{
  "collection": "majah",
  "book": 34,
  "name": {
    "arabic": "كتاب Supplication",
    "transliteration": "supplication",
    "translation": "Supplication"
  },
  "totalHadith": 66,
  "hadithNumberRange": {
    "first": 3827,
    "last": 3892
  },
  "content": [
    {
      "hadithNumber": 3827,
      "arabicNumber": 3827,
      "book": 34,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبُو الْمَلِيحِ الْمَدَنِيُّ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ لَمْ يَدْعُ اللَّهَ سُبْحَانَهُ غَضِبَ عَلَيْهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the :Messenger of Allah (saas) said: \"Whoever does not call upon Allah, He will be angry with him",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اللہ تعالیٰ سے دعا نہیں کرتا، تو اللہ تعالیٰ اس پر غضب ناک ( غصہ ) ہوتا ہے ۱؎۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d'Allah (ﷺ) a dit : « Celui qui n'invoque pas Allah, Il se met en colère contre lui. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abu Al Malih Al Madani] dia berkata; saya mendengar [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang tidak berdo`a kepada Allah subhaanahu, maka Allah akan murka kepadanya",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu demiştir: «Kim Allah Sübhanehu'ya dua etmez ise Allah o kimse'ye gazab eder.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 3828,
      "arabicNumber": 3828,
      "book": 34,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ ذَرِّ بْنِ عَبْدِ اللَّهِ الْهَمْدَانِيِّ، عَنْ يُسَيْعٍ الْكِنْدِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ الدُّعَاءَ هُوَ الْعِبَادَةُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ}‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Nu'man bin Bashir that :the Messenger of Allah (saas) said: \"Indeed the supplication is the worship.\" Then he recited: \"And your Lord said: Invoke Me, I will respond to you",
          "ur": "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بیشک دعا ہی عبادت ہے، پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی:«وقال ربكم ادعوني أستجب لكم» اور تمہارے رب نے کہا: دعا کرو ( مجھے پکارو ) میں تمہاری دعا قبول کروں گا ( سورة الغافر: 60 ) ۔",
          "fr": "Rapporté par Nu'man bin Bashir : Le Messager d'Allah (ﷺ) a dit : « L'invocation, c'est l'adoration. » Puis il a récité : « Et votre Seigneur a dit : Invoquez-Moi, Je vous répondrai. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Dzar bin Abdullah Al Hamdani] dari [Yusai' Al Kindi] dari [Nu'man bin Basyir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya do'a adalah ibadah.\" Kemudian beliau membaca: \"Berdo'alah kepada-Ku, niscaya akan Kuperkenankan bagimu.\" (QS Al Ghafir;)",
          "tr": "Nu'man bin Beşir (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz ancak dua ibadettir.» buyurdu. Sonra: ''.. Ve Rabbiniz buyurdu ki: Siz bana dua ediniz ki bende size icabet edeyim. Bana dua etmeye tenezzül etmeyenler. Şüphesiz alçalmış olarak cehennem'e gireceklerdir.'' [Mu'min 60] ayetini okudu. Diğer tahric: Tirmizi, Ebu Davud, Nesai, İbn-i Hibban, Hakim ve Ahmed Müsned"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 3829,
      "arabicNumber": 3829,
      "book": 34,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا عِمْرَانُ الْقَطَّانُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لَيْسَ شَىْءٌ أَكْرَمَ عَلَى اللَّهِ سُبْحَانَهُ مِنَ الدُّعَاءِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Prophet (saas) said: \"There is nothing more noble to Allah the Glorified, than supplication",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے نزدیک دعا سے زیادہ لائق قدر کوئی چیز نہیں ۔",
          "fr": "Rapporté par Abu Hurairah : Le Prophète ﷺ a dit : « Il n’y a rien de plus noble auprès d’Allah, le Glorifié, que l’invocation. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin yahya] telah menceritakan kepada kami [Abu daud] telah menceritakan kepada kami ['Imran Al Qatthan] dari [Qatadah] dari [Sa'id bin Abu Al Hasan] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada sesuatu yang lebih mulia bagi Allah subhaanahu dari do`a",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «(Zikir sözlü ibadetlerden) hiç bir şey Allah sübhanehu katında dua'dan daha faziletli değildir.» Diğer tahric: Tirmizi ve Ahmed Müsned. Buhari de el-Edebu'l-Müfred'de bu hadis'i rivayet etmiştir. Hakim ve İbn-i Hibban bu hadisin sahih olduğunu söylemişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 3830,
      "arabicNumber": 3830,
      "book": 34,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، سَنَةَ إِحْدَى وَثَلاَثِينَ وَمِائَتَيْنِ حَدَّثَنَا وَكِيعٌ، فِي سَنَةِ خَمْسٍ وَتِسْعِينَ وَمِائَةٍ قَالَ حَدَّثَنَا سُفْيَانُ فِي مَجْلِسِ الأَعْمَشِ مُنْذُ خَمْسِينَ سَنَةً حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ الْجَمَلِيُّ فِي زَمَنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ الْمُكْتِبِ عَنْ طَلِيقِ بْنِ قَيْسٍ الْحَنَفِيِّ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ فِي دُعَائِهِ ‏ \"‏ رَبِّ أَعِنِّي وَلاَ تُعِنْ عَلَىَّ وَانْصُرْنِي وَلاَ تَنْصُرْ عَلَىَّ وَامْكُرْ لِي وَلاَ تَمْكُرْ عَلَىَّ وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَىَّ رَبِّ اجْعَلْنِي لَكَ شَكَّارًا لَكَ ذَكَّارًا لَكَ رَهَّابًا لَكَ مُطِيعًا إِلَيْكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَاهْدِ قَلْبِي وَسَدِّدْ لِسَانِي وَثَبِّتْ حُجَّتِي وَاسْلُلْ سَخِيمَةَ قَلْبِي ‏\"‏ ‏.‏ قَالَ أَبُو الْحَسَنِ الطَّنَافِسِيُّ قُلْتُ لِوَكِيعٍ أَقُولُهُ فِي قُنُوتِ الْوِتْرِ قَالَ نَعَمْ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that :the Prophet (saas) used to say in his supplication: \"Rabbi! A'inni wa la tu'in 'alayya, wansurni wa la tansur 'alayya, wamkurli wa la tamkur 'alayya, wahdini wa yassiril-huda li, wansurni 'ala man bagha 'alayya. Rabbij'alni laka shakkaran laka dhakkaran, laka rahhaban, laka muti'an, 'ilayka mukhbitan, 'ilayka awwahan muniba. Rabbi! Taqabbal tawbati, waghsil hawbati wa ajib da'wati, wahdi qalbi, wa saddid lisani, wa thabbit hujjati, waslul sakhimata qalbi (O Lord! Help me and do not help others against me, support me and do not support others against me, plan for me and do not plan against me, guide me and make guidance easy for me, and help me against those who wrong me. O Lord! Make me grateful to You, make me remember You much, make me fearful of You, obedient to You, humble before You and turning to You. O Lord! Accept my repentance and wash away my sins, answer my supplication, guide my heart, make my tongue speak the truth, make my proof firm and remove resentment from my heard).\" (Sahih)(One of the narrators) Abul-Hasan At-Tanafisi said: \"I said to Waki': 'Shall I say it in the Qunut of Witr?' He said: 'Yes",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم اپنی دعا میں یہ پڑھا کرتے تھے: «رب أعني ولا تعن علي وانصرني ولا تنصر علي وامكر لي ولا تمكر علي واهدني ويسر الهدى لي وانصرني على من بغى علي رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطيعا إليك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي واهد قلبي وسدد لساني وثبت حجتي واسلل سخيمة قلبي» اے میرے رب! میری مدد فرما، اور میرے مخالف کی مدد مت کر، اور میری تائید فرما، اور میرے مخالف کی تائید مت کر، اور میرے لیے تدبیر فرما، میرے خلاف کسی کی سازش کامیاب نہ ہونے دے، اور مجھے ہدایت فرما، اور ہدایت کو میرے لیے آسان کر دے، اور اس شخص کے مقابلہ میں میری مدد فرما جو مجھ پر ظلم کرے، اے اللہ! مجھے اپنا شکر گزار اور ذکر کرنے والا، ڈرنے والا، اور اپنا مطیع فرماں بردار، رونے اور گڑگڑانے والا، رجوع کرنے والا بندہ بنا لے، اے اللہ میری توبہ قبول فرما، میرے گناہ دھو دے، میری دعا قبول فرما، میرے دل کو صحیح راستے پر لگا، میری زبان کو مضبوط اور درست کر دے، میری دلیل و حجت کو مضبوط فرما، اور میرے دل سے بغض و عناد ختم کر دے ۔ ابوالحسن طنافسی کہتے ہیں کہ میں نے وکیع سے کہا: کیا میں یہ دعا قنوت وتر میں پڑھ لیا کروں؟ تو انہوں نے کہا: ہاں پڑھ لیا کرو۔",
          "fr": "Rapporté par Ibn 'Abbas : Le Prophète ﷺ avait l’habitude de dire dans ses invocations : « Rabbi ! Aide-moi et ne sois pas contre moi, soutiens-moi et ne soutiens pas d’autres contre moi, planifie pour moi et non contre moi, guide-moi et facilite-moi la voie droite, aide-moi contre ceux qui me font du tort. Seigneur, fais de moi quelqu’un de reconnaissant envers Toi, qui se souvient beaucoup de Toi, qui Te craint, qui T’obéit, qui s’humilie devant Toi et qui revient vers Toi. Seigneur, accepte mon repentir, efface mes fautes, exauce mon invocation, guide mon cœur, rends ma langue véridique, affermis mes preuves et enlève la rancune de mon cœur. » (Sahih) Abul-Hasan At-Tanafisi a dit : « J’ai demandé à Waki’ : Dois-je dire cela dans le Qunut du Witr ? » Il a répondu : « Oui. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] -(wafat) tahun dua ratus tiga puluh satu- telah menceritakan kepada kami [Waki'] -tahun seratus sembilan puluh lima- dia berkata; telah menceritakan kepada kami [Sufyan] ketika dia di Majlisnya Al A'masy semenjak lima puluh tahun yang lalu, telah menceritakan kepada kami ['Amru bin Murrah Al Jamali] di zamannya Khalid, dari [Abdullah bin Al Harits Al Mukattib] dari [Qais bin Thalq Al Hanafi] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam dalam do'anya beliau mengucapkan: \"Wahai Rabbku, tolonglah diriku dan janganlah Engkau sia-siakan aku. Belalah daku dan jangan Engkau biarkan daku. Semalatkanlah daku dari tipu daya dan janganlah Engkau perdayai aku. Berilah kepadaku hidayah dan mudahkanlah bagiku hidayah itu. Menangkanlah aku atas orang-orang yang berbuat aniaya terhadap diriku. Ya Rabbku, jadikanlah diriku sebagai orang yang bersyukur kepada-Mu, orang yang selalu mengingat-Mu, orang yang takut kepada-Mu, orang yang taat kepada-Mu. Kepada-Mu aku bersimpuh, kepada-Mu aku merintih dan bertaubat. Wahai Rabbku, terimalah taubatku, hapuskanlah kesalahanku, terimalah do'aku, berilah hatiku petunjuk, kuatkanlah lisanku, tetapkanlah pendirianku dan hilangkanlah rasa dengki dari hatiku.\" Abu Hasan Ath Thanafisi berkata; \"Aku bertanya kepada Waki'; \"Apakah aku dapat membacanya ketika memboca do'a qunut dalam shalat witir?\" dia menjawab; \"Ya, boleh",
          "tr": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) duasında mealen şöyle derdi: «Rabbim! Bana yardım et ve aleyhimde (düşmanıma) yardım etme.Yardımını benden esirgeme ve aleyhimde (düşmanımı) destekleme. Düşmanımı cezalandır, beni cezalandırma. Beni hayırlı işlere yönelt ve yayır yolunda ilerlemeyi bana kolaylaştır. Bana zulüm ve haksızlık edene karşı bana yardım et. Ey Rabbim! Beni sana çok şükreden, çok zikreden, senden çok korkan, sana çok itaat eden, sana çok boyun eğip tevazu eden, sana çok yakarıp ağlayarak tevbekar eyle. Ey Rabbim benim tevbemi kabul eyle, günahımı gider, duamı kabul et, kalbimi hidayet üzerine daim kıl, dilimi doğrulukla hakkı söylemekten ayırma, hüccetimi sabit kıl ve kalbimi fenalıktan arındır.» Ebu'l-Hasen et-Tenafisi dediki: Ben Veki'e : Bu duayı vitir namazı kunutunda okuyabilir (miy) im? dedim. Evet dedi. Diğer tahric: Tirmizi, Ebu Davud, Nesai, İbn-i Hibban ve Hakim tarafından da rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 3831,
      "arabicNumber": 3831,
      "book": 34,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ، حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَتْ فَاطِمَةُ النَّبِيَّ ـ صلى الله عليه وسلم ـ تَسْأَلُهُ خَادِمًا فَقَالَ لَهَا ‏\"‏ مَا عِنْدِي مَا أُعْطِيكِ ‏\"‏ ‏.‏ فَرَجَعَتْ فَأَتَاهَا بَعْدَ ذَلِكَ فَقَالَ ‏\"‏ الَّذِي سَأَلْتِ أَحَبُّ إِلَيْكِ أَوْ مَا هُوَ خَيْرٌ مِنْهُ ‏\"‏ ‏.‏ فَقَالَ لَهَا عَلِيٌّ قُولِي لاَ بَلْ مَا هُوَ خَيْرٌ مِنْهُ فَقَالَتْ فَقَالَ ‏\"‏ قُولِي اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ رَبَّنَا وَرَبَّ كُلِّ شَىْءٍ مُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْقُرْآنِ الْعَظِيمِ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَىْءٌ وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَىْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَىْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَىْءٌ اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah said:\"Fatimah came to the Prophet (saas) to ask him for a servant, and he said: 'I do not have anything to give you.' So she went back, but after that he came to her and said: 'Is what you asked for dearer to you, or something better than that?' 'Ali said to her: 'Say: something better than that.' So she said it. He said: 'Say: Allahumma Rabbas-samawatis-Sab'i wa Rabbal-'Arshil-'Azim, Rabbana wa Rabba Kulli shay'in, munzil at-Tawrati wal-Injili wal-Qur'anil-'Azim. Antal-Awwalu fa laysa qablaka shay', wa Antal-Akiru fa laysa ba'daka shay', Antaz-Zahiru fa laysa fawqaka shay', wa Antal-Batinu fa laysa dunaka shay', Iqdi 'annad-daina wa aghnina minal-faqr (O Allah, Lord of the seven heavens and Lord of the Mighty Throne, Our Lord, and the Lord of Everything, Revealer of the Tawrah, the Injil and the Magnificent Qur'an. You are the First and there is nothing after You; You are the Last and there is nothing after You. You are the Most High, and there is nothing above You, and You are the Most Near and there is nothing nearer than You. Settle our debts and make us free of want)",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ فاطمہ رضی اللہ عنہا نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں ایک خادم طلب کرنے کے لیے آئیں، تو آپ نے ان سے فرمایا: میرے پاس تو خادم نہیں ہے جو میں تجھے دوں ، ( یہ سن کر ) وہ واپس چلی گئیں، اس کے بعد آپ خود ان کے پاس تشریف لائے اور فرمایا: جو چیز تم نے طلب کی تھی وہ تمہیں زیادہ پسند ہے یا اس سے بہتر چیز تمہیں بتاؤں ؟ علی رضی اللہ عنہ نے فاطمہ رضی اللہ عنہا سے کہا: تم کہو کہ نہیں، بلکہ مجھے وہ چیز زیادہ پسند ہے جو خادم سے بہتر ہو، چنانچہ فاطمہ رضی اللہ عنہا نے یہی کہا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم یہ کہا کرو «اللهم رب السموات السبع ورب العرش العظيم ربنا ورب كل شيء منزل التوراة والإنجيل والقرآن العظيم أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عنا الدين وأغننا من الفقر» اے اللہ! ساتوں آسمانوں اور عرش عظیم کے رب! اور ہمارے رب اور ہر چیز کے رب، تورات، انجیل اور قرآن عظیم کو نازل کرنے والے! تو ہی اول ہے تجھ سے پہلے کوئی چیز نہیں تھی، تو ہی آخر ہے، تیرے بعد کوئی چیز نہیں ہو گی، تو ہی ظاہر ہے تیرے اوپر کوئی چیز نہیں، تو ہی باطن ہے تیرے ورے کوئی چیز نہیں، ہم سے ہمارا قرض ادا کر دے، اور محتاجی دور کر کے ہمیں غنی کر دے ۔",
          "fr": "Rapporté par Abu Hurairah : Fatimah est venue voir le Prophète ﷺ pour lui demander un serviteur, et il lui a dit : « Je n’ai rien à te donner. » Elle est repartie, puis il est venu la voir et lui a dit : « Ce que tu as demandé t’est-il plus cher, ou veux-tu quelque chose de meilleur ? » ‘Ali lui a dit : « Dis : quelque chose de meilleur. » Elle l’a donc dit. Il a dit : « Dis : Allahumma Rabbas-samawatis-Sab’i wa Rabbal-‘Arshil-‘Azim, Rabbana wa Rabba Kulli shay’in, munzil at-Tawrati wal-Injili wal-Qur’anil-‘Azim. Antal-Awwalu fa laysa qablaka shay’, wa Antal-Akhiru fa laysa ba’daka shay’, Antaz-Zahiru fa laysa fawqaka shay’, wa Antal-Batinu fa laysa dunaka shay’, Iqdi ‘annad-daina wa aghnina minal-faqr (Ô Allah, Seigneur des sept cieux et du Trône immense, notre Seigneur et Seigneur de toute chose, Révélateur de la Torah, de l’Évangile et du Noble Coran. Tu es le Premier, il n’y a rien avant Toi ; Tu es le Dernier, il n’y a rien après Toi ; Tu es le Très-Haut, rien n’est au-dessus de Toi ; Tu es le Plus Proche, rien n’est plus proche que Toi. Règle nos dettes et préserve-nous de la pauvreté). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Abu 'Ubaidah] telah menceritakan kepada kami [ayahku] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; \"Fathimah datang menemui Nabi shallallahu 'alaihi wasallam dan meminta kepada beliau seorang pembantu. Maka beliau bersabda kepadanya: \"Saya tidak memiliki apa yang akan kuberikan kepadamu.\" Maka Fathimah pulang, lantas Nabi shallallahu 'alaihi wasallam mendatanginya dan bersabda: \"Apakah yang kamu meminta sesuatu yang kamu cintai itu atau yang lebih baik lagi?\" Ali berkata kepada Fathimah; \"Katakan tidak, namun yang lebih baik dari hal itu.\" Maka Fathimah mengatakannya, dan beliau bersabda: \"Ucapkanlah olehmu; \"Ya Allah, Rabb pemilik langit yang tujuh dan Rabb pemilik 'Arsy yang agung, Rabb kami dan Rabb segala sesuatu. Dzat yang menurunkan Taurat, Injil dan Al Qur`an yang agung. Engkau yang Maha terdahulu dan tidak ada sesuatu sebelum Engkau, Engkau Maha penghabisan dan tidak ada sesuatu setelah-Mu, Engkau dzat yang Maha nyata dan tidak ada sesuatu yang lebih nyata dari-Mu, Engkau yang Maha tersembunyi dan tidak ada sesuatu yang lebih tersembunyi dari-Mu. Lunasilah hutang kami dan lindungilah kami dari kefakiran",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: (Nebi (Sallallahu Aleyhi ve Sellem)'in kızı) Fatima (r.anha) Nebi (Sallallahu Aleyhi ve Sellem)'in yanına Ondan bir hizmetçi istedi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) ona: «Yanımda sana verebileceğim (hizmetçi) yoktur.» buyurdu. Fatime de dönüp gitti. Bundan bir süre sonra Nebi (Sallallahu Aleyhi ve Sellem) Fatime'nin yanına gelerek: «Senin istediğin (hizmetçi mi) sana daha sevimlidir yoksa ondan daha hayırlı olan şeymidir?» buyurdu. Ali (r.a.) Fatime'ye dediki: Söyle: Hayır. Bilakis ondan daha hayırlı olan şey (daha sevimlidir.) Bunun üzerine Fatime (Ali r.a.'in dediğini) söyledi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) de Fatime'ye şöyle buyurdu: «De ki: Allahım! Ey yedi göğün Rabbi. Azametli Arş'ın Rabbi. bizim Rabbimiz ve her şey'in Rabbi. Ey Tevrat, İncil ve Kur'an-i Azim'i indiren. Evvel sensin senden önce olan hiç bir şey yoktur. Ahir de sensin, senden sonra hiç bir şey yoktur. Zahir sensin, varlığı seninkinden daha aşikar hiç bir şey yoktur. Batın sensin, sen'den daha gizli hiç bir şey yoktur. Borcumuzu öde ve bizi fakirlikten kurtarıp zenginleştir.» Bu hadisini Tirmizi de rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 3832,
      "arabicNumber": 3832,
      "book": 34,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ كَانَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah that :the Prophet (saas) used to say: \"Allahumma inni as'alukal-huda wat-tuqa wal-'afaf wal-ghina (O Allah, I ask You for guidance, piety, chastity and affluence)",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم یہ دعا مانگا کرتے تھے: «اللهم إني أسألك الهدى والتقى والعفاف والغنى» اے اللہ! میں تجھ سے ہدایت، پرہیزگاری، پاکدامنی اور دل کی مالدرای چاہتا ہوں ۔",
          "fr": "Rapporté par 'Abdullah : Le Prophète ﷺ avait l’habitude de dire : « Allahumma inni as’alukal-huda wat-tuqa wal-‘afaf wal-ghina (Ô Allah, je Te demande la guidée, la piété, la pureté et l’aisance). »",
          "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim Ad dauraqi] dan [Muhammad bin Basyar] keduanya berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau membaca do'a: \"Ya Allah, aku memohon kepada-Mu petunjuk, ketakwaan, kelembutan dan kejayaan",
          "tr": "Abdullah (bin Mes'ud) (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle dua ederdi: «Allahumme inni es'eluke'l-huda ve't-tuka ve'l-ifafe ve'l-ğina.» Dua’nın Meali: Allahım! Ben senden hidayet, takva, iffet ve (gönülce) zenginlik isterim. Diğer tahric: Müslim ve Tirmizi AÇIKLAMA (3830, 3831, 3832): 3830 nolu hadisin baş kısmında Allah'tan inayet ve nusret isteniyor. Bu bölümün;"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 3833,
      "arabicNumber": 3833,
      "book": 34,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ مُوسَى بْنِ عُبَيْدَةَ، عَنْ مُحَمَّدِ بْنِ ثَابِتٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا وَالْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَأَعُوذُ بِاللَّهِ مِنْ عَذَابِ النَّارِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (saas) used to say: 'Allahummanfa'ni bima 'allamtani, wa 'allimni ma yanfa'uni, wa zidni 'ilman, wal-hamdu lillahi 'ala kulli hal, wa a'udhu billahi min 'adhabin-nar (O Allah, benefit me by that which You have taught me, and teach me that which will benefit me, and increase me in knowledge. Praise is to Allah in all situations, and I seek refuge with Allah from the torment of the Fire)",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا مانگا کرتے تھے: «اللهم انفعني بما علمتني وعلمني ما ينفعني وزدني علما والحمد لله على كل حال وأعوذ بالله من عذاب النار» اے اللہ! مجھے اس علم سے فائدہ پہنچا جو تو نے مجھے سکھایا، اور مجھے وہ علم سکھا جو میرے لیے نفع بخش ہو، اور میرے علم میں زیادتی عطا فرما، اللہ تعالیٰ کا ہر حال میں شکر ہے، میں جہنم کے عذاب سے اللہ کی پناہ چاہتا ہوں ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ avait l’habitude de dire : « Allahummanfa’ni bima ‘allamtani, wa ‘allimni ma yanfa’uni, wa zidni ‘ilman, wal-hamdu lillahi ‘ala kulli hal, wa a’udhu billahi min ‘adhabin-nar (Ô Allah, fais-moi profiter de ce que Tu m’as appris, apprends-moi ce qui me sera utile, augmente-moi en savoir. Louange à Allah en toute situation, et je cherche refuge auprès d’Allah contre le châtiment du Feu). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dari [Musa bin 'Ubaidah] dari [Muhammad bin Tsabit] dari [Abu Hurairah] dia berkata; \"Ya Allah, berikanlah kemanfa'atan atas apa yang telah Engkau ajarkan kepadaku, dan ajarkanlah aku apa-apa yang bermanfa'at untuk diriku, tambahkanlah kepadaku ilmu. Dan segala puji bagi Allah atas semua keadaan, aku pun berlindung kepada Allah dari siksa api neraka",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle dua ederdi: «Allahumme infa'ni bima allemteni ve allimni ma yenfauni ve zidni ilmen ve'l-hamdu lillahi ala kulli halin ve euzu billahi min azabi'n-Nar. » Duanın Meali: Allahım! Bana öğrettiğin ilimden beni yararlandır, menfaatleneceğim bilgileri bana ihsan eyle ve ilmimi arttır. Hamd her hal üzerine Allah'adır. Ben ateş azabından Allah'a sığınırım. Diğer tahric: Bu Hadisi; Tirmizi, Nesai ve Hakim de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 3834,
      "arabicNumber": 3834,
      "book": 34,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُكْثِرُ أَنْ يَقُولَ ‏\"‏ اللَّهُمَّ ثَبِّتْ قَلْبِي عَلَى دِينِكَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ تَخَافُ عَلَيْنَا وَقَدْ آمَنَّا بِكَ وَصَدَّقْنَاكَ بِمَا جِئْتَ بِهِ فَقَالَ ‏\"‏ إِنَّ الْقُلُوبَ بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ عَزَّ وَجَلَّ يُقَلِّبُهَا ‏\"‏ ‏.‏ وَأَشَارَ الأَعْمَشُ بِإِصْبَعَيْهِ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas bin Malik said:\"The Messenger of Allah (saas) often used to say: 'Allahumma thabbit qalbi 'ala dinika [O Allah, make my heart steadfast in (adhering to) Your religion].' A man said: 'O Messenger of Allah! Do you fear for us when we have believed in you and in (the Message) that you have brought?' He said: 'Hearts are between two of the fingers of the Most Merciful, and He controls them.'\" (Hasan)Al-A'mash (one of the narrators) indicated with his fingers",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اکثر یہ دعا مانگا کرتے تھے: «اللهم ثبت قلبي على دينك» اے اللہ! میرے دل کو اپنے دین پر قائم رکھ ، ایک شخص نے عرض کیا: اللہ کے رسول! آپ ہم پر خوف کرتے ہیں ( ہمارے حال سے کہ ہم پھر گمراہ ہو جائیں گے ) ، حالانکہ ہم تو آپ پر ایمان لا چکے، اور ان تعلیمات کی تصدیق کر چکے ہیں جو آپ لے کر آئے، آپ صلی اللہ علیہ وسلم نے فرمایا: بیشک لوگوں کے دل رحمن کی دونوں انگلیوں کے درمیان ہیں، انہیں وہ الٹتا پلٹتا ہے ، اور اعمش نے اپنی دونوں انگلیوں سے اشارہ کیا ۱؎۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah ﷺ disait souvent : « Allahumma thabbit qalbi ‘ala dinika (Ô Allah, rends mon cœur ferme dans Ta religion). » Un homme a dit : « Ô Messager d’Allah ! Craindrais-tu pour nous alors que nous avons cru en toi et en ce que tu as apporté ? » Il a répondu : « Les cœurs sont entre deux doigts du Tout Miséricordieux, et Il les tourne comme Il veut. » (Hasan) Al-A'mash (un des rapporteurs) a fait ce geste avec ses doigts",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] dari [Yazid Ar raqasyi] dari [Anas bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam memperbanyak mengucapkan: \"Ya Allah, teguhkan hatiku diatas dien-Mu\", maka seorang sahabat berkata: \"Wahai Rasulullah, mengapa anda mengkhawatirkan kami, sedang kami telah beriman kepadamu dan membenarkanmu terhadap apa yang anda bawa.\" Beliau bersabda: \"Sesungguhnya hati-hati itu berada diantara dua jari dari jari-jari Ar Rahman 'azza wajalla, Dia membolak-balikkannya.\" Dan Al A'masy mengisyaratkan dengan dua jarinya",
          "tr": "Enes bin Malik (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem): «Allahumme sebbit kalbi ala dinike (Allah'ım kalbimi dininin üzerinde sabit kıl)» duasını çok söylerdi. Bununun üzerine bir adam: Ya Resulallah! Sana iman ettiğimiz ve getirdiğin (din) hakkında seni tasdik ettiğimiz halde bizim için korkuyor (mu)sun ? dedi. Bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Kalbler şüphesiz Rahman (olan Allah Azze ve Celle) nin parmaklarından iki parmak arasındadır (dilediği şekilde) döndürür.» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinin sıhhat durumu Yezid er-Rakkaşi'nin güvenilirliği durumuna bağlıdır. Bu ravi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 3835,
      "arabicNumber": 3835,
      "book": 34,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، ‏.‏ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاَتِي ‏.‏ قَالَ ‏ \"‏ قُلِ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Bakr Siddiq that :he said to the Messenger of Allah (saas): \"Teach me a supplication which I can say during my prayer.\" He said: \"Say: Allahumma inni zalamtu nafsi zulman kathiran wa la yaghfirudh-dhunub illa Anta, faghfirli maghfiratan min 'indika warhamni, innaka Antal-Ghafurur-Rahim (O Allah, I have wronged myself greatly and no one forgives sins but You, so grant me forgiveness from You and have mercy on me, for You are the Oft-Forgiving, Most Merciful)",
          "ur": "ابوبکر صدیق رضی اللہ عنہ کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: مجھے کوئی ایسی دعا سکھا دیجئیے جسے میں نماز میں پڑھا کروں، آپ نے فرمایا: تم یہ دعا پڑھا کرو «اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم» اے اللہ! میں نے اپنے نفس پر بہت ظلم کیا ہے اور گناہوں کا بخشنے والا صرف تو ہی ہے، تو اپنی عنایت سے میرے گناہ بخش دے، اور مجھ پر رحم فرما، تو غفور و رحیم ( بخشنے والا مہربان ) ہے ۔",
          "fr": "Rapporté par Abu Bakr Siddiq : Il a dit au Messager d’Allah ﷺ : « Apprends-moi une invocation que je pourrais dire dans ma prière. » Il a dit : « Dis : Allahumma inni zalamtu nafsi zulman kathiran wa la yaghfirudh-dhunub illa Anta, faghfirli maghfiratan min ‘indika warhamni, innaka Antal-Ghafurur-Rahim (Ô Allah, je me suis fait beaucoup de tort à moi-même et nul ne pardonne les péchés sauf Toi, alors accorde-moi un pardon venant de Toi et fais-moi miséricorde, car Tu es le Pardonneur, le Miséricordieux). »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari [Abdullah bin 'Amru bin 'Ash] dari [Abu Bakar As Shidiq] bahwa dia berkata kepada Rasulullah shallallahu 'alaihi wasallam; \"Ajarkanlah kepadaku do'a yang saya baca di dalam shalatku.\" Beliau menjawab: \"Ucapkanlah; \"Ya Allah, sesungguhnya aku telah menganiaya diriku dengan kedzaliman, dan tiada yang mengampuni dosa selain Engkau, maka ampunilah daku dengan pengampunan dari sisi-Mu serta kasihanilah diriku, sesungguhnya Engkau Maha pengampun lagi Maha penyayang",
          "tr": "Ebu Bekr-i Sıddık (r.a.)'den rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'e: Ya Resulallah! Bana namazım(ın sonun)da okuyacağım bir duayı öğret, diye ricada bulunmuş. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «''Allahumme inni zalemtu nefsi zulmen kesiren ve la yağfiru'z-zunube illa ente fağfirli mağfireten min indike verhamni inneke ente'l-ğafuru'r-Rahim.'' duasını oku.» buyurdu. Dua'nın meali: Allahım! Şüphesiz ben kendi nefsime çok zulüm ettim. Senden başka hiçbir kimse günahları bağışlayamaz. Bu itibarla katından (ikram olarak) bir mağfiretle beni bağışla ve bana merhamet et. Şüphesiz Ğafur sensin, Rahim sensin. Diğer tahric edenler: Buhari, sıfatu’s-salat, Müslim zikir, Tirmizi, deavat; Nesai, sehv BUHARİ RİVAYETİ VE İZAH İÇİN BURAYA TIKLAYIN"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 3836,
      "arabicNumber": 3836,
      "book": 34,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ أَبِي مَرْزُوقٍ، عَنْ أَبِي الْعَدَبَّسِ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ مُتَّكِئٌ عَلَى عَصًا فَلَمَّا رَأَيْنَاهُ قُمْنَا فَقَالَ ‏\"‏ لاَ تَفْعَلُوا كَمَا يَفْعَلُ أَهْلُ فَارِسَ بِعُظَمَائِهَا ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ لَوْ دَعَوْتَ اللَّهَ لَنَا ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لَنَا وَارْحَمْنَا وَارْضَ عَنَّا وَتَقَبَّلْ مِنَّا وَأَدْخِلْنَا الْجَنَّةَ وَنَجِّنَا مِنَ النَّارِ وَأَصْلِحْ لَنَا شَأْنَنَا كُلَّهُ ‏\"‏ ‏.‏ قَالَ فَكَأَنَّمَا أَحْبَبْنَا أَنْ يَزِيدَنَا فَقَالَ ‏\"‏ أَوَلَيْسَ قَدْ جَمَعْتُ لَكُمُ الأَمْرَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Umamah Al Bahili said:\"The Messenger of Allah (saas) came out to us, leaning on a stick, and when we saw him we stood up. He said: 'Do not do what the Persians do for their leaders.' We said: 'O Messenger of Allah, why don't you pray to Allah for us?' He said: 'Allahummaghfirlana, warhamna, warda 'anna, wa taqabbal minna, wa adkhilnal-jannah, wa najjina minan-nar, wa aslih lana sha'nana kullah. [O Allah, forgive us and have mercy on us, be pleased with us and accept (our good deeds) from us, admit us to Paradise and save us from Hell, and rectify all our affairs].' It was as if we wanted him to say more, but he said: 'Have I not summed everything for you?",
          "ur": "ابوامامہ باہلی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم عصا ( چھڑی ) پر ٹیک لگائے ہمارے پاس باہر تشریف لائے، جب ہم نے آپ کو دیکھا تو ہم کھڑے ہو گئے، آپ صلی اللہ علیہ وسلم نے فرمایا: تم ایسے کھڑے نہ ہوا کرو جیسے فارس کے لوگ اپنے بڑوں کے لیے کھڑے ہوتے ہیں ہم نے عرض کیا: اللہ کے رسول! کاش آپ ہمارے لیے اللہ سے دعا فرماتے، آپ صلی اللہ علیہ وسلم نے دعا فرمائی: «اللهم اغفر لنا وارحمنا وارض عنا وتقبل منا وأدخلنا الجنة ونجنا من النار وأصلح لنا شأننا كله» اے اللہ! ہمیں بخش دے، اور ہم پر رحم فرما، اور ہم سے راضی ہو جا، ہماری عبادت قبول فرما، ہمیں جنت میں داخل فرما، اور جہنم سے بچا، اور ہمارے سارے کام درست فرما دے ، ابوامامہ رضی اللہ عنہ فرماتے ہیں: تو گویا ہماری خواہش ہوئی کہ آپ اور کچھ دعا فرمائیں: تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا میں نے تمہارے لیے جامع دعا نہیں کر دی ۔",
          "fr": "Rapporté par Abu Umamah Al Bahili : Le Messager d’Allah ﷺ est sorti vers nous en s’appuyant sur un bâton, et quand nous l’avons vu, nous nous sommes levés. Il a dit : « Ne faites pas comme les Perses le font pour leurs chefs. » Nous avons dit : « Ô Messager d’Allah, pourquoi ne pries-tu pas Allah pour nous ? » Il a dit : « Allahummaghfirlana, warhamna, warda ‘anna, wa taqabbal minna, wa adkhilnal-jannah, wa najjina minan-nar, wa aslih lana sha’nana kullah (Ô Allah, pardonne-nous, fais-nous miséricorde, sois satisfait de nous, accepte nos bonnes actions, fais-nous entrer au Paradis, sauve-nous de l’Enfer et améliore toutes nos affaires). » On aurait dit que nous voulions qu’il dise plus, mais il a dit : « N’ai-je pas tout résumé pour vous ? »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Abu Marzuq] dari [Abu Wa`il] dari [Abu Umamah Al Bahili] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam keluar menemui kami sambil berpegangan pada tongkat, lalu kami berdiri ketika melihat beliau, beliau bersabda: \"Janganlah kalian melakukan perbuatan seperti perbuatan orang-orang Persia terhadap para pembesar kerajaan.\" Kami bertanya; \"Wahai Rasulullah, sekiranya anda berkenan mendo'akan kami semua!.\" Beliau bersabda: \"Ya Allah! Ampuni kami, rahmati kami, ridlai kami, terimalah (amalan) kami, masukkanlah kami ke surga, dan selamatkanlah kami dari neraka serta perbaikilah kondisi kami seluruhnya.\" Abu Umamah berkata; \"Sepertinya kami menginginkan beliau menambahi do`a untuk kami, lalu beliau bersabda; \"Tidakkah saya telah menyatukan urusan kalian menjadi satu?",
          "tr": "Ebu Ümame el-Bahili (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bir baston'a dayanmış olarak çıkıp yanımıza geldi. Biz de onu görünce ayağa kalktık. Bunun üzerine: «Faris halkının ulularına karşı yaptıkları gibi yapmayınız.» buyurdu. Biz: Ya Resulallah! Bizim için Allah'a dua etmenizi diliyoruz. dedik. O da: «Allahım bize mağfiret eyle, bize merhamet et. bizden razı ol, (ibadet ve duaları) bizden kabul eyle, bizi cennet'e dahil et, bizi ateşten kurtar ve bizim için her durumumuzu ıslah eyle,» diye dua ett. Ebu Ümame dediki: Bana öyle geliyorki bize daha fazla dua buyurmasını iştiyakla arzuladık. Bunun üçin şöyle buyurdu: «Dilekler işini sizin için toplamadım mı?» (Yani sizin için gerekli herşeyi istemedim mi) Bu hadis'in ilk bölümü yani dua talebi ve dua kısmı hariç kalan kısmını Ebu Davud da rivayet etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 3837,
      "arabicNumber": 3837,
      "book": 34,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَخِيهِ، عَبَّادِ بْنِ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الأَرْبَعِ مِنْ عِلْمٍ لاَ يَنْفَعُ وَمِنْ قَلْبٍ لاَ يَخْشَعُ وَمِنْ نَفْسٍ لاَ تَشْبَعُ وَمِنْ دُعَاءٍ لاَ يُسْمَعُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Hurairah told that the Messenger of Allah (saas) said:'Allahumma! Inni a'udhu bika minal-arba': min 'ilmin la yanfa'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min du'a'in la yusma' [O Allah, I seek refuge with You from four things: From knowledge that is of no benefit, from a heart that does not fear (You), from a soul that is never satisfied, and from a supplication that is not heard",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا فرمایا کرتے تھے: «اللهم إني أعوذ بك من الأربع من علم لا ينفع ومن قلب لا يخشع ومن نفس لا تشبع ومن دعا لا يسمع» اے اللہ! میں چار باتوں سے تیری پناہ چاہتا ہوں: اس علم سے جو فائدہ نہ دے، اس دل سے جو اللہ کے سامنے نرم نہ ہو، اس نفس سے جو آسودہ نہ ہو اور اس دعا سے جو قبول نہ ہو ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit : « Allahumma ! Inni a’udhu bika minal-arba’ : min ‘ilmin la yanfa’u, wa min qalbin la yakhsha’u, wa min nafsin la tashba’u, wa min du’a’in la yusma’ (Ô Allah, je cherche refuge auprès de Toi contre quatre choses : un savoir qui ne sert à rien, un cœur qui ne craint pas, une âme jamais satisfaite et une invocation qui n’est pas exaucée). »",
          "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri] telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [saudaranya yaitu 'Abbad bin Abu Sa'id] bahwa dia mendengar [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam berdo'a: \"Ya Allah, sesungguhnya aku berlindung kepada-Mu dari empat perkara; dari ilmu yang tidak bermanfa'at, dari hati yang tidak khusyu' dari jiwa yang tidak puas dan dari do'a yang tidak di dengar",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle dua ederdi: «Allahım dört şeyden sana sığınırım: Faydasız ilimden, huşu duynayan kalp'ten, doymayan nefis'ten ve işitilmeyen (yani kabul olmayan) dua'dan.» Diğer tahric: Bu hadisi Ebu Davud ve Nesai de tahric ettiler. Benzerini ise Müslim, Zeyd bin Erkam, Tirmizi, İbn-i Amr bin el-As r.a.'dan rivayet ettiler"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 3838,
      "arabicNumber": 3838,
      "book": 34,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَدْعُو بِهَؤُلاَءِ الْكَلِمَاتِ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ وَمِنْ شَرِّ فِتْنَةِ الْغِنَى وَشَرِّ فِتْنَةِ الْفَقْرِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that the :Prophet (saas) would supplicate with these words: \"Allahumma inni a'udhu bika min fitnatin-nari wa 'adhabin-nar, wa min fitnatil-qabri wa 'adhabil-qabr, wa min sharri fitnatil-ghina wa min sharri fitnatil-faqr, wa min sharri fitnatil-masihid-dajjal. Allahumma aghsil khatayaya bima'ith-thalfi wal-barad, wa naqqi qalbi minal-khataya kama naqqaytath-thawbal-abyad minad-danas. Wa ba'id bayni wa bayna khatayaya kama ba'adta baynal-mashriqi wal-maghrib. Allahumma inni a'udhu bika minal-kasali wal-harami wal-ma'thami wal-maghrami (O Allah, I seek refuge with You from the tribulation of the Fire and the torment of the Fire, and from the tribulation of the grave, and from the evil of the tribulation of richness and the evil of the tribulation of poverty, and from the evil of the trial of the False Christ. O Allah! Wash away my sins with the water of snow and hail, and cleanse my heart from sin as a white garment is cleansed from filth, and put a great distance between me and my sins, as great as the distance You have made between the east and the west. O Allah! I seek refuge with You from laziness and old age, and from sins and debt)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ان کلمات کے ذریعہ دعا کیا کرتے تھے: «اللهم إني أعوذ بك من فتنة النار وعذاب النار ومن فتنة القبر وعذاب القبر ومن شر فتنة الغنى وشر فتنة الفقر ومن شر فتنة المسيح الدجال اللهم اغسل خطاياي بماء الثلج والبرد ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم إني أعوذ بك من الكسل والهرم والمأثم والمغرم» اے اللہ! میں تیری پناہ چاہتا ہوں جہنم کے فتنہ اور جہنم کے عذاب سے، اور قبر کے فتنہ اور اس کے عذاب سے، اور مالداری و فقیری کے فتنے کی برائی سے، اور مسیح الدجال کے فتنے کی برائی سے، اے اللہ! میرے گناہوں کو برف اور اولے کے پانی سے دھو ڈال، اور میرے دل کو گناہوں سے پاک و صاف کر دے، جس طرح تو نے سفید کپڑے کو میل کچیل سے پاک و صاف کیا ہے، اور میرے اور میرے گناہوں کے درمیان دوری کر دے جس طرح تو نے پورب اور پچھم کے درمیان دوری کی ہے، اے اللہ! میں تیری پناہ چاہتا ہوں سستی، بڑھاپے، گناہ اور قرض سے ۱؎۔",
          "fr": "Rapporté par ‘Aishah : Le Prophète ﷺ invoquait avec ces mots : « Allahumma inni a’udhu bika min fitnatin-nari wa ‘adhabin-nar, wa min fitnatil-qabri wa ‘adhabil-qabr, wa min sharri fitnatil-ghina wa min sharri fitnatil-faqr, wa min sharri fitnatil-masihid-dajjal. Allahumma aghsil khatayaya bima’ith-thalji wal-barad, wa naqqi qalbi minal-khataya kama naqqaytath-thawbal-abyad minad-danas. Wa ba’id bayni wa bayna khatayaya kama ba’adta baynal-mashriqi wal-maghrib. Allahumma inni a’udhu bika minal-kasali wal-harami wal-ma’thami wal-maghrami (Ô Allah, je cherche refuge auprès de Toi contre l’épreuve du Feu et son châtiment, contre l’épreuve de la tombe et son châtiment, contre le mal de l’épreuve de la richesse et le mal de l’épreuve de la pauvreté, contre le mal de l’épreuve du Faux Messie. Ô Allah, lave mes fautes avec l’eau, la neige et la grêle, purifie mon cœur des péchés comme tu purifies un vêtement blanc de la saleté, éloigne-moi de mes fautes comme Tu as éloigné l’Orient de l’Occident. Ô Allah, je cherche refuge auprès de Toi contre la paresse, la vieillesse, les péchés et les dettes). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] semuanya dari [Hisyam bin 'Urwah] dari [ayahnya] da ri ['aisyah] bawa Nabi shallallahu 'alaihi wasallam berdo'a dengan kalimat-kalimat ini, yaitu; \"Ya Allah, aku berlindung kepada-Mu dari fitnah neraka dan dari siksa api neraka, dari fitnah kubur dan dari siksa kubur, dari buruknya fitnah kekayaan dan dari buruknya kekafiran serta dari fitnah Al Masih Ad Dajjal. Ya Allah, bersihkanlah kesalahan-kesalahanku dengan air sajju dan air embun, sucikanlah hatiku dari kotoran-kotoran sebagaimana Engkau menyucikan baju yang putih dari kotoran. Dan jauhkanlah antara diriku dan kesalahan-kesalahanku sebagaimana Engkau jauhkan antara timur dan barat. Ya Allah, aku berlindung kepada-Mu dari rasa malas, kepikunan, kesalahan dan kerugian",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şu cümlelerle dua ederdi: «Allahım! cehennem ateşinin fitnesinden cehennem ateşinin azabından, kabir fitnesinden, kabir azabından, zenginlik fitnesinin, şerrinden, fakirlik fitnesinin şerrinden ve Deccal-i Mesih'in fitnesinin şerrinden sana sığınırım. Allahım! Günahlarımı kar ve dolu suyu ile yıka. ve beyaz elbiseyi kirden temizler gibi kalbimi hatalardan arındır. Benimle hatalarımın arasını da doğu ile batının arasını uzaklaştırdığın gibi uzak kıl. Allahım! Tembellikten, bunaklık derecesinde ihtiyarlıktan, günahtan ve borç'tan ve borçluluktan sana sığınırım. » Diğer tahric: Bu hadisi; Buhari, Müslim, Tirmizi ve Nesal de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 3839,
      "arabicNumber": 3839,
      "book": 34,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، عَنْ هِلاَلٍ، عَنْ فَرْوَةَ بْنِ نَوْفَلٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ دُعَاءٍ، كَانَ يَدْعُو بِهِ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَتْ كَانَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Farwah bin Nawfal said:\"I asked 'Aishah about a supplication that the Messenger of Allah (saas) used to say. She said that he used to say: 'Allahumma inni a'udhu bika min sharri ma 'amiltu, wa min sharri ma lam a'mal (O Allah, I seek refuge with You from the evil of that which I have done and the evil of that which I have not done)",
          "ur": "فروہ بن نوفل رضی اللہ عنہ کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہما سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم کون سی دعا کیا کرتے تھے؟ انہوں نے کہا: آپ کہتے تھے: «اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل» اے اللہ! میں تیری پناہ چاہتا ہوں ان کاموں کی برائی سے جو میں نے کئے اور ان کاموں کی برائی سے جو میں نے نہیں کئے ۔",
          "fr": "Rapporté par Farwah bin Nawfal : J’ai demandé à ‘Aishah une invocation que le Messager d’Allah ﷺ avait l’habitude de dire. Elle a dit qu’il disait : « Allahumma inni a’udhu bika min sharri ma ‘amiltu, wa min sharri ma lam a’mal (Ô Allah, je cherche refuge auprès de Toi contre le mal de ce que j’ai fait et le mal de ce que je n’ai pas fait). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [Hushain] dari [Hilal] dari [Farwah bin Naufal] dia berkata; saya bertanya kepada ['Aisyah] mengenai do'a yang sering di baca Rasulullah shallallahu 'alaihi wasallam, maka ia menjawab; \"Bahwa beliau mengucapkan: \"Ya Allah, aku berlindung kepada-Mu dari keburukan yang telah aku lakukan dan dari keburukan yang belum lakukan",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle dua ederdi: «Allahım! İşlediğimin şerrinden ve işlemediğimden sana sığınırım.» Diğer tahric: Bu hadisi; Müslim, Ebu Davud ve Nesai de rivAyet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 3840,
      "arabicNumber": 3840,
      "book": 34,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا بَكْرُ بْنُ سُلَيْمٍ، حَدَّثَنِي حُمَيْدٌ الْخَرَّاطُ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُعَلِّمُنَا هَذَا الدُّعَاءَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah (saas) used to teach us this supplication just as he would teach us a Surah from the Qur'an: 'Allahumma inni a'udhu bika min 'adhabi jahannam, wa a'udhu bika min 'adhabil-qabr, wa a'udhu bika min fitnatil-masihil-dajjal, wa a'udhu bika min fitnatil-mahya wal-mamat (O Allah, I seek refuge with You from the torment of Hell, and I seek refuge with You from the torment of the grave, and I see refuge with you from the tribulation of False Christ, and I seek refuge with You from the trials of life and death)",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جیسے قرآن کی سورت سکھاتے اسی طرح یہ دعا بھی ہمیں سکھاتے تھے: «اللهم إني أعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات» اے اللہ! میں تیری پناہ چاہتا ہوں جہنم کے عذاب سے، اور میں تیری پناہ چاہتا ہوں قبر کے عذاب سے، اور میں تیری پناہ چاہتا ہوں مسیح دجال کے فتنہ سے، اور میں تیری پناہ چاہتا ہوں زندگی اور موت کے فتنہ سے ۔",
          "fr": "Rapporté par Ibn ‘Abbas : Le Messager d’Allah ﷺ nous enseignait cette invocation comme il nous enseignait une sourate du Coran : « Allahumma inni a’udhu bika min ‘adhabi jahannam, wa a’udhu bika min ‘adhabil-qabr, wa a’udhu bika min fitnatil-masihil-dajjal, wa a’udhu bika min fitnatil-mahya wal-mamat (Ô Allah, je cherche refuge auprès de Toi contre le châtiment de l’Enfer, contre le châtiment de la tombe, contre l’épreuve du Faux Messie et contre les épreuves de la vie et de la mort). »",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir Al Hizami] telah menceritakan kepada kami [Bakr bin Sulaim] telah menceritakan kepadaku [Humaid Al Kharrath] dari [Kuraib bekas budak Ibnu Abbas] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam mengajarkan kami do`a ini sebagaimana beliau mengajari kami surat dari Al Qur`an, yaitu; \"Ya Allah, aku berlindung kepada-Mu dari siksa Jahannam, dan aku berlindung kepada-Mu dari siksa kubur. Aku berlindung kepada-Mu dari fitnah Al Masih Ad Dajjal dan aku berlindung kepada-Mu dari fitnah kematian dan kehidupan",
          "tr": "İbn-i Abbas (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bize Kur'an'dan olan sureyi öğrettiği gibi bize bu dua'yı da öğretirdi: «Allahım! Cehennem azabından şüphesiz sana sığınırım. Kabir azabından da cidden sana sığınırım ve Deccal-i Mesih'in fitnesinden de gerçekten sana sığınırım. Hayat ve Ölüm fitnesinden de sana sığınırım.» Diğer tahric: Bu hadis; Müslim, Tirmizi, Ebu Davud ve Nesai tarafından da rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 3841,
      "arabicNumber": 3841,
      "book": 34,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عَائِشَةَ، قَالَتْ فَقَدْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ ذَاتَ لَيْلَةٍ مِنْ فِرَاشِهِ فَالْتَمَسْتُهُ فَوَقَعَتْ يَدِي عَلَى بَطْنِ قَدَمَيْهِ وَهُوَ فِي الْمَسْجِدِ وَهُمَا مَنْصُوبَتَانِ وَهُوَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Aishah said:\"I noticed that the Messenger of Allah (saas) was missing from his bed one night, so I went looking for him, and my hand touched the soles of his feet; he was in the Masjid with his feet upright (prostrating), and he was saying: 'Allahumma inni a'udhu biridaka min sakhatika wa bimu'afatika 'an 'uqubatika, wa a'udhu bika minka, la uhsi thana'an 'alayka, Anta kama athnayta 'ala nafsika (O Allah, I seek refuge in Your pleasure from Your wrath, and in Your forgiveness from Your punishment. I seek refuge in You from You. I cannot praise You enough; You are as You have praised Yourself)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے ایک رات رسول اللہ صلی اللہ علیہ وسلم کو بستر پر موجود نہ پایا تو میں آپ کو ڈھونڈھنے لگی ( مکان میں اندھیرا تھا ) تو میرا ہاتھ آپ کے قدموں کے تلووں پر جا پڑا، دونوں پاؤں کھڑے تھے اور آپ ( حالت سجدہ میں ) یہ دعا کر رہے تھے: «اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك» اے اللہ! میں پناہ مانگتا ہوں تیری رضا مندی کی تیری ناراضگی سے، اور تیری عافیت کی تیری سزا سے، اور میں تیری پناہ مانگتا ہوں تیرے عذاب سے، میں تیری تعریف کما حقہ نہیں کر سکتا، تو ویسے ہی ہے جیسے تو نے خود اپنی تعریف فرمائی ہے ۔",
          "fr": "Rapporté par ‘Aishah : J’ai remarqué que le Messager d’Allah ﷺ n’était pas dans son lit une nuit, alors je suis partie à sa recherche, et ma main a touché la plante de ses pieds ; il était dans la mosquée, les pieds dressés (en prosternation), et il disait : « Allahumma inni a’udhu biridaka min sakhatika wa bimu’afatika ‘an ‘uqubatika, wa a’udhu bika minka, la uhsi thana’an ‘alayka, Anta kama athnayta ‘ala nafsika (Ô Allah, je cherche refuge dans Ta satisfaction contre Ta colère, et dans Ton pardon contre Ton châtiment. Je cherche refuge auprès de Toi contre Toi. Je ne peux pas Te louer comme il se doit ; Tu es tel que Tu T’es loué Toi-même). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami ['Ubaidullah bin Umar] dari Telah memberitakan kepada kami [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] dari ['Aisyah] dia berkata; \"Pada suatu malam, saya pernah kehilangan Rasulullah shallallahu 'alaihi wasallam dari tempat tidurnya, maka saya pun mencarinya, kemudian tanganku menyentuh kedua telapak kaki belaiu saat beliau tengah berada di dalam Masjid. dan kedua telapak kaki beliau berdiri tegak. Beliau tengah mengucapkan: \"Ya Allah, sesungguhnya aku berlindung dengan keridlaan-Mu dari kemarahan-Mu, dengan ke'afiyatan-Mu dari siksaan-Mu. Dan aku berlindung kepada-Mu dari murka-Mu, aku tidak mampu menghitung pujian atas diri-Mu sebagaimana Engkau telah memuji diri-Mu sendiri",
          "tr": "Aişe (r.anha)'dan; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i bir gece yatağında bulamadım. Bunun üzerine O'nu aradım ve elim O'nun ayağının alt kısmına değdi. O secde halinde idi, her iki ayağı dikilmiş vaziyette idi ve şöyle dua ediyordu: «Allahım! Ben senin hoşnutsuzluğundan rızana ve azabından affına sığınırım. Sen(in azabın)den sana sığınırım. Sana (layıkı vechiyle) hamd - sena etmeye takatim yetmez. Sen zatını övdüğün yüce vasıflara, üstün kemalat'a sahibsin.» Diğer tahric: Bu hadisi Müslim ve Tirmizi de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 3842,
      "arabicNumber": 3842,
      "book": 34,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، عَنِ الأَوْزَاعِيِّ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ جَعْفَرِ بْنِ عِيَاضٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ تَعَوَّذُوا بِاللَّهِ مِنَ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَنْ تَظْلِمَ أَوْ تُظْلَمَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Messenger of Allah (saas) said: \"Seek refuge with Allah from poverty, insufficiency and humiliation, and from wronging (others) and being wronged",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم اللہ سے فقیری، مال کی کمی، ذلت، ظلم کرنے اور ظلم کئے جانے سے پناہ مانگو ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit : « Cherchez refuge auprès d’Allah contre la pauvreté, l’insuffisance et l’humiliation, ainsi que contre le fait de commettre des injustices ou d’en subir. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Muhammad bin Mush'ab] dari [Al Auza'i] dari [Ishaq bin Abdullah] dari [Ja'far bin 'Iyadl] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam: \"Berlindunglah kalian kepada Allah dari kefakiran dan kekurangan dan kehinaan dan berbuat dzalim dan di dzalimi",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu demiştir: «Fakirlikten, azlıktan, zilletten, zulüm etmekten ve zulm'e uğramaktan Allah'a sığınırım.» Diğer tahric: Bu hadisi; Ebu Davud ile Nesai de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 3843,
      "arabicNumber": 3843,
      "book": 34,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ سَلُوا اللَّهَ عِلْمًا نَافِعًا وَتَعَوَّذُوا بِاللَّهِ مِنْ عِلْمٍ لاَ يَنْفَعُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Jabir that :the Messenger of Allah said: \"Ask Allah for beneficial knowledge and seek refuge with Allah from knowledge that is of no benefit",
          "ur": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم اللہ تعالیٰ سے اس علم کا سوال کرو جو فائدہ پہنچائے، اور اس علم سے پناہ مانگو جو فائدہ نہ پہنچائے ۔",
          "fr": "Rapporté par Jabir : Le Messager d’Allah ﷺ a dit : « Demandez à Allah un savoir utile et cherchez refuge auprès d’Allah contre un savoir qui ne sert à rien. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Usamah bin Zaid] dari [Muhammad bin Al Munkadir] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Memintalah kalian kepada Allah ilmu yang bermanfa'at, dan berlindunglah kalian kepada Allah dari ilmu yang tidak bermanfa'at",
          "tr": "Cabir (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah'tan yararlı ilim dileyiniz ve yarar sağlamayan ilim'den Allah'a sığınınız.» Not: Zevald'de şöyle denilmiştir: Bunun senedi sahih olup ravileri sika (yani güvenilir zatlar) dır. Ravi Üsame bin Zeyd, el-Leysi el-Müzeni olan Usame'dir. Müslim bu ravinin hadislerin! rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 3844,
      "arabicNumber": 3844,
      "book": 34,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَتَعَوَّذُ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَرْذَلِ الْعُمُرِ وَعَذَابِ الْقَبْرِ وَفِتْنَةِ الصَّدْرِ ‏.‏ قَالَ وَكِيعٌ يَعْنِي الرَّجُلَ يَمُوتُ عَلَى فِتْنَةٍ لاَ يَسْتَغْفِرُ اللَّهَ مِنْهَا ‏.‏",
        "translations": {
          "en": "It was narrated from 'Umar that the :Prophet saas used to seek refuge with Allah from cowardice, miserliness, old age, the torment of the grave and the tribulation of the heart. (Da'if)(One of the narrators) Waki' said: \"Meaning when a man dies in a state of tribulation (Fitnah) and does not ask Allah to forgive him",
          "ur": "عمر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم بزدلی، بخیلی، ارذل عمر ( انتہائی بڑھاپا ) ، قبر کے عذاب اور دل کے فتنہ سے پناہ مانگتے تھے۔ وکیع نے کہا: دل کا فتنہ یہ ہے کہ آدمی برے اعتقاد پر مر جائے، اور اللہ تعالیٰ سے اس کے بارے میں توبہ و استغفار نہ کرے",
          "fr": "Rapporté par ‘Umar : Le Prophète ﷺ avait l’habitude de chercher refuge auprès d’Allah contre la lâcheté, l’avarice, la vieillesse, le châtiment de la tombe et l’épreuve du cœur. (Da’if) Waki’ (un des rapporteurs) a dit : « Cela signifie quand une personne meurt dans l’épreuve (Fitnah) et ne demande pas pardon à Allah. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Abu Ishaq] dari ['Amru bin Maimun] dari [Umar] bahwa Nabi shallallahu 'alaihi wasallam selalu berlindung diri dari sifat pengecut dan bakhil, kepikunan, siksa kubur, dan dari fitnah dada. Waki’ menerangkan; yaitu seseorang meninggal diatas fitnah dan dia tidak beristighfar kepada kepada Allah dari fitnah tersebut",
          "tr": "Ömer(r.a.)'den; şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem), korkaklıktan, cimrilikten ve ömrün en rezil döneminden ve kalb fitnesinden Allah'a sığınırdı. (Ravi) Veki' dediki: Kalb fitnesi ile bir günah işleyip de ondan dolayı Allah'tan mağfiret dilemeden ölen adamın kalbini kasdetmiştir. Diğer tahric: Bu hadisi Ebu Davud ve Nesai de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 3845,
      "arabicNumber": 3845,
      "book": 34,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا أَبُو مَالِكٍ، سَعْدُ بْنُ طَارِقٍ عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَقَدْ أَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ أَقُولُ حِينَ أَسْأَلُ رَبِّي قَالَ ‏\"‏ قُلِ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَارْزُقْنِي ‏\"‏ ‏.‏ وَجَمَعَ أَصَابِعَهُ الأَرْبَعَ إِلاَّ الإِبْهَامَ ‏\"‏ فَإِنَّ هَؤُلاَءِ يَجْمَعْنَ لَكَ دِينَكَ وَدُنْيَاكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Malik, Sa'd Bin Tariq, narrated from his father that :when a man had come to the Messenger of Allah (saas), he heard him say: \"O Messenger of Allah, what should I say when I ask of Allah?\" He said: \"Say: Allahumma-ghfirli warhamni wa 'afini warzuqni (O Allah, forgive me, have mercy on me, keep me safe and sound and grant me provision),\" and he held up his four fingers apart from the thumb and said: \"These combine your religious and worldly affairs",
          "ur": "طارق رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے سنا ( اس وقت کہ جب ) ایک شخص آپ کی خدمت میں حاضر ہوا، اور اس نے عرض کیا: اللہ کے رسول! میں جب اپنے رب سے سوال کروں تو کیا کہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم یہ کہو: «اللهم اغفر لي وارحمني وعافني وارزقني» اے اللہ! مجھے بخش دے، مجھ پر رحم فرما، اور مجھے عافیت دے اور مجھے رزق عطا فرما ، اور آپ نے انگوٹھے کے علاوہ چاروں انگلیاں جمع کر کے فرمایا: یہ چاروں کلمات تمہارے لیے دین اور دنیا دونوں کو اکٹھا کر دیں گے ۔",
          "fr": "Rapporté par Abu Malik, Sa’d Bin Tariq, d’après son père : Lorsqu’un homme est venu voir le Messager d’Allah ﷺ, il l’a entendu dire : « Ô Messager d’Allah, que dois-je dire quand je demande à Allah ? » Il a dit : « Dis : Allahumma-ghfirli warhamni wa ‘afini warzuqni (Ô Allah, pardonne-moi, fais-moi miséricorde, protège-moi et accorde-moi ma subsistance), » et il a levé quatre doigts, sauf le pouce, en disant : « Ces paroles englobent tes affaires religieuses et mondaines. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Yazid bin harun] telah memberitakan kepada kami [Abu Malik Sa'd bin Thariq] dari [ayahnya] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam telah di kunjungi oleh seseorang laki-laki sambil bertanya; \"Wahai Rasulullah, apa yang harus saya ucapkan ketika aku memohon kepada Rabbku?\" beliau menjawab: \"Ucapkanlah; Ya Allah, ampunilah daku, kasihanilah daku, berikanlah daku ke'afiyatan dan berilah daku riziki.\" Kemudian beliau merapatkan keempat jari tangannya selain ibu jari: \"Sesungguhnya kalimat-kalimat tersebut akan mencukup bagimu agamamu dan duniamu",
          "tr": "Tarik (b. Eşyem r.a.)'den rivayet edildiğine göre bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek, Ya Resulullah! Ben Rabbim'den dilekte bulunmak istediğim zaman nasıl söyleyeyim, dediğinde Nebi (Sallallahu Aleyhi ve Sellem)'in (adama) şöyle buyurduğuna şahid olmuştur: « De ki : اللّهُمَّ! اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَارْزُقْنِي = Allahumme-ğfirli ve erhamni ve afini ve erzukni. » Ve Resul-i Ekrem (sallallahu aleyhi ve sellem) baş parmak hariç dört parmağını birleştirerek: «Şüphesiz şunlar senin için dinini ve dünyanı tıoplar » Dua’nın Meali: De ki: Allahım! Beni bağışla, bana rahmet et, beni afiyette kıl ve beni rızıklandır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 3846,
      "arabicNumber": 3846,
      "book": 34,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَخْبَرَنِي جَبْرُ بْنُ حَبِيبٍ، عَنْ أُمِّ كُلْثُومٍ بِنْتِ أَبِي بَكْرٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَّمَهَا هَذَا الدُّعَاءَ ‏ \"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that :the Messenger of Allah (saas) taught her this supplication: \"Allahumma inni as'aluka minal-khayri kullihi, 'ajilihi wa ajilihi, ma 'alimtu minhu wa ma la a'lam. Wa a'udhu bika minash-sharri kullihi, 'ajilihi wa ajilihi, ma 'alimtu minhu wa ma la a'lam. Allahumma inni as'aluka min khayri ma sa'alaka 'abduka wa nabiyyuka, wa a'udhu bika min sharri ma 'adha bihi 'abduka wa nabiyyuka. Allahumma inni as'alukal-jannatah wa ma qarrab ilayha min qawlin aw 'amalin, wa a'udhu bika minan-nari wa ma qarraba ilayha min qawlin aw 'amalin, wa as'aluka an taj'al kulla qada'in qadaytahuli khayran (O Allah, I ask You for all that is good, in this world and in the Hereafter, what I know and what I do not know. O Allah, I seek refuge with You from all evil, in this world and in the Hereafter, what I know and what I do not know. O Allah, I ask You for the good that Your slave and Prophet has asked You for, and I seek refuge with You from the evil from which Your slave and Prophet sought refuge. O Allah, I ask You for Paradise and for that which brings one closer to it, in word and deed, and I seek refuge in You from Hell and from that which brings one closer to it, in word and deed. And I ask You to make every decree that You decree concerning me good)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں یہ دعا سکھائی: «اللهم إني أسألك من الخير كله عاجله وآجله ما علمت منه وما لم أعلم وأعوذ بك من الشر كله عاجله وآجله ما علمت منه وما لم أعلم اللهم إني أسألك من خير ما سألك عبدك ونبيك وأعوذ بك من شر ما عاذ به عبدك ونبيك اللهم إني أسألك الجنة وما قرب إليها من قول أو عمل وأعوذ بك من النار وما قرب إليها من قول أو عمل وأسألك أن تجعل كل قضاء قضيته لي خيرا» اے اللہ! میں تجھ سے دنیا و آخرت کی ساری بھلائی کی دعا مانگتا ہوں جو مجھ کو معلوم ہے اور جو نہیں معلوم، اور میں تیری پناہ چاہتا ہوں دنیا اور آخرت کی تمام برائیوں سے جو مجھ کو معلوم ہیں اور جو معلوم نہیں، اے اللہ! میں تجھ سے اس بھلائی کا طالب ہوں جو تیرے بندے اور تیرے نبی نے طلب کی ہے، اور میں تیری پناہ چاہتا ہوں اس برائی سے جس سے تیرے بندے اور تیرے نبی نے پناہ چاہی ہے، اے اللہ! میں تجھ سے جنت کا طالب ہوں اور اس قول و عمل کا بھی جو جنت سے قریب کر دے، اور میں تیری پناہ چاہتا ہوں جہنم سے اور اس قول و عمل سے جو جہنم سے قریب کر دے، اور میں تجھ سے سوال کرتا ہوں کہ ہر وہ حکم جس کا تو نے میرے لیے فیصلہ کیا ہے بہتر کر دے ۔",
          "fr": "Rapporté par ‘Aishah : Le Messager d’Allah ﷺ lui a appris cette invocation : « Allahumma inni as’aluka minal-khayri kullihi, ‘ajilihi wa ajilihi, ma ‘alimtu minhu wa ma la a’lam. Wa a’udhu bika minash-sharri kullihi, ‘ajilihi wa ajilihi, ma ‘alimtu minhu wa ma la a’lam. Allahumma inni as’aluka min khayri ma sa’alaka ‘abduka wa nabiyyuka, wa a’udhu bika min sharri ma ‘adha bihi ‘abduka wa nabiyyuka. Allahumma inni as’alukal-jannatah wa ma qarrab ilayha min qawlin aw ‘amalin, wa a’udhu bika minan-nari wa ma qarraba ilayha min qawlin aw ‘amalin, wa as’aluka an taj’al kulla qada’in qadaytahuli khayran (Ô Allah, je Te demande tout le bien, immédiat ou futur, ce que j’en connais et ce que je n’en connais pas. Je cherche refuge auprès de Toi contre tout mal, immédiat ou futur, ce que j’en connais et ce que je n’en connais pas. Ô Allah, je Te demande le bien que Ton serviteur et Prophète T’a demandé, et je cherche refuge auprès de Toi contre le mal dont Ton serviteur et Prophète a cherché protection. Ô Allah, je Te demande le Paradis et ce qui y mène, en paroles et en actes, et je cherche refuge auprès de Toi contre l’Enfer et ce qui y mène, en paroles et en actes. Je Te demande aussi que tout ce que Tu as décrété pour moi soit un bien). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepadaku [Jabr bin Habib] dari [Ummu Kultsum binti Abu Bakar] dari ['Aisyah] bawha Rasulullah shallallahu 'alaihi wasallam pernah mengajarinya do'a ini, yaitu; \"Ya Allah, aku memohon kepada-Mu semua kebaikan, baik yang cepat (di dunia) maupun yang di tangguhkan (di akhirat), yang aku ketahui maupun yang tidak aku ketahui. Dan aku berlindung kepada-Mu dari semua keburukan, baik yang cepat (di dunia) maupun yang di tangguhkan (di akhirat), yang aku ketahui maupun yang tidak aku ketahui. Ya Allah, aku memohon kepada-Mu kebaikan yang di mohonkan hamba-Mu dan Nabi-Mu kepada-Mu, dan aku berlindung kepada-Mu dari keburukan yang hamba-Mu dan Nabi-Mu berlindung darinya kepada-Mu. Ya Allah, sungguh aku memohon surga memohon surga kepada-Mu dan semua yang mendekatkan diriku kepadanya dari perkataan atau perbuatan. Dan aku berlindung kepada-Mu dari neraka dan semua yang mendekatkan diriku kepadanya dari perkataan dan perbuatan. Serta aku memohon kepada-Mu agar Engkau menjadikan semua ketentuan yang Engkau tentukan kepadaku sebagai kebaikan",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) kendisine şu dua'yı öğretmiştir: «Allahım! Şüphesiz ben senden hayrın her çeşidinden isterim, acil olanı, acil olmayanı, bilebildiğim hayrı ve bilemediğim hayrı. Acil olan ve acil olmayan, bilebildiğim ve bilemediğim şerrin hepsinden sana sığınırım. Allahım! Senin kulun ve Nibiinin Sen'den istediği hayır (çeşidlerinden) şüphesiz bende isterim ve senin sevgili kulun ve Nebi'inin sana sığındığı şerlerden sana bende sığınırım. Allahım! Şüphesiz ben sen'den cenneti ve (beni) cennet'e yaklaştırıcı söz ve amel (de) muvaffak olmayı isterim.Cehennme ateşinden ve (beni) ona yaklaştıran söz veya amel'den de sana sığınırım. Beni için hükmettiğim her kaza (ve kadar) hükmünü hayırlı kılmanı senden dilerim.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi söz götürür. Seneddekl Ümmü Külsüm hakkında konuşanı görmedim. Bir gurup onu sahabilerden saymışlar ise de buna itiraz variddir, çünkü bu hatun Ebu Bekir (r.a.)'m vefatından sonra doğmuştur. Senedin kalan ravileri güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 3847,
      "arabicNumber": 3847,
      "book": 34,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لِرَجُلٍ ‏\"‏ مَا تَقُولُ فِي الصَّلاَةِ ‏\"‏ ‏.‏ قَالَ أَتَشَهَّدُ ثُمَّ أَسْأَلُ اللَّهَ الْجَنَّةَ وَأَعُوذُ بِهِ مِنَ النَّارِ أَمَا وَاللَّهِ مَا أُحْسِنُ دَنْدَنَتَكَ وَلاَ دَنْدَنَةَ مُعَاذٍ ‏.‏ قَالَ ‏\"‏ حَوْلَهُمَا نُدَنْدِنُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Messenger of Allah (saas) said to a man: \"What do you say during your prayer?\" He said: \"I recite the Tashah-hud then I ask for Allah for Paradise and see refuge with Him from Hell, but by Allah I do not understand your whispering or the whispering of Mu'adh.\" He said: \"It is concerning them (Paradise and Hell) that we are whispering",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے پوچھا: تم نماز میں کیا کہتے ہو ؟ اس نے کہا: میں تشہد ( التحیات ) پڑھتا ہوں، پھر اللہ سے جنت کا سوال کرتا ہوں اور جہنم سے اس کی پناہ مانگتا ہوں، لیکن اللہ کی قسم میں آپ کی اور معاذ کی گنگناہٹ اچھی طرح سمجھ نہیں پاتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: ہم بھی تقریباً ویسے ہی گنگناتے ہیں ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit à un homme : « Que dis-tu pendant ta prière ? » Il a répondu : « Je récite le Tashahhud puis je demande à Allah le Paradis et je cherche refuge auprès de Lui contre l’Enfer, mais par Allah, je ne comprends pas tes murmures ni ceux de Mu’adh. » Il a dit : « C’est justement à propos du Paradis et de l’Enfer que nous murmurons. »",
          "id": "Telah menceritakan kepada kami [Yusuf bin Musa Al Qatthan] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada seorang lelaki: \"Apa yang kamu ucapkan didalam shalat?.\" Dia menjawab; \"Aku membaca tasyahhud, kemudian meminta surga kepada Allah, dan berlindung kepada-Nya dari neraka. Demi Allah, sesungguhnya ucapan-ucapan pujianmu sangat baik dan bukan ucapan pujiam-pujian dari Mu'adz.\" Beliau bersabda: \"Semua dalam shalat kita mengucapkan pujian",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) bir adam a: «Namaz da (yani oturunca) ne diyorsun? » diye sordu. Adam: Ben teşehüdü (tehiyat ve salavat) okuyorum. Sonra Allah'tan cennet diliyor ve cehennem ateşinden O'na sığınıyorum. Ama, Vallahi ben ne senin ne okuduğunu ne de Muaz'ın ne okuduğunu bilmiyorum. dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Biz onun çevresinde (yani senin okuduğun şeylere yakın) sözler söyleriz,» buyurdu. Not: Zevaid'de bunun senedinin sahih ve ravilerinin güvenilir olduğu belirtilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 3848,
      "arabicNumber": 3848,
      "book": 34,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنِي سَلَمَةُ بْنُ وَرْدَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ الدُّعَاءِ أَفْضَلُ قَالَ ‏\"‏ سَلْ رَبَّكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ ‏\"‏ ‏.‏ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّانِي فَقَالَ يَا رَسُولَ اللَّهِ أَىُّ الدُّعَاءِ أَفْضَلُ قَالَ ‏\"‏ سَلْ رَبَّكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ ‏\"‏ ‏.‏ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّالِثِ فَقَالَ يَا نَبِيَّ اللَّهِ أَىُّ الدُّعَاءِ أَفْضَلُ قَالَ ‏\"‏ سَلْ رَبَّكَ الْعَفْوَ وَالَعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ فَإِذَا أُعْطِيتَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ فَقَدْ أَفْلَحْتَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas bin Malik said:\"A man come to the Prophet (saas) and said: 'O Messenger of Allah, what supplication is best?' He said: 'Ask your Lord for forgiveness and to be kept safe and sound in this world and in the Hereafter.' Then (the man) came the next day and said: 'O Messenger of Allah, what supplication is best?' He said: 'Ask your Lord for forgiveness and to be kept safe and sound in this world and in the Hereafter.' Then (the man) came the third day and said: 'O Prophet of Allah, what supplication is best?' He said: 'Ask your Lord for forgiveness and to be kept safe and sound in this world and in the Hereafter, for if you are forgiven and kept safe and sound in this world and the Hereafter, you will have succeeded",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا اور کہنے لگا: اللہ کے رسول! کون سی دعا سب سے بہتر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم اللہ سے دنیا اور آخرت میں عفو اور عافیت کا سوال کیا کرو ، پھر وہ شخص دوسرے دن حاضر خدمت ہوا اور عرض کیا: اللہ کے رسول! کون سی دعا سب سے بہتر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے رب سے دنیا و آخرت میں عفو اور عافیت کا سوال کیا کرو ، پھر وہ تیسرے دن بھی حاضر خدمت ہوا، اور عرض کیا: اللہ کے نبی! کون سی دعا سب سے بہتر ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے رب سے دنیا و آخرت میں عفو و عافیت کا سوال کیا کرو، کیونکہ جب تمہیں دنیا اور آخرت میں عفو اور عافیت عطا ہو گئی تو تم کامیاب ہو گئے ۱؎۔",
          "fr": "Rapporté par Anas bin Malik : Un homme est venu voir le Prophète ﷺ et a dit : « Ô Messager d’Allah, quelle est la meilleure invocation ? » Il a répondu : « Demande à ton Seigneur le pardon et la protection dans ce monde et dans l’au-delà. » Le lendemain, il est revenu et a posé la même question, et le Prophète a donné la même réponse. Le troisième jour, il a reposé la question, et le Prophète a dit : « Demande à ton Seigneur le pardon et la protection dans ce monde et dans l’au-delà, car si tu es pardonné et protégé ici-bas et dans l’au-delà, tu as réussi. »",
          "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Salamah bin Wardan] dari [Anas bin Malik] dia berkata; \"Seorang laki-laki mendatangi Nabi shallallahu 'alaihi wasallam seraya bertanya; \"Wahai Rasulullah, do`a apa yang paling utama?.\" Beliau menjawab: \"Mintalah ampunan dan kesehatan kepada Rabbmu di dunia dan akhirat.\" Kemudian datang lagi di hari yang kedua, dan bertanya; \"Wahai Rosulullah, do`a apa yang paling utama?.\" Beliau menjawab: \"Mintalah ampunan dan kesehatan kepada Robbmu di dunia dan akhirat.\" Kemuduian datang lagi di hari yang ketiga, dan bertanya; \"Wahai Nabi Allah, do`a apa yang paling utama?.\" Beliau menjnawab: \"Mintalah ampunan dan kesehatan kepada Rabbmu di dunia dan akhirat, dan jika kamu telah di beri ma'af dan kesehatan di dunia dan akhirat, maka kamu telah beruntung",
          "tr": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resulallah! Hangi dua efdaldir? diye sordu. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Rabbinden dünyada ve ahirette afv ve afiyet dile » buyurdu. Sonra Adam ikinci gün gelerek: Ya Resulallah! Hangi dua efdaldir? diye sordu. Resul- Ekrem (Sallallahu Aleyhi ve Sellem): «Rabbin'den dünyada ve ahirette afv ve afiyet iste, » buyurdu. Sonra adam ona üçüncü gün geldi ve: Ya Nebiyyallah! Hangi dua efdaldir? dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Rabbin'den dünyada ve ahirette afv ve afiyet dile. Sana dünya ve ahirette afv afiyet verilince şüphesiz muradına ermiş olursun,» buyurdu. Bu Hadis’i Tirmizi de tahric etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 3849,
      "arabicNumber": 3849,
      "book": 34,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا عُبَيْدُ بْنُ سَعِيدٍ، قَالَ سَمِعْتُ شُعْبَةَ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ سَمِعْتُ سُلَيْمَ بْنَ عَامِرٍ، يُحَدِّثُ عَنْ أَوْسَطَ بْنِ إِسْمَاعِيلَ الْبَجَلِيِّ، أَنَّهُ سَمِعَ أَبَا بَكْرٍ، حِينَ قُبِضَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَقُولُ قَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي مَقَامِي هَذَا عَامَ الأَوَّلِ ثُمَّ بَكَى أَبُو بَكْرٍ ثُمَّ قَالَ ‏ \"‏ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ مَعَ الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَسَلُوا اللَّهَ الْمُعَافَاةَ فَإِنَّهُ لَمْ يُؤْتَ أَحَدٌ بَعْدَ الْيَقِينِ خَيْرًا مِنَ الْمُعَافَاةِ وَلاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَقَاطَعُوا وَلاَ تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Awsat (bin Isma'il) Al-Bajali that :he heard Abu Bakr, when the Prophet (saas) had passed away, saying: \"The Messenger of Allah (saas) stood in this place where I am standing, last year.\" Then Abu Bakr wept, then he said: \"You must adhere to the truth, for with it comes righteousness and they both lead to Paradise. And you must beware of lying for with it comes immorality, and they both lead to Hell. Ask Allah for Al-Mu'afah, for no one is given anything after certainty that is better than Mu'afah. Do not envy one another, do not hate one another, do not sever ties with one another, do not turn your backs on one another and be, O slaves of Allah, brothers",
          "ur": "اوسط بن اسماعیل بجلی سے روایت ہے کہ جب نبی اکرم صلی اللہ علیہ وسلم کی وفات ہوئی، تو انہوں نے ابوبکر رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ پچھلے سال میری اس جگہ پر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے تھے، پھر ابوبکر رضی اللہ عنہ نے روتے ہوئے کہا: آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے لیے سچائی کو لازم کر لو کیونکہ سچائی نیکی کی ساتھی ہے، اور یہ دونوں جنت میں ہوں گی، اور تم جھوٹ سے پرہیز کرو کیونکہ جھوٹ برائی کا ساتھی ہے، اور یہ دونوں جہنم میں ہوں گی، اور تم اللہ تعالیٰ سے تندرستی اور عافیت طلب کرو کیونکہ ایمان و یقین کے بعد صحت و تندرستی سے بڑھ کر کوئی چیز نہیں ہے، تم آپس میں ایک دوسرے سے حسد اور بغض نہ کرو، قطع رحمی اور ترک تعلقات سے بچو، اور ایک دوسرے سے منہ موڑ کر پیٹھ نہ پھیرو بلکہ اللہ کے بندے بھائی بھائی بن کر رہو ۱؎۔",
          "fr": "Rapporté par Awsat (bin Isma’il) Al-Bajali : Il a entendu Abu Bakr, après le décès du Prophète ﷺ, dire : « Le Messager d’Allah ﷺ s’est tenu à cet endroit où je me tiens, l’an dernier. » Puis Abu Bakr a pleuré et a dit : « Tenez-vous à la vérité, car elle mène à la piété, et toutes deux mènent au Paradis. Méfiez-vous du mensonge, car il mène à l’immoralité, et toutes deux mènent à l’Enfer. Demandez à Allah la protection (Al-Mu’afah), car après la certitude, rien n’est meilleur que la protection. Ne vous enviez pas, ne vous détestez pas, ne rompez pas vos liens, ne vous tournez pas le dos, et soyez, ô serviteurs d’Allah, des frères. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami ['Ubaid bin Sa'id] dia berkata; saya mendengar [Syu'bah] dari [Yazid bin Khumair] dia berkata; saya mendengar [Sulaim bin 'Amir] bercerita dari [Ausath bin Isma'il Al Bajali] bahwa dia mendengar [Abu Bakar] ketika Nabi shallallahu 'alaihi wasallam meninggal dunia, katanya; \"Rasulullah shallallahu 'alaihi wasallam telah berdiri di tempat berdiriku ini pada tahun pertama.\" -kemudian dia menangis- dia melanjutkan; \"Kalian harus berlaku jujur, karena sesungguhnya kejujuran bersama dengan kebaikan, dan keduanya berada di surga. Janganlah kalian berdusta, karena sesungguhnya kedustaan bersama dengan kejahatan, dan kedua-duanya berada di neraka. Memintalah kalian kepada Allah ampunan, sesungguhnya ia tidak di berikan kepada seseorang setelah keyakinan yang lebih baik daripada pengampunan, dan janganlah kalian saling hasad, jangan saling membenci, jangan saling memutus hubungan dan jangan saling bermusuhan, dan jadilah kalian hamba-hamba Allah yang bersaudara",
          "tr": "Evsat bin İsmail el-Beceli (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) vefat edince Ebu Bekr (r.a.)'in şu hadis'i rivayetine kendisi şahid olmuştur: Resulullah (Sallallahu Aleyhi ve Sellem) iki yıl benim şu yerimde ayağa kalktı (Ebu Bekr böyle söyledikten sonra ağladı). Daha sonra hadis rivayetine devamla dediki: (Sözde ve iş'te) doğruluktan ayrılmayınız. Çünkü doğruluk şüphesiz hayır ile beraberdir (yani sahibini iyi amele yöneltir.) Doğruluk ve hayır (sahibi) de cennettedir. Yalancılıktan da sakınınız. Çünkü yalancılık şüphesiz şer ile beraberdir. (yani sahibini kötülüğe sürükler) ve yalancılıkla şer sahibi cehennemdedir. Allah'tan muafat (yani hoşlanılmayan şerlerden selamet ve afiyette olamayı) dileyiniz. Çünkü hiç kimse imandan sonra afiyetten daha hayırlı bir şey şüphesiz verilmemiştir. Birbirinize haset etmeyiniz. Birbirinize buğz etmeyiniz. Birbirinizle iyi ilişkileri kemeyiniz. Birbirinizden yüz çevirip küsüşmeyiniz. Ve ey Allah'ın kulları kardeşler olunuz. Not: Zevaid'de şöyle denilmiştir: Bu hadisi Nesai, el•Yevm ve'l.Leyle adlı kitabında birkaç yoldan rivayet etmiştir. O yollardan bazısı şunlardır: Yahya. bin Osman'dan, o da Ömer bin Abdulvahid'den; ayrıca Mahmud bin Halid'den, o da el•Velid'den rivayet etmişler ve bu iki ravi. yani Ömer ile Velid bunu Abdurrahman bin Yezld'den, o da Cabir'den. o da Süleym bin Amir'den rivayette' bulunmuşlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 3850,
      "arabicNumber": 3850,
      "book": 34,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ كَهْمَسِ بْنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ وَافَقْتُ لَيْلَةَ الْقَدْرِ مَا أَدْعُو قَالَ ‏ \"‏ تَقُولِينَ اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that she said:\"O Messenger of Allah, what do you think I should say in my supplication, if I come upon Laylatul-Qadr?\" He said: \"Say: 'Allahumma innaka 'afuwwun tuhibbul-'afwa, fa'fu 'anni (O Allah, You are Forgiving and love forgiveness, so forgive me)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے عرض کیا: اللہ کے رسول! اگر مجھے شب قدر مل جائے تو کیا دعا کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: یہ دعا کرو «اللهم إنك عفو تحب العفو فاعف عني» اے اللہ تو معاف کرنے والا ہے اور معافی و درگزر کو پسند کرتا ہے تو تو مجھ کو معاف فرما دے ۔",
          "fr": "Rapporté par ‘Aishah : Elle a dit : « Ô Messager d’Allah, que dois-je dire dans mon invocation si je tombe sur la nuit du Destin (Laylatul-Qadr) ? » Il a dit : « Dis : Allahumma innaka ‘afuwwun tuhibbul-‘afwa, fa’fu ‘anni (Ô Allah, Tu es Pardonneur et Tu aimes le pardon, alors pardonne-moi). »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Kahmas bin Al Hasan] dari [Abdullah bin Buraidah] dari ['Aisyah] bahwa dia berkata; \"Wahai Rasulullah, apa pendapatmu jika aku ketepatan mendapatkan malam lailatul Qodar, apa yang harus aku ucapkan?\", beliau menjawab: \"Ucapkanlah; ya Allah, sesungguhnya Engkau maha pema'af mencintai kema'afan, maka ma'afkanlah daku",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre, kendisi: Ya Resulallh! Kadis gecesine rastlarsam ne dua edeceğimi bana bildir, diye talepte bulunmuş. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Allahım! Şüphesiz, sen afv edicisin, afv etmeyi seversin, beni afv et, dersin.» (Allahumme inneke afuvvun, tuhibbu'l-afve, fe-affu anni) Diğer tahric: Tirmizi, Nesai, Ahmed ve Hakim"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 3851,
      "arabicNumber": 3851,
      "book": 34,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ عَنْ قَتَادَةَ، عَنِ الْعَلاَءِ بْنِ زِيَادٍ الْعَدَوِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا مِنْ دَعْوَةٍ يَدْعُو بِهَا الْعَبْدُ أَفْضَلَ مِنَ - اللَّهُمَّ إِنِّي أَسْأَلُكَ الْمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (saas) said: 'There is no supplication that a person can say that is better than: Allahumma inni as'aluka al-mu'afah fid-dunya wal-akhirah (O Allah, I ask You for Al-Mu'afah in this world and in the Hereafter)",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بندہ جو بھی دعا مانگتا ہے وہ اس دعا سے زیادہ بہتر نہیں ہو سکتی: ( وہ دعا یہ ہے ) «اللهم إني أسألك المعافاة في الدنيا والآخرة» اے اللہ میں تجھ سے دنیا اور آخرت میں عافیت چاہتا ہوں ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit : « Il n’y a pas d’invocation meilleure que celle-ci : Allahumma inni as’aluka al-mu’afah fid-dunya wal-akhirah (Ô Allah, je Te demande la protection dans ce monde et dans l’au-delà). »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Hisyam pemilik Ad Dastuwa`i] dari [Qatadah] dari [Al 'Ala` bin Ziyad Al 'Adawi] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada do`a yang di ucapkan seorang hamba ketika berdo`a lebih utama dari; Ya Allah, sesungguhnya aku meminta kepada-Mu ampunan didunia dan akhirat",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kulun; ''Allahın! Ben sen'den dünya ve ahirette afiyet dilerim'' duasından daha faziletli, edecceği bir dua yoktur.» Zevaid de : Bu hadis'in senedi sahih, ravileri sikadır. Ravi el-Ala bin Ziyad'ı İbn-i Hibban sika saymıştır. Bende bu ravi hakkında konuşanı görmedim. diğer raviler ise meşhurdurlar, hakların konuşmaya gerek yoktur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 3852,
      "arabicNumber": 3852,
      "book": 34,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَرْحَمُنَا اللَّهُ وَأَخَا عَادٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that :the Messenger of Allah (saas) said: \"May Allah have mercy on us and on our brother of 'Ad.\" (i.e., Prophet Hud alay-salaam)",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ ہم پر اور عاد کے بھائی ( ہود علیہ السلام ) پر رحم فرمائے ۱؎۔",
          "fr": "Rapporté par Ibn ‘Abbas : Le Messager d’Allah ﷺ a dit : « Qu’Allah nous fasse miséricorde ainsi qu’à notre frère du peuple de ‘Ad. » (C’est-à-dire le Prophète Hud, alay-salaam)",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Zaid bin Al Khubab] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah merahmati kita dan saudara 'Aad (Nabi Hud)",
          "tr": "İbn-i (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle dua etti, demiştir: «Allah biz'e ve Ad'in kardeşine rahmet eylesin.» Zevaid de: Bu hadis'in senedi sahih, ravileri sikadır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 3853,
      "arabicNumber": 3853,
      "book": 34,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ يُسْتَجَابُ لأَحَدِكُمْ مَا لَمْ يَعْجَلْ ‏\"‏ ‏.‏ قِيلَ وَكَيْفَ يَعْجَلُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ يَقُولُ قَدْ دَعَوْتُ اللَّهَ فَلَمْ يَسْتَجِبِ اللَّهُ لِي ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Messenger of Allah (saas) said: \"It is necessary that you do not become hasty.\" It was said: \"What does being hasty mean, O Messenger of Allah?\" He said: \"When one says: 'I supplicated to Allah but Allah did not answer me",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے ہر ایک کی دعا قبول ہوتی ہے، بشرطیکہ وہ جلدی نہ کرے ، عرض کیا گیا: اللہ کے رسول! جلدی کا کیا مطلب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ یوں کہتا ہے کہ میں نے اللہ تعالیٰ سے دعا کی لیکن اللہ تعالیٰ نے میری دعا قبول نہ کی ۱؎۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit : « Il est important de ne pas être pressé. » On a demandé : « Que signifie être pressé, ô Messager d’Allah ? » Il a répondu : « C’est quand on dit : “J’ai invoqué Allah mais Allah ne m’a pas répondu.” »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Ishaq bin Sulaiman] dari [Malik bin Anas] dari [Az Zuhri] dari [Abu 'Ubaid bekas budak Abdurrahman bin 'Auf] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Do`a salah seorang dari kalian akan di kabulkan selagi ia tidak tergesa-gesa.\" Di tanyakan; \"Bagaimana maksud dari tergesa-gesa?\" beliau menjawab: \"Ia berkata; \"aku telah berdo'a kepada Allah, namun sampai saat ini Allah tidak juga mengabulkan do'aku",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem): «Herhangibiriniz acele etmedikçe duası kabul olunur, » buyurmuş. Dua eden kişi nasıl acele eder? Ya Resulullah, diye sorulunca, O: «Adam: Ben Allah'a dua ettim de Allah benim duamı kabul etmedi, der.» diye cevap verdi. Diğer tahric: Buhari, deavat; Müslim, zikir; Ebu Davud, vitr; Tirmizi dua; Muvatta', kur'an; Ahmed b. Hanbel, II, 487. Tirmizî: Bu hadis hasen sahihtir. Ebu Ubeyde’nin ismi Sa’d’tır. Abdurrahman b. Ezher’in azadlı kölesidir. Abdurrahman b. Avf’ın azadlısı olduğu da söylenir. Abdurrahman b. Ezher ise Abdurrahman b. Avf’ın amcasının oğludur. Tirmizî: Bu konuda Enes (r.a.)’den de hadis rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 3854,
      "arabicNumber": 3854,
      "book": 34,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ يَقُولَنَّ أَحَدُكُمُ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ وَلْيَعْزِمْ فِي الْمَسْأَلَةِ فَإِنَّ اللَّهَ لاَ مُكْرِهَ لَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the :Messenger of Allah (saas) said: \"No one among you should say: \"O Allah, forgive me if You will.' Let him be definite in his asking, and no one can compel Allah",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی یہ نہ کہے کہ اے اللہ! اگر تو چاہے تو مجھے بخش دے، بلکہ اللہ تعالیٰ سے یقینی طور پر سوال کرے، کیونکہ اللہ تعالیٰ پر کوئی زور زبردستی کرنے والا نہیں ہے ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d'Allah (ﷺ) a dit : « Aucun d’entre vous ne doit dire : “Ô Allah, pardonne-moi si Tu veux.” Qu’il soit déterminé dans sa demande, car personne ne peut contraindre Allah. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdullah bin Idris] dari [Ibnu 'Ajlan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian mengucapkan; \"Ya Allah, ampunilah daku jika Engkau menghendaki.\" Namun hendaknya ia bersungguh-sungguh dalam memohon, karena sesungguhnya Allah tidak memiliki kebencian",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sakın herhangi biriniz ''Allahım! Dilersen bana mağfiret et'' şeklinde dua etmesin. ve dileğinde kesin ifade kullansın. Çünkü Allah'ı zorlayan hiç bir güç yoktur.» Diğer tahric: Bu hadisi; Buhari, Müslim, Tirmizi, Ebu Davud ve Malik de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 3855,
      "arabicNumber": 3855,
      "book": 34,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي زِيَادٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اسْمُ اللَّهِ الأَعْظَمُ فِي هَاتَيْنِ الآيَتَيْنِ ‏{وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لاَ إِلَهَ إِلاَّ هُوَ الرَّحْمَنُ الرَّحِيمُ}‏ وَفَاتِحَةِ سُورَةِ آلِ عِمْرَانَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Asma' bint Yazid that :the Messenger of Allah (saas) said: \"The Greatest Name of Allah is in these two Verses: And your Ilah (God) is One Ilah (God - Allah), La Ilaha Illa Huwa (none has the right to be worshipped but He), the Most Gracious, the Most Merciful.' And at the beginning of Surah Al 'Imran",
          "ur": "اسماء بنت یزید رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کا اسم اعظم ان دو آیات میں ہے «وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم» تم سب کا معبود ایک ہی معبود ہے، اس کے سوا کوئی معبود برحق نہیں، وہ بہت رحم کرنے والا اور بڑا مہربان ہے ( سورۃ البقرہ: ۱۶۳ ) اور سورۃ آل عمران کے شروع میں: «الم الله لا إله إلا هو الحي القيوم» «الم»، اللہ تعالیٰ وہ ہے جس کے سوا کوئی معبود برحق نہیں، جو حی و قیوم ( زندہ اور سب کا نگہبان ) ہے ۔ ( سورۃ آل عمران: ۱-۲ ) ۔",
          "fr": "Rapporté par Asma' bint Yazid : Le Messager d'Allah (ﷺ) a dit : « Le plus grand Nom d’Allah se trouve dans ces deux versets : “Et votre Ilah (Dieu) est un Ilah unique (Allah), La Ilaha Illa Huwa (nul n’a le droit d’être adoré en dehors de Lui), le Tout Miséricordieux, le Très Miséricordieux.” Et au début de la sourate Al 'Imran. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Isa bin Yunus] dari ['Ubaidillah bin Abu Ziyad] dari [Syahr bin Hausyab] dari [Asma` binti Yazid] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Nama Allah yang Agung terdapat di dalam dua ayat ini; Dan Rabbmu adalah Rabb yang Maha Esa, tidak ada ilah (yang berhak di sembah) selain Dia, yang Maha pemurah lagi Maha penyayang.\" Qs Al Baqarah; 163, dan pembukaan surat Ali Imran",
          "tr": "Esma' bint-i Yezid (r.anha)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah'ın ism-i azam'ı şu iki ayettedir (1):’’ وَإلهُكُمْ إِلهٌ وَاحِدٌ لاَ إِلهَ إِلاَّ هُوَ الرَّحْمنُ الرَّحِيمُ. =..Ve sizin ilahınız tek ilhtır. Ondan başka ilah yoktur. Rahman O'dur. Rahim O'dur.’’ [Bakara163] (2): Al-i İmran suresinin başındaki iki ayet.» الم {1} اللّهُ لا إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ {2} \"Elif, Lam, Mim. Allah, O'ndan başka ilah yoktur, ezeli ve ebedi diri olan O'dur, bütün varlıkları yönetip gözeten O'dur.\" Diğer tahric: Bu lıadisi; Tirmizi, Ebu Davud ve Ahmed de rivAyet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 3856,
      "arabicNumber": 3856,
      "book": 34,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْعَلاَءِ، عَنِ الْقَاسِمِ، قَالَ اسْمُ اللَّهِ الأَعْظَمُ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ فِي سُوَرٍ ثَلاَثٍ الْبَقَرَةِ وَآلِ عِمْرَانَ وَطَهَ ‏.‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ، قَالَ ذَكَرْتُ ذَلِكَ لِعِيسَى بْنِ مُوسَى فَحَدَّثَنِي أَنَّهُ، سَمِعَ غَيْلاَنَ بْنَ أَنَسٍ، يُحَدِّثُ عَنِ الْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ ‏.‏",
        "translations": {
          "en": "It was narrated that Al-Qasim said:The Greatest Name of Allah, if He is called by which He will respond, is in three Surah: Al-Baqarah, Al 'Imran and Ta-Ha. (Hasan)Another chain for something similar from Al-Qasim, from Abu Umamah, from the Prophet (saas)",
          "ur": "قاسم کہتے ہیں کہ اللہ تعالیٰ کا اسم اعظم جس کے ذریعہ اگر دعا کی جائے تو قبول ہوتی ہے تین سورتوں میں ہے: سورۃ البقرہ، سورۃ آل عمران اور سورۃ طہٰ ۱؎۔",
          "fr": "Rapporté par Al-Qasim : Le plus grand Nom d’Allah, si on L’invoque par ce Nom Il répond, se trouve dans trois sourates : Al-Baqarah, Al 'Imran et Ta-Ha. (Hasan) Une autre chaîne rapporte quelque chose de similaire de la part d’Al-Qasim, d’Abu Umamah, du Prophète (ﷺ)",
          "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami ['Amru bin Abu Salamah] dari [Abdullah bin Al 'Ala`] dari [Al Qasim] dia berkata; \"Nama Allah yang Agung yang apabila berdo`a dengan-Nya akan di kabulkan, yaitu didalam tiga surat; Al Baqarah, Ali 'Imran dan Thahaa.\" Telah menceritakan kepadaku [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami ['Amru bin Abu Salamah] dia berkata; aku menyebutkan hal itu kepada ['Isa bin Musa] lantas dia menceritakannya kepadaku, bahwa dia pernah mendengar [Ghailan bin Anas] menceritakan dari [Al Qasim] dari [Abu Umamah] dari Nabi shallallahu 'alaihi wasallam seperti di atas"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 3857,
      "arabicNumber": 3857,
      "book": 34,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، أَنَّهُ سَمِعَهُ مِنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ سَمِعَ النَّبِيُّ ـ صلى الله عليه وسلم ـ رَجُلاً يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّكَ أَنْتَ اللَّهُ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لَقَدْ سَأَلَ اللَّهَ بِاسْمِهِ الأَعْظَمِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى وَإِذَا دُعِيَ بِهِ أَجَابَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin Buraidah that his father said:\"The Prophet (saas) heard a man say: 'Allahumma! Inni as'aluka bi-annaka Antallahul-Ahadus-Samad, alladhi lam yalid wa lam yuwlud, wa lam yakun lahu kufuwan ahad (O Allah! I ask You by virtue of Your being Allah, the One, the Self-Sufficient Master, Who begets not nor was begotten, and there is none co-equal or comparable to Him).' The Messenger of Allah (saas) said: 'He has asked Allah by His Greatest Name, which if He is asked thereby He gives, and if He is called upon thereby He answers",
          "ur": "بریدہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص کو یہ کہتے سنا: «اللهم إني أسألك بأنك أنت الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد» اے اللہ! میں تجھ سے سوال کرتا ہوں کیونکہ تو ہی اکیلا اللہ ہے، بے نیاز ہے، جس نے نہ جنا اور نہ وہ جنا گیا، اور نہ کوئی اس کا ہم سر ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس شخص نے اللہ سے اس کے اس اسم اعظم کے ذریعہ سوال کیا ہے جس کے ذریعہ اگر سوال کیا جائے تو اللہ تعالیٰ عطا کرتا ہے، اور دعا کی جائے تو وہ قبول کرتا ہے ۔",
          "fr": "Rapporté par 'Abdullah bin Buraidah, dont le père a dit : Le Prophète (ﷺ) a entendu un homme dire : “Allahumma ! Inni as’aluka bi-annaka Antallahul-Ahadus-Samad, alladhi lam yalid wa lam yuwlad, wa lam yakun lahu kufuwan ahad (Ô Allah ! Je Te demande par le fait que Tu es Allah, l’Unique, le Maître absolu, qui n’engendre pas et n’a pas été engendré, et nul n’est égal à Lui).” Le Messager d’Allah (ﷺ) a dit : « Il a invoqué Allah par Son plus grand Nom, qui, si on L’invoque par Lui, Il donne, et si on L’appelle par Lui, Il répond. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Malik bin Mighwal] bahwa dia mendengar dari [Abdullah bin Buraidah] dari [ayahnya] dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah mendengar seseorang mengucapkan; \"Ya Allah, sesungguhnya aku meminta kepada-Mu, bahwasanya Engkau adalah Allah Yang Maha Esa, Yang Bergantung pada-Nya segala sesuatu, yang tidak beranak dan tidak diperanakkan, dan tidak ada seorang pun yang setara dengan-Nya.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh dia telah meminta kepada Allah dengan nama-Nya yang Agung, yang apabila diminta dengan menyebut-Nya, pasti akan di beri dan apabila berdo'a dengan menyebut-Nya pasti akan di kabulkan",
          "tr": "Büreyde (bin el-Husayb) (r.a.)'den şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) bir adam'ın (ki Ebu Musa el-Eş'aridir): ''Allahım! Ben senin zatında, sıfatlarında ve fiillerinde tek olup benzeri ve ortağı olmayan, her şeyden müstağni olup tüm varlıkların muhtaç olduğu, doğurmayan, doğurulmayan ve hiç bir şey O'na denk olmayan Allah olduğunu itiraf ederek senden isterim'' diye dua ederken sesini işitti. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Şüphesiz bu adam Allah'tan İsm-i A'zam'ı ile istedi, o İsm-i A'zam ki onunlar Allah'tan istenince verir ve onunla çağrıldığı zaman dua'yı kabul buyurur.» Diğer tahric: Bu hadisi; Tirmizi, Ebu Davud, Nesai, Ahmed, İbn-i Hibban ve Hakim de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 3858,
      "arabicNumber": 3858,
      "book": 34,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبُو خُزَيْمَةَ، عَنْ أَنَسِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعَ النَّبِيُّ ـ صلى الله عليه وسلم ـ رَجُلاً يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لاَ إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالأَرْضِ ذُو الْجَلاَلِ وَالإِكْرَامِ فَقَالَ ‏ \"‏ لَقَدْ سَأَلَ اللَّهَ بِاسْمِهِ الأَعْظَمِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى وَإِذَا دُعِيَ بِهِ أَجَابَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas bin Malik said:\"The Prophet (saas) heard a man say: 'Allahumma! Inni as'aluka bi-anna lakal-hamd. La ilaha illa Anta, wahdaka la sharika laka. Al-Mannan. Badi'us-samawati wal-ard. Dhul-jalali wal-ikram (O Allah! I ask You by virtue of the fact that all praise is due to You; none has the right to be worshiped but You alone, and You have no partner or associate, the Bestower, the Originator of the heavens and the earth, the Possessor of majesty and honor.' He (saas) said: 'He has asked Allah by His Greatest Name which, if He is asked thereby He gives and if He is called upon thereby He answers",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص کو یہ دعا کرتے سنا، «اللهم إني أسألك بأن لك الحمد لا إله إلا أنت وحدك لا شريك لك المنان بديع السموات والأرض ذو الجلال والإكرام» اے اللہ! میں تجھ سے سوال کرتا ہوں کیونکہ تیرے ہی لیے حمد ہے، تیرے سوا کوئی معبود برحق نہیں، تو اکیلا ہے تیرا کوئی شریک نہیں، تو بہت احسان کرنے والا ہے، آسمانوں اور زمین کو بغیر مثال کے پیدا کرنے والا ہے، جلال اور عظمت والا ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس شخص نے اللہ سے اس کے اس اسم اعظم کے ذریعہ سوال کیا ہے کہ جب بھی اس کے ذریعہ سوال کیا جائے تو وہ عطا کرتا ہے، اور جب اس کے ذریعہ دعا مانگی جائے تو وہ قبول کرتا ہے ۔",
          "fr": "Rapporté par Anas bin Malik : Le Prophète (ﷺ) a entendu un homme dire : “Allahumma ! Inni as’aluka bi-anna lakal-hamd. La ilaha illa Anta, wahdaka la sharika laka. Al-Mannan. Badi’us-samawati wal-ard. Dhul-jalali wal-ikram (Ô Allah ! Je Te demande car à Toi reviennent toutes les louanges ; nul n’a le droit d’être adoré sauf Toi, Tu es sans associé, le Bienfaiteur, le Créateur des cieux et de la terre, le Détenteur de la majesté et de la générosité).” Il (ﷺ) a dit : « Il a invoqué Allah par Son plus grand Nom, qui, si on L’invoque par Lui, Il donne, et si on L’appelle par Lui, Il répond. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abu Khaizamah] dari [Anas bin Sirin] dari [Anas bin Malik] dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah mendengar seseorang mengucapkan; \"Ya Allah, sesungguhnya aku memohon kepada-Mu bahwa bagi-Mu segala pujian, tiada ilah melainkan Engkau yang tidak ada sekutu bagi-Mu, yang Maha memberi, pencipta langit dan bumi, Yang Maha memiliki keluruhan dan Kemurahan.\" Maka beliau bersabda: \"Ia telah memohon kepada Allah dengan nama-Nya yang Agung, yang jika ia meminta sesutu dengan menyebutnya pasti akan di beri, dan jika berdo'a dengannya pasti akan di kabulkan",
          "tr": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) bir adam'ın ''Allahım! Ben hamdin sana mahsus olup senden başka ilah olmadığını, senin tek olup hiç bir ortağın vulunmadığını, senin bol ni'met verdiğini, göklerin ve yerin yoktan var edicisi olduğunu, azamet, hakimiyet ve sonsuz ikram sahibi olduğunu kesinlikle itiraf ederek şüphesiz senden dilerim'' diye dua ederken sesini işittive bunun üzerine şöyle buyurdu: «(And olsun ki) Şüphesiz bu adam Allah'tan İsm-i A'zam'ı istedi o İsm-i A'zam ki onunla Allah'tan istenince verir ve onunla çağrıldığı zaman dua'yı kabul buyurur.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 3859,
      "arabicNumber": 3859,
      "book": 34,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو يُوسُفَ الصَّيْدَلاَنِيُّ، مُحَمَّدُ بْنُ أَحْمَدَ الرَّقِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنِ الْفَزَارِيِّ، عَنْ أَبِي شَيْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ الْجُهَنِيِّ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الطَّاهِرِ الطَّيِّبِ الْمُبَارَكِ الأَحَبِّ إِلَيْكَ الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ وَإِذَا سُئِلْتَ بِهِ أَعْطَيْتَ وَإِذَا اسْتُرْحِمْتَ بِهِ رَحِمْتَ وَإِذَا اسْتُفْرِجْتَ بِهِ فَرَّجْتَ ‏\"‏ ‏.‏ قَالَتْ وَقَالَ ذَاتَ يَوْمٍ ‏\"‏ يَا عَائِشَةُ هَلْ عَلِمْتِ أَنَّ اللَّهَ قَدْ دَلَّنِي عَلَى الاِسْمِ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي فَعَلِّمْنِيهِ ‏.‏ قَالَ ‏\"‏ إِنَّهُ لاَ يَنْبَغِي لَكِ يَا عَائِشَةُ ‏\"‏ ‏.‏ قَالَتْ فَتَنَحَّيْتُ وَجَلَسْتُ سَاعَةً ثُمَّ قُمْتُ فَقَبَّلْتُ رَأْسَهُ ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِيهِ ‏.‏ قَالَ ‏\"‏ إِنَّهُ لاَ يَنْبَغِي لَكِ يَا عَائِشَةُ أَنْ أُعَلِّمَكِ إِنَّهُ لاَ يَنْبَغِي لَكِ أَنْ تَسْأَلِي بِهِ شَيْئًا مِنَ الدُّنْيَا ‏\"‏ ‏.‏ قَالَتْ فَقُمْتُ فَتَوَضَّأْتُ ثُمَّ صَلَّيْتُ رَكْعَتَيْنِ ثُمَّ قُلْتُ اللَّهُمَّ إِنِّي أَدْعُوكَ اللَّهَ وَأَدْعُوكَ الرَّحْمَنَ وَأَدْعُوكَ الْبَرَّ الرَّحِيمَ وَأَدْعُوكَ بِأَسْمَائِكَ الْحُسْنَى كُلِّهَا مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ أَنْ تَغْفِرَ لِي وَتَرْحَمَنِي ‏.‏ قَالَتْ فَاسْتَضْحَكَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ قَالَ ‏\"‏ إِنَّهُ لَفِي الأَسْمَاءِ الَّتِي دَعَوْتِ بِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Aishah said:\"I heard the Messenger of Allah (saas) say: 'Allahumma! Inni asa'luka bismikat-tahirit-tayyibil-mubarak al-ahabbi ilaika, alladhi idha du'ita bihi ajabta, wa idha su'ilta bihi a'taita, wa idhasturhimta bihi rahimta, wa idhastufrijta bihi farrajta (O Allah! I ask You by Your pure, good and blessed Name which is most beloved by You, which if You are called thereby You answer, and if You as asked thereby You give, if You are asked for mercy thereby You bestow mercy, and if You are asked for relief (from distress) thereby You grant relief.'\"She said: \"He said one day: 'O 'Aishah, do you know that Allah has told me the Name which, if He is called thereby, He responds?' I said: 'O Messenger of Allah, may my father and mother be ransomed for you! Teach it to me.' He said: 'You should not learn it, O 'Aishah.' So I moved aside and sat for a while, then I got up and kissed his head, then I said: 'O Messenger of Allah, teach it to me.' He said: 'You should not learn it, O 'Aishah, and I should not teach it to you, for you should not ask for any worldly things thereby.'\" She said: \"So I got up and performed ablution, then I prayed two Rak'ah, then I said: 'O Allah, I call upon Allah, and I call upon You, Ar-Rahman (the Most Gracious), and I call upon You, Al-Barr Ar-Rahim (The Most Kind, the Most Merciful), and I call upon You by all Your beautiful Names, those that I know and those that I do not know, (asking) that You forgive me and have mercy on me.' The Messenger of Allah (saas) smiled, then he said: 'It is among the names by which you called upon (Allah)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ دعا مانگتے ہوئے سنا ہے: «اللهم إني أسألك باسمك الطاهر الطيب المبارك الأحب إليك الذي إذا دعيت به أجبت وإذا سئلت به أعطيت وإذا استرحمت به رحمت وإذا استفرجت به فرجت» اے اللہ! میں تجھ سے تیرے اس پاکیزہ، مبارک اچھے نام کے واسطہ سے دعا کرتا ہوں جو تجھے زیادہ پسند ہے کہ جب اس کے ذریعہ تجھ سے دعا کی جاتی ہے، تو تو قبول فرماتا ہے، اور جب اس کے ذریعہ تجھ سے سوال کیا جاتا ہے تو تو عطا کرتا ہے، اور جب اس کے ذریعہ تجھ سے رحم طلب کی جائے تو تو رحم فرماتا ہے، اور جب مصیبت کو دور کرنے کی دعا کی جاتی ہے تو مصیبت اور تنگی کو دور کرتا ہے ، اور ایک روز آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! کیا تم جانتی ہو کہ اللہ تعالیٰ نے مجھے اپنا وہ نام بتایا ہے کہ جب بھی اس کے ذریعہ دعا کی جائے تو وہ اسے قبول کرے گا ، میں نے عرض کیا: اللہ کے رسول! میرے ماں باپ آپ پر قربان ہوں، مجھے بھی وہ نام بتا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! یہ تمہارے لیے مناسب نہیں ، میں یہ سن کر علیحدہ ہو گئی اور کچھ دیر خاموش بیٹھی رہی، پھر میں نے اٹھ کر آپ کے سر مبارک کو چوما، اور عرض کیا: اللہ کے رسول! مجھے بتا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! تمہارے لیے مناسب نہیں کہ میں تمہیں بتاؤں، اور تمہارے لیے اس اسم اعظم کے واسطہ سے دنیا کی کوئی چیز طلب کرنی مناسب نہیں، یہ سن کر میں اٹھی، وضو کیا، پھر میں نے دو رکعت نماز پڑھی، اس کے بعد میں نے یہ دعا مانگی: «اللهم إني أدعوك الله وأدعوك الرحمن وأدعوك البر الرحيم وأدعوك بأسمائك الحسنى كلها ما علمت منها وما لم أعلم أن تغفر لي وترحمني» اے اللہ! میں تجھ اللہ سے دعا کرتی ہوں، میں تجھ رحمن سے دعا کرتی ہوں، اور میں تجھ محسن و مہربان سے دعا کرتی ہوں اور میں تجھ سے تیرے تمام اسماء حسنیٰ سے دعا کرتی ہوں، جو مجھے معلوم ہوں یا نہ معلوم ہوں، یہ کہ تو مجھے بخش دے، اور مجھ پر رحم فرما ، یہ سن کر آپ صلی اللہ علیہ وسلم ہنسے اور فرمایا: اسم اعظم انہی اسماء میں ہے جس کے ذریعہ تم نے دعا مانگی ہے ۔",
          "fr": "Rapporté par 'Aishah : J’ai entendu le Messager d’Allah (ﷺ) dire : “Allahumma ! Inni asa’luka bismikat-tahirit-tayyibil-mubarak al-ahabbi ilaika, alladhi idha du’ita bihi ajabta, wa idha su’ilta bihi a’taita, wa idhasturhimta bihi rahimta, wa idhastufrijta bihi farrajta (Ô Allah ! Je Te demande par Ton Nom pur, bon, béni, le plus aimé de Toi, par lequel si Tu es invoqué Tu réponds, si on Te demande Tu donnes, si on Te demande miséricorde Tu fais miséricorde, et si on Te demande soulagement Tu accordes le soulagement).” Elle a dit : Il a dit un jour : “Ô 'Aishah, sais-tu qu’Allah m’a appris le Nom par lequel, si on L’invoque, Il répond ?” J’ai dit : “Ô Messager d’Allah, que mon père et ma mère soient sacrifiés pour toi ! Enseigne-le-moi.” Il a dit : “Tu ne dois pas l’apprendre, ô 'Aishah.” Alors je me suis éloignée et je me suis assise un moment, puis je me suis levée, j’ai embrassé sa tête et j’ai dit : “Ô Messager d’Allah, enseigne-le-moi.” Il a dit : “Tu ne dois pas l’apprendre, ô 'Aishah, et je ne dois pas te l’enseigner, car tu ne dois pas demander des choses de ce bas-monde avec ce Nom.” Elle a dit : “Alors je me suis levée, j’ai fait mes ablutions, puis j’ai prié deux unités de prière, puis j’ai dit : ‘Ô Allah, j’invoque Allah, et je T’invoque, Ar-Rahman (le Tout Miséricordieux), et je T’invoque, Al-Barr Ar-Rahim (Le Très Bon, le Très Miséricordieux), et je T’invoque par tous Tes beaux Noms, ceux que je connais et ceux que je ne connais pas, en demandant que Tu me pardonnes et que Tu me fasses miséricorde.’ Le Messager d’Allah (ﷺ) a souri, puis il a dit : “C’est parmi les Noms par lesquels tu as invoqué (Allah).”",
          "id": "Telah menceritakan kepada kami [Abu Yusuf As Shaidalani Muhammad bin Ahmad Ar raqqi] telah menceritakan kepada kami [Muhammad bin Salamah] da ri [Al Fazari] dari [Abu Syaibah] dari [Abdullah bin 'Ukaim Al Juhani] dari ['Aisyah] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam mengucapkan: \"Ya Allah, sesungguhnya aku meminta kepada-Mu dengan nama-Mu Yang Suci, yang Indah, diberkahi serta lebih Engkau cintai, yang apabila Engkau diseru dengan-Nya, Engkau akan mengabulkan, dan apabila Engkau diminta dengan-Nya Engkau akan memberi, dan apabila Engkau dimintai rahmat dengan-Nya Engkau akan merahmati dan apabila Engkau dimintai jalan keluar dengan-Nya Engkau akan memberi jalan keluar.\" 'Aisyah berkata; Suatu hari beliau bersabda: \"Wahai 'Aisyah, apakah kamu tahu bahwa Allah telah menunjukkan kepadaku satu nama yang apabila diseru dengannya Dia akan mengabulkan?\" 'Aisyah berkata; Jawabku; \"Wahai Rasulullah, demi ayahku, anda dan ibuku, maka ajarkanlah ia kepadaku.\" Beliau bersabda: \"Sesungguhnya ia tidak layak bagimu wahai 'Aisyah.\" 'Aisyah berkata; maka aku menyingkir dan duduk sejenak kemudian aku bangun dan membalik kepalanya, kemudian aku berkata; \"Wahai Rosulullah, ajarkanlah kepadaku.\" Beliau bersabda: \"Sesungguhnya ia tidak layak bagimu wahai 'Aisyah yaitu untuk mengajarkan kepadamu, sesungguhnya ia tidak layak bagimu jika dengannya kamu meminta sesuatu dari dunia.\" 'Aisyah berkata; \"Maka aku bangun dan berwudlu` kemudian shalat dua raka'at dan berdo'a; \"Ya Allah, sesungguhnya aku berdo'a kepada-Mu ya Allah, aku berdo'a kepada-Mu ya Rahman, aku berdo'a kepada-Mu wahai yang Maha Baik lagi Maha Penyayang, dan aku berdo'a kepada-Mu dengan nama-nama-Mu yang indah semuanya, baik yang aku ketahui dan yang tidak aku ketahui agar Engkau mengampuniku dan merahmatiku.\" 'Aisyah berkata; Maka Rasulullah shallallahu 'alaihi wasallam mentertawakanku dan bersabda: \"Sesungguhnya itu terdapat di dalam asma'-asma' yang Engkau berdo'a dengannya tadi",
          "tr": "Aişe (r.anha)'dan şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in: «Allahım! Benin senin pak, güzel, mubarek ve zatına en sevimli ismin ile şüphesiz senden dilerim, o isim ki onunla çağrıldığın zaman icabet edersin, onunla senden istendiği zaman verirsin, onunla senden, onunla senden rahmet taleb edildiği zaman rahmet eylersin ve sıkıntıdan kurtulmak için onunla senden yardım dilediği zaman sıkıntıdan kurtarırsın.» diye dua ederken sesini işittim. Aişe demiştir ki: Ve Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) bir gün: «Ya Aişe Allah'ın hangi isimle çağrıldığı zaman duayı kabul buyuracağını bana gösterip bildirdiğini bilirmisin?» buyurdu. Aişe demiştir ki: Ben: Ya Resulallah! Babam anam sana feda olsun O İsmi bana öğret, dedim. O: «Ya Aişe O İsmin öğretilmesi sana uygun değildir.» buyurdu. Aişe demiştir ki: Bunun üzerine ben uzaklaşıp bir saat oturdum. Sonra kalktım ve O'nun başını öptüm. Daha sonra: Ya Resulallah! O İsmi bana öğret, diye ricada bulundum. O: «Ya Aişe O İsmin sana öğretmem sana uygun değildir. Çünkü şüphesiz senin O İsimle dünyalık bir şey istemen senin için uygun olmaz.» buyurdu. Aişe demiştir ki: Bunun üzerine ben de kalkıp abdest aldım ve iki rek'at namaz kıldıktan sonra: Allahım! Şüphesiz ben seni Allah, diye çağırırım, er-Rahman diye çağırırım, el-Berr, er-Rahim, diye çağırırım ve seni bildiğim ve bilemediğim Esma-ı Hüsna'nın hepsiyle çağırırım ki beni mağfiret edesin ve bana rahmet edesin, diyerek dua ve dilekte bulundum. Aişe demiştir ki: Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) güldü. Sonra buyurdu ki: «Şüphesiz O İsim senin duada andığın isimler içindedir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi hakkında konuşulur, RAvi Abdullah bin Ukeym'i, el-Hatib güvenilir kabul ederek sahabller arasında saymıştır. Fakat Nebi (s.a.v.)'den hadis dinlediği sağlıklı bir rivayetle sabit değildir. Ravi Ebu Şeybe'ye gelince; Ben onu ne yeren ne de güvenilir sayan kimseyi görmedim. senedln kalan ravileri güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 3860,
      "arabicNumber": 3860,
      "book": 34,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلاَّ وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Messenger of Allah (saas) said: \"Allah has ninety-nine Names, one hundred less one. Whoever counts them will enter Paradise",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے نناوے نام ہیں ایک کم سو، جو انہیں یاد ( حفظ ) کرے ۱؎ تو وہ شخص جنت میں داخل ہو گا ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a dit : « Allah a quatre-vingt-dix-neuf Noms, cent moins un. Celui qui les énumère entrera au Paradis. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam: \"Sesungguhnya Allah memiliki sembilan puluh sembilan nama, seratus kurang satu, maka barangsiapa menghitungnya (menghafalnya) akan masuk surga",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu demiştir: «Şüphesiz Allahın doksan dokuz (yani) yüz eksi bir ismi vardır. Kim bu isimleri (tamamen) sayarsa cennet'e girer.» Diğer tahric edenler: Buhari, Müslim, Tirmizi, Nesai"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 3861,
      "arabicNumber": 3861,
      "book": 34,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الصَّنْعَانِيُّ، حَدَّثَنَا أَبُو الْمُنْذِرِ، زُهَيْرُ بْنُ مُحَمَّدٍ التَّمِيمِيُّ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ الأَعْرَجُ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلاَّ وَاحِدًا إِنَّهُ وِتْرٌ يُحِبُّ الْوِتْرَ مَنْ حَفِظَهَا دَخَلَ الْجَنَّةَ وَهِيَ اللَّهُ الْوَاحِدُ الصَّمَدُ الأَوَّلُ الآخِرُ الظَّاهِرُ الْبَاطِنُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ الْمَلِكُ الْحَقُّ السَّلاَمُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ الرَّحْمَنُ الرَّحِيمُ اللَّطِيفُ الْخَبِيرُ السَّمِيعُ الْبَصِيرُ الْعَلِيمُ الْعَظِيمُ الْبَارُّ الْمُتَعَالِ الْجَلِيلُ الْجَمِيلُ الْحَىُّ الْقَيُّومُ الْقَادِرُ الْقَاهِرُ الْعَلِيُّ الْحَكِيمُ الْقَرِيبُ الْمُجِيبُ الْغَنِيُّ الْوَهَّابُ الْوَدُودُ الشَّكُورُ الْمَاجِدُ الْوَاجِدُ الْوَالِي الرَّاشِدُ الْعَفُوُّ الْغَفُورُ الْحَلِيمُ الْكَرِيمُ التَّوَّابُ الرَّبُّ الْمَجِيدُ الْوَلِيُّ الشَّهِيدُ الْمُبِينُ الْبُرْهَانُ الرَّءُوفُ الرَّحِيمُ الْمُبْدِئُ الْمُعِيدُ الْبَاعِثُ الْوَارِثُ الْقَوِيُّ الشَّدِيدُ الضَّارُّ النَّافِعُ الْبَاقِي الْوَاقِي الْخَافِضُ الرَّافِعُ الْقَابِضُ الْبَاسِطُ الْمُعِزُّ الْمُذِلُّ الْمُقْسِطُ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ الْقَائِمُ الدَّائِمُ الْحَافِظُ الْوَكِيلُ الْفَاطِرُ السَّامِعُ الْمُعْطِي الْمُحْيِي الْمُمِيتُ الْمَانِعُ الْجَامِعُ الْهَادِي الْكَافِي الأَبَدُ الْعَالِمُ الصَّادِقُ النُّورُ الْمُنِيرُ التَّامُّ الْقَدِيمُ الْوِتْرُ الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ فَبَلَغَنَا عَنْ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ أَوَّلَهَا يُفْتَحُ بِقَوْلِ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ لاَ إِلَهَ إِلاَّ اللَّهُ لَهُ الأَسْمَاءُ الْحُسْنَى ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Messenger of Allah (saas) said: \"Allah has ninety-nine names, one hundred less one, for He is One and loves the odd (numbered). Whoever learns them will enter Paradise. They are: Allah, Al-Wahid (the One), As-Samad (the Self-Sufficient Master who all creatures need, He neither eats nor drinks), Al-Awwal (the First), Al-Akhir (the Last), Az-Zahir (the Most High), Al-Batin (the Most Near), Al-Khaliq (the Creator), Al-Bari (the Inventor of all things), Al-Musawwir (the Bestower of forms), Al-Malik (the King), Al-Haqq (the Truth), As-Salam (the One free from all defects), Al-Mu'min (the Giver of security), Al-Muhaymin (the Watcher over His creatures), Al-'Aziz (the All-Mighty), Al-Jabbar (the Compeller), Al-Mutakabbir (the Supreme), Ar-Rahman (the Most Gracious), Ar-Rahim (the Most Merciful), Al-Latif (the Most Subtle and Courteous), Al-Khabir (the Aware), As-Sami' (the Hearing), Al-Basir (the Seeing), Al-'Alim (the All-Knowing), Al-'Azim (the Most Great), Al-Barr (the Source of goodness), Al-Muta'al (the Most Exalted), Al-Jalil (the Sublime One), Al-Jamil (the Beautiful), Al-Hayy (the Ever-Living), Al-Qayyum (the One Who sustains and protects all that exists), Al-Qadir (the Able), Al-Qahir (the Irrestible), Al-'Ali (the Exalted), Al-Hakim (the Most Wise), Al-Qarib (the Ever-Near), Al-Mujib (the Responsive), Al-Ghani (the Self-Sufficient), Al-Wahhab (the Bestower), Al-Wadud (the Loving), Ash-Shakur (the Appreciative), Al-Majid (the Most Gentle), Al-Wajid (the Patron), Al-Wali (the Governor), Al-Rashid (the Guide), Al-'Afuw (the Pardoner), Al-Ghafur (the Forgiver), Al-Halim (the Forbearing One), Al-Karim (the Most Generous), At-Tawwab (the Acceptor of Repentance), Ar-Rabb (the Lord and Cherisher), Al-Majid (the Most Glorious), Al-Wali (the Helper), Ash-Shahid (the Witness), Al-Mubin (the Manifest), Al-Burhan (the Proof), Ar-Ra'uf (the Compassionate), Ar-Rahim (the Most Merciful), Al-Mubdi' (the Originator), Al-Mu'id (the Restorer), Al-Ba'ith (the Resurrector), Al-Warith (the Supreme Inheritor), Al-Qawi (the All-Strong), Ash-Shadid (the Severe), Ad-Darr (the One Who harms), An-Nafi' (the One Who benefits), Al-Baqi' (the Everlasting), Al-Waqi (the Protector), Al-Khafid (the Humble), Ar-Rafi' (the Exalter), Al-Qabid (the Retainer), Al-Basit (the Expander), Al-Mu'izz (the Honorer), Al-Mudhill (the Humiliator), Al-Muqsit (the Equitable), Ar-Razzaq (the Providor), Dhul-Quwwah (the Powerful), Al-Matin (the Most Strong), Al-Qa'im (the Firm), Ad-Da'im (the Eternal), Al-Hafiz (the Guardian), Al-Wakil (the Trustee), Al-Fatir (the Originator of creation), As-Sami' (the Hearer), Al-Mu'ti (the Giver), Al-Muhyi (the Giver of life), Al-Mumit (the Giver of death), Al-Mani' (the Withholder), Al-Jami' (the Gatherer), Al-Hadi (the Guide), Al-Kafi (the Sufficient), Al-Abad (the Eternal), Al-'Alim (the Knower), As-Sadiq (the Truthful), An-Nur (the Light), Al-Munir (the Giver of light), At-Tamm (the Perfect), Al-Qadim (the Earlier), Al-Witr (the One), Al-Ahad (the Lone), As-Samad [(the Self-sufficient Master, Who all creatures need, (He neither eats no drinks)]. He begets not, nor was He begotten. And there is none co-equal or comparable unto him.\"(One of the narrators) Zuhair said: We heard from more than one of the scholars that the first of these (names) should begin after saying: La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, bi yadihil-khair wa Huwa 'ala kulli shay-in Qadir, la ilaha illallahu lahul-asma'ul-husna [None has the right to be worshipped but Allah, with no partner or associate. His is the dominion and all praise is His. In His Hand is (all) goodness, and He is Able to do all things, none has the right to be worshipped but Allah, and His are the (Most) Beautiful Names",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بیشک اللہ تعالیٰ کے ننانوے نام ہیں ایک کم سو، چونکہ اللہ تعالیٰ طاق ہے اس لیے طاق کو پسند کرتا ہے جو انہیں یاد کرے گا وہ جنت میں داخل ہو گا، اور وہ ننانوے نام یہ ہیں: «الله» اسم ذات سب ناموں سے اشرف اور اعلیٰ ، «الواحد» اکیلا، ایکتا ، «الصمد» بے نیاز ، «الأول» پہلا ، «الآخر» پچھلا ، «الظاهر» ظاہر ، «الباطن» باطن ، «الخالق» پیدا کرنے والا ، «البارئ» بنانے والا ، «المصور» صورت بنانے والا ، «الملك» بادشاہ ، «الحق» سچا ، «السلام» سلامتی دینے والا ، «المؤمن» یقین والا ، «المهيمن» نگہبان ، «العزيز» غالب ، «الجبار» تسلط والا ، «المتكبر» بڑائی والا ، «الرحمن» بہت رحم کرنے والا ،«الرحيم» مہربان ، «اللطيف» بندوں پر شفقت کرنے والا ، «الخبير» خبر رکھنے والا ، «السميع» سننے والا ، «البصير» دیکھنے والا ،«العليم» جاننے والا ، «العظيم» بزرگی والا ، «البار» بھلائی والا ، «المتعال» برتر ، «الجليل» بزرگ ، «الجميل» خوبصورت ،«الحي» زندہ ، «القيوم» قائم رہنے اور قائم رکھنے والا ، «القادر» قدرت والا ، «القاهر» قہر والا ، «العلي» اونچا ، «الحكيم» حکمت والا ، «القريب» نزدیک ، «المجيب» قبول کرنے والا ، «الغني» تونگر بے نیاز ، «الوهاب» بہت دینے والا ، «الودود» بہت چاہنے والا ، «الشكور» قدر کرنے والا ، «الماجد» بزرگی والا ، «الواجد» پانے والا ، «الوالي» مالک مختار، حکومت کرنے والا ، «الراشد» خیر والا ، «العفو» بہت معاف کرنے والا ، «الغفور» بہت بخشنے والا ، «الحليم» بردبار ، «الكريم» کرم والا ، «التواب» توبہ قبول کرنے والا ، «الرب» پالنے والا ، «المجيد» بزرگی والا ، «الولي» مددگار و محافظ ، «الشهيد» نگراں، حاضر ، «المبين» ظاہر کرنے والا ،«البرهان» دلیل ، «الرءوف» شفقت والا ، «الرحيم» مہربان ، «المبدئ» پہلے پہل پیدا کرنے والا ، «المعيد» دوبارہ پیدا کرنے والا ،«الباعث» زندہ کر کے اٹھانے والا ، «الوارث» وارث ، «القوي» ( قوی ) زور آور ، «الشديد» سخت ، «الضار» نقصان پہنچانے والا ،«النافع» نفع دینے والا ، «الباقي» قائم ، «الواقي» بچانے والا ، «الخافض» پست کرنے والا ، «الرافع» اونچا کرنے والا ، «القابض» روکنے والا ، «الباسط» چھوڑ دینے والا، پھیلانے والا ، «المعز» عزت دینے والا ، «المذل» ذلت دینے والا ، «المقسط» منصف ،«الرزاق» روزی دینے والا ، «ذو القوة» طاقت والا ، «المتين» مضبوط ، «القائم» ہمیشہ رہنے والا ، «الدائم» ہمیشگی والا ، «الحافظ» بچانے والا ، «الوكيل» کارساز ، «الفاطر» پیدا کرنے والا ، «السامع» سننے والا ، «المعطي» دینے والا ، «المحيي» زندہ کرنے والا ، «المميت» مارنے والا ، «المانع» روکنے والا ، «الجامع» جمع کرنے والا ، «الهادي» ( رہبری ہادی ) راہ بنانے والا ، «الكافي» کفایت کرنے والا ، «الأبد» ہمیشہ برقرار ، «العالم» ( عالم ) جاننے والا ، «الصادق» سچا ، «النور» روشن، ظاہر ، «المنير» روشن کرنے والا ،«التام» مکمل ، «القديم» ہمیشہ رہنے والا ، «الوتر» طاق ، «الأحد» اکیلا ، «الصمد» بے نیاز ، «الذي لم يلد ولم يولد ولم يكن له كفوا أحد» جس نے نہ جنا ہے نہ وہ جنا گیا ہے، اور اس کا کوئی ہمسر نہیں ہے ۔ زہیر کہتے ہیں: ہمیں بہت سے اہل علم سے یہ بات معلوم ہوئی ہے کہ ان ناموں کی ابتداء اس قول سے کی جاتی ہے: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد بيده الخير وهو على كل شيء قدير لا إله إلا الله له الأسماء الحسنى» اللہ کے علاوہ کوئی معبود برحق نہیں، وہ اکیلا ہے اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے، اسی کے لیے ہر طرح کی تعریف ہے، اسی کے ہاتھ میں خیر ہے اور وہ ہر چیز پر قدرت والا ہے، اللہ کے علاوہ کوئی معبود برحق نہیں اسی کے لیے اچھے نام ہیں ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a dit : « Allah a quatre-vingt-dix-neuf Noms, cent moins un, car Il est Unique et Il aime les nombres impairs. Celui qui les apprend entrera au Paradis. Ce sont : Allah, Al-Wahid (l’Unique), As-Samad (le Maître absolu dont toutes les créatures ont besoin, Il ne mange ni ne boit), Al-Awwal (le Premier), Al-Akhir (le Dernier), Az-Zahir (le Très-Haut), Al-Batin (le Très-Proche), Al-Khaliq (le Créateur), Al-Bari (l’Inventeur de toutes choses), Al-Musawwir (Celui qui donne la forme), Al-Malik (le Roi), Al-Haqq (la Vérité), As-Salam (Celui qui est exempt de tout défaut), Al-Mu’min (Celui qui accorde la sécurité), Al-Muhaymin (le Gardien), Al-‘Aziz (le Tout-Puissant), Al-Jabbar (le Contraignant), Al-Mutakabbir (le Suprême), Ar-Rahman (le Tout Miséricordieux), Ar-Rahim (le Très Miséricordieux), Al-Latif (le Subtil et Courtois), Al-Khabir (le Bien Informé), As-Sami’ (Celui qui entend tout), Al-Basir (Celui qui voit tout), Al-‘Alim (l’Omniscient), Al-‘Azim (le Très Grand), Al-Barr (la Source de bonté), Al-Muta’al (le Très-Élevé), Al-Jalil (le Sublime), Al-Jamil (le Beau), Al-Hayy (le Vivant), Al-Qayyum (Celui qui soutient et protège tout), Al-Qadir (le Capable), Al-Qahir (l’Irrésistible), Al-‘Ali (l’Élevé), Al-Hakim (le Sage), Al-Qarib (le Proche), Al-Mujib (Celui qui répond), Al-Ghani (le Suffisant), Al-Wahhab (le Donateur), Al-Wadud (le Bien-Aimant), Ash-Shakur (le Reconnaissant), Al-Majid (le Très Noble), Al-Wajid (le Patron), Al-Wali (le Gouverneur), Al-Rashid (le Guide), Al-‘Afuw (le Pardonneur), Al-Ghafur (le Pardonneur), Al-Halim (le Clément), Al-Karim (le Généreux), At-Tawwab (Celui qui accepte le repentir), Ar-Rabb (le Seigneur et Protecteur), Al-Majid (le Glorieux), Al-Wali (l’Aide), Ash-Shahid (le Témoin), Al-Mubin (le Manifeste), Al-Burhan (la Preuve), Ar-Ra’uf (le Compatissant), Ar-Rahim (le Très Miséricordieux), Al-Mubdi’ (l’Initiateur), Al-Mu’id (le Restaureur), Al-Ba’ith (le Ressusciteur), Al-Warith (l’Héritier Suprême), Al-Qawi (le Très Fort), Ash-Shadid (le Sévère), Ad-Darr (Celui qui nuit), An-Nafi’ (Celui qui profite), Al-Baqi’ (le Permanent), Al-Waqi (le Protecteur), Al-Khafid (l’Abaisseur), Ar-Rafi’ (l’Éleveur), Al-Qabid (le Reteneur), Al-Basit (l’Étendeur), Al-Mu’izz (Celui qui honore), Al-Mudhill (Celui qui humilie), Al-Muqsit (l’Équitable), Ar-Razzaq (le Pourvoyeur), Dhul-Quwwah (le Puissant), Al-Matin (le Très Fort), Al-Qa’im (le Ferme), Ad-Da’im (l’Éternel), Al-Hafiz (le Gardien), Al-Wakil (le Garant), Al-Fatir (l’Initiateur de la création), As-Sami’ (Celui qui entend), Al-Mu’ti (le Donneur), Al-Muhyi (Celui qui donne la vie), Al-Mumit (Celui qui donne la mort), Al-Mani’ (Celui qui retient), Al-Jami’ (Celui qui rassemble), Al-Hadi (le Guide), Al-Kafi (le Suffisant), Al-Abad (l’Éternel), Al-‘Alim (le Savant), As-Sadiq (le Véridique), An-Nur (la Lumière), Al-Munir (Celui qui donne la lumière), At-Tamm (le Parfait), Al-Qadim (l’Ancien), Al-Witr (l’Unique), Al-Ahad (le Seul), As-Samad [(le Maître absolu dont toutes les créatures ont besoin, Il ne mange ni ne boit)]. Il n’engendre pas et n’a pas été engendré. Et nul n’est égal ou comparable à Lui.” (Un des rapporteurs) Zuhair a dit : Nous avons entendu de plusieurs savants que le début de ces (Noms) doit commencer après avoir dit : La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, bi yadihil-khair wa Huwa ‘ala kulli shay-in Qadir, la ilaha illallahu lahul-asma’ul-husna [Nul n’a le droit d’être adoré sauf Allah, sans associé. À Lui la royauté et la louange. Dans Sa main est tout bien, et Il est capable de toute chose, nul n’a le droit d’être adoré sauf Allah, et à Lui appartiennent les plus beaux Noms]",
          "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Abdul Malik bin Muhammad As Shan'ani] telah menceritakan kepada kami [Abu Al Mundzir Zuhair bin Muhammad At Taimi] telah menceritakan kepada kami [Musa bin 'Uqbah] telah menceritakan kepadaku [Abdurrahman Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memiliki sembilan puluh sembilan nama, seratus kurang satu. Sesungguhnya Dia Maha ganjil serta mencintai sesuantu yang genjil. Barangsiapa menghafalnya, maka ia akan masuk surga. Yaitu; Allah, Al Ahad, As Shamad, Al Awwal. Al Akhir, Ad Dlahir, Al bathin, Al Khaliq, AL Bari`, Al Mushawir, Al Malik, Al Haq, As Salam, Al Mu`min, Al Muhaimin, Al Aziz, Al Jabbar, Al Mutakabbir, Ar Rahman, Ar Rahim, Al Lathif, Al Khabir, As Sami', Al Bashir, Al 'Alim, Al 'Adzim, Al Baar, Al Muta'al, Al Jalil, Al Jamil, Al Hayyu, Al Qayyum, Al Qadir, Al Qahir, Al 'Ali, Al Hakim, Al Qarib, Al Mujib, Al Ghaniy, Al Wahhab, Al Wadud, As Syakur, Al Majid, AL Wajid, Al Wali, Ar Rasyid, Al 'Afwu, Al ghafur, Al Halim, Al Karim, At Tawwab, Ar Rabb, Al Majid, Al Wali, As Syahid, Al Mubin, Al Burhan, Ar Ra`uf Ar Rahim, Al mubdi`, Al Mu'id, Al Ba'its, Al Warits, Al Qawi, As Syadid, Adl Dlar, An Nafi', Al Baqi, Al Waqi, Al Khafidl, Ar Rafi', Al Qabidl, Al Basith, Al Mu'iz, Al Mudzil, Al Muqsith, Ar Razaq, Dzu Al Quwwatil Matin, Al Qa`im, Ad da`im, Al Hafidz, Al Wakil, Al Fathir, As Sami', Al Mu'thi, Al Muhyi, Al Mumit, Al Mani', Al Jami', Al Haadi, Al Kaafi, Al Abad, Al 'Alim, As Shadiq, An Nuur, Al Munir, At Taam, Al Qadim, Al Witru, Al Ahad, As Shamad alladzi lam yalid walam yuulad walam yakul lahu kufuwan ahad.\" Zuhair berkata; \"telah menyampaikan kepadaku tidak cuma satu orang dari ahli ilmu, bahwa pertama-tama di awali dengan kalimat; Tidak ada ilah selain Allah, dzat satu-satunya yang tidak ada sekutu bagi-Nya, dzat yang memiliki kerajaan, dan bagi-Nya segala pujian, di tangan-Nya lah kebaikan dan Dia adalah dzat yang terhadap segala sesuatu berkuasa, tidak ada ilah (yang berhak di sembah) kecuali Allah, Dialah dzat yang memiliki nama-nama yang bagus",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Şüphesiz Allahın 99 (yani) yüzden bir eksik ismi vardır. Allah, şüphesiz tektir, tek olanı sever.Kim O 99 ismi hıfzedip ezberlerse cennet'e girer. O isimler: ALLAH, EL-VAHİD, ES-SAMED, EL-EVVEL, EL-AHİR, EZ-ZAHİR, EL-BATIN, EL-HALIK, EL-BARİ, EL-MUSAVVİR, EL-MELİK, EL-HAKK, ES-SELAM, EL-MU'MİN, EL-MUHAYMİN, EL-AZİZ, EL-CEBBAR, EL-MÜTEKEBBİR, ER-RAHMAN, ER-RAHİM, EL-LATİF, EL-HABİR, ES-SEMİ', EL-BASİR, EL-ALİM, EL-AZİM, EL-BARR, EL-MÜTEAL, EL-CELİL, EL-CEMİL, EL-HAYY, EL-KAYYİM, EL-KADİR, ELKAHİR, EL-ALİ, EL-HAKİM, EL-KARİB, EL-MUCİB, ELĞANİ, EL-VAHHAB,EL-VEDUD, EŞ-ŞEKUR, EL-MUCİD, EL-VACİD, EL-VALİ, ER-RAŞİD, EL-AFUVV, ELĞAFUR, EL-HALİM, EL-KERİM, ET-TEVVAB, ER-RABB, EL-MECİD, EL-VELİYY, EŞ-ŞEHİD, EL-MUBİN, EL-BURHAN, ER-RAUF, ER-RAHİM, EL-MUBDİ, EL-MUİD, EL-BAİS,, EL-VARİS, EL-KAVİYY, EŞ-ŞEDİD, ED-DARR, EN-NAFİ', EL-BAKİ, EL-VAKİ, EL-HAFID, ER-RAFİ', EL-KABID, , EL-BASİT, EL-MUİZZ, EL-MUZİLL, EL-MUKSIT, ER-REZZAK, ZU'L-KUVVE, EL-METİN, EL-KAİM, ED-DAİM, EL-HAFIZ, EL-VEKİL, EL-FATIR, ES-SAMİ', EL-MU'Tİ, EL-MUHYİ, EL-MUMİT, EL-MANİ, EL-CAMİ, EL-HADİ, EL-KAFİ, EL-EBED, EL-ALİM, ES-SADIK, EN-NUR, EL-MÜNİR, ET-TAMM, EL-KADİM, EL-VİTR, EL-AHED, ES-SAMED. Öyle Allah ki doğurmadı, doğurulmadı ve hiçbir kimse O'nun dengi olamaz. Zübeyr demiştir ki: Bana bir çok ilim adamları tarafından ulaştığına göre Esma-i Hüsna'nın evveline şu zikirle başlanır. La ilahe illallahu vahdehu la şerike lehu. Lehu'l-mulk ve lehu'l-hamd biyedihi'l-hayru ve huve ala kulli şey'in kadir. La ilahe illallah. Lehu'l-Esmau'l-Husna. » Meali: Allah'tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O'nundur, hamd de O'nundur. Hayır ancak O'nın elindedir ve O her şey'e kadirdir. Allah'tan başka ilah yoktur. Esma-i Hüsna onadır. Not: Zevaid'de şöyle denilmiştir: İbn-i Mace ve Tirmizi'den başka. altı imamdan hiçbirisi Allah'ın Esma-i Husna'sını ne bu vecihle ne de başka türlü tadad etmemiştir (yani sayarak rivayet etmemiştir). İbn-i Mace ile Tirmizi'nin saydıkları isimlerin sırasında takdim ve tehir vardır. Bu konuya dair senedlerin en sıhhatlisi Tirmizi'ninkidir, İbn-i Mace'nin senedi, ravi Abdülmelik bin Muhammed'in Zayıflığı sebebiyle zayıf bir seneddir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 3862,
      "arabicNumber": 3862,
      "book": 34,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي جَعْفَرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ ثَلاَثُ دَعَوَاتٍ يُسْتَجَابُ لَهُنَّ لاَ شَكَّ فِيهِنَّ دَعْوَةُ الْمَظْلُومِ وَدَعْوَةُ الْمُسَافِرِ وَدَعْوَةُ الْوَالِدِ لِوَلَدِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah that :the Messenger of Allah (saas) said: \"There are three supplications that will undoubtedly be answered: the supplication of one who has been wronged; the supplication of the traveler; and the supplication of a father for his child",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تین دعائیں ہیں جن کی قبولیت میں کوئی شک نہیں: مظلوم کی دعا، مسافر کی دعا، والد ( اور والدہ ) کی دعا اپنی اولاد کے حق میں ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a dit : « Il y a trois invocations qui seront sûrement exaucées : l’invocation de celui qui subit une injustice, l’invocation du voyageur et l’invocation d’un père pour son enfant. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdullah bin Bakr As Sahmi] dari [Hisyam Ad Dastuwa`i] dari [Yahya bin Abu Katsir] dari [Abu Ja'far] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga macam do`a yang akan di kabulkan dan tidak ada keraguan pada ketiganya, yaitu; do'a orang yang di dzalimi, do'anya orang musafir dan do'a orang tua kepada anaknya",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Üç (çeşid) dua kabul olunur, onlar(ın kabul olunmasın) da şüphe yoktur: Mazlumun duası, misafir'in duası ve baba'nın çocuğuna duası.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 3863,
      "arabicNumber": 3863,
      "book": 34,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو سَلَمَةَ، حَدَّثَتْنَا حَبَابَةُ ابْنَةُ عَجْلاَنَ، عَنْ أُمِّهَا أُمِّ حَفْصٍ، عَنْ صَفِيَّةَ بِنْتِ جَرِيرٍ، عَنْ أُمِّ حَكِيمٍ بِنْتِ وَدَاعٍ الْخُزَاعِيَّةِ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ دُعَاءُ الْوَالِدِ يُفْضِي إِلَى الْحِجَابِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Umm Haim bint Wadda' Al-Khuza'iyyah said:\"I heard the Messenger of Allah (saas) say: 'The supplication of a father reaches the Veil (i.e. the place of repentance)",
          "ur": "ام حکیم بنت وداع خزاعیہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: والد ( اور والدہ ) کی دعا حجاب الٰہی ( مقام قبولیت ) تک پہنچتی ہے ۔",
          "fr": "Rapporté par Umm Haim bint Wadda' Al-Khuza'iyyah : J’ai entendu le Messager d’Allah (ﷺ) dire : « L’invocation d’un père atteint le Voile (c’est-à-dire le lieu du repentir). »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Abu Salamah] telah menceritakan kepada kami [Hubabah putrinya 'Ajlan] dari [ibunya yaitu Ummu Hafsh] dari [Shafiyah binti Jarir] dari [Ummu Hakim binti Wadda' al Khuza'iyyah] dia berkata; \"Aku mendengar Rosulullah shallallahu 'alaihi wasallam bersabda: \"Do'a orang tua itu membuka hijab",
          "tr": "Ümmü Hakim bint-i Vedda el-Huzaiyye (r.a.)'den şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şu buyruğu işittim: «Babanın duası kabul makamına ulaşır.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi söz götürür. Çünkü senedde bulunan kadınlann hiçbirini ne cerh eden, ne de güvenilir sayan kimseyi görmedim. Ravi Ebu Selerne, et.-Tebuzkl olan zattır. Adı da Musa bin İsmail'dir, güvenilir bir zattır. Onun ravisi de böyledir. Diğer tahric: Bu hadis'in Ebu Hureyre rivayetini Tirmizi ve Ebu Davud tahric etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 3864,
      "arabicNumber": 3864,
      "book": 34,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنْبَأَنَا سَعِيدٌ الْجُرَيْرِيُّ، عَنْ أَبِي نَعَامَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ، سَمِعَ ابْنَهُ، يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْقَصْرَ الأَبْيَضَ عَنْ يَمِينِ الْجَنَّةِ، إِذَا دَخَلْتُهَا ‏.‏ فَقَالَ أَىْ بُنَىَّ سَلِ اللَّهَ الْجَنَّةَ وَعُذْ بِهِ مِنَ النَّارِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ سَيَكُونُ قَوْمٌ يَعْتَدُونَ فِي الدُّعَاءِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Na'amah that :'Abdullah bin Mughaffal heard his son say: \"O Allah, I ask You for the white palace on the right-hand side of Paradise, when I enter it.\" He said: \"O my son, ask Allah for Paradise and seek refuge with Him from Hell, for I heard the Messenger of Allah (saas) say: 'There will be people who will transgress in supplication",
          "ur": "ابونعامہ (قیس بن عبایہ) سے روایت ہے کہ عبداللہ بن مغفل رضی اللہ عنہ نے اپنے بیٹے کو یہ دعا مانگتے سنا: «اللهم إني أسألك القصر الأبيض عن يمين الجنة إذا دخلتها» اللہ! جب میں جنت میں جاؤں تو مجھے جنت کی دائیں جانب سفید محل عطا فرما ، تو انہوں نے کہا: میرے بیٹے! اللہ تعالیٰ سے جنت کا سوال کرو اور جہنم سے پناہ مانگو، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: عنقریب کچھ ایسے لوگ پیدا ہوں گے جو دعا میں حد سے آگے بڑھ جائیں گے ۱؎۔",
          "fr": "Rapporté par Abu Na'amah : 'Abdullah bin Mughaffal a entendu son fils dire : “Ô Allah, je Te demande le palais blanc à droite du Paradis, quand j’y entrerai.” Il lui a dit : “Ô mon fils, demande à Allah le Paradis et cherche refuge auprès de Lui contre l’Enfer, car j’ai entendu le Messager d’Allah (ﷺ) dire : ‘Il y aura des gens qui dépasseront les limites dans leurs invocations.’”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah memberitakan kepada kami [Sa'id Al Jurairi] dari [Abu Na'amah] bahwa [Abdullah bin Mughaffal] mendengar anaknya mengatakan; \"Ya Allah, aku memohon kepada-Mu istana putih yang berada di sisi kanan surga jika saya masuk ke dalamnya.\" Maka Abdullah bin Mughffal berkata; \"Wahai anakku, mohonlah kepada Allah surga, dan berlindunglah kepada-Nya dari api neraka. Karena sesungguhnya aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan ada suatu kaum yang berdo'a secara berlebih-lebihan",
          "tr": "Ebu Naame (r.a.)'den rivayet edildiğine göre: Abdullah bin Muğaffel (r.a.), oğlunun: ''Allahım! Ben cennet'e girince senden cennet'in sağ tarafından beyaz köşk isterim.'' diye dua ettiğini işitti. Bunun üzerine: Ey oğulcuğum Allah'tan cennet iste ve cehennem ateşinden O'na sığın. Çünkü ben Resulullah (Sallallahu Aleyhi ve Sellem)'den şu buyruğu işittim, dedi: «Dua'da haddi tecavüz eden bir kavim olacaktır.» Bu hadisin benzerini Ebu Davud ve Ahmed de tahric ettiler. EBU DAVUD RİVAYETİ VE İZAH İÇİN BURAYA TIKLAYIN"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 3865,
      "arabicNumber": 3865,
      "book": 34,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ جَعْفَرِ بْنِ مَيْمُونٍ، عَنْ أَبِي عُثْمَانَ، عَنْ سَلْمَانَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ رَبَّكُمْ حَيِيٌّ كَرِيمٌ يَسْتَحْيِي مِنْ عَبْدِهِ أَنْ يَرْفَعَ إِلَيْهِ يَدَيْهِ فَيَرُدَّهُمَا صِفْرًا - أَوْ قَالَ خَائِبَتَيْنِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Salman that the :Prophet (saas) said: \"Your Lord is Kind and Most Generous, and is too kind to let His slave, if he raises his hands to Him, bring them back empty,\" or he said \"frustrated",
          "ur": "سلمان رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تمہارا رب «حی» ( بڑا باحیاء، شرمیلا ) اور کریم ہے، اسے اس بات سے شرم آتی ہے کہ اس کا بندہ اس کے سامنے ہاتھ پھیلائے تو وہ انہیں خالی یا نامراد لوٹا دے ۱؎۔",
          "fr": "Rapporté par Salman : Le Prophète (ﷺ) a dit : « Votre Seigneur est Bienveillant et Très Généreux, et Il est trop bon pour laisser Son serviteur, s’il lève les mains vers Lui, les ramener vides » ou il a dit : « déçues. »",
          "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Ja'far bin Maimun] dari [Abu Utsman] dari [Salman] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Rabb kalian Maha Hidup lagi Maha Pemurah, Malu dari hamba-Nya yang mengangkat kedua tangannya kepada-Nya kemudian mengembalikannya dengan tangan hampa, atau bersabda;...kedua tangannya yang tidak mendapatkan apa-apa",
          "tr": "Selman(-ı Farisi) (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Şüphesiz sizin Rabbiniz haya eder. İkramı boldur, kulunun O'na ellerini havaya kaldırıp da bunları boş çevirmekten (veya dediki) haybete uğratmanktan haya eder (yani boş çevirmez).» Diğer tahric edenler: Tirmizi, dua; Ebu Davud, vitr; Beyhaki ve Hakim. TİRMİZİ RİVAYETİ İÇİN BURAYA TIKLAYIN EBU DAVUD RİVAYETİ ve İZAH İÇİN TIKLAYIN"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 3866,
      "arabicNumber": 3866,
      "book": 34,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ، عَنْ صَالِحِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِذَا دَعَوْتَ اللَّهَ فَادْعُ بِبُطُونِ كَفَّيْكَ وَلاَ تَدْعُ بِظُهُورِهِمَا فَإِذَا فَرَغْتَ فَامْسَحْ بِهِمَا وَجْهَكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that :the Messenger of Allah (saas) said: \"When you supplicate to Allah, supplicate with your palms uppermost, not with the backs of your hands uppermost, and when you finish, wipe your face with them",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم اللہ تعالیٰ سے دعا کرو تو اپنے ہاتھ کی اندرونی ہتھیلیوں سے دعا کیا کرو، ان کی پشت اپنی طرف کر کے دعا نہ کرو، پھر جب دعا سے فارغ ہو جاؤ تو اپنے ہاتھ اپنے منہ پر پھیرو ۔",
          "fr": "Rapporté par Ibn 'Abbas : Le Messager d’Allah (ﷺ) a dit : « Lorsque vous invoquez Allah, faites-le avec les paumes tournées vers le haut, et non le dos des mains vers le haut, et quand vous avez terminé, essuyez votre visage avec elles. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin As Shabah] telah menceritakan kepada kami ['Aidz bin Habib] dari [Shalih bin Hasan] dari [Muhammad bin Ka'ab Al Qurtzi] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu berdo'a kepada Allah, maka berdo'alah dengan kedua telapak tanganmu, jangan berdo'a dengan punggung telapak tangan, jika kamu telah selesai, maka basuhlah wajahmu dengan kedua telapak tangan tersebut",
          "tr": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Allah'a dua ettiğin zaman ellerinin içlerini açarak dua et ve ellerinin ters yüzünü havaya kaldırarak dua etme. Sonra dua'nı bitirince ellerini yüzüne sür.» Diğer tahric: Ebu Davud ve Hakim tahric ettiler. EBU DAVUD HADİSİ VE İZAH İÇİN TIKLAYIN"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 3867,
      "arabicNumber": 3867,
      "book": 34,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ قَالَ حِينَ يُصْبِحُ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ - كَانَ لَهُ عَدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ وَحُطَّ عَنْهُ عَشْرُ خَطِيئَاتٍ وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ وَإِذَا أَمْسَى فَمِثْلُ ذَلِكَ حَتَّى يُصْبِحَ ‏\"‏ ‏.‏ قَالَ فَرَأَى رَجُلٌ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِيمَا يَرَى النَّائِمُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبَا عَيَّاشٍ يَرْوِي عَنْكَ كَذَا وَكَذَا ‏.‏ فَقَالَ ‏\"‏ صَدَقَ أَبُو عَيَّاشٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu 'Ayyash Az-Zuraqi that :the Messenger of Allah (saas) said: \"Whoever says in the morning: 'La illaha illalahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'ala kulli shay'in Qadir (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion and all praise is to Him, and He is Able to all things)' - he will have (a reward) equal to freeing a slave among the sons of Isma'il, ten bad deeds will be erased from (his record), he will be raised (in status) ten degrees, and he will have protection against Satan until evening comes. When evening comes, (if he says likewise) he will have the same until morning comes.'\" (Sahih)He (one of the narrators) said: \"A man saw the Messenger of Allah (saas) in a dream and said: 'O Messenger of Allah, Abu 'Ayyash narrated such and such from you.' He said: 'Abu 'Ayyash spoke the truth",
          "ur": "ابوعیاش زرقی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص صبح کے وقت یہ دعا پڑھے: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير» اللہ کے علاوہ کوئی معبود برحق نہیں، وہ یکتا ہے اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے، اور اسی کے لیے حمد و ثنا، وہی ہر چیز پر قادر ہے تو اسے اسماعیل علیہ السلام کی اولاد میں سے ایک غلام آزاد کرنے کا ثواب ملتا ہے، اور اس کے دس گناہ مٹا دئیے جاتے ہیں، اور اس کے دس درجے بڑھا دئیے جاتے ہیں، اور وہ شام تک شیطان سے محفوظ رہتا ہے، اور اگر شام کے وقت یہ پڑھے تو وہ صبح تک ایسے ہی رہتا ہے تو ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کو خواب میں دیکھا، اور عرض کیا: اللہ کے رسول! ابوعیاش آپ سے ایسی اور ایسی حدیث بیان کرتے ہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ابوعیاش سچ کہتا ہے ۔",
          "fr": "Rapporté par Abu 'Ayyash Az-Zuraqi : Le Messager d’Allah (ﷺ) a dit : « Celui qui dit le matin : ‘La illaha illalahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa ‘ala kulli shay’in Qadir (Nul n’a le droit d’être adoré sauf Allah seul, sans associé. À Lui la royauté et la louange, et Il est capable de toute chose)’ – il aura une récompense équivalente à l’affranchissement d’un esclave parmi les descendants d’Ismaïl, dix mauvaises actions seront effacées de son registre, il sera élevé de dix degrés, et il sera protégé contre Satan jusqu’au soir. Et s’il dit cela le soir, il aura la même chose jusqu’au matin. » (Sahih) Un homme a vu le Messager d’Allah (ﷺ) en rêve et lui a dit : « Ô Messager d’Allah, Abu 'Ayyash a rapporté telle et telle chose de toi. » Il a répondu : « Abu 'Ayyash a dit vrai. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Al Hasan bin Musa] telah menceritakan kepada kami [Hammad bin Salamah] dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu 'Ayyasy Az Zuraqi] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ketika pagi hari mengucapkan; \"Laa ilaaha illallah wahdahu laa syariikalah lahul mulku walahul hamdu wahuwa 'alaa kulli syai`in qadiir (Tiada ilah selain Allah yang Maha Esa, yang tiada sekutu bagi-Nya, milik-Nya kerajaan dan bagi-Nya segala pujian, serta Dia berkuasa atas segala sesuatu). Maka ia akan mendapatkan pahala seperti memerdekakan seorang budak dari keturunan Isma'il, di hapuskan darinya sepuluh kesalahan, di angkat baginya sepuluh derajat, dan ia tetap terjaga dari syaitan hingga sore hari. Jika dia berada di sore hari, maka ia akan tetap demikian sampai pagi hari menjelang.\" Perawi berkata; \"Seorang laki-laki bermimpi bertemu dengan Rasulullah shallallahu 'alaihi wasallam sebagaimana mimpinya orang-orang yang tidur, dan dia berkata; \"Wahai Rasulullah, Abu 'Ayyasy telah meriwayatkan darimu begini dan begini.\" Beliau menjawab: \"Abu 'Ayyasy benar",
          "tr": "Ebu Ayyaş ez-Züraki (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim sabahleyin ''La ilahe illallahu vahdehu la şerike leh. Lehu'l-mulu ve lehu'l-hamdu ve huve ala kulli şey'in kadir'' derse bu o kimse için İsmail A.S.'ın evladından bier rakabe (köle) yi azadlamak kadar (sevaplı) olur. O kimsenin on hatası (küçük günahı) silinir, onun için on derece terfi yapılır ve o gün akşama kadar o kimse şeytandan korunmuş olur. Akşamleyin de bu zikri okuyunca ertesi günün sabahına kadar anılan şeylerin mislini kazanır.» Ravi dediki: Sonra bir adam Resulullah (Sallallahu Aleyhi ve Sellem)'i rüyasında görüp: Ya Resulallah! Ebu Ayyaş senden şöyle şöyle bir hadis rivayet eder, demiş. Bunun üzerine Resul-i Ekrem de: Ebu Ayyaş doğru söyledi, buyurmuştur. Zikrin Meali: Allah'tan başka ilah yoktur. O, tektir, ortğı yoktur. Mülk O'nundur. Hamd O'na mahsustur. Ve O, her şey'e kadirdir. Diğer tahric: Ebu Davud da rivayet etmiştir. Nesai de bunu \"Amelu'l-Yevme ve'l-Leyle\" de rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 3868,
      "arabicNumber": 3868,
      "book": 34,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِذَا أَصْبَحْتُمْ فَقُولُوا اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَى وَبِكَ نَمُوتُ وَإِذَا أَمْسَيْتُمْ فَقُولُوا اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَى وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :the Messenger of Allah (saas) said: \"In the morning say: 'Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namut (O Allah, by Your leave we have reached the morning and by Your leave we reach the evening, and by Your leave we live and by Your leave we die). And when evening comes, say: Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namut, wa ilaykal-masir (O Allah, by Your leave we have reached the evening and by Your leave we reach the morning, and by Your leave we live and by Your leave we die, and unto You is our return)",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب صبح کرو تو یہ کہا کرو، «اللهم بك أصبحنا وبك أمسينا وبك نحيى وبك نموت وإذا أمسيتم فقولوا اللهم بك أمسينا وبك أصبحنا وبك نحيى وبك نموت وإليك المصير» اے اللہ ہم نے تیرے ہی نام پر صبح کی، اور تیرے ہی نام پر شام کی، اور تیرے ہی نام پر ہم جیتے ہیں، اور تیرے ہی نام پر مریں گے ، اور شام کرو تو یہ کہا کرو، «اللهم بك أمسينا وبك أصبحنا وبك نحيى وبك نموت وإليك المصير» اے اللہ! ہم نے تیرے ہی نام پر شام کی، اور تیرے ہی نام پر صبح کی، اور تیرے ہی نام پر جیتے ہیں، تیرے ہی نام پر مریں گے، اور تیری ہی طرف پلٹ کر جانا ہے ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a dit : « Le matin, dites : ‘Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namut (Ô Allah, par Ta permission nous sommes arrivés au matin, par Ta permission nous arrivons au soir, par Ta permission nous vivons et par Ta permission nous mourons).’ Et le soir, dites : ‘Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namut, wa ilaykal-masir (Ô Allah, par Ta permission nous sommes arrivés au soir, par Ta permission nous arrivons au matin, par Ta permission nous vivons et par Ta permission nous mourons, et vers Toi est notre retour).’ »",
          "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian berada di pagi hari, maka ucapkanlah; \"Allahumma bika ashbahna wabika amsaina wabika nahya wabika namut (Ya Allah, dengan-Mu kami di pagi hari, dan dengan-Mu kami di sore hari, dengan-Mu kami hidup dan dengan-Mu kami mati).\" Dan jika berada di sore hari, maka ucapkanlah \"Allahumma bika amsaina wabika ashbahnya wabika nahya wabika namut wa ilaikal mashir (Ya Allah, dengan-Mu kami di sore hari, dan dengan-Mu kami di pagi hari, dengan-Mu kami hidup dan dengan-Mu kami mati)",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sabah'a ulaştığınız zaman: ''Allahumme bike asbahna ve bike emseyna ve bike nahya ve bike nemutu.'' deyiniz. Akşam'a ulaştığınız zaman da : Allahumme bike emseyna ve bike asbahna ve bike nahya ve bike nemutu ve ileyke'l-mesir,'' deyiniz.» Meali: Sabah: Allahım, Biz ancak senin (himayen veya nimetlerin) ile sabah'a ulaştık. Ve Ancak senin (himayen veya nimetlerin) ile (dünkü) akşam'a ulaştık (veya bu gün akşama ulaşabiliriz.) Ancak semim (iznin) ile yaşarız ve senin (iznin) ile ölürüz. '' Akşam: Allahım! Biz ancak senin (himayen veya nimetlerin) ile akşam'a ulaştık ve ancak senin (himayen veya nimetlerin) ile sabah'a ulaştık (veya yarınki sabah'a ulaşabiliriz.) Ancak senin (iznin) ile yaşarız ve ancak senin (iznin) ile ölürüz. Dönüş ancak sanadır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 3869,
      "arabicNumber": 3869,
      "book": 34,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ أَبَانَ بْنِ عُثْمَانَ، قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ مَا مِنْ عَبْدٍ يَقُولُ فِي صَبَاحِ كُلِّ يَوْمٍ وَمَسَاءِ كَلِّ لَيْلَةٍ بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلاَثَ مَرَّاتٍ - فَيَضُرَّهُ شَىْءٌ ‏\"‏ ‏.‏ قَالَ وَكَانَ أَبَانُ قَدْ أَصَابَهُ طَرَفٌ مِنَ الْفَالِجِ فَجَعَلَ الرَّجُلُ يَنْظُرُ إِلَيْهِ فَقَالَ لَهُ أَبَانُ مَا تَنْظُرُ إِلَىَّ أَمَا إِنَّ الْحَدِيثَ كَمَا قَدْ حَدَّثْتُكَ وَلَكِنِّي لَمْ أَقُلْهُ يَوْمَئِذٍ لِيُمْضِيَ اللَّهُ عَلَىَّ قَدَرَهُ ‏.‏",
        "translations": {
          "en": "Uthman bin 'Affan said:\"I heard the Messenger of Allah (saas) say: \"There is no person who says, in the morning and evening of every day: Bismillahil-ladhi la yadurru ma'a ismihi shay'un fil-ardi wa la fis-sama'i wa Huwas-Sami'ul-'Alim (In the name of Allah with Whose Name nothing on earth or in heaven harms, and He is the All-Seeing, All-Knowing), three times, and is then harmed by anything.'\" (Hasan)He (one of the narrators) said: \"Aban had been stricken with paralysis on one side of his body, and a man started looking at him. Aban said: 'Why are you looking at me? The Hadith is as I have narrated it to you, but I did not say it that day, so that the decree of Allah might be implemented",
          "ur": "عثمان بن عفان رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: جو کوئی بندہ ہر دن صبح اور شام تین بار یہ کہے: «بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم» اس اللہ کے نام سے جس کے نام لینے سے زمین اور آسمان کی کوئی چیز نقصان نہیں پہنچا سکتی ہے، وہ سمیع و علیم ( یعنی سننے اور جاننے والا ہے ) تو اسے کوئی چیز نقصان نہیں پہنچا سکتی ۔ راوی کہتے ہیں: ابان کچھ فالج سے متاثر ہو گئے تو وہ شخص انہیں دیکھنے لگا، ابان نے اس سے کہا: مجھے کیا دیکھتے ہو؟ سنو! حدیث ویسے ہی ہے جیسے میں نے تم سے بیان کی، لیکن میں اس دن یہ دعا نہیں پڑھ سکا تھا تاکہ اللہ تعالیٰ اپنی تقدیر مجھ پر نافذ کر دے ۱؎۔",
          "fr": "Rapporté par Uthman bin 'Affan : J’ai entendu le Messager d’Allah (ﷺ) dire : « Il n’y a personne qui dise, chaque matin et chaque soir : ‘Bismillahil-ladhi la yadurru ma’a ismihi shay’un fil-ardi wa la fis-sama’i wa Huwas-Sami’ul-‘Alim (Au nom d’Allah, avec Son Nom rien ne nuit sur terre ni dans le ciel, et Il est l’Audient, l’Omniscient)’, trois fois, et qui soit ensuite atteint par quoi que ce soit de nuisible. » (Hasan) Un des rapporteurs a dit : Aban avait été frappé par une paralysie d’un côté de son corps, et un homme s’est mis à le regarder. Aban a dit : « Pourquoi me regardes-tu ? Le hadith est tel que je te l’ai rapporté, mais ce jour-là, je ne l’ai pas dit, afin que le décret d’Allah s’accomplisse. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Ibnu Abu Az Zinnad] dari [ayahnya] dari [Aban bin Utsman] dia berkata; saya mendengar ['Utsman bin 'Affan] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba yang membaca pada pagi dan sore hari di setiap malamnya; Bismillahilladzii laa yadzurru ma'asmihi syai`un fil alrdli walaa fis samaa` wahuwas samii'ul 'aliim (Dengan menyebut nama Allah yang tidaklah sesuatu yang ada di bumi dan di langit akan celaka dengan nama-Nya, dan Dia Maha mendengar lagi Maha mengetahui).\" Sebanyak tiga kali, niscaya tidak akan di celakakan oleh sesuatu.\" Abu Zinnad berkata; \"Sementara itu, Abban terkena penyakit lumpuh, sedangkan ada seorang laki-laki yang memandanginya. Maka Abban berkata kepadanya; \"Mengapa kamu memandangiku?\" adapun mengenai hadits tersebut telah kuriwayatkan sebagaimana yang aku riwayatkan kepadamu. Namun saat (kejadian) itu aku tidak membacanya, sehingga Allah menakdirkanku dengan takdir-Nya",
          "tr": "“. Osman bin Affân (radıyallahü anh)'den rivâyet edildiğine göre kendisi Resûlüllah (sallallahü aleyhi ve sellem)’den : günün sabahında ve her gelenin akşamında \"Bismillahi'l-lezi lâ yedurru maasmihi şey’ün fi'l-Ardı ve lâ fi's-Semâi ve huve's-Semiu'l-Alîm = (Eziyyet edici her şeyden) Allah'ın ismiyle (korunurum) . Öyle Allah ki, O'nun İsmiyle beraber (olununca) ne yerde bulunan ne de gökte (n inecek) olan hiçbir şey zarar veremez. (Her şeyi) işitici O'dur, bilici O'dur.\" zikrini üç defa söyleyip de kendisine herhangi bir şey zarar veren hiç bir (mü'min) kul yoktur,) buyruğu işitmişti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 3870,
      "arabicNumber": 3870,
      "book": 34,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا أَبُو عَقِيلٍ، عَنْ سَابِقٍ، عَنْ أَبِي سَلاَّمٍ، خَادِمِ النَّبِيِّ ـ صلى الله عليه وسلم ـ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَا مِنْ مُسْلِمٍ أَوْ إِنْسَانٍ أَوْ عَبْدٍ يَقُولُ حِينَ يُمْسِي وَحِينَ يُصْبِحُ رَضِيتُ بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا - إِلاَّ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Salam, the servant of the Prophet (saas), that :the Prophet (saas) said: \"There is no Muslim - or no person, or slave (of Allah) - who says, in the morning and evening: 'Radaytu billahi Rabban wa bil-Islami dinan wa bi Muhammadin nabiyyan (I am content with Allah as my Lord, Islam as my religion and Muhammad as my Prophet),' but he will have a promise from Allah to make him pleased on the Day of Resurrection",
          "ur": "خادم رسول ابوسلام رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب کوئی مسلمان یا کوئی آدمی یا کوئی بندہ ( یہ راوی کا شک ہے کہ کون سا کلمہ ارشاد فرمایا ) صبح و شام یہ کہتا ہے: «رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا» ہم اللہ کے رب ہونے، اسلام کے دین ہونے، اور محمد صلی اللہ علیہ وسلم کے نبی ہونے سے راضی و خوش ہیں ) تو اللہ تعالیٰ پر اس کا یہ حق بن گیا کہ وہ قیامت کے دن اسے خوش کرے ۔",
          "fr": "Rapporté par Abu Salam, le serviteur du Prophète (ﷺ) : Le Prophète (ﷺ) a dit : « Il n’y a aucun musulman – ou aucune personne, ou esclave (d’Allah) – qui dise, le matin et le soir : ‘Radaytu billahi Rabban wa bil-Islami dinan wa bi Muhammadin nabiyyan (Je suis satisfait qu’Allah soit mon Seigneur, l’Islam ma religion et Muhammad mon Prophète),’ sans qu’il ait une promesse d’Allah de le satisfaire au Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Mis'ar] telah menceritakan kepada kami [Abu 'Aqil] dari [Sabiq] dari [Abu Sallam] [pembantu Nabi] shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah seorang muslim atau manusia atau seorang hamba berkata ketika menjelang sore dan pagi hari; \"Radliitu billahi rabba wabil islaami diina wabimuhammadi nabiyya (aku ridla kepada Allah sebagai Robbku, Islam sebagai agamaku dan Muhammad sebagai Nabi), kecuali Allah berhak untuk meridlainya pada hari kiamat",
          "tr": "Nebi (Sallallahu Aleyhi ve Sellem)'in hizmetçisi Ebu Sellam (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Akşam'a ulaştığı zaman ve sabaha ulaştığı zaman: Raditu billah'i Rabben ve bi'l-İslami dinen ve bi Muhammedi Nebiyyen'' diyen hiç bir müslüman veya insan yada kul yoktur ki kıyamet günü o kimseyi razı etmek Allah üzerinde bir hak olmasın.» Zikrin Meali: Rab olarak Allah'ı (C.C.), din olarak İslam'ı Nebi olarak da Muhammed'i (s.a.v.) seçtim. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih olup ravileri güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 3871,
      "arabicNumber": 3871,
      "book": 34,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الطَّنَافِسِيُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عُبَادَةُ بْنُ مُسْلِمٍ، حَدَّثَنَا جُبَيْرُ بْنُ أَبِي سُلَيْمَانَ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ لَمْ يَكُنْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَدَعُ هَؤُلاَءِ الدَّعَوَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ ‏ \"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَاىَ وَأَهْلِي وَمَالِي اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي وَاحْفَظْنِي مِنْ بَيْنِ يَدَىَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ‏\"‏ ‏.‏ قَالَ وَكِيعٌ يَعْنِي الْخَسْفَ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Umar said:\"The Messenger of Allah (saas) never abandoned these supplications, every morning and evening: Allahumma inni as'alukal-'afwa wal-'afiyah fid-dunya wal-akhirah. Allahumma inni as'alukal-'afwa wal-'afiyah fi dini wa dunyaya wa ahli wa mali. Allahum-mastur 'awrati, wa amin raw'ati wahfazni min bayni yadayya, wa min khalfi, wa 'an yamini wa 'an shimali, wa min fawqi, wa 'audhu bika an ughtala min tahti (O Allah, I ask You for forgiveness and well-being in this world and in the Hereafter. O Allah, I ask You for forgiveness and well-being in my religious and my worldly affairs. O Allah, conceal my faults, calm my fears, and protect me from before me and behind me, from my right and my left, and from above me, and I seek refuge in You from being taken unaware from beneath me).\" Waki' (one of the narrators, explaining) said: \"Meaning Al-Khasf (disgrace)",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم صبح و شام ان دعاؤں کو نہیں چھوڑتے تھے: «اللهم إني أسألك العفو والعافية في الدنيا والآخرة اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي اللهم استر عوراتي وآمن روعاتي واحفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بك أن أغتال من تحتي» اے اللہ! میں تجھ سے دنیا اور آخرت میں عفو اور عافیت کا طالب ہوں، اے اللہ! میں تجھ سے اپنے دین و دنیا اور اپنے اہل و مال میں معافی اور عافیت کا طالب ہوں، اے اللہ! میرے عیوب چھپا دے، میرے دل کو مامون کر دے، اور میرے آگے پیچھے، دائیں بائیں، اور اوپر سے میری حفاظت فرما، اور میں تیری پناہ چاہتا ہوں نیچے سے ہلاک کئے جانے سے ۔ وکیع کہتے ہیں:«أغتال من تحتي» کے معنی دھنسا دئیے جانے کے ہیں",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah (ﷺ) n’abandonnait jamais ces invocations, chaque matin et chaque soir : « Allahumma inni as’alukal-‘afwa wal-‘afiyah fid-dunya wal-akhirah. Allahumma inni as’alukal-‘afwa wal-‘afiyah fi dini wa dunyaya wa ahli wa mali. Allahum-mastur ‘awrati, wa amin raw’ati wahfazni min bayni yadayya, wa min khalfi, wa ‘an yamini wa ‘an shimali, wa min fawqi, wa ‘audhu bika an ughtala min tahti (Ô Allah, je Te demande le pardon et la santé dans ce monde et dans l’au-delà. Ô Allah, je Te demande le pardon et la santé dans ma religion, dans ma vie d’ici-bas, pour ma famille et mes biens. Ô Allah, cache mes défauts, rassure-moi, protège-moi devant moi, derrière moi, à ma droite, à ma gauche et au-dessus de moi, et je cherche refuge auprès de Toi contre le fait d’être pris au dépourvu par en dessous de moi). » Waki’ (un des rapporteurs, en expliquant) a dit : « Cela signifie l’engloutissement (la disgrâce). »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad At Thanafisi] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami ['Ubadah bin Muslim] telah menceritakan kepada kami [Jubair bin Abu Sulaiman bin Jubair bin Muth'im] dia berkata; saya mendengar [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam tidak pernah meninggalkan do'a-do'a tersebut ketika menjelang pagi dan sore, yaitu; \"Ya Allah, sesungguhnya aku meminta kepada-Mu ampunan dan keselamatan dunia dan akhirat. Ya Allah, sesungguhnya aku meminta kepada-Mu ampunan dan keselamatan di dalam menjalankan dienku, duniaku, keluargaku dan hartaku. Ya Allah, tutupilah auratku, amankanlah apa-apa yang menjadi pemeliharaanku, lindumgilah kami dari bahaya yang datang dari hadapanku, dari belakangku, dari samping kananku, dari sampaing kiriku dan dari atasku dan aku berlindung kepada-Mu dari bahaya yang datang tak disangka dari bawahku",
          "tr": "İbn-i Ömer (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) akşam'a ulaştığı zaman ve sabah'a ulaştığı zaman şu duaları bırakmazdı. «Allahım! Ben senden dünyada ve ahirette af ve afiyet dilerim. Allahım! Ben senden dinim, dünyam, aile ferdlerim ve malım (hususun) da af ve afiyet dilerim. Allahım! Ayıplarımı ört, beni korkutacak şeylerden emin kıl ve benim önümden, arkamdan, sağımdan solumdan ve üstümden koru. Altımdan muaheze edilmemden sana sığınırım.» Ravi Veki' demiştir ki: (alttan muaheze ile) yere batırmayı kasdediyor. Diğer tahric: Ebu Davud, Nesai"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 3872,
      "arabicNumber": 3872,
      "book": 34,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُيَيْنَةَ، حَدَّثَنَا الْوَلِيدُ بْنُ ثَعْلَبَةَ، عَنْ عَبْدِ اللَّهِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ بِنِعْمَتِكَ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ ‏\"‏ ‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ قَالَهَا فِي يَوْمِهِ وَلَيْلَتِهِ فَمَاتَ فِي ذَلِكَ الْيَوْمِ أَوْ تِلْكَ اللَّيْلَةِ دَخَلَ الْجَنَّةَ إِنْ شَاءَ اللَّهُ تَعَالَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin Buraidah that :his father said: \"The Messenger of Allah (saas) said: Allahumma Anta Rabbi la ilaha illa Anta, khalaqtani wa ana 'abduka wa ana 'ala 'ahdika wa wa'dika mastata'tu. A'udhu bika min sharri ma sana'tu, abu'u bi ni'matika wa abu'u bi dhanbi faghfirli, fa innahu la yaghfirudh-dhunuba illa Anta (O Allah, You are my Lord, there is none worthy of worship except You. You have created me and I am Your slave, and I am adhering to Your covenant and Your promise as much as I can. I seek refuge with You from the evil of what I do. I acknowledge Your blessing and I acknowledge my sin, so forgive me, for there is none who can forgive sin except You).\"He said: \"The Messenger of Allah (saas) said: 'Whoever says this by day and by night, if he dies that day or that night, he will enter Paradise if Allah wills",
          "ur": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء بنعمتك وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت» اے اللہ! تو ہی میرا رب ہے، تیرے سوا کوئی معبود برحق نہیں ہے، تو نے ہی مجھے پیدا کیا، میں تیرا ہی بندہ ہوں، اپنی طاقت بھر میں تیرے عہد و وعدہ پر قائم ہوں، اپنے کئے ہوئے کے شر سے میں تیری پناہ چاہتا ہوں، مجھے تیرے احسانات اور اپنے گناہوں کا اعتراف ہے، میری بخشش فرما، بلاشبہ تو ہی گناہوں کو بخشنے والا ہے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی شخص دن اور رات میں یہ دعا پڑھے، اور اسی دن یا اسی رات اس شخص کا انتقال ہو جائے، تو ان شاءاللہ وہ جنت میں داخل ہو گا ۔",
          "fr": "Rapporté par 'Abdullah bin Buraidah, dont le père a dit : Le Messager d’Allah (ﷺ) a dit : « Allahumma Anta Rabbi la ilaha illa Anta, khalaqtani wa ana ‘abduka wa ana ‘ala ‘ahdika wa wa’dika mastata’tu. A’udhu bika min sharri ma sana’tu, abu’u bi ni’matika wa abu’u bi dhanbi faghfirli, fa innahu la yaghfirudh-dhunuba illa Anta (Ô Allah, Tu es mon Seigneur, il n’y a pas de divinité en dehors de Toi. Tu m’as créé et je suis Ton serviteur, et je m’efforce de tenir Ton engagement et Ta promesse autant que je le peux. Je cherche refuge auprès de Toi contre le mal que j’ai fait. Je reconnais Tes bienfaits et j’avoue mon péché, alors pardonne-moi, car nul ne pardonne les péchés sauf Toi). » Il a dit : Le Messager d’Allah (ﷺ) a dit : « Celui qui dit cela le jour et la nuit, s’il meurt ce jour-là ou cette nuit-là, il entrera au Paradis si Allah le veut. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Ibrahim bin 'Uyainah] telah menceritakan kepada kami [Al Walid bin tsa'labah] dari [Abdullah bin Buraidah] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam berdo'a: \"Ya Allah, Engkaulah Rabbku, tiada ilah yang berhak di sembah selain Engkau, Engkau telah menciptakanku, dan aku adalah hamba-Mu. Aku berada dalam ketentuan dan janji-Mu semampuku. Aku berlindung kepada-Mu dari keburukan yang telah aku perbuat. Kuakui akan nikmat-nikmat-Mu dan kuakui akan dosa-dosaku, maka ampunilah aku, karena sesugguhnya tidak ada yang mampu mengampuni dosa selain Engkau.\" Buraidah berkata; \"Rasulullah shallallahu 'alaihi wasallam berabda: \"Barangsiapa membacanya pada siang dan malam hari, kemudian dia mati pada hari itu atau pada malam itu, niscaya ia akan masuk surga, jika Allah Ta'ala menghendaki",
          "tr": "Büreyde (b. el-Husayb) (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) mealen: «Allahumme ente Rabbi. La İlahe illa ente. Halekteni ve ene abduke ve ene ala ahdike ve va'dike mesteta'tu. Euzu bike min şerri ma sana'ta. Euzu bi ni'metike ve ebuu bi zenbi. Fağfir li Fe innehu la yağfiru'z-zunube illa ente » duasını okurdu. Büreyde dediki: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Kim bu dua'yı gününde ve gecesinde okuyupta da sonra o gün veya o gece ölürse İnşaallah Teala o kimse cennet'e girer.» Dua'nın meali: Allahım! Rabbin sensin. Senden başka ilah yoktur. Sen beni yarattın. Ben senin kulunum ve gücüm yettiği kadar sana verdiğim ahd'e, söz'e sadakat gösteririm ve (mu'min olarak ölenlere verdiğin mağfiretle vennet'e dair) va'd (-i ilahine) inanç üzereyim. İşlediğimin şerrinden sana sığınırım. Senin ni'metini itiraf ederim. Günahımı da itiraf ederim. Bu itibarla günahımı bağışla. Çünkü şüphesiz günahları ancak sen bağışlarsın. Diğer tahric: Ebu Davud, Nesai"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 3873,
      "arabicNumber": 3873,
      "book": 34,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ كَانَ يَقُولُ إِذَا أَوَى إِلَى فِرَاشِهِ ‏ \"‏ اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأَرْضِ وَرَبَّ كُلِّ شَىْءٍ فَالِقَ الْحَبِّ وَالنَّوَى مُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْقُرْآنِ الْعَظِيمِ أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَىْءٌ وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَىْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَىْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَىْءٌ اقْضِ عَنِّي الدَّيْنَ وَأَغْنِنِي مِنَ الْفَقْرِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that :when going to bed, the Prophet (saas) used to say: \"Allahumma Rabbas-samawati wa Rabbal-ardi, wa Rabba kulli shay'in, faliqal-habbi wan-nawa, munzilat-Tawrati wal-Injili wal-Qur'anil-'Azim. A'udhu bika min sharri kulli dabbatin Anta akhidhun binasiyatiha, Antal-Awwalu fa laysa qablaka shayun, wa Antal-Akhiru, fa laysa ba'daka shayun', Antaz-zahiru, fa laysa fawqaka shayun', wa antal-batinu fa laysa dunaka shay', aqdi 'annid-dayna waghnini minal-faqr (O Allah, Lord of the heavens and Lord of the earth and Lord of all things, Cleaver of the seed and the kernel, Revealer of the Tawrah, the Injil and the Magnificent Qur'an, I seek refuge with You from the evil of every creature You seize by the forelock. You are the First and there is nothing before You; You are the Last and there is nothing after You; You are the Most High (Az-Zahir) and there is nothing above You, and You are the Most Near (Al-Batin) and there is nothing nearer than You. Settle my debt for me and spare me from poverty",
          "ur": "(ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب اپنے بستر پر تشریف لے جاتے تو یہ دعا پڑھتے: «اللهم رب السموات ورب الأرض ورب كل شيء فالق الحب والنوى منزل التوراة والإنجيل والقرآن العظيم أعوذ بك من شر كل دابة أنت آخذ بناصيتها أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عني الدين وأغنني من الفقر» اے اللہ! آسمانوں اور زمین کے رب! ہر چیز کے رب! دانے اور گٹھلی کو پھاڑ کر پودا نکالنے والے! توراۃ، انجیل اور قرآن عظیم کو نازل کرنے والے! میں تیری پناہ چاہتا ہوں زمین پر رینگنے والی ہر مخلوق کے شر و فساد سے، جس کی پیشانی تیرے ہاتھوں میں ہے، تو ہی سب سے پہلے ہے، تجھ سے پہلے کوئی نہیں تھا، اور تو ہی سب سے آخر ہے تیرے بعد کوئی نہیں، اور تو ہی ظاہر ہے تیرے اوپر کوئی نہیں، اور تو ہی باطن ہے تجھ سے ورے کوئی چیز نہیں، میرا قرض ادا کرا دے اور فقر و مسکنت سے مجھے آزاد کرا دے آسودہ حال بنا دے ) ۔",
          "fr": "Rapporté par Abu Hurairah : Quand il allait se coucher, le Prophète (ﷺ) disait : « Allahumma Rabbas-samawati wa Rabbal-ardi, wa Rabba kulli shay’in, faliqal-habbi wan-nawa, munzilat-Tawrati wal-Injili wal-Qur’anil-‘Azim. A’udhu bika min sharri kulli dabbatin Anta akhidhun binasiyatiha, Antal-Awwalu fa laysa qablaka shayun, wa Antal-Akhiru, fa laysa ba’daka shayun, Antaz-zahiru, fa laysa fawqaka shayun, wa antal-batinu fa laysa dunaka shay’, aqdi ‘annid-dayna waghnini minal-faqr (Ô Allah, Seigneur des cieux, de la terre et de toute chose, Fendeur de la graine et du noyau, Révélateur de la Torah, de l’Évangile et du Noble Coran, je cherche refuge auprès de Toi contre le mal de toute créature dont Tu tiens le toupet. Tu es le Premier, rien n’est avant Toi ; Tu es le Dernier, rien n’est après Toi ; Tu es le Très-Haut, rien n’est au-dessus de Toi ; Tu es le Très-Proche, rien n’est plus proche que Toi. Règle ma dette et préserve-moi de la pauvreté. »)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu As Syawarib] telah menceritakan kepada kami [Abdul Aziz bin Muhtar] telah menceritakan kepada kami [Suhail] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bahwa apabila beliau hendak berbaring ke tempat tidurnya, maka beliau membaca: \"Ya Allah, Rabb langit dan bumi, Rabb segala sesuatu, yang Maha menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan, dzat yang telah menurunkan Taurat, Injil dan Al Qur`an yang agung. Aku berlindung kepada-Mu dari kejahatan semua binatang merayap yang Engkau pegang ubun-ubunnya. Engkau Maha terdahulu yang tidak ada sesuatu sebelum-Mu. Engkau Maha terakhir yang tiada sesuatu setelah-Mu. Engkau Maha nyata yang tidak ada sesuatu yang lebih nyata dari-Mu. Dan Engkau Maha tersembunyi yang tidak ada sesuatu yang lebih tersembunyi dari-Mu. Lunasilah dariku segala hutang-hutangku dan cukupkanlah aku dari kefakiran",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle dua ederdi: «Ey göklerin ve yer'in Rabbi, her şey'in Rabbi, tane'yi ve hurma çekirdeğini yarıp filizlendiren, Tevrat, İncil ve Kur'an-ı Azimi'i indiren Allah. Ben Hükümranlığın altında bulunan yerde yerde yürüyen bütün canlıların şerrinden sana sığınırım. Evvel sensin senden önce olan hiçbir şey yoktur. Ahir de sensin senden sonra da hiç bir şey yoktur. Zahir sensin varlığı seninkinden daha aşikar hiç bir şey yoktur. Batın da sensin, senden daha gizli hiç bir şey yoktur. Borcumu sen öde ve beni fakirlikten kurtarıp zenginleştir.» Diğer tahric: Müslim, Tirmizi, Ebu Davud ve Nesai de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 3874,
      "arabicNumber": 3874,
      "book": 34,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَضْطَجِعَ عَلَى فِرَاشِهِ فَلْيَنْزِعْ دَاخِلَةَ إِزَارِهِ ثُمَّ لْيَنْفُضْ بِهَا فِرَاشَهُ فَإِنَّهُ لاَ يَدْرِي مَا خَلَفَهُ عَلَيْهِ ثُمَّ لْيَضْطَجِعْ عَلَى شِقِّهِ الأَيْمَنِ ثُمَّ لْيَقُلْ رَبِّ بِكَ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا حَفِظْتَ بِهِ عِبَادَكَ الصَّالِحِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that:the Messenger of Allah (saas) said: \"When anyone of you wants to go to bed, let him undo the edge of his Izar (waist wrap) and dust of his bed with it, for he does not know what came to it after him. Then let him lie down on his right side and say: 'Rabbi bika wada'tu janbi wa bika arfa'uhu, fa in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima hafizta bihi 'ibadikaas-salihin (O Lord, by Your leave I lie down and by Your leave I rise, so if You should take my soul then have mercy on it, and if You should return my soul then protect it as You protect Your righteous slaves)",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی اپنے بستر پر لیٹنے کا ارادہ کرے تو اپنے تہبند کا داخلی کنارہ کھینچ کر اس سے اپنا بستر جھاڑے، اس لیے کہ اسے نہیں پتہ کہ ( جانے کے بعد ) بستر پر کون سی چیز پڑی ہے، پھر داہنی کروٹ لیٹے اور کہے: «رب بك وضعت جنبي وبك أرفعه فإن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما حفظت به عبادك الصالحين» میرے رب! میں نے تیرا نام لے کر اپنا پہلو رکھا ہے، اور تیرے ہی نام پر اس کو اٹھاؤں گا، پھر اگر تو میری جان کو روک لے ( یعنی اب میں نہ جاگوں اور مر جاؤں ) تو اس پر رحم فرما، اور اگر تو چھوڑ دے ( اور میں جاگوں ) تو اس کی حفاظت فرما ان چیزوں کے ذریعہ جن سے تو نے اپنے نیک بندوں کی حفاظت فرماتا ہے ) ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a dit : « Quand l’un de vous veut aller se coucher, qu’il défasse le bord de son izar (vêtement de taille) et qu’il dépoussière son lit avec, car il ne sait pas ce qui a pu y venir après lui. Puis qu’il s’allonge sur son côté droit et dise : ‘Rabbi bika wada’tu janbi wa bika arfa’uhu, fa in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima hafizta bihi ‘ibadikaas-salihin (Ô Seigneur, par Ta permission je me couche et par Ta permission je me lève, si Tu retiens mon âme alors fais-lui miséricorde, et si Tu la rends, protège-la comme Tu protèges Tes serviteurs vertueux). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdullah bin Numair] dari ['Ubaidullah] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian hendak berbaring di atas tempat tidurnya, maka hendaknya ia membuka bagian dari selimutnya lalu membersihkan kasurnya, karena dirinya tidak mengetahui terhadap apa yang akan membahayakan dirinya. Kemudian hendaknya ia berbaring dengan meletakkan sisi kanan badannya sambil berdo'a; \"Wahai Rabbku, dengan nama-Mu aku membaringkan sisi badanku, dan juga dengan nama-Mu aku mengangkatnya. Jika Engkau mengambil jiwaku, maka kasihanilah ia. Dan jika Engkau melepaskannya, maka lindungilah ia, sebagaimana Engkau melindungi pada hamba-Mu yang shalih",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Sizden birisi yatağında yatmak istediği zaman izarının iç kenarını çıkarıp onunla yatağını silsin, Çünkü yatacak adam kendisinden sonra neyin onun yerine yatağına girdiğini bilemez. Sonra sağ tarafı üstünde yatsın. Sonra şöyle dua etsin : ''Ey Rabbim! Senin ismin ile yan tarafımı yere koydum. Senin (ismin) ile kaldırırım. Eğer ruhumu alırsan ona rahmet eyle. Eğer hayatta bırakacaksan nefsimi salih kullarını muhafaza ettiğin himaye-muvaffakiyetle muhafaza eyle''» Bu hadis, Kütüb-i Sitte'nin hepsinde rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 3875,
      "arabicNumber": 3875,
      "book": 34,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، وَسَعِيدُ بْنُ شُرَحْبِيلَ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، أَخْبَرَهُ عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا أَخَذَ مَضْجَعَهُ نَفَثَ فِي يَدَيْهِ وَقَرَأَ بِالْمُعَوِّذَتَيْنِ وَمَسَحَ بِهِمَا جَسَدَهُ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that:whenever the Prophet (saas) went to bed, he would blow into his hands, recite Al-Mu'awwidhatain, then wipe his hands over his body",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب اپنے بستر پر لیٹتے تو اپنے دونوں ہاتھوں میں پھونک مارتے، اور معوذتین: «قل أعوذ برب الفلق» و «قل أعوذ برب الناس» پڑھتے، اور انہیں اپنے جسم پر پھیر لیتے۔",
          "fr": "Rapporté par 'Aishah : Chaque fois que le Prophète (ﷺ) allait se coucher, il soufflait dans ses mains, récitait Al-Mu’awwidhatain, puis passait ses mains sur son corps",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Yunus bin Muhammad] dan [Sa'id bin Syurahbil] telah memberitakan kepada kami [Al Laits bin Sa'd] dari ['Uqail] dari [Ibnu Syihab] bahwa ['Urwah bin Az Zubair] telah mengabarkan kepadanya dari ['Aisyah] bahwa Apabila Rasulullah shallallahu 'alaihi wasallam mendatangi tempat pembaringannya, beliau meniup di kedua tangannya dan membaca surat mu'awwidatain lalu mengusapkan ke badannya dengan kedua telapak tangannya tersebut",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) yatağına yattığı zaman ellerine üfler, muavvizeteyn surelerini okur ve ellerini vücuduna sürerdi. Diğer tahric: (benzeri;) Buhari, Müslim, Tirmizi ve Ebu Davud"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 3876,
      "arabicNumber": 3876,
      "book": 34,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ لِرَجُلٍ ‏ \"‏ إِذَا أَخَذْتَ مَضْجَعَكَ أَوْ أَوَيْتَ إِلَى فِرَاشِكَ فَقُلِ اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لاَ مَلْجَأَ وَلاَ مَنْجَى مِنْكَ إِلاَّ إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَنَبِيِّكَ الَّذِي أَرْسَلْتَ فَإِنْ مِتَّ مِنْ لَيْلَتِكَ مِتَّ عَلَى الْفِطْرَةِ وَإِنْ أَصْبَحْتَ أَصْبَحْتَ وَقَدْ أَصَبْتَ خَيْرًا كَثِيرًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Bara' bin 'Azib that :the Prophet (saas) said to a man: \"When you go to lay down, or go to your bed, say: Allahumma aslamtu wajhi ilayka, wa al-ja'tu zahri ilayka, wa fawwadtu amri ilayka, raghbatan wa rahbatan ilayka, la malja'a wa la manja'a minka illa ilayka, amantu bi kitabikal-ladhi anzalta, wa nabiyyikal arsalta [O Allah, I have submitted my face (i.e., myself) to You, and I am under Your command (i.e., I depend upon You in all my affairs), and I put my trust in You, hoping for Your reward and fearing Your punishment. There is no fleeing from You and no refuge from You except with You. I believe in Your Book that You have revealed and in Your Prophet whom You have sent).' Then if you die that night, you will die in a state of the Fitrah (nature), and if you wake in the morning you will wake with a great deal of good",
          "ur": "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا: جب تم سونے لگو یا اپنے بستر پر جاؤ تو یہ دعا پڑھا کرو: «اللهم أسلمت وجهي إليك وألجأت ظهري إليك وفوضت أمري إليك رغبة ورهبة إليك لا ملجأ ولا منجى منك إلا إليك آمنت بكتابك الذي أنزلت ونبيك الذي أرسلت» اے اللہ! میں نے اپنا چہرہ ( یعنی نفس ) تجھ کو سونپ دیا، اپنی پیٹھ تیرے سہارے پر لگا دی، اور اپنا کام تیرے سپرد کر دیا، امیدی ناامیدی کے ساتھ تیری ذات پر بھروسہ کیا، سوائے تیرے سوا کہیں اور کوئی جائے پناہ اور جائے نجات نہیں، میں تیری کتاب پر جسے تو نے نازل کیا، اور تیرے نبی پر جسے تو نے بھیجا ایمان لایا، پھر اگر تمہارا اس رات انتقال ہو گیا تو دین اسلام پر مرو گے، اور اگر تم نے صبح کی تو تم خیر کثیر کے ساتھ صبح کرو گے ۔",
          "fr": "Rapporté par Bara' bin 'Azib : Le Prophète (ﷺ) a dit à un homme : « Quand tu vas te coucher, ou que tu t’allonges, dis : Allahumma aslamtu wajhi ilayka, wa al-ja’tu zahri ilayka, wa fawwadtu amri ilayka, raghbatan wa rahbatan ilayka, la malja’a wa la manja’a minka illa ilayka, amantu bi kitabikal-ladhi anzalta, wa nabiyyikal arsalta (Ô Allah, je T’ai soumis mon visage (c’est-à-dire moi-même), je me confie à Toi (je dépends de Toi pour toutes mes affaires), je mets ma confiance en Toi, espérant Ta récompense et craignant Ton châtiment. Il n’y a pas de refuge contre Toi sauf auprès de Toi. Je crois en Ton Livre que Tu as révélé et en Ton Prophète que Tu as envoyé).’ Puis, si tu meurs cette nuit-là, tu mourras dans la nature originelle (fitrah), et si tu te réveilles le matin, tu te réveilleras avec beaucoup de bien. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Al Barra` bin 'Azib] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada seorang laki-laki: \"Jika kamu hendak pergi ke tempat pembaringanmu atau kamu hendak pergi tidur ke tempat tidurmu, maka ucapkanlah; \"Ya Allah, aku hadapkan wajahku kepada-Mu dan aku serahkan punggungku kepada-Mu. Aku titipkan kepada-Mu dalam keadaan suka dan senag terhadap-Mu, tiada tempat bergantung dan berlindung melainkan hanya kepada-Mu. Aku beriman kepada kitab-Mu yang telah Engkau turunkan kepada Nabi-Mu yang telah Engkau utus.\" Maka jika kamu meninggal dunia pada malam itu, kamu akan meninggal dalam keadaan suci. Dan jika kamu bangun di pagi hari, maka kamu akan hidup di pagi hari dengan mendapatkan kebaikan yang berlimpah",
          "tr": "EI-Bera bin Azib (r.a.)'den rivayet edildiğine göre; Nebi (Sallallalıu Aleylıi ve Sellem) bir adama: «Yatağında yerleştiğin veya yatağına vardığın zaman: \"Allahumme eslemtu vechi ileyke ve elce'tu zahri ileyke ve revvadtu emri ileyke rağbeten ve rehbeten Heyke. La melcee ve la mencee minke illa ileyke. Amentu bi kitabike'l-lezi enzelte ve Nebiyyike'l¬lezi erselte'' de. (Sen böyle söyledikten) sonra eğer o gece ölürsrn fıtrat (yani İslam dini üzerine ölürsün. Şayet sabaha ulaşıırsan çok hayır kazanmış olarak sabaha ulaşmış olursun,» buyurdu.\" Dua'nın Meali: Allahım! Ben sen Cin rızanh dileyerek ve sen <in aza¬bın) dan korkarak kendimi sana teslim ettim: sırtımı sana dayadım ve (tüm) işimi sana bıraktım, Sen Cin tazibin) den ancak sana (yanİ rahmetine) iltica edilir, sığınılır, başka kurtuluş yolu yoktur. İndirdiğin Kitab'a ve gönderdiğin Nebi'ye iman ettim,\" Diğer tahric: (benzerini) Buhari de rivayet etmiştir. Ayrıca kalan Kütüb-i Sitte'nin hepsinde bunun benzeri gene Bera (r.a.)'den rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 3877,
      "arabicNumber": 3877,
      "book": 34,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ وَضَعَ يَدَهُ - يَعْنِي الْيُمْنَى - تَحْتَ خَدِّهِ ثُمَّ قَالَ ‏ \"‏ اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ - أَوْ تَجْمَعُ - عِبَادَكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah that:whenever the Prophet (saas) went to his bed, he would put his hand - meaning his right hand - beneath his cheek then say: \"Allahumma qini 'adhabaka yawm tab'athu - [or: tajma'u] - 'ibadaka (O Allah, save me from Your punishment on the Day when You resurrect - or gather - Your slaves)",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب بستر پر تشریف لے جاتے تو اپنا دایاں ہاتھ اپنے رخسار مبارک کے نیچے رکھتے، پھر ( یہ دعا ) پڑھتے: «اللهم قني عذابك يوم تبعث ( أو تجمع ) عبادك» اے اللہ! مجھ کو تو اپنے اس دن کے عذاب سے بچا جس دن تو اپنے بندوں کو اٹھائے گا یا جمع کرے گا ۔",
          "fr": "Rapporté par 'Abdullah : Chaque fois que le Prophète (ﷺ) allait se coucher, il posait sa main – c’est-à-dire sa main droite – sous sa joue puis disait : « Allahumma qini ‘adhabaka yawm tab’athu – [ou : tajma’u] – ‘ibadaka (Ô Allah, protège-moi de Ton châtiment le jour où Tu ressusciteras – ou rassembleras – Tes serviteurs). »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah] bahwa apabila Nabi shallallahu 'alaihi wasallam hendak pergi ke tempat tidurnya, beliau meletakkan tangannya -yaitu yang kanan- di bawah pipinya, lalu beliau mengucapkan: \"Allahumma qinii 'adzaabaka yauma tab'ats au tajma' 'ibadaka (Ya Allah, lindungilah aku dari adzab-Mu pada hari saat Engkau bangkitkan -atau kumpulkan- para hamba-Mu)",
          "tr": "Abdullah (bin Mes'ud) (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) yatağına girdiği zaman elini (yani sağ elini sağ) yanağının altına kordu. Sonra: «Allahumme Kıni azabeke yevme teb'asu (ev tecmau) ibadeke Dua'nın meali: Allahım! Kullarını diriIteceğin (veya toplayacağın) gün beni azabından koru» duasını okurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedinin ravileri güveniıır zatlar• dır. Fakat sened munkati (kopuk)tur. Çünkü Ebli Ubeyde, babası (İbn•l-Mes'ud) (r.a.)'dan hiçbir hadis işitmemiştir. Bu, yani AbduIIah (r.a.)'ın hadisi Zevaid türündendir. Ancak bunun bir benzerini Ebu Davud, Hz. Hafsa (r.anha)'dan rivayet etmiştir. Oradaki metin mealen şöyledir: \"Resulullah (Sallallahu Aleyhi ve Sellem) yatmak istediği zaman sağ elini (sağ) yanağının aItına kor, sonra: -Allahım! Kullarını dirilteceğin gün beni azabından koru. duasını üç kere okurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 3878,
      "arabicNumber": 3878,
      "book": 34,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي عُمَيْرُ بْنُ هَانِئٍ، حَدَّثَنِي جُنَادَةُ بْنُ أَبِي أُمَيَّةَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ تَعَارَّ مِنَ اللَّيْلِ فَقَالَ حِينَ يَسْتَيْقِظُ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ ثُمَّ دَعَا رَبِّ اغْفِرْ لِي - غُفِرَ لَهُ ‏\"‏ ‏.‏ قَالَ الْوَلِيدُ أَوْ قَالَ ‏\"‏ دَعَا اسْتُجِيبَ لَهُ فَإِنْ قَامَ فَتَوَضَّأَ ثُمَّ صَلَّى قُبِلَتْ صَلاَتُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Ubadah bin As-Samit said:“The Messenger of Allah (ﷺ) said: ‘Whoever wakes up in the morning and says upon waking: La ilaha illallah wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa ‘ala kulli shay’in Qadir; Subhan-Allah walhamdu lillahi, wa la ilaha illallahu, wa Allahu Akbar, wa la hawla wa la quwwata illa billahil-‘Aliyil-‘Azim (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion and all praise is to Him, and He is Able to do all things. Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, Allah is the Most Great, and there is no power and no strength except with Allah, the Most High, the Most Supreme), then he supplicates Rabbighfirli (O Lord, forgive me), he will be forgiven.’” Walid said: “Or he said: then if he supplicated, it will be answered for him then if he stood up and performed ablution and then performed prayer, his prayer would be accepted.”",
          "ur": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو رات میں بیدار ہو اور آنکھ کھلتے ہی یہ دعا پڑھے: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم» اللہ کے علاوہ کوئی معبود برحق نہیں، وہ یکتا ہے اس کا کوئی شریک نہیں، اسی کے لیے بادشاہت ہے، اور اسی کے لیے حمد و ثنا ہے، وہی ہر چیز پر قادر ہے، اللہ کی پاکی بیان کرتا ہوں، تمام تعریفیں اللہ ہی کے لیے ہیں، اللہ کے سوا کوئی معبود برحق نہیں، اللہ ہی سب سے بڑا ہے، طاقت و قوت اللہ بلند و برتر کی توفیق ہی سے ہے پھر یہ دعا پڑھے: «رب اغفر لي» اے رب مجھ کو بخش دے ، تو وہ بخش دیا جائے گا، ولید کہتے ہیں: یا یوں کہا: اگر وہ دعا کرے تو اس کی دعا قبول ہو گی، اور اگر اٹھ کر وضو کرے، پھر نماز پڑھے تو اس کی نماز قبول ہو گی۔",
          "fr": "Rapporté par ‘Ubadah bin As-Samit : Le Messager d’Allah (ﷺ) a dit : « Celui qui se réveille le matin et dit en se levant : La ilaha illallah wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa ‘ala kulli shay’in Qadir ; Subhan-Allah walhamdu lillahi, wa la ilaha illallahu, wa Allahu Akbar, wa la hawla wa la quwwata illa billahil-‘Aliyil-‘Azim (Nul n’a le droit d’être adoré sauf Allah seul, sans associé. À Lui la royauté et la louange, et Il est capable de toute chose. Gloire à Allah, louange à Allah, nul n’a le droit d’être adoré sauf Allah, Allah est le Plus Grand, et il n’y a de force ni de puissance qu’en Allah, le Très-Haut, le Très-Grand), puis il invoque : Rabbighfirli (Ô Seigneur, pardonne-moi), il sera pardonné. » Walid a dit : « Ou il a dit : puis s’il invoque, il sera exaucé, puis s’il se lève, fait ses ablutions et prie, sa prière sera acceptée. »",
          "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku ['Umair bin Hani`] telah menceritakan kepadaku [Junadah bin Abu Umayyah] dari ['Ubadah bin Shamit] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa terbangun di malam hari, dan ketika terbangun ia mengucapkan; \"Tidak ada ilah selain Allah yang Maha Esa, yang tidak ada sekutu bagi-Nya. Milik-Nya kerajaan dan bagi-Nya segala pujian, dan Dia Maha Kuasa atas segala sesuatu. Maha Suci Allah, d an segala puji bagi Allah serta tidak ada ilah selain Allah dan Allah Maha Besar. Tiada daya dan upaya melainkan Allah yang Maha Agung.\" Kemudian dia berdo'a; \"Ya Allah, ampunilah aku.\" Niscaya ia akan di ampuni.\" Al Walid berkata; \"atau beliau bersabda: \"Jika ia berdo'a, niscaya do'anya akan di kabulkan. Dan jika ia bangun untuk berwudlu' lalu shalat, maka shalatnya pasti di terima",
          "tr": "Ubade bin es-$amit (r.a.)'den rivayet ediIdiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim geceleyin uykudan uyanır (veya bir taraftan diğer tarafa dönerek uyanır) da uyandığı zaman: \"La ilahe illallahu vahdehu la şerike leh. Lehu'l-Mulku ve lehu'l-hamdu ve huve ala kulli şey'in kadir. Sübhanallahi ve'l-hamdu lillahi ve la ilahe illallahu vallahu ekber ve la havle ve la kuvvete illa bilIahi'l-Aliyyu'l-Azim'' deyip sonra \"Rabbiğfir li'' diye dua ederse günahları bağışlanır.» Ravi el-Velid: Veya O, (bu son cümle yerine): \"Sonra dua ederse onun duası (muhakkak) kabul olunur» buyurdu, demiştir. (Nebi (Sallallahu Aleyhi ve Sellem) daha sonra şöyle buyurdu: Eğer adam (yukardaki dullları okuduktan) sonra kalkıp abdest alır, sonra namaz kılarsa namazı (muhakkak) kabul olunur. Meali: Allah'tan başka ilah yoktur, O tekdir, ortağı yoktur. Mülk (hakimiyet) O'nundur, hamd O'nundur ve O, her şeye kadirdir. Ben Allah'ın her türlü noksanlıklardan ve eksikliklerden pak ve nezih olduğuna inanırım, hamd Allah'adır, Allah'tan başka ilah yoktur, Allah her şey'den büyüktür. Günahlardan dönüş ve kulluk görevinin ifasına güç ancak yüksek ve azametli Allah (ın yardımı) iledir. - Ey Rabbim, beni bağışla Diğer tahric:; Buhari, Tirmizi, Ebu Davud ve Nesai de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 3879,
      "arabicNumber": 3879,
      "book": 34,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، أَنْبَأَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ رَبِيعَةَ بْنَ كَعْبٍ الأَسْلَمِيَّ، أَخْبَرَهُ أَنَّهُ، كَانَ يَبِيتُ عِنْدَ بَابِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَكَانَ يَسْمَعُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ مِنَ اللَّيْلِ ‏\"‏ سُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ ‏\"‏ ‏.‏ الْهَوِيَّ ثُمَّ يَقُولُ ‏\"‏ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Rabi’ah bin Ka’b Al-Aslami narrated that he used to spend the night outside the door of the Messenger of Allah (ﷺ), and he used to hear the Messenger of Allah (ﷺ) saying at night:“Subhan Allahi Rabbil-‘alamin (Glory is to Allah, the Lord of the worlds),” repeating that for a while, then he said: Subhan Allahi wa bihamdihi (Glory and praise is to Allah).”",
          "ur": "ربیعہ بن کعب اسلمی رضی اللہ عنہ خبر دیتے ہیں کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے دروازے کے پاس رات گزارتے تھے اور رات کو بڑی دیر تک آپ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنتے: «سبحان الله رب العالمين» پھر فرماتے: «سبحان الله وبحمده» ۱؎۔",
          "fr": "Rapporté par Rabi’ah bin Ka’b Al-Aslami : Il racontait qu’il passait la nuit devant la porte du Messager d’Allah (ﷺ), et il entendait le Messager d’Allah (ﷺ) dire pendant la nuit : « Subhan Allahi Rabbil-‘alamin (Gloire à Allah, le Seigneur des mondes) », répétant cela un moment, puis il disait : « Subhan Allahi wa bihamdihi (Gloire et louange à Allah). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah memberitakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] bahwa [Rabi'ah bin Ka'b Al Aslami] telah mengabarkan bahwa dirinya pernah bermalam di depan pintu rumah Rasulullah shallallahu 'alaihi wasallam, dan dia mendengar Rasulullah shallallahu 'alaihi wasallam membaca do'a di malam hari: \"Al Hamdulillahi rabbil 'alamin (Segala puji bagi Allah Rabb semesta alam.\" Suatu waktu di malam hari beliau mengucapkan: \"Subhanallah wa bihamdih (Maha Suci Allah dan segala puji bagi-Nya)",
          "tr": "Rebia bin Malik (bin Ka'b) el-Eslemi (r.a.)'den rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'in kapısı yanında gecelerdi ve Resulullah (Sallallahu Aleyhi ve Sellem)'in geceleyin uzun süre «Sübhanaılahi Rabbilalemin = Alemlerin Rabbı olan AIlah'ı tesbih ederim (her türlü noksanlıklardan ve eksikliklerden pak olduğuna inanırım) zikrini, daha sonra da (uzun süre) Sübhanallahi ve bi hamdihi = AIlah'a hamdederek O'nu tesbih ederim» zikrini işitirdi. Bu hadisin benzerini; Nesai, Tirmizi ve Ahmed de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 3880,
      "arabicNumber": 3880,
      "book": 34,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا انْتَبَهَ مِنَ اللَّيْلِ قَالَ ‏ \"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Hudhaifah said:“Whenever the Messenger of Allah (ﷺ) woke up in the morning, he would say: ‘Al-hamdu lillahil-ladhi ahyana ba’dama amatana wa ilayhi’n-nushur (Praise is to Allah Who has given us life after taking it from us, and unto Him is the Resurrection).’”",
          "ur": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب رات کو جاگتے تو یہ دعا پڑھتے: «الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور» تمام تعریف اس اللہ کے لیے ہے جس نے ہم کو ( نیند کی صورت میں ) موت طاری کرنے کے بعد دوبارہ زندہ کیا، اور اسی کی طرف اٹھ کر جا نا ہے ۱؎۔",
          "fr": "Rapporté par Hudhaifah : Chaque fois que le Messager d’Allah (ﷺ) se réveillait le matin, il disait : « Al-hamdu lillahil-ladhi ahyana ba’dama amatana wa ilayhi’n-nushur (Louange à Allah qui nous a redonné la vie après nous l’avoir retirée, et vers Lui est la Résurrection). »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Abdul Malik bin 'Umair] dari [Rib'i bin Hirasy] dari [Hudzaifah] dia berkata; \"Jika Rasulullah shallallahu 'alaihi wasallam terbangum di malam hari, beliau mengucapkan: \"Al Hamdulillahilladzii ahyaana ba'da maa amatana wailaihi nusyur (Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah tempat kembali)",
          "tr": "Huzeyfe (bin el-Yeman) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) geceleyin uyandığı zaman: \"El-hamdu lillahi'l-lezi ahyana ba'de ma ematena ve ileyhi'n-nuşur = Bizi öldürdükten (Yami uyuttuktan) sonra dirilten (yani uyandıran) Allah'a hamd olsun, öldükten sonra dirilmek de (böylece) O'na (ait) dir.\" dedi, Bu Hadisi ayrıca Buhari. Tirmizi ve Ahmed de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 3881,
      "arabicNumber": 3881,
      "book": 34,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو الْحُسَيْنِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي ظَبْيَةَ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا مِنْ عَبْدٍ بَاتَ عَلَى طُهُورٍ ثُمَّ تَعَارَّ مِنَ اللَّيْلِ فَسَأَلَ اللَّهَ شَيْئًا مِنْ أَمْرِ الدُّنْيَا أَوْ مِنْ أَمْرِ الآخِرَةِ إِلاَّ أَعْطَاهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Mu’adh bin Jabal that the Messenger of Allah (ﷺ) said:“There is no person who goes to bed in a state of purity, then wakes up at night, and asks Allah for something in this world or the Hereafter, but it will be given to him.”",
          "ur": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی بندہ رات کو باوضو سوئے، اور پھر رات میں اٹھ کر اللہ تعالیٰ سے دنیا و آخرت کی کسی چیز کا سوال کرے تو اللہ تعالیٰ اسے دیتا ہے ۔",
          "fr": "Rapporté par Mu’adh bin Jabal : Le Messager d’Allah (ﷺ) a dit : « Toute personne qui se couche en étant en état de pureté, puis se réveille la nuit et demande quelque chose à Allah, que ce soit pour cette vie ou pour l’au-delà, Allah le lui accordera. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Al Husain] dari [Hammad bin Salamah] dari ['Ashim bin Abu An Nujud] dari [Syahr bin Hausyab] dari [Abu Dzabyah] dari [Mu'adz bin Jabal] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba tidur di malam hari dalam keadaan suci, kemudian ia terbangun di tengah malam, lalu ia memohon sesuatu kepada Allah dari perkara dunia atau perkara akhirat, niscaya akan di berikan kepadanya",
          "tr": "Muaz bin Cebel (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Abdestli olarak geceleyin yatan, sonra geceleyin uykudan uyanan (veya uykuda iken bir taraftan diğer tarafa dönerek uyanan) ve uyandığında dünya işlerinden veya ahiret işlerinden (hayırlı) bir şeyi Allah'tan isteyen hiçbir (müslüman) kul yoktur ki Allah onun istediğini vermesin.» (Yani mutlaka verir), Bu hadis ayrıca: Ebu Davud ve Nesai tarafından da rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 3882,
      "arabicNumber": 3882,
      "book": 34,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، حَدَّثَنِي هِلاَلٌ، مَوْلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، عَنْ أُمِّهِ، أَسْمَاءَ ابْنَةِ عُمَيْسٍ قَالَتْ عَلَّمَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ كَلِمَاتٍ أَقُولُهُنَّ عِنْدَ الْكَرْبِ ‏ \"‏ اللَّهُ اللَّهُ رَبِّي لاَ أُشْرِكُ بِهِ شَيْئًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Asma’ bint ‘Umais said:“The Messenger of Allah (ﷺ) taught me some words to say at times of distress: Allah! Allahu Rabbi la ushriku bihi shay’an (Allah, Allah is my Lord, I do not associate anything with Him).”",
          "ur": "اسماء بنت عمیس رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے یہ کلمات سکھائے کہ میں سخت تکلیف کے وقت پڑھا کروں، ( وہ کلمات یہ ہیں ) «الله الله ربي لا أشرك به شيئا» اللہ، اللہ ہی میرا رب ہے میں اس کے ساتھ کسی کو شریک نہیں ٹھہراتی",
          "fr": "Rapporté par Asma’ bint ‘Umais : Le Messager d’Allah (ﷺ) m’a appris des paroles à dire dans les moments de détresse : « Allah ! Allahu Rabbi la ushriku bihi shay’an (Allah, Allah est mon Seigneur, je n’associe rien à Lui). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Muhammad bin Bisyr]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] semuanya dari [Abdul Aziz bin Umar bin Abdul Aziz] telah menceritakan kepadaku [Hilal bekas budak Umar bin Abdul Aziz] dari [Umar bin Abdul Aziz] dari [Abdullah bin Ja'far] dari [ibunya Asma' binti 'Umais] dia berkata; Rasulullah shallallahu 'alaihi wasallam mengajariku beberapa kalimat yang aku baca ketika sedang susah, yaitu; \"Allah, Allah Rabbi, laa usyrik bihi syai`a. (Allah, Allah, Robbku, aku tidak menyekutukan-Nya dengan sesuatu apapun)",
          "tr": "Esma bint-i Umeys (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bana üzüntü zamanında söyleyeceğim kelimeleri öğretti: \"Allahu, Allahu Rabbi La uşriku bihi aheda\" (Allah, Allah Rabbimdir O'na hiçbir şeyi ortak koşmam.,.) Diğer tahric: Bu hadisi; Ebu Davud, Nesai ve Tabari de rivayet etmişlerdir. Tabari' de bu zikrin üç defa okunması kaydı vardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 3883,
      "arabicNumber": 3883,
      "book": 34,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ عِنْدَ الْكَرْبِ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ سُبْحَانَ اللَّهِ رَبِّ السَّمَوَاتِ السَّبْعِ وَرَبِّ الْعَرْشِ الْكَرِيمِ ‏\"‏ ‏.‏ قَالَ وَكِيعٌ مَرَّةً لاَ إِلَهَ إِلاَّ اللَّهُ فِيهَا كُلِّهَا ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Abbas that the Prophet (ﷺ) used to say at times of distress:“La ilaha illallahul-Halimul-Karim, Subhan-Allahi Rabbil-‘Arshil-‘Azim, Subhan-Allahi Rabbil-samawatis-sab’i wa Rabbil-‘Arshil-Azim (None has the right to be worshipped but Allah, the Forbearing, the Most Generous; glory is to Allah the Lord of the Mighty Throne; glory is to Allah, the Lord of the seven heavens and the Lord of the Magnificent Throne).” Waki’ said with each wording La ilaha illallahu (none has the right to be worshipped but Allah) is to be included",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم سخت تکلیف کے وقت یہ ( دعا ) پڑھتے تھے: «لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم سبحان الله رب السموات السبع ورب العرش الكريم» اللہ حلیم ( برد بار ) و کریم ( کرم والے ) کے سوا کوئی معبود برحق نہیں ہے، پاکی بیان کرتا ہوں عرش عظیم کے رب اللہ کی، پاکی بیان کرتا ہوں ساتوں آسمان اور عرش کریم کے رب اللہ کی ۔ وکیع کی ایک روایت میں ہے کہ ہر فقرے کے شروع میں ایک ایک بار «لا إله إلا الله» ہے۔ ۱؎",
          "fr": "Rapporté par Ibn ‘Abbas : Le Prophète (ﷺ) disait dans les moments de détresse : « La ilaha illallahul-Halimul-Karim, Subhan-Allahi Rabbil-‘Arshil-‘Azim, Subhan-Allahi Rabbil-samawatis-sab’i wa Rabbil-‘Arshil-Azim (Nul n’a le droit d’être adoré en dehors d’Allah, le Doux, le Généreux ; gloire à Allah, le Seigneur du Trône immense ; gloire à Allah, le Seigneur des sept cieux et du Trône magnifique). » Waki’ a précisé que pour chaque version, il faut inclure « La ilaha illallahu (nul n’a le droit d’être adoré en dehors d’Allah) »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Hisyam pemilik Ad Dastuwa`i] dari [Qatadah] dari [Abu 'Aliyah] dari [Ibnu 'Abbas] bahwa ketika Nabi shallallahu 'alaihi wasallam dalam kesulitan, beliau akan mengucapkan: \"Tidak ada ilah selain Allah, yang Maha Lembut lagi Maha Mulia. Maha suci Allah, Rabb pemilik 'Arsy yang agung, Maha suci Allah, Rabb langit yang tujuh dan Rabb 'Arsy yang mulia.\" Waki' berkata; \"Suatu kali (beliau mengucapkan): \"Laa ilaaha illallah (Tidak ada ilah yang berhak di sembah selain Allah), \" sebab di dalamnya terkandung segalanya",
          "tr": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem). sıkıntı, meşakkat olduğunda şu zikri yapardı: \"LA ilahe illallahu'I-HaIimu'I-Kerim. Sübhanallahi Rabbi'l-Arşi'l¬Azim. Sübhanallahi Rabbi's-semavati's-seb'i ve Rabbi'I-Arşi'I-kerim.'' Meali: Halim, Kerim olan Allah'tan başka ilah yoktur. Ben azametli Arş'ın Rabbı olan Allah'ı tesbih (noksanlıklardan tenzih) ederim, Ben yedi göğün Rabbı ve güzel Arş'ın Rabbı olan Allah'ı tesbih ederim. Ravi Veki, bu zikrin hepsinde \"La ilahe ilIallah\" kelimesini bir defa söylemiştir.\" Diğer tahric: Bu hadisi; Buhari, Müslim, Tirmizi ve Nesai de rivayet etmişlerdir. (zikir lafızları farklıdır)"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 3884,
      "arabicNumber": 3884,
      "book": 34,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنْ أُمِّ سَلَمَةَ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا خَرَجَ مِنْ مَنْزِلِهِ قَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أَزِلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَىَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Umm Salamah that whenever he left his house, the Prophet (ﷺ) would say:“Allahumma inni a’udhu bika an adilla aw azilla, aw azlima aw uzlama, aw ajhala aw yujhala ‘alayya (O Allah, I seek refuge with You from going astray or stumbling, from wronging others or being wronged, and from behaving or being treated in an ignorant manner).”",
          "ur": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب گھر سے باہر تشریف لے جاتے تو یہ دعا پڑھتے: «اللهم إني أعوذ بك أن أضل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل علي» اے اللہ! میں تیری پناہ چاہتا ہوں اس بات سے کہ میں راہ بھٹک جاؤں یا پھسل جاؤں، یا کسی پر ظلم کروں، یا کوئی مجھ پر ظلم کرے، یا میں جہالت کروں، یا کوئی مجھ سے جہالت کرے ۔",
          "fr": "Rapporté par Umm Salamah : Chaque fois qu’il quittait sa maison, le Prophète (ﷺ) disait : « Allahumma inni a’udhu bika an adilla aw azilla, aw azlima aw uzlama, aw ajhala aw yujhala ‘alayya (Ô Allah, je cherche protection auprès de Toi contre l’égarement ou la chute, contre le fait de commettre une injustice ou d’en subir une, et contre l’ignorance ou le fait d’être traité avec ignorance). »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Abidah bin Humaid] dari [Manshur] dari [As Sya'bi] dari [Ummu Salamah] bahwa apabila Nabi shallallahu 'alaihi wasallam keluar dari rumahnya, beliau mengucapkan: \"Allahumma inni a'uudzubika an adzilla au azilla, au adzlima au udzlama, au ajhala au yujhala 'alaya (Ya Allah, aku berlindung kepada-Mu dari ketersesatan atau ketergelinciran, atau dari berbuat kedzaliman maupun di dzalimi atau berbuat kebodohan maupun di bodohi)",
          "tr": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) evinden çıktığı zaman: « اللّهُمَّ! إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أَزِلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ. أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ ''Allahumme inni euzu bike en adille ev eziIle ev azlime ev uzlame ev echile ev yüchele aleyye''» diyerek dua ederdi. Meali: Allahım! Ben dalalete düşmekten, ayak kaymasınden, (kimseye) zulüm etmekten, (kimse tarafından) bana zulüm edilmekten, cahilce davranınaktan ve (başkası tarafından) aleyhimde cahilce davranılmaktan şüphesiz sana sığınınm. Diğer tahric: Bu hadisi; Tirmizi, Ebu. Davud ve Nesai de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 3885,
      "arabicNumber": 3885,
      "book": 34,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ حُسَيْنِ بْنِ عَطَاءِ بْنِ يَسَارٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ ‏ \"‏ بِسْمِ اللَّهِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ التُّكْلاَنُ عَلَى اللَّهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that whenever he left his house, the Prophet (ﷺ) would say:“Bismillah, la hawla wa la quwwata illa billah, at-tuklanu ‘ala Allah (In the Name of Allah, there is no power and strength except with Allah, and trust is placed in Allah).”",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب گھر سے باہر تشریف لے جاتے تو یہ دعا پڑھتے: «بسم الله لا حول ولا قوة إلا بالله التكلان على الله» اللہ کے نام سے ( میں نکل رہا ہوں ) گناہوں سے بچنے اور نیکی کرنے کی طاقت، اللہ تعالیٰ کی مدد اور قوت کے بغیر ممکن نہیں، اللہ ہی پر بھروسہ ہے ۔",
          "fr": "Rapporté par Abu Hurairah : Chaque fois qu’il quittait sa maison, le Prophète (ﷺ) disait : « Bismillah, la hawla wa la quwwata illa billah, at-tuklanu ‘ala Allah (Au nom d’Allah, il n’y a de force et de puissance qu’en Allah, et la confiance est placée en Allah). »",
          "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Abdullah bin Husain bin 'Atha` bin Yasar] dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] bahwa apabila Rasulullah shallallahu 'alaihi wasallam apabila keluar dari rumahnya beliau mengucapkan: \"Bismillah laa haula walaa quwwata illa billahi at tuklanu 'alallah (Dengan nama Allah, tidak ada daya dan upaya kecuali dengan kehendak Allah, dan bersandar kepada Allah)",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) evinden çıktığı zaman ‘’ بِسْمِ اللهِ، لاَحَوْلَ وَلاَ قُوَّةَ إِلاَّ باللهِ. التُّكْلانُ عَلَى اللهِ Bismillahi, la havle ve la kuvvete illa billah. Et-Tuklanu alallah’’ duasını okurdu. Dua’nın Meali:Allah'ın isminden yardım dilerim. Günahlardan dönüş ve kulluk görevine takat ancak Allah'ın yardımıyladır, Dayanmak Allah'adır.\" Not: Zevaid'de şöyle denilmiştir: Bunun isnadında bulunan Abdullah bin Hüseyin'i Ebü Zur'a, Buhri ve İbn-i Hibban zayı! saymışjardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 3886,
      "arabicNumber": 3886,
      "book": 34,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، حَدَّثَنِي هَارُونُ بْنُ هَارُونَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِذَا خَرَجَ الرَّجُلُ مِنْ بَابِ بَيْتِهِ - أَوْ مِنْ بَابِ دَارِهِ - كَانَ مَعَهُ مَلَكَانِ مُوَكَّلاَنِ بِهِ فَإِذَا قَالَ بِسْمِ اللَّهِ ‏.‏ قَالاَ هُدِيتَ ‏.‏ وَإِذَا قَالَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏ قَالاَ وُقِيتَ ‏.‏ وَإِذَا قَالَ تَوَكَّلْتُ عَلَى اللَّهِ قَالاَ كُفِيتَ قَالَ فَيَلْقَاهُ قَرِينَاهُ فَيَقُولاَنِ مَاذَا تُرِيدَانِ مِنْ رَجُلٍ قَدْ هُدِيَ وَكُفِيَ وَوُقِيَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:“When a man goes out of the door of his house, there are two angels with him who are appointed over him. If he says Bismillah (in the Name of Allah) they say: ‘You have been guided.’ If he says La hawla wa la quwwata illa billah (there is no power and no strength except with Allah), they say: ‘You are protected.’ If he says, Tawwakaltu ‘ala Allah (I have my trust in Allah), they say: ‘You have been taken care of.’ Then his two Qarins (satans) come to him and they (the two angels) say: ‘What do you want with a man who has been guided, protected and taken care of?’”",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب آدمی اپنے گھر یا اپنے مکان کے دروازے سے باہر نکلتا ہے، تو اس کے ساتھ دو فرشتے مقرر ہوتے ہیں، جب وہ «بسم الله» کہتا ہے تو وہ دونوں فرشتے کہتے ہیں: تو نے سیدھی راہ اختیار کی، اور جب وہ آدمی «لا حول ولا قوة إلا بالله»کہتا ہے تو وہ فرشتے کہتے ہیں کہ اب تو ہر آفت سے محفوظ ہے اور جب آدمی «توكلت على الله» کہتا ہے، تو وہ دونوں فرشتے کہتے ہیں کہ اب تجھے کسی اور کی مدد کی حاجت نہیں، اس کے بعد اس شخص کے دونوں شیطان جو اس کے ساتھ رہتے ہیں وہ اس سے ملتے ہیں تو یہ فرشتے ان سے کہتے ہیں کہ اب تم اس کے ساتھ کیا کرنا چاہتے ہو جس نے سیدھا راستہ اختیار کیا، تمام آفات و مصائب سے محفوظ ہو گیا، اور اللہ کی مدد کے علاوہ دوسرے کی مدد سے بے نیاز ہو گیا اور ہر ایک آفت و مصیبت سے بچا لیا گیا۔",
          "fr": "Rapporté par Abu Hurairah : Le Prophète (ﷺ) a dit : « Quand un homme sort de chez lui, deux anges sont chargés de l’accompagner. S’il dit “Bismillah (au nom d’Allah)”, ils disent : “Tu as été guidé.” S’il dit “La hawla wa la quwwata illa billah (il n’y a de force et de puissance qu’en Allah)”, ils disent : “Tu es protégé.” S’il dit “Tawwakaltu ‘ala Allah (je place ma confiance en Allah)”, ils disent : “Tu es pris en charge.” Ensuite, ses deux Qarins (démons) viennent à lui, et les deux anges disent : “Que voulez-vous d’un homme qui a été guidé, protégé et pris en charge ?” »",
          "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] telah menceritakan kepada kami [Ibnu Abu fudaik] telah menceritakan kepadaku [Harun bin Harun] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika seseorang keluar dari pintu rumahnya atau dari pintu tempat tinggalnya, maka dia akan di sertai oleh dua Malaikat yang diwakilkan dengannya, jika ia mengatakan; \"Bismillah (dengan menyebut nama Allah), \" maka dua malaikat tersebut akan menjawab; \"Kamu telah di beri petunjuk.\" Jika ia mengucapkan; \"Laa haula walaa quwwata illa billah (Tidak ada daya dan upaya kecuali dengan kehendak Allah), \" maka kedua Malaikat tersebut akan berkata; \"Kamu telah di lindungi.\" Jika ia mengucapkan; \"Tawakaltu 'alallah (saya bertawakal kepada Allah).\" Maka kedua Malaikat tersebut akan berkata; \"Kamu telah di cukupi).\" Beliau bersabda: \"Kemudian jika dua qarinnya menemuinya, maka kedua Malaikat tersebut akan mengatakan; \"Apa yang akan hendak kalian perbuat dari seseorang yang telah di beri petunjuk, dan di cukupi serta di lindungi ini?",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Adam evinin kapısından çıktığı zaman görevlendirilmiş iki melek onunla beraber olurlar. Bu itibarla adam \"Bismillah = Allah'ın ismiyle\" dediği zaman o iki melek kendisine: Hidayete, doğru yola erdirildin, derler. Sonra adam \"La havle ve la kuvvete illa billah = Günahlardan dönüş ve kulluk görevine kuvvet ancak Allah'ın yardımıyladır\" deyince melekler ona: Korundun, derler. Adam: \"Tevekkeltu alallah O Allah'a dayandırn\" deyince de melekler ona: işin görüldü, derler. (Nebi (Sallallahu Aleyhi ve Sellem) buyruğuna devamla şöyle der) Sonra iki karini (yani onu günaha sürüklemek isteyen insi ve cinni iki şeytanı) ona rastlarlar. Melekler (o şeytanlara): Hidayete erdirilen, işi (Allah tarafından) görülen ve muhafaza edilen bir adam'dan ne istersiniz? derler. (yani onu sapıtamazsınız).' Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Harun bin Harun bin AbdilIalı bulunur. Bu ravi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 3887,
      "arabicNumber": 3887,
      "book": 34,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ قَالَ الشَّيْطَانُ لاَ مَبِيتَ لَكُمْ وَلاَ عَشَاءَ ‏.‏ وَإِذَا دَخَلَ وَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ أَدْرَكْتُمُ الْمَبِيتَ ‏.‏ فَإِذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ قَالَ أَدْرَكْتُمُ الْمَبِيتَ وَالْعَشَاءَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Jabir bin ‘Abdullah that he heard the Prophet (ﷺ) say:“When a man enters his house, and remembers Allah when he enters and when he eats, Satan says: ‘You have no place to stay and no supper.’ If he enters his house and does not remember Allah upon entering, Satan says: ‘You have found a place to stay.’ And if he does not remember Allah when he eats, (Satan) says: ‘You have found a place to stay and supper.’”",
          "ur": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: جب آدمی گھر میں داخل ہوتے وقت اور کھانا کھاتے وقت اللہ کا ذکر کرتا ( یعنی بسم اللہ کہتا ) ہے، تو شیطان اپنے لشکر سے کہتا ہے کہ آج یہاں نہ تمہاری رات گزر سکتی ہے ( یعنی نہ سونے کی جگہ تم کو مل سکتی ہے ) اور نہ تمہیں کھانا مل سکتا ہے، اور جب آدمی گھر میں بغیر اللہ کا ذکر کئے ( یعنی بغیر بسم اللہ کہے ) داخل ہوتا ہے، تو شیطان ( اپنے لشکر سے ) کہتا ہے کہ تم نے سونے کی جگہ پا لی، اگر آدمی کھانے کے وقت بھی اللہ کا نام نہیں لیتا ہے، تو شیطان کہتا ہے کہ تم نے کھانے اور سونے دونوں کی جگہ پا لی ۔",
          "fr": "Rapporté par Jabir bin ‘Abdullah : Il a entendu le Prophète (ﷺ) dire : « Quand un homme entre chez lui et se souvient d’Allah en entrant et en mangeant, le diable dit : “Tu n’as ni endroit où dormir ni dîner.” S’il entre sans se souvenir d’Allah, le diable dit : “Tu as trouvé un endroit où dormir.” Et s’il ne se souvient pas d’Allah en mangeant, le diable dit : “Tu as trouvé un endroit où dormir et aussi le dîner.” »",
          "id": "Telah menceritakan kepada kami [Abu Bisyr Bakr bin Khalaf] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Jika seseorang memasuki rumahnya kemudian dia berdzikir kepada Allah ketika masuk dan ketika makan, maka setan akan berkata (kepada kawannya); \"Tidak ada tempat menginap bagi kalian dan tidak ada makan malam.\" Jika ia masuk (rumahnya) tanpa berdzikir kepada Allah ketika memasukinya, maka setan akan berkata (kepada kawannya); \"Kalian telah mendapatkan tempat menginap.\" Dan jika ia tidak berdzikir kepada Allah ketika makan, setan pun akan berkata (kepada kawannya); \"Kalian telah mendapatkan tempat menginap dan makan malam",
          "tr": "Cabir bin Abdillah (r.a.)'dan rivayet edildiğine göre kendisi Nebi (Sallallahu Aleyhi ve Sellem)'den şu buyruğu işitmiştir: Adam kendi evine girip de girdiği zaman ve (akşam) yemeğini yediği zaman Allah'ı anınca şeytan, (yardımcılarına): (bu evde) sizin için ne gecelenecek yer ne de akşam yemeği var, der. Adam (evine) girip de girdiği zaman Allah'ı anmayınca, şeytan (yardımcılarına): Geceyi geçireceğiniz yere kavuştunuz, der. Sonra adam (akşam) yemeğini yiyeceği zaman Allah'ı anmayınca şeytan (yardımeııarına): Geceleyeceğiniz yere ve akşam yemeğine ulaştınız, der. Diğer tahric: Bu hadisi; Müslim, Ebu Davud ve Ahmed bin Hanbel de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 3888,
      "arabicNumber": 3888,
      "book": 34,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، وَأَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ - وَقَالَ عَبْدُ الرَّحِيمِ يَتَعَوَّذُ - إِذَا سَافَرَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَالْحَوْرِ بَعْدَ الْكَوْرِ وَدَعْوَةِ الْمَظْلُومِ وَسُوءِ الْمَنْظَرِ فِي الأَهْلِ وَالْمَالِ ‏\"‏ ‏.‏ وَزَادَ أَبُو مُعَاوِيَةَ فَإِذَا رَجَعَ قَالَ مِثْلَهَا ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Abdullah bin Sarjis said:“The Messenger of Allah (ﷺ) used to say” – and (one of the narrators) ‘Abdur-Rahim said: “he used to seek refuge” – “when he traveled: ‘Allahumma inni a’udhu bika min wa’tha’is-safar, wa ka’abatil-munqalab, wal-hawri ba’dal-kawr, wa da’watil-mazlum, wa su’il-manzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from decrease after increase, from the prayer of the one who has been wronged, and seeing some calamity befall my family or wealth).’” (One of the narrators) Abu Mu’awiyah added: “And when he returned he said likewise.”",
          "ur": "عبداللہ بن سرجس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب سفر کرتے تو یہ دعا پڑھتے: ( اور عبدالرحیم کی روایت میں ہے کہ آپ پناہ مانگتے تھے ) :«اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال» اے اللہ! میں تیری پناہ چاہتا ہوں سفر کی صعوبتوں اور مشقتوں سے، واپسی کے غم سے، ترقی کے بعد تنزلی سے، اور مظلوم کی بد دعا سے اور اہل و عیال کے سلسلے میں برا منظر دیکھنے سے ۔ اور ابومعاویہ کی روایت میں یہ اضافہ ہے کہ سفر سے لوٹتے وقت بھی یہی دعا پڑھتے",
          "fr": "Rapporté par ‘Abdullah bin Sarjis : Le Messager d’Allah (ﷺ) avait l’habitude de dire – et (l’un des rapporteurs) ‘Abdur-Rahim a précisé : « il cherchait protection » – lorsqu’il voyageait : « Allahumma inni a’udhu bika min wa’tha’is-safar, wa ka’abatil-munqalab, wal-hawri ba’dal-kawr, wa da’watil-mazlum, wa su’il-manzari fil-ahli wal-mal (Ô Allah, je cherche protection auprès de Toi contre les difficultés du voyage, la tristesse du retour, la diminution après l’abondance, l’invocation de l’opprimé, et contre le malheur qui pourrait frapper ma famille ou mes biens). » (Un des rapporteurs) Abu Mu’awiyah a ajouté : « Et quand il revenait, il disait la même chose. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abndurrahim bin Sulaiman] dan [Abu Mu'awiyah] dari ['Ashim] dari [Abdullah bin Sarjis] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda -Abdurrahim bin Sulaiman mengatakan; berta'awudz- jika hendak bepergian: \"Ya Allah, aku berlindung kepada-Mu dari kesusahan dalam kesusahan dan kesedihan, kekurangan setelah penambahan, do'a orang yang terdzalimi serta keburukan akan penilaian terhadap harta benda dan keluarga.\" Abu Mu'awiyah menambahkan; \"Dan jika beliau hendak kembali, beliau juga membaca seperti itu",
          "tr": "Abdullah bin Sercis (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) yolculuğa çıktığı zaman: « اللّهُمَّ! إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآَبِةَ الْمُنْقَبِ، وَالْحورِ بَعْدَ الْكَوْرِ، وَدَعْوَةِ الْمَظْلُومِ، وَسُوءِ الْمَنْظَرِ فِي الأَهْلِ وَالْمَالِ Allahumme inni euzu bike min va'sai's-seferi ve keabeti'l-munkeabe ve'l-havri ba'de'l-kevri ve da'veti'l-mazlumi ve sui'l-manzari fil ehli ve'I-mali» derdi (ravi Abdurrahim kendi rivayetinde, \"Derdi\" cümlesi yerine, \"taavvuz ederdi, yani Allah'a sığınırdı\" demiştir). Ravi Ebü Muaviye şunu ilave etmiştir: \"Nebi yolculuktan döndüğü zaman da bu duaşı okurdu.\" Dua'nın Meali: Dua'nın Meali: Allahım! Ben, yolculuğun meşakkat ve sıkıntısından, üzüntülü döııüşten, düzenli işlerin bundan sonra bozulmasından, mazlumun bedduasından ve ev halkı ile mal (fena maksadlı kişiler tarafından olan) kötü bakıştan sana sığınırım. Diğer tahric: Bu hadisi; Müslim, Tirmizi ve Nesai de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 3889,
      "arabicNumber": 3889,
      "book": 34,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ الْمِقْدَامِ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا رَأَى سَحَابًا مُقْبِلاً مِنْ أُفُقٍ مِنَ الآفَاقِ تَرَكَ مَا هُوَ فِيهِ وَإِنْ كَانَ فِي صَلاَتِهِ حَتَّى يَسْتَقْبِلَهُ فَيَقُولُ ‏\"‏ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ شَرِّ مَا أُرْسِلَ بِهِ ‏\"‏ ‏.‏ فَإِنْ أَمْطَرَ قَالَ ‏\"‏ اللَّهُمَّ سَيْبًا نَافِعًا ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثَةً وَإِنْ كَشَفَهُ اللَّهُ عَزَّ وَجَلَّ وَلَمْ يُمْطِرْ حَمِدَ اللَّهَ عَلَى ذَلِكَ ‏.‏",
        "translations": {
          "en": "‘Aishah narrated that when the Prophet (ﷺ) saw a cloud approaching from any horizon, he would stop what he was doing, even if he was praying, and turn to face it, then he would say:“Allahumma inna na’udhu bika min sharri ma ursila bihi (O Allah, we seek refuge with You from the evil of that with which it is sent).” Then if it rained he would say: “Allahumma sayyiban nafi’an (O Allah, a beneficial rain),” two or three times. And if Allah dispelled it and it did not rain, he would praise Allah for that",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب آسمان کے کسی کنارے سے اٹھتے بادل کو دیکھتے تو جس کام میں مشغول ہوتے اسے چھوڑ دیتے، یہاں تک کہ اگر نماز میں ( بھی ) ہوتے تو بادل کی طرف چہرہ مبارک کرتے، اور یہ دعا ما نگتے: «اللهم إنا نعوذ بك من شر ما أرسل به» اے اللہ ہم تیری پناہ مانگتے ہیں اس چیز کے شر سے جو اس کے ساتھ بھیجی گئی ہے پھر اگر بارش شروع ہو جاتی تو فرماتے: «اللهم سيبا نافعا» اے اللہ جاری اور فائدہ دینے والا پانی عنایت فرما ، دو یا تین مرتبہ یہی الفاظ دہراتے اور اگر اللہ تعالیٰ بادل ہٹا دیتا اور بارش نہ ہوتی تو آپ صلی اللہ علیہ وسلم اس پر اللہ کا شکر ادا کرتے ۱؎۔",
          "fr": "Rapporté par ‘Aishah : Quand le Prophète (ﷺ) voyait un nuage venir de n’importe quel horizon, il arrêtait ce qu’il faisait, même la prière, et se tournait vers le nuage, puis il disait : « Allahumma inna na’udhu bika min sharri ma ursila bihi (Ô Allah, nous cherchons protection auprès de Toi contre le mal de ce avec quoi il a été envoyé). » Si la pluie tombait, il disait : « Allahumma sayyiban nafi’an (Ô Allah, une pluie bénéfique) », deux ou trois fois. Et si Allah dissipait le nuage sans qu’il pleuve, il remerciait Allah pour cela",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Al Miqdam bin Syuraih] dari [ayahnya Al Miqdam] dari [ayahnya] bahwa ['Aisyah] telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam apabila beliau melihat awan gelap yang begerak di ufuk di antara ufuk yang tinggi, maka beliau meninggalkan semua kegiatannya meski dalam shalat, sampai menatapnya dan berdo'a: \"Ya Allah, kami berlindung kepada-Mu dari keburukan yang Engkau datangkan bersamanya.\" Jika turun hujan, maka beliau berdo'a: \"Allahumma shaiban naafi'a (Ya Allah jadikanlah curahan yang penuh keberkahan).\" (beliau membacanya) dua kali atau tiga kali. Dan jika Allah Azza Wa Jalla menghilangkannya dan tidak jadi turun hujan, maka beliau (bersyukur) memuji Allah atas semua itu",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) ufuklardan herhangi birisinden gelen bir bulutu gördüğü zaman onu karşılamak ve şu duayı okumal{ üzere namazında bile olsaydı içinde bulunduğu işi bırakırdı. Sonra: Allahumme inna nauzu bike min şerri ma ürsile bihi « Allahımız! şu bulut ile gönderilen (yağmur, dolu ve benzerin) in şerrinden şüphe:aiz sana sığınırız» derdi. Sonra yağmur yağsaydı iki veya üç kere: Allahım! Bu yağmuru yer yüzünde akan, yararlı bir yağmur eyle. derdi. Şayet Allah (Azze ve Celle) havayı açıp yağnur yağdırmasaydı bunun içi.~ Allah'a hamdederdi. Diğer tahric: Bu hadis Ebu Davud ve Nesai tarafından da rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 3890,
      "arabicNumber": 3890,
      "book": 34,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبِ بْنِ أَبِي الْعِشْرِينَ، حَدَّثَنَا الأَوْزَاعِيُّ، أَخْبَرَنِي نَافِعٌ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، أَخْبَرَهُ عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ إِذَا رَأَى الْمَطَرَ قَالَ ‏ \"‏ اللَّهُمَّ اجْعَلْهُ صَيِّبًا هَنِيئًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Aishah that when the Messenger of Allah (ﷺ) saw rain, he would say:“Allahumma aj’alhu sayyiban hani’an (O Allah, make it a wholesome rain cloud).”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب بارش کو دیکھتے تو فرماتے: «اللهم اجعله صيبا هنيئا» اے اللہ! تو اس کو جاری اور بابرکت بنا ۔",
          "fr": "Rapporté par ‘Aishah : Quand le Messager d’Allah (ﷺ) voyait la pluie, il disait : « Allahumma aj’alhu sayyiban hani’an (Ô Allah, fais-en une pluie bienfaisante). »",
          "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Abdul Hamid bin Habib bin Abu Al 'Isyrin] telah menceritakan kepada kami [Al Auza'i] telah mengabarkan kepadaku [Nafi'] bahwa [Al Qasim bin Muhammad] telah mengabarkan dari ['Aisyah] bahwa apabila Rasulullah shallallahu 'alaihi wasallam melihat hujan turun, beliau berdo'a: \"Allahummaj'alhu shaiyyiban hani`an (Ya Allah, jadikanlah curahan hujan yang menyejukkan)",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) yağmur gördüğü zaman: «Allahın! Bu yağmuru, yer yüzünde akıcı, faydalı amaca uygun ve zararsız bir yağmur eyle» derdi. Bu hadis Nesai tarafından da rivayet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 3891,
      "arabicNumber": 3891,
      "book": 34,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا رَأَى مَخِيلَةً تَلَوَّنَ وَجْهُهُ وَتَغَيَّرَ وَدَخَلَ وَخَرَجَ وَأَقْبَلَ وَأَدْبَرَ فَإِذَا أَمْطَرَتْ سُرِّيَ عَنْهُ ‏.‏ قَالَ فَذَكَرَتْ لَهُ عَائِشَةُ بَعْضَ مَا رَأَتْ مِنْهُ فَقَالَ ‏\"‏ وَمَا يُدْرِيكِ لَعَلَّهُ كَمَا قَالَ قَوْمُ هُودٍ ‏{فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ }‏ ‏\"‏ ‏.‏ الآيَةَ",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“If the Messenger of Allah (ﷺ) saw a cloud that looked as if it was bringing rain, the color of his face would change, and he would go in and out and walk to and fro. Then, if it rained, he would feel relieved.” ‘Aishah mentioned to him what she had seen him do, and he said: “How do you know? Perhaps it would be as the people of Hud said: ‘Then, when they saw it as a dense cloud coming towards their valleys, they said: “This is a cloud bringing us rain!” Nay, but it is that (torment) which you were asking to be hastened.” [46:]",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب بادل کو دیکھتے تو ( تردد و پریشانی کی وجہ سے ) آپ کے چہرہ مبارک کا رنگ بدل جاتا، کبھی اندر تشریف لے جاتے کبھی باہر، کبھی آگے جاتے کبھی پیچھے، پھر جب بارش ہونے لگتی تو آپ کی یہ کیفیت ختم ہو جاتی، عائشہ رضی اللہ عنہا نے آپ صلی اللہ علیہ وسلم سے آپ کی اس کیفیت کا ذکر کیا جسے انہہوں نے دیکھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اے عائشہ تجھے کیا معلوم؟ ہو سکتا ہے یہ وہی ہو جسے دیکھ کر قوم ہود نے کہا تھا: «فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا بل هو ما استعجلتم به» تو جب ان لوگوں نے بادل کو اپنی وادیوں کی طرف آتے دیکھا تو کہنے لگے: یہ بادل ہے جو ہم پر پانی برسائے گا، ( نہیں اس میں پانی نہیں تھا ) بلکہ وہ چیز ( یعنی عذاب ) ہے جس کی تم جلدی مچا رہے تھے ( سورۃ الاحقاف: ۲۴ ) ۔",
          "fr": "Rapporté par ‘Aishah : Si le Messager d’Allah (ﷺ) voyait un nuage qui semblait apporter la pluie, la couleur de son visage changeait, il entrait et sortait, marchait de long en large. Puis, s’il pleuvait, il se sentait soulagé. ‘Aishah lui a parlé de ce qu’elle avait remarqué, et il a dit : « Comment sais-tu ? Peut-être que cela serait comme ce que le peuple de Hud a dit : “Puis, quand ils le virent comme un nuage épais venant vers leurs vallées, ils dirent : ‘Voici un nuage qui va nous apporter de la pluie !’ Non, c’est plutôt ce que vous cherchiez à hâter : un châtiment.” [46:] »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Mu'adz bin Mu'adz] dari [Ibnu Juraij] dari ['Atha`] dari ['Asiyah] dia berkata; Apabila Rasulullah shallallahu 'alaihi wasallam melihat mendung yang akan menurunkan hujan, maka raut wajah beliau berubah, beliau akan keluar-masuk, berjalan ke depan dan ke belakang. Dan apabila hujan telah turun, maka beliau sangat bergembira dengannya.\" Ibnu Juraij berkata; Kemudian 'Aisyah menanyakan apa yang di lihatnya dari sikap beliau!.\" Maka beliau menjawab: \"Apa yang mungkin kamu tahu (tentang apa yang akan terjadi)? Mungkin saja mendung itu sebagaimana yang di katakan oleh kaumnya Hud, yaitu; \"Maka tatkala mereka melihat adzab itu berupa awan yang menuju ke lembah-lembah mereka, berkatalah mereka; \"inilah awan yang akan menurunkan hujan kepada kami. (Bukan), bahkan itulah adzab yang kamu minta supaya datang dengan segera.\" QS Al Ahqaf;",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) yağışlı sanılan bir bulut görünce (ümmetine bir Metin gelmesinden endişelenerek) çehresi renkten renge girip değişir, (eve) girip çıkar ve buluta karşı durup geri dönerdi. Buluttan yağmur yağınca üzüntüsü giderilirdi. Ravi. demiştir ki: Sonra Aişe (r.anha), O'ndan gördüğü (bu hal ve endişesi'nin bazısını O'na anlatmış. Bunun üzerine Resül-i Ekrem (Aişe'ye) şöyle buyurdu: «Ne bilirsin? Belki 0, (şu ayette azab olduğu bildirilen, fakat Hüd kavminin (onu bir bulut parçası sanarak) dediği gibi bir şeydir: Onlar o azıibı (içinde bulundukları) vadilerine doğnı gelen, yaygın bir bulut olarak görünce : \"Bu, bize yağmur getiren bir yaygın buluttur, dediler. (Hüd dedi ki:) Bi'l-akis bu, acele istediğiniz azabtır.\"\" (Ahkaaf)"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 65
      }
    },
    {
      "hadithNumber": 3892,
      "arabicNumber": 3892,
      "book": 34,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ خَارِجَةَ بْنِ مُصْعَبٍ، عَنْ أَبِي يَحْيَى، عَمْرِو بْنِ دِينَارٍ - وَلَيْسَ بِصَاحِبِ ابْنِ عُيَيْنَةَ - مَوْلَى آلِ الزُّبَيْرِ عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ فَجِئَهُ صَاحِبُ بَلاَءٍ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلاً - عُوفِيَ مِنْ ذَلِكَ الْبَلاَءِ كَائِنًا مَا كَانَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Umar that the Messenger of Allah (ﷺ) said:“Whoever unexpectedly comes across a person suffering a calamity, and says: Al-hamdu Lillahil-ladhi ‘afani mim-mabtalaka bihi, wa faddalani ‘ala kathirin mimman khalaqa tafdila (Praise is to Allah Who has kept me safe from that which has afflicted you and preferred me over many of those whom He has created), will be kept safe from that calamity, no matter what it is.’”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب کوئی شخص اچانک کسی کو بلایا مصیبت میں مبتلا دیکھے تو یہ دعا پڑھے: «الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا» تمام تعریفیں اس اللہ کے لیے ہیں جس نے مجھے عافیت دی اس چیز سے جس میں تجھ کو مبتلا کیا، اور مجھے اپنی بہت سی مخلوقات پر فضیلت بخشی ، تو وہ اس بلا اور مصیبت سے محفوظ رہے گا، چاہے کوئی بھی بلا اور مصیبت ہو ۱؎۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) a dit : « Celui qui croise par surprise une personne touchée par une épreuve et dit : Al-hamdu Lillahil-ladhi ‘afani mim-mabtalaka bihi, wa faddalani ‘ala kathirin mimman khalaqa tafdila (Louange à Allah qui m’a préservé de ce dont tu souffres et m’a favorisé par rapport à beaucoup de ceux qu’Il a créés), sera protégé de cette épreuve, quelle qu’elle soit. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Kharijah bin Mush'ab] dari [Abu Yahya 'Amru bin Dinar] -tidak termasuk dari teman Ibnu 'Uyainah- yaitu bekas budak Az Zubair, dari [Salim] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa dikejutkan oleh orang yang tertimpa musibah, kemudian dia mengucapkan; \"Segala puji bagi Allah yang telah menyelamatkanku dari musibah yang menimpamu, dan memberi kelebihan kepadaku atas semua yang di ciptakan-Nya dengan kelebihan yang sempurna.\" Maka dia akan diselamatkan dari musibah itu bagaimanapun juga",
          "tr": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: « Kim, başına bir bela gelen bir kimseye aniden rastlar da: الْحَمْدُ للهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ، وُفَضَّلَنِي عَلَى كَثَيرٍ ممَّنْ خَلَقَ تَفْضِيلاً \"El-hamdu lillahi'l-lezi afani mimmebtelake bihi ve faddalani ala kesirin mimmen halaka tefdiylen = Senin başına getirdiği beladan beni selamette kılan ve beni yaratıklarının bir çoğundan gerçekten üstün tutan Allah'a hamd olsun\" derse o bela ne olursa olsun o kimse ondan (ömür boyu) selamette kılınır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Very Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 34,
        "hadith": 66
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "57KB"
  }
}