{
  "collection": "majah",
  "book": 10,
  "name": {
    "arabic": "كتاب The Chapters on Divorce",
    "transliteration": "the chapters on divorce",
    "translation": "The Chapters on Divorce"
  },
  "totalHadith": 78,
  "hadithNumberRange": {
    "first": 2016,
    "last": 2477
  },
  "content": [
    {
      "hadithNumber": 2016,
      "arabicNumber": 2016,
      "book": 10,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ، وَمَسْرُوقُ بْنُ الْمَرْزُبَانِ، قَالُوا حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ صَالِحِ بْنِ صَالِحِ بْنِ حَىٍّ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ طَلَّقَ حَفْصَةَ ثُمَّ رَاجَعَهَا ‏.‏",
        "translations": {
          "en": "It was narrated from 'Umar bin Khattab that:the Messenger of Allah divorced Hafsah then took her back",
          "ur": "عمر بن خطاب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ام المؤمنین حفصہ رضی اللہ عنہا کو طلاق دے دی پھر رجوع کر لیا۔",
          "fr": "Rapporté par 'Umar bin Khattab : Le Messager d’Allah a divorcé de Hafsah puis l’a reprise",
          "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] dan [Abdullah bin Amir bin Zurarah] dan [Masruq bin Al Marzuban] mereka berkata; telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] dari [Shalih bin Shalih bin Hay] dari [Salamah bin Kuhail] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari [Umar bin Khaththab] berkata, \"Pernah Rasulullah shallallahu 'alaihi wasallam menceraikan Hafshah kemudian merujuknya kembali",
          "tr": "Ömer hin el-Hattâb (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) (Ömer bin el-Hattâb'ın kızı) Hafsa (r.anha)'yı (rec'î talâk ile) boşadı, sonra ona rücû (dönüş) yaptı. Diğer tahric: Ebu Davud, talak (2283); Darimi, talak EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 2017,
      "arabicNumber": 2017,
      "book": 10,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُؤَمَّلٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَا بَالُ أَقْوَامٍ يَلْعَبُونَ بِحُدُودِ اللَّهِ يَقُولُ أَحَدُهُمْ قَدْ طَلَّقْتُكِ قَدْ رَاجَعْتُكِ ‏.‏ قَدْ طَلَّقْتُكِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Musa that:the Messenger of Allah said: What is wrong with people who play with the limits imposed by Allah, and one of them says: \"I divorce you, I take you back, I divorce you?",
          "ur": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ان لوگوں کا کیا حال ہے جو اللہ کے حدود سے کھیل کرتے ہیں، ان میں سے ایک اپنی بیوی سے کہتا ہے: میں نے تجھے طلاق دے دی پھر تجھ سے رجعت کر لی، پھر تجھے طلاق دے دی ۔",
          "fr": "Rapporté par Abu Musa : Le Messager d’Allah a dit : \"Qu’arrive-t-il à des gens qui jouent avec les limites fixées par Allah, et l’un d’eux dit : 'Je te divorce, je te reprends, je te divorce' ?",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Mu`ammal] berkata, telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenapa mereka mempermainkan hudud Allah. Salah seorang dari mereka berkata, 'Aku telah menceraikanmu, aku telah merujukmu, aku telah menceraikanmu",
          "tr": "Ebu Musa (el-Eş'ârî) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Bâzı kimselere ne oluyor ki Allah'ın kanunları ile oynuyorlar. Onlardan birisi (karısına): Seni boşadım. Sana rücu (dönüş) yaptım. Seni boşadım, diyor.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi hasendir. Ravi Müemmel bin İsmail'in sikalığı ihtilaflıdır. Onun sika olduğu söylendiği gibi hatasının çokluğu da söylenmiştir. Bir kavle göre hadisleri münkerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 2018,
      "arabicNumber": 2018,
      "book": 10,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ الْوَلِيدِ الْوَصَّافِيِّ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَبْغَضُ الْحَلاَلِ إِلَى اللَّهِ الطَّلاَقُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin 'Umar that:the Messenger of Allah said: \"The most hated of permissible things to Allah is divorce",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: حلال چیزوں میں اللہ کے نزدیک سب سے زیادہ ناپسندیدہ اور مبغوض چیز طلاق ہے ۔",
          "fr": "Rapporté par 'Abdullah bin 'Umar : Le Messager d’Allah a dit : \"La chose permise la plus détestée par Allah est le divorce",
          "id": "Telah menceritakan kepada kami [Katsir bin Ubaid Al Himshi] berkata, telah menceritakan kepada kami [Muhammad bin Khalid] dari [Ubaidullah bin Al Walid Al Washshafi] dari [Muharib bin Ditsar] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perkara halal yang paling dibenci Allah adalah talak",
          "tr": "Abdullah bin Ömer (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: *Helâl (yâni haram olmayan) şeyler içinde Allah Teâlâ'nın ençok buğzettiği şey (sebebsiz yere yapılan) boşamadır.» Diğer tahric: Ebu Davud, talak (2178); Beyhakî, es-Sünenü'l-kübra, VII, 322; Hakim, Müstedrek, II, 196. EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 2019,
      "arabicNumber": 2019,
      "book": 10,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ طَلَّقْتُ امْرَأَتِي وَهِيَ حَائِضٌ فَذَكَرَ ذَلِكَ عُمَرُ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ مُرْهُ فَلْيُرَاجِعْهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ ثُمَّ تَطْهُرَ ثُمَّ إِنْ شَاءَ طَلَّقَهَا قَبْلَ أَنْ يُجَامِعَهَا وَإِنْ شَاءَ أَمْسَكَهَا فَإِنَّهَا الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Umar said:\"I divorced my wife when she was menstruating. 'Umar mentioned that to the Messenger of Allah and he said: 'Tell him to take her back until she becomes pure (i.e., her period ends), then she has her period (again), then she becomes pure (again), then if he wishes he may divorce her before having sexual relations with her, and if he wishes he may keep her. This is the waiting period that Allah has enjoined",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ میں نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی، عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں حکم دو کہ اپنی بیوی سے رجوع کر لیں یہاں تک کہ وہ عورت حیض سے پاک ہو جائے پھر اسے حیض آئے، اور اس سے بھی پاک ہو جائے، پھر ابن عمر اگر چاہیں تو جماع سے پہلے اسے طلاق دے دیں، اور اگر چاہیں تو روکے رکھیں یہی عورتوں کی عدت ہے جس کا اللہ نے حکم دیا ہے ۱؎۔",
          "fr": "Rapporté par Ibn 'Umar : J’ai divorcé de ma femme alors qu’elle avait ses règles. 'Umar en a parlé au Messager d’Allah et il a dit : \"Dis-lui de la reprendre jusqu’à ce qu’elle soit purifiée (c’est-à-dire que ses règles se terminent), puis qu’elle ait de nouveau ses règles, puis qu’elle soit purifiée (encore), alors s’il veut, il peut la divorcer avant d’avoir des relations avec elle, et s’il veut, il peut la garder. C’est la période d’attente qu’Allah a prescrite",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Aku telah mencerai isteriku padahal ia sedang haid.\" Lalu Umar menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Perintahkanlah ia untuk merujuknya hingga kembali suci, kemudian haid, kemudian suci, kemudian mencerainya sebelum ia mensetubuhinya kembali, atau tetap menahannya sebagai isteri jika ia mau, itulah iddah yang Allah telah perintahkan",
          "tr": "(Abdullah) bin Ömer (r.a.)'den; Şöyle demiştir: Karım aybaşı âdeti içinde iken ben onu (bir talâk ile) boşadım. (Babam) Ömer bu durumu Resulullah (Sallallahu Aleyhi ve Sellem)'» anlattı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) : «Oğlun Abdullah'a emret, karısına geri dönsün, sonra kadın temizlenip tekrar aybaşı adetini görüp bundan sonra tekrar temizleninceye kadar onunla birlikte yaşasın. (kadın ikinci kez adetten temizlendikten) Sonra oğlun dilerse onunla cinsel ilişkide bulunmaksızın boşayabilir. Dilerse onunla aile hayatını sürdürebilir. İşte kadının ikinci kez adetten temizlenip henüz bu temizlik halinde onunla cinsel ilişkide bulunmaksızın onu boşamak, Allah'ın müsade ettiği iddet'in başlamasına elverişli olan boşanmadır.» Diğer tahric edenler: Buhari, Müslim, Tirmizi, Ebu Davud, Nesai, Muvatta ve Şafii EBU DAVUD’DAKİ İBN-İ ÖMER’İN BU VAKASINA DAİR HADİSLER VE İZAH: 2179 – 2180 – 2181 – 2182 – 2183 – 2184 –"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 2020,
      "arabicNumber": 2020,
      "book": 10,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ طَلاَقُ السُّنَّةِ أَنْ يُطَلِّقَهَا طَاهِرًا مِنْ غَيْرِ جِمَاعٍ ‏.‏",
        "translations": {
          "en": "It was narrated that Abdullah said:\"Divorce according to the Sunnah means divorcing her when she is pure, ( i.e., not menstruating) and without having had intercourse with her (during that cycle)",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ طلاق سنی یہ ہے کہ عورت کو اس طہر میں ایک طلاق دے جس میں اس سے جماع نہ کیا ہو ۱؎۔",
          "fr": "Rapporté par Abdullah : Le divorce selon la Sunna consiste à divorcer d’elle quand elle est pure (c’est-à-dire, sans menstruations) et sans avoir eu de rapports avec elle pendant cette période",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dari [Abu Ishaq] dari [Abul Ahwash] dari [Abdullah] ia berkata, \"Talak yang sunah adalah seseorang mentalak (isterinya) dalam keadaan suci dan belum disetubuhi",
          "tr": "Abdullah (bin Mes'ûd) (r.a.)'den; Şöyle demiştir: Sünnet (hadîs)'e uygun olan boşama karısı (aybaşı ve lohusalık hâlinden) temiz iken ve onunla cinsel temasta bulunmaksızın erkeğin ettiği boşamadır. Nesai de bunu rivayet etti. AÇIKLAMA 2021’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 2021,
      "arabicNumber": 2021,
      "book": 10,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ طَلاَقُ السُّنَّةِ يُطَلِّقُهَا عِنْدَ كُلِّ طُهْرٍ تَطْلِيقَةً فَإِذَا طَهُرَتِ الثَّالِثَةَ طَلَّقَهَا وَعَلَيْهَا بَعْدَ ذَلِكَ حَيْضَةٌ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Abdullah said:\"Divorce according to the Sunnah means divorcing her with one divorce in each cycle when she is pure, then when she becomes pure the third time, then he pronounces divorce again, and after that she must wait one more menstrual cycle",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں طلاق سنی یہ ہے کہ عورت کو ہر طہر میں ایک طلاق دے، جب تیسری بار پاک ہو تو آخری طلاق دیدے، اور اس کے بعد عدت ایک حیض ہو گی ۱؎۔",
          "fr": "Rapporté par 'Abdullah : Le divorce selon la Sunna consiste à prononcer un divorce à chaque cycle quand elle est pure, puis quand elle devient pure la troisième fois, il prononce à nouveau le divorce, et après cela, elle doit attendre encore un cycle menstruel",
          "id": "Telah menceritakan kepada kami [Ali bin Maimun Ar Raqi] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al A'masy] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah] ia berkata tentang talak sunnah, \"Setiap kali suci suami menjatuhkan satu talak, jika tiba masa suci yang ketiga, ia menceraikannya, dan setelahnya isterinya dipastikan mempunyai kebiasaan haid",
          "tr": "Abdullah (bin Mes'ud) (r.a.)'ın sünnet (hadîs)'e uygun boşama hakkında şöyle söylediği kendisinden rivayet edilmiştir: Erkek, karısını her temizlik hâlinde (onunla cima etmeksizin) bir talâkla boşar. Kadın üçüncü kez temizlenince (yine onunla cima etmeksizin) kocası onu (son bir talâkla) boşar. Bu son boşamadan sonra (iddet olarak) kadına bir kere aybaşı âdeti görmesi gerekir. (yâni bir kere hayız görüp temizlenince iddeti bitmiş olur.) Diğer tahric: İbni Mes'ud'un bu iki (2020 ve 2021.) hadisini Nesai de rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 2022,
      "arabicNumber": 2022,
      "book": 10,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ يُونُسَ بْنِ جُبَيْرٍ أَبِي غَلاَّبٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَقَالَ تَعْرِفُ عَبْدَ اللَّهِ بْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَأَتَى عُمَرُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَمَرَهُ أَنْ يُرَاجِعَهَا ‏.‏ قُلْتُ أَيُعْتَدُّ بِتِلْكَ قَالَ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ",
        "translations": {
          "en": "It was narrated that Yunus bin Jubair, Abu Ghallab, said:\"I asked Ibn 'Umar about a man who divorced his wife when she was menstruating. He said: 'Do you know 'Abdullah bin 'Umar? He divorced his wife when she was menstruating then 'Umar came to the Prophet (ﷺ) (and told him what had happened). He ordered him to take her back.' I said: 'Will that be counted (as a divorce)?' He said: 'Do You think he was helpless and behaving foolishly? [i.e., Yes, it counts (as a divorce]",
          "ur": "ابو غلاب یونس بن جبیر کہتے ہیں کہ میں نے ابن عمر رضی اللہ عنہما سے اس شخص کے بارے میں پوچھا جس نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی تو انہوں نے کہا: کیا تم عبداللہ بن عمر رضی اللہ عنہما کو پہچانتے ہو؟ انہوں نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی تھی تو عمر رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے تو آپ صلی اللہ علیہ وسلم نے انہیں حکم دیا تھا کہ ابن عمر رجوع کر لیں، میں نے پوچھا: کیا اس طلاق کا شمار ہو گا؟ انہوں نے کہا: تم کیا سمجھتے ہو، اگر وہ عاجز ہو جائے یا دیوانہ ہو جائے ( تو کیا وہ شمار نہ ہو گی یعنی ضرور ہو گی ) ۔",
          "fr": "Rapporté par Yunus bin Jubair, Abu Ghallab : J’ai demandé à Ibn 'Umar au sujet d’un homme qui a divorcé de sa femme alors qu’elle avait ses règles. Il a dit : \"Connais-tu 'Abdullah bin 'Umar ? Il a divorcé de sa femme alors qu’elle avait ses règles, puis 'Umar est allé voir le Prophète ﷺ (et lui a raconté ce qui s’était passé). Il lui a ordonné de la reprendre.\" J’ai demandé : \"Est-ce que cela compte (comme un divorce) ?\" Il a dit : \"Penses-tu qu’il était incapable et qu’il agissait bêtement ? [C’est-à-dire : Oui, cela compte comme un divorce]",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Abdul A'la] ia berkata; telah menceritakan kepada kami [Hisyam] dari [Muhammad] dari [Yunus bin Jubair Abu Ghallab] ia berkata; Aku bertanya [Ibnu Umar] tentang seorang laki-laki yang mentalak isterinya disaat haid, maka ia pun menjawab, \"Engkau tahu Abdullah bin Umar mencerai isterinya disaat haid, lalu Umar mendatangi Nabi shallallahu 'alaihi wasallam hingga beliau memerintahkannya agar Abdullah bin Umar merujuknya kembali. Aku berkata, \"Apakah ia harus iddah karena hal itu?\" ia menjawab, \"Apa pendapatmu jika ia tidak merujuknya dan berlaku bodoh?",
          "tr": "Yûnus bin Cübeyr Ebû Ğallab (r.a.) şöyle demiştir: Aybaşı âdeti içinde iken karısını boşayan adamın durumunu Abdullah bin Ömer'e sordum. Abdullah (r.a.): Sen Abdullah bin Ömer'i (yâni beni) tanıyor (mu) sun? (İşte Abdullah), karısını hayız hâlinde iken (bir talâkla) boşadı. Sonra (babası) Ömer, Nebi (Sallallahu Aleyhi ve Selîem)'in yanına vararak (durumu arzetti). Bunun üzerine Nebi, Abdullah'ın, karısına geri dönmesini emretti, diye cevap verdi. Ben (Abdullah'a) : (Adam ettiği boşamadan dönüş yapınca) o talak, adamın aleyhinde hesablanır mı? diye sordum Abdullah (r.a.): Eğer adam (boşama yemininden sonra) karısına geri dönmekten âciz ise veya. dönebildiği halde ahmaklık edip dönüş yapmazsa (o talâk adam aleyhinde hesablanmaz mı?) Evet o talâk hesablanır. Diğer tahric: Buhari'den başka Kütüb-i Sitte sahibIeri ve Ahmed bu hadisi rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 2023,
      "arabicNumber": 2023,
      "book": 10,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لِيُطَلِّقْهَا وَهِيَ طَاهِرٌ أَوْ حَامِلٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that:he divorced his wife when she was menstruating, and 'Umar mentioned that to the Prophet (ﷺ). He said: \"Tell him to take her back then divorce her when she is pure (not menstruating) or pregnant",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ انہوں نے اپنی بیوی کو حیض کی حالت میں طلاق دے دی، تو عمر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں حکم دو کہ رجوع کر لیں، پھر طہر کی یا حمل کی حالت میں طلاق دیں ۱؎۔",
          "fr": "Rapporté par Ibn 'Umar : Il a divorcé de sa femme alors qu’elle avait ses règles, et 'Umar en a parlé au Prophète ﷺ. Il a dit : \"Dis-lui de la reprendre puis de la divorcer quand elle est pure (sans règles) ou enceinte",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Muhammad bin 'Abdurrahman] -mantan budak keluarga Thalhah- dari dari [Salim] dari [Ibnu Umar] bahwa ia pernah mencerai isterinya di saat haid, lalu Umar menceritakan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Perintahkanlah agar ia merujuk kembali, kemudian mencerainya disaat suci, atau saat hamil",
          "tr": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Kendisi karısını, aybaşı âdeti içinde iken boşamış. Sonra Ömer (r.a.), durumu Nebi (Sallallahu Aleyhi ve Sellem)'e anlatmış, Nebi (Sallallahu Aleyhi ve Sellem) de: «Oğlun Abdullah'a söyle, karısına geri dönsün. Sonra karısı âdetten temizlenmiş (boy abdesti almış) iken (—onunla cima' etmeksizin—) veya hâmile iken boşasın (boşayabilir)» buyurmuştur. Diğer tahric: Bu hadisi Ahmed, Müslim, Tirmizi, Ebu Davud ve Nesai de rivayet etmişlerdir. Bazı rivayetlerde bulunan lafız değişikliği manayı etkilemez. HADİsİN FıKıH YÖNÜ 1. Kadın ay başı adeti içinde iken onu boşamak haramdır ve hemen ona dönüş yapmak vacibtir. Çünkü Peygamber (s.a.v.). ibni Ömer (r.a.)'in dönüş yapmasını emretmiştir. Ancak bilindiği gibi onun boşaması bir talak ile olmuştu. Üç talakla boşama olmuş ise aybaşı adeti içinde de olsa artık kadına dönüş yapmak mümkün değildir. Böyle bir boşama haram ise de geçerlidir. Tekmile yazarı Sünnet talakı babında rivayet olunan bu hadisin açıklaması bahsinde şöyle der: Nevevi: Kadının rızası olmaksızın hayız halinde ve hamilelik durumu da yok iken onu boşamanın haramlığı hususunda tüm ümmet icma etmiştir. Şayet adam bu durumda karısını boşarsa haram işlemiş olur. Talakı da geçerlidir. Adam karısına dönüş yapmakla mükelleftir. (Tabii boşama üç talakla olmuş ise artık dönüş yapılamaz). Zahiriye mezhebine mensup bazı alimler, hayız halindeki boşama geçersizdir, çünkü böyle bir boşamaya izin verilmemiştir, demişler ise de bu söz muteber değildir. Doğrusu yukarda anlattığım sözdür, demiştir. 2. Karısını aybaşı adeti içinde iken bir veya iki talakla boşayan adam, ona dönüş yapıp adetten çıkılıncaya kadar onunla birlikte yaşaması emrediImiştir. Karısı temizlendikten sonra onu boşamak caizdir. Yani iki kez temizlenmesini beklemeye gerek yoktur. Ebu Hanife'nin kavli budur Şafii ve Ahmed'den alınan birer rivayet de böyledir, 3. Hamile kadını, temiz iken veya aybaşı adeti içinde iken boşamak caizdir ve sünnete yani hadislere uygun boşama sayılır. Cumhurun kavli budur, Hamile kadını boşamanın Sünni bir boşama olmadığına dair bir kavil Ahmed'den rivayet edilmiştir. 4. Rac'at hususunda erkek kendi başına yetkiIidir, Karısının muvafakatı veya velinin aracılığı ve izni gibi şeylere ihtiyaç yoktur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 2024,
      "arabicNumber": 2024,
      "book": 10,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ إِسْحَاقَ بْنِ أَبِي فَرْوَةَ، عَنْ أَبِي الزِّنَادِ، عَنْ عَامِرٍ الشَّعْبِيِّ، قَالَ قُلْتُ لِفَاطِمَةَ بِنْتِ قَيْسٍ حَدِّثِينِي عَنْ طَلاَقِكِ، ‏.‏ قَالَتْ طَلَّقَنِي زَوْجِي ثَلاَثًا وَهُوَ خَارِجٌ إِلَى الْيَمَنِ فَأَجَازَ ذَلِكَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Amir Sha'bi said:\"I said to Fatimah bint Qais: 'Tell me about your divorce.' She said: 'My husband divorced me three times when he was leaving for Yemen, and the Messenger of Allah (ﷺ) allowed that",
          "ur": "عامر شعبی کہتے ہیں کہ میں نے فاطمہ بنت قیس رضی اللہ عنہا سے کہا: آپ مجھ سے اپنی طلاق کے بارے میں بیان کریں، تو انہوں نے کہا: میرے شوہر نے یمن کے سفر پر نکلتے وقت مجھے تین طلاق دی تو رسول اللہ صلی اللہ علیہ وسلم نے اس کو جائز رکھا ۱؎۔",
          "fr": "Rapporté par 'Amir Sha'bi : J’ai dit à Fatimah bint Qais : \"Raconte-moi ton divorce.\" Elle a dit : \"Mon mari m’a divorcée trois fois quand il partait pour le Yémen, et le Messager d’Allah ﷺ a permis cela",
          "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Ishaq bin Abu Farwah] dari [Abu Az Zanad] dari [Amir bin Asy Sya'bi] ia berkata, \"Aku berkata kepada [Fathimah binti Qais], \"Ceritakanlah kepadaku tentang perceraianmu.\" Ia berkata, \"Suamiku menceraikan aku dengan talak tiga disaat ia keluar menuju Yaman, dan Rasulullah shallallahu 'alaihi wasallam memperbolehkannya",
          "tr": "Amir eş-Şabî (r.a.)'den; Şöyle demiştir: Ben, Fâtıma bint-i Kays (r.anha)'ya Bana boşanman (olayın)ı anlat, dedim. Fâtıma: Kocam Yemen tarafına çıkmış iken beni üç talâkla boşadı. Resulullah (Sallallahu Aleyhi ve Sellem) de bunu geçerli saydı, dedi. Diğer tahric: Bu hadisi Müslim, Ebu Davud, Nesai ve Tahavi de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 2025,
      "arabicNumber": 2025,
      "book": 10,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ الضُّبَعِيُّ، عَنْ يَزِيدَ الرِّشْكِ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، أَنَّ عِمْرَانَ بْنَ الْحُصَيْنِ، سُئِلَ عَنْ رَجُلٍ، يُطَلِّقُ امْرَأَتَهُ ثُمَّ يَقَعُ بِهَا وَلَمْ يُشْهِدْ عَلَى طَلاَقِهَا وَلاَ عَلَى رَجْعَتِهَا ‏.‏ فَقَالَ عِمْرَانُ طَلَّقْتَ بِغَيْرِ سُنَّةٍ وَرَاجَعْتَ بِغَيْرِ سُنَّةٍ أَشْهِدْ عَلَى طَلاَقِهَا وَعَلَى رَجْعَتِهَا ‏.‏",
        "translations": {
          "en": "Imran bin Husain:was asked about a man who divorced his wife then had intercourse with her, and there were no witnesses to his divorcing her or his taking her back. 'Imran said: \"You have divorced (her) in a manner that is not according to the Sunnah, and you have taken her back in a manner that is not according to the Sunnah. Bring people to witness your divorcing her and taking her back",
          "ur": "مطرف بن عبداللہ بن شخیر سے روایت ہے کہ عمران بن حصین رضی اللہ عنہما سے اس شخص کے بارے میں پوچھا گیا جو اپنی بیوی کو طلاق دیدے پھر اس سے جماع کرے، اور اپنی طلاق اور رجعت پہ کسی کو گواہ نہ بنائے؟ تو عمران رضی اللہ عنہ نے کہا: تم نے سنت کے خلاف طلاق دی، اور سنت کے خلاف رجعت کی، اپنی طلاق اور رجعت پہ گواہ بناؤ ۱؎۔",
          "fr": "Rapporté par Imran bin Husain : On lui a demandé à propos d’un homme qui a divorcé de sa femme puis a eu des rapports avec elle, sans témoins pour le divorce ou la reprise. Imran a dit : \"Tu as divorcé d’une manière qui n’est pas conforme à la Sunna, et tu l’as reprise d’une manière qui n’est pas conforme à la Sunna. Fais venir des témoins pour ton divorce et ta reprise",
          "id": "Telah menceritakan kepada kami [Bisyr bin Hilal Ash Shawwaf] berkata, telah menceritakan kepada kami [Ja'far bin Sulaiman Adl Dluba'i] dari [Yazid Ar Risyk] dari [Mutharrif bin Abdullah bin Asy Syikhkhir] bahwa [Imran bin Al Hushain] ditanya tentang seseorang yang menceraikan isterinya kemudian menyetubuhinya dan tidak mengambil saksi atas cerai dan rujuknya. Maka Imran menjawab, \"Kamu telah melakukan perceraian dan rujuk tidak sesuai sunnah. Datangkanlah saksi atas perceraian dan rujuknya",
          "tr": "Mutarrtf bin Abdillah bin eş-Şıhhîr (r.a.)'den rivayet edildiğine göre: İmrân bin el-Husayn (r.a.)'a şöyle bir soru soruldu: Bir adam karısını (bir veya iki talâkla) boşar. Sonra (henüz iddet bitmemiş iken) karısına dönüş yapıp onunla cinsel ilişkide bulunur. Halbuki, adam ne boşamayı ne de rac'atı (geri dönüşü) şâhidlendirmemiş (şâhidlerin huzurunda yapmamış) tır. İmran (r.a.) (bu soruya cevaben) şöyle demiştir: Sen (boşamayı ve karına geri dönüşü şahidlendirmemekle) Peygamber (s.a.v.)'in sünnetine aykırı boşamada bulunmuş ve (yine) O'nun sünnetine aykırı rec'atta bulunmuşsun. Kadını boşarnayı ve ona rec'at etmeyi şahidIerin huzurunda yapmalısın, dedi.\" Diğer tahric: Bu hadisi Ebu Davud da rivayet etmiştir. Oradaki rivayette hadisin son cümlesi; \"ve bir daha şahid olmaksızın boşama veya rec'atta bulunma\" şeklindedir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 2026,
      "arabicNumber": 2026,
      "book": 10,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجٍ، حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ أَبِيهِ، عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ، أَنَّهُ كَانَتْ عِنْدَهُ أُمُّ كُلْثُومٍ بِنْتُ عُقْبَةَ فَقَالَتْ لَهُ وَهِيَ حَامِلٌ طَيِّبْ نَفْسِي بِتَطْلِيقَةٍ ‏.‏ فَطَلَّقَهَا تَطْلِيقَةً ثُمَّ خَرَجَ إِلَى الصَّلاَةِ فَرَجَعَ وَقَدْ وَضَعَتْ ‏.‏ فَقَالَ مَالَهَا خَدَعَتْنِي خَدَعَهَا اللَّهُ ثُمَّ أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ سَبَقَ الْكِتَابُ أَجَلَهُ اخْطُبْهَا إِلَى نَفْسِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Zubair bin 'Awwam that:he was married to Umm Kulthum bint 'Uqbah, and she said to him when she was pregnant. \"I will accept one divorce.\" So he divorced her once. Then he went out for prayer, and when he came back she had given birth. He said: \"What is wrong with her? She misled me may Allah mislead her!\" Then he came to the Prophet (ﷺ), who said: \"Her waiting period is over (and she is divorced); propose marriage a new to her",
          "ur": "زبیر بن عوام رضی اللہ عنہ سے روایت ہے کہ ان کی زوجیت میں ام کلثوم بنت عقبہ تھیں، انہوں نے حمل کی حالت میں زبیر رضی اللہ عنہ سے کہا: مجھے ایک طلاق دے کر میرا دل خوش کر دو، لہٰذا انہوں نے ایک طلاق دے دی، پھر وہ نماز کے لیے نکلے جب واپس آئے تو وہ بچہ جن چکی تھیں تو زبیر رضی اللہ عنہ نے کہا: اسے کیا ہو گیا؟ اس نے مجھ سے مکر کیا ہے، اللہ اس سے مکر کرے، پھر وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا: کتاب کی میعاد گزر گئی ( اب رجوع کا اختیار نہیں رہا ) لیکن اسے نکاح کا پیغام دے دو ۱؎۔",
          "fr": "Rapporté par Zubair bin 'Awwam : Il était marié à Umm Kulthum bint 'Uqbah, et elle lui a dit alors qu’elle était enceinte : \"J’accepte un seul divorce.\" Il l’a donc divorcée une fois. Puis il est sorti pour la prière, et à son retour elle avait accouché. Il a dit : \"Qu’a-t-elle ? Elle m’a trompé, qu’Allah la trompe !\" Puis il est allé voir le Prophète ﷺ, qui a dit : \"Son délai d’attente est terminé (et elle est divorcée) ; demande-lui sa main à nouveau si tu veux te remarier avec elle",
          "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin Hayyaj] berkata, telah menceritakan kepada kami [Qabishah bin Uqbah] berkata, telah menceritakan kepada kami [Sufyan] dari ['Amr bin Maimun] dari [Bapaknya] dari [Az Zubair bin Al 'Awwam] bahwa waktu itu Ummu Kultsum binti Uqbah adalah sebagai isterinya. Lalu Ummu Kultsum yang sedang hamil berkata kepadanya, \"Tentramkan jiwaku dengan perceraian.\" Lalu ia pun menceraikannya dengan talaq satu, setelah itu ia keluar untuk shalat. Ketika kembali, ternyata isterinya telah melahirkan. Maka Zubair berkata, \"Kenapa dia menipuku, semoga Allah menipunya.\" Kemudian Zubair mendatangi Nabi shallallahu 'alaihi wasallam, beliau lantas bersabda: \"Al Kitab telah mendahului waktunya (iddahnya telah sempurna), maka pinanglah ia kembali",
          "tr": "Zübeyr bin el-Avvâm (r.a.)'den rivayet edildiğine göre: Ümmü Külsum bint-i Ukbe (r.anha) onun nikâhı altında idi. Ümmü Külsum (r.anha) hâmile iken (bir gün) Zübeyr (r.a.)'a: Bir talâkla (beni boşamak sureti ile) nefsimi hoşlandır (gönlümü açıver) diye talebte bulunmuştur. Zübeyr (r.a.) de onu bir talâkla boşadıktan sonra namasa çıkmış ve namazdan dönünceye kadar karısı doğum yapmıştır. Bunun üzerine Zübeyr (r.a.): Bu kadına ne oluyor? Beni aldattı, Allah onun cezasını versin, demiş, sonra Nebi (Sallellahu Aleyhi ve Sellem)'in yanına varmış (da başından geçeni anlatmıştır) Nebi (Sallallahu Aleyhi ve Sellem) ona: «İddet süresi beklenmedik bir anda sona ermiştir. (Artık) sen ona (yeniden) talip ol» buyurmuştur. Not: Zevaid'de şöyle denilmiştir: Bunun senedindeki raviler sika zatlardJr. Fakat sened munkatidir. Ravi Meymun, İbn-i Mihran olan zattır. Meymun'un babası Ebu Eyyub'un Zübeyr'den olan rivayetlerinin mürsel olduğunu el-Mizzi, et-Tehzib'te söylemiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 2027,
      "arabicNumber": 2027,
      "book": 10,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ أَبِي السَّنَابِلِ، قَالَ وَضَعَتْ سُبَيْعَةُ الأَسْلَمِيَّةُ بِنْتُ الْحَارِثِ حَمْلَهَا بَعْدَ وَفَاةِ زَوْجِهَا بِبِضْعٍ وَعِشْرِينَ لَيْلَةً فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَشَوَّفَتْ فَعِيبَ ذَلِكَ عَلَيْهَا وَذُكِرَ أَمْرُهَا لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ إِنْ تَفْعَلْ فَقَدْ مَضَى أَجَلُهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Sanabil said:\"Subai'ah Aslamiyyah bint Harith gave birth twenty-odd days after her husband died. When her postnatal bleeding ended, she adorned herself, and was criticized for doing that. Her case was mentioned to the Prophet (ﷺ) and he said: 'If she does that, then her waiting period is over",
          "ur": "ابوسنابل کہتے ہیں کہ سبیعہ اسلمیہ بنت حارث رضی اللہ عنہا نے اپنے شوہر کی وفات کے بیس سے کچھ زائد دنوں بعد بچہ جنا، جب وہ نفاس سے پاک ہو گئیں تو شادی کی خواہشمند ہوئیں، تو یہ معیوب سمجھا گیا، اور اس کی خبر نبی اکرم صلی اللہ علیہ وسلم کو دی گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا: اگر چاہے تو وہ ایسا کر سکتی ہے کیونکہ اس کی عدت گزر گئی ہے ۔",
          "fr": "Rapporté par Abu Sanabil : Subai'ah Aslamiyyah bint Harith a accouché une vingtaine de jours après le décès de son mari. Quand ses saignements postnataux ont pris fin, elle s'est faite belle, et certaines personnes l'ont critiquée pour cela. On a parlé de son cas au Prophète (ﷺ), qui a dit : \"Si elle fait cela, alors sa période d'attente est terminée",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Abu As Sanabil] ia berkata, \"Subai'ah Al Aslamiah binti Al Harits melahirkan bayi dua puluhan hari setelah meninggalnya sang suami. Setelah masa nifasnya selesai ia berbenah diri (hingga ada seseorang yang mau menikahinya), namun hal itu menuai celaan. Maka diceritakanlah perkaranya kepada Nabi shallallahu 'alaihi wasallam, beliau pun bersabda: \"Jika ia melakukan itu, sungguh masa iddahnya telah selesai",
          "tr": "Ebu's-Senâbil (bin Ba'kek) (r.a.)'den; Şöyle demiştir: Sübey'a el-Eslemiyye bint-i el-Hârîs (r.anha), kocasının vefatından yirmi küsur gece sonra doğum yaptı. Sonra lohusalık hâlinden çıkınca evlenme tekliflerini almaya hazırlandı. Onun bu durumu kınandı ve Resulullah (Sallallahu Aleyhi ve Sellem)'e de anlatıldı. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Eğer (evlenme işini) işlerse (bunu yapabilir) çünkü iddet süresi bitmiştir.» Diğer tahric. Tirmizi, Nesai BU KONUDAKİ MÜSLİM HADİSLERİ VE İZAH: 1484 —"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 2028,
      "arabicNumber": 2028,
      "book": 10,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، وَعَمْرِو بْنِ عُتْبَةَ، أَنَّهُمَا كَتَبَا إِلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ يَسْأَلاَنِهَا عَنْ أَمْرِهَا، فَكَتَبَتْ إِلَيْهِمَا إِنَّهَا وَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِخَمْسَةٍ وَعِشْرِينَ فَتَهَيَّأَتْ تَطْلُبُ الْخَيْرَ فَمَرَّ بِهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ فَقَالَ قَدْ أَسْرَعْتِ اعْتَدِّي آخِرَ الأَجَلَيْنِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏.‏ فَأَتَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي ‏.‏ قَالَ ‏\"‏ وَمِمَّ ذَاكَ ‏\"‏ ‏.‏ فَأَخْبَرْتُهُ ‏.‏ فَقَالَ ‏\"‏ إِنْ وَجَدْتِ زَوْجًا صَالِحًا فَتَزَوَّجِي ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Masruq and 'Amr bin 'Utbah wrote to Subai'ah bint Harith, asking about her case.:She wrote to them saying that she gave birth twenty-five days after her husband died. Then she prepared herself, seeking to remarry. Abu Sanabil bin Ba'kak passed by her and said: \"You are in a hurry; observe waiting period for the longer period, four months and ten days.\" \"So I went to the Prophet (ﷺ) and said: 'O Messenger of Allah, (ﷺ) pray for forgiveness for me.' He said: 'Why is that.” I told him (what had happened). He said: 'If you find a righteous husband then marry him",
          "ur": "مسروق اور عمرو بن عتبہ سے روایت ہے کہ ان دونوں نے سبیعہ بنت حارث رضی اللہ عنہا کو خط لکھا، وہ ان سے پوچھ رہے تھے کہ ان کا کیا معاملہ تھا؟ سبیعہ رضی اللہ عنہا نے ان کو جواب لکھا کہ ان کے شوہر کی وفات کے پچیس دن بعد ان کے یہاں بچہ پیدا ہوا، پھر وہ خیر یعنی شوہر کی تلاش میں متحرک ہوئیں، تو ان کے پاس ابوسنابل بن بعکک گزرے تو انہوں نے کہا کہ تم نے جلدی کر دی، دونوں میعادوں میں سے آخری میعاد چار ماہ دس دن عدت گزارو، یہ سن کر میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی، اور عرض کیا: اللہ کے رسول! میرے لیے دعائے مغفرت کر دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: یہ کس لیے ؟ میں نے صورت حال بتائی تو آپ صلی اللہ علیہ وسلم نے فرمایا: اگر کوئی نیک اور دیندار شوہر ملے تو شادی کر لو ۔",
          "fr": "Rapporté par Masruq et 'Amr bin 'Utbah : Ils ont écrit à Subai'ah bint Harith pour lui demander des précisions sur son cas. Elle leur a répondu qu'elle avait accouché vingt-cinq jours après la mort de son mari. Ensuite, elle s'est préparée dans l'intention de se remarier. Abu Sanabil bin Ba'kak est passé et lui a dit : \"Tu es pressée ; observe la période d'attente la plus longue, soit quatre mois et dix jours.\" \"Je suis donc allée voir le Prophète (ﷺ) et j'ai dit : 'Ô Messager d'Allah (ﷺ), prie pour que je sois pardonnée.' Il a demandé : 'Pourquoi cela ?' Je lui ai expliqué ce qui s'était passé. Il a dit : 'Si tu trouves un homme pieux, alors marie-toi avec lui",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Dawud bin Abu Hind] dari [Asy Sya'bi] dari [Masruq] dan [Amru bin Utbah] bahwa keduanya menulis surat kepada [Subai'ah binti Al Harits], menanyakan perihal perkaranya. Lalu ia ganti menulis surat kepada keduanya bahwa ia telah melahirkan dua puluh lima hari setelah wafatnya sang suami. Setelah itu Subai'ah berbenah diri dan mengharap kebaikan (datangnya suami). Maka lewatlah Abu As Sanabil bin Ba'kak di hadapan Subai'ah seraya berkata, \"Cepat sekali engkau melakukan iddah, beriddahlah engkau dengan batas terakhir dari dua iddah (iddah kematian dan iddah melahirkan), empat bulan sepuluh hari.\" Maka aku pun mendatangi Nabi shallallahu 'alaihi wasallam, aku katakan kepada beliau, \"Wahai Rasulullah, mintakanlah ampun untukku, \" beliau bersabda: \"Ada apa?\" lalu aku ceritakan hal tersebut kepada beliau, hingga beliaupun bersabda: \"Jika engkau mendapatkan calon suami yang baik maka nikahlah",
          "tr": "Mesruk ve Amr bin Utbe (r.a.)'den rivayet edildiğine göre: İkisi Sübey'a bint~i el-Haris (r.anha)'ya mektup yazarak onun iddetiyle ilgili durumunu sordular. Sübey'a (r.anha) onlara şöyle cevap yazdı: Sübey'a, kocasının ölümünden yirmi beş gün sonra doğum yaptı. Sonra da hayırlı bir koca ile evlenmek arzusu ile hazırlandı. Bu esnada Ebü's-Senâbil bin Ba'kek (r.a.), ona uğradı ve (hazırlandığını görünce): Sen acele ettin. Uzun iddet olan dört ay on gün bekle, diyerek (Sübey'a (r.anha)'nın doğum yapmakla iddetten çıkmasına karşı çıktı.) Sübey'a (r.anha) (demiştir ki) Bunun üzerine ben, Nebi (Sallallahu Aleyhi ve Sellem)'in yanına vararak: Yâ Resulallah! Benim için istiğfar buyur, dedim. O: «İstediğin istiğfar ne hakkındadır?» diye sordu. Ben de durumu O'na arz ettim. Bunun üzerine buyurdu ki: «Eğer sen sâlih bir koca bulursan.evlen.» BU KONUDAKİ MÜSLİM HADİSLERİ VE İZAH: 1484 — 1485 EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 2029,
      "arabicNumber": 2029,
      "book": 10,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَمَرَ سُبَيْعَةَ أَنْ تَنْكِحَ إِذَا تَعَلَّتْ مِنْ نِفَاسِهَا ‏.‏",
        "translations": {
          "en": "It was narrated from Miswar bin Makhramah that:the Prophet (ﷺ) told Subai'ah to get married, when her postnatal bleeding ended",
          "ur": "مسور بن مخرمہ رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے سبیعہ رضی اللہ عنہا کو حکم دیا کہ نفاس سے پاک ہونے کے بعد شادی کر لیں ۱؎۔",
          "fr": "Rapporté par Miswar bin Makhramah : Le Prophète (ﷺ) a dit à Subai'ah de se remarier lorsque ses saignements postnataux ont pris fin",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali] dan [Muhammad bin Basysyar] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Dawud] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari [Al Miswar bin Makhramah] berkata, \"Nabi shallallahu 'alaihi wasallam memerintahkan Subai'ah untuk menikah lagi jika ia telah selesai dari nifasnya",
          "tr": "Misver bin Mahrama (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) (kocası ölen) Sübey'a (r.anha)'ya, lohusalığından çıkınca evlenmesini emretti. BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 2030,
      "arabicNumber": 2030,
      "book": 10,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ وَاللَّهِ لَمَنْ شَاءَ لاَعَنَّاهُ لأُنْزِلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ أَرْبَعَةِ أَشْهُرٍ وَعَشْرًا ‏.‏",
        "translations": {
          "en": "It was narrated that' Abdullah bin Mas'ud said:\"By Allah, for those who would like to go through the process of praying for Allah's curse to be upon the one who is wrong, the shorter Surah concerning women[l] was revealed after (the Verses[2] which speak of the waiting period of) four months and ten (days).\" [1] (65:40), [2] (2:)",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ اللہ کی قسم! جو کوئی چاہے ہم اس سے لعان کر لیں کہ چھوٹی سورۃ نساء ( سورۃ الطلاق ) اس آیت کے بعد اتری ہے جس میں چار ماہ دس دن کی عدت کا حکم ہے ۱؎۔",
          "fr": "Rapporté par 'Abdullah bin Mas'ud : Par Allah, pour ceux qui veulent invoquer la malédiction d’Allah sur celui qui a tort, la sourate la plus courte concernant les femmes a été révélée après les versets qui parlent de la période d’attente de quatre mois et dix jours. [1] (65:40), [2] (2:)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Muslim] dari [Masruq] dari [Abdullah bin Mas'ud] ia berkata, \"Demi Allah, bagi siapa yang ingin maka kami akan mengutuknya. Sungguh telah turun surat An Nisa Al Qushra '(Setelah empat bulan sepuluh hari)",
          "tr": "Abdullah bin Mes'ud (r.a.)'den; şöyle demiştir: Vallahi kim dilerse (gelsin) haksız olanı beraberce lanetliyelim. Şüphesiz Talaka suresi (kocası ölen kadının iddetinin) dört ay on gün olduğuna dair ayetten sonra indirilmiştir. Diğer tahric: Nesai, talak; Ebu Davud, talak (2307) EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 2031,
      "arabicNumber": 2031,
      "book": 10,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، سُلَيْمَانُ بْنُ حَيَّانَ عَنْ سَعْدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، عَنْ زَيْنَبَ بِنْتِ كَعْبِ بْنِ عُجْرَةَ، وَكَانَتْ، تَحْتَ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ أُخْتَهُ الْفُرَيْعَةَ بِنْتَ مَالِكٍ، قَالَتْ خَرَجَ زَوْجِي فِي طَلَبِ أَعْلاَجٍ لَهُ فَأَدْرَكَهُمْ بِطَرَفِ الْقَدُومِ فَقَتَلُوهُ فَجَاءَ نَعْىُ زَوْجِي وَأَنَا فِي دَارٍ مِنْ دُورِ الأَنْصَارِ شَاسِعَةٍ عَنْ دَارِ أَهْلِي فَأَتَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ جَاءَ نَعْىُ زَوْجِي وَأَنَا فِي دَارٍ شَاسِعَةٍ عَنْ دَارِ أَهْلِي وَدَارِ إِخْوَتِي وَلَمْ يَدَعْ مَالاً يُنْفِقُ عَلَىَّ وَلاَ مَالاً وَرِثْتُهُ ‏.‏ وَلاَ دَارًا يَمْلِكُهَا فَإِنْ رَأَيْتَ أَنْ تَأْذَنَ لِي فَأَلْحَقَ بِدَارِ أَهْلِي وَدَارِ إِخْوَتِي فَإِنَّهُ أَحَبُّ إِلَىَّ وَأَجْمَعُ لِي فِي بَعْضِ أَمْرِي ‏.‏ قَالَ ‏\"‏ فَافْعَلِي إِنْ شِئْتِ ‏\"‏ ‏.‏ قَالَتْ فَخَرَجْتُ قَرِيرَةً عَيْنِي لِمَا قَضَى اللَّهُ لِي عَلَى لِسَانِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَتَّى إِذَا كُنْتُ فِي الْمَسْجِدِ - أَوْ فِي بَعْضِ الْحُجْرَةِ - دَعَانِي فَقَالَ ‏\"‏ كَيْفَ زَعَمْتِ ‏\"‏ ‏.‏ قَالَتْ فَقَصَصْتُ عَلَيْهِ فَقَالَ ‏\"‏ امْكُثِي فِي بَيْتِكِ الَّذِي جَاءَ فِيهِ نَعْىُ زَوْجِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ‏\"‏ ‏.‏ قَالَتْ فَاعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏.‏",
        "translations": {
          "en": "It was narrated from Zainab bint Ka'b bin 'Ujrah, who was married to Abu Sa'eed Al-Khudri,:that his sister Furai'ah bint Malik said: \"My husband went out to pursue some slaves of his. He caught up with them at the edge of Qadumttl and they killed him. News of his death reached me when I was in one of the houses of the Ansar, far away from the house of my family and my brothers. I went to the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ), there has come to me news of my husband's death and I am in a house far away from the house of my people and the house of my brothers. He did not leave any money that could be spent on me, or any inheritance, or any house I may take possession of. If you think that you could give me permission to join my family and my brothers, then that is what I prefer and is better for me in some ways.' He said: 'Do that if you wish.' Then I went out, feeling happy with the ruling of Allah given upon the lips of the Messenger of Allah (ﷺ), until, when I was in the mosque, or, in one of the apartments, he called me and said: 'What did you say?' I told him the story, and he said: 'Stay in the house in which the news of your husband's death came to you, until your waiting period is ever.\"' She said: \"So I observed the waiting period there for four months and ten (days)",
          "ur": "زینب بنت کعب بن عجرہ رضی اللہ عنہما جو ابو سعید خدری رضی اللہ عنہ کے نکاح میں تھیں سے روایت ہے کہ ابو سعید خدری رضی اللہ عنہ کی بہن فریعہ بنت مالک رضی اللہ عنہما نے کہا: میرے شوہر اپنے کچھ غلاموں کی تلاش میں نکلے اور ان کو قدوم کے کنارے پا لیا، ان غلاموں نے انہیں مار ڈالا، میرے شوہر کے انتقال کی خبر آئی تو اس وقت میں انصار کے ایک گھر میں تھی، جو میرے کنبہ والوں کے گھر سے دور تھا، میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی اور میں نے عرض کیا: اللہ کے رسول! میرے شوہر کی موت کی خبر آئی ہے اور میں اپنے کنبہ والوں اور بھائیوں کے گھروں سے دور ایک گھر میں ہوں، اور میرے شوہر نے کوئی مال نہیں چھوڑا جسے میں خرچ کروں یا میں اس کی وارث ہوں، اور نہ اپنا ذاتی کوئی گھر چھوڑا جس کے وہ مالک ہوتے، اب اگر آپ اجازت دیں تو میں اپنے خاندان کے گھر اور بھائیوں کے گھر میں آ جاؤں؟ یہ مجھے زیادہ پسند ہے، اس میں میرے بعض کام زیادہ چل جائیں گے، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم چاہتی ہو تو ایسا کر لو ۔ فریعہ رضی اللہ عنہا نے کہا کہ میں یہ سن کر ٹھنڈی آنکھوں کے ساتھ خوش خوش نکلی کہ اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کی زبان پہ مجھے حکم دیا تھا، یہاں تک کہ میں ابھی مسجد میں یا حجرہ ہی میں تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے بلایا اور فرمایا: کیا کہتی ہو ؟ میں نے سارا قصہ پھر بیان کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اسی گھر میں جہاں تمہارے شوہر کے انتقال کی خبر آئی ہے ٹھہری رہو یہاں تک کہ کتاب ( قرآن ) میں لکھی ہوئی عدت ( چار ماہ دس دن ) پوری ہو جائے، فریعہ رضی اللہ عنہا کہتی ہیں: پھر میں نے اسی گھر میں چار ماہ دس دن عدت کے گزارے ۔",
          "fr": "Rapporté par Zainab bint Ka'b bin 'Ujrah, épouse d'Abu Sa'eed Al-Khudri : Sa sœur, Furai'ah bint Malik, a dit : \"Mon mari est parti à la poursuite de certains de ses esclaves. Il les a rattrapés à la frontière de Qadumttl et ils l'ont tué. J'ai appris sa mort alors que j'étais dans une maison des Ansar, loin de la maison de ma famille et de mes frères. Je suis allée voir le Prophète (ﷺ) et j'ai dit : 'Ô Messager d'Allah (ﷺ), j'ai appris la mort de mon mari alors que je suis loin de ma famille et de mes frères. Il n'a laissé ni argent pour subvenir à mes besoins, ni héritage, ni maison dont je pourrais disposer. Si tu penses pouvoir m'autoriser à rejoindre ma famille et mes frères, c'est ce que je préfère et qui serait mieux pour moi à certains égards.' Il a dit : 'Fais-le si tu le souhaites.' Je suis donc sortie, contente de la décision d'Allah transmise par le Messager d'Allah (ﷺ), jusqu'à ce que, alors que j'étais à la mosquée ou dans un des appartements, il m'a appelée et a dit : 'Qu'as-tu dit ?' Je lui ai raconté mon histoire, et il a dit : 'Reste dans la maison où tu as appris la mort de ton mari, jusqu'à la fin de ta période d'attente.' Elle a dit : \"J'ai donc observé la période d'attente là-bas, pendant quatre mois et dix jours",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar Sulaiman bin Hayyan] dari [Sa'd bin Ishaq bin Ka'bin bin Ujrah] dari [Zainab binti Ka'b bin Ujrah] -ia adalah isteri Abu Sa'id Al Khudri- bahwa saudara wanitanya,? [Al Furai'ah binti Malik] berkata, \"Suamiku keluar mencari budak miliknya hingga mereka bertemu dengan suamiku dan membunuhnya. Hingga datanglah berita kematian suamiku, sementara aku ada di salah satu rumah Anshar yang sangat jauh dari rumah keluargaku. Lalu aku mendatangi Nabi shallallahu 'alaihi wasallam, aku berkata, \"Wahai Rasulullah, telah datang berita kematian suamiku sementara aku ada di suatu rumah yang sangat jauh dari rumah keluargaku dan rumah saudara-sadaraku, suamiku tidak meninggalkan harta sebagai nafkah, harta yang bisa aku warisi, atau rumah yang ia punyai. Jika engkau setuju untuk memberi izin, maka aku ingin tinggal di rumah keluarga dan saudara-saudaraku. Sebab hal itu lebih aku sukai dan aku bisa menumpahkan sebagian persoalanku?! Beliau bersabda: \"Lakukanlah jika engkau mau.\" Ia berkata, \"Maka aku pun keluar dengan berderai air mata atas apa yang telah Allah putuskan melalui lisan Rasulullah shallallahu 'alaihi wasallam, hingga ketika aku berada di masjid, atau di sebagian kamar beliau memanggilku, beliau bersabda: \"Bagaimana dengan keputusanmu?\" ia berkata, \"Lalu aku ceritakan kembali kepada beliau perihal suamiku. Beliau bersabda: \"Tinggallah di rumah yang engkau mendengar kabar kematian suamimu hingga selesai masa iddahmu.\" Ia berkata, \"Maka aku pun beriddah selama empat bulan sepuluh hari di rumah tersebut",
          "tr": "Zeyneb bint-i Kâ'b bin Ucra (r.anha)'dan rivayet edildiğine göre; Kocası Ebû Saîd-i Hudrî (r.a.)'ın kız kardeşi Furay'a bint-i Mâlik (r.anha) şöyle demiştir : Kocam, (kaçan) kölelerini aramaya çıktı ve Kadûm tarafında onlara yetişti. Köleler kocamı (orada) öldürdüler. Kocamın ölüm haberi geldi. Ben o sıralarda babamın evine uzak düşen Ensar'ın evlerinin birisinde ikâmet ediyordum. Bunun üzerine ben. Nebi (Sallallahu Aleyhi ve Seliem)'in yanına vararak: Yâ Resûlallah! Kocamın ölüm haberi geldi. Ben babamın evinden ve kardeşlerimin evinden uzak olan bir evdeyim. Kocam ne bana harcanacak bir mal bıraktı, ne mirasçıhk yolu ile sahip olduğum bir mal bıraktı, ne de maliki bulunduğu bir ev bıraktı. Babamın evine ve kardeşlerimin evine taşınmama izin verirseniz şüphesiz bunu çok arzularım ve bazı işlerim yönünden iyi olur, diye müsaade istedim. Efendimiz : «Ditersen (taşınma işini) yap,- buyurdu. Furay'a demiştir İd : Resulullah (Sallallahu Aleyhi ve Sellem)'in dili ile Allah'ın benim için verdiği bu hükme sevinçli olarak Nebi'in huzurundan ayrıldım. Nihayet ben mescidde veya evin sahanlığında iken, Efendimiz beni (geri) çağırarak: «Sen nasıl söyledin?» buyurdu. Furay'a demiştir ki: Ben söylediklerimi tekrar anlattım. Bunun üzerine O, bana: «Yazılı (yâni süresi Kur'an da belirli) iddet süresi tamamlanıncaya kadar, sen kocanın ölüm haberini aldığın evinde dur» buyurdu. Furay'a demiştir ki: Ben o evde dört ay on gün iddet olarak durdum. Diğer tahric: Bu hadisi dört sünen sahibIeri, Malik, Şafii, Ahmed ve Hakim rivayet etmişlerdir. Bazı rivayetlerdeki ifade değişikliği manayı etkilemez"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 2032,
      "arabicNumber": 2032,
      "book": 10,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ دَخَلْتُ عَلَى مَرْوَانَ فَقُلْتُ لَهُ امْرَأَةٌ مِنْ أَهْلِكَ طُلِّقَتْ فَمَرَرْتُ عَلَيْهَا وَهِيَ تَنْتَقِلُ فَقَالَتْ أَمَرَتْنَا فَاطِمَةُ بِنْتُ قَيْسٍ وَأَخْبَرَتْنَا أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَمَرَهَا أَنْ تَنْتَقِلَ ‏.‏ فَقَالَ مَرْوَانُ هِيَ أَمَرَتْهُمْ بِذَلِكَ ‏.‏ قَالَ عُرْوَةُ فَقُلْتُ أَمَا وَاللَّهِ لَقَدْ عَابَتْ ذَلِكَ عَائِشَةُ وَقَالَتْ إِنَّ فَاطِمَةَ كَانَتْ فِي مَسْكَنٍ وَحْشٍ فَخِيفَ عَلَيْهَا فَلِذَلِكَ أَرْخَصَ لَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏",
        "translations": {
          "en": "It was narrated from Hisham bin 'Urwah that his father said:\"I entered upon Marwan and said to him: 'A women from your family has been divorced. I passed by her and she was moving. She said: 'Fatimah bint Qais told us to do that, and she told us that the Messenger of Allah (ﷺ) told her to move.' Marwan said: 'She told them to do that.\"' 'Urwah said: \"l said: 'By Allah, 'Aishah did not like that, and said: 'Fatimah was living in a deserted house and it was feared for her (safety and well being), so the Messenger of Allah (ﷺ) granted a concession to her",
          "ur": "عروہ کہتے ہیں کہ میں نے مروان کے پاس جا کر کہا کہ آپ کے خاندان کی ایک عورت کو طلاق دے دی گئی، میرا اس کے پاس سے گزر ہوا تو دیکھا کہ وہ گھر سے منتقل ہو رہی ہے، اور کہتی ہے: فاطمہ بنت قیس رضی اللہ عنہا نے ہمیں حکم دیا ہے اور ہمیں بتایا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں گھر بدلنے کا حکم دیا تھا، مروان نے کہا: اسی نے اسے حکم دیا ہے۔ عروہ کہتے ہیں کہ تو میں نے کہا: اللہ کی قسم، عائشہ رضی اللہ عنہا نے اس چیز کو ناپسند کیا ہے، اور کہا ہے کہ فاطمہ رضی اللہ عنہا ایک خالی ویران مکان میں تھیں جس کی وجہ سے ان کے بارے میں ڈر پیدا ہوا، اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے ان کو مکان بدلنے کی اجازت دی ۱؎۔",
          "fr": "Rapporté par Hisham bin 'Urwah, d'après son père : Je suis allé voir Marwan et lui ai dit : 'Une femme de ta famille a été divorcée. Je suis passé devant elle et elle se déplaçait. Elle a dit : 'Fatimah bint Qais nous a dit de faire cela, et elle nous a dit que le Messager d'Allah (ﷺ) lui avait dit de se déplacer.' Marwan a dit : 'Elle leur a dit de faire cela.' 'Urwah a dit : \"Par Allah, 'Aishah n'aimait pas cela et disait : 'Fatimah vivait dans une maison isolée et on craignait pour sa sécurité, alors le Messager d'Allah (ﷺ) lui a accordé une dérogation",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abdullah] berkata, telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Hisyam bin Urwah] dari [Bapaknya] ia berkata, \"Aku masuk menemui Marwan, aku berkata kepadanya, \"Seorang wanita dari keluargamu telah dicerai. Aku melewatinya saat ia pindah, ia berkata, \" [Fatimah binti Qais] menyuruh kami! Dan ia mengabarkan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam pernah memerintahkan kepadanya untuk pindah.\" Marwan kemudian berkata, \"Ia menyuruh mereka untuk melakukan itu! \" Urwah berkata, \"Aku berkata, \" ['Aisyah] telah mencelanya, ia mengatakan, \"Sesungguhnya Fatimah itu ada di suatu tempat yang berbahaya hingga akan membahayakan dirinya, maka Rasulullah shallallahu 'alaihi wasallam memberikan keringan kepadanya",
          "tr": "Urve (bin Zübeyir) (r.a.)'dan rivayet edildiğine göre şöyle demiştir: Ben (Medine-i Münevvere valisi) Mervân (bin el-Hakem)'iıı yanına girerek ona şöyle dedim: Senin ailenden bir kadın boşanmış (iddette)dir. O'na uğradım evini değiştiriyordu. Sonra kadın şöyle dedi : Fâtıma bint-i Kays evimizi değiştirmemize müsaade ederek kendisinin (iddette iken) ev değiştirmesine Resulullah (Sallallahu Aleyhi ve Sellem)'in müsaade ettiğini bize haber verdi. (Urve demiştir ki:) Bunun üzerine Mervân: (Evet.) Fâtıma onlara ev değiştirmelerini emretti, dedi. Urve demiştir ki: Mervân'ın bu sözü üzerine ben şöyle dedim: (îyi) ama Allah'a yemin ederim ki Âişe, Fâtıma'nın bu fetvasını kınadı ve dedi ki: Fâtıma ıssız ve ücra bir evde idi. Onun o evde durmasından korkuldu. Resulullah (Sallallahu Aleyhi ve Sellem) de bundan dolayı Fâtıma'nın ev değiştirmesine müsâade etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 2033,
      "arabicNumber": 2033,
      "book": 10,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَتْ فَاطِمَةُ بِنْتُ قَيْسٍ يَا رَسُولَ اللَّهِ إِنِّي أَخَافُ أَنْ يُقْتَحَمَ عَلَىَّ ‏.‏ فَأَمَرَهَا أَنْ تَتَحَوَّلَ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Aishah said:“Fatimah bint Qais said: 'O Messenger of Allah, (ﷺ) I am afraid that someone may enter upon me by force.' So he told her to move",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ فاطمہ بنت قیس رضی اللہ عنہا نے کہا: اللہ کے رسول! میں ڈرتی ہوں کہ کوئی میرے پاس گھس آئے، تو آپ نے انہیں وہاں سے منتقل ہو جانے کا حکم دیا۔",
          "fr": "Rapporté par 'Aishah : Fatimah bint Qais a dit : \"Ô Messager d'Allah (ﷺ), j'ai peur que quelqu'un entre chez moi de force.\" Alors il lui a dit de déménager",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Hisyam bin Urwah] dari [Bapaknya] ia berkata, \" [Fatimah binti Qais] berkata, \"Wahai Rasulullah, sesungguhnya aku takut jika terzhalimi, \" maka beliau pun memerintahkan kepadanya untuk pindah",
          "tr": "Âişe (r.anha)'dzn rivayet edildiğine göre şöyle demiştir: Fâtıma bînt-i Kays: Yâ Resûlallah! (îddet için durduğum ev ıssız olduğundan) zorla evime girilmesinden korkuyorum, dedi. Bunun üzerine Rssulullah onun ev değiştirmesine müsaade etti. Diğer tahric: Urve (r.anh)'ın hadisinin birer benzerini Şafii, Buhari, Ebu Davud, ve Beyhaki da rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 2034,
      "arabicNumber": 2034,
      "book": 10,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ مَنْصُورٍ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ طُلِّقَتْ خَالَتِي فَأَرَادَتْ أَنْ تَجُدَّ نَخْلَهَا فَزَجَرَهَا رَجُلٌ أَنْ تَخْرُجَ إِلَيْهِ فَأَتَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ بَلَى فَجُدِّي نَخْلَكِ فَإِنَّكِ عَسَى أَنْ تَصَدَّقِي أَوْ تَفْعَلِي مَعْرُوفًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir bin 'Abdullah said:\"My maternal aunt was divorced, and she wanted to collect the harvest from her date-palm trees. A man rebuked her for going out to the trees. She went to the Prophet (ﷺ), who said: 'No, go and collect the harvest from your trees, for perhaps you will give some in charity or do a good deed with it",
          "ur": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ میری خالہ کو طلاق دے دی گئی، پھر انہوں نے اپنی کھجوریں توڑنے کا ارادہ کیا، تو ایک شخص نے انہیں گھر سے نکل کر باغ جانے پر ڈانٹا تو وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ٹھیک ہے، تم اپنی کھجوریں توڑو، ممکن ہے تم صدقہ کرو یا کوئی کار خیر انجام دو ۱؎۔",
          "fr": "Rapporté par Jabir bin 'Abdullah : Ma tante maternelle a été divorcée et elle voulait récolter les dattes de ses palmiers. Un homme l'a réprimandée parce qu'elle sortait pour cela. Elle est allée voir le Prophète (ﷺ), qui a dit : \"Non, va récolter les dattes de tes arbres, car peut-être en donneras-tu en aumône ou feras-tu une bonne action avec",
          "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Rauh]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Manshur] berkata, telah menceritakan kepada kami [Hajjaj bin Muhammad] semuanya dari [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Bibiku dari pihak ibu dicerai, lalu ia ingin memetik buah kurma. Namun seorang laki-laki melarangnya untuk keluar, maka ia pun mendatangi Nabi shallallahu 'alaihi wasallam. Beliau lantas bersabda: \"Tidak apa-apa, petiklah buah kurmamu. Semoga dengannya engkau bisa bersedekah atau melakukan sesuatu yang ma'ruf",
          "tr": "Câbir (bin Abdiilah) (r.a.)'dan: Şöyle demiştir: Teyzem (üç talâkla) boşanmıştı. Hurmalığındaki hurmaları kesmek için (evden dışan) çıkmak istedi. Fakat bir adam onu (iddette olduğu gerekçesi ile) hurmalığına çıkmasına mâni oldu. Bunun üzerine teyzem Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gitti (ve durumu ona arzetti). Nebi (Sallallahu Aleyhi ve Sellem): «Hayır. Hurmalarını kes. Çünkü şüphesiz (hurmalarından) sadaka vermen veya başka hayır yapman umulur.» buyurdu. Diğer tahric: Bu hadisi, Ahmed, Müslim, Ebu Davud, Nesai ve Beyhaki da rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 2035,
      "arabicNumber": 2035,
      "book": 10,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بَكْرِ بْنِ أَبِي الْجَهْمِ بْنِ صُخَيْرٍ الْعَدَوِيِّ، قَالَ سَمِعْتُ فَاطِمَةَ بِنْتَ قَيْسٍ، تَقُولُ إِنَّ زَوْجَهَا طَلَّقَهَا ثَلاَثًا فَلَمْ يَجْعَلْ لَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ سُكْنَى وَلاَ نَفَقَةً ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Bakr bin Abu Jahm bin Sukhair Al-'Adawi said:\"I heard Fatimah bint Qais say that her husband divorced her ttree times, and the Messenger of Allah (ﷺ) did not say that she was entitled to accommodation and maintenance",
          "ur": "ابوبکر بن ابی جہم بن صخیر عدوی کہتے ہیں کہ میں نے فاطمہ بنت قیس رضی اللہ عنہا کو کہتے سنا کہ ان کے شوہر نے انہیں تین طلاقیں دے دیں، تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں سکنیٰ ( جائے رہائش ) اور نفقہ کا حقدار نہیں قرار دیا ۱؎۔",
          "fr": "Rapporté par Abu Bakr bin Abu Jahm bin Sukhair Al-'Adawi : J'ai entendu Fatimah bint Qais dire que son mari l'avait divorcée trois fois, et le Messager d'Allah (ﷺ) n'a pas dit qu'elle avait droit à un logement ou à une pension",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Abu Bakr bin Abu Al Jahm bin Shukhair Al 'Adawi] ia berkata, \"Aku mendengar [Fatimah bin Qais] mengatakan bahwa suaminya telah menceraikannya dengan talak tiga, lalu Rasulullah shallallahu 'alaihi wasallam tidak memberikan putusan bahwa ia berhak mendapatkan jaminan tempat tinggal dan nafkah",
          "tr": "Fâtıma bint-i Kays (r.anha)'dan rivayet edildiğine göre; Kocası kendisini üç talâkla boşamış da Resulullah (Sallallahu Aleyhi ve Sellem) o (nun iddet süresi) için ne mesken ne de nafaka hakkını kıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 2036,
      "arabicNumber": 2036,
      "book": 10,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، قَالَ قَالَتْ فَاطِمَةُ بِنْتُ قَيْسٍ طَلَّقَنِي زَوْجِي عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ثَلاَثًا فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ سُكْنَى لَكِ وَلاَ نَفَقَةَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Sha'bi said:Fatimah bint Qais said: “My husband divorced me at the time of the Messenger of Allah (ﷺ) three times. The Messenger of Allah (ﷺ) said: 'You have no right to accommodation or to maintenance.'”",
          "ur": "شعبی کہتے ہیں کہ فاطمہ بنت قیس رضی اللہ عنہا کا بیان ہے کہ میرے شوہر نے مجھے رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں تین طلاقیں دے دیں تو آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارے لیے نہ سکنی ( رہائش ) ہے، نہ نفقہ ( اخراجات ) ۱؎۔",
          "fr": "Rapporté par Sha'bi : Fatimah bint Qais a dit : \"Mon mari m'a divorcée à l'époque du Messager d'Allah (ﷺ) trois fois. Le Messager d'Allah (ﷺ) a dit : 'Tu n'as pas droit à un logement ni à une pension",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Asy Sya'bi] ia berkata, \" [Fatimah bin Qais] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam, suamiku menceraikan aku dengan talak tiga. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Engkau tidak berhak mendapatkan jaminan tempat tinggal ataupun nafkah",
          "tr": "Fâtıma bint-i Kays (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken kocam beni (üç talâkla) boşadı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (bana): «Senin için ne mesken ne de nafaka (hakkı) vardır» buyurdu. Diğer tahric: Fatima binti Kays (r.anha)'nın ilk hadisini Müslim, Ebu Davud ve Tahavi. ikinci hadisini Tirmizi rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 2037,
      "arabicNumber": 2037,
      "book": 10,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ أَبُو الأَشْعَثِ الْعِجْلِيُّ، حَدَّثَنَا عُبَيْدُ بْنُ الْقَاسِمِ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ عَمْرَةَ بِنْتَ الْجَوْنِ، تَعَوَّذَتْ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حِينَ أُدْخِلَتْ عَلَيْهِ فَقَالَ ‏ \"‏ لَقَدْ عُذْتِ بِمُعَاذٍ ‏\"‏ ‏.‏ فَطَلَّقَهَا وَأَمَرَ أُسَامَةَ أَوْ أَنَسًا فَمَتَّعَهَا بِثَلاَثَةِ أَثْوَابٍ رَازِقِيَّةٍ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that:'Amrah bint Jawn sought refuge.with Allah from the Messenger of Allah (ﷺ) when she was brought to him (as a bride) He said: \"You have sought refuge with Him in Whom refuge is sought.\" So he divorced her and told Usamah or Anas to give her, a gift of three garments of white flax",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ جب عمرہ بنت جون رسول اللہ صلی اللہ علیہ وسلم کے پاس لائی گئی تو اس نے آپ صلی اللہ علیہ وسلم سے ( اللہ کی ) پناہ مانگی تو آپ صلی اللہ علیہ وسلم نے فرمایا: تو نے ایسی ہستی کی پناہ مانگی جس کی پناہ مانگی جاتی ہے ، پھر آپ صلی اللہ علیہ وسلم نے اسے طلاق دے دی، اور اسامہ رضی اللہ عنہ یا انس رضی اللہ عنہ کو حکم دیا تو انہوں نے اسے سفید کتان کے تین کپڑے دیئے۔",
          "fr": "Rapporté par 'Aishah : 'Amrah bint Jawn a cherché refuge auprès d'Allah contre le Messager d'Allah (ﷺ) lorsqu'elle lui a été présentée comme épouse. Il a dit : \"Tu as cherché refuge auprès de Celui auprès de qui on cherche refuge.\" Alors il l'a divorcée et a demandé à Usamah ou Anas de lui offrir trois vêtements en lin blanc",
          "id": "Telah menceritakan kepada kami [Ahmad bin Al Miqdam Abul Asy'ats Al 'Ijli] berkata, telah menceritakan kepada kami [Ubaid bin Al Qasim] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] berkata, \"Amrah binti Al Jaun berlindung dari Rasulullah shallallahu 'alaihi wasallam ketika dipertemukan dengannya. Maka Beliau bersabda: \"Engkau telah berlindung kepada Mu'adz.\" Lalu Beliau menceraikannya dan memerintahkan Usamah atau Anas agar memberinya tiga potong baju kain linen putih",
          "tr": "Âişe (r.anha)'dan; şöyle demiştir: Cevn kızı Amra, Resulullah (Sallallahu Aleyhi ve Sellem) (e nikâh olunup O'n)un huzuruna konulunca Amra, senden Allah'a sığınırım, dedi. Bunun üzerine Resûl-i Ekrem: «Sen (şânı çok yüce olan) bir sığınılana sığındın» buyurduktan sonra onu boşadı ve Usâme veya Enes'e emredip ona râzıkkıyye (denilen beyaz keten kumaştan mamul) üç kat elbise giydirdi. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Ubeyd bin el•Kasım buIumır. Onun hakkında İbn-i Main: 0, kezzab ve habisti, demiş, Salih bin Muhammed de: O. kezzabtır, hadis uyduruyordu, demiştir. İbn-i Hibban da: 0, sika zatlardan mevdu hadisleri rivayet edenlerdir, Hişam bin Urve'den bir tomar mevdu hadisler rivayet etmiş, demiştir. Buhari, Ebu Zur'a, Ebu Hatim, Nesai ve başkaları onu zayıf saymışlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Munkar"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Munkar"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 2038,
      "arabicNumber": 2038,
      "book": 10,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ أَبُو حَفْصٍ التَّنِّيسِيُّ، عَنْ زُهَيْرٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِذَا ادَّعَتِ الْمَرْأَةُ طَلاَقَ زَوْجِهَا فَجَاءَتْ عَلَى ذَلِكَ بِشَاهِدٍ عَدْلٍ اسْتُحْلِفَ زَوْجُهَا فَإِنْ حَلَفَ بَطَلَتْ شَهَادَةُ الشَّاهِدِ وَإِنْ نَكَلَ فَنُكُولُهُ بِمَنْزِلَةِ شَاهِدٍ آخَرَ وَجَازَ طَلاَقُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:the Prophet (ﷺ) said: \"If a woman claims that her husband has divorced her, and she brings a witness of good character (to testify) to that, her husband should be asked to swear an oath. If he swears, that will invalidate the testimony of the witness, but if he refuses then that will be equivalent to a second witness, and the divorce will take effect",
          "ur": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب عورت دعویٰ کرے کہ اس کے شوہر نے اسے طلاق دے دی ہے، اور طلاق پہ ایک معتبر شخص کو گواہ لائے ( اور اس کا مرد انکار کرے ) تو اس کے شوہر سے قسم لی جائے گی، اگر وہ قسم کھا لے تو گواہ کی گواہی باطل ہو جائے گی، اور اگر قسم کھانے سے انکار کرے تو اس کا انکار دوسرے گواہ کے درجہ میں ہو گا، اور طلاق جائز ہو جائے گی ۔",
          "fr": "Rapporté par 'Amr bin Shu'aib, d'après son père, d'après son grand-père : Le Prophète (ﷺ) a dit : \"Si une femme affirme que son mari l'a divorcée et qu'elle présente un témoin de bonne réputation, on demande alors au mari de jurer. S'il jure, cela invalide le témoignage du témoin, mais s'il refuse, cela équivaut à un deuxième témoin et le divorce prend effet",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami ['Amr bin Abu Salamah Abu Hafsh At Tannisi] dari [Zuhair] dari [Ibnu Juraij] dari ['Amr bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seorang isteri mengklaim telah cerai dengan suaminya dan mendatangkan seorang saksi adil. Maka si suami hendaknya diambil sumpah. Jika bersumpah maka gugurlah persaksian saksi. Jika (suami) mengundurkan diri, maka pengundurannya sama dengan adanya saksi baru, maka perceraian itu bisa dianggap sah",
          "tr": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: Kadın, kocasının kendisini boşadığını iddia edip, sonra buna dâir âdil bir erkek şahit getirdiği zaman, kocasına yemin teklif edilir. Eğer kocası (onu boşamadığına) yemin ederse şahidin şahitliği geçersiz olur ve eğer kocası yemin etmekten imtina ederse, imtina etmesi başka bir şahit yerine geçer ve boşamaya hükmedilir.» Not: Bunun senedinin sahihliği ve ravilerinin sikalığı Zevaid'de bildirilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 2039,
      "arabicNumber": 2039,
      "book": 10,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَبِيبِ بْنِ أَرْدَكَ، حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ ثَلاَثٌ جِدُّهُنَّ جِدٌّ وَهَزْلُهُنَّ جِدٌّ النِّكَاحُ وَالطَّلاَقُ وَالرَّجْعَةُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that:the Messenger of Allah (ﷺ) said: \"There are three matters in which seriousness is serious and joking is serious: marriage, divorce and taking back (one's wife)",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تین کام ہیں جو سنجیدگی سے کرنا بھی حقیقت ہے، اور مذاق کے طور پر کرنا بھی حقیقت ہے، ایک نکاح، دوسرے طلاق، تیسرے ( طلاق سے ) رجعت ۱؎۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d'Allah (ﷺ) a dit : \"Il y a trois choses qui sont prises au sérieux, que ce soit sérieusement ou en plaisantant : le mariage, le divorce et la reprise de l'épouse",
          "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Hatim bin Isma'il] berkata, telah menceritakan kepada kami ['Abdurrahman bin Habib bin Ardak] berkata, telah menceritakan kepada kami ['Atha bin Abu Rabah] dari [Yusuf bin Mahak] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga perkara baik dilakukan dengan serius atau dengan main-main hukumnya tetap berlaku; nikah, talak dan rujuk",
          "tr": "Ebû Hüreyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Üç şey vardır ki ciddisi de ciddîdir, şakası da ciddidir: Nikâh, boşama ve rac'at.» Diğer tahric: Bu hadisi Tirmizi, Ebu Davud ve Hakim de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 2040,
      "arabicNumber": 2040,
      "book": 10,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَعَبْدَةُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، جَمِيعًا عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ اللَّهَ تَجَاوَزَ لأُمَّتِي عَمَّا حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَعْمَلْ بِهِ أَوْ تَكَلَّمْ بِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that:the Messenger of Allah (ﷺ) said: \"Allah has forgiven my nation for what they think of to themselves, so long as they do not act upon it or speak of it",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے میری امت سے معاف کر دیا ہے جو وہ دل میں سوچتے ہیں جب تک کہ اس پہ عمل نہ کریں، یا اسے زبان سے نہ کہیں ۱؎۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d'Allah (ﷺ) a dit : \"Allah a pardonné à ma communauté ce qu'ils pensent en eux-mêmes, tant qu'ils n'agissent pas en conséquence ou n'en parlent pas",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali bin Mushir] dan [Abdah bin Sulaiman]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Humaid bin Mas'adah] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] semuanya dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Zurarah bin Aufa] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah akan mengampuni apa yang terdetik dalam hati umatku selama belum melakukannya atau mengatakannya",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ümmetimin kalblerinden geçen şeyleri (fiilen) işlemedikçe veya söylemedikçe Allah Te&Ia şüphesiz Affeylemiftir.» Bu hadisi Kütüb-i sitte sahipleri rivayet etti. BUHARİ HADİSİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 2041,
      "arabicNumber": 2041,
      "book": 10,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ، وَمُحَمَّدُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حَمَّادٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ رُفِعَ الْقَلَمُ عَنْ ثَلاَثَةٍ عَنِ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنِ الصَّغِيرِ حَتَّى يَكْبَرَ وَعَنِ الْمَجْنُونِ حَتَّى يَعْقِلَ أَوْ يُفِيقَ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ فِي حَدِيثِهِ ‏\"‏ وَعَنِ الْمُبْتَلَى حَتَّى يَبْرَأَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Aishah that:the Messenger of Allah said. \"The Pen has been lifted from three : from the sleeping person until he awakens, from the minor until he grows up, and from the insane person until he comes to his senses.\"In his narration, (one of the narrators Abu Bakr (Ibn Abu Shaibah) said: \"And from the afflicted person, unit he recovers",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تین افراد سے قلم اٹھا لیا گیا ہے: ایک تو سونے والے سے یہاں تک کہ وہ جاگے، دوسرے نابالغ سے یہاں تک کہ وہ بالغ ہو جائے، تیسرے پاگل اور دیوانے سے یہاں تک کہ وہ عقل و ہوش میں آ جائے ۔ ابوبکر کی روایت میں «وعن المجنون حتى يعقل» کے بجائے «وعن المبتلى حتى يبرأ» دیوانگی میں مبتلا شخص سے یہاں تک کہ وہ اچھا ہو جائے ہے ۱؎۔",
          "fr": "Rapporté par Aishah : Le Messager d'Allah a dit : \"La plume est levée pour trois personnes : pour celui qui dort jusqu'à ce qu'il se réveille, pour le mineur jusqu'à ce qu'il grandisse, et pour la personne atteinte de folie jusqu'à ce qu'elle retrouve la raison.\" Dans son récit, (l'un des rapporteurs, Abu Bakr (Ibn Abu Shaibah), a ajouté : \"Et pour la personne malade jusqu'à ce qu'elle guérisse",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Khalid bin Khidasy] dan [Muhammad bin Yahya] keduanya berkata; telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Hammad] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pena akan diangkat dari tiga orang; orang yang tidur hingga bangun, anak kecil hingga besar (balig) dan orang gila hingga berakal atau sadar.\" Abu Bakr menyebutkan dalam haditsnya, \"orang yang hilang akal hingga sadar",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Üç sınıf mükelleftik kalemi kaldırılmıştır: Uyanıncaya kadar uyuyandan, erginlik çağına varıncaya kadar çocuktan ve akıllanıncaya veya ayılıncaya kadar deliden.» EBU DAVUD HADİSLERİ: İZAH 4403’TE 4398 – 4399 – 4400 – 4401 – 4402 –"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 2042,
      "arabicNumber": 2042,
      "book": 10,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَنْبَأَنَا الْقَاسِمُ بْنُ يَزِيدَ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ يُرْفَعُ الْقَلَمُ عَنِ الصَّغِيرِ وَعَنِ الْمَجْنُونِ وَعَنِ النَّائِمِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Ali bin Abu Talib that:the Messenger of Allah (ﷺ) said: \"The Pen is lifted from the minor, the insane person and the sleeper",
          "ur": "علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بچے، دیوانے اور سوئے ہوئے شخص سے قلم اٹھا لیا جاتا ہے ۔",
          "fr": "Rapporté par 'Ali bin Abu Talib : Le Messager d'Allah (ﷺ) a dit : \"La plume est levée pour le mineur, la personne atteinte de folie et celui qui dort",
          "id": "Telah menceritakan kepada kami [Muhamamd bin Basysyar] berkata, telah menceritakan kepada kami [Rauh bin Ubadah] berkata, telah menceritakan kepada kami [Ibnu Juraij] berkata, telah memberitakan kepada kami [Al Qasim bin Yazid] dari [Ali bin Abi Thalib] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pena diangkat dari (tiga) golongan; anak kecil, orang gila dan orang tidur",
          "tr": "Ali bin Ebî Tâlib (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Çocuktan, deliden ve uyuyandan sorumluluk kalemi kaldırılıyor.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde bulunan Kasım bin Yezid, mechuldür ve Ali bin Ebi Talib (r.a.)'a yetişmemiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 2043,
      "arabicNumber": 2043,
      "book": 10,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ يُوسُفَ الْفِرْيَابِيُّ، حَدَّثَنَا أَيُّوبُ بْنُ سُوَيْدٍ، حَدَّثَنَا أَبُو بَكْرٍ الْهُذَلِيُّ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ اللَّهَ تَجَاوَزَ عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Dharr Al-Ghifari that the Messenger of Allah (ﷺ) said:Allah has forgiven for me my nation their mistakes and forgetfulness, and what they are forced to do",
          "ur": "ابوذرغفاری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے میری امت سے بھول چوک، اور جس کام پہ تم مجبور کر دیئے جاؤ معاف کر دیا ہے ۱؎۔",
          "fr": "Rapporté par Abu Dharr Al-Ghifari : Le Messager d'Allah (ﷺ) a dit : Allah a pardonné à ma communauté leurs erreurs, leurs oublis et ce qu'ils sont contraints de faire",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Muhammad bin Yusuf Al Firyabi] berkata, telah menceritakan kepada kami [Ayyub bin Suwaid] berkata, telah menceritakan kepada kami [Abu Bakr Al Hudzali] dari [Syahr bin Hausyab] dari [Abu Dzar Al Ghifari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memaafkan dari umatku sesuatu yang dilakukan karena salah, lupa dan sesuatu yang dipaksakan kepadanya",
          "tr": "Ebû Zer'-i Ğifârî (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ümmetimin yanılmasını, unutmasını ve zorlandığı şey (in günahın)! Allah Teâlâ şüphesiz affetmiştir.» Not: Zevaid'de şöyle denilmiştir: Alimler, bu senedde bulunan ravi Ebi Bekir el-Huzeli'nin zayıflığı üzerinde ittifak ettikleri için bu sened zayıftır. AÇIKLAMA 2046’da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 2044,
      "arabicNumber": 2044,
      "book": 10,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مِسْعَرٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ اللَّهَ تَجَاوَزَ لأُمَّتِي عَمَّا تُوَسْوِسُ بِهِ صُدُورُهَا ‏.‏ مَا لَمْ تَعْمَلْ بِهِ أَوْ تَتَكَلَّمْ بِهِ وَمَا اسْتُكْرِهُوا عَلَيْهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the:Messenger of Allah (ﷺ) said : \"Allah has forgiven my nation for the evil suggestions of their hearts, so long as they do not act upon it or speak of it, and for what they are forced to do",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے میری امت سے جو ان کے دلوں میں وسوسے آتے ہیں معاف کر دیا ہے جب تک کہ اس پہ عمل نہ کریں، یا نہ بولیں، اور اسی طرح ان کاموں سے بھی انہیں معاف کر دیا ہے جس پر وہ مجبور کر دیئے جائیں ۱؎۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d'Allah (ﷺ) a dit : \"Allah a pardonné à ma communauté les mauvaises pensées de leur cœur, tant qu'ils n'agissent pas en conséquence ou n'en parlent pas, ainsi que ce qu'ils sont contraints de faire",
          "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Mis'ar] dari [Qatadah] dari [Zurarah bin Aufa] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memaafkan dari umatku ini sesuatu yang terdetik dalam hati selama tidak dilakukan, atau diucapkan. Dan apa-apa yang dipaksakan kepadanya",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ümmetimin gönüllerinden geçen (günah işleme) temayülleri (fiilen) işlemedikçe, yahut (dilleri ile) söylemedikçe, bir de onların zorlandıkları şeyleri Allah Teâlâ şüphesiz affeylemiştir.» AÇIKLAMA 2046’da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Shadh"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 2045,
      "arabicNumber": 2045,
      "book": 10,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ اللَّهَ وَضَعَ عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said :\"Allah has forgiven my nation for mistakes and forgetfulness, and what they are forced to do",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: بیشک اللہ نے میری امت سے بھول چوک اور زبردستی کرائے گئے کام معاف کر دیئے ہیں ۔",
          "fr": "Rapporté par Ibn 'Abbas : Le Prophète (ﷺ) a dit : \"Allah a pardonné à ma communauté les erreurs, les oublis et ce qu'ils sont contraints de faire",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al MuShaffa Al Himshi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] dari ['Atha] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah akan menggugurkan dari umatku sesuatu yang dilakukan karena salah, lupa dan sesuatu yang dipaksakan kepadanya",
          "tr": "(Abdullah) bin Abbas (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Ümmetimin yanılmasını, unutmasını ve zorlandığı şey (in günahın) ı Allah Teâlâ affeylemiştir.» Not: Zevaid'de şöyle denilmiştir: Bu 'Sened munkati değilse sahihtir. Fakat münkati görülür. Nitekim ikinci senedde, Ubeyd bin Nümeyr isimli ravi ilaveten vardır ... Bu münkatiIik yani senedden bir ravinin atılması ile meydana gelen kopukluk ravi el-Velid bin Müslim'den ileri ge!miş olabilir. Çünkü kendisi tedlisçi idi. AÇIKLAMA 2046’da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 2046,
      "arabicNumber": 2046,
      "book": 10,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ ثَوْرٍ، عَنْ عُبَيْدِ بْنِ أَبِي صَالِحٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، قَالَتْ حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ طَلاَقَ وَلاَ عَتَاقَ فِي إِغْلاَقٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Safiyyah bint Shaibah said:\"Aishah told me that the Messenger of Allah (ﷺ) said: 'There is no divorce and no manumission at the time of coercion",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: زبردستی کی صورت میں نہ طلاق واقع ہوتی ہے اور نہ عتاق ( غلامی سے آزادی ) ۔",
          "fr": "Rapporté par Safiyyah bint Shaibah : 'Aishah m'a dit que le Messager d'Allah (ﷺ) a dit : \"Il n'y a pas de divorce ni d'affranchissement en cas de contrainte",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Muhammad bin Ishaq] dari [Tsaur] dari [Ubaid bin Abu Shalih] dari [Shafiah binti Syaibah] ia berkata, \" ['Aisyah] menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada talak atau pembebasan (budak) disaat marah (yang memuncak)",
          "tr": "Âişe (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Zorlama altında ne boşama olabilir, ne de (köle ve cariyeyi) âzad etmek.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 2047,
      "arabicNumber": 2047,
      "book": 10,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا عَامِرٌ الأَحْوَلُ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، جَمِيعًا عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ طَلاَقَ فِيمَا لاَ يَمْلِكُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from \"Amr bin Shu'aib, from his father, from his grandfather, that:the Messenger of Allah said : \"There is no divorce regarding that which one does not possess",
          "ur": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آدمی جس عورت کا بطور نکاح مالک نہیں اس کی طلاق کا کوئی اعتبار نہیں ہے ۱؎۔",
          "fr": "Rapporté par 'Amr bin Shu'aib, d'après son père, d'après son grand-père : Le Messager d'Allah a dit : \"Il n'y a pas de divorce concernant ce que l'on ne possède pas",
          "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Husyaim] berkata, telah memberitakan kepada kami [Amir Al Ahwal]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Hatim bin Isma'il] semuanya dari ['Abdurrahman bin Al Harits] dari ['Amr bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada perceraian pada apa yang tidak kamu miliki",
          "tr": "Anır bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Adamın nikahlanmadı bir kadın hakkında boşama (yetkisi) yoktur.» Diğer tahric: Tirmizi, Ebu Davud, Ahmed, Beyhaki, Darekutni ve Hakim de rivayet etmişlerdir. Tirmizi bu hadisin hasen - sahih olduğunu söylemiştir. AÇIKLAMA 2049’da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 2048,
      "arabicNumber": 2048,
      "book": 10,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ طَلاَقَ قَبْلَ نِكَاحٍ وَلاَ عِتْقَ قَبْلَ مِلْكٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Miswar bin Makharamah that the Prophet (ﷺ) said:\"There is no divorce before marriage, and no manumission before taking possession",
          "ur": "مسور بن مخرمہ رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: نکاح سے پہلے طلاق نہیں، اور ملکیت سے پہلے آزادی نہیں ۔",
          "fr": "Rapporté par Miswar bin Makharamah : Le Prophète (ﷺ) a dit : \"Il n'y a pas de divorce avant le mariage, ni d'affranchissement avant d'avoir la possession",
          "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] berkata, telah menceritakan kepada kami [Ali bin Al Husain bin Waqid] berkata, telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Az Zuhri] dari [Urwah] dari [Miswar bin Makhramah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada perceraian sebelum terjadi pernikahan dan tidak ada pembebasan sebelum memiliki",
          "tr": "Misver bin Mahrama (r.a.)'den rivayet edİldiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Nikâh kıyılmadan önce boşamak yoktur ve (köleye - cariyeye) mâlik olmadan önce (onları) azad etmek yoktur.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi hasendir. Çünkü ravi Ali bin el•Hüseyin bin Vakıd'ın güvenirliği ihtilaflıdır. Diğer ravi Hişam bin Sa'd da böyledir ve zayıftır. Fakat Müslim, Şevahid'de onun rivayetini almıştır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 2049,
      "arabicNumber": 2049,
      "book": 10,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنْ جُوَيْبِرٍ، عَنِ الضَّحَّاكِ، عَنِ النَّزَّالِ بْنِ سَبْرَةَ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ طَلاَقَ قَبْلَ النِّكَاحِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ' Ali bin Abu Talib that the Prophet (ﷺ) said :\"There is no divorce before marriage",
          "ur": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: نکاح سے پہلے طلاق نہیں ۔",
          "fr": "Rapporté par 'Ali bin Abu Talib : Le Prophète (ﷺ) a dit : \"Il n'y a pas de divorce avant le mariage",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami ['Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Juwaibir] dari [Adl Dlahhak] dari [Nazzal bin Sabrah] dari [Ali bin Abu Thalib] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada perceraian sebelum adanya pernikahan",
          "tr": "Ali bin Ebî Tâlib (r.a.)'den rivâyetrfdildiğine göre; Nebi (Sallallahu Aleyhi ve Scllem) şöyle buyurmuştur: «Nikâh kıyılmadan önce boşamak yoktur.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 2050,
      "arabicNumber": 2050,
      "book": 10,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ سَأَلْتُ الزُّهْرِيَّ أَىُّ أَزْوَاجِ النَّبِيِّ ـ صلى الله عليه وسلم ـ اسْتَعَاذَتْ مِنْهُ فَقَالَ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ أَنَّ ابْنَةَ الْجَوْنِ لَمَّا دَخَلَتْ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَدَنَا مِنْهَا قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ عُذْتِ بِعَظِيمٍ ‏.‏ الْحَقِي بِأَهْلِكِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Awza'i said :\"I asked Zuhri: 'Which of the wives of the Prophet (ﷺ) sought refuge with Allah from him? He said : \"Urwah told me, (narrating) from 'Aishah, that when the daughter of Jawn entered upon the Messenger of Allah (ﷺ) and he came close to her, she said: \"I seek refuge with Allah from you.\" the Messenger of Allah (ﷺ) said : \"You have sought refuge in the Almighty\" go to your family",
          "ur": "اوزاعی کہتے ہیں میں نے زہری سے پوچھا کہ نبی اکرم صلی اللہ علیہ وسلم کی کون سی بیوی نے آپ سے اللہ کی پناہ مانگی تو انہوں نے کہا: مجھے عروہ نے خبر دی کی عائشہ رضی اللہ عنہا نے فرمایا: جَون کی بیٹی جب نبی اکرم صلی اللہ علیہ وسلم کی خلوت میں آئی اور آپ صلی اللہ علیہ وسلم اس کے قریب گئے تو بولی: میں آپ سے اللہ کی پناہ مانگتی ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے ایک بڑی ہستی کی پناہ مانگی ہے تم اپنے گھر والوں کے پاس چلی جاؤ ۱؎۔",
          "fr": "Rapporté par Awza'i : J'ai demandé à Zuhri : \"Laquelle des épouses du Prophète (ﷺ) a cherché refuge auprès d'Allah contre lui ?\" Il a répondu : \"Urwah m'a raconté, d'après 'Aishah, que lorsque la fille de Jawn est entrée auprès du Messager d'Allah (ﷺ) et qu'il s'est approché d'elle, elle a dit : 'Je cherche refuge auprès d'Allah contre toi.' Le Messager d'Allah (ﷺ) a dit : 'Tu as cherché refuge auprès du Tout-Puissant. Retourne auprès de ta famille",
          "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] ia berkata; aku bertanya [Az Zuhri], \"Siapakah dari isteri-isteri Nabi shallallahu 'alaihi wasallam yang berlindung dari beliau?\" ia lalu berkata, \" [Urwah] telah mengabarkan kepadaku dari ['Aisyah], bahwa Puteri Al Jaun ketika bertemu dengan Rasulullah shallallahu 'alaihi wasallam dan beliau telah dekat dengannya, ia berkata, \"Aku berlindung kepada Allah darimu.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Engkau telah berlindung dengan sesuatu yang besar, kembalilah kepada keluargamu",
          "tr": "Evzâî (dediki): Ben Zühri'ye: Nebi (Sallallahu Aleyhi ve Sellem)'in hangi zevcesi O'ndan Allah'a sığınmıştır? diye sordum. Zührî şöyle cevap verdi, demiştir: Âişe (r.anha)'nın şöyle dediğini bana Urve haber vermiştir: Cevn kızı (Amra) Resulullah (Sallallahu Aleyhi ve Sellem) (e nikâh olunup O'nun huzuruna konulup Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ona yaklaşınca, Cevn kızı: Senden Allah'a sığınırım, dedi. Nebi (Sallallahu Aleyhi ve Sellem) de: «(Ey Cevn'in kızı) sen (şanı) büyük olan (Allah)'a sığındın. Artık ailen gile git.» buyurdu. Diğer tahric: Bu hadisi Buhari de rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Munkar"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 2051,
      "arabicNumber": 2051,
      "book": 10,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ جَرِيرِ بْنِ حَازِمٍ، عَنِ الزُّبَيْرِ بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ يَزِيدَ بْنِ رُكَانَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَأَتَى رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَأَلَهُ فَقَالَ ‏\"‏ مَا أَرَدْتَ بِهَا ‏\"‏ ‏.‏ قَالَ وَاحِدَةً ‏.‏ قَالَ ‏\"‏ آللَّهِ مَا أَرَدْتَ بِهَا إِلاَّ وَاحِدَةً قَالَ آللَّهِ مَا أَرَدْتُ بِهَا إِلاَّ وَاحِدَةً ‏.‏ قَالَ فَرَدَّهَا عَلَيْهِ ‏.‏ قَالَ مُحَمَّدُ بْنُ مَاجَهْ سَمِعْتُ أَبَا الْحَسَنِ عَلِيَّ بْنَ مُحَمَّدٍ الطَّنَافِسِيَّ يَقُولُ مَا أَشْرَفَ هَذَا الْحَدِيثَ ‏.‏ قَالَ ابْنُ مَاجَهْ أَبُو عُبَيْدٍ تَرَكَهُ نَاحِيَةً وَأَحْمَدُ جَبُنَ عَنْهُ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin 'Ali bin Yazid bin Rukanah, from his father, from his grandfather, that:he divorced his wife irrevocably, then he came to the Messenger of Allah (ﷺ) and asked him. He said: \"What did you mean by that?\" He said: \"One (divorce).\" He said: \"By Allah did you only mean one (divorce) thereby?\" He said: \"By Allah, I meant one.\" Then he sent her back to him. (Da'if)Muhammad bin Majah said: I heard Abul-Hasan ' Ali bin Muhammad Tanafisi saying: \"How noble is this Hadith.\" Ibn Majah said: 'Abu 'Ubaid left it (i.e., did not accept its narration) and Ahmad was fearful of it (i.e., of narrating it)",
          "ur": "رکانہ رضی اللہ عنہ کہتے ہیں کہ انہوں نے اپنی بیوی کو طلاق بتہ ( قطعی طلاق ) دے دی، پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو آپ نے ان سے پوچھا: تم نے اس سے کیا مراد لی ہے ؟ انہوں نے کہا: ایک ہی مراد لی ہے، آپ صلی اللہ علیہ وسلم نے پوچھا: قسم اللہ کی کیا تم نے اس سے ایک ہی مراد لی ہے ؟، انہوں نے کہا: قسم اللہ کی میں نے اس سے صرف ایک ہی مراد لی ہے، تب نبی اکرم صلی اللہ علیہ وسلم نے ان کی بیوی انہیں واپس لوٹا دی ۱؎۔ محمد بن ماجہ کہتے ہیں: میں نے محمد بن حسن بن علی طنافسی کو کہتے سنا: یہ حدیث کتنی عمدہ ہے۔ ابن ماجہ کہتے ہیں: ابوعبیدہ نے یہ حدیث ایک گوشے میں ڈال دی ہے، اور احمد اسے روایت کرنے کی ہمت نہیں کر سکے ہیں۔",
          "fr": "Rapporté par 'Abdullah bin 'Ali bin Yazid bin Rukanah, d'après son père, d'après son grand-père : Il a divorcé de sa femme de façon irrévocable, puis il est allé voir le Messager d'Allah (ﷺ) et l'a interrogé. Il a dit : \"Qu'entendais-tu par là ?\" Il a répondu : \"Un seul (divorce).\" Il a dit : \"Par Allah, voulais-tu vraiment dire un seul divorce ?\" Il a répondu : \"Par Allah, je voulais dire un seul.\" Alors il l'a renvoyée auprès de lui. (Da'if) Muhammad bin Majah a dit : J'ai entendu Abul-Hasan 'Ali bin Muhammad Tanafisi dire : \"Ce hadith est très noble.\" Ibn Majah a dit : \"Abu 'Ubaid ne l'a pas accepté (c'est-à-dire n'a pas retenu sa transmission) et Ahmad était réservé à son sujet (c'est-à-dire à l'idée de le transmettre)",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Jarir bin Hazim] dari [Az Zubair bin Sa'id] dari [Abdullah bin Ali bin Yazid bin Rukanah] dari [Bapaknya] dari [Kakeknya] bahwa ia telah mencerai isterinya dengan talak tiga. Lalu ia datang kepada Rasulullah shallallahu 'alaihi wasallam dan menanyakannya, lantas beliau balik bertanya: \"Apa yang kamu inginkan?\" ia menjawab: \"Talak satu.\" Beliau kembali menegaskan: \"Demi Allah, kamu tidak menginginkannya kecuali satu!? ia menjawab: \"Demi Allah, aku tidak menginginkannya kecuali satu.\" Ia berkata, \"Maka Beliau mengembalikan isterinya kepadanya.\" Muhammad bin Hajah berkata, \"Aku mendengar Abu Al Hasan Ali bin Muhammad Ath Thanafisi berkata, \"Betapa mulianya hadits ini.\" Ibnu Majah berkata, \"Nama Abu Ubaid telah ditinggalkan oleh Najiah, sementara Ahmad melemahkannya",
          "tr": "Abdullah bin Ali bin Yezîd bin Rukaııe (r.a.)'in dedesi (Rukane)'den rivayet edildiğine güre: Kendisi (Süheyme isimli) karısını \"Elbette boşamak\" sözü ile bo-şamış (Yâni boşama yemininde elbette kelimesini de kullanmış), sonra Resulullah (Sallallahu Aleyhi ve Sellem)'in huzuruna varıp ettiği yeminin hükmünü sormuştur. Nebi (Sallallahu Aleyhi ve Sellem) ona: \"Elbette kelimesi ile neyi kasdettin?» buyurmuş. Rukâne (r.a.): Bir talâkı, demiş. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): \"Bununla yalnız bir talâkı kasdettiğine Allah Teâlâ'nın ismi ife yemin eder misin?\" buyurmuş. Rukane (r.a.): Vallahi, ben elbette kelimesi ile yalnız bir talâk kasdettim, (bir'den fazla talâkı kasdetmedim) diye cevap vermiştir. Ravi demiştir kiı Bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Sellem), (sözü edilen) kadını Rükane'ye geri verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 2052,
      "arabicNumber": 2052,
      "book": 10,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ خَيَّرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَاخْتَرْنَاهُ ‏.‏ فَلَمْ نَرَهُ شَيْئًا ‏.‏",
        "translations": {
          "en": "It was narrated that Aishah said:\"The Messenger of Allah gave us the choice, and we chose him, and he did not consider it as something (i.e., an effective divorce)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم کو اختیار دیا تو ہم نے آپ ہی کو اختیار کیا، پھر آپ نے اس کو کچھ نہیں سمجھا ۱؎۔",
          "fr": "Rapporté par Aïcha : Le Messager d'Allah nous a donné le choix, et nous l'avons choisi, et il n'a pas considéré cela comme quelque chose (c'est-à-dire un divorce effectif)",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Muslim] dari [Masruq] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membuat pilihan untuk kami hingga kami pun memilihnya, dan sama sekali kami tidak ada keinginan memilih thalaq sedikitpun",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine güre şöyle de-nıişlir: Resulullah (Sallallahu Aleyhi ve Sellem), bizi (yâni muhterem zevcelerini, kendisi ile beraber kalmak ve kendisinden ayrılıp boşanmak hususunda) muhayyer bıraktı, biz (tüm zevceleri) kendisini (yâni Onun nikâhı altında kalmayı dünyalığa ve süse tercih edip) seçtik. Resül-i Ekrem, kendisini seçmemizi talâk olarak görmedi. (Yâni bunu talâk saymadı.) Diğer tahric: Bu hadisi Kütüb-i Sitte sahibIeri ve Ahmed rivayet etmişlerdir. Ahmed'in rivayeti uzundur. Diğer rivayetlerin bazı lafızlannda görülen farklılık manayı etkilemez. AÇIKLAMA 2053’te:"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 2053,
      "arabicNumber": 2053,
      "book": 10,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتْ ‏{وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ}‏ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ يَا عَائِشَةُ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تَعْجَلِي فِيهِ حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ قَالَتْ قَدْ عَلِمَ وَاللَّهِ أَنَّ أَبَوَىَّ لَمْ يَكُونَا لِيَأْمُرَانِي بِفِرَاقِهِ ‏.‏ قَالَتْ فَقَرَأَ عَلَىَّ ‏{يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا }‏ ‏.‏ الآيَاتِ ‏.‏ فَقُلْتُ فِي هَذَا أَسْتَأْمِرُ أَبَوَىَّ قَدِ اخْتَرْتُ اللَّهَ وَرَسُولَهُ ‏.‏",
        "translations": {
          "en": "It was narrated that Aishah said:\"When the following was revealed: 'But if you desire Allah and His Messenger, (ﷺ) the Messenger of Allah (ﷺ) entered upon me and said: 'O Aishah I want to say something to you, and you do not have to hasten (in making a decision) until you have consulted your parents.\"' She said: \"He knew, by Allah, that my parents would never tell me to leave him.\" She said: \"Then he recited to me: ' O Prophet (Muhammad)! Say to your wives: \" If you desire the life of this world, and its glitter.'\" I said: 'Do I need to consult my parents about this? I choose Allah and His Messenger",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب آیت: «وإن كنتن تردن الله ورسوله» اتری تو رسول اللہ صلی اللہ علیہ وسلم نے میرے پاس آ کر فرمایا: عائشہ! میں تم سے ایک بات کہنے والا ہوں، تم اس میں جب تک اپنے ماں باپ سے مشورہ نہ کر لینا جلد بازی نہ کرنا ، عائشہ رضی اللہ عنہا کہتی ہیں: اللہ کی قسم! آپ خوب جانتے تھے کہ میرے ماں باپ کبھی بھی آپ کو چھوڑ دینے کے لیے نہیں کہیں گے، پھر آپ صلی اللہ علیہ وسلم نے مجھ پر یہ آیت پڑھی: «يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها» ( سورة الأحزاب: 28 ) اے نبی! اپنی بیویوں سے کہہ دیجئیے کہ اگر تم دنیا کی زندگی اور اس کی آرائش و زیبائش پسند کرتی ہو تو آؤ میں تم کو کچھ دے کر اچھی طرح رخصت کر دوں، اور اگر تم اللہ اور اس کے رسول اور یوم آخرت کو چاہتی ہو تو تم میں سے جو نیک ہیں اللہ نے ان کے لیے بڑا ثواب تیار کر رکھا ہے … ( یہ سن کر ) میں بولی: کیا میں اس میں اپنے ماں باپ سے مشورہ لینے جاؤں گی! میں اللہ اور اس کے رسول کو اختیار کر چکی ہوں ۱؎۔",
          "fr": "Rapporté par Aïcha : Lorsque ce verset a été révélé : \"Mais si vous désirez Allah et Son Messager\", le Messager d'Allah (ﷺ) est venu me voir et a dit : \"Ô Aïcha, je veux te dire quelque chose, et tu n'as pas à te presser pour prendre une décision avant d'avoir consulté tes parents.\" Elle a dit : \"Il savait, par Allah, que mes parents ne me diraient jamais de le quitter.\" Elle a ajouté : \"Ensuite, il m'a récité : 'Ô Prophète (Muhammad) ! Dis à tes épouses : 'Si vous désirez la vie d'ici-bas et ses plaisirs...'\" J'ai dit : \"Ai-je besoin de consulter mes parents pour cela ? Je choisis Allah et Son Messager",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] ia berkata, \"Katika turun ayat: \"(Dan jika kamu sekalian menghendaki (keredhaan) Allah dan Rasulnya-Nya) \", Rasulullah shallallahu 'alaihi wasallam masuk menemuiku seraya bersabda: \"Wahai 'Aisyah, aku akan mengingatkan suatu perkara kepadamu, maka janganlah kamu segera dalam memberi putusan hingga engkau minta pertimbangan terlebih dahulu kepada kedua orang tuamu, \" 'Aisyah melanjutkan penuturannya, \"Demi Allah, beliau sudah tahu bahwa kedua orang tuaku tidak akan mungkin memberiku saran untuk berpisah dengannya.\" 'Aisyah berkata, \"Lalu beliau membacakan kepadaku ayat: \"(Hai Nabi, katakanlah kepada isteri-isterimu: 'Jika kamu sekalian mengingini kehidupan dunia dan perhiasannya..).\" 'Aisyah berkata, \"Apakah dalam perkara semacam ini aku akan meminta pertimbangan orang tuaku! Sungguh, aku lebih memilih Allah dan Rasul-Nya",
          "tr": "Aişe {r.anha)'dan: Şöyle demiştir: وإن كنتن تردن اللَّه ورسوله [Ahzab 29] ayeti inince Resulullah (Sallallahu Aleyhi ve Sellem) benim odama girdi ve: «Yâ Âişe! Ben sana bir durumu anlatacağım. Bu durum hakkında baban ve ananın emirlerini sormadan karar vermeye acele etmemende senin için bir mahzur yoktur» buyurdu. Âişe demiştir ki: Vallahi O, biliyordu ki babam ve anam Ondan ayrılmamı emredecek değiller. Âişe demiştir ki: Resûl-i Ekrem (bu tenbihten sonra); يا أيها النبي إن كنتن تردن الحياة وزينتها. [Ahzab 28] ayetlerini bana okudu. Bunun üzerine ben dedim ki: Bu hususta (yâni dünyalığı ve ziyneti veya Allah'ı ve Resulünü seçmek hakkında) babam ve anamın emirlerini mi soracağım. Ben Allah'ı ve Resulünü kesinlikle tercih edip seçtim. Diğer tahric: Bunu Müslim ve Buhari de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 2054,
      "arabicNumber": 2054,
      "book": 10,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ جَعْفَرِ بْنِ يَحْيَى بْنِ ثَوْبَانَ، عَنْ عَمِّهِ، عُمَارَةَ بْنِ ثَوْبَانَ عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ تَسْأَلُ الْمَرْأَةُ زَوْجَهَا الطَّلاَقَ فِي غَيْرِ كُنْهِهِ فَتَجِدَ رِيحَ الْجَنَّةِ ‏.‏ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:\"No woman asks for divorce when it is not absolutely necessary, but she will never smell the fragrance of paradise, although its fragrance can be detected from a distance of forty years' travel",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: عورت بغیر کسی حقیقی وجہ اور واقعی سبب کے اپنے شوہر سے طلاق کا مطالبہ نہ کرے تاکہ وہ جنت کی خوشبو پا سکے، جب کہ جنت کی خوشبو چالیس سال کی مسافت سے پائی جاتی ہے ۱؎۔",
          "fr": "Rapporté par Ibn 'Abbas : Le Prophète (ﷺ) a dit : \"Aucune femme ne demande le divorce sans raison valable, sinon elle ne sentira jamais le parfum du Paradis, alors que son parfum peut être perçu à une distance de quarante ans de voyage",
          "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Bisyr] berkata, telah menceritakan kepada kami [Abu 'Ashim] dari [Ja'far bin Yahya bin Tsauban] dari pamannya [Umarah bin Tsauban] dari ['Atha] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang isteri yang minta cerai suaminya bukan karena alasan yang dibenarkan kemudian mendapatkan bau surga, sungguh bau surga dapat dicapai dengan perjalanan empat puluh tahun",
          "tr": "(Abdullah) bin Abbâs (r.a.)'dan rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Boşanma talebinde mazur gösteren bir durum yokken, kocasından boşama isteğinde bulunmakla beraber cennet kokusunu bulan bir kadın yoktur.» Not: Bu hadisin senedinin zayıf olduğu Zevaid'de bildirilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 2055,
      "arabicNumber": 2055,
      "book": 10,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الأَزْهَرِ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَيُّمَا امْرَأَةٍ سَأَلَتْ زَوْجَهَا الطَّلاَقَ فِي غَيْرِ مَا بَأْسٍ فَحَرَامٌ عَلَيْهَا رَائِحَةُ الْجَنَّةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Thawban that the Messenger of Allah (ﷺ) said:'Any woman who asks her husband for a divorce when it is not absolutely necessary, the fragrance of Paradise will be forbidden to her",
          "ur": "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس کسی عورت نے اپنے شوہر سے بغیر کسی ایسی تکلیف کے جو طلاق لینے پر مجبور کرے طلاق کا مطالبہ کیا، تو اس پہ جنت کی خوشبو حرام ہے ۔",
          "fr": "Rapporté par Thawban : Le Messager d'Allah (ﷺ) a dit : \"Toute femme qui demande le divorce à son mari sans raison valable, le parfum du Paradis lui sera interdit",
          "id": "Telah menceritakan kepada kami [Ahmad Ibnul Azhar] berkata, telah menceritakan kepada kami [Muhammad Ibnul Fadll] dari [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Asma] dari [Tsauban] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita mana saja yang minta cerai kepada suaminya bukan karena alasan yang dibenarkan, maka ia tidak akan mendapatkan bau surga",
          "tr": "Sevbân (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Hangi kadın çetin bir durum bulunmadığı halde kocasından boşanma isteğinde bulunursa ona cennet kokusu haramdır.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 2056,
      "arabicNumber": 2056,
      "book": 10,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ جَمِيلَةَ بِنْتَ سَلُولَ، أَتَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَتْ وَاللَّهِ مَا أَعْتِبُ عَلَى ثَابِتٍ فِي دِينٍ وَلاَ خُلُقٍ ‏.‏ وَلَكِنِّي أَكْرَهُ الْكُفْرَ فِي الإِسْلاَمِ لاَ أُطِيقُهُ بُغْضًا ‏.‏ فَقَالَ لَهَا النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ فَأَمَرَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَأْخُذَ مِنْهَا حَدِيقَتَهُ وَلاَ يَزْدَادَ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that:Jamilah bint Salul came to the Prophet (ﷺ) and said: \"By Allah, I do not find any fault with Thabit regarding his religion nor his behavior, but I hate disbelief after becoming Muslim and I cannot stand him. \"The Prophet (ﷺ) said to her: 'WiIl you give him back his garden?\" She said: \"Yes.\" So the Messenger of Allah (ﷺ) told him to take back his garden from her and no more than that",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ جمیلہ بنت سلول رضی اللہ عنہا نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا: اللہ کی قسم میں ( اپنے شوہر ) ثابت پر کسی دینی و اخلاقی خرابی سے غصہ نہیں کر رہی ہوں، لیکن میں مسلمان ہو کر کفر ( شوہر کی ناشکری ) کو ناپسند کرتی ہوں، میں ان کے ساتھ نہیں رہ پاؤں گی کیونکہ شکل و صورت سے وہ مجھے ناپسند ہیں، تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: کیا ان کا دیا ہوا باغ واپس لوٹا دو گی ؟ انہوں نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے ثابت کو حکم دیا کہ اپنی بیوی جمیلہ سے اپنا باغ لے لیں، اور زیادہ نہ لیں ۱؎۔",
          "fr": "Rapporté par Ibn 'Abbas : Jamilah bint Salul est venue voir le Prophète (ﷺ) et a dit : \"Par Allah, je ne reproche rien à Thabit concernant sa religion ni son comportement, mais je déteste revenir à l'incroyance après être devenue musulmane et je ne peux pas le supporter.\" Le Prophète (ﷺ) lui a dit : \"Veux-tu lui rendre son jardin ?\" Elle a répondu : \"Oui.\" Alors le Messager d'Allah (ﷺ) a dit à Thabit de reprendre son jardin et rien de plus",
          "id": "Telah menceritakan kepada kami [Azhar bin Marwan] berkata, telah menceritakan kepada kami [Abdul A'la bin Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Jamilah binti Salul datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Aku tidak mencela Tsabit dalam masalah agama dan ahlaknya, akan tetapi aku benci kekafiran di dalam Islam, aku tidak mampu karena jengkel.\" Lalu Nabi shallallahu 'alaihi wasallam pun bersabda kepadanya: \"Apakah engkau bersedia mengembalikan kebun miliknya (mahar) kepadanya?\" ia menjawab, \"Ya.\" Maka beliau memerintahkan Tsabit mengambil kebun miliknya dan tidak memberi tambahan",
          "tr": "(Abdullah) bin Abbas (r.a.)'dan; Şöyle demiştir: Cemile bint-i Selul, Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resulallah! Vallahi ben (kocam) Sabit (bin Kays)'i ne diyaneti (nin noksanlığı), ne de huyu açısından kınıyorum. (Yani ondan ayrılmak istememin sebebi bu değildir.) Lakin (onun yanında kalırsam) küfrü mucip bir duruma düşmemi çirkin görüyorum, (çünkü) Ondan nefret etmemeye gücüm yetmiyor. (Bu cihetle ondan ayrılmak istiyorum), dedi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) Cemileye : «Sabit'in mehlr olarak sana vaktiyle vermiş olduğu bostanım kendisine geri verir misin?» diye sordu. Kadın: Evet veririm, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), Sabit bin Kays'a, bostanı Cemîle'den (geri) almasını ve bundan fazla bir şey almamasını (ve buna karşılık kadını boşamasını) emretti. (Kadın bostanı, Sabit de talakını verdi. Diğer tahric: Bu hadisi Buhari ve Beyhaki de rivayet etmişlerdir. AÇIKLAMA 2057’te)"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 2057,
      "arabicNumber": 2057,
      "book": 10,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حَجَّاجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ كَانَتْ حَبِيبَةُ بِنْتُ سَهْلٍ تَحْتَ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَكَانَ رَجُلاً دَمِيمًا ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ لَوْلاَ مَخَافَةُ اللَّهِ إِذَا دَخَلَ عَلَىَّ لَبَصَقْتُ فِي وَجْهِهِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ فَرَدَّتْ عَلَيْهِ حَدِيقَتَهُ ‏.‏ قَالَ فَفَرَّقَ بَيْنَهُمَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:\"Habibah bint Sahl was married to Thabit bin Qais bin Shammas, who was an ugly man. She said: 'O Messenger of Allah, (ﷺ) by Allah, were it not for fear of Allah when he enters upon me I would spit in his face.' The Messenger of Allah (ﷺ) said: 'Will you give him back his garden?' She :said: 'Yes.' So she gave him back his garden and the Messenger of Allah (ﷺ) separated them",
          "ur": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ حبیبہ بنت سہل رضی اللہ عنہا ثابت بن قیس بن شماس رضی اللہ عنہما کے نکاح میں تھیں، وہ ناٹے اور بدصورت آدمی تھے، حبیبہ رضی اللہ عنہا نے کہا: اللہ کے رسول! اللہ کی قسم! اگر اللہ کا ڈر نہ ہوتا تو ثابت جب میرے پاس آئے تو میں ان کے منہ پر تھوک دیتی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا تم ان کا باغ واپس لوٹا دو گی ؟ کہا: ہاں، اور ان کا باغ انہیں واپس دے دیا، تو رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کے درمیان جدائی کرا دی۔",
          "fr": "Rapporté par 'Amr bin Shu'aib, d'après son père, d'après son grand-père : Habibah bint Sahl était mariée à Thabit bin Qais bin Shammas, qui était un homme peu attirant. Elle a dit : \"Ô Messager d'Allah (ﷺ), par Allah, si je n'avais pas la crainte d'Allah quand il vient vers moi, je lui aurais craché au visage.\" Le Messager d'Allah (ﷺ) a dit : \"Veux-tu lui rendre son jardin ?\" Elle a répondu : \"Oui.\" Elle lui a donc rendu son jardin et le Messager d'Allah (ﷺ) les a séparés",
          "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Hajjaj] dari ['Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Habibah binti Sahl adalah isteri Tsabit bin Qais bin Syammas, sementara dia adalah seorang lelaki yang bermuka buruk. Habibah berkata, \"Wahai Rasulullah, demi Allah, sekiranya bukan karena takut kepada Allah, jika dia berani masuk kepadaku niscaya aku akan meludahi mukanya.\" Beliau lalu bersabda: \"Apakah kamu mau mengembalikan kebun miliknya (mahar) kepada dia?\" ia menjawab, \"Ya.\" Maka ia pun mengembalikan kebun tersebut kepada Tsabit bin Qais. Ia (perawi) berkata, \"Maka Rasulullah shallallahu 'alaihi wasallam pun menceraikan keduanya",
          "tr": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr) (r.a.)'den; Şöyle demiştir: Habîbe bint-i Sehl, Sabit bin Kays bin Şemmas'ın nikahı altında idi. Sabit kısa boylu çirkin bir adam idi. Habîbe: Ya Resulallah! Vallahi eğer Allah korkusu olmasaydı kocam sabit yanıma girdiği zaman (yaratılışı itibari ile çirkinliğinden) onun yüzüne tükürürdüm, dedi. (Bu yüzden ondan ayrılmak istediğini söyledi) Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), kadın'a: «Sabit'in, vaktiyle mehir olarak sana verdiği bostanını kendisine geri verirmisin?» diye sordu. Kadın:. Evet veririm, dedi. Ravi demiştir ki: Bunun üzerine kadın bostanı Sabit'e geri verdi. Ravi demiştir ki: Bundan sonra Resulullah (Sallallahu Aleyhi ve Sellem) Sabit ile Habîbe'yi biribirinden ayırdı. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Haccac bin Ertat bulunur. Bu zat tedlisçidir ve bu hadisi an'ane ile rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 2058,
      "arabicNumber": 2058,
      "book": 10,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ النَّيْسَابُورِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ، قَالَ قُلْتُ لَهَا حَدِّثِينِي حَدِيثَكِ، ‏.‏ قَالَتِ اخْتَلَعْتُ مِنْ زَوْجِي ثُمَّ جِئْتُ عُثْمَانَ ‏.‏ فَسَأَلْتُ مَاذَا عَلَىَّ مِنَ الْعِدَّةِ فَقَالَ لاَ عِدَّةَ عَلَيْكِ إِلاَّ أَنْ يَكُونَ حَدِيثَ عَهْدٍ بِكِ فَتَمْكُثِينَ عِنْدَهُ حَتَّى تَحِيضِينَ حَيْضَةً ‏.‏ قَالَتْ وَإِنَّمَا تَبِعَ فِي ذَلِكَ قَضَاءَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي مَرْيَمَ الْمَغَالِيَّةِ ‏.‏ وَكَانَتْ تَحْتَ ثَابِتِ بْنِ قَيْسٍ فَاخْتَلَعَتْ مِنْهُ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Ubadah bin Samit from Rubai' bint Mu'awwidh bin 'Afra'.:He said: \"I said to her: 'Tell me your Hadith.' She said: 'I got Khul' from my husband, then I came to 'Uthman and asked him: \"What waiting period do I have to observe?\" He said: \"You do not have to observe any waiting period, unless you had intercourse with him recently, in which case you should stay with him until you have menstruated.\" In that he was following the ruling of the Messenger of Allah (ﷺ) concerning Maryam Maghaliyyah, who was married to Thabit bin Qais and she got Khul' from him",
          "ur": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ میں نے ربیع بنت معوذ بن عفراء رضی اللہ عنہا سے کہا: تم مجھ سے اپنا واقعہ بیان کرو، انہوں نے کہا: میں نے اپنے شوہر سے خلع کرا لیا، پھر میں نے عثمان رضی اللہ عنہ کے پاس آ کر پوچھا: مجھ پر کتنی عدت ہے؟ انہوں نے کہا: تم پر کوئی عدت نہیں مگر یہ کہ تمہارے شوہر نے حال ہی میں تم سے صحبت کی ہو، تو تم اس کے پاس رکی رہو یہاں تک کہ تمہیں ایک حیض آ جائے، ربیع رضی اللہ عنہا نے کہا: عثمان رضی اللہ عنہ نے اس سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کے فیصلہ کی پیروی کی، جو آپ نے بنی مغالہ کی خاتون مریم رضی اللہ عنہا کے سلسلے میں کیا تھا، جو ثابت بن قیس رضی اللہ عنہ کی زوجیت میں تھیں اور ان سے خلع کر لیا تھا ۱؎۔",
          "fr": "Rapporté par 'Ubadah bin Samit, de la part de Rubai' bint Mu'awwidh bin 'Afra' : Il a dit : \"Je lui ai demandé : 'Raconte-moi ton hadith.' Elle a dit : 'J'ai obtenu le khul' de mon mari, puis je suis allée voir 'Uthman et je lui ai demandé : \"Quelle période d'attente dois-je observer ?\" Il a répondu : \"Tu n'as pas à observer de période d'attente, sauf si tu as eu récemment des rapports avec lui, dans ce cas tu dois rester avec lui jusqu'à ce que tu aies tes règles.\" Il suivait ainsi la décision du Messager d'Allah (ﷺ) concernant Maryam Maghaliyyah, qui était mariée à Thabit bin Qais et avait obtenu le khul' de lui",
          "id": "Telah menceritakan kepada kami [Ali bin Salamah An Naisaburi] berkata, telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] berkata, telah menceritakan kepada kami [Bapakku] dari [Ibnu Ishaq] berkata, telah mengabarkan kepadaku [Ubadah bin Al Walid bin Ubadah bin Ash Shamit] dari [Ar Rubayyi' binti Mu'awwidz bin Afra] berkata, \"Aku berkata kepadanya, \"Ceritakanlah kepadaku tentang masalahmu.\" Ia menuturkan, \"Aku menggugat cerai suamiku, kemudian aku mendatangi Utsman dan bertanya, \"Apa kewajibanku dari Iddah?\" Maka dia menjawab, \"Tidak ada 'Iddah bagimu, karena kamu masih dalam keadaan baru, maka tinggallah di sisinya sehingga kamu mengalami haid satu kali.\" Rubayyi' berkata, \"Dalam perkara itu dia hanya mengikuti keputusan Rasulullah shallallahu 'alaihi wasallam sebagaimana dalam kasus Maryam Al Maghaliyyah, yang saat itu sedang berada di bawah naungan Tsabit bin Qais, kemudian dia meminta khulu' darinya",
          "tr": "Ubade bin es-Sâmit (r.a.)'den; Şöyle demiştir: Ben Rübeyyi' bint-i Muavviz bin Afra' (r.anha)'ya: Bana, (kocanın seni hul' etmesi) olayını anlat, dedim. Rubeyyi' şöyle dedi: Ben hul' yolu ile kocamdan ayrıldım. Sonra Osman (bin Af-fân) (r.a.)'ın yanına vardım ve: Bana ne kadar iddet gerekir? diye sordum. Osman, bana: Senin üzerinde hiç bir iddet yoktur. Ancak kocan yakın bir zamanda sana yaklaşmış (yâni cinsi ilişkide bulunmuş) ise sen bir defa aybaşı âdetini görünceye kadar onun hakkı altında bekliyeceksin, dedi. Rubeyyi dedi ki: Osman bu fetvasında, Resulullah (Sallallahu Aleyhi ve Sellem)'in Meryem el-Mağâliye hakkında verdiği hükme uydu. Meryem, Sabit bin Kays'ın nikâhı altında idi, hul' yolu ile ondan ayrıldı idi. Diğer tahric: Nesai; Tirmizi (benzer)"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 2059,
      "arabicNumber": 2059,
      "book": 10,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الرِّجَالِ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ أَقْسَمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ لاَ يَدْخُلَ عَلَى نِسَائِهِ شَهْرًا فَمَكَثَ تِسْعَةً وَعِشْرِينَ يَوْمًا حَتَّى إِذَا كَانَ مَسَاءَ ثَلاَثِينَ دَخَلَ عَلَىَّ فَقُلْتُ إِنَّكَ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا ‏.‏ فَقَالَ ‏\"‏ شَهْرٌ هَكَذَا ‏\"‏ ‏.‏ يُرْسِلُ أَصَابِعَهُ فِيهَا ثَلاَثَ مَرَّاتٍ ‏\"‏ وَشَهْرٌ هَكَذَا ‏\"‏ ‏.‏ وَأَرْسَلَ أَصَابِعَهُ كُلَّهَا وَأَمْسَكَ إِصْبَعًا وَاحِدًا فِي الثَّالِثَةِ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) swore that he would not enter upon his wives for a month, and he stayed for twenty-nine days until, on the eve of the thirtieth, he entered upon me. I said: 'You swore not to enter upon us for a month.' He said: 'The month may be like this,' and he held up his (ten) fingers three times; 'or the month may be like this,' and he held up his fingers three times, keeping one finger down on the third time",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے قسم کھائی کہ ایک ماہ تک اپنی بیویوں کے پاس نہیں جائیں گے، آپ ۲۹ دن تک رکے رہے، جب تیسویں دن کی شام ہوئی تو آپ صلی اللہ علیہ وسلم میرے پاس آئے، میں نے کہا: آپ نے تو ایک ماہ تک ہمارے پاس نہ آنے کی قسم کھائی تھی؟! آپ صلی اللہ علیہ وسلم نے فرمایا: مہینہ اس طرح ہوتا ہے آپ نے دونوں ہاتھوں کی ساری انگلیوں کو کھلا رکھ کر تین بار فرمایا، اس طرح کل تیس دن ہوئے، پھر فرمایا: اور مہینہ اس طرح بھی ہوتا ہے اس بار دو دفعہ ساری انگلیوں کو کھلا رکھا، تیسری بار میں ایک انگلی بند کر لی۔",
          "fr": "Rapporté par Aïcha : Le Messager d'Allah (ﷺ) a juré de ne pas venir voir ses épouses pendant un mois, et il est resté absent pendant vingt-neuf jours, puis, la veille du trentième jour, il est venu me voir. J'ai dit : \"Tu as juré de ne pas venir nous voir pendant un mois.\" Il a répondu : \"Le mois peut être comme ceci,\" et il a montré ses dix doigts trois fois ; \"ou le mois peut être comme cela,\" et il a montré ses doigts trois fois, en gardant un doigt baissé la troisième fois",
          "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Abu Ar Rijal] dari [Bapaknya] dari [Amrah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah bersumpah untuk tidak menggauli isteri-isterinya selama satu bulan, hal itu berlangsung hingga dua puluh sembilan hari. Maka ketika masuk malam ke tiga puluh beliau masuk menemuiku, aku bertanya, \"Engkau telah bersumpah untuk tidak menemui kami selama satu bulan?! \" beliau menjawab: \"Satu bulan itu seperti ini -beliau mengacungkan jari-jarinya tiga kali-, satu bulan itu seperti ini -lalu beliau mengacungkan semua jarinya dan menggenggam satu jari pada kali ketiganya",
          "tr": "Aişe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), kadınlarının odalarına bir ay girmemeye yemin etti. Bu yemin üzerine, Resû-i Ekrem (Sallallahu Aleyhi ve Sellem) yirmi dokuz gün bekledi. Nihayet otuzuncu günün sonuna doğru benim odama teşrif buyurdu. Ben: Bir ay odalarımıza girmemeye şüphesiz yemin ettin, dedim. Resulullah (Sallallahu Aleyhi ve Sellem) üç kez: «Ay (bazen) şöyledir,» buyurdu ve her defasında elinin on parmağını salıveriyordu. (Sonra yine üç kez): «Ve ay (bazen) şöyledir,» (buyurdu) ve parmaklarının tamamını salıverdi, üçüncü defasında bir parmağını yumdu. Not: Zevaid'de şöyle denilmiştir: Bunun isnadı hasendir. ÇÜnkÜ Abdurrahman bin Ebi'r-Rical'in sikalığı ihtilaflıdır. AÇIKLAMA 2061’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 2060,
      "arabicNumber": 2060,
      "book": 10,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ حَارِثَةَ بْنِ مُحَمَّدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ إِنَّمَا آلَى لأَنَّ زَيْنَبَ رَدَّتْ عَلَيْهِ هَدِيَّتَهُ ‏.‏ فَقَالَتْ عَائِشَةُ لَقَدْ أَقْمَأَتْكَ ‏.‏ فَغَضِبَ ـ صلى الله عليه وسلم ـ فَآلَى مِنْهُنَّ ‏.‏",
        "translations": {
          "en": "It was narrated from Aishah that:the Messenger of Allah (ﷺ) swore to keep away from his wives, because Zainab had sent back her gift and 'Aishah said: \"She has disgraced you.\" He became angry and swore to keep away from them",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایلاء کیا، اس لیے کہ ام المؤمنین زینب رضی اللہ عنہا نے آپ کا بھیجا ہوا ہدیہ واپس کر دیا تھا، ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: زینب نے آپ کی بےقدری کی ہے، یہ سن کر آپ غصہ ہوئے اور ان سب سے ایلاء کر لیا ۱؎۔",
          "fr": "Rapporté par Aïcha : Le Messager d'Allah (ﷺ) a juré de s'éloigner de ses épouses, parce que Zaynab avait renvoyé son cadeau et Aïcha a dit : \"Elle t'a humilié.\" Il s'est alors mis en colère et a juré de s'éloigner d'elles",
          "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] dari [Haritsah bin Muhammad] dari [Amrah] dari ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan Ila` (sumpah tidak akan meniduri isterinya) karena Zainab mengembalikan hadiah pemberian beliau. 'Aisyah berkata, \"Sesungguhnya ia telah merendahkanmu.\" Maka Nabi shallallahu 'alaihi wasallam marah dan meng-Ila` mereka",
          "tr": "Âişe (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) ancak şu sebeble îlâ etti: (O'nun kadınlarından) Zeyneb (bint-i Cahş) O'nun hediyesini O'na iade etti. Bunun üzerine Âişe. Resûl-i Ekrem'e: Zeyneb şüphesiz senin hediyeni küçümsedi. dedi. Efendimiz (Sallallahu Aleyhi ve Sellem) de kızdı ve bütün kadınlarından İlâ etti. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Harise bin Muhammed bin Ebi'r-Ridl bulunur. Bu raviyi, Ahmed. İbn-i Main, Nesai, İbn-i Adi ve başkaları zayıf görmüşlerdir\" AÇIKLAMA 2061’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 2061,
      "arabicNumber": 2061,
      "book": 10,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ صَيْفِيٍّ، عَنْ عِكْرِمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ آلَى مِنْ بَعْضِ نِسَائِهِ شَهْرًا فَلَمَّا كَانَ تِسْعَةً وَعِشْرِينَ رَاحَ أَوْ غَدَا ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ إِنَّمَا مَضَى تِسْعٌ وَعِشْرُونَ ‏.‏ فَقَالَ ‏ \"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Umm Salamah that:the Messenger of Allah (ﷺ) swore to keep away from some of his wives for a month. On the twenty-ninth day, in the evening or the morning, it was said: \"O Messenger of Allah, only twenty-nine days have passed.\" He said: \"The month is twenty-nine days",
          "ur": "ام المؤمنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بعض بیویوں سے ایک ماہ کا ایلاء کیا، جب ۲۹ دن ہو گئے تو آپ صبح کو یا شام کو بیویوں کے پاس تشریف لے گئے، عرض کیا گیا: اللہ کے رسول! ابھی تو ۲۹ ہی دن ہوئے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: مہینہ ۲۹ کا بھی ہوتا ہے ۔",
          "fr": "Rapporté par Umm Salamah : Le Messager d'Allah (ﷺ) a juré de s'éloigner de certaines de ses épouses pendant un mois. Le vingt-neuvième jour, le soir ou le matin, on lui a dit : \"Ô Messager d'Allah, il ne s'est écoulé que vingt-neuf jours.\" Il a répondu : \"Le mois compte vingt-neuf jours",
          "id": "Telah menceritakan kepada kami [Ahmad bin Yusuf As Sulami] berkata, telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] dari [Yahya bin Abdullah bin Muhammad bin Shaifi] dari [Ikrimah bin 'Abdurrahman] dari [Ummu Salamah] berkata, \"Rasulullah shallallahu 'alaihi wasallam meng-Ila` (sumpah untuk tidak menggaulinya) sebagian isteri-isterinya selama satu bulan. Maka, ketika telah masuk hari ke dua puluh sembilan beliau keluar di waktu sore atau pagi hari. Lalu dikatakan kepada beliau, \"Wahai Rasulullah, sekarang baru berlalu dua puluh sembilan hari! \" beliau lantas bersabda: \"Satu bulan itu dua puluh sembilan hari",
          "tr": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre şöyle söylemiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bâzı kadınlarının odalarına bir ay girmemeye yemin etti. (Bu süre) yirmi dokuz gün olunca (otuzuncu) günün sonuna doğru veya evvelinde (Âişe'nin odasına) gitti. (Aişe tarafından): Yâ Resülallah ancak yirmi dokuz gün geçti, denildi Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Bu ay yirmi dokuz gündür,» buyurdu. AÇIKLAMA (2059, 2060 ve 2061): İlk hadis Zevaid türündendir. Bu hadiste: Resul-i Ekrem (s.a.v.)'in, kadınlarının odalarına bir ay gitmemeye yemin ettiği, ayın otuzuncu günü akşamdan önce Aişe (r.anha)'nın odasına girdiği, kadınlarının odalarına bir ay girmemeye yemin ettiği Aişe (r.anha) tarafından söylenince; ayın bazen otuz, bazen yirmi dokuz gün olduğunun buyurulduğu, ifade edilmektedir. Bu hadiste, Resul-i Ekrem (s.a.v.)'in yemin etmesine sebep olan olayın ne olduğu belirtilmemiştir. Aişe (r.anha)'nın ikinci hadisi de Zevaid türündendir. Bu hadiste Resul-i Ekrem (s.a.v.)'in yemin etmesine sebep olan olayın O'nun kadınlarından Zeyneb bint-i Cahş (r.anha)'nın Resul-i Ekrem (s.a.v.) tarafından kendisine gönderilen hediyeyi geri çevirmesi olduğu ifade edilmiştir. Peygamber (s.a.v.)'in söz konusu yeminine sebep olan olay hakkında başka rivayetler de vardır. Bazı rivayetlere göre bunun sebebi, ınuhterem zevcelerinin nafakalarını artırma talepleri olayıdır. Bu olay hakkında yeterli bilgi 2052 - 2053 nolu hadislerin izahı bölümünde verilmiştir. Diğer bazı rivayetlere göre Efendimizin söz konusu yemin etmesine sebep olan olay, Hz. Hafsa (r.anha)'nın, Peygamber (s.a.v.)'in talimatına rağmen gizli bir durumu Aişe (r.anha)'ya ifşa etmesi olayıdır. Bu olay hakkında gerekli bilgi 2016 nolu hadisin izahı bölümünde verilmiştir. Buhari'nin Nikah kitabının \"Adamın, kızına kocası hakkında nasihat etmesi\" babında rivayet ettiği Ömer (r.a.)'ın hadisinin izahı bölümünde el-Fetih yazarı bu olayların hepsine işaret ettikten sonra Peygamber (s.a.v.)'in yemin etmesinin sebebi bu olayların tümü olabilir, demiştir. Ümmü Seleme (r.anha)'nın hadisini Buhari de rivayet etmiştir. Buradaki rivayette Peygamber (s.a.v.)'in bazı kadınlarının odalarına bir ay girmemek için yemin ettiği ifade edilmiş ise de Buhari'nin rivayetine göre Peygamber (s.a.v.) bütün kadınlarının odalarına girmemeye yeniin etmiştir. Çünkü oradaki rivayette \"bazı kadınları\" kaydı yoktur. Diğer bazı rivayetlerden de anlaşılıyor ki; söz konusu yemin bütün kadınlarının odalarına girmemek içindi. Şunu tekrar hatırlatayım; Peygamber (s.a.v.)'in yemini kadınlarının odalarına bir ay girmemek içindir. Bu itibarla O'nun yemini Şer-i Şerifte beyan edilen ila sayılmaz. Çünkü ila'nın en az süresi dört aydır. Keza, fıkıhtaki ila, kadınla cinsi münasebette bulunmanıak üzere yapılan yemindir. Peygamber (s.a.v.)'in yemini ise kadınların odalarına girmemek hakkındadır. Bu noktadan da O'nun ki İla sayılmaz"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 2062,
      "arabicNumber": 2062,
      "book": 10,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ سَلَمَةَ بْنِ صَخْرٍ الْبَيَاضِيِّ، قَالَ كُنْتُ امْرَأً أَسْتَكْثِرُ مِنَ النِّسَاءِ لاَ أُرَى رَجُلاً كَانَ يُصِيبُ مِنْ ذَلِكَ مَا أُصِيبُ فَلَمَّا دَخَلَ رَمَضَانُ ظَاهَرْتُ مِنِ امْرَأَتِي حَتَّى يَنْسَلِخَ رَمَضَانُ فَبَيْنَمَا هِيَ تُحَدِّثُنِي ذَاتَ لَيْلَةٍ انْكَشَفَ لِي مِنْهَا شَىْءٌ فَوَثَبْتُ عَلَيْهَا فَوَاقَعْتُهَا فَلَمَّا أَصْبَحْتُ غَدَوْتُ عَلَى قَوْمِي فَأَخْبَرْتُهُمْ خَبَرِي وَقُلْتُ لَهُمْ سَلُوا لِي رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقَالُوا مَا كُنَّا لِنَفْعَلَ إِذًا يُنْزِلَ اللَّهُ فِينَا كِتَابًا أَوْ يَكُونَ فِينَا مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَوْلٌ فَيَبْقَى عَلَيْنَا عَارُهُ وَلَكِنْ سَوْفَ نُسَلِّمُكَ لِجَرِيرَتِكَ اذْهَبْ أَنْتَ فَاذْكُرْ شَأْنَكَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ فَخَرَجْتُ حَتَّى جِئْتُهُ فَأَخْبَرْتُهُ الْخَبَرَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَنْتَ بِذَاكَ ‏\"‏ ‏.‏ فَقُلْتُ أَنَا بِذَاكَ وَهَا أَنَا يَا رَسُولَ اللَّهِ صَابِرٌ لِحُكْمِ اللَّهِ عَلَىَّ ‏.‏ قَالَ ‏\"‏ فَأَعْتِقْ رَقَبَةً ‏\"‏ ‏.‏ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَصْبَحْتُ أَمْلِكُ إِلاَّ رَقَبَتِي هَذِهِ ‏.‏ قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ وَهَلْ دَخَلَ عَلَىَّ مَا دَخَلَ مِنَ الْبَلاَءِ إِلاَّ بِالصَّوْمِ قَالَ ‏\"‏ فَتَصَدَّقْ وَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ بِتْنَا لَيْلَتَنَا هَذِهِ مَا لَنَا عَشَاءٌ ‏.‏ قَالَ ‏\"‏ فَاذْهَبْ إِلَى صَاحِبِ صَدَقَةِ بَنِي زُرَيْقٍ فَقُلْ لَهُ فَلْيَدْفَعْهَا إِلَيْكَ وَأَطْعِمْ سِتِّينَ مِسْكِينًا وَانْتَفِعْ بِبَقِيَّتِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Salamah bin Sakhr Al-Bayadi said:\"I was a man who had a lot of desire for women, and I do not think there was any man who had as great a share of that as me. When Ramadan began, I declared Zihar upon my wife (to last) until Ramadan ended. While she was talking to me one night, part of her body became uncovered. I jumped on her and had intercourse with her. The next morning I went to my people and told them, and said to them: 'Ask the Messenger of Allah (ﷺ) for me.' They said: 'We will not do that, lest Allah reveal Quran concerning us or the Messenger of Allah (ﷺ) says, something about us, and it will be a lasting source of disgrace for us. Rather we will leave you to deal with it yourself. Go yourself and tell the Messenger of Allah (ﷺ) about your problem.' So I went out and when I came to him, I told him what happened. The Messenger of Allah (ﷺ) said: 'Did you really do that?' I said: 'I really did that, and here I am, O Messenger of Allah. (ﷺ) I will bear Allah’s ruling on me with patience.' He said: 'Free a slave.' I said: 'By the One Who sent you with the truth, I do not own anything but myself.' He said: 'Fast for two consecutive months.' I said: 'O Messenger of Allah, the thing that happened to me was only because of fasting.' He said: 'Then give charity, or feed sixty poor persons.' I said: 'By the One Who sent you with the truttu we spent last night with no dinner.' He said: 'Then go to the collector of charity of Banu Zuraiq, and tell him to give you something, then feed sixty poor persons, and benefit from the rest",
          "ur": "سلمہ بن صخر بیاضی رضی اللہ عنہ کہتے ہیں کہ میں ایک ایسا آدمی تھا جسے عورتوں کی بڑی چاہت رہتی تھی، میں کسی مرد کو نہیں جانتا جو عورت سے اتنی صحبت کرتا ہو جتنی میں کرتا تھا، جب رمضان آیا تو میں نے اپنی بیوی سے رمضان گزرنے تک ظہار کر لیا، ایک رات وہ مجھ سے باتیں کر رہی تھی کہ اس کا کچھ بدن کھل گیا، میں اس پہ چڑھ بیٹھا، اور اس سے مباشرت کر لی، جب صبح ہوئی تو میں اپنے لوگوں کے پاس گیا، اور ان سے اپنا قصہ بیان کیا، میں نے ان سے کہا: تم لوگ میرے لیے رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ پوچھو، تو انہوں نے کہا: ہم نہیں پوچھیں گے، ایسا نہ ہو کہ ہماری شان میں وحی اترے، یا رسول اللہ صلی اللہ علیہ وسلم ہم لوگوں کے سلسلے میں کچھ فرما دیں، اور اس کا عار ہمیشہ کے لیے باقی رہے لیکن اب یہ کام ہم تمہارے ہی سپرد کرتے ہیں، اب تم خود ہی جاؤ اور رسول اللہ صلی اللہ علیہ وسلم سے اپنا حال بیان کرو۔ سلمہ رضی اللہ عنہ کہتے ہیں کہ میں خود ہی چلا اور رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر آپ سے واقعہ بیان کیا، آپ نے فرمایا: تم نے یہ کام کیا ہے ؟ میں نے عرض کیا: ہاں، اے اللہ کے رسول! میں حاضر ہوں اور اپنے بارے میں اللہ کے حکم پر صابر ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم ایک غلام آزاد کرو ، میں نے عرض کیا: اللہ کے رسول! قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے، میں تو صرف اپنی جان کا مالک ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم لگاتار دو ماہ کے روزے رکھو، میں نے عرض کیا: اللہ کے رسول یہ بلا جو میرے اوپر آئی ہے روزے ہی کہ وجہ سے تو آئی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تو صدقہ دو، یا ساٹھ مسکینوں کو کھانا کھلاؤ ، میں نے کہا: قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے ہم نے یہ رات اس حالت میں گزاری ہے کہ ہمارے پاس رات کا کھانا نہ تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: بنی زریق کا صدقہ وصول کرنے والے کے پاس جاؤ، اور اس سے کہو کہ وہ تمہیں کچھ مال دیدے، اور اس میں سے ساٹھ مسکینوں کو کھلاؤ اور جو بچے اپنے کام میں لے لو ۱؎۔",
          "fr": "Rapporté par Salamah bin Sakhr Al-Bayadi : J'étais un homme avec beaucoup de désir pour les femmes, et je ne pense pas qu'il y ait eu un homme qui en avait autant que moi. Quand le Ramadan a commencé, j'ai prononcé le zihar sur ma femme jusqu'à la fin du Ramadan. Une nuit, alors qu'elle me parlait, une partie de son corps s'est découverte. J'ai sauté sur elle et j'ai eu un rapport avec elle. Le lendemain matin, je suis allé voir mes proches et je leur ai dit : \"Demandez au Messager d'Allah (ﷺ) pour moi.\" Ils ont répondu : \"Nous ne le ferons pas, de peur qu'Allah ne fasse descendre un verset sur nous ou que le Messager d'Allah (ﷺ) dise quelque chose sur nous, et que cela reste une honte pour nous. Va toi-même voir le Messager d'Allah (ﷺ) et parle-lui de ton problème.\" Je suis donc allé le voir et je lui ai raconté ce qui s'était passé. Le Messager d'Allah (ﷺ) a dit : \"Tu as vraiment fait cela ?\" J'ai répondu : \"Oui, ô Messager d'Allah (ﷺ), et j'accepterai la décision d'Allah avec patience.\" Il a dit : \"Libère un esclave.\" J'ai répondu : \"Par Celui qui t'a envoyé avec la vérité, je ne possède rien d'autre que moi-même.\" Il a dit : \"Jeûne deux mois consécutifs.\" J'ai dit : \"Ô Messager d'Allah, ce qui m'est arrivé, c'est justement à cause du jeûne.\" Il a dit : \"Alors fais l'aumône, ou nourris soixante pauvres.\" J'ai dit : \"Par Celui qui t'a envoyé avec la vérité, nous avons passé la nuit sans dîner.\" Il a dit : \"Va voir le collecteur de la zakat des Banu Zuraiq, demande-lui de te donner quelque chose, puis nourris soixante pauvres et garde le reste pour toi",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] berkata, telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin Amru bin 'Atha] dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr Al Bayadli] ia berkata, \"Aku adalah orang yang paling besar ketertarikannya terhadap wanita, tidak seorang laki-laki pun yang seperti aku dalam hal itu. Ketika masuk bulan ramadlan aku menzhihar isteriku hingga bulan ramadlan berakhir. Ketika pada suatu malam ia berbicara kepadaku, sebagian auratnya tersingkaf hingga aku pun mendekapnya dan menggaulinya. Di pagi harinya aku pergi menemui kaumku dan mengabarkan apa yang telah aku lakukan. Aku katakan kepada mereka, \"Temanilah aku untuk menemui Rasulullah shallallahu 'alaihi wasallam, \" mereka berkata, \"Kami tidak akan melakukannya, kami takut akan ada ayat yang Allah 'azza wajalla turunkan atas kami. Atau, akan keluar perkataan Rasulullah shallallahu 'alaihi wasallam atas kami. Akan tetapi kami akan menyerahkan kamu beserta dosa-dosamu, maka pergi dan sebutkanlah perkaramu kepada Rasulullah shallallahu 'alaihi wasallam.\" Salamah bin Shakhr Al Bayadli berkata, \"Lalu aku keluar menemui beliau dan aku kabarkan hal itu kepadanya, Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Kamu berdosa karena hal itu, \" aku menjawab, \"Aku berdosa karena hal itu! Wahai Rasulullah, aku akan sabar dengan hukum Allah.\" Beliau bersabda: \"Bebaskanlah seorang budak.\" Salamah bin Shakhr Al Bayadli berkata, \"Aku berkata, \"Demi yang mengutusmu dengan keberanan, disaat pagi hari aku tidak mempunyai kecuali hanya budak ini.\" beliau bersabda: \"Berpuasalah dua bulan berturut-turut.\" Salamah bin Shakhr Al Bayadli berkata, \"Aku berkata, \"Wahai Rasulullah, apakah ada sesuatu yang menjadikan aku tertimpa musibah kecuali puasa?\" beliau bersabda: \"Bersedekahlah, atau beliau mengatakan, \"berilah makan enam puluh orang miskin.\" Salamah bin Shakhr Al Bayadli berkata, \"Aku berkata, \"Demi yang mengutusmu dengan kebenaran, malam ini kami telah bermalam dan kami tidak mendapati makan malam.\" Beliau bersabda: \"Temuilah pemegang harta sedekah dari bani Zurai', katakan kepadanya agar ia memberikan harta itu kepadamu. Lalu berilah makan kepada enam puluh orang miskin, dan manfaatkanlah sisanya",
          "tr": "Seleme bin Sahr el-Beyazî (r.a.)'den; Şöyle demiştir: Ben (helalim olan) kadınlara karşı çok şehvetli bir adamdım. Benim kadar helali ile temasta bulunan bir erkeğin varlığını sanmıyorum. Bu durumum dolayısıyla Ramazan ayı girince, (gündüzleri bir hataya düşmemek için) Ramazan ayı çıkıncaya kadar karımdan zıhar'da bulundum. Bir gece karım benimle konuşurken onun şehvet getirici bir tarafı açılıp o yere gözüm ilişti. Bunun üzerine ben de karımın üstüne atlayıp temasta bulundum. Sabah olunca kavmimin yanına gidip başımdan geçeni anlattım ve: Benim için (bu durumu) Resulullah (Sallallahu Aleyhi ve Sellem)'e sorun, diye ricada bulundum. (Fakat) Onlar: Biz bunu yapacak değiliz. (Çünkü) bunu yaptığımız zaman, (bakarsın) Allah, hakkımızda ayet gönderir veya hakkımızda Resulullah (Sallallahu Aleyhi ve Sellem)'in bir kavli olur da bunun lekesi bizim üzerimizde kalır ve lakin, biz seni günahınla baş-başa bırakacağız. Sen git de halini Resulullah (Sallallahu Aleyhi ve Sellem)'e anlat, dediler. Seleme demiştir ki: Artık ben (onların yanından) çıktım ve nihayet Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)'in huzuruna varıp başımdan geçen olayı O'na arzettim. Resulullah (Sallallahu Aleyhi ve Sellem), bana: «Sen (mi) bu fiili işledin?» buyurdu. Ben de: (Evet) bunu yapan benim. Ve Ya Resûlallah! İşte ben (hazırım), Allah'ın benim aleyhimdeki hükmüne sabrederim, dedim. Resulullah (Sallallahu Aleyhi ve Sellem) : «Şu halde bir rakaba (köle veya cariye)yi azad et», buyurdu. Seleme demiştir ki ben: (Ya Resûlallah!) Seni hak (din) ile gönderen (Allah)'a yemin ederim ki, kendi nefsimden başka hiç bir şeye malik değilim, dedim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem); «O halde aralıksız iki ay oruç tut», buyurdu. Seleme demiştir ki, ben: Ya Resûlallah! Başıma gelen bela oruç tutmamdan başka bir sebeble mi geldi? dedim. Resûl-i Ekrem (Saİlallahu Aleyhi ve Sellem): «Bu durumda sen yetmiş yoksula sadaka ver veya yemek yedir», buyurdu. Seleme demiştir ki ben: Seni hak ile gönderen (Allah)'a yemin ederim ki, bu (geçen) gecemizi akşam yemeğimiz bulunmadığı halde geçirdik, dedim. Buyurdular ki: «Öyle ise Benî Zürayk (kabilesinin) zekat amili (memuru) na git de ona söyle, onların zekatını sana ödesin. Sen de (bundan) altmış yoksulu yedir ve kalanından yararlan,» Diğer tahric: Ahmed, Ebu Davud, Hakim, Tirmizi ve Beyhaki de bunu rivayet etmişıerdir. Hakim bu hadisin Müslim'in şartı üzerine sahih olduğunu, Tirmizi de bunun hasen - sahih olduğunu söylemişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 2063,
      "arabicNumber": 2063,
      "book": 10,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ، حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ قَالَتْ عَائِشَةُ تَبَارَكَ الَّذِي وَسِعَ سَمْعُهُ كُلَّ شَىْءٍ ‏.‏ إِنِّي لأَسْمَعُ كَلاَمَ خَوْلَةَ بِنْتِ ثَعْلَبَةَ وَيَخْفَى عَلَىَّ بَعْضُهُ وَهِيَ تَشْتَكِي زَوْجَهَا إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَهِيَ تَقُولُ يَا رَسُولَ اللَّهِ أَكَلَ شَبَابِي وَنَثَرْتُ لَهُ بَطْنِي حَتَّى إِذَا كَبِرَتْ سِنِّي وَانْقَطَعَ وَلَدِي ظَاهَرَ مِنِّي اللَّهُمَّ إِنِّي أَشْكُو إِلَيْكَ ‏.‏ فَمَا بَرِحَتْ حَتَّى نَزَلَ جِبْرَائِيلُ بِهَؤُلاَءِ الآيَاتِ ‏{‏قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ‏}‏‏.‏",
        "translations": {
          "en": "It was narrated from 'Urwah bin Zubair, that 'Aishah said:\"Blessed is the One Whose hearing encompasses all things. I heard some of the words of Khawlah bint Tha'labah, but some of her words were not clear to me, when she complained to the Messenger of Allah (ﷺ) about her husband, and said: 'O Messenger of Allah, (ﷺ) he has consumed my youth and I split my belly for him (i.e., bore him many children), but when I grew old and could no longer bear children he declared Zihar upon me; O Allah, I complain to You.' She continued to complain until Jibra'il brought down these Verses: 'Indeed Allah has heard the statement of she who pleads with you (O Muhammad) concerning her husband, and complains to Allah\" (58:)",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا نے کہا بابرکت ہے وہ ذات جو ہر چیز کو سنتی ہے، میں خولہ بنت ثعلبہ رضی اللہ عنہا کی بات سن رہی تھی، کچھ باتیں سمجھ میں نہیں آ رہی تھیں، وہ رسول اللہ صلی اللہ علیہ وسلم سے اپنے شوہر کی شکایت کر رہی تھیں کہ میرا شوہر میری جوانی کھا گیا، میں اس کی اولاد جنتی رہی، جب میں بوڑھی ہو گئی اور ولادت کا سلسلہ منقطع ہو گیا، تو اس نے مجھ سے ظہار کر لیا، اے اللہ! میں تجھ ہی سے شکوہ کرتی ہوں، وہ ابھی وہاں سے ہٹی بھی نہیں تھیں کہ جبرائیل علیہ السلام یہ آیتیں لے کر اترے: «قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله» ( سورة المجادلة: 1 ) اللہ نے اس عورت کی بات سن لی جو تجھ سے اپنے شوہر کے بارے میں جھگڑ رہی تھی اور اللہ سے شکوہ کر رہی تھی ۱؎۔",
          "fr": "Rapporté par 'Urwah bin Zubair, d'après Aïcha : Béni soit Celui dont l'ouïe englobe toute chose. J'ai entendu une partie des paroles de Khawlah bint Tha'labah, mais certaines de ses paroles ne m'étaient pas claires, lorsqu'elle s'est plainte au Messager d'Allah (ﷺ) au sujet de son mari, et a dit : \"Ô Messager d'Allah (ﷺ), il a pris ma jeunesse et j'ai porté ses enfants, mais quand j'ai vieilli et que je ne peux plus avoir d'enfants, il a prononcé le zihar sur moi ; Ô Allah, je me plains à Toi.\" Elle a continué à se plaindre jusqu'à ce que Jibril apporte ces versets : \"Allah a certes entendu la parole de celle qui discute avec toi (Ô Muhammad) au sujet de son mari et se plaint à Allah...\" (58:)",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Abu Ubaidah] berkata, telah menceritakan kepada kami [Bapakku] dari [Al A'masy] dari [Tamim bin Salamah] dari [Urwah bin Az Zubair] ia berkata, \" ['Aisyah] berkata, \"Maha Suci Allah yang pendengaran-Nya mencakup segala sesuatu. Sungguh, aku pernah mendengar perkataan Khaulah binti Tsa'labah ketika ia mengadu kepada Rasulullah shallallahu 'alaihi wasallam tentang suaminya, namun aku tidak mendengar yang sebagiannya. Ia mengatakan, \"Wahai Rasulullah, ia telah memakan masa mudaku dan aku buka rahimku untuknya. Namun ketika umurku telah senja dan tidak bisa lagi memberi anak ia menzhiharku. Ya Allah, aku mengadu kepada-Mu, \" ia tetap saja begitu hingga Jibril turun dengan membaya ayat-ayat tersebut: \"(Sesungguhnya Allah telah mendengar perkataan wanita yang mengajukan gugatan kepada kamu tentang suaminya, dan mengadukan (halnya) kepada Allah",
          "tr": "Aişe (r.anha)'dan; Şöyle demiştir: İşitmesi her şeyi kaplayan (Allah Teala) çok yücedir. Havle bint-i Salebe, kocasını Resulullah (Sallallahu Aleyhi ve Sellem)'e şikayet ederken (öyle yavaş fısıltı ile söylüyordu ki yanlarında bulunduğum halde) ben gerçekten onun sözlerini işitiyordum da bir kısmını duyamıyordum. Havle şöyle diyordu: 'Ya Resulallah! Kocam gençliğimi yedi, karnım ona saçıldı (yani ona evlad doğurdum). Nihayet yaslanıp çocuktan kesildiğim zaman kocam bana zihar yaptı. AlIahım, ben şüphesiz halimi sana. arzediyorum. Kadın (böyle demeye devam edip) henüz oradan ayrılmadan nihayet Cebrail (A.S.) şu ayetleri indirdi: «(Ey Muhammed) Kocası hakkında seninle tartışan ve halini Allah Teala'ya arzeden kadının sözünü Allah şüphesiz işitti ve Allah ikinizin karşılıklı konuşmanızı işitir. Şüphesiz Allah (her şeyi) hakkı ile işitici ve görücüdür.» [Mücadele 1, 2, 3 ve 4. ayet] Diğer tahric: Bu hadisi Nesai'de rivayet etmiştir. Hazin tefsirinde, bu hadisin Buhari ve Müslim'de rivayet edildiği bildirilmiş ise de buna. rastlıyamadım"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 2064,
      "arabicNumber": 2064,
      "book": 10,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ سَلَمَةَ بْنِ صَخْرٍ الْبَيَاضِيِّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي الْمُظَاهِرِ يُوَاقِعُ قَبْلَ أَنْ يُكَفِّرَ قَالَ ‏ \"‏ كَفَّارَةٌ وَاحِدَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Salamah bin Sakhr Al-Bayedi that:the Prophet (ﷺ) said concerning a man who declared Zihar upon his wife having intercourse with her before compensation: \"Let him offer one expiation",
          "ur": "سلمہ بن صخر بیاضی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ظہار کرنے والے شخص کے متعلق جو کفارہ کی ادائیگی سے پہلے جماع کر لے فرمایا: اس پر ایک ہی کفارہ ہے ۔",
          "fr": "Rapporté par Salamah bin Sakhr Al-Bayedi : Le Prophète (ﷺ) a dit, à propos d'un homme qui a prononcé le zihar sur sa femme et a eu un rapport avec elle avant d'avoir fait l'expiation : \"Qu'il offre une seule expiation",
          "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin Amru bin 'Atha] dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr Al Bayadli] dari Nabi shallallahu 'alaihi wasallam tentang seseorang yang menzhihar kemudian mensetubuhi (isteri yang ia zhihar) sebelum membayar kafarahnya, \"Cukup dengan satu kali kafarah",
          "tr": "Seleme bin Sahr el-Beyazî (r.a.)'den rivayet edildiğine göre: Kefaret ödemeden Önce karısı ile cinsel ilişkide bulunan ziharcı (zihâra yemin eden) adam hakkında Nebi (Sallallahu Aleyhi ve Sellem): «Bir kefaret (yeter) dir- buyurmuştur.\" Diğer tahric: Bu hadisi Tirmizi de rivayet etmiştir. AÇIKLAMA 2065’te"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 2065,
      "arabicNumber": 2065,
      "book": 10,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا مَعْمَرٌ، عَنِ الْحَكَمِ بْنِ أَبَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، ظَاهَرَ مِنِ امْرَأَتِهِ فَغَشِيَهَا قَبْلَ أَنْ يُكَفِّرَ فَأَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏ \"‏ مَا حَمَلَكَ عَلَى ذَلِكَ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ بَيَاضَ حِجْلَيْهَا فِي الْقَمَرِ فَلَمْ أَمْلِكْ نَفْسِي أَنْ وَقَعْتُ عَلَيْهَا ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَمَرَهُ أَلاَّ يَقْرَبَهَا حَتَّى يُكَفِّرَ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that:a man declared Zihar upon his wife, then he had intercourse with her before offering expiation. He came to the Prophet (ﷺ) and told him about that. He said: \"What made you do that?\" He said: \"I saw her ankles in the moonlight, and I could not control myself, and I had intercourse with her.\" The Messenger of Allah (ﷺ) smiled and told him not to go near her until he had offered expiation",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ ایک شخص نے اپنی بیوی سے ظہار کیا، اور کفارہ کی ادائیگی سے قبل ہی جماع کر لیا، چنانچہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور آپ سے اس کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے پوچھا: تم نے ایسا کیوں کیا ؟ وہ بولا: اللہ کے رسول! میں نے اس کے پازیب کی سفیدی چاندنی رات میں دیکھی، میں بے اختیار ہو گیا، اور اس سے جماع کر بیٹھا، رسول اللہ صلی اللہ علیہ وسلم مسکرائے، اور اسے حکم دیا کہ کفارہ کی ادائیگی سے پہلے اس کے قریب نہ جائے۔",
          "fr": "Rapporté par Ibn 'Abbas : Un homme a prononcé le zihar sur sa femme, puis il a eu un rapport avec elle avant de faire l'expiation. Il est venu voir le Prophète (ﷺ) et lui a raconté cela. Le Prophète (ﷺ) a dit : \"Qu'est-ce qui t'a poussé à faire cela ?\" Il a répondu : \"J'ai vu ses chevilles au clair de lune, je n'ai pas pu me retenir et j'ai eu un rapport avec elle.\" Le Messager d'Allah (ﷺ) a souri et lui a dit de ne plus s'approcher d'elle avant d'avoir fait l'expiation",
          "id": "Telah menceritakan kepada kami [Al Abbas bin Yazid] berkata, telah menceritakan kepada kami [Ghundar] berkata, telah menceritakan kepada kami [Ma'mar] dari [Al Hakam bin Aban] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Seseorang menzhihzar isterinya kemudian ia menggaulinya sebelum membayar kafarah. Lalu ia datang kepada Nabi shallallahu 'alaihi wasallam dan menerangkan permasalahannya. Beliau bertanya: \"Apa yang membuatmu berbuat seperti itu?\" ia menjawab, \"Ya Rasulullah, aku melihat putih kedua kakinya saat terkena sinar rembulan, hingga aku tidak mampu menguasai jiwaku untuk menggaulinya.\" Rasulullah shallallahu 'alaihi wasallam tertawa dan memerintahkannya agar tidak mendekatinya hingga membayar kafarah",
          "tr": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre: Bir adam— Seleme bin Sahr — karısı hakkında zihar yemininde bulunmuş ve kefaret ödemeden önce onunla cinsel temas etmiştir. Daha sonra Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek bu durumu O'na anlatmıştır. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) (adama): «Ne sebeple öyle ettin?» buyurmuş. Adam: Ya Resulallah! Ay ışığında karımın ayak bileziklerinin beyazlığını gördüm, bunun etkisi ile nefsime hakim olamayıp onunla cinsel temasta bulundum, demiş. Resulullah (Sallallahu Aleyhi ve Sellem), gülürasemiş ve kefaret ödeyinceye kadar kadına yaklaşmamasını ona emretmiştir. Diğer tahric: Ebu Davud, Tirmizi, Nesai ve Hakim de bunu rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 2066,
      "arabicNumber": 2066,
      "book": 10,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جَاءَ عُوَيْمِرٌ إِلَى عَاصِمِ بْنِ عَدِيٍّ فَقَالَ سَلْ لِي رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَقَتَلَهُ أَيُقْتَلُ بِهِ أَمْ كَيْفَ يَصْنَعُ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ذَلِكَ فَعَابَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الْمَسَائِلَ ‏.‏ ثُمَّ لَقِيَهُ عُوَيْمِرٌ فَسَأَلَهُ فَقَالَ مَا صَنَعْتَ فَقَالَ صَنَعْتُ أَنَّكَ لَمْ تَأْتِنِي بِخَيْرٍ سَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَعَابَ الْمَسَائِلَ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لآتِيَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَلأَسْأَلَنَّهُ ‏.‏ فَأَتَى رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَوَجَدَهُ قَدْ أُنْزِلَ عَلَيْهِ فِيهِمَا فَلاَعَنَ بَيْنَهُمَا فَقَالَ عُوَيْمِرٌ وَاللَّهِ لَئِنِ انْطَلَقْتُ بِهَا يَا رَسُولَ اللَّهِ لَقَدْ كَذَبْتُ عَلَيْهَا ‏.‏ قَالَ فَفَارَقَهَا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَصَارَتْ سُنَّةً فِي الْمُتَلاَعِنَيْنِ ثُمَّ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏ \"‏ انْظُرُوهَا فَإِنْ جَاءَتْ بِهِ أَسْحَمَ أَدْعَجَ الْعَيْنَيْنِ عَظِيمَ الأَلْيَتَيْنِ فَلاَ أُرَاهُ إِلاَّ قَدْ صَدَقَ عَلَيْهَا وَإِنْ جَاءَتْ بِهِ أُحَيْمِرَ كَأَنَّهُ وَحَرَةٌ فَلاَ أُرَاهُ إِلاَّ كَاذِبًا ‏\"‏ ‏.‏ قَالَ فَجَاءَتْ بِهِ عَلَى النَّعْتِ الْمَكْرُوهِ ‏.‏",
        "translations": {
          "en": "It was narrated that Sahl bin Sa'd As-Sa'idi said:\"Uwaimir came to 'Asim bin 'Adi and said: 'Ask the Messenger of Ailah (ﷺ) for me: \"Do you think that if a man finds another man with his wife and kills him, he should be killed in retaliation, or what should he do?\" 'Asim asked the Messenger of Allah (ﷺ) about that, and the Messenger of Allah (ﷺ) disapproved of the question. Then 'Uwaimir met him ('Asim) and asked him about that, saying: 'What did you do?’ He said: I did that and you have not brought me any good. I asked the Messenger of Allah (ﷺ) and he disapproved of this question.’ Uwaimir said: 'By Allah, I will go to the Messenger of Allah (ﷺ) myself and ask him.' So he went to the Messenger of Allah (ﷺ) and found that Qur'an had been revealed concerning them, and the Prophet (ﷺ) told them to go through the procedure of Li'an. 'Uwaimir said: 'O Messenger of Allah, (ﷺ) by Allah if I take her back, I would have been telling lies about her.' So he left her before the Messenger of Allah (ﷺ) told him to do so, and that became the Sunnah for two who engage in the procedure of Li'an. Then the Prophet (ﷺ) said: 'Wait and see. If she gives birth to a child who is black in color with widely-spaced dark eyes and large buttocks, then I think that he was telling the truth about her, but if she gives birth to a child with a red complexion like a Wahrah,[1] then I think that he was lying.' Then she gave birth to a child with features resembling those of the man concerning whom she was accused",
          "ur": "سہل بن سعد ساعدی رضی اللہ عنہ کہتے ہیں کہ عویمر عجلانی ( رضی اللہ عنہ ) عاصم بن عدی ( رضی اللہ عنہ ) کے پاس آئے، اور کہنے لگے کہ رسول اللہ صلی اللہ علیہ وسلم سے میرے لیے یہ مسئلہ پوچھو کہ اگر کوئی مرد اپنی عورت کے ساتھ کسی اجنبی مرد کو ( زنا ) کرتے ہوئے پائے پھر اس کو قتل کر دے تو کیا اس کے بدلے اسے بھی قتل کر دیا جائے گا یا وہ کیا کرے؟ عاصم ( رضی اللہ عنہ ) نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا، آپ صلی اللہ علیہ وسلم کو ایسے سوالات برے لگے ۱؎، پھر عویمر ( رضی اللہ عنہ ) عاصم ( رضی اللہ عنہ ) سے ملے اور پوچھا: تم نے کیا کیا؟ عاصم رضی اللہ عنہ نے کہا: میں نے کیا جو کیا یعنی پوچھا لیکن تم سے مجھے کوئی بھلائی نہیں پہنچی، میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تو آپ نے اس طرح کے سوالوں کو برا جانا، عویمر رضی اللہ عنہ کہنے لگے: اللہ کی قسم میں رسول اللہ صلی اللہ علیہ وسلم کے پاس خود جاؤں گا اور آپ سے پوچھوں گا، چنانچہ وہ خود آپ کے پاس آئے تو دیکھا کہ ان دونوں کے بارے میں وحی اتر چکی ہے، آپ صلی اللہ علیہ وسلم نے ان دونوں کے درمیان لعان کرا دیا، عویمر رضی اللہ عنہ نے کہا: اللہ کے رسول! اب اگر اس عورت کو میں ساتھ لے جاؤں تو گویا میں نے اس پر تہمت لگائی چنانچہ انہوں نے اس کو نبی اکرم صلی اللہ علیہ وسلم کے حکم سے پہلے ہی چھوڑ دیا، پھر لعان کرنے والوں کے بارے میں یہ دستور ہو گیا۔ پھر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: دیکھو اگر عویمر کی عورت کالے رنگ کا، کالی آنکھوں والا، بڑی سرین والا بچہ جنے تو میں سمجھتا ہوں کہ عویمر سچے ہیں، اور اگر سرخ رنگ کا بچہ جنے جیسے وحرہ ( سرخ کیڑا ہوتا ہے ) تو میں سمجھتا ہوں وہ جھوٹے ہیں ۔ راوی کہتے ہیں کہ پھر اس عورت کا بچہ بری شکل پہ پیدا ہوا۔",
          "fr": "Rapporté par Sahl bin Sa'd As-Sa'idi : Uwaimir est allé voir 'Asim bin 'Adi et lui a dit : \"Demande au Messager d'Allah (ﷺ) pour moi : 'Penses-tu que si un homme trouve un autre homme avec sa femme et le tue, il sera tué en représailles, ou que doit-il faire ?'\" 'Asim a posé la question au Messager d'Allah (ﷺ), qui n'a pas apprécié la question. Ensuite, Uwaimir l'a rencontré et lui a demandé : \"Qu'as-tu fait ?\" Il a répondu : \"Je l'ai fait, mais tu ne m'as rien apporté de bon. J'ai posé la question au Messager d'Allah (ﷺ) et il n'a pas aimé cette question.\" Uwaimir a dit : \"Par Allah, j'irai moi-même demander au Messager d'Allah (ﷺ).\" Il est donc allé voir le Prophète (ﷺ) et a appris que le Coran avait été révélé à ce sujet, et le Prophète (ﷺ) leur a ordonné de suivre la procédure du li'an. Uwaimir a dit : \"Ô Messager d'Allah (ﷺ), par Allah, si je la reprends, j'aurais menti à son sujet.\" Il l'a donc quittée avant même que le Messager d'Allah (ﷺ) ne le lui ordonne, et cela est devenu la règle pour deux personnes qui font le li'an. Ensuite, le Prophète (ﷺ) a dit : \"Attendez de voir. Si elle donne naissance à un enfant noir aux yeux foncés et aux grosses fesses, alors je pense qu'il disait la vérité à son sujet, mais si elle donne naissance à un enfant à la peau rouge comme une Wahrah, alors je pense qu'il mentait.\" Elle a ensuite donné naissance à un enfant qui ressemblait à l'homme dont elle avait été accusée",
          "id": "Telah menceritakan kepada kami [Abu Marwan Al Utsmani Muhammad bin Utsman] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [Sahl bin Sa'd As Sa'idi] ia berkata, \"Uwaimir datang menemui Ashim bin Adi dan berkata, \"Sampaikanlah pertanyaanku kepada Rasulullah shallallahu 'alaihi wasallam; apa pendapatmu jika seorang laki-laki marah ketika mendapati isterinya bersama laki-laki lain hingga ia membunuhnya. Apakah ia harus dibunuh (qishash) atau bagaimana?\" maka Ashim pun menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, namun Rasulullah shallallahu 'alaihi wasallam mencela (benci) pertanyaan tersebut. Uwaimir lantas menemui Ashim dan bertanya kepadanya, \"Apa yang telah engkau lakukan?\" ia menjawab, \"Engkau datang kepadaku tidak membawa kebaikan, aku telah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, namun beliau mencela pertanyaan tersebut. Maka Uwaimir pun berkata, \"Demi Allah, sungguh aku akan mendatangi Rasulullah shallallahu 'alaihi wasallam dan menanyakan hal itu kepadanya.\" Akhirnya ia datang menemui Rasulullah shallallahu 'alaihi wasallam, ia menemui beliau saat ayat yang berkenaan dengan permasalahannya telah diturunkan. Lalu Rasulullah menyuruhnya untuk saling mengambil sumpah antara keduanya. Uwaimir berkata, \"Demi Allah ya Rasulullah, jika aku membawanya pulang ke rumahku, berarti aku berdusta (tidak konsisten dengan ucapanku)?! \" Ia (perawi) berkata, \"Uwaimir pun berpisah dengan isterinya sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya, hingga itu menjadi hal pertama kali yang terjadi dalam kasus li'an. Setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Tolong awasi dan selidiki wanita itu, jika ia melahirkan bayinya yang berkulit hitam, warna mata yang sangat hitam dan pantat besar, berarti suaminya benar. Namun jika wanita itu melahirkan bayi dengan ciri-ciri warna kemerahan seperti wahrah (binatang semacam tokek), berarti suaminya yang bohong.\" Ia (perawi) berkata, \"Ternyata wanita itu melahirkan bayi yang ciri-cirinya tidak cocok dengan ayahnya ('Uwaimir)",
          "tr": "Sehl bin Sa'd-i Saidî (r.a.)'daa rivayet edildiğine göre şöyle demiştir: (Aclan oğullarından) Uveymir, (Aclan oğullarının başı olan) Asim bin Adî'ye gelerek: Benim için Resulullah (Sallallahu Aleyhi ve Sellem)'e şu soruyu sor, dedi: (Ya Resûlallah!)ne dersin? Bir kimse, karısının beraberinde bir adamı bulsa (zina ettiklerini muhakkak bilse) ve (zani) adamı öldürse, bu Öldürme nedeni ile kadının kocası kısas olarak öldürülür mü? Yoksa kadının kocası ne yapar? Asim da gidip bu soruyu Resulullah (Sallallahu Aleyhi ve Sellem)'e sordu. Fakat Resulullah (Sallallahu Aleyhi ve Sellem), bu soruları ayıpladı. Sonra Uveymir, Asım'a rastladı ve: Ne yaptın? diye sordu. Asim ona: Sen bana iyi bir iş getirmedin. Ben (senin sorunu) Resulullah (Sallallahu Aleyhi ve Sellem)'e sordum. Ama O, bu soruları ayıpladı (böyle meseleleri sormayı çirkin gördü), dedi. Bunun üzerine Uveymir : — Vallahi ben kendim Resulullah (Sallallahu Aleyhi ve Sellem)'e gidip bu soruyu muhakkak soracağım, dedi ve Resulullah (Sallallahu Aleyhi ve Sellem)'in huzuruna çıktı. Baktı ki kendisi ile karısı hakkında Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'e Kur'an ayetleri indirilmiş. Bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Seliem), Uveymir ile karısı (Havle) arasında Lian işlemini icra etti. Bu işlemden hemen sonra Uveymir: Ey Allah'ın Resulü! Allah'a yemin ederim ki eğer ben bu kadını götürsem (yani nikahım altında tutarsam) onun aleyhinde yalan söz söylemiş olurum, dedi. Ravi demiştir ki: Ve Resulullah (Sallallahu Aleyhi ve Sellem), Uveymir'e (karısını boşamasını) emretmeden önce kendisi karısından ayrıldı (yani üç talakla boşadı). Artık lanetleşen karı, koca hakkında bu şekil boşama, uyulan bir yol oldu. Sonra Nebi (Sallallahu Aleyhi ve Seliem) (orada bulunanlara): «Bu kadın'a nezaret ediniz. Eğer vücudu siyah, gözlerinin siyahı koyu, kalçaları iri (ve baldırları kaba) bir çocuk getirirse ben Uveymir'in bu kadına zina isnadında gerçekten doğru olduğunu sanırım. Eğer kadın keler nevinden kızılca kurt gibi kızılca bir çocuk getirir (doğurur) ise ben Uveymir'in yalancı olduğunu sanırım» buyurdu. Ravi demiştir ki sonra kadın hoşlanılmayan (Yani zina isnadını doğrulayıcı) surette bir çocuk getirdi.\" Diğer tahric: Bu hadisi, Tirmizi hariç Kütüb-İ Sitte sahibieri ve imamlar da rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 2067,
      "arabicNumber": 2067,
      "book": 10,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، قَالَ أَنْبَأَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ هِلاَلَ بْنَ أُمَيَّةَ، قَذَفَ امْرَأَتَهُ عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِشَرِيكِ بْنِ سَحْمَاءَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ الْبَيِّنَةُ أَوْ حَدٌّ فِي ظَهْرِكَ ‏\"‏ ‏.‏ فَقَالَ هِلاَلُ بْنُ أُمَيَّةَ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنِّي لَصَادِقٌ وَلَيُنْزِلَنَّ اللَّهُ فِي أَمْرِي مَا يُبَرِّئُ ظَهْرِي ‏.‏ قَالَ فَنَزَلَتْ ‏{‏وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُنْ لَهُمْ شُهَدَاءُ إِلاَّ أَنْفُسُهُمْ‏}‏ ‏.‏ حَتَّى بَلَغَ ‏{‏وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ‏}‏ ‏.‏ فَانْصَرَفَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَأَرْسَلَ إِلَيْهِمَا فَجَاءَا فَقَامَ هِلاَلُ بْنُ أُمَيَّةَ فَشَهِدَ وَالنَّبِيُّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنَّ اللَّهَ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْ تَائِبٍ ‏\"‏ ‏.‏ ثُمَّ قَامَتْ فَشَهِدَتْ فَلَمَّا كَانَ عِنْدَ الْخَامِسَةِ ‏{‏أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ‏}‏ ‏.‏ قَالُوا لَهَا إِنَّهَا الْمُوجِبَةُ ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَتَلَكَّأَتْ وَنَكَصَتْ حَتَّى ظَنَنَّا أَنَّهَا سَتَرْجِعُ فَقَالَتْ وَاللَّهِ لاَ أَفْضَحُ قَوْمِي سَائِرَ الْيَوْمِ ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ انْظُرُوهَا فَإِنْ جَاءَتْ بِهِ أَكْحَلَ الْعَيْنَيْنِ سَابِغَ الأَلْيَتَيْنِ خَدَلَّجَ السَّاقَيْنِ فَهُوَ لِشَرِيكِ بْنِ سَحْمَاءَ ‏\"‏ ‏.‏ فَجَاءَتْ بِهِ كَذَلِكَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ لَوْلاَ مَا مَضَى مِنْ كِتَابِ اللَّهِ لَكَانَ لِي وَلَهَا شَأْنٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that:Hilal bin Umayyah accused his wife in the presence of the Prophet (ﷺ) of (committing adultery) with Sharik bin Sahma'. The Prophet said: \"Bring proof or you will feel the Hadd (punishment) on your back.\" Hilal bin Umayyah said: \"By the One Who sent you with the truth, I am telling the truth, and Allah will send down revelation concerning my situation which will spare my back.\" Then the following was revealed: \"And for those who accuse their wives, but have no witnesses except themselves, let the testimony of one of them be four testimonies (i.e., testifies four times) by Allah that he is one of those who speak the truth. And the fifth (testimony should be) the invoking of the curse of Allah on him if he be of those who tell a lie (against her). But it shall avert the punishment (of stoning to death) from her, it she bears witness four times by Allah, that he (her husband) is telling a lie. And the fifth (testimony) should be that the wrath of Allah be upon her if he (her husband) speaks the truth.\" The Prophet (ﷺ), turned and sent for them, and they came. Hilal bin Umayyah stood up and bore witness, and the Prophet (ﷺ) said: \"Allah knows that one of you is lying. Will either of you repent?\" Then she stood up and affirmed her innocence. On the fifth time, meaning that the wrath of Allah be upon her if he (her husband) speaks the truth, they said to her: \"It will invoke the wrath of Allah.\" Ibn 'Abbas said: \"She hesitated and backed up, until we thought that she was going to recant. Then she said: 'By Allah, I cannot dishonor my people for ever.' Then the Prophet (ﷺ) said: 'Wait and see. If she gives birth to a child with black eyes, fleshy buttocks and big calves, then he is the son of Sharik bin Sahma'.' And she gave birth to such a child. Then the Prophet (ﷺ) said: 'Had it not the matter been settled by the Book of Allah, I would have punished her severely",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ہلال بن امیہ رضی اللہ عنہ نے اپنی بیوی پر نبی اکرم صلی اللہ علیہ وسلم کے سامنے شریک بن سحماء کے ساتھ ( بدکاری کا ) الزام لگایا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم گواہ لاؤ ورنہ تمہاری پیٹھ پر کوڑے لگیں گے، ہلال بن امیہ رضی اللہ عنہ نے کہا: قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے میں بالکل سچا ہوں، اور اللہ تعالیٰ میرے بارے میں کوئی ایسا حکم اتارے گا جس سے میری پیٹھ حد لگنے سے بچ جائے گی، راوی نے کہا: پھر یہ آیت اتری: «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم» جو لوگ اپنی بیویوں کو تہمت لگاتے ہیں اور ان کے پاس اپنے سوا کوئی گواہ نہیں ہوتے… یہاں تک کہ اخیر آیت: «والخامسة أن غضب الله عليها إن كان من الصادقين» ( سورة النور: ۶-۹ ) تک پہنچے تو نبی اکرم صلی اللہ علیہ وسلم لوٹے اور ہلال اور ان کی بیوی دونوں کو بلوایا، وہ دونوں آئے، ہلال بن امیہ رضی اللہ عنہ کھڑے ہوئے اور گواہیاں دیں، نبی اکرم صلی اللہ علیہ وسلم فرما رہے تھے: اللہ تعالیٰ جانتا ہے کہ تم میں سے ایک جھوٹا ہے، تو کوئی ہے توبہ کرنے والا ، اس کے بعد ان کی بیوی کھڑی ہوئی اور اس نے گواہی دی، جب پانچویں گواہی کا وقت آیا یعنی یہ کہنے کا کہ عورت پہ اللہ کا غضب نازل ہو اگر مرد سچا ہو تو لوگوں نے عورت سے کہا: یہ گواہی ضرور واجب کر دے گی۔ ابن عباس رضی اللہ عنہما کہتے ہیں کہ یہ سن کر وہ عورت جھجکی اور واپس مڑی یہاں تک کہ ہم نے گمان کیا کہ اب وہ اپنی گواہی سے پھر جائے گی، لیکن اس نے کہا: اللہ کی قسم! میں تو اپنے گھر والوں کو زندگی بھر کے لیے رسوا اور ذلیل نہیں کروں گی۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: دیکھو اگر اس عورت کو کالی آنکھوں والا، بھری سرین والا، موٹی پنڈلیوں والا بچہ پیدا ہو، تو وہ شریک بن سحماء کا ہے ، بالآخر اسی شکل کا لڑکا پیدا ہوا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اگر اللہ کی کتاب کا فیصلہ جو ہو چکا نہ ہوا ہوتا تو میں اس عورت کے ساتھ ضرور کچھ سزا کا معاملہ کرتا ۱؎۔",
          "fr": "Rapporté par Ibn 'Abbas : Hilal bin Umayyah a accusé sa femme devant le Prophète (ﷺ) d'adultère avec Sharik bin Sahma'. Le Prophète a dit : \"Apporte une preuve ou tu recevras la peine (le châtiment) sur ton dos.\" Hilal bin Umayyah a dit : \"Par Celui qui t'a envoyé avec la vérité, je dis la vérité, et Allah révélera quelque chose à mon sujet qui me préservera du châtiment.\" Puis ce verset a été révélé : \"Et ceux qui accusent leurs épouses sans avoir d'autres témoins qu'eux-mêmes, le témoignage de l'un d'eux doit être de jurer quatre fois par Allah qu'il est du nombre des véridiques. Et la cinquième fois, qu'il invoque la malédiction d'Allah sur lui s'il ment. Mais elle évitera la punition si elle jure quatre fois par Allah qu'il ment, et la cinquième fois qu'elle invoque la colère d'Allah sur elle s'il dit la vérité.\" Le Prophète (ﷺ) s'est alors tourné et les a fait venir. Hilal bin Umayyah s'est levé et a témoigné, et le Prophète (ﷺ) a dit : \"Allah sait que l'un de vous ment. L'un de vous veut-il se repentir ?\" Puis elle s'est levée et a affirmé son innocence. À la cinquième fois, c'est-à-dire lorsqu'elle a invoqué la colère d'Allah sur elle si son mari disait la vérité, ils lui ont dit : \"Cela invoquera la colère d'Allah.\" Ibn 'Abbas a dit : \"Elle a hésité et reculé, au point que nous avons cru qu'elle allait se rétracter. Puis elle a dit : 'Par Allah, je ne déshonorerai jamais ma famille.' Ensuite, le Prophète (ﷺ) a dit : 'Attendez de voir. Si elle donne naissance à un enfant aux yeux noirs, aux grosses fesses et aux gros mollets, alors c'est le fils de Sharik bin Sahma'.' Et elle a donné naissance à un tel enfant. Le Prophète (ﷺ) a dit : 'Si l'affaire n'avait pas été tranchée par le Livre d'Allah, je l'aurais punie sévèrement",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Ibnu Abu Adi] berkata, telah memberitakan kepada kami [Hisyam bin Hassan] berkata, telah menceritakan kepada kami [Ikrimah] dari [Ibnu Abbas] berkata, \"Hilal bin Umayyah menuduh isterinya selingkuh dengan Syarik bin Sahma di hadapan Nabi shallallahu 'alaihi wasallam. Maka, Nabi shallallahu 'alaihi wasallam pun bersabda: \"Engkau berikan bukti, atau engkau akan menerima hukuman had?! Hilal bin Umayyah lantas berkata, \"Demi yang mengutusmu dengan kebenaran, sungguh aku berkata benar. Dan pasti Allah akan menurunkan sebuah ayat yang akan membebaskan aku dari hukuman had.\" Ibnu Abbas berkata, \"Maka turunlah ayat: \"(Dan orang-orang yang menuduh isterinya (berzina), padahal mereka tidak ada mempunyai saksi-saksi selain diri mereka sendiri) \" hingga ayat \"(dan (sumpah) yang kelima: bahwa la'nat Allah atasnya jika suaminya itu termasuk orang-orang yang benar).\" Kemudian Nabi shallallahu 'alaihi wasallam berpaling dan mengutus utusan untuk memanggil keduanya (Hilal dan isterinya), dan mereka pun datang. Hilal bin Umayyah lantas berdiri dan bersaksi, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah mengetahui bahwa di antara kalian ada yang bohong, maka apakah ada yang mau bertaubat (sebelum terlambat)?\" setelah itu isterinya juga berdiri dan bersaksi. Maka ketika sampai pada (sumpah) yang kelima \"(bahwa la'nat Allah atasnya jika suaminya itu termasuk orang-orang yang benar).\" Para sahabat berkata, \"Ayat itu pasti akan mengenai wanita itu, ia wajib mendapatkan had.\" Ibnu Abbas berkata, \"Wanita itu ragu dan maju mundur hingga kami mengira seakan-akan ia akan kembali (taubat). Namun ia justru berkata, \"Sungguh kaumku tidak akan beruntung sepanjang hari.\" Setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Lihatlah wanita itu, jika ia melahirkan anak yang bermata hitam, berpantat besar dan kedua betisnya juga besar, maka itu adalah anak Syarik bin Sahma.\" Dan wanita itu benar-benar melahirkan anak sebagaimana yang beliau sebutkan, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Kalau bukan karena ketetapan yang telah tertera dalam Kitabullah, sungguh antara aku dengan dia pasti akan ada masalah",
          "tr": "İbn-i Abbâs (r.a.)'dan rivayet edildiğine göre: Hilâl bin Ümeyye (el-Ensâri), karısı (Havle)'nin Şerik bin Sahmâ ile zina ettiğini Resulullah (Sallallahu Aleyhi ve Sellem)'in huzurunda iddia etti. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) Hilâl'e: «Dört şahidini hazırla veya sırtına had (vurulur)» buyurdu. Hilâl, Nebi (Sallallahu Aleyhi ve Sellem)'e; — (Yâ Resûlallah!) Seni hak ile gönderen (Allah)'a yemin ederim ki ben (bu isnadımda) muhakkak doğru sözlüyüm ve muhakkak Allah Teâlâ bu meselemde benim sırtımı hadden kurtaracak âyet göndercektir, dedi. İbn-i Abbâs demiştir ki: Hemen sonra; والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم [Nur 6] ayetinden ta والخامسة أن غضب اللَّه عليها إن كان من الصادقين [Nur 9] ayetine kadar olan Nazm-i İlâhî indi. Nebi (Sallallahü Aleyhi ve Slelem) de (bu âyetlerin kendisine indiği yerden) hemen ayrılıp Hilâl ile karısına haber gönderdi (onları huzura getirtti.) İkisi de geldi. (Önce) Hilâl ayağa kalkarak (âyetlerde emredildiği şekilde) liân yemininde bulundu. Nebi (Sallallahu Aleyhi ve Sellem) de (eşlere hitaben): Allah, ikinizden birisinin yalancı olduğunu şüphesiz bilir. Bu itibarla (ikinizden) tevbe edip bu liân yemininden imtina eden var mıdır? buyuruyordu. Hilâl liân yemini ettikten sonra karısı ayağa kalktı ve liân yeminini (dört defa) etti. Beşincisinde: \"Eğer Hilâl (zina isnadında) doğru sözlü ise Allah'ın gazabı Havle'nin üzerinde olsun\" demeye sıra gelince, orada bulunanlar kadına:.- (Ey kadın bil ki) bu (beşinci) yemin şüphesiz elim azabı mûcibtir, diye uyardılar. îbn-i Abbâs demiştir ki: Bu uyarı üzerine kadın durakladı ve biraz geriledi. Hattâ biz kadının dönüş yapacağıni (ve beşinci yemini yapmadan gerisin geriye gideceğini) sandık. Fakat kadın (kendini toparladı ve): Vallahi ben kabilemi ömür boyunca rezîl ve rüsvay etmem, dedi, (ve beşinci yemini de etti). Sonra Resul i Ekrem (Sallallahu Aleyhi ve Sellem) orada bulunanlara: «(Hâmile olan bu kadın'ın doğuracağı çocuğun) durumuna dikkat edin. Eğer gözleri sürmeli, kalçaları iri ve baldırları kaba bir çocuk getirir ise, çocuk Şerik bin Sanmaya aittir», buyurdu. Kadın da hakikaten bu şekilde bir çocuk doğurdu. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Eğer Allah'ın kitabının (liân) hükmü yerine getirilmemiş olsaydı benim ile bu kadın için bir durum (kadını recmettirmek işi) olacaktı.» buyurdu. BUHARİ HADİSİ VE İZAH İÇİN TIKLA EBU DAVUD’UN İBN-İ ABBAS R.A.’TAN HADİSLERİ VE İZAH: 2254 — 2255 —"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 2068,
      "arabicNumber": 2068,
      "book": 10,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ، قَالاَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا فِي الْمَسْجِدِ لَيْلَةَ الْجُمُعَةِ ‏.‏ فَقَالَ رَجُلٌ لَوْ أَنَّ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً فَقَتَلَهُ قَتَلْتُمُوهُ وَإِنْ تَكَلَّمَ جَلَدْتُمُوهُ وَاللَّهِ لأَذْكُرَنَّ ذَلِكَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏ فَذَكَرَهُ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ فَأَنْزَلَ اللَّهُ آيَاتِ اللِّعَانِ ‏.‏ ثُمَّ جَاءَ الرَّجُلُ بَعْدَ ذَلِكَ يَقْذِفُ امْرَأَتَهُ فَلاَعَنَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بَيْنَهُمَا وَقَالَ ‏ \"‏ عَسَى أَنْ تَجِيءَ بِهِ أَسْوَدَ ‏\"‏ ‏.‏ فَجَاءَتْ بِهِ أَسْوَدَ جَعْدًا ‏.‏",
        "translations": {
          "en": "It was narrated that 'Abdullah said:\"We were in the mosque one Friday night when a man said: 'If a man finds a man with his wife and kills him, will you kill him, and if he speaks,will you flog him. By Allah I will mention that to the Prophet (ﷺ). So he mentioned that to the Prophet (ﷺ), and Allah revealed the Verses of Li'an. Then after that the man came and accused his wife, so the Prophet (ﷺ) told them to go through the procedure of Li'an and he said: 'Perhaps she will give birth to a black child.’ Then she gave birth to a black child with curly hair",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم جمعہ کی رات کو مسجد میں تھے کہ ایک شخص آ کر کہنے لگا اگر کوئی اپنی بیوی کے ساتھ کسی مرد کو پائے، پھر اس کو مار ڈالے، تو تم لوگ اس کو مار ڈالو گے، اور اگر زبان سے کچھ کہے تو تم اسے کوڑے لگاؤ گے، اللہ کی قسم میں تو نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر ضرور کروں گا، آخر اس نے نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر کیا، تب اللہ تعالیٰ نے لعان کی آیتیں نازل فرمائیں، پھر وہ آیا اور اس نے اپنی بیوی پر زنا کی تہمت لگائی، نبی اکرم صلی اللہ علیہ وسلم نے ان دونوں کے درمیان لعان کرایا اور فرمایا: میرا گمان ہے کہ شاید اس عورت کا بچہ کالا ہی پیدا ہو چنانچہ ایسا ہی ہوا، اس کے یہاں کالا گھونگھریالے بال والا بچہ پیدا ہوا۔",
          "fr": "Rapporté par 'Abdullah : Nous étions à la mosquée un vendredi soir quand un homme a dit : \"Si un homme trouve un autre homme avec sa femme et le tue, allez-vous le tuer ? Et s'il parle, allez-vous le fouetter ? Par Allah, je vais en parler au Prophète (ﷺ).\" Il en a donc parlé au Prophète (ﷺ), et Allah a révélé les versets du li'an. Ensuite, cet homme est venu et a accusé sa femme, alors le Prophète (ﷺ) leur a ordonné de suivre la procédure du li'an et il a dit : \"Peut-être qu'elle donnera naissance à un enfant noir.\" Ensuite, elle a donné naissance à un enfant noir aux cheveux crépus",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] dan [Ishaq bin Ibrahim bin Habib] keduanya berkata; telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Ketika kami sedang berada di masjid pada malam jum'at, ada seseorang yang berkata, \"Kalau saja seorang suami mendapatkan seorang lelaki bersama isterinya, kemudian dia membunuhnya, kalian pasti akan balas membunuhnya. Dan jika ia berbicara, pasti kalian akan menderanya. Demi Allah, aku akan sampaikan hal itu kepada Nabi shallallahu 'alaihi wasallam.\" Maka ia pun menyampaikannya hal itu kepada Nabi shallallahu 'alaihi wasallam, hingga Allah 'azza wajalla menurunkan ayat-ayat li'an. Setelah kejadian itu, laki-laki tersebut kemudian menuduh isterinya, maka Nabi shallallahu 'alaihi wasallam memerintahkan agar keduanya saling bersumpah, beliau bersabda: \"Semoga dia melahirkan anak yang berkulit hitam.\" Dan benar saja, wanita tersebut melahirkan seorang anak yang berkulit hitam dan berambut keriting",
          "tr": "Abdullah (bin Mes'ûd) (r.a.)'den; Şöyle demiştir: Biz bir Cum'a gecesi Mescid-i Nebevide idik. (Meseid'e giren) bir adam (oradaki cemaata hitaben): Eğer bir erkek, karısının yanında (zina hâlinde) bir erkeği bulup zâniyi öldürürse siz (katil diye kısas olarak) adamı öldürürsünüz. Eğer karısının zina ettiğini söyler (ve şâhidler getiremez) seniz onu kazif haddi ile cezalandırırsınız. Vallahi ben muhakkak bunu Nebi (Sallallahu Aleyhi ve Sellem)'e anlatacağım, dedi. Sonra bunu Nebi (Sallallahu Aleyhi ve Sellem)'e anlattı. Bunun üzerine Allah Teâlâ liân âyetlerini indirdi. Âyetler indirildikten sonra adam (Nebi'e) gelip karısının zina ettiğini iddia etti. Nebi (Sallallahu Aleyhi ve Sellem) de adam İle karısı arasında liân hükmünü uyguladı ve: «Bu kadının (kıvırcık saçlı) siyah bir çocuk doğurması (ve böylece zina olayının doğrulanması) umulur,» buyurdu. Sonra kadın kıvırcık saçlı ve siyah bir çocuk doğurdu. MÜSLİM HADİSİ VE İZAH İÇİN TIKLA EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 2069,
      "arabicNumber": 2069,
      "book": 10,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ وَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that:a man invoked curses on his wife, and refused to accept her child. The Messenger of Allah (ﷺ) separated them, and left the child with the woman",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ ایک مرد نے اپنی بیوی سے لعان کیا، اور اس کے بچے کا انکار کر دیا، تو رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں میں جدائی کرا دی اور بچہ کو ماں کو دیدیا ۱؎۔",
          "fr": "Rapporté par Ibn 'Umar : Un homme a invoqué la malédiction sur sa femme et a refusé de reconnaître son enfant. Le Messager d'Allah (ﷺ) les a séparés et a laissé l'enfant avec la femme",
          "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] berkata, \"Seorang laki-laki menyumpahi isterinya dan tidak mengakui anak yang dilahirkannya. Rasulullah shallallahu 'alaihi wasallam kemudian memisahkan keduanya dan menasabkan anak tersebut kepada ibunya",
          "tr": "(Abdullah) bin Ömer (r.a.)'dan; Şöyle demiştir: Bir erkek karısı ile liân yemininde bulundu ve çocuğun kendisinden olmadığını söyledi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) eşleri birbirinden ayırdı ve çocuğu (neseb ve mirasta) kadına ilhak eyledi. BUHARİ HADİSİ VE İZAH İÇİN TIKLA MÜSLİM HADİSİ VE İZAH İÇİN TIKLA EBU DAVUD’UN İBN-İ ÖMER R.A.’DEN HADİSLERİ VE İZAH: 2257 — 2258 —"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 2070,
      "arabicNumber": 2070,
      "book": 10,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ النَّيْسَابُورِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ ذَكَرَ طَلْحَةُ بْنُ نَافِعٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ تَزَوَّجَ رَجُلٌ مِنَ الأَنْصَارِ امْرَأَةً مِنْ بَلْعِجْلاَنَ فَدَخَلَ بِهَا فَبَاتَ عِنْدَهَا فَلَمَّا أَصْبَحَ قَالَ مَا وَجَدْتُهَا عَذْرَاءَ فَرُفِعَ شَأْنُهَا إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَدَعَا الْجَارِيَةَ فَسَأَلَهَا فَقَالَتْ بَلَى قَدْ كُنْتُ عَذْرَاءَ ‏.‏ فَأَمَرَ بِهِمَا فَتَلاَعَنَا وَأَعْطَاهَا الْمَهْرَ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Abbas said:\"A man from among the Ansar manried a wornan from Bal'ijlan. He entered upon her and spent the night with her, then in the morning he said: 'I did not find her to be a virgin.' Her case was taken to the Prophet (ﷺ), and he called the girl and asked her. She said: 'No, I was a virgin.' So he told thern to go through the procedure of Li'an, and gave her the bridal-money.” (D a'if)",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ قبیلہ انصار کے ایک شخص نے قبیلہ بنی عجلان کی ایک عورت سے شادی کی، اور اس کے پاس رات گزاری، جب صبح ہوئی تو کہنے لگا: میں نے اسے کنواری نہیں پایا، آخر دونوں کا مقدمہ نبی اکرم صلی اللہ علیہ وسلم تک لے جایا گیا، آپ صلی اللہ علیہ وسلم نے لڑکی کو بلایا، اور اس سے پوچھا تو اس نے کہا: میں تو کنواری تھی، پھر آپ نے حکم دیا تو دونوں نے لعان کیا، اور آپ صلی اللہ علیہ وسلم نے اس عورت کو مہر دلوا دیا۔",
          "fr": "Rapporté par Ibn 'Abbas : Un homme parmi les Ansar a épousé une femme de Bal'ijlan. Il est allé vers elle et a passé la nuit avec elle, puis le matin il a dit : \"Je ne l'ai pas trouvée vierge.\" Son cas a été présenté au Prophète (ﷺ), qui a appelé la jeune femme et lui a demandé. Elle a dit : \"Non, j'étais vierge.\" Alors il leur a ordonné de suivre la procédure du li'an et lui a donné la dot. (Dha'if)",
          "id": "Telah menceritakan kepada kami [Ali bin Salamah An Naisaburi] berkata, telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] berkata, telah menceritakan kepada kami [Bapakku] dari [Ibnu Ishaq] ia berkata; [Thalhah bin Nafi'] menyebutkan dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki Anshar menikahi seorang wanita yang berasal dari Bal'ijlan, lalu ia masuk dan bermalam bersamanya. Ketika datang waktu pagi ia berkata, \"Aku tidak mendapatkan kegadisannya! \" hingga akhirnya, persoalan tersebut disampaikan kepada Nabi shallallahu 'alaihi wasallam. Beliau memanggil wanita tersebut dan menanyainya, wanita itu menjawab, \"Benar, aku masih dalam keadaan gadis.\" Maka beliau pun memerintahkan keduanya untuk saling bersumpah, dan beliau memberikan hak mahar kepadanya",
          "tr": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Ensâr'dan bir erkek Beliclân (Beni Aclân) kabilesinden bir kadınla evlendi. Sonra yanına girip bir gece onunla yattı. Sabahleyin adamı Ben kızı bakire olarak bulmadım dedi. Kadının bu durumu Nebi (Sallallahu Aleyhi ve Sellem)'in huzuruna arzedildi. Bunun üzerine, Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) genç kadını çağırtıp (bu durumu) kendisine sordu. Kadın: Hayır. Ben bakire idim, dedi. Bunun üzerine Nebi koca ile karının liân etmelerini emretti. Onlar da liân yeminleri ettiler ve koca, kadına mehir verdi. Not; Zevaid'de şöyle denilmiştir: Bunun senedinde zayıflık vardır. Çünkü ravi Muhammed bin İshak tedlisçidir. Bezzar da: Bu hadis yalnız bu.senedie tanınır, demiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 2071,
      "arabicNumber": 2071,
      "book": 10,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحَضْرَمِيُّ، عَنْ ضَمْرَةَ بْنِ رَبِيعَةَ، عَنِ ابْنِ عَطَاءٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ أَرْبَعٌ مِنَ النِّسَاءِ لاَ مُلاَعَنَةَ بَيْنَهُنَّ النَّصْرَانِيَّةُ تَحْتَ الْمُسْلِمِ وَالْيَهُودِيَّةُ تَحْتَ الْمُسْلِمِ وَالْحُرَّةُ تَحْتَ الْمَمْلُوكِ وَالْمَمْلُوكَةُ تَحْتَ الْحُرِّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was nanated from 'Amr bin Shu'aib, from his father, from his grandfather, that:the Prophet (ﷺ) said: \"There are four kinds of women for whom there is no Li'an: a Christian woman married to a Muslim, a Jewish woman married to a Muslim, a free woman married to a slave, and a slave woman married to a free man",
          "ur": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: چار قسم کی عورتوں میں لعان نہیں ہے، ایک تو نصرانیہ جو کسی مسلمان کے نکاح میں ہو، دوسری یہودیہ جو کسی مسلمان کے نکاح میں ہو، تیسری آزاد عورت جو کسی غلام کے نکاح میں ہو، چوتھی لونڈی جو کسی آزاد مرد کے نکاح میں ہو ۱؎۔",
          "fr": "Rapporté par 'Amr bin Shu'aib, d'après son père, d'après son grand-père : Le Prophète (ﷺ) a dit : \"Il y a quatre types de femmes pour lesquelles il n'y a pas de li'an : une chrétienne mariée à un musulman, une juive mariée à un musulman, une femme libre mariée à un esclave, et une esclave mariée à un homme libre",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Haiwah bin Syuraih Al Hadlrami] dari [Dlamrah bin Rabi'ah] dari [Ibnu 'Atha] dari [Bapaknya] dari ['Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ada empat orang dari kaum wanita yang li'an tidak berlaku bagi mereka; wanita Nasrani yang ada di bawah lelaki muslim, wanita Yahudi yang ada di bawah lelaki muslim, wanita merdeka yang ada di bawah seorang budak, dan budak wanita yang ada di bawah seorang lelaki merdeka",
          "tr": "Amr bin Şuayb'ın dedesi (İbn Amr) (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kadınlardan dört sınıf vardır ki onlar (ile kocaları) arasında liân (yeminlerinin icrası) yoktur: Müslüman erkeğin nikâhı altındaki Hristiyan kadın, müslüman erkeğin nikâhı altında bulunan yahüdî kadın, kölenin nikâhı altındaki hür kadın ve hür erkeğin nikâhı altındaki câriye.» Not:; Bunun senedinde bulunan Osman bin Ata'nın zayıflığı üzerinde ittifak edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 2072,
      "arabicNumber": 2072,
      "book": 10,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ قَزَعَةَ، حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ آلَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ نِسَائِهِ وَحَرَّمَ فَجَعَلَ الْحَرَامَ حَلاَلاً ‏.‏ وَجَعَلَ فِي الْيَمِينِ كَفَّارَةً ‏.‏",
        "translations": {
          "en": "It was narrated that 'Aishah said:\"The Messenger of Allah swore to keep away from his wives and declared them as unlawful for him, so he made something permissible forbidden, and he offered expiation for having sworn to do so",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں سے ایلاء کیا، اور اپنے اوپر حلال کو حرام ٹھہرا لیا ۱؎ اور قسم کا کفارہ ادا کیا ۲؎۔",
          "fr": "Rapporté par Aïcha : Le Messager d'Allah a juré de s'éloigner de ses épouses et les a déclarées interdites pour lui, donc il a rendu interdit ce qui était permis, puis il a offert une expiation pour avoir juré de le faire",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Quz'ah] berkata, telah menceritakan kepada kami [Maslamah bin Alqamah] berkata, telah menceritakan kepada kami [Dawud bin Abu Hind] dari [Amir] dari [Masruq] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan ilaa' terhada isteri-isterinya dan mengharamkan mereka. Beliau mengharamkan yang halal dan menjadikan kafarah di dalam yamin (sumpah)",
          "tr": "Aişe (r.anha)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) karılarından İlâ etti (onlann odalarına bir ay girmemeye yemin etti) ve haram etti, böylece (kendisine) helâl olanı haram eyledi ve (böyle) yemin için kefaret ödemeyi (gerekli) kıldı. Diğer tahric. Tirmizi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 2073,
      "arabicNumber": 2073,
      "book": 10,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ فِي الْحَرَامِ يَمِينٌ ‏.‏ وَكَانَ ابْنُ عَبَّاسٍ يَقُولُ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ ‏.‏",
        "translations": {
          "en": "It was narrated from Sa'eed bin Jubair that Ibn 'Abbas said:\"For the one who makes unlawful is the swearing.\" (Sahih)And Ibn 'Abbas used to say: \"You had the best example in the Messenger of Allah.\" (33:)",
          "ur": "سعید بن جبیر رضی اللہ عنہ کہتے ہیں کہ عبداللہ بن عباس رضی اللہ عنہما نے کہا: حلال کو حرام کرنے میں قسم کا کفارہ ہے، اور ابن عباس رضی اللہ عنہما کہتے تھے:«لقد كان لكم في رسول الله أسوة حسنة» ( سورة الاحزاب: 21 ) تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں بہترین نمونہ ہے ۔",
          "fr": "Rapporté par Sa'id bin Jubair, d'après Ibn 'Abbas : \"Pour celui qui rend interdit, il s'agit d'un serment.\" (Sahih) Et Ibn 'Abbas disait : \"Vous avez le meilleur exemple dans le Messager d'Allah.\" (33:)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Hisyam Ad Dastuwani] dari [Yahya bin Abu Katsir] dari [Ya'la bin Hakim] dari [Sa'id bin Jubair] ia berkata; [Ibnu Abbas] berkata, \"Di dalam perkara yang dilarang itu ada sumpah.\" Dan Ibnu Abbas berkata, \"Sungguh telah ada bagi kalian dalam diri Rasulullah suri tauladan yang baik",
          "tr": "(Abdullah) bin Abbas (r.a.)'dan; şöyle demiştir; (Kişinin helâl olan bir şeyi kendisine) haram etmesinde yemin (kefareti ödemesi) vardır. Ve İbn-i Abbâs: And olsun ki şübhesiz Resûlullah, sizin için güzel bir örnektir, diyordu. Diğer tahric: Bu hadisi Buhari ve Müsliın de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 2074,
      "arabicNumber": 2074,
      "book": 10,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، أَنَّهَا أَعْتَقَتْ بَرِيرَةَ فَخَيَّرَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَكَانَ لَهَا زَوْجٌ حُرٌّ ‏.‏",
        "translations": {
          "en": "It was narrated from Aishah that:she freed Barirah and the Messenger of Allah (ﷺ) gave her the choice, and she (Barirah) had a free husband",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ انہوں نے بریرہ رضی اللہ عنہا کو آزاد کر دیا، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کو اختیار دے دیا، ( کہ وہ اپنے شوہر کے پاس رہیں یا اس سے جدا ہو جائیں ) اور ان کے شوہر آزاد تھے ۱؎۔",
          "fr": "Rapporté par Aïcha : Elle a affranchi Barirah et le Messager d'Allah (ﷺ) lui a donné le choix, et elle (Barirah) avait un mari libre",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad bin Yazid] dari ['Aisyah] Bahwasanya ia telah memerdekakan Barirah, lalu Rasulullah shallallahu 'alaihi wasallam memberi pilihan kepadanya, dan ia memiliki seorang suami yang merdeka",
          "tr": "Aişe (r.anha)'dan rivayet edildiğine göre: Kendisi (cariyesi) Berire'yi âzad etmiş, bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) Berîre'ye. (nikâhını feshetmesi hususunda) muhayyer bırakmıştır. Berîre'nin hür kocası var idi. AÇIKLAMA 2078’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 2075,
      "arabicNumber": 2075,
      "book": 10,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، قَالاَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ زَوْجُ بَرِيرَةَ عَبْدًا يُقَالُ لَهُ مُغِيثٌ كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ خَلْفَهَا وَيَبْكِي وَدُمُوعُهُ تَسِيلُ عَلَى خَدِّهِ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ لِلْعَبَّاسِ ‏\"‏ يَا عَبَّاسُ أَلاَ تَعْجَبُ مِنْ حُبِّ مُغِيثٍ بَرِيرَةَ وَمِنْ بُغْضِ بَرِيرَةَ مُغِيثًا ‏\"‏ ‏.‏ فَقَالَ لَهَا النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ لَوْ رَاجَعْتِيهِ فَإِنَّهُ أَبُو وَلَدِكِ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ تَأْمُرُنِي قَالَ ‏\"‏ إِنَّمَا أَشْفَعُ ‏\"‏ ‏.‏ قَالَتْ لاَ حَاجَةَ لِي فِيهِ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Abbas said:\"The husband of Barirah was a slave called Mughith. It is as if I can see him now, walking behind her and weeping, with tears running down his cheeks. The Prophet (ﷺ) said to 'Abbas: 'O Abbas, are you not amazed by the love of Mughith for Barirah, and the hatred of Barirah for Mughith?' And the Prophet said to her: Why don’t you take him back, for he is the father of your child?' She said: 'O Messenger of Allah, are you commanding me (to do so)?' He said: 'No, rather I am interceding.' She said: 'I have no need of him",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ بریرہ رضی اللہ عنہا کا شوہر غلام تھا اس کو مغیث کہا جاتا تھا، گویا کہ میں اس وقت اس کو دیکھ رہا ہوں کہ وہ بریرہ کے پیچھے پھر رہا ہے، اور رو رہا ہے اور اس کے آنسو اس کے گالوں پہ بہہ رہے ہیں، اور نبی اکرم صلی اللہ علیہ وسلم عباس رضی اللہ عنہ سے فرما رہے ہیں: عباس! کیا تمہیں بریرہ سے مغیث کی محبت اور مغیث سے بریرہ کی نفرت پہ تعجب نہیں ہے ؟ چنانچہ نبی اکرم صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہا سے کہا: کاش تو مغیث کے پاس لوٹ جاتی، وہ تیرے بچے کا باپ ہے ، اس نے عرض کیا: اللہ کے رسول! کیا آپ مجھے حکم دے رہے ہیں؟ آپ صلی اللہ علیہ وسلم نے کہا: نہیں، میں صرف سفارش کر رہا ہوں ، تو وہ بولی: مجھے مغیث کی کوئی ضرورت نہیں۔",
          "fr": "Rapporté par Ibn 'Abbas : Le mari de Barirah était un esclave nommé Mughith. C'est comme si je le voyais encore, marchant derrière elle en pleurant, les larmes coulant sur ses joues. Le Prophète (ﷺ) a dit à 'Abbas : \"Ô Abbas, n'es-tu pas étonné de l'amour de Mughith pour Barirah, et de la haine de Barirah pour Mughith ?\" Et le Prophète lui a dit : \"Pourquoi ne le reprends-tu pas, c'est le père de ton enfant ?\" Elle a répondu : \"Ô Messager d'Allah, est-ce un ordre ?\" Il a dit : \"Non, c'est une intercession.\" Elle a dit : \"Je n'ai pas besoin de lui",
          "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] dan [Muhammad bin Khallad Al Bahili] keduanya berkata; telah menceritakan kepada kami [Abdul Wahhab Ats Tsaqafi] berkata, telah menceritakan kepada kami [Khalid Al Hadzdza] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Suami Barirah adalah seorang budak yang bernama Mughits, seakan-akan aku melihatnya berjalan di belakang Barirah sedang air matanya mengalir di pipinya. Nabi shallallahu 'alaihi wasallam lantas bersabda kepada Al Abbas: \"Wahai Abbas, tidakkah engkau taajub dengan cintanya Mughits kepada Barirah dan betapa bencinya Barirah kepada Mughits?\" Nabi shallallahu 'alaihi wasallam lalu bersabda kepada Barirah: \"Jika engkau mau kembali kepadanya, sungguh ia adalah bapak dari anakmu, \" Barirah menjawab, \"Wahai Rasulullah, apakah engkau memerintahkan kepadaku?\" beliau bersabda: \"Aku hanya menganjurkan.\" Barirah lalu berkata, \"Aku tidak butuh (dia)",
          "tr": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: (Âişe'nin cariyesi) Berîre'nin kocası Muğîs isimli bir köle idi. (Berire âzad edilip kocasından ayrılmayı tercih edince) zavallı Muğîs (in perişan durumu hâlâ gözümün önünde, kendisin) e bakıyor gibiyim. (Berîre'yi aşırı seven) Muğîs, ağlıyarak ve göz yaşları yanağının üzerinden akarak, (Medine sokaklarında ve çevresinde) Berîre'nin arkasında dönüp dolaşırdı. (Berîre ise ondan nefret ederdi.) Bir gün Nebi (Sallallahu Aleyhi ve Sellem) (babam) Abbâs'a: «Yâ Abbâs Muğîs'in Berire'ye aşırı muhabbetine ve Berîre'nin ona olan nefretine hayret etmiyor musun?» buyurdu. Sonra (Muğis'in baş vurusu üzerine) Nebi (Sallallahu Aleyhi ve Sellem) Berîre'ye: «(Ey Berîre!) keşke Muğîs'e dönüş yapsan. Çünkü senin çocuğun babasıdır.» buyurdu. Berîre: Yâ Resûlallah! (Ona dönüş yapmam için) bana emir ediyor musun? dedi. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Ben emretmiyorum). Ancak şefaatçi (aracı) oluyorum» buyurdu. Berîre: Muğîs'e ihtiyacım yoktur, dedi. AÇIKLAMA 2078’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 2076,
      "arabicNumber": 2076,
      "book": 10,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ مَضَى فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ خُيِّرَتْ حِينَ أُعْتِقَتْ وَكَانَ زَوْجُهَا مَمْلُوكًا وَكَانُوا يَتَصَدَّقُونَ عَلَيْهَا فَتُهْدِي إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَيَقُولُ ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Aishah said:'Three Sunan were established because of Barirah: She was given the choice (of whether to remain married) when she was freed, and her husband was a slave; they used to give her charity and she used to give it as a gift to the Prophet (ﷺ), and he would say: 'It is charity for her and a gift for us,' and he said, the 'Wala' is for the one who set the slave free",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ بریرہ میں تین سنتیں سامنے آئیں ایک تو یہ کہ جب وہ آزاد ہوئیں تو انہیں اختیار دیا گیا، اور ان کے شوہر غلام تھے، دوسرے یہ کہ لوگ بریرہ رضی اللہ عنہا کو صدقہ دیا کرتے اور وہ نبی اکرم صلی اللہ علیہ وسلم کو ہدیہ کر دیتیں، تو آپ صلی اللہ علیہ وسلم فرماتے: وہ اس کے لیے صدقہ ہے، اور ہمارے لیے ہدیہ ہے ، تیسرے یہ کہ آپ صلی اللہ علیہ وسلم نے انہیں کے سلسلہ میں فرمایا: حق ولاء ( غلام یا لونڈی کی میراث ) اس کا ہے جو آزاد کرے ۱؎۔",
          "fr": "Rapporté par Aïcha : Trois traditions ont été établies à cause de Barirah : elle a eu le choix (de rester mariée ou non) lorsqu'elle a été affranchie, alors que son mari était esclave ; on lui donnait de la charité et elle l'offrait comme cadeau au Prophète (ﷺ), qui disait : \"C'est une aumône pour elle et un cadeau pour nous\" ; et il a dit : \"Le 'Wala' revient à celui qui affranchit l'esclave",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Usamah bin Yazid] dari [Al Qasim bin Muhammad] dari ['Aisyah] ia berkata, \"Telah berlalu bagi Barirah tiga kali haid, dan saat dimerdekakan ia diberi pilihan. Suaminya adalah seorang budak, orang-orang banyak memberi sedekah kepadanya, lalu ia hadiahkan sedekah tersebut kepada Nabi shallallahu 'alaihi wasallam. Beliau kemudian bersabda: \"Baginya adalah sedekah, dan bagi kita adalah hadiah.\" Beliau bersabda lagi: \"Loyalitas itu untuk yang memerdekakannya",
          "tr": "Aişe (r.anha)'dan; Şöyle demiştir: (Cariyem) Berire dolayısıyla üç sünnet tamamlandı: Berire âzad edildiği zaman nikâhının feshi hususunda serbest kılındı, kocası da köle idi. Sahâbîler Berîre'ye (cariyem iken) sadaka verirlerdi» kendisi de (bu sadakadan) Nebi (Sallallahu Aleyhi ve Sellem)'e hediye ederdi, O da: «Bu, Berire'ye sadakadır, bize de bir hediyedir,» buyurdu. Bir de: «Velâ âzad edene aittir,» buyurdu. AÇIKLAMA 2078’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 2077,
      "arabicNumber": 2077,
      "book": 10,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ أُمِرَتْ بَرِيرَةُ أَنْ تَعْتَدَّ، بِثَلاَثِ حِيَضٍ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Aishah said:\"Barirah was told to observe the waiting period for three menstrual cycles",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ بریرہ رضی اللہ عنہا کو حکم دیا گیا کہ وہ تین حیض عدت گزاریں",
          "fr": "Rapporté par 'Aishah : On a dit à Barirah d’observer une période d’attente de trois cycles menstruels",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] ia berkata, \"Barirah diperintah untuk menjalani masa iddah selama tiga kali haid",
          "tr": "Aişe (r.a.)'dan; Şöyle demiştir: Berire (nikâhını feshettiğinde) üç kez aybaşı âdetini görünceye kadar beklemesi kendisine (Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) tarafından) emredildi. Not: Bunun senedinin sahih ve ravllerinin sika oldukları Zevaid'de bildirilmiştir. AÇIKLAMA 2078’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 2078,
      "arabicNumber": 2078,
      "book": 10,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ تَوْبَةَ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أُذَيْنَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ خَيَّرَ بَرِيرَةَ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that:the Messenger of Allah (ﷺ) gave Barirah the choice",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بریرہ رضی اللہ عنہا کو اختیار دیا ( کہ وہ اپنے شوہر مغیث کی زوجیت میں رہیں یا نہ رہیں ) ۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a donné à Barirah le choix",
          "id": "Telah menceritakan kepada kami [Isma'il bin Taubah] berkata, telah menceritakan kepada kami ['Abbad bin Al 'Awwam] dari [Yahya bin Ishaq] dari ['Abdurrahman bin Udzainah] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi pilihan kepada Barirah",
          "tr": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Berîre'yi (âzad edildi ğinde nikâhının feshi hususunda) serbest kıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 2079,
      "arabicNumber": 2079,
      "book": 10,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا عُمَرُ بْنُ شَبِيبٍ الْمُسْلِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنْ عَطِيَّةَ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ طَلاَقُ الأَمَةِ اثْنَتَانِ وَعِدَّتُهَا حَيْضَتَانِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Urnar that the Messenger of Allah (ﷺ), said:\"The divorce of a slave woman is twice, and her waiting period is two menstrual cycles",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لونڈی کے لیے دو طلاقیں ہیں، اور اس کی عدت دو حیض ہے ۱؎۔",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah (ﷺ) a dit : \"Le divorce d’une femme esclave est de deux fois, et sa période d’attente est de deux cycles menstruels",
          "id": "Telah menceritakan kepada kami [Muhammad bin Thuraif] dan [Ibrahim bin Sa'id Al Jauhari] keduanya berkata; telah menceritakan kepada kami [Umar bin Syabib Al Musli] dari [Abdullah bin Isa] dari ['Athiyyah] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Talak bagi seorang budak wanita itu sebanyak dua kali, dan masa iddahnya adalah dua kali haid",
          "tr": "(Abdullah) bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Cariye'nin talâkı ikidir, iddeti de iki hayız hâlidir.» Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde bulunan Atiyye el-Avfi'nin zayıflığı hususunda ittifak vardır. Ravi Ömer bin Şebib el-Kufi de bunun gibidir. Bu hadisi Malik, el-Muvatta'da İbn-i Ömer (r.a.) üzerinde mevkuf olarak rivayet etmiştir. Nesai hariç, sünen sahibIeri de bu hadisi Aişe yolu ile rivayet etmişlerdir. AÇIKLAMA 2080’de"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 2080,
      "arabicNumber": 2080,
      "book": 10,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ مُظَاهِرِ بْنِ أَسْلَمَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ طَلاَقُ الأَمَةِ تَطْلِيقَتَانِ وَقُرْؤُهَا حَيْضَتَانِ ‏\"‏ ‏.‏ قَالَ أَبُو عَاصِمٍ فَذَكَرْتُهُ لِمُظَاهِرٍ فَقُلْتُ حَدِّثْنِي كَمَا حَدَّثْتَ ابْنَ جُرَيْجٍ ‏.‏ فَأَخْبَرَنِي عَنِ الْقَاسِمِ عَنْ عَائِشَةَ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ طَلاَقُ الأَمَةِ تَطْلِيقَتَانِ وَقُرْؤُهَا حَيْضَتَانِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that the Prophet (ﷺ) said:\"The divorce of a slave woman is twice, and her (waiting) period is two menstrual cycles.\" Abu 'Asim said: \"I mentioned this to Muzahir and said: 'Tell me what you told Ibn Juraij.' So he told me, narrating from Qasim from 'Aishah, that the Prophet (ﷺ) said: 'The divorce of a slave woman is twice, and her (waiting) period is two menstrual cycles",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: لونڈی کی دو طلاقیں ہیں، اور اس کی عدت دو حیض ہے ۔ ابوعاصم کہتے ہیں کہ میں نے مظاہر بن اسلم سے اس حدیث کا ذکر کیا اور ان سے عرض کیا کہ یہ حدیث آپ مجھ سے ویسے ہی بیان کریں جیسے کہ آپ نے ابن جریج سے بیان کی ہے، تو انہوں نے مجھے «قاسم عن عائشہ» کے طریق سے بتایا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: لونڈی کے لیے دو طلاقیں ہیں اور اس کی عدت دو حیض ہے ۔",
          "fr": "Rapporté par 'Aishah : Le Prophète (ﷺ) a dit : \"Le divorce d’une femme esclave est de deux fois, et sa période d’attente est de deux cycles menstruels.\" Abu 'Asim a dit : \"J’ai mentionné cela à Muzahir et lui ai demandé : 'Dis-moi ce que tu as dit à Ibn Juraij.' Il m’a alors raconté, d’après Qasim, d’après 'Aishah, que le Prophète (ﷺ) a dit : 'Le divorce d’une femme esclave est de deux fois, et sa période d’attente est de deux cycles menstruels",
          "tr": "Âişe (r.anha)'dan rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Cariye'nin talâkı ikidir, iddeti de iki kez aybaşı âdetidir.» Diğer tahric: Ebu Davud. Beyhaki. Hakim, Darekutni ve Tirmizi de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 65
      }
    },
    {
      "hadithNumber": 2081,
      "arabicNumber": 2081,
      "book": 10,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ مُوسَى بْنِ أَيُّوبَ الْغَافِقِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ سَيِّدِي زَوَّجَنِي أَمَتَهُ وَهُوَ يُرِيدُ أَنْ يُفَرِّقَ بَيْنِي وَبَيْنَهَا ‏.‏ قَالَ فَصَعِدَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الْمِنْبَرَ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ مَا بَالُ أَحَدِكُمْ يُزَوِّجَ عَبْدَهُ أَمَتَهُ ثُمَّ يُرِيدُ أَنْ يُفَرِّقَ بَيْنَهُمَا إِنَّمَا الطَّلاَقُ لِمَنْ أَخَذَ بِالسَّاقِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Abbas said:\"A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah, my master married me to his slave woman, and now he wants to separate me and her.' The Messenger of Allah (ﷺ) ascended the pulpit and said: 'O people, what is the matter with one of you who marries his slave to his slave woman, then wants to separate them? Divorce belongs to the one who takes hold of the calf (i.e., her husband).’ “",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک آدمی آیا، اور اس نے عرض کیا: اللہ کے رسول! میرے مالک نے اپنی لونڈی سے میرا نکاح کر دیا تھا، اب وہ چاہتا ہے کہ مجھ میں اور میری بیوی میں جدائی کرا دے، یہ سن کر آپ صلی اللہ علیہ وسلم منبر پر چڑھے اور فرمایا: لوگو! تمہارا کیا حال ہے کہ تم میں سے ایک شخص اپنے غلام کا نکاح اپنی لونڈی سے کر دیتا ہے، پھر وہ چاہتا ہے کہ ان دونوں میں جدائی کرا دے، طلاق تو اسی کا حق ہے جو عورت کی پنڈلی پکڑے ۱؎۔",
          "fr": "Rapporté par Ibn 'Abbas : Un homme est venu voir le Prophète (ﷺ) et a dit : \"Ô Messager d’Allah, mon maître m’a marié à sa servante, et maintenant il veut nous séparer.\" Le Messager d’Allah (ﷺ) monta sur le minbar et dit : \"Ô gens, pourquoi l’un d’entre vous marie-t-il son esclave à sa servante, puis veut les séparer ? Le divorce appartient à celui qui tient le mollet (c’est-à-dire, le mari)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yahya bin Abdullah bin Bukair] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Musa bin Ayyub Al Ghafiqi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Seorang lelaki datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya tuanku mengawinkan aku dengan budak perempuannya, lalu ia ingin memisahkan aku dari dia.\" Ibnu Abbas berkata, \"Rasulullah shallallahu 'alaihi wasallam kemudian naik ke mimbar dan bersabda: \"Wahai manusia, kenapa salah seorang dari kalian menikahkan budaknya dengan budak perempuannya, kemudian dia ingin memisahkan keduanya?! Hanyasanya talak itu hak bagi orang yang memegang betis",
          "tr": "(Abdullah) bin Abbâs (r.a.)'dan; Şöyle demiştir: Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'in yanına gelerek: Ya Resulullah! Benim efendim, beni cariyesi ile evlendirdi. Şimdi de o câriye ile beni birbirimizden ayırmak ister, diye şikâyette bulundu. İbn-i Abbâs demiştir ki: Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (hemen) minbere çıktı ve: «Ey insanlar! Sizden birisine ne oluyor ki kölesini cariyesi ile evlendirir, sonra onları birbirinden ayırmak ister- Şüphesiz boşama (yetkisi) ancak kadının bacağını tutan (kocasın)'a aittir, (yâni kölenin efendisine âit değildir.)» Not; Bunun senedinde İbn-i Lahia'nın bulundUğU ve onun zayıf olduğu Zevaid'de bildirilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 2082,
      "arabicNumber": 2082,
      "book": 10,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ زَنْجَوَيْهِ أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عُمَرَ بْنِ مُعَتِّبٍ، عَنْ أَبِي الْحَسَنِ، مَوْلَى بَنِي نَوْفَلٍ قَالَ سُئِلَ ابْنُ عَبَّاسٍ عَنْ عَبْدٍ طَلَّقَ، امْرَأَتَهُ تَطْلِيقَتَيْنِ ثُمَّ أُعْتِقَا أَيَتَزَوَّجُهَا قَالَ نَعَمْ ‏.‏ فَقِيلَ لَهُ عَمَّنْ قَالَ قَضَى بِذَلِكَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ لَقَدْ تَحَمَّلَ أَبُو الْحَسَنِ هَذَا صَخْرَةً عَظِيمَةً عَلَى عُنُقِهِ ‏.‏",
        "translations": {
          "en": "lt was narrated that Abul Hasan, the freed slave of Banu Nawfal, said:\"Ibn 'Abbas was asked about a slave who divorces his wife twice, then (they are freed). Can he marry her? He said: 'Yes.' It was said to him: 'On what basis?' He said: 'The Messenger of Allah (ﷺ) passed such a judgement .' \" (D a' if)",
          "ur": "ابوالحسن مولی بنی نوفل کہتے ہیں کہ عبداللہ بن عباس رضی اللہ عنہما سے اس غلام کے بارے میں پوچھا گیا جس نے اپنی بیوی کو دو طلاق دے دی ہو پھر دونوں آزاد ہو جائیں، کیا وہ اس سے نکاح کر سکتا ہے؟ ابن عباس رضی اللہ عنہما نے جواب دیا: ہاں، کر سکتا ہے، ان سے پوچھا گیا: یہ فیصلہ کس کا ہے؟ تو وہ بولے: رسول اللہ صلی اللہ علیہ وسلم نے اس کا فیصلہ کیا۔ عبدالرزاق کہتے ہیں کہ عبداللہ بن مبارک نے کہا: ابوالحسن نے یہ حدیث روایت کر کے گویا ایک بڑا پتھر اپنی گردن پہ اٹھا لیا ہے۔",
          "fr": "Rapporté par Abul Hasan, l’affranchi des Banu Nawfal : On a demandé à Ibn 'Abbas au sujet d’un esclave qui divorce deux fois de sa femme, puis ils sont affranchis. Peut-il l’épouser à nouveau ? Il a répondu : \"Oui.\" On lui a demandé : \"Sur quelle base ?\" Il a dit : \"Le Messager d’Allah (ﷺ) a rendu un tel jugement.\" (Faible)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Zanjawaih Abu Bakr] berkata, telah menceritakan kepada kami ['Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Umar bin Mu'attib] dari [Abul Hasan Maula Bani Naufal] ia berkata, \" [Ibnu Abbas] ditanya tentang seorang budak yang telah mentalak isterinya dengan dua talak kemudian keduanya dimerdekakan, maka apakah ia boleh menikahinya lagi?\" Ibnu Abbas menjawab, \"Ya, boleh.\" Ibnu Abbas ditanya lagi, \"Sumbernya dari siapa?\" ia menjawab, \"Demikianlah Rasulullah shallallahu 'alaihi wasallam memutuskan perkara seperti in.\" 'Abdurrazaq berkata; Abdullah bin Mubarak berkata, \"Sungguh Abul Hasan telah mampu memikul batu besar ini di atas pundaknya",
          "tr": "Nevfel oğullan azadlısı Ebü'l-Hasan (r.a.)'dan rivayet edildiğine göre şöyle demiştir: Bir köle (câriye olan) karısını iki talâkla boşadıktan sonra ikisi de âzad edilmiştir. Bu erkek bu kadınla (tekrar) evlenebilir mi? sorusu İbn-i Abbâs (r.a.)'a soruldu. İbn-i Abbâs: Evet (evlenebilir), dedi. Bunun üzerine İbn-i Abbâs'a: (Bu hükmü) kimden (rivayet ediyorsun)? diye soruldu. O: Resulullah (Sallallahu Aleyhi ve Sellem) bununla hükmetti, diye cevap verdi. Diğer tahric: Bunu Ahmed, Ebu Davud, Nesai ve Beyhaki de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 67
      }
    },
    {
      "hadithNumber": 2083,
      "arabicNumber": 2083,
      "book": 10,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ رَجَاءِ بْنِ حَيْوَةَ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ لاَ تُفْسِدُوا عَلَيْنَا سُنَّةَ نَبِيِّنَا مُحَمَّدٍ ـ صلى الله عليه وسلم ـ عِدَّةُ أُمِّ الْوَلَدِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا ‏.‏",
        "translations": {
          "en": "It was narrated that 'Amr bin 'As said:\"Do not corrupt the Sunnah of our Prophet Muhammad (ﷺ). The waiting period of an Umm Walad is four months and ten (days)",
          "ur": "عمرو بن العاص رضی اللہ عنہ کہتے ہیں کہ ہم پر ہمارے نبی محمد صلی اللہ علیہ وسلم کی سنت کو نہ بگاڑو، ام ولد کی عدت چار ماہ دس دن ہے ۱؎۔",
          "fr": "Rapporté par 'Amr bin 'As : \"Ne corrompez pas la Sunna de notre Prophète Muhammad (ﷺ). La période d’attente d’une Umm Walad est de quatre mois et dix jours",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sa'id bin Abu 'Arubah] dari [Mathar Al Warraq] dari [Raja bin Haiwah] dari [Qabishah bin Dzu`aib] dari [Amru bin 'Ash] ia berkata, \"Janganlah kalian merusak sunnah Nabi kami, Muhammad shallallahu 'alaihi wasallam. Masa Iddah ummul walad adalah empat bulan sepuluh hari",
          "tr": "Amr bin el-Âs (r.a.)'den; Şöyle demiştir: Nebiimiz Muhammed (Sallallahu Aleyhi ve Sellem)'in sünnetini bize bozmayınız. Ümmü'l-Veled'in iddeti dört ay on gündür, Diğer tahric. Bu hadisi Ahmed, Ebu Davud ve Hakim de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 68
      }
    },
    {
      "hadithNumber": 2084,
      "arabicNumber": 2084,
      "book": 10,
      "hadithInBook": 69,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، ‏.‏ أَنَّهُ سَمِعَ زَيْنَبَ ابْنَةَ أُمِّ سَلَمَةَ، تُحَدِّثُ أَنَّهَا سَمِعَتْ أُمَّ سَلَمَةَ، وَأُمَّ حَبِيبَةَ تَذْكُرَانِ أَنَّ امْرَأَةً أَتَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَتْ إِنَّ ابْنَةً لَهَا تُوُفِّيَ عَنْهَا زَوْجُهَا فَاشْتَكَتْ عَيْنُهَا فَهِيَ تُرِيدُ أَنْ تَكْحَلَهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ قَدْ كَانَتْ إِحْدَاكُنَّ تَرْمِي بِالْبَعْرَةِ عِنْدَ رَأْسِ الْحَوْلِ وَإِنَّمَا هِيَ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Humaid bin Nafi' that:he heard Zainab the daughter of Umm Salamah narrating that she heard Umm Salamah and Umm Habibah mention that a woman came to the Prophet (ﷺ) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (ﷺ) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days)",
          "ur": "ام المؤمنین ام سلمہ اور ام المؤمنین ام حبیبہ رضی اللہ عنہما ذکر کرتی ہیں کہ ایک عورت نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی اور اس نے عرض کیا کہ اس کی بیٹی کا شوہر مر گیا ہے، اور اس کی بیٹی کی آنکھ دکھ رہی ہے وہ سرمہ لگانا چاہتی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پہلے ( زمانہ جاہلیت میں ) تم سال پورا ہونے پر اونٹ کی مینگنی پھینکتی تھی اور اب تو عدت صرف چار ماہ دس دن ہے ۱؎۔",
          "fr": "Rapporté par Humaid bin Nafi' : Il a entendu Zainab, la fille d’Umm Salamah, raconter qu’elle avait entendu Umm Salamah et Umm Habibah dire qu’une femme était venue voir le Prophète (ﷺ) et lui avait dit que le mari de sa fille était décédé, qu’elle souffrait d’une maladie des yeux et qu’elle voulait mettre du khôl comme remède. Le Messager d’Allah (ﷺ) a dit : \"L’une d’entre vous jetterait la bouse d’une chamelle quand une année serait passée depuis la mort de son mari. Mais la période est de quatre mois et dix jours",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin harun] berkata, telah memberitakan kepada kami [Yahya bin Sa'id] dari [Humaid bin Nafi'] Bahwasanya ia mendengar [Zainab bintu Ummu Salamah] menceritakan bahwa ia mendengar [Ummu Salamah] dan [Ummu Habibah] menyebutkan, bahwa ada seorang wanita mendatangi Nabi shallallahu 'alaihi wasallam dan mengatakan bahwa suami anak perempuannya telah meninggal, lalu anaknya merasakan sakit pada matanya, hingga ia (ibu) ingin memberikan celak. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sungguh, tradisi kalian dahulu menyudahi masa iddahnya dengan cara melempar kotoran unta (setelah masa iddah genap satu tahun), padahal masa iddahnya hanyalah empat bulan sepuluh hari",
          "tr": "(Nebiin zevcelerinden) Ümmü Seleme ve Ümmü Habîbe (r.anha)'dan rivayet edildiğine göre; Bir kadın Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek kızının kocasının öldüğünü, kızının gözünün ağrıdığını ve bu nedenle gözüne sürme çekmek istediğini, söyledi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Ey kadınlar (Câhiliyyet devrinde ve islâmiyet'in ilk döneminde sizden birisinin kocası öldüğünde bir yıl nâmüsâid şartlar altında beklerdi ve) bir yıllık iddeti bittiğinde (yerden aldığı) hayvan tezeğini (omuzundan arkaya) atardı (ve böylece yas'tan çıkardı.) Şimdi ise size kolaylık sağlanmıştır ve iddet ancak dört ay on gündür.» Bu hadis’e ek olarak 2085, 2086 ve 2087 için Buhari ve Ebu Davud izahatları aynı, ikisininde kapsamlı açıklamaları çok önemli bu nedenle bu dört sayfaya da aynı linkleri koydum: BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA EBU DAVUD HADİSLERİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 2085,
      "arabicNumber": 2085,
      "book": 10,
      "hadithInBook": 70,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Aishah that:the Prophet (ﷺ) said: \"It is not permissible for a woman to mourn for any deceased person for more than three days, except for her husband",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کسی عورت کے لیے حلال نہیں کہ شوہر کے سوا کسی میت پہ تین دن سے زیادہ سوگ منائے ۔",
          "fr": "Rapporté par 'Aishah : Le Prophète (ﷺ) a dit : \"Il n’est pas permis à une femme de porter le deuil pour un défunt plus de trois jours, sauf pour son mari",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seorang wanita melakukan ihdad (tidak berhias dan memakai wewangian) atas mayat lebih dari tiga hari, kecuali untuk suaminya",
          "tr": "Aişe (r.anha)'dun rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem): «Bir kadının, kocasından başka br ölü için üç günden fazla yas tutması helâl değildir,» buyurdu. Bu hadis’e ek olarak 2084, 2086 ve 2087 için Buhari ve Ebu Davud izahatları aynı, ikisininde kapsamlı açıklamaları çok önemli bu nedenle bu dört sayfaya da aynı linkleri koydum: BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA EBU DAVUD HADİSLERİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 70
      }
    },
    {
      "hadithNumber": 2086,
      "arabicNumber": 2086,
      "book": 10,
      "hadithInBook": 71,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Hafsah the wife of the Prophet (ﷺ) that:the Messenger of Allah (ﷺ), said: \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for any deceased person for more than three days, except for her husband",
          "ur": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو عورت اللہ اور آخرت کے دن پر ایمان رکھتی ہو اس کے لیے حلال نہیں کہ شوہر کے علاوہ کسی میت پر تین دن سے زیادہ سوگ منائے ۔",
          "fr": "Rapporté par Hafsah, l’épouse du Prophète (ﷺ) : Le Messager d’Allah (ﷺ) a dit : \"Il n’est pas permis à une femme qui croit en Allah et au Jour dernier de porter le deuil pour un défunt plus de trois jours, sauf pour son mari",
          "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Yahya bin Sa'id] dari [Nafi'] dari [Shafiah binti Abu Ubaid] dari [Hafshah] -isteri Nabi shallallahu 'alaihi wasallam- ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhir melakukan ihdad (tidak berhias dan memakai wewangian) atas mayat lebih dari tiga hari, kecuali untuk suaminya",
          "tr": "Nebi (Sallallahu Aleyhi ve Sellem)'m karısı Hafsa (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Allah'a ve âhiret gününe îman eden bir kadın'ın, kocasından başka bir ölü için üç günden fazla yas tutması helâl değildir.» Bu hadis’e ek olarak 20854 2085 ve 2087 için Buhari ve Ebu Davud izahatları aynı, ikisininde kapsamlı açıklamaları çok önemli bu nedenle bu dört sayfaya da aynı linkleri koydum: BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA EBU DAVUD HADİSLERİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 71
      }
    },
    {
      "hadithNumber": 2087,
      "arabicNumber": 2087,
      "book": 10,
      "hadithInBook": 72,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ الْمَرْأَةُ تُحِدُّ عَلَى زَوْجِهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا وَلاَ تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلاَّ ثَوْبَ عَصْبٍ وَلاَ تَكْتَحِلُ وَلاَ تَطَيَّبُ إِلاَّ عِنْدَ أَدْنَى طُهْرِهَا بِنُبْذَةٍ مِنْ قُسْطٍ وَأَظْفَارٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Umm 'Atiyyah that the Messenger of Allah (ﷺ) said:'No deceased person should be mourned for more than three days, except a woman should mourn for her husband for four months and ten days, and she should not wear dyed clothes, except for a garment of 'Asb, and she should not wear kohl or perfume, except at the beginning of her purity, when she may apply a little Qust and Azfar.’”",
          "ur": "ام عطیہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کسی میت پہ تین دن سے زیادہ سوگ نہ منایا جائے البتہ بیوی اپنے شوہر پر چار ماہ دس دن تک سوگ کرے، رنگا ہوا کپڑا نہ پہنے، ہاں رنگین بنی ہوئی چادر اوڑھ سکتی ہے، سرمہ اور خوشبو نہ لگائے، مگر حیض سے پاکی کے شروع میں تھوڑا سا قسط یا اظفار ( خوشبو ) لگا لے ۱؎۔",
          "fr": "Rapporté par Umm 'Atiyyah : Le Messager d’Allah (ﷺ) a dit : \"Aucun défunt ne doit être pleuré plus de trois jours, sauf qu’une femme doit porter le deuil pour son mari pendant quatre mois et dix jours. Elle ne doit pas porter de vêtements teints, sauf un vêtement d’‘Asb, et elle ne doit pas mettre de khôl ni de parfum, sauf au début de sa pureté, où elle peut appliquer un peu de Qust et d’Azfar",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Hisyam bin Hassan] dari [Hafshah] dari [Ummu Athiah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Seorang wanita) tidak boleh melakukan ihdad (tidak berhias dan memakai wewangian) atas mayit lebih dari tiga hari, kecuali seorang wanita untuk suaminya, empat bulan sepuluh hari. Tidak boleh memakai kain yang dicelup selain kain kecuali kain Ashb (kain yang telah dicelup sebelum ditenun). Tidak boleh bercelak dan memakai wewangian kecuali setelah sucinya sedikit qusth (kayu wangi), atau azhfar (wewangian dari Yaman)",
          "tr": "Ümmü Atiyye (Nesîbe bint-i el-Hârîs) (r.anha)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kadın kocasından başka bir ölü için üç günden fazla yas tutamaz, kocası için (ise) dört ay on gün yas tutar, (bu sürece süs için) boyanmış elbise giyinmez, lâkin (Yemen'in bir nevî boyalı kumaşı olan) asb elbisesini giyinebilir. Gözüne sürme çekmez ve güzel koku sürünmez, ancak aybaşı âdetinden temizlendiği vakit (buhurun birer çeşidi olan) kust veya azfar'dan azıcık bir parça kullanabilir.» Bu hadis’e ek olarak 2084, 2085 ve 2086 için Buhari ve Ebu Davud izahatları aynı, ikisininde kapsamlı açıklamaları çok önemli bu nedenle bu dört sayfaya da aynı linkleri koydum: BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA EBU DAVUD HADİSLERİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 72
      }
    },
    {
      "hadithNumber": 2088,
      "arabicNumber": 2088,
      "book": 10,
      "hadithInBook": 73,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، وَعُثْمَانُ بْنُ عُمَرَ، قَالاَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كَانَتْ تَحْتِي امْرَأَةٌ وَكُنْتُ أُحِبُّهَا وَكَانَ أَبِي يُبْغِضُهَا فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ فَأَمَرَنِي أَنْ أُطَلِّقَهَا فَطَلَّقْتُهَا ‏.‏",
        "translations": {
          "en": "It was narrated that 'Abdullah bin 'Umar said:\"I had a wife whom I loved, but my father hated her. 'Umar mentioned that to the Prophet (ﷺ) and he ordered me to divorce her, so I divorced her",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ میرے نکاح میں ایک عورت تھی میں اس سے محبت کرتا تھا، اور میرے والد اس کو برا جانتے تھے، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں اسے طلاق دے دوں، چنانچہ میں نے اسے طلاق دے دی۔",
          "fr": "Rapporté par 'Abdullah bin 'Umar : J’avais une femme que j’aimais, mais mon père ne l’aimait pas. 'Umar en a parlé au Prophète (ﷺ) et il m’a ordonné de la divorcer, alors je l’ai divorcée",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dan [Utsman bin Umar] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari pamannya [Al Harits bin 'Abdurrahman] dari [Hamzah bin Abdullah bin Umar] dari [Abdullah bin Umar] ia berkata, \"Aku memiliki seorang isteri yang aku sukai, namun ayahku tidak menyukainya.\" Lalu Umar menyampaikan hal itu kepada Nabi shallallahu 'alaihi wasallam hingga beliau memerintahkanku untuk menceraikannya, maka aku pun menceraikannya",
          "tr": "Abdullah bin Ömer (r.a.)'dat\\; şöyle demiştir: Benim nikâhım altında bir karım var idi ve ben onu severdim, babam da ona buğzederdi. Sonra (babam) Ömer (r.a.) bu durumu Nebi (Sallallahu Aleyhi ve Sellem)'e anlattı. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) bana bu karımı boşamamı emretti. Ben de onu boşadım. Diğer tahric: Tirmizi, Ebu Davud ve Nesai de rivayet etmişlerdir. AÇIKLAMA 2089’da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 73
      }
    },
    {
      "hadithNumber": 2089,
      "arabicNumber": 2089,
      "book": 10,
      "hadithInBook": 74,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ رَجُلاً، أَمَرَهُ أَبُوهُ أَوْ أُمُّهُ - شَكَّ شُعْبَةُ - أَنْ يُطَلِّقَ، امْرَأَتَهُ فَجَعَلَ عَلَيْهِ مِائَةَ مُحَرَّرٍ ‏.‏ فَأَتَى أَبَا الدَّرْدَاءِ فَإِذَا هُوَ يُصَلِّي الضُّحَى وَيُطِيلُهَا وَصَلَّى مَا بَيْنَ الظُّهْرِ وَالْعَصْرِ فَسَأَلَهُ فَقَالَ أَبُو الدَّرْدَاءِ أَوْفِ بِنَذْرِكَ وَبَرَّ وَالِدَيْكَ ‏.‏ وَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ الْوَالِدُ أَوْسَطُ أَبْوَابِ الْجَنَّةِ فَحَافِظْ عَلَى وَالِدَيْكَ أَوِ اتْرُكْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdur-Rahman that:a man's father or mother - Shu'bah (one of the namators) was not sure - ordered him to divorce his wife, and he made a vow that he would free one hundred slaves if he did that. He came to Abu Darda' while he was praying the Duha, and he was making his prayer lengthy, and he prayed between Zuhr and 'Asr. Then he asked him and Abu Darda' said: \"Fulfill your vow and honor your parents.\" Abu Ad-Darda' said: \"I heard the Messenger of Allah (ﷺ) say: '(Honoring) one's father may lead one to enter through the best of the gates of Paradise; so take care of your parents, (it is so, whether you take care of them) or not",
          "ur": "ابوعبدالرحمٰن سے روایت ہے کہ ایک شخص کو اس کی ماں نے یا باپ نے ( یہ شک شعبہ کو ہوا ہے ) حکم دیا کہ اپنی بیوی کو طلاق دیدے، اس نے نذر مان لی کہ اگر اپنی بیوی کو طلاق دیدے تو اسے سو غلام آزاد کرنا ہوں گے، پھر وہ ابوالدرداء رضی اللہ عنہ کے پاس آیا، وہ صلاۃ الضحیٰ ( چاشت کی نماز ) پڑھ رہے تھے، اور اسے خوب لمبی کر رہے تھے، اور انہوں نے نماز پڑھی ظہر و عصر کے درمیان، بالآخر اس شخص نے ان سے پوچھا، تو ابوالدرداء رضی اللہ عنہ نے کہا: اپنی نذر پوری کرو، اور اپنے ماں باپ کی اطاعت کرو۔ ابوالدرداء رضی اللہ عنہ نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ہے: باپ جنت میں جانے کا بہترین دروازہ ہے، اب تم اپنے والدین کے حکم کی پابندی کرو، یا اسے نظر انداز کر دو ۱؎۔",
          "fr": "Rapporté par 'Abdur-Rahman : Le père ou la mère d’un homme – Shu'bah (un des rapporteurs) n’était pas sûr – lui a ordonné de divorcer de sa femme, et il a fait le vœu d’affranchir cent esclaves s’il le faisait. Il est allé voir Abu Darda’ pendant qu’il priait la prière du Duha, et il a prolongé sa prière, puis il a prié entre le Zuhr et l’Asr. Ensuite il l’a interrogé et Abu Darda’ a dit : \"Accomplis ton vœu et honore tes parents.\" Abu Darda’ a dit : \"J’ai entendu le Messager d’Allah (ﷺ) dire : '(Honorer) son père peut permettre d’entrer par la meilleure des portes du Paradis ; alors prends soin de tes parents, que tu le veuilles ou non",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari ['Atha bin As Sa`ib] dari [Abu 'Abdurrahman] berkata, \"Seorang laki-laki disuruh ayah atau ibunya -Syu'bah merasa ragu- untuk menceraikan isterinya dan ia akan diganti dengan seratus budak. Maka ia mendatangi Abu Darda yang waktu itu sedang melaksanakan shalat dluha, dan ia memperpanjang ahalatnya. Ketika Abu Darda shalat antara zhuhur dan asar, barulah ia menanyakan hal tersebut. [Abu Darda] menjawab: \"Tepati nadzarmu dan berbuat baiklah kepada kedua orang tuamu. Karena aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang tua akan berada di tengah-tengah pintu surga, maka jagalah kedua orang tuamu atau justru kamu meninggalkannya",
          "tr": "Ebû Abdirrahman (es-Sülemî) (r.a.)'den rivayet edildiğine göre: Bir adamın babası veya annesi (Rrâvi Şube tereddüd etmiş) kendisine karısını boşamasını emretti. Adam da (karısını boşamak istemediği için) karısını boşaması hâlinde yüz köleyi âzad etmeyi adadı. Adam sonra Ebü'd-Derdâ (r.a.)'in yanına vardı. Baktı ki Ebu'd-Derdâ kuşluk namazını kılıyor ve namazını uzatıyor. Öğle ile ikindi arasında da namaz kıldı. Sonra adam (durumu) ona sordu. Ebü'd-Derdâ; Adağını ifa et ve baban ile annene itaat et, dedi. Ebü'd-Derdâ şöyle de dedi: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim, buyurdular ki: «Baba, cennet kapılarının en hayırlısı (ndan girmeye vesile) dir, artık (dilersen) baba ve annenin hukukunu iyice koru veya (iyice korumayı) terk et.» Diğer tahric: Tirmizi, İbn-i Hibban, Hakim ve Ebu Davud-i Tayalisi de rivayet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 74
      }
    },
    {
      "hadithNumber": 2435,
      "arabicNumber": 2435,
      "book": 10,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، وَعَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، وَأَبُو أُسَامَةَ وَجَعْفَرُ بْنُ عَوْنٍ عَنِ ابْنِ أَنْعُمٍ، قَالَ أَبُو كُرَيْبٍ وَحَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنِ ابْنِ أَنْعُمٍ، عَنِ عِمْرَانَ بْنِ عَبْدٍ الْمَعَافِرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الدَّيْنَ يُقْضَى مِنْ صَاحِبِهِ يَوْمَ الْقِيَامَةِ إِذَا مَاتَ إِلاَّ مَنْ يَدَيَّنُ فِي ثَلاَثِ خِلاَلٍ الرَّجُلُ تَضْعُفُ قُوَّتُهُ فِي سَبِيلِ اللَّهِ فَيَسْتَدِينُ يَتَقَوَّى بِهِ لِعَدُوِّ اللَّهِ وَعَدُوِّهِ وَرَجُلٌ يَمُوتُ عِنْدَهُ مُسْلِمٌ لاَ يَجِدُ مَا يُكَفِّنُهُ وَيُوَارِيهِ إِلاَّ بِدَيْنٍ وَرَجُلٌ خَافَ اللَّهَ عَلَى نَفْسِهِ الْعُزْبَةَ فَيَنْكِحُ خَشْيَةً عَلَى دِينِهِ فَإِنَّ اللَّهَ يَقْضِي عَنْ هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:“A debt will be settled on the Day of Resurrection if the one who owes it dies, apart from three: A man who lost his strength fighting in the cause of Allah (SWT), so he borrows in order to become strong again to fighting in the cause of Allah (SWT), so he borrows in order to become strong again to fight the enemy of Allah (SWT) and his enemy. A man who sees a Muslims die and he cannot find anything with which to shroud him except by taking a loan. A man who sees a Muslim die and he cannot find anything with which to shroud him except, by taking a loan. A man who fears Allah (SWT) if he stays single, so he gets married for fear of (losing) his religious commitment. Allah will pay off the debt for these people on the Day of Resurrection.”",
          "ur": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قرض دار جب مقروض مر جائے تو قیامت کے دن اس کے قرض کی ادائیگی اس سے ضرور کرائی جائے گی سوائے اس کے کہ اس نے تین باتوں میں سے کسی کے لیے قرض لیا ہو، ایک وہ جس کی طاقت جہاد میں کمزور پڑ جائے تو وہ قرض لے کر اپنی طاقت بڑھائے تاکہ وہ اللہ تعالیٰ کے اور اپنے دشمن سے جہاد کے قابل ہو جائے، دوسرا وہ شخص جس کے پاس کوئی مسلمان مر جائے اور اس کے پاس اس کے کفن دفن کے لیے سوائے قرض کے کوئی چارہ نہ ہو، تیسرا وہ شخص، جو تجرد ( بغیر شادی کے رہنے ) سے اپنے نفس پر ڈرے، اور اپنے دین کو مبتلائے آفت ہونے کے اندیشے سے قرض لے کر نکاح کرے، تو اللہ تعالیٰ ان تینوں کا قرض قیامت کے دن ادا کر دے گا ۔",
          "fr": "Rapporté par 'Abdullah bin 'Amr : Le Messager d’Allah (ﷺ) a dit : « Une dette sera réglée le Jour de la Résurrection si celui qui la doit meurt, sauf dans trois cas : Un homme qui a perdu ses forces en combattant dans la voie d’Allah (SWT), alors il emprunte pour pouvoir se renforcer et combattre à nouveau l’ennemi d’Allah (SWT) et son propre ennemi. Un homme qui voit un musulman mourir et ne trouve rien pour l’envelopper sauf en prenant un prêt. Un homme qui craint Allah (SWT) s’il reste célibataire, alors il se marie par crainte de perdre sa foi. Allah réglera la dette de ces personnes le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Risydin bin Sa'd] dan ['Abdurrahman Al Muharibi] dan [Abu Usamah] dan [Ja'far bin Aun] dari [Ibnu An'um]. [Abu Kuraib] berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ibnu An'um] dari [Imran bin Abad Al Ma'arifi] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat hutang itu akan diminta pembayarannya dari pemiliknya kecuali seseorang yang berhutang dalam tiga kondisi; seseorang yang berada di jalan Allah dalam keadaan lemah kemudian ia berhutang untuk menambah kekuatannya dalam menghadapai musuh Allah dan musuhnya. Dan seorang lelaki yang meninggal sementara disampingnya ada seorang muslim yang tidak mendapatkan kain untuk membungkus dan mengkafaninya kecuali dengan berhutang. Serta seorang lelaki yang takut kepada Allah lantaran dirinya dalam keadaan bujang, sehingga ia berhutang untuk menikah demi menjaga agamanya. Maka Allah akan membayarkan hutang mereka pada hari kiamat",
          "tr": "Abdullah bin Amr (bin el-As) (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Şüphesiz borç sahibi ölünce kıyamet günü borcu kendisinden tahsil edilir. Fakat (şu) üç haslet için borçlanan (müslüman) bir kimse bu hükmün dışındadır: Adamın gücü Allah yolunda zayıflar ve bu nedenle borçlanıp bununla Allah düşmanına ve kendi düşmanına karşı kuvvetlenir ve Adamın yanında bir müslüman ölür ve onun tekfin ve defni için borçtan başka bir şey bulamaz. Bir de Adam bekarlık yüzünden nefsinin günaha girmesinden korkar da dînini korumak gayesiyle evlenir. Şüphesiz Allah Teala kıyamet günü bunların yerine borçlarım öder.» Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Abdurrahman bin Ziyad bin Enum eş-Şeybani kadı İfrikıyye bulunur ki bu ravi zayıftır. Ahmed, İbn-i Main. Nesai ve başkaları onun zayıflığını beyan etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 2464,
      "arabicNumber": 2464,
      "book": 10,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ الأَرْضَ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ لَهَا خَرَاجًا مَعْلُومًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Tawus that Ibn`Abbas told that the Messenger of Allah (ﷺ) merely said:“For one of you to give (land) to his brother is better for him than if he were to take a set amount in rent for it.”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے تو صرف یہ فرمایا تھا: کوئی اپنے بھائی کو اپنی زمین یوں ہی مفت کھیتی کے لیے دیدے، تو یہ اس سے بہتر ہے کہ وہ اس سے کوئی معین محصول لے ۔",
          "fr": "Rapporté par Tawus que Ibn 'Abbas a dit que le Messager d’Allah (ﷺ) a simplement dit : “Pour l’un de vous, donner (sa terre) à son frère est mieux pour lui que de recevoir un loyer fixe pour elle.”",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Amru bin Dinar] dari [Thawus] ia berkata, [Ibnu Abbas] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang dari kaliam menyerahkan (pengelolaan tanahnya) kepada saudaranya, maka itu lebih baik baginya daripada meminta bagian tertentu",
          "tr": "İbn-i Abbas (r.a.)'den rivayet edildiğine göre şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) şüphesiz ancak şöyle buyurdu: «Şüphesiz birinizin, arazisini ziraat için (din) kardeşine (ücretsiz) vermesi, belirli bir ücret karşılığı vermesinden kendisi için hayırlıdır.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 2476,
      "arabicNumber": 2476,
      "book": 10,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الْمِنْهَالِ، سَمِعْتُ إِيَاسَ بْنَ عَبْدٍ الْمُزَنِيَّ، وَرَأَى، أُنَاسًا يَبِيعُونَ الْمَاءَ فَقَالَ لاَ تَبِيعُوا الْمَاءَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُبَاعَ الْمَاءُ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Minhal said:“I heard Iyas bin 'Abd Muzani say - when he saw people selling water: 'Do not sell water, for I heard the Messenger of Allah (ﷺ) forbidding selling of water.' ”",
          "ur": "ابومنہال کہتے ہیں کہ میں نے ایاس بن عبداللہ مزنی رضی اللہ عنہ سے سنا، انہوں نے کچھ لوگوں کو پانی بیچتے ہوئے دیکھا تو کہا: پانی نہ بیچو اس لیے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آپ صلی اللہ علیہ وسلم نے پانی بیچنے سے منع کیا ہے ۱؎۔",
          "fr": "Rapporté par Abu Minhal : “J’ai entendu Iyas bin 'Abd Muzani dire – en voyant des gens vendre de l’eau : ‘Ne vendez pas l’eau, car j’ai entendu le Messager d’Allah (ﷺ) interdire la vente de l’eau.’”",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Abu Al Minhal] berkata; Aku mendengar [Iyas bin Abd Al Muzanni] ia melihat orang-orang menjual air, maka ia berkata, \"Janganlah kalian menjual air, sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam melarang untuk menjual air",
          "tr": "İyâs bin Abd (Ebû Avf) el-Müzenî (r.a.)'in bâzı insanların su sattığını görünce (onlara) şöyle dediği rivayet olunmuştur: Su satmayınız. Çünkü ben Resulullah (Sallallahu Aleyhi ve Sellem)'den (ihtiyaç fazlası) suyun satılmasını yasakladığını işittim. EBU DAVUD HADİSİ VE İZAH İÇİN TIKLA"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih Hadith"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 2477,
      "arabicNumber": 2477,
      "book": 10,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ فَضْلِ الْمَاءِ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:“The Messenger of Allah (ﷺ) forbade selling surplus water.”",
          "ur": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے زائد پانی بیچنے سے منع فرمایا ہے ۱؎۔",
          "fr": "Rapporté par Jabir : Le Messager d'Allah (ﷺ) a interdit de vendre l'eau excédentaire",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Ibrahim bin Sa'id Al Jauhari] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menjual kelebihan air",
          "tr": "Cabir (bin Abdillah) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) su'yun fazlasını satmayı yasakladı. MÜSLİM HADİSLERİ VE İZAHI 1565 —"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih Hadith"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 10,
        "hadith": 62
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "64KB"
  }
}