{
  "collection": "majah",
  "book": 32,
  "name": {
    "arabic": "كتاب Chapters on Dress",
    "transliteration": "chapters on dress",
    "translation": "Chapters on Dress"
  },
  "totalHadith": 107,
  "hadithNumberRange": {
    "first": 3550,
    "last": 3656
  },
  "content": [
    {
      "hadithNumber": 3550,
      "arabicNumber": 3550,
      "book": 32,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي خَمِيصَةٍ لَهَا أَعْلاَمٌ فَقَالَ ‏ \"‏ شَغَلَنِي أَعْلاَمُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَائْتُونِي بِأَنْبِجَانِيَّتِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“The Messenger of Allah (ﷺ) prayed in a Khamisah* that had markings on it. Then he said: ‘These markings distracted me. Take it to Abu Jahm and bring me an Anbijaniyyah.’”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک چادر میں نماز پڑھی جس میں نقش و نگار تھے، تو آپ صلی اللہعلیہ وسلم نے فرمایا: مجھے ان بیل بوٹوں نے غافل کر دیا، اسے ابوجہم کو کے پاس لے کر جاؤ اور مجھے ان کی انبجانی چادر لا کر دے دو ۔",
          "fr": "Rapporté par ‘Aishah : Le Messager d’Allah (ﷺ) a prié dans un vêtement Khamisah* qui avait des motifs. Ensuite, il a dit : \"Ces motifs m’ont distrait. Apportez-le à Abu Jahm et ramenez-moi un Anbijaniyyah.\" (*Khamisah : un vêtement à motifs)",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam shalat dengan mengenakan kain wool yang bergaris, maka beliau bersabda: \"Aku merasa terganggu dengan garis-garis ini, bawalah ia kepada Abu Jahm dan bawakan kepadaku baju wool yang tidak bergaris",
          "tr": "Âi§e (r.a.)'dan; Şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem nakışlı bir siyah abâ içinde namaz kıldı. Sonra buyurdu ki: Bu aba'nın nakışları beni meşgul etti. Bunu Ebû Cehm'e (geri) götürün ve bana onun enbicâniyesini getirin"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 3551,
      "arabicNumber": 3551,
      "book": 32,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، أَخْبَرَنِي سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَأَخْرَجَتْ لِي إِزَارًا غَلِيظًا مِنَ الَّتِي تُصْنَعُ بِالْيَمَنِ وَكِسَاءً مِنْ هَذِهِ الأَكْسِيَةِ الَّتِي تُدْعَى الْمُلَبَّدَةَ وَأَقْسَمَتْ لِي لَقُبِضَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِيهِمَا ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Burdah said:“I entered upon ‘Aishah and she brought out to me a thick waist wrap of the type made in Yemen, and one of these cloaks that are called Mulabbadah,* and she swore to me that the Messenger of Allah (ﷺ) had passed away in them.”",
          "ur": "ابوبردہ رضی اللہ عنہ کہتے ہیں کہ میں ام المؤمنین عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا، انہوں نے ایک موٹے کپڑے کا تہبند نکالا جو یمن میں تیار کیا جاتا ہے، اور ان چادروں میں سے ایک چادر جنہیں ملبدہ ( موٹا ارزاں کمبل ) کہا جاتا ہے، نکالا اور قسم کھا کر مجھے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں میں وفات پائی ۱؎۔",
          "fr": "Rapporté par Abu Burdah : Je suis entré chez ‘Aishah et elle m’a montré une ceinture épaisse du Yémen et un de ces manteaux appelés Mulabbadah*. Elle m’a juré que le Messager d’Allah (ﷺ) était décédé en portant ces vêtements. (*Mulabbadah : un manteau épais)",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Abu Usamah] Telah mengabarkan kepadaku [Sulaiman bin Al Mughirah] dari [Humaid bin Hilal] dari [Abu Burdah] dia berkata, \"Saya menemui [Aisyah], lantas ia mengeluarkan kain tebal yang terbuat dari daerah Yaman dan satu potong baju dari baju-baju ini yang di sebut dengan Al Mulabbadah (baju yang kasar), lantas ia bersumpah kepadaku, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam wafat dengan menggunakan keduanya",
          "tr": "Ebû Bürde (bin Ebî Musa el-Eş'arî) (r.a.)'dan; Şöyle demiştir: Ben, Âişe (r.anhâ)'nın yanına girdim. O, Yemen'de dokunan tok kumaştan mamul bir izâr ve mülebbede denilen (yâni çok yamalanmakla keçelenmiş gibi olan) şu elbiselerden bir kaftanı benim için çıkar (ıp göster) di ve bana yemin ederek: Resulullah Sallallahu Aleyhi ve Sellem bu iki elbise içinde vefat etti, dedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 3552,
      "arabicNumber": 3552,
      "book": 32,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الأَحْوَصِ بْنِ حَكِيمٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى فِي شَمْلَةٍ قَدْ عَقَدَ عَلَيْهَا ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Ubadah bin Samit that the Messenger of Allah (ﷺ) prayed in a Shamlah tied with a knot",
          "ur": "عبادہ بن صامت رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک ایسی چادر میں نماز پڑھی جس میں آپ نے گرہ لگا رکھی تھی۔",
          "fr": "Rapporté par ‘Ubadah bin Samit : Le Messager d’Allah (ﷺ) a prié en portant un châle attaché avec un nœud",
          "id": "Telah menceritakan kepada kami [Ahmad bin Tsabit Al Jahdari] Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Al Ahwash bin Hakim] dari [Khalid bin Ma'dan] dari ['Ubadah bin Ash Shamit], bahwa Rasulullah shallallahu 'alaihi wasallam melakukan shalat dengan mantel yang beliau kenakan",
          "tr": "Ubade bin es-Sâmit (r.a.)'den; Şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bir semle (car - ihram) içinde namaz kıldı, (carın küçüklüğü dolayısıyla düşmemesi için) onu bağlamıştı. Not: Zevaid'de şöyle denilmiştir: Ravi Halid'in Ubade bin es-Samit (r.a.)'den hadis işitmesi sabit değildir. Ebu Naim de demiş ki: Halid, Ubade ile görüşmemiş ve ondan hadis işitmemiştir. Ravi el-Ahvas bin Hakim de zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 3553,
      "arabicNumber": 3553,
      "book": 32,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَعَلَيْهِ رِدَاءٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas bin Malik said:“I was with the Messenger of Allah (ﷺ) and over him was a Najrani upper wrap with a thick border.”",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ تھا، آپ کے جسم پر موٹے کنارے والی نجرانی چادر تھی۔",
          "fr": "Rapporté par Anas bin Malik : J’étais avec le Messager d’Allah (ﷺ) et il portait un manteau Najrani avec un bord épais",
          "id": "Telah menceritakan kepada kami [Yunus bin Abdul A'la] Telah menceritakan kepada kami [Ibnu Wahb] Telah menceritakan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] dia berkata, \"Aku bersama Nabi shallallahu 'alaihi wasallam sedangkan beliau mengenakan kain Najrani yang pinggirnya tebal",
          "tr": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Ben, Nebi Sallallahu Aleyhi ve Sellem'in beraberinde idim. O'nun üstünde saçağı kalın Necrân mamulü bir ridâ vardı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 3554,
      "arabicNumber": 3554,
      "book": 32,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ لَهِيعَةَ، حَدَّثَنَا أَبُو الأَسْوَدِ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسُبُّ أَحَدًا وَلاَ يُطْوَى لَهُ ثَوْبٌ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“I never saw the Messenger of Allah (ﷺ) insulting anyone, and no garment was ever folded up for him.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے کبھی رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا کہ آپ نے کسی کو برا بھلا کہا ہو یا آپ کا کپڑا تہ کیا جاتا رہا ہو۔",
          "fr": "Rapporté par ‘Aishah : « Je n’ai jamais vu le Messager d’Allah (ﷺ) insulter qui que ce soit, et jamais un vêtement n’a été plié pour lui. »",
          "id": "Telah menceritakan kepada kami [Abdul Quddus bin Muhammad] Telah menceritakan kepada kami [Bisyr bin 'Umar] Telah menceritakan kepada kami [Ibnu Lahi'ah] Telah menceritakan kepada kami [Abu Al Aswad] dari ['Ashim bin Umar bin Qatadah] dari [Ali bin Al Husain] dari [Aisyah] dia berkata, \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam mencaci maki seseorang dan juga tidak melipat bajunya",
          "tr": "Âişe (r.anha)'dan rivayet edildiğine göre şöyle demiştir: Ben, Resulullah Sallallahu Aleyhi ve Sellem'in herhangi bir kimseyi sövdüğünü ve O'nun için bir elbisenin durulduğunu görmedim. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Abdullah bin Lehia vardır. Bu ravi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 3555,
      "arabicNumber": 3555,
      "book": 32,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ امْرَأَةً، جَاءَتْ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بِبُرْدَةٍ - قَالَ وَمَا الْبُرْدَةُ قَالَ الشَّمْلَةُ - قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي نَسَجْتُ هَذِهِ بِيَدِي لأَكْسُوَكَهَا ‏.‏ فَأَخَذَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مُحْتَاجًا إِلَيْهَا فَخَرَجَ عَلَيْنَا فِيهَا وَإِنَّهَا لإِزَارُهُ فَجَاءَ فُلاَنُ بْنُ فُلاَنٍ - رَجُلٌ سَمَّاهُ يَوْمَئِذٍ - فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحْسَنَ هَذِهِ الْبُرْدَةَ اكْسُنِيهَا ‏.‏ قَالَ ‏ \"‏ نَعَمْ ‏\"‏ ‏.‏ فَلَمَّا دَخَلَ طَوَاهَا وَأَرْسَلَ بِهَا إِلَيْهِ فَقَالَ لَهُ الْقَوْمُ وَاللَّهِ مَا أَحْسَنْتَ كُسِيَهَا النَّبِيُّ ـ صلى الله عليه وسلم ـ مُحْتَاجًا إِلَيْهَا ثُمَّ سَأَلْتَهُ إِيَّاهَا وَقَدْ عَلِمْتَ أَنَّهُ لاَ يَرُدُّ سَائِلاً ‏.‏ فَقَالَ إِنِّي وَاللَّهِ مَا سَأَلْتُهُ إِيَّاهَا لأَلْبَسَهَا وَلَكِنْ سَأَلْتُهُ إِيَّاهَا لِتَكُونَ كَفَنِي ‏.‏ فَقَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ يَوْمَ مَاتَ ‏.‏",
        "translations": {
          "en": "It was narrated from Sahl bin Sa’d Sa’idi that a woman came to the Messenger of Allah (ﷺ) with a woven sheet – he said:* “What type of woven sheet?” He said: “A Shamlah.” She said: “O Messenger of Allah, I have woven this with my own hands for you to wear.” The Messenger of Allah (ﷺ) took it, since he needed it. He came out to us wearing it as a lower wrap. So-and-so the son of so-and-so.” – a man whose name he told that day – said: “O Messenger of Allah, how beautiful this sheet is! Let me wear it.” He said: “Yes.” When he went inside he folded it up and sent it to him. The people said to him: “By Allah, you have not done well. The Prophet (ﷺ) wore it because he needed it, then you asked for it, and you knew that he would not refuse anyone who asked him for something.” He said: “By Allah, I did not ask for it so that I could wear it, rather I asked for it so that it could be my shroud.” Sahl said: “And it became his shroud the day he died.”",
          "ur": "سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں «بردہ» ( چادر ) لے کر آئی ( ابوحازم نے پوچھا«بردہ» کیا چیز ہے؟ ان کے شیخ نے کہا: «بردہ» شملہ ہے جسے اوڑھا جاتا ہے ) اور کہا: اللہ کے رسول! اسے میں نے اپنے ہاتھ سے بنا ہے تاکہ میں آپ کو پہناؤں، رسول اللہ صلی اللہ علیہ وسلم نے اسے لے لیا کیونکہ آپ کو اس کی ضرورت تھی، پھر آپ اسے پہن کر کے ہمارے درمیان نکل کر آئے، یہی آپ کا تہبند تھا، پھر فلاں کا بیٹا فلاں آیا ( اس شخص کا نام حدیث بیان کرنے کے دن سہل نے لیا تھا لیکن ابوحازم اسے بھول گئے ) اور عرض کیا: اللہ کے رسول! یہ چادر کتنی اچھی ہے، یہ آپ مجھے پہنا دیجئیے، فرمایا: ٹھیک ہے ، پھر جب آپ اندر گئے تو اسے ( اتار کر ) تہ کیا، اور اس کے پاس بھجوا دی، لوگوں نے اس سے کہا: اللہ کی قسم! تم نے اچھا نہیں کیا، نبی اکرم صلی اللہ علیہ وسلم کو اس نے اس لیے پہنائی تھی کہ آپ کو اس کی حاجت تھی، پھر بھی تم نے اسے آپ سے مانگ لیا، حالانکہ تمہیں معلوم تھا کہ آپ کسی سائل کو نامراد واپس نہیں کرتے تو اس شخص نے جواب دیا: اللہ کی قسم! میں نے آپ سے اسے پہننے کے لیے نہیں مانگا ہے بلکہ اس لیے مانگا ہے کہ وہ میرا کفن ہو، سہل کہتے ہیں: جب وہ مرے تو یہی چادر ان کا کفن تھی ۱؎۔",
          "fr": "Rapporté par Sahl bin Sa’d Sa’idi : Une femme est venue voir le Messager d’Allah (ﷺ) avec un tissu tissé – il demanda : « Quel type de tissu tissé ? » Il répondit : « Une shamlah. » Elle dit : « Ô Messager d’Allah, j’ai tissé ceci de mes propres mains pour que tu le portes. » Le Messager d’Allah (ﷺ) l’a pris, car il en avait besoin. Il est ensuite sorti vers nous en le portant comme pagne. Un homme, dont il a donné le nom ce jour-là, dit : « Ô Messager d’Allah, ce tissu est magnifique ! Laisse-moi le porter. » Il répondit : « Oui. » Quand il est rentré à l’intérieur, il l’a plié et le lui a envoyé. Les gens lui dirent : « Par Allah, tu n’as pas bien agi. Le Prophète (ﷺ) l’a porté parce qu’il en avait besoin, puis tu l’as demandé, alors que tu savais qu’il ne refusait jamais rien à celui qui lui demandait quelque chose. » Il répondit : « Par Allah, je ne l’ai pas demandé pour le porter, mais pour qu’il me serve de linceul. » Sahl dit : « Et il est devenu son linceul le jour de sa mort. »",
          "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] Telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Ayahnya] dari [Sahl bin Sa'd As Sa'idi], bahwa seorang wanita datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa kain burdah -perawai berkata, 'Apakah kain burdah itu? Ia Dijawab, 'Yaitu kain mantel.'- Wanita itu berkata, \"Wahai Rasulullah, sungguh aku telah merajut sendiri jubah ini supaya anda memakainya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam mengambilnya karena beliau butuh jubah tersebut, kemudian beliau memperlihatkan jubah tersebut kepada kami yang bentuknya seperti kain. Lalu datanglah fulan bin fulan -seorang laki-laki yang di kenal masa itu- seraya berkata, \"Wahai Rasulullah, sungguh sangat indah jubah ini, pakaikanlah untukku! \" Beliau menjawab: \"Baiklah.\" Beliau kemudian masuk dan melipat kain tersebut, lalu mengirimkannya kepada laki-laki tersebut, orang-orang lalu berkata kepadanya, \"Demi Allah, sungguh beruntung kamu, (padahal) Nabi shallallahu 'alaihi wasallam memakainya karena butuh terhadap jubah itu, kemudian kamu memintanya. Kamu sebenarnya sangat tahu bahwa beliau tidak pernah bisa menolak orang yang meminta.\" Laki-laki itu berkata, \"Demi Allah, sesungguhnya aku tidaklah meminta jubah itu untuk aku pakai, tetapi aku minta itu untuk aku pakai sebagai kain kafanku.\" Sahl berkata, \"Maka jubah itu pun menjadi kain kafan lelaki tersebut ketika ia meninggal dunia",
          "tr": "Sehl bin Sa'd es-Sâidî (r.a.)'dan; Şöyle demiştir: Bir kadın, Resulullah Sallallahu Aleyhi ve Sellem'e bir bürde getirdi. (Sehl: Bürde nedir? diye —orada bulunanlara — sordu —da sözüne devamla — Bürdedir —yâni ihram gibi dikişsizdir— diye sorusunu kendisi cevabladı.) Bürdeyi getiren kadın : Yâ Resûlallah, bu bürdeyi sana giydireyim diye kendi elimle dokudum, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) de bürdeyi aldı. Zâten kendisinin böyle bir bürdeye ihtiyacı vardı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) o bürdeyi izâr (yâni belden aşağı vücûduna sarmış) olarak giyip (evden) yanımıza çıktı. Sonra falan oğlu falan (Sehl'in o gün ismini söylediği bir adam) gelerek: Yâ Resulallah, bu bürde ne güzeldir! Bunu bana giydir, dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) de: Peki buyurdu. Sonra eve girince bürdeyi dürüp o adam'a gönderdi. Orada hazır olan cemâat adama: Vallahi sen iyi etmedin. Nebi (Sallallahu Aleyhi ve Sellem)'e bu bürde ihtiyacı olarak giydirildi. Sonra sen kendisinin bir şey isteyen hiç bir kimseyi reddetmediğini bildiğin halde Ondan bürdeyi istedin, dediler. Adam da (bu yadırgamaya karşılık): Vallahi ben bu bürdeyi giymek için istemedim. Ve lâkin (öldüğümde) kefenim olsun diye istedim, dedi. Sehl demiştir ki: Sonra bu zât'ın vefat ettiği gün hakikaten o bürde onun kefeni oldu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 3556,
      "arabicNumber": 3556,
      "book": 32,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ يُوسُفَ بْنِ أَبِي كَثِيرٍ، عَنْ نُوحِ بْنِ ذَكْوَانَ، عَنِ الْحَسَنِ، عَنْ أَنَسٍ، قَالَ لَبِسَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الصُّوفَ وَاحْتَذَى الْمَخْصُوفَ وَلَبِسَ ثَوْبًا خَشِنًا خَشِنًا ‏.‏",
        "translations": {
          "en": "It was narrated that Anas said:“The Messenger of Allah (ﷺ) wore wool and sandals, and he wore coarse, rough garments.”",
          "ur": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اون کا ( سادہ اور موٹا ) لباس پہنا ہے، مرمت شدہ جوتا پہنا ہے اور انتہائی موٹا کپڑا زیب تن فرمایا ہے۔",
          "fr": "Rapporté par Anas : « Le Messager d’Allah (ﷺ) portait de la laine et des sandales, et il mettait des vêtements épais et rugueux. »",
          "id": "Telah menceritakan kepada kami [Yahya bin 'Utsman bin Sa'id bin Katsir bin Dinar Al Himshi] Telah menceritakan kepada kami [Baqiyah bin Al Walid] dari [Yusuf bin Abu Katsir] dari [Nuh bin Dzakwan] dari [Al Hasan] dari [Anas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengenakan kain shuf (wol) dan mengenakan terompah yang di tambal, beliau juga mengenakan pakaian yang kasar",
          "tr": "Enes (r.a.)'den rivayet edildiğine göre: Resulullah Sallallahu Aleyhi ve Sellem'in elbise ve yamalanmış ayakkabı giyiniş ve cidden sert elbise giymiştir. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Nuh bin Zekvan bulunur. Bu ravi zayıftır. Bakıyye isimli ravi de tedlisçi olup bu hadisi an'ane lle rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Very Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 3557,
      "arabicNumber": 3557,
      "book": 32,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ حَدَّثَنَا أَصْبَغُ بْنُ زَيْدٍ، حَدَّثَنَا أَبُو الْعَلاَءِ، عَنْ أَبِي أُمَامَةَ، قَالَ لَبِسَ عُمَرُ بْنُ الْخَطَّابِ ثَوْبًا جَدِيدًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ مَنْ لَبِسَ ثَوْبًا جَدِيدًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ‏.‏ ثُمَّ عَمَدَ إِلَى الثَّوْبِ الَّذِي أَخْلَقَ أَوْ أَلْقَى فَتَصَدَّقَ بِهِ كَانَ فِي كَنَفِ اللَّهِ وَفِي حِفْظِ اللَّهِ وَفِي سِتْرِ اللَّهِ حَيًّا وَمَيِّتًا ‏\"‏ ‏.‏ قَالَهَا ثَلاَثًا ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Umamah said:“Umar bin Khattab put on a new garment and said: Al-hamdu lillahil-ladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi hayati (Praise is to Allah Who has clothed me in something with which I conceal my nakedness and adorn myself in my life). Then he said: ‘I heard the Messenger of Allah (ﷺ) say: “Whoever puts on a new garment and says: Al-hamdu lillahil- ladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi hayati (Praise be to Allah Who has clothed me in something with which I conceal my nakedness and adorn myself in my life), then takes the garment that has worn out, or that he had taken off and gives it in charity, he will be under the shelter, protection and care of Allah, whether he lives or dies.’ He said this three times.”",
          "ur": "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے نیا کپڑا پہنا تو یہ دعا پڑھی: «الحمد لله الذي كساني ما أواري به عورتي وأتجمل به في حياتي» یعنی: اللہ کا شکر ہے جس نے مجھے ایسا کپڑا پہنایا جس سے میں اپنی ستر پوشی کرتا ہوں، اور اپنی زندگی میں زینت حاصل کرتا ہوں ، پھر کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا کہ جو شخص نیا کپڑا پہنے اور یہ دعا پڑھے: «الحمد لله الذي كساني ما أواري به عورتي وأتجمل به في حياتي»یعنی اللہ کا شکر ہے جس نے مجھے ایسا کپڑا پہنایا جس سے میں اپنی ستر پوشی کرتا ہوں اور اپنی زندگی میں زینت حاصل کرتا ہوں ، پھر وہ اس کپڑے کو جو اس نے اتارا، یا جو پرانا ہو گیا صدقہ کر دے، تو وہ اللہ کی حفظ و امان اور حمایت میں رہے گا، زندگی میں بھی اور موت کے بعد بھی یہ آپ صلی اللہ علیہ وسلم نے تین بار فرمایا۔",
          "fr": "Rapporté par Abu Umamah : ‘Umar bin Khattab a mis un vêtement neuf et a dit : Al-hamdu lillahil-ladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi hayati (Louange à Allah qui m’a vêtu de quoi couvrir ma nudité et m’embellir dans ma vie). Puis il a ajouté : « J’ai entendu le Messager d’Allah (ﷺ) dire : “Celui qui met un vêtement neuf et dit : Al-hamdu lillahil-ladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi hayati (Louange à Allah qui m’a vêtu de quoi couvrir ma nudité et m’embellir dans ma vie), puis prend le vêtement usé ou qu’il a retiré et le donne en aumône, sera sous la protection, la garde et le soin d’Allah, qu’il vive ou qu’il meure.” » Il l’a dit trois fois",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Yazid bin Harun] dia berkata; Telah menceritakan kepada kami [Ashbagh bin Zaid] Telah menceritakan kepada kami [Abu Al 'Ala] dari [Abu Umamah] dia berkata, \" [Umar bin Al Khaththab] memakai baju baru, kemudian dia mengucapkan, 'ALHAMDULILLAHILLADZII KASAANI MAA UWAARIBIHI 'AURATII WA ATAJAMMALU BIHI FII HAYAATI (Segala puji bagi Allah yang telah memberiku pakaian untuk menutupi 'auratku dan menghiasi diriku didalam kehidupanku) '. Kemudian dia berkata, \"Aku mendengar RAsulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakai baju baru lalu mengucapkan 'ALHAMDULILLAHILLADZII KASAANI MAA UWAARIBIHI 'AURATII WA ATAJAMMALU BIHI FII HAYAATI (Segala puji bagi Allah yang telah memberiku pakaian untuk menutupi auratku dan menghiasi diriku didalam kehidupanku) ', kemudian dia mengambil pakaian yang telah usang atau yang sudah di tinggalkan, dan menyedekahkannya, maka hidup dan matinya, ia akan selalu berada dalam naungan Allah dan perlindungan Allah serta di dalam penjagaan Allah baik.\" Beliau mengulanginya hingga tiga kali",
          "tr": "Ebû Ümâme (el-Bâhilî) (r.a.)'den; Şöyle demiştir: Ömer bin el-Hattab (r.a.) yeni bir elbise giydi ve: Avretimi örten ve kıyafetimi iyi düzenleyen, elbiseyi bana giydiren Allah'a haradolsun, dedikten sonra; ben Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken iş ittim: «Kim yeni bir elbise giyip; الْحَمْدُ لِلّهِ الَّذِي كَسَانِي مَأُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي جَلْوَتِي. der, sonra eskittiği veya (bedeninden) attığı elbiseye gidip onu sadaka ederse; diri ve ölü iken (yâni dünyada ve âhirette) Allah'ın himayesinde, Allah'ın muhafazasında (korumasında) ve Allah'ın sitrinde (örtüsünde) olur. Bunu üç defa tekrarlar"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 3558,
      "arabicNumber": 3558,
      "book": 32,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَأَى عَلَى عُمَرَ قَمِيصًا أَبْيَضَ فَقَالَ ‏\"‏ ثَوْبُكَ هَذَا غَسِيلٌ أَمْ جَدِيدٌ ‏\"‏ ‏.‏ قَالَ لاَ بَلْ غَسِيلٌ ‏.‏ قَالَ ‏\"‏ الْبَسْ جَدِيدًا وَعِشْ حَمِيدًا وَمُتْ شَهِيدًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn `Umar that the Messenger of Allah (ﷺ) saw `Umar wearing a white shirt and he said:“Is this garment of yours washed or a new one?” He said: “Rather it has been washed.” He said: “Ilbas jadida, wa `ish hamida, wa mut shahida (May you wear new clothes, live a good life and die as martyr).”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کو ایک سفید قمیص پہنے دیکھا تو پوچھا: تمہارا یہ کپڑا دھویا ہوا ہے یا نیا ہے ؟ انہوں نے جواب دیا: نہیں، یہ دھویا ہوا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: «البس جديدا وعش حميدا ومت شهيدا» نیا لباس، قابل تعریف زندگی، اور شہادت کی موت نصیب ہو ۔",
          "fr": "Rapporté par Ibn `Umar : Le Messager d’Allah (ﷺ) a vu ‘Umar porter une chemise blanche et il a dit : « Ce vêtement est-il lavé ou neuf ? » Il répondit : « Il a été lavé. » Il dit : « Ilbas jadida, wa ‘ish hamida, wa mut shahida (Porte des vêtements neufs, vis honorablement et meurs en martyr). »",
          "id": "Telah menceritakan kepada kami [Al Husain bin Mahdi] Telah menceritakan kepada kami [Abdurrazaq] Telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam melihat Umar mengenakan pakaian putih, maka beliau pun bertanya, \"Apakah pakaianmu ini habis di cuci atau benar-benar baru?\" dia menjawab, \"Tidak, akan tetapi bajuku habis di cuci.\" Beliau bersabda: \"ILBAS JADIDAN WA 'ISY HAMIDAN WA MUT SYAHIDAN (Pakailah baju baru dan hiduplah dengan terhormat serta matilah sebagai syahid)",
          "tr": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Ömer (bin el-Hattâb)'ın üzerinde beyaz bir entari gördü ve: Senin bu elbisen yıkanmış (mı), yoksa yeni midir? buyurdu. Ömer de: Hayır (yeni değil). Fakat yıkanmıştır, dedi. Resûl-i Ekrem: «Yeni bir elbise giy (giyesin), hamdedici olarak yaşa ve şehid olarak öl,» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir. Ra.vi Hüseyin bin Mehdi el-Eyli'yi İbn-l Hlbban sıka raviler arasında anmıştır. İbn-i Huzeyme de kendi Sahlh'inde ondan rivayette bulunmuştur. Senedin kalan ravİlerin rivayetleri Buhar! ve Müsllm'de mevcuttur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 3559,
      "arabicNumber": 3559,
      "book": 32,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ لِبْسَتَيْنِ فَأَمَّا اللِّبْسَتَانِ فَاشْتِمَالُ الصَّمَّاءِ وَالاِحْتِبَاءُ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ) forbade two kinds of dress. Those two types of dress are Ishtimalus- Samma’* and Ihtiba’ in a single garment, with no part of it upon his private part",
          "ur": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے دو طرح کے پہناوے سے منع فرمایا ہے، ایک «اشتمال صماء» ۱؎ سے، دوسرے ایک کپڑے میں «احتباء» ۲؎ سے کہ اس کی شرمگاہ پر کچھ نہ ہو",
          "fr": "Rapporté par Abu Sa’eed Al-Khudri : Le Prophète (ﷺ) a interdit deux façons de s’habiller. Ces deux types sont : l’Ishtimalus-Samma’ et l’Ihtiba’ avec un seul vêtement, sans qu’aucune partie de ce vêtement ne couvre ses parties intimes",
          "id": "Telah menceritakan kepada kami [Abu Bakar] Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Atha bin Zaid Al Laitsi] dari [Abu Sa'id Al Khudri], bahwa Nabi shallallahu 'alaihi wasallam melarang mengenakan dua cara berpakaian; memakai pakaian shama` dan ihtiba` dengan satu kain sehingga tidak ada sesuatu yang menutupi kemaluannya",
          "tr": "Ebû Saîd-i Hudrî (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) iki çeşit giyinişi yasaklamıştır. O giyinişler iştimal-ı samına (denilen kıyafet) ve kabaları üzerinde oturup bacakları dikerek avret yeri örtüsüz kalacak şekilde tek bir elbiseye sarınmaktır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 3560,
      "arabicNumber": 3560,
      "book": 32,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ لِبْسَتَيْنِ عَنِ اشْتِمَالِ الصَّمَّاءِ وَعَنِ الاِحْتِبَاءِ فِي الثَّوْبِ الْوَاحِدِ يُفْضِي بِفَرْجِهِ إِلَى السَّمَاءِ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) forbade two kinds of dress:Ishtimalus-Samma’ and Ihtiba’, exposing one’s private part to the sky",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے دو طرح کے پہناوے سے منع فرمایا: «اشتمال صماء» سے اور ایک کپڑے میں«احتباء» سے، کہ شرمگاہ آسمان کی طرف کھلی رہے۔",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah (ﷺ) a interdit deux façons de s’habiller : l’Ishtimalus-Samma’ et l’Ihtiba’, qui exposent la partie intime vers le ciel",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Usamah] dari ['Ubaidillah bin Umar] dari [Khubaib bin Abdurrahman] dari [Hafsh bin 'Ashim] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam melarang mengenakan dua jenis pakaian; pakaian shama` dan ikhtiba` dengan satu kain seraya menengadahkan kemaluannya ke langit",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) iki çeşit giyinişi yasaklamıştır: İştimâl-i sammâ (denilen giyiniş) den ve kabaları üzerinde oturup bacakları dikerek avret yerini semâya doğru açarak (yani avret yerini örtüsüz bırakarak) tek bir elbiseye sarınmaktan"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 3561,
      "arabicNumber": 3561,
      "book": 32,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ سَعْدِ بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ لِبْسَتَيْنِ اشْتِمَالِ الصَّمَّاءِ وَالاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْتَ مُفْضٍ فَرْجَكَ إِلَى السَّمَاءِ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“The Messenger of Allah (ﷺ) forbade two kinds of dress: Ishtimalus-Samma’ and Ihtiba’ in one garment, when you are exposing your private part to the sky.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے دو طرح کے پہناوے سے منع فرمایا: «اشتمال صماء» سے، اور ایک کپڑے میں«احتباء» سے، کہ تم اپنی شرمگاہ کو آسمان کی طرف کھولے رہو۔",
          "fr": "Rapporté par ‘Aishah : « Le Messager d’Allah (ﷺ) a interdit deux façons de s’habiller : l’Ishtimalus-Samma’ et l’Ihtiba’ avec un seul vêtement, quand on expose sa partie intime vers le ciel. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Usamah] dari [Sa'id bin Sa'id] dari ['Amrah] dari [Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang dua jenis pakaian; shama` dan ikhtiba` dengan satu kain seraya menengadahkan kemaluannya ke langit.\" Ket; shama` adalah seseorang yang menyelimutui seluruh tubuhnya dan tidak ada yang terlihat; dan ihtiba` adalah duduk di atas bokong sementara kedua tangan mendekap kedua lututnya menempel dada",
          "tr": "Âİşe (r.anha)'dan; §öyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) iki çeşit giyinişi yasaklamıştır: İştimâl-i sanıma (denilen kıyafet) ve avret yerini semâya doğru açtığın (yâni örtüsüz bıraktığın) halde kabaların üzerinde oturup bacakları dikerek tek bir elbiseye sarınmak. Not: Zevaid'de şöyle denilmiştir: Aişe (r.anha)'nın hadisi sahih olup ravileri sika zatlardır. Ravi Sa'd bin Said, Yahya bin Said el-Ensari'nin kardeşidir. Müslim onun rivayetlni delil saymıştır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 3562,
      "arabicNumber": 3562,
      "book": 32,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ قَتَادَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ لِي يَا بُنَىَّ لَوْ شَهِدْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Burdah that his father said to him:“O my son, if only you could have seen us when we were with the Messenger of Allah (ﷺ), when rain fell on us; you would have thought that we smelled like sheep.”",
          "ur": "ابوبردہ اپنے والد ابوموسیٰ اشعری سے روایت کرتے ہیں کہ میرے والد نے مجھ سے کہا: میرے بیٹے! کاش تم ہم کو اس وقت دیکھتے جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، جب ہم پر آسمان سے بارش ہوتی تو تم خیال کرتے کہ ہماری بو بھیڑ کی بو جیسی ہے ۱؎۔",
          "fr": "Rapporté par Abu Burdah : Son père lui a dit : « Mon fils, si seulement tu nous avais vus avec le Messager d’Allah (ﷺ) quand la pluie tombait sur nous ; tu aurais pensé que nous sentions comme des moutons. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Al Hasan bin Musa] dari [Syaiban] dari [Qatadah] dari [Abu Burdah] dari [Ayahnya] dia berkata, \"Ayahku berkata kepadaku, \"Wahai anakku, sekiranya kamu menyaksikan saat kami bersama Rasulullah shallallahu 'alaihi wasallam ketika terkena angin, niscaya kamu akan mengira bahwa bau tubuh kami adalah bau domba",
          "tr": "Ebû Bürde (bin Ebî Mûsâ el-Eş'arî) (r.a.)'dan; Şöyle demiştir: Babam (Ebû Mûsâ el-Eş'arî bir gün) bana şöyle dedi: Ey oğulcuğum! Biz Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber iken, üzerimize yağmur yağdığı zaman eğer sen yanımızda olsaydın bizim (elbise) kokumuzu koyun kokusu zannederdin"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 3563,
      "arabicNumber": 3563,
      "book": 32,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ كَرَامَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَحْوَصُ بْنُ حَكِيمٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ذَاتَ يَوْمٍ وَعَلَيْهِ جُبَّةٌ رُومِيَّةٌ مِنْ صُوفٍ ضَيِّقَةُ الْكُمَّيْنِ فَصَلَّى بِنَا فِيهَا لَيْسَ عَلَيْهِ شَىْءٌ غَيْرُهَا ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Ubadah bin Samit said:“The Messenger of Allah (ﷺ) came out to us one day, wearing a Roman cloak of wool with narrow sleeves. He led us in prayer wearing that, and nothing else.”",
          "ur": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم اون کا بنا ہوا تنگ آستین والا رومی جبہ پہنے ہمارے پاس تشریف لائے، اور اسی میں ہمیں نماز پڑھائی، اس کے علاوہ آپ پر کوئی اور لباس نہ تھا۔",
          "fr": "Rapporté par ‘Ubadah bin Samit : « Un jour, le Messager d’Allah (ﷺ) est sorti vers nous, portant un manteau romain en laine à manches étroites. Il nous a dirigés dans la prière en portant seulement cela. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Utsman bin Karamah] Telah menceritakan kepada kami [Abu Usamah] Telah menceritakan kepada kami [Al Ahwash bin Hakim] dari [Khalid bin Ma'dan] dari ['Ubadah bin Ash Shamit] dia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam mendatangi kami, dan beliau mengenakan jubbah buatan romawi yang terbuat dari wool yang sempit kedua lengannya. Kemudian beliau mengimami kami dengan mengenakan baju itu tanpa ada sesuatu yang menempel padanya",
          "tr": "Ubâde bin es-Sâmit (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) kolları dar, yünden mamul bir Rûmî cübbeyi giymiş olarak bir gün (evden) yanımıza çıktı ve o cübbeyle bize namaz kıldırdı. Üzerinde o cübbeden başka (elbiseden) bir şey yoktu. Not: Zevaid'de şöyle denilmlştir: Ben derim ki: El-Hafız Ebu Naim; Halid'in Ubade'ye rastlamadığını ve ondan hadis işitmediğlni söylemiştir. Ebu Hatim de aynı şeyi söylemiştir. Ravi el-Ahvas da zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 3564,
      "arabicNumber": 3564,
      "book": 32,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، وَأَحْمَدُ بْنُ الأَزْهَرِ، قَالاَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ السِّمْطِ، حَدَّثَنِي الْوَضِينُ بْنُ عَطَاءٍ، عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ تَوَضَّأَ فَقَلَبَ جُبَّةَ صُوفٍ كَانَتْ عَلَيْهِ فَمَسَحَ بِهَا وَجْهَهُ ‏.‏",
        "translations": {
          "en": "It was narrated from Salman Farisi that the Messenger of Allah (ﷺ) performed ablution, then he turned his woolen cloak that he was wearing inside out and wiped his face with it",
          "ur": "سلمان فارسی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے وضو فرمایا، پھر اون والے جبہ کو جو آپ پہنے ہوئے تھے الٹ دیا، اور اس سے اپنا چہرہ پونچھا۔",
          "fr": "Rapporté par Salman Farisi : Le Messager d’Allah (ﷺ) a fait ses ablutions, puis il a retourné son manteau de laine qu’il portait et s’est essuyé le visage avec",
          "id": "Telah menceritakan kepada kami [Al 'Abbas bin Al Walid Ad Dimasyqi] dan [Ahmad bin Al Azhar] keduanya berkata; Telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Yazid bin As Simth] telah menceritakan kepadaku [Al Wadlin bin 'Atha] dari [Mahfudz bin 'Alqamah] dari [Salman Al Farisi], bahwa Rasulullah shallallahu 'alaihi wasallam berwudlu dengan membalikkan jubah wool yang di kenakannya, kemudian beliau membasuh mukanya",
          "tr": "Selmân-i Fârisî (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) bir defa) abdest almış ve sonra üstündeki yün cübbeyi çevirip onunla yüzünü kurulamıştır. Not: Zevaid'de şöyle denilmlştir: Blmun senedinde Mahfuz bin Alkams, Selman'dan rivayet etmiştir. Tehzib'u, belirtildiği gibi bu rivayetin mUrsel olduğu söylenmiştir. Senedin kalan rı\\vtlerl sıka., yani güvenilir zatlsrdır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 3565,
      "arabicNumber": 3565,
      "book": 32,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُوسَى بْنُ الْفَضْلِ، عَنْ شُعْبَةَ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسِمُ غَنَمًا فِي آذَانِهَا وَرَأَيْتُهُ مُتَّزِرًا بِكِسَاءٍ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas bin Malik said:“I saw the Messenger of Allah (ﷺ) marking sheep on their ears, and I saw him wearing a cloak around his wrist.”",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو بکریوں کے کانوں میں داغتے دیکھا، اور میں نے آپ کو چادر کا تہبند پہنے دیکھا۔",
          "fr": "Rapporté par Anas bin Malik : « J’ai vu le Messager d’Allah (ﷺ) marquer des moutons à l’oreille, et je l’ai vu porter un manteau autour du poignet. »",
          "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] Telah menceritakan kepada kami [Musa bin Al Fadl] dari [Syu'bah] dari [Hisyam bin Zaid] dari [Anas bin Malik] dia berkata, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam memberi tanda di telinga kambing dan saya melihat beliau mengenakan pakaian sarung",
          "tr": "Enes bin Mâlik (r.a.)'den; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i davar sürüsünün kulaklarını nişanlarken gördüm ve O'nu bir kisâ (dikilmiş elbise) yi bedeninin belden aşağı giymiş olarak gördüm"
        }
      },
      "grades": [
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 3566,
      "arabicNumber": 3566,
      "book": 32,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، عَنِ ابْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ خَيْرُ ثِيَابِكُمُ الْبَيَاضُ فَالْبَسُوهَا وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ) said:“The best of your garments are the white ones, so wear them and shroud your dead in them.”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارے بہترین کپڑے سفید کپڑے ہیں، لہٰذا انہیں کو پہنو اور اپنے مردوں کو انہیں میں کفناؤ ۔",
          "fr": "Rapporté par Ibn ‘Abbas : Le Messager d’Allah (ﷺ) a dit : « Les meilleurs de vos vêtements sont les blancs, alors portez-les et enveloppez vos morts dedans. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin As Shabah] Telah memberitakan kepada kami [Abdullah bin Raja Al Makki] dari [Ibnu Khutsaim] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik baju kalian adalah baju putih, maka pakailah oleh kalian (baju putih) dan kafanilah mayat kalian dengannya",
          "tr": "İbn-i Abbâs (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Elbisenizin en hayırlısı beyaz renkli olanıdır. Bu itibarla beyaz elbise giyiniz ve ölülerinizi beyaz renkli kefenle tekfin ediniz"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 3567,
      "arabicNumber": 3567,
      "book": 32,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ الْبَسُوا ثِيَابَ الْبَيَاضِ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Samurah bin Jundab that the Messenger of Allah (ﷺ) said:“Wear white garments, for they are purer and better.”",
          "ur": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سفید کپڑے پہنو کہ یہ زیادہ پاکیزہ اور عمدہ لباس ہیں ۔",
          "fr": "Rapporté par Samurah bin Jundab : Le Messager d’Allah (ﷺ) a dit : « Portez des vêtements blancs, car ils sont plus purs et meilleurs. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Habib bin Abu Tsabit] dari [Maimun bin Abu Syabib] dari [Samrah bin Jundab] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pakailah baju putih, karena sesungguhnya baju putih lebih suci dan lebih baik",
          "tr": "Semure bin Cündüb (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Elbisenin beyaz olanını giyiniz.Çünkü beyaz elbise daha temiz ve daha güzeldir.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 3568,
      "arabicNumber": 3568,
      "book": 32,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ الأَزْرَقُ، حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ أَبِي رَوَّادٍ، حَدَّثَنَا مَرْوَانُ بْنُ سَالِمٍ، عَنْ صَفْوَانَ بْنِ عَمْرٍو، عَنْ شُرَيْحِ بْنِ عُبَيْدٍ الْحَضْرَمِيِّ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ أَحْسَنَ مَا زُرْتُمُ اللَّهَ بِهِ فِي قُبُورِكُمْ وَمَسَاجِدِكُمُ الْبَيَاضُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Darda’ that the Messenger of Allah (ﷺ) said:“The best of that in which you visit Allah in your graves and your mosque is white (garments).”",
          "ur": "ابوالدرداء رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سب سے بہتر لباس جس کو پہن کر تم اپنی قبروں اور مسجدوں میں اللہ کی زیارت کرتے ہو، سفید لباس ہے ۔",
          "fr": "Rapporté par Abu Darda’ : Le Messager d’Allah (ﷺ) a dit : « Le meilleur vêtement pour visiter Allah dans vos tombes et à la mosquée est le blanc. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Hassan Al Azraq] telah menceritakan kepada kami [Abdul Majid bin Abu Rawwad] telah menceritakan kepada kami [Marwan bin Salim] dari [Shafwan bin 'Amru] dari [Syuraih bin 'Ubaid Al Hadlrami] dari [Abu Ad Darda] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik pakaian yang kalian kenakan untuk mengunjungi Allah di kuburan dan masjid kalian adalah pakaian putih",
          "tr": "Ebü'd-Derdâ (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kabirlerinizde ve mescidlerinizde Allah'ı ziyaret etmenize en güzel elbise —kefen— şüphesiz beyaz olanıdır.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi. zayıftır. çünkü Şurayh bin Ubeyd, Ebü Derda'dan hadis işitmemiştir. Bu durumu et-Tehzib yazarı bu kitabında açıklamıştır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Mawdu"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Mawdu"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 3569,
      "arabicNumber": 3569,
      "book": 32,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، جَمِيعًا عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ الَّذِي يَجُرُّ ثَوْبَهُ مِنَ الْخُيَلاَءِ لاَ يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Umar that the Messenger of Allah (ﷺ) said:“Whoever lets his garment drag out of pride, Allah will not look at him on the Day of Resurrection.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اپنے کپڑے فخر و غرور سے گھسیٹے گا، اللہ تعالیٰ ایسے شخص کی طرف قیامت کے دن نہیں دیکھے گا ۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) a dit : « Celui qui laisse traîner son vêtement par orgueil, Allah ne le regardera pas le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah]. (dalam riwayat lain disebutkan) telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Abdullah bin Numair] semuanya dari ['Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang memanjangkan kainnya dengan sombong, maka Allah tidak akan memandang kepadanya pada hari Kiamat",
          "tr": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «(Giydiği) elbiseyi kibirden dolayı (yerde) sürükleyen kimse'ye Allah kıyamet günü bakmaz (veya rahmet etmez).»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 3570,
      "arabicNumber": 3570,
      "book": 32,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ جَرَّ إِزَارَهُ مِنَ الْخُيَلاَءِ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ فَلَقِيتُ ابْنَ عُمَرَ بِالْبَلاَطِ فَذَكَرْتُ لَهُ حَدِيثَ أَبِي سَعِيدٍ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ وَأَشَارَ إِلَى أُذُنَيْهِ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Atiyyah, that Abu Sa’eed said:“The Messenger of Allah (ﷺ) said: ‘Whoever lets his lower wrap drag out of pride, Allah will not look at him on the Day of Resurrection.” He ( ‘Atiyyah) said \"I met Ibn 'Umar in Al-Balaat so I mentioned Abu Sa'eed's hadith from the Prophet (ﷺ). So he said and pointed to his ears 'My two ears heard it, and my heart preserved it",
          "ur": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے غرور و تکبر سے اپنا تہبند گھسیٹا، اللہ تعالیٰ ایسے شخص کی طرف قیامت کے روز نہیں دیکھے گا ۔ عطیہ کہتے ہیں کہ مقام بلاط میں میری ملاقات ابن عمر رضی اللہ عنہما سے ہوئی تو میں نے ان سے ابوسعید رضی اللہ عنہ کی یہ حدیث بیان کی جو انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی، تو ابن عمر رضی اللہ عنہما نے اپنے کانوں کی طرف اشارہ کر کے کہا: اسے میرے کانوں نے بھی سنا ہے، اور میرے دل نے اسے محفوظ رکھا ہے۔",
          "fr": "Rapporté par ‘Atiyyah, d’après Abu Sa’eed : Le Messager d’Allah (ﷺ) a dit : « Celui qui laisse traîner son pagne par orgueil, Allah ne le regardera pas le Jour de la Résurrection. » (‘Atiyyah dit : « J’ai rencontré Ibn ‘Umar à Al-Balaat et je lui ai parlé du hadith d’Abu Sa’eed venant du Prophète (ﷺ). Il a alors dit, en montrant ses oreilles : “Mes deux oreilles l’ont entendu, et mon cœur l’a retenu.” »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari ['Athiyah] dari [Abu Sa'id] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memanjangkan kainnya dengan sombong, niscaya Allah tidak akan memandangnya pada hari Kiamat.\" 'Athiyah berkata, \"Lalu aku bertemu dengan [Ibnu Umar] di Balath, kemudian aku menyebutkan hadits yang di riwayatkan oleh Abu Sa'id dari Nabi shallallahu 'alaihi wasallam tersebut, maka sambil memberi isyarat ke telinganya, Ibnu Umar berkata, \"Kedua telingaku telah mendengarnya dan hatiku juga telah meyakininya",
          "tr": "Ebû Saîd-i Hudrî (r.a.)'den rivayet edildiğine göre ; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim izârını kibir'den dolayı (yerde) sürûklerse Allah ona kıyamet günü bakmaz (veya rahmet etmez).» Not: Zevaid'de şöyle denilmiştir: İbn-i Ömer (r.a.)'ın hadisi Buharİ ve Müslim'de mevcuttur (yani müellifimizin 3569. hadisi), Lakin Ebi Said (r.a.)'ın hadisini yalnız İbn-i Maceh rivı\\yet etmiştir. Bunun senedinde Atiyye bin Sa'd el-Avfi Ebu'I-Hasan bulunur. Bu ravi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 3571,
      "arabicNumber": 3571,
      "book": 32,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَرَّ بِأَبِي هُرَيْرَةَ فَتًى مِنْ قُرَيْشٍ يَجُرُّ سَبَلَهُ فَقَالَ يَا ابْنَ أَخِي إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ مَنْ جَرَّ ثَوْبَهُ مِنَ الْخُيَلاَءِ لَمْ يَنْظُرِ اللَّهُ له يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that a young man of Quriash passed by Abu Hurairah with his cloak dragging. He said:“O my nephew! I heard the Messenger of Allah (ﷺ) saying ‘Whoever let his garment drag out of pride, Allah will not look at him on the Day of Resurrection.’”",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ان کے پاس سے قریش کا ایک جوان اپنی چادر لٹکائے ہوئے گزرا، آپ نے اس سے کہا: میرے بھتیجے! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جس نے غرور و تکبر سے اپنے کپڑے گھسیٹے اللہ تعالیٰ قیامت کے دن اس کی طرف نہیں دیکھے گا ۔",
          "fr": "Rapporté par Abu Hurairah : Un jeune homme de Quraïsh est passé devant lui avec son manteau qui traînait. Il lui dit : « Ô mon neveu ! J’ai entendu le Messager d’Allah (ﷺ) dire : “Celui qui laisse traîner son vêtement par orgueil, Allah ne le regardera pas le Jour de la Résurrection.” »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Muhammad bin Bisyr] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata, \"Seorang pemuda Quraisy yang pakaiannya melebihi mata kaki lewat di hadapan Abu Hurairah, lalu ia pun menegurnya seraya mengatakan, \"Wahai anak pamanku, sesungguhnya saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memanjangkan kainnya dengan sombong, niscaya Allah tidak akan memandangnya pada hari Kiamat kelak",
          "tr": "Ebü Hureyre (r.a.)'den rivayet edildiğine göre: Kureyş'ten bir genç topuklarından aşağıya sarkık (vaziyette giydiği) elbisesini (yerde) sürükleyerek Ebû Hureyre'nin yanından geçti. Bunun üzerine Ebû Hureyre: Ey kardeşimin oğlu, ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şu hadîsi buyururken işittim: «Kim kibir'den dolayı elbisesini (yerde) sürûklerse Allah ona kıyamet günü bakmaz (veya rahmet etmez).»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 3572,
      "arabicNumber": 3572,
      "book": 32,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ مُسْلِمِ بْنِ نُذَيْرٍ، عَنْ حُذَيْفَةَ، قَالَ أَخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِأَسْفَلِ عَضَلَةِ سَاقِي أَوْ سَاقِهِ فَقَالَ ‏ \"‏ هَذَا مَوْضِعُ الإِزَارِ فَإِنْ أَبَيْتَ ‏.‏ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَلاَ حَقَّ لِلإِزَارِ فِي الْكَعْبَيْنِ ‏\"‏ ‏.‏ حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنِي أَبُو إِسْحَاقَ، عَنْ مُسْلِمِ بْنِ نُذَيْرٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "It was narrated that Hudhaifah said:“The Messenger of Allah (ﷺ) took hold of the lower part of my calf or his calf and said: ‘This is where the lower wrap should come to. If you insist, then lower, and if you insist, then lower, but the lower wrap has no right to (come to) the ankle.’”",
          "ur": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے میری پنڈلی کے نیچے کا پٹھا پکڑا اور فرمایا: تہبند کا مقام یہ ہے، اگر تم اتنا نہ کر سکو تو اس سے تھوڑا نیچے رکھو، اور اگر اتنا بھی نہ رکھ سکو تو اور نیچے رکھو، لیکن اگر اتنا بھی نہ کر سکو تو تمہیں ٹخنوں سے نیچے تہبند رکھنے کا کوئی حق نہیں ہے ۔",
          "fr": "Rapporté par Hudhaifah : Le Messager d’Allah (ﷺ) a pris le bas de mon mollet ou du sien et a dit : « C’est là que le pagne doit arriver. Si tu insistes, alors un peu plus bas, et si tu insistes encore, alors plus bas, mais le pagne n’a pas le droit d’aller jusqu’à la cheville. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Muslim bin Nudzair] dari [Hudzaifah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memegang bagian bawah kedua betisku -atau kedua betisnya- kemudian bersabda: \"Sampai di sinilah batas kain sarung, apabila kamu enggan maka rendahkanlah (sedikit ke bawah), jika kamu masih enggan maka lebih rendahkanlah lagi, dan jika kamu masih enggan, maka tidak ada hak bagi kain sarung untuk (melebihi) kedua mata kaki.\" Telah menceritakan kepada kami [Ali bin Muhammad] Telah menceritakan kepada kami [Sufyan bin 'Uyainah] Telah menceritakan kepadaku [Abu Ishaq] dari [Muslim bin Nudzair] dari [Hudzaifah] dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Huzeyfe (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) benim baldırımın veya onun baldırının adalesi (yâni çok etli kaba kısmı) nın aşağısını tutarak: İzârın yeri (yâni uzatılacağı yer) burasıdır. Eğer (bundan imtina) edersen (yâni daha da uzatmak istersen) bunun aşağısına in, şayet (bundan) imtina edersen onun da aşağısına in. Eğer (bu kadardan) imtina edersen (yâni daha da uzatmak istersen), İzârın topuklarda hakkı yoktur (yâni izar topukları örtmemelidir). Huzeyfe'nin. Nebi (Sallallahu Aleyhi ve Sellem)'den rivayet ettiği bu hadîsin mislini ... senediyle Ali bin Muhammed bize rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 3573,
      "arabicNumber": 3573,
      "book": 32,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، قَالَ قُلْتُ لأَبِي سَعِيدٍ هَلْ سَمِعْتَ مِنْ، رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَيْئًا فِي الإِزَارِ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لاَ جُنَاحَ عَلَيْهِ مَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ وَمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ فِي النَّارِ ‏\"‏ ‏.‏ يَقُولُ ثَلاَثًا ‏\"‏ لاَ يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Ala bin ‘Abdur-Rahman that his father said:“I said to Abu Sa’eed: ‘Did you hear anything from the Messenger of Allah (ﷺ) concerning the lower wrap?’ He said: ‘Yes. I heard the Messenger of Allah (ﷺ) say: ‘The lower wrap of the believer should come to mid-calf, but there is no sin on him if it comes between that point and the ankle. But whatever is lower than the ankle is in the Fire.’ And he said three times: ‘Allah will not look at the one who lets his lower wrap drag out of vanity.’”",
          "ur": "عبدالرحمٰن کہتے ہیں کہ میں نے ابو سعید خدری رضی اللہ عنہ سے کہا: کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے تہبند کے بارے میں کچھ سنا ہے؟ فرمایا: ہاں، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: مومن کا تہبند اس کی آدھی پنڈلی تک ہوتا ہے، اور اگر وہ اس کے اور ٹخنوں کے درمیان کسی بھی جگہ تک رکھے تو بھی کوئی حرج نہیں، لیکن جو ٹخنوں سے نیچے ہو وہ حصہ جہنم میں ہو گا، اور آپ صلی اللہ علیہ وسلم نے تین بار فرمایا: اللہ تعالیٰ اس کی طرف نہیں دیکھے گا جو اپنا تہبند تکبر کی وجہ سے گھسیٹے ۔",
          "fr": "Rapporté par ‘Ala bin ‘Abdur-Rahman, d’après son père : J’ai demandé à Abu Sa’eed : « As-tu entendu quelque chose du Messager d’Allah (ﷺ) à propos du pagne ? » Il répondit : « Oui. J’ai entendu le Messager d’Allah (ﷺ) dire : “Le pagne du croyant doit arriver au milieu du mollet, mais il n’y a pas de péché s’il est entre ce point et la cheville. Mais ce qui est en dessous de la cheville est dans le Feu.” » Et il a dit trois fois : « Allah ne regardera pas celui qui laisse traîner son pagne par vanité. »",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Al 'Ala bin Abdurrahman] dari [Ayahnya] dia berkata, \"Saya berkata kepada [Abu Sa'id], \"Apakah kamu pernah mendengar sesuatu dari Rasulullah shallallahu 'alaihi wasallam mengenai kain sarung?\" dia menjawab, \"Ya. Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kain sarung seorang mukmin itu hingga (menutupi) kedua betisnya, dan tidak ada larangan baginya antara betis tersebut hingga kedua mata kaki, sedangkan yang melebihi mata kaki maka tempatnya di dalam neraka.\" Beliau mengatakannya hingga tiga kali, (kemudian bersabda): \"Allah tidak akan memandang seseorang yang memanjangkan kain sarungnya dengan sombong",
          "tr": "El-Ala bin Abdirrahman'ın babası (Abdurrahmân bin Yâkûb el-Cühenî) (r.a.)'den; Şöyle demiştir: Ben, Ebu Saîd(-i Hudri) (r.a.)'a: Sen izar hakkında Resulullah (Sallallahu Aleyhi ve Sellem)'den bir şey işittin mi? diye sordum. Ebû Said: Evet. Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken işittim: «Mu'minin izârının uzunluğu baldırlarının ortalarına Kadardır. Bununla topuklar arasında olan izâr de ona günah yoktur. Topuklardan aşağı olan ateştedir. O üç kez şöyle buyurdu: Allah (giydiği), izârını kibirlenerek (yerde) sürükleyen kimseye bakmaz.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 3574,
      "arabicNumber": 3574,
      "book": 32,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شَرِيكٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ حُصَيْنِ بْنِ قَبِيصَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ يَا سُفْيَانَ بْنَ سَهْلٍ لاَ تُسْبِلْ فَإِنَّ اللَّهَ لاَ يُحِبُّ الْمُسْبِلِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Mughirah bin Shu’bah that the Messenger of Allah (ﷺ) said:“O Sufyan bin Sahl, do not let your garment hang, for Allah does not like those who let their garments hang below the ankles.’”",
          "ur": "مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سفیان بن سہل! ( ٹخنہ کے نیچے ) تہبند نہ لٹکاؤ کہ اللہ تعالیٰ تہبند لٹکانے والوں کو پسند نہیں کرتا ۔",
          "fr": "Rapporté par Mughirah bin Shu’bah : Le Messager d’Allah (ﷺ) a dit : « Ô Sufyan bin Sahl, ne laisse pas ton vêtement traîner, car Allah n’aime pas ceux qui laissent leurs vêtements descendre sous les chevilles. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] Telah menceritakan kepada kami [Yazid bin Harun] telah memberitakan kepada kami [Syarik] dari [Abdul Malik bin 'Umair] dari [Hushain bin Qabishah] dari [Al Mughirah bin Syu'bah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Sufyan bin Sahl, janganlah kamu memanjangkan kain sarung atau celana melebihi mata kaki, karena Allah membenci orang-orang yang memanjangkan kain sarung atau celananya melebihi mata kaki",
          "tr": "El-Müğîre bin Şu'be (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yâ Süfyân bin Sehl İzârını (topuklardan aşağıya) sarkıtma. Çünkü Allah İzârını (topuklardan aşağıya) şarkıtanları kesinlikle sevmez.»\" Not: Zevaid'de şöyle den!lmiştir: Bunun senodi sahlh olup ravileri güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 3575,
      "arabicNumber": 3575,
      "book": 32,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا أَبُو تُمَيْلَةَ، عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أُمِّهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ لَمْ يَكُنْ ثَوْبٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنَ الْقَمِيصِ ‏.‏",
        "translations": {
          "en": "It was narrated that Umm Salamah said:There was no garment more beloved to the Messenger of Allah (ﷺ) than the shirt.”",
          "ur": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کو کرتے ( قمیص ) سے بڑھ کر کوئی لباس محبوب اور پسندیدہ نہ تھا ۱؎۔",
          "fr": "Rapporté par Umm Salamah : « Le vêtement préféré du Messager d’Allah (ﷺ) était la chemise. »",
          "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim Ad Dauraqi] telah menceritakan kepada kami [Abu Tumailah] dari [Abdul Mukmin bin Khalid] dari [Ibnu Buraidah] dari [Ibunya] dari [Ummu Salamah] dia berkata, \"Tidak ada pakaian yang lebih dicintai oleh Rasulullah shallallahu 'alaihi wasallam selain gamis",
          "tr": "Ümmü Seleme (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'e kamîs (uzun gömlek) ten daha sevimli bir libas olmadı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 3576,
      "arabicNumber": 3576,
      "book": 32,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنِ ابْنِ أَبِي رَوَّادٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ الإِسْبَالُ فِي الإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ شَيْئًا خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ مَا أَغْرَبَهُ ‏.‏",
        "translations": {
          "en": "It was narrated from Salim, from his father, that the Prophet (ﷺ) said:“Hanging down may apply to the waist wrap, shirt or turban. Whoever lets any of these drag out of pride, Allah will not look at him on the Day of Resurrection.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «اسبال»: تہبند، کرتے ( قمیص ) اور عمامہ ( پگڑی ) میں ہوتا ہے جو اسے محض تکبر اور غرور کے سبب گھسیٹے تو اللہ تعالیٰ ایسے شخص کی طرف قیامت کے روز نہیں دیکھے گا ۱؎۔ ابوبکر بن ابی شیبہ کہتے ہیں کہ یہ کتنی غریب روایت ہے",
          "fr": "Rapporté par Salim, d’après son père : Le Prophète (ﷺ) a dit : « Le fait de laisser traîner concerne le pagne, la chemise ou le turban. Celui qui laisse l’un de ces vêtements traîner par orgueil, Allah ne le regardera pas le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Al Husain bin Ali] dari [Ibnu Abu Rawwad] dari [Salim] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Isbal itu terdapat juga pada kain sarung (celana), pakaian (gamis) dan surban. Barangsiapa memanjangkan sesuatu (seperti tadi) dengan sombong, niscaya Allah tidak akan melihat kepadanya pada hari Kiamat kelak.\" Abu Bakar berkata; \"Husain bin Ali tidak menganggap asing hadits di atas",
          "tr": "Sâlim'in babası (Abdullah bin Ömer) (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Îsbâl (yâni yasak olan elbise sarkıtma - uzatma işi) izâr (yâni bedenin belden aşağısını örten elbise) de, kamîs (uzun gömlek-entari) de ve sarıktadır. Kim (giydiği elbiseden) bir şeyi kibirlenerek sürüklerse Allah kıyamet günü ona bakmaz.» (Müellifin şeyhi) Ebû Bekir (bin Ebî Şeybe) demiştir ki t Ben (râvi) İbn-i Ebî Revvâd'ı tanımam"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 3577,
      "arabicNumber": 3577,
      "book": 32,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِيُّ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنَا حَسَنُ بْنُ صَالِحٍ، ح وَحَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبِي، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ مُسْلِمٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَلْبَسُ قَمِيصًا قَصِيرَ الْيَدَيْنِ وَالطُّولِ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Abbas said:“The Messenger of Allah (ﷺ) used to wear a shirt that was short in the sleeves and length.”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایسی قمیص پہنتے جس کی آستین چھوٹی اور لمبائی بھی کم ہوتی تھی۔",
          "fr": "Rapporté par Ibn ‘Abbas : « Le Messager d’Allah (ﷺ) portait une chemise courte aux manches et à la longueur. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Utsman bin Hakim Al Audi] telah menceritakan kepada kami [Abu Ghassan] dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami ['Ubaid bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Al Hasan bin Shalih]. (dalam riwayat lain disebutkan) Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [Ayahku] dari [Al Hasan bin Shalih] dari [Muslim] dari [Mujahid] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam selalu mengenakan gamis yang kedua lengannya pendek dan panjang",
          "tr": "İbn-i Abbâs (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), kolları ve boyu kısa kamis (gömlek - entari) giyerdi. Not: Zevâid'de şöyle denilmiştir: Bunun senedinde Müslim bin Keysân el-Kufl bulunur. Bu râvinin zayıflığı üzerinde ittifak edilmiştir. Senedin durumunun dönüm noktası bu râvl Üzerindedir. El-Bezzâr bu hadisi Enes (R.A.)'den rivayet etmiştir. Mamafih, Esma blnt-i es-Seken'in hadîsi bu hadisi teyid eder. Esmâ'nın hadisini Tirmizl rivayet ederek hasen olduğunu söylemiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 3578,
      "arabicNumber": 3578,
      "book": 32,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا ابْنُ دُكَيْنٍ، عَنْ زُهَيْرٍ، عَنْ عُرْوَةَ بْنِ عَبْدِ اللَّهِ بْنِ قُشَيْرٍ، حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَبَايَعْتُهُ وَإِنَّ زِرَّ قَمِيصِهِ لَمُطْلَقٌ ‏.‏ قَالَ عُرْوَةُ فَمَا رَأَيْتُ مُعَاوِيَةَ وَلاَ ابْنَهُ فِي شِتَاءٍ وَلاَ صَيْفٍ إِلاَّ مُطْلَقَةً أَزْرَارُهُمَا ‏.‏",
        "translations": {
          "en": "Mu’awiyah bin Qurrah narrated that his father said:“I came to the Messenger of Allah (ﷺ) and gave him my pledge, and the buttons of his shirt were undone.”",
          "ur": "قرہ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے بیعت کی، اس وقت آپ کے کرتے کی گھنڈیاں کھلی ہوئی تھیں، عروہ کہتے ہیں کہ میں نے معاویہ رضی اللہ عنہ اور ان کے بیٹے کو خواہ سردی ہو یا گرمی ہمیشہ اپنی گھنڈیاں ( بٹن ) کھولے دیکھا ۱؎۔",
          "fr": "Rapporté par Mu’awiyah bin Qurrah, d’après son père : « Je suis allé voir le Messager d’Allah (ﷺ) et je lui ai prêté allégeance, et les boutons de sa chemise étaient défaits. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Ibnu Dukain] dari [Zuhair] dari ['Urwah bin Abdullah bin Qusyair] telah menceritakan kepadaku [Mu'awiyah bin Qurrah] dari [Ayahnya] dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam lalu berbai'at kepadanya, dan sungguh kancing gamis beliau terbuka.\" 'Urwah berkata, \"Aku tidak pernah melihat Mu'awiyah maupun anaknya baik di musim dingin maupun panas kecuali kancing-kancing bajunya terbuka",
          "tr": "Kurre (bin Eyâs el-Müzenî) (r.a.)'den; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına vararak O'na bey'at ettim. O esnada O'nun gömleğinin düğmesi çözük (yâni iliksiz) idi. Urve demiştir ki: Ben bundan dolayı Muâviye'yi ve oğlunu kış ve yaz (mevsimlerin) de dâima (gömlek) düğmeleri çözük olarak gördüm"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 3579,
      "arabicNumber": 3579,
      "book": 32,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، وَعَبْدُ الرَّحْمَنِ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سُوَيْدِ بْنِ قَيْسٍ، قَالَ أَتَانَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَسَاوَمَنَا سَرَاوِيلَ ‏.‏",
        "translations": {
          "en": "It was narrated that Suwaid bin Qais said:“The Prophet (ﷺ) came to us and haggled with us over the price of trousers.”",
          "ur": "سوید بن قیس رضی اللہ عنہ کہتے ہیں کہ ہمارے پاس نبی اکرم صلی اللہ علیہ وسلم تشریف لائے تو آپ نے ہم سے پاجامے کا مول بھاؤ ( سودا ) کیا۔",
          "fr": "Rapporté par Suwaid bin Qais : Le Prophète (ﷺ) est venu vers nous et a négocié avec nous le prix de pantalons",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki']. (dalam riwayat lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya] dan [Abdurrahman] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Simak bin Harb] dari [Suwaid bin Qais] dia berkata, \"Nabi shallallahu 'alaihi wasallam menemui kami dan menawarkan celana panjang kepada kami",
          "tr": "Suveyd bin Kays (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) (Minâ'da elbise sattığımız esnada) yanımıza geldi ve bir uzun iç don pazarlık ederek Maden satın aldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 3580,
      "arabicNumber": 3580,
      "book": 32,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ كَمْ تَجُرُّ الْمَرْأَةُ مِنْ ذَيْلِهَا قَالَ ‏\"‏ شِبْرًا ‏\"‏ ‏.‏ قُلْتُ إِذًا يَنْكَشِفَ عَنْهَا ‏.‏ قَالَ ذِرَاعٌ لاَ تَزِيدُ عَلَيْهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Umm Salamah said:“The Messenger of Allah (ﷺ) was asked about how long a woman’s hem should hang down. He said: ‘A hand span.’ I said: ‘But then (her legs and feet) will be uncovered.’ He said: ‘Then a forearm’s length, but no more than that.’”",
          "ur": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا گیا: عورت اپنے کپڑے کا دامن کتنا لٹکا سکتی ہے؟ فرمایا: ایک بالشت میں نے عرض کیا: اتنے میں تو پاؤں کھل جائے گا، تو فرمایا: ایک ہاتھ، اس سے زیادہ نہیں ۔",
          "fr": "Rapporté par Umm Salamah : On a demandé au Messager d’Allah (ﷺ) jusqu’où une femme devait laisser traîner le bas de sa robe. Il a répondu : « Une largeur de main. » J’ai dit : « Mais alors (ses jambes et ses pieds) seront découverts. » Il a dit : « Alors une longueur d’avant-bras, mais pas plus. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] dari ['Ubaidillah bin Umar] dari [Nafi'] dari [Sulaiman bin Yasar] dari [Ummu Salamah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam di tanya, \"Berapakah seharusnya seorang wanita memanjangkan kainnya?\" beliau menjawab: \"Satu jengkal.\" Aku berkata, \"Jika demikian, maka masih memungkinkan untuk tersingkap.\" Maka beliau bersabda: \"(Lebihkanlah) satu hasta, dan jangan sampai lebih dari itu",
          "tr": "Ümraü Seleme (r.a.)'dan; Şöyle demi§tir: Resulullah (Sallallahu Aleyhi ve Sellem)'e: Kadın, eteğinden ne kadarını (erkeğin eteğinden fazla) sarkıtır? diye soruldu. O: «Bir karış» buyurdu. Ben: O zaman (kadın yürüdüğünde) bedeninin bir kısmı (ayağı) açılır, dedim. O: «Bir zir'a (uzatılabilir). Kadın bundan fazla yapamaz» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 3581,
      "arabicNumber": 3581,
      "book": 32,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ زَيْدٍ الْعَمِّيِّ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنِ ابْنِ عُمَرَ، أَنَّ أَزْوَاجَ النَّبِيِّ، ـ صلى الله عليه وسلم ـ رُخِّصَ لَهُنَّ فِي الذَّيْلِ ذِرَاعًا فَكُنَّ يَأْتِيَنَّا فَنَذْرَعُ لَهُنَّ بِالْقَصَبِ ذِرَاعًا ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Umar:“The wives of the Prophet (ﷺ) were allowed to let their hems hang down, so they used to come to us and we would measure one forearms length for them with a reed.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کی ازواج مطہرات رضی اللہ عنہن کو کپڑوں کے دامن ایک ہاتھ لٹکانے کی اجازت تھی، چنانچہ جب وہ ہمارے پاس آتیں تو ہم ان کے لیے لکڑی سے ایک ہاتھ کا ناپ بنا کر دیتے۔",
          "fr": "Rapporté par Ibn ‘Umar : Les épouses du Prophète (ﷺ) avaient la permission de laisser traîner le bas de leurs robes, alors elles venaient vers nous et nous mesurions une longueur d’avant-bras pour elles avec un roseau",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Zaid Al 'Ammi] dari [Abu Ash Shiddiq An Naji] dari [Ibnu Umar], bahwa isteri-isteri Nabi shallallahu 'alaihi wasallam diberi keringanan untuk melebihkan kain baju bagian bawah (jubahnya) satu hasta. Saat mereka mendatangi kami, maka kami pun mengukurnya dengan kayu dan ternyata panjangnya sehasta",
          "tr": "İbn-i Ömer (r.a.)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in zevceleri için eteklerini bir zira (fazla) sarkıtmalarına izin verildi. Artık onlar bize gelirlerdi. Biz de onlar için kamışla bir zira ölçerdik"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 3582,
      "arabicNumber": 3582,
      "book": 32,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ لِفَاطِمَةَ أَوْ لأُمِّ سَلَمَةَ ‏ \"‏ ذَيْلُكِ ذِرَاعٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said to Fatimah, or to Umm Salamah:“Let your hem down one forearm’s length.”",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فاطمہ یا ام سلمہ رضی اللہ عنہا سے فرمایا: اپنے کپڑے کا دامن ایک ہاتھ کا رکھو ۔",
          "fr": "Rapporté par Abu Hurairah : Le Prophète (ﷺ) a dit à Fatimah, ou à Umm Salamah : « Laisse descendre le bas de ta robe d’une longueur d’avant-bras. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Al Muhazzim] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada Fatimah dan Ummu Salamah: \"Panjang kainmu bagian bawah adalah satu hasta",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) Fâtime'ye veya Ümmü Seleme'ye: Senin eteğin bir ziradır,» buyurmuştur. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Ebü'l-Mühezzim bulunur. Bu ravinin zayıflığı üzerinde ittifak edilmiştir. Adı da Yezid bin Süfyan'dır. Aduun Abdurrahman olduğu da söylenmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Very Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 3583,
      "arabicNumber": 3583,
      "book": 32,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ فِي ذُيُولِ النِّسَاءِ ‏\"‏ شِبْرًا ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ إِذًا تَخْرُجَ سُوقُهُنَّ ‏.‏ قَالَ ‏\"‏ فَذِرَاعٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Aishah that the Prophet (ﷺ) said, concerning how long a woman’s hem should hang down:“A hand span.” ‘Aishah said: “This may show her calves.” He said: “Then a forearm’s length.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے عورتوں کے دامن کے سلسلے میں فرمایا: ایک بالشت کا ہو ام المؤمنین عائشہ رضی اللہ عنہا نے عرض کیا کہ اتنے میں تو پنڈلی کھل جائے گی؟ فرمایا: تو پھر ایک ہاتھ ہو ۔",
          "fr": "Rapporté par ‘Aishah : Le Prophète (ﷺ), à propos de la longueur du bas de la robe d’une femme, a dit : « Une largeur de main. » ‘Aishah a dit : « Cela pourrait montrer ses mollets. » Il a dit : « Alors une longueur d’avant-bras. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Habib Al Mu'allim] dari [Abu Al Muhazzim] dari [Abu Hurairah] dari [Aisyah], bahwa Nabi shallallahu 'alaihi wasallam bersabda mengenai kain (jubah bagian) bawah para wanita, yaitu di lebihkan satu jengkal.\" Aisyah berkata, \"Saya berkata, \"Kalau begitu betis mereka masih terlihat! \" Beliau bersabda: \"Jika seperti itu, tambahlah satu hasta",
          "tr": "Ai§e (r.anha)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) kadınların etekleri hakkında: «(Erkeklerinkinden) bir karış (fazla sarkıtsınlar)» buyurdu. Bunun üzerine Âişe (r.anha): O zaman (kadınlar yürürken) baldırları (açığa) çıkar, dedi. O: «Şu halde bir zira (yeter),» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Ebü'l-Mühezzim bulunur. Bu ra.vinin durumu bıuıdan önceki hadisin notunda geçti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Very Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 3584,
      "arabicNumber": 3584,
      "book": 32,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَخْطُبُ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
        "translations": {
          "en": "It was narrated from Ja’far bin ‘Amr bin Huraith that his father said:“I saw the Prophet (ﷺ) delivering a sermon on the pulpit, wearing a black turban.”",
          "ur": "عمرو بن حریث رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو منبر پر خطبہ دیتے دیکھا، آپ کے سر پر کالی پگڑی تھی۔",
          "fr": "Rapporté par Ja’far bin ‘Amr bin Huraith : Son père a dit : « J’ai vu le Prophète (ﷺ) faire un sermon sur la chaire, portant un turban noir. »",
          "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Sufyan bin 'Uyaianh] dari [Musawir Al Warraq] dari [Ja'far bin 'Amru bin Huraits] dari [Ayahnya] dia berkata, \"Saya melihat Nabi shallallahu 'alaihi wasallam khutbah di atas minbar dengan mengenakan surban berwarna hitam",
          "tr": "Amr bin Hureys (r.a.)den; Şöyle demiştir: Ben, Nebi (Sallallahu Aleyhi ve Sellem)'i minber üzerinde hutbe okurken ve başında siyah bir sarık varken gördüm"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 3585,
      "arabicNumber": 3585,
      "book": 32,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
        "translations": {
          "en": "It was narrated from Jabir that the Prophet (ﷺ) entered Makkah wearing a black turban",
          "ur": "جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب مکہ میں ( فتح کے دن ) داخل ہوئے، تو آپ کے سر پر کالی پگڑی تھی۔",
          "fr": "Rapporté par Jabir : Le Prophète (ﷺ) est entré à La Mecque en portant un turban noir",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Az Zubair] dari [Jabir], bahwa Nabi shallallahu 'alaihi wasallam memasuki kota Makkah dengan mengenakan surban berwarna hitam",
          "tr": "Câbir (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) (fetih yılı) başında siyah bir sarık olduğu halde Mekke'ye girdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 3586,
      "arabicNumber": 3586,
      "book": 32,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا مُوسَى بْنُ عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Umar that the Prophet (ﷺ) entered (Makkah), on the Day of the Conquest of Makkah, wearing a black turban",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فتح مکہ کے دن مکہ میں داخل ہوئے، آپ کے سر پر کالی پگڑی تھی۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Prophète (ﷺ) est entré (à La Mecque), le jour de la conquête de La Mecque, en portant un turban noir",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Ubaidullah] telah memberitakan kepada kami [Musa bin 'Ubaidah] dari [Abdullah bin Dinar] dari [Ibnu Umar], bahwa ketika penaklukan kota Makkah, Rasulullah shallallahu 'alaihi wasallam masuk kota dengan mengenakan imamah (surban) berwarna hitam",
          "tr": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) Mekke'nin fetih günü başında siyah bir sarık olduğu halde (Mekke'ye) girdi. Not: Zevaid'de şöyle denilmiştir: Bu hadisin ravisi Musa bin Ubeyde er-Ribzi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 3587,
      "arabicNumber": 3587,
      "book": 32,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مُسَاوِرٍ، حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ ‏.‏",
        "translations": {
          "en": "Ja’far bin ‘Amr bin Huraith narrated that his father said:“It is as if I can see the Messenger of Allah (ﷺ), wearing a black turban, with the ends hanging down his shoulders.”",
          "ur": "عمرو بن حریث رضی اللہ عنہ کہتے ہیں کہ گویا میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہوں، اور آ پ کے سر پر کالی پگڑی ہے جس کے دونوں کناروں کو آپ اپنے دونوں شانوں کے درمیان لٹکائے ہوئے ہیں",
          "fr": "Rapporté par Ja’far bin ‘Amr bin Huraith : Son père a dit : « C’est comme si je voyais encore le Messager d’Allah (ﷺ), portant un turban noir, dont les extrémités pendaient sur ses épaules. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Musawir] telah menceritakan kepadaku [Ja'far bin 'Amru bin Huraits] dari [Ayahnya] dia berkata, \"Seakan aku melihat Rasulullah shallallahu 'alaihi wasallam mengenakan surban hitam yang kedua ujungnya dibiarkan menjuntai antara kedua pundak beliau",
          "tr": "Amr bin Hureys (r.a.)'den; Şöyle söylemiştir; Resulullah (Sallallahu Aleyhi ve Sellem), başında siyah bir sarık ve sarığın uçlarını omuzları arasına sarkıtmış vaziyette gözlerimin önündedir, sanki O'na bakıyorum"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 3588,
      "arabicNumber": 3588,
      "book": 32,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:“Whoever wears silk in this world will not wear it in the Hereafter.”",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس آدمی نے دنیا میں ریشمی کپڑا پہنا، وہ آخرت میں نہیں پہن سکے گا ۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) a dit : « Celui qui porte de la soie dans ce monde n’en portera pas dans l’au-delà. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakai kain sutera di dunia, maka ia tidak akan memakainya di Akhirat kelak",
          "tr": "Enes bfn Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim dünyada ipek giyerse âhirette onu giyemez.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 3589,
      "arabicNumber": 3589,
      "book": 32,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، عَنِ الْبَرَاءِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الدِّيبَاجِ وَالْحَرِيرِ وَالإِسْتَبْرَقِ ‏.‏",
        "translations": {
          "en": "It was narrated that Bara’ bin ‘Azib said:“The Messenger of Allah (ﷺ) forbade brocade, silk, and embroidered brocade.”",
          "ur": "براء رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ( مردوں کے لیے ) دیباج، حریر اور استبرق ( موٹا ریشمی کپڑا ) پہننے سے منع کیا ۱؎۔",
          "fr": "Rapporté par Bara’ bin ‘Azib : Le Messager d’Allah (ﷺ) a interdit le brocart, la soie et le brocart brodé",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Asy Syaibani] dari [Asy'ats bin Abu Asy Sya'tsa`] dari [Mu'awiyah bin Suwaid] dari [Al Barra`] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengenakan pakaian dibaj (kain bersulam sutera), kain sutera murni dan istabraq (pakaian tebal yang bercampur sutera)",
          "tr": "Berâ' (bin A'zİb) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) (argaç ve erişi ipek olan) atlas, ipek ve (argaç ve erişi ipek olan) kalın atlası yasaklamıştır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 3590,
      "arabicNumber": 3590,
      "book": 32,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ حُذَيْفَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ لُبْسِ الْحَرِيرِ وَالذَّهَبِ وَقَالَ ‏ \"‏ هُوَ لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Hudhaifah said:“The Messenger of Allah (ﷺ) forbade wearing silk and gold. He said: ‘They are for them in this world and for us in the Hereafter.’”",
          "ur": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ( مردوں کے لیے ) ریشم اور سونا پہننے سے منع کیا، اور فرمایا: یہ ان ( کافروں ) کے لیے دنیا میں ہے اور ہمارے لیے آخرت میں ہے ۔",
          "fr": "Rapporté par Hudhaifah : Le Messager d’Allah (ﷺ) a interdit de porter de la soie et de l’or. Il a dit : « Cela leur est permis dans ce monde et à nous dans l’au-delà. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Al Hakam] dari [Abdurrahman bin Abu Laila] dari [Hudzaifah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengenakan kain sutera dan emas, sabdanya: \"Itu untuk mereka di dunia dan untuk kita di Akhirat",
          "tr": "Huzeyfe (bin el-Yemân) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) ipek giymeyi ve altın (ziynet - kap kullanmayı) yasaklamış ve: «Altın dünyada kâfirleredir, âhirette de bizedir», buyurmuştur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 3591,
      "arabicNumber": 3591,
      "book": 32,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةً سِيَرَاءَ مِنْ حَرِيرٍ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ ابْتَعْتَ هَذِهِ الْحُلَّةَ لِلْوَفْدِ وَلِيَوْمِ الْجُمُعَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّمَا يَلْبَسُ هَذَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Abdullah bin ‘Umar that ‘Umar bin Khattab saw a silken two piece suit (being offered for sale). He said:“O Messenger of Allah, why don’t you buy this two piece suit (to wear for meeting) the delegations, and on Fridays?” The Messenger of Allah (ﷺ) said: “This is only worn by one who has no share in the Hereafter.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے ریشم کا ایک سرخ جوڑا دیکھا تو کہا: اللہ کے رسول! اگر آپ اس جوڑے کو وفود سے ملنے کے لیے اور جمعہ کے دن پہننے کے لیے خرید لیتے تو اچھا ہوتا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے وہ لوگ پہنتے ہیں جن کا آخرت میں کوئی حصہ نہیں ہوتا ۔",
          "fr": "Rapporté par ‘Abdullah bin ‘Umar : ‘Umar bin Khattab a vu un ensemble en soie (mis en vente). Il a dit : « Ô Messager d’Allah, pourquoi ne pas acheter cet ensemble (pour recevoir) les délégations, et pour le vendredi ? » Le Messager d’Allah (ﷺ) a dit : « Cela n’est porté que par celui qui n’a aucune part dans l’au-delà. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Ubaidullah bin Umar] dari [Nafi'] bahwa [Abdullah bin Umar] telah mengabarkan kepadanya, bahwa Umar bin Al Khaththab melihat pakaian yang terbuat dari sutera murni, dia lalu berkata, \"Wahai Rasulullah, sekiranya anda mengenakan pakaian ini untuk menerima utusan dan ketika hari Jum'at.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hanyasanya yang memakai kain ini adalah orang-orang yang tidak akan mendapatkan kebaikan di Akhirat",
          "tr": "Abdullah bin Ömer (r.a.)'dan rivayet edildiğine göre: Ömer bin el-Hattâb sırf ipekten mamul (satılık) bir kat elbise gördü ve: Yâ Resulallah, keşke bu elbiseyi (dışardan gelen) özel hey'etler ve Cum'a günü için (giymek üzere) satın alsan, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Bunu ancak âhirette (ipek elbisede) hiç nasibi olmayan kimse giyer» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 3592,
      "arabicNumber": 3592,
      "book": 32,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، ‏.‏ أَنَّ أَنَسَ بْنَ مَالِكٍ، نَبَّأَهُمْ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَخَّصَ لِلزُّبَيْرِ بْنِ الْعَوَّامِ وَلِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فِي قَمِيصَيْنِ مِنْ حَرِيرٍ مِنْ وَجَعٍ كَانَ بِهِمَا حِكَّةٍ ‏.‏",
        "translations": {
          "en": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) granted a concession to Zubair bin ‘Awwam and ‘Abdur-Rahman bin ‘Auf, allowing them to wear silk shirts, because of a rash they were suffering from",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے زبیر بن عوام اور عبدالرحمٰن بن عوف رضی اللہ عنہما کو اس تکلیف کی وجہ سے جو انہیں کھجلی کی وجہ سے تھی، ریشم کے کرتے پہننے کی اجازت دی۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) a accordé une dérogation à Zubair bin ‘Awwam et ‘Abdur-Rahman bin ‘Auf pour porter des chemises en soie, à cause d’une éruption cutanée dont ils souffraient",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] telah mengabarkan kepada mereka, bahwa Rasulullah shallallahu 'alaihi wasallam memberi keringanan kepada Zubair bin 'Awwam dan Abdurrahman bin 'Auf untuk mengenakan kain sutera karena keduanya menderita penyakit gatal",
          "tr": "Enes bin Mâlik (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Zübeyr bin el-Avvâm ve Abdurrahmân bin Avf (r.a.)'a vücûdlanndaki uyuz hastalığı nedeniyle ipek gömlek giymelerine izin verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 3593,
      "arabicNumber": 3593,
      "book": 32,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ عُمَرَ، أَنَّهُ كَانَ يَنْهَى عَنِ الْحَرِيرِ، وَالدِّيبَاجِ، إِلاَّ مَا كَانَ هَكَذَا ثُمَّ أَشَارَ بِإِصْبَعِهِ ثُمَّ الثَّانِيَةِ ثُمَّ الثَّالِثَةِ ثُمَّ الرَّابِعَةِ فَقَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَانَا عَنْهُ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Umar that he used to forbid silk and brocade, except for what was like this:Then he gestured with his finger, then a second, and a third, and a fourth (i.e., the width of four fingers), and he said: “The Messenger of Allah (ﷺ) used to forbid it.”",
          "ur": "عمر رضی اللہ عنہ سے روایت ہے کہ وہ خالص ریشمی کپڑے ( حریر و دیباج ) کے استعمال سے منع فرماتے تھے سوائے اس کے جو اس قدر ریشمی ہوتا، پھر انہوں نے اپنی ایک انگلی، پھر دوسری پھر تیسری پھر چوتھی انگلی سے اشارہ کیا ۱؎ پھر کہا: رسول اللہ صلی اللہ علیہ وسلم ہمیں اس سے منع کرتے تھے۔",
          "fr": "Rapporté par ‘Umar : Il interdisait la soie et le brocart, sauf pour ce qui était comme ceci : puis il a montré un doigt, puis un deuxième, un troisième et un quatrième (c’est-à-dire la largeur de quatre doigts), et il a dit : « Le Messager d’Allah (ﷺ) l’interdisait. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari ['Ashim] dari [Abu 'Utsman] dari [Umar], bahwa dia melarang mengenakan pakaian yang terbuat dari sutera murni atau dibaj (campuran sutera), kecuali jika ia seperti ini.\" Kemudian dia memberi isyarat dengan jarinya, lalu yang kedua, lalu yang ketiga, lalu yang ke empat kali seraya berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang kita untuk mengenakannya",
          "tr": "Ebu Osman en-Nehdî (r.a.)'den rivayet edildiğine göre: Ömer (bin el-Hattab) (r.a.) ipek ve dibâç (yâni ipekten mamul atlas) ı yasaklardı. Yalnız şu kadar olanı müstesna diyerek bir parmağı sonra, ikinci parmağı, sonra üçüncü parmağı ve daha sonra dördüncü parmağıyla işaret etti ve: Resulullah Sallallahu Aleyhi ve Sellem bizi ipekten men ederdi, dedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 3594,
      "arabicNumber": 3594,
      "book": 32,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُغِيرَةَ بْنِ زِيَادٍ، عَنْ أَبِي عُمَرَ، مَوْلَى أَسْمَاءَ قَالَ رَأَيْتُ ابْنَ عُمَرَ اشْتَرَى عِمَامَةً لَهَا عَلَمٌ فَدَعَا بِالْجَلَمَيْنِ فَقَصَّهُ فَدَخَلْتُ عَلَى أَسْمَاءَ فَذَكَرْتُ ذَلِكَ لَهَا فَقَالَتْ بُؤْسًا لِعَبْدِ اللَّهِ يَا جَارِيَةُ هَاتِي جُبَّةَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَجَاءَتْ بِجُبَّةٍ مَكْفُوفَةِ الْكُمَّيْنِ وَالْجَيْبِ وَالْفَرْجَيْنِ بِالدِّيبَاجِ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu ‘Umar, the freed slave of Asma’, said:“I saw Ibn ‘Umar buying a turban that had some markings, then he called for a pair of scissors and cut that off. I entered upon Asma’ and mentioned that to her, and she said: ‘May ‘Abdullah perish, O girl! Give me the garment of the Messenger of Allah (ﷺ).’ A garment was brought that was hemmed with brocade on the sleeves, necklines and openings (at the front and back).”",
          "ur": "اسماء رضی اللہ عنہا کے غلام ابوعمر کہتے ہیں کہ میں نے ابن عمر رضی اللہ عنہما کو دیکھا کہ انہوں نے ایک عمامہ خریدا جس میں گوٹے بنے تھے، پھر قینچی منگا کر انہیں کتر دیا ۱؎، میں اسماء رضی اللہ عنہا کی خدمت میں حاضر ہوا، اور اس کا تذکرہ کیا، تو انہوں نے کہا: تعجب ہے عبداللہ پر، ( ایک اپنی خادمہ کو پکار کر کہا: ) اے لڑکی! رسول اللہ صلی اللہ علیہ وسلم کا جبہ لے آ، چنانچہ وہ ایک ایسا جبہ لے کر آئی جس کی دونوں آستینوں، گریبان اور کلیوں کے دامن پر ریشمی گوٹے تھے۔",
          "fr": "Rapporté par Abu ‘Umar, l’affranchi d’Asma’ : J’ai vu Ibn ‘Umar acheter un turban avec des motifs, puis il a demandé des ciseaux et les a coupés. Je suis allé voir Asma’ et je lui ai raconté cela, et elle a dit : « Qu’Allah maudisse ‘Abdullah, ô fille ! Apporte-moi le vêtement du Messager d’Allah (ﷺ). » On a apporté un vêtement bordé de brocart sur les manches, l’encolure et les ouvertures (devant et derrière)",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Mughirah bin Ziyad] dari [Abu Umar] mantan budak Asma, dia berkata, \"Saya melihat Ibnu Umar membeli surban yang bergambar, kemudian dia meminta di ambilkan gunting lalu mengguntingnya. Setelah itu aku menjumpai Asma dan kuceritakan hal itu kepadanya, [Asma] lantas berkata, \"Sungguh buruk apa yang telah di lakukan oleh Abdullah! Wahai pembantu, ambilkanlah jubah Rasulullah shallallahu 'alaihi wasallam.\" Kemudian pembantu wanita itu datang dengan membawa jubah berlengan dan bersaku serta kedua selanya bergaris yang terbuat dari dibaj (campuran sutera)",
          "tr": "(Ebû Bekr-i Sıddîk'ın kızı) Esmâ'nın mevlâsi Ebû Ömer (r.a.)'den; Şöyle demiştir: Ben, İbn-i Ömer (r.a.)'ın bir âlem'i (yâni ipekten nakış - biye gibi bir parçası) olan bir sarık satın aldığını ve celemeyn (denilen yün makasını) isteyerek o âlem'i kestiğini gördüm. Sonra Esmâ'(bint-i Ebı Bekir)'in yanına giderek bu durumu ona anlattım. Bunun üzerine Esma: Hayret Abdullah'a! Ey câriye, Resulullah (Sallallahu Aleyhi ve Sellem)'in cübbesini getir, dedi. Câriye de yenlerine, yakasına ve yırtmaçlarına dibac (argacı ve erişi hâlis yünden mamul atlas) geçirilmiş bir cübbe getirdi, (ve Esma' şöyle dedi: Âişe vefat edinceye kadar bu cübbe onun yanında idi. O vefat edince cübbeyi ben aldım ve Nebi (Sallallahu Aleyhi ve Sellem) bunu giyiyordu. Biz bu cübbeyi hastalar için yıkıyoruz. Onun (bereketi) ile (Allah'tan) şifâ dileniyor"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 3595,
      "arabicNumber": 3595,
      "book": 32,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي الصَّعْبَةِ، عَنْ أَبِي الأَفْلَحِ الْهَمْدَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ زُرَيْرٍ الْغَافِقِيِّ، سَمِعْتُهُ يَقُولُ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ أَخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حَرِيرًا بِشِمَالِهِ وَذَهَبًا بِيَمِينِهِ ثُمَّ رَفَعَ بِهِمَا يَدَيْهِ فَقَالَ ‏ \"‏ إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لإِنَاثِهِمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "‘Ali bin Abu Talib said:“The Messenger of Allah (ﷺ) took hold of some silk in his left hand and some gold in his right, then he raised his hands and said: ‘These two are forbidden for the males of my nation, and permitted to the females.’”",
          "ur": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے بائیں ہاتھ میں ریشم اور دائیں ہاتھ میں سونا لیا، اور دونوں کو ہاتھ میں اٹھائے فرمایا: یہ دونوں میری امت کے مردوں پر حرام، اور عورتوں کے لیے حلال ہیں ۔",
          "fr": "Rapporté par ‘Ali bin Abu Talib : Le Messager d’Allah (ﷺ) a pris de la soie dans sa main gauche et de l’or dans sa main droite, puis il a levé les mains et a dit : « Ces deux choses sont interdites aux hommes de ma communauté et permises aux femmes. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Abdul Aziz bi Abu As Sha'bah] dari [Abu Al Aflah Al Hamdani] dari [Abdullah bin Zurair Al Ghafiqi] saya mendengar [Ali bin Abu Thalib] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengambil sutera dengan tangan kirinya dan emas dengan tangan kanannya, kemudian beliau mengangkat kedua tangannya sambil bersabda: \"Sesungguhnya kedua benda ini haram bagi kaum laki-laki dari umatku dan halal bagi kaum wanita",
          "tr": "Alî bin Ebî Tâlib (r.a.j'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bir ipek kumaşı sol eline ve bir parça altını sağ eline aldı, sonra bunları elleriyle havaya kaldırarak (halk'a göstererek): «Şu iki şey ümmetimin erkeklerine haram, kadınlarına helaldir,» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 3596,
      "arabicNumber": 3596,
      "book": 32,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ أَبِي فَاخِتَةَ، حَدَّثَنِي هُبَيْرَةُ بْنُ يَرِيمَ، عَنْ عَلِيٍّ، أَنَّهُ أُهْدِيَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حُلَّةٌ مَكْفُوفَةٌ بِحَرِيرٍ إِمَّا سَدَاؤُهَا وَإِمَّا لُحْمَتُهَا فَأَرْسَلَ بِهَا إِلَىَّ فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا أَصْنَعُ بِهَا أَلْبَسُهَا قَالَ ‏ \"‏ لاَ وَلَكِنِ اجْعَلْهَا خُمُرًا بَيْنَ الْفَوَاطِمِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Ali that a two-piece suit hemmed with silk, either on the wrap or the weft,* was given to the Messenger of Allah (ﷺ), and he sent them to me (‘Ali). I came to him and said:“O Messenger of Allah, what should I do with these? Shall I wear them?” He said: “No, rather make them into head-cloths and give them to the Fatimahs.”",
          "ur": "علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک ریشمی ( جوڑا ) تحفہ میں آیا جس کے تانے یا بانے میں ریشم ملا ہوا تھا، آپ نے وہ میرے پاس بھیج دیا، میں آپ کی خدمت میں حاضر ہوا، اور عرض کیا: اللہ کے رسول! میں اس کا کیا کروں؟ کیا میں اسے پہنوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، بلکہ اسے فاطماؤں کی اوڑھنیاں بنا دو ۱؎۔",
          "fr": "Rapporté par ‘Ali : Un ensemble bordé de soie, soit sur la chaîne soit sur la trame, a été donné au Messager d’Allah (ﷺ), et il me les a envoyés (‘Ali). Je suis allé le voir et j’ai dit : « Ô Messager d’Allah, que dois-je en faire ? Dois-je les porter ? » Il a dit : « Non, fais-en plutôt des foulards et donne-les aux Fatimah. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Yazid bin Abu Ziyad] dari [Abu Fakhitah] telah menceritakan kepadaku [Hubairah bin Yarim] dari [Ali], bahwa telah di hadiahkan pakaian yang terbuat dari sutera kepada Rasulullah shallallahu 'alaihi wasallam, yaitu yang panjang atau lebar kainnya bersulam sutera. Kemudian beliau mengirimnya kembali kepadaku, lantas kudatangi beliau seraya berkata, \"Wahai Rasulullah, apa yang harus kuperbuat dengannya? Apakah aku boleh mengenakannya?\" beliau menjawab: \"Tidak, akan tetapi buatlah kerudung untuk para Fatimah",
          "tr": "Alî (bin Ebî Tâlib) (r.a.)'den; Şöyle demiştir: Erişi veya argacı ipekten olan bir kat elbise Resulullah (Sallallahu Aleyhi ve Sellem)'e hediye edildi. O da bana gönderdi. Bunun üzerine ben Onun yanına vararak: Yâ Resûlallah! O elbiseyi ne yapayım? Onu giyeyim (mi) ? dedim. O: «Hayır (giyme) ve lâkin onu (parçalayıp) baş örtüleri yap ve Fâtimeler arasında (taksim et)», buyurdu. (Ben de öyle yaptım)"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 3597,
      "arabicNumber": 3597,
      "book": 32,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنِ الإِفْرِيقِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَفِي إِحْدَى يَدَيْهِ ثَوْبٌ مِنْ حَرِيرٍ وَفِي الأُخْرَى ذَهَبٌ فَقَالَ ‏ \"‏ إِنَّ هَذَيْنِ مُحَرَّمٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لإِنَاثِهِمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Abdullah bin ‘Umar said:“The Messenger of Allah (ﷺ) came out to us, and in one of his hands was a garment of silk and in the other was some gold. He said: ‘These are forbidden to the males of my nation and permitted to the females.’”",
          "ur": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس گھر سے نکل کر آئے، آپ کے ایک ہاتھ میں ریشم کا کپڑا، اور دوسرے میں سونا تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: یہ دونوں چیزیں میری امت کے مردوں پر حرام، اور عورتوں کے لیے حلال ہیں ۔",
          "fr": "Rapporté par ‘Abdullah bin ‘Umar : Le Messager d’Allah (ﷺ) est sorti vers nous, tenant dans une main un vêtement en soie et dans l’autre de l’or. Il a dit : « Ceci est interdit aux hommes de ma communauté et permis aux femmes. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Al Ifriqi] dari [Abdurrahman bin Rafi'] dari [Abdullah bin 'Amru] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui kami, satu tangannya memegang sutera dan tangan yang lain memegang emas, lalu beliau bersabda: \"Sesungguhnya kedua benda ini diharamkan bagi kaum lelaki umatku dan di halalkan bagi kaum wanitanya",
          "tr": "Abdullah bin Amr (bin el-Âs) (r.a.)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (bir gün) bir elinde ipekten bir elbise ve diğer elinde bir altın olduğu halde yanımıza çıktı ve: «Şüphesiz bu iki şey ümmetimin erkeklerine haram kılındı, kadınlarına helâldir», buyurdu. Not: Zevaİd'de şöyle denilmiştir: Bunun senedinde Abdurrahman bin Rafl bulunur. Kendisinden bir takım münker hadisler rivayet olunmuştur. İbn-i Hibbân: Onun hadisleri Abdurrahman bin Ziyâd bin En'am'ın rivayetinden olduğu zaman delil sayılmaz. Rivâyetlerindeki münkerlik râvi Abdurrahman bin Ziyad'dan dolayıdır, demiştir. Ebû Hâtera de: O, yani Abdurrahman bin Rafİ, hadisi münker olan bir şeyhtir, demiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 3598,
      "arabicNumber": 3598,
      "book": 32,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، قَالَ رَأَيْتُ عَلَى زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَمِيصَ حَرِيرٍ سِيَرَاءَ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas said:“I saw Zainab the daughter of the Messenger of Allah (ﷺ) wearing a shirt of Siyara’ silk",
          "ur": "انس رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی صاحب زادی زینب رضی اللہ عنہا کو سرخ دھاری دار ریشمی کرتا پہنے دیکھا۔",
          "fr": "Rapporté par Anas : J’ai vu Zainab, la fille du Messager d’Allah (ﷺ), porter une chemise en soie de Siyara’",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Isa bin Yunus] dari [Ma'mar] dari [Az Zuhri] dari [Anas] dia berkata, \"Aku melihat Zainab binti Rasulullah shallallahu 'alaihi wasallam mengenakan gamis sutera yang bergaris",
          "tr": "Enes (r.a.)'den; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'in kızı Zeyneb üzerinde çubuklu ipekli kumaştan bir gömlek gördüm"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Shadh"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Shadh"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 3599,
      "arabicNumber": 3599,
      "book": 32,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ الْقَاضِي، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ مَا رَأَيْتُ أَجْمَلَ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُتَرَجِّلاً فِي حُلَّةٍ حَمْرَاءَ ‏.‏",
        "translations": {
          "en": "It was narrated that Bara’ said:“I never saw anyone more handsome then the Messenger of Allah (ﷺ), with his hair combed, wearing a red two-piece suit.”",
          "ur": "براء رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے زیادہ خوبصورت بال جھاڑے اور سنوارے ہوئے سرخ جوڑے میں ملبوس کسی کو نہیں دیکھا",
          "fr": "Rapporté par Bara’ : Je n’ai jamais vu quelqu’un de plus beau que le Messager d’Allah (ﷺ), avec ses cheveux coiffés, portant un ensemble rouge",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dari [Syarik bin Abdullah Al Qadli] dari [Abu Ishaq] dari [Al Barra] dia berkata, \"Saya tidak pernah melihat yang lebih indah dari sosok Rasulullah shallallahu 'alaihi wasallam kecuali saat beliau berjalan dengan mengenakan pakaian merah",
          "tr": "Berâ (bin Âzib) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) saçlarını tarayarak kırmızı bir hülle içinde iken O'ndan daha güzel hiç kimseyi görmedim"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 3600,
      "arabicNumber": 3600,
      "book": 32,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ بَرَّادِ بْنِ يُوسُفَ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا حُسَيْنُ بْنُ وَاقِدٍ، قَاضِي مَرْوَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، أَنَّ أَبَاهُ، حَدَّثَهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَخْطُبُ فَأَقْبَلَ حَسَنٌ وَحُسَيْنٌ عَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ وَيَقُومَانِ فَنَزَلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَأَخَذَهُمَا فَوَضَعَهُمَا فِي حِجْرِهِ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ وَرَسُولُهُ ‏{إِنَّمَا أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ}‏ رَأَيْتُ هَذَيْنِ فَلَمْ أَصْبِرْ ‏\"‏ ‏.‏ ثُمَّ أَخَذَ فِي خُطْبَتِهِ ‏.‏",
        "translations": {
          "en": "‘Abdullah bin Buraidah narrated that his father told him:I saw the Messenger of Allah (ﷺ) delivering a sermon, and Hasan and Husain came forward, wearing red shirts, stumbling and getting up again. The Prophet (ﷺ) stepped down, picked them up and put them in his lap. Then he said: “Allah and His Messenger have spoken the truth. ‘Your wealth and your children are only a trial.’ [64:15] I saw these two and I could not be patient. Then he resumed his sermon.”",
          "ur": "بریدہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو خطبہ دیتے دیکھا، اتنے میں حسن اور حسین رضی اللہ عنہما دونوں لال قمیص پہنے ہوئے آ گئے کبھی گرتے تھے کبھی اٹھتے تھے، نبی اکرم صلی اللہ علیہ وسلم ( منبر سے ) اترے، دونوں کو اپنی گود میں اٹھا لیا، اور فرمایا: اللہ اور اس کے رسول کا قول سچ ہے: «إنما أموالكم وأولادكم فتنة» بلاشبہ تمہارے مال اور تمہاری اولاد آزمائش ہیں ، میں نے ان دونوں کو دیکھا تو صبر نہ کر سکا، پھر آپ صلی اللہ علیہ وسلم نے خطبہ شروع کر دیا ۱؎۔",
          "fr": "Rapporté par ‘Abdullah bin Buraidah, selon ce que son père lui a raconté : J’ai vu le Messager d’Allah (ﷺ) faire un sermon, et Hasan et Husain sont venus vers lui, portant des chemises rouges, trébuchant et se relevant. Le Prophète (ﷺ) est descendu, les a pris et les a installés sur ses genoux. Puis il a dit : « Allah et Son Messager ont dit la vérité. “Vos biens et vos enfants ne sont qu’une épreuve.” [64:15] J’ai vu ces deux-là et je n’ai pas pu rester indifférent. » Puis il a repris son sermon",
          "id": "Telah menceritakan kepada kami [Abu 'Amir Abdullah bin 'Amir bin Barrad bin Yusuf bin Abu Burdah bin Abu Musa Al Asy'ari] dia berkata; telah menceritakan kepada kami [Zaid bin Hubab] telah menceritakan kepada kami [Husain bin Waqid Qadli Marwa] telah menceritakan kepadaku [Abdullah bin Buraidah] bahwa [Ayahnya] telah menceritakan kepadanya, dia berkata, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam berkhutbah, kemudian Hasan dan Husain 'alaihima salam menghampiri beliau dengan mengenakan baju warna merah dan keduanya berdiri. Nabi shallallahu 'alaihi wasallam lalu mengambil keduanya serta meletakkannya di pangkuan, beliau lalu bersabda: \"Maha benar Allah dan Rasul-Nya; 'Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu)...' (QS. At Taghabun; 15), aku melihat kedua anak ini dan aku tidak sanggup menahan diri (untuk memeluknya).\" Kemudian beliau melanjutkan khutbahnya",
          "tr": "Büreyde (bin el-Husayb) (r.a.)'den; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i hutbe okurken gördüm. Hasan ve Hüseyin (r.a.) geldiler, üzerlerinde iki kırmızı gömlek vardı, düşe kalka yürüyorlardı. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) (minberden) indi ve onları alıp kucağına koydu. Sonra: «Allah ve Resulü doğru söylediler, = Şüphesiz mallarınız ve evlâdınız bir sınamadır ve büyük sevap Allah katandadır.» (Teğabun 15) Ben bunları gördüm de sabredemedim, buyurdu. Sonra hutbesine devam etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 3601,
      "arabicNumber": 3601,
      "book": 32,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَسَنِ بْنِ سُهَيْلٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُفَدَّمِ ‏.‏ قَالَ يَزِيدُ قُلْتُ لِلْحَسَنِ مَا الْمُفَدَّمُ قَالَ الْمُشْبَعُ بِالْعُصْفُرِ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The Messenger of Allah (ﷺ) forbade Al-Mufaddam.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «مفدم» سے منع کیا ہے، یزید کہتے ہیں کہ میں نے حسن سے پوچھا: «مفدم» کیا ہے؟ انہوں نے کہا: جو کپڑا «کسم» میں رنگنے سے خوب پیلا ہو جائے ۱؎۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) a interdit Al-Mufaddam",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Yazid bin Abu Ziyad] dari [Al Hasan bin Suhail] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang Al Mufaddam.\" Yazid berkata, \"Aku bertanya kepada Al Hasan, \"Apakah al Mufaddam itu?\" Dia menjawab: \"(Pakaian) yang di celup dengan pohon 'ushfur (sejenis tumbuhan pewarna)",
          "tr": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'in müfeddem elbiseyi yasakladığını söylemiştir. Râvî Yezîd demiş ki t Ben el-Hasan'a t Müfeddem nedir? diye sordum. EI-Hasan dedi ki: Müfeddem, aspur ile doyasıya boyanmış olan (kumaş elbise) dir. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih olup ravileri sika, güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 3602,
      "arabicNumber": 3602,
      "book": 32,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، قَالَ سَمِعْتُ عَلِيًّا، يَقُولُ نَهَانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ - وَلاَ أَقُولُ نَهَاكُمْ - عَنْ لُبْسِ الْمُعَصْفَرِ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Abdullah bin Hunain said:“I heard ‘Ali say: ‘The Messenger of Allah (ﷺ) forbade me – and I do not say that he forbade you – from wearing clothes dyed with safflower.’”",
          "ur": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے پیلے رنگ کے کپڑے پہننے سے روکا، میں یہ نہیں کہتا کہ تمہیں منع کیا۔",
          "fr": "Rapporté par ‘Abdullah bin Hunain : J’ai entendu ‘Ali dire : « Le Messager d’Allah (ﷺ) m’a interdit – et je ne dis pas qu’il vous l’a interdit – de porter des vêtements teints au carthame. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Usamah bin Zaid] dari [Abdullah bin Hunain] dia berkata; saya mendengar [Ali] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarangku, dan aku tidak mengatakan beliau melarang kalian dari memakai pakaian yang dicelup (diberi warna)",
          "tr": "Ali (r.a.)'den rivayet edildiğine göre şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) beni aspurla boyanmış olan (kumaş, elbise) den menetti. Ben O'nun sizi menettiğini söylemem"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 3603,
      "arabicNumber": 3603,
      "book": 32,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ هِشَامِ بْنِ الْغَازِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ ثَنِيَّةِ أَذَاخِرَ فَالْتَفَتَ إِلَىَّ وَعَلَىَّ رَيْطَةٌ مُضَرَّجَةٌ بِالْعُصْفُرِ فَقَالَ ‏\"‏ مَا هَذِهِ ‏\"‏ ‏.‏ فَعَرَفْتُ مَا كَرِهَ فَأَتَيْتُ أَهْلِي وَهُمْ يَسْجُرُونَ تَنُّورَهُمْ فَقَذَفْتُهَا فِيهِ ثُمَّ أَتَيْتُهُ مِنَ الْغَدِ فَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ مَا فَعَلَتِ الرَّيْطَةُ ‏\"‏ ‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ أَلاَ كَسَوْتَهَا بَعْضَ أَهْلِكَ فَإِنَّهُ لاَ بَأْسَ بِذَلِكَ لِلنِّسَاءِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Amr bin Shu’aib, from his father, that his grandfather said:“We came with the Messenger of Allah (ﷺ) was Thaniyyat Adhakhir. He turned to me, and I was wearing a thin cloak dyed with safflower, and said: ‘What is this?’ And I realized that he disliked it. I came to my family when they were heating their oven and threw it (in the oven). Then I came to him the following day and he said: ‘O ‘Abdullah, what happened to the thin cloak?’ I told him (what I had done) and he said: ‘Why did you not give it to some of your family to wear, for there is nothing wrong with it for women.’”",
          "ur": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ ہم اذاخر ۱؎ کے موڑ سے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آئے، آپ میری طرف متوجہ ہوئے، میں باریک چادر پہنے ہوئے تھا جو کسم کے رنگ میں رنگی ہوئی تھی، تو آپ صلی اللہ علیہ وسلم نے پوچھا: یہ کیا ہے ؟ میں آپ کی اس ناگواری کو بھانپ گیا، چنانچہ میں اپنے گھر والوں کے پاس آیا، وہ اس وقت اپنا تنور گرم کر رہے تھے، میں نے اسے اس میں ڈال دیا، دوسری صبح میں آپ کے پاس آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: عبداللہ! چادر کیا ہوئی ؟ میں نے آپ کو ساری بات بتائی تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم نے اپنی کسی گھر والی کو کیوں نہیں پہنا دی؟ اس لیے کہ اسے پہننے میں عورتوں کے لیے کوئی مضائقہ نہیں ۔",
          "fr": "Rapporté par ‘Amr bin Shu’aib, d’après son père, que son grand-père a dit : Nous sommes venus avec le Messager d’Allah (ﷺ) à Thaniyyat Adhakhir. Il s’est tourné vers moi, et je portais un manteau fin teint au carthame, et il a dit : « Qu’est-ce que c’est ? » J’ai compris qu’il n’aimait pas cela. Je suis rentré chez moi alors qu’ils chauffaient le four, et j’ai jeté le manteau dedans. Le lendemain, je suis revenu vers lui et il a dit : « Ô ‘Abdullah, qu’est-il arrivé au manteau fin ? » Je lui ai raconté ce que j’avais fait et il a dit : « Pourquoi ne l’as-tu pas donné à quelqu’un de ta famille ? Il n’y a pas de mal à ce que les femmes le portent. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Isa bin Yunus] dari [Hisyam bin Al Ghaz] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] dia berkata, \"Kami berjumpa dengan Rasulullah shallallahu 'alaihi wasallam ketika berada di Tsaniyah Adzakhir, dan beliau menoleh kepadaku sedangkan aku mengenakan pakaian yang dicelup dengan pohon 'ushfur, maka beliau bersabda: 'Apakah ini? ', akupun bahwa beliau tidak menyukainya. Kemudian aku menemui keluargaku ketika mereka sedang menyalakan tungku api, lalu kulemparkan mantelku ke dalam tungku api. Keesokan harinya aku mendatangi Rasulullah shallallahu 'alaihi wasallam, beliau lalu bertanya: \"Wahai Abdullah, apa yang telah kamu perbuat dengan mantelmu?\" lalu kuberitahukan kepada beliau bahwa aku telah membakarnya, maka beliau pun bersabda: \"Kenapa tidak kamu berikan kepada istrimu? Karena mantel yang seperti itu tidak mengapa jika di pakai oleh kaum wanita",
          "tr": "Amr bin Şuayb'ın dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'den; Şöyle demiştir: Biz, Resulullah (Sallallahu Aleyhi ve Sellem) ile bareber Ezâhır dağ yolundan geliyorduk. Bir ara Resulullah (Sallallahu Aleyhi ve Sellem) bana dönüp baktı. Benim üstümde aspurla boyanmış dikişsiz bir car (veya ince yumuşak bir elbise) vardı. Resulullah (Sallallahu Aleyhi ve Sellem) (üstümdeki elbiseye işaretle): «Bu nedir?» buyurdu. Ben Onun bundan hoşlanmadığını anladım. Sonra ev halkımın yamna vardım. O sırada onlar tandırlarını ateşleyerek kızdırıyorlardı. Ben o elbiseyi tandıra attım. Ertesi gün O'nun huzuruna gittim. O: «Yâ Abdullah! O elbiseyi ne yaptın ?» buyurdu. Ben de O'na (durumdan) haber verdim. Bunun üzerine buyurdu ki: «O elbiseyi aile ferdlerinin bâzısına giydirmeliydin. Çünkü kadınların böyle elbiseyi giymelerinde bir günah yoktur» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 3604,
      "arabicNumber": 3604,
      "book": 32,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ شُرَحْبِيلَ، عَنْ قَيْسِ بْنِ سَعْدٍ، قَالَ أَتَانَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَوَضَعْنَا لَهُ مَاءً يَتَبَرَّدُ بِهِ فَاغْتَسَلَ ثُمَّ أَتَيْتُهُ بِمِلْحَفَةٍ صَفْرَاءَ فَرَأَيْتُ أَثَرَ الْوَرْسِ عَلَى عُكَنِهِ ‏.‏",
        "translations": {
          "en": "It was narrated that Qais bin Sa’d said:“The Prophet (ﷺ) came to us and we gave him some water with which to cool down. He bathed, then I brought him a yellow blanket, and I saw the traces of Wars (the yellow dye) on the folds of his stomach.”",
          "ur": "قیس بن سعد رضی اللہ عنہ کہتے ہیں کہ ہمارے پاس نبی اکرم صلی اللہ علیہ وسلم تشریف لائے، تو ہم نے آپ کے لیے پانی رکھا تاکہ آپ اس سے ٹھنڈے ہوں، آپ نے اس سے غسل فرمایا، پھر میں آپ کے پاس ایک پیلی چادر لے کر آیا، ( اس کو آپ نے پہنا ) تو میں نے آپ کے پیٹ کی سلوٹوں پر ورس کا نشان دیکھا ۱؎۔",
          "fr": "Rapporté par Qais bin Sa’d : Le Prophète ﷺ est venu chez nous et nous lui avons donné de l’eau pour se rafraîchir. Il s’est lavé, puis je lui ai apporté une couverture jaune, et j’ai vu des traces de Wars (un colorant jaune) sur les plis de son ventre",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Laila] dari [Muhammad bin Abdurrahman] dari [Muhammad bin Syurahbil] dari [Qais bin Sa'd] dia berkata, \"Nabi shallallahu 'alaihi wasallam menemui kami, lalu kami menyiapkan air agar beliau bisa mendinginkan badannya, beliau pun mandi, kemudian aku berikan kain selimut berwarna kuning, sehingga aku pun dapat melihat bekas warna kuning pada leher beliau",
          "tr": "Kays bin Sa'd (r.a.)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) bize geldi. Biz O'nun İçin (yıkanıp) serinleneceği su koyduk. O da yıkandı. Sonra ben O'na san bir çarşaf götürdüm (onunla kurulandı). Sonra ben O'nun karın kıvrımları üzerinde vers (yâni çarşaftaki Yemen za'feranı bitkisin) in izini gördüm"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 3605,
      "arabicNumber": 3605,
      "book": 32,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا مَا لَمْ يُخَالِطْهُ إِسْرَافٌ أَوْ مَخِيلَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Amr bin Shu’aib, from his father, that his grandfather said:“The Messenger of Allah (ﷺ) said: ‘Eat and drink, give charity and wear clothes, as long as that does not involve any extravagance or vanity.’”",
          "ur": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہعلیہ وسلم نے فرمایا: کھاؤ پیو، صدقہ و خیرات کرو، اور پہنو ہر وہ لباس جس میں اسراف و تکبر ( فضول خرچی اور گھمنڈ ) کی ملاوٹ نہ ہو ۱؎۔",
          "fr": "Rapporté par ‘Amr bin Shu’aib, d’après son père, d’après son grand-père : Le Messager d’Allah ﷺ a dit : “Mangez et buvez, donnez en aumône et portez des vêtements, tant que cela ne mène pas à l’excès ou à l’orgueil.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah memberitakan kepada kami [Hammam] dari [Qatadah] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makan dan minumlah, bersedekah dan berpakaianlah kalian dengan tidak berlebih-lebihan atau kesombongan",
          "tr": "Amr bin Şuayb'in dedesi (Abdullah bin Amr bin el-Âs) (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Yeyiniz, içiniz, sadaka veriniz ve giyininiz, buna israf veya kibir karışmadıkça.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 3606,
      "arabicNumber": 3606,
      "book": 32,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْوَاسِطِيَّانِ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شَرِيكٌ، عَنْ عُثْمَانَ بْنِ أَبِي زُرْعَةَ، عَنْ مُهَاجِرٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَلْبَسَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ثَوْبَ مَذَلَّةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The Messenger of Allah (ﷺ) said: ‘Whoever wears a garment of pride and vanity, Allah will clothe him, on the Day of Resurrection, in a garment of humiliation.’”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے شہرت کا لباس پہنا اللہ تعالیٰ اسے قیامت کے دن ذلت کا لباس پہنائے گا ۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah ﷺ a dit : “Celui qui porte un vêtement par orgueil et vanité, Allah l’habillera, au Jour de la Résurrection, d’un vêtement d’humiliation.”",
          "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubadah] dan [Muhammad bin Abdul Malik Al Washatiyani] keduanya berkata; telah menceritakan kepada kami [Yazid bin Harun] telah memberitakan kepada kami [Syarik] dari [Utsman bin Abu Zur'ah] dari [Muhajir] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengenakan pakaian dengan penuh kesombongan (pamer), maka Allah akan memakaikan kepadanya pakaian kehinaan pada hari Kiamat",
          "tr": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim meşhur olmaya vesile olan bir elbise giyerse, Allah kıyamet günü o kimseye zillet elbisesini giydirir.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 3607,
      "arabicNumber": 3607,
      "book": 32,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ، عَنِ الْمُهَاجِرِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ فِي الدُّنْيَا أَلْبَسَهُ اللَّهُ ثَوْبَ مَذَلَّةٍ يَوْمَ الْقِيَامَةِ ثُمَّ أَلْهَبَ فِيهِ نَارًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Abdullah bin ‘Umar said:“The Messenger of Allah (ﷺ) said: ‘Whoever wears a garment of pride and vanity in this world, Allah will clothe him in a garment of humiliation on the Day of Resurrection, then set it ablaze.’”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے دنیا میں شہرت کا لباس پہنا اللہ تعالیٰ قیامت کے دن اسے ذلت کا لباس پہنائے گا، پھر اس میں آگ بھڑکائے گا۔",
          "fr": "Rapporté par ‘Abdullah bin ‘Umar : Le Messager d’Allah ﷺ a dit : “Celui qui porte un vêtement par orgueil et vanité dans ce monde, Allah l’habillera d’un vêtement d’humiliation au Jour de la Résurrection, puis il l’enflammera.”",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu As Syawarib] telah menceritakan kepada kami [Abu 'Awanah] dari ['Utsman bin Al Mughirah] dari [Al Muhajir] dari [Abdullah bin Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengenakan pakaian dengan penuh kesombongan (pamer) di dunia, maka Allah akan mengenakan pakaian kehinaan pada hari Kiamat dan dia akan di masukkan ke dalam api Neraka",
          "tr": "Abdullah bin Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Kim dünyada meşhur olmaya vesile olan bir elbise giyerse Allah kıyamet günü o kimseye bir zillet elbisesini giydirir, sonra o elbise içinde bir ateş alevlendirir.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 3608,
      "arabicNumber": 3608,
      "book": 32,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ الْبَحْرَانِيُّ، حَدَّثَنَا وَكِيعُ بْنُ مُحْرِزٍ النَّاجِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ جَهْمٍ، عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَعْرَضَ اللَّهُ عَنْهُ حَتَّى يَضَعَهُ مَتَى وَضَعَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Dharr that the Prophet (ﷺ) said:“Whoever wears a garment of pride and vanity, Allah will turn away from him until he takes it off.”",
          "ur": "ابوذر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے شہرت کی خاطر لباس پہنا، اللہ تعالیٰ اس سے منہ پھیر لے گا یہاں تک کہ اسے اس جگہ رکھے گا جہاں اسے رکھنا ہے ( یعنی جہنم میں ) ۔",
          "fr": "Rapporté par Abu Dharr : Le Prophète ﷺ a dit : “Celui qui porte un vêtement par orgueil et vanité, Allah se détournera de lui jusqu’à ce qu’il l’enlève.”",
          "id": "Telah menceritakan kepada kami [Al 'Abbas bin Yazid Al Bahrani] telah menceritakan kepada kami [Waki' bin Muhris An Naji] telah menceritakan kepada kami [Utsman bin Jahm] dari [Zirr bin Hubaisy] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa mengenakan pakaian dengan penuh kesombongan (pamer), maka Allah akan berpaling darinya sampai dia melepaskan pakaian tersebut, kapan saja dia melepasnya",
          "tr": "Ebû Zer' (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Kim bir şöhret elbisesini giyerse, Allah o kimseden yüz çevirir (yâni rahmet nazarıyla bakmaz), nihayet onu alçaltacağı zaman alçaltır.» Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedi hasen'dir. Ravi el-Abbas bin Yezid'in güvenilirliği hakkında ihtilalolmuştur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 3609,
      "arabicNumber": 3609,
      "book": 32,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏ \"‏ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Abbas said:“I heard the Messenger of Allah (ﷺ) say: ‘Any skin that has been tanned has been purified.’”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ہر وہ کھال جسے دباغت دے دی گئی ہو پاک ہے ۱؎۔",
          "fr": "Rapporté par Ibn ‘Abbas : J’ai entendu le Messager d’Allah ﷺ dire : “Toute peau qui a été tannée est purifiée.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Zaid bin Aslam] dari [Abdurrahman bin Wa'lah] dari [Ibnu Abbas] dia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kulit (binatang) apa saja yang telah di samak, maka ia menjadi suci",
          "tr": "İbn-i Abbâs (r.a.)'dan; Şöyle demiştir: Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'den şu buyruğu işittim: «Hangi deri tabaklanırsa temizlenmiş olur.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 3610,
      "arabicNumber": 3610,
      "book": 32,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ شَاةً، لِمَوْلاَةِ مَيْمُونَةَ مَرَّ بِهَا - يَعْنِي النَّبِيَّ ـ صلى الله عليه وسلم ـ - قَدْ أُعْطِيَتْهَا مِنَ الصَّدَقَةِ مَيْتَةً فَقَالَ ‏\"‏ هَلاَّ أَخَذُوا إِهَابَهَا فَدَبَغُوهُ فَانْتَفَعُوا بِهِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ قَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Maimunah that he (meaning the Prophet (ﷺ)) passed by a dead sheep belonging to the freed slave woman of Maimunah, that had been given to her in charity. He said:“Why don’t they take its skin and ten it, and make us of it?” They said: “O Messenger of Allah, it is dead meat.”* He said: “It is only unlawful to eat it.”",
          "ur": "ام المؤمنین میمونہ رضی اللہ عنہا سے روایت ہے کہ ان کی ایک لونڈی کو صدقہ کی ایک بکری ملی تھی جو مری پڑی تھی، نبی اکرم صلی اللہ علیہ وسلم کا گزر اس بکری کے پاس ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ان لوگوں نے اس کی کھال کیوں نہیں اتار لی کہ اسے دباغت دے کر کام میں لے آتے ؟ لوگوں نے عرض کیا: اللہ کے رسول! یہ تو مردار ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: صرف اس کا کھانا حرام ہے ۱؎۔",
          "fr": "Rapporté par Maymouna : Le Prophète ﷺ est passé près d’un mouton mort appartenant à l’ancienne esclave affranchie de Maymouna, qui lui avait été donné en aumône. Il a dit : “Pourquoi ne prennent-ils pas sa peau pour la tanner et l’utiliser ?” Ils ont répondu : “Ô Messager d’Allah, c’est une bête morte.” Il a dit : “Seule la consommation de sa chair est interdite.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah], bahwa kambing milik mantan budak Maimunah yang telah ia berikan kepadanya sebagai sedekah lalu mati, diliwati oleh beliau -Nabi shallallahu 'alaihi wasallam-, maka beliau bersabda: \"Kenapa kalian tidak mengambil kulitnya dan menyamaknya hingga mereka dapat memanfaatkannya?\" mereka menjawab, \"Wahai Rasulullah, kambing itu telah mati! \" Beliau lalu bersabda: \"Yang diharamkan adalah memakannya",
          "tr": "Meyroune (r.anhâ)'dan; Şöyle demiştir: Meymûne (yâni kendisi) nin âzadh bir cariyesine sadaka (malın)-dan verilmiş olan bir davar ölmüş iken yanından O, yâni Nebi (Sallallahu Aleyhi ve Sellem) geçti ve: «Bunun derisini alıp tabakladıktan sonra ondan istifade etmeliydiler (yâni niçin böyle yapmadılar) ?» buyurdu. Orada bulunanlar: Yâ Resûlallah, bu davar murdardır (yâni boğazlanmadan ölmüş), dediler. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Ölü hayvan'ın yalnız yenmesi haram oldu» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 3611,
      "arabicNumber": 3611,
      "book": 32,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ لَيْثٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ سَلْمَانَ، قَالَ كَانَ لِبَعْضِ أُمَّهَاتِ الْمُؤْمِنِينَ شَاةٌ فَمَاتَتْ فَمَرَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَيْهَا فَقَالَ ‏ \"‏ مَا ضَرَّ أَهْلَ هَذِهِ لَوِ انْتَفَعُوا بِإِهَابِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Salman said:“One of the Mothers of the Believers had a sheep that died. The Messenger of Allah (ﷺ) passed by it and said: ‘It would not have harmed its owners if they had made use of its hide.’”",
          "ur": "سلمان رضی اللہ عنہ کہتے ہیں کہ امہات المؤمنین میں سے کسی ایک کے پاس ایک بکری تھی جو مر گئی، رسول اللہ صلی اللہ علیہ وسلم کا اس پر گزر ہوا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اگر لوگ اس کی کھال کو کام میں لے آتے تو اس کے مالکوں کو کوئی نقصان نہ ہوتا ۔",
          "fr": "Rapporté par Salman : L’une des Mères des Croyants avait un mouton qui est mort. Le Messager d’Allah ﷺ est passé à côté et a dit : “Cela n’aurait pas fait de mal à ses propriétaires s’ils avaient utilisé sa peau.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Laits] dari [Syahr bin Hausyab] dari [Salman] dia berkata, \"Beberapa orang dari Ummul Mukminin memiliki kambing lalu mati, kemudian Rasulullah shallallahu 'alaihi wasallam lewat di dekatnya, maka beliau bertanya, \"Tidak mengapa jika pemilik kambing ini ingin memanfaatkan kulitnya",
          "tr": "Selmân (r.a.)'den; Şöyle demiştir: Mu'minlerin analarından bazısının bir davarı vardı. Hayvan öldü. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) hayvanın olduğu yerden geçti ve: «Sâhibleri bunun derisinden istifâde etseydiler yararlanma onlara zarar vermezdi (yâni günah olmazdı).» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Leys bin Selim bulunur. Bu ravi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 3612,
      "arabicNumber": 3612,
      "book": 32,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“The Messenger of Allah (ﷺ) commanded that use should be made of the skins of dead animals, if they were tanned.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم فرمایا: جب مردہ جانوروں کی کھال کو دباغت دے دی جائے، تو لوگ ا سے فائدہ اٹھائیں ۔",
          "fr": "Rapporté par ‘Aïsha : Le Messager d’Allah ﷺ a ordonné d’utiliser les peaux des animaux morts, si elles étaient tannées",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Khalid bin Makhlad] dari [Malik bin Anas] dari [Yazid bin Qusaith] dari [Muhammad bin Abdurrahman] dari [Ibunya] dari [Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk memanfaatkan kulit bangkai binatang jika telah di samak",
          "tr": "Âişe (r.anha)'dan rivayet edildiğine göre şöyle söylemiştir: Resulullah (Sallallahu Aleyhi ve Sellem) ölü hayvanların derilerinden tabaklandığı zaman yararlanmayı emretti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 3613,
      "arabicNumber": 3613,
      "book": 32,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، ح وَحَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، كُلُّهُمْ عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ، قَالَ أَتَانَا كِتَابُ النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏ \"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Abdullah bin ‘Ukaym said:“There came to us a letter from the Prophet (ﷺ) (saying): ‘No not make use of the untanned skin and sinew of dead animals.’”",
          "ur": "عبداللہ بن عکیم کہتے ہیں کہ ہمارے پاس نبی اکرم صلی اللہ علیہ وسلم کا مکتوب آیا کہ مردار کی کھال اور پٹھوں سے فائدہ نہ اٹھاؤ ۱؎۔",
          "fr": "Rapporté par ‘Abdullah bin ‘Ukaym : Nous avons reçu une lettre du Prophète ﷺ disant : “N’utilisez pas la peau ni les tendons d’animaux morts s’ils ne sont pas tannés.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Jarir] dari [Manshur]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [As Syaibani]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] semuanya dari [Al Hakam] dari [Abdurrahman bin Abu Laila] dari [Abdullah bin 'Ukaim] dia berkata, \"Surat Nabi shallallahu 'alaihi wasallam datang menemui kami (isinya): \"Janganlah kalian mengambil manfaat dari bangkai, baik kulit maupun tulangnya",
          "tr": "Abdullah bin Ükeym (r.a.)'den; Şöyle demiştir: Ölü hayvan'ın derisinden ve sinir telinden istifâde etmeyiniz, diye bize Nebi (Sallallahu Aleyhi ve Sellem)'in mektubu geldi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 3614,
      "arabicNumber": 3614,
      "book": 32,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ، قَالَ كَانَ لِنَعْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قِبَالاَنِ مَثْنِيٌّ شِرَاكُهُمَا ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Abdullah bin ‘Abbas said:“The sandals of the Prophet (ﷺ) had two thongs doubled around their straps.”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی جوتیوں کے دو تسمے تھے، جو آگے سے دہرے ہوتے ۱؎۔",
          "fr": "Rapporté par ‘Abdullah bin ‘Abbas : Les sandales du Prophète ﷺ avaient deux lanières enroulées autour de leurs brides",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Khalid Al Khadzdza`] dari [Abdullah bin Al Harits] dari [Abdullah bin Abbas] dia berkata, \"Sandal Nabi shallallahu 'alaihi wasallam memiliki dua tali yang bercabang dua",
          "tr": "Abdullah bin Abbâs (r.a.)'dan; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in ayakkabısının tasması çift olan iki kıbâlesi (parmaklar arasına geçirilen tasmacık) vardı. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih olup ravileri sıka, güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 65
      }
    },
    {
      "hadithNumber": 3615,
      "arabicNumber": 3615,
      "book": 32,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ لِنَعْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قِبَالاَنِ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas said:“The sandals of the Prophet (ﷺ) had two thongs.”",
          "ur": "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی جوتیوں کے دو تسمے تھے۔",
          "fr": "Rapporté par Anas : Les sandales du Prophète ﷺ avaient deux lanières",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] dari [Hammam] dari [Qatadah] dari [Anas] dia berkata, \"Sandal Nabi shallallahu 'alaihi wasallam memiliki dua tali",
          "tr": "Enes (r.a.)'den; Şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in ayakkabısının iki kıbâlesi (parmaklar arasına geçirilen tasmacık) vardı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 3616,
      "arabicNumber": 3616,
      "book": 32,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا خَلَعَ فَلْيَبْدَأْ بِالْيُسْرَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:“When anyone of you puts on his sandals, let him start with the right, and when he takes them off, let him start with the left.”",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی جوتا پہنے تو دائیں پیر سے شروع کرے، اور اتارے تو پہلے بائیں پیر سے اتارے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : “Quand l’un de vous met ses sandales, qu’il commence par le pied droit, et quand il les enlève, qu’il commence par le pied gauche.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Muhammad bin Ziyad] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian memakai sandal, hendaklah ia memulainya dengan yang kanan, dan jika melepasnya hendaknya ia memulainya dari yang sebelah kiri",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Biriniz ayakkabısını giyeceği zaman sağ ayağı ile başlasın, çıkaracağı zaman da önce sol ayağını çıkarsın.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 67
      }
    },
    {
      "hadithNumber": 3617,
      "arabicNumber": 3617,
      "book": 32,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ لاَ يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدٍ وَلاَ خُفٍّ وَاحِدٍ لِيَخْلَعْهُمَا جَمِيعًا أَوْ لِيَمْشِ فِيهِمَا جَمِيعًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said; “None of you should walk in one sandal or in one leather sock. Let him take them both off or walk in both of them.”",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی بھی شخص ایک جوتا یا ایک موزہ پہن کر نہ چلے، یا تو دونوں جوتے اور موزے اتار دے یا پھر دونوں جوتے اور موزے پہن لے ۱؎۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : “Aucun de vous ne doit marcher avec une seule sandale ou un seul chausson en cuir. Qu’il les enlève toutes les deux ou qu’il marche avec les deux.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdullah bin Idris] dari [Ibnu Ajlan] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian berjalan dengan mengenakan satu sandal atau satu khuf (sepatu), hendaknya ia melepas kedua-duanya atau memakainya semua",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: Sîzden birisi tek bir ayakkabı, ne de tek bir mest ile (halkın gözü önünde) yürümez (yâni yürümesin). Ya ikisini birden çıkarsın (yalın ayak yürüsün), ya da her ikisinde yürüsün (yâni giyin.li yürüsün). Not: Zevâid'de şöyle denilmiştir : Bunun senedi sahih olup râvileri sıka zâtlardır. Bu hadisi müelliften başkası da rivayet etmiştir. Fakat müellif mesti ilave etmiş. Bu nedenle ben bu hadisi Zevâid nevine dâhil ettim"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Bukhari And Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 68
      }
    },
    {
      "hadithNumber": 3618,
      "arabicNumber": 3618,
      "book": 32,
      "hadithInBook": 69,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah said:“The Messenger of Allah (ﷺ) forbade putting on sandals whilst standing.”",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کھڑے ہو کر جوتا پہننے سے منع فرمایا",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a interdit de mettre ses sandales en restant debout",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang memakai sandal sambil berdiri",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) adam'ın ayakkabısını ayakta giymesini yasaklamıştır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 3619,
      "arabicNumber": 3619,
      "book": 32,
      "hadithInBook": 70,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى النَّبِيُّ ـ صلى الله عليه وسلم ـ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The Prophet (ﷺ) forbade putting on sandals whilst standing.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے کھڑے کھڑے جوتا پہننے سے منع فرمایا۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Prophète ﷺ a interdit de mettre ses sandales en restant debout",
          "id": "Telah menceritakan kepada kami [Ali bin Muhammad] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang memakai sandal sambil berdiri",
          "tr": "Îbn-İ Ömer (r.a.)'dan rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) adam'ın ayakkabısını ayakta giymesini yasaklamıştır. Not: Zevâid yazarı bu hadisin Zevâid nevinden olduğuna işaret etmiş, fakat senedin durumuna değinmemiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 70
      }
    },
    {
      "hadithNumber": 3620,
      "arabicNumber": 3620,
      "book": 32,
      "hadithInBook": 71,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا دَلْهَمُ بْنُ صَالِحٍ الْكِنْدِيُّ، عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ الْكِنْدِيِّ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّجَاشِيَّ، أَهْدَى لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ خُفَّيْنِ سَاذَجَيْنِ أَسْوَدَيْنِ فَلَبِسَهُمَا ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn Buraidah, from his father, that an-Najashi sent a pair of pure black Khuff as a gift to the Prophet (ﷺ) of, which he wore",
          "ur": "بریدہ رضی اللہ عنہ سے روایت ہے کہ نجاشی ( اصحمہ بن بحر ) نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں دو کالے اور چمڑے کے سادہ موزے تحفہ میں بھیجے تو آپ صلی اللہ علیہ وسلم نے انہیں پہنا۔",
          "fr": "Rapporté par Ibn Buraidah, d’après son père : An-Najashi a offert au Prophète ﷺ une paire de khuffs noirs purs, et il les a portés",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Dalham bin Shalih Al Kindi] dari [Hujair bin Abdullah Al Kindi] dari [Ibnu Buraidah] dari [ayahnya], bahwa An Najasyi memberi hadiah kepada Rasulullah shallallahu 'alaihi wasallam dua khuf (sepatu) yang berwarna hitam polos, kemudian beliau mengenakannya",
          "tr": "Büreyde (r.a.)'den rivayet edildiğine göre: Necâşİ, Resulullah (Sallallahu Aleyhi ve Sellem)'e sâde siyah renkli bir çift mest hediye etti. O da onu giydi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 71
      }
    },
    {
      "hadithNumber": 3621,
      "arabicNumber": 3621,
      "book": 32,
      "hadithInBook": 72,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ أَبَا سَلَمَةَ، وَسُلَيْمَانَ بْنَ يَسَارٍ، يُخْبِرَانِ عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah attributed to the Prophet (ﷺ):“The Jews and the Christians do not dye (their hair), so differ from them.”",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: یہود و نصاریٰ خضاب نہیں لگاتے، تو تم ان کی مخالفت کرو ( یعنی خضاب لگاؤ ) ۔",
          "fr": "Rapporté par Abu Huraira, attribué au Prophète ﷺ : “Les Juifs et les Chrétiens ne teignent pas leurs cheveux, alors distinguez-vous d’eux.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dia mendengar [Abu Salamah] dan [Sulaiman bin Yasar], keduanya mengabarkan kepadanya dari [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Orang-orang Yahudi dan Nashrani tidak menyemir rambut, oleh karena itu selisihilah mereka",
          "tr": "Ebû Hureyre (r.a.)'den rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Yahudiler ve Hiristiyanlar (ak sakallarım) boyamazlar. Siz onlara muhalefet ediniz.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 72
      }
    },
    {
      "hadithNumber": 3622,
      "arabicNumber": 3622,
      "book": 32,
      "hadithInBook": 73,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الأَجْلَحِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Dharr that the Messenger of Allah (ﷺ) said:“The best things with which you change gray hair are henna and Katam.”",
          "ur": "ابوذر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بالوں کی سفیدی بدلنے کے لیے سب سے بہترین چیز مہندی اور کتم ہے ۱؎۔",
          "fr": "Rapporté par Abu Dharr : Le Messager d’Allah ﷺ a dit : “Les meilleures choses pour teindre les cheveux blancs sont le henné et le katam.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdullah bin Idris] dari [Al Ajlah] dari [Abdullah bin Buraidah] dari [Abu Al Aswad Ad Dailami] dari [Abu Dzar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, sebaik-baik yang kalian gunakan untuk merubah uban adalah pohon pacar (inai) dan katam (sejenis tumbuhan)",
          "tr": "Ebû Zer' (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Saç ve sakalın beyazlığını değiştirmek için kullandığınız en güzel şey kına ve ketemdır.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 73
      }
    },
    {
      "hadithNumber": 3623,
      "arabicNumber": 3623,
      "book": 32,
      "hadithInBook": 74,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ عُثْمَانَ بْنِ مَوْهَبٍ، قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ ‏.‏ قَالَ فَأَخْرَجَتْ إِلَىَّ شَعَرًا مِنْ شَعَرِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مَخْضُوبًا بِالْحِنَّاءِ وَالْكَتَمِ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Uthman bin Mawhab said:“I entered upon Umm Salamah and she brought out for me a hair of the Messenger of Allah (ﷺ), which was dyed with henna and Katam.”",
          "ur": "عثمان بن موہب کہتے ہیں کہ میں ام المؤمنین ام سلمہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم کا ایک بال نکال کر مجھے دکھایا، جو مہندی اور کتم سے رنگا ہوا تھا۔",
          "fr": "Rapporté par ‘Uthman bin Mawhab : Je suis entré chez Umm Salamah et elle m’a montré un cheveu du Messager d’Allah ﷺ, qui était teint avec du henné et du katam",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Sallam bin Abu Muthi'] dari [Utsman bin Mauhab] dia berkata, \"Saya menemui Ummu Salamah.\" Utsman melanjutkan, \"Kemudian [Ummu Salamah] mengeluarkan sehelai rambut dari rambut Rasulullah shallallahu 'alaihi wasallam yang telah di semir dengan inai dan katam (semacam tumbuhan)",
          "tr": "Osman (bin Abdillah) bin Mevhib (r.a.)'den; Şöyle demiştir: Ben, (Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi) Ümmü Seleme (r.anha)'nın huzuruna çıktım. Osman demiştir ki t Ümmü Seleme, Resulullah (Sallallahu Aleyhi ve Sellem)'in (saç- sakal) kıllarından kına ve ketem ile boyanmış bir kılı (sakladığı yerden) çıkarıp bana gösterdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 74
      }
    },
    {
      "hadithNumber": 3624,
      "arabicNumber": 3624,
      "book": 32,
      "hadithInBook": 75,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ لَيْثٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جِيءَ بِأَبِي قُحَافَةَ يَوْمَ الْفَتْحِ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَكَأَنَّ رَأْسَهُ ثَغَامَةٌ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ اذْهَبُوا بِهِ إِلَى بَعْضِ نِسَائِهِ فَلْتُغَيِّرْهُ وَجَنِّبُوهُ السَّوَادَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Jabir that he said:“Abu Quhaifah was brought to the Prophet (ﷺ) on the Day of the Conquest (of Makkah), and his head was all white. The Messenger of Allah (ﷺ) said: ‘Take him to some of his womenfolk and let them change this, but avoid black.’”",
          "ur": "جابر رضی اللہ عنہ کہتے ہیں کہ فتح مکہ کے دن ابوقحافہ رضی اللہ عنہ کو نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا، اس وقت ان کے بال سفید گھاس کی طرح تھے، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: انہیں ان کی کسی عورت کے پاس لے جاؤ کہ وہ انہیں بدل دے ( یعنی خضاب لگا دے ) ، لیکن کالے خضاب سے انہیں بچاؤ ۱؎۔",
          "fr": "Rapporté par Jabir : Abu Quhaifah a été amené au Prophète ﷺ le jour de la conquête de La Mecque, et sa tête était toute blanche. Le Messager d’Allah ﷺ a dit : “Emmenez-le auprès de ses femmes pour qu’elles changent cela, mais évitez le noir.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Laits] dari [Abu Az Zubair] dari [Jabir] dia berkata, \"Ketika penaklukan kota Makkah Abu Quhafah di datangkan kepada Nabi shallallahu 'alaihi wasallam dan seakan-akan rambutnya seperti pohon tsaghamah (sejenis pohon yang buah dan bunganya berwarna putih). Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Bawalah ia menemui salah seorang dari isterinya supaya ia menyemir rambutnya, dan hindarilah warna hitam",
          "tr": "Cabir (r.a.)'den; şöyle demiştir: (Ebu Bekr-i Sıddık'ın babası) Mekke'nin fethi günü Nebi (Sallallahu Aleyhi ve Sellem)'in huzuruna getirildi. Onun başı -----ve----- sakalı da bir sağame (bitkisi) gibiydi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) «Bunu kadınlarından birine götürün de kadın bunun saçının rengini değiştirsin ve ve bunu siyah boyadan uzak tutunuz» buyurdu. Not: Zevaid'de şöyle denilmiştir: Bu hadisin aslını Müslim de rivayet etmiştir. Fakat musannefin rivayetine ait senedde Leys bin Selim bulunur. Bu raviyi cumhur zayıf saymıştır. Diğer tahric: Bu hadisi: Müslim, Ebu Davud ve Nesai tahric ettiler"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 75
      }
    },
    {
      "hadithNumber": 3625,
      "arabicNumber": 3625,
      "book": 32,
      "hadithInBook": 76,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ، مُحَمَّدُ بْنُ فِرَاسٍ حَدَّثَنَا عُمَرُ بْنُ الْخَطَّابِ بْنِ زَكَرِيَّا الرَّاسِبِيُّ، حَدَّثَنَا دَفَّاعُ بْنُ دَغْفَلٍ السَّدُوسِيُّ، عَنْ عَبْدِ الْحَمِيدِ بْنِ صَيْفِيٍّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، صُهَيْبِ الْخَيْرِ قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏ \"‏ إِنَّ أَحْسَنَ مَا اخْتَضَبْتُمْ بِهِ لَهَذَا السَّوَادُ أَرْغَبُ لِنِسَائِكُمْ فِيكُمْ وَأَهْيَبُ لَكُمْ فِي صُدُورِ عَدُوِّكُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Suhaib Al-Khair said:“The Messenger of Allah (ﷺ) said: ‘The best thing with which you can dye your hair is this black (dye). It makes your women desire you and creates fear in the hearts of your enemies.’”",
          "ur": "صہیب الخیر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو خضاب تم لگاتے ہو ان میں بہترین کالا خضاب ہے، اس سے عورتیں تمہاری طرف زیادہ راغب ہوتی ہیں، اور تمہارے دشمنوں کے دلوں میں تمہاری ہیبت زیادہ بیٹھتی ہے ۔",
          "fr": "Rapporté par Suhaib Al-Khair : Le Messager d’Allah ﷺ a dit : “La meilleure chose pour teindre vos cheveux est ce noir (colorant). Cela rend vos femmes attirées par vous et fait craindre vos ennemis.”",
          "id": "Telah menceritakan kepada kami [Abu Hurairah Ash Shairafi Muhammad bin Firas] telah menceritakan kepada kami [Umar bin Al Khaththab bin Zakaria Ar Rasibi] telah menceritakan kepada kami [Daffa' bin Daghfal As Sadusi] dari [Abdul Hamid bin Shaifi] dari [Ayahnya] dari kakeknya [Shuihaib Al Khair] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, sesuatu yang paling baik kalian gunakan untuk mengecat rambut adalah warna hitam ini, karena dia lebih disukai oleh isteri-isteri kalian, dan kalian bisa membuat takut musuh-musuh kalian",
          "tr": "Suhaybu'l-Hayr (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Ak saç ve sakalınızın rengini değiştirmekte kullandığınız en güzel renk şüphesiz şu siyah olanıdır, kadınlarınızı size daha fazla rağbet ettiricidir ve düşmanlarınızın kalblerine sizin için daha çok heybet - korku salıcıdır.» Not: Bu hadis, siyah boyanın yasaklığına dair hadise, ters düşer. O hadis, sened bakımından daha kuvvetlidir. Keza, iki hadis arasında muhalefet olduğunda yasaklayıcı olanı öncelik alır. Zevaid'de bunun senedinin hasen olduğu belirtilmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 76
      }
    },
    {
      "hadithNumber": 3626,
      "arabicNumber": 3626,
      "book": 32,
      "hadithInBook": 77,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّ عُبَيْدَ بْنَ جُرَيْجٍ، سَأَلَ ابْنَ عُمَرَ قَالَ رَأَيْتُكَ تُصَفِّرُ لِحْيَتَكَ بِالْوَرْسِ فَقَالَ ابْنُ عُمَرَ أَمَّا تَصْفِيرِي لِحْيَتِي فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُصَفِّرُ لِحْيَتَهُ ‏.‏",
        "translations": {
          "en": "It was narrated from Sa’eed bin Abu Sa’eed that ‘Ubaid bin Juraij asked Ibn ‘Umar:“I see that you dye your beard yellow with Wars.” Ibn ‘Umar said: “As for my dyeing of my beard yellow with Wars, I saw the Messenger of Allah (ﷺ) dyeing his beard yellow.”",
          "ur": "عبید بن جریج سے روایت ہے کہ انہوں نے ابن عمر رضی اللہ عنہما سے پوچھا: میں آپ کو اپنی داڑھی ورس سے زرد ( پیلی ) کرتے دیکھتا ہوں؟، ابن عمر رضی اللہ عنہما نے کہا: میں اس لیے زرد ( پیلی ) کرتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اپنی داڑھی زرد ( پیلی ) کرتے دیکھا۔",
          "fr": "Rapporté par Sa’eed bin Abu Sa’eed, d’après ‘Ubaid bin Juraij qui a demandé à Ibn ‘Umar : “Je vois que tu teins ta barbe en jaune avec du Wars.” Ibn ‘Umar a répondu : “Si je teins ma barbe en jaune avec du Wars, c’est parce que j’ai vu le Messager d’Allah ﷺ faire de même.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari ['Ubaidullah bin Umar] dari [Sa'id bin Abu Sa'id] bahwa [Ubaid bin Juraij] bertanya kepada [Ibnu Umar] ia berkata, \"Aku melihatmu mengecat kuning jenggotmu dengan Al Wars (sejenis tumbuhan).\" Lantas Ibnu Umar berkata, \"Aku mengecat kuning jenggotku ini, karena aku melihat Rasulullah shallallahu 'alaihi wasallam mengecat kuning jenggotnya",
          "tr": "(Medineli Tabiilerden) Said bin Ebi Said'den rivayet edildiğine göre Ubey bin Cüreyc (r.a.), İbn-i Ömer (r.a.)'e: Sakalını vers (yani Yemen za'feran'ı) ile boyamış olarak seni görüyorum. diyerek bunun hükmünü sormuş. İbn-i Ömer de: Sakalımı sarı'ya boyamama gelince, sebebi şudur: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in sakalını sarıya boyadığını kesinlikle gördüm, diye cevap vermiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 77
      }
    },
    {
      "hadithNumber": 3627,
      "arabicNumber": 3627,
      "book": 32,
      "hadithInBook": 78,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ حُمَيْدِ بْنِ وَهْبٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى رَجُلٍ قَدْ خَضَبَ بِالْحِنَّاءِ فَقَالَ ‏\"‏ مَا أَحْسَنَ هَذَا ‏\"‏ ‏.‏ ثُمَّ مَرَّ بِآخَرَ قَدْ خَضَبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا ‏\"‏ ‏.‏ ثُمَّ مَرَّ بِآخَرَ قَدْ خَضَبَ بِالصُّفْرَةِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ ‏\"‏ ‏.‏ قَالَ وَكَانَ طَاوُسٌ يُصَفِّرُ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Abbas said:“The Prophet (ﷺ) passed by a man who had dyed his hair with henna and said: ‘How handsome this is!’ Then he passed by another who had dyed his hair with henna and Katam, and said: ‘This one is more handsome than that one.’ Then he passed by another who had dyed his hair yellow and said: ‘This one is more handsome than all of them.’”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کا گزر ایک ایسے شخص کے پاس ہوا جس نے مہندی کا خضاب لگا رکھا تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ کتنا اچھا ہے ، پھر آپ ایک دوسرے شخص کے پاس سے گزرے جس نے مہندی اور کتم ( وسمہ ) کا خضاب لگایا تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: یہ اس سے اچھا ہے ! پھر آپ کا گزر ایک دوسرے کے پاس ہوا جس نے زرد خضاب لگا رکھا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ ان سب سے اچھا اور بہتر ہے ۔ ابن طاؤس کہتے ہیں کہ اسی لیے طاؤس بالوں کو زرد خضاب کیا کرتے تھے",
          "fr": "Rapporté par Ibn ‘Abbas : Le Prophète ﷺ est passé devant un homme qui avait teint ses cheveux avec du henné et a dit : “Comme c’est beau !” Puis il est passé devant un autre qui avait teint ses cheveux avec du henné et du katam, et a dit : “Celui-ci est plus beau que le précédent.” Ensuite, il est passé devant un autre qui avait teint ses cheveux en jaune et a dit : “Celui-ci est le plus beau de tous.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Humaid bin Wahb] dari [Ibnu Thawus] dari [Thawus] dari [Ibnu Abbas] dia berkata, \"Nabi shallallahu 'alaihi wasallam melewati seorang lelaki yang telah mengecat rambutnya dengan inai, maka beliau bersabda: \"Alangkah bagusnya ini.\" Kemudian beliau melewati orang lain yang telah mengecat dengan inai dan katam (sejenis pohon inai), maka beliau bersabda: \"Ini lebih bagus ketimbang yang ini.\" Kemudian beliau melewati orang yang lainnya yang telah mengecat dengan shufrah (sejenis tumbuhan yang baunya wangi dan berwarna kuning), maka beliau bersabda: \"Ini lebih baik dari semuanya.\" Ibnu Thawus berkata, \"Oleh karenanya Thawus mengecat (rambutnya) dengan shufrah",
          "tr": "İbn-i Abbas (r.a.)'den şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) ak saç ve sakalını kına ile boyamış bir adam'ın yanından geçti ve: «Bu ne güzeldir,» buyurdu. Sonra saç ve sakalını kına ve ketem ile boyamış başka bir adam'ın yanından geçti ve «Bu ondan daha güzeldir,» buyurdu. Daha sonra saç ve sakalını sarıya boyamış bir adamın yanından geçti ve: «Bu o'nun hepsinden daha güzeldir.» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 78
      }
    },
    {
      "hadithNumber": 3628,
      "arabicNumber": 3628,
      "book": 32,
      "hadithInBook": 79,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ هَذِهِ مِنْهُ بَيْضَاءُ ‏.‏ يَعْنِي عَنْفَقَتَهُ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Juhaifah said:“I saw the Messenger of Allah (ﷺ), and this part of his hair was white” – meaning the tuft of hair between the lower lip and the chin",
          "ur": "ابوحجیفہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے یہ بال یعنی داڑھی بچہ سفید دیکھی۔",
          "fr": "Rapporté par Abu Juhaifah : J’ai vu le Messager d’Allah ﷺ, et cette partie de ses cheveux était blanche – c’est-à-dire la touffe entre la lèvre inférieure et le menton",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Abu Juhaifah] dia berkata, \"Saya melihat Rasulullah shallallahu 'alaihi wasallam pada bagian ininya putih.\" -maksudnya adalah pada bagian rambut di bawah bibir",
          "tr": "Ebu Cuhayfe (r.a.)'den; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'i gördüm. O'nun (sakalının) şurası beyazlaşmıştı. Yani Anfakası. (alt dudağı veya bura ile alt çenesi arası ağarmıştı)"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 79
      }
    },
    {
      "hadithNumber": 3629,
      "arabicNumber": 3629,
      "book": 32,
      "hadithInBook": 80,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، وَابْنُ أَبِي عَدِيٍّ، عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ أَخَضَبَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ إِنَّهُ لَمْ يَرَ مِنَ الشَّيْبِ إِلاَّ نَحْوَ سَبْعَةَ عَشَرَ أَوْ عِشْرِينَ شَعَرَةً فِي مُقَدَّمِ لِحْيَتِهِ ‏.‏",
        "translations": {
          "en": "It was narrated that Humaid said:“Anas bin Malik was asked: ‘Did the Messenger of Allah (ﷺ) dye his hair?’ He said: ‘He did not have any white hair apart from approximately seventeen or twenty hairs at the front of his beard.’”",
          "ur": "حمید کہتے ہیں کہ انس بن مالک رضی اللہ عنہ سے سوال کیا گیا: کیا رسول اللہ صلی اللہ علیہ وسلم نے خضاب لگایا ہے؟ کہا: میں نے آپ کی داڑھی میں سفید بال دیکھے ہی نہیں سوائے ان سترہ یا بیس بالوں کے جو آپ کی داڑھی کے سامنے والے حصے میں تھے۔",
          "fr": "Rapporté par Humaid : On a demandé à Anas bin Malik : “Le Messager d’Allah (ﷺ) teignait-il ses cheveux ?” Il a répondu : “Il n’avait pas de cheveux blancs, sauf environ dix-sept ou vingt cheveux à l’avant de sa barbe.”",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Khalid bin Al Harits] dan [Ibnu Abu 'Adi] dari [Humaid] dia berkata, \" [Anas bin Malik] ditanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam menyemir rambutnya?\" dia menjawab, \"Sesungguhnya uban beliau tidak terlihat kecuali hanya tujuh belas helai atau dua puluh helai di jenggot bagian depan",
          "tr": "Humeyd (r.a.)'den; şöyle demiştir: Enes bin Malik'e Resulullah (Sallallahu Aleyhi ve Sellem) (saç sakalını) boyadımı diye soruldu. Enes: Sakalanın ön kısmında on yedi veya yirmi kadar saç telinden başka O saç sakal ağarmasını görmedi. diye cevap verdi. Not: Zevaid'de şöyle denilmiştir: Bu isnad sahih olup ravileri güvenilir zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 80
      }
    },
    {
      "hadithNumber": 3630,
      "arabicNumber": 3630,
      "book": 32,
      "hadithInBook": 81,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ شَرِيكٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ شَيْبُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ نَحْوَ عِشْرِينَ شَعَرَةً ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The white hair of the Prophet (ﷺ) numbered approximately twenty.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا بڑھاپا تقریباً ً بیس بال کا تھا ۱؎۔",
          "fr": "Rapporté par Ibn ‘Umar : Les cheveux blancs du Prophète (ﷺ) étaient au nombre d’environ vingt",
          "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin Al Walid Al Kindi] telah menceritakan kepada kami [Yahya bin Adam] dari [Syarik] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rambut uban Rasulullah shallallahu 'alaihi wasallam hanya sekitar dua puluh helai",
          "tr": "İbn-i Ömer (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'in (başında ve sakalında) beyazlaşan saç teli sayısı yirmi kadar oldu. Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahih olup ravileri sika zatlardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 81
      }
    },
    {
      "hadithNumber": 3631,
      "arabicNumber": 3631,
      "book": 32,
      "hadithInBook": 82,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَتْ أُمُّ هَانِئٍ دَخَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ ‏.‏ تَعْنِي ضَفَائِرَ ‏.‏",
        "translations": {
          "en": "It was narrated that Mujahid said:“Umm Hani said: ‘When the Messenger of Allah (ﷺ) entered Makkah he had four braids.’”",
          "ur": "ام ہانی رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب مکہ میں ( فتح کے روز ) داخل ہوئے، تو آپ کے سر میں چار چوٹیاں تھیں ۱؎۔",
          "fr": "Rapporté par Mujahid : Umm Hani a dit : “Quand le Messager d’Allah (ﷺ) est entré à La Mecque, il avait quatre tresses.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu Abu Najih] dari [Mujahid] dia berkata, \" [Ummu Hani`] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam memasuki kota Makkah, beliau memiliki empat ghada`ir, yaitu jalinan rambut yang terurai",
          "tr": "Ümmü Hani (r.anha)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Mekke'ye dört ğadiresi olduğu halde girdi. Ümmü Hani (ğadire ile) saç örgülerini kasdeder"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 82
      }
    },
    {
      "hadithNumber": 3632,
      "arabicNumber": 3632,
      "book": 32,
      "hadithInBook": 83,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ أَهْلُ الْكِتَابِ يَسْدُلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرِقُونَ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ ‏.‏ قَالَ فَسَدَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Abbas said:“The People of the Book used to let their hair hang down, and the idolaters used to part their hair. The Messenger of Allah (ﷺ) liked to be more like the People of the Book. So the Messenger of Allah (ﷺ) let his forelock hang down, then after that he parted it.”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ اہل کتاب اپنے بالوں کو پیشانی پر لٹکائے رکھتے تھے، اور مشرکین مانگ نکالا کرتے تھے، رسول اللہ صلی اللہ علیہ وسلم اہل کتاب کی موافقت پسند فرماتے تھے تو آپ صلی اللہ علیہ وسلم بھی اپنی پیشانی پر بال لٹکائے رکھتے، پھر بعد میں آپ مانگ نکالنے لگے",
          "fr": "Rapporté par Ibn ‘Abbas : Les Gens du Livre laissaient leurs cheveux retomber, tandis que les idolâtres faisaient une raie. Le Messager d’Allah (ﷺ) préférait ressembler aux Gens du Livre. Donc, il a laissé sa mèche retomber, puis ensuite il a fait une raie",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Adam] dari [Ibrahim bin Sa'd] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dia berkata, \"Para ahli kitab (Yahudi dan Nashrani) membelah dua rambut mereka, sedangkan orang-orang Musyrik mengurai rambut mereka, dan Rasulullah shallallahu 'alaihi wasallam senang seperti ahli Kitab.\" Anas berkata, \"Rasulullah shallallahu 'alaihi wasallam mengurai rambutnya dan membelah menjadi dua",
          "tr": "İbn-i Abbas (r.a.)'den; şöyle demiştir: Ehl-i Kitap saçlarını alınlarının üstüne salıverirlerdi. Müşrikler de ikiye ayırırlardı. Resulullah (Sallallahu Aleyhi ve Sellem) de Ehl-i kitab'a uygun olmaktan hoşlanırdı. İbn-i Abbas demiştir ki: Resulullah (Sallallahu Aleyhi ve Sellem) bu nedenle perçemini alnının üstüne salıverdi, bir süre sonra saçını ikiye ayırıp aşağıya salıverdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 83
      }
    },
    {
      "hadithNumber": 3633,
      "arabicNumber": 3633,
      "book": 32,
      "hadithInBook": 84,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَفْرِقُ خَلْفَ يَافُوخِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ أَسْدِلُ نَاصِيَتَهُ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“I used to part the hair of the Messenger of Allah (ﷺ) behind his crown, and let his forelock hang down.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے سر پر چندیا کے پچھلے حصے میں مانگ نکالتی تھی اور سامنے کے بال پیشانی پر لٹکتے چھوڑ دیتی تھی۔",
          "fr": "Rapporté par ‘Aishah : Je faisais une raie dans les cheveux du Messager d’Allah (ﷺ) à l’arrière de sa tête, et je laissais sa mèche retomber",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ishaq bin Manshur] dari [Ibrahim bin Sa'd] dari [Ibnu Ishaq] dari [Yahya bin 'Abbad] dari [ayahnya] dari [Aisyah] dia berkata, \"Aku membelah (rambut) di belakang ubun-ubun Rasulullah shallallahu 'alaihi wasallam, kemudian aku menguraikannya hingga ke dahi",
          "tr": "Aişe (r.anha)'dan; şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in (saçını taradığımda) başının ortasından itibaren saçını ikiye bölerek sağ ve sol taraf'a salıverir, sonra perçemini alnının üstüne bırakırdım"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 84
      }
    },
    {
      "hadithNumber": 3634,
      "arabicNumber": 3634,
      "book": 32,
      "hadithInBook": 85,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ شَعَرُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَعَرًا رَجِلاً بَيْنَ أُذُنَيْهِ وَمَنْكِبَيْهِ",
        "translations": {
          "en": "It was narrated that Anas said:“The hair of the Messenger of Allah (ﷺ) was wavy, and (hung down) between his ears and his shoulders.”",
          "ur": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے بال دونوں کانوں اور مونڈھوں کے درمیان سیدھے تھے ۱؎۔",
          "fr": "Rapporté par Anas : Les cheveux du Messager d’Allah (ﷺ) étaient ondulés et tombaient entre ses oreilles et ses épaules",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah memberitakan kepada kami [Jariri bin Hazim] dari [Qatadah] dari [Anas] dia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam lurus ikal, terurai antara telinga dan pundaknya",
          "tr": "Enes (r.a.)'den rivayet'e göre Resulullah (Sallallahu Aleyhi ve Sellem)'in saç'ı recil (yani ne düz ne de kıvırcık değil, hafif dalgalı) bir saç idi. kulakları ile omuzları arasına kadar (uzun) idi. Diğer tahric: Bu Hadisi Buhari ve Müslim de tahric etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 85
      }
    },
    {
      "hadithNumber": 3635,
      "arabicNumber": 3635,
      "book": 32,
      "hadithInBook": 86,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَعَرٌ دُونَ الْجُمَّةِ وَفَوْقَ الْوَفْرَةِ.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“The Messenger of Allah (ﷺ) had hair that came between his earlobes and his shoulders.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے بال مونڈھوں سے اوپر اور کانوں سے نیچے ہوتے تھے۔",
          "fr": "Rapporté par ‘Aishah : Le Messager d’Allah (ﷺ) avait des cheveux qui descendaient entre ses lobes d’oreilles et ses épaules",
          "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim] telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Abdurrahman bin Abu Az Zinad] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memiliki rambut yang menjuntai tidak lebih dari pundaknya, dan di atas kedua daun telinganya",
          "tr": "Aişe (r.anha)'dan; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'in onuzlarına ulaşan yan ve kulak yumuşaklığını geçen saç'ı oldu. Diğer tahric: Bu Hadis'i Ebu Davud ve Tirmizi de tahric etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 86
      }
    },
    {
      "hadithNumber": 3636,
      "arabicNumber": 3636,
      "book": 32,
      "hadithInBook": 87,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، وَسُفْيَانُ بْنُ عُقْبَةَ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ رَآنِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَلِي شَعَرٌ طَوِيلٌ فَقَالَ ‏\"‏ ذُبَابٌ ذُبَابٌ ‏\"‏ ‏.‏ فَانْطَلَقْتُ فَأَخَذْتُهُ فَرَآنِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Wa’il bin Hujr said:“The Prophet (ﷺ) saw me when I had long hair. He said: ‘Bad news, bad news!’ So I went away and cut it short. Then the Prophet (ﷺ) saw me and said: ‘I did not mean you, but this is better.’”",
          "ur": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مجھے دیکھا کہ میرے بال لمبے ہیں تو فرمایا: منحوس ہے منحوس ، یہ سن کر میں چلا آیا، اور میں نے بالوں کو چھوٹا کیا، پھر جب نبی اکرم صلی اللہ علیہ وسلم نے مجھے دیکھا تو فرمایا: میں نے تم کو نہیں کہا تھا، ویسے یہ بال زیادہ اچھے ہیں ۱؎۔",
          "fr": "Rapporté par Wa’il bin Hujr : Le Prophète (ﷺ) m’a vu alors que j’avais les cheveux longs. Il a dit : “Mauvaise nouvelle, mauvaise nouvelle !” Alors je suis parti les couper courts. Ensuite, le Prophète (ﷺ) m’a revu et a dit : “Je ne parlais pas de toi, mais c’est mieux ainsi.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dan [Sufyan bin 'Uqbah] dari [Sufyan] dari ['Ashim bin Kulaib] dari [Ayahnya] dari [Wa`il bin Hujr] dia berkata, \"Nabi shallallahu 'alaihi wasallam melihatku sementara aku memiliki rambut yang panjang, beliau lalu bersabda: \"Lalat, lalat (maksudnya sesuatu yang buruk).\" Maka aku pun pergi dan memotongnya, kemudian beliau melihatku dan bersabda: \"Sesungguhnya aku tidak bermaksud menyakitimu, akan tetapi hal ini lebih baik",
          "tr": "Vail bin Hucr (r.a.)'den; şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) beni uzun saçım olduğu halde gördü ve: «sinek, sinek,» buyurdu. Ben de gidip hemen saçımı aldım. Sonra Nebi (Sallallahu Aleyhi ve Sellem) beni gördü ve: «Ben seni kasdetmedim. Bununla beraber bu daha güzeldir,» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 87
      }
    },
    {
      "hadithNumber": 3637,
      "arabicNumber": 3637,
      "book": 32,
      "hadithInBook": 88,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهُ ـ صلى الله عليه وسلم ـ عَنِ الْقَزَعِ ‏.‏ قَالَ وَمَا الْقَزَعُ قَالَ أَنْ يُحْلَقَ مِنْ رَأْسِ الصَّبِيِّ مَكَانٌ وَيُتْرَكَ مَكَانٌ ‏.‏",
        "translations": {
          "en": "It was narrated from Nafi’ that Ibn ‘Umar said:“The Messenger of Allah (ﷺ) forbade Qaza’.” He (Nafi’) said: “What is Qaza’?” He said: “It means shaving part of a child’s head and leaving another part.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «قزع» سے منع فرمایا۔ راوی نے کہا: «قزع» کیا ہے؟ انہوں نے جواب دیا: بچے کے سر کے بال ایک جگہ کے کاٹ دئیے جائیں، اور دوسری جگہ کے چھوڑ دئیے جائیں، اسے «قزع» کہتے ہیں۔",
          "fr": "Rapporté par Nafi’ d’après Ibn ‘Umar : Le Messager d’Allah (ﷺ) a interdit le Qaza’. Nafi’ a demandé : “Qu’est-ce que le Qaza’ ?” Il a répondu : “C’est raser une partie de la tête d’un enfant et laisser une autre partie.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [Ubaidullah bin Umar] dari [Umar bin Nafi'] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari qaza'.\" Nafi' berkata, \"Apakah yang di maksud dengan qaza' itu?\" Ibnu Umar menjawab, \"Yaitu mencukur sebagian rambut anak kecil dan membiarkan sebagian yang lain",
          "tr": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre: Kendisi Resulullah (Sallallahu Aleyhi ve Sellem) kaza'dan nehyetti dedi. Ravi (Ömer bin Nafi'): Kaza' nedir diye (Nafi'e) sordu Ravi (Nafi): Çocuğun başından bir yerin saçını kazıyıp başka bir yerin saçını bırakmaktır, diye cevap verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 88
      }
    },
    {
      "hadithNumber": 3638,
      "arabicNumber": 3638,
      "book": 32,
      "hadithInBook": 89,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْقَزَعِ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The Messenger of Allah (ﷺ) forbade Qaza’.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «قزع» سے منع فرمایا ہے۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) a interdit le Qaza’",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Dinar] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari qaza",
          "tr": "İbn-i Ömer (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) kaza'i yasakladı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 89
      }
    },
    {
      "hadithNumber": 3639,
      "arabicNumber": 3639,
      "book": 32,
      "hadithInBook": 90,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ اتَّخَذَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ خَاتَمًا مِنْ وَرِقٍ ثُمَّ نَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ فَقَالَ ‏ \"‏ لاَ يَنْقُشْ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The Messenger of Allah (ﷺ) wore a ring of silver, then he had engraved on it (the words) ‘Muhammad Rasul Allah’ (Muhammad the Messenger of Allah). And he said: ‘No one should have his ring engraved like this ring of mine.’”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی، پھر اس میں «محمد رسول الله» نقش کرایا، اور فرمایا: میری انگوٹھی کا یہ نقش کوئی اور نہ کرائے ۱؎۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) portait une bague en argent, sur laquelle était gravé : “Muhammad Rasul Allah” (Muhammad le Messager d’Allah). Il a dit : “Personne ne doit faire graver sa bague comme la mienne.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ayyub bin Musa] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam membuat cincin dari perak, kemudian mengukirnya dengan tulisan 'Muhammad Rasulullah'.\" Lalu beliau bersabda: \"Janganlah salah seseorang mengukir cincinnya seperti cincinku ini",
          "tr": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) gümüş bir yüzük edindi ve yüzüğe: Muhammeden Resulullah cümlesini nakşettirdi. Sonra «Hiç kimse benim bu yüzüğümün nakşını kendi yüzüğüne nakşetmesin,» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 90
      }
    },
    {
      "hadithNumber": 3640,
      "arabicNumber": 3640,
      "book": 32,
      "hadithInBook": 91,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ اصْطَنَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ خَاتَمًا فَقَالَ ‏ \"‏ إِنَّا قَدِ اصْطَنَعْنَا خَاتَمًا وَنَقَشْنَا فِيهِ نَقْشًا فَلاَ يَنْقُشَنَّ عَلَيْهِ أَحَدٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas bin Malik said:“The Messenger of Allah (ﷺ) had a ring made for him, and he said: ‘I have had a ring made for me and had it engraved, and no one should make a ring with similar engraving.’”",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک انگوٹھی بنوائی، اور فرمایا: ہم نے ایک انگوٹھی بنوائی ہے اور اس میں نقش کرایا ہے، لہٰذا اب اس طرح کوئی اور نقش نہ کرائے ۱؎۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) s’est fait faire une bague et a dit : “Je me suis fait faire une bague et j’y ai fait graver une inscription. Personne ne doit faire une bague avec une gravure semblable.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam membuat cincin, lalu beliau bersabda: \"Sesungguhnya aku telah membuat cincin dan telah mengukirnya dengan suatu ukiran, maka janganlah salah seorang mengukirnya (seperti ukiran yang serupa)",
          "tr": "Enes bin Malik (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bir yüzük yaptırdı sonra şöyle buyurdu: «Biz bir yüzük yaptırdık ve ona bir nakış (Muhammeden Resulullah yazısını) yazdırdık. Sakın hiç kimse onun nakşını kendi yüzüğüne nakşettirmesin.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 91
      }
    },
    {
      "hadithNumber": 3641,
      "arabicNumber": 3641,
      "book": 32,
      "hadithInBook": 92,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ لَهُ فَصٌّ حَبَشِيٌّ وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ ‏.‏",
        "translations": {
          "en": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) wore a ring of silver, in which was an Ethiopian gemstone and the inscription:‘Muhammad Rasul Allah’ (Muhammad the Messenger of Allah).”",
          "ur": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی ایک انگوٹھی بنوائی اس میں ایک حبشی نگینہ تھا، اور اس میں «محمد رسول الله» کا نقش تھا۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) portait une bague en argent, qui avait une pierre précieuse éthiopienne et l’inscription : “Muhammad Rasul Allah” (Muhammad le Messager d’Allah)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Yunus] dari [Az Zuhri] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam membuat cincin dari perak yang mata batunya dari negeri Habsyah dan berukirkan 'Muhammad Rasulullah",
          "tr": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) gümüşten bir yüzük edindi. Yüzüğün habeşi bir taşı vardı. Yüzüğün nakşı da: ''Muhammeden Resulullah '' yazısı idi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 92
      }
    },
    {
      "hadithNumber": 3642,
      "arabicNumber": 3642,
      "book": 32,
      "hadithInBook": 93,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، مَوْلَى عَلِيٍّ عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ التَّخَتُّمِ بِالذَّهَبِ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Ali said:“The Messenger of Allah (ﷺ) forbade wearing gold rings.”",
          "ur": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سونے کی انگوٹھی پہننے سے منع فرمایا۔",
          "fr": "Rapporté par ‘Ali : Le Messager d’Allah (ﷺ) a interdit de porter des bagues en or",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abdullah bin Numair] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Hunain] mantan budak Ali, dari [Ali] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengenakan cincin (yang terbuat) dari emas",
          "tr": "Ali (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) altın yüzük kullanmayı yasak etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 93
      }
    },
    {
      "hadithNumber": 3643,
      "arabicNumber": 3643,
      "book": 32,
      "hadithInBook": 94,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَسَنِ بْنِ سُهَيْلٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ خَاتَمِ الذَّهَبِ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn ‘Umar said:“The Messenger of Allah (ﷺ) forbade gold rings.”",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سونے کی انگوٹھی ( پہننے ) سے منع فرمایا۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) a interdit les bagues en or",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Ali bin Mushir] dari [Yazid bin Abu Ziyad] dari [Al Hasan bin Suhail] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang (mengenakan) cincin dari emas",
          "tr": "İbn-i Ömer (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) altın yüzüğü yasak etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 94
      }
    },
    {
      "hadithNumber": 3644,
      "arabicNumber": 3644,
      "book": 32,
      "hadithInBook": 95,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ أَهْدَى النَّجَاشِيُّ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَلْقَةً فِيهَا خَاتَمُ ذَهَبٍ فِيهِ فَصٌّ حَبَشِيٌّ فَأَخَذَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِعُودٍ وَإِنَّهُ لَمُعْرِضٌ عَنْهُ أَوْ بِبَعْضِ أَصَابِعِهِ ثُمَّ دَعَا ابْنَةَ ابْنَتِهِ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ فَقَالَ ‏ \"‏ تَحَلَّىْ بِهَذَا يَا بُنَيَّةُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah the Mother of the Believers said:“Najashi sent some jewelry as a gift to the Messenger of Allah (ﷺ). Among that was a gold ring with an Ethiopian gemstone. The Messenger of Allah (ﷺ) picked it up with a stick – as if he found it distasteful – or with one of his fingers, then he called for his daughter, Umamah bint Abul-‘As, and said: ‘Wear this, O my daughter.’”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نجاشی نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک چھلا بطور ہدیہ بھیجا، اس میں ایک سونے کی انگوٹھی تھی، انگوٹھی میں حبشی نگینہ تھا، رسول اللہ صلی اللہ علیہ وسلم نے اسے لکڑی سے چھوا، آپ اس سے اعراض کر رہے تھے، یا پھر اپنی ایک انگلی سے چھوا، اور اپنی نواسی امامہ بنت ابی العاص کو بلا کر فرمایا: بیٹی! اسے تم پہن لو ۔",
          "fr": "Rapporté par ‘Aishah, la Mère des Croyants : Najashi a envoyé des bijoux en cadeau au Messager d’Allah (ﷺ). Parmi eux, il y avait une bague en or avec une pierre précieuse éthiopienne. Le Messager d’Allah (ﷺ) l’a prise avec un bâton – comme s’il n’aimait pas la toucher – ou avec un de ses doigts, puis il a appelé sa fille, Umamah bint Abul-‘As, et a dit : “Porte-la, ma fille.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dari [Muhammad bin Ishaq] dari [Yahya bin 'Abbad bin Abdullah bin Az Zubair] dari [Ayahnya] dari [Aisyah] Ummul Mukminin, dia berkata, \"Raja Najasyi menghadiahkan kepada Nabi shallallahu 'alaihi wasallam perhiasan yang di antaranya ada cincin emas yang batu cincinnya dari Habasyah. Rasulullah shallallahu 'alaihi wasallam lalu mengambilnya dengan sebatang kayu dan beliau berpaling darinya -atau mengambilnya dengan jari-jari tangannya-, kemudian beliau memanggil cucu perempuannya, Umamah binti Al 'Ash, sambil bersabda: \"Berhiaslah kamu dengan ini wahai puteriku",
          "tr": "Ümmü'l-Mu'minin Aişe (r.anha)'dan; şöyle demiştir: Necaşi, Resulullah (Sallallahu Aleyhi ve Sellem)'e içinde habeşi kaşlı bir altın yüzük bulunan bir halkayı hediye etti. Resulullah (Sallallahu Aleyhi ve Sellem) o altın yüzüğü bir çubukla veya parmaklarının bazısıyla aldı. Fakat ona iltifat etmedi. Sonra kızın kızın (ın yani Zeyneb'in) kızı Ümame bint-i Ebi'l-As'ı çağırdı ve: «Ey kızcağızım bununla ziynetlen,» buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 95
      }
    },
    {
      "hadithNumber": 3645,
      "arabicNumber": 3645,
      "book": 32,
      "hadithInBook": 96,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَجْعَلُ فَصَّ خَاتَمِهِ مِمَّا يَلِي كَفَّهُ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ‘Umar that the Prophet (ﷺ) used to wear (his ring) with the stone nearest his palm",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم اپنی انگوٹھی کے نگینے کو ہتھیلی کی جانب رکھتے تھے۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Prophète (ﷺ) portait sa bague avec la pierre tournée vers la paume de sa main",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ayyub bin Musa] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam menghadapkan batu cincinnya pada telapak tangannya",
          "tr": "İbn-i Ömer (r.a.) Nebi (Sallallahu Aleyhi ve Sellem), yüzüğünün kaşını avucunun iç tarafına koyardı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 96
      }
    },
    {
      "hadithNumber": 3646,
      "arabicNumber": 3646,
      "book": 32,
      "hadithInBook": 97,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يُونُسَ بْنِ يَزِيدَ الأَيْلِيِّ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَبِسَ خَاتَمَ فِضَّةٍ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ فِي بَطْنِ كَفِّهِ ‏.‏",
        "translations": {
          "en": "It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) wore a silver ring with an Ethiopian gemstone, and he used to ear the stone in towards his palm",
          "ur": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے چاندی کی انگوٹھی پہنی، اس میں حبشی نگینہ تھا، آپ اپنے نگینے کو اپنی ہتھیلی کے اندر کی جانب رکھتے تھے۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) portait une bague en argent avec une pierre précieuse éthiopienne, et il portait la pierre tournée vers la paume de sa main",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Isma'il bin Abu Uwais] telah menceritakan kepadaku [Sulaiman bin Bilal] dari [Yunus bin Yazid Al Aili] dari [Ibnu Syihab] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam mengenakan cincin yang terbuat dari perak dan mata batunya dari Habasyah, beliau lalu menghadapkan batu cincinnya ke arah telapak tangan",
          "tr": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem), içinde habeşi bir kaş bulunan gümüş bir yüzük kullandı. Yüzüğünün kaşını avucunun içine koyuyordu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 97
      }
    },
    {
      "hadithNumber": 3647,
      "arabicNumber": 3647,
      "book": 32,
      "hadithInBook": 98,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَتَخَتَّمُ فِي يَمِينِهِ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Abdullah bin Ja’far that the Prophet (ﷺ) used to wear a ring on his right hand",
          "ur": "عبداللہ بن جعفر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم اپنے داہنے ہاتھ میں انگوٹھی پہنتے تھے ۱؎۔",
          "fr": "Rapporté par ‘Abdullah bin Ja’far : Le Prophète (ﷺ) portait une bague à la main droite",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numir] dari [Ibrahim bin Al Fadll] dari [Abdullah bin Muhammad bin 'Aqil] dari [Abdullah bin Ja'far], bahwa Nabi shallallahu 'alaihi wasallam mengenakan cincin di tangan kanannya",
          "tr": "Abdullah bin Ca'fer (bin Ebi Talib) (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) yüzüğü sağ eline takardı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 98
      }
    },
    {
      "hadithNumber": 3648,
      "arabicNumber": 3648,
      "book": 32,
      "hadithInBook": 99,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عَاصِمٍ، عَنْ أَبِي بُرْدَةَ، عَنْ عَلِيٍّ، قَالَ نَهَانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ أَتَخَتَّمَ فِي هَذِهِ وَفِي هَذِهِ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Ali said:“The Messenger of Allah (ﷺ) forbade me to wear a ring on this and on this,” meaning the little finger and the thumb",
          "ur": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے منع فرمایا کہ میں اس میں اور اس میں انگوٹھی پہنوں، یعنی چھنگلی اور انگوٹھے میں ۱؎۔",
          "fr": "Rapporté par ‘Ali : Le Messager d’Allah (ﷺ) m’a interdit de porter une bague sur ce doigt-ci et sur celui-là, c’est-à-dire le petit doigt et le pouce",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari ['Ashim] dari [Abu Burdah] dari [Ali] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarangku mengenakan cincin di sini dan di sini.\" -yaitu di jari kelingking dan jempol",
          "tr": "Ali (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) beni yüzüğü şu ve bu parmağıma takmaktan men etti, demiştir. Ravi demiştir ki: Ali küçük parmağı ve baş parmağını kasdetmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 99
      }
    },
    {
      "hadithNumber": 3649,
      "arabicNumber": 3649,
      "book": 32,
      "hadithInBook": 100,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Talhah that the Prophet (ﷺ) said:“The angels do not enter a house in which there is a dog or an image.”",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ ابوطلحہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس گھر میں فرشتے نہیں داخل ہوتے جس میں کتا اور تصویر ہو ۱؎۔",
          "fr": "Rapporté par Abu Talhah : Le Prophète (ﷺ) a dit : “Les anges n’entrent pas dans une maison où il y a un chien ou une image.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dari [Abu Thalhah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Malaikat tidak akan masuk ke dalam rumah yang di dalamnya terdapat anjing dan gambar",
          "tr": "Ebu Talha (Zeyd bin Sehl) (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «İçinde köpek ve suret (yani canlı resmi, heykel) bulunan ev'e melek girmez.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 100
      }
    },
    {
      "hadithNumber": 3650,
      "arabicNumber": 3650,
      "book": 32,
      "hadithInBook": 101,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ نُجَىٍّ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from ‘Ali bin Abu Talib that the Prophet (ﷺ) said:“The angels do not enter a house in which there is a dog or an image.”",
          "ur": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: فرشتے اس گھر میں داخل نہیں ہوتے جس میں کتا اور تصویر ہو ۱؎۔",
          "fr": "Rapporté par ‘Ali bin Abu Talib : Le Prophète (ﷺ) a dit : “Les anges n’entrent pas dans une maison où il y a un chien ou une image.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Ali bin Mudrik] dari [Abu Zur'ah] dari [Abdullah bin Nujjay] dari [Ayahnya] dari [Ali bin Abu Thalib] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Malaikat tidak akan masuk ke dalam rumah yang di dalamnya terdapat anjing dan gambar",
          "tr": "Ali bin Ebi Talib (r.a.)'den rivayet edildiğine göre, Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Şüphesiz melekler içinde köpek ve suret bulunan eve girmez.»"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 101
      }
    },
    {
      "hadithNumber": 3651,
      "arabicNumber": 3651,
      "book": 32,
      "hadithInBook": 102,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ وَاعَدَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ جِبْرِيلُ عَلَيْهِ السَّلاَمُ فِي سَاعَةٍ يَأْتِيهِ فِيهَا فَرَاثَ عَلَيْهِ فَخَرَجَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَإِذَا هُوَ بِجِبْرِيلَ قَائِمٌ عَلَى الْبَابِ فَقَالَ ‏ \"‏ مَا مَنَعَكَ أَنْ تَدْخُلَ ‏\"‏ ‏.‏ قَالَ إِنَّ فِي الْبَيْتِ كَلْبًا وَإِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“Jibril (as) promised the Messenger of Allah (ﷺ) that he would come to him at a certain hour, but he was late. The Prophet (ﷺ) went out and there was Jibril standing at the door. He said: ‘What kept you from entering?’ He said: ‘There is a dog in the house, and we do not enter a house in which there is a dog or an image.’”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جبرائیل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک ایسے وقت میں آنے کا وعدہ کیا جس میں وہ آیا کرتے تھے، لیکن آنے میں دیر کی تو نبی اکرم صلی اللہ علیہ وسلم باہر نکلے، دیکھا تو جبرائیل علیہ السلام دروازے پر کھڑے ہیں، آپ صلی اللہ علیہ وسلم نے پوچھا: آپ کو اندر آنے سے کس چیز نے باز رکھا؟ فرمایا: گھر میں کتا ہے، اور ہم لوگ ایسے گھر میں داخل نہیں ہوتے جہاں کتے اور تصویریں ہوں ۔",
          "fr": "Rapporté par ‘Aishah : Jibril (as) avait promis au Messager d’Allah (ﷺ) qu’il viendrait à une certaine heure, mais il a eu du retard. Le Prophète (ﷺ) est sorti et a vu Jibril debout à la porte. Il a dit : “Qu’est-ce qui t’a empêché d’entrer ?” Il a répondu : “Il y a un chien dans la maison, et nous n’entrons pas dans une maison où il y a un chien ou une image.”",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Aisyah] dia berkata, \"Jibril berjanji akan bertemu Rasulullah shallallahu 'alaihi wasallam pada waktu yang telah di tentukan, dan beliau menunggu lama. Kemudian Nabi shallallahu 'alaihi wasallam keluar rumah, dan ternyata Jibril tengah berdiri di depan pintu, beliau pun bertanya: \"Apa yang menghalangimu masuk?\" Jibril menjawab, \"Di dalam rumahmu ada anjing, dan sungguh kami tidak akan masuk ke dalam rumah yang di dalamnya terdapat anjing dan gambar",
          "tr": "Aişe (r.anha)'dan; şöyle demiştir: Cebrail (A.S.) Resulullah (Sallallahu Aleyhi ve Sellem)'e geleceğe bir saat hususunda Onunla sözleşti de Resulullah (Sallallahu Aleyhi ve Sellem)'i bir hayli bekletti. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) çıktı. Ansızın Cebrail ile karşılaştı, Cebrail ayakta duruyordu. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Seni girmekten men eden neditr?» diye sordu. Cebrail (A.S.): Evde şüphesiz bir köpek vardır. Halbuki biz içinde ne köpek ne de suret bulunan eve kesinlikle girmeyiz, dedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 102
      }
    },
    {
      "hadithNumber": 3652,
      "arabicNumber": 3652,
      "book": 32,
      "hadithInBook": 103,
      "text": {
        "arabic": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا عُفَيْرُ بْنُ مَعْدَانَ، حَدَّثَنَا سُلَيْمُ بْنُ عَامِرٍ، عَنْ أَبِي أُمَامَةَ، أَنَّ امْرَأَةً، أَتَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَخْبَرَتْهُ أَنَّ زَوْجَهَا فِي بَعْضِ الْمَغَازِي فَاسْتَأْذَنَتْهُ أَنْ تُصَوِّرَ فِي بَيْتِهَا نَخْلَةً فَمَنَعَهَا أَوْ نَهَاهَا ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Umamah that a woman came to the Prophet (ﷺ) and told him that her husband was away on some military campaign. She asked him for permission to make an image of a palm tree in her house, and he did not let her, or he forbade her",
          "ur": "ابوامامہ رضی اللہ عنہ سے روایت ہے کہ ایک عورت نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر آپ کو بتایا کہ اس کا شوہر کسی جنگ میں گیا ہوا ہے، اور اپنے گھر میں کھجور کے درخت کی تصویر بنانے کی اجازت طلب کی، تو آپ صلی اللہ علیہ وسلم نے اسے منع فرما دیا یا روک دیا۔",
          "fr": "Rapporté par Abu Umamah : Une femme est venue voir le Prophète (ﷺ) et lui a dit que son mari était parti en expédition. Elle lui a demandé la permission de faire une image d’un palmier dans sa maison, mais il ne l’a pas autorisée, ou il le lui a interdit",
          "id": "Telah menceritakan kepada kami [Al 'Abbas bin 'Utsman Ad Dimasyqi] telah menceritakan kepada kami [Al Walid] telah menceritakan kepada kami ['Ufair bin Ma'dan] telah menceritakan kepada kami [Sulaim bin 'Amir] dari [Abu Umamah], bahwa seorang wanita datang kepada Nabi shallallahu 'alaihi wasallam dan memberitahukan kepada beliau bahwa suaminya berada di kancah pertempuran, kemudian dia meminta izin kepada beliau untuk menggambar pohon kurma di dalam rumahnya, namun beliau mencegahnya atau melarangnya",
          "tr": "Ebu Ümame (r.a.)'den rivayet edildiğine göre: Bir kadın Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek kocasının bazı savaşlarda olduğunu O'na arz etti ve evinde bir hurma ağacının resmini yapmak için Ondan izin istedi. O kadını men etti veya nehyetti. Not: Zevaid'de şöyle denilmiştir: Bımun senedinde meyr bin Ma'dan var. Bu ravi zayıftır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 103
      }
    },
    {
      "hadithNumber": 3653,
      "arabicNumber": 3653,
      "book": 32,
      "hadithInBook": 104,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَتَرْتُ سَهْوَةً لِي - تَعْنِي الدَّاخِلَ - بِسِتْرٍ فِيهِ تَصَاوِيرُ فَلَمَّا قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ هَتَكَهُ فَجَعَلْتُ مِنْهُ مَنْبُوذَتَيْنِ فَرَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ مُتَّكِئًا عَلَى إِحْدَاهُمَا ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Aishah said:“I covered a small room closet of mine, meaning, from the inside, with a curtain on which there were images. When the Prophet (ﷺ) came, he tore it down, so I made two pillows from it, and I saw the Prophet (ﷺ) reclining on one of them.”",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے اپنے روشن دان پر پردہ ڈالا یعنی اندر سے، پردے میں تصویریں تھیں، جب نبی اکرم صلی اللہ علیہ وسلم تشریف لائے، تو آپ نے اسے پھاڑ ڈالا، میں نے اس سے دو تکیے بنا لیے پھر میں نے دیکھا کہ نبی اکرم صلی اللہ علیہ وسلم ان میں سے ایک تکیے پر ٹیک لگائے ہوئے تھے ۱؎۔",
          "fr": "Rapporté par ‘Aishah : J’ai recouvert un petit placard chez moi, c’est-à-dire de l’intérieur, avec un rideau sur lequel il y avait des images. Quand le Prophète (ﷺ) est venu, il l’a déchiré, alors j’en ai fait deux coussins, et j’ai vu le Prophète (ﷺ) s’allonger sur l’un d’eux",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Usamah bin Zaid] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari [Aisyah] dia berkata, \"Aku menutup bufetku yaitu yang ada di dalam dengan menggunakan kain yang bergambar, ketika Nabi shallallahu 'alaihi wasallam datang beliau langsung memotongnya, maka aku pun menjadikannya dua bantal, (suatu ketika) aku melihat Rasulullah shallallahu 'alaihi wasallam bersandar pada salah satunya",
          "tr": "Aişe (r.anha)'dan şöyle demiştir: Ben bir sehvemi (yani küçük kilerimi) içinde suretler bulunan bir örtü ile örttüm. Sonra Nebi (Sallallahu Aleyhi ve Sellem) gelince o örtüyü söktü. Bunun üzerine bende ondan iki yastık yaptım. Sonra da ben Nebi (Sallallahu Aleyhi ve Sellem)'i o yastıklardan birisine yaslanmış olarak gördüm. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde Üsame bin Zeyd vardır ve onun zayıflığı üzerinde ittifak edilmiştir. Bu hadis Buhari'de de vardır. Ancak ''Bonra da ben Nebi (s.a.v.)'i o yastıklardan birisine yaslanmış olarak: gördüm'' mealindeki kısım orada yoktur. Bu fıkranın dışında kalan kısım buradaki gibidir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Isnaad Hasan Bukhari And Muslim"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 104
      }
    },
    {
      "hadithNumber": 3654,
      "arabicNumber": 3654,
      "book": 32,
      "hadithInBook": 105,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ هُبَيْرَةَ، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ خَاتَمِ الذَّهَبِ وَعَنِ الْمِيثَرَةِ يَعْنِي الْحَمْرَاءَ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Ali said:“The Messenger of Allah (ﷺ) forbade rings of gold and Al-Mitharah,”* meaning the red ones",
          "ur": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سونے کی انگوٹھی پہننے اور گدے استعمال کرنے سے منع فرمایا یعنی سرخ ریشمی گدے زین پوش",
          "fr": "Rapporté par ‘Ali : Le Messager d’Allah (ﷺ) a interdit les bagues en or et Al-Mitharah, c’est-à-dire les rouges",
          "id": "Telah menceritakan kepada kami [Abu Bakar] telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Hubairah] dari [Ali] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang penggunaan cincin emas dan alas pelana yang terbuat dari sutera",
          "tr": "Ali (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) altın yüzüğü ve misereyi (eğer yada palan minderi) yani kırmızı olan misereyi yasaklamıştır Diğer Tahric edenler: Tirmizi, Ebu Davud, Nesai ve Ahmed"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 105
      }
    },
    {
      "hadithNumber": 3655,
      "arabicNumber": 3655,
      "book": 32,
      "hadithInBook": 106,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْحِمْيَرِيُّ، عَنْ أَبِي حُصَيْنٍ الْحَجْرِيِّ الْهَيْثَمِ، عَنْ عَامِرٍ الْحَجْرِيِّ، قَالَ سَمِعْتُ أَبَا رَيْحَانَةَ، صَاحِبَ النَّبِيِّ ـ صلى الله عليه وسلم ـ يَقُولُ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَنْهَى عَنْ رُكُوبِ النُّمُورِ ‏.‏",
        "translations": {
          "en": "It was narrated that ‘Amir Al-Hajri said:“I heard Abu Raihanah, the Companion of the Prophet (ﷺ) say: ‘The Prophet (ﷺ) used to forbid riding on leopard skins.’”",
          "ur": "ابوریحانہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم چیتوں کی کھال پر سواری کرنے سے منع فرماتے تھے۔",
          "fr": "Rapporté par ‘Amir Al-Hajri : J’ai entendu Abu Raihanah, le compagnon du Prophète (ﷺ), dire : « Le Prophète (ﷺ) interdisait de monter sur des peaux de léopard. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Zaid bin Hubab] telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepadaku ['Ayyasy bin 'Abbas al Himyari] dari [Abu Hushain Al Hajri Al Haitsam] dari ['Amir Al Hajri] dia berkata; saya mendengar [Abu Raihanah] salah seorang sahabat Nabi shallallahu 'alaihi wasallam, berkata, \"Nabi shallallahu 'alaihi wasallam melarang untuk menunggangi harimau",
          "tr": "Nebi (Sallallahu Aleyhi ve Sellem)'in sahabisi Ebu Reyhane (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Kaplanlar('ın derilerini binek hayvanı üstüne veya eyer semer üstüne çekip onlar)'a binneyi men ederdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 106
      }
    },
    {
      "hadithNumber": 3656,
      "arabicNumber": 3656,
      "book": 32,
      "hadithInBook": 107,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي الْمُعْتَمِرِ، عَنِ ابْنِ سِيرِينَ، عَنْ مُعَاوِيَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَى عَنْ رُكُوبِ النُّمُورِ ‏.‏",
        "translations": {
          "en": "It was narrated that Mu’awiyah said:“The Messenger of Allah (ﷺ) used to forbid riding on leopard skins.”",
          "ur": "معاویہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم چیتوں کی کھال پر سواری کرنے سے منع فرماتے تھے ۱؎۔",
          "fr": "Rapporté par Mu’awiyah : Le Messager d’Allah (ﷺ) interdisait de monter sur des peaux de léopard",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Abu Mu'tamir] dari [Ibnu Sirin] dari [Mu'awiyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang untuk mengendarai harimau",
          "tr": "Muaviye (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Kaplanlar(ın derilerini eyer ve semer üstüne çekmek veya binek hayvanı sırtına başka türlü atmak suretiyle onlar)a binmeyi men ederdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Fouad Abd al-Baqi",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "majah",
        "book": 32,
        "hadith": 107
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "72KB"
  }
}