{
  "collection": "abudawud",
  "book": 4,
  "name": {
    "arabic": "كتاب Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey",
    "transliteration": "prayer (kitab al-salat): detailed rules of law about the prayer during journey",
    "translation": "Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey"
  },
  "totalHadith": 52,
  "hadithNumberRange": {
    "first": 1198,
    "last": 1249
  },
  "content": [
    {
      "hadithNumber": 1198,
      "arabicNumber": 1198,
      "book": 4,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ فُرِضَتِ الصَّلاَةُ رَكْعَتَيْنِ رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ فَأُقِرَّتْ صَلاَةُ السَّفَرِ وَزِيدَ فِي صَلاَةِ الْحَضَرِ ‏.‏",
        "translations": {
          "en": "Narrated Aisha, Ummul Mu'minin: The prayer was prescribed as consisting of two rak'ahs both when one was resident and when travelling. The prayer while travelling was left according to the original prescription and the prayer of one who was resident was enhanced",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ سفر اور حضر دونوں میں دو دو رکعت نماز فرض کی گئی تھی، پھر سفر کی نماز ( حسب معمول ) برقرار رکھی گئی اور حضر کی نماز میں اضافہ کر دیا گیا ۱؎۔",
          "fr": "Rapporté par Aïcha, la mère des croyants رضي الله عنها : La prière fut prescrite à l’origine en deux unités, que l’on soit résident ou en voyage. La prière du voyageur est restée telle quelle, tandis que celle du résident a été augmentée",
          "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Shalih bin Kaisan] dari ['Urwah bin Zubair] dari [Aisyah radliallahu 'anha] dia berkata; \"Shalat di wajibkan dua raka'at-dua raka'at, baik ketika mukim atau dalam perjalanan, di tetapkan dua raka'at dalam perjalanan, dan di tambah (raka'atnya) ketika mukim",
          "tr": "Âişe (r.anhâ)'dan; demiştir ki: Namaz hazarda ve seferde ikişer rekat olarak farz kılındı. Sonra yolculuk namazı olduğu gibi bırakıldı, hazar namazına ilâve yapıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (350) Sahih Muslim (685)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 1
      },
      "narrator": {
        "en": "Aisha, Ummul Mu'minin"
      }
    },
    {
      "hadithNumber": 1199,
      "arabicNumber": 1199,
      "book": 4,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا خُشَيْشٌ، - يَعْنِي ابْنَ أَصْرَمَ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي عَمَّارٍ، عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ، عَنْ يَعْلَى بْنِ أُمَيَّةَ، قَالَ قُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ أَرَأَيْتَ إِقْصَارَ النَّاسِ الصَّلاَةَ وَإِنَّمَا قَالَ تَعَالَى ‏{‏ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمُ الَّذِينَ كَفَرُوا ‏}‏ فَقَدْ ذَهَبَ ذَلِكَ الْيَوْمُ ‏.‏ فَقَالَ عَجِبْتُ مِمَّا عَجِبْتَ مِنْهُ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوا صَدَقَتَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Ya'la b. Umayyah:I remarked to 'Umar al-Khattab: Have you seen the shortening of the prayer by the people today while Allah has said: \"If you fear that those who are infidels may afflict you\", whereas those days are gone now? He replied: I have wondered about the same matter for which you wondered. So I mentioned this to the Messenger of Allah (ﷺ). He said: It is an act of charity which Allah has done to you, so accept his charity",
          "ur": "یعلیٰ بن امیہ رضی اللہ عنہ کہتے ہیں کہ میں نے عمر بن خطاب رضی اللہ عنہ سے کہا: مجھے بتائیے کہ ( سفر میں ) لوگوں کے نماز قصر کرنے کا کیا مسئلہ ہے اللہ تعالیٰ تو فرما رہا ہے: اگر تمہیں ڈر ہو کہ کافر تمہیں فتنہ میں مبتلا کر دیں گے ، تو اب تو وہ دن گزر چکا ہے تو آپ نے کہا: جس بات پر تمہیں تعجب ہوا ہے اس پر مجھے بھی تعجب ہوا تھا تو میں نے اس کا تذکرہ رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تبارک و تعالیٰ نے تم پر یہ صدقہ کیا ہے لہٰذا تم اس کے صدقے کو قبول کرو ۱؎ ۔",
          "fr": "Rapporté par Ya’la b. Umayyah رضي الله عنه : J’ai dit à 'Omar al-Khattab رضي الله عنه : « As-tu vu que les gens raccourcissent la prière alors qu’Allah a dit : “Si vous craignez que les mécréants ne vous attaquent”, alors que ce temps-là est révolu ? » Il répondit : « Je me suis posé la même question que toi. J’en ai parlé au Messager d’Allah ﷺ. Il a dit : “C’est une aumône qu’Allah vous a accordée, acceptez donc Son aumône.” »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Khusyaisy yaitu Ibnu Ashram] telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] dia berkata; telah menceritakan kepadaku [Abdurrahman bin Abdullah bin Abu 'Ammar] dari [Abdullah bin Babaih] dari [Ya'la bin Umayyah] dia berkata; aku bertanya kepada Umar bin Khattab; \"Bagaimana pendapat anda mengenai orang-orang yang meng-qashar shalatnya karena firman Allah; \"…Jika kamu takut di serang oleh orang-orang kafir…\" QS An Nisaa'; 101, padahal rasa takut itu telah hilang saat sekarang ini.\" [Umar] berkata; \"Sebenarnya aku juga heran seperti yang kamu herankan itu, oleh karena itu, aku sampaikan masalah tersebut kepada Rasulullah shallallahu 'alaihi wasallam, justru beliau menjawab: \"Itu merupakan sedekah Allah terhadap kalian, oleh karena itu, terimalah sedekah-Nya.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazaq] dan [Muhammad bin Bakr] keduanya berkata; telah mengabarkan kepada kami [Ibnu Juraij] saya mendengar [Abdullah bin Abu 'Ammar] bercerita …\" kemudian ia menyebutkan hadits yang semisalnya, Abu Daud mengatakan; \"Di riwayatkan pula oleh [Abu 'Ashim] dan [Hammad bin Mas'adah] sebagaimana yang di riwayatkan oleh Ibnu Bakr",
          "tr": "Ya'la b. Ümeyye'den; demiştir ki: Ömer b. Hattâb'a, \"Aziz ve celil olan Allah sadece \"Eğer kâfirlerin size fenalık yapacağından korkarsanız\" dediği ve (bugün) bu (korku) da kalmadığı halde insanların (yolculukta) namazı kısaltmalarını nasıl buluyorsun?\" dedim. Ömer (r.a.) dedi ki: Senin hayret ettiğin şey'e ben de hayret ettim de bunu Resûlullah (s.a.v.)'den sordum. “Bu, aziz ve celil olan Allah'ın size verdiği bir sadakadır. O'nun sadakasını alınız\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (686)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 2
      },
      "narrator": {
        "en": "Ya'la b. Umayyah"
      }
    },
    {
      "hadithNumber": 1200,
      "arabicNumber": 1200,
      "book": 4,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، وَمُحَمَّدُ بْنُ بَكْرٍ، قَالاَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي عَمَّارٍ، يُحَدِّثُ فَذَكَرَهُ نَحْوَهُ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ أَبُو عَاصِمٍ وَحَمَّادُ بْنُ مَسْعَدَةَ كَمَا رَوَاهُ ابْنُ بَكْرٍ ‏.‏",
        "translations": {
          "en": "The above mentioned tradition has also been narrated through a different chain of transmitters by 'Abd Allah b. Abi 'Ammar who narrated it in like manner. Abu Dawud said:This has been transmitted by Abu 'Asim and Hammad b. Mas'adah as transmitted by Ibn Bakr",
          "ur": "ابن جریج کہتے ہیں کہ میں نے عبداللہ بن ابی عمار کو بیان کرتے ہوئے سنا، پھر انہوں نے اسی طرح کی روایت ذکر کی۔ ابوداؤد کہتے ہیں: اس حدیث کو ابوعاصم اور حماد بن مسعدہ نے بھی اسی طرح روایت کیا ہے جیسے اسے ابن بکر نے کیا ہے۔",
          "fr": "Le même récit a également été rapporté par une autre chaîne de transmetteurs par 'Abd Allah b. Abi 'Ammar, qui l’a transmis de la même manière. Abu Dawud a dit : « Cela a été transmis par Abu 'Asim et Hammad b. Mas'adah comme l’a rapporté Ibn Bakr. »",
          "tr": "İbn Cüreyc, \"Ben Abdullah b. Ebî Ammâr'ı (şöyle) derken duydum\" dedi ve şu (bir önceki: 1199.) hadisi nakletti. Ebû Dâvûd dedi ki: Bu hadisi Ebû Âsım'la Hammâd b. Mesâde'de aynen İbn Bekr'in naklettiği gibi rivayet ettiler. Açıklama Bu hadisle ilgili açıklama (1199) numaralı hadisin açıklamasında geçmiştir. Ancak burada Müellif Ebû Davud'un taliki ile ilgili olarak şunları ilâve etmek mümkündür: Müellif Ebû Dâvud bu tâlikiyle Muhammed b. Bekr'in bu hadisi riva­yet ederken dayandığı senedin 1199 numaralı hadisi nakleden Yahya el-Kattân'ın dayandığı senedden daha kuvvetli olduğunu söylemişse de Müs­lim, Nesâî ve İbn Mâce'nin senedleri Yahya el-Kattân'ın senedine uygun düş­mektedir. Bu bakımdan Muhammed b. Bekr'in rivayetini tercih için yeterli bir sebeb yoktur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 1201,
      "arabicNumber": 1201,
      "book": 4,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَحْيَى بْنِ يَزِيدَ الْهُنَائِيِّ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قَصْرِ الصَّلاَةِ، فَقَالَ أَنَسٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا خَرَجَ مَسِيرَةَ ثَلاَثَةِ أَمْيَالٍ أَوْ ثَلاَثَةِ فَرَاسِخَ - شُعْبَةُ شَكَّ - يُصَلِّي رَكْعَتَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated Yahya b. Yazid al-Hannani:I asked Anas b. Malik about the shortening of the prayer (while travelling). He said: When the Messenger of Allah (ﷺ) went out on a journey of three miles or three farsakh (the narrator Shu'bah doubted), he used to pray two rak'ahs",
          "ur": "یحییٰ بن یزید ہنائی کہتے ہیں کہ میں نے انس بن مالک رضی اللہ عنہ سے نماز قصر کرنے کے متعلق پوچھا تو آپ نے کہا: رسول اللہ صلی اللہ علیہ وسلم جب تین میل یا تین فرسخ ( یہ شک شعبہ کو ہوا ہے ) کی مسافت پر نکلتے تو دو رکعت پڑھتے ۱؎۔",
          "fr": "Rapporté par Yahya b. Yazid al-Hannani : J’ai demandé à Anas b. Malik au sujet de la réduction de la prière pendant le voyage. Il a dit : Lorsque le Messager d’Allah ﷺ partait en voyage sur une distance de trois miles ou trois farsakh (le rapporteur Shu'bah avait un doute), il priait deux rak‘as",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Yazid Al Huna`i] dia berkata; saya bertanya kepada Anas bin Malik tentang mengqashr shalat, maka [Anas] menjawab; \"Apabila Rasulullah shallallahu 'alaihi wasallam bepergian sejauh perjalanan tiga mil atau tiga farsakh -Syu'bah ragu- maka beliau shalat dua raka'at",
          "tr": "Yahya b. Yezîd el-Hunâî demiştir ki: Enes b. Mâlik'e namazı kısaltarak kılmayı sordum. (O da); Resûlullah (s.a.v.) üç millik yahut -Şu'be şüphe etmiştir- üç fersahlık yola çıktığı zaman iki rekat kılardı, diye cevap verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (691)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 4
      },
      "narrator": {
        "en": "Yahya b. Yazid al-Hannani"
      }
    },
    {
      "hadithNumber": 1202,
      "arabicNumber": 1202,
      "book": 4,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ، سَمِعَا أَنَسَ بْنَ مَالِكٍ، يَقُولُ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated Anas b. Malik :I prayed along with the Messenger of Allah (ﷺ) four rak'ahs at the noon prayer at Medina and two rak'ahs at the afternoon prayer in Dhu al-Hulaifah",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینے میں ظہر چار رکعت پڑھی اور ذو الحلیفہ میں عصر دو رکعت ۱؎۔",
          "fr": "Rapporté par Anas b. Malik : J’ai prié avec le Messager d’Allah ﷺ quatre rak‘as pour la prière du midi à Médine, et deux rak‘as pour la prière de l’après-midi à Dhu al-Hulaifah",
          "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Muhammad bin Al Munkadir] dan [Ibrahim bin Maisarah] keduanya mendengar [Anas bin Malik] berkata; \"Aku shalat dluhur empat raka'at di Madinah bersama Rasulullah shallallahu 'alaihi wasallam, dan shalat Ashar dua raka'at di Dzul Hulaifah",
          "tr": "Muhammed b. el-Münkedir ile İbrahim b. Meysere Enes b. Mâlik'i şöyle derken işitmişlerdir: Resûlullah (s.a.v.) ile birlikte öğle namazını Medine'de dört rek'at, ikindi namazım da Zü'l-Huleyfe'de iki rekat olarak kıldım"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1089) Sahih Muslim (690)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 5
      },
      "narrator": {
        "en": "Anas b. Malik"
      }
    },
    {
      "hadithNumber": 1203,
      "arabicNumber": 1203,
      "book": 4,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا عُشَّانَةَ الْمَعَافِرِيَّ، حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَعْجَبُ رَبُّكُمْ مِنْ رَاعِي غَنَمٍ فِي رَأْسِ شَظِيَّةٍ بِجَبَلٍ يُؤَذِّنُ بِالصَّلاَةِ وَيُصَلِّي فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا إِلَى عَبْدِي هَذَا يُؤَذِّنُ وَيُقِيمُ الصَّلاَةَ يَخَافُ مِنِّي فَقَدْ غَفَرْتُ لِعَبْدِي وَأَدْخَلْتُهُ الْجَنَّةَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Uqbah ibn Amir: I heard the Messenger of Allah (ﷺ) say: Allah is pleased with a shepherd of goats who calls to prayer at the peak of a mountain, and offers prayer, Allah, the Exalted, says: Look at this servant of Mine; he calls to prayer and offers it and he fears Me. So I forgive him and admit him to paradise",
          "ur": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: تمہارا رب بکری کے اس چرواہے سے خوش ہوتا ہے جو کسی پہاڑ کی چوٹی میں رہ کر نماز کے لیے اذان دیتا ۱؎ اور نماز ادا کرتا ہے، اللہ تعالیٰ فرماتا ہے: دیکھو میرے اس بندے کو، یہ اذان دے رہا ہے اور نماز قائم کر رہا ہے، مجھ سے ڈرتا ہے، میں نے اپنے بندے کو بخش دیا اور اسے جنت میں داخل کر دیا ۔",
          "fr": "Rapporté par Uqbah ibn Amir : J’ai entendu le Messager d’Allah ﷺ dire : « Allah est satisfait d’un berger de chèvres qui appelle à la prière au sommet d’une montagne et accomplit la prière. Allah, le Très-Haut, dit : “Regardez ce serviteur à Moi ; il appelle à la prière, il l’accomplit et il Me craint. Je lui pardonne donc et Je le fais entrer au Paradis.” »",
          "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah menceritakan kepada kami [Ibnu Wahb] dari ['Amru bin Al harits] bahwa [Abu 'Usyanah Al Ma'afiri] telah menceritakan dari ['Uqbah bin 'Amir] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kalian kagum terhadap seorang yang mengumandangkan shalat di atas bukit, kemudian dia shalat, maka Allah Azza wa Jalla berfirman; \"Lihatlah kepada hamba-Ku ini, dia mengumandangkan adzan lalu shalat karena takut kepada-Ku, Aku telah mengampuni dosa hamba-Ku dan memasukkannya ke dalam surga",
          "tr": "Ukbe b. Âmir'den; demiştir ki: Resûlullah (s.a.v.)'i şöyle buyururken işittim: \"Rabbiniz dağ başında ezan okuyup namaz kılan bir koyun çobanından razı olur ve (şöyle) buyurur: \"Şu kuluma bakın. Benden korkarak ezan okuyor ve namaz kılıyor. Ben bu kulumu affettim ve onu kesinlikle Cennete koyacağım"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 6
      },
      "narrator": {
        "en": "Uqbah ibn Amir"
      }
    },
    {
      "hadithNumber": 1204,
      "arabicNumber": 1204,
      "book": 4,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْمِسْحَاجِ بْنِ مُوسَى، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ حَدِّثْنَا مَا، سَمِعْتَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ كُنَّا إِذَا كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي السَّفَرِ فَقُلْنَا زَالَتِ الشَّمْسُ أَوْ لَمْ تَزُلْ صَلَّى الظُّهْرَ ثُمَّ ارْتَحَلَ ‏.‏",
        "translations": {
          "en": "Narrated Mishaj b. Musa:I asked Anas b. Malik: Narrate to us what you heard the Messenger of Allah (ﷺ) say. He said: When we travelled along with the Messenger of Allah (ﷺ), we would say: Did the sun pass the meridian or not? But he (the Prophet) would offer the noon prayer and then proceed",
          "ur": "مسحاج بن موسیٰ کہتے ہیں کہ میں نے انس بن مالک رضی اللہ عنہ سے کہا: ہم سے آپ کوئی ایسی حدیث بیان کیجئے جسے آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہو، انہوں نے کہا: جب ہم لوگ سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہوتے تو ہم کہتے: سورج ڈھل گیا یا نہیں ۱؎ تو آپ ظہر پڑھتے پھر کوچ کرتے۔",
          "fr": "Rapporté par Mishaj b. Musa : J’ai demandé à Anas b. Malik : Raconte-nous ce que tu as entendu du Messager d’Allah ﷺ. Il a dit : Lorsque nous voyagions avec le Messager d’Allah ﷺ, nous nous demandions : « Le soleil a-t-il passé le zénith ou non ? » Mais lui, il accomplissait la prière du midi puis reprenait la route",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al Mishaj bin Musa] dia berkata; kataku kepada [Anas bin Malik]; \"Sampaikanlah kepada kami sesuatu yang anda dengar dari Rasulullah shallallahu 'alaihi wasallam!.\" Anas berkata; \"Apabila kami bepergian bersama Rasulullah shallallahu 'alaihi wasallam, maka kami berkata; \"Matahari telah tergelincir atau belum, beliau kemudian shalat dluhur lalu melanjutkan perjalanan",
          "tr": "(Mâlik b. Enes) dedi ki: Biz Resûlullah (s.a.v.) ile beraber yolculukta bulunduğumuz zaman (acaba) güneş (batıya) meyletti mi, yoksa etmedi mi, derken (Resûlullah s.a.v.) öğleyi kılar, sonra yola düşerdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 7
      },
      "narrator": {
        "en": "Mishaj b. Musa"
      }
    },
    {
      "hadithNumber": 1205,
      "arabicNumber": 1205,
      "book": 4,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، حَدَّثَنِي حَمْزَةُ الْعَائِذِيُّ، - رَجُلٌ مِنْ بَنِي ضَبَّةَ - قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا نَزَلَ مَنْزِلاً لَمْ يَرْتَحِلْ حَتَّى يُصَلِّيَ الظُّهْرَ فَقَالَ لَهُ رَجُلٌ وَإِنْ كَانَ بِنِصْفِ النَّهَارِ قَالَ وَإِنْ كَانَ بِنِصْفِ النَّهَارِ ‏.‏",
        "translations": {
          "en": "Narrated Anas ibn Malik: When the Messenger of Allah (ﷺ) halted at a certain place (while on a journey), he would not leave that place till he offered the noon prayer. A man said to him: Even if in the middle of the day? He replied: Even if in the middle of the day",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی مقام پر قیام فرماتے تو ظہر پڑھ کر ہی کوچ فرماتے، تو ایک شخص نے ان سے کہا: گرچہ نصف النہار ہوتا؟ انہوں نے کہا: اگرچہ نصف النہار ہوتا۔",
          "fr": "Rapporté par Anas ibn Malik : Quand le Messager d’Allah ﷺ faisait une halte à un endroit pendant un voyage, il ne quittait pas cet endroit avant d’avoir accompli la prière du midi. Un homme lui a demandé : « Même si c’est en plein milieu de la journée ? » Il a répondu : « Même si c’est en plein milieu de la journée. »",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepadaku [Hamzah Al 'A`idzi] -seorang laki-laki dari Bani Dlabbah- dia berkata; saya mendengar [Anas bin Malik] berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam singgah di suatu tempat, beliau tidak melanjutkan perjalanannya sehingga beliau shalat dluhur.\" Maka laki-laki tersebut berkata; \"Meskipun berada pada tengah hari?\" Anas menjawab; \"Meskipun berada di tengah hari",
          "tr": "Dabbe oğullarından Hamz el-Âizî dedi ki: Enes b. Mâlik'in şöyle dediğini işittim: Resûlullah (s.a.v.) bir yerde konakladığında öğle namazını kılmadan yola çıkmazdı. Bir adam: Gündüzün yarısında (zevalden önce) olsa da mı? deyince (Enes); Evet, gündüzün yarısında da olsa diye cevab verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 8
      },
      "narrator": {
        "en": "Anas ibn Malik"
      }
    },
    {
      "hadithNumber": 1206,
      "arabicNumber": 1206,
      "book": 4,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ أَبِي الطُّفَيْلِ، عَامِرِ بْنِ وَاثِلَةَ أَنَّ مُعَاذَ بْنَ جَبَلٍ، أَخْبَرَهُمْ أَنَّهُمْ، خَرَجُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ فَأَخَّرَ الصَّلاَةَ يَوْمًا ثُمَّ خَرَجَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ دَخَلَ ثُمَّ خَرَجَ فَصَلَّى الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا ‏.‏",
        "translations": {
          "en": "Narrated Mu’adh bin Jabal :They (the Companions) proceeded on the expedition of Tabuk along with the Messenger of Allah (ﷺ). He combined the noon and afternoon prayers and the sunset and night prayers. One day he delayed the prayer and came out (of his dwelling) and combined the noon and the afternoon prayers. He then went it and then came out and combined the sunset and the night prayers",
          "ur": "معاذ بن جبل رضی اللہ عنہ نے خبر دی ہے کہ وہ لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ تبوک کے لیے نکلے تو آپ ظہر و عصر اور مغرب و عشاء کو جمع کرتے تھے، ایک دن آپ صلی اللہ علیہ وسلم نے نماز مؤخر کی پھر نکلے اور ظہر و عصر ایک ساتھ پڑھی ۲؎پھر اندر ( قیام گاہ میں ) ۳؎ چلے گئے، پھر نکلے اور مغرب اور عشاء ایک ساتھ پڑھی۔",
          "fr": "Rapporté par Mu’adh bin Jabal : Les Compagnons sont partis en expédition à Tabuk avec le Messager d’Allah ﷺ. Il regroupait la prière du midi et celle de l’après-midi, ainsi que celles du coucher du soleil et de la nuit. Un jour, il a retardé la prière, puis il est sorti et a regroupé la prière du midi et celle de l’après-midi. Ensuite il est rentré, puis il est ressorti et a regroupé la prière du coucher du soleil et celle de la nuit",
          "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zubair Al Makki] dari [Abu Ath Thufail 'Amir bin Watsilah] bahwa [Mu'adz bin Jabal] mengabarkan kepada mereka, bahwa mereka (kaum Muslimin) keluar bersama Rasulullah shallallahu 'alaihi wasallam pada waktu perang Tabuk, dan Rasulullah shallallahu 'alaihi wasallam menjama' shalat antara shalat Dluhur dan Ashar, dan antara shalat Maghrib dan Isya', suatu hari beliau mengakhirkan shalat, kemudian beliau keluar untuk mengerjakan shalat Dluhur dan Ashar secara jama', kemudian beliau masuk (tenda), setelah itu beliau keluar lalu mengerjakan shalat Maghrib dan Isya' secara jama",
          "tr": "Ebu't-Tufeyl Âmir b. Vâsile'den rivayete göre Muaz b. Cebel (r.a.), kendilerine şu haberi vermiştir: Resulullah (Sallallahu aleyhi ve Sellem) ile birlikte Tebuk gazvesine çıktıklarında (Resulullah (Sallallahu aleyhi ve Sellem) öğley ile ikindiyi, akşam ile de yatsıyı birleştirerek kılardı. Bir gün (öğle) namazı(nı) geciktirmiş, sonra (çadır’dan) çıkıp öğleyle ikindiyi birleştirerek kılmış. Bir süre sonra (tekrar çadıra) girip çıkmış ve akşamla yatsıyı birleştirerek kılmış. Diğer tahric: Buhari, mevakît, taksîrü's-salat; Müslim, musafirîn; Nesai, mevakit; Tirmizî, salat; cuma; Ahmed b. Hanbel, II, 4, 7, 8, 34, 51, :0, 77, ICC"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (706)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 9
      },
      "narrator": {
        "en": "Mu’adh bin Jabal"
      }
    },
    {
      "hadithNumber": 1207,
      "arabicNumber": 1207,
      "book": 4,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، اسْتُصْرِخَ عَلَى صَفِيَّةَ وَهُوَ بِمَكَّةَ فَسَارَ حَتَّى غَرَبَتِ الشَّمْسُ وَبَدَتِ النُّجُومُ فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا عَجِلَ بِهِ أَمْرٌ فِي سَفَرٍ جَمَعَ بَيْنَ هَاتَيْنِ الصَّلاَتَيْنِ ‏.‏ فَسَارَ حَتَّى غَابَ الشَّفَقُ فَنَزَلَ فَجَمَعَ بَيْنَهُمَا ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Umar: Ibn Umar was informed about the death of Safiyyah (the wife of the Prophet) when he was at Mecca. He proceeded till the sun set and the stars shined. He said: When the Prophet (ﷺ) was in a hurry about something while on a journey, he would combine both these prayers. He proceed till twilight had disappeared. He then combined both of them (the prayers)",
          "ur": "نافع کہتے ہیں کہ ابن عمر رضی اللہ عنہما کو صفیہ ۱؎ کی موت کی خبر دی گئی اس وقت مکہ میں تھے تو آپ چلے ( اور چلتے رہے ) یہاں تک کہ سورج ڈوب گیا اور ستارے نظر آنے لگے، تو عرض کیا کہ نبی اکرم صلی اللہ علیہ وسلم کو سفر میں جب کسی کام کی عجلت ہوتی تو آپ یہ دونوں ( مغرب اور عشاء ) ایک ساتھ ادا کرتے، پھر وہ شفق غائب ہونے تک چلتے رہے ٹھہر کر دونوں کو ایک ساتھ ادا کیا۔",
          "fr": "Rapporté par Abdullah ibn Umar : Ibn Umar a appris la mort de Safiyyah (l’épouse du Prophète) alors qu’il était à La Mecque. Il a continué son chemin jusqu’au coucher du soleil et à l’apparition des étoiles. Il a dit : Lorsque le Prophète ﷺ était pressé pendant un voyage, il regroupait ces deux prières. Il a continué jusqu’à la disparition du crépuscule, puis il a regroupé les deux prières",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] di beritahu tentang wafatnya Shafiyah, ketika itu ia berada di Makkah. Kemudian dia berangkat hingga matahari terbenam dan bintang-bintang mulai muncul, lalu dia berkata; \"Sesungguhnya apabila Nabi shallallahu 'alaihi wasallam mengalami kesulitan perkara dalam suatu perjalanan, maka beliau menjama' dua shalat ini, lalu beliau berangkat. Setelah awan merah hilang, ia singgah dan menjama' kedua shalat tersebut",
          "tr": "Nâfî'den rivayet olunduğuna göre; İbn Ömer (r.a.)'e Mekke'de iken (eşi) Safiyye'nin ölüm döşeğinde olduğu haberi gelince, hemen yola çıktı. Nihayet güneş batıp da yıldızlar görülmeye başlayınca; \"Nebi (s.a.v.) acele yola çıkmasını gerektiren bir iş olduğu zaman şu iki namazı (akşam ile yatsıyı) birleştirirdi\" dedi. Nihayet şafak kaybolunca (hayvanından) inip ikisini birleştirdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 10
      },
      "narrator": {
        "en": "Abdullah ibn Umar"
      }
    },
    {
      "hadithNumber": 1208,
      "arabicNumber": 1208,
      "book": 4,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الرَّمْلِيُّ الْهَمْدَانِيُّ، حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ، وَاللَّيْثُ بْنُ سَعْدٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ أَبِي الطُّفَيْلِ، عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ فِي غَزْوَةِ تَبُوكَ إِذَا زَاغَتِ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ جَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَإِنْ يَرْتَحِلْ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ حَتَّى يَنْزِلَ لِلْعَصْرِ وَفِي الْمَغْرِبِ مِثْلَ ذَلِكَ إِنْ غَابَتِ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ وَإِنْ يَرْتَحِلْ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ أَخَّرَ الْمَغْرِبَ حَتَّى يَنْزِلَ لِلْعِشَاءِ ثُمَّ جَمَعَ بَيْنَهُمَا ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ هِشَامُ بْنُ عُرْوَةَ عَنْ حُسَيْنِ بْنِ عَبْدِ اللَّهِ عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ الْمُفَضَّلِ وَاللَّيْثِ ‏.‏",
        "translations": {
          "en": "Narrated Mu'adh ibn Jabal: On the expedition to Tabuk if the sun had passed the meridian before the apostle of Allah (ﷺ) moved off, he combined the noon and the afternoon prayers; but if he moved off before the sun had passed the meridian, he delayed the noon prayer till he halted for the afternoon prayer. He acted similarly for the sunset prayer; if the sun set before he moved off, he combined the sunset and the night prayers, but if he moved off before sunset, he delayed the sunset prayer till he halted for the night prayer and then combined them. Abu Dawud said: Hisham b. 'Urwah narrated this tradition from Husain b. 'Abd Allah, from Kuraib on the authority of Ibn 'Abbas from the Prophet (ﷺ) like the tradition narrated by Mufaddal and al-Laith",
          "ur": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ غزوہ تبوک میں سفر سے پہلے سورج ڈھل جانے کی صورت میں تو رسول اللہ صلی اللہ علیہ وسلم عصر کو ظہر کے ساتھ ملا کر پڑھ لیتے، اور اگر سورج ڈھلنے سے پہلے کوچ کرتے تو ظہر کو مؤخر کر دیتے یہاں تک کہ آپ عصر کے لیے قیام کرتے، اسی طرح آپ مغرب میں کرتے، اگر کوچ کرنے سے پہلے سورج ڈوب جاتا تو عشاء کو مغرب کے ساتھ ملا کر پڑھ لیتے اور اگر سورج ڈوبنے سے پہلے کوچ کرتے تو مغرب کو مؤخر کر دیتے یہاں تک کہ عشاء کے لیے قیام کرتے پھر دونوں کو ملا کر پڑھ لیتے۔ ابوداؤد کہتے ہیں: اسے ہشام بن عروہ نے حصین بن عبداللہ سے حصین نے کریب سے، کریب نے ابن عباس رضی اللہ عنہما سے، ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم سے مفضل اور لیث کی حدیث کی طرح روایت کیا ہے۔",
          "fr": "Rapporté par Mu'adh ibn Jabal : Lors de l’expédition de Tabuk, si le soleil avait passé le zénith avant que l’Envoyé d’Allah ﷺ ne reparte, il regroupait la prière du midi et celle de l’après-midi. Mais s’il repartait avant le zénith, il retardait la prière du midi jusqu’à l’arrêt pour la prière de l’après-midi. Il agissait de même pour la prière du coucher du soleil : si le soleil se couchait avant qu’il ne reparte, il regroupait la prière du coucher du soleil et celle de la nuit. Mais s’il repartait avant le coucher du soleil, il retardait la prière du coucher du soleil jusqu’à l’arrêt pour la prière de la nuit, puis il les regroupait. Abu Dawud a dit : Hisham b. 'Urwah a rapporté ce récit de Husain b. 'Abd Allah, de Kuraib, d’après Ibn 'Abbas, du Prophète ﷺ, comme le récit rapporté par Mufaddal et al-Laith",
          "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Yazid bin Abdullah bin Mauhab Ar Ramli Al Hamdani] telah menceritakan kepada kami [AL Mufadlal bin Fadlalah] dan [Laits bin Sa'd] dari [Hisyam bin Sa'ad] dari [Abu Az Zubair] dari [Abu Ath Thufail] dari [Mu'adz bin Jabal] bahwa pada waktu Rasulullah shallallahu 'alaihi wasallam perang Tabuk, ketika matahari telah tergelincir sebelum berangkat, maka beliau menjama' antara shalat Dluhur dan shalat Ashar. Dan jika beliau berangkat sebelum matahari tergelincir, maka beliau mengundurkan Dluhur sehingga beliau singgah untuk shalat Ashar, demikian pula ketika shalat Maghrib, apabila Matahari telah terbenam sebelum berangkat, maka beliau menjama' antara Maghrib dan Isya', dan jika berangkat sebelum matahari terbenam, beliau mengakhirkan shalat Maghrib, sehingga beliau singgah pada waktu Isya', kemudian beliau menjama' keduanya.\" Abu Daud mengatakan; \"Telah di riwayatkan pula oleh [Hisyam bin 'Urwah] dari [Husain bin Abdullah] dari [Kuraib] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam sebagaimana hadits Al Mufadlal dan Al Laits",
          "tr": "Muâz b. Cebel (r.a.)’den rivayet olunduğuna göre; Resûlullah (s.a.v.) Tebûk gazvesinde iken (konaklama yerlerinden) yola çıkmadan önce güneş (batıya) kayarsa öğleyle ikindiyi birleştirerek kılardı. Eğer güneş (batıya) kaymadan önce yola çıkacak olursa ikindiyi kılmak üzere (bir yerde) konaklaymcaya kadar öğleyi geciktirirdi. Akşamleyin de aynı şekilde (hareket ederdi). Eğer yola çıkmadan önce güneş batmışsa, akşamla yatsıyı birleştirerek kılardı. Eğer güneş batmadan yola çıkmışsa, akşam namazını yatsıyı kılmak için (bir yerde) konaklaymcaya kadar geciktirirdi. Sonra ikisini birleştirerek kılardı. Ebû Dâvûd dedi ki: Bu hadisi Hişâm b. Urve de Hüseyn b. Abdullah, Kureyb ve İbn Abbâs vasıtasıyle Nebi (s.a.v.)'den, el-Mufaddal ve el-Leys hadisine benzer bir şekilde rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 11
      },
      "narrator": {
        "en": "Mu'adh ibn Jabal"
      }
    },
    {
      "hadithNumber": 1209,
      "arabicNumber": 1209,
      "book": 4,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ، عَنْ أَبِي مَوْدُودٍ، عَنْ سُلَيْمَانَ بْنِ أَبِي يَحْيَى، عَنِ ابْنِ عُمَرَ، قَالَ مَا جَمَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ قَطُّ فِي السَّفَرِ إِلاَّ مَرَّةً ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا يُرْوَى عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ مَوْقُوفًا عَلَى ابْنِ عُمَرَ أَنَّهُ لَمْ يُرَ ابْنُ عُمَرَ جَمَعَ بَيْنَهُمَا قَطُّ إِلاَّ تِلْكَ اللَّيْلَةَ يَعْنِي لَيْلَةَ اسْتُصْرِخَ عَلَى صَفِيَّةَ وَرُوِيَ مِنْ حَدِيثِ مَكْحُولٍ عَنْ نَافِعٍ أَنَّهُ رَأَى ابْنَ عُمَرَ فَعَلَ ذَلِكَ مَرَّةً أَوْ مَرَّتَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Umar: The Messenger of Allah (ﷺ) never combined the sunset and night prayers while on a journey except once. Abu Dawud said: This has been narrated by Ayyub from Nafi' from Ibn 'Umar as a statement of Ibn 'Umar. Ibn 'Umar was never seen combining these two prayers except on the night he was informed about the death of Safiyyah. The tradition narrated by Makhul from Nafi' indicates that he (Nafi') saw Ibn 'Umar doing so once or twice",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سفر میں ایک بار کے علاوہ کبھی بھی مغرب اور عشاء کو ایک ساتھ ادا نہیں کیا۔ ابوداؤد کہتے ہیں: یہ حدیث «ایوب عن نافع عن ابن عمر» سے موقوفاً روایت کی جاتی ہے کہ نافع نے ابن عمر رضی اللہ عنہما کو ایک رات کے سوا کبھی بھی ان دونوں نمازوں کو جمع کرتے نہیں دیکھا، یعنی اس رات جس میں انہیں صفیہ کی وفات کی خبر دی گئی، اور مکحول کی حدیث نافع سے مروی ہے کہ انہوں نے ابن عمر کو اس طرح ایک یا دو بار کرتے دیکھا۔",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah ﷺ n’a jamais regroupé la prière du coucher du soleil et celle de la nuit pendant un voyage, sauf une seule fois. Abu Dawud a dit : Cela a été rapporté par Ayyub de Nafi' d’Ibn 'Umar comme une parole d’Ibn 'Umar. On n’a jamais vu Ibn 'Umar regrouper ces deux prières, sauf la nuit où il a appris la mort de Safiyyah. Le récit rapporté par Makhul de Nafi' indique que Nafi' l’a vu faire cela une ou deux fois",
          "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdullah bin Nafi'] dari [Abu Maudud] dari [Sulaiman bin Abu Yahya] dari [Ibnu Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sama sekali tidak pernah menjama' shalat Maghrib dan Isya' dalam suatu perjalanan kecuali hanya sekali.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan dari [Ayyub] dari [Nafi'] dari [Ibnu Umar]. Mauquf sampai Ibnu Umar, bahwa dirinya tidak pernah melihat bila beliau pernah menjama' keduanya kecuali hanya malam itu, yaitu malam ketika dia di beritahu wafatnya Shafiyah, dan di riwayatkan pula dari haditsnya [Makhul] dari [Nafi'] bahwa dia melihat [Ibnu Umar] melakukan hal itu hanya sekali atau dua kali",
          "tr": "İbn Ömer'den; demiştir ki: Resûlullah (s.a.v.) bir defadan başka yolculukta akşamla yatsıyı asla birleştirmemiştir. Ebû Dâvûd dedi ki: Bu hadis aynı zamanda Eyyûb, Nâfi', îbn Ömer senediyle îbn Ömer'e ait mevkuf (bir hadis) olarak (şu şekilde) rivayet olunmuştur: \"Nâfİ' Safiyye'nin kara haberinin geldiği gecenin dışında îbn Ömer'in iki namazı birleştirerek kıldığını asla görmemiştir. \" Mekhûl'ün Nâfi'den rivayet ettiği hadis (de şöyledir: Nâfi) îbn Ömer'i böyle yaparken bir veya iki kere görmüştür"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Munkar"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Munkar"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 12
      },
      "narrator": {
        "en": "Ibn 'Umar"
      }
    },
    {
      "hadithNumber": 1210,
      "arabicNumber": 1210,
      "book": 4,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ وَالْعَصْرَ جَمِيعًا وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا فِي غَيْرِ خَوْفٍ وَلاَ سَفَرٍ ‏.‏ قَالَ مَالِكٌ أُرَى ذَلِكَ كَانَ فِي مَطَرٍ ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ حَمَّادُ بْنُ سَلَمَةَ نَحْوَهُ عَنْ أَبِي الزُّبَيْرِ وَرَوَاهُ قُرَّةُ بْنُ خَالِدٍ عَنْ أَبِي الزُّبَيْرِ قَالَ فِي سَفْرَةٍ سَافَرْنَاهَا إِلَى تَبُوكَ ‏.‏",
        "translations": {
          "en": "Narrated 'Abd Allah b. 'Abbas: The Messenger of Allah (ﷺ) combined the noon and the afternoon prayers, and combined the sunset and night prayers without any danger or journey. Malik said: I think it so happened during rain. Abu Dawud said: Hammad b. Salamah narrated it like manner from Abu al-Zubair, it has also been narrated by Qurrah b. Khalid from Abu al-Zubair. He said: It is so happened in a journey that we made to Tabuk",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بلا کسی خوف اور سفر کے ظہر اور عصر کو ایک ساتھ اور مغرب و عشاء کو ایک ساتھ ادا کیا ۱؎۔ مالک کہتے ہیں: میرا خیال ہے کہ ایسا بارش میں ہوا ہو گا ۲؎۔ ابوداؤد کہتے ہیں: اسے حماد بن سلمہ نے مالک ہی کی طرح ابوالزبیر سے روایت کیا ہے، نیز اسے قرہ بن خالد نے بھی ابوالزبیر سے روایت کیا ہے اس میں ہے کہ یہ ایک سفر میں ہوا تھا جو ہم نے تبوک کی جانب کیا تھا۔",
          "fr": "Rapporté par 'Abd Allah b. 'Abbas : Le Messager d’Allah ﷺ a regroupé la prière du midi et celle de l’après-midi, ainsi que la prière du coucher du soleil et celle de la nuit, sans qu’il y ait de danger ni de voyage. Malik a dit : Je pense que cela s’est produit à cause de la pluie. Abu Dawud a dit : Hammad b. Salamah l’a rapporté de la même manière de Abu al-Zubair, et cela a aussi été rapporté par Qurrah b. Khalid de Abu al-Zubair. Il a dit : Cela s’est produit lors d’un voyage que nous avons fait à Tabuk",
          "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zubair Al Makki] dari [Sa'id bin Jubair] dari [Abdullah bin 'Abbas] dia berkata; Rasulullah mengerjakan shalat Dluhur dan Ashar secara Jama', dan shalat Maghrib dan Isya' secara Jama' tidak dalam kondisi ketakutan atau dalam perjalanan.\" (perawi berkata; Malik berkata; \"Aku berpendapat, beliau melakukan hal itu karena kondisi sedang hujan.\" Abu Daud berkata; \"Dan telah diriwayatkan pula oleh [Hammad bin Salamah] seperti hadits tersebut, dari [Abu Az Zubair], dan di riwayatkan oleh [Qurrah bin Khalid] dari [Abu Az Zubair] dia berkata; \"…Yaitu dalam perjalanan ketika kami ke Tabuk",
          "tr": "Abdullah b. Abbâs'tan; demiştir ki: Resûlullah (s.a.v.) korku ve sefer olmaksızın öğle ile ikindiyi ve akşamla yatsıyı bir arada kıldı. Malik dediki: \"Ben bunun yağmur hakkında olduğunu zannediyorum.\" Ebu Davud dediki: Bu hadisin benzerini Ebu'z-Zübeyr, Hammad b. Seleme ile Kurretü'bnü Halid de rivayet etmiştir. (Ebu'z-Zübeyr) dedi ki: (Bu hadise) Tebuk seferine çıktığımızda oldu. Diğer tahric: Müslim, müsafirin, Tirmizi mevakit; Nesâi, mevakit"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (705)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 13
      },
      "narrator": {
        "en": "'Abd Allah b. 'Abbas"
      }
    },
    {
      "hadithNumber": 1211,
      "arabicNumber": 1211,
      "book": 4,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَمَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ بِالْمَدِينَةِ مِنْ غَيْرِ خَوْفٍ وَلاَ مَطَرٍ ‏.‏ فَقِيلَ لاِبْنِ عَبَّاسٍ مَا أَرَادَ إِلَى ذَلِكَ قَالَ أَرَادَ أَنْ لاَ يُحْرِجَ أُمَّتَهُ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:The Messenger of Allah (ﷺ) combined the noon and afternoon prayers, and the sunset and night prayers at Medina without any danger and rain. He was asked: What did he intend by it ? He replied: He intended that his community might not fall into hardship",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینے میں بلا کسی خوف اور بارش کے ظہر و عصر اور مغرب و عشاء کو ملا کر پڑھا، ابن عباس سے پوچھا گیا: اس سے آپ کا کیا مقصد تھا؟ انہوں نے کہا: آپ صلی اللہ علیہ وسلم نے چاہا کہ اپنی امت کو کسی زحمت میں نہ ڈالیں ۱؎۔",
          "fr": "Rapporté par Ibn 'Abbas : Le Messager d’Allah ﷺ a regroupé la prière du midi et celle de l’après-midi, ainsi que la prière du coucher du soleil et celle de la nuit à Médine, sans danger ni pluie. On lui a demandé : « Pourquoi a-t-il fait cela ? » Il a répondu : « Il voulait éviter des difficultés à sa communauté. »",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Habib bin Abu Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah menjama' shalat Dluhur dan Ashar, antara shalat Maghrib dan Isya' di Madinah, tidak dalam kondisi ketakutan, tidak pula hujan.\" Maka di tanyakan hal itu kepada Ibnu Abbas; \"Apa maksud beliau melakukan hal itu?\" Ibnu Abbas menjawab; \"Supaya tidak memberatkan umatnya",
          "tr": "İbn Abbas (r.a.)'dan; demiştir ki; Resûlullah (s.a.v.) korku ve yağmur olmaksızın Medine'de öğle ile ikindiyi ve akşam ile yatsıyı cem etti (ikisini bir arada kıldı). İbn Abbâs'a Resûlullah (s.a.v.)'in bununla neyi kasdettiği sorulunca: Ümmetine kolaylık getirmeyi murad etti, diye cevap verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (705 After  706)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 14
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1212,
      "arabicNumber": 1212,
      "book": 4,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ وَاقِدٍ، أَنَّ مُؤَذِّنَ ابْنِ عُمَرَ، قَالَ الصَّلاَةُ ‏.‏ قَالَ سِرْ سِرْ ‏.‏ حَتَّى إِذَا كَانَ قَبْلَ غُيُوبِ الشَّفَقِ نَزَلَ فَصَلَّى الْمَغْرِبَ ثُمَّ انْتَظَرَ حَتَّى غَابَ الشَّفَقُ وَصَلَّى الْعِشَاءَ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا عَجِلَ بِهِ أَمْرٌ صَنَعَ مِثْلَ الَّذِي صَنَعْتُ فَسَارَ فِي ذَلِكَ الْيَوْمِ وَاللَّيْلَةِ مَسِيرَةَ ثَلاَثٍ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ ابْنُ جَابِرٍ عَنْ نَافِعٍ نَحْوَ هَذَا بِإِسْنَادِهِ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Waqid: The mu'adhdhin of Ibn Umar said: prayer (i.e. the time of prayer has come). He said: Go ahead. He then alighted before the disappearance. He then offered the night prayer. He then said: When the Messenger of Allah (ﷺ) was in a hurry about something, he would do as I did. Then he travelled and covered a distance of three days' journey on the day. Abu Dawud said: A similar tradition has been transmitted by Ibn Jabir from Nafi' with the same chain",
          "ur": "نافع اور عبداللہ بن واقد سے روایت ہے کہ ابن عمر رضی اللہ عنہما کے مؤذن نے کہا: نماز ( پڑھ لی جائے ) ( تو ) ابن عمر نے کہا: چلتے رہو پھر شفق غائب ہونے سے پہلے اترے اور مغرب پڑھی پھر انتظار کیا یہاں تک کہ شفق غائب ہو گئی تو عشاء پڑھی، پھر کہنے لگے: رسول اللہ صلی اللہ علیہ وسلم کو جب کسی کام کی جلدی ہوتی تو آپ ایسا ہی کرتے جیسے میں نے کیا ہے، چنانچہ انہوں نے اس دن اور رات میں تین دن کی مسافت طے کی۔ ابوداؤد کہتے ہیں: اسے ابن جابر نے بھی نافع سے اسی سند سے اسی کی طرح روایت کیا ہے۔",
          "fr": "Rapporté par Abdullah ibn Waqid : Le muezzin d’Ibn Umar a dit : « La prière (c’est-à-dire le temps de la prière est arrivé). » Il a répondu : « Avance. » Il s’est alors arrêté avant la disparition du crépuscule, puis il a accompli la prière de la nuit. Ensuite il a dit : « Quand le Messager d’Allah ﷺ était pressé, il faisait comme moi. » Puis il a voyagé et a parcouru une distance de trois jours de marche en une journée. Abu Dawud a dit : Un récit similaire a été transmis par Ibn Jabir de Nafi’ avec la même chaîne",
          "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Muharibi] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [ayahnya] dari [Nafi'] dan [Abdullah bin Waqid] bahwa Mu'adzin [Ibnu Umar] berseru; \"Telah tiba waktu shalat…!\" Maka dia berkata; \"Jalan terus, jalan terus.\" sehingga ketika mega merah hampir hilang, dia singgah lalu mengerjakan shalat Maghrib. Kemudian menunggu sampai mega merah benar-benar hilang, lalu mengerjakan shalat Isya'. Setelah itu dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam jika terdesak oleh suatu urusan, beliau melakukan seperti yang aku lakukan tadi.\" Lalu dia berjalan sehari semalam, sejauh perjalanan tiga malam.\" Abu Daud berkata; 'Di riwayatkan pula oleh [Ibnu Jabir] dari [Nafi'] seperti hadits ini dengan sanadnya. Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa] dari [Ibnu Jabir] dengan Makna hadits ini. Abu Daud mengatakan; \"Di riwayatkan pula oleh [Abdullah bin Al 'Ala`] dari [Nafi'] dia berkata; \"…Hingga ketika mega merah telah hilang, maka beliau singgah lalu menjama' keduanya",
          "tr": "Nâfi' ve Abdullah b. Vâkıd'dan rivayet edildiğine göre; İbn Ömer'in müezzini (İbn Ömer'e); Namazı (kılmayacak mıyız?) deyince (O da); Devam et, devam et, demiş. Nihayet şafak kaybolmadan (biraz) önce (devesinden) inip akşam namazını kılmış daha sonra da şafak kayboluncaya kadar bekleyip yatsı namazını kılmış ve (şöyle) demiş: Gerçekten Resûlullah (s.a.v.)'in acele bir işi olduğu zaman benim yaptığım gibi yapardı. İbn Ömer o gün ve gece üç (günlük) yol yürümüştü. Ebu Davud dediki: Bu hadisi aynı senedle Nafi'den İbn-i Cabir de rivayet etti. Diğer tahric: Nesai, mevakit"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Shadh"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Shadh"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 15
      },
      "narrator": {
        "en": "Abdullah ibn Waqid"
      }
    },
    {
      "hadithNumber": 1213,
      "arabicNumber": 1213,
      "book": 4,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى، عَنِ ابْنِ جَابِرٍ، بِهَذَا الْمَعْنَى ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ عَبْدُ اللَّهِ بْنُ الْعَلاَءِ عَنْ نَافِعٍ، قَالَ حَتَّى إِذَا كَانَ عِنْدَ ذَهَابِ الشَّفَقِ نَزَلَ فَجَمَعَ بَيْنَهُمَا ‏.‏",
        "translations": {
          "en": "This tradition has also been transmitted by Ibrahim b. Musa al-Razi, from 'Isa, on the authority of Ibn Jabir to the same effect. Abu Dawud said:'Abd Allah b. al-'Ala' narrated on the authority of Nafi' saying: When the twilight was about to disappear, he alighted and combined both (the prayers)",
          "ur": "اس طریق سے بھی ابن جابر سے اسی مفہوم کی حدیث مروی ہے ابوداؤد کہتے ہیں: اور عبداللہ بن علاء نے نافع سے یہ حدیث روایت کی ہے: اس میں ہے یہاں تک کہ جب شفق غائب ہونے کا وقت ہوا تو وہ اترے اور مغرب اور عشاء ایک ساتھ پڑھی۔",
          "fr": "Ce récit a aussi été transmis par Ibrahim b. Musa al-Razi, de 'Isa, d’après Ibn Jabir avec le même sens. Abu Dawud a dit : 'Abd Allah b. al-'Ala' a rapporté de Nafi' en disant : Quand le crépuscule allait disparaître, il s’arrêtait et regroupait les deux prières",
          "tr": "İbrahim b. Mûsâ er-Râzî, îsâ vasıtasıyle İbn Câbir'den (önceki 1212.) hadisin mânâsını (rivayet etmiştir). Ebû Davud dediki: Bu hadisi bir de Abdullah b. el-A'la Nafi'den rivayet etmiştir. (Nafi) demiştir ki; \"şafak kaybolmak üzere iken (devesinden) indi ve ikisini (akşamla yatsıyı) birleştirerek kıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 1214,
      "arabicNumber": 1214,
      "book": 4,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُسَدَّدٌ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ ثَمَانِيًا وَسَبْعًا الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ ‏.‏ وَلَمْ يَقُلْ سُلَيْمَانُ وَمُسَدَّدٌ بِنَا ‏.‏ قَالَ أَبُو دَاوُدَ وَرَوَاهُ صَالِحٌ مَوْلَى التَّوْأَمَةِ عَنِ ابْنِ عَبَّاسٍ قَالَ فِي غَيْرِ مَطَرٍ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:The Messenger of Allah (ﷺ) led us in prayer at Medina eight of seven rak'ahs, in the noon and afternoon prayers, and the sunset and night prayers. The narrator Sulaiman and Musaddad did not say the words \"led us\". Abu Dawud said: The aforesaid tradition has also been narrated by Salih, the client of Tu'mah on the authority if Ibn 'Abbas saying: \"Not during rain",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینے میں ہمارے ساتھ ظہر و عصر ملا کر آٹھ رکعتیں اور مغرب و عشاء ملا کر سات رکعتیں پڑھیں۔ سلیمان اور مسدد کی روایت میں «بنا» یعنی ہمارے ساتھ کا لفظ نہیں ہے۔ ابوداؤد کہتے ہیں: اسے صالح مولیٰ توامہ نے ابن عباس سے روایت کیا ہے، اس میں «بغير مطر» بغیر بارش کے الفاظ ہیں۔",
          "fr": "Rapporté par Ibn 'Abbas : Le Messager d’Allah ﷺ nous a dirigés dans la prière à Médine, huit ou sept rak‘as pour la prière du midi et de l’après-midi, et pour la prière du coucher du soleil et de la nuit. Les rapporteurs Sulaiman et Musaddad n’ont pas dit les mots « nous a dirigés ». Abu Dawud a dit : Ce récit a aussi été rapporté par Salih, l’affranchi de Tu’mah, d’après Ibn 'Abbas, en précisant : « Pas pendant la pluie. »",
          "tr": "İbn Abbas'dan; demiştir ki: Resûlullah (s.a.v.) bize Medine'de öğle ile ikindiyi, akşamla da yatsıyı sekiz ve yedi rekat olmak üzere kıldırdı. Süleyman ile Müsedded (bu hadisi naklederken) \"Bize\" (sözünü) nakletmediler. Ebû Dâvûd dedi ki: et-Tev'eme'nin azatlısı Salih de bu hadisi, \"İbn Abbâs yağmur olmadığı halde dedi\" (ilâvesiyle) nakletti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (543) Sahih Muslim (705)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 17
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1215,
      "arabicNumber": 1215,
      "book": 4,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدٍ الْجَارِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَابَتْ لَهُ الشَّمْسُ بِمَكَّةَ فَجَمَعَ بَيْنَهُمَا بِسَرِفَ ‏.‏",
        "translations": {
          "en": "Narrated Jabir ibn Abdullah: When the sun set at Mecca, the Messenger of Allah (ﷺ) combined the two prayers at Sarif",
          "ur": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مکہ میں تھے کہ سورج ڈوب گیا تو آپ نے مقام سرف میں دونوں ( مغرب اور عشاء ) ایک ساتھ ادا کی۔",
          "fr": "Rapporté par Jabir ibn Abdullah : Lorsque le soleil s’est couché à La Mecque, le Messager d’Allah ﷺ a regroupé les deux prières à Sarif",
          "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Yahya bin Muhammad Al Jari] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Malik] dari [Abu Az Zubair] dari [Jabir] bahwa matahari telah tenggelam ketika Rasulullah shallallahu 'alaihi wasallam masih berada di Makkah, namun beliau baru menjama' Shalat di daerah Saraf.\" Telah menceritakan kepada kami Muhammad bin Hisyam tetangga Ahmad bin Hambal, telah menceritakan kepada kami Ja'far bin 'Aun dari Hisyam bin Sa'd dia berkata: \"Jarak antara Makkah dengan Saraf adalah sekitar sepuluh mil",
          "tr": "Cabir (r.a.)'den rivayet edildiğine göre, Resûlullah (s.a.v.) Mekke'de iken güneş attı, (akşam ile yatsı namazlarım) ikisini de Şerif (denilen yer)de birleştirerek kıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 18
      },
      "narrator": {
        "en": "Jabir ibn Abdullah"
      }
    },
    {
      "hadithNumber": 1216,
      "arabicNumber": 1216,
      "book": 4,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ هِشَامٍ، جَارُ أَحْمَدَ بْنِ حَنْبَلٍ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، قَالَ بَيْنَهُمَا عَشْرَةُ أَمْيَالٍ يَعْنِي بَيْنَ مَكَّةَ وَسَرِفَ ‏.‏",
        "translations": {
          "en": "Narrated Hisham b. Sa'd:There was a distance of ten miles between them, that is, Mecca and Sarif",
          "ur": "ہشام بن سعد کہتے ہیں کہ دونوں یعنی مکہ اور سرف کے درمیان دس میل کا فاصلہ ہے۔",
          "fr": "Rapporté par Hisham b. Sa'd : Il y avait une distance de dix miles entre eux, c’est-à-dire entre La Mecque et Sarif",
          "tr": "Hişam b. Amr'den; demiştir ki: İkisinin -yani Mekke ile Şerifin- arasında on millik mesafe vardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Maqtu"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Maqtu"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 19
      },
      "narrator": {
        "en": "Hisham b. Sa'd"
      }
    },
    {
      "hadithNumber": 1217,
      "arabicNumber": 1217,
      "book": 4,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ اللَّيْثِ، قَالَ قَالَ رَبِيعَةُ - يَعْنِي كَتَبَ إِلَيْهِ - حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ قَالَ غَابَتِ الشَّمْسُ وَأَنَا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَسِرْنَا فَلَمَّا رَأَيْنَاهُ قَدْ أَمْسَى قُلْنَا الصَّلاَةُ ‏.‏ فَسَارَ حَتَّى غَابَ الشَّفَقُ وَتَصَوَّبَتِ النُّجُومُ ثُمَّ إِنَّهُ نَزَلَ فَصَلَّى الصَّلاَتَيْنِ جَمِيعًا ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا جَدَّ بِهِ السَّيْرُ صَلَّى صَلاَتِي هَذِهِ يَقُولُ يَجْمَعُ بَيْنَهُمَا بَعْدَ لَيْلٍ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ عَاصِمُ بْنُ مُحَمَّدٍ عَنْ أَخِيهِ عَنْ سَالِمٍ وَرَوَاهُ ابْنُ أَبِي نَجِيحٍ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ذُؤَيْبٍ أَنَّ الْجَمْعَ بَيْنَهُمَا مِنِ ابْنِ عُمَرَ كَانَ بَعْدَ غُيُوبِ الشَّفَقِ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Umar: Abdullah ibn Dinar said: The sun set when I was with Abdullah ibn Umar. We proceeded, and when we saw that the evening came, we said prayer. He went on travelling until the twilight disappeared and the stars became thick. He then slighted and combined the two prayers. Then he said: I saw the Messenger of Allah (ﷺ); when he hastened his travelling, he would pray like this prayer of mine. He said: He would combine the two prayers after the passing of a part of night. AbuDawud said: This has been transmitted by Asim ibn Muhammad from his brother on the authority of Salim and this has also been narrated by Ibn AbuNajih from Isma'il ibn AbdurRahman ibn Dhuwayb saying that Ibn Umar would combine the two prayers after the disappearance of twilight",
          "ur": "عبداللہ بن دینار کہتے ہیں کہ سورج ڈوب گیا، اس وقت میں عبداللہ بن عمر رضی اللہ عنہما کے پاس تھا، پھر ہم چلے، جب دیکھا کہ رات آ گئی ہے تو ہم نے کہا: نماز ( ادا کر لیں ) لیکن آپ چلتے رہے یہاں تک کہ شفق غائب ہو گئی اور تارے پوری طرح جگمگا نے لگے، پھر آپ اترے، اور دونوں نمازیں ( مغرب اور عشاء ) ایک ساتھ ادا کیں، پھر کہا کہ میں نے دیکھا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو جب چلتے رہنا ہوتا تو میری اس نماز کی طرح آپ بھی نماز ادا کرتے یعنی دونوں کو رات ہو جانے پر ایک ساتھ پڑھتے۔ ابوداؤد کہتے ہیں: یہ حدیث عاصم بن محمد نے اپنے بھائی سے اور انہوں نے سالم سے روایت کی ہے، اور ابن ابی نجیح نے اسماعیل بن عبدالرحمٰن بن ذویب سے روایت کی ہے کہ ان دونوں نمازوں کو ابن عمر رضی اللہ عنہما نے شفق غائب ہونے کے بعد جمع کیا۔",
          "fr": "Rapporté par Abdullah ibn Umar : Abdullah ibn Dinar a dit : Le soleil s’est couché alors que j’étais avec Abdullah ibn Umar. Nous avons continué à avancer, et quand nous avons vu que la nuit tombait, nous avons prié. Il a continué à voyager jusqu’à la disparition du crépuscule et à l’apparition de nombreuses étoiles. Il s’est alors arrêté et a regroupé les deux prières. Ensuite il a dit : « J’ai vu le Messager d’Allah ﷺ ; quand il pressait sa marche, il priait comme je viens de le faire. » Il a dit : « Il regroupait les deux prières après qu’une partie de la nuit soit passée. » Abu Dawud a dit : Cela a été transmis par Asim ibn Muhammad de son frère, d’après Salim, et aussi rapporté par Ibn Abu Najih de Isma’il ibn AbdurRahman ibn Dhuwayb, disant qu’Ibn Umar regroupait les deux prières après la disparition du crépuscule",
          "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib] telah menceritakan kepada kami [Ibnu Wahb] dari [Al Laits] dia berkata; [Rabi'ah] berkata; -yaitu ia menulis surat kepada Al Laits- telah menceritakan kepadaku [Abdullah bin Dinar] dia berkata; \"Matahari telah terbenam, sementara aku berada di samping Abdullah bin Umar, lalu kami berangkat. Ketika kami tahu waktu telah sore, kami berkata; \"Waktu shalat telah tiba!.\" Namun Ibnu Umar masih tetap berjalan, hingga mega merah telah hilang dan bintang-bintang mulai muncul, kemudian [Ibnu Umar] singgah untuk menjama' dua shalat tersebut (Maghrib dan Isya), lalu dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam, apabila dalam suatu perjalanan mengalami kepayahan, beliau mengerjakan dua shalat ini.\" dia berkata; \"yaitu dengan menjama'nya ketika malam telah tiba.\" Abu Daud berkata; \"Di riwayatkan pula oleh ['Ashim bin Muhammad] dari [Saudaranya] dari [Salim]. Dan di riwayatkan pula oleh [Ibnu Abu Najih] dari [Isma'il bin Abdurrahman bin Dzu`aib] bahwa menjama' keduanya yang berasal dari Ibnu Umar adalah setelah hilang mega merah",
          "tr": "Abdullah b. Dinar'dan; dedi ki: Ben Abdullah b. Ömer'le bir (yolculuk yapar)ken güneş battı, (beraberce) yola devam ettik. Akşam olduğunu görünce \"namaz (zamanı geldi)\" dedik. Yola devam etti. Nihayet şafak kayboldu da yıldızlar (batıya) kaymaya başlayınca (hayvanından) inerek iki namazı birden kıldı. Sonra; \"Ben, Resûlullah'ın acele yola çıktığı zaman namazı şu benim kıldığım gibi kıldığını gördüm. Bu iki namazı gece (girdik)den sonra birleştirdi\" dedi. Ebû Dâvûd dedi ki: Bu hadisi Âsim b. Muhammed'de kardeşi (Ömer b. Muhammed) vasıtasıyla Salim 'den rivayet etmiştir. îbn Ebî Necîh de bu hadisi İsmail b. Abdurrahman b. Zübeyr'den; \"îbn Ömer'in bu iki namazı birleştirmesi şafak kaybolduktan son­ra idi\" şeklinde rivayet etti. Diğer tahric: Beyhakî, es-Sünenü'l-kührâ, III"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 20
      },
      "narrator": {
        "en": "Abdullah ibn Umar"
      }
    },
    {
      "hadithNumber": 1218,
      "arabicNumber": 1218,
      "book": 4,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، وَابْنُ، مَوْهَبٍ - الْمَعْنَى - قَالاَ حَدَّثَنَا الْمُفَضَّلُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا فَإِنْ زَاغَتِ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو دَاوُدَ كَانَ مُفَضَّلٌ قَاضِيَ مِصْرَ وَكَانَ مُجَابَ الدَّعْوَةِ وَهُوَ ابْنُ فَضَالَةَ ‏.‏",
        "translations": {
          "en": "Narrated Anas b. Malik :When the Messenger of Allah (ﷺ) proceeded before the sun had declined, he delayed the noon prayer till the time of the afternoon prayer, he would then alight and combine the two prayers. If the sun declined before he moved off, he would offer the noon prayer and rode (the beast) - may peace be upon him. Abu Dawud said: The narrator Mufaddal was the judge of Egypt. His supplication was accepted by Allah; he was the son of Fudalah",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب سورج ڈھلنے سے پہلے کوچ فرماتے تو ظہر کو عصر کے وقت تک مؤخر کر دیتے پھر قیام فرماتے اور دونوں کو جمع کرتے، اور اگر کوچ کرنے سے پہلے سورج ڈھل جاتا تو آپ ظہر پڑھ لیتے پھر سوار ہوتے۔ ابوداؤد کہتے ہیں: مفضل مصر کے قاضی اور مستجاب لدعوات تھے، وہ فضالہ کے لڑکے ہیں۔",
          "fr": "Rapporté par Anas b. Malik : Lorsque le Messager d’Allah ﷺ repartait avant que le soleil n’ait passé le zénith, il retardait la prière du midi jusqu’à l’heure de la prière de l’après-midi, puis il s’arrêtait et regroupait les deux prières. Si le soleil avait passé le zénith avant qu’il ne reparte, il accomplissait la prière du midi puis montait sur sa monture – que la paix soit sur lui. Abu Dawud a dit : Le rapporteur Mufaddal était le juge d’Égypte. Allah exauçait ses invocations ; il était le fils de Fudalah",
          "id": "Telah menceritakan kepada kami [Qutaibah] dan [Ibnu Mauhib] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Al Mufadlal] dari ['Uqail] dari [Ibnu Syihab] dari [Anas bin Malik] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam berangkat safar sebelum matahari condong (ke barat), maka beliau mengakhirkan Dluhur hingga waktu Ashar, kemudian beliau singgah dan menjama' keduanya, apabila matahari mulai condong sebelum berangkat, maka beliau mengerjakan shalat Dluhur lalu beliau shallallahu 'alaihi wasallam berangkat.\" Abu Daud berkata; \"Mufadlal adalah qadli (hakim) daerah Mesir, sedangkan orang yang di ijabahi do'anya adalah ibnu Fadlalah.\" Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Jabir bin Isma'il] dari ['Uqail] seperti hadits ini dengan sanadnya, katanya; \"Kemudian beliau mengakhirkan waktu Maghrib hingga beliau menjama' shalat Isya' ketika mega merah telah hilang",
          "tr": "Enes b. Mâlik'den; demiştir ki: Resûlullah (s.a.v.) güneşin zevalinden önce yola çıktığı vakit öğle namazını ikindi vaktine kadar te'hir eder, sonra hayvanından inerek ikisini birden kılardı. Eğer yola çıkmadan önce güneş (batıya) kaymışsa öğleyi kılıp da yola çıkardı. Ebû Dâvûd dedi ki: (Bu hadisin râvisi olan) Mufaddal, duası mak­bul Mısır kadısı İbn Fadâle'dir. Diğer tahric: Buhârî, taksîrü's-salât; Müslim, müsâfirîn; Nesâî, mevâkît"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1112) Sahih Muslim (704)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 21
      },
      "narrator": {
        "en": "Anas b. Malik"
      }
    },
    {
      "hadithNumber": 1219,
      "arabicNumber": 1219,
      "book": 4,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي جَابِرُ بْنُ إِسْمَاعِيلَ، عَنْ عُقَيْلٍ، بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ قَالَ وَيُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ حِينَ يَغِيبُ الشَّفَقُ ‏.‏",
        "translations": {
          "en": "The above mentioned tradition has also been reported by 'Uqail through a different chain of narrators. He said:He would delay the evening prayer till he combined the evening and the night prayers when the twilight disappeared",
          "ur": "اس طریق سے بھی عقیل سے یہی روایت اسی سند سے منقول ہے البتہ اس میں اضافہ ہے کہ مغرب کو مؤخر فرماتے یہاں تک کہ جب شفق غائب ہو جاتی تو اسے اور عشاء کو ملا کر پڑھتے۔",
          "fr": "Le récit mentionné ci-dessus a aussi été rapporté par 'Uqail avec une chaîne différente. Il a dit : Il retardait la prière du coucher du soleil jusqu’à ce qu’il regroupe la prière du coucher du soleil et celle de la nuit, lorsque le crépuscule disparaissait",
          "tr": "Ukayl (önceki 1218.) hadisi aynı senedle rivayet etmiş ve demiştir ki: Akşamı da geciktirir ve şafak kaybolunca yatsıyla birleştirerek kılardı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1112) Sahih Muslim (704)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 1220,
      "arabicNumber": 1220,
      "book": 4,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الطُّفَيْلِ، عَامِرِ بْنِ وَاثِلَةَ عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي غَزْوَةِ تَبُوكَ إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ حَتَّى يَجْمَعَهَا إِلَى الْعَصْرِ فَيُصَلِّيهِمَا جَمِيعًا وَإِذَا ارْتَحَلَ بَعْدَ زَيْغِ الشَّمْسِ صَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ سَارَ وَكَانَ إِذَا ارْتَحَلَ قَبْلَ الْمَغْرِبِ أَخَّرَ الْمَغْرِبَ حَتَّى يُصَلِّيَهَا مَعَ الْعِشَاءِ وَإِذَا ارْتَحَلَ بَعْدَ الْمَغْرِبِ عَجَّلَ الْعِشَاءَ فَصَلاَّهَا مَعَ الْمَغْرِبِ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَمْ يَرْوِ هَذَا الْحَدِيثَ إِلاَّ قُتَيْبَةُ وَحْدَهُ ‏.‏",
        "translations": {
          "en": "Narrated Mu'adh ibn Jabal: The Prophet (ﷺ) was engaged in the Battle of Tabuk. If he moved off before the sun had declined, he would delay the noon prayer till he would combine it with the afternoon prayer and would offer them together. If he moved off after the sun had declined, he would combine the noon and afternoon prayers, and then he proceeded; if he moved off before the evening prayer, he would delay the evening prayer; he would offer it along with the night prayer, he would delay the evening prayer; he would offer it along with the night prayer. If he moved off after the evening prayer, he would offer the night prayer earlier and offer it along with the evening prayer. Abu Dawud said: This tradition has not been narrated by anyone except by Qutaibah",
          "ur": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم غزوہ تبوک میں سورج ڈھلنے سے پہلے کوچ فرماتے تو ظہر کو مؤخر کر دیتے یہاں تک کہ اسے عصر سے ملا دیتے، اور دونوں کو ایک ساتھ ادا کرتے، اور جب سورج ڈھلنے کے بعد کوچ کرتے تو ظہر اور عصر کو ایک ساتھ پڑھتے پھر روانہ ہوتے، اور جب مغرب سے پہلے کوچ فرماتے تو مغرب کو مؤخر کرتے یہاں تک کہ اسے عشاء کے ساتھ ملا کر ادا کرتے، اور اگر مغرب کے بعد کوچ کرتے تو عشاء میں جلدی فرماتے اور اسے مغرب کے ساتھ ملا کر پڑھتے۔ ابوداؤد کہتے ہیں: یہ حدیث سوائے قتیبہ کے کسی اور نے روایت نہیں کی ہے ۱؎۔",
          "fr": "Rapporté par Mu'adh ibn Jabal : Le Prophète ﷺ était engagé dans la bataille de Tabuk. S’il repartait avant que le soleil n’ait passé le zénith, il retardait la prière du midi afin de la regrouper avec celle de l’après-midi et les accomplissait ensemble. S’il repartait après le zénith, il regroupait la prière du midi et celle de l’après-midi, puis il reprenait la route. S’il repartait avant la prière du coucher du soleil, il retardait cette prière et l’accomplissait avec celle de la nuit. S’il repartait après la prière du coucher du soleil, il avançait la prière de la nuit et l’accomplissait avec celle du coucher du soleil. Abu Dawud a dit : Ce récit n’a été rapporté que par Qutaibah",
          "tr": "Muâz b. Cebel (r.a.)'den rivayet olunduğuna göre; Nebi (s.a.v.) Tebûk gazvesinde iken güneş (batıya) kaymadan önce yola çıkarsa, öğleyi ikindiye kadar bekletir, ikindi namazıyla birlikte kılardı. Eğer güneş batıya kaydıktan sonra yola çıkmak isterse ikindiyi (vaktinden) öne alarak öğleyle beraber kıldıktan sonra yola düşerdi. Eğer akşamdan önce yola çıkacak olursa akşamı te'hir eder yatsıyla beraber kılardı. Eğer akşam olduktan sonra yola çıkmak isterse yatsıyı (vaktinden) öne alarak akşamla birlikte kılardı. Ebu Davud dediki: Bu hadisi Kuteybe'den başka hiçbir kimse rivayet etmedi. Diğer tahric: Buhârî, taksir; Müslim, müsâfirin; Tirmizî, cuma; Nesaî, mevâkit; Ahmed b. Hanbel, III"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 23
      },
      "narrator": {
        "en": "Mu'adh ibn Jabal"
      }
    },
    {
      "hadithNumber": 1221,
      "arabicNumber": 1221,
      "book": 4,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنِ الْبَرَاءِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَصَلَّى بِنَا الْعِشَاءَ الآخِرَةَ فَقَرَأَ فِي إِحْدَى الرَّكْعَتَيْنِ بِالتِّينِ وَالزَّيْتُونِ ‏.‏",
        "translations": {
          "en": "Narrated Al-Bara' :We went out on a journey along with the Messenger of Allah (ﷺ). He led us in the night prayer and he recited in one of the rak'ahs: \"By the fig and the olive",
          "ur": "براء رضی اللہ عنہ کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں نکلے آپ نے ہمیں عشاء پڑھائی اور دونوں رکعتوں میں سے کسی ایک رکعت میں «والتين والزيتون» پڑھی",
          "fr": "Rapporté par Al-Bara’ : Nous sommes partis en voyage avec le Messager d’Allah ﷺ. Il nous a dirigés dans la prière de la nuit et il a récité dans l’une des rak‘as : « Par le figuier et l’olivier. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari ['Adi bin Tsabit] dari [Al Barra`] dia berkata; \"Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam, lalu beliau mengerjakan shalat Isya', di salah satu raka'atnya beliau membaca: \"At Tiin waz zaitun",
          "tr": "el-Berâ (r.a.)'dan; demiştir ki: Resûlullah ile birlikte bir yolculuğa çıkmıştık. Bize kıldırdığı son yatsı namazında (ilk) iki rekatın birincisinde et-Tîn sûresini okudu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (767) Sahih Muslim (464)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 24
      },
      "narrator": {
        "en": "Al-Bara'"
      }
    },
    {
      "hadithNumber": 1222,
      "arabicNumber": 1222,
      "book": 4,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ أَبِي بُسْرَةَ الْغِفَارِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ الأَنْصَارِيِّ، قَالَ صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَمَانِيَةَ عَشَرَ سَفَرًا فَمَا رَأَيْتُهُ تَرَكَ رَكْعَتَيْنِ إِذَا زَاغَتِ الشَّمْسُ قَبْلَ الظُّهْرِ ‏.‏",
        "translations": {
          "en": "Narrated Al-Bara' ibn Azib: I accompanied the Messenger of Allah (ﷺ) on eighteen journeys and I never saw him fail to pray two rak'ahs when the sun had passed the meridian before offering the noon prayer",
          "ur": "براء بن عازب انصاری رضی اللہ عنہما کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اٹھارہ سفروں میں رہا، لیکن میں نے نہیں دیکھا کہ سورج ڈھلنے کے بعد ظہر سے پہلے آپ نے دو رکعتیں ترک کی ہوں۔",
          "fr": "Rapporté par Al-Bara’ ibn Azib : J’ai accompagné le Messager d’Allah ﷺ lors de dix-huit voyages et je ne l’ai jamais vu manquer de prier deux rak‘as lorsque le soleil avait passé le zénith avant la prière du midi",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Shufwan bin Sulaim] dari [Abu Busrah Al Ghifari] dari [Al Barra` bin 'Azib Al Anshari] dia berkata; \"Aku pernah menyertai Rasulullah shallallahu 'alaihi wasallam dalam perjalanan sebanyak delapan belas kali, dan aku tidak pernah sama sekali melihat beliau meninggalkan dua raka'at ketika matahari telah condong",
          "tr": "el-Berâ b. Âzib el-Ensâri'den; demiştir ki: Ben Resûlullah (s.a.v.) ile birlikte onsekiz defa yolculuk yaptım. Güneş (batıya) kaydıktan sonra, öğleden evvel iki rekat namaz kılmayı terk ettiğini görmedim. Diğer tahric: Tirmizî, salât"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 25
      },
      "narrator": {
        "en": "Al-Bara' ibn Azib"
      }
    },
    {
      "hadithNumber": 1223,
      "arabicNumber": 1223,
      "book": 4,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ أَبِيهِ، قَالَ صَحِبْتُ ابْنَ عُمَرَ فِي طَرِيقٍ - قَالَ - فَصَلَّى بِنَا رَكْعَتَيْنِ ثُمَّ أَقْبَلَ فَرَأَى نَاسًا قِيَامًا فَقَالَ مَا يَصْنَعُ هَؤُلاَءِ قُلْتُ يُسَبِّحُونَ ‏.‏ قَالَ لَوْ كُنْتُ مُسَبِّحًا أَتْمَمْتُ صَلاَتِي يَا ابْنَ أَخِي إِنِّي صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي السَّفَرِ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ عَزَّ وَجَلَّ وَصَحِبْتُ أَبَا بَكْرٍ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ عَزَّ وَجَلَّ وَصَحِبْتُ عُمَرَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ تَعَالَى وَصَحِبْتُ عُثْمَانَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ تَعَالَى وَقَدْ قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ ‏}‏ ‏.‏",
        "translations": {
          "en": "Narrated Hafs b. 'Asim:I accompanied Ibn 'Umar on the way (on a journey). He led us in two rak'ah's of (the noon) prayer. Then he proceeded and saw some people standing. He asked: What are they doing ? I replied: They are glorifying Allah (i.e. offering supererogatory prayer). He said: If I had offered the supererogatory prayer (while travelling), I would have completed prayer, my cousin. I accompanied the Messenger of Allah (ﷺ) during the journey, he did not pray more than two raka'at until his death. I also accompanied Abu Bakr, and he prayed two raka'at and nothing more until he died. I also accompanied 'Umar, and he prayed two raka'at and nothing more until he died. I also accompanied 'Uthman, and he prayed two raka'at and nothing more until he died. Indeed Allah, the Exalted, said: \"Certainly you have in the Messenger of Allah an excellent exemplar",
          "ur": "حفص بن عاصم کہتے ہیں کہ میں ایک سفر میں ابن عمر رضی اللہ عنہما کے ساتھ رہا تو آپ نے ہم کو دو رکعت نماز پڑھائی پھر متوجہ ہوئے تو دیکھا کہ کچھ لوگ ( نماز کی حالت میں ) کھڑے ہیں، پوچھا: یہ لوگ کیا کر رہے ہیں؟ میں نے کہا: یہ نفل پڑھ رہے ہیں، تو آپ نے کہا: بھتیجے! اگر مجھے نفل ۱؎ پڑھنی ہوتی تو میں اپنی نماز ہی پوری پڑھتا، میں سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہا لیکن آپ نے دو سے زیادہ رکعتیں نہیں پڑھیں یہاں تک کہ اللہ تعالیٰ نے آپ کو وفات دے دی، پھر میں ابوبکر رضی اللہ عنہ کے ساتھ رہا انہوں نے بھی دو رکعت سے زیادہ نہیں پڑھیں یہاں تک کہ اللہ تعالیٰ نے انہیں وفات دے دی، اور عمر رضی اللہ عنہ کے ساتھ رہا انہوں نے بھی دو سے زیادہ رکعتیں نہیں پڑھیں یہاں تک کہ اللہ تعالیٰ نے انہیں وفات دے دی، مجھے ( سفر میں ) عثمان رضی اللہ عنہ کی رفاقت بھی ملی لیکن انہوں نے بھی دو سے زیادہ رکعتیں نہیں پڑھیں یہاں تک کہ اللہ تعالیٰ نے انہیں وفات دے دی، اور اللہ عزوجل فرما چکا ہے: «لقد كان لكم في رسول الله أسوة حسنة‏» تمہارے لیے اللہ کے رسول کی زندگی میں بہترین نمونہ ہے ۔",
          "fr": "Rapporté par Hafs b. 'Asim : J’ai accompagné Ibn 'Umar en voyage. Il nous a dirigés dans la prière du midi en deux rak‘as. Ensuite il a continué et a vu des gens debout. Il a demandé : « Que font-ils ? » J’ai répondu : « Ils glorifient Allah (c’est-à-dire qu’ils accomplissent une prière surérogatoire). » Il a dit : « Si j’avais accompli une prière surérogatoire en voyage, j’aurais complété la prière, mon cousin. J’ai accompagné le Messager d’Allah ﷺ pendant le voyage, il n’a jamais prié plus de deux rak‘as jusqu’à sa mort. J’ai aussi accompagné Abu Bakr, et il priait deux rak‘as et rien de plus jusqu’à sa mort. J’ai aussi accompagné 'Umar, et il priait deux rak‘as et rien de plus jusqu’à sa mort. J’ai aussi accompagné 'Uthman, et il priait deux rak‘as et rien de plus jusqu’à sa mort. En vérité, Allah, le Très-Haut, a dit : “Vous avez dans le Messager d’Allah un excellent modèle.” »",
          "id": "telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Isa bin Hafsh bin 'Ashim bin Umar bin Khattab] dari [ayahnya] dia berkata; \"Aku pernah menemani Ibnu Umar dalam suatu perjalanan.\" Hafsh berkata; \"lalu Ibnu Umar melaksanakan shalat dua raka'at bersama kami, Kemudian dia menghadap, ketika dia melihat orang-orang berdiri, dia berkata; \"Apa yang di perbuat mereka?\" Jawabku; \"Mereka sedang mengerjakan shalat sunnah.\" [Ibnu Umar] berkata; \"Sekiranya aku mengerjakan shalat sunnah, tentu aku akan menyempurnakan shalatku. Wahai anak saudaraku, Sesungguhnya aku pernah menyertai Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, namun beliau tidak pernah menambah dua raka'at hingga Allah Azza Wa Jalla mewafatkannya, aku juga pernah menyertai Abu Bakar, namun dia tidak pernah menambah dua raka'at hingga Allah Azza Wa Jalla mewafatkannya, aku juga menyertai Umar, namun dia tidak pernah menambah dua raka'at hingga Allah Ta'ala mewafatkannya, aku juga pernah menyertai Utsman, namun dia tidak pernah menambah dua raka'at hingga Allah Ta'ala mewafatkannya, sungguh Allah Azza Wa Jalla telah berfirman; \"Sesungguhnya Telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu.\" QS Al Ahzab;",
          "tr": "Hafs b. Âsim b. Ömer b. el-Hattab dedi ki: \"Ben Mekke yolunda İbn Ömer'le beraber bulundum. Bize iki rekat namaz kıldırdı, sonra dönüp bir baktı ki halk uzakta dikiliyorlar: Bunlar ne yapıyorlar? dedi. Ben: Nafile namaz kılıyorlar, dedim. O da: Ben nafile kılacak olsam namazımı (dörde) tamamlardım. Ey kardeşimin oğlu! Gerçekten ben Resûlullah (s.a.v.) ile birlikte seferde bulundum. Allah ruhunu kabzedinceye kadar iki rekattan fazla kılmadı. Ebû Bekir'le birlikte bulundum, o da Allah ruhunu kabzedin­ceye kadar iki rekatten fazla kılmadı. Ömer'le de beraber bulundum, o da Allah ruhunu kabz edinceye kadar iki rekattan fazla kılmadı. Sonra Osman'la beraber bulundum o da Allah Teâlâ ruhunu kabz edinceye kadar iki rekattan fazla kılmadı. Allahu Teâlâ da; \"Gerçekten Resûlullah da sizin için güzel bir örnek vardır\" buyurmuştur, dedi. izah: Buhârî, taksîrü's-salât; Müslim, musâfirîn; Nesâî, taksiru's-salât; İbn Mâce, ikâme Bu hadis-i şerif Resul-i Ekrem (s.a.v.)'in yolculukta beş vakit namaza bağlı olarak kılınan revâtib sünnetleri kılmadığını ve Râşid halifelerinin de aynı yolu takip ettiklerini ifâde etmektedir. Buhârî'nin, Salim b. Abdillah'dan rivayet ettiği hadis-i .şerif ise, Resûl-i Ekrem (s.a.v.)'in yolculukta hayvan üzerinde hayvanın gidiş istikâmetine doğru yö­nelerek nafile namaz kıldığım [Buhârî, taksîrü's-salât] ifâde etmektedir. Bu da gösteriyor ki sefer­de nafile kılmakta hiçbir sakınca yoktur. Esasen ulemâ bu mevzuda ittifak etmiştir. Ancak her ne kadar mevzumuzu teşkil eden Ebû Dâvûd hadisinde Hz. Osman'ın da hayatının sonuna kadar seferde iki rekattan fazla namaz kılmadığı ifâde ediliyorsa da Müslim'in rivayet ettiği, \"Resûlullah (s.a.v.) Mina'da namazı iki rekat kıldı. Ondan sonra Ebû Bckr, Ebu Bekr'den sonra, Ömer ve hilâfetinin ilk zamanlarında Osman da hep ikişer rekat kıldılar. Bir müddet sonra Osman dört rekat kılmağa başladı. İbn Ömer imamla kıldığı vakit dört, yalnız kıldığında iki rekat kılmış”[Müslim, musâfirîn] mealindeki hadis-i şeriften ömrünün son zamanlarında seferde farz namazları dörde tamamladığı anla­şılıyor. Binaenaleyh bu iki hadis-i şerif arasında da bir çelişki söz konusu değildir. Çünkü iyice dikkat edilirse, Ebü Dâvûd hadisindeki \"Hz. Osman, seferde Allah ruhunu kabzedinceye kadar farzları ikişer rekat kıldı'' ifadesi Hz. Osman'ın Minâ'nm dışındaki yolculuklarıyla ilgilidir. Müslim hadisin­deki hayatının son zamanlarına doğru farzları dörde1 tamamlayarak kıldığı­na dâir olan ifâde ise, Minâ'da kıldığı namazlarla ilgilidir. Hz. Osman'ın Minâ'da sonraları namazını niçin kıldığı meselesi de ihtilaflıdır. Bir kavle göre Osman (r.a.) namazını özellikle tam kılmıştır. Ulemâdan bazılarına göre, Hz. Osman bu babda mubah ile amel etmiştir. Çünkü yolcu için namazı iki rekat kılmak da, dört rekat kılmak da caizdir. Zührî'ye göre Osman (r.a.)'in Minâ'da namazlarını dört rekat olarak kılması o sene orada bedeviler çok bulunduğu içindir. Osman (r.a.) onlara kıldığı namazların esas itibariyle dör­der rekatlı olduğunu göstermek istemiştir. Zührî'den diğer bir rivayete göre hac'dan sonra Minâ'da ikâmete niyet ettiği için dört rekat kılmıştır. Zührî'­den bunlara yakın daha başka rivayetler de vardır. Fakat bu rivayetlerin hep­sine itiraz olunmuştur. Hz. Osman'ın Minâ'da namazlarım tam kıldığı için kendisine itiraz edilince ; \"Ey nâs! Ben buraya gelince evlendim. Ben Re-sûlullah (s.a.v.)'den, \"Bir kimse bir beldeden evlenirse, orada namazlarını mu­kim namazı gibi kılsın\" dediğini işittim\" dediği rivayet olunursa da bu rivayet munkati'dir. İbn Battal diyor ki: \"Bu kaviller içinde sahih olanı -Allahii a'lem- şu­dur: Osman ile Âişe (r.anhumâ)'nın seferde namazlarını tamam yani dört rekat üzerinden kılmaları Peygamber 'in kasrla tamam kılma arasında mu­hayyer bırakılınca ümmetine kolay geleni seçtiğini [Müslim, fedâil] bildikleri içindir. Ge­rek Âişe (r.anhâ) gerekse Osman (r.a.) kendileri hakkında ruhsatı bırakarak şiddeti tercih etmişlerdir. Çünkü bunu da kendileri için mubah görmüşler­dir. Bu hadisle ilgili hükümler bir önceki hadisin açıklamasında geçmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1102) Sahih Muslim (689)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 26
      },
      "narrator": {
        "en": "Hafs b. 'Asim"
      }
    },
    {
      "hadithNumber": 1224,
      "arabicNumber": 1224,
      "book": 4,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُسَبِّحُ عَلَى الرَّاحِلَةِ أَىَّ وَجْهٍ تَوَجَّهَ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لاَ يُصَلِّي الْمَكْتُوبَةَ عَلَيْهَا ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Umar:While travelling the Messenger of Allah (ﷺ) would pray voluntary prayer on his riding beast in whatever direction it turned; and he would observe witr prayer, but he did not offer the obligatory prayers upon it",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سواری پر نفل پڑھتے تھے، خواہ آپ کسی بھی طرف متوجہ ہوتے اور اسی پر وتر پڑھتے، البتہ اس پر فرض نماز نہیں پڑھتے تھے ۱؎۔",
          "fr": "Rapporté par Ibn 'Umar : En voyage, le Messager d’Allah ﷺ accomplissait la prière surérogatoire sur sa monture, peu importe sa direction ; il accomplissait aussi la prière du witr, mais il n’accomplissait pas les prières obligatoires sur sa monture",
          "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] dari [ayahnya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan shalat sunnah di atas kendaraannya ke arah mana saja kendaraannya menghadap, dan pernah juga mengerjakan shalat witir di atas kendaraan, namun beliau tidak pernah mengerjakan shalat wajib di atas kendaraan",
          "tr": "Salim, babası (İbn Ömer)'in şöyle dediğini rivayet etmiştir: Resûlullah (s.a.v.) yönü ne tarafa olursa olsun, deve üzerinde nafile ve vitir namazı kılardı. Fakat deve üzerinde farz namazı kılmazdı. izah: Buhâri, salât; vitr; taksir; Müslim, müsâfirîn; Tirmizî, mevâkît; Nesâî, salât; kıble; Muvatta', sefer; Ahmed b. Hanbel, Iî, 2, 4, 7, 20, 38, 41, 44. Hadisin muhtelif rivayetleri binit üzerinde nafile namaz kılınabileceğine, bu arada vitir namazını dahi hayvan üze­rinde kılmanın caiz olduğuna delâlet etmektedir. Hayvan üzerinde nafile namaz kılmak bi'1-ittifak caizdir. Yalnız Dârekutnî ve başkaları burada râvî Amr b. Yahya'nın hata ettiğini söylemiş ve; \"Peygamber (s.a.v.)'in malum olan namazı deve üzerinde idi. Doğrusu mer-keb üzerinde namaz kılmak Müslim'in de zikrettiği vechle Enes'in yaptığı bir iştir” demişlerdir. Sübha'dan murad, nafile namazdır. Tesbih'in hakikati noksanlıklardan tenzih demektir. Ancak mecazen tahmîd, temcîd ve sairede kullanıldığı gibi cüz'ü zikir, küllü irade kabilinden mecaz-i mürsel olmak üzere nafile nama­za da sübha denilir. Bu babda her mezhebin tafsilâtı vardır. Şöyle ki: 1. Şâfiîlere göre, hayvan üzerinde nafile kılan bir kimse gideceği tarafa doğru namaz kılar. O taraftan başka yere inhiraf etmesi caiz değildir. Me­ğer ki kıble başka tarafta olup da onun için inhiraf etmiş ola! Aksi takdirde namazı bozulur. Hayvan üzerinde namaz ancak sefer şartı ile caizdir. Velev ki gideceği -yer sefer mesafesinden az olsun. Meşakkat yoksa namazı rükü'u ile sücûdu ile kılmak icab eder. Meşakkat varsa rükû' ve sücûdu imâ ile yapar. Kıbleye karşı dönmek vâcibtir. Fakat o da meşakkatli ise yalnız iftitâh tekbirini alır­ken kıbleye dönmek icabeder. O da meşakkatli olursa altı şartla kıbleye kar­şı dönmek ondan sakıt olur. Bu şartlar: a) Seferin mubah olması, b) Seferin cuma ezanı işitilmeyecek kadar uzak bir yere yapılması. c) Seferin ticâret gibi şer'i bir maksatla yapılması, d) Seferin namazdan çıkıncaya kadar devam etmesi, e) Yürüyüşün devam etmesidir. Namaz esnasında istirahat için durmak, veya hayvandan inmek, namazı bozar, o namazı yeniden kılmak icabeder. f) Özürsüz ve ihtiyaç yokken hayvanı mahmuzlamak ve koşturmak gibi fi'l-i kesirden (yani namazla alâkası olmayan fazla fiil ve hareketten) sakın­maktır. Zaruret veya ihtiyaç varsa, bu gibi fiiller, namaza zarar vermez. Hayvanın üzerinde oturacağı yer temiz olmalıdır. Hayvanın yuları elin­de iken hayvan bevleder veya ağzı kanar yahut necaset üzerine basarsa, na­mazı bozulur. Yülan, elinde değilse, bunların, namaza zararı yoktur. Yolcunun yürürken nafile namaz kılması caizdir. Yol, çamur değilse na­mazı rükûu ile, sücûdu île kılmak ve bunları yaparken kıbleye dönmek ica­beder. Nitekim namaza niyetlenirken ve iki secde arasında otururken dahi kıbleye dönmek lâzımdır. Namazda yalnız kıyam hâlinde, rüku'dan doğrulurken, teşehhüd okurken ve selâm verirken yürür. Kar, çamur veya su için­de yürüyen kimse rükû' ve sücudunu imâ ile yapabilir. Yalnız kıbleye dönmesi icab eder, yürüyerek namaz kılan kimse kasten necaset üzerine basarsa namazı bozulur. Unutarak basarsa ayağına bulaşıp kalmamak şartı ile namazı sahihtir, bulaşırsa namazı bozulur. 2. Malikilere göre sefer mesafesine giden yolcunun hayvanın üzerinde nafile hatta vitir namazını kılması caizdir. Buna yolcunun namazını kasr et­meye başladığı yerden başlanır. Hayvanın üzerinde tahtırevan veya mihaffe gibi bir şey bulunur da rükû ve sücûd yapmak mümkün olursa, ya ayakta yahut oturarak namazı rükû'u ile, sücûdu ile kılmak icâb eder. Sefer edece­ği tarafa dönmek istikbal-i kıble yerini tutar. Eşek veya katır gibi bir hayvan üzerinde namaz kılan rükû' ve sücûdu imâ ile yapabilir. Fakat imânın semer üzerine değil de yere yapılması ve alnının açık bulunması şarttır. İmâ ettiği yerin temiz olması ve keza istikbâl-i kıble şart değildir. Şart olan gideceği yere göre dönmesidir. Zaruret yokken kasden gideceği yerden başka tarafa dönmek namazı bozar. Bundan yalnız kıble müstesnadır. Çünkü kıble asıldır. Hayvan üzerinde nafile namaz kılan kimsenin mümkünse namaza, kıb­leye karşı niyetlenmesi mendubtur. Fakat yaya giden veya sefer mesafesin­den daha yakın bir yere niyet eden ve keza hayvana mutad şekilde binmemiş, (mesela ters binmiş) olan kimsenin namazı ancak kıbleye karşı dönerek rü­kû ve sücûdunu tam yapmakla sahih olur. Hayvanın üzerinde nafile kılan kimse hayvanı kamçılamak ayağı ile dürt­mek ve yularını eliyle tutmak gibi zarurî fiilleri yapabilir. Yalnız konuşamaz ve bakınamaz. Hayvanın üzerinde namaza niyet eden kimse durur da bulunduğu yerde ikâmete niyet ederse, hayvanından inerek yerde rükû' ve sücûdu ile namazı­nı tamamlar. Sefer hükmüne son veren ikâmete niyet etmezse, namazını hay­vanın üzerinde tamamlar ve kıraati hafif tutar. Hayvanın üzerinde farz namaz kılmak caiz değildir. Yalnız hevdec gibi bir şey içinde bulunursa, kıbleye karşı ayakta durmak, rükû' ve sücûdu yap­mak şartı ile namazı sahihdir. 3. Han belilere göre mubah olmak şartı ile muayyen bir yere yola çıkan bir yolcunun hayvan üzerinde nafile namaz kılması caizdir. Yaya giden bir kimsenin yürürken nafile kılması dahi böyledir. Hayvan üzerinde kılan kim­senin meşakkatsiz mümkün olduğu takdirde bütün namazını kıbleye karşı dönerek rükû'u ile sücûdu ile kılması icab eder. Meşakkat varsa bunlardan hiçbiri vâcib olmaz. Kıbleye karşı dönemeyen gideceği yere doğru kılar. Rükû' ve sücûd'dan birini yapamayan onu ima ile edâ eder. Mümkün olursa secde için rükû'dan daha fazla eğilerek ima yapmak gerekir. Yaya giden kimsenin, kıbleye doğru namaza niyetlenmesi ve yine kıble­ye doğru rükû' ve secde yapması lâzımdır. Namazın sair kısımlarını gideceği tarafa doğru dönerek edâ eder. Gerek hayvan üzerinde gerekse yaya giderken, nafile kılan bir kimse, gideceği tarafa döndürülse yahut kendisi dönse, özürü bulunmadığı takdirde namazı mutlak surette bâtıl olur. Meğer ki, kıb­leye dönmüş ola! Bir özürden dolayı başka tarafa dönmüş ve örfen çok sa­yılacak derecede ise, namazı bâtıl olur. Aksi takdirde namazı sahihtir. Hayvanın temiz olması şart değilse de üzerinde, namaz kılan kimsenin altındaki heybe ve benzeri şeylerin temiz olması şarttır. Muayyen bir yere gitmeyi niyet etmeyen, yahut mekruh veya haram bir sefere çıkan kimseye kıbleye dönmek ve sair namazın bütün şartlarını yerine getirmek vacibtir. 4. Hanefîlere göre, hayvan nereye dönerse namazı o tarafa doğru kıl­mak mendubtur. Hayvanın döndüğü tarafı bırakıp da başka tarafa dönmek caiz değildir. Çünkü bunun için bir zaruret yoktur. Hayvan üzerinde namaz kılmak için sefer dahi şart değildir. Mukim olan bir kimse hiçbir özrü olmadığı halde yolcunun namazını kasr etmeye başla­dığı yere (şehir dışına) çıktığı vakit hayvanın üzerinde nafile namazı kılabilir. Bu namaz da imâ ile kılınır. Namaza niyetlenirken kıbleye karşı dön­mek şart değildir. Çünkü namazın kendisi kıbleye dönmeden caiz olunca, kıbleye dönmeden niyet de caizdir. Yalnız kıbleye karşı dönmek imkânı var­sa ona karşı niyetlenmek müstehabtır. Namaza yerde niyetlenen bir kimse, onu hayvanın üzerinde tamamlayamaz. Fakat şehir dışında hayvan üzerin­de başladığı namazım, şehir içine girdiği vakit de hayvan üzerinde tamamla­yabilir. Farz ve vâcib namazları ile sabah namazının sünnetini hayvan üzerinde kılmak caiz değildir. Meğer ki kendinin veya hayvanının hırsız yahut yırtıcı hayvan tehlikesine maruz kalması gibi bir zaruret buluna! Hayvan üzerinde namazın sahih olması için hayvanın temiz olması şart değildir. Hayvanın vücudunda hatta semeri ile özengisinde necaset bulun­ması namaza mâni değildir. Yaya giden bir kimsenin yürürken nafile kılma­sı caiz değildir; namaz kılacağı vakit durması ve namazını dururken kılması icab eder"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1098) Sahih Muslim (700)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 27
      },
      "narrator": {
        "en": "Ibn 'Umar"
      }
    },
    {
      "hadithNumber": 1225,
      "arabicNumber": 1225,
      "book": 4,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا رِبْعِيُّ بْنُ عَبْدِ اللَّهِ بْنِ الْجَارُودِ، حَدَّثَنِي عَمْرُو بْنُ أَبِي الْحَجَّاجِ، حَدَّثَنِي الْجَارُودُ بْنُ أَبِي سَبْرَةَ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَافَرَ فَأَرَادَ أَنْ يَتَطَوَّعَ اسْتَقْبَلَ بِنَاقَتِهِ الْقِبْلَةَ فَكَبَّرَ ثُمَّ صَلَّى حَيْثُ وَجَّهَهُ رِكَابُهُ ‏.‏",
        "translations": {
          "en": "Narrated Anas ibn Malik: When the Messenger of Allah (ﷺ) was on a journey and wished to say voluntary prayer, he made his she-camel face the qiblah and uttered the takbir (Allah is most great), then prayed in whatever direction his mount made his face",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب سفر کرتے اور نفل پڑھنے کا ارادہ کرتے تو اپنی اونٹنی قبلہ رخ کر لیتے اور تکبیر کہتے پھر نماز پڑھتے رہتے خواہ آپ کی سواری کا رخ کسی بھی طرف ہو جائے۔",
          "fr": "Rapporté par Anas ibn Malik : Lorsque le Messager d’Allah ﷺ était en voyage et voulait accomplir une prière surérogatoire, il faisait tourner sa chamelle vers la qibla et prononçait le takbir (Allah est le plus Grand), puis il priait dans la direction où sa monture l’emmenait",
          "id": "telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Rib'i bin Abdullah bin Al Jarud] telah menceritakan kepadaku ['Amru bin Abu Al Hajjaj] telah menceritakan kepadaku [Jarud bin Abu Sabrah] telah menceritakan kepadaku [Anas bin Malik] bahwa apabila Rasulullah shallallahu 'alaihi wasallam hendak mengerjakan shalat sunnah, beliau menghadapkan untanya ke arah Kiblat, lalu beliau shalat ke arah mana saja kendaraan (untanya) menghadap",
          "tr": "Enes b. Mâlik (r.a.)'den rivayet edildiğine göre; Resulullah (s.a.v.) yola çıktığı zaman nafile namaz kılmak istediğinde devesini kıbleye yöneltip tekbir alırdı. Sonra bineğinin kendisini yönelttiği cihete doğru namazı(nı) kılardı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 28
      },
      "narrator": {
        "en": "Anas ibn Malik"
      }
    },
    {
      "hadithNumber": 1226,
      "arabicNumber": 1226,
      "book": 4,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ ‏.‏",
        "translations": {
          "en": "Narrated 'Abd Allah b. 'Umar:I saw the Messenger of Allah (ﷺ) praying on a donkey while he was facing Khaibar",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو گدھے پر نماز پڑھتے دیکھا آپ کا رخ خیبر کی جانب تھا۱؎۔",
          "fr": "Rapporté par 'Abd Allah ibn 'Umar : J’ai vu le Messager d’Allah ﷺ prier sur un âne alors qu’il faisait face à Khaybar",
          "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari ['Amru bin Yahya Al Mazini] dari [Abu Al Habbab Sa'id bin Yasar] dari [Abdullah bin Umar] bahwa dia berkata; aku pernah melihat Rasulullah shallallahu 'alaihi wasallam shalat di atas keledai, sedangkan beliau menghadap ke arah Khaibar",
          "tr": "Abdullah b. Ömer (r.a.)'den; demiştir ki: Ben Resûlullah (s.a.v.)'i eşek üzerinde Hayber'e doğru namaz kılarken gördüm"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (700)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 29
      },
      "narrator": {
        "en": "'Abd Allah b. 'Umar"
      }
    },
    {
      "hadithNumber": 1227,
      "arabicNumber": 1227,
      "book": 4,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، - قَالَ - بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَاجَةٍ قَالَ فَجِئْتُ وَهُوَ يُصَلِّي عَلَى رَاحِلَتِهِ نَحْوَ الْمَشْرِقِ وَالسُّجُودُ أَخْفَضُ مِنَ الرُّكُوعِ ‏.‏",
        "translations": {
          "en": "Narrated Jabir ibn Abdullah: The Messenger of Allah (ﷺ) sent me on some business, and when I came to him he was praying on (the back of) his riding beast (moving) towards the east and making the prostration lower than the bowing",
          "ur": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے کسی ضرورت سے بھیجا، میں ( واپس ) آیا تو دیکھا کہ آپ اپنی سواری پر مشرق کی جانب رخ کر کے نماز پڑھ رہے ہیں ( آپ کا ) سجدہ رکوع کی بہ نسبت زیادہ جھک کر ہوتا تھا",
          "fr": "Rapporté par Jabir ibn Abdullah : Le Messager d’Allah ﷺ m’a envoyé pour une mission, et quand je suis revenu vers lui, il priait sur sa monture en direction de l’est, et il faisait la prosternation plus basse que l’inclinaison",
          "id": "Telah menceritakan kepada kami [Ibnu Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Az Zubair] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutusku untuk suatu keperluan, katanya; \"lalu aku datang menemui beliau, sementara beliau sedang shalat di atas kendaraannya menghadap ke timur, dan sujud beliau lebih rendah daripada ruku' beliau",
          "tr": "Câbir (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) beni bir iş için göndermişti. Döndüğüm zaman o devesinin üzerinde doğu'ya doğru namaz kılıyordu, secdesi rükûundan daha eğik idi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (540)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 30
      },
      "narrator": {
        "en": "Jabir ibn Abdullah"
      }
    },
    {
      "hadithNumber": 1228,
      "arabicNumber": 1228,
      "book": 4,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، عَنِ النُّعْمَانِ بْنِ الْمُنْذِرِ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، أَنَّهُ سَأَلَ عَائِشَةَ - رضى الله عنها - هَلْ رُخِّصَ لِلنِّسَاءِ أَنْ يُصَلِّينَ عَلَى الدَّوَابِّ قَالَتْ لَمْ يُرَخَّصْ لَهُنَّ فِي ذَلِكَ فِي شِدَّةٍ وَلاَ رَخَاءٍ ‏.‏ قَالَ مُحَمَّدٌ هَذَا فِي الْمَكْتُوبَةِ ‏.‏",
        "translations": {
          "en": "Narrated Aisha, Ummul Mu'minin: Ata' ibn AbuRabah asked Aisha: Can women offer prayer on a riding beast? She replied: They were not permitted to do so in hardship or comfort. Muhammad ibn Shu'ayb said: This (prohibition) applies to the obligatory prayers",
          "ur": "عطا بن ابی رباح کہتے ہیں کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: کیا عورتوں کو چوپایوں پر نماز ادا کرنے کی اجازت دی گئی ہے؟ آپ نے کہا: مشکل میں ہوں یا سہولت میں، انہیں کسی حالت میں اس کی اجازت نہیں دی گئی ہے۔ محمد بن شعیب کہتے ہیں: یہ بات فرض نماز کے سلسلے میں ہے۔",
          "fr": "Rapporté par Aisha, la mère des croyants رضي الله عنها : Ata’ ibn Abu Rabah a demandé à Aisha : « Les femmes peuvent-elles prier sur une monture ? » Elle a répondu : « Elles n’y étaient pas autorisées, que ce soit en cas de difficulté ou de facilité. » Muhammad ibn Shu’ayb a précisé : « Cette interdiction concerne les prières obligatoires. »",
          "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Muhammad bin Syu'aib] dari [An Nu'man bin Al Mundzir] dari ['Atha` bin Abu Rabah] bahwa dia bertanya kepada [Aisyah] radliallahu 'anha; \"Apakah kaum wanita di beri keringanan untuk mengerjakan shalat di atas kendaraan (binatang tunggangan)?\" dia menjawab; \"Tidak ada keringanan bagi mereka mengenai hal itu, baik dalam keadaan susah atau lapang.\" Muhammad mengatakan; \"Larangan ini merupakan larangan dalam shalat wajib",
          "tr": "Atâ b. Ebî Rebâh'tan rivayet olunduğuna göre kendisi, Âişe (r.anhâ)'ye; \"kadınlara hayvan üzerinde namaz kılmalarına izin verildi mi?\" diye sormuş. O da; \"Onlara darlık halinde de genişlik halinde de bu konuda izin verilmedi\" diye cevap vermiş"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 31
      },
      "narrator": {
        "en": "Aisha, Ummul Mu'minin"
      }
    },
    {
      "hadithNumber": 1229,
      "arabicNumber": 1229,
      "book": 4,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا ابْنُ عُلَيَّةَ، - وَهَذَا لَفْظُهُ - أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ، عَنْ أَبِي نَضْرَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُ مَعَهُ الْفَتْحَ فَأَقَامَ بِمَكَّةَ ثَمَانِيَ عَشْرَةَ لَيْلَةً لاَ يُصَلِّي إِلاَّ رَكْعَتَيْنِ وَيَقُولُ ‏ \"‏ يَا أَهْلَ الْبَلَدِ صَلُّوا أَرْبَعًا فَإِنَّا قَوْمٌ سَفْرٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Imran ibn Husayn: I went on an expedition with the Messenger of Allah (ﷺ), and I was present with him at the conquest. He stayed eighteen days in Mecca and prayed only two rak'ahs (at each time of prayer). And he said: You who live in the town must pray four; we are travellers",
          "ur": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ کیا اور فتح مکہ میں آپ کے ساتھ موجود رہا، آپ نے مکہ میں اٹھارہ شب قیام فرمایا، آپ صلی اللہ علیہ وسلم صرف دو رکعتیں ہی پڑھتے رہے اور فرماتے: اے مکہ والو! تم چار پڑھو، کیونکہ ہم تو مسافر ہیں ۱؎۔",
          "fr": "Rapporté par Imran ibn Husayn : J’ai participé à une expédition avec le Messager d’Allah ﷺ, et j’étais présent lors de la conquête. Il est resté dix-huit jours à La Mecque et n’a prié que deux unités de prière à chaque horaire. Il a dit : « Vous qui habitez la ville, vous devez prier quatre unités ; nous, nous sommes des voyageurs. »",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Ibnu 'Ulayyah] -lafadz hadits ini dari dia- telah mengabarkan kepada kami [Ali bin Zaid] dari [Abu Nadlrah] dari ['Imran bin Hushain] dia berkata; \"Aku berperang bersama Rasulullah shallallahu 'alaihi wasallam, dan aku juga menyaksikan bersama beliau ketika pembebasan kota Makkah, beliau bermukim di Makkah selama delapan belas hari, dan tidaklah beliau mengerjakan shalat, kecuali hanya dua raka'at, lalu beliau bersabda: 'wahai para penduduk (asli), shalatlah kalian empat raka'at, sebab kami ini adalah para musafir",
          "tr": "İmrân b. Husayn'dan; demiştir ki: Ben Resûlullah (s.a.v.) ile (pek çok) gazvelerde bulundum. (Mekke'nin) fethinde onunla beraberdim. Mekke'de on sekiz gece kaldı. Namaz(Iar)ı ikişer rekat kılardı ve (arkasmdakilere): \"Ey Mekkeliler namaz(lar)ı dörder (rekat olarak) kılınız. Biz (Medineliler) yolcuyuz\" buyururdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 32
      },
      "narrator": {
        "en": "Imran ibn Husayn"
      }
    },
    {
      "hadithNumber": 1230,
      "arabicNumber": 1230,
      "book": 4,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - الْمَعْنَى وَاحِدٌ - قَالاَ حَدَّثَنَا حَفْصٌ، عَنْ عَاصِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقَامَ سَبْعَ عَشْرَةَ بِمَكَّةَ يَقْصُرُ الصَّلاَةَ ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَمَنْ أَقَامَ سَبْعَ عَشْرَةَ قَصَرَ وَمَنْ أَقَامَ أَكْثَرَ أَتَمَّ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ أَقَامَ تِسْعَ عَشْرَةَ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) had a stop of seventeen days in Mecca and he shortened the prayer (i.e. prayed two rak'ahs at each time of prayer). Ibn Abbas said: He who stays seventeen days should shorten the prayer; and who stays more than that should offer complete prayer. Abu Dawud said: The other version transmitted by Ibn 'Abbas through a different chain adds: He (the Prophet) had a stop of nineteen days (in Mecca)",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سترہ دن مکہ میں مقیم رہے، اور نماز قصر کرتے رہے، تو جو شخص سترہ دن قیام کرے وہ قصر کرے، اور جو اس سے زیادہ قیام کرے وہ اتمام کرے۔ ابوداؤد کہتے ہیں: عباد بن منصور نے عکرمہ سے انہوں نے ابن عباس سے روایت کی ہے، اس میں ہے: آپ صلی اللہ علیہ وسلم انیس دن تک مقیم رہے۔",
          "fr": "Rapporté par Abdullah ibn Abbas : Le Messager d’Allah ﷺ a séjourné dix-sept jours à La Mecque et il a raccourci la prière (c’est-à-dire qu’il priait deux unités à chaque horaire). Ibn Abbas a dit : « Celui qui reste dix-sept jours doit raccourcir la prière ; celui qui reste plus longtemps doit prier normalement. » Abu Dawud a dit : Une autre version transmise par Ibn Abbas via une autre chaîne ajoute : « Le Prophète ﷺ est resté dix-neuf jours à La Mecque. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Utsman bin Abu Syaibah] dengan maksud yang sama, keduanya berkata; telah menceritakan kepada kami [Hafsh] dari ['Ashim] dari ['Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bermukim di Makkah selama tujuh belas hari, dan selalu mengqashar shalat.\" Ibnu Abbas berkata; \"Barangsiapa bermukim selama tujuh belas hari, maka ia boleh mengqashar shalat, dan barangsiapa bermukim lebih dari itu, dia harus menyempurnakan shalat.\" Abu Daud mengatakan; [Abbad bin Manshur] berkata dari [Ikrimah] dari [Ibnu Abbas] dia berkata; \"Beliau bermukim selama sembilan belas hari",
          "tr": "ibn Abbâs (r.a.)'den rivayet edildiğine göre; Resûlullah (sallellahu aleyhi ve sellem) (Veda Haccında) namaz(lar)ı kısaltarak on yedi (gün ve gece) Mekke'de kalmıştır. İbn Abbâs dedi ki: \"Kim (bir beldede) onyedi (gün ve gece) kalırsa (namazlarını) kısaltır. Kim de daha fazla kalacak olursa (namazlarını) tam kılar.\" Ebu Davud dediki: Abbad b. Mansur'un İkrime'den rivayetine göre İbn Abbas: \"(Rasulullah (s.a.v.) Mekke'de) ondokuz (gün ve gece) kaldı...\" demiştir. Diğer tahric: Beyhakî, es-Sünemı'l-kubrâ, III, 151. AÇIKLAMA Bu hadis-i şerifte sözkonusu edilen ResÛl-i Ekrem (s.a.v.)'in Mekke'deki ikametinden maksat, \"Mekke'nin Fethi\" esnasındaki ikâmetidir. Aynı hadis-ix şerif, Buhârî, Tirmizî ve İbn Mâce'de de geçmektedir. Ancak bu kaynaklarda \"onyedi gün\" yerine \"ondokuz gün\" ifadesi bulunmaktadır.[bk. Buhârî, taksîr; Tirrnizî, cum'a; îbn Mâce, ikâme] Yukarıda da beyân ettiğimiz gibi Beyhakfye göre bu farklılık Mekke'­ye giriş ve çıkış günlerinin sayılıp sayılmamasından ileri gelmektedir. Ebû Davud'un bir rivayetinde giriş ve çıkış günleri sayılmamış; Resûl-i Ekrem'in Mekke'de kalışını on dokuz gün olarak rivayet eden kaynaklarda bu sayıya giriş ve çıkış günleri de ilâve edilmiştir. Yine Buhârî'nin rivayetinde Resûlullah (s.a.v.)'in Mekke'de ondokuz gün kaldığı ifâde ediliyorsa da [bk. Buhârî, meğâzî] o rivayette de durum aynıdır. Hanefî ulemâsı­na göre, \"Resûl-i Ekrem (s.a.v.) Mekke'de onbeş gün kalmaya niyet etmediği için namazlarını kısaltarak kılmıştır.\" İmam Şafiî'ye göre ise, \"Bir yerde ikâmete niyet etmemiş bir kimse onsekiz günden ziyâde namazları kısalta­rak kılamaz. Nitekim bu hadis-i şerif de bunu te'yid etmektedir.\" \"Kim (bir beldede) onyedi (gün ve gece) kalırsa namazlarını kısaltır, kim de daha fazla kalacak olursa (namazlarını) tam kılar.\" Sözü îbn Abbâs (r.a.)'ın kendi içtihadıdır. Bir beldeye varır varmaz, onyedi gün oturmaya niyet eden kimse ile ilgilidir. Bugün - yarın derken 17 günden fazla kalan kimse ile ilgili değildir. Bu şekilde ömrü boyunca bir yerden eğleşip kalan bir kimse İbn Abbâs (r.a.)'a göre de müsafir sayılır ve namazlarım kısalta­rak kılar. Bu mevzu ile ilgili münâkaşa ve deliller bir önceki hadisin açıklamasın­da geçtiği için burada tekrara lüzum görmüyoruz"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1080)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 33
      },
      "narrator": {
        "en": "Abdullah ibn Abbas"
      }
    },
    {
      "hadithNumber": 1231,
      "arabicNumber": 1231,
      "book": 4,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَكَّةَ عَامَ الْفَتْحِ خَمْسَ عَشْرَةَ يَقْصُرُ الصَّلاَةَ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى هَذَا الْحَدِيثَ عَبْدَةُ بْنُ سُلَيْمَانَ وَأَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ وَسَلَمَةُ بْنُ الْفَضْلِ عَنِ ابْنِ إِسْحَاقَ لَمْ يَذْكُرُوا فِيهِ ابْنَ عَبَّاسٍ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) stayed fifteen days in Mecca in the year of Conquest. Shortening the prayer. Abu Dawud said: This tradition has also been transmitted by 'Abdah b. Sulaiman, Ahmad b. Khalid al-Wahbi, and Salamah b. Fadli on the authority of Ibn Ishaq ; but they did not mention the name of Ibn 'Abbas",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے فتح کے سال مکہ میں پندرہ روز قیام فرمایا، آپ صلی اللہ علیہ وسلم نماز قصر کرتے رہے۔ ابوداؤد کہتے ہیں: یہ حدیث عبدہ بن سلیمان، احمد بن خالد وہبی اور سلمہ بن فضل نے ابن اسحاق سے روایت کی ہے، اس میں ان لوگوں نے ابن عباس رضی اللہ عنہما کا ذکر نہیں کیا ہے۔",
          "fr": "Rapporté par Abdullah ibn Abbas : Le Messager d’Allah ﷺ est resté quinze jours à La Mecque l’année de la Conquête, en raccourcissant la prière. Abu Dawud a dit : Ce récit a aussi été rapporté par ‘Abdah ibn Sulaiman, Ahmad ibn Khalid al-Wahbi et Salamah ibn Fadli d’après Ibn Ishaq, mais ils n’ont pas mentionné le nom d’Ibn Abbas",
          "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dia berkata; \"Pada hari penaklukan kota Makkah, Rasulullah shallallahu 'alaihi wasallam bermukim di sana selama lima belas hari, beliau selalu mengqashar shalat.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan oleh [Abdah bin Sulaiman] dan [Ahmad bin Khalid Al Wahbi] serta [Salamah bin Al Fadl] dari [Abu Ishaq], namun mereka tidak menyebutkan Ibnu Abbas dalam hadits tersebut",
          "tr": "İbn Abbas(r.a.)'dan; demiştir ki: Resûlullah (s.a.v.) Fetih yılında Mekke'de namazlarını kısaltarak onbeş gün kaldı. Ebû Dâvûd dedi ki: Bu hadisi Abde b. Süleyman, Ahmed b. Hâlid el- Vehbî ve Seleme b. el-Fadl da îbn İshak'tan rivayet ettiler. (Fa­kat) bunda Îbn Abbâs'ı zikretmediler. Diğer tahric: Beyhakî, es-Sünenu'l-kiibrfi, III"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Munkar"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif Munkar"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 34
      },
      "narrator": {
        "en": "Abdullah ibn Abbas"
      }
    },
    {
      "hadithNumber": 1232,
      "arabicNumber": 1232,
      "book": 4,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، أَخْبَرَنِي أَبِي، حَدَّثَنَا شَرِيكٌ، عَنِ ابْنِ الأَصْبَهَانِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقَامَ بِمَكَّةَ سَبْعَ عَشْرَةَ يُصَلِّي رَكْعَتَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:The Messenger of Allah (ﷺ) stayed in Mecca seventeen days and prayed two rak'ahs (at each time of prayer)",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مکہ میں سترہ دن تک مقیم رہے اور دو دو رکعتیں پڑھتے رہے۔",
          "fr": "Rapporté par Ibn Abbas : Le Messager d’Allah ﷺ est resté dix-sept jours à La Mecque et priait deux unités à chaque horaire",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepadku [ayahku] telah menceritakan kepada kami [Syarik] dari [Ibnu Al Ashbahani] dari ['Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bermukim di Makkah selama tujuh belas hari, beliau mengerjakan shalat dua raka'at",
          "tr": "İbn Abbâs'dan rivayet edildiğine göre; Resûlullah (s.a.v.) Mekke'de namazlarını ikişer rekat kılarak on yedi gün kalmıştır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Munkar"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif Munkar"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 35
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1233,
      "arabicNumber": 1233,
      "book": 4,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، وَمُسْلِمُ بْنُ إِبْرَاهِيمَ، - الْمَعْنَى - قَالاَ حَدَّثَنَا وُهَيْبٌ، حَدَّثَنِي يَحْيَى بْنُ أَبِي إِسْحَاقَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ فَكَانَ يُصَلِّي رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِ فَقُلْنَا هَلْ أَقَمْتُمْ بِهَا شَيْئًا قَالَ أَقَمْنَا بِهَا عَشْرًا ‏.‏",
        "translations": {
          "en": "Narrated Anas b. Malik :We went out from Medina to Mecca with the Messenger of Allah (ﷺ) and he prayed two rak'ahs (at each time of prayer) till we returned to Medina. We (the people) said: Did you stay there for some time ? He replied: We stayed there ten days",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے مکہ کے لیے نکلے، آپ ( اس سفر میں ) دو رکعتیں پڑھتے رہے، یہاں تک کہ ہم مدینہ واپس آ گئے تو ہم لوگوں نے پوچھا: کیا آپ لوگ مکہ میں کچھ ٹھہرے؟ انہوں نے جواب دیا: مکہ میں ہمارا قیام دس دن رہا ۱؎ ۔",
          "fr": "Rapporté par Anas ibn Malik : Nous sommes partis de Médine vers La Mecque avec le Messager d’Allah ﷺ, et il a prié deux unités à chaque horaire jusqu’à notre retour à Médine. Les gens ont demandé : « Êtes-vous restés là-bas quelque temps ? » Il a répondu : « Nous y sommes restés dix jours. »",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Muslim bin Ibrahim] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Wuhaib] telah menceritakan kepadaku [Yahya bin Abu Ishaq] dari [Anas bin Malik] dia berkata; \"Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam dari madinah menuju Makkah, beliau selalu mengerjakan shalat dua raka'at sehingga kami kembali tiba di Madinah.\" Kami berkata; 'Apakah kalian bermukim di sana?\" dia berkata; \"Kami bermukim di sana selama sepuluh hari",
          "tr": "Enes b. Mâlik (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) ile birlikte Medine'den Mekke'ye (doğru yola) çıktık. Medine'ye döndüğümüz zamana kadar bize (akşam, namazından başka namazları hep) ikişer rekat kıldırdı. (Ravî Yahya Ibn Ebi İshâk dedi ki:) Biz (Enes b. Mâlik'e) Mekke'de biraz kaldınız mı? diye sorduk da. Orada on (gün) kaldık, cevabını verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (1081) Sahih Muslim (693)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 36
      },
      "narrator": {
        "en": "Anas b. Malik"
      }
    },
    {
      "hadithNumber": 1234,
      "arabicNumber": 1234,
      "book": 4,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَابْنُ الْمُثَنَّى، - وَهَذَا لَفْظُ ابْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، - قَالَ ابْنُ الْمُثَنَّى - قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ عَلِيًّا، - رضى الله عنه - كَانَ إِذَا سَافَرَ سَارَ بَعْدَ مَا تَغْرُبُ الشَّمْسُ حَتَّى تَكَادَ أَنْ تُظْلِمَ ثُمَّ يَنْزِلُ فَيُصَلِّي الْمَغْرِبَ ثُمَّ يَدْعُو بِعَشَائِهِ فَيَتَعَشَّى ثُمَّ يُصَلِّي الْعِشَاءَ ثُمَّ يَرْتَحِلُ وَيَقُولُ هَكَذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ‏.‏ قَالَ عُثْمَانُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيٍّ سَمِعْتُ أَبَا دَاوُدَ يَقُولُ وَرَوَى أُسَامَةُ بْنُ زَيْدٍ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ يَعْنِي ابْنَ أَنَسِ بْنِ مَالِكٍ أَنَّ أَنَسًا كَانَ يَجْمَعُ بَيْنَهُمَا حِينَ يَغِيبُ الشَّفَقُ وَيَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ وَرِوَايَةُ الزُّهْرِيِّ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلُهُ ‏.‏",
        "translations": {
          "en": "Narrated Ali ibn AbuTalib ; Anas ibn Malik: Muhammad reported from his father, Umar, on the authority of his grandfather, Ali ibn AbuTalib: When Ali travelled, he continued to travel till it became nearly dark. He then alighted and offered the sunset prayer. Then he would call for his dinner and eat it. Then he prayed the night prayer and then moved off. He would say: This is how the Messenger of Allah (ﷺ) used to do. Usamah ibn Zayd reported from Hafs ibn Ubaydullah, the son of Anas ibn Malik: Anas would combine them (the evening and night prayer) when the twilight disappeared. He said: The Prophet (ﷺ) used to do so. Az-Zuhri also reported similarly on the authority of Anas from the Prophet (ﷺ)",
          "ur": "عمر بن علی بن ابی طالب سے روایت ہے کہ علی رضی اللہ عنہ جب سفر کرتے تو سورج ڈوبنے کے بعد بھی چلتے رہتے یہاں تک کہ اندھیرا چھا جانے کے قریب ہو جاتا، پھر آپ اترتے اور مغرب پڑھتے۔ پھر شام کا کھانا طلب کرتے اور کھا کر عشاء ادا کرتے۔ پھر کوچ فرماتے اور کہا کرتے تھے: رسول اللہ صلی اللہ علیہ وسلم ایسا ہی کیا کرتے تھے۔ عثمان کی روایت میں «أخبرني عبدالله بن محمد بن عمر بن علي» کے بجائے «عن عبدالله بن محمد بن عمر بن علي» ہے۔ ( ابوعلی لولؤی کہتے ہیں ) میں نے ابوداؤد کو کہتے سنا کہ اسامہ بن زید نے حفص بن عبیداللہ ( بن انس بن مالک ) سے روایت کی ہے کہ انس رضی اللہ عنہ جب شفق غائب ہو جاتی تو دونوں ( مغرب اور عشاء ) کو جمع کرتے اور کہتے: نبی کریم صلی اللہ علیہ وسلم بھی ایسا ہی کیا کرتے تھے۔ زہری نے انس رضی اللہ عنہ سے انس نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے ہم مثل روایت کی ہے۔",
          "fr": "Rapporté par Ali ibn Abu Talib et Anas ibn Malik : Muhammad a rapporté de son père, Umar, de la part de son grand-père, Ali ibn Abu Talib : Quand Ali voyageait, il continuait jusqu’à ce que la nuit tombe presque, puis il s’arrêtait et faisait la prière du coucher du soleil. Ensuite, il demandait à manger et dînait, puis il priait la prière de la nuit et repartait. Il disait : « C’est ainsi que faisait le Messager d’Allah ﷺ. » Usamah ibn Zayd a rapporté de Hafs ibn Ubaydullah, fils d’Anas ibn Malik : Anas regroupait les deux prières (du coucher du soleil et de la nuit) quand la lueur du soir disparaissait. Il disait : « Le Prophète ﷺ faisait ainsi. » Az-Zuhri a aussi rapporté de façon similaire d’Anas, du Prophète ﷺ",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ibnu Al Mutsanna] dan lafadz hadits ini dari Ibnul Mutsanna, keduanya berkata; telah menceritakan kepada kami [Abu Usamah], Ibnu Al Mutsanna mengatakan; telah mengabarkan kepadaku [Abdullah bin Muhammad bin Umar bin Ali bin Abu Thalib] dari [ayahnya] dari [kakeknya] bahwa apabila [Ali radliallahu 'anhu] bepergian, dia berangkat setelah matahari terbenam, hingga apabila hampir gelap, dia singgah lalu mengerjakan shalat Maghrib kemudian melakukan makan malam, setelah itu dia mengerjakan shalat Isya'. Lalu dia melanjutkan perjalanannya, katanya; \"Seperti inilah Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan.\" [Utsman] berkata; dari [Abdullah bin Muhammad bin Umar bin Ali]. Aku mendengar Abu Daud berkata; [Usamah bin Zaid] meriwayatkan, dari [Hafsh bin Ubaidullah yaitu Ibnu Anas bin Malik] bahwa [Anas] pernah menjama' keduanya ketika mega merah telah hilang, dia berkata; \"Nabi shallallahu 'alaihi wasallam juga pernah melakukan hal itu.\" Sedangkan riwayatnya [Az Zuhri] dari [Anas] dari Nabi shallallahu 'alaihi wasallam juga seperti hadits di atas",
          "tr": "Abdullah b. Muhammed b. Ömer b. Ali b. Ebi Tâlib, babası (Muhammed b. Ömer) vasıtasıyla dedesi (Ömer b. Ali b. Ebi Tâlib)'den rivayet etmiştir ki: Ali (r.a.) bir yolculuğa çıkacağı zaman güneş battıktan sonra çıkardı. Hava kararacağı zaman (hayvanından) iner akşamı kılardı. Sonra akşam yemeğini (yemek) isterdi, yedikten sonra da yatsıyı kılardı. Sonra \"işte Resûlulîah (s.a.v.) böyle yapardı\" diyerek yola çıkardı. (Râvi) Osman (b. Ebî Şeybe bu hadisi), Abdullah b. Muhammed b. Ömer b. Ali'den diyerek rivayet etmiştir. Ebü Ali Ebû Davud'un (şöyle) dediğini haber verdi: Usame b. Zeyd; Hafs b. Ubeydillah'dan; -Enes b. Mâlik'in oğlu Ubeydullah'ı kastediyor- rivayetine göre Enes, şafak kaybolup giderken akşamla yatsıyı birlikte kılar ve; \"Peygamber (s.a.v.) işte böyle yapardı\" dermiş. Ebû Dâvûd dedi ki: Zührt'nin Enes (r.a.) vasıtasıyla Peygamber (s.a.v.)'den (yaptığı) rivayeti de böyledir. Sadece Ebû Dâvûd rivayet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 37
      },
      "narrator": {
        "en": "Ali ibn AbuTalib ; Anas ibn Malik"
      }
    },
    {
      "hadithNumber": 1235,
      "arabicNumber": 1235,
      "book": 4,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَبُوكَ عِشْرِينَ يَوْمًا يَقْصُرُ الصَّلاَةَ ‏.‏ قَالَ أَبُو دَاوُدَ غَيْرُ مَعْمَرٍ لاَ يُسْنِدُهُ ‏.‏",
        "translations": {
          "en": "Narrated Jabir ibn Abdullah: The Messenger of Allah (ﷺ) stayed at Tabuk twenty days; he shortened the prayer (during his stay). Abu Dawud said: No one narrates this tradition with continuous chain except Ma'mar",
          "ur": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے تبوک میں بیس دن قیام فرمایا اور نماز قصر کرتے رہے۔ ابوداؤد کہتے ہیں: معمر کے علاوہ سبھی اسے مرسل روایت کرتے ہیں، کوئی اسے مسند روایت نہیں کرتا ہے۔",
          "fr": "Rapporté par Jabir ibn Abdullah : Le Messager d’Allah ﷺ est resté vingt jours à Tabuk, et il a raccourci la prière pendant son séjour. Abu Dawud a dit : Personne ne rapporte ce récit avec une chaîne continue sauf Ma’mar",
          "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Muhammad bin Abdurrahman bin Tsauban] dari [Jabir bin Abdullah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah bermukim di Tabuk selama dua puluh hari, dan selalu mengqashar shalat.\" Abu Daud mengatakan; \"selain Ma'mar, memursalkan hadits ini, dan sanadnya tidak bersambung",
          "tr": "Câbir b. Abdullah'dan; demiştir ki: Resûlullah (s.a.v.) Tebûk'de namaz(lar)ı kısaltarak yirmi (gün) kaldı. Ebû Dâvûd dedi ki: (Bu hadisi) Ma'mer'den başka müsned ola­rak rivayet eden yoktur. Diğer tahric: Buhârî, taksir; Ahmed b. Hanbel, III, 295; Beyhakî, es-Sünenü'l-kübrâ, III"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 38
      },
      "narrator": {
        "en": "Jabir ibn Abdullah"
      }
    },
    {
      "hadithNumber": 1236,
      "arabicNumber": 1236,
      "book": 4,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِعُسْفَانَ وَعَلَى الْمُشْرِكِينَ خَالِدُ بْنُ الْوَلِيدِ فَصَلَّيْنَا الظُّهْرَ فَقَالَ الْمُشْرِكُونَ لَقَدْ أَصَبْنَا غِرَّةً لَقَدْ أَصَبْنَا غَفْلَةً لَوْ كُنَّا حَمَلْنَا عَلَيْهِمْ وَهُمْ فِي الصَّلاَةِ فَنَزَلَتْ آيَةُ الْقَصْرِ بَيْنَ الظُّهْرِ وَالْعَصْرِ فَلَمَّا حَضَرَتِ الْعَصْرُ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُسْتَقْبِلَ الْقِبْلَةِ وَالْمُشْرِكُونَ أَمَامَهُ فَصَفَّ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَفٌّ وَصَفَّ بَعْدَ ذَلِكَ الصَّفِّ صَفٌّ آخَرُ فَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَكَعُوا جَمِيعًا ثُمَّ سَجَدَ وَسَجَدَ الصَّفُّ الَّذِينَ يَلُونَهُ وَقَامَ الآخَرُونَ يَحْرُسُونَهُمْ فَلَمَّا صَلَّى هَؤُلاَءِ السَّجْدَتَيْنِ وَقَامُوا سَجَدَ الآخَرُونَ الَّذِينَ كَانُوا خَلْفَهُمْ ثُمَّ تَأَخَّرَ الصَّفُّ الَّذِي يَلِيهِ إِلَى مَقَامِ الآخَرِينَ وَتَقَدَّمَ الصَّفُّ الأَخِيرُ إِلَى مَقَامِ الصَّفِّ الأَوَّلِ ثُمَّ رَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَكَعُوا جَمِيعًا ثُمَّ سَجَدَ وَسَجَدَ الصَّفُّ الَّذِي يَلِيهِ وَقَامَ الآخَرُونَ يَحْرُسُونَهُمْ فَلَمَّا جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالصَّفُّ الَّذِي يَلِيهِ سَجَدَ الآخَرُونَ ثُمَّ جَلَسُوا جَمِيعًا فَسَلَّمَ عَلَيْهِمْ جَمِيعًا فَصَلاَّهَا بِعُسْفَانَ وَصَلاَّهَا يَوْمَ بَنِي سُلَيْمٍ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى أَيُّوبُ وَهِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ هَذَا الْمَعْنَى عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَذَلِكَ رَوَاهُ دَاوُدُ بْنُ حُصَيْنٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ وَكَذَلِكَ عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ وَكَذَلِكَ قَتَادَةُ عَنِ الْحَسَنِ عَنْ حِطَّانَ عَنْ أَبِي مُوسَى فِعْلَهُ وَكَذَلِكَ عِكْرِمَةُ بْنُ خَالِدٍ عَنْ مُجَاهِدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَذَلِكَ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ قَوْلُ الثَّوْرِيِّ ‏.‏",
        "translations": {
          "en": "Narrated AbuAyyash az-Zuraqi: We accompanied the Messenger of Allah (ﷺ) at Usfan, and Khalid ibn al-Walid was the chief of unbelievers. We offered the noon prayer. Thereupon, the unbelievers said: We suffered from negligence; we became careless. We should have attacked them while they were praying. Thereupon the verse was revealed, relating to the shortening of the prayer (in time of danger) between the noon and afternoon (prayer). When the time of the afternoon prayer came, the Messenger of Allah (ﷺ) stood facing the qiblah, and the unbelievers were standing in front of him. The people stood in a row behind the Messenger of Allah (ﷺ) and there was another row behind this row. The Messenger of Allah (ﷺ) bowed and all of them bowed. He then prostrated and also the row near him prostrated. The other people in the second row remained standing and stood guard over them. When they performed two prostrations and stood up, those who were behind them prostrated. The people in the front row near him then stepped backward taking the place of the people in the second row and the second row took the place of the first row. The Messenger of Allah (ﷺ) then bowed and all of them bowed together. Then he and the row near him prostrated themselves. The other people in the second row remained standing and stood guard over them. When the Messenger of Allah (ﷺ) and the row near him (i.e. the front row) were seated, the people in the second row behind them prostrated themselves. Then all of them were seated. (He (the Prophet) then uttered the salutation upon all of them. He prayed in his manner at Usfan as well as at the territory of Banu Sulaym. Abu Dawud said: This tradition has been narrated by Ayyub and Hisham from Abu al-Zubair on the authority of Jabir to the same effect from the Prophet (ﷺ). Similarly, this has been transmitted by Dawud b. Husain from 'Ikrimah, on the authority of Ibn 'Abbas. This has also been reported by 'Abd al-Malik, from 'Ata' from Jabir in like manner. This has also been narrated by Qatadah from al-Hasan from Hittan on the authority of Abu Musa in a similar way. Similarly, this has been reported by 'Ikrimah b. Khalid from Mujahid from the Prophet (ﷺ). This has also been reported by Hisham b. 'Urwah from his father from the Prophet (ﷺ). This is the opinion of al-Thawri",
          "ur": "ابوعیاش زرقی رضی اللہ عنہ کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مقام عسفان میں تھے، اس وقت مشرکوں کے سردار خالد بن ولید تھے، ہم نے ظہر پڑھی تو مشرکین کہنے لگے: ہم سے چوک ہو گئی، ہم غفلت کا شکار ہو گئے، کاش! ہم نے دوران نماز ان پر حملہ کر دیا ہوتا، چنانچہ ظہر اور عصر کے درمیان قصر کی آیت نازل ہوئی ۱؎ پھر جب عصر کا وقت ہوا تو رسول اللہ صلی اللہ علیہ وسلم قبلہ رخ ہو کر کھڑے ہوئے، مشرکین آپ کے سامنے تھے، لوگوں نے آپ کے پیچھے ایک صف بنائی اور اس صف کے پیچھے ایک دوسری صف بنائی تو آپ صلی اللہ علیہ وسلم نے ان سب کے ساتھ بیک وقت رکوع کیا، لیکن سجدہ آپ نے اور صرف اس صف کے لوگوں نے کیا جو آپ سے قریب تر تھے اور باقی ( پچھلی صف کے ) لوگ کھڑے نگرانی کرتے رہے، پھر جب یہ لوگ سجدہ کر کے کھڑے ہو گئے تو باقی دوسرے لوگوں نے جو ان کے پیچھے تھے، سجدے کئے، پھر قریب والی صف پیچھے ہٹ کر دوسری صف کی جگہ پر چلی گئی، اور دوسری صف آگے بڑھ کر پہلی صف کی جگہ پر آ گئی، پھر سب نے مل کر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رکوع کیا، اس کے بعد سجدہ صرف آپ اور آپ سے قریب والی صف نے کیا اور بقیہ لوگ کھڑے نگرانی کرتے رہے، جب رسول اللہ صلی اللہ علیہ وسلم اور قریب والی صف کے لوگ بیٹھ گئے تو بقیہ دوسروں نے سجدہ کیا، پھر سب ایک ساتھ بیٹھے اور ایک ساتھ سلام پھیرا، آپ نے عسفان میں اسی طرح نماز پڑھی اور بنی سلیم سے جنگ کے روز بھی اسی طرح نماز پڑھی۔ ابوداؤد کہتے ہیں: ایوب اور ہشام نے ابو الزبیر سے ابوالزبیر نے جابر سے اسی مفہوم کی حدیث نبی اکرم صلی اللہ علیہ وسلم سے مرفوعاً روایت کی ہے۔ اسی طرح یہ حدیث داود بن حصین نے عکرمہ سے، عکرمہ نے ابن عباس رضی اللہ عنہما سے روایت کی ہے۔ اسی طرح یہ حدیث عبدالملک نے عطا سے، عطاء نے جابر سے روایت کی ہے۔ اسی طرح قتادہ نے حسن سے، حسن نے حطان سے، حطان نے ابوموسیٰ رضی اللہ عنہ سے یہی عمل نقل کیا ہے۔ اسی طرح عکرمہ بن خالد نے مجاہد سے مجاہد نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔ اسی طرح ہشام بن عروہ نے اپنے والد عروہ سے، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے اور یہی ثوری کا قول ہے۔",
          "fr": "Rapporté par Abu Ayyash az-Zuraqi : Nous avons accompagné le Messager d’Allah ﷺ à Usfan, et Khalid ibn al-Walid était le chef des mécréants. Nous avons accompli la prière du midi. Les mécréants ont alors dit : « Nous avons manqué une occasion ; nous aurions dû les attaquer pendant qu’ils priaient. » C’est alors que le verset concernant la réduction de la prière en cas de danger a été révélé, entre la prière du midi et celle de l’après-midi. Quand le moment de la prière de l’après-midi est arrivé, le Messager d’Allah ﷺ s’est mis face à la qibla, et les mécréants étaient devant lui. Les gens se sont rangés en un rang derrière le Messager d’Allah ﷺ, et un autre rang derrière eux. Le Messager d’Allah ﷺ s’est incliné et tous se sont inclinés. Puis il s’est prosterné, et le rang le plus proche de lui aussi, tandis que le deuxième rang restait debout pour les protéger. Quand ils ont fait deux prosternations et se sont relevés, ceux du second rang se sont prosternés. Le premier rang a alors reculé pour prendre la place du second, et le second rang a avancé. Le Messager d’Allah ﷺ s’est de nouveau incliné, et tous se sont inclinés ensemble. Puis lui et le rang proche de lui se sont prosternés, tandis que le deuxième rang restait debout pour les surveiller. Quand le Messager d’Allah ﷺ et le rang proche de lui se sont assis, ceux du second rang derrière eux se sont prosternés. Ensuite, tous se sont assis. Le Prophète ﷺ a alors salué tout le monde. Il a prié de cette façon à Usfan ainsi qu’au territoire de Banu Sulaym. Abu Dawud a dit : Ce récit a été rapporté par Ayyub et Hisham d’après Abu al-Zubair, de la part de Jabir, avec le même sens, du Prophète ﷺ. De même, cela a été transmis par Dawud ibn Husain d’après ‘Ikrimah, de la part d’Ibn Abbas. Cela a aussi été rapporté par ‘Abd al-Malik, d’après ‘Ata’, de Jabir de façon similaire. Qatadah l’a aussi rapporté d’al-Hasan, de Hittan, de la part d’Abu Musa, de façon semblable. ‘Ikrimah ibn Khalid l’a aussi rapporté de Mujahid, du Prophète ﷺ. Hisham ibn ‘Urwah l’a rapporté de son père, du Prophète ﷺ. C’est aussi l’avis d’al-Thawri",
          "id": "telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Manshur] dari [Mujahid] dari [Abu 'Ayasy Az Zuraqi] dia berkata; kami bersama Rasulullah shallallahu 'alaihi wasallam di Usfan, sedangkan waktu itu, kaum Musyrikin berada di bawah komando Khalid bin Walid. lalu kami mengerjakan shalat Dluhur, maka orang-orang Musyrik berkata; \"Sungguh kita telah lengah, kita telah lalai. (Alangkah baiknya) sekiranya kita serang mereka ketika mereka tengah mengerjakan shalat.\" lalu turunlah ayat untuk mengqashar shalat antara Dluhur dengan Ashar, ketika waktu Ashar telah tiba, Rasulullah shallallahu 'alaihi wasallam berdiri menghadap ke kiblat, sedangkan orang-orang musyrik berada di hadapannya, sementara satu shaf berbaris di belakang beliau, kemudian ada juga di belakangnya satu shaf lagi, lalu Rasulullah shallallahu 'alaihi wasallam ruku', mereka juga ikut ruku', lalu beliau sujud, dan shaf di belakang beliau juga sujud, sementara shaf berikutnya masih tetap berdiri untuk berjaga-jaga. Setelah shaf pertama selesai sujud dua kali dan berdiri, barulah shaf yang berikutnya (shaf kedua) sujud. Setelah itu, shaf yang ada di belakang beliau (shaf pertama) mundur menempati shaf yang lain (shaf kedua), sedangkan shaf yang kedua maju ke depan menempati shaf pertama, kemudian Rasulullah shallallahu 'alaihi wasallam ruku', mereka semuanya juga ikut ruku', lalu sujud dan shaf yang berada di belakang beliau ikut sujud, sedangkan shaf yang belakangnya (shaf kedua) tetap berdiri berjaga-jaga. Ketika Rasulullah shallallahu 'alaihi wasallam duduk, maka shaf kedua sujud, kemudian mereka semuanya duduk, lalu beliau memberi salam dan mereka pun salam. Cara shalat seperti ini di kerjakan di daerah Usfan, dan juga pernah di kerjakan di Bani Sulaim. ' Abu Daud berkata; [Ayyub] dan [Hisyam] meriwayatkan dari [Abu Az Zubair] dari [Jabir] dengan makna seperti ini dari Nabi shallallahu 'alaihi wasallam, begitu juga [Daud bin Hushain] meriwayatkan dari ['Ikrimah] dari [Ibnu Abbas], begitu juga [Abdul Malik] dari ['Atha`] dari [Jabir]. Begitu juga dengan [Qatadah] dari [Al Hasan] dari [Hithan] dari [Abu Musa] juga pernah mengerjakan seperti itu, begitu juga [Ikrimah bin Khalid] dari [Mujahid] dari Nabi shallallahu 'alaihi wasallam, begitu juga [Hisyam bin 'Urwah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, dan itu merupakan perkataan Ats Tsauri",
          "tr": "Ebû Ayyaş ez-Zürâkî'den; demiştir ki: Biz Resûlullah (s.a.v.) ile birlikte Usfân'da bulunuyorduk. Müşriklerin başında da Hâlid b. el-Velîd bulunuyordu. Öğleyi kıldık. Müşrikler \"gerçekten çok gafil davrandık, çok hatalı davrandık onlar namazda iken üzerlerine bir yüklenseydik (ne güzel olurdu)!\" demeye başladılar. Bunun üzerine öğle ile ikindi namazı arasında \"Kasr âyeti\" nazil oldu. ikindi (vakti) gelince Resûlullah (s.a.v.) kalkıp kıbleye karşı durdu. Müşrikler de karşısında idiler. Arkasında bir saf teşekkül etti. Bu saffın arkasında da başka bir saf (vardı). Resûlullah (s.a.v.)'in rükû'a varmasıyla hepsi birden rükû'a vardılar. Sonra arka saftakiler cemaati ayakta beklerken imam arkasındaki (birinci) safla beraber secdeye vardı. Bunlar secdeleri yapıp kalkınca arkalarında bulunan diğerleri secdeye vardılar, sonra (Resûl-i Ekrem'in) arkasındaki saf geri çekilerek arkadakilerin yerini, arka saftakiler de ilerleyerek ön saftakilerin yerini aldı. Sonra Resûlullah (s.a.v.) rükû'a varınca (her iki saftakiler) birlikte rükû'a vardılar. (Resûl-i Ekrem) secdeye varınca, hemen arkasında bulunan (birinci saf) da secdeye vardı. Diğerleri ise bunları (ayakta) bekliyorlardı. Rssûİ-i Ekrem (s.a.v.) oturunca hemen arkasındaki saf da oturdu, sonra da hep beraber oturdular ve (Resûl-i Ekrem -s.a.v.-) hepsine birden selâm verdi. (Resûl-i Ekrem) Usfan'da kıldığı bu namazı bir de Beni Süleym'de kıldı. Ebû Dâvûd dedi ki: (Hadisin metninden anlaşılan) bu mânâyı, Eyyûb ile Hişâm da Ebu'z-Zübeyr, ve Câbir vasıtasıyle Peygamber (s.a.v.)'den rivayet etmişlerdir. Yine (mana olarak) bû hadisi Dâvûd b. Husayn, îkrime vasıtasıyla İbn Abbâs'dan rivayet etti. Aynı şekilde (bu hadisi) Abdülmelik, Atâ vasıtasıyle Câbir'den rivayet etti. Katâde de el-Hasen ve Hıttân vasıtasıyle Ebû Mûsâ\"dan (Ebû Mûsâ'nın fiili olarak rivayet etti. Yine aynı şekilde (mânâ ola­rak) îkrime b. Hâlid, Mücâhid vasıtasıyla Peygamber (s.a.v.)'den riva­yet ettiği gibi Hişâm b. Urve de babası vasıtasıyla Peygamber (s. a.) 'den rivayet etmiştir ve bu (tatbikat) es-Sevr’nin görüşüdür. Diğer tahric: Nesaî, havf; Ahmed b. Hanbel, IV"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 39
      },
      "narrator": {
        "en": "AbuAyyash az-Zuraqi"
      }
    },
    {
      "hadithNumber": 1237,
      "arabicNumber": 1237,
      "book": 4,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِأَصْحَابِهِ فِي خَوْفٍ فَجَعَلَهُمْ خَلْفَهُ صَفَّيْنِ فَصَلَّى بِالَّذِينَ يَلُونَهُ رَكْعَةً ثُمَّ قَامَ فَلَمْ يَزَلْ قَائِمًا حَتَّى صَلَّى الَّذِينَ خَلْفَهُمْ رَكْعَةً ثُمَّ تَقَدَّمُوا وَتَأَخَّرَ الَّذِينَ كَانُوا قُدَّامَهُمْ فَصَلَّى بِهِمُ النَّبِيُّ صلى الله عليه وسلم رَكْعَةً ثُمَّ قَعَدَ حَتَّى صَلَّى الَّذِينَ تَخَلَّفُوا رَكْعَةً ثُمَّ سَلَّمَ ‏.‏",
        "translations": {
          "en": "Narrated Sahl b. Abi Hathmah:The Prophet (ﷺ) prayed in time of danger and divided them (the people) behind him in two rows. He then led those who were near him in one rak'ah. Then he stood and remained standing till those who were in second row offered one rak'ah. Thereafter they came forward and those who were in front of them (in the first row) stepped backward. The Prophet (ﷺ) led them in one rak'ah of prayer. He sat down till those who were in the second row completed on rak'ah. He then uttered the salutation",
          "ur": "سہل بن ابی حثمہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے صحابہ کرام کے ساتھ حالت خوف میں نماز ادا کی تو اپنے پیچھے دو صفیں بنائیں پھر جو آپ سے قریب تھے ان کو ایک رکعت پڑھائی، پھر کھڑے ہو گئے اور برابر کھڑے رہے یہاں تک کہ ان لوگوں نے جو پہلی صف کے پیچھے تھے، ایک رکعت ادا کی، پھر وہ لوگ آگے بڑھ گئے اور جو لوگ دشمن کے سامنے تھے، آپ کے پیچھے آ گئے، تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں ایک رکعت پڑھائی پھر آپ بیٹھے رہے یہاں تک کہ جو لوگ پیچھے رہ گئے تھے انہوں نے ایک رکعت اور پڑھی پھر آپ نے سلام پھیرا۔",
          "fr": "Rapporté par Sahl ibn Abi Hathmah : Le Prophète ﷺ a prié en temps de danger et a divisé les gens derrière lui en deux rangs. Il a dirigé ceux qui étaient près de lui pour une unité de prière. Ensuite, il est resté debout jusqu’à ce que ceux du deuxième rang fassent une unité. Après cela, ils sont venus devant et ceux du premier rang sont passés derrière. Le Prophète ﷺ les a alors dirigés pour une unité de prière. Il s’est assis jusqu’à ce que ceux du second rang terminent une unité. Puis il a fait la salutation",
          "id": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Shalih bin Khawwat] dari [Sahl bin Abu Hatsmah] bahwa Nabi shallallahu 'alaihi wasallam pernah mengerjakan shalat khauf bersama para sahabatnya, beliau menjadikan mereka dua shaf di belakangnya, lalu beliau mengerjakan shalat dengan shaf yang ada di belakang beliau satu raka'at, kemudian berdiri. Beliau tetap dalam posisi berdiri sehingga orang-orang yang berada di shaf kedua shalat satu raka'at, setelah itu mereka maju ke depan, sedangkan shaf pertama mundur ke belakang, lalu Nabi shallallahu 'alaihi wasallam shalat bersama mereka satu raka'at, kemudian beliau duduk (sambil menanti) sehingga orang-orang yang tertinggal (di shaf ke dua) menyelesaikan satu raka'at yang tertinggal, kemudian beliau salam",
          "tr": "Sehl b. Ebî Hasme'den rivayet edildiğine göre; Peygamber (s.a.v.) korkulu bir zamanda ashabına namaz kıldırmış. Onları arkasında iki saf halinde durdurup (önce) hemen arkasında bulunanlara, bir rekat kıldırmış, sonra (ön) saftakilerin ardındakiler de bir rekat daha (namaz) kılıncaya kadar ayakta durmuş, sonra (imamın arkasındakiler) öne, onların önündekiler de arkaya geçmişler. Bunun üzerine Peygamber (s.a.v.) bunlara da bir rekat namaz kıldırıp arkasında bulunanlar bir rekat (daha namaz) kılıncaya kadar oturduktan sonra selâm vermiş. Diğer tahric: Müslim, müsâfirîn; Ahmed b. Hanbel, III"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (4131) Sahih Muslim (841)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 40
      },
      "narrator": {
        "en": "Sahl b. Abi Hathmah"
      }
    },
    {
      "hadithNumber": 1238,
      "arabicNumber": 1238,
      "book": 4,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، عَمَّنْ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ ذَاتِ الرِّقَاعِ صَلاَةَ الْخَوْفِ أَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةً وِجَاهَ الْعَدُوِّ فَصَلَّى بِالَّتِي مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا وَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتِ الطَّائِفَةُ الأُخْرَى فَصَلَّى بِهِمُ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلاَتِهِ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْ ‏.‏ قَالَ مَالِكٌ وَحَدِيثُ يَزِيدَ بْنِ رُومَانَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ ‏.‏",
        "translations": {
          "en": "Narrated Salih b. Khawwat: On the authority of a person who offered the prayer in time of danger along with the Messenger of Allah (ﷺ) at the battle of Dhat al-Riqa. One section of people stood in the row of prayer along with the Messenger of Allah (ﷺ) and the other section remained standing in front of the enemy. He led those who were with him in one rak'ah and remained standing (in his place) and they completed (the second rak'ah) by themselves. Then they turned away and arrayed before the enemy. Thereafter the other section came and he led them in the rak'ah which remained from his prayer. He then remained sitting (in his place) and they completed their one rak'ah by themselves. He then uttered the salutation along with them. Malik said: I like the tradition reported by Yazid b. Ruman (i.e. the present tradition) more than (other versions) I heard",
          "ur": "صالح بن خوات ایک ایسے شخص سے روایت کرتے ہیں جس نے ذات الرقاع کے غزوہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز خوف ادا کی وہ کہتے ہیں: ایک جماعت آپ کے ساتھ صف میں کھڑی ہوئی اور دوسری دشمن کے سامنے، آپ صلی اللہ علیہ وسلم نے اپنے ساتھ والی جماعت کے ساتھ ایک رکعت ادا کی پھر کھڑے رہے اور ان لوگوں نے ( اس دوران میں ) اپنی نماز پوری کر لی ( یعنی دوسری رکعت بھی پڑھ لی ) پھر وہ واپس دشمن کے سامنے صف بستہ ہو گئے اور دوسری جماعت آئی تو آپ صلی اللہ علیہ وسلم نے ان کے ساتھ اپنی رکعت ادا کی پھر بیٹھے رہے اور ان لوگوں نے اپنی دوسری رکعت پوری کی، پھر آپ صلی اللہ علیہ وسلم نے ان کے ساتھ سلام پھیرا۔ مالک کہتے ہیں: یزید بن رومان کی حدیث میری مسموعات میں مجھے سب سے زیادہ پسند ہے۔",
          "fr": "Rapporté par Salih ibn Khawwat, d’après une personne qui a prié en temps de danger avec le Messager d’Allah ﷺ lors de la bataille de Dhat al-Riqa : Un groupe de personnes s’est rangé en prière avec le Messager d’Allah ﷺ, tandis que l’autre groupe faisait face à l’ennemi. Il a dirigé ceux qui étaient avec lui pour une unité de prière, puis il est resté debout à sa place et ils ont terminé la seconde unité seuls. Ensuite, ils se sont retirés et se sont placés devant l’ennemi. L’autre groupe est alors venu, et il les a dirigés pour l’unité de prière qui lui restait. Il est resté assis et ils ont terminé leur unité seuls. Puis il a fait la salutation avec eux. Malik a dit : Je préfère la version rapportée par Yazid ibn Ruman (c’est-à-dire celle-ci) à d’autres versions que j’ai entendues",
          "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yazid bin Ruman] dari [Shalih bin Khuwwat] dari [orang] yang pernah mengerjakan shalat khauf bersama Rasulullah shallallahu 'alaihi wasallam pada waktu Perang Dzatur Riqa', yaitu; bahwa satu shaf berbaris bersama beliau, sedangkan shaf yang lain (berjaga-jaga) menghadapi musuh, kemudian orang-orang yang bersama beliau shalat satu raka'at, kemudian beliau tetap dalam kondisi berdiri, sedangkan mereka menyempurnakan satu raka'at sendiri-sendiri, setelah itu mereka beranjak pergi dan berbaris (berjaga-jaga) menghadapi musuh. Setelah itu, kelompok yang lain datang dan shalat bersama beliau satu raka'at dari sisa satu raka'at beliau, kemudian beliau tetap dalam duduk (menunggu), sedangkan mereka menyempurnakan shalat (satu raka'at) sendiri-sendiri, lalu beliau salam bersama mereka.\" Malik berkata; sedangkan haditsnya Yazid bin Ruman lebih aku sukai dari apa yang pernah aku dengar",
          "tr": "Salih b. Havvât'ın Zâtü'r-Rikaa' harbi vuku bulduğu gün Resûlüllah (sallallahü aleyhi ve sellem) ile birlikte korku namazı kılan bir zattan rivâyet ettiğine göre; taife Peygamber (sallallahü aleyhi ve sellem) ile birlikte (arkasında), bir başka taife de düşmana karşı saf tutmuştu. (Hazret-i Peygamber) Yanındakilere bir rekat namaz kıldırmış, sonra ayakta dururken (cemaat) kendi kendilerine (namazı) tamamlamışlar. Sonra namazdan çıkarak düşmanın karşısına saf bağlamışlar. (Bu sefer) öteki taife gelmiş, Resûlüllah (sallallahü aleyhi ve sellem) onlara da namazından kalan rekatı kıldırmış, sonra oturarak beklemiş, cemaat kendi kendilerine namazı tamamlamışlar, sonra Resûlüllah (sallallahü aleyhi ve sellem) onlarla selâm vermiş. meğâzî 31; Müslim, müsâfirîn 310; Nesâî, havf 20; Tirmizî, cuma 46; muvatta, havf 1; Ahmed b. Hanbel, II, 132, 150, 155, 320, 522. dedi ki: (Bu mevzuda) duyduklarımın bana en hoş geleni Yezid b. Rûman'ın hadisidir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (4129) Sahih Muslim (842)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 41
      },
      "narrator": {
        "en": "Salih b. Khawwat"
      }
    },
    {
      "hadithNumber": 1239,
      "arabicNumber": 1239,
      "book": 4,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ صَالِحِ بْنِ خَوَّاتٍ الأَنْصَارِيِّ، أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ الأَنْصَارِيَّ، حَدَّثَهُ أَنَّ صَلاَةَ الْخَوْفِ أَنْ يَقُومَ الإِمَامُ وَطَائِفَةٌ مِنْ أَصْحَابِهِ وَطَائِفَةٌ مُوَاجِهَةَ الْعَدُوِّ فَيَرْكَعُ الإِمَامُ رَكْعَةً وَيَسْجُدُ بِالَّذِينَ مَعَهُ ثُمَّ يَقُومُ فَإِذَا اسْتَوَى قَائِمًا ثَبَتَ قَائِمًا وَأَتَمُّوا لأَنْفُسِهِمُ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ سَلَّمُوا وَانْصَرَفُوا وَالإِمَامُ قَائِمٌ فَكَانُوا وِجَاهَ الْعَدُوِّ ثُمَّ يُقْبِلُ الآخَرُونَ الَّذِينَ لَمْ يُصَلُّوا فَيُكَبِّرُونَ وَرَاءَ الإِمَامِ فَيَرْكَعُ بِهِمْ وَيَسْجُدُ بِهِمْ ثُمَّ يُسَلِّمُ فَيَقُومُونَ فَيَرْكَعُونَ لأَنْفُسِهِمُ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ يُسَلِّمُونَ ‏.‏ قَالَ أَبُو دَاوُدَ وَأَمَّا رِوَايَةُ يَحْيَى بْنِ سَعِيدٍ عَنِ الْقَاسِمِ نَحْوُ رِوَايَةِ يَزِيدَ بْنِ رُومَانَ إِلاَّ أَنَّهُ خَالَفَهُ فِي السَّلاَمِ وَرِوَايَةُ عُبَيْدِ اللَّهِ نَحْوُ رِوَايَةِ يَحْيَى بْنِ سَعِيدٍ قَالَ وَيَثْبُتُ قَائِمًا ‏.‏",
        "translations": {
          "en": "Narrated Sahl b. Abi Hathmah al-Ansari: The prayer time of danger should be offered in the following way: The imam should stand (for prayer) and a section of the people should stand along with him. The other section should stand facing the enemy. The imam should perform bowing and prostrate himself along with those who are with him. He then should stand (after prostration) and, when he stands straight, he should remain standing. They (the people) should (in the meantime) complete their remaining rak'ah (i.e. the second one). They they should utter the salutation, and turn away while the imam should remain standing. They should go before the enemy. Thereafter those who did not pray should come forward and utter the takbir (Allah is most great) behind imam. He should bow and prostrate along with them and utter the salutation. Then they should stand and completed their remaining rak'ah, and utter the salutation. Abu Dawud said: The tradition reported by Yahya b. Sa'id from al-Qasim is similar to the one transmitted by Yazid b. Ruman except that he differed with him in salutation. The tradition reported by 'Ubaid Allah is like the one reported by Yahya b. Sa'id, saying: He (the Prophet) remained standing",
          "ur": "صالح بن خوات انصاری کہتے ہیں کہ سہل بن ابی حثمہ انصاری رضی اللہ عنہ نے ان سے بیان کیا ہے کہ نماز خوف اس طرح ہو گی کہ امام ( نماز کے لیے ) کھڑا ہو گا اور اس کے ساتھیوں کی ایک جماعت اس کے ساتھ ہو گی اور دوسری جماعت دشمن کے سامنے کھڑی ہو گی، امام اور جو اس کے ساتھ ہوں گے رکوع اور سجدہ کریں گے پھر امام کھڑا ہو گا، جب پورے طور سے سیدھا کھڑا ہو جائے گا تو یونہی کھڑا رہے گا یہاں تک کہ لوگ اپنی باقی ( دوسری ) رکعت بھی ادا کر لیں گے، پھر وہ لوگ سلام پھیر کر واپس چلے جائیں گے اور امام کھڑا رہے گا، اب یہ دشمن کے سامنے ہوں گے اور جن لوگوں نے نماز نہیں پڑھی ہے، وہ آئیں گے اور امام کے پیچھے تکبیر ( تکبیر تحریمہ ) کہیں گے پھر وہ ان کے ساتھ رکوع اور سجدہ کر کے اپنی دوسری رکعت پوری کرے گا پھر سلام پھیر دے گا، اس کے بعد یہ لوگ کھڑے ہو کر اپنی باقی رکعت ادا کریں گے پھر سلام پھیریں گے۔ ابوداؤد کہتے ہیں: رہی قاسم سے مروی یحییٰ بن سعید کی روایت تو وہ یزید بن رومان کی روایت ہی کی طرح ہے سوائے اس کے کہ انہوں نے سلام میں اختلاف کیا ہے اور عبیداللہ کی روایت یحییٰ بن سعید کی روایت کی طرح ہے اس میں ہے کہ ( امام ) کھڑا رہے گا ۔",
          "fr": "Rapporté par Sahl ibn Abi Hathmah al-Ansari : La prière en temps de danger doit être accomplie ainsi : L’imam doit se tenir debout pour la prière, et une partie des gens doit prier avec lui, l’autre partie faisant face à l’ennemi. L’imam s’incline et se prosterne avec ceux qui sont avec lui, puis il se relève et reste debout. Pendant ce temps, ceux qui ont prié avec lui terminent leur seconde unité et font la salutation, puis ils se retirent pour faire face à l’ennemi. Ceux qui n’ont pas encore prié avancent et disent « Allahou Akbar » derrière l’imam. Il s’incline et se prosterne avec eux, puis fait la salutation. Ensuite, ils se lèvent, terminent leur seconde unité et font la salutation. Abu Dawud a dit : Le récit rapporté par Yahya ibn Sa’id d’al-Qasim est similaire à celui transmis par Yazid ibn Ruman, sauf qu’il diffère sur la salutation. Le récit rapporté par ‘Ubaid Allah est comme celui de Yahya ibn Sa’id, disant : « Le Prophète ﷺ est resté debout. »",
          "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] dari [Shalih bin Khuwwat Al Anshari] bahwa [Sahl bin Abu Hatsmah Al Anshari] telah menceritakan kepadanya, bahwa shalat khauf itu adalah; \"Imam berdiri bersama satu kelompok sahabatnya, sedangkan satu kelompok yang lainnya menghadap ke arah musuh. Lalu imam ruku' dan sujud bersama kelompok yang menyertainya, lalu berdiri. Apabila telah berdiri tegak, imam tetap berdiri, sedangkan kelompok yang bersamanya menyempurnakan satu raka'at yang tersisa sendiri-sendiri, lalu mereka salam dan beranjak pergi, sedangkan imam masih dalam posisi berdiri, sementara mereka pergi berjaga-jaga menghadapi musuh. Kemudian kelompok yang lain, yang belum shalat datang dan bertakbir di belakang imam. Imam ruku' dan sujud bersama mereka, kemudian imam salam, sementara mereka berdiri dan melanjutkan raka'at yang sisa, lalu mereka salam.\" Abu Daud berkata; adapun riwayat Yahya bin Sa'id dari Al Qasim seperti riwayat Yazid bin Ruman, namun riwayatnya sedikit berbeda ketika salam, sedangkan riwayatnya 'Ubaidullah seperti riwayatnya Yahya bin Sa'id, katanya; \"Imam tetap berdiri",
          "tr": "Sehl b. Ebi Hasme el-Ensârî (r.a.)'den şöyle dediği rivayet olunmuştur: Korku namazı (şöyle kılınır): îmam cemaatinden bir zümre ile kalkar namaza durur. Diğer bir zümre de düşman karşısında durur. İmam, arkasındaki cemaatle beraber rükû’ ve secdeyi yaptıktan son­ra ayağa kalkar, iyice doğrulup ayakta kalır. Cemaat de kalan rekatı kendi başlarına tamamlarlar. Sonra imam ayakta dikilirken selâmı verip giderler, düşmanın karşısında yerlerini alırlar. Sonra namazlarını kılmamış olan zümre gelip imamın arkasında (iftitah) tekbiri alıp (namaza durur), imam onlarla beraber rükû'a ve secdeye vardıktan sonra selâm verir, (namazdan çıkar. Arkasındaki cemaat ise) kalkıp geriyekalan rükû' (ve secdeyi de) yaptıktan sonra selâm verirler. Ebû Dâvûd dedi ki: Yahya b. Said'in el-Kasım'dan (naklettiği) rivayeti Yezid b. Rûmân'ın rivayeti gibidir. Ancak Yahya b. Said se­lam konusunda Yezid b. Rûmân'a muhalefet etmiştir. Ubeydullah'ınm rivayeti de Yahya b. Said'in rivayetine benzer. (Ubeydullah da riva­yetinde aynen Yahya gibi) \"ayakta sabit kalır\" dedi. Diğer tahric: Buhârî, havf; Müslim, müsâfirîn; Nesâî, havf; Tirmizî, cuma; Muvattâ', havf; Ahmed b. Hanbel, II"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (4129) Sahih Muslim (842)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 42
      },
      "narrator": {
        "en": "Sahl b. Abi Hathmah al-Ansari"
      }
    },
    {
      "hadithNumber": 1240,
      "arabicNumber": 1240,
      "book": 4,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، وَابْنُ، لَهِيعَةَ قَالاَ أَخْبَرَنَا أَبُو الأَسْوَدِ، أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، يُحَدِّثُ عَنْ مَرْوَانَ بْنِ الْحَكَمِ، أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ هَلْ صَلَّيْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْخَوْفِ قَالَ أَبُو هُرَيْرَةَ نَعَمْ ‏.‏ قَالَ مَرْوَانُ مَتَى فَقَالَ أَبُو هُرَيْرَةَ عَامَ غَزْوَةِ نَجْدٍ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى صَلاَةِ الْعَصْرِ فَقَامَتْ مَعَهُ طَائِفَةٌ وَطَائِفَةٌ أُخْرَى مُقَابِلَ الْعَدُوِّ ظُهُورُهُمْ إِلَى الْقِبْلَةِ فَكَبَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَبَّرُوا جَمِيعًا الَّذِينَ مَعَهُ وَالَّذِينَ مُقَابِلِي الْعَدُوِّ ثُمَّ رَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَةً وَاحِدَةً وَرَكَعَتِ الطَّائِفَةُ الَّتِي مَعَهُ ثُمَّ سَجَدَ فَسَجَدَتِ الطَّائِفَةُ الَّتِي تَلِيهِ وَالآخَرُونَ قِيَامٌ مُقَابِلِي الْعَدُوِّ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَامَتِ الطَّائِفَةُ الَّتِي مَعَهُ فَذَهَبُوا إِلَى الْعَدُوِّ فَقَابَلُوهُمْ وَأَقْبَلَتِ الطَّائِفَةُ الَّتِي كَانَتْ مُقَابِلِي الْعَدُوِّ فَرَكَعُوا وَسَجَدُوا وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ كَمَا هُوَ ثُمَّ قَامُوا فَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَةً أُخْرَى وَرَكَعُوا مَعَهُ وَسَجَدَ وَسَجَدُوا مَعَهُ ثُمَّ أَقْبَلَتِ الطَّائِفَةُ الَّتِي كَانَتْ مُقَابِلِي الْعَدُوِّ فَرَكَعُوا وَسَجَدُوا وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَاعِدٌ وَمَنْ مَعَهُ ثُمَّ كَانَ السَّلاَمُ فَسَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَسَلَّمُوا جَمِيعًا فَكَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم رَكْعَتَانِ وَلِكُلِّ رَجُلٍ مِنَ الطَّائِفَتَيْنِ رَكْعَةٌ رَكْعَةٌ ‏.‏",
        "translations": {
          "en": "Urwah ibn az-Zubayr reported that Marwan ibn al-Hakam asked AbuHurayrah:Did you pray in time of danger with the Messenger of Allah (ﷺ)? AbuHurayrah replied: Yes. Marwan then asked: When? AbuHurayrah said: On the occasion of the Battle of Najd. The Messenger of Allah (ﷺ) stood up to offer the afternoon prayer. One section stood with him (to pray) and the other was standing before the enemy, and their backs were towards the qiblah. The Messenger of Allah (ﷺ) uttered the takbir and all of them too uttered the takbir, i.e. those who were with him and those who were facing the enemy. Then the Messenger of Allah (ﷺ) offered one rak'ah and the section that was with him also prayed one rak'ah. He then prostrated himself and those who were with him also prostrated, while the other section was standing before the enemy. The Messenger of Allah (ﷺ) then stood up and the section with him also stood up. They went and faced the enemy and the section that was previously facing the enemy stepped forward. They bowed and prostrated while the Messenger of Allah (ﷺ) was standing in the same position. Then they stood up and the Messenger of Allah (may peace be upon) prayed another rak'ah and all of them bowed and prostrated along with him. After that the section that was standing before the enemy came forward and they bowed and prostrated, while the Messenger of Allah (ﷺ) remained seated and also those who were with him. The salutation then followed. The Messenger of Allah (ﷺ) uttered the salutation and all of them uttered it together. The Messenger of Allah (ﷺ) prayed two rak'ahs and each of the two sections prayed one rak'ah with him (and the other by themselves)",
          "fr": "Urwah ibn az-Zubayr rapporte que Marwan ibn al-Hakam a demandé à Abu Hurayrah : « As-tu prié en temps de danger avec le Messager d’Allah ﷺ ? » Abu Hurayrah a répondu : « Oui. » Marwan a alors demandé : « Quand cela ? » Abu Hurayrah a dit : « Lors de la bataille de Najd. Le Messager d’Allah ﷺ s’est levé pour la prière de l’après-midi. Un groupe a prié avec lui, l’autre faisait face à l’ennemi, leur dos tourné vers la qibla. Le Messager d’Allah ﷺ a dit “Allahou Akbar” et tous l’ont dit aussi, ceux qui étaient avec lui et ceux qui faisaient face à l’ennemi. Puis le Messager d’Allah ﷺ a accompli une unité de prière, et le groupe avec lui aussi. Il s’est prosterné, et ceux qui étaient avec lui aussi, tandis que l’autre groupe restait face à l’ennemi. Le Messager d’Allah ﷺ s’est alors relevé, et ceux qui étaient avec lui aussi. Ils sont allés faire face à l’ennemi, et le groupe qui était face à l’ennemi a avancé. Ils se sont inclinés et prosternés pendant que le Messager d’Allah ﷺ restait debout. Ensuite, ils se sont relevés, et le Messager d’Allah ﷺ a accompli une autre unité et tous se sont inclinés et prosternés avec lui. Après cela, le groupe qui était face à l’ennemi est venu, ils se sont inclinés et prosternés, tandis que le Messager d’Allah ﷺ et ceux qui étaient avec lui sont restés assis. Puis la salutation a été faite. Le Messager d’Allah ﷺ a salué et tous l’ont fait avec lui. Le Messager d’Allah ﷺ a prié deux unités, et chacun des deux groupes a prié une unité avec lui (et l’autre seul). »",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abu Abdurrahman Al Muqri`i] telah menceritakan kepada kami [Haiwah] dan [Ibnu Lahi'ah] keduanya berkata; telah mengabarkan kepada kami [Abu Al Aswad] bahwa dia mendengar ['Urwah bin Az Zubair] bercerita dari [Marwan bin Hakam] bahwa dia bertanya kepada [Abu Hurairah]; \"Apakah kamu pernah shalat khauf bersama Rasulullah shallallahu 'alaihi wasallam?\" Abu Hurairah menjawab; \"Ya, pernah.\" Marwan bertanya; \"Kapan?\" Abu Hurairah menjawab; \"Ketika memerangi Bani Najd, Rasulullah shallallahu 'alaihi wasallam hendak mengerjakan shalat Ashar, lalu sekelompok orang berdiri (shalat) bersama beliau, sedangkan kelompok yang lain menghadap ke arah musuh membelakangi Kiblat. Rasulullah shallallahu 'alaihi wasallam bertakbir, lalu mereka juga ikut bertakbir, baik yang bersama beliau atau kelompok yang menghadap musuh. Setelah itu, Rasulullah shallallahu 'alaihi wasallam ruku' sekali bersama dengan kelompok yang menyertai beliau, lalu beliau sujud dan sujud pula orang yang menyertai beliau, sementara kelompok yang lain tetap berdiri menghadap ke arah musuh. Selanjutnya Rasulullah shallallahu 'alaihi wasallam berdiri, begitu juga kelompok yang menyertai beliau, kemudian kelompok ini pindah, menggantikan kelompok yang menghadapi musuh, sedangkan kelompok yang menghadapi musuh pindah ke belakang beliau untuk mengerjakan ruku' dan sujud sendiri-sendiri. Sedangkan Rasulullah shallallahu 'alaihi wasallam tetap berdiri menunggu sampai mereka berdiri pula. Setelah itu Rasulullah shallallahu 'alaihi wasallam ruku' (untuk raka'at kedua), lalu mereka ruku' bersama beliau, beliau sujud, mereka pun ikut sujud. Lalu kelompok yang menghadapi musuh datang, mereka ruku' dan sujud sendiri, sedangkan Rasulullah shallallahu 'alaihi wasallam tetap duduk menunggu bersama kelompok yang menyertai beliau tadi, setelah itu, baru tiba waktu salam. Maka Rasulullah shallallahu 'alaihi wasallam salam dan mereka semuanya pun salam. Maka bagi Rasulullah shallallahu 'alaihi wasallam dua rala'at, sedangkan bagi masing-masing mereka satu raka'at.\" Telah menceritakan kepada kami [Muhammad bin 'Amru Ar Razi] telah menceritakan kepada kami [Salamah] telah menceritakan kepadaku [Muhammad bin Ishaq] dari [Muhammad bin Ja'far bin Zubair] dan [Muhammad bin Al Aswad] dari ['Urwah bin Az Zubair] dari [Abu Hurairah] dua berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam menuju daerah Najd, hingga ketika kami sampai di perkebunan kurma Dzatur Riqa', beliau bertemu dengan sekelompok orang Bani Ghathafan…' kemudian dia menyebutkan makna dan lafadz hadits ini, tidak seperti lafadz hadits sebelumnya. Dalam hadits tersebut, dia berkata; \"…Ketika beliau ruku' dam sujud bersama orang-orang yang berada di belakang beliau. selanjutnya Perawi berkata; \"Setelah mereka berdiri, lalu berjalan mundur ke barisan sahabat mereka.\" dalam hadits ini tidak di sebutkan \"membelakangi Kiblat",
          "tr": "Mervân b. el-Hakem'den rivayet edildiğine göre kendisi Ebü Hureyre (r.a.)'e, \"Resûlullah (s.a.v.) ile beraber korku namazı kıldın mı?\" diye sormuş. O da \"Evet\" diye cevab vermiş. Mervân: \"Ne zaman?\" deyince; Ebû Hureyre de şu cevabı vermiş: Necid gazvesi yılında (kıldım). Resûlullah (s.a.v.) ikindi namazı için kalktı, (askerlerden) bir grup sırtları kıbleye karşı düşman karşısında dururlarken bir grub da kendisiyle beraber namaza durdu. Resûlullah (s.a.v.) tekbir alınca düşman karşısında olanlarla kendi yanında bulunanlar hep birlikte tekbir aldılar. Hz. Peygamber secde yaptı, onlar da yaptılar. Diğerleri ise düşman karşısında ayakta duruyorlardı, sonra Resûlullah (secdeden) kalkınca beraberindekiler de kalkıp gittiler ve düşmanın karşısında durdular. (Daha önce) düşman karşısında olan grub da Resûlullah'ın arkasına gelip durdular. Hz. Peygamber (s.a.v.) bir kere daha rükû'a ve secdeye vardı, onlar da O'nunla beraber rükû'a ve secdeye vardılar, Resûlullah ve beraberindekiler otururken düşman karşısında duranlar tekrar gelip rükû ve secdeye vardılar. Daha sonra da hep beraber selâm verdiler. Böylece (cemaatle kılınan namazın miktarı) Resûlullah (s.a.v.) için iki rekat her iki taifede bulunan kimseler içinse birer rekat oldu. Diğer tahric: Nesâî, havf"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 1241,
      "arabicNumber": 1241,
      "book": 4,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ، حَدَّثَنَا سَلَمَةُ، حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، وَمُحَمَّدِ بْنِ الأَسْوَدِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى نَجْدٍ حَتَّى إِذَا كُنَّا بِذَاتِ الرِّقَاعِ مِنْ نَخْلٍ لَقِيَ جَمْعًا مِنْ غَطَفَانَ فَذَكَرَ مَعْنَاهُ وَلَفْظُهُ عَلَى غَيْرِ لَفْظِ حَيْوَةَ وَقَالَ فِيهِ حِينَ رَكَعَ بِمَنْ مَعَهُ وَسَجَدَ قَالَ فَلَمَّا قَامُوا مَشَوُا الْقَهْقَرَى إِلَى مَصَافِّ أَصْحَابِهِمْ وَلَمْ يَذْكُرِ اسْتِدْبَارَ الْقِبْلَةِ ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurairah: We went out with the Messenger of Allah (ﷺ) to Najd. When we reached Dhat ar-Riqa at Nakhl (or in a valley with palm trees) he met a group of the tribe of Ghatafan. The narrator then reported the tradition to the same effect, but his version is other than that of Haywah. He added to the words \"when he bowed along with those who were with him and prostrated\" the words \"when they stood up, they retraced their footsteps to the rows of their companions\". He did not mention the words \"their back was towards the qiblah",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نجد کی طرف نکلے یہاں تک کہ جب ہم ذات الرقاع میں تھے تو غطفان کے کچھ لوگ ملے، پھر انہوں نے اسی مفہوم کی حدیث ذکر کی لیکن اس کے الفاظ حیوۃ کے الفاظ سے مختلف ہیں اس میں «حين ركع بمن معه وسجد» کے الفاظ ہیں، نیز اس میں ہے «فلما قاموا مشوا القهقرى إلى مصاف أصحابهم» یعنی جب وہ اٹھے تو الٹے پاؤں پھرے اور اپنے ساتھیوں کی صف میں آ کھڑے ہوئے ، اس میں انہوں نے «استدبار قبلہ» ( قبلہ کی طرف پیٹھ کرنے ) کا ذکر نہیں کیا ہے۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Nous sommes partis avec le Messager d’Allah ﷺ vers Najd. Quand nous sommes arrivés à Dhat ar-Riqa à Nakhl (ou dans une vallée avec des palmiers), il a rencontré un groupe de la tribu de Ghatafan. Le narrateur a ensuite rapporté le récit avec le même sens, mais sa version diffère de celle de Haywah. Il a ajouté aux mots « quand il s’est incliné avec ceux qui étaient avec lui et s’est prosterné » les mots « quand ils se sont relevés, ils sont retournés dans les rangs de leurs compagnons ». Il n’a pas mentionné que « leur dos était tourné vers la qibla »",
          "tr": "Ebû Hureyre (r.a.)'den; demiştir ki: Resulullah (s.a.v.) ile birlikte Necid'e doğru (sefere) çıktık. Nahl'de bulunan Zâtur'rikâ' denilen yere gelince Gatafân (oğulların)dan bir toplulukla karşılaştık. Daha sonra (Muhammed b. İshak sözlerine devamla daha önce geçen (1240.) hadisin) mânâsını nakletti. Ancak (Muham­med b. İshak'ın rivayet ettiği hadisin) sözleri Hayve (hadisi)nin sözlerinden başkadır. Ve bu hadiste (Muhammed b. İshak): \"(Resûlullah), beraberlerinde bulunan kimselerle rükû'a ve secdeye varınca (beraberindeki kimseler) kalktılar ve geri geri giderek arkadaşlarının bulunduğu yere vardılar\" dedi. Fakat sırtlarının kıbleye karşı olduğunu zikretmedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 44
      },
      "narrator": {
        "en": "Abu Hurairah"
      }
    },
    {
      "hadithNumber": 1242,
      "arabicNumber": 1242,
      "book": 4,
      "hadithInBook": 45,
      "text": {
        "arabic": "قَالَ أَبُو دَاوُدَ وَأَمَّا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ فَحَدَّثَنَا قَالَ حَدَّثَنِي عَمِّي، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ عَائِشَةَ حَدَّثَتْهُ بِهَذِهِ الْقِصَّةِ، قَالَتْ كَبَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَبَّرَتِ الطَّائِفَةُ الَّذِينَ صُفُّوا مَعَهُ ثُمَّ رَكَعَ فَرَكَعُوا ثُمَّ سَجَدَ فَسَجَدُوا ثُمَّ رَفَعَ فَرَفَعُوا ثُمَّ مَكَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسًا ثُمَّ سَجَدُوا هُمْ لأَنْفُسِهِمُ الثَّانِيَةَ ثُمَّ قَامُوا فَنَكَصُوا عَلَى أَعْقَابِهِمْ يَمْشُونَ الْقَهْقَرَى حَتَّى قَامُوا مِنْ وَرَائِهِمْ وَجَاءَتِ الطَّائِفَةُ الأُخْرَى فَقَامُوا فَكَبَّرُوا ثُمَّ رَكَعُوا لأَنْفُسِهِمْ ثُمَّ سَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَجَدُوا مَعَهُ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَسَجَدُوا لأَنْفُسِهِمُ الثَّانِيَةَ ثُمَّ قَامَتِ الطَّائِفَتَانِ جَمِيعًا فَصَلُّوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَكَعَ فَرَكَعُوا ثُمَّ سَجَدَ فَسَجَدُوا جَمِيعًا ثُمَّ عَادَ فَسَجَدَ الثَّانِيَةَ وَسَجَدُوا مَعَهُ سَرِيعًا كَأَسْرَعِ الإِسْرَاعِ جَاهِدًا لاَ يَأْلُونَ سِرَاعًا ثُمَّ سَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَسَلَّمُوا فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَارَكَهُ النَّاسُ فِي الصَّلاَةِ كُلِّهَا ‏.‏",
        "translations": {
          "en": "Abu Dawud said:This tradition has been transmitted by 'Aishah through a different chain of narrators. She said: The Messenger of Allah (ﷺ) uttered the takbir and the section that was in the same row with him also uttered the takbir. He then bowed and they also bowed, and he prostrated and they also prostrated. Then he raised his head and they also raised (their heads). The Messenger of Allah (ﷺ) then remained seated. They prostrated alone and stood up and retraced their footsteps and stood behind them. Then the other section came; they stood up and uttered the takbir and bowed by themselves. The Messenger of Allah (ﷺ) prostrated himself and they also prostrated with him. Then the Messenger of Allah (ﷺ) stood up and they performed the second prostration by themselves. Then both the sections stood up and prayed with the Messenger of Allah (ﷺ). He bowed and they also bowed, and then he prostrated himself and they also prostrated themselves. Then he returned and performed the second prostration and they also prostrated with him as quickly as possible, showing no slackness in quick prostration. The Messenger of Allah (ﷺ) then uttered the salutation. After that the Messenger of Allah (ﷺ) stood up. Thus everyone participated in the entire prayer",
          "ur": "عروہ بن زبیر بیان کرتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا نے ان سے یہی واقعہ بیان کیا اور فرمایا: رسول اللہ صلی اللہ علیہ وسلم نے تکبیر تحریمہ کہی اور اس جماعت نے بھی جو آپ کے ساتھ صف میں کھڑی تھی تکبیر تحریمہ کہی، پھر آپ نے رکوع کیا تو ان لوگوں نے بھی رکوع کیا، پھر آپ نے سجدہ کیا تو ان لوگوں نے بھی سجدہ کیا، پھر آپ نے سجدہ سے سر اٹھایا تو انہوں نے بھی اٹھایا، اس کے بعد آپ بیٹھے رہے اور وہ لوگ دوسرا سجدہ خود سے کر کے کھڑے ہوئے اور ایٹریوں کے بل پیچھے چلتے ہوئے الٹے پاؤں لوٹے، یہاں تک کہ ان کے پیچھے جا کھڑے ہوئے، اور دوسری جماعت آ کر کھڑی ہوئی، اس نے تکبیر کہی پھر خود سے رکوع کیا اب رسول اللہ صلی اللہ علیہ وسلم نے اپنا دوسرا سجدہ کیا اور آپ کے ساتھ ان لوگوں نے بھی سجدہ کیا اس کے بعد رسول اللہ صلی اللہ علیہ وسلم تو اٹھ کھڑے ہوئے اور ان لوگوں نے اپنا دوسرا سجدہ کیا، پھر دونوں جماعتیں ایک ساتھ کھڑی ہوئیں اور دونوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی، آپ نے رکوع کیا ( ان سب نے بھی رکوع کیا ) ، پھر آپ نے سجدہ کیا تو ان سب نے بھی ایک ساتھ سجدہ کیا، پھر آپ نے دوسرا سجدہ کیا اور ان لوگوں نے بھی آپ کے ساتھ جلدی جلدی سجدہ کیا، اور جلدی کرنے میں کوئی کوتاہی نہیں برتی، پھر رسول اللہ صلی اللہ علیہ وسلم نے سلام پھیرا، اور لوگوں نے بھی سلام پھیرا، پھر آپ نماز سے فارغ ہو کر اٹھ کھڑے ہوئے اس طرح لوگوں نے پوری نماز میں آپ کے ساتھ شرکت کر لی۔",
          "fr": "Abu Dawud a dit : Ce récit a été transmis par Aishah رضي الله عنها via une autre chaîne de narrateurs. Elle a dit : Le Messager d’Allah ﷺ a dit « Allahou Akbar » et le groupe qui était dans le même rang que lui l’a aussi dit. Il s’est alors incliné et ils se sont inclinés, il s’est prosterné et ils se sont prosternés. Ensuite, il a relevé la tête et eux aussi. Le Messager d’Allah ﷺ est resté assis. Ils se sont prosternés seuls, se sont relevés et sont retournés derrière. L’autre groupe est venu, ils se sont levés, ont dit « Allahou Akbar » et se sont inclinés seuls. Le Messager d’Allah ﷺ s’est prosterné et ils se sont prosternés avec lui. Puis le Messager d’Allah ﷺ s’est relevé et ils ont fait la seconde prosternation seuls. Ensuite, les deux groupes se sont levés et ont prié avec le Messager d’Allah ﷺ. Il s’est incliné et ils se sont inclinés, puis il s’est prosterné et ils se sont prosternés. Ensuite, il a fait la seconde prosternation et ils l’ont faite avec lui aussi vite que possible, sans traîner. Le Messager d’Allah ﷺ a alors salué. Après cela, il s’est relevé. Ainsi, tout le monde a participé à toute la prière",
          "id": "Abu Daud berkata; telah menceritakan kepada kami ['Ubaidullah bin Sa'd] katanya; telah menceritakan kepadaku [pamanku] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepada kami [Muhammad bin Ja'far bin Az Zubair] bahwa ['Urwah bin Zubair] telah menceritakan kepadanya, bahwa [Aisyah] pernah menceritakan kepadanya dengan kisah seperti ini, kata Asiyah; 'Rasulullah shallallahu 'alaihi wasallam bertakbir, begitu juga dengan kelompok yang shalat bersama beliau ikut bertakbir, kemudian beliau ruku, mereka juga ruku', lalu beliau sujud, mereka juga ikut sujud, lalu beliau mengangkat kepala (duduk di antara dua sujud), lalu mereka ikut bangkit, namun Rasulullah shallallahu 'alaihi wasallam masih tetap duduk, sementara mereka mengerjakan sujud kedua sendiri-sendiri. Kemudian mereka berdiri dan berjalan mundur pelan-pelan sehingga berdiri di belakang mereka (kelompok kedua), dan kelompok kedua datang, lalu mereka berdiri di belakang Rasulullah shallallahu 'alaihi wasallam, mereka bertakbir dan ruku' sendiri-sendiri, setelah ruku', Rasulullah shallallahu 'alaihi wasallam sujud, maka mereka juga sujud bersama beliau. kemudian Rasulullah shallallahu 'alaihi wasallam berdiri, sedangkan mereka mengerjakan sujud kedua sendiri-sendiri, setelah itu kedua kelompok tersebut berdiri semua, mengerjakan shalat bersama dengan Rasulullah shallallahu 'alaihi wasallam. beliau ruku', lalu mereka juga ikut ruku', beliau sujud mereka juga sujud. Lalu beliau kembali duduk, terus sujud lagi yang kedua, maka mereka juga ikut sujud bersama beliau secepatnya dan sangat cepat tanpa mengurangi kesempurnaan (sujud), setelah itu Rasulullah shallallahu 'alaihi wasallam salam dan mereka juga ikut salam bersama beliau.\" Rasulullah shallallahu 'alaihi wasallam berdiri dalam semua shalat yang di sertai oleh semua jama'ah shalat",
          "tr": "Ebû Dâvûd yeni bir senedle (bir Önceki) hâdiseyi Hz. Âişe'den Urve b. ez-Zübeyr'in de naklettiğini ve Aişe'nin şöyle dediğini haber vermiştir: Resûlullah (s.a.v.) tekbir aldı, beraberinde bulunan grub da tekbir aldı, sonra (Resûl-i Ekrem) rukû'a varınca onlar da vardılar, secde edince onlar da secde ettiler. (Secdeden) kalkınca onlar da kalktılar. Resûlullah (s.a.v.) oturarak beklerken kendi kendilerine ikinci secdeyi yaptılar, sonra ökçeleri üzerinde geri çekilerek arkalarında bulunan zümrenin gerisine kadar varıp durdular. Bunun üzerine diğer zümre gelerek namaza durup tekbir aldı, sonra kendi kendilerine rükû'a vardılar. Daha sonra Resûlullah (s.a.v.) (ikinci) secdeye varınca beraberinde onlar da vardılar. Sonra Resûlullah (s.a.v.) (ikinci rekat için) ayağa kalkınca bunlar da kendi başlarına (öteki) secde(yi) ettiler. Sonra her iki zümre de Resûlullah (s.a.v.)'le beraber kıyamda birleşip namaza devam ettiler. Resûlullah (s.a.v.)'le birlikte beraberce rükû'a ve secdeye vardılar. Sonra Resûlullah dönüp ikinci secdeye varınca acelede kusur etmemeye çalışarak en sür'atli bir şekilde onunla birlikte secdeye vardılar. Sonra Resûlullah (s.a.v.) selâm verince onlar da selâm verdi­ler. Bunun üzerine Resûlullah, cemaat namazın tümüne iştirak etmiş olarak (namazdan) kalktı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 1243,
      "arabicNumber": 1243,
      "book": 4,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً وَالطَّائِفَةُ الأُخْرَى مُوَاجِهَةُ الْعَدُوِّ ثُمَّ انْصَرَفُوا فَقَامُوا فِي مَقَامِ أُولَئِكَ وَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً أُخْرَى ثُمَّ سَلَّمَ عَلَيْهِمْ ثُمَّ قَامَ هَؤُلاَءِ فَقَضَوْا رَكْعَتَهُمْ وَقَامَ هَؤُلاَءِ فَقَضَوْا رَكْعَتَهُمْ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ رَوَاهُ نَافِعٌ وَخَالِدُ بْنُ مَعْدَانَ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَذَلِكَ قَوْلُ مَسْرُوقٍ وَيُوسُفَ بْنِ مِهْرَانَ عَنِ ابْنِ عَبَّاسٍ وَكَذَلِكَ رَوَى يُونُسُ عَنِ الْحَسَنِ عَنْ أَبِي مُوسَى أَنَّهُ فَعَلَهُ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Umar: The Messenger of Allah (ﷺ) led one section in one rak'ah of prayer and the other section was facing the enemy. Then they turned away and took the position of the other section. They (the other section) came and he (the Prophet) led them in the second rak'ah. He then uttered the salutation. Thereafter they stood up and completed the remaining rak'ah, they went away and the other section completed their remaining rak'ah. Abu Dawud said: This tradition has been narrated by Nafi' and Khalid b. Ma'dan from Ibn 'Umar in like manner from the Prophet (ﷺ). This has also been transmitted similarly by Masruq ad Yusuf b. Mihran on the authority of Ibn 'Abbas. This has been narrated by Yunus from al-Hasan from Abu Musa something similarly, saying that Abu Musa has done so",
          "ur": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک جماعت کو ایک رکعت پڑھائی اور دوسری جماعت دشمن کے سامنے رہی پھر یہ جماعت جا کر پہلی جماعت کی جگہ کھڑی ہو گئی اور وہ جماعت ( نبی اکرم صلی اللہ علیہ وسلم کے پیچھے ) آ گئی تو آپ نے ان کو بھی ایک رکعت پڑھائی پھر آپ نے سلام پھیر دیا، پھر یہ لوگ کھڑے ہوئے اور اپنی رکعت پوری کی اور وہ لوگ بھی ( جو دشمن کے سامنے چلے گئے تھے ) کھڑے ہوئے اور انہوں نے اپنی رکعت پوری کی۔ ابوداؤد کہتے ہیں: اسی طرح یہ حدیث نافع اور خالد بن معدان نے ابن عمر رضی اللہ عنہما سے ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔ اور یہی قول مسروق اور یوسف بن مہران ہے جسے وہ ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں، اسی طرح یونس نے حسن سے اور انہوں نے ابوموسیٰ رضی اللہ عنہ سے روایت کی ہے کہ آپ نے ایسا ہی کیا۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah ﷺ a dirigé un groupe pour une unité de prière, tandis que l’autre groupe faisait face à l’ennemi. Ensuite, ils ont échangé leur place. Le second groupe est venu et il les a dirigés pour la seconde unité. Il a ensuite fait la salutation. Après cela, ils se sont levés et ont terminé leur unité restante, puis ils sont partis et l’autre groupe a terminé sa propre unité. Abu Dawud a dit : Ce récit a été rapporté par Nafi’ et Khalid ibn Ma’dan d’après Ibn ‘Umar de la même façon, du Prophète ﷺ. Il a aussi été transmis de façon similaire par Masruq et Yusuf ibn Mihran d’après Ibn Abbas. Yunus l’a rapporté d’al-Hasan, d’Abu Musa, de façon similaire, disant qu’Abu Musa a fait ainsi",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat satu raka'at dengan salah satu dari dua kelompok, sedangkan kelompok yang lain berjaga-jaga menghadapi musuh, setelah kelompok pertama selesai melaksanakan shalat, mereka pergi menempati kelompok kedua, dan kelompok kedua menempati tempat kelompok pertama, beliau mengerjakan shalat bersama kelompok kedua satu raka'at sisanya, lalu beliau salam, kemudian kelompok kedua berdiri dan menyelesaikan raka'at mereka, dan mereka berdiri untuk menyelesaikan raka'at mereka.\" Abu Daud berkata; \"Demikian juga yang di riwayatkan oleh [Nafi'] dan [Khalid bin Ma'dan] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, begitu juga dengan perkataannya Masruq dan Yusuf bin Mihran dari Ibnu Abbas, demikian juga yang di riwayatkan Yunus dari Al Hasan dari Abu Musa bahwa dia juga melakukan cara seperti ini",
          "tr": "İbn Ömer'den rivayet edildiğine göre, Resûlullah (s.a.v.) iki zümreden birine bir rekât kıldırdı. (bu arada) diğer zümre düşman karşısında bulunuyordu. Sonra (berikiler) namazdan ayrılıp öbürlerinin yerlerine durunca (bu sefer) onlar geldi. Resûlullah (s.a.v.) onlara da bir rekat namaz kıldırdı. Selâm verdi. Sonra hem kberikiîer hem de ötekiler birer rekat kaza ettiler. Ebû Dâvûd dedi ki: Bu hadisi aynı şekilde Nesâî ile Hâlid b. Mâ­dan da İbn Ömer vasıtasıyla Nebi (s.a.v.)'den rivayet ettiler. Mesruk ile Yûsuf b. Mihran'ın İbn Abbas'tan naklettikleri söz de böyle­dir. Yûnus'un Hasan (el-Basrî)'den naklettiği rivayete göre Ebû Mu­sa da (korku namazını) bu şekilde kılarmış. Diğer tahric: Buhârî, havf; Müslim, musâfırîn; Tirmizî, cuma; Nesaî, havf"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (4133) Sahih Muslim (839)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 46
      },
      "narrator": {
        "en": "Ibn 'Umar"
      }
    },
    {
      "hadithNumber": 1244,
      "arabicNumber": 1244,
      "book": 4,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا خُصَيْفٌ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْخَوْفِ فَقَامُوا صَفَّيْنِ صَفٌّ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَصَفٌّ مُسْتَقْبِلَ الْعَدُوِّ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَةً ثُمَّ جَاءَ الآخَرُونَ فَقَامُوا مَقَامَهُمْ وَاسْتَقْبَلَ هَؤُلاَءِ الْعَدُوَّ فَصَلَّى بِهِمُ النَّبِيُّ صلى الله عليه وسلم رَكْعَةً ثُمَّ سَلَّمَ فَقَامَ هَؤُلاَءِ فَصَلَّوْا لأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمُوا ثُمَّ ذَهَبُوا فَقَامُوا مَقَامَ أُولَئِكَ مُسْتَقْبِلِي الْعَدُوِّ وَرَجَعَ أُولَئِكَ إِلَى مَقَامِهِمْ فَصَلَّوْا لأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمُوا ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Mas'ud: The Messenger of Allah (ﷺ) led us in prayer in the time of danger. They (the people) stood in two rows. One row was behind the Messenger of Allah (ﷺ) and the other faced the enemy. The Messenger of Allah (ﷺ) led them in one rak'ah,and then the other section came and took their place; they went and faced the enemy. The Prophet (ﷺ) led them in one rak'ah and uttered the salutation. They stood up and prayed the second rak'ah by themselves and uttered the salutation and went away; they took the place of the other section facing the enemy. They came back and took their place. They prayed one rak'ah by themselves and then uttered the salutation",
          "ur": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہمیں رسول اللہ صلی اللہ علیہ وسلم نے نماز خوف پڑھائی تو ایک صف رسول اللہ صلی اللہ علیہ وسلم کے پیچھے اور دوسری صف دشمن کے مقابل کھڑی ہوئی، آپ نے ان کو ایک رکعت پڑھائی پھر دوسری جماعت آئی اور ان کی جگہ کھڑی ہوئی اور یہ جماعت دشمن کے سامنے چلی گئی، اب نبی اکرم صلی اللہ علیہ وسلم نے ان کو ایک رکعت پڑھائی، پھر سلام پھیر دیا، پھر یہ جماعت کھڑی ہوئی، اس نے دوسری رکعت ادا کر کے سلام پھیرا اور جا کر ان کی جگہ کھڑی ہو گئی، جو دشمن کے سامنے تھے، اب وہ لوگ ان کی جگہ آ گئے اور انہوں نے اپنی دوسری رکعت ادا کی پھر سلام پھیرا۔",
          "fr": "Rapporté par Abdullah ibn Mas’ud : Le Messager d’Allah ﷺ nous a dirigés en prière en temps de danger. Les gens étaient en deux rangs : un rang derrière le Messager d’Allah ﷺ, l’autre face à l’ennemi. Le Messager d’Allah ﷺ a dirigé le premier groupe pour une unité, puis l’autre groupe est venu prendre leur place, et le premier est parti faire face à l’ennemi. Le Prophète ﷺ a dirigé le second groupe pour une unité et a fait la salutation. Ils se sont alors levés, ont prié la seconde unité seuls, ont fait la salutation et sont partis, prenant la place de l’autre groupe face à l’ennemi. Ils sont revenus, ont repris leur place, ont prié une unité seuls, puis ont fait la salutation",
          "tr": "Abdullah b. Mes'ud'dan nakledilmiştir ki: (sallallahü aleyhi ve sellem) bize korku namazı kıldırdı. (Cemaat) biri Resûlüllah'ın arkasında diğeri de düşman karşısında olmak üzere iki saf halinde (ayağa) kalktılar. Resûlüllah (sallallahü aleyhi ve sellem) (arkasındaki) gruba bir rekat namaz kıldırdı. Sonra öbür gruba bir rekat namaz kıldırdı. Sonra öbür grub gelip bunların yerine durdu. Bunlar da (gidip) düşmana doğru yönelerek (onların yerlerine) durdular. (Resûlüllah -sallallahü aleyhi ve sellem-) berikilere de bir rekat kıldırdıktan sonra selâm verdi. Bunun üzerine (arkasındakiler de) kalktılar kendi başlarına bir rekat (daha) kıldılar ve selâm verdiler. Daha sonra gidip düşman karşısındaki öbür grubun yerini aldılar. Onlar da bunların yerine dönüp geldiler ve kendi kendilerine bir rekat kılıp sonra selâm verdiler. es-Sünenü'l-kübrâ, III"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 47
      },
      "narrator": {
        "en": "Abdullah ibn Mas'ud"
      }
    },
    {
      "hadithNumber": 1245,
      "arabicNumber": 1245,
      "book": 4,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ، أَخْبَرَنَا إِسْحَاقُ، - يَعْنِي ابْنَ يُوسُفَ - عَنْ شَرِيكٍ، عَنْ خُصَيْفٍ، بِإِسْنَادِهِ وَمَعْنَاهُ ‏.‏ قَالَ فَكَبَّرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَكَبَّرَ الصَّفَّانِ جَمِيعًا ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الثَّوْرِيُّ بِهَذَا الْمَعْنَى عَنْ خُصَيْفٍ وَصَلَّى عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ هَكَذَا إِلاَّ أَنَّ الطَّائِفَةَ الَّتِي صَلَّى بِهِمْ رَكْعَةً ثُمَّ سَلَّمَ مَضَوْا إِلَى مَقَامِ أَصْحَابِهِمْ وَجَاءَ هَؤُلاَءِ فَصَلَّوْا لأَنْفُسِهِمْ رَكْعَةً ثُمَّ رَجَعُوا إِلَى مَقَامِ أُولَئِكَ فَصَلَّوْا لأَنْفُسِهِمْ رَكْعَةً ‏.‏ قَالَ أَبُو دَاوُدَ حَدَّثَنَا بِذَلِكَ مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ قَالَ أَخْبَرَنِي أَبِي أَنَّهُمْ غَزَوْا مَعَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ كَابُلَ فَصَلَّى بِنَا صَلاَةَ الْخَوْفِ ‏.‏",
        "translations": {
          "en": "This tradition has been transmitted by Kushaif with a different chain of narrators and to the same effect. This version adds:The Prophet of Allah (ﷺ) uttered takbir and both rows uttered takbir together. Abu Dawud said: This tradition has been narrated by al-Thawri to the same effect on the authority of Khusaif. 'Abd al-Rahman b. Samurah also prayed in like manner. But the section which he (the Prophet) led in one rak'ah and then uttered the salutation and went and took the place of their companions. They came and prayed one rak'ah by themselves. Then they returned to their place and they prayed (one rak'ah) by themselves. Abu Dawud said: Muslim b. Ibrahim reported from 'Abd al-Samad b. Habib on the authority of his father that they had fought a battle at Kabul along with 'Abd al-Rahman b. Samurah. He led us in prayer in time of danger",
          "ur": "اس طریق سے بھی خصیف سے سابقہ سند سے اسی مفہوم کی روایت مروی ہے اس میں ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے تکبیر ( تکبیر تحریمہ ) کہی اور دونوں صف کے سارے لوگوں نے بھی۔ ابوداؤد کہتے ہیں: ثوری نے بھی خصیف سے اسی مفہوم کی حدیث روایت کی ہے اور عبدالرحمٰن بن سمرہ نے اسی طرح یہ نماز ادا کی، البتہ اتنا فرق ضرور تھا کہ وہ گروہ جس کے ساتھ آپ نے ایک رکعت پڑھی اور سلام پھیر دیا، اپنے ساتھیوں کی جگہ واپس چلا گیا اور ان لوگوں نے آ کر خود سے ایک رکعت پوری کی۔ پھر وہ ان کی جگہ واپس چلے گئے اور اس گروہ نے آ کر اپنی باقی ماندہ رکعت خود سے ادا کی۔ ۱۲۴۵/م- ابوداؤد کہتے ہیں: ہم سے یہ حدیث مسلم بن ابراہیم نے بیان کی، مسلم کہتے ہیں: ہم سے عبدالصمد بن حبیب نے بیان کی، عبدالصمد کہتے ہیں: میرے والد نے مجھے بتایا کہ لوگوں نے عبدالرحمٰن بن سمرہ کے ساتھ کابل کا جہاد کیا تو انہوں نے ہمیں نماز خوف پڑھائی۔",
          "fr": "Ce récit a été transmis par Kushaif avec une autre chaîne de narrateurs et dans le même sens. Cette version ajoute : Le Prophète d’Allah ﷺ a dit « Allahou Akbar » et les deux rangs l’ont dit ensemble. Abu Dawud a dit : Ce récit a été rapporté par al-Thawri dans le même sens, d’après Khusaif. ‘Abd al-Rahman ibn Samurah a aussi prié de cette manière. Mais le groupe que le Prophète ﷺ a dirigé pour une unité, puis a fait la salutation et est parti prendre la place de leurs compagnons. Ils sont venus et ont prié une unité seuls. Ensuite, ils sont retournés à leur place et ont prié (une unité) seuls. Abu Dawud a dit : Muslim ibn Ibrahim a rapporté de ‘Abd al-Samad ibn Habib, de la part de son père, qu’ils avaient combattu à Kaboul avec ‘Abd al-Rahman ibn Samurah. Il nous a dirigés en prière en temps de danger",
          "id": "Telah menceritakan kepada kami [Imran bin Maisarah] telah menceritakan kepada kami [Ibnu Fudlail] telah menceritakan kepada kami [Khushaif] dari [Abu 'Ubaidah] dari [Abdullah bin Mas'ud] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan shalat khauf bersama kami, lalu sekelompok mereka berbaris di belakang Rasulullah shallallahu 'alaihi wasallam, sedangkan kelompok yang lain berjaga-jaga menghadapi musuh, maka Rasulullah shallallahu 'alaihi wasallam shalat dengan kelompok pertama satu raka'at, kemudian kelompok kedua datang dan menempati tempat kelompok pertama, sedangkan kelompok pertama bergantian berjaga menghadapi musuh, lalu Nabi shallallahu 'alaihi wasallam shalat dengan kelompok kedua satu raka'at, kemudian beliau salam, sementara kelompok yang shalat bersama beliau berdiri dan menyempurnakan satu raka'at sendiri-sendiri, kemudian mereka salam. Setelah itu mereka kembali dan menempati posisi kelompok yang menghadapi musuh, sedangkan kelompok pertama kembali (ke shaf shalat), kemudian mereka (menyempurnakan) shalat satu raka'at (yang tersisa) sendiri-sendiri, kemudian mereka salam.\" Telah menceritakan kepada kami [Tamim bin Al Muntashir] telah mengabarkan kepada kami [Ishaq yaitu Ibnu Yusuf] dari [Syarik] dari [Khushaif] dengan sanad dan maksud yang sama, katanya; \"Kemudian Nabi shallallahu 'alaihi wasallam bertakbir, dan kedua kelompok juga ikut bertakbir bersama beliau.\" Abu Daud mengatakan; \"Di riwayatkan pula oleh [Ats Tsauri] dengan makna seperti ini, dari [Khushaif], dan Abdurrahman bin Samurah juga mengerjakan cara shalat seperti ini, kecuali kelompok yang shalat satu raka'at, kemudian salam, lalu mereka bergantian menempati tempat sahabatnya yang lain (kelompok kedua), kemudian mereka (kelompok kedua) datang lalu shalat sendiri-sendiri satu raka'at, kemudian mereka kembali ke tempat mereka dan menyempurnakan shalat satu raka'at sendiri-sendiri.\" Abu Daud berkata; telah menceritakan kepada kami hadits seperti itu Muslim bin Ibrahim telah menceritakan kepada kami Abdusshamad bin Habib dia berkata; telah mengabarkan kepadaku ayahku bahwa mereka pernah berperang bersama Abdurrahman bin Samurah di daerah Kabul, kemudian dia mengerjakan shalat khauf bersama kami",
          "tr": "(Bir önceki hadisin 1244.) mânâsını aynı senedle İshâk b.Yûsuf (ve) Şerîk vasıtasıyla Husayf'tan Temîm b. Muntasır da rivayet etti. (Husayf) dedi ki: \"Peygamber (s.a.v.) tekbir getirince her iki saf da birlikte tekbir getirdi.\" Ebû Dâvud dedi ki: Bir önceki hadisi (Şerîk'in rivayet ettiği) mânâ ile Husayf tan es-Sevrîde rivayet etmiştir. Abdurrahman b. Semure de (korku namazını) böyle kılmıştır. Ancak (Semure'nin kıldırdığı korku namazında imama ikinci rekata yetişen ve) imamla bir rekat na­maz kılan grub, (imam) selâm verince (daha önce birinci rekatı imam­la beraber kılıp düşman karşısında beklemekte olan) arkadaşlarının yerlerine gitmişler, (bu sefer) onlar gelip kendi başlarına bir rekat kı­larak (selâm vermişler) ve öbürlerinin yanına giderek (imamın arkası­na gelmelerini) ve kendi başlarına bir rekat (daha) kılmalarını sağlamışlardır. Ebû Dâvûd dedi ki: Şu (bir önceki) hadisi bize Müslim b. İbra­him de Abdussamed b. Habîb'den nakletti. Abdussamed; babam, Ab­durrahman b. Semure ile birlikte Kâbul'e savaşa gittiklerini söyledi ve \"Abdurrahman bize korku namazı kıldırdı\" dedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 1246,
      "arabicNumber": 1246,
      "book": 4,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي الأَشْعَثُ بْنُ سُلَيْمٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ، قَالَ كُنَّا مَعَ سَعِيدِ بْنِ الْعَاصِ بِطَبَرِسْتَانَ فَقَامَ فَقَالَ أَيُّكُمْ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْخَوْفِ فَقَالَ حُذَيْفَةُ أَنَا فَصَلَّى بِهَؤُلاَءِ رَكْعَةً وَبِهَؤُلاَءِ رَكْعَةً وَلَمْ يَقْضُوا ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَا رَوَاهُ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ وَمُجَاهِدٌ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَعَبْدُ اللَّهِ بْنُ شَقِيقٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَيَزِيدُ الْفَقِيرُ وَأَبُو مُوسَى - قَالَ أَبُو دَاوُدَ رَجُلٌ مِنَ التَّابِعِينَ لَيْسَ بِالأَشْعَرِيِّ - جَمِيعًا عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَدْ قَالَ بَعْضُهُمْ فِي حَدِيثِ يَزِيدَ الْفَقِيرِ إِنَّهُمْ قَضَوْا رَكْعَةً أُخْرَى ‏.‏ وَكَذَلِكَ رَوَاهُ سِمَاكٌ الْحَنَفِيُّ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَذَلِكَ رَوَاهُ زَيْدُ بْنُ ثَابِتٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَكَانَتْ لِلْقَوْمِ رَكْعَةً رَكْعَةً وَلِلنَّبِيِّ صلى الله عليه وسلم رَكْعَتَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated Hudhayfah: Tha'labah ibn Zahdam said: We accompanied Sa'd ibn al-'As at Tabaristan. He stood and said: Which of you prayed along with the Messenger of Allah (ﷺ) in time of danger? Hudhayfah said: I then he led one section in one rak'ah and the other section in one rak'ah. They did not pray the second rak'ah by themselves. Abu Dawud: This tradition has been transmitted by 'Ubaid Allah b. 'Abd Allah and Mujahid on the authority of Ibn 'Abbas from the Prophet (ﷺ) in like manner. This has also been narrated by 'Abd Allah b. Shaqiq from Abu Hurairah from the Prophet (ﷺ). Yazid al-Faqir and Abu Musa also narrated this tradition from Jabir from the Prophet (ﷺ). Some of the narrators said in the version narrated by Yazid al-Faqir that they completed their second rak'ah. This has also been narrated by Simak al-Hanafi on the authority of Ibn 'Umar from the Prophet (ﷺ) something similar. Zaid b. Thabit also narrated from the Prophet (ﷺ) in like manner. This version adds: The people prayed on rak'ah and the Prophet (ﷺ) prayed two rak'ahs",
          "ur": "ثعلبہ بن زہدم کہتے ہیں کہ ہم لوگ سعید بن عاص کے ساتھ طبرستان میں تھے، وہ کھڑے ہوئے اور پوچھا: تم میں کس نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز خوف ادا کی ہے؟ تو حذیفہ رضی اللہ عنہ نے کہا: میں نے ( پھر حذیفہ نے ایک گروہ کو ایک رکعت پڑھائی، اور دوسرے کو ایک رکعت ) اور ان لوگوں نے ( دوسری رکعت کی ) قضاء نہیں کی۔ ابوداؤد کہتے ہیں: اور اسی طرح اسے عبیداللہ بن عبداللہ اور مجاہد نے ابن عباس رضی اللہ عنہما سے ابن عباس نے نبی اکرم صلی اللہ علیہ وسلم سے اور عبداللہ بن شفیق نے ابوہریرہ رضی اللہ عنہ سے اور ابوہریرہ نے نبی اکرم صلی اللہ علیہ وسلم سے، اور یزید فقیر اور ابوموسیٰ نے جابر رضی اللہ عنہ سے اور جابر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے۔ ابوداؤد کہتے ہیں: ابوموسیٰ تابعی ہیں، ابوموسیٰ اشعری نہیں ہیں۔ یزید الفقیر کی روایت میں بعض راویوں نے شعبہ سے یوں روایت کی ہے کہ انہوں نے دوسری رکعت قضاء کی تھی۔ اسی طرح اسے سماک حنفی نے ابن عمر رضی اللہ عنہما سے اور ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے۔ نیز اسی طرح اسے زید بن ثابت رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے، اس میں ہے: لوگوں کی ایک ایک رکعت ہوئی اور نبی اکرم صلی اللہ علیہ وسلم کی دو رکعتیں ہوئیں۔",
          "fr": "Rapporté par Hudhayfah : Tha’labah ibn Zahdam a dit : Nous avons accompagné Sa’d ibn al-‘As à Tabaristan. Il s’est levé et a dit : « Qui parmi vous a prié avec le Messager d’Allah ﷺ en temps de danger ? » Hudhayfah a répondu : « Moi. » Il a alors dirigé un groupe pour une unité, puis l’autre groupe pour une unité. Ils n’ont pas prié la seconde unité seuls. Abu Dawud : Ce récit a été transmis par ‘Ubaid Allah ibn ‘Abd Allah et Mujahid d’après Ibn Abbas, du Prophète ﷺ, de la même façon. Il a aussi été rapporté par ‘Abd Allah ibn Shaqiq d’après Abu Huraira, du Prophète ﷺ. Yazid al-Faqir et Abu Musa l’ont aussi rapporté de Jabir, du Prophète ﷺ. Certains narrateurs ont ajouté dans la version de Yazid al-Faqir qu’ils ont complété leur seconde unité. Simak al-Hanafi l’a aussi rapporté d’Ibn ‘Umar, du Prophète ﷺ, de façon similaire. Zaid ibn Thabit l’a aussi rapporté du Prophète ﷺ de la même manière. Cette version ajoute : Les gens ont prié une unité et le Prophète ﷺ en a prié deux",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepadaku [Al Asy'Ats Tsauri bin Sulaim] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam] dia berkata; \"Kami bersama Sa'id bin Al 'Ash di daerah Thabaristan, kemudian dia berdiri dan berkata \"Siapakah di antara kalian yang pernah mengerjakan shalat khauf bersama Rasulullah shallallahu 'alaihi wasallam?\" maka [Hudzaifah] menjawab; \"Aku, beliau mengerjakan shalat satu raka'at dengan satu kelompok, dan mengerjakan satu raka'at dengan kelompok yang lain, dan mereka tidak menambah (sendiri-sendiri).\" Abu Daud berkata; \"Demikian juga yang di riwayatkan ['Ubaidullah bin Abdullah] dan [Mujahid] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam. Dan [Abdullah bin Syaqiq] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Serta [Yazid Al Faqir] dan [Abu Musa]. Abu Daud berkata; \"-Abu Musa yang di maksud adalah seorang tabi'in, bukan (Abu Musa) Asy'ari seorang sahabat, semuanya dari [Jabir] dari Nabi shallallahu 'alaihi wasallam. Sebagian mereka berkata; dari Syu'bah dalam haditsnya Yazid Al Faqir, \"Mereka menyempurnakan satu raka'at lagi.\" Demikian juga yang di riwayatkan [Simak Al Hanafi] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam. Demikian juga yang di riwayatkan Zaid bin Tsabit dari Nabi shallallahu 'alaihi wasallam, dia berkata; \"…Untuk setiap kelompok, mengerjakan satu raka'at-satu raka'at, sedangkan Nabi shallallahu 'alaihi wasallam mengerjakan dua raka'at",
          "tr": "Sa'lebe b. Zehdem'den; demiştir kî: Taberistan'da Said b. el-Âs ile beraber bulunuyorduk. Kalktı \"Resûlullah (s.a.v.) ile beraber hanginiz korku namazı kıldı?\" dedi. Huzeyfe de: Ben, dedi ve her iki taifeye de birer rekat kıldırdı. (Daha sonra cemaat bu namazı) kaza etmediler, dedi. Ebû Dâvûd dedi ki; 1. Bu hadisi aynı şekilde Ubeydullah b. Ab­dullah ile Mucâhid de İbn Abbas vasıtasıyla Peygamber (s.a.v.)'den rivayet etmişlerdir. 2. Abdullah b. Şakîk de (bu hadisi) Ebû Hureyre vasıtasıyla Peygamber (s.a.v.)den rivayet etti. 3. Yezid el-Fakîr ile Ebû Musa[226] da; hepsi de Câbir vasıtasıyla Peygamber (s.a.v.)'den rivayet ettiler. 4. Bazıları \"Şu'be'den (gelen bir rivayette) Yezid el-Fakîr hadi­sinde (her iki) taife de (kılamadıkları) diğer rekatı kaza ettiler” (cüm­lesinin bulunduğunu) söylüyorlar. 5. Bu hadisi aynı şekilde Simâk el-Haneftde İbn Ömer vasıtasıy­le Peygamber (s, a.)'den rivayet etti. 6. Zeyd b. Sabit de Nebi (s.a.v.)’den nakletti (ve) dediki: \"Ce­maatin (kıldığı namaz) bir rekat Nebi (s.a.v.)'in (kıldığı namaz ise) iki rekat idi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 49
      },
      "narrator": {
        "en": "Hudhayfah"
      }
    },
    {
      "hadithNumber": 1247,
      "arabicNumber": 1247,
      "book": 4,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، وَسَعِيدُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ بُكَيْرِ بْنِ الأَخْنَسِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ فَرَضَ اللَّهُ تَعَالَى الصَّلاَةَ عَلَى لِسَانِ نَبِيِّكُمْ صلى الله عليه وسلم فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:Allah, the Exalted, prescribed prayer for you, through the tongue of your Prophet (ﷺ), four rak'ahs while resident, two rak'ahs while travelling and one rak'ah in time of danger",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ اللہ نے نبی اکرم صلی اللہ علیہ وسلم کی زبان سے تم پر حضر میں چار رکعتیں فرض کی ہیں اور سفر میں دو رکعتیں، اور خوف میں ایک رکعت۔",
          "fr": "Rapporté par Ibn ‘Abbas : Allah, le Très-Haut, vous a prescrit la prière, par la langue de votre Prophète ﷺ, en quatre unités quand vous êtes résidents, deux unités en voyage, et une unité en temps de danger",
          "id": "Telah menceritakan kepada kami [Musaddad] dan [Sa'id bin Manshur] keduanya berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Bukair bin Al Ahnas] dari [Mujahid] dari [Ibnu Abbas] dia berkata; \"Allah Ta'ala telah mewajibkan shalat lewat lisan Nabi kalian ketika menetap (tidak bepergian) sebanyak empat raka'at, di waktu bepergian dua raka'at dan dalam kondisi takut (dalam Perang) satu raka'at",
          "tr": "İbn Abbâs (r.a.)'dan; demiştir ki: Allah Teâlâ Peygamberinizin diliyle namazı size hazarda dört, seferde iki ve korku halinde de bir rekat olarak farz kıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (687)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 50
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1248,
      "arabicNumber": 1248,
      "book": 4,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَشْعَثُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم فِي خَوْفٍ الظُّهْرَ فَصَفَّ بَعْضَهُمْ خَلْفَهُ وَبَعْضَهُمْ بِإِزَاءِ الْعَدُوِّ فَصَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَانْطَلَقَ الَّذِينَ صَلَّوْا مَعَهُ فَوَقَفُوا مَوْقِفَ أَصْحَابِهِمْ ثُمَّ جَاءَ أُولَئِكَ فَصَلَّوْا خَلْفَهُ فَصَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَكَانَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَرْبَعًا وَلأَصْحَابِهِ رَكْعَتَيْنِ رَكْعَتَيْنِ ‏.‏ وَبِذَلِكَ كَانَ يُفْتِي الْحَسَنُ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ فِي الْمَغْرِبِ يَكُونُ لِلإِمَامِ سِتَّ رَكَعَاتٍ وَلِلْقَوْمِ ثَلاَثًا ثَلاَثًا ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ رَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَذَلِكَ قَالَ سُلَيْمَانُ الْيَشْكُرِيُّ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Narrated AbuBakrah: The Prophet (ﷺ) offered the noon prayer in time of danger. Some of the people formed a row behind him and others arrayed themselves against the enemy. He led them in two rak'ahs and then he uttered the salutation. Then those who were with him went away and took the position of their companions before the enemy. Then they came and prayed behind him. He led them in two rak'ahs and uttered the salutation. Thus the Messenger of Allah (ﷺ) offered four rak'ahs and his companions offered two rak'ahs. Al-Hasan used to give legal verdict on the authority of this tradition. Abu Dawud said: This will be so in the sunset prayer. The imam will offer six rak'ahs and the people three rak'ahs. Abu Dawud said: Yahya b. Abi Kathir narrated from Abu Salamah from Jabir from the Prophet (ﷺ) something similar. Sulaiman al-Yashkuri reported it from the Prophet (ﷺ) in like manner",
          "ur": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے خوف کی حالت میں ظہر ادا کی تو بعض لوگوں نے آپ کے پیچھے صف بندی کی اور بعض دشمن کے سامنے رہے، آپ نے انہیں دو رکعتیں پڑھائیں پھر سلام پھیر دیا، تو جو لوگ آپ کے ساتھ نماز میں تھے، وہ اپنے ساتھیوں کی جگہ جا کر کھڑے ہو گئے اور وہ لوگ یہاں آ گئے پھر آپ کے پیچھے انہوں نے نماز پڑھی تو آپ نے انہیں بھی دو رکعتیں پڑھائیں پھر سلام پھیرا، اس طرح رسول اللہ صلی اللہ علیہ وسلم کی چار رکعتیں اور صحابہ کرام کی دو دو رکعتیں ہوئیں، اور حسن بصری اسی کا فتویٰ دیا کرتے تھے۔ ابوداؤد کہتے ہیں: اور اسی طرح مغرب میں امام کی چھ، اور دیگر لوگوں کی تین تین رکعتیں ہوں گی۔ ابوداؤد کہتے ہیں: اسی طرح اسے یحییٰ بن ابی کثیر نے ابوسلمہ سے، ابوسلمہ نے جابر رضی اللہ عنہ سے اور جابر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے، اور اسی طرح سلیمان یشکری نے «عن جابر عن النبي صلی اللہ علیہ وسلم» کہا ہے۔",
          "fr": "Rapporté par Abu Bakrah : Le Prophète ﷺ a accompli la prière du midi en temps de danger. Certains se sont rangés derrière lui, d’autres se sont placés face à l’ennemi. Il les a dirigés pour deux unités, puis a fait la salutation. Ceux qui étaient avec lui sont partis prendre la place de leurs compagnons face à l’ennemi. Ensuite, ils sont venus prier derrière lui. Il les a dirigés pour deux unités et a fait la salutation. Ainsi, le Messager d’Allah ﷺ a prié quatre unités et ses compagnons en ont prié deux. Al-Hasan donnait un avis juridique basé sur ce récit. Abu Dawud a dit : Ce sera ainsi pour la prière du coucher du soleil : l’imam fera six unités et les gens trois unités. Abu Dawud a dit : Yahya ibn Abi Kathir a rapporté de Abu Salamah, de Jabir, du Prophète ﷺ, quelque chose de similaire. Sulaiman al-Yashkuri l’a aussi rapporté du Prophète ﷺ de la même manière",
          "id": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al Asy'Ats Tsauri] dari [A Hasan] dari [Abu Bakrah] dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah mengerjakan shalat khauf pada waktu Dluhur, sebagian kelompok berbaris di belakang beliau dan sebagian kelompok yang lain menghadapi musuh, beliau shalat dua raka'at dengan mereka (kelompok pertama), kemudian salam. Lalu kelompok yang tadinya shalat dengan beliau pindah menempati tempat para sahabat mereka (kelompok kedua), kemudian mereka (kelompok kedua) datang dan shalat di belakang beliau, maka beliau shalat dua raka'at bersama mereka, lalu salam. Sehingga Rasulullah shallallahu 'alaihi wasallam shalat empat raka'at, sementara para sahabat beliau shalat dua raka'at-dua raka'at.\" Demikianlah yang di fatwakan oleh Al Hasan. Abu Daud mengatakan; \"Demikian pula dalam shalat Maghrib, maka imam enam raka'at, sementara setiap kelompok tiga raka'at-tiga raka'at.\" Abu Daud mengatakan; \"Demikian pula yang di riwayatkan oleh [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam. [Sulaiman Al Yasykuri] berkata; dari [Jabir] dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Ebu Bekre (r.a.)'den; demiştir ki: Nebi (s.a.v.) korkulu bir anda Öğle namazı kıldırdı. (Cemaatin) bir kısmını arkasında, bir kısmını da düşman karşısında saf tutturdu. (Önce arkasındakilere) iki rekat kıldırdıktan sonra selâm verdi. Kendisiyle birlikte namaz kılanlar gidip (düşman karşısında duran) arkadaşlarının yerine durdular. Sonra onlar gelip (Resûlullah'ın) arkasında namaza durdular, onlara da iki rekat namaz kıldırdı. Sonra selam verdi. Böylece Resûlullah (s.a.v.) dört, ashabı ise iki rekat (na­maz kılmış) oldu. el-Hasen (el-Basrî) de böyle fetva verirdi. Ebû Dâvûd dedi ki: Akşam namazı da yine böyledir. İmam için altı, cemaat için de üçer rekat (kılınır). Ebû Dâvûd dedi ki: Bu hadisi aynı şekilde Yahya b. Ebî Kesîr de Ebû Seleme ve Câbir vasıtasıyla Pey amber (s m.)'den rivayet etti. Süleyman el-Yeşkuri de aynı şekilde; \"Câbir'den o da Peygamber (s.a.v.) 'den \" diye rivayet etti. Diğer tahric: Nesâî, havf"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 51
      },
      "narrator": {
        "en": "AbuBakrah"
      }
    },
    {
      "hadithNumber": 1249,
      "arabicNumber": 1249,
      "book": 4,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنِ ابْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ، عَنْ أَبِيهِ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى خَالِدِ بْنِ سُفْيَانَ الْهُذَلِيِّ - وَكَانَ نَحْوَ عُرَنَةَ وَعَرَفَاتٍ - فَقَالَ ‏ \"‏ اذْهَبْ فَاقْتُلْهُ ‏\"‏ ‏.‏ قَالَ فَرَأَيْتُهُ وَحَضَرَتْ صَلاَةُ الْعَصْرِ فَقُلْتُ إِنِّي لأَخَافُ أَنْ يَكُونَ بَيْنِي وَبَيْنَهُ مَا إِنْ أُؤَخِّرُ الصَّلاَةَ فَانْطَلَقْتُ أَمْشِي وَأَنَا أُصَلِّي أُومِئُ إِيمَاءً نَحْوَهُ فَلَمَّا دَنَوْتُ مِنْهُ قَالَ لِي مَنْ أَنْتَ قُلْتُ رَجُلٌ مِنَ الْعَرَبِ بَلَغَنِي أَنَّكَ تَجْمَعُ لِهَذَا الرَّجُلِ فَجِئْتُكَ فِي ذَاكَ ‏.‏ قَالَ إِنِّي لَفِي ذَاكَ فَمَشَيْتُ مَعَهُ سَاعَةً حَتَّى إِذَا أَمْكَنَنِي عَلَوْتُهُ بِسَيْفِي حَتَّى بَرَدَ ‏.‏",
        "translations": {
          "en": "Narrated 'Abd Allah b. Unais:The Messenger of Allah (ﷺ) sent me to Khalid b. Sufyan al-Hudhail. This was towards 'Uranah and 'Arafat. He (the Prophet) said: Go and kill him. I saw him when the time of the afternoon prayer had come. I said: I am afraid if a fight takes place between me and him (Khalid b. Sufyan), that might delay the prayer. I proceeded walking towards him while I was praying by making a sign. When I reached near him, he said to me: Who are you ? I replied: A man from the Arabs; it came to me that you were gathering (any army) for this man (i.e. Prophet). Hence I came to you in connection with this matter. He said: I am (engaged) in this (work). I then walked along with him for a while ; when it became convenient for me, I dominated him with my sword until he became cold (dead)",
          "ur": "عبداللہ بن انیس رضی اللہ عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے خالد بن سفیان ہذلی کی طرف بھیجا اور وہ عرنہ و عرفات کی جانب تھا تو فرمایا: جاؤ اور اسے قتل کر دو ، عبداللہ کہتے ہیں: میں نے اسے دیکھ لیا عصر کا وقت ہو گیا تھا تو میں نے ( اپنے جی میں ) کہا اگر میں رک کر نماز میں لگتا ہوں تو اس کے اور میرے درمیان فاصلہ ہو جائے گا، چنانچہ میں اشاروں سے نماز پڑھتے ہوئے مسلسل اس کی جانب چلتا رہا، جب میں اس کے قریب پہنچا تو اس نے مجھ سے پوچھا: تم کون ہو؟ میں نے کہا: عرب کا ایک شخص، مجھے معلوم ہوا ہے کہ اس شخص ( یعنی محمد صلی اللہ علیہ وسلم سے مقابلے ) کے لیے تم ( لوگوں کو ) جمع کر رہے ہو ۱؎ تو میں اسی سلسلے میں تمہارے پاس آیا ہوں، اس نے کہا: ہاں میں اسی کوشش میں ہوں، چنانچہ میں تھوڑی دیر اس کے ساتھ چلتا رہا، جب مجھے مناسب موقع مل گیا تو میں نے اس پر تلوار سے وار کر دیا اور وہ ٹھنڈا ہو گیا۔",
          "fr": "Rapporté par ‘Abd Allah ibn Unais : Le Messager d’Allah ﷺ m’a envoyé vers Khalid ibn Sufyan al-Hudhail. C’était du côté de ‘Uranah et ‘Arafat. Il (le Prophète) a dit : « Va et tue-le. » Je l’ai vu alors que le temps de la prière de l’après-midi était arrivé. Je me suis dit : « Si un combat a lieu entre lui et moi (Khalid ibn Sufyan), cela pourrait retarder la prière. » J’ai donc avancé vers lui en priant par des gestes. Quand je suis arrivé près de lui, il m’a dit : « Qui es-tu ? » J’ai répondu : « Un homme des Arabes ; j’ai appris que tu rassemblais (une armée) contre cet homme (le Prophète). Je suis donc venu à toi pour cette raison. » Il a dit : « Oui, je m’en occupe. » J’ai marché un moment avec lui, puis, quand j’en ai eu l’occasion, je l’ai frappé avec mon épée jusqu’à ce qu’il meure",
          "id": "Telah menceritakan kepada kami [Abu Ma'mar Abdullah bin 'Amru] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin ja'far] dari [Ibnu Abdullah bin Unais] dari [ayahnya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengutusku untuk menemui Khalid bin Sufyan Al Hudzali, sedangkan dia berada di daerah antara 'Uranah dan 'Arafat, beliau bersabda: \"Pergilah dan bunuhlah dia.\" Abdullah bin Unais berkata; \"Maka aku dapat melihatnya sedangkan waktu shalat Ashar telah tiba, aku berkata (dalam dalam hati);; \"Aku khawatir jika aku mengakhirkan shalat Ashar, akan terjadi sesuatu antara aku dengan dia.\" Maka aku terus saja berjalan sambil mengerjakan shalat dengan memberi isyarat, ketika jarakku dengannya semakin dekat, dia berkata kepadaku; \"Siapakah kamu?\" jawabku; \"Aku adalah seseorang dari Arab, telah sampai kepadaku bahwa dirimu telah mengumpulkan (orang-orang) untuk memerangi laki-laki ini, maka aku datang untuk urusan tersebut. ' Dia berkata; \"Memang aku berhajat seperti itu.\" Sesaat kemudian aku jalan-jalan bersamanya, ketika keadaan memungkinkan bagiku (untuk membunuhnya), maka aku langsung mengayunkan pedangku menebasnya hingga dia mati terkapar",
          "tr": "Abdullah b. Üneys (r.a.)'den; demiştir ki: Resûlullah (s.a.v.) beni Ürene ve Arafat taraflarında bulunan Halid b. Süfyan el-Hüzelî'ye gönderdi ve \"git onu öldür\" buyurdu. Abdullah sözlerine devamla dedi ki: \"Onu ikindi namazı (vakti) girince gördüm ve (kendi kendime); \"bununla benim aramda namazı (vaktin dışına) ertelememi gerektiren bir şey olmasından korkarım\" deyip imâ ile namaz kılarak ona doğru yürüyüp gittim. Kendisine yaklaşınca bana; \"Sen kimsin? \"dedi. Ben: Arablardan biriyim. Duyduğuma göre (Peygamberim diyen şu) zât (aleyhine kuvvet) topluyor(muş)sun; dedim. O da: Evet bununla meşgulüm, dedi. Onunla bir süre yürüdüm. Fırsatını bulunca kılıcımı çekip işini bitirdim"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 4,
        "hadith": 52
      },
      "narrator": {
        "en": "'Abd Allah b. Unais"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "48KB"
  }
}