{
  "collection": "abudawud",
  "book": 33,
  "name": {
    "arabic": "كتاب Hot Baths (Kitab Al-Hammam)",
    "transliteration": "hot baths (kitab al-hammam)",
    "translation": "Hot Baths (Kitab Al-Hammam)"
  },
  "totalHadith": 11,
  "hadithNumberRange": {
    "first": 4009,
    "last": 4019
  },
  "content": [
    {
      "hadithNumber": 4009,
      "arabicNumber": 4009,
      "book": 33,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ أَبِي عُذْرَةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوهَا فِي الْمَيَازِرِ ‏.‏",
        "translations": {
          "en": "Narrated Aisha, Ummul Mu'minin: The Messenger of Allah (ﷺ) forbade to enter the hot baths. He then permitted men to enter them in lower garments",
          "ur": "ام المؤمنین عائشہ رضی اللہ عنہا کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حمامات ( غسل خانوں ) میں داخل ہونے سے منع فرمایا، پھر آپ نے مردوں کو تہبند باندھ کر جانے کی رخصت دی۔",
          "fr": "Rapporté par Aishah (la mère des croyants) رضي الله عنها : Le Messager d’Allah ﷺ a interdit d’entrer dans les bains chauds. Il a ensuite permis aux hommes d’y entrer à condition de porter un vêtement couvrant le bas du corps",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Abdullah bin Syaddad] dari [Abu 'Udzrah] dari [Aisyah] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam melarang memasuki tempat-tempat pemandian umum. Dan beliau memberi keringanan bagi kaum laki-laki dengan syarat mengenakan kain sarung",
          "tr": "Âişe (ranha)'dan rivayet olunduğuna göre; Resulullah (s.a.v), (önceleri) hamamlara girmeyi yasaklamış, sonra erkeklerin peştemalli olarak oralara girmelerine izin vermiştir. Bu hadis; İbn-i mace, edeb; Tirmizi, zdeb: Darimi, isti'zan; Ahmed b. Hanbel III 339 VI. 132.139.173.179.267. de de var"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 1
      },
      "narrator": {
        "en": "Aisha, Ummul Mu'minin"
      }
    },
    {
      "hadithNumber": 4010,
      "arabicNumber": 4010,
      "book": 33,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، - جَمِيعًا - عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، - قَالَ ابْنُ الْمُثَنَّى - عَنْ أَبِي الْمَلِيحِ، قَالَ دَخَلَ نِسْوَةٌ مِنْ أَهْلِ الشَّامِ عَلَى عَائِشَةَ - رضى الله عنها - فَقَالَتْ مِمَّنْ أَنْتُنَّ قُلْنَ مِنْ أَهْلِ الشَّامِ ‏.‏ قَالَتْ لَعَلَّكُنَّ مِنَ الْكُورَةِ الَّتِي تَدْخُلُ نِسَاؤُهَا الْحَمَّامَاتِ قُلْنَ نَعَمْ ‏.‏ قَالَتْ أَمَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنِ امْرَأَةٍ تَخْلَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِهَا إِلاَّ هَتَكَتْ مَا بَيْنَهَا وَبَيْنَ اللَّهِ تَعَالَى ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا حَدِيثُ جَرِيرٍ وَهُوَ أَتَمُّ وَلَمْ يَذْكُرْ جَرِيرٌ أَبَا الْمَلِيحِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Narrated Aisha, Ummul Mu'minin: AbulMalih said: Some women of Syria came to Aisha. She asked them: From whom are you? They replied: From the people of Syria. She said: Perhaps you belong to the place where women enter hot baths (for washing ). The said: Yes. She said: I heard the Messenger of Allah (ﷺ) say: If a woman puts off her clothes in a place other than her house, she tears the veil between her and Allah, the Exalted. Abu Dawud said: This is the tradition narrated by Jarir, and it is more perfect. Jarir did not mention Abu al-Malih. He said (on the authority of 'A'ishah) that the Messenger of Allah (ﷺ) said",
          "ur": "ابوالملیح کہتے ہیں اہل شام کی کچھ عورتیں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آئیں تو انہوں نے ان سے پوچھا: تم کہاں کی ہو؟ ان سب نے کہا: ہم اہل شام سے تعلق رکھتی ہیں، یہ سن کر وہ بولیں: شاید تم اس علاقہ کی ہو جہاں کی عورتیں بھی غسل خانوں میں داخل ہوتی ہیں، ان سب نے کہا: ہاں، ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: سنو! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جو بھی عورت اپنے کپڑے اپنے گھر کے علاوہ کہیں اور اتارتی ہے تو وہ اپنے پردے کو جو اس کے اور اللہ کے درمیان ہے پھاڑ دیتی ہے ۔ ابوداؤد کہتے ہیں: یہ جریر کی روایت ہے جو زیادہ کامل ہے اور جریر نے ابوالملیح کا ذکر نہیں کیا ہے انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے۔",
          "fr": "Rapporté par Aishah (la mère des croyants) رضي الله عنها : AbulMalih a dit : Des femmes de Syrie sont venues voir Aishah. Elle leur a demandé : « Vous venez d’où ? » Elles ont répondu : « Nous venons de Syrie. » Elle a dit : « Peut-être venez-vous de l’endroit où les femmes entrent dans les bains chauds ? » Elles ont répondu : « Oui. » Elle a dit : « J’ai entendu le Messager d’Allah ﷺ dire : “Si une femme enlève ses vêtements ailleurs que dans sa maison, elle brise le voile entre elle et Allah, le Très-Haut.” » Abu Dawud a dit : C’est la version rapportée par Jarir, et elle est plus complète. Jarir n’a pas mentionné Abu al-Malih. Il a dit (d’après ‘Aishah) que le Messager d’Allah ﷺ a dit cela",
          "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah] telah menceritakan kepada kami [Jarir]. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] semuanya berasal dari [Manshur] dari [Salim bin Abu Al Ja'dan], [Ibnu Al Mutsanna] menyebutkan dari [Abu Al Malih] ia berkata, \"Beberapa wanita Syam menemui [Aisyah] radliallahu 'anhuma, Aisyah kemudian bertanya, \"Dari manakah kalian?\" Mereka menjawab, \"Dari penduduk Syam.\" Aisyah berkata, \"Kemungkinan kalian berasal dari Al Kurah yang para wanitanya biasa memasuki pemandian umum?\" Mereka menjawab, Ya. Aisyah lalu berkata, \"Ketahuilah, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang wanita yang melepas pakaiannya di luar rumah kecuali ia telah melepaskan tabir antara dirinya dengan Allah Ta'ala.\" Abu Daud berkata, \"Ini adalah hadits Jarir, dan hadits ini lebih sempurna. Namun ia tidak menyebutkan nama Abu Al Malih. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda",
          "tr": "Ebu'1-Melîh'den rivayet olunmuştur; dedi ki: Şam halkından bazı kadınlar Aişe (ranha)'nın yanına geldiler. (Hz. Aişe onlara): \"Siz kimlerdensiniz?\" diye sordu. \"Şam halkındanız, cevabını verdiler. (Bu cevabı alan Hz. Aişe): \"Herhalde siz, kadınları hamam'a giren şehrin halkındansınız, dedi. \"Evet, cevabını verdiler. (Bunun üzerine Hz. Aişe): \"Şunu iyi bilin ki ben Resulullah (s.a.v)'i \"Kendi evinin dışında bir yerde elbisesini soyan bir kadın yoktur ki, Allah ile kendi arasındaki perdeyi yırtmış olmasın. \" Ebu Davud dedi ki: Bu hadis (in metni) Cerir'indir, ve bu metin (Muhammed îbn Müsennâ'nın rivayet ettiği metinden) daha geniştir. Aynca Cerîr (bu hadisin senedinde bulunan) Ebu Melîh'i anmamıştır. (Ebû Melih'i atlayıp) \"Resulullah (s.a.v) buyurur ki\" diyerek doğrudan doğruya Hz. Nebi'den rivayet etmiştir. Bu hadis; Tirmizi, edeb; ibn-i mâce edeb: Dârimi, istizan; Ahmed b. Hanbel 4l. 173. 199 267.362. dede var"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 2
      },
      "narrator": {
        "en": "Aisha, Ummul Mu'minin"
      }
    },
    {
      "hadithNumber": 4011,
      "arabicNumber": 4011,
      "book": 33,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّهَا سَتُفْتَحُ لَكُمْ أَرْضُ الْعَجَمِ وَسَتَجِدُونَ فِيهَا بُيُوتًا يُقَالُ لَهَا الْحَمَّامَاتُ فَلاَ يَدْخُلَنَّهَا الرِّجَالُ إِلاَّ بِالأُزُرِ وَامْنَعُوهَا النِّسَاءَ إِلاَّ مَرِيضَةً أَوْ نُفَسَاءَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: After some time the lands of the non-Arabs will be conquered for you, and there you will find houses called hammamat (hot baths). so men should not enter them (to wash) except in lower garments, and forbid the women to enter them except a sick or one who is in a child-bed",
          "ur": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب عجم کی سر زمین تمہارے لیے فتح کر دی جائے گی اور اس میں تمہیں ایسے گھر ملیں گے جنہیں حمام کہا جائے گا تو اس میں مرد بغیر تہ بند کے داخل نہ ہوں اور عورتوں کو ان میں جانے سے روکو سوائے بیمار یا زچہ کے ۔",
          "fr": "Rapporté par Abdullah ibn Amr ibn al-‘As رضي الله عنه : Le Prophète ﷺ a dit : « Après un certain temps, les terres des non-Arabes vous seront ouvertes, et là-bas vous trouverez des maisons appelées hammamat (bains chauds). Que les hommes n’y entrent (pour se laver) qu’en portant un vêtement couvrant le bas du corps, et interdisez aux femmes d’y entrer, sauf si elles sont malades ou en période postnatale. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abdurrahman bin Ziyad bin An'am] dari [Abdurrahman bin Rafi'] dari [Abdullah bin 'Amru], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya akan ditaklukkan untuk kalian negeri orang-orang 'ajam (non Arab), dan di dalamnya akan kalian dapati beberapa bangunan yang disebut pemandian. Maka orang laki-laki tidak boleh memasukinya kecuali dengan memakai sarung, dan laranglah para wanita untuk memasukinya kecuali wanita yang sakit atau para wanita yang nifas",
          "tr": "Abdullah b. Ömer'den rivayet olunduğuna göre; Resulullah (s.a.v) şöyle buyurmuştur: \"Size acem ülkesini fethetmek müyesser olacaktır ve sizler orada hamam denilen (bir takım) evler bulacaksınız. Sakın oralara erkekler peştemalsız olarak girmesinler. Kadınların da oraya girmelerini önleyiniz. Ancak hasta ve lohusa olan kadınlar müstesna”"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 3
      },
      "narrator": {
        "en": "Abdullah ibn Amr ibn al-'As"
      }
    },
    {
      "hadithNumber": 4012,
      "arabicNumber": 4012,
      "book": 33,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ نُفَيْلٍ، حَدَّثَنَا زُهَيْرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ الْعَرْزَمِيِّ، عَنْ عَطَاءٍ، عَنْ يَعْلَى، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَغْتَسِلُ بِالْبَرَازِ بِلاَ إِزَارٍ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ حَيِيٌّ سِتِّيرٌ يُحِبُّ الْحَيَاءَ وَالسَّتْرَ فَإِذَا اغْتَسَلَ أَحَدُكُمْ فَلْيَسْتَتِرْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Ya'la: The Messenger of Allah (ﷺ) saw a man washing in a public place without a lower garment. So he mounted the pulpit, praised and extolled Allah and said: Allah is characterised by modesty and concealment. So when any of you washes, he should conceal himself",
          "ur": "یعلیٰ بن امیہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو بغیر تہ بند کے ( میدان میں ) نہاتے دیکھا تو آپ منبر پر چڑھے اور اللہ کی حمد و ثنا کی پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ حیاء دار ہے پردہ پوشی کرنے والا ہے اور حیاء اور پردہ پوشی کو پسند فرماتا ہے لہٰذا جب تم میں سے کوئی نہائے تو ستر کو چھپا لے ۔",
          "fr": "Rapporté par Ya’la رضي الله عنه : Le Messager d’Allah ﷺ a vu un homme se laver dans un lieu public sans vêtement couvrant le bas du corps. Il est alors monté sur le minbar, a loué et glorifié Allah, puis a dit : « Allah est caractérisé par la pudeur et le fait de couvrir. Donc, lorsque l’un d’entre vous se lave, qu’il se couvre. »",
          "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Nufail] telah menceritakan kepada kami [Zuhair] dari [Abdul Malik bin Abu Sulaiman Al 'Arzami] dari ['Atha] dari [Ya'la], bahwa Rasulullah shallallahu 'alaihi wasallam melihat seorang laki-laki mandi di tanah lapang tanpa memakai sarung. Kemudian beliau naik mimbar, lalu memuji Allah dan bersabda: \"Sesungguhnya Allah 'azza wajalla Maha Pemalu dan Tertutup, Dia menyukai sifat malu dan tertutup. Apabila salah seorang di antara kalian mandi, maka hendaknya ia menutupi dirinya.\" Telah menceritakan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari [Abdul Malik bin Abu Sulaiman] dari ['Atha] dari [Shafwan bin Ya'la] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini.\" Abu Daud berkata, \"Hadits yang pertama lebih sempurna",
          "tr": "Ya'lâ'dan rivayet olunduğuna göre; Resulullah (s.a.v). kırda peştemalsiz olarak yıkanan bir adam görmüş ve minbere çıkıp Allah'a hamd ve senada bulunduktan sonra: \"Muhakkak ki Aziz ve Celîl olan Allah utangaçtır, (ayıplara) kapalıdır, utanmayı ve örtünmeyi sever, Binaenaleyh biriniz yıkandığı zaman örtünsün\" buyurmuştur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 4
      },
      "narrator": {
        "en": "Ya'la"
      }
    },
    {
      "hadithNumber": 4013,
      "arabicNumber": 4013,
      "book": 33,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ ‏.‏ قَالَ أَبُو دَاوُدَ الأَوَّلُ أَتَمُّ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by Ya'la from the Prophet (ﷺ) through a different chain of narrators. Abu Dawud said:The former is more perfect",
          "ur": "اس سند سے بھی صفوان بن یعلیٰ اپنے والد سے اور وہ نبی اکرم صلی اللہ علیہ وسلم سے یہی حدیث روایت کرتے ہیں۔ ابوداؤد کہتے ہیں: پہلی روایت زیادہ کامل ہے۔",
          "fr": "La tradition mentionnée ci-dessus a aussi été transmise par Ya’la du Prophète ﷺ par une autre chaîne de rapporteurs. Abu Dawud a dit : La première version est plus complète",
          "tr": "Bu (4012) hadis (bir de) Ya'la'dan bir başka senetle rivayet olunmuştur. Ebu Davud dedi ki; Önceki (senetle gelen rivayet) daha geniştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 4014,
      "arabicNumber": 4014,
      "book": 33,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ جَرْهَدٍ، عَنْ أَبِيهِ، - قَالَ كَانَ جَرْهَدٌ هَذَا مِنْ أَصْحَابِ الصُّفَّةِ - قَالَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَنَا وَفَخِذِي مُنْكَشِفَةٌ فَقَالَ ‏ \"‏ أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Jarhad: The Messenger of Allah (ﷺ) sat with us and my thigh was uncovered. He said: Do you not know that thigh is a private part ?",
          "ur": "زرعہ بن عبدالرحمٰن بن جرہد اپنے والد سے روایت کرتے ہیں، وہ کہتے ہیں جرہد اصحاب صفہ میں سے تھے وہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس بیٹھے اور میری ران کھلی ہوئی تھی تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تجھے معلوم نہیں کہ ران ستر ہے ( اس کو چھپانا چاہیئے ) ۔",
          "fr": "Rapporté par Jarhad رضي الله عنه : Le Messager d’Allah ﷺ s’est assis avec nous et ma cuisse était découverte. Il a dit : « Ne sais-tu pas que la cuisse fait partie de l’intimité ? »",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu An Nadlr] dari [Zur'ah bin Abdurrahman bin Jarhad] dari [Ayahnya] ia berkata, \" [Jarhad] adalah termasuk para penghuni Shuffah. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam duduk di antara kami, sementara pahaku terbuka. Beliau lalu bersabda: \"Sesungguhnya paha adalah aurat",
          "tr": "(Suffe ashabından olan Abdurrahmân b. Cerhed'in) babasından rivayet olunmuştur; dedi ki: Benim uyluklarım açık bir halde iken Resulullah (s.a.v) (gelip) yanımıza oturdu ve (bana); Uyluğun avret olduğunu bilmiyor musun?\" dedi. Bu hadis, Ahmed b. Hanbel III 478. de de var. İzah 4015 te"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 6
      },
      "narrator": {
        "en": "Jarhad"
      }
    },
    {
      "hadithNumber": 4015,
      "arabicNumber": 4015,
      "book": 33,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ، حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أُخْبِرْتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَكْشِفْ فَخِذَكَ وَلاَ تَنْظُرْ إِلَى فَخِذِ حَىٍّ وَلاَ مَيِّتٍ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا الْحَدِيثُ فِيهِ نَكَارَةٌ ‏.‏",
        "translations": {
          "en": "Narrated Ali ibn AbuTalib: The Prophet (ﷺ) said: Do not uncover you thigh, and do not look at the thigh of the living and the dead. Abu Dawud said: This tradition disagrees with the generally reported traditions (nakarah)",
          "ur": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنی ران نہ کھولو اور کسی زندہ یا مردہ کی ران کو نہ دیکھو ۔ ابوداؤد کہتے ہیں: اس حدیث میں نکارت ہے۔",
          "fr": "Rapporté par Ali ibn Abu Talib رضي الله عنه : Le Prophète ﷺ a dit : « Ne découvre pas ta cuisse, et ne regarde pas la cuisse d’une personne vivante ou morte. » Abu Dawud a dit : Cette tradition diffère des traditions généralement rapportées (nakarah)",
          "id": "Telah menceritakan kepada kami [Ali bin Sahl Ar Ramli] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] ia berkata; aku mendapat kabar dari [Habib bin Abu Tsabit] dari ['Ashim bin Dlamrah] dari [Ali] radliallahu 'anhu, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah engkau buka pahamu, dan jangan engkau melihat kepada paha orang yang hidup maupun yang mati!\" Abu Daud berkata, \"Dalam hadits ini terdapat sesuatu yang diingkari",
          "tr": "Ali (r.a.)!dan rivayet edildiğine göre; Resulullah (s.a.v.): \"Uyluğunu açma, dirinin veya ölünün uyluğuna bakma\" buyurmuştur Ebû Dâvûd dedi ki: Bu hadiste münkerlik vardır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Very Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Very Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 7
      },
      "narrator": {
        "en": "Ali ibn AbuTalib"
      }
    },
    {
      "hadithNumber": 4016,
      "arabicNumber": 4016,
      "book": 33,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الأُمَوِيُّ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ حَمَلْتُ حَجَرًا ثَقِيلاً فَبَيْنَا أَمْشِي فَسَقَطَ عَنِّي ثَوْبِي فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خُذْ عَلَيْكَ ثَوْبَكَ وَلاَ تَمْشُوا عُرَاةً ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Al-Miswar b. Makhramah:I lifted a heavy stone. While I was walking my garment fell down. The Messenger of Allah (ﷺ) said to me: Take you garment upon you, and do not walk naked",
          "ur": "مسور بن مخرمہ رضی اللہ عنہ کہتے ہیں کہ میں ایک بھاری پتھر اٹھائے ہوئے چل رہا تھا کہ اسی دوران میرا کپڑا ( تہبند میرے جسم سے کھل کر ) گر پڑا تو مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنا کپڑا اٹھا کر باندھ لو اور ننگے نہ چلو ۔",
          "fr": "Rapporté par Al-Miswar b. Makhramah رضي الله عنه : J’ai soulevé une pierre lourde. En marchant, mon vêtement est tombé. Le Messager d’Allah ﷺ m’a dit : « Remets ton vêtement sur toi et ne marche pas nu. »",
          "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Yahya bin Sa'id Al Umawi] dari [Utsman bin Hakim] dari [Abu Umamah bin Sahl] dari [Al Miswar bin Makhramah] ia berkata, \"Saat berjalan membawa batu berat, pakaianku terjatuh. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Ambillah pakaianmu dan jangan berjalan dalam keadaan telanjang",
          "tr": "el-Misver b. Mahreme'den rivayet olunmuştur; dedi ki: Ağır bir taş taşıyordum, taşıyıp giderken (etekliğim çözülüp) peştemalim düşüverdi. Bunun üzerine Resulullah (s.a.v) bana (hitaben); \"Elbiseni al, (halkın karşısında) çıplak geçmeyiniz\" buyurdu. Bu hadis, Müslîm hayz da da var. İzah 4019 da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (341)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 8
      },
      "narrator": {
        "en": "Al-Miswar b. Makhramah"
      }
    },
    {
      "hadithNumber": 4017,
      "arabicNumber": 4017,
      "book": 33,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، نَحْوَهُ عَنْ بَهْزِ بْنِ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ ‏\"‏ احْفَظْ عَوْرَتَكَ إِلاَّ مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِذَا كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ قَالَ ‏\"‏ إِنِ اسْتَطَعْتَ أَنْ لاَ يَرَيَنَّهَا أَحَدٌ فَلاَ يَرَيَنَّهَا ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِذَا كَانَ أَحَدُنَا خَالِيًا قَالَ ‏\"‏ اللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ مِنَ النَّاسِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Bahz b. Hakim said that his father told on the authority of his grandfather:I said: Messenger of Allah, from whom should we conceal our private parts and to whom can we show? He replied: conceal your private parts except from your wife and from whom your right hands possess (slave-girls). I then asked: Messenger of Allah, (what should we do), if the people are assembled together? He replied: If it is within your power that no one looks at it, then no one should look at it. I then asked: Messenger of Allah if one of us is alone, (what should he do)? He replied: Allah is more entitled than people that bashfulness should be shown to him",
          "ur": "معاویہ بن حکیم رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! ہم اپنا ستر کس سے چھپائیں اور کس سے نہ چھپائیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ستر سب سے چھپاؤ سوائے اپنی بیوی اور اپنی لونڈیوں کے وہ کہتے ہیں: میں نے عرض کیا: اللہ کے رسول! جب لوگ ملے جلے ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم سے ہو سکے کہ تمہارا ستر کوئی نہ دیکھے تو اسے کوئی نہ دیکھے وہ کہتے ہیں: میں نے عرض کیا: اللہ کے رسول! جب ہم میں سے کوئی تنہا خالی جگہ میں ہو؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: لوگوں کے بہ نسبت اللہ زیادہ حقدار ہے کہ اس سے شرم کی جائے ۔",
          "fr": "Bahz b. Hakim a rapporté que son père tenait cela de son grand-père رضي الله عنهم : J’ai dit : « Messager d’Allah, devant qui devons-nous cacher notre intimité et à qui pouvons-nous la montrer ? » Il a répondu : « Cache ton intimité sauf devant ta femme et celles que ta main droite possède (esclaves). » J’ai demandé : « Et si les gens sont rassemblés ? » Il a répondu : « Si tu peux faire en sorte que personne ne la voie, alors que personne ne la voie. » J’ai demandé : « Et si l’un de nous est seul ? » Il a répondu : « Allah est plus digne que les gens qu’on ait de la pudeur devant Lui. »",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] berkata, telah menceritakan kepada kami [Bapakku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Basysyar] berkata, telah menceritakan kepada kami [Yahya] sebagaimana dalam riwayatnya, dari [Bahz bin Hakim] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Aku bertanya, \"Wahai Rasulullah, tentang aurat kami, siapakah yang boleh kami perlihatkan dan siapa yang tidak boleh?\" beliau menjawab: \"Jagalah auratmu kecuali kepada isteri atau budak yang kamu miliki.\" Ia berkata, \"Aku bertanya, \"Wahai Rasulullah, bagaimana dengan suatu kaum saling bercampur dalam satu tempat (yang mereka saling melihat aurat antara satu dengan yang lain)?\" beliau menjawab: \"Jika kamu mampu, maka jangan sampai ada seorang pun yang melihatnya.\" Ia berkata, \"Aku bertanya, \"Wahai Rasulullah, bagaimana jika salah seorang dari kami sedang sendiri?\" beliau menjawab: \"Allah lebih berhak untuk kamu malu darinya dari pada manusia",
          "tr": "Bühz b. Hakîm'in dedesi (Muaviye, b. Hayde)'den rivayet olunmuştur;) dedi ki: (Nebi s.a.v.'e); \"Ey Allah'ın Resulü, avret yerlerimizin neresini örtüp neresini (açık) bırakacağız? diye sordum. \"Karından ve sahip olduğun cariyenden başkasından avredini koru\" buyurdu. Ey Allah'ın Resulü, bir topluluk birbirlerinden (oluşan yakın akrabadan) ise (yine) de (hüküm böyle midir?) dedim. \"Avretini hiçbir kimsenin görmemesine gücün yetiyorsa (gücünü kullan da) onu kimse görmesin\" buyurdu. Ey Allah Resulü, birimiz yalnız başına olunca da (yine hüküm böyle midir)? dedim. \"Allah kendisinden utanılmaya insanlardan daha müstehaktır\", buyurdu. Bu hadis; Tirmizi, edeb: Ahmed b. Hanbel. III-5. tede var. İzah 4019 da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 4018,
      "arabicNumber": 4018,
      "book": 33,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ الرَّجُلُ إِلَى عُرْيَةِ الرَّجُلِ وَلاَ الْمَرْأَةُ إِلَى عُرْيَةِ الْمَرْأَةِ وَلاَ يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي ثَوْبٍ وَاحِدٍ وَلاَ تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي ثَوْبٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuSa'id al-Khudri: The Prophet (ﷺ) said: A man should not look at the private parts of another man, and a woman should not look at the private parts of another woman. A man should not lie with another man without wearing lower garment under one cover; and a woman should not be lie with another woman without wearing lower garment under one cover",
          "ur": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کوئی مرد کسی مرد کے ستر کو نہ دیکھے اور کوئی عورت کسی عورت کے ستر کو نہ دیکھے اور نہ کوئی مرد کسی مرد کے ساتھ ایک کپڑے میں لیٹے اور نہ کوئی عورت کسی عورت کے کے ساتھ ایک کپڑے میں لیٹے ۔",
          "fr": "Rapporté par Abu Sa’id al-Khudri رضي الله عنه : Le Prophète ﷺ a dit : « Un homme ne doit pas regarder l’intimité d’un autre homme, et une femme ne doit pas regarder l’intimité d’une autre femme. Un homme ne doit pas s’allonger avec un autre homme sous une même couverture sans porter de vêtement couvrant le bas du corps ; et une femme ne doit pas s’allonger avec une autre femme sous une même couverture sans porter de vêtement couvrant le bas du corps. »",
          "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim] berkata, telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Adh Dhahhak bin Utsman] dari [Zaid bin Aslam] dari ['Abdurrahman bin Abu Sa'id Al Khudri] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang laki-laki tidak boleh untuk melihat aurat laki-laki lain, dan seorang wanita tidak boleh melihat aurat wanita yang lain. Seorang laki-laki tidak boleh tidur dengan laki-laki lain dalam satu selimut, dan seorang wanita tidak boleh tidur dengan wanita lain dalam satu selimut",
          "tr": "(Abdurrahman b. Ebî Saîd el-Hudrînin) babasından rivayet olunduğuna göre; Nebi (s.a.v) şöyle buyurmuştur: \"Erkek erkeğin avret (yer) ine bakamaz. Kadın da kadının avret (yer) ine bakamaz. (Aralarında bir engel olmadan) bir erkek bir elbise içerisinde diğer bir erkek (in tenin)e dokunamaz. Kadın da bir elbise içerisinde diğer bir kadın (ın tenin)e dokunamaz. Bu hadis, Müslim Hayz, Nikâh tada var. İzah 4019 da"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (338)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 10
      },
      "narrator": {
        "en": "AbuSa'id al-Khudri"
      }
    },
    {
      "hadithNumber": 4019,
      "arabicNumber": 4019,
      "book": 33,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، ح وَحَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ رَجُلٍ، مِنَ الطُّفَاوَةِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يُفْضِيَنَّ رَجُلٌ إِلَى رَجُلٍ وَلاَ امْرَأَةٌ إِلَى امْرَأَةٍ إِلاَّ وَلَدًا أَوْ وَالِدًا ‏\"‏ ‏.‏ قَالَ وَذَكَرَ الثَّالِثَةَ فَنَسِيتُهَا ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: The Prophet (ﷺ) said: A man should not lie with another man and a woman should not lie with another woman without covering their private parts except a child or a father. He also mentioned a third thing which I forgot",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوئی مرد کسی مرد کے ساتھ ( ایک کپڑے میں ) ہرگز نہ لیٹے اور نہ کوئی عورت کسی عورت کے ساتھ لیٹے سوائے بیٹے اور باپ کے ۔ راوی کہتے ہیں: آپ نے تیسرے کا بھی ذکر کیا لیکن میں اسے بھول گیا۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Prophète ﷺ a dit : « Un homme ne doit pas s’allonger avec un autre homme, et une femme ne doit pas s’allonger avec une autre femme sans couvrir leur intimité, sauf un enfant ou un père. » Il a aussi mentionné une troisième chose que j’ai oubliée",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] berkata, telah mengabarkan kepada kami [Ibnu Ulayyah] dari [Al Jurairi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muammal bin Hisyam] ia berkata; telah menceritakan kepada kami [Isma'il] dari [Al Jurairi] dari [Abu Nadhrah] dari [seorang laki-laki] -dari Ath Thufawah- dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang laki-laki tidak boleh tidur dengan laki-laki lain dalam satu selimut, dan seorang wanita tidak boleh tidur dengan wanita lain dalam satu selimut, kecuali anak atau orang tua (yakni orang tua yang menidurkan anaknya).\" (perawi berkata) berkata, \"Beliau menyebutkan yang ketiga, namun aku lupa",
          "tr": "Ebû Hureyre'den rivayet olunduğuna göre; Resulullah (s.a.v): \"Erkek erkeğe, kadın da kadına (çıplak iken) dokunamaz. Ancak çocuğuna veya babasına dokunabilir\" buyurmuştur. (Ebû Hureyre) dedi ki: (Resulullah (s.a.v), baba kelimesinden sonra) üçüncü bir kelime daha zikretti ama onu unuttum"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 33,
        "hadith": 11
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "9KB"
  }
}