{
  "collection": "abudawud",
  "book": 25,
  "name": {
    "arabic": "كتاب The Office of the Judge (Kitab Al-Aqdiyah)",
    "transliteration": "the office of the judge (kitab al-aqdiyah)",
    "translation": "The Office of the Judge (Kitab Al-Aqdiyah)"
  },
  "totalHadith": 70,
  "hadithNumberRange": {
    "first": 3571,
    "last": 3640
  },
  "content": [
    {
      "hadithNumber": 3571,
      "arabicNumber": 3571,
      "book": 25,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، أَخْبَرَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurayrah: The Prophet (ﷺ) said: He who has been appointed a judge has been killed without a knife",
          "ur": "ابوہریرہ رضی اللہ عنہ کا ارشاد ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو قاضی بنا دیا گیا ( گویا ) وہ بغیر چھری کے ذبح کر دیا گیا ۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Prophète ﷺ a dit : « Celui qui a été nommé juge a été tué sans couteau. »",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Fudlail bin Sulaiman] telah menceritakan kepada kami ['Amru bin Abu 'Amru] dari [Sa'id Al Maqburi] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjabat sebagai hakim, maka sungguh ia telah disembelih tanpa menggunakan pisau",
          "tr": "Ebû Hureyre (r.a)'den rivayet olunduğuna göre; RasûlulIah (s.a.v.): \"Her kim hâkimlik görevini üzerine alırsa bıçaktan başka bir şeyle boğazlanmış olur\" buyurmuştur. Ayrıca bu Hadis'i Tirmizî, ahkâm; İbn Mâce, ahkâm; Ahmed b. Hanbel, II, 230, 365. te tahric ettiler"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 1
      },
      "narrator": {
        "en": "Abu Hurayrah"
      }
    },
    {
      "hadithNumber": 3572,
      "arabicNumber": 3572,
      "book": 25,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الأَخْنَسِيِّ، عَنِ الْمَقْبُرِيِّ، وَالأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurayrah: The Prophet (ﷺ) said: He who has been appointed a judge among the people has been killed without a knife",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص لوگوں کے درمیان قاضی بنا دیا گیا ( گویا ) وہ بغیر چھری کے ذبح کر دیا گیا ۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Prophète ﷺ a dit : « Celui qui a été nommé juge parmi les gens a été tué sans couteau. »",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Bisyr bin Umar] dari [Abdullah bin Ja'far] dari [Utsman bin Muhammad Al Akhnasi] dari [Al Maqburi] serta [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa dijadikan sebagai hakim di antara manusia, maka sungguh ia telah disembelih tanpa menggunakan pisau",
          "tr": "Ebu Hureyre (r.a)'den rivayet olduğuna göre; Nebi (s.a.v.): \"İnsanlar arasında hâkimlik yapmakla görevlendirilen kimse bıçaktan başka bir şeyle boğazlanmış olur\" buyurmuştur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 2
      },
      "narrator": {
        "en": "Abu Hurayrah"
      }
    },
    {
      "hadithNumber": 3573,
      "arabicNumber": 3573,
      "book": 25,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَسَّانَ السَّمْتِيُّ، حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، عَنْ أَبِي هَاشِمٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْقُضَاةُ ثَلاَثَةٌ وَاحِدٌ فِي الْجَنَّةِ وَاثْنَانِ فِي النَّارِ فَأَمَّا الَّذِي فِي الْجَنَّةِ فَرَجُلٌ عَرَفَ الْحَقَّ فَقَضَى بِهِ وَرَجُلٌ عَرَفَ الْحَقَّ فَجَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا أَصَحُّ شَىْءٍ فِيهِ يَعْنِي حَدِيثَ ابْنِ بُرَيْدَةَ ‏\"‏ الْقُضَاةُ ثَلاَثَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Buraydah ibn al-Hasib: The Prophet (ﷺ) said: Judges are of three types, one of whom will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgment accordingly; but a man who knows what is right and acts tyrannically in his judgment will go to Hell; and a man who gives judgment for people when he is ignorant will go to Hell. Abu Dawud said: On this subject this is the soundest tradition, that is, the tradition of Ibn Buraidah: Judges are of three types",
          "ur": "بریدہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قاضی تین طرح کے ہوتے ہیں: ایک جنتی اور دو جہنمی، رہا جنتی تو وہ ایسا شخص ہو گا جس نے حق کو جانا اور اسی کے موافق فیصلہ کیا، اور وہ شخص جس نے حق کو جانا اور اپنے فیصلے میں ظلم کیا تو وہ جہنمی ہے ۔ اور وہ شخص جس نے نادانی سے لوگوں کا فیصلہ کیا وہ بھی جہنمی ہے ۔ ابوداؤد کہتے ہیں: یہ یعنی ابن بریدہ کی تین قاضیوں والی حدیث اس باب میں سب سے صحیح روایت ہے۔",
          "fr": "Rapporté par Buraydah ibn al-Hasib رضي الله عنه : Le Prophète ﷺ a dit : « Il y a trois types de juges : l’un ira au Paradis et deux iront en Enfer. Celui qui ira au Paradis est l’homme qui connaît la vérité et juge selon elle ; mais celui qui connaît la vérité et juge injustement ira en Enfer ; et celui qui juge les gens alors qu’il est ignorant ira aussi en Enfer. » Abu Dawud a dit : À ce sujet, c’est la tradition la plus authentique, c’est-à-dire celle d’Ibn Buraidah : « Les juges sont de trois types. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Hassan As Samti] telah menceritakan kepada kami [Khalaf bin Khalifah] dari [Abu Hasyim] dari [Ibnu Buraidah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Hakim itu ada tiga; satu orang di Surga dan dua orang berada di Neraka. Yang berada di surga adalah seorang laki-laki yang mengetahui kebenaran lalu menghukumi dengannya, seorang laki-laki yang mengetahui kebenaran lalu berlaku lalim dalam berhukum maka ia berada di Neraka, dan orang yang memberikan keputusan untuk manusia di atas kebodohan maka ia berada di Neraka.\" Abu Daud berkata, \"Hadits ini adalah yang paling shahih dalam hal tersebut, yaitu Hadits Ibnu Buraidah yang mengatakan; Hakim ada tiga…",
          "tr": "Abdullah b. Büreyde'nin, babasından rivayet ettiğine göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Hâkimler üç kısımdır: Biri cennette, ikisi de cehennemdedir. Cennette olan, hakkı bilip ona göre hüküm verendir. Hakkı öğrendiği halde hükm(ün)de zulmeden (hâkimler) ile, hakkı bilmeden insanlar hakkında hüküm veren (hakimler) de cehennemdedir.\" Ebû Dâvûd dedi ki: Bu \"Hâkimler üç sınıf tır... \"diye başlayan İbn Büreyde hadisi, bu mevzuda gelen hadislerin en sağlamıdır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 3
      },
      "narrator": {
        "en": "Buraydah ibn al-Hasib"
      }
    },
    {
      "hadithNumber": 3574,
      "arabicNumber": 3574,
      "book": 25,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - أَخْبَرَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌ ‏\"‏ ‏.‏ فَحَدَّثْتُ بِهِ أَبَا بَكْرِ بْنَ حَزْمٍ فَقَالَ هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
        "translations": {
          "en": "It was narrated that `Amr bin Al-`As said \"The Messenger of Allah said:'If a judge passes a judgment having exerted himself to arrive at what is correct, and he is indeed correct, he will have two rewards. If he passes judgment having exerted himself to arrive at what is correct, but it is incorrect, he will have one reward.'\" I narrated it to Abu Bakr bin Hazm and he said: \"This is what Abu Salamah narrated to me from Abu Hurairah",
          "ur": "عمرو بن العاص رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب حاکم ( قاضی ) خوب سوچ سمجھ کر فیصلہ کرے اور درستگی کو پہنچ جائے تو اس کے لیے دوگنا اجر ہے، اور جب قاضی سوچ سمجھ کر فیصلہ کرے اور خطا کر جائے تو بھی اس کے لیے ایک اجر ہے ۱؎ ۔ راوی کہتے ہیں: میں نے اس حدیث کو ابوبکر بن حزم سے بیان کیا تو انہوں نے کہا: مجھ سے اسی طرح ابوسلمہ نے ابوہریرہ رضی اللہ عنہ کے واسطہ سے بیان کیا ہے۔",
          "fr": "Il a été rapporté que ‘Amr bin Al-‘As رضي الله عنه a dit : Le Messager d’Allah ﷺ a dit : « Si un juge rend un jugement après avoir fait des efforts pour trouver la vérité et qu’il a raison, il aura deux récompenses. S’il rend un jugement après avoir fait des efforts mais se trompe, il aura une seule récompense. » Je l’ai rapporté à Abu Bakr bin Hazm et il a dit : « C’est ce qu’Abu Salamah m’a rapporté de la part d’Abu Hurairah. »",
          "id": "Telah menceritakan kepada kami ['Ubaidullah bin Umar bin Maisarah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] telah mengabarkan kepadaku [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim] dari [Busr bin Sa'id] dari [Abu Qais] mantan budak 'Amru bin Al 'Ash dari ['Amru bin Al 'Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang hakim berhukum lalu berijtihad dan benar maka baginya dua pahala, dan apabila ia berhukum lalu berijtihad dan salah maka baginya satu pahala.\" Lalu aku menceritakannya kepada [Abu Bakar bin Hazm], kemudian ia berkata, \"Seperti inilah [Abu Salamah] menceritakan kepadaku dari [Abu Hurairah]",
          "tr": "Amr b. Âs; Rasûlullah (s.a.v.)'in şöyle buyurduğunu rivayet etti: \"Hâkim hüküm verir(ken) ictihad eder de (içtihadında) isabet ederse, kendisine (bu içtihadından dolayı) iki sevap vardır. Eğer hâkim hüküm verir(ken) ictihad eder de (içtihadında) yanılırsa kendisine (bu içtihadından dolayı) bir sevap vardır.\" (Ravi Yezid b. Abdülah b. el-Hâd dedi ki:) Ben bu hadisi Ebû Bekir b. Hazm'e haber verdim de; \"(Bunu bana) Ebû Seleme de Ebû Hureyre'den aynen böyle nakletmişti\" cevabını verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (7352) Sahih Muslim (1716)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 3575,
      "arabicNumber": 3575,
      "book": 25,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا مُلاَزِمُ بْنُ عَمْرٍو، حَدَّثَنِي مُوسَى بْنُ نَجْدَةَ، عَنْ جَدِّهِ، يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ - وَهُوَ أَبُو كَثِيرٍ - قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ طَلَبَ قَضَاءَ الْمُسْلِمِينَ حَتَّى يَنَالَهُ ثُمَّ غَلَبَ عَدْلُهُ جَوْرَهُ فَلَهُ الْجَنَّةُ وَمَنْ غَلَبَ جَوْرُهُ عَدْلَهُ فَلَهُ النَّارُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: The Prophet (ﷺ) said: If anyone seeks the office of judge among Muslims till he gets it and his justice prevails over his tyranny, he will go to Paradise; but the man whose tyranny prevails over his justice will go to Hell",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص مسلمانوں کے منصب قضاء کی درخواست کرے یہاں تک کہ وہ اسے پا لے پھر اس کے ظلم پر اس کا عدل غالب آ جائے تو اس کے لیے جنت ہے، اور جس کا ظلم اس کے عدل پر غالب آ جائے تو اس کے لیے جہنم ہے ۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Prophète ﷺ a dit : « Si quelqu’un cherche à devenir juge parmi les musulmans jusqu’à obtenir ce poste, et que sa justice l’emporte sur son injustice, il ira au Paradis ; mais si son injustice l’emporte sur sa justice, il ira en Enfer. »",
          "id": "Telah menceritakan kepada kami [Abbas Al 'Anbari] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami [Mulazim bin 'Amru] telah menceritakan kepadaku [Musa bin Najdah] dari kakeknya [Yazid bin Abdurrahman Abu Katsir] ia berkata; telah menceritakan kepadaku [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menginginkan untuk menjadi hakim, kemudian keadilannya mengalahkan kelalimannya maka baginya Surga, dan Barangsiapa yang kelalimannya mengalahkan keadilannya maka baginya Neraka",
          "tr": "Ebû Hureyre (r.a) Rasûlullah (s.a.v.)'in şöyle buyurduğunu haber vermiştir: “Her kim müslümanlar arasında hâkimlik yapmak ister ve bu arzusuna erişir, sonra da (onun) adaleti zulmüne baskın gelirse cennetlik olur. (Hâkimlik makamına gelip de) zulmü adaletine baskın gelen kimse de cehenemlik olur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 5
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    },
    {
      "hadithNumber": 3576,
      "arabicNumber": 3576,
      "book": 25,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ بْنِ أَبِي يَحْيَى الرَّمْلِيُّ، حَدَّثَنَا زَيْدُ بْنُ أَبِي الزَّرْقَاءِ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْكَافِرُونَ ‏}‏ إِلَى قَوْلِهِ ‏{‏ الْفَاسِقُونَ ‏}‏ هَؤُلاَءِ الآيَاتُ الثَّلاَثُ نَزَلَتْ فِي الْيَهُودِ خَاصَّةً فِي قُرَيْظَةَ وَالنَّضِيرِ ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas said:\"If any do fail to judge (by the light of) what Allah has revealed, they are (no better than) unbelievers\" up to \"wrongdoers.\" These three verses were revealed about the Jews, particularly about Quraizah and al-Nadir",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں آیت کریمہ «ومن لم يحكم بما أنزل الله فأولئك هم الكافرون» جو اللہ کے حکم کے موافق فیصلہ نہ کریں وہ کافر ہیں اللہ تعالیٰ کے قول «الفاسقون» سورة المائدة: ( ۴۴، ۴۵، ۴۷ ) تک، یہ تینوں آیتیں یہودیوں کے متعلق اور بطور خاص بنی قریظہ اور بنی نضیر کی شان میں نازل ہوئیں۔",
          "fr": "Rapporté par Ibn 'Abbas : « Si quelqu’un ne juge pas selon ce qu’Allah a révélé, il n’est pas meilleur qu’un mécréant », jusqu’à « injustes ». Ces trois versets ont été révélés à propos des Juifs, en particulier concernant Quraizah et al-Nadir",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Hamzah bin Abu Yahya Ar Ramli] telah menceritakan kepada kami [Zaid bin Abu Az Zarqa`] telah menceritakan kepada kami [Ibnu Az Zinad] dari [Ayahnya] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] ia membaca ayat: '(Barangsiapa yang tidak memutuskan menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang kafir) ' hingga firman Allah: '(…… orang-orang yang fasik) ' (Qs. Al Maidah: 44-47). ketiga ayat tersebut turun mengenai orang-orang Yahudi, khususnya orang-orang Bani Quraizhah dan An Nazlir",
          "tr": "İbn Abbas'dan rivayet olunmuştur; dedi ki: \"Kim Allah'ın indirdiği ile hükmetmezse işte kâfirler onlardır\"[Mâide 44] (âyetinin) \"...yoldan çıkmışlardır\"[Mâide 47] âyetine kadar olan (Mâide süresindeki 44,45,47 numaralı) üç âyet, özel olarak (yahudilerden) Kureyza ve Nadîr (oğulları) hakkında inmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 3577,
      "arabicNumber": 3577,
      "book": 25,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ رَجَاءٍ الأَنْصَارِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ الأَنْصَارِيِّ الأَزْرَقِ، قَالَ دَخَلَ رَجُلاَنِ مِنْ أَبْوَابِ كِنْدَةَ وَأَبُو مَسْعُودٍ الأَنْصَارِيُّ جَالِسٌ فِي حَلْقَةٍ فَقَالاَ أَلاَ رَجُلٌ يُنَفِّذُ بَيْنَنَا فَقَالَ رَجُلٌ مِنَ الْحَلْقَةِ أَنَا ‏.‏ فَأَخَذَ أَبُو مَسْعُودٍ كَفًّا مِنْ حَصًى فَرَمَاهُ بِهِ وَقَالَ مَهْ إِنَّهُ كَانَ يُكْرَهُ التَّسَرُّعُ إِلَى الْحُكْمِ ‏.‏",
        "translations": {
          "en": "AbdurRahman ibn Bishr al-Ansari al-Azraq said:Two men from the locality of Kindah came while AbuMas'ud al-Ansari was sitting n a circle. They said: Is there any man who decides between us. A man from the circle said: I, AbuMas'ud took a handful of pebbles and threw at him, saying: Hush! It is disapproved to make haste in decision",
          "ur": "عبدالرحمٰن بن بشر انصاری ازرق کہتے ہیں کہ کندہ کے دروازوں سے دو شخص جھگڑتے ہوئے آئے اور ابومسعود انصاری رضی اللہ عنہ ایک حلقے میں بیٹھے ہوئے تھے، تو ان دونوں نے کہا: کوئی ہے جو ہمارے درمیان فیصلہ کر دے! حلقے میں سے ایک شخص بول پڑا: ہاں، میں فیصلہ کر دوں گا، ابومسعود رضی اللہ عنہ نے ایک مٹھی کنکری لے کر اس کو مارا اور کہا: ٹھہر ( عہد نبوی میں ) قضاء میں جلد بازی کو مکروہ سمجھا جاتا تھا ۱؎۔",
          "fr": "AbdurRahman ibn Bishr al-Ansari al-Azraq a dit : Deux hommes de la région de Kindah sont venus alors qu’Abu Mas'ud al-Ansari était assis dans un cercle. Ils ont demandé : « Y a-t-il quelqu’un ici qui peut trancher entre nous ? » Un homme du cercle a répondu : « Moi. » Abu Mas'ud a alors pris une poignée de cailloux et les a lancés vers lui en disant : « Silence ! Il n’est pas bien de se précipiter pour juger. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Muhammad bin Al Mutsanna] mereka berkata; telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Raja Al Anshari] dari [Abdurrahman bin Bisyr Al Anshari Al Azraq] ia berkata, \"Dua orang lelaki masuk dari beberapa pintu Kindah, sementara Abu Mas'ud Al Anshari sedang duduk di antara sekumpulan orang. Keduanya lalu berkata, \"Adakah seseorang yang memberikan keputusan di antara kami? Kemudian seorang laki-laki dari sekumpulan orang itu yang berkata, \"Aku.\" [Abu Mas'ud] kemudian mengambil segenggam kerikil lalu melemparkannya kepada orang tersebut seraya berkata, \"Tahanlah! Sesungguhnya terburu-buru dalam memberikan keputusan itu dibenci",
          "tr": "Abdurrahman b. Bişr el-Ensarî el-Ezrak'den rivayet olunmuştur, dedi ki: Ebû Mes'ud el-Ensarî (bir gün insanlardan oluşan) bir halka içerisinde otururken, Kinde kapılarından iki adam yanlarına girerek: (İçinizde) bizim aramızda hüküm verecek bir kimse yok mudur? diye sormuşlar. Halka (da bulunanlar) dan birisi de: Ben (varım) demiş. Bunun üzerine Ebû Mes'ud (yerden) bir çakıl taşı alarak o adama atmış ve: Vazgeç, çünkü (Hz. Nebi zamanında) hâkimliğe heves etmek iyi karşılanmazdı, demiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 3578,
      "arabicNumber": 3578,
      "book": 25,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا إِسْرَائِيلُ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ بِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ طَلَبَ الْقَضَاءَ وَاسْتَعَانَ عَلَيْهِ وُكِلَ إِلَيْهِ وَمَنْ لَمْ يَطْلُبْهُ وَلَمْ يَسْتَعِنْ عَلَيْهِ أَنْزَلَ اللَّهُ مَلَكًا يُسَدِّدُهُ ‏\"‏ ‏.‏ وَقَالَ وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الأَعْلَى عَنْ بِلاَلِ بْنِ أَبِي مُوسَى عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَقَالَ أَبُو عَوَانَةَ عَنْ عَبْدِ الأَعْلَى عَنْ بِلاَلِ بْنِ مِرْدَاسٍ الْفَزَارِيِّ عَنْ خَيْثَمَةَ الْبَصْرِيِّ عَنْ أَنَسٍ ‏.‏",
        "translations": {
          "en": "Narrated Anas ibn Malik: The Prophet (ﷺ) said: If anyone desires the office of Judge and seeks help for it, he will be left to his own devices; if anyone does not desire it, nor does he seek help for it, Allah will send down an angel who will direct him aright. Waki' said: (This tradition has also been transmitted) by Isra'il, from 'Abd al-A'la, from Bilal bin Abi Musa, from Anas, from the Prophet (ﷺ). Abu 'Awanah said: from 'Abd al-A'la, from Bilal bin Mirdas al-Fazari, from Khaithamah al-Basri from Anas",
          "ur": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا: جو شخص منصب قضاء کا طالب ہوا اور اس ( عہدے ) کے لیے مدد چاہی ۱؎ وہ اس کے سپرد کر دیا گیا ۲؎، جو شخص اس عہدے کا خواستگار نہیں ہوا اور اس کے لیے مدد نہیں چاہی تو اللہ تعالیٰ اس کے لیے ایک فرشتہ نازل فرماتا ہے جو اسے راہ صواب پر رکھتا ہے ۔",
          "fr": "Rapporté par Anas ibn Malik : Le Prophète ﷺ a dit : « Si quelqu’un désire devenir juge et cherche de l’aide pour obtenir ce poste, il sera laissé à lui-même. Mais si quelqu’un ne le désire pas et ne cherche pas à l’obtenir, Allah enverra un ange pour le guider vers la bonne décision. » Waki' a dit : Cette tradition a aussi été transmise par Isra'il, de 'Abd al-A'la, de Bilal ibn Abi Musa, d’Anas, du Prophète ﷺ. Abu 'Awanah a dit : de 'Abd al-A'la, de Bilal ibn Mirdas al-Fazari, de Khaithamah al-Basri, d’Anas",
          "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Israil] telah menceritakan kepada kami [Abdul A'la] dari [Bilal] dari [Anas bin Malik] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menginginkan untuk menjadi hakim dan ia meminta pertolongan untuk mendapatkannya, maka segala urusannya akan diserahkan kepadanya, sedangkan orang yang tidak menginginkannya dan tidak meminta pertolongan untuk mendapatkannya, maka Allah menurunkan Malaikat untuk meluruskannya.\" [Waki'] berkata dari [Israil] dari [Abul A'la] dari [Bilal bin Abu Musa] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, dan [Abu 'Awanah] berkata dari [Abdul A'la] dari [Bilal bin Mirdas Al Fazari] dari [Khaitsamah Al Anshari] dari [Anas]",
          "tr": "Enes b. Mâlik'den, şöyle demiştir: Ben Rasûlullah (s.a.v.)'in şöyle buyurduğunu işittim: '*- Kim hâkimlik görevi (ni üstenmek) ister ve bu göreve talip olmaz ve onu elde etmek için (aracılardan) yardım istemez (fakat liyakatından dolayı bu göreve getirilir) ise; Allah ona, doğru hareket etmesine yardımcı olacak bir melek indirir.\" Ebû Dâvûd dedi ki; (Bu hadisi) Vekî İsrail'den, Abdü'l-A'lâ'dan, O Bilâl b. Ebû Musa'dan, o Enes'ten, o da Nebi (s.a.v.)'den rivayet etti. Ebû Avâne ise Abdü 'l-A'lâ'dan, o Bilâl b. Mirdâs el-Fezârî'den, o Hayseme el-Basrî'den, o da Enes'ten rivayet etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 8
      },
      "narrator": {
        "en": "Anas ibn Malik"
      }
    },
    {
      "hadithNumber": 3579,
      "arabicNumber": 3579,
      "book": 25,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنِي أَبُو بُرْدَةَ، قَالَ قَالَ أَبُو مُوسَى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَنْ نَسْتَعْمِلَ - أَوْ لاَ نَسْتَعْمِلُ - عَلَى عَمَلِنَا مَنْ أَرَادَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Buradah reported the Prophet (ﷺ) as saying:\"We will never employ or we shall not employ (the narrator is doubtful) in our work one who wants it",
          "ur": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ہم ہرگز کسی ایسے شخص کو عامل مقرر نہیں کریں گے جو عامل بننا چاہے ۔ ابوموسیٰ رضی اللہ عنہ کہتے ہیں کہ",
          "fr": "Abu Buradah a rapporté que le Prophète ﷺ a dit : « Nous n’emploierons jamais, ou nous n’emploierons pas (le narrateur hésite), dans nos affaires, quelqu’un qui le désire. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Qurrah bin Khalid] telah menceritakan kepada kami [Humaid bin Hilal] telah menceritakan kepadaku [Abu Burdah] ia berkata, [Abu Musa] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Kami tidak akan memberikan jabatan untuk mengurusi suatu pekerjaan kami kepada orang yang menginginkannya",
          "tr": "Ebû Musa (el-Eş'arî'den; Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet edilmiştir: \"Biz bu görevimize onu isteyeni hiçbir zaman getirmeyiz\" yahutta \"getirmeyeceğiz"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (6923) Sahih Muslim (1824)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 3580,
      "arabicNumber": 3580,
      "book": 25,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّاشِيَ وَالْمُرْتَشِيَ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Amr ibn al-'As: The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes bribe",
          "ur": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے رشوت دینے، اور رشوت لینے والے دونوں پر لعنت کی ہے۔",
          "fr": "Rapporté par Abdullah ibn Amr ibn al-'As : Le Messager d’Allah ﷺ a maudit celui qui donne un pot-de-vin et celui qui le reçoit",
          "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Al Harits bin Abdurrahman] dari [Abu Salamah] dari [Abdullah bin 'Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaknat orang yang memberi uang sogokan dan orang yang menerimanya",
          "tr": "Abdullah b. Amr'dan, demiştir ki: Rasûlullah (s.a.v.), rüşvet verene de alana da lanet etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 10
      },
      "narrator": {
        "en": "Abdullah ibn Amr ibn al-'As"
      }
    },
    {
      "hadithNumber": 3581,
      "arabicNumber": 3581,
      "book": 25,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، حَدَّثَنِي قَيْسٌ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ عُمَيْرَةَ الْكِنْدِيُّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ مَنْ عَمِلَ مِنْكُمْ لَنَا عَلَى عَمَلٍ فَكَتَمَنَا مِنْهُ مِخْيَطًا فَمَا فَوْقَهُ فَهُوَ غُلٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ أَسْوَدُ كَأَنِّي أَنْظُرُ إِلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ اقْبَلْ عَنِّي عَمَلَكَ ‏.‏ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ قَالَ سَمِعْتُكَ تَقُولُ كَذَا وَكَذَا ‏.‏ قَالَ ‏\"‏ وَأَنَا أَقُولُ ذَلِكَ مَنِ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَلْيَأْتِ بِقَلِيلِهِ وَكَثِيرِهِ فَمَا أُوتِيَ مِنْهُ أَخَذَهُ وَمَا نُهِيَ عَنْهُ انْتَهَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Adi ibn Umayrah al-Kindi: The Prophet (ﷺ) said: O people, if any of you is put in an administrative post on our behalf and conceals from us a needle or more, he is acting unfaithfully, and will bring it on the Day of Resurrection. A black man from the Ansar, as if I am seeing him, stood and said: Messenger of Allah, take back from me my post. He asked: What is that? He replied: I heard you say such and such. He said: And I say that. If we appoint anyone to an office, he must bring what is connected with it, both little and much. What he is given, he may take, and he must refrain from what is kept away from him",
          "ur": "عدی بن عمیرہ کندی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگو! تم میں سے جو شخص کسی کام پر ہمارا عامل مقرر کیا گیا، پھر اس نے ہم سے ان ( محاصل ) میں سے ایک سوئی یا اس سے زیادہ کوئی چیز چھپائی تو وہ چوری ہے، اور وہ قیامت کے دن اس چرائی ہوئی چیز کے ساتھ آئے گا اتنے میں انصار کا ایک کالے رنگ کا آدمی کھڑا ہوا، گویا کہ میں اس کی طرف دیکھ رہا ہوں، اس نے عرض کیا: اللہ کے رسول! آپ مجھ سے اپنا کام واپس لے لیجئے، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا بات ہے؟ اس شخص نے عرض کیا: آپ کو میں نے ایسے ایسے فرماتے سنا ہے آپ صلی اللہ علیہ وسلم نے فرمایا: میں تو یہ کہہ ہی رہا ہوں کہ ہم نے جس شخص کو کسی کام پر عامل مقرر کیا تو ( محاصل ) تھوڑا ہو یا زیادہ اسے حاضر کرے اور جو اس میں سے اسے دیا جائے اسے لے لے، اور جس سے منع کر دیا جائے اس سے رکا رہے ۔",
          "fr": "Rapporté par Adi ibn Umayrah al-Kindi : Le Prophète ﷺ a dit : « Ô gens, si l’un d’entre vous est nommé à un poste administratif en notre nom et cache ne serait-ce qu’une aiguille ou plus, il commet une trahison et devra la présenter le Jour de la Résurrection. » Un homme noir des Ansar, que je vois encore devant moi, s’est alors levé et a dit : « Messager d’Allah, reprends mon poste. » Il a demandé : « Pourquoi ? » Il a répondu : « J’ai entendu ce que tu viens de dire. » Le Prophète ﷺ a dit : « Oui, je le répète. Si nous nommons quelqu’un à une fonction, il doit remettre tout ce qui y est lié, que ce soit peu ou beaucoup. Ce qu’on lui donne, il peut le prendre, mais il doit s’abstenir de ce qui lui est refusé. »",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Isma'il bin Abu Khalid] telah menceritakan kepadaku [Qais] ia berkata; telah menceritakan kepadaku [Adi bin 'Umairah Al Kindi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para manusia, barangsiapa yang di antara kalian diserahi jabatan untuk mengurus pekerjaan, kemudian menyembunyikan sebuah jarum atau lebih dari itu dari kami, maka hal itu adalah sebuah pengkhianatan yang akan ia bawa pada Hari Kiamat.\" Kemudian seorang laki-laki anshar berkulit hitam berdiri seakan aku pernah melihatnya, lalu ia berkata, \"Wahai Rasulullah, terimalah dariku pekerjaan anda! Beliau bersabda: \"Apakah itu?\" laki-laki itu menjawab, \"Saya mendengar anda mengatakan demikian dan demikian.\" Beliau bersabda: \"Dan aku katakan: Barangsiapa yang kami beri jabatan untuk melakukan suatu pekerjaan maka hendaknya ia melakukan yang sedikit dan yang banyak! Lalu apa yang diberikan kepadanya boleh ia mengambilnya, dan apa yang dilarang darinya maka ia tinggalkan",
          "tr": "Adiyy b. Amîre el-Kindî'den, Rasûlullah (s.a.v.)'in şöyle buyurduğu rivayet edilmiştir: \"Ey insanlar, sizden birisi bizim bir işimizin başına getirilir de o işten (hasıl olan) bir iğneyi veya daha küçüğünü bizden gizlerse bu (gizlediği şey onun boynuna geçecek) bir bukağıdır. (Bu kimse) kıyamet gününde Allah'ın huzuruna onunla beraber gelir. (Ravi, sözleri­ne şöyle devam etmiştir:) Ensar'dan siyah bir adam ayağa kalktı, (şu anda ben) o adamı görüyor gibiyim. Ey Allah'ın Rasûlü, görevim benden geri al, dedi. (Hz. Peygamber de ona): \"Bu (sözü söylemenin sebebi) nedir?\" diye sordu. Ben seni şöyle şöyle derken işittim; karşılığını verdi. (Bunun üze­rine Hz. Nebi): \"Ben bu sözü (yine de) söylüyorum. Bizim bir işte görevlendirdiğimiz kimse (bu görevi esnasında halktan almış olduğu malların) azını da, çoğunu da (bize) getirsin. Bu iş(in) den dolayı (kendisine) verileni alsın. Alınması yasaklanan şeyi de almasın\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (1833)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 11
      },
      "narrator": {
        "en": "Adi ibn Umayrah al-Kindi"
      }
    },
    {
      "hadithNumber": 3582,
      "arabicNumber": 3582,
      "book": 25,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ أَخْبَرَنَا شَرِيكٌ، عَنْ سِمَاكٍ، عَنْ حَنَشٍ، عَنْ عَلِيٍّ، عَلَيْهِ السَّلاَمُ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ قَاضِيًا فَقُلْتُ يَا رَسُولَ اللَّهِ تُرْسِلُنِي وَأَنَا حَدِيثُ السِّنِّ وَلاَ عِلْمَ لِي بِالْقَضَاءِ فَقَالَ ‏ \"‏ إِنَّ اللَّهَ سَيَهْدِي قَلْبَكَ وَيُثَبِّتُ لِسَانَكَ فَإِذَا جَلَسَ بَيْنَ يَدَيْكَ الْخَصْمَانِ فَلاَ تَقْضِيَنَّ حَتَّى تَسْمَعَ مِنَ الآخَرِ كَمَا سَمِعْتَ مِنَ الأَوَّلِ فَإِنَّهُ أَحْرَى أَنْ يَتَبَيَّنَ لَكَ الْقَضَاءُ ‏\"‏ ‏.‏ قَالَ فَمَا زِلْتُ قَاضِيًا أَوْ مَا شَكَكْتُ فِي قَضَاءٍ بَعْدُ ‏.‏",
        "translations": {
          "en": "Narrated Ali ibn AbuTalib: The Messenger of Allah (ﷺ) sent me to the Yemen as judge, and I asked: Messenger of Allah, are you sending me when I am young and have no knowledge of the duties of a judge? He replied: Allah will guide your heart and keep your tongue true. When two litigants sit in front of you, do not decide till you hear what the other has to say as you heard what the first had to say; for it is best that you should have a clear idea of the best decision. He said: I had been a judge (for long); or he said (the narrator is doubtful): I have no doubts about a decision afterwards",
          "ur": "علی رضی اللہ عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے یمن کا قاضی بنا کر بھیجا تو میں نے عرض کیا: اللہ کے رسول! آپ مجھے ( قاضی ) بنا کر بھیج رہے ہیں جب کہ میں کم عمر ہوں اور قضاء ( فیصلہ کرنے ) کا علم بھی مجھے نہیں ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: عنقریب اللہ تعالیٰ تمہارے دل کی رہنمائی کرے گا اور تمہاری زبان کو ثابت رکھے گا، جب تم فیصلہ کرنے بیٹھو اور تمہارے سامنے دونوں فریق موجود ہوں تو جب تک تم دوسرے کا بیان اسی طرح نہ سن لو جس طرح پہلے کا سنا ہے فیصلہ نہ کرو کیونکہ اس سے معاملے کی حقیقت واشگاف ہو کر سامنے آ جائے گی وہ کہتے ہیں: تو میں برابر فیصلہ دیتا رہا، کہا: پھر مجھے اس کے بعد کسی فیصلے میں شک نہیں ہوا۔",
          "fr": "Rapporté par Ali ibn Abu Talib : Le Messager d’Allah ﷺ m’a envoyé au Yémen comme juge, et j’ai demandé : « Messager d’Allah, tu m’envoies alors que je suis jeune et que je ne connais pas les devoirs d’un juge ? » Il a répondu : « Allah guidera ton cœur et rendra ta parole juste. Quand deux personnes viennent devant toi, ne rends pas de jugement avant d’avoir entendu les deux parties, comme tu as écouté la première ; c’est ainsi que tu pourras juger au mieux. » Il a ajouté : « J’ai été juge longtemps » ou bien il a dit (le narrateur hésite) : « Je n’ai jamais eu de doute après avoir jugé. »",
          "id": "Telah menceritakan kepada kami ['Amru bin 'Aun] ia berkata; telah mengabarkan kepada kami [Syarik] dari [Simak] dari [Hanasy] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman sebagai hakim, lalu kami katakan, \"Wahai Rasulullah, apakah anda akan mengutusku sementara saya masih muda dan tidak memiliki ilmu mengenai peradilan?\" Kemudian beliau bersabda: \"Sesungguhnya Allah akan memberi petunjuk kepada hatimu, dan meneguhkan lisanmu. Apabila ada dua orang yang berseteru duduk di hadapanmu maka janganlah engkau memberikan keputusan hingga engkau mendengar dari orang yang lain, sebagaimana engkau mendengar dari orang yang pertama, karena sesungguhnya keputusan akan lebih jelas bagimu.\" Ali berkata, \"Setelah itu aku tetap menjadi hakim atau aku tidak merasa ragu dalam memberikan keputusan",
          "tr": "Ali (r.a.)'dan rivayet olunmuştur; dedi ki: Rasûlullah (s.a.v.) beni Yemen'e hâkim olarak göndermişti. (Kendisine); Ey Allah'ın Rasûlu, sen beni gönderiyorsun ama ben daha çok küçüğüm ve nasıl hüküm vereceğimi bilmiyorum, dedim. Bunun üzerine Hz. Nebi şöyle buyurdu: \"Allah senin kalbini (doğru hüküm verebilme yoluna) eriştirecek, dilini (doğru hüküm vermede) sabit kılacak. Binaenaleyh (mahkeme olmak üzere) huzuruna iki hasım geldiği zaman, birincisini dinlediğin gibi diğerini de dinleyinceye kadar hüküm verme. Bu (vereceğin) hükmün aydınlığa kavuşması için daha uygundur.\" (Hz. Ali sözlerine devamla: O günden beri hâlâ bu tavsiyesine göre) \"hâkimliğe devam ediyorum.” yahutta-: \"Bir daha hüküm vermekte tereddüte düşmedim\" dedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 12
      },
      "narrator": {
        "en": "Ali ibn AbuTalib"
      }
    },
    {
      "hadithNumber": 3583,
      "arabicNumber": 3583,
      "book": 25,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ مِنْهُ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ بِشَىْءٍ فَلاَ يَأْخُذْ مِنْهُ شَيْئًا فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Umm Salamah reported the Messenger of Allah (ﷺ) as saying:\"I am only a human being, and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgement on their behalf according to what I hear from them. Therefore, whatever I decide for anyone which by right belongs to his brother, he must not take anything, for I am granting him only a portion of Hell",
          "ur": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں انسان ہی ہوں ۱؎، تم اپنے مقدمات کو میرے پاس لاتے ہو، ہو سکتا ہے کہ تم میں کچھ لوگ دوسرے کے مقابلہ میں اپنی دلیل زیادہ بہتر طریقے سے پیش کرنے والے ہوں تو میں انہیں کے حق میں فیصلہ کر دوں جیسا میں نے ان سے سنا ہو، تو جس شخص کے لیے میں اس کے بھائی کے کسی حق کا فیصلہ کر دوں تو وہ اس میں سے ہرگز کچھ نہ لے کیونکہ میں اس کے لیے آگ کا ایک ٹکڑا کاٹ رہا ہوں ۔",
          "fr": "Umm Salamah a rapporté que le Messager d’Allah ﷺ a dit : « Je ne suis qu’un être humain, et vous me présentez vos différends. Il se peut que l’un de vous soit plus éloquent que l’autre, alors je juge en sa faveur selon ce que j’entends. Donc, si je donne à quelqu’un ce qui appartient en réalité à son frère, qu’il ne le prenne pas, car je ne lui donne en fait qu’un morceau de l’Enfer. »",
          "tr": "Ummü Seleme'den, demiştir ki: Rasûlullah (s.a.v.) şöyle buyurdu: \"Ben ancak bir insanım. Siz davalarınıza bakmam için bana müracaat ediyorsunuz. Bir kısmınız (hakkı savunurken) delilini ifade etme hususunda bir kısmınızdan daha güçlü olabilir, ben de ondan dinlediklerime göre hüküm veririm. Binaenaleyh ben (bu şartlar içerisinde) herhangi bir kimse için kardeşinin hakkı olan bir şey'in verilmesine hükmedersem o kimse bu şeyi almasın. Çünkü ben (bu şekilde verdiğim hükümle) ona ateşten bir parça kes(ip ver)mişim (demek)tir.”"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (6967) Sahih Muslim (1713)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 3584,
      "arabicNumber": 3584,
      "book": 25,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ، قَالَتْ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم رَجُلاَنِ يَخْتَصِمَانِ فِي مَوَارِيثَ لَهُمَا لَمْ تَكُنْ لَهُمَا بَيِّنَةٌ إِلاَّ دَعْوَاهُمَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم فَذَكَرَ مِثْلَهُ فَبَكَى الرَّجُلاَنِ وَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا حَقِّي لَكَ ‏.‏ فَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَمَّا إِذْ فَعَلْتُمَا مَا فَعَلْتُمَا فَاقْتَسِمَا وَتَوَخَّيَا الْحَقَّ ‏.‏ ثُمَّ اسْتَهِمَا ثُمَّ تَحَالاَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Umm Salamah said:Two men came to the Messenger of Allah (ﷺ) who were disputing over their inheritance. They had no evidence except their claim. The Prophet (ﷺ) then said in a similar way. Thereupon both the men wept and each of them said: This right of mine go to you. The Prophet (ﷺ) then said: Now you have done whatever you have done ; do divide it up, aiming at what is right, then drew lots, and let each of you consider the other to have what is legitimately his",
          "ur": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس دو شخص اپنے میراث کے مسئلے میں جھگڑتے ہوئے آئے اور ان دونوں کے پاس بجز دعویٰ کے کوئی دلیل نہیں تھی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا۔ ۔ ۔ ( پھر راوی نے اسی کے مثل حدیث ذکر کی ) تو دونوں رو پڑے اور ان میں سے ہر ایک دوسرے سے کہنے لگا: میں نے اپنا حق تجھے دے دیا، آپ صلی اللہ علیہ وسلم نے ان دونوں سے فرمایا: جب تم ایسا کر رہے ہو تو حق کو پیش نظر رکھ کر ( مال ) کو تقسیم کر لو، پھر قرعہ اندازی کر لو اور ایک دوسرے کو معاف کر دو ۔",
          "fr": "Umm Salamah a dit : Deux hommes sont venus voir le Messager d’Allah ﷺ pour un litige concernant leur héritage. Ils n’avaient aucune preuve, seulement leurs déclarations. Le Prophète ﷺ a alors parlé de la même manière. Les deux hommes se sont mis à pleurer et chacun a dit : « Je te cède mon droit. » Le Prophète ﷺ a alors dit : « Maintenant que vous avez agi ainsi, partagez équitablement, puis tirez au sort, et que chacun considère que l’autre a ce qui lui revient de droit. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Zainab binti Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku hanyalah seorang manusia, dan kalian mengadukan permasalahannya kepadaku. Bisa jadi sebagian kalian lebih pandai dalam berdalih dari sebagian yang lain, sehingga aku memberikan keputusan untuknya sesuai dengan apa yang aku dengar darinya. Maka barangsiapa yang aku berikan suatu keputusan baginya dengan mengambil hak dari saudaranya maka janganlah ia mengambil sedikitpun darinya, karena sesungguhnya aku potongkan (api) baginya dari potongan (api) Neraka.\" Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Usamah bin Zaid] dari [Abdullah bin Rafi'] mantan budak Ummu Salamah, dari [Ummu Salamah] ia berkata, \"Dua orang laki-laki berselisih mengenai warisan mereka berdua, sementara mereka tidak memiliki bukti kecuali pengakuan mereka saja. Lalu Nabi shallallahu 'alaihi wasallam bersabda…lalu ia menyebutkan sebagaimana hadits tersebut. Kedua laki-laki tersebut kemudian menangis, lalu setiap dari mereka berkata, 'Hakku untukmu. ' Kemudian Nabi shallallahu 'alaihi wasallam berkata kepada mereka berdua: \"Adapun apabila kalian berdua melakukan apa yang telah kalian lakukan, maka bagi dan berusahalah untuk bersikap benar (adil).\" Kemudian mereka mengundi mana bagian mereka, dan mereka saling menghalalkan untuk yang lainnya.\" Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa] telah menceritakan kepada kami [Usamah] dari [Abdullah bin Rafi'] ia berkata, \"Aku mendengar [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits tersebut. Ia berkata, \"Mereka berdua berseteru mengenai harta warisan dan beberapa perkara yang telah usang. Kemudian beliau bersabda: \"Aku memberi putusan untuk kalian berdasarkan pendapatku semata, sesuatu yang aku belum mendapatkan wahyu tentangnya",
          "tr": "Ümmü Seleme (r.anhe)'den şöyle dediği rivayet olunmuştur: Kendijerim ait bir miras hususunda ihtilâfa düşen iki kişi Rasûlullah (s.a.v.)'e geldiler. (Davalarını isbata yarayacak) bir belgeleri yoktu, sadece (kendilerine göre) bir iddiaları vardı. (Bunun üzerine) Nebi (s.a.v.) (onlara bir önceki 3583. hadisin) benzeri sözler söyledi. (Bu) iki adam (Hz. Nebi'in konuşmasını dinleyince) ağla(maya başla)dılar. Her biri (diğerine): \"Benim hakkım senin olsun\" dedi. Hz. Nebi (s.a.v.) de; \"(Şu) davranışı gösterdiğinize göre; malınızı kendi aranızda bölüşme yoluna gidiniz. Bunu yaparken önce (malı) iki eşit parçaya bölünüz, sonra (aranızda) kur'a çekiniz (sonunda birbirinizle) helâlleşiniz\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 3585,
      "arabicNumber": 3585,
      "book": 25,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى، حَدَّثَنَا أُسَامَةُ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، قَالَ سَمِعْتُ أُمَّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ قَالَ يَخْتَصِمَانِ فِي مَوَارِيثَ وَأَشْيَاءَ قَدْ دَرَسَتْ فَقَالَ ‏ \"‏ إِنِّي إِنَّمَا أَقْضِي بَيْنَكُمْ بِرَأْيِي فِيمَا لَمْ يُنْزَلْ عَلَىَّ فِيهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Umm Salamah reported the Prophet (ﷺ) as saying when two men were disputing over inheritance and old things:I decide between you on the basis of my opinion in cases about which no revelation has been sent down to me",
          "ur": "اس سند سے بھی ام المؤمنین ام سلمہ رضی اللہ عنہا سے یہی حدیث مروی ہے، اس میں اتنا اضافہ ہے کہ وہ دونوں ترکہ اور کچھ چیزوں کے متعلق جھگڑ رہے تھے جو پرانی ہو چکی تھیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں تمہارے درمیان اپنی رائے سے فیصلہ کرتا ہوں جس میں مجھ پر کوئی حکم نہیں نازل کیا گیا ہے ۔",
          "fr": "Umm Salamah a rapporté que le Prophète ﷺ a dit, alors que deux hommes se disputaient au sujet d’un héritage et de vieilles affaires : « Je juge entre vous selon mon opinion dans les cas où je n’ai reçu aucune révélation. »",
          "tr": "Abdullah b. Râfi'den; dedi ki: Ben Ümmü Seleme'yi, Nebi (s.a.v.) den şu (bir önceki) hadisi (rivayet ederken) işittim. (Abdullah b. Râfî' sözlerine devamla şöyle) dedi: Miras ve kaybolup gitmiş bir takım mallar hususunda (iki şahıs Hz. Nebi'e müracaat ederek birbirlerinden) davacı oldular. Bunun üzerine (Hz. Nebi): \"Ben, hakkında bana (bir vahiy) inmemiş olan hususlarda kendi re'yimle hüküm veririm\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 3586,
      "arabicNumber": 3586,
      "book": 25,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، - رضى الله عنه - قَالَ وَهُوَ عَلَى الْمِنْبَرِ يَا أَيُّهَا النَّاسُ إِنَّ الرَّأْىَ إِنَّمَا كَانَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مُصِيبًا لأَنَّ اللَّهَ كَانَ يُرِيهِ وَإِنَّمَا هُوَ مِنَّا الظَّنُّ وَالتَّكَلُّفُ ‏.‏",
        "translations": {
          "en": "Narrated Umar ibn al-Khattab: Umar said while he was (sitting) on the pulpit: O people, the opinion from the Messenger of Allah (ﷺ) was right, because Allah showed (i.e. inspired) him; but from us it is sheer conjecture and artifice",
          "ur": "ابن شہاب کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے منبر پر فرمایا: لوگو! رائے تو صرف رسول اللہ صلی اللہ علیہ وسلم کی درست تھی کیونکہ اللہ تعالیٰ آپ کو سجھاتا تھا، اور ہماری رائے محض ایک گمان اور تکلف ہے ۱؎ ۔",
          "fr": "Rapporté par Omar ibn al-Khattab alors qu’il donnait un sermon : Omar a dit, alors qu’il était assis sur la chaire : « Ô gens, l’avis du Messager d’Allah ﷺ était juste, car Allah le lui montrait (c’est-à-dire l’inspirait) ; mais de notre part, ce n’est que supposition et ruse. »",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah mengabarkan kepada kami [Ibnu Wahb] dari [Yunus bin Yazid] dari [Ibnu Syihab] bahwa [Umar bin Al Khathab] radliallahu 'anhu berada di atas mimbar dan berkata, \"Wahai para manusia, sesungguhnya jika pendapat itu berasal dari Rasulullah shallallahu 'alaihi wasallam maka ia benar adanya, sebab Allah memperlihatkan kepadanya, dan pendapat yang berasal dari kita hanyalah prasangka dan takalluf (membebani diri)",
          "tr": "Ömer b. el-Hattâb (r.a) minber üzerinde iken şöyle demiştir: Ey insanlar, ancak Rasûlullah (s.a.v.)'in içtihadında kesin isabet yardır. Çünkü Allah ona (doğruyu bizzat kendisi) göstermiştir. Bizden (çıkan) içtihad (lar ise, doğruyu çıkarmak için gücümüz nisbetinde ortaya konmuş fikrî) bir gayret (in semeresinden ibaret)tir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Maqtu"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif Maqtu"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 16
      },
      "narrator": {
        "en": "Umar ibn al-Khattab"
      }
    },
    {
      "hadithNumber": 3587,
      "arabicNumber": 3587,
      "book": 25,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، أَخْبَرَنَا مُعَاذُ بْنُ مُعَاذٍ، قَالَ أَخْبَرَنِي أَبُو عُثْمَانَ الشَّامِيُّ، وَلاَ إِخَالُنِي رَأَيْتُ شَامِيًّا أَفْضَلَ مِنْهُ يَعْنِي حَرِيزَ بْنَ عُثْمَانَ ‏.‏",
        "translations": {
          "en": "Mu'adh bin Mu'adh said:Abu 'Uthman al-Shami, whose name is Hariz bin 'Uthman, told me. I think I did not see anyone from Syria better than him",
          "ur": "معاذ بن معاذ کہتے ہیں ابوعثمان شامی نے مجھے خبر دی اور میری نظر میں ان سے ( یعنی حریز بن عثمان سے ) کوئی شامی افضل نہیں ۱؎۔",
          "fr": "Mu'adh bin Mu'adh a dit : Abu 'Uthman al-Shami, dont le nom est Hariz bin 'Uthman, m’a raconté. Je pense n’avoir vu personne de Syrie meilleur que lui",
          "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah Adl Dalbbi] telah mengabarkan kepada kami [Mu'adz bin Mu'adz] ia berkata, \"Abu Utsman Asy Syami mengabarkan kepadaku, dan aku tidak pernah melihat orang yang Syam yang lebih baik darinya, yaitu Huraiz bin Utsman",
          "tr": "Muaz b. Muaz dedi ki: (Şu bir 3586. önceki hadisi) bana Ebû Osman eş-Şâmî de haber verdi. Ben ondan yani (Ebû Osman eş-Şâmî künyesiyle tanınan) Harîz b. Osman'dan daha faziletli birini gördüğümü sanmıyorum"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih Maqtu"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih Maqtu"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 3588,
      "arabicNumber": 3588,
      "book": 25,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَىِ الْحَكَمِ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn az-Zubayr: The Messenger of Allah (ﷺ) gave the decision that the two adversaries should be made to sit in front of the judge",
          "ur": "عبداللہ بن زبیر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ مدعی اور مدعا علیہ دونوں حاکم کے سامنے بیٹھیں۔",
          "fr": "Rapporté par Abdullah ibn az-Zubayr : Le Messager d’Allah ﷺ a décidé que les deux adversaires devaient être assis en face du juge",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepada kami [Mush'ab bin Tsabit] dari [Abdullah bin Az Zubair] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memutuskan, bahwa dua orang yang saling berselisih hendaklah duduk di hadapan hakim",
          "tr": "Abdullah b. ez-Zübeyr'den, (şöyle) dediği rivayet olunmuştur: Rasûlullah (s.a.v.), davacı ile davalının hâkimin önünde oturmalarını emretti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 18
      },
      "narrator": {
        "en": "Abdullah ibn az-Zubayr"
      }
    },
    {
      "hadithNumber": 3589,
      "arabicNumber": 3589,
      "book": 25,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّهُ كَتَبَ إِلَى ابْنِهِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَقْضِي الْحَكَمُ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abd al-Rahman bin Abi Bakrah reported on the authority of his father that he wrote to his son:The Messenger of Allah (ﷺ) said: A judge should not decide between the two while he is in anger",
          "ur": "ابوبکرہ رضی اللہ عنہ سے روایت ہے انہوں نے اپنے بیٹے کے پاس لکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: غصے کی حالت میں قاضی دو آدمیوں کے درمیان فیصلہ نہ کرے ۔",
          "fr": "Abd al-Rahman bin Abi Bakrah a rapporté de la part de son père qu’il a écrit à son fils : Le Messager d’Allah ﷺ a dit : « Un juge ne doit pas rendre de jugement entre deux personnes lorsqu’il est en colère. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abdul Malik bin 'Umair] ia berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Bakrah] dari [Ayahnya] bahwa ia menulis surat kepada anaknya, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang hakim tidak boleh memberikan keputusan di antara dua orang sementara ia sedang dalam keadaan marah",
          "tr": "Abdurrahman b. Ebî Bekre'nin, babası (Ebû Bekre)'den naklettiğine göre; Ebû Bekre, (Sicistan'da hâkimlik görevinde bulunan Ubeydullah isimli) oğluna bir mektup yazarak, Rasûlullah (s.a.v.)'in şöyle buyurdu­ğunu bildirmiştir: \"Hâkim öfkeli iken iki kişi arasında hüküm veremez"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (7158) Sahih Muslim (1717)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 3590,
      "arabicNumber": 3590,
      "book": 25,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏{‏ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ‏}‏ فَنُسِخَتْ قَالَ ‏{‏ فَاحْكُمْ بَيْنَهُمْ بِمَا أَنْزَلَ اللَّهُ ‏}‏ ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas said:The Qur'anic verse: \"If they do come to thee, either judge between them, or decline to interfere\" was abrogated by the verse: \"So judge between them by what Allah hath revealed",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں آیت کریمہ «فإن جاءوك فاحكم بينهم أو أعرض عنهم» جب کافر آپ کے پاس آئیں تو آپ چاہیں تو فیصلہ کریں یا فیصلہ سے اعراض کریں ( سورۃ المائدہ: ۴۲ ) منسوخ ہے، اور اب یہ ارشاد ہے «فاحكم بينهم بما أنزل الله» تو ان کے معاملات میں اللہ کی نازل کردہ وحی کے مطابق فیصلہ کیجئے ( سورۃ المائدہ: ۴۸ ) ۔",
          "fr": "Ibn 'Abbas a dit : Le verset du Coran : « S’ils viennent à toi, juge entre eux ou détourne-toi d’eux » a été abrogé par le verset : « Juge entre eux selon ce qu’Allah a révélé. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi] telah menceritakan kepadaku [Ali bin Husain] dari [Ayahnya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Ayat: '(Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka) ' (Qs. Al Maidah: 42), dihapus dan diganti dengan ayat: '(maka putuskanlah perkara mereka menurut apa yang Allah turunkan) ' (Qs. Al Maidah:)",
          "tr": "İbn Abbas'tan, şöyle dediği rivayet olunmuştur: \"Sana gelirlerse ister aralarında hükmet, ister onlara yüz çevir\"[Mâide 42] (âyeti kerimesi) neshedilmiştir. (Çünkü Yüce Allah daha sonra indirdiği başka bir âyet-i kerimesinde): \"Ve aralarında Allah'ın indirdiği ile hükmet\" buyurmuştur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 3591,
      "arabicNumber": 3591,
      "book": 25,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ‏}‏ ‏{‏ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ‏}‏ الآيَةَ قَالَ كَانَ بَنُو النَّضِيرِ إِذَا قَتَلُوا مِنْ بَنِي قُرَيْظَةَ أَدَّوْا نِصْفَ الدِّيَةِ وَإِذَا قَتَلَ بَنُو قُرَيْظَةَ مِنْ بَنِي النَّضِيرِ أَدَّوْا إِلَيْهِمُ الدِّيَةَ كَامِلَةً فَسَوَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمْ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Abbas: When this verse was revealed: \"If they do come to thee, either judge between them, or decline to interfere....If thou judge, judge in equity between them.\" Banu an-Nadir used to pay half blood-money if they killed any-one from Banu Qurayzah. When Banu Qurayzah killed anyone from Banu an-Nadir, they would pay full blood-money. So the Messenger of Allah (ﷺ) made it equal between them",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں جب یہ آیت «فإن جاءوك فاحكم بينهم أو أعرض عنهم» جب کافر آپ کے پاس آئیں تو آپ ان کا فیصلہ کریں یا نہ کریں ( سورۃ المائدہ: ۴۲ ) «وإن حكمت فاحكم بينهم بالقسط» اور اگر تم ان کے درمیان فیصلہ کرو تو عدل و انصاف کے ساتھ فیصلہ کرو ( سورۃ المائدہ: ۴۲ ) نازل ہوئی تو دستور یہ تھا کہ جب بنو نضیر کے لوگ قریظہ کے کسی شخص کو قتل کر دیتے تو وہ آدھی دیت دیتے، اور جب بنو قریظہ کے لوگ بنو نضیر کے کسی شخص کو قتل کر دیتے تو وہ پوری دیت دیتے، تو اس آیت کے نازل ہوتے ہی رسول اللہ صلی اللہ علیہ وسلم نے دیت برابر کر دی۔",
          "fr": "Rapporté par Abdullah ibn Abbas : Lorsque ce verset a été révélé : « S’ils viennent à toi, juge entre eux ou détourne-toi d’eux… Si tu juges, fais-le avec équité », Banu an-Nadir payaient la moitié du prix du sang s’ils tuaient quelqu’un de Banu Qurayzah. Mais lorsque Banu Qurayzah tuaient quelqu’un de Banu an-Nadir, ils payaient le prix du sang complet. Le Messager d’Allah ﷺ a alors rendu la justice égale entre eux",
          "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Daud bin Al Hushain] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Tatkala turun ayat ini: '(Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka; jika kamu berpaling dari mereka maka mereka tidak akan memberi mudharat kepadamu sedikitpun. Dan jika kamu memutuskan perkara mereka, maka putuskanlah (perkara itu) diantara mereka dengan adil) ' (Qs. Al Maidah: 42), Ibnu Abbas berkata, \"Dahulu jika orang-orang Bani An Nadlir membunuh orang dari Bani Quraizhah maka mereka memberikan setengah diyat (tebusan), dan apabila Bani Quraizhah membunuh sebagian orang dari Bani An Nazlir, maka mereka menunaikan diyat secara penuh. Lalu Rasulullah shallallahu 'alaihi wasallam menyamaratakan besaran diyat di antara mereka",
          "tr": "İbn Abbas'tan rivayet olunmuştur; dedi ki: \"Sana gelirlerse, ister aralarında hüküm ver ister onlardan yüz çevir\"[Mâide 42] âyet(i ile) bunun devamı (olan), \"Ve eğer hüküm verirsen aralarında adaletle hüküm ver. Çünkü Allah adalet yapanı sever.\" âyet(i) indiği sırada Nadîr oğullan Kureyzâ oğullarından (birini) öldürdüklerinde (onlara) diyetin yarısını öderlerdi. (Fakat) Kureyza oğullan Nadîr oğullarından (birini) öldürdüler mi (onlara) tam diyet öderlerdi. (Bu âyetlerin inmesi üzerine) Rasûîullah (s.a.v.), onların arasında adaletle hüküm verme esasını getirdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 21
      },
      "narrator": {
        "en": "Abdullah ibn Abbas"
      }
    },
    {
      "hadithNumber": 3592,
      "arabicNumber": 3592,
      "book": 25,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، عَنْ شُعْبَةَ، عَنْ أَبِي عَوْنٍ، عَنِ الْحَارِثِ بْنِ عَمْرِو بْنِ أَخِي الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ أُنَاسٍ، مِنْ أَهْلِ حِمْصَ مِنْ أَصْحَابِ مُعَاذِ بْنِ جَبَلٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا أَرَادَ أَنْ يَبْعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ ‏\"‏ كَيْفَ تَقْضِي إِذَا عَرَضَ لَكَ قَضَاءٌ ‏\"‏ ‏.‏ قَالَ أَقْضِي بِكِتَابِ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنْ لَمْ تَجِدْ فِي كِتَابِ اللَّهِ ‏\"‏ ‏.‏ قَالَ فَبِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ فَإِنْ لَمْ تَجِدْ فِي سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ فِي كِتَابِ اللَّهِ ‏\"‏ ‏.‏ قَالَ أَجْتَهِدُ رَأْيِي وَلاَ آلُو ‏.‏ فَضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَدْرَهُ وَقَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ لِمَا يُرْضِي رَسُولَ اللَّهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Some companions of Mu'adh ibn Jabal said:When the Messenger of Allah (ﷺ) intended to send Mu'adh ibn Jabal to the Yemen, he asked: How will you judge when the occasion of deciding a case arises? He replied: I shall judge in accordance with Allah's Book. He asked: (What will you do) if you do not find any guidance in Allah's Book? He replied: (I shall act) in accordance with the Sunnah of the Messenger of Allah (ﷺ). He asked: (What will you do) if you do not find any guidance in the Sunnah of the Messenger of Allah (ﷺ) and in Allah's Book? He replied: I shall do my best to form an opinion and I shall spare no effort. The Messenger of Allah (ﷺ) then patted him on the breast and said: Praise be to Allah Who has helped the messenger of the Messenger of Allah to find something which pleases the Messenger of Allah",
          "ur": "معاذ بن جبل رضی اللہ عنہ کے اصحاب میں سے حمص کے کچھ لوگ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو جب یمن ( کا گورنر ) بنا کرب بھیجنے کا ارادہ کیا تو آپ صلی اللہ علیہ وسلم نے ان سے پوچھا: جب تمہارے پاس کوئی مقدمہ آئے گا تو تم کیسے فیصلہ کرو گے؟ معاذ رضی اللہ عنہ نے عرض کیا: اللہ کی کتاب کے موافق فیصلہ کروں گا، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر اللہ کی کتاب میں تم نہ پا سکو؟ تو معاذ رضی اللہ عنہ نے عرض کیا: رسول اللہ صلی اللہ علیہ وسلم کی سنت کے موافق، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر سنت رسول اور کتاب اللہ دونوں میں نہ پاس کو تو کیا کرو گے؟ انہوں نے عرض کیا: پھر میں اپنی رائے سے اجتہاد کروں گا، اور اس میں کوئی کوتاہی نہ کروں گا، تو رسول اللہ صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کا سینہ تھپتھپایا، نیز آپ صلی اللہ علیہ وسلم نے فرمایا: تمام تعریفیں اس اللہ کے لیے ہیں جس نے رسول اللہ صلی اللہ علیہ وسلم کے قاصد کو اس چیز کی توفیق دی جو اللہ کے رسول کو راضی اور خوش کرتی ہے ۔",
          "fr": "Des compagnons de Mu'adh ibn Jabal ont dit : Lorsque le Messager d’Allah ﷺ a voulu envoyer Mu'adh ibn Jabal au Yémen, il lui a demandé : « Comment jugeras-tu lorsqu’un cas se présentera ? » Il a répondu : « Je jugerai selon le Livre d’Allah. » Il a demandé : « Et si tu ne trouves pas de solution dans le Livre d’Allah ? » Il a répondu : « J’agirai selon la Sunna du Messager d’Allah ﷺ. » Il a demandé : « Et si tu ne trouves pas de solution dans la Sunna du Messager d’Allah ﷺ ni dans le Livre d’Allah ? » Il a répondu : « Je ferai de mon mieux pour former une opinion et je ne ménagerai aucun effort. » Le Messager d’Allah ﷺ a alors posé sa main sur sa poitrine et a dit : « Louange à Allah qui a aidé le messager du Messager d’Allah à trouver ce qui plaît au Messager d’Allah. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dari [Syu'bah] dari [Abu 'Aun] dari [Al Harits bin 'Amru] anak saudara Al Mughirah bin Syu'bah, dari [beberapa orang penduduk Himsh] yang merupakan sebagian dari sahabat Mu'adz bin Jabal. Bahwa Rasulullah shallallahu 'alaihi wasallam ketika akan mengutus Mu'adz bin Jabal ke Yaman beliau bersabda: \"Bagaimana engkau memberikan keputusan apabila ada sebuah peradilan yang dihadapkan kepadamu?\" Mu'adz menjawab, \"Saya akan memutuskan menggunakan Kitab Allah.\" Beliau bersabda: \"Seandainya engkau tidak mendapatkan dalam Kitab Allah?\" Mu'adz menjawab, \"Saya akan kembali kepada sunnah Rasulullah shallallahu 'alaihi wasallam.\" Beliau bersabda lagi: \"Seandainya engkau tidak mendapatkan dalam Sunnah Rasulullah shallallahu 'alaihi wasallam serta dalam Kitab Allah?\" Mu'adz menjawab, \"Saya akan berijtihad menggunakan pendapat saya, dan saya tidak akan mengurangi.\" Kemudian Rasulullah shallallahu 'alaihi wasallam menepuk dadanya dan berkata: \"Segala puji bagi Allah yang telah memberikan petunjuk kepada utusan Rasulullah untuk melakukan apa yang membuat senang Rasulullah.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepadaku [Abu 'Aun] dari [Al Harits bin 'Amru] dari [beberapa orang sahabat Mu'adz] dari [Mu'adz bin Jabal] bahwa Rasulullah shallallahu 'alaihi wasallam tatkala mengutusnya ke Yaman… kemudian ia menyebutkan maknanya",
          "tr": "Hıms halkından ve Muaz b. Cebel (r.a)'in arkadaşlarından (olan) bir takım insanlardan rivayet olunduğuna göre; Rasûlullah (s.a.v.) Muaz'ı Yemen'e göndermek istediği zaman ona şöyle sormuştur: \"Bir dava ile karşılaşırsan nasıl hüküm vereceksin?\" Muaz da şöyle cevap vermiştir: Allahın Kitabıyla hüküm vereceğim. (Nebi s.a.v.:) \"Allah'ın kitabında (bir hüküm) bulamazsan? (Muaz:) Rasûlullah (s.a.v.)'ın sünnetiyle. (Nebi s.a.v.:) \"Ya Rasûlullah'ın sünnetinde ve Allah'ın Kitabında da (bir hüküm) bulamazsan?\" (Muaz:) Kendi görüşümle ictihad ederim, (hüküm vermekten) geri dönmem. Bunun üzerine Rasûlullah (s.a.v.) (Muaz'ın) göğsüne vurarak: \"Allah Rasûlünün elçisini Allah Rasûlü'nün arzusuna (muvafık hareket etmeye) muvaffak kılan Allah'a hamdolsun\" demiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 3593,
      "arabicNumber": 3593,
      "book": 25,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، حَدَّثَنِي أَبُو عَوْنٍ، عَنِ الْحَارِثِ بْنِ عَمْرٍو، عَنْ نَاسٍ، مِنْ أَصْحَابِ مُعَاذٍ عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا بَعَثَهُ إِلَى الْيَمَنِ فَذَكَرَ مَعْنَاهُ ‏.‏",
        "translations": {
          "en": "Mu'adh bin Jabal said that when the Messenger of Allah (ﷺ) sent him to the Yemen... He then narrated the rest of the tradition to the same effect",
          "ur": "معاذ بن جبل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے جب انہیں یمن کی طرف بھیجا۔ ۔ ۔، پھر راوی نے اسی مفہوم کی حدیث ذکر کی۔",
          "fr": "Mu'adh bin Jabal a dit que lorsque le Messager d’Allah ﷺ l’a envoyé au Yémen… Il a ensuite raconté le reste du récit dans le même sens",
          "tr": "Muaz b. Cebel'den, diğer bir rivayete göre de; Hz. Nebi onu Yemen'e göndereceği zaman... (aralarında geçen konuşmayı anlatırken) bir önceki (3592.) hadisin manasını zikretmiştir"
        }
      },
      "grades": [
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 3594,
      "arabicNumber": 3594,
      "book": 25,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ الدِّمَشْقِيُّ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي ابْنَ مُحَمَّدٍ - حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، أَوْ عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ - شَكَّ الشَّيْخُ - عَنْ كَثِيرِ بْنِ زَيْدٍ، عَنِ الْوَلِيدِ بْنِ رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ ‏\"‏ ‏.‏ زَادَ أَحْمَدُ ‏\"‏ إِلاَّ صُلْحًا أَحَلَّ حَرَامًا أَوْ حَرَّمَ حَلاَلاً ‏\"‏ ‏.‏ وَزَادَ سُلَيْمَانُ بْنُ دَاوُدَ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْمُسْلِمُونَ عَلَى شُرُوطِهِمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: The Prophet (ﷺ) said: Conciliation between Muslims is permissible. The narrator Ahmad added in his version: \"except the conciliation which makes lawful unlawful and unlawful lawful.\" Sulayman ibn Dawud added: The Messenger of Allah (ﷺ) said: Muslims are on (i.e. stick to) their conditions",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمانوں کے درمیان مصالحت جائز ہے ۔ احمد بن عبدالواحد نے اتنا اضافہ کیا ہے: سوائے اس صلح کے جو کسی حرام شے کو حلال یا کسی حلال شے کو حرام کر دے ۔ اور سلیمان بن داود نے اپنی روایت میں یہ اضافہ کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان اپنی شرطوں پر قائم رہیں گے ۱؎ ۔",
          "fr": "Rapporté par Abu Hurayrah : Le Prophète ﷺ a dit : « La réconciliation entre musulmans est permise. » Le narrateur Ahmad a ajouté dans sa version : « sauf la réconciliation qui rend licite ce qui est illicite et illicite ce qui est licite. » Sulayman ibn Dawud a ajouté : Le Messager d’Allah ﷺ a dit : « Les musulmans respectent leurs engagements. »",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Sulaiman bin Bilal]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Abdul Wahid Ad Dimasyqi] telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sulaiman bin Bilal] atau [Abdul Aziz bin Muhammad] -Syeikh merasa ragu- dari [Katsir bin Zaid] dari [Al Walid bin Rabah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perjanjian damai diperbolehkan di antara orang-orang Muslim.\" Ahmad menambahkan, \"kecuali perjanjian damai yang menghalalkan sesuatu yang haram atau mengharamkan yang halal.\" Sedangkan [Sulaiman bin Daud] menambahkan, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang Muslim terikat di atas syarat-syarat mereka",
          "tr": "Ebû Hureyre'den rivayet olunduğuna göre Rasûllah (s.a.v.) şöyle buyurmuştur: \"Müslümanlar arasında sulh caizdir.\" Ahmed (b. Abdulvahid ed-Dımışkî bu hadise) ilâve (olarak şu cümleyi de rivayet) etmiştir: \"Ancak bir haramı helâl kılan ya da bir helâli haram kılan sulh müstesnadır.\" Süleyman b. Dâvûd da (bu hadise) ilâve (olarak şu cümleyi rivayet) etmiştir: \"Rasûlullah (s.a.v.); Müslümanlar şartları üzerindedirler buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 24
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    },
    {
      "hadithNumber": 3595,
      "arabicNumber": 3595,
      "book": 25,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّهُ، تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي بَيْتِهِ فَخَرَجَ إِلَيْهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ وَنَادَى كَعْبَ بْنَ مَالِكٍ فَقَالَ ‏\"‏ يَا كَعْبُ ‏\"‏ ‏.‏ فَقَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَشَارَ لَهُ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ قَالَ كَعْبٌ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ka'b bin Malik said that in the time of the Messenger of Allah (ﷺ) he made demand in the mosque for payment of a debt due to him from Ibn Abi Hadrad, and their voices rose till the Messenger of Allah (ﷺ), who was in his house, heard them. The Messenger of Allah (ﷺ) then went out to them and, removing the curtain of his apartment, he called to Ka'b bin Malik, addressing:\"Ka'b!\" He said: \"At your service, Messenger of Allah.\" Thereupon he made a gesture with is hand indicating: Remit half the debt due to you. Ka'b said: \"I shall do so, Messenger of Allah.\" The Prophet (ﷺ) then said: \"Get up and discharge",
          "ur": "کعب بن مالک رضی اللہ عنہ کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد میں ابن ابی حدرد سے اپنے اس قرض کا جو ان کے ذمہ تھا مسجد کے اندر تقاضا کیا تو ان دونوں کی آوازیں بلند ہوئیں یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے سنا آپ اپنے گھر میں تھے تو آپ صلی اللہ علیہ وسلم ان دونوں کی طرف نکلے یہاں تک کہ اپنے کمرے کا پردہ اٹھا دیا، آپ صلی اللہ علیہ وسلم نے کعب بن مالک رضی اللہ عنہ کو پکارا اور کہا: اے کعب! تو انہوں نے کہا: حاضر ہوں، اللہ کے رسول! پھر آپ نے اپنے ہاتھ کے اشارے سے فرمایا کہ آدھا قرضہ معاف کر دو، کعب نے کہا: میں نے معاف کر دیا اللہ کے رسول! تب نبی کریم صلی اللہ علیہ وسلم نے ( ابن حدرد ) سے فرمایا: اٹھو اور اسے ادا کرو ۔",
          "fr": "Ka'b bin Malik a dit qu’à l’époque du Messager d’Allah ﷺ, il a réclamé dans la mosquée le paiement d’une dette que lui devait Ibn Abi Hadrad, et leurs voix se sont élevées au point que le Messager d’Allah ﷺ, qui était chez lui, les a entendus. Le Messager d’Allah ﷺ est alors sorti, a écarté le rideau de son appartement et a appelé Ka'b bin Malik en disant : « Ka'b ! » Il a répondu : « Me voici, Messager d’Allah. » Le Prophète ﷺ a alors fait un geste de la main indiquant : « Remets la moitié de la dette qu’on te doit. » Ka'b a dit : « Je le fais, Messager d’Allah. » Le Prophète ﷺ a alors dit : « Lève-toi et règle la dette. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abdullah bin Ka'b bin Malik] bahwa [Ka'b bin Malik] mengabarkan kepadanya bahwa pada masa Rasulullah shallallahu 'alaihi wasallam ia pernah menuntut hutang kepada Ibnu Abu Hadrad di masjid, kemudian suara mereka meninggi hingga Rasulullah shallallahu 'alaihi wasallam mendengar mereka berdua dari dalam rumahnya. Rasulullah shallallahu 'alaihi wasallam lantas membuka tabir kamarnya dan keluar menemui mereka. Beliau memanggil Ka'b bin Malik dan berkata: \"Wahai Ka'b!\" Kemudian Ka'ab menjawab, \"Aku penuhi panggilanmu wahai Rasulullah.\" Lalu beliau memberikan isyarat kepadanya menggunakan tangannya: \"Gugurkanlah setengah hutangmu!\" Ka'b berkata, \"Aku telah melakukannya wahai Rasulullah.\" Nabi shallallahu 'alaihi wasallam kemudian bersabda: \"Berdiri dan bayarlah hutangmu kepadanya",
          "tr": "Kâ'b b. Mâlik'in haber verdiğine göre; Kendisi, Rasûlullah (Sallallahu aleyhi ve Sellem) zamanında, İbn Ebî Hadred'de olan alacağını, (ondan) mescidde sert bir şekilde istemiş, ikisinin sesleri de evinde bulunan Rasûlullah (s.a.v.) işitecek kadar yükselmiş. Bunun üzerine Rasûlullah (s.a.v.) onlar(ın yanın)a çıkmak isteyip odasının (önünde gerili bulunan) perdesini açarak Kâ'b b. Mâlik'e; \"Ey Kâ'b!\" diye seslenmiş. (O da), \"Buyur ya Rasûlallah\" diye cevap verince, ona \"alacağının yarısını düş\" diye eliyle işaret etmiş. Kâ'b da: \"Ey Allah'ın Rasûlu, (bu tavsiyeyi derhal) yerine getiriyorum\" diye cevap vermiş. Bunun üzerine Rasûlullah (s.a.v.) (borçluya dönerek): \"Kalk, (kalan) borcunu (derhal) öde\" buyurmuştur. Diğer tahric: Buhari, salât, husûmât, sulh; Müslim, müsâkât; Nesâî, kudât; İbn Mâce, sadakat; Dârimî, buyu'; Ahmed b. Hanbel, VI"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (471) Sahih Muslim (1558)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 3596,
      "arabicNumber": 3596,
      "book": 25,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ، وَأَحْمَدُ بْنُ السَّرْحِ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ أَبَاهُ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي عَمْرَةَ الأَنْصَارِيَّ أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ أَوْ يُخْبِرُ بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا ‏\"‏ ‏.‏ شَكَّ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ أَيَّتَهُمَا قَالَ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ مَالِكٌ الَّذِي يُخْبِرُ بِشَهَادَتِهِ وَلاَ يَعْلَمُ بِهَا الَّذِي هِيَ لَهُ ‏.‏ قَالَ الْهَمْدَانِيُّ وَيَرْفَعُهَا إِلَى السُّلْطَانِ ‏.‏ قَالَ ابْنُ السَّرْحِ أَوْ يَأْتِي بِهَا الإِمَامَ ‏.‏ وَالإِخْبَارُ فِي حَدِيثِ الْهَمْدَانِيِّ ‏.‏ قَالَ ابْنُ السَّرْحِ ابْنَ أَبِي عَمْرَةَ ‏.‏ لَمْ يَقُلْ عَبْدَ الرَّحْمَنِ ‏.‏",
        "translations": {
          "en": "Zaid bin Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:\"Shall I not tell you of the best witnesses ? He is the one who produces his deposition or gives his evidence (the narrator is doubtful) before he is asked for it.\" 'Abd Allah bin Abi Bakr dobted which of them he said. Abu Dawud said: Malis said: This refers to a man gives his evidence, but he does not know for whom it is meant. Al-Hamdani said: \"He should inform the authorities. Ibn al-Sarh said: \"He should give it to the ruler. The work ikhbar (inform) occurs in the version of al-Hamdani.\" Ibn al-Sarh said: \"Ibn Abi 'Amrah and not 'Abd al-Rahman",
          "ur": "زید بن خالد جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا میں تمہیں سب سے بہتر گواہ نہ بتاؤں؟ جو اپنی گواہی لے کر حاضر ہو یا فرمایا: اپنی گواہی پیش کرے قبل اس کے کہ اس سے پوچھا جائے ۱؎ ۔ عبداللہ بن ابی بکر نے شک ظاہر کیا ہے کہ آپ صلی اللہ علیہ وسلم نے «الذي يأتي بشهادته» فرمایا، یا «يخبر بشهادته» کے الفاظ فرمائے۔ ابوداؤد کہتے ہیں: مالک کہتے ہیں: ایسا گواہ مراد ہے جو اپنی شہادت پیش کر دے اور اسے یہ علم نہ ہو کہ کس کے حق میں مفید ہے اور کس کے حق میں غیر مفید۔ ہمدانی کی روایت میں ہے: اسے بادشاہ کے پاس لے جائے، اور ابن السرح کی روایت میں ہے: اسے امام کے پاس لائے۔ لفظ «اخبار» ہمدانی کی روایت میں ہے۔ ابن سرح نے اپنی روایت میں صرف «ابن ابی عمرۃ» کہا ہے، عبدالرحمٰن نہیں کہا ہے۔",
          "fr": "Zaid bin Khalid al-Juhani a rapporté que le Messager d’Allah ﷺ a dit : « Voulez-vous que je vous dise qui sont les meilleurs témoins ? C’est celui qui présente son témoignage ou donne sa déposition (le narrateur hésite) avant qu’on ne le lui demande. » 'Abd Allah bin Abi Bakr doutait du terme exact. Abu Dawud a dit : Malik a dit : Cela concerne un homme qui donne son témoignage sans savoir pour qui il est destiné. Al-Hamdani a dit : « Il doit informer les autorités. » Ibn al-Sarh a dit : « Il doit le donner au dirigeant. » Le mot ikhbar (informer) apparaît dans la version d’al-Hamdani. Ibn al-Sarh a dit : « Ibn Abi 'Amrah et non 'Abd al-Rahman. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] dan [Ahmad bin As Sarah] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dari [Abdullah bin Abu Bakr] bahwa [Ayahnya] mengabarkan kepadanya bahwa [Abdullah bin 'Amru bin Utsman bin 'Affan] telah mengabarkan kepadanya, bahwa [Abdurrahman bin 'Amrah Al Anshari] mengabarkan kepadanya, bahwa [Zaid bin Khalid Al Juhani] mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah aku beritahukan kepada kalian tentang seorang saksi terbaik yang datang membawa kesaksiannya, atau memberi kabar mengenai kesaksiannya sebelum ia ditanya mengenainya.\" -Abdullah bin Abu Bakr merasa ragu manakah di antara keduanya yang beliau sebutkan-. Abu Daud berkata, \"Malik berkata, \"Yang mengabarkan kesaksiannya, sementara orang yang memilikinya (hak untuk diberi persaksian) tidak mengetahuinya.\" [Al Hamdani] berkata, \"Ia sampaikan kepada penguasa.\" [Ibnu As As Sarh] berkata, \"Atau ia datang membawanya kepada seorang imam.\" Bentuk pengabaran ada pada hadits Al Hamdani. Ibnu As As Sarh berkata, \"Ibnu Abu 'Amrah tidak menyebutkan nama Abdurrahman",
          "tr": "Zeyd b. Hâlid el-Cühenî (r.a), Rasûlullah (s.a.v.)'in şöyle buyurduğunu haber vermiştir: \"Size şahitlerin en hayırlısını haber vereyim mi? (Kendisinden şahitlik etmesi) istenmeden önce şahitlik (görev)ini (yerine) getiren -ya da gördüğünü haber veren- kimsedir.\" (Ravi) Abdullah b. Ebî Bekir, (babasının bu son iki cümleden) hangisini rivayet ettiğinde şüphe etmiştir. Ehû Dâvûd dedi ki: (Metinde geçen ''şahitlik etmesi kendisinden istenmeden önce şahitlik görevini yerine getiren kimse\" sözünü) Mâlik, \"(Taraflardan) lehine yarayacak kimsenin bilme(yip de kendisinin bil) diği bir delili (kendiliğinden) haber vermesidir\" diye açıkladı. el-Hemedâni (bu cümleyi), \"Bu delili sultana iletir\" diye açıkladı. İbn Şerh ise, \"Bu delili hâkimlere getirir\" diye açıkladı. Hamedânî'nin hadisinde \"ahbere\" (haber verdi) sözü vardır. İbn Şerh de, (Abdurrahman b. Ebî Ömer'den) \"İbn Ebî Ömer\" diye bahsetmiş, (fakat Adurrahman kelimesini) zikretmemiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (1719)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 3597,
      "arabicNumber": 3597,
      "book": 25,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، عَنْ يَحْيَى بْنِ رَاشِدٍ، قَالَ جَلَسْنَا لِعَبْدِ اللَّهِ بْنِ عُمَرَ فَخَرَجَ إِلَيْنَا فَجَلَسَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ حَالَتْ شَفَاعَتُهُ دُونَ حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَدْ ضَادَّ اللَّهَ وَمَنْ خَاصَمَ فِي بَاطِلٍ وَهُوَ يَعْلَمُهُ لَمْ يَزَلْ فِي سَخَطِ اللَّهِ حَتَّى يَنْزِعَ عَنْهُ وَمَنْ قَالَ فِي مُؤْمِنٍ مَا لَيْسَ فِيهِ أَسْكَنَهُ اللَّهُ رَدْغَةَ الْخَبَالِ حَتَّى يَخْرُجَ مِمَّا قَالَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Yahya ibn Rashid said:We were sitting waiting for Abdullah ibn Umar who came out to us and sat. He then said: I heard the Messenger of Allah (ﷺ) as saying: If anyone's intercession intervenes as an obstacle to one of the punishments prescribed by Allah, he has opposed Allah; if anyone disputes knowingly about something which is false, he remains in the displeasure of Allah till he desists, and if anyone makes an untruthful accusation against a Muslim, he will be made by Allah to dwell in the corrupt fluid flowing from the inhabitants of Hell till he retracts his statement",
          "ur": "یحییٰ بن راشد کہتے ہیں کہ ہم عبداللہ بن عمر رضی اللہ عنہما کے انتظار میں بیٹھے تھے، وہ ہمارے پاس آ کر بیٹھے پھر کہنے لگے: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جس نے اللہ کے حدود میں سے کسی حد کو روکنے کی سفارش کی تو گویا اس نے اللہ کی مخالفت کی، اور جو جانتے ہوئے کسی باطل امر کے لیے جھگڑے تو وہ برابر اللہ کی ناراضگی میں رہے گا یہاں تک کہ اس جھگڑے سے دستبردار ہو جائے، اور جس نے کسی مؤمن کے بارے میں کوئی ایسی بات کہی جو اس میں نہیں تھی تو اللہ اس کا ٹھکانہ جہنمیوں میں بنائے گا یہاں تک کہ اپنی کہی ہوئی بات سے توبہ کر لے ۔",
          "fr": "Yahya ibn Rashid a dit : Nous étions assis en attendant Abdullah ibn Umar qui est venu s’asseoir avec nous. Il a alors dit : « J’ai entendu le Messager d’Allah ﷺ dire : Si l’intercession de quelqu’un empêche l’application d’un des châtiments prescrits par Allah, il s’oppose à Allah. Si quelqu’un défend sciemment une cause injuste, il reste sous la colère d’Allah jusqu’à ce qu’il cesse. Et si quelqu’un accuse faussement un musulman, Allah le fera séjourner dans le liquide impur des habitants de l’Enfer jusqu’à ce qu’il retire son accusation. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami ['Umarah bin Ghaziyyah] dari [Yahya bin Rasyid] ia berkata, \"Kami duduk menunggu Abdullah bin Umar, kemudian ia keluar dan duduk bersama kami, ia lalu berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang syafa'atnya menghalanginya dari mendapatkan hukuman di antara hukuman-hukuman Allah, maka sungguh ia telah menyelisihi Allah. Barangsiapa berseteru dalam kebatilan sementara ia mengetahuinya maka ia senantiasa berada dalam kemurkaan Allah hingga ia meninggalkannya. Dan barangsiapa mengatakan pada diri seorang mukmin sesuatu yang tidak ada padanya, maka Allah akan menempatkannya dalam perasan penduduk Neraka hingga ia keluar (meninggalkan) dari apa yang ia katakan.\" Telah menceritakan kepada kami [Ali bin Al Husain bin Ibrahim] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami ['Ashim bin Muhammad bin Zaid Al 'Umari] telah menceritakan kepadaku [Al Mutsanna bin Yazid] dari [Mathar Al Warraq] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan maknanya. Ia menyebutkan, \"Barangsiapa memberikan pertolongan dalam sebuah perselisihan dengan kezhaliman maka sungguh ia telah kembali dengan membawa kemarahan Allah 'azza wajalla",
          "tr": "Abdullah b. Ömer (r.a.)'den, Rasûlullah (s.a.v.)'in şöyle buyurduğunu duyduğu rivayet edilmiştir: \"Aracılığı Allah'ın cezalarından bir cezanın yerine getirilmesine engel olan kimse Allah'a savaş açmış olur. Bile bile haksız bir davayı savunan kimse bu davadan dönünceye kadar, Allah'ın gazabına uğramaya devam eder. Bir müslüman hakkında onda olmayan şeyleri söyleyen kimseyi de Allah, söylediği (bu) sözden dönünceye kadar, cehennem ehlinin vücudundan akan irinle toprak karışımı olan bir bataklıkta tutar"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 3598,
      "arabicNumber": 3598,
      "book": 25,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ الْعُمَرِيُّ، حَدَّثَنِي الْمُثَنَّى بْنُ يَزِيدَ، عَنْ مَطَرٍ الْوَرَّاقِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ قَالَ ‏ \"‏ وَمَنْ أَعَانَ عَلَى خُصُومَةٍ بِظُلْمٍ فَقَدْ بَاءَ بِغَضَبٍ مِنَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) through different chain of narrators to the same effect. In this version he also said:\"He who assits in a dispute unjustly deserves the anger of Allah, Most High",
          "ur": "اس سند سے بھی ابن عمر رضی اللہ عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے اسی مفہوم کی حدیث روایت کی ہے اس میں ہے آپ نے فرمایا: اور جو شخص کسی مقدمے کی ناحق پیروی کرے گا، وہ اللہ کا غیظ و غضب لے کر واپس ہو گا ۔",
          "fr": "Le hadith mentionné ci-dessus a aussi été transmis par Ibn 'Umar du Prophète ﷺ à travers différentes chaînes de narrateurs dans le même sens. Dans cette version, il a aussi dit : « Celui qui aide dans un litige de façon injuste mérite la colère d’Allah, le Très-Haut. »",
          "tr": "İbn Ömer de Hz. Nebi (s.a.v.)'den (bir önceki 3597. hadis'in) manasını (rivayet etmiştir. İbn Ömer'in bu rivayetinde Hz. Peygamber) şöyle buyurmuştur: \"Her kim bir davada zulme yardımcı olursa, kuşkusuz Aziz ve Celîl olan Allah'ın gazabına uğrar.”"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 3599,
      "arabicNumber": 3599,
      "book": 25,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنِي سُفْيَانُ، - يَعْنِي الْعُصْفُرِيَّ - عَنْ أَبِيهِ، عَنْ حَبِيبِ بْنِ النُّعْمَانِ الأَسَدِيِّ، عَنْ خُرَيْمِ بْنِ فَاتِكٍ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ ‏\"‏ عُدِلَتْ شَهَادَةُ الزُّورِ بِالإِشْرَاكِ بِاللَّهِ ‏\"‏ ‏.‏ ثَلاَثَ مِرَارٍ ثُمَّ قَرَأَ ‏{‏ فَاجْتَنِبُوا الرِّجْسَ مِنَ الأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ * حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ ‏}‏ ‏.‏",
        "translations": {
          "en": "Narrated Khuraym Ibn Fatik: The Messenger of Allah (ﷺ) offered the morning prayer. When he finished it, he stood up and said three times: False witness has been made equivalent to attributing a partner to Allah. He then recited: \"So avoid the abomination of idols and avoid speaking falsehood as people pure of faith to Allah, not associating anything with Him",
          "ur": "خریم بن فاتک رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے فجر پڑھائی، جب نماز سے فارغ ہوئے تو کھڑے ہو کر آپ نے فرمایا: جھوٹی گواہی اللہ کے ساتھ شرک کرنے کے برابر ہے یہ جملہ آپ صلی اللہ علیہ وسلم نے تین بار دہرایا پھر یہ آیت پڑھی:«فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور * حنفاء لله غير مشركين به» بتوں کی گندگی اور جھوٹی باتوں سے بچتے رہو خالص اللہ کی طرف ایک ہو کر اس کے ساتھ شرک کرنے والوں میں سے ہوئے بغیر ( سورۃ الحج: ۳۰ ) ۔",
          "fr": "Rapporté par Khuraym Ibn Fatik : Le Messager d’Allah ﷺ a accompli la prière du matin. Lorsqu’il l’a terminée, il s’est levé et a dit trois fois : « Le faux témoignage est équivalent à associer un partenaire à Allah. » Il a ensuite récité : « Éloignez-vous donc de la souillure des idoles et évitez le mensonge, en étant sincères envers Allah, sans rien Lui associer. »",
          "id": "Telah menceritakan kepadaku [Yahya bin Musa Al Balkhi] telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepadaku [Sufyan Al 'Ushfuri] dari [Ayahnya] dari [Habib bin An Nu'man Al Asadi] dari [Khuraim bin Fatik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan Shalat Subuh, selesai shalat beliau bangkit dan berkata: \"Persaksian palsu disamakan dengan perbuatan mensekutukan Allah.\" Beliau mengucapkannya sebanyak tiga kali. Kemudian beliau membaca ayat: '(Maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta dengan ikhlas kepada Allah) ' (Qs. Al Hajj:)",
          "tr": "Hureym b. Fâtik'den; dedi ki: Rasûlullah (s.a.v.), (bir gün) sabah namazını kıldı, (namazı) bitince ayağa kalkarak üç defa: \"- Yalan şahitliği Allah'a şirk koşmaya denk tutulmuştur.\" buyurdu.Sonra, \"Artık -siz Allah'ı birleyen ve O'na şirk koşmayan kimseler olarak -o pis putlardan ve yalan sözden kaçının\"[Hacc 30] âyetini okudu. Diğer tahric: Tirmizî, şehadât; ibn Mâce, ahkâm; Ahmed b. Hanbel, IV"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 29
      },
      "narrator": {
        "en": "Khuraym Ibn Fatik"
      }
    },
    {
      "hadithNumber": 3600,
      "arabicNumber": 3600,
      "book": 25,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَدَّ شَهَادَةَ الْخَائِنِ وَالْخَائِنَةِ وَذِي الْغِمْرِ عَلَى أَخِيهِ وَرَدَّ شَهَادَةَ الْقَانِعِ لأَهْلِ الْبَيْتِ وَأَجَازَهَا لِغَيْرِهِمْ ‏.‏ قَالَ أَبُو دَاوُدَ الْغِمْرُ الْحِنَةُ وَالشَّحْنَاءُ وَالْقَانِعُ الأَجِيرُ التَّابِعُ مِثْلُ الأَجِيرِ الْخَاصِّ ‏.‏",
        "translations": {
          "en": "Amr bin Shu'aib on his father's authority told that his grandfather said:The Messenger of Allah (ﷺ) rejected the testimony of a deceitful man and woman, of one who harbours rancour against his brother, and he rejected the testimony of one who is dependent on a family, and he allowed his testimony for other. Abu Dawud said: Ghimr means malice and enimity ; qani (dependant), a subordinate servant like a special servant",
          "ur": "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے خیانت کرنے والے مرد، خیانت کرنے والی عورت اور اپنے بھائی سے بغض و کینہ رکھنے والے شخص کی شہادت رد فرما دی ہے، اور خادم کی گواہی کو جو اس کے گھر والوں ( مالکوں ) کے حق میں ہو رد کر دیا ہے اور دوسروں کے لیے جائز رکھا ہے۔ ابوداؤد کہتے ہیں: «غمر» کے معنیٰ: کینہ اور بغض کے ہیں، اور «قانع» سے مراد پرانا ملازم مثلاً خادم خاص ہے۔",
          "fr": "Amr bin Shu'aib, selon l’autorité de son père, a rapporté que son grand-père a dit : Le Messager d’Allah ﷺ a rejeté le témoignage d’un homme ou d’une femme trompeur, de celui qui nourrit de la rancune envers son frère, et il a rejeté le témoignage de celui qui dépend d’une famille, mais il a accepté son témoignage pour d’autres affaires. Abu Dawud a dit : Ghimr signifie malveillance et inimitié ; qani (dépendant) désigne un serviteur subordonné, comme un domestique particulier",
          "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Muhammad bin Rasyid] telah menceritakan kepada kami [Sulaiman bin Musa] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menolak persaksian orang laki-laki dan perempuan yang berkhianat serta orang yang memiliki kedengkian terhadap saudaranya. Dan beliau menolak persaksian orang yang bekerja untuk penghuni rumah, dan beliau memperbolehkan persaksian tersebut untuk orang selain mereka.\" Abu Daud berkata, \"Al Ghimru adalah permusuhan dan kebencian, sedangkan Al Qani' adalah buruh yang mengikuti seperti buruh special.\" Telah menceritakan kepada kami [Muhammad bin Khalaf bin Thariq Ar Razi] telah menceritakan kepada kami [Zaid bin Yahya bin 'Ubaid Al Khuza'i] telah menceritakan kepada kami [Sa'id bin Abdul 'Aziz] dari [Sulaiman bin Musa] dengan sanadnya, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh persaksian seorang laki-laki dan wanita yang berkhianat, dan tidak pula laki-laki serta wanita pezina dan orang yang memiliki kedengkian terhadap saudaranya",
          "tr": "Amr b. Şuayb'in dedesinden şöyle dediği rivayet olunmuştur: Rasûlullah, (emanete) hiyanet eden erkek ve kadın ile kardeşine kin besleyen kimsenin şahitliğini kabul etmedi (ği gibi, geçimini temin etmekte) bir ev halkına bağımlı olan kimsenin şahitliğini de reddetti. (Fakat bu kimsenin, bağımlı olduğu aile halkından) başkasının lehine yaptığı şahitliği geçerli saydı. Ebû Dâvûd dedi ki: (Metinde geçen) \"el-gimru\" ya da \"hinne\" kelimesi -\"eş-şahnâü\" kelimesiyle eş anlamlıdır. el-Kâni' kelimesi de (bir kimsenin kendi işinde ücretle çalıştırdığı) \"e!-ectrü'l-hass\" gibi, (kişinin kendi işine ve emrine bağlı) ücretli kimse demektir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 3601,
      "arabicNumber": 3601,
      "book": 25,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفِ بْنِ طَارِقٍ الرَّازِيُّ، حَدَّثَنَا زَيْدُ بْنُ يَحْيَى بْنِ عُبَيْدٍ الْخُزَاعِيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، بِإِسْنَادِهِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَجُوزُ شَهَادَةُ خَائِنٍ وَلاَ خَائِنَةٍ وَلاَ زَانٍ وَلاَ زَانِيَةٍ وَلاَ ذِي غِمْرٍ عَلَى أَخِيهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above (No. 3593) has also been transmitted by Sulayman ibn Musa through a different chain of narrators. This version has:The Messenger of Allah (ﷺ) said: The testimony of a deceitful man or woman, of an adulterer and adulteress, and of one who harbours rancour against his brother is not allowable",
          "ur": "اس سند سے بھی عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: خیانت کرنے والے مرد اور خیانت کرنے والی عورت کی، زانی مرد اور زانیہ عورت کی اور اپنے بھائی سے کینہ رکھنے والے شخص کی گواہی جائز نہیں ۔",
          "fr": "Rapporté par Sulayman ibn Musa : Le Messager d’Allah ﷺ a dit : « Le témoignage d’un homme ou d’une femme trompeur, d’un adultère ou d’une adultère, et de celui qui garde de la rancune contre son frère n’est pas recevable. »",
          "tr": "Süleyman b. Musa'dan; demiştir ki: Rasûlullah (s.a.v.) şöyle buyurmuştur: \"Hain erkeğin, hain kadının, zina eden erkeğin, zina eden kadın'ın, (din) kardeşlerine kin besleyen kimsenin şahitliği geçerli değildir.” Ayrıca bu hadis'i; Tirmizî, şehadât; İbn Mâce, ahkâm; Ahmed b. Hanbel, II, 204, 208, 225. te tahric ettiler"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 3602,
      "arabicNumber": 3602,
      "book": 25,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، وَنَافِعُ بْنُ يَزِيدَ، عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: The Prophet (ﷺ) said: The testimony of a nomad Arab against a townsman is not allowable",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: دیہاتی کی گواہی بستی اور شہر میں رہنے والے شخص کے خلاف جائز نہیں ۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Prophète ﷺ a dit : « Le témoignage d’un Bédouin contre un citadin n’est pas recevable. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yahya bin Ayyub] serta [Nafi' bin Yazid] dari [Ibnu Al Had] dari [Muhammad bin 'Amru bin 'Atha] dari ['Atha bin Yasar] dari [Abu Hurairah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Persaksian orang pelosok tidak berlaku untuk penduduk kota",
          "tr": "Ebû Hureyre (ra)'den rivayet olunduğuna göre; Rasûlul­lah (s.a.v.)'ın şöyle buyurduğunu duymuştur: \"Bedevinin köylü aleyhindeki şahitliği geçerli değildir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 32
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    },
    {
      "hadithNumber": 3603,
      "arabicNumber": 3603,
      "book": 25,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ، وَحَدَّثَنِيهِ صَاحِبٌ، لِي عَنْهُ - وَأَنَا لِحَدِيثِ، صَاحِبِي أَحْفَظُ - قَالَ تَزَوَّجْتُ أُمَّ يَحْيَى بِنْتَ أَبِي إِهَابٍ فَدَخَلَتْ عَلَيْنَا امْرَأَةٌ سَوْدَاءُ فَزَعَمَتْ أَنَّهَا أَرْضَعَتْنَا جَمِيعًا فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَأَعْرَضَ عَنِّي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا لَكَاذِبَةٌ ‏.‏ قَالَ ‏ \"‏ وَمَا يُدْرِيكَ وَقَدْ قَالَتْ مَا قَالَتْ دَعْهَا عَنْكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Uqbah bin al-Harith said:\"I married Umm Yahya daughter of Abu Ihab. A black woman entered upon us. She said that she had suckled both of us. So I came to the Prophet (ﷺ), and amentioned it to him. He turned away from me. I said (to him): Messenger of Allah! she is a liar. He said: What do you know? She has said what she has said. Separate yourself from her (wife)",
          "ur": "ابن ابی ملیکہ کہتے ہیں کہ مجھ سے عقبہ بن حارث نے اور میرے ایک دوست نے انہیں کے واسطہ سے بیان کیا اور مجھے اپنے دوست کی روایت زیادہ یاد ہے وہ ( عقبہ ) کہتے ہیں: میں نے ام یحییٰ بنت ابی اہاب سے شادی کی، پھر ہمارے پاس ایک کالی عورت آ کر بولی: میں نے تم دونوں ( میاں، بیوی ) کو دودھ پلایا ہے ۱؎، میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے اس واقعہ کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے مجھ سے چہرہ پھیر لیا، میں نے عرض کیا: اللہ کے رسول! وہ عورت جھوٹی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں کیا معلوم؟ اسے جو کہنا تھا اس نے کہہ دیا، تم اسے اپنے سے علیحدہ کر دو ۔",
          "fr": "Rapporté par Uqbah ibn al-Harith : J’ai épousé Umm Yahya, la fille d’Abu Ihab. Une femme noire est entrée chez nous et a dit qu’elle nous avait tous les deux allaités. Je suis donc allé voir le Prophète ﷺ pour lui en parler. Il s’est détourné de moi. J’ai dit : « Messager d’Allah ! Elle ment. » Il a répondu : « Comment peux-tu en être sûr ? Elle a dit ce qu’elle a dit. Sépare-toi d’elle (ta femme). »",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ibnu Abu Mulaikah] telah menceritakan kepadaku ['Uqbah bin Al Harits] dan telah menceritakannya kepadaku [sahabatku], dan aku lebih hafal terhadap hadits sahabatku, ia berkata, \"Aku menikahi Ummu Yahya binti Abu Ihab, kemudian seorang wanita hitam datang kepadaku dan mengaku bahwa ia telah menyusui kami semua. Lalu aku datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepadanya. Beliau pun berpaling dariku, lalu aku katakan, \"Wahai Rasulullah, sesungguhnya ia telah berdusta.\" Beliau bersabda: \"Bagaimana engkau mengetahui, sementara ia telah mengatakan apa yang telah ia katakan. Tinggalkan wanita (isterimu) tersebut!\" Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani] telah menceritakan kepada kami [Al Harits bin 'Umair Al Bashri]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulaiyyah] keduanya berasal dari [Ayyub] dari [Ibnu Abu Mulaikah] dari ['Ubaid bin Abu Maryam] dari ['Uqbah bin Al Harits] aku telah mendengarnya dari 'Uqbah, akan tetapi aku lebih hafal dengan hadits 'Ubaid…lalu ia menyebutkan maknanya.\" Abu Daud berkata; [Hammad bin Zaid] melihat kepada Al Harits bin 'Umair kemudian berkata, \"Orang ini termasuk di antara sahabat-sahabat Ayyub yang tsiqah",
          "tr": "İbn Ebî Müleyke'den (rivayet olunduğuna göre) Ukbe b. Haris şöyle demiştir: Ben Ümmü Yahya binti Ebî İhâb ile evlenmiştim. Siyah bir kadın yanımıza gelip ikimizi birden emzirdiğini iddia etti. Bunun üzerine Nebi (s.a.v.)'e varıp bu durumu kendisine anlattım. Benden yüz çevirdi, (söyleyeceklerimi dinlemek istemedi). Ey Allah'ın Rasûlü, o kadın kesinlikle yalancıdır! dedim. \"Ne biliyorsun? O söylediğini söyledi. Sen artık (evlendiğin) o kadını bırak\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (5104)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 3604,
      "arabicNumber": 3604,
      "book": 25,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ، حَدَّثَنَا الْحَارِثُ بْنُ عُمَيْرٍ الْبَصْرِيُّ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، كِلاَهُمَا عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُبَيْدِ بْنِ أَبِي مَرْيَمَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، - وَقَدْ سَمِعْتُهُ مِنْ، عُقْبَةَ وَلَكِنِّي لِحَدِيثِ عُبَيْدٍ أَحْفَظُ - فَذَكَرَ مَعْنَاهُ ‏.‏ قَالَ أَبُو دَاوُدَ نَظَرَ حَمَّادُ بْنُ زَيْدٍ إِلَى الْحَارِثِ بْنِ عُمَيْرٍ فَقَالَ هَذَا مِنْ ثِقَاتِ أَصْحَابِ أَيُّوبَ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by 'Uqbah bin al-Harith to the same effect through a different chain of narrators. Abu Dawud said:Hammad bin Zaid looked at al-Harith bin 'Umair and said: He is from reliable narrators from Ayyub",
          "ur": "اس سند سے بھی ابن ابی ملیکہ سے روایت ہے، وہ عبید بن ابی مریم سے روایت کرتے ہیں اور وہ عقبہ بن حارث سے، ابن ابی ملیکہ کا کہنا ہے کہ میں نے اسے براہ راست عقبہ سے بھی سنا ہے لیکن عبید کی روایت مجھے زیادہ اچھی طرح یاد ہے، پھر انہوں نے اسی مفہوم کی حدیث ذکر کی۔ ابوداؤد کہتے ہیں: حماد بن زید نے حارث بن عمیر کو دیکھا تو انہوں نے کہا: یہ ایوب کے ثقہ تلامذہ میں سے ہیں۔",
          "fr": "Rapporté par Uqbah ibn al-Harith : Ce récit a également été rapporté par Uqbah ibn al-Harith avec une autre chaîne de transmetteurs, dans le même sens. Abu Dawud a dit : Hammad ibn Zaid a regardé al-Harith ibn Umair et a dit : « C’est un transmetteur fiable venant de Ayyub. »",
          "tr": "(Bir önceki 3603. hadisi) İbn Ebî Müleyke, Ukbe b. el-Hâris'ten (bir de) Ubeyd b. Ebî Meryem vastasıyla rivayet etmiştir. (Bir defasında da İbn Ebî Müleyke bir önceki hadisin manasını (doğrudan doğruya Ukbe'den, rivayet etmiş (ve şöyle demiştir): \"Ben bu hadisi (bizzat) Ukbe'den (de) işittim, fakat arkadaşımın rivayetini daha iyi bel­ledim.\" Ebû Dâvûd dedi ki: (Bu hadisin ravilerinden) Hammâd b. Zeyd, Haris b. Umeyr'e bakıp: Bu (zat) Uyyub'un (ders) arkadaşlarının güvenilenlerindendir, dedi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 3605,
      "arabicNumber": 3605,
      "book": 25,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا زَكَرِيَّا، عَنِ الشَّعْبِيِّ، أَنَّ رَجُلاً، مِنَ الْمُسْلِمِينَ حَضَرَتْهُ الْوَفَاةُ بِدَقُوقَاءَ هَذِهِ وَلَمْ يَجِدْ أَحَدًا مِنَ الْمُسْلِمِينَ يُشْهِدُهُ عَلَى وَصِيَّتِهِ فَأَشْهَدَ رَجُلَيْنِ مِنْ أَهْلِ الْكِتَابِ فَقَدِمَا الْكُوفَةَ فَأَتَيَا أَبَا مُوسَى الأَشْعَرِيَّ فَأَخْبَرَاهُ وَقَدِمَا بِتَرِكَتِهِ وَوَصِيَّتِهِ ‏.‏ فَقَالَ الأَشْعَرِيُّ هَذَا أَمْرٌ لَمْ يَكُنْ بَعْدَ الَّذِي كَانَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَحْلَفَهُمَا بَعْدَ الْعَصْرِ بِاللَّهِ مَا خَانَا وَلاَ كَذِبَا وَلاَ بَدَّلاَ وَلاَ كَتَمَا وَلاَ غَيَّرَا وَإِنَّهَا لَوَصِيَّةُ الرَّجُلِ وَتَرِكَتُهُ فَأَمْضَى شَهَادَتَهُمَا ‏.‏",
        "translations": {
          "en": "Ash-Sha'bi said:A Muslim was about to die at Daquqa', but he did not find any Muslim to call him for witness to his will. So he called two men of the people of the Book for witness. Then they came to Kufah, and approaching AbuMusa al-Ash'ari they informed him (about his) will. They brought his inheritance and will. Al-Ash'ari said: This is an incident (like) which happened in the time of the Messenger of Allah (ﷺ) and never occurred after him. So he made them to swear by Allah after the afternoon prayer to the effect that they had not misappropriated, nor told a lie, nor changed, nor concealed, nor altered, and that it was the will of the man and his inheritance. He then executed their witness",
          "ur": "شعبی کہتے ہیں کہ ایک مسلمان شخص مقام دقوقاء میں مرنے کے قریب ہو گیا اور اسے کوئی مسلمان نہیں مل سکا جسے وہ اپنی وصیت پر گواہ بنائے تو اس نے اہل کتاب کے دو شخصوں کو گواہ بنایا، وہ دونوں کوفہ آئے اور ابوموسیٰ رضی اللہ عنہ سے اسے بیان کیا اور اس کا ترکہ بھی لے کر آئے اور وصیت بھی بیان کی، تو اشعری رضی اللہ عنہ نے کہا: یہ تو ایسا معاملہ ہے جو عہد نبوی صلی اللہ علیہ وسلم میں صرف ایک مرتبہ ہوا اور اس کے بعد ایسا واقعہ پیش نہیں آیا، پھر ابوموسیٰ رضی اللہ عنہ نے ان دونوں کو عصر کے بعد قسم دلائی کہ: قسم اللہ کی، ہم نے نہ خیانت کی ہے اور نہ جھوٹ کہا ہے، اور نہ ہی کوئی بات بدلی ہے نہ کوئی بات چھپائی ہے اور نہ ہی کوئی ہیرا پھیری کی، اور بیشک اس شخص کی یہی وصیت تھی اور یہی ترکہ تھا۔ پھر ابوموسیٰ رضی اللہ عنہ نے ان دونوں کی شہادتیں قبول کر لیں ( اور اسی کے مطابق فیصلہ کر دیا ) ۔",
          "fr": "Ash-Sha’bi a dit : Un musulman était sur le point de mourir à Daquqa’, mais il n’a trouvé aucun musulman pour témoigner de son testament. Il a donc appelé deux hommes parmi les gens du Livre comme témoins. Ensuite, ils sont venus à Koufa et ont informé Abu Musa al-Ash’ari de son testament. Ils ont apporté son héritage et son testament. Al-Ash’ari a dit : « C’est un cas qui s’est produit à l’époque du Messager d’Allah ﷺ et qui ne s’est jamais reproduit après lui. » Il leur a alors fait jurer par Allah, après la prière de l’après-midi, qu’ils n’avaient ni détourné, ni menti, ni modifié, ni caché, ni changé quoi que ce soit, et que c’était bien le testament et l’héritage de cet homme. Il a alors accepté leur témoignage",
          "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Zakaria] dari [Asy Sya'bi] bahwa seorang muslim meninggal di Daquqa` (daerah antara Baghdad dan Irbil), dan tidak ada seseorang yang bisa menjadi saksi terhadap wasiatnya. Kemudian ada dua orang ahli kitab memberi persaksian hingga mereka pun datang ke Kufah menemui [Abu Musa Al Asy'ari] dan mengabarkan hal tersebut. keduanya datang dengan membawa harta warisan dan wasiat orang yang meninggal tersebut, Abu Musa Al Asy'ari lalu berkata, \"Ini adalah permasalahan yang belum pernah terjadi sejak zaman Rasulullah shallallahu 'alaihi wasallam.\" Lalu Abu Musa meminta mereka berdua agar bersumpah dengan nama Allah bahwa mereka tidak berkhianat, tidak berdusta, tidak mengganti, tidak menyembunyikan serta tidak merubah, dan bahwa wasiat dan harta wasiatnya itu adalah wasiat laki-laki tersebut. Abu Musa kemudian menerima persaksian mereka berdua",
          "tr": "Şa'bî'den rivayet olunduğuna göre; Müslümanlardan birine şu Dakûkâ (denilen yer) de eceli gelmiş, vasiyetine şahit olacak müslüman bir kimse bulamamış. (Ancak) kitap ehlinden iki adamı şahit tutmuş. (Kitap ehlinden olan bu iki şahit) Kûfe'ye gelip Ebû Musa el-Eş'arî'nin yanına varmışlar, (durumu ona) anlatmışlar, (vefat eden zatın) mallarını da ona getiri (ip teslim et) mişler. Bunun üzerine Ebû Musa el-Eş'arî: \"Bu, Rasûlullah (s:a) zamanından sonra (bugüne kadar hiç) olmamış bir hâdisedir.\" dedi ve onlara ikindiden sonra; (şahitliklerinde) hiyanet etmediklerine, yalan söylemediklerine, (gerçeği) değiştirmediklerine, saklamadıklarına, bozmadıklarına, bu vasiyetin (yolculukta vefat eden zatın) vasiyyeti, (malların da yine o zatın) geride bıraktığı malları olduğuna dair Allah'a yemin ettirip şahitliklerini geçerli kıldı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 3606,
      "arabicNumber": 3606,
      "book": 25,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ رَجُلٌ مِنْ بَنِي سَهْمٍ مَعَ تَمِيمٍ الدَّارِيِّ وَعَدِيِّ بْنِ بَدَّاءَ فَمَاتَ السَّهْمِيُّ بِأَرْضٍ لَيْسَ بِهَا مُسْلِمٌ فَلَمَّا قَدِمَا بِتَرِكَتِهِ فَقَدُوا جَامَ فِضَّةٍ مُخَوَّصًا بِالذَّهَبِ فَأَحْلَفَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ وُجِدَ الْجَامُ بِمَكَّةَ فَقَالُوا اشْتَرَيْنَاهُ مِنْ تَمِيمٍ وَعَدِيٍّ فَقَامَ رَجُلاَنِ مِنْ أَوْلِيَاءِ السَّهْمِيِّ فَحَلَفَا لَشَهَادَتُنَا أَحَقُّ مِنْ شَهَادَتِهِمَا وَإِنَّ الْجَامَ لِصَاحِبِهِمْ ‏.‏ قَالَ فَنَزَلَتْ فِيهِمْ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ ‏}‏ الآيَةَ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah Ibn Abbas: A man from Banu Sahm went out with Tamim ad-Dari and Adi ibn Badda'. The man of Banu Sahm died in the land where no Muslim was present. When they returned with his inheritance, they (the heirs) did not find a silver cup with lines of gold (in his property). The Messenger of Allah (ﷺ) administered on oath to them. The cup was then found (with someone) at Mecca. They said: We have bought it from Tamim and Adi. Then two men from the heirs of the man of Banu Sahm got up and swore saying: Our witness is more reliable than their witness. They said that the cup belonged to their man. He (Ibn Abbas) said: The following verse was revealed about them: \"O ye who believe! when death approaches any of you",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ بنو سہم کا ایک شخص تمیم داری اور عدی بن بداء کے ساتھ نکلا تو سہمی ایک ایسی سر زمین میں مر گیا جہاں کوئی مسلمان نہ تھا، جب وہ دونوں اس کا ترکہ لے کر آئے تو لوگوں نے اس میں چاندی کا وہ گلاس نہیں پایا جس پر سونے کا پتر چڑھا ہوا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کو قسم دلائی، پھر وہ گلاس مکہ میں ملا تو ان لوگوں نے کہا: ہم نے اسے تمیم اور عدی سے خریدا ہے تو اس سہمی کے اولیاء میں سے دو شخص کھڑے ہوئے اور ان دونوں نے قسم کھا کر کہا کہ ہماری گواہی ان دونوں کی گواہی سے زیادہ معتبر ہے اور گلاس ان کے ساتھی کا ہے۔ راوی کہتے ہیں: یہ آیت: «يا أيها الذين آمنوا شهادة بينكم إذا حضر أحدكم الموت» سورة المائدة: ( ۱۰۶ ) انہی کی شان میں اتری ۱؎۔",
          "fr": "Rapporté par Abdullah ibn Abbas رضي الله عنه : Un homme de Banu Sahm est parti avec Tamim ad-Dari et Adi ibn Badda’. L’homme de Banu Sahm est décédé dans un endroit où il n’y avait aucun musulman. Quand ils sont revenus avec son héritage, les héritiers n’ont pas trouvé une coupe en argent ornée de lignes d’or parmi ses biens. Le Messager d’Allah ﷺ leur a fait prêter serment. La coupe a ensuite été retrouvée à La Mecque. On a dit : « Nous l’avons achetée à Tamim et Adi. » Deux hommes parmi les héritiers se sont alors levés et ont juré : « Notre témoignage est plus fiable que le leur. » Ils ont affirmé que la coupe appartenait à leur parent. Ibn Abbas a dit : « Le verset suivant a été révélé à leur sujet : “Ô vous qui croyez ! Lorsque la mort s’approche de l’un de vous…” »",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Ibnu Abu Zaidah] dari [Muhammad bin Abu Al Qasim] dari [Abdul Malik bin Sa'id bin Jubair] dari [Ayahnya] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki Bani Sahm keluar bersama Tamim Ad Dari dan 'Udai bin Badda, kemudian orang dari Bani Sahm tersebut meninggal di negeri yang tidak ada seorang Muslim pun di dalamnya. Kemudian tatkala mereka berdua datang dengan membawa harta warisannya mereka kehilangan gelas perak yang terukir dengan emas seperti daun kurma. Lalu Rasulullah shallallahu 'alaihi wasallam meminta mereka berdua agar bersumpah, dan gelas itu kemudian ditemukan di Makkah, keduanya lalu berkata, \"Kami membelinya dari Tamim dan 'Udai.\" Dua orang dari wali laki-laki Bani As Sahm kemudian berdiri dan bersumpah, 'Sungguh persaksian kami lebih berhak dari pada persaksian mereka berdua. ' Dan sesungguhnya gelas tersebut adalah milik sahabat mereka.\" Jubair berkata, \"Kemudian turunlah ayat: '(Hai orang-orang yang beriman, apabila salah seorang kamu menghadapi kematian, sedang dia akan berwasiat, maka hendaklah (wasiat itu) disaksikan oleh dua orang yang adil di antara kamu, atau dua orang yang berlainan agama dengan kamu, jika kamu dalam perjalanan di muka bumi lalu kamu ditimpa bahaya kematian. Kamu tahan kedua saksi itu sesudah sembahyang (untuk bersumpah), lalu mereka keduanya bersumpah dengan nama Allah, jika kamu ragu-ragu: \"(Demi Allah) kami tidak akan membeli dengan sumpah ini harga yang sedikit (untuk kepentingan seseorang), walaupun dia karib kerabat, dan tidak (pula) kami menyembunyikan persaksian Allah; sesungguhnya kami kalau demikian tentulah termasuk orang-orang yang berdosa) ' (Qs. Al Maidah:)",
          "tr": "İbn Abbas (r.a)'dan, şöyle dediğrrivayet olunmuştur: Sehm.oğullarından (Büdeyl isimli müslüman) bir adam,. Temîm ed-Dârî ve Adiyy b. Beddâ ile (bir yolculuğa) çıkmıştı., (Yol'da) Sehm oğullarına mensub olan (bu müslüman) kimse, hiçbir müslümanın bulunmadığı bir yerde vefat etti. (Yol arkadaşları, onım) geriye kalan mallarını getirdikleri zaman (vefat eden zatın ailesi,sanun bıraktığı) altın süslerle kaplı gümüş bir kabı bulamadılar. Bunım üzerine Rasülullah (s.a.v.), (bu kabın kendi yanlarında olmadığına dair) vefat eden zatın yol arkadaşlarına yemin ettirdi, (Onlar da yemin ettiler. Bir süre) sonra; kab Mekke'de (bazı kimselerin elinde) bulundu. (Bunlar; biz) bu kabı Temîm ile Adiyy'den satın aldık, dediler. (Vefat eden) Sehm kabilesine mensup zatın yakınlarından iki adam ayağa kalkarak: (Müslüman olarak) bizimi şahitliğimiz Temîm ile Adiyy'in şahitliğinden daha doğrudur ve bu kab bizim (vçfat eden) arkadaşımızın-dır, diye yemin ettiler. (İbn Abbas sözlerine devam ederek) dedi ki: \"Ey inananlar, birinize ölüm gelince vasiyyet sırasında içinizden iki adil kişi şahitlik etsin\"[Mâide 106] âyet-i kerimesi onlar hakkında inmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (2780)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 36
      },
      "narrator": {
        "en": "Abdullah Ibn Abbas"
      }
    },
    {
      "hadithNumber": 3607,
      "arabicNumber": 3607,
      "book": 25,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، أَنَّ الْحَكَمَ بْنَ نَافِعٍ، حَدَّثَهُمْ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ، أَنَّ عَمَّهُ، حَدَّثَهُ وَهُوَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم ابْتَاعَ فَرَسًا مِنْ أَعْرَابِيٍّ فَاسْتَتْبَعَهُ النَّبِيُّ صلى الله عليه وسلم لِيَقْضِيَهُ ثَمَنَ فَرَسِهِ فَأَسْرَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَشْىَ وَأَبْطَأَ الأَعْرَابِيُّ فَطَفِقَ رِجَالٌ يَعْتَرِضُونَ الأَعْرَابِيَّ فَيُسَاوِمُونَهُ بِالْفَرَسِ وَلاَ يَشْعُرُونَ أَنَّ النَّبِيَّ صلى الله عليه وسلم ابْتَاعَهُ فَنَادَى الأَعْرَابِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنْ كُنْتَ مُبْتَاعًا هَذَا الْفَرَسَ وَإِلاَّ بِعْتُهُ ‏.‏ فَقَامَ النَّبِيُّ صلى الله عليه وسلم حِينَ سَمِعَ نِدَاءَ الأَعْرَابِيِّ فَقَالَ ‏\"‏ أَوَلَيْسَ قَدِ ابْتَعْتُهُ مِنْكَ ‏\"‏ ‏.‏ فَقَالَ الأَعْرَابِيُّ لاَ وَاللَّهِ مَا بِعْتُكَهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَلَى قَدِ ابْتَعْتُهُ مِنْكَ ‏\"‏ ‏.‏ فَطَفِقَ الأَعْرَابِيُّ يَقُولُ هَلُمَّ شَهِيدًا ‏.‏ فَقَالَ خُزَيْمَةُ بْنُ ثَابِتٍ أَنَا أَشْهَدُ أَنَّكَ قَدْ بَايَعْتَهُ ‏.‏ فَأَقْبَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى خُزَيْمَةَ فَقَالَ ‏\"‏ بِمَ تَشْهَدُ ‏\"‏ ‏.‏ فَقَالَ بِتَصْدِيقِكَ يَا رَسُولَ اللَّهِ ‏.‏ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهَادَةَ خُزَيْمَةَ بِشَهَادَةِ رَجُلَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated Uncle of Umarah ibn Khuzaymah: The Prophet (ﷺ) bought a horse from a Bedouin. The Prophet (ﷺ) took him with him to pay him the price of his horse. The Messenger of Allah (ﷺ) walked quickly and the Bedouin walked slowly. The people stopped the Bedouin and began to bargain with him for the horse as and they did not know that the Prophet (ﷺ) had bought it. The Bedouin called the Messenger of Allah (ﷺ) saying: If you want this horse, (then buy it), otherwise I shall sell it. The Prophet (ﷺ) stopped when he heard the call of the Bedouin, and said: Have I not bought it from you? The Bedouin said: I swear by Allah, I have not sold it to you. The Prophet (ﷺ) said: Yes, I have bought it from you. The Bedouin began to say: Bring a witness. Khuzaymah ibn Thabit then said: I bear witness that you have bought it. The Prophet (ﷺ) turned to Khuzaymah and said: On what (grounds) do you bear witness? He said: By considering you trustworthy, Messenger of Allah (ﷺ)! The Prophet (ﷺ) made the witness of Khuzaymah equivalent to the witness of two people",
          "ur": "عمارہ بن خزیمہ کہتے ہیں: ان کے چچا نے ان سے بیان کیا اور وہ نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے تھے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک اعرابی سے ایک گھوڑا خریدا، آپ اسے اپنے ساتھ لے آئے تاکہ گھوڑے کی قیمت ادا کر دیں، آپ صلی اللہ علیہ وسلم جلدی جلدی چلنے لگے، دیہاتی نے تاخیر کر دی، پس کچھ لوگ دیہاتی کے پاس آنا شروع ہوئے اور گھوڑے کا مول بھاؤ کرنے لگے اور وہ لوگ یہ نہ سمجھ سکے کہ نبی اکرم صلی اللہ علیہ وسلم نے اسے خرید لیا ہے، چنانچہ دیہاتی نے رسول اللہ صلی اللہ علیہ وسلم کو پکارا اور کہا: اگر آپ اسے خریدتے ہیں تو خرید لیجئے ورنہ میں نے اسے بیچ دیا، دیہاتی کی آواز سن کر نبی اکرم صلی اللہ علیہ وسلم کھڑے ہو گئے اور فرمایا: کیا میں تجھ سے اس گھوڑے کو خرید نہیں چکا؟ دیہاتی نے کہا: نہیں، قسم اللہ کی، میں نے اسے آپ سے فروخت نہیں کیا ہے، پھر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کیوں نہیں؟ میں اسے تم سے خرید چکا ہوں پھر دیہاتی یہ کہنے لگا کہ گواہ پیش کیجئے، تو خزیمہ بن ثابت رضی اللہ عنہ بول پڑے کہ میں گواہی دیتا ہوں کہ تم اسے نبی اکرم صلی اللہ علیہ وسلم کو فروخت کر چکے ہو، نبی اکرم صلی اللہ علیہ وسلم خزیمہ رضی اللہ عنہ کی طرف متوجہ ہوئے اور فرمایا: تم کیسے گواہی دے رہے ہو؟ خزیمہ بن ثابت رضی اللہ عنہ نے کہا: آپ کی تصدیق کی وجہ سے، اللہ کے رسول! تو رسول اللہ صلی اللہ علیہ وسلم نے خزیمہ رضی اللہ عنہ کی گواہی کو دو آدمیوں کی گواہی کے برابر قرار دے دیا۔",
          "fr": "Rapporté par l’oncle de Umarah ibn Khuzaymah : Le Prophète ﷺ a acheté un cheval à un Bédouin. Le Prophète ﷺ l’a emmené avec lui pour le payer. Le Messager d’Allah ﷺ marchait vite et le Bédouin marchait lentement. Les gens ont arrêté le Bédouin et ont commencé à marchander avec lui pour le cheval, sans savoir que le Prophète ﷺ l’avait déjà acheté. Le Bédouin a appelé le Messager d’Allah ﷺ en disant : « Si tu veux ce cheval, achète-le, sinon je le vends à quelqu’un d’autre. » Le Prophète ﷺ s’est arrêté en entendant l’appel du Bédouin et a dit : « Ne l’ai-je pas déjà acheté chez toi ? » Le Bédouin a répondu : « Par Allah, je ne te l’ai pas vendu. » Le Prophète ﷺ a dit : « Si, je te l’ai acheté. » Le Bédouin a alors dit : « Apporte un témoin. » Khuzaymah ibn Thabit a alors dit : « J’atteste que tu l’as acheté. » Le Prophète ﷺ s’est tourné vers Khuzaymah et lui a demandé : « Sur quoi te bases-tu pour témoigner ? » Il a répondu : « Parce que je te considère digne de confiance, ô Messager d’Allah ﷺ ! » Le Prophète ﷺ a alors considéré le témoignage de Khuzaymah comme équivalent à celui de deux personnes",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] bahwa [Al Hakam bin Nafi'] telah menceritakan kepada mereka, ia berkata; telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dari ['Umarah bin Khuzaimah] bahwa [pamannya] seorang sahabat Nabi shallallahu 'alaihi wasallam, telah menceritakan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam pernah membeli seekor kuda dari seorang Arab dusun, kemudian Nabi shallallahu 'alaihi wasallam meminta kepada Arab dusun tersebut untuk mengikutinya sehingga beliau bisa membayar kuda yang dibelinya. Rasulullah shallallahu 'alaihi wasallam berjalan cepat sementara orang Arab dusun tersebut berjalan lambat. Setelah itu orang-orang datang kepada Arab dusun itu dan menawar kudanya, dan mereka tidak mengetahui bahwa Nabi shallallahu 'alaihi wasallam telah membelinya. Arab dusun itu kemudian datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Apabila engkau membeli kuda ini maka belilah, jika tidak maka aku akan menjualnya.\" Saat mendengar panggilan Arab dusun itu Nabi shallallahu 'alaihi wasallam bangkit dan berkata: \"Bukankah aku telah membelinya darimu?\" Arab dusun itu menjawab, \"Demi Allah, tidak! Aku tidak menjualnya kepadamu.\" Nabi shallallahu 'alaihi wasallam lalu berkata: \"Benar, aku telah membelinya darimu.\" Maka Arab dusun itu pun berkata, \"Berikan kepadaku seorang saksi.\" Kemudian Khuzaimah bin Tsabit berkata, \"Aku bersaksi bahwa engkau telah menjualnya.\" Lalu Nabi shallallahu 'alaihi wasallam menghadap kepada ke arah Khuzaimah dan berkata: \"Dengan apakah engkau bersaksi?\" Khuzaimah menjawab, \"Dengan membenarkanmu wahai Rasulullah!\" Lalu Rasulullah shallallahu 'alaihi wasallam menjadikan persaksian Khuzaimah sama dengan persaksian dua orang",
          "tr": "Umâre b. Huzeyme'den rivayet olunduğuna göre; Nebi (s.a.v.)'in sahâbîlerinden olan amcası ona şöyle demiştir: Nebi (s.a.v.) bedevilerden birinden bir kısrak satın aldı. Ona atının fiatını ödemek için peşinden gelmesini istedi (ve önden yürüyüp gitti). Râsulullah (s.a.v.) hızlıca yürüyordu. Bedevi ise yavaş yavaş gidiyordu. Derken halk bedevinin etrafını sarıp (onun yedeğinde bulunan) kısrağı satın almak üzere .pazarlığa giriştiler. Bu kısrağı Hz. Peygamber (s.a.v.)'in bedeviden satın aldığını bilmiyorlardı. (Halkın elindeki kısrağa daha fazla fiat verdiğini gören) bedevi, Rasûlullah (s.a.v.)'e haykırarak: Bu kısrağı alacaksan al, yoksa ben onu sattım! dedi. Rasûlullah (s.a.v.) bedevinin haykırışını işitince (yanına,varıp): \"Ben bu kısrağı senden satın almadım mı?\" diye sordu. Bedevi'nin; -Hayır vallahi, ben bunu sana satmadım; karşılığını vermesi üzerine Nebi (s.a.v.): \"Evet, ben bu kısrağı senden satın aldım\" dedi. Bedevi de; Haydi öyleyse, şahit göster; demeye başladı. Derken Huzeyme b. Sabit (ortaya atılarak bedeviye dönüp): Ben senin bu hayvanı (Hz. Nebi'e) sattığına şahitlik ederim, dedi. Nebi (s.a.v.) Huzeyme'ye dönerek: \"Neye (dayanarak) şahitlik ediyorsun?\" diye sordu. (Huzeyme de): Ey Allah'ın Rasûlü, (ben, Allah'ın) seni tasdik etmesiyle (şahitlik ediyorum) cevabını verdi. Bunun üzerine Rasûlullah (s.a.v.) Huzeyme'nin şahitliğini iki erkeğin şahitliğine denk saydı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 37
      },
      "narrator": {
        "en": "Uncle of Umarah ibn Khuzaymah"
      }
    },
    {
      "hadithNumber": 3608,
      "arabicNumber": 3608,
      "book": 25,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَالْحَسَنُ بْنُ عَلِيٍّ، أَنَّ زَيْدَ بْنَ الْحُبَابِ، حَدَّثَهُمْ حَدَّثَنَا سَيْفٌ الْمَكِّيُّ، - قَالَ عُثْمَانُ سَيْفُ بْنُ سُلَيْمَانَ - عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِيَمِينٍ وَشَاهِدٍ ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas said:The Messenger of Allah (ﷺ) gave a decision on the basis of an oath and a single witness",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک حلف اور ایک گواہ پر فیصلہ کیا ۱؎۔",
          "fr": "Ibn Abbas رضي الله عنه a dit : Le Messager d’Allah ﷺ a rendu un jugement sur la base d’un serment et d’un seul témoin",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Al Hasan bin Ali] bahwa [Zaid bin Al Hubab] menceritakan kepada mereka, ia berkata; telah menceritakan kepada kami [Saiful Makki]. [Utsman Saif bin Sulaiman] berkata dari [Qais bin Sa'd] dari ['Amru bin Dinar] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan putusan dengan adanya sumpah dan seorang saksi.\" Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Salamah bin Syabib] mereka berdua berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Muhammad bin Muslim] dari ['Amru bin Dinar] dengan sanad dan maknanya. Salamah menyebutkan dalam haditsnya; 'Amru berkata dalam masalah hak",
          "tr": "İbn Abbas'tan rivayet olunduğuna göre; Nebi (s.a.v.), bir yeminle bir şahid'e dayanarak hüküm vermiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (1712)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 3609,
      "arabicNumber": 3609,
      "book": 25,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَسَلَمَةُ بْنُ شَبِيبٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، بِإِسْنَادِهِ وَمَعْنَاهُ ‏.‏ قَالَ سَلَمَةُ فِي حَدِيثِهِ قَالَ عَمْرٌو فِي الْحُقُوقِ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by 'Amr bin Dinar through a different chain of narrators and to the same effect. Salamah has in his version:'Amr said: In the rights (of the people)",
          "ur": "اس سند سے بھی ابن عباس رضی اللہ عنہما سے اسی مفہوم کی حدیث مروی ہے سلمہ نے اپنی حدیث میں یوں کہا کہ: عمرو نے کہا ہے کہ یہ فیصلہ حقوق میں تھا ( نہ کہ حدود میں ) ۔",
          "fr": "Ce récit a également été rapporté par ‘Amr ibn Dinar avec une autre chaîne de transmetteurs, dans le même sens. Salamah rapporte dans sa version : ‘Amr a dit : « Dans les droits des gens. »",
          "tr": "(Bir önceki 3608. hadis aynı) mana ile Amr b. Dinar'dan da rivayet olunmuştur. Bu hadisi (Ebû Davud'un şeyhi Muhammed b. Yahya'ya nakleden) Seleme b. Şebîb (bu rivayetinde şöyle) dedi: \"Amr, (bu hadisin sadece) hukuk (davaların) da (geçerli olduğunu) söyledi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih Maqtu"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih Maqtu"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 3610,
      "arabicNumber": 3610,
      "book": 25,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ أَبُو مُصْعَبٍ الزُّهْرِيُّ، حَدَّثَنَا الدَّرَاوَرْدِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏ قَالَ أَبُو دَاوُدَ وَزَادَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ فِي هَذَا الْحَدِيثِ قَالَ أَخْبَرَنِي الشَّافِعِيُّ عَنْ عَبْدِ الْعَزِيزِ قَالَ فَذَكَرْتُ ذَلِكَ لِسُهَيْلٍ فَقَالَ أَخْبَرَنِي رَبِيعَةُ - وَهُوَ عِنْدِي ثِقَةٌ - أَنِّي حَدَّثْتُهُ إِيَّاهُ وَلاَ أَحْفَظُهُ ‏.‏ قَالَ عَبْدُ الْعَزِيزِ وَقَدْ كَانَ أَصَابَتْ سُهَيْلاً عِلَّةٌ أَذْهَبَتْ بَعْضَ عَقْلِهِ وَنَسِيَ بَعْضَ حَدِيثِهِ فَكَانَ سُهَيْلٌ بَعْدُ يُحَدِّثُهُ عَنْ رَبِيعَةَ عَنْهُ عَنْ أَبِيهِ ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: The Prophet (ﷺ) gave a decision on the basis of an oath and a single witness. Abu Dawud said: Al-Rabi' bin Sulaiman al-Mu'adhdhin told me some additional words in this tradition: Al-Shafi'i told me from 'Abd al-'Aziz. I then mentioned it fo Suhail who said: Rabi'ah told me - and he is reliable in my opinion - that I told him this (tradition) and I do not remember it. 'Abd al-'Aziz said: Suhail suffered from some disease which caused him to lose a little of his intelligence, and he forgot some of his traditions. Thereafter Suhail would narrate traditions from Rabi'ah on the authority of his father",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم نے گواہ کے ساتھ قسم پر فیصلہ کیا۔ ابوداؤد کہتے ہیں: ربیع بن سلیمان مؤذن نے مجھ سے اس حدیث میں «قال: أخبرني الشافعي عن عبدالعزيز» کا اضافہ کیا عبدالعزیز دراوردی کہتے ہیں: میں نے اسے سہیل سے ذکر کیا تو انہوں نے کہا: مجھے ربیعہ نے خبر دی ہے اور وہ میرے نزدیک ثقہ ہیں کہ میں نے یہ حدیث ان سے بیان کی ہے لیکن مجھے یاد نہیں۔ عبدالعزیز دراوردی کہتے ہیں: سہیل کو ایسا مرض ہو گیا تھا جس سے ان کی عقل میں کچھ فتور آ گیا تھا اور وہ کچھ احادیث بھول گئے تھے، تو سہیل بعد میں اسے «عن ربیعہ عن أبیہ» کے واسطے سے روایت کرتے تھے۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Prophète ﷺ a rendu un jugement sur la base d’un serment et d’un seul témoin. Abu Dawud a dit : Al-Rabi’ ibn Sulaiman al-Mu’adhdhin m’a rapporté quelques mots supplémentaires dans ce récit : Al-Shafi’i m’a rapporté cela de ‘Abd al-‘Aziz. Je l’ai ensuite mentionné à Suhail qui a dit : « Rabi’ah m’a rapporté cela — et il est fiable à mes yeux — que je lui ai transmis ce récit, mais je ne m’en souviens pas. » ‘Abd al-‘Aziz a dit : « Suhail a souffert d’une maladie qui lui a fait perdre un peu de sa mémoire, et il a oublié certains de ses récits. Par la suite, Suhail rapportait des récits de Rabi’ah au nom de son père. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Abu Bakr Abu Mush'ab Az Zuhri] dari [Rabi'ah bin Abu Abdurrahman] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam memberikan putusan dengan adanya sumpah dan satu orang saksi.\" Abu Daud berkata, \" [Ar Rabi' bin Sulaiman Al Muadzdzin] dalam haditsnya menambahkan kepadaku, ia berkata; telah mengabarkan kepadaku [Asy Syafi'i] dari [Abdul Aziz] ia berkata, \"Hal itu kemudian aku ceritakan kepada [Suhail], ia pun berkata; telah mengabarkan kepadaku [Rabi'ah] -dan ia menurutku adalah orang yang tsiqah- bahwa aku telah menceritakan hal tersebut kepadanya dan aku sudah tidak menghafalnya. Abdul Aziz berkata; Suhail telah terkena suatu penyakit yang menghilangkan sebagian ingatannya, hingga ia lupa sebagian haditsnya. Setelah itu ia menceritakan kepadanya dari Rabi'ah dari ayahnya.\" Telah menceritakan kepada kami [Muhammad bin Daud Al Iskandarani] telah menceritakan kepada kami [Ziyad bin Yunus] telah menceritakan kepadaku [Sulaiman bin Bilal] dari [Rabi'ah] dengan sanad Abu Mush'ab dan dengan maknanya. Sulaiman berkata, \"Kemudian aku bertemu dengan Suhail dan bertanya kepadanya mengenai hadits ini, lalu ia berkata, \"Aku tidak mengetahuinya.\" Lalu aku katakan kepadanya, \"Sesungguhnya Rabi'ah telah mengabarkannya kepadaku darimu.\" Ia berkata, \"Jika Rabi'ah pernah mengabarkan kepadamu dariku, maka ceritakan (riwayat) dari Rabi'ah dariku",
          "tr": "Ebû Hureyre'den (r.a) rivayet olunduğuna göre; Nebi (s.a.v.), bir şahitle beraber yemine dayanarak hüküm vermiştir. Ebû Dâvûd dedi ki: Rabîb. Süleyman el-Müezzin bu hadise ilâve olarak bana şunları da söyledi:. Şafiî bana, Abdülaziz'in (kendisine şunları) söylediğini haber verdi: \"Ben bu hadisi (bunu Rabîa bana senden nakletmişti diyerek) Süheyl'e okudum da Süheyl (şöyle) dedi: Bence güvenilir bir adam olan Rabîa da bana bu hadisi kedisine okuduğumu söylemişti,, fakat ben hatırlayamamıştım.\" Abdülaziz (sözlerine devamla) dedi ki: \"Gerçekten de Süheyl'e bir hastalık arız olmuş ve aklına biraz zarar vermişti. (Bu yüzden bil­diği bu) hadisin bir kısmını unutmuştu. Daha sonra o, bu .hadisi; -Rabîa'dan, o da Süheyl'den, Süheyl'in babasından- diyerek nâklederdi. Ayrıca bu hadis'i; Müslim, akdiye; Tirmizî, ahkâm; İbn Mâce, ahkâm; Muvatta, akdiye; Ahmed b. Hanbel, I, 315, 323, III, 305. te tahric ettiler"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 40
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    },
    {
      "hadithNumber": 3611,
      "arabicNumber": 3611,
      "book": 25,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ الإِسْكَنْدَرَانِيُّ، حَدَّثَنَا زِيَادٌ، - يَعْنِي ابْنَ يُونُسَ - حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ رَبِيعَةَ، بِإِسْنَادِ أَبِي مُصْعَبٍ وَمَعْنَاهُ ‏.‏ قَالَ سُلَيْمَانُ فَلَقِيتُ سُهَيْلاً فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَقَالَ مَا أَعْرِفُهُ ‏.‏ فَقُلْتُ لَهُ إِنَّ رَبِيعَةَ أَخْبَرَنِي بِهِ عَنْكَ ‏.‏ قَالَ فَإِنْ كَانَ رَبِيعَةُ أَخْبَرَكَ عَنِّي فَحَدِّثْ بِهِ عَنْ رَبِيعَةَ عَنِّي ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by Rabi'ah through the chain of Abu Mus'ab and to the same effect. Sulaiman said:I then met Suhail and asked him about this tradition. He said: I do not know it. I said to him: Rabi'ah transmitted it to me from you. He said: If Rabi'ah transmitted it to you from me, then retransmit it from Rabi'ah on my authority",
          "ur": "ابومصعب ہی کی سند سے ربیعہ سے اسی مفہوم کی حدیث مروی ہے۔ سلیمان کہتے ہیں میں نے سہیل سے ملاقات کی اور اس حدیث کے متعلق ان سے پوچھا: تو انہوں نے کہا: میں اسے نہیں جانتا تو میں نے ان سے کہا: ربیعہ نے مجھے آپ کے واسطہ سے اس حدیث کی خبر دی ہے تو انہوں نے کہا: اگر ربیعہ نے تمہیں میرے واسطہ سے خبر دی ہے تو تم اسے بواسطہ ربیعہ مجھ سے روایت کرو۔",
          "fr": "Ce récit a également été rapporté par Rabi’ah avec la chaîne de Abu Mus’ab, dans le même sens. Sulaiman a dit : J’ai ensuite rencontré Suhail et je l’ai interrogé sur ce récit. Il a dit : « Je ne le connais pas. » Je lui ai dit : « Rabi’ah me l’a transmis de ta part. » Il a dit : « Si Rabi’ah te l’a transmis de ma part, alors transmets-le de Rabi’ah en mon nom. »",
          "tr": "(Bu hadis) Ebû Mus'ab senediyle ve önceki (3610.) hadisle aynı manada Rabîa'dan da rivayet olunmuştur. Hadisi (Rabîa'dan rivayet eden) Süleyman dedi ki: Ben Süheyl'le karşılaştım ve kendisine bu hadisi sordum, \"Ben bu hadisi bilmiyorum\" cevabını verdi. Ben de kendisine, \"Onu bana Rabîa senden nakletti\" dedim. O da: \"Eğer (bu hadisi) sana Rabîa benden nakletmişse sen de onu; Rabîa'dan (naklediyorum), (Rabıa da) Süheyl'den (nakletmiştir) diye rivayet et\" cevabını verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 3612,
      "arabicNumber": 3612,
      "book": 25,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، حَدَّثَنَا عَمَّارُ بْنُ شُعَيْبِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْبِ الْعَنْبَرِيُّ، حَدَّثَنِي أَبِي قَالَ، سَمِعْتُ جَدِّيَ الزُّبَيْبَ، يَقُولُ بَعَثَ نَبِيُّ اللَّهِ صلى الله عليه وسلم جَيْشًا إِلَى بَنِي الْعَنْبَرِ فَأَخَذُوهُمْ بِرُكْبَةٍ مِنْ نَاحِيَةِ الطَّائِفِ فَاسْتَاقُوهُمْ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَرَكِبْتُ فَسَبَقْتُهُمْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ السَّلاَمُ عَلَيْكَ يَا نَبِيَّ اللَّهِ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ أَتَانَا جُنْدُكَ فَأَخَذُونَا وَقَدْ كُنَّا أَسْلَمْنَا وَخَضْرَمْنَا آذَانَ النَّعَمِ فَلَمَّا قَدِمَ بَلْعَنْبَرُ قَالَ لِي نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكُمْ بَيِّنَةٌ عَلَى أَنَّكُمْ أَسْلَمْتُمْ قَبْلَ أَنْ تُؤْخَذُوا فِي هَذِهِ الأَيَّامِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ مَنْ بَيِّنَتُكَ ‏\"‏ ‏.‏ قُلْتُ سَمُرَةُ رَجُلٌ مِنْ بَنِي الْعَنْبَرِ وَرَجُلٌ آخَرُ سَمَّاهُ لَهُ فَشَهِدَ الرَّجُلُ وَأَبَى سَمُرَةُ أَنْ يَشْهَدَ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَبَى أَنْ يَشْهَدَ لَكَ فَتَحْلِفُ مَعَ شَاهِدِكَ الآخَرِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ فَاسْتَحْلَفَنِي فَحَلَفْتُ بِاللَّهِ لَقَدْ أَسْلَمْنَا يَوْمَ كَذَا وَكَذَا وَخَضْرَمْنَا آذَانَ النَّعَمِ ‏.‏ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ اذْهَبُوا فَقَاسِمُوهُمْ أَنْصَافَ الأَمْوَالِ وَلاَ تَمَسُّوا ذَرَارِيَهُمْ لَوْلاَ أَنَّ اللَّهَ لاَ يُحِبُّ ضَلاَلَةَ الْعَمَلِ مَا رَزَيْنَاكُمْ عِقَالاً ‏\"‏ ‏.‏ قَالَ الزُّبَيْبُ فَدَعَتْنِي أُمِّي فَقَالَتْ هَذَا الرَّجُلُ أَخَذَ زِرْبِيَّتِي فَانْصَرَفْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم - يَعْنِي فَأَخْبَرْتُهُ - فَقَالَ لِي ‏\"‏ احْبِسْهُ ‏\"‏ ‏.‏ فَأَخَذْتُ بِتَلْبِيبِهِ وَقُمْتُ مَعَهُ مَكَانَنَا ثُمَّ نَظَرَ إِلَيْنَا نَبِيُّ اللَّهِ صلى الله عليه وسلم قَائِمَيْنِ فَقَالَ ‏\"‏ مَا تُرِيدُ بِأَسِيرِكَ ‏\"‏ ‏.‏ فَأَرْسَلْتُهُ مِنْ يَدِي فَقَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَقَالَ لِلرَّجُلِ ‏\"‏ رُدَّ عَلَى هَذَا زِرْبِيَّةَ أُمِّهِ الَّتِي أَخَذْتَ مِنْهَا ‏\"‏ ‏.‏ فَقَالَ يَا نَبِيَّ اللَّهِ إِنَّهَا خَرَجَتْ مِنْ يَدِي ‏.‏ قَالَ فَاخْتَلَعَ نَبِيُّ اللَّهِ صلى الله عليه وسلم سَيْفَ الرَّجُلِ فَأَعْطَانِيهِ ‏.‏ وَقَالَ لِلرَّجُلِ ‏\"‏ اذْهَبْ فَزِدْهُ آصُعًا مِنْ طَعَامٍ ‏\"‏ ‏.‏ قَالَ فَزَادَنِي آصُعًا مِنْ شَعِيرٍ ‏.‏",
        "translations": {
          "en": "Narrated Zubayb ibn Tha'labah al-Anbari: The Messenger of Allah (ﷺ) sent an army to Banu al-Anbar. They captured them at Rukbah in the suburbs of at-Ta'if and drove them to the Holy Prophet (ﷺ). I rode hurriedly to the Holy Prophet (ﷺ) and said: Peace be on you, Messenger of Allah, and the mercy of Allah and His blessings. Your contingent came to us and arrested us, but we had already embraced Islam and cut the sides of the ears of our cattle. When Banu al-Anbar arrived, the Holy Prophet (ﷺ) said to me: Have you any evidence that you had embraced Islam before you were captured today? I said: Yes. He said: Who is your witness? I said: Samurah, a man from Banu al-Anbar, and another man whom he named. The man testified but Samurah refused to testify. The Holy Prophet (ﷺ) said: He (Samurah) has refused to testify for you, so take an oath with your other witness. I said: Yes. He then dictated an oath to me and I swore to the effect that we had embraced Islam on a certain day, and that we had cut the sides of the ears of the cattle. The Holy Prophet (ﷺ) said: Go and divide half of their property, but do not touch their children. Had Allah not disliked the wastage of action, we should not have taxed you even a rope. Zubayb said: My mother called me and said: This man has taken my mattress. I then went to the Holy Prophet (ﷺ) and informed him. He said to me: Detain him. So I caught him with a garment around his neck, and stood there with him . Then the Holy Prophet (ﷺ) looked at us standing there. He asked: What do you intend (doing) with your captive? I said: I shall let him go free if he returns to this (man) the mattress of his mother which he has taken from her. He said: Prophet of Allah (ﷺ), I no longer have it. He said: The Holy Prophet (ﷺ) took the sword of the man and gave it to me, and said to him: Go and give him some sa's of cereal. So he gave me some sa's of barley",
          "ur": "زبیب عنبری کہتے ہیں کہ اللہ کے نبی کریم صلی اللہ علیہ وسلم نے بنی عنبر کی طرف ایک لشکر بھیجا، تو لشکر کے لوگوں نے انہیں مقام رکبہ۱؎ میں گرفتار کر لیا، اور انہیں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں پکڑ لائے، میں سوار ہو کر ان سے آگے نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور کہا: السلام علیک یا نبی اللہ ورحمۃ اللہ وبرکاتہ آپ کا لشکر ہمارے پاس آیا اور ہمیں گرفتار کر لیا، حالانکہ ہم مسلمان ہو چکے تھے اور ہم نے جانوروں کے کان کاٹ ڈالے تھے ۲؎، جب بنو عنبر کے لوگ آئے تو مجھ سے اللہ کے نبی کریم صلی اللہ علیہ وسلم نے فرمایا: تمہارے پاس اس بات کی گواہی ہے کہ تم گرفتار ہونے سے پہلے مسلمان ہو گئے تھے؟ میں نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: کون تمہارا گواہ ہے؟ میں نے کہا: بنی عنبر کا سمرہ نامی شخص اور ایک دوسرا آدمی جس کا انہوں نے نام لیا، تو اس شخص نے گواہی دی اور سمرہ نے گواہی دینے سے انکار کر دیا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: سمرہ نے تو گواہی دینے سے انکار کر دیا، تم اپنے ایک گواہ کے ساتھ قسم کھاؤ گے؟ میں نے کہا: ہاں، چنانچہ آپ صلی اللہ علیہ وسلم نے مجھے قسم دلائی، پس میں نے اللہ کی قسم کھائی کہ بیشک ہم لوگ فلاں اور فلاں روز مسلمان ہو چکے تھے اور جانوروں کے کان چیر دیئے تھے، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جاؤ اور ان کا آدھا مال تقسیم کر لو اور ان کی اولاد کو ہاتھ نہ لگانا، اگر اللہ تعالیٰ مجاہدین کی کوششیں بیکار ہونا برا نہ جانتا تو ہم تمہارے مال سے ایک رسی بھی نہ لیتے ۔ زبیب کہتے ہیں: مجھے میری والدہ نے بلایا اور کہا: اس شخص نے تو میرا توشک چھین لیا ہے میں نبی اکرم صلی اللہ علیہ وسلم کے پاس گیا اور آپ سے ( صورت حال ) بیان کی، آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: اسے پکڑ لاؤ میں نے اسے اس کے گلے میں کپڑا ڈال کر پکڑا اور اس کے ساتھ اپنی جگہ پر کھڑا ہو گیا، پھر نبی کریم صلی اللہ علیہ وسلم نے ہم دونوں کو کھڑا دیکھ کر فرمایا: تم اپنے قیدی سے کیا چاہتے ہو؟ تو میں نے اسے چھوڑ دیا، نبی اکرم صلی اللہ علیہ وسلم کھڑے ہوئے اور اس آدمی سے فرمایا: تو اس کی والدہ کا توشک واپس کرو جسے تم نے اس سے لے لیا ہے اس شخص نے کہا: اللہ کے نبی! وہ میرے ہاتھ سے نکل چکا ہے، وہ کہتے ہیں: تو اللہ کے نبی نے اس آدمی کی تلوار لے لی اور مجھے دے دی اور اس آدمی سے کہا: جاؤ اور اس تلوار کے علاوہ کھانے کی چیزوں سے چند صاع اور اسے دے دو وہ کہتے ہیں: اس نے مجھے ( تلوار کے علاوہ ) جو کے چند صاع مزید دئیے۔",
          "fr": "Rapporté par Zubayb ibn Tha’labah al-Anbari : Le Messager d’Allah ﷺ a envoyé une armée contre Banu al-Anbar. Ils les ont capturés à Rukbah, près de Ta’if, et les ont amenés au Saint Prophète ﷺ. Je suis allé rapidement voir le Saint Prophète ﷺ et j’ai dit : « Que la paix, la miséricorde d’Allah et Ses bénédictions soient sur toi, Messager d’Allah. Ton détachement est venu chez nous et nous a arrêtés, mais nous avions déjà embrassé l’islam et coupé les oreilles de nos bêtes. » Quand Banu al-Anbar sont arrivés, le Saint Prophète ﷺ m’a dit : « As-tu une preuve que tu avais embrassé l’islam avant d’être capturé aujourd’hui ? » J’ai répondu : « Oui. » Il a demandé : « Qui est ton témoin ? » J’ai répondu : « Samurah, un homme de Banu al-Anbar, et un autre homme dont il a cité le nom. » L’homme a témoigné, mais Samurah a refusé de témoigner. Le Saint Prophète ﷺ a dit : « Il (Samurah) a refusé de témoigner pour toi, alors prête serment avec ton autre témoin. » J’ai dit : « Oui. » Il m’a alors dicté un serment, et j’ai juré que nous avions embrassé l’islam à telle date, et que nous avions coupé les oreilles des bêtes. Le Saint Prophète ﷺ a dit : « Va et partage la moitié de leurs biens, mais ne touche pas à leurs enfants. Si Allah n’avait pas détesté la perte d’efforts, nous ne t’aurions même pas imposé une corde. » Zubayb a dit : « Ma mère m’a appelé et a dit : “Cet homme a pris mon matelas.” » Je suis alors allé voir le Saint Prophète ﷺ pour l’en informer. Il m’a dit : « Retiens-le. » Je l’ai donc attrapé avec un vêtement autour du cou et je suis resté debout avec lui. Ensuite, le Saint Prophète ﷺ nous a vus ainsi et a demandé : « Que veux-tu faire de ton prisonnier ? » J’ai dit : « Je le libérerai s’il rend à cet homme le matelas de sa mère qu’il lui a pris. » Il a dit : « Prophète d’Allah ﷺ, je ne l’ai plus. » Le Saint Prophète ﷺ a alors pris l’épée de cet homme et me l’a donnée, puis il lui a dit : « Va lui donner quelques sa’ de céréales. » Il m’a donc donné quelques sa’ d’orge",
          "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami ['Ammar bin Syu'aib bin Abdullah bin Az Zubaib Al 'Anbari] telah menceritakan kepadaku [Ayahku] ia berkata; aku mendengar kakekku [Az Zubaib] berkata, \"Nabi Allah shallallahu 'alaihi wasallam mengutus sepasukan menuju Bani Al 'Anbar, lalu pasukan tersebut menyerang mereka di Rukbah (bukit di Thaif) dari arah Thaif, pasukan itu kemudian menggiringnya menemui Nabi Allah shallallahu 'alaihi wasallam. Aku lantas mengendarai kuda dan mendahului mereka menuju Nabi shallallahu 'alaihi wasallam, dan aku ucapkan 'As salamu 'alaika wa rahmatullahi wa barakatuh wahai Nabi Allah! Pasukan anda telah datang dan menyerang kami, padahal kami telah masuk Islam dan telah memotong ujung telinga hewan-hewan ternak kami.\" Kemudian tatkala sampai di Bal'anbar Nabi Allah shallallahu 'alaihi wasallam berkata kepadaku: \"Apakah kalian memiliki bukti bahwa kalian telah masuk Islam sebelum diserang pada beberapa hari ini?\" Aku katakan, \"Ya.\" Beliau bertanya: \"Siapakah yang bisa menjadi saksi untukmu?\" Aku katakan, \"Samurah, seorang laki-laki dari Bani Al 'Anbar.\" Dan seorang laki-laki lain yang ia sebutkan. Kemudian laki-laki tersebut bersaksi sementara Samurah menolak untuk bersaksi. Nabi Allah shallallahu 'alaihi wasallam kemudian bersabda: \"Ia enggan bersaksi untukmu, maka engkau bisa bersumpah bersama saksimu yang lain.\" Aku katakan, \"Ya.\" Lalu beliau memintaku untuk bersumpah, maka aku bersumpah dengan nama Allah, 'Sungguh kami telah masuk Islam pada hari ini dan ini, dan kami telah memotong ujung telinga hewan-hewan ternak. ' Kemudian Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Pergilah kalian dan bagilah untuk mereka separuh harta tersebut dan jangan kalian sentuh keturunan-keturunan mereka! Seandainya Allah tidak membenci hilangnya suatu amal maka kami tidak akan mengurangi kalian satu 'Iqalpun (tali unta).\" Az Zubaib berkata, \"Kemudian ibuku memanggilku dan berkata, \"Orang ini telah mengambil permadaniku.\" Lalu aku pergi menemui Nabi shallallahu 'alaihi wasallam dan mengabarkan hal tersebut, beliau pun berkata: \"Tahanlah dia!\" Lalu aku cengkeram bajunya, dan aku berdiri bersamanya di tempat kami. Kemudian Nabi shallallahu 'alaihi wasallam melihat kepada kami dalam keadaan berdiri, lalu beliau bersabda: \"Apa yang engkau kehendaki dengan tawananmu?\" Lalu aku melepaskannya, kemudian Nabi Allah shallallahu 'alaihi wasallam berdiri dan berkata kepada orang tersebut: \"Kembalikan kepada orang ini permadani milik ibunya yang telah engkau ambil!\" Orang tersebut berkata, \"Wahai Nabi Allah, sesungguhnya permadani tersebut telah hilang dari tanganku.\" Az Zubaib berkata, \"Kemudian Nabi Allah shallallahu 'alaihi wasallam melepas pedang laki-laki tersebut dan memberikannya kepadaku, kemudian beliau berkata kepada laki-laki itu: \"Pergi dan tambahlah beberapa sha' makanan!\" Az Zubaib berkata, \"Kemudian laki-laki itu menambahku beberapa sha' gandum",
          "tr": "Şuays b. Abdullah b. ez-Zübeyb dedi ki: Ben dedem Zübeyb (b. Sa'lebe'y)i (şöyle) derken işittim: Allah'ın elçisi (Muhammed) (s.a.v.) Anber oğulları üzerine (bir) asker (î kuvvet) göndermişti. (Bu askerler) onları Tâif'in nahiyelerinden Rukbe'de yakaladılar ve Nebi (s.a.v.)'e götürdüler. (Ben de bir hayvan'a) bindim (aradan sıvışarak) onlardan önce Nebi (s.a.v.)'e geldim. \"Selâm sana ey Allah'ın elçisi, Allah'ın rahmet ve bereketi (senin üzerine olsun). Senin askerlerin bizi yakaladılar. Oysa biz (daha önce) müslüman olmuş ve (müslüman olduğumuzun bilinmesi için) develer(imiz)in kulaklarını kesmiştik\" dedim. Anber oğulları gelince Peygamber (s.a.v.) bana: \"Bu günlerde yakalanmanızdan önce müslümanlığı kabul ettiğinize dair bir şahidiniz var mıdır?\" diye sordu. Ben \"Evet\" cevabım verdim. \"Şahidin kimdir?\" dedi. Anber oğullarından Semure isimli bir adamla, başka bir adam, dedi(m ve) Nebi (s.a.v.)'e adamın ismini söyledi(m). Adam (bizim daha önceden müslümanlığı kabul ettiğimize) şahitlik etti (fakat) Semure şahitlik etmedi. Nebi (s.a.v.) (bana hitaben):. \"(Semure) senin lehine şahitlik etmekten kaçındı, öbür şahidin(in) şahitliğiyle birlikte sen de yemin eder misin?\" dedi. \"Evet\" karşılığını verdim. Bunun üzerine bana yemin teklif etti. Ben de: Biz (daha önce) falanca gün müslüman olmuştuk ve develerin kulaklarını kesmiştik diye Allah'a yemin ettim. Bunun üzerine Nebi (s.a.v.) (oradaki sahâbilere dönerek): \"Haydi, gidiniz malları(nın) yarısını (onlardan alınız, diğer yarısını da) kendilerine bırakınız. Çoluk çocuklarına dokunmayınız\" buyurdu. (Sonra Anber oğullarına dönerek): \"Eğer Allah amelleri boşa çıkarmayı sevmez olmasaydı (bu mallardan) size bir ipi dahi eksik vermezdim\" (Fakat askerlerin emeğini boşa çıkarmak istemediğim, için mallarınızın bir kısmını onlara, verdim) buyurdu. ez-Züheyb (sözlerine devamla şöyle) dedi: \"O sırada, annem beni çağırıp (askerlerden birini göstererek): Bu adam benim saçaklı yaygımı aldı, diye şikâyet etti. Ben de hemen Peygamber (s.a.v.)'e gidip şikâyette butundum. (Nebi Efendimiz) bana: \"Onu yakala\" dedi. Bunun üzerine hemen (varıp onun) yakasını topladım, bulunduğumuz yerde onunla birlikte beklemeye başladım. O sırada Nebi (s.a.v.) bizim orada beklemekte olduğumuzu görünce (bana): \"Bu yakaladığın adamdan ne istiyorsun?\" dedi. Ben de onu elimden bırakıverdim. Nebi (s.a.v.) karşımıza geçip o adama,hitap ederek: \"Bu adama annesinden aldığın saçaklı sergiyi geri ver\" buyurdu. (Adam da): Ey Allah'ın Rasûlü, o kadın benim elimden çıktı, dedi. Nebi (s.a.v.) de adamın kılıcını çekip aldı, bana verdi ve ona: \"Git, buna ilaveten bir ölçek de yiyecek ver\" buyurdu. O zat bana (kılıca) ilâve olarak bir ölçek de arpa verdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 42
      },
      "narrator": {
        "en": "Zubayb ibn Tha'labah al-Anbari"
      }
    },
    {
      "hadithNumber": 3613,
      "arabicNumber": 3613,
      "book": 25,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ رَجُلَيْنِ، ادَّعَيَا بَعِيرًا أَوْ دَابَّةً إِلَى النَّبِيِّ صلى الله عليه وسلم لَيْسَتْ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهُ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا ‏.‏",
        "translations": {
          "en": "Narrated AbuMusa al-Ash'ari: Two men claimed a camel or an animal and brought the case to the Holy Prophet (ﷺ). But as neither of them produced any proof, the Holy Prophet (ﷺ) declared that they should share it equally",
          "ur": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ دو شخصوں نے ایک اونٹ یا چوپائے کا رسول اللہ صلی اللہ علیہ وسلم کے پاس دعویٰ کیا اور ان دونوں میں سے کسی کے پاس کوئی گواہ نہیں تھا تو نبی اکرم صلی اللہ علیہ وسلم نے اس چوپائے کو ان کے درمیان تقسیم فرما دیا۔",
          "fr": "Rapporté par Abu Musa al-Ash’ari رضي الله عنه : Deux hommes se disputaient un chameau ou un animal et ont porté l’affaire devant le Saint Prophète ﷺ. Comme aucun d’eux n’a pu apporter de preuve, le Saint Prophète ﷺ a décidé qu’ils devaient le partager à parts égales",
          "tr": "Ebû Musa el-Eş'arî'den rivayet olunduğuna göre; İki adam bir deve ya da bir hayvan üzerinde hak iddia ederek Nebi (Sallallahu Aleyhi ve Sellem)'e başvurmuşlar; hiçbirinin de şahidi yokmuş. Nebi (s.a.v.) de o deveyi ikisi arasında paylaştırmış"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 43
      },
      "narrator": {
        "en": "AbuMusa al-Ash'ari"
      }
    },
    {
      "hadithNumber": 3614,
      "arabicNumber": 3614,
      "book": 25,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ، بِإِسْنَادِهِ وَمَعْنَاهُ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by Sa'id through a different chain of narrators to the same effect",
          "ur": "اس سند سے بھی سعید (ابن ابی عروبۃ) سے اسی طریق سے اسی مفہوم کی حدیث مروی ہے۔",
          "fr": "Ce récit a également été rapporté par Sa’id avec une autre chaîne de transmetteurs, dans le même sens",
          "tr": "(Bir önceki 3613. hadis) senediyle ve manasıyla (yine) Sâid (b. Ebî Bürde)'den rivayet olunmuştur"
        }
      },
      "grades": [
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 3615,
      "arabicNumber": 3615,
      "book": 25,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، بِمَعْنَى إِسْنَادِهِ أَنَّ رَجُلَيْنِ، ادَّعَيَا بَعِيرًا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنِ فَقَسَمَهُ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا نِصْفَيْنِ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by Qatadah through a different chain of narrators to the effect that two men laid claim camel and both of them produced witness so the prophet (peace be upon him) divided it in halves between them",
          "ur": "اس سند سے بھی قتادہ سے اسی طریق سے اسی مفہوم کی حدیث مروی ہے اس میں ہے کہ نبی اکرم صلی اللہ علیہ وسلم کے زمانے میں دو آدمیوں نے کسی ایک اونٹ کا دعویٰ کیا، اور دونوں نے دو دو گواہ پیش کئے، تو نبی اکرم صلی اللہ علیہ وسلم نے اسے دونوں کے درمیان آدھا آدھا تقسیم کر دیا۔",
          "fr": "Ce récit a également été rapporté par Qatadah avec une autre chaîne de transmetteurs, indiquant que deux hommes revendiquaient un chameau et que tous deux avaient des témoins, alors le Prophète ﷺ l’a partagé en deux entre eux",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal Adl Dlarir] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Sa'id bin Abu Burdah] dari [Ayahnya] dari kakeknya [Abu Musa Al Asy'ari] bahwa ada dua orang laki-laki mengklaim seekor unta atau seekor hewan kepada Nabi shallallahu 'alaihi wasallam, sementara keduanya tidak memiliki bukti. Nabi shallallahu 'alaihi wasallam lalu membagi unta tersebut untuk keduanya.\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Sa'id] dengan sanad dan maknanya.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] dari [Qatadah] dengan makna sanadnya, bahwa dua orang yang mengklaim seekor unta pada zaman Nabi shallallahu 'alaihi wasallam, lalu keduanya mengirimkan dua orang saksi, Nabi shallallahu 'alaihi wasallam kemudian membagi unta tersebut untuk mereka berdua",
          "tr": "(Bir önceki hadisdeki senedle) Katâde'den rivayet olunduğuna göre; Nebi (Sallallahu Aleyhi ve Sellem) zamanında iki adam bir deve üzerinde hak iddia etmişler ve (ikisi de) iki (şer) şahit (bulup) göndermişler. Bunun üzerine Nebi (s.a.v.) o deveyi bu iki kişi arasında eşit olarak paylaştırmış"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 3616,
      "arabicNumber": 3616,
      "book": 25,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلَيْنِ، اخْتَصَمَا فِي مَتَاعٍ إِلَى النَّبِيِّ صلى الله عليه وسلم لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اسْتَهِمَا عَلَى الْيَمِينِ مَا كَانَ أَحَبَّا ذَلِكَ أَوْ كَرِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: Two men disputed about some property and brought the case to the Holy Prophet (ﷺ), but neither of them could produce any proof. So the Holy Prophet (ﷺ) said: Cast lots about the oath whatever it may be, whether they like it or dislike it",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ دو آدمی ایک سامان کے متعلق نبی اکرم صلی اللہ علیہ وسلم کے پاس جھگڑا لے کر گئے اور دونوں میں سے کسی کے پاس کوئی گواہ نہیں تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم دونوں قسم پر قرعہ اندازی کرو ۱؎ خواہ تم اسے پسند کرو یا ناپسند ۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Deux hommes se disputaient un bien et ont porté l’affaire devant le Saint Prophète ﷺ, mais aucun d’eux n’a pu apporter de preuve. Le Saint Prophète ﷺ a alors dit : « Tirez au sort pour le serment, qu’ils l’acceptent ou non. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah] bahwa dua orang laki-laki mengadukan perselisihan tentang sebuah barang kepada Nabi shallallahu 'alaihi wasallam, sementara keduanya tidak memiliki bukti. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Undilah untuk melakukan sumpah!\" Baik keduanya menyukai hal tersebut atau membencinya",
          "tr": "Ebû Hureyre'den rivayet olunduğuna göre; İki kişi bir mal üzerinde anlaşmazlığa düşerek, Nebi (Sallallahu Aleyhi ve Sellem)'e başvurmuşlar. Nebi (s.a.v.) de (onlara): \"İsteyerek de olsa istemeyerek de olsa,(sonunda) yemin etmek üzere kur'a çekiniz\" buyurmuştur"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 46
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    },
    {
      "hadithNumber": 3617,
      "arabicNumber": 3617,
      "book": 25,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَسَلَمَةُ بْنُ شَبِيبٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - قَالَ أَحْمَدُ قَالَ - حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا كَرِهَ الاِثْنَانِ الْيَمِينَ أَوِ اسْتَحَبَّاهَا فَلْيَسْتَهِمَا عَلَيْهَا ‏\"‏ ‏.‏ قَالَ سَلَمَةُ قَالَ أَخْبَرَنَا مَعْمَرٌ وَقَالَ إِذَا أُكْرِهَ الاِثْنَانِ عَلَى الْيَمِينِ ‏.‏",
        "translations": {
          "en": "Abu hurairah reported the holy prophet (peace be upon him) as saying:When two men dislike the oath or like it,lots will be cost about it. Salamah said on the authority of Ma’mar who said: when the two are compelled to take an oath",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب دونوں آدمی قسم کھانے کو برا جانیں، یا دونوں قسم کھانا چاہیں تو قسم کھانے پر قرعہ اندازی کریں ( اور جس کے نام قرعہ نکلے وہ قسم کھا کر اس چیز کو لے لے ) ۔ سلمہ کہتے ہیں: عبدالرزاق کی روایت میں «حدثنا معمر» کے بجائے «أخبرنا معمر» اور «إذا كَرِهَ الاثنان اليمين» کے بجائے «إذا أكره الاثنان على اليمين»ہے۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Saint Prophète ﷺ a dit : « Quand deux hommes refusent ou acceptent de prêter serment, on tirera au sort pour le serment. » Salamah a rapporté de la part de Ma’mar : « Quand les deux sont obligés de prêter serment. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Salamah bin Syabib] mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] [Ahmad] berkata; telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila dua orang tidak senang bersumpah atau tidak menyukainya, maka hendaknya mereka berdua berundi untuk mendapatkannya.\" [Salamah] berkata; telah mengabarkan kepada kami [Ma'mar] dan ia berkata, \"Apabila dua orang dipaksa untuk bersumpah.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Khalid bin Al Harits] dari [Sa'id bin Abu 'Arubah] dengan sanad Ibnu Minhal",
          "tr": "Ebû Hureyre'dem rivayet edildiğine göre; Nebi (Sallallahu Aleyhi ve Sellem): \"(İhtilaflı olan) iki kişi yemin etmeyi isteseler de istemeseler de (sonunda) yemin etmek üzere (aralarında) kur'a çekmelidirler.\" buyurmuştur. (Ravi) Seleme (b.Şebîb) dedi ki: (Abdürrezzak bu hadisi bana): \"Bize Ma'mer haber verdi\" (tabiriyle) ve 'İki kişiye, istemedikleri halde yemin teklif edilirse \"(sözleriyle) rivayet etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 3618,
      "arabicNumber": 3618,
      "book": 25,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، بِإِسْنَادِ ابْنِ مِنْهَالٍ مِثْلَهُ قَالَ فِي دَابَّةٍ وَلَيْسَ لَهُمَا بَيِّنَةٌ فَأَمَرَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَسْتَهِمَا عَلَى الْيَمِينِ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by sa’id b. ‘Urubah through the chain as narrated by Ibn Minhal. This version has :About an animal and they had no proof. So the Messenger of Allah (ﷺ) ordered to cast lots about the oath",
          "ur": "سعید بن ابی عروبہ سے ابن منہال کی سند سے اسی کے مثل مروی ہے اس میں «في متاع» کے بجائے «في دابة» کے الفاظ ہیں یعنی دو شخصوں نے ایک چوپائے کے سلسلہ میں جھگڑا کیا اور ان کے پاس کوئی گواہ نہیں تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں قسم پر قرعہ اندازی کا حکم دیا۔",
          "fr": "Ce récit a également été rapporté par Sa’id ibn ‘Urubah avec la chaîne rapportée par Ibn Minhal. Cette version précise : « À propos d’un animal, et ils n’avaient aucune preuve. Le Messager d’Allah ﷺ a donc ordonné de tirer au sort pour le serment. »",
          "tr": "Saîd b. Ebî Arube'den, (yine) aynen (3613 numaralı) îbn Minhal (hadisinin) senediyle rivayet edilmiştir ki, Ebu Musa el-Eş'arî şöyle dedi: (İki adam) bir hayvan üzerinde (hak iddia ederek Nebi (Sallallahu Aleyhi ve Sellem)'e başvurdular), ikisinin de şahidi yoktu. Rasûlullah (Sallallahu Aleyhi ve Sellem) onlara (sonunda) yemin etmek üzere kur'a çekmelerini emir buyurdu. Ayrıca bu hadis'i Nesâî, kudât; İbn Mâce, ahkâm da tahric ettiler"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 3619,
      "arabicNumber": 3619,
      "book": 25,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَتَبَ إِلَىَّ ابْنُ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ ‏.‏",
        "translations": {
          "en": "Ibn Abi Mulaikah said:Ibn ‘Abbas wrote to me that the Messenger of Allah (ﷺ)had defendant should take an oath",
          "ur": "ابن ابی ملیکہ کہتے ہیں کہ ابن عباس رضی اللہ عنہما نے میرے پاس لکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے مدعی علیہ پر قسم کا فیصلہ کیا ہے ( یعنی جب وہ منکر ہو اور مدعی کے پاس گواہ نہ ہو تو وہ قسم کھائے ) ۔",
          "fr": "Ibn Abi Mulaikah a dit : Ibn ‘Abbas m’a écrit que le Messager d’Allah ﷺ avait décidé que le défendeur devait prêter serment",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Al Qa'nabi] telah menceritakan kepada kami [Nafi' bin Umar] dari [Ibnu Abu Mulaikah] ia berkata, \" [Ibnu Abbas] menulis surat kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa orang yang tertuduh harus bersumpah",
          "tr": "İbn Ebî Müleyke'den (şöyle) dediği rivayet olunmuştur: İbn Abbas r.a. bana bir mektup yazarak Rasulullah (Sallallahu Aleyhi ve Sellem)'in, yeminin davalı üzerine düştüğüne hükmettiğini bildirdi. Diğer tahric: Buhari, şehadat, rehn, tefsiri sure (Al-i imran); Müslim, akdiye; Tirmizî, ahkâm; Ahmed b. Hanbel, I, 253, 288, 323, 351, 356, 363, II"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (2514، 1711)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 3620,
      "arabicNumber": 3620,
      "book": 25,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، عَنْ أَبِي يَحْيَى، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ - يَعْنِي لِرَجُلٍ حَلَّفَهُ - ‏ \"‏ احْلِفْ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ مَا لَهُ عِنْدَكَ شَىْءٌ ‏\"‏ ‏.‏ يَعْنِي لِلْمُدَّعِي ‏.‏ قَالَ أَبُو دَاوُدَ أَبُو يَحْيَى اسْمُهُ زِيَادٌ كُوفِيٌّ ثِقَةٌ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn Abbas: The Holy Prophet (ﷺ) said to a man whom he asked to take an oath: Swear by Allah except whom there is no god that you have nothing belonging to him, i.e. the plaintiff",
          "ur": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص سے قسم کھلائی تو یوں فرمایا: اس اللہ کی قسم کھاؤ جس کے سوا کوئی بندگی کے لائق نہیں کہ تیرے پاس اس ( یعنی مدعی کی ) کی کوئی چیز نہیں ہے ۔ ابوداؤد کہتے ہیں: ابویحییٰ کا نام زیاد کوفی ہے اور وہ ثقہ ہیں۔",
          "fr": "Rapporté par Abdullah ibn Abbas رضي الله عنه : Le Saint Prophète ﷺ a dit à un homme à qui il demandait de prêter serment : « Jure par Allah, en dehors de qui il n’y a pas de divinité, que tu ne possèdes rien qui appartienne à cet homme, c’est-à-dire au plaignant. »",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Al Ahwash] telah menceritakan kepada kami ['Atha bin As Saib] dari [Abu Yahya] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada seorang laki-laki yang beliau perintahkan agar bersumpah: \"Bersumpahlah dengan nama Allah yang tidak ada tuhan yang berhak disembah melainkan Allah, bahwa ia tidak memiliki sesuatu yang diklaim ada padamu.\" Abu Daud berkata, \"Abu Yahya namanya Ziyad Kufi, ia adalah orang yang tsiqah",
          "tr": "İbn Abbas'tan rivayet olunduğuna göre; Nebi (Sallallahu Aleyhi ve Sellem) yemin ettir(mek iste)diği bir adama: \"Davacının sende hiçbir hakkı bulunmadığına dair, kendisinden başka hakiki bir ma'bud bulunmayan Allah'a yemin et\" buyurmuştur. Ebû Dâvûd dedi ki: (Ravi) Ebû Yahya'nın adı Ziyâd'dır. Kendisi güvenilir bir kimsedir ve Kûfelidir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 50
      },
      "narrator": {
        "en": "Abdullah ibn Abbas"
      }
    },
    {
      "hadithNumber": 3621,
      "arabicNumber": 3621,
      "book": 25,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنِ الأَشْعَثِ، قَالَ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أَرْضٌ فَجَحَدَنِي فَقَدَّمْتُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏ ‏.‏ قُلْتُ لاَ ‏.‏ قَالَ لِلْيَهُودِيِّ ‏\"‏ احْلِفْ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِذًا يَحْلِفَ وَيَذْهَبَ بِمَالِي ‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏",
        "translations": {
          "en": "Al-Ash’ath b. Qais said:A Jew and I shared some land and he denied my right, so I took him to the holy prophet (ﷺ). The holy prophet (ﷺ) said to me: Have you have proof. I said: No. He then said to the Jew: Swear an oath I said Messenger of Allah,he will swear an oath and go off my property. So Allah sent down: “Those who barter for a small price Allah’s covenant and their oaths....\" to the end of the verse",
          "ur": "اشعث رضی اللہ عنہ کہتے ہیں کہ میرے اور ایک یہودی کے درمیان کچھ ( مشترک ) زمین تھی، یہودی نے میرے حصہ کا انکار کیا، میں اسے نبی اکرم صلی اللہ علیہ وسلم کے پاس لے گیا تو نبی اکرم صلی اللہ علیہ وسلم نے مجھ سے فرمایا: کیا تمہارے پاس کوئی گواہ ہے؟ میں نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے یہودی سے فرمایا: تم قسم کھاؤ میں نے عرض کیا: اللہ کے رسول! تب تو یہ قسم کھا کر میرا مال ہڑپ لے گا، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی: «إن الذين يشترون بعهد الله وأيمانهم» جو لوگ اللہ کا عہد و پیمان دے کر اور اپنی قسمیں کھا کر تھوڑا مال خریدتے ہیں آخرت میں ان کا کوئی حصہ نہیں ( سورة آل عمران: ۷۷ ) ۔",
          "fr": "Rapporté par Al-Ash’ath ibn Qais رضي الله عنه : Un Juif et moi possédions ensemble un terrain, et il a nié mon droit. Je l’ai donc amené devant le Saint Prophète ﷺ. Le Saint Prophète ﷺ m’a dit : « As-tu une preuve ? » J’ai répondu : « Non. » Il a alors dit au Juif : « Prête serment. » J’ai dit : « Messager d’Allah, il va prêter serment et partir avec mon bien. » Alors Allah a révélé : « Ceux qui échangent le pacte d’Allah et leurs serments contre un vil prix… » jusqu’à la fin du verset",
          "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Al Asy'ats] ia berkata, \"Aku dan seorang laki-laki Yahudi berselisih atas sebuah lahan, kemudian ia mengingkariku. Maka aku pun datang menemui Nabi shallallahu 'alaihi wasallam dan mengadukan hal itu kepadanya, Nabi shallallahu 'alaihi wasallam lalu berkata kepadaku: \"Apakah engkau memiliki bukti?\" Aku menjawab, \"Tidak.\" Beliau bersabda kepada orang Yahudi tersebut: \"Bersumpahlah!\" Maka aku katakan, \"Wahai Rasulullah, jika demikian ia akan bersumpah dan membawa hartaku!\" Kemudian Allah menurunkan ayat: '(Sesungguhnya orang-orang yang menukar janji (nya dengan) Allah dan sumpah-sumpah mereka dengan harga yang sedikit…) ' (Qs. Ali Imran: 77) hingga akhir ayat",
          "tr": "el-Eş'as'dan rivayet edilmiştir; dedi ki: Benimle yahudilerden bir adam arasında (ihtilaflı) bir arazi vardı. Adam beni (m hakkımı) inkâr et(miş)ti. (Tutup) kendisini Peygamber (s.a.v.)'e götürdüm. Nebi (s.a.v.) bana: \"Senin şahidin var mı?\" diye sordu. Bende, \"Hayır\" cevabını verdim. (Bunun üzerine) yahudiye (dönerek): \"Yemin et\" diye emir verdi. Ben (onun yemin etmesine fırsat vermeden): \"Ey Allah'ın Rasûlü, bu durumda (bu adam) yemin eder ve malımı (da elimden alır) götürür, dedim. Bunun üzerine Yüce Allah; \"Fakat Allah'a verdikleri sözü ve yeminlerini az (bir) paraya satanlar var ya...\"[Âl-i İmran 77] âyetini, sonuna kadar indirdi"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (2616، 2617) Sahih Muslim (138)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 3622,
      "arabicNumber": 3622,
      "book": 25,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، حَدَّثَنَا الْفِرْيَابِيُّ، حَدَّثَنَا الْحَارِثُ بْنُ سُلَيْمَانَ، حَدَّثَنِي كُرْدُوسٌ، عَنِ الأَشْعَثِ بْنِ قَيْسٍ، أَنَّ رَجُلاً، مِنْ كِنْدَةَ وَرَجُلاً مِنْ حَضْرَمَوْتَ اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم فِي أَرْضٍ مِنَ الْيَمَنِ فَقَالَ الْحَضْرَمِيُّ يَا رَسُولَ اللَّهِ إِنَّ أَرْضِي اغْتَصَبَنِيهَا أَبُو هَذَا وَهِيَ فِي يَدِهِ ‏.‏ قَالَ ‏ \"‏ هَلْ لَكَ بَيِّنَةٌ ‏\"‏ ‏.‏ قَالَ لاَ وَلَكِنْ أُحَلِّفُهُ وَاللَّهِ مَا يَعْلَمُ أَنَّهَا أَرْضِي اغْتَصَبَنِيهَا أَبُوهُ ‏.‏ فَتَهَيَّأَ الْكِنْدِيُّ يَعْنِي لِلْيَمِينِ ‏.‏ وَسَاقَ الْحَدِيثَ ‏.‏",
        "translations": {
          "en": "Al-Ash’ath b. Qais said:A men from Kindah and a men from Hadramawt came to the Holy Prophet(ﷺ)with their dispute about a land in the Yemen. The Hadrami said: Messenger of Allah, the this (man)had usurped land belonging to me, and it is his possession. He asked: Have you any proof ?He replied:No, but I can have him swear on oath. Allah knows that it is my land, and father seized it from me. The Kindi was prepared to take oath. He then narrated the rest of the tradition",
          "ur": "اشعث بن قیس رضی اللہ عنہ کہتے ہیں ایک کندی اور ایک حضرمی یمن کی ایک زمین کے سلسلے میں جھگڑتے ہوئے نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، حضرمی نے کہا: اللہ کے رسول! اس ( کندی ) کے باپ نے مجھ سے میری زمین غصب کر لی ہے اور وہ زمین اس کے قبضے میں ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تمہارے پاس کوئی گواہ ہے حضرمی نے کہا: نہیں لیکن میں اس کو اس بات پر قسم دلاؤں گا کہ وہ نہیں جانتا کہ میری زمین کو اس کے باپ نے مجھ سے غصب کر لیا ہے؟ تو وہ کندی قسم کے لیے آمادہ ہو گیا، پھر راوی نے پوری حدیث بیان کی ( جو گزر چکی نمبر: ۳۲۴۴ ) ۔",
          "fr": "Rapporté par Al-Ash’ath ibn Qais رضي الله عنه : Un homme de Kindah et un homme de Hadramawt sont venus auprès du Saint Prophète ﷺ pour un litige concernant une terre au Yémen. Le Hadrami a dit : « Messager d’Allah, cet homme a usurpé une terre qui m’appartient, et elle est en sa possession. » Il a demandé : « As-tu une preuve ? » Il a répondu : « Non, mais je peux lui faire prêter serment. Allah sait que c’est ma terre, et mon père me l’a prise. » Le Kindi était prêt à prêter serment. Il a ensuite raconté la suite du récit",
          "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Al Faryabi] telah menceritakan kepada kami [Al Harits bin Sulaiman] telah menceritakan kepadaku [Kurdus] dari [Al Asy'ats bin Qais] bahwa seorang laki-laki dari Kindah dan seorang laki-laki dari Hadlramaut mengadukan perselisihan mereka tentang lahan yang ada di Yaman kepada Nabi shallallahu 'alaihi wasallam. Orang Hadlrami berkata, \"Wahai Rasulullah, sesungguhnya tanahku telah dirampas bapak orang ini. Dan tanah tersebut ada di tangannya.\" Beliau bersabda: \"Apakah engkau memiliki bukti?\" Aku katakan, \"Tidak, akan tetapi aku memintanya agar ia bersumpah. Demi Allah ia tidak mengetahui bahwa tanah tersebut adalah tanahku yang dirampas oleh bapaknya.\" Maka orang Kindah tersebut bersiap-siap untuk bersumpah…. Al Asy'ats lalu menyebutkan hadits tersebut",
          "tr": "Es'aş b. Kays'dan rivayet olunduğuna göre; Kindeli bir adam ile Hadramevtli bir adam Yemen'de bulunan bir arazi üzerinde anlaşamayarak Nebi (s.a.v.)'e başvurmuşlar. Hadramevtli adam: Ey Allah'ın Rasûlü, şu adamın babası benim toprağımı haksızlıkla elimden aldı. (Şimdi) bu toprak kendi elinde bulunuyor, dedi. Hz. Nebi de ona: \" Senin (bu iddianı doğrulayacak) bir şahidin var mı?\" diye sordu. Hayır, (yok) fakat ben ona bu arazinin benim olup da babasının onu benden haksızlıkla aldığını bilmediğine dair yemin etmesini teklif ediyorum, dedi. Bunun üzerine Kindeli adam yemin etmeye hazırlandı... (el-Eş'as . Kays, sözlerine devam ederek bir önceki 3621.) hadisi (aynen) anlattı"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 3623,
      "arabicNumber": 3623,
      "book": 25,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلِ بْنِ حُجْرٍ الْحَضْرَمِيِّ، عَنْ أَبِيهِ، قَالَ جَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ وَرَجُلٌ مِنْ كِنْدَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ الْحَضْرَمِيُّ يَا رَسُولَ اللَّهِ إِنَّ هَذَا غَلَبَنِي عَلَى أَرْضٍ كَانَتْ لأَبِي فَقَالَ الْكِنْدِيُّ هِيَ أَرْضِي فِي يَدِي أَزْرَعُهَا لَيْسَ لَهُ فِيهَا حَقٌّ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِلْحَضْرَمِيِّ ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَلَكَ يَمِينُهُ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ فَاجِرٌ لَيْسَ يُبَالِي مَا حَلَفَ لَيْسَ يَتَوَرَّعُ مِنْ شَىْءٍ ‏.‏ فَقَالَ ‏\"‏ لَيْسَ لَكَ مِنْهُ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "‘Alqamah b. Wa’il b. Hujr al-Hadrami said on the authority of the father:A man from Hadramaw and a man from kindah came to the Messenger of Allah (ﷺ). The hadrami said: Messenger of Allah, this (man) has seized land which belonged to my father. Al-Kindi said: That is my land in my possession and I cultivate it; he has no right to it. The Holy prophet (may be peace upon him) said to the Hadrami: Have you any proof? We said : No. he (the Prophet)said: Then he will swear an oath for you . He said: Messenger of Allah, he is a reprobate and he would not care to swear to anything and stick at nothing. He said: That is only your recourse",
          "ur": "وائل بن حجر حضرمی رضی اللہ عنہ کہتے ہیں ایک حضرمی اور ایک کندی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تو حضرمی نے عرض کیا: اللہ کے رسول! اس شخص نے میرے والد کی زمین مجھ سے چھین لی ہے، کندی نے کہا: یہ تو میری زمین ہے میں اسے جوتتا ہوں اس میں اس کا حق نہیں ہے، نبی اکرم صلی اللہ علیہ وسلم نے حضرمی سے فرمایا: کیا تیرے پاس کوئی گواہ ہے؟ اس نے کہا: نہیں، تب آپ صلی اللہ علیہ وسلم نے ( کندی سے ) فرمایا: تو تیرے لیے قسم ہے تو حضرمی نے کہا: اللہ کے رسول! یہ تو ایک فاجر شخص ہے اسے قسم کی کیا پرواہ؟ وہ کسی چیز سے پرہیز نہیں کرتا، آپ صلی اللہ علیہ وسلم نے فرمایا: سوائے اس کے اس پر تیرا کوئی حق نہیں ۔",
          "fr": "‘Alqamah ibn Wa’il ibn Hujr al-Hadrami a rapporté de la part de son père : Un homme de Hadramawt et un homme de Kindah sont venus auprès du Messager d’Allah ﷺ. Le Hadrami a dit : « Messager d’Allah, cet homme a pris une terre qui appartenait à mon père. » Al-Kindi a dit : « C’est ma terre, elle est en ma possession et je la cultive ; il n’a aucun droit dessus. » Le Saint Prophète ﷺ a dit au Hadrami : « As-tu une preuve ? » Nous avons dit : « Non. » Il (le Prophète) a dit : « Alors il prêtera serment pour toi. » Il a dit : « Messager d’Allah, c’est un dépravé, il ne se gênera pas pour jurer sur n’importe quoi. » Il a répondu : « C’est la seule solution qui te reste. »",
          "id": "Telah menceritakan kepada kami [Hannad bin As Sari] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari ['Alqamah bin Wail bin Hujr Al Hadlrami] dari [Ayahnya] ia berkata, \"Seorang laki-laki Hadlramaut dan seorang laki-laki dari Kindah datang kepada Rasulullah shallallahu 'alaihi wasallam. Orang Hadlramaut tersebut berkata, \"Wahai Rasulullah, sesungguhnya orang ini telah menguasai tanah yang dahulu adalah milik ayahku.\" Kemudian orang Kindi tersebut berkata, \"Tanah itu adalah tanahku, ia ada padaku dan aku yang menanaminya, dia tidak memiliki hak pada tanah tersebut!\" 'Alqamah bin Wail berkata, \"Kemudian Nabi shallallahu 'alaihi wasallam bertanya kepada orang Hadlrami, \"Apakah engkau memiliki bukti?\" Orang Hadlrami itu menjawab, \"Tidak.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Bagimu sumpahnya.\" Orang Hadlrami itu pun berkata, \"Wahai Rasulullah, dia itu orang yang suka berbuat dosa, dia tidak peduli dengan apa yang ia bersumpah atasnya! Ia tidak menjaga diri dari sesuatupun.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Engkau tidak bisa melakukan apapun kecuali hanya itu",
          "tr": "Alkame b. Vâil b. Hucr el-Hadramî'nin babasından şöyle dediği rivayet olunmuştur: Hadramevtli bir adamla Kindeli bir adam (aralarında ihtilâfa düşerek) Rasûlullah (s.a.v.)'e geldi(ler). Hadramevtli (adam diğerini göstererek); Ey Allah'ın Rasûlü, bu adam, babama ait olan bir araziyi üzerinde hiçbir hakkı olmadığı halde zorla elimden aldı, dedi. Kindeli de: O benim toprağımdır. Benim elimde bulunmaktadır. Onu ben işlemekteyim, cevabını verdi. Nebi (s.a.v.) Hadramevtliye: “Şahidin var mı?\" diye sordu. Adam, \"Hayır\" cevabını verdi. Rasûlullah (s.a.v.): \"Bu durumda senin ondan (sadece bir) yemin etmesini isteme hakkın vardır\" buyurdu. (Hadramevtli bu cevabı işitince): Ey Allah'ın Rasûlü, o, yemine önem vermeyen yalancının biridir. Hiçbir günahdan da çekinmez, dedi. (Hz. Nebi de). “Senin için ondan (isteyebileceğin) bundan başka (bir şey) yoktur\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim (139)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 3624,
      "arabicNumber": 3624,
      "book": 25,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا رَجُلٌ، مِنْ مُزَيْنَةَ - وَنَحْنُ عِنْدَ سَعِيدِ بْنِ الْمُسَيَّبِ - عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَعْنِي لِلْيَهُودِ ‏ \"‏ أَنْشُدُكُمْ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى مَا تَجِدُونَ فِي التَّوْرَاةِ عَلَى مَنْ زَنَى ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ فِي قِصَّةِ الرَّجْمِ ‏.‏",
        "translations": {
          "en": "Abu Hurairah said:The holy Prophet (ﷺ) said to the Jew : I adjure you by Allah Who sent down the Torah to Moses ! do you not find in the Torah(a rule about a man) who commits adultery. He then narrated the rest of the tradition relating to the stoning",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے یہودیوں سے فرمایا: میں تمہیں اس اللہ کی قسم دیتا ہوں جس نے موسیٰ علیہ السلام پر تورات نازل کی کہ تم لوگ زانی کے متعلق تورات میں کیا حکم پاتے ہو ۔ اور راوی نے واقعہ رجم سے متعلق پوری حدیث بیان کی۔",
          "fr": "Abu Hurayrah رضي الله عنه a dit : Le Saint Prophète ﷺ a dit au Juif : « Je t’adjure par Allah qui a fait descendre la Torah sur Moïse ! Ne trouves-tu pas dans la Torah (une règle concernant un homme) qui commet l’adultère ? » Il a ensuite raconté le reste du récit concernant la lapidation",
          "tr": "Ebû Hureyre'den rivayet edildiğne göre; Nebi (s.a.v.) yahudilere (yemin teklif ederken) şöyle buyurdu: \"Sizden, Tevrat'ı Musa'ya indiren Allah aşkına doğru söylemenizi istiyorum; Tevrat'ta zina eden kimse hakkında hiçbir hükme rastladınız mı?\" Musannif Ebû Dâvûd, bu hadisi recm olayında (4446 numaralı hadis) da nakletmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 3625,
      "arabicNumber": 3625,
      "book": 25,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الأَصْبَغِ، حَدَّثَنِي مُحَمَّدٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، بِهَذَا الْحَدِيثِ وَبِإِسْنَادِهِ قَالَ حَدَّثَنِي رَجُلٌ، مِنْ مُزَيْنَةَ مِمَّنْ كَانَ يَتَّبِعُ الْعِلْمَ وَيَعِيهِ يُحَدِّثُ سَعِيدَ بْنَ الْمُسَيَّبِ وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ ‏.‏",
        "translations": {
          "en": "The tradition mentioned above has also been transmitted by al-Zuhri through a different chain of narrator. This version has:A man from Muzainah who followed the knowledge and memorized it to me that sa’id b.al-Musayyab transmitted it. He then mentioned the rest of the tradition to the same effect",
          "ur": "اس سند سے بھی زہری سے یہی حدیث اسی طریق سے مروی ہے اس میں ہے کہ مجھ سے مزینہ کے ایک آدمی نے جو علم کا شیدائی تھا اور اسے یاد رکھتا تھا بیان کیا ہے وہ سعید بن مسیب سے بیان کر رہا تھا، پھر راوی نے پوری حدیث اسی مفہوم کی ذکر کی",
          "fr": "Ce récit a également été rapporté par al-Zuhri avec une autre chaîne de transmetteurs. Cette version précise : Un homme de Muzainah, qui a suivi la science et l’a mémorisée pour moi, m’a rapporté que Sa’id ibn al-Musayyab l’a transmis. Il a ensuite mentionné la suite du récit dans le même sens",
          "tr": "Şu (bir önceki 3624.) hadis (yine bir önceki) senediyle ez-Zührî'den de rivayet olunmuştur. Bu hadiste (şu ibare vardır: ez-Zührî): \"Bana (bu hadisi) Müzeyne (kabilesin) den, ilim peşinde koşup onu gereğince belleyen bir adam haber verdi. (Ve bu adam bu hadisi kendisine rivayet eden kimseden bahsederken) Saîd b. el-Müseyyeb'i zikretti\" dedi ve (önceki hadisi) manasıyla rivayet etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 3626,
      "arabicNumber": 3626,
      "book": 25,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ يَعْنِي لاِبْنِ صُورِيَا ‏ \"‏ أُذَكِّرُكُمْ بِاللَّهِ الَّذِي نَجَّاكُمْ مِنْ آلِ فِرْعَوْنَ وَأَقْطَعَكُمُ الْبَحْرَ وَظَلَّلَ عَلَيْكُمُ الْغَمَامَ وَأَنْزَلَ عَلَيْكُمُ الْمَنَّ وَالسَّلْوَى وَأَنْزَلَ عَلَيْكُمُ التَّوْرَاةَ عَلَى مُوسَى أَتَجِدُونَ فِي كِتَابِكُمُ الرَّجْمَ ‏\"‏ ‏.‏ قَالَ ذَكَّرْتَنِي بِعَظِيمٍ وَلاَ يَسَعُنِي أَنْ أَكْذِبَكَ ‏.‏ وَسَاقَ الْحَدِيثَ ‏.‏",
        "translations": {
          "en": "Narrated Ikrimah: The Holy Prophet (ﷺ) said to Ibn Suriya': I remind you by Allah Who saved you from the people of Pharaoh, made you cover the sea, gave you the shade of clouds, sent down to you manna and quails, sent down you Torah to Moses, do you find stoning (for adultery) in your Book? He said: You have reminded me by the Great. It is not possible for me to belie you. He then transmitted the rest of the tradition",
          "ur": "عکرمہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اس سے یعنی ابن صوریا ۱؎ سے فرمایا: میں تمہیں اس اللہ کی یاد دلاتا ہوں جس نے تمہیں آل فرعون سے نجات دی، تمہارے لیے سمندر میں راستہ بنایا، تمہارے اوپر ابر کا سایہ کیا، اور تمہارے اوپر من و سلوی نازل کیا، اور تمہاری کتاب تورات کو موسیٰ علیہ السلام پر نازل کیا، کیا تمہاری کتاب میں رجم ( زانی کو پتھر مارنے ) کا حکم ہے؟ ابن صوریا نے کہا: آپ نے بہت بڑی چیز کا ذکر کیا ہے لہٰذا میرے لیے آپ سے جھوٹ بولنے کی کوئی گنجائش نہیں رہی اور راوی نے پوری حدیث بیان کی۔",
          "fr": "Rapporté par Ikrimah : Le Prophète ﷺ a dit à Ibn Suriya : « Je te rappelle par Allah, Celui qui t’a sauvé du peuple de Pharaon, t’a fait traverser la mer, t’a donné l’ombre des nuages, a fait descendre sur toi la manne et les cailles, a fait descendre la Torah à Moïse. Trouves-tu la lapidation (pour l’adultère) dans ton Livre ? » Il répondit : « Tu m’as rappelé par le Très-Grand. Je ne peux pas te contredire. » Il transmit ensuite le reste du récit",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] telah menceritakan kepada kami [seorang laki-laki Muzainah] -saat itu kami berada di sisi Sa'id bin Al Musayyab- dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam berkata kepada seorang Yahudi: \"Aku sumpahi kamu atas nama Allah yang telah menurunkan Taurat kepada Musa, hukuman apakah yang kalian dapatkan dalam Taurat terhadap orang yang berzina? Abu Hurairah menyebutkan terusan hadits tersebut dalam masalah rajam.\" Telah menceritakan kepada kami [Abdul Aziz bin Yahya Abu Al Ashbagh] telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Az Zuhri] dengan hadits ini dan dengan sanadnya. Ia berkata; telah menceritakan kepadaku [seorang laki-laki Muzainah] dari orang yang mengikuti ilmu dan memahaminya, ia menceritakan dari Sa'id bin Al Musayyab, lalu ia menyebutkan hadits tersebut dengan maknanya.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Ikrimah] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada Ibnu Shuriya: \"Aku ingatkan kalian kepada Allah yang telah menyelamatkan kalian dari keluarga Fir'aun, membelah laut untuk kalian, menaungi kalian dengan awan, menurunkan Al Mann dan As Salwa kepada kalian, serta menurunkan Taurat kepada Musa. Apakah kalian mendapatkan rajam dalam Kitab kalian?\" Ibnu Shuriya menjawab, \"Engkau telah mengingatkan aku dengan sesuatu yang agung, tidak ada alasan bagiku untuk mendustaimu….. lalu ia menyebutkan hadits tersebut",
          "tr": "İkrime'den rivayet olunduğuna göre; Nebi (s.a.v.) İbn Sûriyâ'ya (yemin teklif ederken) şöyle dedi: \"Size, sizi Firavun hanedanından kurtaran, denizi size yaran ve üzerinizi bulutlarla gölgelendiren ve size kudret helvasıyla bıldırcın indiren, Musa'ya indirdiği Tevrat'ı size de gönderen Allah'ı hatırlatarak size yemin veriyorum. (Doğru söyleyin), siz kitabınızda recm cezasını görüyor musunuz?\" İbn Sûriyâ da: Sen bana çok büyük bir yemin verdin. Artık benim yalan söylemem caiz olmaz, dedi. (Ravi rivayetine devam ederek bir önceki) hadisi (bütünüyle) rivayet etti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 56
      },
      "narrator": {
        "en": "Ikrimah"
      }
    },
    {
      "hadithNumber": 3627,
      "arabicNumber": 3627,
      "book": 25,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ، وَمُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ، قَالاَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ سَيْفٍ، عَنْ عَوْفِ بْنِ مَالِكٍ، أَنَّهُ حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بَيْنَ رَجُلَيْنِ ‏.‏ فَقَالَ الْمَقْضِيُّ عَلَيْهِ لَمَّا أَدْبَرَ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يَلُومُ عَلَى الْعَجْزِ وَلَكِنْ عَلَيْكَ بِالْكَيْسِ فَإِذَا غَلَبَكَ أَمْرٌ فَقُلْ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Awf ibn Malik: The Holy Prophet (ﷺ) gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet (ﷺ) said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs",
          "ur": "عوف بن مالک رضی اللہ عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم نے دو شخصوں کے درمیان فیصلہ کیا، تو جس کے خلاف فیصلہ دیا گیا واپس ہوتے ہوئے کہنے لگا: مجھے بس اللہ کافی ہے اور وہ بہتر کار ساز ہے، اس پر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ بیوقوفی پر ملامت کرتا ہے لہٰذا زیر کی و دانائی کو لازم پکڑو، پھر جب تم مغلوب ہو جاؤ تو کہو: میرے لیے بس اللہ کافی ہے اور وہ بہترین کار ساز ہے ۔",
          "fr": "Rapporté par Awf ibn Malik : Le Prophète ﷺ a rendu un jugement entre deux hommes, et celui contre qui la décision a été prise s’est détourné en disant : « Allah me suffit, et Il est le meilleur garant de mes affaires. » Le Prophète ﷺ a dit : « Allah, le Très-Haut, blâme ceux qui manquent d’efforts, mais utilisez votre intelligence, et quand la situation vous dépasse, dites : “Allah me suffit, et Il est le meilleur garant de mes affaires.” »",
          "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] dan [Musa bin Marwan Ar Raqqi] mereka berkata; telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Saif] dari ['Auf bin Malik] bahwa ia menceritakan kepada mereka, bahwa Nabi shallallahu 'alaihi wasallam telah memberikan keputusan di antara dua orang laki-laki, kemudian orang yang diputuskan atasnya ketika pergi mengatakan, \"Cukuplah Allah bagiku dan Dia adalah sebaik-baik pelindung.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah mencela kelemahan, hendaklah kalian berlaku bijak, jika kalian mendapati sesuatu yang kalian tidak sukai maka ucapkanlah: HASBIALLAHU WA NI'MAL WAKIL (Cukuplah Allah bagiku dan Dia adalah sebaik-baik pelindung)",
          "tr": "Avf b. Mâlik'ten, şöyle dediği rivayet olunmuştur: Nebi (s.a.v.) iki kişi arasında hüküm vermişti. (Bunlardan) aleyhine hüküm verilen adam, dönüp giderken; \"Hasbiyallah ve ni'mel vekîl = Bana Allah yeter; O, ne güzel bir vekildir\" dedi. (Bunu gören) Nebi (s.a.v.) de (ona): \"Allah miskinlerden hoşlanmaz. Senin akıllıca ve tedbirli davranman gerekir. Binaenaleyh bir iş karşısında acze düştüğün zaman, (işi oluruna bırakıverme, gereken tedbirleri akıllıca al) sonra; hasbiyyallah ve ni'mel vekîl, de\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 57
      },
      "narrator": {
        "en": "Awf ibn Malik"
      }
    },
    {
      "hadithNumber": 3628,
      "arabicNumber": 3628,
      "book": 25,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ وَبْرِ بْنِ أَبِي دُلَيْلَةَ، عَنْ مُحَمَّدِ بْنِ مَيْمُونٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَىُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ الْمُبَارَكِ يُحِلُّ عِرْضَهُ يُغَلَّظُ لَهُ وَعُقُوبَتَهُ يُحْبَسُ لَهُ ‏.‏",
        "translations": {
          "en": "Narrated Ash-Sharid: The Prophet (ﷺ) said: Delay in payment on the part of one who possesses means makes it lawful to dishonour and punish him. Ibn al-Mubarak said that \"dishonour\" means that he may be spoken to roughly and \"punish\" means he may be imprisoned for it",
          "ur": "شرید رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مالدار آدمی کا ٹال مٹول کرنا اس کی ہتک عزتی اور سزا کو جائز کر دیتا ہے ۔ ابن مبارک کہتے ہیں: ہتک عزتی سے مراد اسے سخت سست کہنا ہے، اور سزا سے مراد اسے قید کرنا ہے۔",
          "fr": "Rapporté par Ash-Sharid : Le Prophète ﷺ a dit : « Le retard de paiement de la part de quelqu’un qui en a les moyens rend licite de l’humilier et de le punir. » Ibn al-Mubarak a expliqué que « l’humilier » signifie qu’on peut lui parler durement et « le punir » signifie qu’il peut être emprisonné pour cela",
          "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Wabr bin Abu Dulailah] dari [Muhammad bin Maimun] dari ['Amru bin Asy Syarid] dari [Ayahnya] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Orang mampu yang menunda pembayaran hutangnya, maka kehormatan dan hukuman telah halal untuknya.\" Ibnu Al Mubarak berkata, \"Halal kehormatannya maksudnya boleh untuk mengeraskan suara (mencela), dan halal hukumannya maksudnya adalah memenjarakannya",
          "tr": "Amr b. eş-Şerîd'in babasından, Rasulullah (Sallallahu aleyhi ve Sellem)'in şöyle buyurduğu rivayet edilmiştir: \"Varlıklı bir kimse'nin borcununu ödemeyi geciktirmesi (alacaklıya ondan) şikâyetçi olmayı ve (hâkime de) onu (hapis cezasıyle) cezalandırmayı meşru kılar.\" Îbnü'l-Mübârek dedi ki; (Metinde geçen) \"Yuhillu ırzahû\" (cümlesi) \"Ona sertçe çıkışabilir\" anlamına gelir, \"Ve ukûbetehu\" cümlesi de, \"hapsedilebilir' anlamına gelir. Diğer tahric: Buhari, istikrad; Nesâî, buyu'; İbn Mâce, sadakat; Ahmed b. Hanbel, V"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 58
      },
      "narrator": {
        "en": "Ash-Sharid"
      }
    },
    {
      "hadithNumber": 3629,
      "arabicNumber": 3629,
      "book": 25,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَخْبَرَنَا هِرْمَاسُ بْنُ حَبِيبٍ، - رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ - عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِغَرِيمٍ لِي فَقَالَ لِي ‏\"‏ الْزَمْهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ لِي ‏\"‏ يَا أَخَا بَنِي تَمِيمٍ مَا تُرِيدُ أَنْ تَفْعَلَ بِأَسِيرِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Grandfather of Hirmas ibn Habib: I brought my debtor to the Holy Prophet (ﷺ). He said to me: Stick to him. He again said to me: O brother of Banu Tamim, what do you want to do with your prisoner",
          "ur": "حبیب تمیمی عنبری سے روایت ہے کہ ان کے والد نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنے ایک قرض دار کو لایا تو آپ نے مجھ سے فرمایا: اس کو پکڑے رہو پھر آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: اے بنو تمیم کے بھائی تم اپنے قیدی کو کیا کرنا چاہتے ہو؟ ۔",
          "fr": "Rapporté par le grand-père de Hirmas ibn Habib : J’ai amené mon débiteur auprès du Prophète ﷺ. Il m’a dit : « Reste auprès de lui. » Puis il m’a encore dit : « Ô frère des Banou Tamim, que veux-tu faire de ton prisonnier ? »",
          "id": "Telah menceritakan kepada kami [Mu'adz bin Asad] telah menceritakan kepada kami [An Nadlr bin Syumail] telah mengabarkan kepada kami [Hirmas bin Habib] seorang laki-laki dari penduduk badui, dari [Ayahnya] dari [Kakeknya] ia berkata, \"Aku datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa orang yang berhutang kepadaku, lalu beliau bersabda: \"Tetaplah bersamanya!\" Kemudian beliau bertanya: \"Wahai saudara Bani Tamim, apa yang engkau ingin engkau lakukan terhadap tawananmu?",
          "tr": "Bedevilerden birisi olan Hirmâs b. Habib'in dedesinin şöyle dediği rivayet olunmuştur: Bana borçlu olan bir kimseyi Nebi (Sallallahu aleyhi ve Sellem)'e getirmiştim. Bana; \"Borçlunun peşini bırakma\" buyurdu. (Bir süre) sonra da, \"Ey Temîm oğullarının kardeşi, esirine ne yapmak istiyorsun?\" dedi. Diğer tahric: İbn Mâce, sadakat"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 59
      },
      "narrator": {
        "en": "Grandfather of Hirmas ibn Habib"
      }
    },
    {
      "hadithNumber": 3630,
      "arabicNumber": 3630,
      "book": 25,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ بَهْزِ بْنِ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حَبَسَ رَجُلاً فِي تُهْمَةٍ ‏.‏",
        "translations": {
          "en": "Bahz bin Hakim, on his father's authority, said that his grandfather told that the Prophet (ﷺ) imprisoned a man on suspicion",
          "ur": "معاویہ بن حیدہ قشیری رضی اللہ عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم نے ایک الزام میں ایک شخص کو قید میں رکھا۔",
          "fr": "Bahz ibn Hakim, rapportant de son père, a dit que son grand-père a raconté que le Prophète ﷺ a emprisonné un homme par simple soupçon",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam menahan seorang laki-laki karena suatu tuduhan",
          "tr": "Behz b. Hâkim'in dedesinden rivayet olduğuna göre; Nebi (s.a.v.) bir adamı, bir suçlamadan dolayı hapsetmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 3631,
      "arabicNumber": 3631,
      "book": 25,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ، وَمُؤَمَّلُ بْنُ هِشَامٍ، - قَالَ ابْنُ قُدَامَةَ - حَدَّثَنِي إِسْمَاعِيلُ، عَنْ بَهْزِ بْنِ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، - قَالَ ابْنُ قُدَامَةَ - إِنَّ أَخَاهُ أَوْ عَمَّهُ وَقَالَ مُؤَمَّلٌ - إِنَّهُ قَامَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَخْطُبُ فَقَالَ جِيرَانِي بِمَا أَخَذُوا ‏.‏ فَأَعْرَضَ عَنْهُ مَرَّتَيْنِ ثُمَّ ذَكَرَ شَيْئًا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ خَلُّوا لَهُ عَنْ جِيرَانِهِ ‏\"‏ ‏.‏ لَمْ يَذْكُرْ مُؤَمَّلٌ وَهُوَ يَخْطُبُ ‏.‏",
        "translations": {
          "en": "Bahz ibn Hakim reported from his grandfather:(Ibn Qudamah's version has: His grandfather's brother or uncle reported:) - the narrator Mu'ammal said: - He (his grandfather Mu'awiyah) got up before the Holy Prophet (ﷺ) who was giving sermon: and he said: Why have your companions arrested my neighbours? He turned away from him twice. He (his grandfather Mu'awiyah) then mentioned something. The Holy Prophet (ﷺ) then said: Let his neighbours go. (Mu'ammal did not mention the words \"He was giving sermon)",
          "ur": "معاویہ بن حیدہ رضی اللہ عنہ روایت کرتے ہیں ابن قدامہ کی روایت میں ہے کہ ان کے بھائی یا ان کے چچا اور مومل کی روایت میں ہے وہ خود نبی اکرم صلی اللہ علیہ وسلم کے پاس کھڑے ہوئے اور آپ خطبہ دے رہے تھے تو یہ کہنے لگے: کس وجہ سے میرے پڑوسیوں کو پکڑ لیا گیا ہے؟ تو آپ نے ان سے دو مرتبہ منہ پھیر لیا پھر انہوں نے کچھ ذکر کیا تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس کے پڑوسیوں کو چھوڑ دو اور مومل نے یہ ذکر نہیں کیا ہے کہ آپ خطبہ دے رہے تھے۔",
          "fr": "Bahz ibn Hakim rapporte de son grand-père : (La version d’Ibn Qudamah précise : Son frère ou son oncle paternel a rapporté :) – le narrateur Mu’ammal a dit : – Son grand-père Mu’awiyah s’est levé devant le Prophète ﷺ qui faisait un sermon et a dit : « Pourquoi tes compagnons ont-ils arrêté mes voisins ? » Il s’est détourné de lui deux fois. Puis (son grand-père Mu’awiyah) a mentionné quelque chose. Le Prophète ﷺ a alors dit : « Relâchez ses voisins. » (Mu’ammal n’a pas mentionné les mots « Il faisait un sermon »)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah] dan [Muammal bin Hisyam], [Ibnu Qudamah] berkata; telah menceritakan kepadaku [Isma'il] dari [Bahz bin Hakim] dari [Ayahnya] dari [kakeknya], Ibnu Qudamah berkata, \"Sesungguhnya saudaranya atau pamannya, sedangkan Mu`ammal berkata, \"Sesungguhnya ia bangkit menemui Nabi shallallahu 'alaihi wasallam saat beliau sedang berkhutbah. Lalu ia berkata, \"Karena apa para tetanggaku ditahan?\" kemudian beliau berpaling darinya sebanyak dua kali. Kemudian ia menyebutkan sesuatu, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Bebaskanlah para tetangganya!\" Namun Mu`ammal tidak menyebutkan lafadz, 'saat beliau sedang berkhutbah",
          "tr": "İbn Kudâme'nin dedi(ğine göre, Behz b. Hakim b. Muâviye'nin dedesi olan. Muâviye îbn Hayde'nin) kardeşi ya da amcası: Müemmel'in söyledi (ğine göre ise Muâviye'nin bizzat) kendisi kalkıp hutbe okumakta olan Hz. Nebi'e varmış ve iki defa: Komşularım niçin tutuklandılar? diye sormuş. Sonra cevap alamayınca bir şeyler daha söylemiş. Bunun üzerine Nebi (s.a.v.): \"Onun komşularım serbest bırakınız\" buyurmuş. (Ancak) Müemmel, (İbn Kudâme'nin rivayetinde geçen) \"hutbe okumakta olan\" sözünü rivayet etmemiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Isnaad"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Isnaad"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 3632,
      "arabicNumber": 3632,
      "book": 25,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا عَمِّي، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَهُ يُحَدِّثُ، قَالَ أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ وَقُلْتُ لَهُ إِنِّي أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ ‏.‏ فَقَالَ ‏ \"‏ إِذَا أَتَيْتَ وَكِيلِي فَخُذْ مِنْهُ خَمْسَةَ عَشَرَ وَسْقًا فَإِنِ ابْتَغَى مِنْكَ آيَةً فَضَعْ يَدَكَ عَلَى تَرْقُوَتِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Jabir ibn Abdullah: I intended to go (on expedition) to Khaybar. So I came to the Holy Prophet (ﷺ), greeted him and said: I am intending to go to Khaybar. He said: When you come to my agent, you should take from him fifteen wasqs (of dates). If he asks you for a sign, then place your hand on his collar-bone",
          "ur": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ میں نے خیبر کی جانب نکلنے کا ارادہ کیا تو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور سلام کیا پھر میں نے عرض کیا: میں خیبر جانے کا ارادہ رکھتا ہوں آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم میرے وکیل کے پاس جانا تو اس سے پندرہ وسق کھجور لے لینا اور اگر وہ تم سے کوئی نشانی طلب کرے تو اپنا ہاتھ اس کے گلے پر رکھ دینا ۱؎ ۔",
          "fr": "Rapporté par Jabir ibn Abdullah : Je voulais partir (en expédition) à Khaybar. Je suis donc allé voir le Prophète ﷺ, je l’ai salué et j’ai dit : « J’ai l’intention d’aller à Khaybar. » Il a dit : « Quand tu arriveras auprès de mon agent, prends de lui quinze wasqs (de dattes). S’il te demande un signe, pose ta main sur sa clavicule. »",
          "id": "Telah menceritakan kepada kami ['Ubaidullah bin Sa'dan bin Ibrahim] telah menceritakan kepada kami [Pamanku] telah menceritakan kepada kami [Ayahku] dari [Ibnu Ishaq] dari [Abu Nu'aim Wahb bin Kaisan] dari [Jabir bin Abdullah] bahwa ia mendengarnya menceritakan, ia berkata, \"Aku ingin pergi ke Khaibar, lalu aku datang menemui Rasulullah shallallahu 'alaihi wasallam, aku ucapkan salam kemudian berkata, \"Sesungguhnya aku ingin pergi ke Khaibar.\" Kemudian beliau bersabda: \"Apabila engkau datang kepada wakilku, maka ambillah darinya lima belas wasaq, dan apabila ia menginginkan tanda darimu maka letakkan tanganmu pada tulang bahunya",
          "tr": "Câbir b. Abdullah'tan (r.a) şöyle dediği rivayet olunmuştur: Ben Hayber'e gitmek istemiştim. Nebi (s.a.v.)'e varıp selâm verdim ve kendisine; Ben Hayber'e gitmek istiyorum, dedim. \"Vekilimin yanına vardığın zaman ondan (benim hesabıma) on-beş vesk (hurma) al. Eğer senden (benim vekilim olduğuna dair) bir alâmet isterse, elini onun köprücük kemiğinin üstüne koy\" buyurdu"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 62
      },
      "narrator": {
        "en": "Jabir ibn Abdullah"
      }
    },
    {
      "hadithNumber": 3633,
      "arabicNumber": 3633,
      "book": 25,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ، حَدَّثَنَا قَتَادَةُ، عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا تَدَارَأْتُمْ فِي طَرِيقٍ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuHurayrah: The Prophet (ﷺ) said: If you dispute over a pathway, leave the margin of seven yards",
          "ur": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم کسی راستہ کے متعلق جھگڑو تو سات ہاتھ راستہ چھوڑ دو ۱؎ ۔",
          "fr": "Rapporté par Abu Hurayrah رضي الله عنه : Le Prophète ﷺ a dit : « Si vous vous disputez pour un passage, laissez une marge de sept coudées. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Al Mutsanna bin Sa'id] telah menceritakan kepada kami [Qatadah] dari [Busyair bin Ka'b Al 'Adawi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kalian berselisih dengan (batas), maka jadikanlah jalan tersebut lebarnya adalah tujuh hasta",
          "tr": "Ebû Hureyre (s.a.v.)'den rivayet olunduğuna göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Yol (un eni)hakkında anlaşmazlığa düştüğünüz zaman onu yedi arşın yapın"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 63
      },
      "narrator": {
        "en": "AbuHurayrah"
      }
    },
    {
      "hadithNumber": 3634,
      "arabicNumber": 3634,
      "book": 25,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، وَابْنُ أَبِي خَلَفٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا اسْتَأْذَنَ أَحَدُكُمْ أَخَاهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلاَ يَمْنَعْهُ ‏\"‏ ‏.‏ فَنَكَسُوا فَقَالَ مَا لِي أَرَاكُمْ قَدْ أَعْرَضْتُمْ لأُلْقِيَنَّهَا بَيْنَ أَكْتَافِكُمْ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا حَدِيثُ ابْنِ أَبِي خَلَفٍ وَهُوَ أَتَمُّ ‏.‏",
        "translations": {
          "en": "Abu Hurairah reported the Holy Prophet(ﷺ) as saying:When one of you asks permission for inserting a wooden peg in his wall, he should not prevent him. So they (the people) lowered down their heads. Then he (Abu Hurairah) said: What is the matter ? I am seeing you are neglecting (to hear this tradition), I shall spread it among you. Abu Dawud said:This is the tradition of Ibn Abi Khalaf is more perfect",
          "ur": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی اپنے بھائی سے اس کی دیوار میں لکڑی گاڑنے کی اجازت طلب کرے تو وہ اسے نہ روکے یہ سن کر لوگوں نے سر جھکا لیا تو ابوہریرہ رضی اللہ عنہ نے کہا: کیا بات ہے جو میں تمہیں اس حدیث سے اعراض کرتے ہوئے دیکھ رہا ہوں، میں تو اسے تمہارے شانوں کے درمیان ڈال ہی کر رہوں گا ( یعنی اسے تم سے بیان کر کے ہی چھوڑوں گا ) ۔ ابوداؤد کہتے ہیں: یہ ابن ابی خلف کی حدیث ہے اور زیادہ کامل ہے۔",
          "fr": "Abu Hurairah رضي الله عنه rapporte que le Prophète ﷺ a dit : « Quand l’un de vous demande la permission d’enfoncer une cheville en bois dans le mur de son voisin, il ne doit pas l’en empêcher. » Les gens baissèrent alors la tête. Puis il (Abu Hurairah) dit : « Qu’y a-t-il ? Je vois que vous négligez d’écouter cette tradition, je vais la répandre parmi vous. » Abu Dawud a dit : « La version d’Ibn Abi Khalaf est plus complète. »",
          "id": "Telah menceritakan kepada kami [Musaddad] dan [Ibnu Abu Khalaf] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian meminta izin kepada saudaranya untuk meletakkan kayu pada dindingnya maka izinkanlah, lalu mereka mengiyakan dengan kepalanya. Lalu dia berkata; 'Kenapa saya masih melihat kalian menolaknya. Sungguh saya akan menyampaikan kepada mereka.\" Abu Daud berkata; Ini adalah hadits Ibnu Abu Khalaf, dan merupakan yang paling lengkap",
          "tr": "Ebû Hureyre (r.a)'den rivayet olduğuna göre; Rasûlullah (s.a.v.): \"Biriniz (din kardeşinizden) duvarına ağaç (ucu) sokmak için izin isterse (duvar sahibi) onu(n bu isteğim) reddetmesin\" buyurmuştur. (Bu hadisi Ebû Hureyre'den rivayet eden A'rac bu hadise ilâveten şunları da söyledi: Ebû Hureyre bu hadisi söyleyince onu dinleyen halk işittikleri sözlerden memnun olmadılar, hemen) başlarını önlerine eğdiler. Bunun üzerine (Ebû Hureyre): \"Sizi niçin (böyle hadisten) yüz çevirir bir halde görüyorum? (Şunu iyi bilin ki) ben bu (sözün sorumluluğu) nu sizin omuzlarınız üzerine atıyorum.\" dedi. Ebû Dâvûd dedi ki; \"Bu hadisi bana îbn Ebî Halef rivayet etmiştir, en uzun rivayet de budur.”"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (2463) Sahih Muslim (1609)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 3635,
      "arabicNumber": 3635,
      "book": 25,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ لُؤْلُؤَةَ، عَنْ أَبِي صِرْمَةَ، - قَالَ أَبُو دَاوُدَ قَالَ غَيْرُ قُتَيْبَةَ فِي هَذَا الْحَدِيثِ عَنْ أَبِي صِرْمَةَ صَاحِبِ النَّبِيِّ صلى الله عليه وسلم - عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated AbuSirmah: The Prophet (ﷺ) said: If anyone harms (others), Allah will harm him, and if anyone shows hostility to others, Allah will show hostility to him",
          "ur": "ابوصرمہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے کسی کو تکلیف پہنچائی تو اللہ تعالیٰ اسے تکلیف پہنچائے گا، اور جس نے کسی سے دشمنی کی تو اللہ تعالیٰ اس سے دشمنی کرے گا ۔",
          "fr": "Rapporté par Abu Sirmah : Le Prophète ﷺ a dit : « Celui qui fait du tort aux autres, Allah lui fera du tort, et celui qui se montre hostile envers les autres, Allah sera hostile envers lui. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Muhammad bin Yahya bin Habban] dari [Luluah] dari [Abu Shirmah] -selain Qutaibah telah menyebutkan hadits ini dari Shirmah- sahabat Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa menimpakan madharat (keburukan) kepada orang lain maka Allah akan menimpakan madharat kepadanya, dan barangsiapa memperberat orang lain maka Allah akan memperberat dirinya",
          "tr": "Nebi (s.a.v.)'in sahâbîlerinden olan Ebû Sırma'dan rivayet edildiğine göre; Nebi (s.a.v.) şöyle buyurmuştur: \"Zarar verene Allah zarar verir. Güçlük çıkaran'a Allah güçlük çıkarır"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 65
      },
      "narrator": {
        "en": "AbuSirmah"
      }
    },
    {
      "hadithNumber": 3636,
      "arabicNumber": 3636,
      "book": 25,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا وَاصِلٌ، مَوْلَى أَبِي عُيَيْنَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ، مُحَمَّدَ بْنَ عَلِيٍّ يُحَدِّثُ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّهُ كَانَتْ لَهُ عَضُدٌ مِنْ نَخْلٍ فِي حَائِطِ رَجُلٍ مِنَ الأَنْصَارِ قَالَ وَمَعَ الرَّجُلِ أَهْلُهُ قَالَ فَكَانَ سَمُرَةُ يَدْخُلُ إِلَى نَخْلِهِ فَيَتَأَذَّى بِهِ وَيَشُقُّ عَلَيْهِ فَطَلَبَ إِلَيْهِ أَنْ يَبِيعَهُ فَأَبَى فَطَلَبَ إِلَيْهِ أَنْ يُنَاقِلَهُ فَأَبَى فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَطَلَبَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم أَنْ يَبِيعَهُ فَأَبَى فَطَلَبَ إِلَيْهِ أَنْ يُنَاقِلَهُ فَأَبَى ‏.‏ قَالَ ‏\"‏ فَهَبْهُ لَهُ وَلَكَ كَذَا وَكَذَا ‏\"‏ ‏.‏ أَمْرًا رَغَّبَهُ فِيهِ فَأَبَى فَقَالَ ‏\"‏ أَنْتَ مُضَارٌّ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلأَنْصَارِيِّ ‏\"‏ اذْهَبْ فَاقْلَعْ نَخْلَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Ja'far Muhammad bin 'Ali reported from Samurah ibn Jundub that he had a row of palm-trees in the garden of a man of the Ansar. The man had his family with him. Samurah used to visit his palm-trees, and the man was annoyed by that and felt it keenly. So he asked him (Samurah) to sell them to him, but he refused. He then asked him to take something else in exchange, but he refused. So he came to the Holy Prophet (ﷺ) and mentioned it to him. The Holy Prophet (ﷺ) asked him to sell it to him, but he refused. He asked him to take something else in exchange, but he refused. He then said:Give it to him and you can have such and such, mentioning something with which he tried to please him, but he refused. He then said: You are a nuisance. The Messenger of Allah (ﷺ) then said to the Ansari: Go and uproot his palm-trees",
          "ur": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ ایک انصاری کے باغ میں ان کے کھجور کے کچھ چھوٹے چھوٹے درخت تھے، اور اس شخص کے ساتھ اس کے اہل و عیال بھی رہتے تھے۔ راوی کا بیان ہے کہ سمرہ رضی اللہ عنہ جب اپنے درختوں کے لیے جاتے تو انصاری کو تکلیف ہوتی اور ان پر شاق گزرتا اس لیے انصاری نے ان سے اسے فروخت کر دینے کا مطالبہ کیا، لیکن انہوں نے انکار کر دیا، پھر اس نے ان سے یہ گزارش کی کہ وہ درخت کا تبادلہ کر لیں وہ اس پر بھی راضی نہیں ہوئے تو وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور اس نے آپ سے اس واقعہ کو بیان کیا، تو آپ نے بھی ان سے فرمایا: اسے بیچ ڈالو پھر بھی وہ نہ مانے تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے درخت کے تبادلہ کی پیش کش کی لیکن وہ اپنی بات پر اڑے رہے تو آپ صلی اللہ علیہ وسلم نے فرمایا: پھر تم اسے ہبہ کر دو، اس کے عوض فلاں فلاں چیزیں لے لو بہت رغبت دلائی مگر وہ نہ مانے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم «مضار» یعنی ایذا دینے والے ہو تب رسول اللہ صلی اللہ علیہ وسلم نے انصاری سے فرمایا: جاؤ ان کے درختوں کو اکھیڑ ڈالو ۔",
          "fr": "Abu Ja’far Muhammad bin ‘Ali rapporte de Samurah ibn Jundub qu’il possédait une rangée de palmiers dans le jardin d’un homme des Ansar. Cet homme vivait là avec sa famille. Samurah venait voir ses palmiers, ce qui agaçait beaucoup l’homme. Il lui demanda de les lui vendre, mais Samurah refusa. Il lui proposa un échange, mais il refusa aussi. Il alla alors voir le Prophète ﷺ et lui en parla. Le Prophète ﷺ demanda à Samurah de les lui vendre, mais il refusa. Il lui proposa un échange, mais il refusa encore. Il lui dit alors : « Donne-les-lui et tu auras telle et telle chose », en essayant de le convaincre, mais il refusa. Le Prophète ﷺ lui dit alors : « Tu es une nuisance. » Puis il dit à l’Ansari : « Va et arrache ses palmiers. »",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Washil] mantan budak Abu 'Uyainah, ia berkata; saya mendengar [Abu Ja'far Muhammad bin Ali] menceritakan dari [Samurah bin Jundub] bahwa ia dahulu memiliki pohon kurma kecil yang berada di kebun seorang laki-laki anshar.\" Samurah berkata, \"Laki-laki itu mempunyai keluarga.\" Muhammad berkata, \"Samurah pernah memasuki kebun kurmanya sehingga laki-laki Anshar tersebut merasa terganggu dan berat hati. Lalu ia meminta kepada Samurah untuk menjual pohon kurma tersebut, namun Samurah menolak. Lalu laki-laki Anshar itu meminta agar ia memindahnya, namun Samurah menolak. Maka ia pun datang menemui Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepadanya. Nabi shallallahu 'alaihi wasallam kemudian meminta Samurah agar menjual pohon kurma tersebut, namun ia menolak, lalu beliau memintanya agar memindahkannya namun Samurah tetap menolak. Beliau pun bersabda: \"Berikan kepadanya dan bagimu demikian dan demikian.\" -sesuatu yang menyenangkan-, namun ia menolak. Beliau lalu bersabda: \"Engkau adalah orang yang menimbulkan madlarat (kesusahan).\" Rasulullah shallallahu 'alaihi wasallam kemudian berkata kepada orang Anshar tersebut: \"Pergi dan cabutlah pohon kurmanya",
          "tr": "Semure b. Cündüb'den rivayet olunduğuna göre; Kendisinin Ensar'dan birisinin bahçesinde yeni dikilmiş bir hurma ağacı varmış. (Bahçe sahibi olan) kişi ailesi ile beraber (o bahçede kalıyor) imiş. Semüre o hurmanın yanına giri(p çıkı)yormuş. Onun bu giriş çıkışından (bahçe sahibi) rahatsız oluyor ve (bu durum) onun gücüne gidiyormuş. Bu sebeple (Semüre'den) bu hurmayı kendisine satmasını istemiş. Semure (bu teklifi) kabul etmemiş. Bunun üzerine Semure'ye ağacı (oradan söküp başka bir bahçeye) götürmesini teklif etmiş. (Semure bu teklifi de) reddetmiş. Bunun üzerine (bahçe sahibi) Nebi (s.a.v.)'e varıp durumu kendisine anlatmış. Nebi (s.a.v.) de Semure'ye bu ağacı (bahçe sahibine) satmasını rica etmiş, Semure (bu teklifi) kabul etmemiş. Sonra ona bu ağacı (buradan başka bir yere) nakletmesini teklif etmiş, (Semure) bunu da kabui etmemiş. Bunun üzerine, yapılmasını tavsiye ettiği (iyi) bir iş olarak; \"Onu bu bahçenin sahibine bağışla, (karşılığında) sana şu ka­dar (sevap) var\" diye emretmiş. (Semure yine) kabu! etmeyince; \"Sen zarar göreceksin!\" demiş ve (bahçe sahibi olan) Ensarî'ye de: \"Git, onun hurmasını sök!\" buyurmuş"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Daif"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 3637,
      "arabicNumber": 3637,
      "book": 25,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا اللَّيْثُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ رَجُلاً خَاصَمَ الزُّبَيْرَ فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا فَقَالَ الأَنْصَارِيُّ سَرِّحِ الْمَاءَ يَمُرُّ ‏.‏ فَأَبَى عَلَيْهِ الزُّبَيْرُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلْ إِلَى جَارِكَ ‏\"‏ ‏.‏ فَغَضِبَ الأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ اسْقِ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏ ‏.‏ فَقَالَ الزُّبَيْرُ فَوَاللَّهِ إِنِّي لأَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ ‏{‏ فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ ‏}‏ الآيَةَ ‏.‏",
        "translations": {
          "en": "Narrated Abdullah ibn az-Zubayr: A man disputed with az-Zubayr about streamlets in the lava plain which was irrigated by them. The Ansari said: Release the water and let it run, but az-Zubayr refused. The Holy Prophet (ﷺ) said to az-Zubayr: Water (your ground), Zubayr, then let the water run to your neighbour. The Ansari then became angry and said: Messenger of Allah! it is because he is your cousin! Thereupon the face of the Messenger of Allah (ﷺ) changed colour and he said: Water (your ground), then keep back the water till it returns to the embankment. Az-Zubayr said: By Allah! I think this verse came down about that: \"But no , by thy Lord! they can have no (real) faith, until they make thee judge",
          "ur": "عبداللہ بن زبیر رضی اللہ عنہما کہتے ہیں کہ ایک شخص نے زبیر رضی اللہ عنہ سے حرۃ کی نالیوں کے سلسلہ میں جھگڑا کیا جس سے وہ سینچائی کرتے تھے، انصاری نے زبیر رضی اللہ عنہ سے کہا: پانی کو بہنے دو، لیکن زبیر رضی اللہ عنہ نے اس سے انکار کیا تو رسول اللہ صلی اللہ علیہ وسلم نے زبیر رضی اللہ عنہ سے فرمایا: تم اپنے کھیت سینچ لو پھر پانی کو اپنے پڑوسی کے لیے چھوڑ دو یہ سن کر انصاری کو غصہ آ گیا اور کہنے لگا: اللہ کے رسول! یہ آپ کے پھوپھی کے لڑکے ہیں نا؟ تو رسول اللہ صلی اللہ علیہ وسلم کے چہرے کا رنگ متغیر ہو گیا اور آپ نے زبیر رضی اللہ عنہ سے فرمایا: تم اپنے کھیت سینچ لو اور پانی روک لو یہاں تک کہ کھیت کے مینڈھوں تک بھر جائے ۔ زبیر رضی اللہ عنہ کہتے ہیں: اللہ کی قسم! میں سمجھتا ہوں یہ آیت «فلا وربك لا يؤمنون حتى يحكموك» قسم ہے تیرے رب کی وہ اس وقت تک کامل مومن نہیں ہو سکتے جب تک کہ آپ کو اپنا فیصل نہ مان لیں ( سورة النساء: ۶۵ ) اسی بابت اتری ہے",
          "fr": "Rapporté par Abdullah ibn az-Zubayr : Un homme eut un différend avec az-Zubayr au sujet de petits canaux dans la plaine de lave qu’ils irriguaient. L’Ansari dit : « Lâche l’eau et laisse-la couler », mais az-Zubayr refusa. Le Prophète ﷺ dit à az-Zubayr : « Arrose (ton terrain), Zubayr, puis laisse l’eau aller à ton voisin. » L’Ansari se mit alors en colère et dit : « Ô Messager d’Allah ! C’est parce qu’il est ton cousin ! » Le visage du Messager d’Allah ﷺ changea de couleur et il dit : « Arrose (ton terrain), puis retiens l’eau jusqu’à ce qu’elle revienne à la digue. » Az-Zubayr dit : « Par Allah ! Je pense que ce verset a été révélé à ce sujet : “Mais non, par ton Seigneur ! Ils n’auront pas la foi tant qu’ils ne t’auront pas pris comme juge…” »",
          "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Al Laits] dari [Az Zuhri] dari ['Urwah] bahwa [Abdullah bin Az Zubair] menceritakan kepadanya, bahwa ada seorang laki-laki bermusuhan dengan Az Zubair mengenai saluran-saluran air pada tanah keras yang berbatu hitam yang mereka gunakan untuk mengairi tanaman. Kemudian orang anshar tersebut berkata, \"Biarkanlah air lewat!\" Namun Az Zubair menolak. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepada Az Zubair: \"Siramilah tanamanmu wahai Az Zubair, kemudian alirkan kepada tetanggamu!\" Maka marahklah orang anshar tersebut, lalu ia berkata, \"Wahai Rasulullah, apakah karena ia itu anak bibimu!\" Maka rona muka Rasulullah shallallahu 'alaihi wasallam berubah, beliau bersabda: \"Siramlah tanamanmu, lalu tahanlah iar tersebut hingga ia kembali ke tempatnya semula.\" Az Zubair berkata, \"Demi Allah, sungguh aku mengira ayat ini turun mengenai hal tersebut; '(Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim…) ' (Qs. An Nisa:)",
          "tr": "Urve'nin Abdullah b. ez-Zübeyr'den rivayet ettiğine göre; Bir adam (halkın) kendisi ile (hurma bahçelerini) suladıkları Harre arkı (içinden gelen su) yüzünden Zübeyr'den davacı olmuş. (Zübeyr'i dava eden bu) Ensarlı (zat Zübeyr'e): Suyu bırak, (önünü.kesme kendi haline) akıp gitsin! demiş. (Zübeyr onun bu isteğini) kabul etmemiş. Nebi (s.a.v.) de Zübeyr'e: “Ey Zübeyr, (bahçeni) sula ve sonra suyu bırakıver, komşuna (gitsin)\" buyurmuş. Bunun üzerine Ensarlı öfkelenip: Ey Allah'ın Rasûlü! (Zübeyr) halanın oğlu olduğu için mi (böyle hüküm veriyorsun)? demiş. Rasûlullah (s.a.v.)'in yüzünün rengi atmış, sonra: “(Ey Zübeyr! Sen kendi bahçeni iyice) sula, sonra suyu (bahçe) duvann(ın) temeline (veya ağaçların köklerine) erişinceye kadar salma\" buyurdu. Zübeyr (sözlerine devam ederek) dedi ki: Allah'a yemin olsun ki,\"Rabbin hakkı için, onlar aralarında vuku bulan her çekişmede seni hakem kılmadıkları sürece iman etmiş olmazlar\"[Nisâ 65] âyetinin bu hâdise hakkında indiğini zannediyorum"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari (2359، 2360) Sahih Muslim (2357)"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 67
      },
      "narrator": {
        "en": "Abdullah ibn az-Zubayr"
      }
    },
    {
      "hadithNumber": 3638,
      "arabicNumber": 3638,
      "book": 25,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ، - يَعْنِي ابْنَ كَثِيرٍ - عَنْ أَبِي مَالِكِ بْنِ ثَعْلَبَةَ، عَنْ أَبِيهِ، ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ أَنَّهُ سَمِعَ كُبَرَاءَهُمْ، يَذْكُرُونَ أَنَّ رَجُلاً، مِنْ قُرَيْشٍ كَانَ لَهُ سَهْمٌ فِي بَنِي قُرَيْظَةَ فَخَاصَمَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَهْزُورٍ - يَعْنِي السَّيْلَ الَّذِي يَقْتَسِمُونَ مَاءَهُ - فَقَضَى بَيْنَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْمَاءَ إِلَى الْكَعْبَيْنِ لاَ يَحْبِسُ الأَعْلَى عَلَى الأَسْفَلِ ‏.‏",
        "translations": {
          "en": "Narrated Tha'labah ibn AbuMalik: Tha'labah heard his elders say that a man from the Quraysh had his share with Banu Qurayzah (in water). He brought the dispute to the Messenger of Allah (ﷺ) about al-Mahzur, a stream whose water they shared together. The Messenger of Allah (ﷺ) then decided that when water reached the ankles waters should not be held back to flow to the lower",
          "ur": "ثعلبہ بن ابی مالک قرظی کہتے ہیں انہوں نے اپنے بزرگوں سے بیان کرتے ہوئے سنا کہ قریش کے ایک آدمی نے جو بنو قریظہ کے ساتھ ( پانی میں ) شریک تھا رسول اللہ صلی اللہ علیہ وسلم کے پاس مہزور کے نالے کے متعلق جھگڑا لے کر آیا جس کا پانی سب تقسیم کر لیتے تھے، تو رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ کیا کہ جب تک پانی ٹخنوں تک نہ پہنچ جائے اوپر والا نیچے والے کے لیے نہ روکے۔",
          "fr": "Rapporté par Tha'labah ibn Abu Malik : Tha'labah a entendu ses aînés dire qu’un homme des Quraysh partageait l’eau d’un ruisseau, al-Mahzur, avec les Banu Qurayzah. Il porta le différend devant le Messager d’Allah ﷺ à propos de ce ruisseau dont ils se partageaient l’eau. Le Messager d’Allah ﷺ décida alors que lorsque l’eau atteignait les chevilles, il ne fallait pas la retenir pour qu’elle puisse couler vers l’aval",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari [Abu Malik bin Tsa'labah] dari [Tsa'labah bin Malik] bahwa ia mendengar [para pembesar] mereka menyebutkan bahwa seorang laki-laki Quraisy memiliki saham pada Bani Quraizhah, kemudian ia memperkarakan kepada Rasulullah shallallahu 'alaihi wasallam mengenai aliran yang mereka berbagi dengan airnya. Kemudian Rasulullah shallallahu 'alaihi wasallam memberi putusan untuk mereka, bahwa batas genangan air adalah sebatas mata kaki, orang yang lahannya di atas tidak boleh menahan dari yang di bawah",
          "tr": "Sa'lebe b. Ebi Mâlik'den rivayet olunduğuna göre; kendisi (ashab-ı kiramın) ileri gelenlerinden bazı kimseleri şöyle derlerken işitmiştir: Kureyş'ten bir adam'ın Kureyza oğulları (nın arazisi) içerisinde bir hissesi vardı. Mehzûr (vadisin)de suyunu beraberce paylaştıkları bir su kanalından dolayı (Kureyza oğullarını) Rasûlullah (s.a.v.)'e şikâyet etti. Rasûlullah (s.a.v.) da onlar arasında; suyun (bir bahçede) ancak topuklara yükselinceye kadar (tutulabileceğine), yukarı (başta bulunan) kimsenin (suyu bu kadar süre bahçesinde tuttuktan sonra), aşağıda bulunan kimse(nin bahçesi) üzerine göndermesi gerektiğine hükmetti"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 68
      },
      "narrator": {
        "en": "Tha'labah ibn AbuMalik"
      }
    },
    {
      "hadithNumber": 3639,
      "arabicNumber": 3639,
      "book": 25,
      "hadithInBook": 69,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي السَّيْلِ الْمَهْزُورِ أَنْ يُمْسَكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ ثُمَّ يُرْسِلُ الأَعْلَى عَلَى الأَسْفَلِ ‏.‏",
        "translations": {
          "en": "Amr bin Shu'aib on his father's authority said that his grandfather told that the Messenger of Allah (ﷺ) decided regarding the stream al-Mahzur that its water should be held back till it reached the ankles, and that the upper waters should then be allowed to flow to the lower",
          "ur": "عبداللہ بن عمر و رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مہزور کے نالے کے متعلق یہ فیصلہ کیا کہ پانی اس وقت تک روکا جائے جب تک کہ ٹخنے کے برابر نہ پہنچ جائے، پھر اوپر والا نیچے والے کے لیے چھوڑ دے۔",
          "fr": "Amr bin Shu’aib rapporte, d’après son père, que son grand-père a raconté que le Messager d’Allah ﷺ a statué au sujet du ruisseau al-Mahzur que l’eau devait être retenue jusqu’à ce qu’elle atteigne les chevilles, puis que les eaux en amont devaient être laissées couler vers l’aval",
          "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] telah menceritakan kepadaku ayahku [Abdurrahman bin Al Harits] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam memberi putusan dalampembagian air, bahwa batas genangan air (pada tanaman) adalah setinggi mata kaki. Setelah itu orang yang lahannya di bagian atas memberikannya kepada orang yang lahannya di bawah",
          "tr": "Amr b. Şu'ayb'ın dedesinden rivayet olunduğuna göre; Rasûlullah (s.a.v.), el-Mehzûr (denilen vadi)deki su kanalı hakkında, (insanın oradan gelen suyu) topuklara yükselinceye kadar tutabileceğine, (kanalın) yukarı (başında bulunan) kimse (nin onu bu kadar beklettikten) sonra aşağı (da bulunan bahçeler) üzerine bırakıvermesi gerektiğine hükmetmiştir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Shuaib Al Arnaut",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 3640,
      "arabicNumber": 3640,
      "book": 25,
      "hadithInBook": 70,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ، أَنَّ مُحَمَّدَ بْنَ عُثْمَانَ، حَدَّثَهُمْ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ أَبِي طُوَالَةَ، وَعَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ اخْتَصَمَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلاَنِ فِي حَرِيمِ نَخْلَةٍ - فِي حَدِيثِ أَحَدِهِمَا فَأَمَرَ بِهَا فَذُرِعَتْ فَوُجِدَتْ سَبْعَةَ أَذْرُعٍ وَفِي حَدِيثِ الآخَرِ - فَوُجِدَتْ خَمْسَةَ أَذْرُعٍ فَقَضَى بِذَاكَ ‏.‏ قَالَ عَبْدُ الْعَزِيزِ فَأَمَرَ بِجَرِيدَةٍ مِنْ جَرِيدِهَا فَذُرِعَتْ ‏.‏",
        "translations": {
          "en": "Narrated AbuSa'id al-Khudri: Two men brought their dispute about the precincts of a palm-tree to the Messenger of Allah (ﷺ). According to a version of this tradition, he ordered to measure and it was measured. It was found seven yards. According to another version, it was found five yards. He made a decision according to that. AbdulAziz said: He ordered to measure with a branch of its branches. It was then measured",
          "ur": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ دو شخص ایک کھجور کے درخت کی حد کے سلسلے میں جھگڑا لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، ایک روایت میں ہے آپ نے اس کے ناپنے کا حکم دیا جب ناپا گیا تو وہ سات ہاتھ نکلا، اور دوسری روایت میں ہے وہ پانچ ہاتھ نکلا تو آپ نے اسی کا فیصلہ فرما دیا۔ عبدالعزیز کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے اسی درخت کی ایک ٹہنی سے پیمائش کرنے کے لیے کہا تو پیمائش کی گئی۔",
          "fr": "Rapporté par Abu Sa’id al-Khudri : Deux hommes ont porté leur différend au sujet des abords d’un palmier devant le Messager d’Allah ﷺ. Selon une version, il ordonna de mesurer et on trouva sept coudées. Selon une autre version, on trouva cinq coudées. Il a jugé en fonction de cette mesure. AbdulAziz a dit : Il ordonna de mesurer avec une branche du palmier, et cela fut fait",
          "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] bahwa [Muhammad bin Utsman] menceritakan kepada mereka, ia berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Abu Thuwalah] dan ['Amru bin Yahya] dari [Ayahnya] dari [Abu Sa'id Al Khudri] ia berkata, \"Dua orang laki-laki mengadukan kepada Rasulullah shallallahu 'alaihi wasallam tentang batas kebun kurma mereka. Kemudian beliau memerintahkan agar mengukurnya, lalu batasan tersebut diukur dan didapati ukurannya adalah tujuh hasta. Dan dalam hadits yang lain, maka di dapati ukurannya adalah lima hasta, lalu beliau memutuskan dengan hal tersebut.\" Abdul Aziz berkata, \"Kemudian beliau memerintakan agar diambilkan salah satu dahan pohon kurma tersebut, kemudian batasan tersebut diukur",
          "tr": "Ebû Saîd el-Hudrî'den, şöyle dediği rivayet olunmuştur: İki adam bir hurma ağacına ait sahanın boyutları hakkında anlaşmazlığa düşerek Rasûlullah (s.a.v.)'a başvurmuşlardı. (Bu hadisi Amr b. Yahya'nın babasından nakleden Ebû Tuvale Abdurrahman b. Ma'mer ile Amr b. Yahya'dan) birinin rivayetinde (şu ibare vardır): \"Hz. Nebi) o ağacın ölçülmesini) emretti, (ağaç) ölçüldü yedi zira', (uzunluğunda) bulundu.\" (Diğerinin rivayetinde de:) \"Beş zira' (uzunluğunda) bulundu. Bunun üzerine (Hz. Peygamber, bu ağacın sahasının boyutları hakkında) buna göre hüküm verdi.\" ibaresi vardır. (Bu hadisi Ebû Tuvale'den nakleden) Abdülaziz (b. Muhammed de bu tesbit işini açıklarken şöyle) dedi: (Hz. Nebi, sözü geçen) hurmanın yapraksız dallarından birini(n getirilmesini) istedi. Dal getirildi ve ağaç (bu dalla) ölçüldü"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Muhammad Muhyi Al-Din Abdul Hamid",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "abudawud",
        "book": 25,
        "hadith": 70
      },
      "narrator": {
        "en": "AbuSa'id al-Khudri"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "58KB"
  }
}