{
  "collection": "nasai",
  "book": 42,
  "name": {
    "arabic": "كتاب The Book of Hunting and Slaughtering",
    "transliteration": "kitab hunting and slaughtering",
    "translation": "The Book of Hunting and Slaughtering"
  },
  "totalHadith": 98,
  "hadithNumberRange": {
    "first": 4263,
    "last": 4360
  },
  "content": [
    {
      "hadithNumber": 4263,
      "arabicNumber": 4263,
      "book": 42,
      "hadithInBook": 1,
      "text": {
        "arabic": "أَخْبَرَنَا الإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ النَّسَائِيُّ، بِمِصْرَ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُوَيْدِ بْنِ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ فَإِنْ أَدْرَكْتَهُ لَمْ يَقْتُلْ فَاذْبَحْ وَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ وَإِنْ أَدْرَكْتَهُ قَدْ قَتَلَ وَلَمْ يَأْكُلْ فَكُلْ فَقَدْ أَمْسَكَهُ عَلَيْكَ فَإِنْ وَجَدْتَهُ قَدْ أَكَلَ مِنْهُ فَلاَ تَطْعَمْ مِنْهُ شَيْئًا فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِنْ خَالَطَ كَلْبُكَ كِلاَبًا فَقَتَلْنَ فَلَمْ يَأْكُلْنَ فَلاَ تَأْكُلْ مِنْهُ شَيْئًا فَإِنَّكَ لاَ تَدْرِي أَيُّهَا قَتَلَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Adiyy bin Hatim that:he asked the Messenger of Allah about hunting. He said: \"When you release your dog, mention the name of Allah over him, and if you catch up with him and he has not killed (the game), then slaughter it and mention the name of Allah over it. If you catch up with him and he has killed (the game) but has not eaten any of it, then eat, for he caught it for you. If you find that the has eaten some of it, then do not eat any of it for he caught it for himself. If there are other dogs with your dog and they have killed (the game) but have not eaten any of it, then do not eat any of it, because you do not know which of them killed it",
          "fr": "Rapporté par 'Adiyy bin Hatim : Il a interrogé le Messager d’Allah ﷺ au sujet de la chasse. Il a dit : \"Quand tu lâches ton chien, prononce le nom d’Allah sur lui, et si tu arrives avant qu’il n’ait tué la proie, alors égorge-la en prononçant le nom d’Allah. Si tu arrives et qu’il l’a tuée sans en avoir mangé, alors mange, car il l’a attrapée pour toi. Si tu vois qu’il en a mangé, alors ne mange pas, car il l’a attrapée pour lui-même. Si d’autres chiens sont avec le tien et qu’ils ont tué la proie sans en avoir mangé, alors ne mange pas, car tu ne sais pas lequel l’a tuée",
          "id": "Telah mengabarkan kepada kami Imam Abu Abdurrahman An Nasai di Mesir dengan membacakan riwayat dan saya mendengar, dari [Suwaid bin Nashr], ia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari ['Ashim] dari [Asy Sya'bi] dari ['Adi bin Hatim] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan maka beliau bersabda: 'Apabila engkau melepaskan anjingmu maka sebutlah nama Allah padanya, kemudian apabila engkau mendapatinya belum membunuh maka sembelihlah dan sebutlah nama Allah padanya. Namun apabila ia telah membunuh dan belum memakan buruan maka makanlah sungguh ia telah menangkap untukmu. Apabila engkau mendapatinya telah memakan sebagiannya maka janganlah engkau memakan sedikitpun dari buruan tersebut, karena sesungguhnya anjing tersebut menangkap untuk dirinya sendiri. Dan apabila anjingmu bercampur dengan anjing- anjing yang lain kemudian membunuh buruan dan anjing- anjing tersebut tidak makan sesuatupun darinya maka sesungguhnya engkau tidak mengetahui anjing yang manakah yang membunuh"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 4264,
      "arabicNumber": 4264,
      "book": 42,
      "hadithInBook": 2,
      "text": {
        "arabic": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏\"‏ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَبْتَ بِعَرْضِهِ فَهُوَ وَقِيذٌ ‏\"‏ ‏.‏ وَسَأَلْتُهُ عَنِ الْكَلْبِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَأَخَذَ وَلَمْ يَأْكُلْ فَكُلْ فَإِنَّ أَخْذَهُ ذَكَاتُهُ وَإِنْ كَانَ مَعَ كَلْبِكَ كَلْبٌ آخَرُ فَخَشِيتَ أَنْ يَكُونَ أَخَذَ مَعَهُ فَقَتَلَ فَلاَ تَأْكُلْ فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that `Adiyy bin Abi Hatim said:\"I asked the Messenger of Allah about hunting with a Mi`rad. He said: 'If you strike (the game) with its sharp point, then eat, but if you strike it with its broad side, then the animal has been killed with a blow.' I asked him about dogs and he said: 'If you release your dog and he catches (the game) but does not eat it, then eat, because his catching it is its slaughter. If you find another dog with your dog and you fear that it caught (the game) with him and killed it, then do not eat, for you said the name of Allah over your dog, but you did not say His name over the other one",
          "fr": "Rapporté par 'Adiyy bin Abi Hatim : J’ai demandé au Messager d’Allah ﷺ au sujet de la chasse avec un Mi‘rad. Il a dit : \"Si tu frappes la proie avec la pointe, alors mange, mais si tu la frappes avec le côté large, alors l’animal a été tué par un coup.\" Je lui ai demandé au sujet des chiens et il a dit : \"Si tu lâches ton chien et qu’il attrape la proie sans en manger, alors mange, car le fait qu’il l’attrape équivaut à l’abattage. Si tu trouves un autre chien avec le tien et que tu crains qu’il ait attrapé la proie avec lui et l’ait tuée, alors ne mange pas, car tu as prononcé le nom d’Allah sur ton chien, mais pas sur l’autre",
          "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr], ia berkata; telah menceritakan kepada kami [Abdullah] dari [Zakariya] dari [Asy Sya'bi] dari [Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, maka beliau bersabda: \"Apa yang engkau kenai dengan bagian yang tajam maka makanlah dan apa yang engkau kenai dengan bagian yang tumpul maka itu adalah hewan yang mati karena terkena benda tumpul.\" Dan saya bertanya kepada beliau mengenai anjing, maka beliau bersabda: \"Apabila engkau melepaskan anjingmu kemudian ia menangkap dan tidak memakannya maka makanlah karena sesungguhnya tangkapannya adalah penyembelihannya, apabila terdapat anjing lain bersama dengan anjingmu kemudian kamu khawatir anjing tersebut menangkap bersamanya dan membunuh buruan tersebut maka janganlah engkau memakannya karena sesunggunya engkau hanya menyebutkan nama Allah pada anjingmu dan tidak menyebutkan nama Allah pada anjing yang lain"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 4265,
      "arabicNumber": 4265,
      "book": 42,
      "hadithInBook": 3,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا مَنْصُورٌ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ أُرْسِلُ الْكَلْبَ الْمُعَلَّمَ فَيَأْخُذُ ‏.‏ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ الْكَلْبَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَأَخَذَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلَ قَالَ ‏\"‏ وَإِنْ قَتَلَ ‏\"‏ ‏.‏ قُلْتُ أَرْمِي بِالْمِعْرَاضِ ‏.‏ قَالَ ‏\"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was Narrated from 'Adiyy bin Hatim the he asked the Messenger of Allah :\"I release my trained dog and he catches (game).\" He said: \"If you release the trained dog and you say the name of Allah over him, and he catches (something), then eat.\" I said: \"Even if he kills it?\" He said: shoot with the Mirad.\" He said: \"If it hits (the game) with its sharp point, then eat, but if it hits it with its broad side, then do not eat",
          "fr": "Rapporté par 'Adiyy bin Hatim : Il a demandé au Messager d’Allah ﷺ : \"Je lâche mon chien dressé et il attrape une proie.\" Il a dit : \"Si tu lâches le chien dressé et que tu prononces le nom d’Allah sur lui, et qu’il attrape quelque chose, alors mange.\" J’ai dit : \"Même s’il la tue ?\" Il a dit : \"Tire avec le Mirad.\" Il a dit : \"Si la pointe touche la proie, alors mange, mais si c’est le côté large, alors ne mange pas",
          "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Abu Abdush Shamad Abdul 'Aziz bin Abdush Shamad], ia berkata; telah menceritakan kepada kami [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari [Adi bin Hatim] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata; saya mengirimkan anjing yang telah dilatih kemudian ia menangkap buruan. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau mengirim anjing yang telah dilatih dan telah engkau sebutkan nama Allah padanya kemudian ia menangkap buruan maka makanlah.\" Saya katakan; walaupun ia telah membunuh buruan? Beliau bersabda: \"walaupun ia telah membunuhnya.\" Saya katakan; Apakah saya boleh memanah dengan anak panah yang tumpul? Beliau bersabda: \"Apabila ia mengenai dengannya bagian tajamnya maka makanlah dan apabila ia mengenai dengan bagian yang tumpul maka jangan engkau makan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 4266,
      "arabicNumber": 4266,
      "book": 42,
      "hadithInBook": 4,
      "text": {
        "arabic": "أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ الْكُوفِيُّ الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، قَالَ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ، يَقُولُ أَنْبَأَنَا أَبُو إِدْرِيسَ، عَائِذُ اللَّهِ قَالَ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ، يَقُولُ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي وَأَصِيدُ بِكَلْبِي الْمُعَلَّمِ وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ ‏.‏ فَقَالَ ‏ \"‏ مَا أَصَبْتَ بِقَوْسِكَ فَاذْكُرِ اسْمَ اللَّهِ عَلَيْهِ وَكُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرِ اسْمَ اللَّهِ وَكُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Tha'labah Al-Khushani said:\"I said: 'O Messenger of Allah, we live in a land where people hunt, and I hunt with my bow and with my trained dog, and with trained dog, and with my dog which ins not trained.' He said: 'whatever you catch with your bow, mention the name of Allah over it and eat. Whatever you catch with the trained dog, mention the name of Allah over it and eat. Whatever you catch with your untrained dog and you reach it while it is still alive, then slaughter it, and eat.\"\"( Sahih)",
          "fr": "Rapporté par Abu Tha’labah Al-Khushani : J’ai dit : \"Ô Messager d’Allah, nous vivons dans un pays où les gens chassent, et je chasse avec mon arc, avec mon chien dressé, et avec mon chien qui n’est pas dressé.\" Il a dit : \"Tout ce que tu attrapes avec ton arc, prononce le nom d’Allah dessus et mange. Ce que tu attrapes avec le chien dressé, prononce le nom d’Allah dessus et mange. Ce que tu attrapes avec le chien non dressé et que tu arrives alors qu’il est encore vivant, alors égorge-le et mange.\" (Sahih)",
          "id": "Telah mengabarkan kepadaku [Muhammad bin 'Ubaid bin Muhammad Al Kufi Al Muharibi], ia berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Haiwah bin Syuraih], ia berkata; saya mendengar [Rabi'ah bin Yazid] berkata; telah memberitakan kepada kami [Abu Idris 'Aidzullah], ia berkata; saya mendengar [Abu Tsa'labah Al Khusyani] berkata; saya berkata; wahai Rasulullah, sesungguhnya kami berada di lahan perburuan, saya berburu menggunakan busurku dan berburu dengan anjingku yang telah terlatih dan anjingku yang belum terlatih. Maka beliau bersabda: \"Apa yang engkau kenai dengan busurmu maka sebutlah nama Allah padanya dan makanlah, dan apa yang engkau kenai dengan anjingmu yang terlatih maka sebutlah nama Allah dan makanlah, dan apa yang engkau kenai dengan anjingmu yang belum terlatih kemudian engkau sempat menyembelihnya maka makanlah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 4267,
      "arabicNumber": 4267,
      "book": 42,
      "hadithInBook": 5,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ أَبُو صَالِحٍ الْمَكِّيُّ، قَالَ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كِلاَبِي الْمُعَلَّمَةَ فَيُمْسِكْنَ عَلَىَّ فَآكُلُ قَالَ ‏\"‏ إِذَا أَرْسَلْتَ كِلاَبَكَ الْمُعَلَّمَةَ فَأَمْسَكْنَ عَلَيْكَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ ‏\"‏ ‏.‏ قَالَ ‏\"‏ مَا لَمْ يَشْرَكْهُنَّ كَلْبٌ مِنْ سِوَاهُنَّ ‏\"‏ ‏.‏ قُلْتُ أَرْمِي بِالْمِعْرَاضِ فَيَخْزِقُ ‏.‏ قَالَ ‏\"‏ إِنْ خَزَقَ فَكُلْ وَإِنْ أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I release my trained dogs and they catch (game) for me; can I eat It? He said: 'When you release your trained dogs and they catch (game) for you, then eat.' I said: 'Even if they kill it.' He said: 'So long as no other dogs have joined them.\" I said: 'I shoot with the Mirad. And they penetrate (the game).' He said 'If they penetrate it, then eat, but if the broad said strikes it, then do not eat",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai dit : \"Ô Messager d’Allah, je lâche mes chiens dressés et ils attrapent une proie pour moi ; puis-je la manger ?\" Il a dit : \"Quand tu lâches tes chiens dressés et qu’ils attrapent une proie pour toi, alors mange.\" J’ai dit : \"Même s’ils la tuent ?\" Il a dit : \"Tant qu’aucun autre chien ne s’est joint à eux.\" J’ai dit : \"Je tire avec le Mirad. Et il pénètre la proie.\" Il a dit : \"S’il la pénètre, alors mange, mais si c’est le côté large qui la frappe, alors ne mange pas",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Zunbur Abu Shaleh Al Makki], ia berkata; telah menceritakan kepada kami [Fudhail bin 'Iyadh] dari [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari ['Adi bin Hatim], ia berkata; saya berkata; wahai Rasulullah, saya mengirim anjing- anjingku yang telah terlatih, kemudian mereka menangkap untukku, apakah saya boleh memakannya? Beliau bersabda: \"Apabila engkau mengirim anjing- anjing yang telah terlatih kemudian mereka menangkap untukmu maka makanlah.\" Saya katakan; walaupun anjing - anjing tersebut membunuh? Beliau bersabda: \"Walaupun anjing- anjing tersebut membunuh.\" Beliau bersabda: \"Selama tidak ada anjing lain yang ikut bersama mereka.\" Saya katakan; bolehkah saya memanah menggunakan anak panah yang tidka bermata kemudian menancap padanya? Beliau bersabda: \"Apabila menancap maka makanlah, dan apabila mengenai dengan bagian yang tumpul maka janganlah engkau makan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 4268,
      "arabicNumber": 4268,
      "book": 42,
      "hadithInBook": 6,
      "text": {
        "arabic": "أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَخَالَطَتْهُ أَكْلُبٌ لَمْ تُسَمِّ عَلَيْهَا فَلاَ تَأْكُلْ فَإِنَّكَ لاَ تَدْرِي أَيَّهَا قَتَلَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:\"If you release your dog and other dogs over with you have not mentioned the name of Allah join him, then do not eat (what they catch), because you do not know which of them killed it (the game)",
          "fr": "Rapporté par 'Adiyy bin Hatim : Il a demandé au Messager d’Allah ﷺ au sujet de la chasse et il a dit : \"Si tu lâches ton chien et que d’autres chiens, sur lesquels tu n’as pas prononcé le nom d’Allah, se joignent à lui, alors ne mange pas ce qu’ils attrapent, car tu ne sais pas lequel l’a tuée",
          "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Ahmad bin Abu Syu'aib], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Ma'mar] dari ['Ashim bin Sulaiman] dari ['Amir Asy Sya'bi] dari ['Adi bin Hatim] bahwa Ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, maka beliau bersabda: \"Apabila engkau mengirim anjingmu kemudian ada anjing- anjing lain yang bercampur dengannya dan engkau belum menyebut nama Allah padanya maka janganlah engkau makan, karena sesungguhnya engkau tidak tahu aniing manakah yang membunuhnya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 4269,
      "arabicNumber": 4269,
      "book": 42,
      "hadithInBook": 7,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا زَكَرِيَّا، - وَهُوَ ابْنُ أَبِي زَائِدَةَ - قَالَ حَدَّثَنَا عَامِرٌ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْكَلْبِ فَقَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَسَمَّيْتَ فَكُلْ وَإِنْ وَجَدْتَ كَلْبًا آخَرَ مَعَ كَلْبِكَ فَلاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about dogs and he said: 'If you release your dog and say the name of Allah, then eat, but if you find another dog with your dog then do not eat, for you only said the name of Allah over your dog, not any other",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai demandé au Messager d’Allah ﷺ au sujet des chiens et il a dit : \"Si tu lâches ton chien et que tu prononces le nom d’Allah, alors mange, mais si tu trouves un autre chien avec le tien, alors ne mange pas, car tu n’as prononcé le nom d’Allah que sur ton chien, pas sur l’autre",
          "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Zakariya yaitu Ibnu Abu Zaidah], ia berkata; telah menceritakan kepada kami ['Amir] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai anjing. Kemudian beliau bersabda: \"Apabila engkau mengirimkan anjingmu maka sebutkan nama Allah dan makanlah, dan apabila engkau dapati anjing yang lain bersama dengan anjingmu maka janganlah engkau makan, karena sesungguhnya engkau hanya menyebut nama Allah pada anjingmu saja, dan tidak menyebutnya pada anjing yang lain"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 4270,
      "arabicNumber": 4270,
      "book": 42,
      "hadithInBook": 8,
      "text": {
        "arabic": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ جَعْفَرٍ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، قَالَ حَدَّثَنَا الشَّعْبِيُّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، - وَكَانَ لَنَا جَارًا وَدَخِيلاً وَرَبِيطًا بِالنَّهْرَيْنِ - أَنَّهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم قَالَ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا قَدْ أَخَذَ لاَ أَدْرِي أَيَّهُمَا أَخَذَ قَالَ ‏ \"‏ لاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ash-Sha bi that; \"Adiyy bin Hatim who was neighbor, Dakhilan and Rabitan at An-Nahrain narrated that he asked the Prophet Saying:'I releaser my dog and I find another dog with my dog, and I do not know which of them caught (the game).' He said: 'Do not eat, for your only said the name of Allah over your dog, and not over any other dog",
          "fr": "Rapporté par Ash-Sha‘bi : 'Adiyy bin Hatim, qui était voisin, Dakhilan et Rabitan à An-Nahrain, a raconté qu’il avait demandé au Prophète ﷺ : \"Je lâche mon chien et je trouve un autre chien avec le mien, et je ne sais pas lequel a attrapé la proie.\" Il a dit : \"Ne mange pas, car tu n’as prononcé le nom d’Allah que sur ton chien, pas sur un autre",
          "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam], ia berkata; telah menceritakan kepada kami [Muhammad yaitu Ibnu Ja'far], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Masruq], ia berkata; telah menceritakan kepada kami [Asy Sya'bi] dari ['Adi bin Hatim] dan ia adalah tetangga kami, orang yang bercampur dengan kami dan senantiasa tinggal di Nahrain, bahwa ia bertanya kepada Nabi shallallahu 'alaihi wasallam, ia berkata; saya mengirim ajingku dan saya dapati anjing lain bersamanya yang telah menangkap buruan, saya tidak tahu manakah diantara keduanya yang menangkap. Beliau bersabda: \"Janganlah engkau memakannya karena engkau hanya menyebutkan nama Allah pada anjingmu saja dan tidak menyebutkannya pada anjing yang lain.\" telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam], ia berkata; telah menceritakan kepada kami [Muhammad], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam], ia berkata; ia telah menceritakan kepada kami [Asy Sya'bi] dari ['Adi] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang sama Seperti itu"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 4271,
      "arabicNumber": 4271,
      "book": 42,
      "hadithInBook": 9,
      "text": {
        "arabic": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ حَدَّثَنَا عَنِ الشَّعْبِيِّ، عَنْ عَدِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ ذَلِكَ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Adiyy bin Hatim:A similar report was narrated from 'Adiyy bin Hatim",
          "fr": "Rapporté par 'Adiyy bin Hatim : Un récit similaire a été rapporté de la part de 'Adiyy bin Hatim"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 4272,
      "arabicNumber": 4272,
      "book": 42,
      "hadithInBook": 10,
      "text": {
        "arabic": "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو الْغَيْلاَنِيُّ الْبَصْرِيُّ، قَالَ حَدَّثَنَا بَهْزٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ أُرْسِلُ كَلْبِي ‏.‏ قَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَسَمَّيْتَ فَكُلْ وَإِنْ أَكَلَ مِنْهُ فَلاَ تَأْكُلْ فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِذَا أَرْسَلْتَ كَلْبَكَ فَوَجَدْتَ مَعَهُ غَيْرَهُ فَلاَ تَأْكُلْ فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah: 'I release my dog. He said: 'If you release your dog and mention the name of Allah, then eat. But it he has eaten some of it, the do not eats, for the caught it for himself. If you release your dog then you find another dog with it, then do not eat, for you said the name of Allah over your dog, and not over any other",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai demandé au Messager d’Allah ﷺ : \"Je lâche mon chien. Il a dit : \"Si tu lâches ton chien et que tu prononces le nom d’Allah, alors mange. Mais s’il en a mangé, alors ne mange pas, car il l’a attrapée pour lui-même. Si tu lâches ton chien et que tu trouves un autre chien avec lui, alors ne mange pas, car tu as prononcé le nom d’Allah sur ton chien, pas sur un autre",
          "id": "Telah mengabarkan kepada kami [Sulaiman bin 'Ubaidullah bin 'Amr Al Ghailani Al Bashri], ia berkata; telah menceritakan kepada kami [Bahz], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Abdullah bin Abu As Safar] dari ['Amir Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam, saya katakan; saya mengirimkan anjingku. Beliau bersabda: \"Apabila engkau mengirim anjingmu dan engkau sebutkan nama Allah maka makanlah dan apabila ia memakan sebagian darinya maka jangan engakau makan, karena ia menangkap untuk dirinya dan apabila engkau mengirim anjingmu kemudian engkau dapati anjing lain bersamanya maka janganlah engkau makan, karena sesungguhnya engkau hanya menyebutkan nama Allah pada anjingmu saja dan tidak menyebutkannya pada selainnya"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 4273,
      "arabicNumber": 4273,
      "book": 42,
      "hadithInBook": 11,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنِ ابْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، وَعَنِ الْحَكَمِ، عَنِ الشَّعْبِيِّ، وَعَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا آخَرَ لاَ أَدْرِي أَيَّهُمَا أَخَذَ قَالَ ‏ \"‏ لاَ تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah: 'I release my dog, and I find another dog with mine, and I do not know which mine, and I do not know which of them caught (the game).' He said: 'do not eat it, for you said the name of Allah over your dog, but not over any other",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai demandé au Messager d’Allah ﷺ : \"Je lâche mon chien, et je trouve un autre chien avec le mien, et je ne sais pas lequel a attrapé la proie.\" Il a dit : \"Ne la mange pas, car tu as prononcé le nom d’Allah sur ton chien, mais pas sur un autre",
          "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abu Daud] dari [Syu'bah] dari [Ibnu Abu As Safar] dari [Asy Sya'bi]. Dan dari [Al Hakam] dari [Asy Sya'bi]. Juga dari [Sa'id bin Masruq] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam, saya katakan; saya mengirimkan anjingku kemuidian saya dapati anjing yang lain bersama anjingku, saya tidak tahu anjing yang manakah yang menangkap buruan tersebut. Beliau bersabda: \"Janganlah engkau makan, karena sesungguhnya engkau menyebutkan nama Allah pada anjingmu dan tidak menyebutkan pada selainnya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 4274,
      "arabicNumber": 4274,
      "book": 42,
      "hadithInBook": 12,
      "text": {
        "arabic": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ هَارُونَ - أَنْبَأَنَا زَكَرِيَّا، وَعَاصِمٌ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏\"‏ مَا أَصَابَ بِحَدِّهِ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ ‏\"‏ ‏.‏ قَالَ وَسَأَلْتُهُ عَنْ كَلْبِ الصَّيْدِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلَ قَالَ ‏\"‏ وَإِنْ قَتَلَ فَإِنْ أَكَلَ مِنْهُ فَلاَ تَأْكُلْ وَإِنْ وَجَدْتَ مَعَهُ كَلْبًا غَيْرَ كَلْبِكَ وَقَدْ قَتَلَهُ فَلاَ تَأْكُلْ فَإِنَّكَ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَزَّ وَجَلَّ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْ عَلَى غَيْرِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about hunting with the Mirad. He said: 'whatever is struck with the sharp edge, eat, and whatever is hit with its broad side, it is an animal killed by a blow. \"\" He said: \"And I asked him about hunting dogs. He said: 'If you release your dog and mention the name of Allah over it, then eat.,' I said: 'Even it he kills it?' He said: 'Even if he kills it?\" He said: 'Even if he kills it. But if he has eaten some of it, then do not eat. And if you find another dog with your dog and he has killed (the game), then do not eat, for you only said the name of Allah over your dog, not over your dog, not over any other",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai demandé au Messager d’Allah ﷺ au sujet de la chasse avec le Mirad. Il a dit : \"Tout ce qui est touché par la pointe, mange, et tout ce qui est frappé par le côté large, c’est un animal tué par un coup.\" Il a dit : \"Je lui ai aussi demandé au sujet des chiens de chasse. Il a dit : \"Si tu lâches ton chien et que tu prononces le nom d’Allah sur lui, alors mange.\" J’ai dit : \"Même s’il la tue ?\" Il a dit : \"Même s’il la tue.\" Il a dit : \"Même s’il la tue. Mais s’il en a mangé, alors ne mange pas. Et si tu trouves un autre chien avec le tien et qu’il a tué la proie, alors ne mange pas, car tu n’as prononcé le nom d’Allah que sur ton chien, pas sur un autre",
          "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami [Yazid yaitu Ibnu Harun], telah memberitakan kepada kami [Zakariya] dan ['Ashim] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, maka beliau bersabda: \"Apa yang engkau kenai dengan bagian yang tajam maka makanlah dan apa yang engkau kenai dengan bagian yang tumpul maka itu adalah hewan yang mati karena terkena benda tumpul.\" Dan saya bertanya kepada beliau mengenai anjing pemburu, maka beliau bersabda: \"Apabila engkau mengirimkan anjingmu dan menyebut nama Allah padanya maka makanlah.\" Saya katakan; walaupun ia membunuhnya? Beliau bersabda: \"Walaupun ia membunuhnya, apabila ia makan sebagian darinya maka janganlah engkau makan, dan jika engkau dapati bersamanya terdapat anjing lain selain anjingmu dan ia telah membunuhnya maka jangan engkau makan karena sesungguhnya engkau hanya menyebutkan nama Allah 'azza wajalla pada anjingmu dan tidak engkau sebutkan pada anjing yang lain"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 4275,
      "arabicNumber": 4275,
      "book": 42,
      "hadithInBook": 13,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ الطَّائِيِّ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ قَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كَلْبَكَ فَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَقَتَلَ وَلَمْ يَأْكُلْ فَكُلْ وَإِنْ أَكَلَ مِنْهُ فَلاَ تَأْكُلْ فَإِنَّمَا أَمْسَكَهُ عَلَيْهِ وَلَمْ يُمْسِكْ عَلَيْكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Adiyy bin Hatim At-Tai that he asked the Messenger of Allah about hunting. He said:\"If you release your dog and mention the name of Allah over him, and he kills (the game), but does not eat any of it, then eat. But if he has eaten from it, then do not eat, for he caught it for himself, and not for you",
          "fr": "Rapporté par 'Adiyy bin Hatim At-Tai : Il a demandé au Messager d’Allah ﷺ au sujet de la chasse. Il a dit : \"Si tu lâches ton chien et que tu prononces le nom d’Allah sur lui, et qu’il tue la proie sans en avoir mangé, alors mange. Mais s’il en a mangé, alors ne mange pas, car il l’a attrapée pour lui-même, pas pour toi",
          "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Ahmad bin Abu Syu'aib], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Ma'mar] dari ['Ashim bin Sulaiman] dari [Asy Sya'bi] dari ['Adi bin Hatim Ath Tha'i] bahwa Ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, beliau bersabda: \"Apabila engkau mengirim anjingmu dan engkau sebutkan nama Allah padanya kemudian ia membunuh dan tidak makan maka makanlah, dan apabila ia makan sebagian darinya maka jangan engkau makan, karena sesungguhnya ia menangkap untuk dirinya dan tidak menangkap untukmu"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 4276,
      "arabicNumber": 4276,
      "book": 42,
      "hadithInBook": 14,
      "text": {
        "arabic": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، قَالَ أَخْبَرَتْنِي مَيْمُونَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ جِبْرِيلُ عَلَيْهِ السَّلاَمُ لَكِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏.‏ فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكِلاَبِ حَتَّى إِنَّهُ لَيَأْمُرُ بِقَتْلِ الْكَلْبِ الصَّغِيرِ ‏.‏",
        "translations": {
          "en": "It was narrated that Az-Zuhri said:\"Ibn As-Sabbaq said: \"Maimunah told me that Jibril, peace be upon him, said to the Messenger of Allah 'We (Angles) do not enter a house in which there is a dog or a picture, The next day the Messenger of Allah commanded that all dogs be killed, even small dogs",
          "fr": "Rapporté par Az-Zuhri : Ibn As-Sabbaq a dit : \"Maymouna m’a raconté que Jibril, paix sur lui, a dit au Messager d’Allah ﷺ : 'Nous (les Anges) n’entrons pas dans une maison où il y a un chien ou une image.' Le lendemain, le Messager d’Allah ﷺ a ordonné que tous les chiens soient tués, même les petits chiens",
          "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku [Ibnu As Sabbaq], ia berkata; telah mengabarkan kepadaku [Maimunah] bahwa Jibril berkata kepada Rasulullah shallallahu 'alaihi wasallam; kami tidak memasuki rumah yang padanya terdapat anjing dan gambar. Kemudian pada pagi hari tersebut Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing hingga beliau memerintahkan untuk membunuh anjing kecil"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 4277,
      "arabicNumber": 4277,
      "book": 42,
      "hadithInBook": 15,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ غَيْرَ مَا اسْتَثْنَى مِنْهَا ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that:the Messenger of Allah commanded that dogs be killed, except those which were exempted",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah ﷺ a ordonné que les chiens soient tués, sauf ceux qui étaient exemptés",
          "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing tanpa terkecuali"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 4278,
      "arabicNumber": 4278,
      "book": 42,
      "hadithInBook": 16,
      "text": {
        "arabic": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، قَالَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم رَافِعًا صَوْتَهُ يَأْمُرُ بِقَتْلِ الْكِلاَبِ فَكَانَتِ الْكِلاَبُ تُقْتَلُ إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ ‏.‏",
        "translations": {
          "en": "Salim bin 'Abdullah narrated that his father said:\"I heard the Messenger of Allah raise his voice with the command to kill dogs. All dogs were to be killed except dogs used for hunting or herding livestock",
          "fr": "Rapporté par Salim bin 'Abdullah, d’après son père : J’ai entendu le Messager d’Allah ﷺ élever la voix pour ordonner de tuer les chiens. Tous les chiens devaient être tués sauf ceux utilisés pour la chasse ou la garde du bétail",
          "id": "Telah mengabarkan kepada kami [Wahb bin Bayan], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus], ia berkata; [Ibnu Syihab] berkata; telah menceritakan kepadaku [Salim bin Abdullah] dari [ayahnya], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam meninggikan suaranya memerintahkan untuk membunuh anjing, maka semua anjing dibunuh kecuali anjing pemburu dan anjing penjaga hewan ternak"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 4279,
      "arabicNumber": 4279,
      "book": 42,
      "hadithInBook": 17,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ إِلاَّ كَلْبَ صَيْدٍ أَوْ كَلْبَ مَاشِيَةٍ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that:The Messenger of Allah commanded that all dogs be killed except dogs used for hunting or herding livestock",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah ﷺ a ordonné que tous les chiens soient tués, sauf ceux utilisés pour la chasse ou la garde du bétail",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hammad] dari ['Amr] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh seluruh anjing kecuali anjing pemburu dan anjing penjaga hewan ternak"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 4280,
      "arabicNumber": 4280,
      "book": 42,
      "hadithInBook": 18,
      "text": {
        "arabic": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْلاَ أَنَّ الْكِلاَبَ أُمَّةٌ مِنَ الأُمَمِ لأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الأَسْوَدَ الْبَهِيمَ وَأَيُّمَا قَوْمٍ اتَّخَذُوا كَلْبًا لَيْسَ بِكَلْبِ حَرْثٍ أَوْ صَيْدٍ أَوْ مَاشِيَةٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah said:\"Were it not that dogs form one of the communities (or nations - of creatures), I would have commanded that they be killed. But kill those that are all black. Any people who keep a dog, except for dogs used for farming, hunting or herding livestock, one Qirat will be deducted from their reward each day",
          "fr": "Rapporté par 'Abdullah bin Mughaffal : Le Messager d’Allah ﷺ a dit : \"Si les chiens ne formaient pas une des communautés (ou espèces) de créatures, j’aurais ordonné qu’ils soient tous tués. Mais tuez ceux qui sont entièrement noirs. Toute personne qui garde un chien, sauf pour l’agriculture, la chasse ou la garde du bétail, verra une Qirat de sa récompense diminuée chaque jour",
          "id": "Telah mengabarkan kepada kami [Imran bin Musa], ia berkata; telah menceritakan kepada kami [Yazid bin Zurai'], ia berkata; telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Abdullah bin Mughaffal], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jikalau anjing itu bukan umat diantara umat niscaya saya akan memerintahkan untuk membunuhnya, bunuhlah anjing yang hitam pekat, siapapun orang yang mengambil anjing yang bukan anjing penjaga kebun atau anjing pemburu atau penjaga hewan ternak maka sesungguhnya akan berkurang dari pahalanya setiap hari sebanyak satu qirath"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 4281,
      "arabicNumber": 4281,
      "book": 42,
      "hadithInBook": 19,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، وَيَحْيَى بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ نُجَىٍّ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَلاَئِكَةُ لاَ تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ وَلاَ كَلْبٌ وَلاَ جُنُبٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Ali bin Abi Talib that the Prophet said:\"The angels do not enter a house in which there is a picture, a dog or a person who is Junub",
          "fr": "Rapporté par 'Ali bin Abi Talib : Le Prophète ﷺ a dit : « Les anges n’entrent pas dans une maison où il y a une image, un chien ou une personne en état de grande impureté (Junub). »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Muhammad] dan [Yahya bin Sa'id] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Ali bin Mudrik] dari [Abu Zur'ah] dari [Abdullah bin Nuji] dari [Ayahnya] dari [Ali bin Abu Thalib] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Malaikat tidak masuk rumah yang padanya terdapat gambar dan anjing serta orang yang junub"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 4282,
      "arabicNumber": 4282,
      "book": 42,
      "hadithInBook": 20,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Talhah said:\"The Messenger of Allah said: '; The angels do not enter a house in which there is a dog or a picture",
          "fr": "Rapporté par Abu Talhah : Le Messager d’Allah ﷺ a dit : « Les anges n’entrent pas dans une maison où il y a un chien ou une image. »",
          "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Ishaq bin Manshur] dari [Sufyan] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] dari [Abu Thalhah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Malaikat tidak masuk rumah yang padanya terdapat anjing dan gambar"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 4283,
      "arabicNumber": 4283,
      "book": 42,
      "hadithInBook": 21,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَخْبَرَتْنِي مَيْمُونَةُ، زَوْجُ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَصْبَحَ يَوْمًا وَاجِمًا فَقَالَتْ لَهُ مَيْمُونَةُ أَىْ رَسُولَ اللَّهِ لَقَدِ اسْتَنْكَرْتُ هَيْئَتَكَ مُنْذُ الْيَوْمَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ كَانَ وَعَدَنِي أَنْ يَلْقَانِي اللَّيْلَةَ فَلَمْ يَلْقَنِي أَمَا وَاللَّهِ مَا أَخْلَفَنِي ‏\"‏ ‏.‏ قَالَ فَظَلَّ يَوْمَهُ كَذَلِكَ ثُمَّ وَقَعَ فِي نَفْسِهِ جَرْوُ كَلْبٍ تَحْتَ نَضَدٍ لَنَا فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بِيَدِهِ مَاءً فَنَضَحَ بِهِ مَكَانَهُ فَلَمَّا أَمْسَى لَقِيَهُ جِبْرِيلُ عَلَيْهِ السَّلاَمُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ ‏\"‏ ‏.‏ قَالَ أَجَلْ وَلَكِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ قَالَ فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ ذَلِكَ الْيَوْمِ فَأَمَرَ بِقَتْلِ الْكِلاَبِ ‏.‏",
        "translations": {
          "en": "Maimunah, the wife of the Prophet narrated:\"The Messenger of Allah was upset one morning and Maimunah said to him: \"O Messenger of Allah, you look upset today., He said: 'Jibril, peace be upon him, had promised to meet me last night but he did not come, and by Allah, he never failed to keep an appointment,; The day passed, then he thought of a puppy that was beneath a table of ours. He ordered that it be taken out, and then he took some water In his hand and sprinkled it over the place where it had been. That evening, Jibril, peace be upon him, came and met him. The Messenger of Allah said to him: 'You [promised to meet me last night,; He said: 'Yes, but we do not enter a house in which there is a dog or a picture,; the next day the Messenger of Allah Commanded that dogs be killed]",
          "fr": "Rapporté par Maymouna, l’épouse du Prophète ﷺ : Le Messager d’Allah ﷺ était contrarié un matin et Maymouna lui a dit : « Ô Messager d’Allah, tu sembles contrarié aujourd’hui. » Il a dit : « Jibril, paix sur lui, m’avait promis de venir hier soir mais il n’est pas venu, et par Allah, il n’a jamais manqué un rendez-vous. » La journée est passée, puis il a pensé à un chiot qui était sous l’une de nos tables. Il a demandé qu’on le sorte, puis il a pris un peu d’eau dans sa main et en a aspergé l’endroit où il était. Ce soir-là, Jibril, paix sur lui, est venu le rencontrer. Le Messager d’Allah ﷺ lui a dit : « Tu avais promis de me rencontrer hier soir. » Il a répondu : « Oui, mais nous n’entrons pas dans une maison où il y a un chien ou une image. » Le lendemain, le Messager d’Allah ﷺ a ordonné de tuer les chiens",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Khalid bin Khali], ia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib] dari [ayahnya] dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku [Ibnu As Sibaq] dari [Ibnu Abbas], ia berkata; telah mengabarkan kepadaku [Maimunah] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam sangat bersedih di pagi hari, kemudian Maimunah berkata kepadanya; wahai Rasulullah, sungguh saya tidak mengetahui keadaan anda sejak hari ini. Beliau bersabda: \"Sesungguhnya Jibril 'alaihis salam telah berjanji untuk menemuiku pada malam ini, kemudian Ia tidak menemuiku. Demi Allah ia tidak pernah mengingkari janjinya kepadaku.\" Ibnu Abbas berkata; Beliau selama seharian dalam keadaan demikian, kemudian beliau teringat anjing kecil di bawah ranjang kami. Kemudian beliau memerintahkan agar anjing tersebut dikeluarkan, maka anjing tersebut dikeluarkan. Kemudian beliau mengambil air dengan tangannya dan mempercici tempat anjing tersebut. Kemudian pada sore harinya beliau berjumpa dengan Jibril 'alaihis salam. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Sungguh engkau telah berjanji kepadaku untuk menemuiku tadi malam.\" Jibril berkata; benar. Akan tetapi kami tidak memasuki rumah padanya terdapat anjing dan gambar. Ibnu Abbas berkata; kemudian pada pagi harinya Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh Anjing"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 4284,
      "arabicNumber": 4284,
      "book": 42,
      "hadithInBook": 22,
      "text": {
        "arabic": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرِ بْنِ سُوَيْدٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - وَهُوَ ابْنُ الْمُبَارَكِ - عَنْ حَنْظَلَةَ، قَالَ سَمِعْتُ سَالِمًا، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اقْتَنَى كَلْبًا نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ إِلاَّ ضَارِيًا أَوْ صَاحِبَ مَاشِيَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn'Umar said:\"The Messenger of Allah said: 'whoever keeps a dog, two Qirats will be detracted from his reward each day, except a trained hunting dog, or a dog for herding livestock",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah ﷺ a dit : « Celui qui garde un chien, deux qirats seront retirés de sa récompense chaque jour, sauf s’il s’agit d’un chien dressé pour la chasse ou pour garder le bétail. »",
          "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr bin Suwaid], ia berkata; telah memberitakan kepada kami [Abdullah yaitu Ibnu Al Mubarak] dari [Hanzhalah], ia berkata; saya mendengar [Salim] menceritakan dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memelihara anjing maka telah berkurang dari pahalanya setiap hari dua sebanyak dua qirath kecuali anjing pemburu atau anjing penjaga hewan ternak"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 4285,
      "arabicNumber": 4285,
      "book": 42,
      "hadithInBook": 23,
      "text": {
        "arabic": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرِ بْنِ إِيَاسِ بْنِ مُقَاتِلِ بْنِ مُشَمْرِجِ بْنِ خَالِدٍ السَّعْدِيُّ، عَنْ إِسْمَاعِيلَ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ يَزِيدَ، - وَهُوَ ابْنُ خُصَيْفَةَ - قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّهُ وَفَدَ عَلَيْهِمْ سُفْيَانُ بْنُ أَبِي زُهَيْرٍ الشَّنَائِيُّ وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قُلْتُ يَا سُفْيَانُ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ وَرَبِّ هَذَا الْمَسْجِدِ ‏.‏",
        "translations": {
          "en": "As-Saib bin Yazid narrated that Surfyan bin Abi Zuhair Ash-Shanai I came to visit them and said:\"The Messenger of Allah said: 'Whoever keeps a dog which he does not need for farming or livestock, one Qirt will be deducted from his (good) deeds each day.' It was said to him: 'did you hear this from the Messenger of Allah He said: 'Yes, by the Lord of this Masjid",
          "fr": "Rapporté par As-Saib bin Yazid : Sufyan bin Abi Zuhair Ash-Shanai est venu nous rendre visite et a dit : « Le Messager d’Allah ﷺ a dit : “Celui qui garde un chien sans en avoir besoin pour l’agriculture ou le bétail, un qirat sera retiré de ses bonnes actions chaque jour.” » On lui a demandé : « As-tu entendu cela du Messager d’Allah ﷺ ? » Il a répondu : « Oui, par le Seigneur de cette mosquée. »",
          "id": "Telah mengabarkan kepada kami [Ali bin Hujr bin Iyas bin Muqatil bin Musyamrij bin Khalid As Sa'di] dari [Isma'il yaitu Ibnu Ja'far] dari [Yazid yaitu Ibnu Khushaifah], ia berkata; telah mengabarkan kepadaku [As Saib bin Yazid] bahwa telah datang sebagai utusan kepada mereka Sufyan bin Abu Zuhair Asy Syanai dan ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memelihara anjing tidak ia manfaatkan untuk menjaga tanaman dan hewan ternak maka telah berkurang dari pahala amalannya Setiap hari sebanyak dua qirath. Saya bertanya; wahai Sufyan, apakah engkau mendengar hal ini dari Rasulullah shallallahu 'alaihi wasallam? Ia berkata; ya, demi Tuhan masjid ini"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 4286,
      "arabicNumber": 4286,
      "book": 42,
      "hadithInBook": 24,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَهُ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَمْسَكَ كَلْبًا إِلاَّ كَلْبًا ضَارِيًا أَوْ كَلْبَ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Umar said:\"The Messenger of Allah said:' whoever keeps a dog except one that is trained for hunting or a dog for herding livestock, two Qirats will be deducted from his reward each day",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d’Allah ﷺ a dit : « Celui qui garde un chien, sauf s’il est dressé pour la chasse ou pour garder le bétail, deux qirats seront retirés de sa récompense chaque jour. »",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang menahan anjing kecuali anjing pemburu dan anjing penjaga hewan ternak maka telh berkurng dari pahalanya setiap hari sebanyak dua qirath"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 4287,
      "arabicNumber": 4287,
      "book": 42,
      "hadithInBook": 25,
      "text": {
        "arabic": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Salim, from his father, that the Messenger of Allah said:\"Whoever keeps a dog. Except a dog for hunting or herding livestock, two Qirats will be deducted from his reward each day",
          "fr": "Rapporté par Salim, de la part de son père : Le Messager d’Allah ﷺ a dit : « Celui qui garde un chien, sauf un chien pour la chasse ou pour garder le bétail, deux qirats seront retirés de sa récompense chaque jour. »",
          "id": "Telah mengabarkan kepada kami [Abdul Jabbar bin Al 'Ala`] dari [Sufyan], ia berkata; telah menceritakan kepada kami [Az Zuhri] dari [Salim] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: 'Barang siapa yang memelihara anjing selain anjing pemburu dan penjaga hewan ternak maka telah berkurang dari pahalanya setiap hari sebanyak dua qirath"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 4288,
      "arabicNumber": 4288,
      "book": 42,
      "hadithInBook": 26,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، وَابْنُ أَبِي عَدِيٍّ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ عَوْفٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ أَوْ زَرْعٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin Mughaffal that the Prophet said:\"Whoever keeps a dog, except a dog for hunting, herding livestock or farming, one Qurat will be deducted from his reward each day",
          "fr": "Rapporté par 'Abdullah bin Mughaffal : Le Prophète ﷺ a dit : « Celui qui garde un chien, sauf un chien pour la chasse, pour garder le bétail ou pour l’agriculture, un qirat sera retiré de sa récompense chaque jour. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Yahya] dan [Ibnu Abu 'Adi] dan [Muhammad bin Ja'far] dari ['Auf] dari [Al Hasan] dari [Abdullah bin Mughaffal] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang mengambil anjing selain anjing pemburu dan anjing penjaga hewan ternak dan tanaman maka telah berkurang dari pahalanya setiap hari sebanyak satu qirath"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 4289,
      "arabicNumber": 4289,
      "book": 42,
      "hadithInBook": 27,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ زَرْعٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Messenger of Allah said:\"Whoever keep s dog except a dog for hunting, farming or herding livestock, on e Qurat will be deducted from his good deeds each day",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit : « Celui qui garde un chien, sauf un chien pour la chasse, l’agriculture ou le bétail, un qirat sera retiré de ses bonnes actions chaque jour. »",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdur Razzaq], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"\"Barang siapa yang mengambil anjing selain anjing pemburu dan anjing penjaga hewan tanaman dan ternak maka telah berkurang dari amalannya setiap hari sebanyak satu qirath"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 4290,
      "arabicNumber": 4290,
      "book": 42,
      "hadithInBook": 28,
      "text": {
        "arabic": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، قَالَ أَنْبَأَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ وَلاَ مَاشِيَةٍ وَلاَ أَرْضٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the Messenger of Allah said:\"Whoever keeps a dog that is not a dog used for hunting, herding livestock or guarding land, two qirats will be deducted from his reward each day",
          "fr": "Rapporté par Abu Hurairah : Le Messager d’Allah ﷺ a dit : « Celui qui garde un chien qui n’est pas utilisé pour la chasse, le bétail ou la garde d’un terrain, deux qirats seront retirés de sa récompense chaque jour. »",
          "id": "Telah mengabarkan kepada kami [Wahb bin Bayan], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah menceritakan kepadaku [Yunus], ia berkata; telah memberitakan kepada kami [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang memelihara anjing yang bukan anjing pemburu dan anjing penjaga hewan ternak dan kebun maka akan berkurang dari pahalanya setiap hari sebanyak dua qirath"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 4291,
      "arabicNumber": 4291,
      "book": 42,
      "hadithInBook": 29,
      "text": {
        "arabic": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ جَعْفَرٍ - قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ كَلْبَ صَيْدٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ وَقَالَ أَبُو هُرَيْرَةَ ‏\"‏ أَوْ كَلْبَ حَرْثٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Salim bin 'Abdullah that his father said:\"The Messenger of Allah said: \"Whoever keeps a dog, except a dog for herding livestock or a dog for hunting, one Qirat will be deducted from his reward each day.\" 'Abdullah said: \"Abu Hurairah said: 'Or a dog for farming",
          "fr": "Rapporté par Salim bin 'Abdullah, de la part de son père : Le Messager d’Allah ﷺ a dit : « Celui qui garde un chien, sauf un chien pour garder le bétail ou pour la chasse, un qirat sera retiré de sa récompense chaque jour. » 'Abdullah a ajouté : « Abu Hurairah a dit : “Ou un chien pour l’agriculture.” »",
          "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il yaitu Ibnu Ja'far], ia berkata; telah menceritakan kepada kami [Muhammad bin Abu Harmalah] dari [Salim bin Abdullah] dari [Ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"\"Barang siapa yang memeliha anjing kecuali anjing penjaga hewan ternak, pemburu maka telah berkurang dari pahalanya setiap hari sebanyak satu qirath. Berkata Abdullah dan berkata Abu Hurairah; atau anjing penjaga tanaman"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 4292,
      "arabicNumber": 4292,
      "book": 42,
      "hadithInBook": 30,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ، عُقْبَةَ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith bin Hisham that her heard Abu Mas ud 'Uqbah say:\"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator and the fees of a fortuneteller.\"( Sahih)",
          "fr": "Rapporté par Abu Bakr bin 'Abdur-Rahman bin Al-Harith bin Hisham, qui a entendu Abu Mas'ud 'Uqbah dire : Le Messager d’Allah ﷺ a interdit le prix d’un chien, le don d’une femme prostituée et les honoraires d’un devin. (Sahih)",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam] bahwa ia mendengar [Abu Mas'ud 'Uqbah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari harga anjing dan memberi upah pelacur serta bayaran dukun"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 4293,
      "arabicNumber": 4293,
      "book": 42,
      "hadithInBook": 31,
      "text": {
        "arabic": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا مَعْرُوفُ بْنُ سُوَيْدٍ الْجُذَامِيُّ، أَنَّ عُلَىَّ بْنَ رَبَاحٍ اللَّخْمِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَحِلُّ ثَمَنُ الْكَلْبِ وَلاَ حُلْوَانُ الْكَاهِنِ وَلاَ مَهْرُ الْبَغِيِّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Hurairah said:\"The Prophet said: 'The price of a dog, the fees of a fortuneteller and the gift of a female fornicator are not permissible",
          "fr": "Rapporté par Abu Hurairah : Le Prophète ﷺ a dit : « Le prix d’un chien, les honoraires d’un devin et le don d’une fornicatrice ne sont pas permis. »",
          "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah memberitakan kepada kami [Ma'ruf bin Suwaid Al Judzami] bahwa [Ali bin Radbah Al Lakhmi] telah menceritakan kepada kepadanya bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Tidak halal harga anjing, bayaran dukun dan upah pezina"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Hadith"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 4294,
      "arabicNumber": 4294,
      "book": 42,
      "hadithInBook": 32,
      "text": {
        "arabic": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ وَثَمَنُ الْكَلْبِ وَكَسْبُ الْحَجَّامِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Waqi bin Khadij said:\"The Messenger of Allah said: 'The worst of earnings arte the gift of a female fornicator, the price of a dog and the earnings of a cupper",
          "fr": "Rapporté par Waqi bin Khadij : Le Messager d’Allah ﷺ a dit : « Les pires gains sont le don d’une prostituée, le prix d’un chien et le salaire d’un ventouseur. »",
          "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dari [Yahya] dari [Muhammad bin Yusuf] dari [As Saib bin Yazid] dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seburuk-buruk pekerjaan adalah upah pelacur, harga anjing dan profesi tukang bekam"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Hadith"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 4295,
      "arabicNumber": 4295,
      "book": 42,
      "hadithInBook": 33,
      "text": {
        "arabic": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ السِّنَّوْرِ وَالْكَلْبِ إِلاَّ كَلْبَ صَيْدٍ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَحَدِيثُ حَجَّاجٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ لَيْسَ هُوَ بِصَحِيحٍ ‏.‏",
        "translations": {
          "en": "It was narrated from Jabir that:the Prophet forbade the price of cats and dogs, except hunting. (Da if) Abu Abdur-Rahman (An-Nasa I) said: The Hadith of Hajjaj from Hammad bin Salamah is not authentic:",
          "fr": "Rapporté par Jabir : Le Prophète ﷺ a interdit le prix des chats et des chiens, sauf pour la chasse. (Da'if) Abu Abdur-Rahman (An-Nasa'i) a dit : Le hadith de Hajjaj d’après Hammad bin Salamah n’est pas authentique",
          "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan Al Miqsami], ia berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Hammad bin Salamah] dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari harga kucing dan anjing kecuali anjing pemburu. Abu Abdurrahman berkata; dan hadits Hajjaj dari Hammad bin Salamah tidak shahih"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 4296,
      "arabicNumber": 4296,
      "book": 42,
      "hadithInBook": 34,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا ابْنُ سَوَاءٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ أَبِي مَالِكٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي كِلاَبًا مُكَلَّبَةً فَأَفْتِنِي فِيهَا ‏.‏ قَالَ ‏\"‏ مَا أَمْسَكَ عَلَيْكَ كِلاَبُكَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ ‏\"‏ ‏.‏ قَالَ أَفْتِنِي فِي قَوْسِي ‏.‏ قَالَ ‏\"‏ مَا رَدَّ عَلَيْكَ سَهْمُكَ فَكُلْ ‏\"‏ ‏.‏ قَالَ وَإِنْ تَغَيَّبَ عَلَىَّ قَالَ ‏\"‏ وَإِنْ تَغَيَّبَ عَلَيْكَ مَا لَمْ تَجِدْ فِيهِ أَثَرَ سَهْمٍ غَيْرَ سَهْمِكَ أَوْ تَجِدْهُ قَدْ صَلَّ ‏\"‏ ‏.‏ يَعْنِي قَدْ أَنْتَنَ ‏.‏ قَالَ ابْنُ سَوَاءٍ وَسَمِعْتُهُ مِنْ أَبِي مَالِكٍ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "It was narrated from 'Arm bin Shu'aib, from his father, from his grandfather, that:a man came to the Prophet and said: \"O Messenger of Allah, I have trained dogs; advise me concerning them.\" He said: \"Whatever your dogs catch for you, eat,\" I side: \"Even if they kill it?\" He said: \"Even if they kill it. \" He said: \"Advise me about my bow. \"He said: \"Whatever your arrow returns to you, eat.\" He said: \"Even if it gets away from you, so long as you do not find the mark of an arrow other than yours on it, or you find that it has gone rotten.\"(Another chain)",
          "fr": "Rapporté par 'Amr bin Shu'aib, de la part de son père, de son grand-père : Un homme est venu voir le Prophète ﷺ et a dit : « Ô Messager d’Allah, j’ai dressé des chiens ; conseille-moi à leur sujet. » Il a dit : « Mange ce que tes chiens attrapent pour toi. » J’ai demandé : « Même s’ils le tuent ? » Il a répondu : « Même s’ils le tuent. » Il a dit : « Conseille-moi à propos de mon arc. » Il a dit : « Mange ce que ta flèche te ramène. » Il a demandé : « Même si l’animal s’échappe de moi, tant que je ne trouve pas la marque d’une autre flèche que la tienne, ou que tu ne trouves pas qu’il est pourri. »",
          "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Ibnu Sawa`], ia berkata; telah menceritakan kepada kami [Sa'id] dari [Abu Malik] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, sesungguhnya saya memiliki beberapa ekor anjing yang terlatih, maka berilah saya fatwa mengenainya! Beliau bersabda: \"Apa yang ditangkap anjing-anjingmu untukmu makanlah.\" Saya katakan; walaupun mereka membunuh buruan? Beliau bersabda: \"Walaupun mereka membunuh buruan.\" Ia berkata; berilah saya fatwa mengenai busurku. Beliau bersabda: \"Apa yang dibawa kembali oleh anak panahmu untukmu maka makanlah.\" Ia berkata; walaupun tidak kelihatan olehku? Beliau bersabda: \" Walaupun tidak kelihatan olehmu selama engkau tidak mendapati bekas anak panah selain anak panahmu atau engkau mendapatinya telah membusuk.\" [Ibnu Sawa`] berkata; saya mendengarnya dari [Abu Malik 'Ubaidullah bin Al Akhnas] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 4297,
      "arabicNumber": 4297,
      "book": 42,
      "hadithInBook": 35,
      "text": {
        "arabic": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ فَأَصَابُوا إِبِلاً وَغَنَمًا وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي أُخْرَيَاتِ الْقَوْمِ فَعَجَّلَ أَوَّلُهُمْ فَذَبَحُوا وَنَصَبُوا الْقُدُورَ فَدُفِعَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِالْقُدُورِ فَأُكْفِئَتْ ثُمَّ قَسَّمَ بَيْنَهُمْ فَعَدَلَ عَشْرًا مِنَ الشَّاءِ بِبَعِيرٍ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ نَدَّ بَعِيرٌ وَلَيْسَ فِي الْقَوْمِ إِلاَّ خَيْلٌ يَسِيرَةٌ فَطَلَبُوهُ فَأَعْيَاهُمْ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Rafi bin Khadij said:\"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same",
          "fr": "Rapporté par Rafi bin Khadij : Alors que nous étions avec le Messager d’Allah ﷺ à Dhul-Hulaifah à Tihamah, ils ont obtenu des chameaux et des moutons (comme butin). Le Messager d’Allah ﷺ était parmi les derniers, et les premiers se sont précipités pour abattre les animaux et faire cuire la viande. Le Messager d’Allah ﷺ est arrivé et a ordonné de renverser les marmites, puis il a réparti les animaux en comptant dix moutons pour un chameau. Pendant ce temps, un chameau s’est échappé. Les gens avaient peu de chevaux, alors ils l’ont poursuivi mais il leur a échappé. Un homme a tiré une flèche sur lui et l’a arrêté. Le Messager d’Allah ﷺ a dit : « Certains de ces animaux sont sauvages comme des bêtes, alors si l’un d’eux vous échappe, faites de même. »",
          "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami [Husain bin Ali] dari [Zaidah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah bin Rafi'] dari [Rafi' bin Khadij], ia berkata; ketika kami bersama Rasulullah shallallahu 'alaihi wasallam di Dzul Hulaifah dari Mekkah mereka mendapatkan unta dan kambing, sedangkan Rasulullah shallallahu 'alaihi wasallam berada pada beberapa kelompok orang yang terlambat, kemudian orang yang pertama bersegera menyembelih dan meletakkan kuali, kemudian Rasulullah shallallahu 'alaihi wasallam terdorong untuk menuju kepada mereka kemudian beliau memerintahkan agar isi kuali dikeluarkan, kemudian beliau membagi diantara mereka, dan menyamakan sepuluh kambing dengan satu unta. Ketika mereka dalam keadaan demikian, tiba-tiba terdapat unta yang lepas, mereka tidak memiliki kecuali kuda yang tidak kencang larinya. Mereka mencarinya dan lelah karenanya, kemudin seorang laki-laki memanahnya dengan anak panah kemudian Allah menahan unta tersebut. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya binatang-binatang ini memiliki binanatang-binatang yang menjadi liar, seperti liarnya binatang liar, maka apa yang kalian mampu lakukan terhadapnya maka lakukanlah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 4298,
      "arabicNumber": 4298,
      "book": 42,
      "hadithInBook": 36,
      "text": {
        "arabic": "أَخْبَرَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، قَالَ أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏ \"‏ إِذَا رَمَيْتَ سَهْمَكَ فَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ فَإِنْ وَجَدْتَهُ قَدْ قُتِلَ فَكُلْ إِلاَّ أَنْ تَجِدَهُ قَدْ وَقَعَ فِي مَاءٍ وَلاَ تَدْرِي الْمَاءُ قَتَلَهُ أَوْ سَهْمُكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about hunting and he said: 'When you shoot your arrow, mention the name of Allah, and if you find that it (the game) has been killed, the eat it, unless you find that it fell into some water, and you do not know whether the water killed it or your arrow",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai demandé au Messager d’Allah ﷺ à propos de la chasse et il a dit : « Quand tu tires ta flèche, mentionne le nom d’Allah, et si tu trouves que le gibier est mort, alors mange-le, sauf si tu découvres qu’il est tombé dans de l’eau et que tu ne sais pas si c’est l’eau ou ta flèche qui l’a tué. »",
          "id": "Telah mengabarkan kepada kami [Ahmad bin Mani'], ia berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak], ia berkata; telah mengabarkan kepadaku ['Ashim Al Ahwali] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam mengenai hewan buruan, kemudian beliau bersabda: \"Apabila engkau melepaskan anak panahmu maka sebutlah nama Allah 'azza wajalla, kemudian apabila engkau mendapatinya telah terbunuh maka makanlah, kecuali engkau dapati dia telah terjatuh dalam air, dan engkau tidak mengetahui apakah air tersebut yang membuatnya mati atau anak panahmu"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 4299,
      "arabicNumber": 4299,
      "book": 42,
      "hadithInBook": 37,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ، عَنْ مَعْمَرٍ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، عَنْ عَامِرٍ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّيْدِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ سَهْمَكَ وَكَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَقَتَلَ سَهْمُكَ فَكُلْ ‏\"‏ ‏.‏ قَالَ فَإِنْ بَاتَ عَنِّي لَيْلَةً يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ إِنْ وَجَدْتَ سَهْمَكَ وَلَمْ تَجِدْ فِيهِ أَثَرَ شَىْءٍ غَيْرَهُ فَكُلْ وَإِنْ وَقَعَ فِي الْمَاءِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Adiyy bin Hatim that he asked the Messenger of Allah about hunting and he said:\"When you release your arrow or your dog, mention the name of Allah, and when your arrow kills (the game), then eat.\" He said: \"What if it gets away from me for a night, O Messenger of Allah?\" He said: \"If you find your arrow and you do not find the mark of anything else, then eat it. But if it falls into the water, do not eat it",
          "fr": "Rapporté par 'Adiyy bin Hatim : Il a demandé au Messager d’Allah ﷺ à propos de la chasse et il a dit : « Quand tu lances ta flèche ou que tu lâches ton chien, mentionne le nom d’Allah, et si ta flèche tue le gibier, alors mange-le. » Il a dit : « Et s’il s’échappe de moi pendant une nuit, ô Messager d’Allah ? » Il a dit : « Si tu retrouves ta flèche et que tu ne vois pas la marque de quelque chose d’autre, alors mange-le. Mais s’il tombe dans l’eau, ne le mange pas. »",
          "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Ahmad bin Abu Syu'aib], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Ma'mar] dari ['Ashim bin Sulaiman] dari ['Amir Asy Sya'bi] dari ['Adi bin Hatim] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, maka beliau bersabda: \"Apabila engkau melepas anak panah dan anjingmu dan menyebutkan nama Allah kemudian anak panahmu membunuh maka makanlah.\" Adi berkata: walaupun telah bermalam satu malam wahai Rasulullah? Beliau bersabda: \"Apabila engkau mendapatkan anak panahmu dan tidak mendapatkan padanya bekas sesuatu selainnya maka makanlah, dan apabila terjatuh ke dalam air maka janganlah engkau makan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 4300,
      "arabicNumber": 4300,
      "book": 42,
      "hadithInBook": 38,
      "text": {
        "arabic": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ الصَّيْدِ وَإِنَّ أَحَدَنَا يَرْمِي الصَّيْدَ فَيَغِيبُ عَنْهُ اللَّيْلَةَ وَاللَّيْلَتَيْنِ فَيَبْتَغِي الأَثَرَ فَيَجِدُهُ مَيِّتًا وَسَهْمُهُ فِيهِ ‏.‏ قَالَ ‏ \"‏ إِذَا وَجَدْتَ السَّهْمَ فِيهِ وَلَمْ تَجِدْ فِيهِ أَثَرَ سَبُعٍ وَعَلِمْتَ أَنَّ سَهْمَكَ قَتَلَهُ فَكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated tht 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, we are a people who hunt, and one of us may shoot his arrow but (the game) gets way from him for a night or two. What if he follows its tracks, and finds it dead with his arrow in it?\" He said: \"If you find the arrow in it, and you do not find any sign of predators, and you know that your arrow killed it, then eat it.\" (Sahih)",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai dit : « Ô Messager d’Allah, nous sommes des gens qui chassent, et il arrive que l’un de nous tire une flèche et que le gibier lui échappe pendant une nuit ou deux. Que faire s’il suit ses traces et le retrouve mort avec sa flèche dedans ? » Il a dit : « Si tu trouves la flèche dedans, et que tu ne vois aucune trace de prédateurs, et que tu sais que c’est ta flèche qui l’a tué, alors mange-le. » (Sahih)",
          "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah memberitakan kepada kami [Abu Bisyr] dari [Sa'id bin Jubair] dari ['Adi bin Hatim], ia berkata; saya katakan; wahai Rasulullah, sesungguhnya kami adalah orang-orang yang biasa berburu, dan salah seorang diantara kami memanah hewan buruan kemudian menghilang darinya satu malam dan dua malam. Kemudian ia mencarinya, dan mendapatinya telah mati dan anak panahnya berada padanya. Beliau bersabda: \"Apabila ia mendapati anak panahnya padanya dan tidak mendapati padanya bekas binatang buas dan ia mengetahui bahwa anak panahnya telah membunuhnya maka makanlah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 4301,
      "arabicNumber": 4301,
      "book": 42,
      "hadithInBook": 39,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالاَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا رَأَيْتَ سَهْمَكَ فِيهِ وَلَمْ تَرَ فِيهِ أَثَرًا غَيْرَهُ وَعَلِمْتَ أَنَّهُ قَتَلَهُ فَكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Adiyy bin Hatim that the Messenger of Allah said:\"If you see your arrow in it. And you do not see any other mark, and you know that (Your arrow) killed it, then eat it",
          "fr": "Rapporté par 'Adiyy bin Hatim : Le Messager d’Allah ﷺ a dit : « Si tu vois ta flèche dans le gibier, et que tu ne vois aucune autre marque, et que tu sais que c’est ta flèche qui l’a tué, alors mange-le. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dan [Isma'il bin Mas'ud] mereka berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari ['Adi bin Hatim] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau melihat anak panahmu ada padanya dan engkau tidakmelihat padanya bekas selainnya dan engkau tahu bahwa anak panah tersebut telah membunuhnya maka makanlah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 4302,
      "arabicNumber": 4302,
      "book": 42,
      "hadithInBook": 40,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ فَأَطْلُبُ أَثَرَهُ بَعْدَ لَيْلَةٍ ‏.‏ قَالَ ‏ \"‏ إِذَا وَجَدْتَ فِيهِ سَهْمَكَ وَلَمْ يَأْكُلْ مِنْهُ سَبُعٌ فَكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "it was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I shoot game and I follow its tracks after of night. He said: 'If you find your arrow in it, and no predator has eaten from it, then eat it",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai dit : « Ô Messager d’Allah, je tire sur du gibier et je suis ses traces après une nuit. » Il a dit : « Si tu trouves ta flèche dans le gibier, et qu’aucun prédateur n’en a mangé, alors mange-le. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin Maisarah] dari [Sa'id bin Jubair] dari ['Adi bin Hatim], ia berkata; saya katakan; wahai Rasulullah, saya memanah hewan buruanku kemudian saya mencari jejaknya setelah satu malam, Beliau bersabda: \" Apabila engkau dapatkan padanya anak panahmu, dan tidak ada hewan buas yang memakannya maka makanlah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 4303,
      "arabicNumber": 4303,
      "book": 42,
      "hadithInBook": 41,
      "text": {
        "arabic": "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ الْخَلاَّلُ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ أَنْبَأَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ صَالِحٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي ثَعْلَبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الَّذِي يُدْرِكُ صَيْدَهُ بَعْدَ ثَلاَثٍ فَلْيَأْكُلْهُ إِلاَّ أَنْ يُنْتِنَ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Tha'labah from the Prophet that:the one who catches up with the game (he shot) after three days may eat from it, unless it has turned rotten",
          "fr": "Rapporté par Abu Tha'labah, du Prophète ﷺ : Celui qui retrouve le gibier qu’il a tiré après trois jours peut en manger, sauf s’il est devenu pourri",
          "id": "Telah mengabarkan kepada kami [Ahmad bin Khalid Al Khalal], ia berkata; telah menceritakan kepada kami [Ma'n], ia berkata; telah memberitakan kepada kami [Mu'awiyah yaitu Ibnu Shalih] dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya] dari [Abu Tsa'labah] dari Nabi shallallahu 'alaihi wasallam mengenai orang yang menjumpai hewan buruan buruannya setelah tiga hari, beliau bersabda: \"Hendaknya ia memakannya kecuali apabila telah membusuk"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 4304,
      "arabicNumber": 4304,
      "book": 42,
      "hadithInBook": 42,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، قَالَ سَمِعْتُ مُرِّيَّ بْنَ قَطَرِيٍّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كَلْبِي فَيَأْخُذُ الصَّيْدَ وَلاَ أَجِدُ مَا أُذَكِّيهِ بِهِ فَأُذَكِّيهِ بِالْمَرْوَةِ وَالْعَصَا ‏.‏ قَالَ ‏ \"‏ أَهْرِقِ الدَّمَ بِمَا شِئْتَ وَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "t was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I release my dog and he catches the game, but I cannot find anything with which to slaughter it, so I slaughter it with a sharp-edged stone or a stick.' He said: 'Shed the blood with whatever you want, and mention the name of Allah",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai dit : « Ô Messager d’Allah, je lâche mon chien et il attrape le gibier, mais je ne trouve rien pour l’égorger, alors je le tue avec une pierre tranchante ou un bâton. » Il a dit : « Fais couler le sang avec ce que tu veux, et mentionne le nom d’Allah. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Simak], ia berkata; saya mendengar [Murri bin Qathari] dari ['Adi bin Hatim], ia berkata; saya berkata; wahai Rasulullah, saya mengirim anjingku kemudian ia menangkap hewan buruan, dan saya tidak mendapatkan Sesuatu untuk menyembelihnya, kemudian saya menyembelihnya dengan batu putih yang dibuat seperti pisau dan sebuah tongkat. Beliau bersabda: \"Alirkanlah darah dengan apa yang engkau kehendaki, dan sebutlah nama Allah 'azza wajalla"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 4305,
      "arabicNumber": 4305,
      "book": 42,
      "hadithInBook": 43,
      "text": {
        "arabic": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرْسِلُ الْكِلاَبَ الْمُعَلَّمَةَ فَتُمْسِكُ عَلَىَّ فَآكُلُ مِنْهُ قَالَ ‏\"‏ إِذَا أَرْسَلْتَ الْكِلاَبَ - يَعْنِي الْمُعَلَّمَةَ - وَذَكَرْتَ اسْمَ اللَّهِ فَأَمْسَكْنَ عَلَيْكَ فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مِنْهَا ‏\"‏ ‏.‏ قُلْتُ وَإِنِّي أَرْمِي الصَّيْدَ بِالْمِعْرَاضِ فَأُصِيبُ فَآكُلُ قَالَ ‏\"‏ إِذَا رَمَيْتَ بِالْمِعْرَاضِ وَسَمَّيْتَ فَخَزَقَ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "t was narrated that 'Adiyy bin Hatim said:\"I said: 'O Messenger of Allah, I release my trained dogs and they catch (the game) for me - should I eat of it?\" he said: 'If you release your trained dogs, and mention the name of Allah, and they catch it for your, then eat.' I said: 'Even if they kill it?' He said:\" 'Even if they kill it, so long as another, strange dog has not joined them 'I said: 'And I shoot the game with the Mirad and I hit it - should I eat?' He said: ''If you shoot the and it penetrates (the target), then eat, but if it hits it with its broad edge, then do not6 eat it",
          "fr": "Rapporté par 'Adiyy bin Hatim : J’ai dit : « Ô Messager d’Allah, je lâche mes chiens dressés et ils attrapent le gibier pour moi – puis-je en manger ? » Il a dit : « Si tu lâches tes chiens dressés, que tu mentionnes le nom d’Allah et qu’ils l’attrapent pour toi, alors mange. » J’ai demandé : « Même s’ils le tuent ? » Il a dit : « Même s’ils le tuent, tant qu’un autre chien étranger ne s’est pas joint à eux. » J’ai dit : « Et si je tire sur le gibier avec le Mirad et que je le touche – puis-je en manger ? » Il a dit : « Si tu tires et que la flèche pénètre, alors mange, mais si elle le frappe avec son côté large, alors ne mange pas. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dari [Jarir] dari [Manshur] dari [Ibrahim] dari [Hammam] dari ['Adi bin Hatim], ia berkata; saya mengatakan; wahai Rasulullah, sesungguhnya saya mengirimkan beberapa ekor anjing yang terlatih, kemudian mereka menangkap buruan untukku, lalu saya memakan sebagian darinya. Beliau bersabda: \"Apabila engkau mengirim anjing-anjingmu yang terlatih dan engkau menyebutkan nama Allah kemudian mereka menangkap buruan untukmu maka makanlah.\" Saya katakan; walaupun mereka membunuhnya? Beliau bersabda: \"Walaupun mereka membunuhnya selama tidak ada anjing selainnya yang ikut serta. Saya katakan; dan saya memanah hewan buruanku dengan anak panah tanpa mata panah, kemudian saya mengenai buruan, dan memakannya. Beliau bersabda: \"Apabila engkau memanah dengan anak panah yang tak bermata panah dan engkau telah menyebutkan nama Allah dan anak panah tersebut menusuk maka makanlah, dan apabila mengenai dengan bagian tumpunya maka jangan engkau makan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 4306,
      "arabicNumber": 4306,
      "book": 42,
      "hadithInBook": 44,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْمِعْرَاضِ فَقَالَ ‏ \"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَقُتِلَ فَإِنَّهُ وَقِيذٌ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "(It was narrated that Ash-Sha bi said:\" I heard 'Adiyy bin Hatim say: 'I asked the Messenger of Allah about the Mirad and he said: \"If the sharp point hits 9the game) then eat, bu",
          "fr": "Rapporté par Ash-Sha'bi : J'ai entendu 'Adiyy bin Hatim dire : J'ai interrogé le Messager d'Allah au sujet du Mirad et il a dit : \"Si la pointe acérée touche le gibier, alors mangez-en",
          "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Abdullah bin Abu As Safar] dari [Asy Sya'bi], ia berkata; saya mendengar ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai anak panah tanpa mata. Kemudian beliau bersabda: \"Apabila ia mengenai dengan bagian tajamnya maka makanlah dan apabila mengenai dengan bagian tumpulnya kemudian terbunuh maka sesungguhnya buruan tersebut merupakan hewan yang mati karena benda tumpul, maka jangan engkau makan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 4307,
      "arabicNumber": 4307,
      "book": 42,
      "hadithInBook": 45,
      "text": {
        "arabic": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّارِعُ، قَالَ حَدَّثَنَا أَبُو مِحْصَنٍ، قَالَ حَدَّثَنَا حُصَيْنٌ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏ \"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Hatim said:\"I asked the Messenger of Allah about hunting with the Mirad and the said: 'If the sharp edge hits (the game), then eat, but if the broad edge of it strikes it, do not eat it",
          "fr": "Rapporté par 'Adiyy bin Hatim : J'ai interrogé le Messager d'Allah au sujet de la chasse avec le Mirad et il a dit : \"Si le côté tranchant touche le gibier, alors mangez-en, mais si c'est le côté large qui le frappe, n'en mangez pas",
          "id": "Telah mengabarkan kepada kami [Al Husain bin Muhammad Adz Dzarra'], ia berkata; telah menceritakan kepada kami [Abu Muhshan], ia berkata; telah menceritakan kepada kami [Hushain] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, kemudian beliau bersabda: \"Apabila mengenai dengan bagian yang tajam maka makanlah, dan apabila mengenai dengan bagian yang tumpul maka jangan engkau makan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 4308,
      "arabicNumber": 4308,
      "book": 42,
      "hadithInBook": 46,
      "text": {
        "arabic": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، وَغَيْرُهُ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ ‏ \"‏ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Adiyy bin Htim said:\"I asked the Messenger of Allah about hunting with Mirad and he said: 'If the sharp edge hits (the game), then eat, but if the broad edge of it strikes it, then it has been killed by a blow",
          "fr": "Rapporté par 'Adiyy bin Hatim : J'ai interrogé le Messager d'Allah au sujet de la chasse avec le Mirad et il a dit : \"Si le côté tranchant touche le gibier, alors mangez-en, mais si c'est le côté large qui le frappe, alors il a été tué par un coup (et il ne faut pas en manger)",
          "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah memberitakan kepada kami [Isa bin Yunus] dan yang lainnya dari [Zakariya] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, maka beliau bersabda: \"Apa yang engkau kenai dengan bagian tajamnya maka makanlah dan apa yang engkau kenai dengan bagian tumpulnya maka itu adalah hewan yang mati karena benda tumpul"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 4309,
      "arabicNumber": 4309,
      "book": 42,
      "hadithInBook": 47,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي مُوسَى، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي مُوسَى، عَنْ وَهْبِ بْنِ مُنَبِّهٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ سَكَنَ الْبَادِيَةَ جَفَا وَمَنِ اتَّبَعَ الصَّيْدَ غَفُلَ وَمَنِ اتَّبَعَ السُّلْطَانَ افْتُتِنَ ‏\"‏ ‏.‏ وَاللَّفْظُ لاِبْنِ الْمُثَنَّى ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that the Prophet said:\"Whoever lives in the desert, he becomes hard-hearted, and whoever follows game becomes preoccupied with it (and neglectful toward other duties), and whoever follows the ruler will put himself through trial.\"(Sahih) The wording is of Ibn Al-Muthanna",
          "fr": "Rapporté par Ibn 'Abbas : Le Prophète a dit : \"Celui qui vit dans le désert devient dur de cœur, et celui qui poursuit le gibier finit par s'y consacrer (et néglige d'autres devoirs), et celui qui suit le dirigeant s'expose à l'épreuve.\" (Sahih) Cette formulation est celle d'Ibn Al-Muthanna",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdurrahman] dari [Sufyan] dari [Abu Musa], telah menceritakan dan memberitakan kepada kami [Muhammad bin Al Mutsanna] dari [Abdurrahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Musa] dari [Wahb bin Munabbih] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang tinggal di pelosok maka ia hidup keras, barangsiapa yang mengikuti hewan buruan ia akan lalai, barangsiapa yang mengikuti kemauan penguasa maka ia akan terfitnah, \" lafazh ini milik Ibn Al Mutsanna"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 4310,
      "arabicNumber": 4310,
      "book": 42,
      "hadithInBook": 48,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ الْبَحْرَانِيُّ، قَالَ حَدَّثَنَا حَبَّانُ، - وَهُوَ ابْنُ هِلاَلٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم بِأَرْنَبٍ قَدْ شَوَاهَا فَوَضَعَهَا بَيْنَ يَدَيْهِ فَأَمْسَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَأْكُلْ وَأَمَرَ الْقَوْمَ أَنْ يَأْكُلُوا وَأَمْسَكَ الأَعْرَابِيُّ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا يَمْنَعُكَ أَنْ تَأْكُلَ ‏\"‏ ‏.‏ قَالَ إِنِّي أَصُومُ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ‏.‏ قَالَ ‏\"‏ إِنْ كُنْتَ صَائِمًا فَصُمِ الْغُرَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Hurairah said:\"A Bedouin brought a rabbit to the Messenger of Allah that he had grilled and placed it before him. The messenger of Allah refrained from eating but he told the people to eat. The Bedouin also refrained from eating, and the Messenger of Allah said to him: 'What is keeping you from eating?' He said: 'I fast three days of each month.' He Said: \"If you are going to fast, then fast the bright days (Al-Ghurr)",
          "fr": "Rapporté par Abu Hurairah : Un Bédouin a apporté un lapin grillé au Messager d'Allah et l'a posé devant lui. Le Messager d'Allah n'en a pas mangé, mais il a dit aux gens d'en manger. Le Bédouin s'est aussi abstenu de manger, et le Messager d'Allah lui a dit : \"Pourquoi ne manges-tu pas ?\" Il a répondu : \"Je jeûne trois jours chaque mois.\" Il a dit : \"Si tu veux jeûner, alors jeûne les jours lumineux (Al-Ghurr)",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar Al Bahrani], ia berkata; telah menceritakan kepada kami [Habban yaitu Ibnu Hilal], ia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik bin 'Umair] dari [Musa bin Thalhah] dari [Abu Hurairah], ia berkata; telah datang seorang badui kepada Nabi shallallahu 'alaihi wasallam membawa kelinci yang telah ia baker, kemudian ia meletakkannya dihadapan beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam menahan diri tidak memakannya, dan beliau memerintahkan orang-orang agar memakannya, dan orang badui tersebut menahan untuk makan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apa yang menghalangimu untuk makan?\" Ia berkata; sesungguhnya Saya sedang berpuasa tiga hari dari setiap bulan. Beliau bersabda: \"Apabila engkau berpuasa maka berpuasalah tanggal tiga belas, empat belas dan lima belas"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 4311,
      "arabicNumber": 4311,
      "book": 42,
      "hadithInBook": 49,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حَكِيمِ بْنِ جُبَيْرٍ، وَعَمْرِو بْنِ عُثْمَانَ، وَمُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنِ ابْنِ الْحَوْتَكِيَّةِ، قَالَ قَالَ عُمَرُ رضى الله عنه مَنْ حَاضِرُنَا يَوْمَ الْقَاحَةِ قَالَ قَالَ أَبُو ذَرٍّ أَنَا أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَرْنَبٍ فَقَالَ الرَّجُلُ الَّذِي جَاءَ بِهَا إِنِّي رَأَيْتُهَا تَدْمَى ‏.‏ فَكَانَ النَّبِيُّ صلى الله عليه وسلم لَمْ يَأْكُلْ ثُمَّ إِنَّهُ قَالَ ‏\"‏ كُلُوا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ إِنِّي صَائِمٌ ‏.‏ قَالَ ‏\"‏ وَمَا صَوْمُكَ ‏\"‏ ‏.‏ قَالَ مِنْ كُلِّ شَهْرٍ ثَلاَثَةُ أَيَّامٍ ‏.‏ قَالَ ‏\"‏ فَأَيْنَ أَنْتَ عَنِ الْبِيضِ الْغُرِّ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn Al- Hawtakiyyah said:\"Umar, May Allah be pleased with us on the day when we stopped at Al-Qaha?' Abu Dharr said: 'I was. A rabbit was brought to the Messenger Allah and the man who brought it said: I saw it bleeding (menstruating). The Prophet did not eat, then he said: \"Eat.\" A man said: \"I am fasting.\" He said: \"What fast are you observing?\" He said: \"Three days each month\" He said: \"Why don't yo",
          "fr": "‘Umar — qu’Allah l’agrée — dit : « Étais-tu avec nous le jour où nous nous sommes arrêtés à al-Qahâ ? » Abû Dharr répondit : « Oui, j’y étais. » Un lapin fut alors apporté au Messager d’Allah ﷺ, et l’homme qui l’avait apporté dit : « Je l’ai vu saigner (comme s’il avait ses règles). » Le Prophète ﷺ n’en mangea pas, puis il dit : « Mangez-en. » Un homme dit : « Je jeûne. » Le Prophète ﷺ lui demanda : « Quel jeûne observes-tu ? » Il répondit : « Trois jours chaque mois. » Le Prophète ﷺ dit : « Pourquoi ne jeûnes-tu pas les jours blancs : le treizième, quatorzième et quinzième ? »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Hakim bin Jubair] dan ['Amr bin Utsman] dan [Muhammad bin Abdurrahman] dari [Musa bin Thalhah] dari [Ibnu Al Hautakiyah], ia berkata; Umar radliallahu 'anhu berkata; siapakah yang hadir bersama kami pada saat kejadian di Al Qahah? Ibnu Al Hautakiyah berkata; [Abu Dzar] berkata; Rasulullah shallallahu 'alaihi wasallam diberi seekor kelinci, kemudian seorang laki-laki yang membawanya berkata; sesungguhnya saya melihatnya bercucuran darah. Nabi shallallahu 'alaihi wasallam tidak memakannya kemudian beliau bersabda: \"Makanlah kalian.\" Kemudian seseorang berkata; saya berpuasa. Beliau bersabda: \"Apakah puasamu?\" Ia berkata; puasa tiga hari setiap bulan. Beliau bersabda: \"Dimana engkau dari hari bidh? Yaitu tiga belas, empat belas dan lima belas?"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 4312,
      "arabicNumber": 4312,
      "book": 42,
      "hadithInBook": 50,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ هِشَامٍ، - وَهُوَ ابْنُ زَيْدٍ - قَالَ سَمِعْتُ أَنَسًا، يَقُولُ أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَأَخَذْتُهَا فَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ فَذَبَحَهَا فَبَعَثَنِي بِفَخِذَيْهَا وَوَرِكَيْهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَبِلَهُ ‏.‏",
        "translations": {
          "en": "Anas said:\"We disturbed a rabbit in Marr Az-Zahran so I caught it, and brought it to Abu Talhah who slaughtered it, and sent me with its thighs and haunches to the Prophet and he accepted it",
          "fr": "Rapporté par Anas : Nous avons dérangé un lapin à Marr Az-Zahran, alors je l'ai attrapé et l'ai apporté à Abu Talhah qui l'a égorgé, puis il m'a envoyé avec ses cuisses et ses hanches vers le Prophète, et il les a acceptées",
          "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Hisyam yaitu Ibnu Zaid], ia berkata; saya mendengar [Anas] berkata; kami mengeluarkan kelinci dari tempatnya di Marrizh Zhahran, kemudian Saya mengambilnya, lalu saya bewa kepada Abu Thalhah dan ia menyembelihnya. Kemudian ia mengutusku membawa dua paha kelinci tersebut serta dua pangkal pahanya kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau menerimanya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 4313,
      "arabicNumber": 4313,
      "book": 42,
      "hadithInBook": 51,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَفْصٌ، عَنْ عَاصِمٍ، وَدَاوُدَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ صَفْوَانَ، قَالَ أَصَبْتُ أَرْنَبَيْنِ فَلَمْ أَجِدْ مَا أُذَكِّيهِمَا بِهِ فَذَكَّيْتُهُمَا بِمَرْوَةٍ فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَمَرَنِي بِأَكْلِهِمَا ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn Safwan said:\"I caught two rabbits but I could not find anything with which to slaughter then, so I slaughtered them with a sharp-edged stone. I asked the Prophet about that and he commanded me to eat them",
          "fr": "Rapporté par Ibn Safwan : J'ai attrapé deux lapins mais je n'ai rien trouvé pour les égorger, alors je les ai égorgés avec une pierre tranchante. J'ai interrogé le Prophète à ce sujet et il m'a ordonné de les manger",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hafsh] dari ['Ashim] dan [Daud] dari [Asy Sya'bi] dari [Ibnu Shafwan], ia berkata; saya mendapatkan dua kelinci dan tidak mendapatkan sesuatu untuk menyembelihnya, kemudian saya menyembelih menggunakan batu putih yang dibentuk seperti pisau. Lalu saya bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai hal tersebut dan beliau memerintahkanku untuk memakannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 4314,
      "arabicNumber": 4314,
      "book": 42,
      "hadithInBook": 52,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ سُئِلَ عَنِ الضَّبِّ فَقَالَ ‏ \"‏ لاَ آكُلُهُ وَلاَ أُحَرِّمُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that:the Messenger of Allah was asked about mastigures when he was on the Minbar and he said? \"I do not eat them, but I do not say that they are Haram",
          "fr": "Rapporté par Ibn 'Umar : Le Messager d'Allah a été interrogé au sujet des varans alors qu'il était sur le minbar et il a dit : \"Je n'en mange pas, mais je ne dis pas qu'ils sont interdits",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam sedang berada di atas mimbar ditanya mengenai Biawak. Kemudian beliau bersabda: \"Saya tidak memakannya dan tidak mengharamkannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 4315,
      "arabicNumber": 4315,
      "book": 42,
      "hadithInBook": 53,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا تَرَى فِي الضَّبِّ قَالَ ‏ \"‏ لَسْتُ بِآكِلِهِ وَلاَ مُحَرِّمِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that a man said:\"O Messenger of Allah what do you think about mastigures?\" He said: \"I do not eat them but I do not say that they arte Haram",
          "fr": "Rapporté par Ibn 'Umar : Un homme a dit : \"Ô Messager d'Allah, que penses-tu des varans ?\" Il a dit : \"Je n'en mange pas, mais je ne dis pas qu'ils sont interdits",
          "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dan [Abdullah bin Dinar] dari [Ibnu Umar] bahwa seorang laki-laki berkata; wahai Rasulullah, bagaimana pendapat anda mengenai biawak? Beliau bersabda: \"Saya tidak memakannya dan tidak mengharamkannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 4316,
      "arabicNumber": 4316,
      "book": 42,
      "hadithInBook": 54,
      "text": {
        "arabic": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، عَنْ مُحَمَّدِ بْنِ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، قَالَ أَخْبَرَنِي الزُّهْرِيُّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِضَبٍّ مَشْوِيٍّ فَقُرِّبَ إِلَيْهِ فَأَهْوَى إِلَيْهِ بِيَدِهِ لِيَأْكُلَ مِنْهُ قَالَ لَهُ مَنْ حَضَرَ يَا رَسُولَ اللَّهِ إِنَّهُ لَحْمُ ضَبٍّ ‏.‏ فَرَفَعَ يَدَهُ عَنْهُ فَقَالَ لَهُ خَالِدُ بْنُ الْوَلِيدِ يَا رَسُولَ اللَّهِ أَحَرَامٌ الضَّبُّ قَالَ ‏ \"‏ لاَ وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ فَأَهْوَى خَالِدٌ إِلَى الضَّبِّ فَأَكَلَ مِنْهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏",
        "translations": {
          "en": "It was narrated from Khalid bin Al-Walid that:A grilled mastigure was brought to the Messenger of Allah and was placed near to him. He reached out his hand to eat it, and someone who was present said: \"O Messenger of Allah, it is the meat of a mastigure.\" He withdrew his hand and Khalid bin Al-Walid said to him: \"O Messenger of Allah, is mastigure Haram?\" He said: \"No, but it is not found in the land of my people, and I find it distasteful.\" He said: \"Then Khalid bent over the mastigure and ate some of it, and the Messenger of Allah was looking at him",
          "fr": "Rapporté par Khalid bin Al-Walid : Un varan grillé a été apporté au Messager d'Allah et placé près de lui. Il a tendu la main pour en manger, et quelqu'un a dit : \"Ô Messager d'Allah, c'est de la viande de varan.\" Il a retiré sa main et Khalid bin Al-Walid lui a dit : \"Ô Messager d'Allah, est-ce que le varan est interdit ?\" Il a répondu : \"Non, mais on n'en trouve pas dans la région de mon peuple, et je n'aime pas cela.\" Alors Khalid s'est penché sur le varan et en a mangé, et le Messager d'Allah le regardait",
          "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid] dari [Muhammad bin Harb] dari [Az Zubaidi], ia berkata; telah mengabarkan kepadaku [Az Zuhri] dari [Abu Umamah bin Sahl] dari [Abdullah bin 'Abbas] dari [Khalid bin Al Walid] bahwa Rasulullah shallallahu 'alaihi wasallam diberi biawak bakar kemudian didekatkan kepadanya, kemudian beliau mengulurkan tangannya untuk makan sebagian darinya. Orang yang hadir berkata; wahai Rasulullah, sesungguhnya itu adalah daging biawak. Kemudian beliau mengangkat tangannya, kemudian Khalid bin Al Walid berkata; wahai Rasulullah, apakah biawak itu haram? Beliau bersabda: \"Tidak, akan tetapi itu tidak ada di negeri kaumku Sehingga saya dapati diriku tidak menyukainya.\" Kemudian Khalid mengulurkan tangannya ke biawak tersebut dan memakan sebagian darinya, sedang Rasulullah shallallahu 'alaihi wasallam melihat"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 4317,
      "arabicNumber": 4317,
      "book": 42,
      "hadithInBook": 55,
      "text": {
        "arabic": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ بِنْتِ الْحَارِثِ - وَهِيَ خَالَتُهُ - فَقُدِّمَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَحْمُ ضَبٍّ - وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَأْكُلُ شَيْئًا حَتَّى يَعْلَمَ مَا هُوَ - فَقَالَ بَعْضُ النِّسْوَةِ أَلاَ تُخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا يَأْكُلُ فَأَخْبَرَتْهُ أَنَّهُ لَحْمُ ضَبٍّ فَتَرَكَهُ قَالَ خَالِدٌ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَحَرَامٌ هُوَ قَالَ ‏ \"‏ لاَ وَلَكِنَّهُ طَعَامٌ لَيْسَ فِي أَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ إِلَىَّ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏ وَحَدَّثَهُ ابْنُ الأَصَمِّ عَنْ مَيْمُونَةَ وَكَانَ فِي حَجْرِهَا ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn ' Abbas that:Khalid bin Al-Walid said that he entered upon Maimunah bint Al-Harith, who was his maternal aunt, with the Messenger of Allah, and some meat of a mastigure was offered to the Messenger of Allah The Messenger of Allah would not eat anything until he knew what it was. One of the women said: \"Why don't you tell the Messenger of Allah what he is eating?\" So she told him that it was the meat of a mastigure, and he stopped eating. Khalid said: \"I asked the Messenger of Allah 'Is it Haram?' He said: \"No but it is a food that is no",
          "fr": "Khalid ibn al-Walîd a rapporté : Je suis entré avec le Messager d’Allah ﷺ chez Maymûnah bint al-Hârith, qui était ma tante maternelle. On servit au Messager d’Allah ﷺ de la viande de ḍabb (mastigure). Le Messager d’Allah ﷺ ne mangeait jamais une nourriture avant de savoir ce que c’était. Une des femmes présentes dit : « Pourquoi ne dis-tu pas au Messager d’Allah ce qu’il est en train de manger ? » Alors elle lui dit que c’était de la viande de mastigure, et il cessa de manger. Je demandai au Messager d’Allah ﷺ : « Est-ce que c’est harâm (interdit) ? » Il répondit : « Non. Mais c’est une nourriture qui n’est pas connue dans le pays de mon peuple, et je n’en aime pas le goût. » Alors, je l’ai rapprochée de moi et je l’ai mangée, tandis que le Messager d’Allah ﷺ me regardait. Et Ibn al-Asamm a aussi rapporté ce hadith d’après Maymûnah, alors qu’il se trouvait dans son appartement",
          "id": "Telah mengabarkan kepada kami [Abu Daud], ia berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Ayahku] dari [Shalih] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl] dari [Ibnu Abbas] bahwa ia telah mengabarkan kepadanya bahwa [Khalid bin Al Walid] telah mengabarkan kepadanya bahwa ia bersama Rasulullah shallallahu 'alaihi wasallam menemui Maimunah binti Al Harits dan ia adalah bibi Khalid. Kemudian dipersembahkan kepada Rasulullah shallallahu 'alaihi wasallam daging biawak, dan Rasulullah shallallahu 'alaihi wasallam tidak memakan sedikitpunn hingga beliau mengetahui apakah itu. Kemudian sebagian isteri mengatakan; tidakkah kalian mengabarkan kepada Rasulullah shallallahu 'alaihi wasallam apa yang beliau makan? Kemudian Maimunah mengabarkan kepadanya bahwa itu adalah daging biawak. Lalu beliau meninggalkannya, Khalid berkata; saya telah bertanya kepada Rasulullah shallallahu 'alaihi wasallam; apakah daging biawak itu haram? Maka beliau bersabda: \"Tidak, akan tetapi itu adalah makanan yang tidak ada di negeri kaumku sehingga saya dapati diriku tidak menyukainya. Khalid berkata; kemudian saya menariknya kepadaku dan memakannya dan Rasulullah shallallahu 'alaihi wasallam melihat. Dan hadits tersebut telah diriwayatkan Ibnu Al Asham dari Maimunah dan ia adalah orang yang berada dalam asuhannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 4318,
      "arabicNumber": 4318,
      "book": 42,
      "hadithInBook": 56,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَهْدَتْ خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَقِطًا وَسَمْنًا وَأَضُبًّا فَأَكَلَ مِنَ الأَقِطِ وَالسَّمْنِ وَتَرَكَ الأَضُبَّ تَقَذُّرًا وَأُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn 'Abbas said:\"My maternal aunt gave some cottage cheese, cooking fat, and mastigures to the Messenger of Allah He ate some of the cottage cheese and cooking fat, and left the mastigures, as he found them distasteful. But they were eaten upon the table-spread of the Messenger of Allah and if they were Haram they would not have been eaten upon the table-spread of the Messenger of Allah and he would not have told others to eat them",
          "fr": "Rapporté par Ibn 'Abbas : Ma tante maternelle a offert du fromage frais, du gras cuit et des varans au Messager d'Allah. Il a mangé du fromage et du gras, mais il a laissé les varans car il n'aimait pas cela. Mais ils ont été mangés à la table du Messager d'Allah, et s'ils étaient interdits, ils n'auraient pas été consommés à sa table et il n'aurait pas dit aux autres d'en manger",
          "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas], ia berkata; bibiku telah menghadiahkan kepada Rasulullah shallallahu 'alaihi wasallam keju, mentega dan biawak. Kemudian beliau makan sebagian mentega serta keju dan meninggalkan biawak Karena merasa tidak senang. Dan daging tersebut dimakan dalam hidangan Rasulullah shallallahu 'alaihi wasallam, seandainya hal itu adalah haram maka tidak akan dimakan dalam hidangan Rasulullah shallallahu 'alaihi wasallam"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 4319,
      "arabicNumber": 4319,
      "book": 42,
      "hadithInBook": 57,
      "text": {
        "arabic": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ سُئِلَ عَنْ أَكْلِ الضِّبَابِ، فَقَالَ أَهْدَتْ أُمُّ حُفَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا فَأَكَلَ مِنَ السَّمْنِ وَالأَقِطِ وَتَرَكَ الضِّبَابَ تَقَذُّرًا لَهُنَّ فَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ أَمَرَ بِأَكْلِهِنَّ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that:he was asked about eating mastigures. He said: \"Umm Hufaid gave some cooking fat, cottage cheese, and mastigures to the Messenger of Allah and the ate some of the cooking fat and cottage cheese, but he did not eat the mastigures because he found them distasteful. If they were Haram they would not have been eaten at the table-spread of the Messenger of Allah and the would not have told others to eat them",
          "fr": "Rapporté par Ibn 'Abbas : On lui a demandé s'il était permis de manger des varans. Il a dit : \"Umm Hufaid a offert du gras, du fromage et des varans au Messager d'Allah, et il a mangé du gras et du fromage, mais il n'a pas mangé les varans car il n'aimait pas cela. S'ils étaient interdits, ils n'auraient pas été mangés à la table du Messager d'Allah et il n'aurait pas dit aux autres d'en manger",
          "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah memberitakan kepada kami [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa ia ditanya mengenai makan biawak, kemudian berkata; Ummu Hufaid telah menghadiahkan kepada Rasulullah shallallahu 'alaihi wasallam mentega, keju dan biawak, kemudian beliau makan sebagian dari mentega dan keju dan meninggalkan biawak, karena merasa tidak senang. Seandainya hal itu adalah haram maka tidak akan dimakan pada hidangan Rasulullah shallallahu 'alaihi wasallam dan tidak memerintahkan untuk memakannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 4320,
      "arabicNumber": 4320,
      "book": 42,
      "hadithInBook": 58,
      "text": {
        "arabic": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ الْبَلْخِيُّ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، سَلاَّمُ بْنُ سُلَيْمٍ عَنْ حُصَيْنٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ ثَابِتِ بْنِ يَزِيدَ الأَنْصَارِيِّ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَنَزَلْنَا مَنْزِلاً فَأَصَابَ النَّاسُ ضِبَابًا فَأَخَذْتُ ضَبًّا فَشَوَيْتُهُ ثُمَّ أَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَأَخَذَ عُودًا يَعُدُّ بِهِ أَصَابِعَهُ ثُمَّ قَالَ ‏ \"‏ إِنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ مُسِخَتْ دَوَابَّ فِي الأَرْضِ وَإِنِّي لاَ أَدْرِي أَىُّ الدَّوَابِّ هِيَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ قَدْ أَكَلُوا مِنْهَا - قَالَ - فَمَا أَمَرَ بِأَكْلِهَا وَلاَ نَهَى ‏.‏",
        "translations": {
          "en": "It was narrated that Thabit bin Yazid Al-Ansari said:\"We were with the Prophet on a journey. We stopped to camp and the people caught some mastigures. I took a mastigure and grilled it, and brought it to the Prophet. He took a palm stalk, and started counting his fingers with it, and said: 'A nation from among the children of Israel was turned into beasts of the Earth, and I do not know what kind of animals they were, I said: 'O Messenger of Allah, the people have eaten some of them.' He did not tell them to eat it, and he did not forbid them from eating it",
          "fr": "Rapporté par Thabit bin Yazid Al-Ansari : Nous étions avec le Prophète lors d'un voyage. Nous avons fait une halte et les gens ont attrapé des varans. J'ai pris un varan, je l'ai grillé et je l'ai apporté au Prophète. Il a pris un bâton de palmier, a commencé à compter ses doigts avec, et a dit : \"Une nation parmi les enfants d'Israël a été transformée en bêtes de la terre, et je ne sais pas de quels animaux il s'agissait.\" J'ai dit : \"Ô Messager d'Allah, les gens en ont mangé.\" Il ne leur a pas dit d'en manger, et il ne leur a pas interdit non plus",
          "id": "Telah mengabarkan kepada kami [Sulaiman bin Manshur Al Balkhi], ia berkata; telah menceritakan kepada kami [Abu Al Ahwash Sallam bin Sulaim] dari [Hushain] dari [Zaid bin Wahb] dari [Tsabit bin Yazid Al Anshari] ia berkata; kami bersama Rasulullah shallallahu 'alaihi wasallam pada suatu safar, lalu kami singgah disebuah rumah, lalu orang-orang menemukan beberapa biawak, lalu aku mengambil seekor dan membakarnya kemudian menyuguhkannya kepada Nabi shallallahu 'alaihi wasallam, lalu beliau mengambil ranting dan menghitung jari-jarinya dengannya dan bersabda: \"Sungguh sebuah umat dari Bani Israil telah dirubah menjadi hewan melata dibumi, dan aku tidak tahu hewan apakah itu, \" aku berkata; wahai Rasulullah sesungguhnya orang-orang telah memakannya. Tsabit berkata; maka beliau tidak menyuruh untuk memakannya dan tidak melarangnya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 4321,
      "arabicNumber": 4321,
      "book": 42,
      "hadithInBook": 59,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، يُحَدِّثُ عَنْ ثَابِتِ بْنِ وَدِيعَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِضَبٍّ فَجَعَلَ يَنْظُرُ إِلَيْهِ وَيُقَلِّبُهُ وَقَالَ ‏ \"‏ إِنَّ أُمَّةً مُسِخَتْ لاَ يُدْرَى مَا فَعَلَتْ وَإِنِّي لاَ أَدْرِي لَعَلَّ هَذَا مِنْهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Thabit bin Wadi ah said:\"A man brought a mastigure to the Messenger of Allah and he started looking at it, and turning it over. He said: 'A nation was transformed, it is not known what they did, and I do not know if this is one of them",
          "fr": "Rapporté par Thabit bin Wadi'ah : Un homme a apporté un varan au Messager d'Allah et il a commencé à le regarder et à le tourner. Il a dit : \"Une nation a été transformée, on ne sait pas ce qu'ils sont devenus, et je ne sais pas si celui-ci en fait partie",
          "id": "Telah mengabarkan kepada kami ['Amr bin Yazid], ia berkata; telah menceritakan kepada kami [Bahz bin Asad], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepadaku ['Adi bin Tsabit], ia berkata; saya mendengar [Zaid bin Wahb] menceritakan dari [Tsabit bin Wadi'ah], ia berkata; telah datang seorang laki-laki kepada Rasulullah shallallahu 'alaihi wasallam membawa seekor biawak kemudian beliau melihatnya dan membaliknya serta bersabda: \"Sesungguhnya sebuah umat telah dirubah bentuknya, tidak diketahui apa yang mereka lakukan dan saya tidak tahu barangkali ini sebagian dari mereka"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 4322,
      "arabicNumber": 4322,
      "book": 42,
      "hadithInBook": 60,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنْ ثَابِتِ بْنِ وَدِيعَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم بِضَبٍّ فَقَالَ ‏ \"‏ إِنَّ أُمَّةً مُسِخَتْ وَاللَّهُ أَعْلَمُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from al-Bara bin Azib, from Thabnit bin Wadiah, that:a man brought a mastigure to the Prophet and he said? \"A nation was transformed, and Allah knows best",
          "fr": "Rapporté par Al-Bara bin Azib, de Thabit bin Wadi'ah : Un homme a apporté un varan au Prophète et il a dit : \"Une nation a été transformée, et Allah sait mieux",
          "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abdurrahman], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Zaid bin Wahb] dari [Al Bar` bin 'Azib] dari [Tsabit bin Wadi'ah] bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam membawa biawak, kemudian beliau bersabda: \"Sesungguhnya sebuah umat telah dirubah bentuknya.\" Wallahu a'lam"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 4323,
      "arabicNumber": 4323,
      "book": 42,
      "hadithInBook": 61,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنِ ابْنِ أَبِي عَمَّارٍ، قَالَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنِ الضَّبُعِ، فَأَمَرَنِي بِأَكْلِهَا فَقُلْتُ أَصَيْدٌ هِيَ قَالَ نَعَمْ ‏.‏ قُلْتُ أَسَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏",
        "translations": {
          "en": "It was narrated that Ibn Abi 'Ammar said:\"I asked Jabir bin 'Abdullah about hyenas and he told me to eat them. I said: 'Are they game (that can be hunted)? He said: 'Yes,' I said: 'Did you hear that from the Messenger of Allah?' He said: 'Yes",
          "fr": "Rapporté par Ibn Abi 'Ammar : J'ai demandé à Jabir bin 'Abdullah au sujet des hyènes et il m'a dit d'en manger. J'ai demandé : \"Est-ce un gibier que l'on peut chasser ?\" Il a répondu : \"Oui.\" J'ai dit : \"As-tu entendu cela du Messager d'Allah ?\" Il a dit : \"Oui",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; telah menceritakan kepadaku [Ibnu Juraij] dari [Abdullah bin 'Ubaid bin Umair] dari [Ibnu Abu 'Ammar], ia berkata; saya bertanya kepada [Jabir bin Abdullah] mengenai biawak, kemudian ia memerintahku untuk memakannya. Kemudian saya katakan; apakah itu merupakan hewan buruan? Ia berkata; ya. Saya katakan; apakah engkau mendengarnya dari Rasulullah shallallahu 'alaihi wasallam? Maka ia berkata; ya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 4324,
      "arabicNumber": 4324,
      "book": 42,
      "hadithInBook": 62,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ ذِي نَابٍ مِنَ السِّبَاعِ فَأَكْلُهُ حَرَامٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah that the prophet said:'Every predator possessing fangs is forbidden to eat",
          "fr": "Rapporté par Abu Hurairah : Le Prophète a dit : \"Tout animal prédateur qui a des crocs est interdit à la consommation",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur], ia berkata; telah menceritakan kepada kami [Abdurrahman], ia berkata; telah menceritakan kepada kami [Malik] dari [Isma'il bin Abu Hakim] dari ['Ubaidah bin Sufyan] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Semua yang memiliki taring dari binatan buas haram dimakan"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 4325,
      "arabicNumber": 4325,
      "book": 42,
      "hadithInBook": 63,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Tha labah Al-Khushani that:the Prophet forbade eating any predator that has fangs",
          "fr": "Rapporté par Abu Tha'labah Al-Khushani : Le Prophète a interdit de manger tout animal prédateur qui a des crocs",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dan [Muhammad Al Mutsanna] dari [Sufyan] dari [Az Zuhri] dari [Abu Idris] dari [Abu Tsa'labah Al Khusyani] bahwa Nabi shallallahu 'alaihi wasallam melarang dari memakan setiap yang memiliki taring dari binatang buas"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 4326,
      "arabicNumber": 4326,
      "book": 42,
      "hadithInBook": 64,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدٍ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي ثَعْلَبَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَحِلُّ النُّهْبَى وَلاَ يَحِلُّ مِنَ السِّبَاعِ كُلُّ ذِي نَابٍ وَلاَ تَحِلُّ الْمُجْثَّمَةُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Abu Tha'labah said:\"The Messenger of Allah said: 'Wealth taken by force is (not permissible), any predator that has fangs is not permissible, and any animal used for target practice is not permissible",
          "fr": "Rapporté par Abu Tha'labah : Le Messager d'Allah a dit : \"La richesse prise par la force n'est pas permise, tout animal prédateur qui a des crocs n'est pas permis, et tout animal utilisé comme cible n'est pas permis",
          "id": "Telah mengabarkan kepada kami ['Amr bin Utsman], ia berkata; telah menceritakan kepada kami [Baqiyah] dari [Bahir] dari [Khalid] dari [Jubair bin Nufair] dari [Abu Tsa'labah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal perampasan dan tidak halal setiap yang memiliki taring dari binatang buas serta menjadikan binatang sebagai sasaran memanah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 4327,
      "arabicNumber": 4327,
      "book": 42,
      "hadithInBook": 65,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، - وَهُوَ ابْنُ دِينَارٍ - عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرٍ، قَالَ نَهَى - وَذَكَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم - يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ وَأَذِنَ فِي الْخَيْلِ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:\"On the Day of Khaibar, the Messenger of Allah forbade the flesh of donkeys but he permitted the flesh of horses",
          "fr": "Rapporté par Jabir : Le jour de Khaybar, le Messager d'Allah a interdit la viande d'ânes mais il a permis la viande de chevaux",
          "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Ahmad bin 'Abdah] mereka berakata; telah menceritakan kepada kami [Hammad] dari ['Amr yaitu Ibnu Dinar] dari [Muhammad bin Ali] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam pada saat perang Khaibar melarang makan daging keledai dan mengizinkan untuk makan daging kuda"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 65
      }
    },
    {
      "hadithNumber": 4328,
      "arabicNumber": 4328,
      "book": 42,
      "hadithInBook": 66,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، قَالَ أَطْعَمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم لُحُومَ الْخَيْلِ وَنَهَانَا عَنْ لُحُومِ الْحُمُرِ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:\"The Messenger of Allah allowed us to eat the flesh of horses but he forbade the flesh of donkeys",
          "fr": "Rapporté par Jabir : Le Messager d'Allah nous a permis de manger de la viande de cheval mais il a interdit la viande d'âne",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam memberi kami makan daging kuda dan melarang kami dari daging keledai"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 4329,
      "arabicNumber": 4329,
      "book": 42,
      "hadithInBook": 67,
      "text": {
        "arabic": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ، - وَهُوَ ابْنُ وَاقِدٍ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، وَعَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ، وَعَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ أَطْعَمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ لُحُومَ الْخَيْلِ وَنَهَانَا عَنْ لُحُومِ الْحُمُرِ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:\" On the Day of Khaibar, the Messenger of Allah (ﷺ) allowed us to eat the flesh of horses but he forbade us from the flesh of donkeys",
          "fr": "Rapporté par Jabir : Le jour de Khaybar, le Messager d'Allah (ﷺ) nous a permis de manger de la viande de cheval mais il nous a interdit la viande d'âne",
          "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits], ia berkata; telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Al Husain yaitu Ibnu Waqid] dari [Abu Az Zubair] dari [Jabir], dan ['Amr bin Dinar] dari [Jabir] dan [Ibnu Abu Najih] dari ['Atho`] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam memberi makan kami pada saat Perang Khaibar daging kuda dan melarang kami dari daging keledai"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 67
      }
    },
    {
      "hadithNumber": 4330,
      "arabicNumber": 4330,
      "book": 42,
      "hadithInBook": 68,
      "text": {
        "arabic": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، - وَهُوَ ابْنُ عَمْرٍو - قَالَ حَدَّثَنَا عَبْدُ الْكَرِيمِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَأْكُلُ لُحُومَ الْخَيْلِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:\"We used to eat horse meat during the time of the Messenger of Allah",
          "fr": "Rapporté par Jabir : Nous mangions de la viande de cheval à l'époque du Messager d'Allah",
          "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami ['Ubaidullah yaitu Ibnu 'Amr], ia berkata; telah menceritakan kepada kami [Abdul Karim] dari ['Atho`] dari [Jabir], ia berkata; kami pernah makan daging kuda pada zaman Rasulullah shallallahu 'alaihi wasallam"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 68
      }
    },
    {
      "hadithNumber": 4331,
      "arabicNumber": 4331,
      "book": 42,
      "hadithInBook": 69,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ، عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَحِلُّ أَكْلُ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Khalid bin al-walid that he heard the Messe4nger of Allah say:\"It is not permissible to eat the flesh of horses, mules or donkeys",
          "fr": "Rapporté par Khalid ibn al-Walid : Il a entendu le Messager d’Allah dire : « Il n’est pas permis de manger la viande des chevaux, des mulets ou des ânes. »",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Baqiyah bin Al Walid], ia berkata; telah menceritakan kepadaku [Tsaur bin Yazid] dari [Shalih bin Yahya bin Al Miqdam bin Ma'dikarib] dari [ayahnya] dari [kakeknya] dari [Khalid bin Walid] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal makan daging kuda, baghal dan keledai"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 4332,
      "arabicNumber": 4332,
      "book": 42,
      "hadithInBook": 70,
      "text": {
        "arabic": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ وَكُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
        "translations": {
          "en": "It was narrated from Khalid bin Al-Walid that:the Messenger of Allah forbade eating the flesh of horses, mules and donkeys, and any predator that has fangs",
          "fr": "Rapporté par Khalid ibn al-Walid : Le Messager d’Allah a interdit de manger la viande des chevaux, des mulets, des ânes, ainsi que celle de tout animal prédateur ayant des crocs",
          "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Baqiyah] dari [Tsaur bin Yazid] dari [Shalih bin Yahya bin Al Miqdam bin Ma'dikarib] dari [ayahnya] dari [kakeknya] dari [Khalid bin Al Walid] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari memakan daging kuda, baghal dan keledai serta segala yang memiliki taring dari binatang buas"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 70
      }
    },
    {
      "hadithNumber": 4333,
      "arabicNumber": 4333,
      "book": 42,
      "hadithInBook": 71,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَأْكُلُ لُحُومَ الْخَيْلِ ‏.‏ قُلْتُ الْبِغَالَ قَالَ لاَ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Ata, that Jabir said:\"we used to eat horseflesh. \": I said: \"And mules?\" He said: \"No",
          "fr": "Rapporté par ‘Ata, d’après Jabir : « Nous mangions de la viande de cheval. » J’ai demandé : « Et les mulets ? » Il a répondu : « Non. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Abdurrahman] dari [Sufyan] dari [Abdul Karim] dari ['Atho`] dari [Jabir] ia berkata; kami makan daging kuda. Saya berkata bagaimana dengan baghal? ia menjawab; tidak"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 71
      }
    },
    {
      "hadithNumber": 4334,
      "arabicNumber": 4334,
      "book": 42,
      "hadithInBook": 72,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ، وَعَبْدِ اللَّهِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِمَا، قَالَ قَالَ عَلِيٌّ لاِبْنِ عَبَّاسٍ رضى الله عنهما إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ نِكَاحِ الْمُتْعَةِ وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ يَوْمَ خَيْبَرَ ‏.‏",
        "translations": {
          "en": "It was narrated from Al- Hasan bin Muhammad, and 'Abdullah bin Muhammad that their father said:\"Ali said to Ibn'Abbas, may Allah be please with them both: The Prophet forbade Mut'ah marriage, and the flesh of domesticated donkeys on the Day of Khaibar",
          "fr": "Rapporté par Al-Hasan ibn Muhammad et ‘Abdullah ibn Muhammad, d’après leur père : Leur père a dit : « ‘Ali a dit à Ibn ‘Abbas, رضي الله عنهما : Le Prophète a interdit le mariage temporaire (Mut’ah) et la viande des ânes domestiques le jour de Khaybar. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits dari [Sufyan] dari [Az Zuhri] dari [Al Hasan bin Muhammad] dan [Abdullah bin Muhammad] dari [ayah mereka], ia berkata; [Ali] berkata kepada Ibnu Abbas; sesungguhnya Nabi shallallahu 'alaihi wasallam melarang dari nikah mut'ah dan daging keledai jinak pada saat perang Khaibar"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 72
      }
    },
    {
      "hadithNumber": 4335,
      "arabicNumber": 4335,
      "book": 42,
      "hadithInBook": 73,
      "text": {
        "arabic": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، وَمَالِكٌ، وَأُسَامَةُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدٍ عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏",
        "translations": {
          "en": "It was narrated from Al-Hasan bin Muhammad, and 'Abdullah bin Muhammad, from their father, that 'Ali bin Abi Talib may Allah be please with him, said:\"The Messenger of Allah forbade Mut'ah and the flesh of domesticated donkeys on the Day of Khaibar",
          "fr": "Rapporté par Al-Hasan ibn Muhammad et ‘Abdullah ibn Muhammad, d’après leur père, que ‘Ali ibn Abi Talib, رضي الله عنه, a dit : « Le Messager d’Allah a interdit le Mut’ah et la viande des ânes domestiques le jour de Khaybar. »",
          "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud], ia berkata; telah menceritakan kepada kami [Abdullah bin Wahb], ia berkata; telah mengabarkan kepadaku [Yunus] dan [Malik] serta [Usamah] dari [Ibnu Syihab] dari [Al Hasan] serta [Abdullah] dua anak Muhammad dari [ayah mereka] dari [Ali bin Abu Thalib] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari menikahi wanita secara mut'ah pada saat perang Khaibar dan dari daging keledai jinak"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 73
      }
    },
    {
      "hadithNumber": 4336,
      "arabicNumber": 4336,
      "book": 42,
      "hadithInBook": 74,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ، ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحُمُرِ الأَهْلِيَّةِ يَوْمَ خَيْبَرَ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Umar that:the Messenger of Allah forbade (the flesh of) domesticated donkeys on the Day of Khaibar",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah a interdit (la consommation de) la viande des ânes domestiques le jour de Khaybar",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Muhammad bin Bisyr], ia berkata; telah memberitakan kepada kami ['Ubaidullah], telah menceritakan dan memberitakan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari keledai jinak pada saat perang Khaibar. telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Muhammad bin 'Ubaid], ia berkata; telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam seperti hadits tersebut namun ia tidak menyebutkan Khaibar"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 74
      }
    },
    {
      "hadithNumber": 4337,
      "arabicNumber": 4337,
      "book": 42,
      "hadithInBook": 75,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ وَلَمْ يَقُلْ خَيْبَرَ ‏.‏",
        "translations": {
          "en": "Narrated from Ibn 'Umar:A similar report was narrated from Ibn 'Umar, but he did not mention Khaibar",
          "fr": "Rapporté par Ibn ‘Umar : Un récit similaire a été rapporté de la part d’Ibn ‘Umar, mais il n’a pas mentionné Khaybar"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "-"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 75
      },
      "narrator": {
        "en": "from Ibn 'Umar"
      }
    },
    {
      "hadithNumber": 4338,
      "arabicNumber": 4338,
      "book": 42,
      "hadithInBook": 76,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ نَضِيجًا وَنِيئًا ‏.‏",
        "translations": {
          "en": "It was narrated that Al-Bara said:\"On the Day of Khaibar, the Messenger of Allah forbade the flesh of domesticated donkeys, cooked or raw",
          "fr": "Rapporté par Al-Bara : « Le jour de Khaybar, le Messager d’Allah a interdit la viande des ânes domestiques, qu’elle soit cuite ou crue. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Abdur Razzaq], ia berkata; telah menceritakan kepada kami [Ma'mar] dari ['Ashim] dari [Asy Sya'bi] dari [Al Barra`], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang pada saat perang Khaibar dari daging keledai jinak baik sudah matang atau masih mentah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 76
      }
    },
    {
      "hadithNumber": 4339,
      "arabicNumber": 4339,
      "book": 42,
      "hadithInBook": 77,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ أَصَبْنَا يَوْمَ خَيْبَرَ حُمُرًا خَارِجًا مِنَ الْقَرْيَةِ فَطَبَخْنَاهَا فَنَادَى مُنَادِي النَّبِيِّ صلى الله عليه وسلم إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حَرَّمَ لُحُومَ الْحُمُرِ فَأَكْفِئُوا الْقُدُورَ بِمَا فِيهَا ‏.‏ فَأَكْفَأْنَاهَا ‏.‏",
        "translations": {
          "en": "It was narrated that 'Abdullah bin Awfa said:\"On the Day of khaiber we caught some donkeys outside the village and we cooked them. Then the caller of the Prophet called out: 'The Messenger of Allah has forbidden the flesh of donkeys, so turn over your cooking pots with whatever is in them.' So we turned them over",
          "fr": "Rapporté par ‘Abdullah ibn Awfa : « Le jour de Khaybar, nous avons attrapé des ânes à l’extérieur du village et nous les avons cuisinés. Ensuite, le crieur du Prophète a annoncé : ‘Le Messager d’Allah a interdit la viande des ânes, alors renversez vos marmites avec ce qu’il y a dedans.’ Nous les avons donc renversées. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid Al Muqri`], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq Asy Syaibani] dari [Abdullah bin Abu Aufa], ia berkata; kami telah mendapat keledai yang keluar dari kampong pada saat perang Khaibar, kemudian kami memasaknya lalu seorang penyeru Nabi shallallahu 'alaihi wasallam menyeru; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah mengharamkan daging keledai maka baliklah kuali beserta dengan apa yang ada padanya. Maka kami membaliknya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 77
      }
    },
    {
      "hadithNumber": 4340,
      "arabicNumber": 4340,
      "book": 42,
      "hadithInBook": 78,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ صَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ فَخَرَجُوا إِلَيْنَا وَمَعَهُمُ الْمَسَاحِي فَلَمَّا رَأَوْنَا قَالُوا مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ وَرَجَعُوا إِلَى الْحِصْنِ يَسْعَوْنَ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَيْهِ ثُمَّ قَالَ ‏ \"‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏ ‏.‏ فَأَصَبْنَا فِيهَا حُمُرًا فَطَبَخْنَاهَا فَنَادَى مُنَادِي النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ يَنْهَاكُمْ عَنْ لُحُومِ الْحُمُرِ فَإِنَّهَا رِجْسٌ ‏.‏",
        "translations": {
          "en": "It was narrated that Anas said:\"The Messenger of Allah reached Khaibar in the morning, and they came out to us carrying their shovels. When they saw us they said: 'Muhammad and the army!' And they rushed back inot the fortress. The Messenger of Allah raised his hands, then he said: ' Allahu Akbar, Allahu Akbar, Khaibar is destroyed. Verily, when we descend in field of a people (i.e. near to them), evil will be the morning for those who had been warned! Acquired some donkeys there and we cooked the., Then the caller of the Prophet called out: 'Allah and His Messenger forbid you to eat the flesh of donkeys, for it is an abomination",
          "fr": "Rapporté par Anas : « Le Messager d’Allah est arrivé à Khaybar le matin, et ils sont sortis vers nous en portant leurs pelles. Quand ils nous ont vus, ils ont dit : ‘Muhammad et l’armée !’ et ils se sont précipités dans la forteresse. Le Messager d’Allah a levé les mains, puis il a dit : ‘Allahu Akbar, Allahu Akbar, Khaybar est détruite. En vérité, quand nous descendons sur le territoire d’un peuple (c’est-à-dire près d’eux), quel mauvais matin pour ceux qui ont été avertis !’ Nous avons trouvé là-bas des ânes et nous les avons cuisinés. Ensuite, le crieur du Prophète a annoncé : ‘Allah et Son Messager vous interdisent de manger la viande des ânes, car c’est une abomination.’ »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Muhammad] dari [Anas], ia berkata; Rasulullah shallallahu 'alaihi wasallam menyerang Khaibar pada pagi hari kemudian mereka keluar kepada kami membawa sekop, kemudian tatkala melihat kami maka mereka mengatakan; Muhammad bersama dengan pasukan. Dan mereka kembali menuju benteng dengan setengah berlari. Kemudian Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya dan bersabda: \"Allahu akbar, Allahu akbar, Khaibar telah hancur. Sesungguhnya kami apabila turun turun dihalaman mereka, maka amat buruklah pagi hari yang dialami oleh orang-orang yang diperingatkan itu.\" Kemudian kami mendapatkan keledai lalu kami memasaknya. Kemudian penyeru Nabi shallallahu 'alaihi wasallam menyeru; sesungguhnya Allah 'azza wajalla dan RasulullahNya melarang kalian dari daging keledai sesungguhnya hal itu adalah najis"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 78
      }
    },
    {
      "hadithNumber": 4341,
      "arabicNumber": 4341,
      "book": 42,
      "hadithInBook": 79,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، أَنْبَأَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّهُ حَدَّثَهُمْ أَنَّهُمْ، غَزَوْا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ وَالنَّاسُ جِيَاعٌ فَوَجَدُوا فِيهَا حُمُرًا مِنْ حُمُرِ الإِنْسِ فَذَبَحَ النَّاسُ مِنْهَا فَحُدِّثَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فَأَذَّنَ فِي النَّاسِ ‏ \"‏ أَلاَ إِنَّ لُحُومَ الْحُمُرِ الإِنْسِ لاَ تَحِلُّ لِمَنْ يَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Tha''Aabah Al-Khushani that:they went on a military campaign with the Messenger of Allah to Khaibar, and the people were starving. They found some domesticated donkeys there, so the people slaughtered some of them. The Prophet was told about that, and he ordered 'Abdur-rahman bin 'Awf to announce to the people: \"The flesh of domesticated donkeys is not permissible for the one who testifies that I am the Messenger of Allah",
          "fr": "Rapporté par Abu Tha’labah Al-Khushani : Ils sont partis en expédition avec le Messager d’Allah à Khaybar, et les gens avaient faim. Ils ont trouvé des ânes domestiques, alors ils en ont abattu. Le Prophète en a été informé et il a ordonné à ‘Abdur-Rahman ibn ‘Awf d’annoncer aux gens : « La viande des ânes domestiques n’est pas permise à celui qui atteste que je suis le Messager d’Allah. »",
          "id": "Telah mengabarkan kepada kami ['Amr bin Utsman] telah memberitakan kepada kami [Baqiyah] dari [Bahir] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] dari [Abu Tsa'labah Al Khusyani] bahwa ia menceritakan kepada mereka bahwa mereka berperang bersama Rasulullah shallallahu 'alaihi wasallam menuju Khaibar dan orang-orang dalam keadaan lapar. Kemudian mereka mendapatkan keledai jinak padanya, kemudian mereka menyembelih sebagiannya kemudian hal tersebut diceritakan kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau memerintahkan Abdurrahman bin 'Auf kemudian ia mengumumkan diantara manusia; ketahuilah bahwa daging keledai jinak, keledai tersebut tidak halal bagi orang yang bersaksi bahwa aku adalah Rasulullah"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Lighairihi"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 79
      }
    },
    {
      "hadithNumber": 4342,
      "arabicNumber": 4342,
      "book": 42,
      "hadithInBook": 80,
      "text": {
        "arabic": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، عَنْ بَقِيَّةَ، قَالَ حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Tha'labah Al-khushani that:the Messenger of Allah forbade eating any -predator with fangs, and the flesh of domesticated donkeys",
          "fr": "Rapporté par Abu Tha’labah Al-Khushani : Le Messager d’Allah a interdit de manger tout prédateur ayant des crocs, ainsi que la viande des ânes domestiques",
          "id": "Telah mengabarkan kepada kami ['Amr bin Utsman] dari [Baqiyah], ia berkata; telah menceritakan kepadaku [Az Zubaidi] dari [Az Zuhri] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari memakan segala yang memiliki taring dari hewan buas dan dari daging keledai jinak"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 80
      }
    },
    {
      "hadithNumber": 4343,
      "arabicNumber": 4343,
      "book": 42,
      "hadithInBook": 81,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُفَضَّلُ، - هُوَ ابْنُ فَضَالَةَ - عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أَكَلْنَا يَوْمَ خَيْبَرَ لُحُومَ الْخَيْلِ وَالْوَحْشِ وَنَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنِ الْحِمَارِ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:\"On the Day of Khaibar we ate the flesh of horses, and onagers, but the Prophet forbade us (from eating) donkeys.\"(sahih)",
          "fr": "Rapporté par Jabir : « Le jour de Khaybar, nous avons mangé de la viande de cheval et d’onagre, mais le Prophète nous a interdit (de manger) les ânes. » (sahih)",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Mufadhdhal yaitu Ibnu Fadhalah] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], ia berkata; kami pada saat perang Khaibar makan daging kuda serta keledai liar, dan Nabi shallallahu 'alaihi wasallam melarang dari keledai"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 81
      }
    },
    {
      "hadithNumber": 4344,
      "arabicNumber": 4344,
      "book": 42,
      "hadithInBook": 82,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، - هُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عُمَيْرِ بْنِ سَلَمَةَ الضَّمْرِيِّ، قَالَ بَيْنَا نَحْنُ نَسِيرُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِبَعْضِ أَثَايَا الرَّوْحَاءِ وَهُمْ حُرُمٌ إِذَا حِمَارُ وَحْشٍ مَعْقُورٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعُوهُ فَيُوشِكُ صَاحِبُهُ أَنْ يَأْتِيَهُ ‏\"‏ ‏.‏ فَجَاءَ رَجُلٌ مِنْ بَهْزٍ هُوَ الَّذِي عَقَرَ الْحِمَارَ فَقَالَ يَا رَسُولَ اللَّهِ شَأْنَكُمْ هَذَا الْحِمَارُ ‏.‏ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ يُقَسِّمُهُ بَيْنَ النَّاسِ ‏.‏",
        "translations": {
          "en": "It was narrated that 'Umair bin Salamah Ad-Damri said:\"While we were traveling with the Prophet in part of Athaya Ar-Rawha and they were in Ihram, we saw a wounded onager, the Messenger of Allah said: \"Leave it, for soon the one who wounded it will come,' then a man from Bahz came, and he was the one who had wounded the onager. He said: 'O Messenger of Allah, it is up to you what you do with this onager,' The Messenger of Allah ordered Abu Bakr to distribute it among the people",
          "fr": "Rapporté par ‘Umair ibn Salamah Ad-Damri : « Pendant que nous voyagions avec le Prophète dans une partie d’Athaya Ar-Rawha et que certains étaient en état d’Ihram, nous avons vu un onagre blessé. Le Messager d’Allah a dit : ‘Laissez-le, car celui qui l’a blessé va bientôt arriver.’ Puis un homme de Bahz est venu, c’était lui qui avait blessé l’onagre. Il a dit : ‘Ô Messager d’Allah, c’est à toi de décider pour cet onagre.’ Le Messager d’Allah a ordonné à Abu Bakr de le répartir entre les gens. »",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Bakr yaitu Ibnu Mudhar] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim] dari [Isa bin Thalhah] dari ['Umair bin Salamah Adh Dhamri], ia berkata; ketika kami berjalan bersama Rasulullah shallallahu 'alaihi wasallam membawa sebagian tempat di Atsaya (tempat diantara dua tanah haram), dan mereka sedang beihram. Tiba-tiba terdapat keledai liar yang tersembelih, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pemiliknya akan datang kepadanya.\" Kemudian datanglah seorang laki-laki dari Bahz, ia adalah orang yang menyembelih keledai tersebut, kemudian Ia berkata; wahai Rasulullah, ambillah keledai ini. Lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan Abu Bakar untuk membaginya diantara manusia"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 82
      }
    },
    {
      "hadithNumber": 4345,
      "arabicNumber": 4345,
      "book": 42,
      "hadithInBook": 83,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَبِي أُنَيْسَةَ، عَنْ أَبِي حَازِمٍ، عَنِ ابْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ أَبِي قَتَادَةَ، قَالَ أَصَابَ حِمَارًا وَحْشِيًّا فَأَتَى بِهِ أَصْحَابَهُ وَهُمْ مُحْرِمُونَ وَهُوَ حَلاَلٌ فَأَكَلْنَا مِنْهُ فَقَالَ بَعْضُهُمْ لِبَعْضٍ لَوْ سَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْهُ ‏.‏ فَسَأَلْنَاهُ فَقَالَ ‏\"‏ قَدْ أَحْسَنْتُمْ ‏\"‏ ‏.‏ فَقَالَ لَنَا ‏\"‏ هَلْ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ قُلْنَا نَعَمْ ‏.‏ قَالَ ‏\"‏ فَاهْدُوا لَنَا ‏\"‏ ‏.‏ فَأَتَيْنَاهُ مِنْهُ فَأَكَلَ مِنْهُ وَهُوَ مُحْرِمٌ ‏.‏",
        "translations": {
          "en": "It was narrated that from Ibn Abi Qatadah, from Abu Qatadah, that:he caught an onager and brought it to his companion's who were in Ihram whereas he was not, and they ate from it. Then they said to one another: \"Let us ask the Messenger of Allah about it,\" So we asked him and he said:\" You did well\" Then he said to us: \"Do you have anything left of it?\" We said: \"Yes.\" He said: \"Give us some \"So we brought him some, and he ate from it, while he was in Ihram",
          "fr": "Rapporté par Ibn Abi Qatadah, d’après Abu Qatadah : Il a attrapé un onagre et l’a apporté à ses compagnons qui étaient en état d’Ihram, alors que lui ne l’était pas, et ils en ont mangé. Ensuite, ils se sont dit : « Demandons au Messager d’Allah à ce sujet. » Nous l’avons donc interrogé et il a dit : « Vous avez bien fait. » Puis il nous a demandé : « Est-ce qu’il vous en reste ? » Nous avons répondu : « Oui. » Il a dit : « Donnez-m’en un peu. » Nous lui en avons apporté, et il en a mangé alors qu’il était en état d’Ihram",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Wahb], ia berkata; telah menceritakan kepada kami [Muhammad bin Salamah], ia berkata; telah menceritakan kepadaku [Abu Abdurrahin], ia berkata; telah menceritakan kepadaku [Zaid bin Abu Unaisah] dari [Abu Hazim] dari [Ibnu Abu Qatadah] dari [ayahnya yaitu Abu Qatadah], bahwa Ia mendapatkan unta liar kemudian ia membawanya kepada para sahabatnya yang sedang berihram, sedangkan ia tidak berihram. Kemudian kami makan sebagian darinya. Sebagian mereka berkata kepada sebagian yang lain, sendainya kita bertanya kepada Rasulullah shallallahu 'alaihi wasallam, kemudian kami bertanya kepada beliau. Beliau bersabda: \"Kalian telah berbuat baik\", kemudian beliau bersabda kepada kami: \"Apakah kalian memiliki sebagian darinya?\" kami mengatakan; ya. Beliau bersabda: \"Berilah kami hadiah.\" Maka kami memberi sebagian darinya kepada beliau. Kemudian beliau memakan sebagiannya sedang beliau dalam keadaan berihram"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 83
      }
    },
    {
      "hadithNumber": 4346,
      "arabicNumber": 4346,
      "book": 42,
      "hadithInBook": 84,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ زَهْدَمٍ، أَنَّ أَبَا مُوسَى، أُتِيَ بِدَجَاجَةٍ فَتَنَحَّى رَجُلٌ مِنَ الْقَوْمِ فَقَالَ مَا شَأْنُكَ قَالَ إِنِّي رَأَيْتُهَا تَأْكُلُ شَيْئًا قَذِرْتُهُ فَحَلَفْتُ أَنْ لاَ آكُلَهُ ‏.‏ فَقَالَ أَبُو مُوسَى ادْنُ فَكُلْ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُهُ ‏.‏ وَأَمَرَهُ أَنْ يُكَفِّرَ عَنْ يَمِينِهِ ‏.‏",
        "translations": {
          "en": "It was narrated from Zahdam that:Some chicken was brought to Abu Musa and a man moved away from the people. He said: \"What is the matter with you?\" He said: \"I saw it eating something that I consider filthy, and I swore I would not eat it.\" Abu Musa said: \"Come and eat, for I saw the Messenger of Allah eating it.\" And he told him to offer an expiation for his vow (Kafarat Al-Yamin)",
          "fr": "Rapporté par Zahdam : On a apporté du poulet à Abu Musa et un homme s’est éloigné des gens. Il lui a demandé : « Qu’as-tu ? » Il a répondu : « Je l’ai vu manger quelque chose que je considère comme impur, et j’ai juré de ne pas en manger. » Abu Musa lui a dit : « Viens manger, car j’ai vu le Messager d’Allah en manger. » Et il lui a demandé de faire une expiation pour son serment (Kafarat Al-Yamin)",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Zahdam] bahwa Abu Musa diberi ayam kemudian Seseorang menjauh. Kemudian Abu Musa berkata; ada apa engkau? Ia berkata; sesungguhnya saya telah melihat memakan sesuatu yang tidak saya sukai, kemudian saya bersumpah untuk tidak memakannya. Kemudian [Abu Musa] berkata; mendekatlah dan makanlah sesungguhnya saya melihat Rasulullah shallallahu 'alaihi wasallam memakannya dan memerintahkannya. Dan Abu Musa memerintahkannya agar menebus sumpahnya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 84
      }
    },
    {
      "hadithNumber": 4347,
      "arabicNumber": 4347,
      "book": 42,
      "hadithInBook": 85,
      "text": {
        "arabic": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنِ الْقَاسِمِ التَّمِيمِيِّ، عَنْ زَهْدَمٍ الْجَرْمِيِّ، قَالَ كُنَّا عِنْدَ أَبِي مُوسَى فَقُدِّمَ طَعَامُهُ وَقُدِّمَ فِي طَعَامِهِ لَحْمُ دَجَاجٍ وَفِي الْقَوْمِ رَجُلٌ مِنْ بَنِي تَيْمِ اللَّهِ أَحْمَرُ كَأَنَّهُ مَوْلًى فَلَمْ يَدْنُ فَقَالَ لَهُ أَبُو مُوسَى ادْنُ فَإِنِّي قَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ مِنْهُ ‏.‏",
        "translations": {
          "en": "It was narrated that Zahadam Al-Jarmi said:\"We were with Abu Musa and His food was brought, including chicken. Among the people there was a man from banu Taimullah who had reddish complexion, as if he were a freed slave. He did not come close and Abu Musa said: \"Come (and eat) for I saw the Messenger of All eating it",
          "fr": "Rapporté par Zahdam Al-Jarmi : « Nous étions avec Abu Musa et on a apporté son repas, dont du poulet. Parmi les gens, il y avait un homme de Banu Taimullah, à la peau rougeâtre, comme s’il avait été affranchi. Il ne s’est pas approché, et Abu Musa lui a dit : ‘Viens (manger), car j’ai vu le Messager d’Allah en manger.’ »",
          "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Al Qasim At Taimi] dari [Zahdam Al Jarmi], ia berkata; kami pernah bersama Abu Musa kemudian disuguhkan makanannya dan di dalam makanannya disuguhkan daging ayam, dan diantara orang-orang terdapat seorang laki-laki dari Bani Taimillah ahmar, sepertinya ia adalah seorang budak dan ia tidak mendekat. Kemudian [Abu Musa] berkata kepadanya; mendekatlah, sesungguhnya saya telah melihat Rasulullah shallallahu 'alaihi wasallam memakan sebagian darinya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 85
      }
    },
    {
      "hadithNumber": 4348,
      "arabicNumber": 4348,
      "book": 42,
      "hadithInBook": 86,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ بِشْرٍ، - هُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم نَهَى يَوْمَ خَيْبَرَ عَنْ كُلِّ ذِي مِخْلَبٍ مِنَ الطَّيْرِ وَعَنْ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ ‏.‏",
        "translations": {
          "en": "It was narrated from Ibn 'Abbas that:on the Day of Khaibar, the Prophet of Allah forbade eating any birds with talons and any predators with fangs. (Daif)",
          "fr": "Rapporté par Ibn ‘Abbas : Le jour de Khaybar, le Prophète d’Allah a interdit de manger tout oiseau ayant des griffes et tout prédateur ayant des crocs. (Da’if)",
          "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Bisyr yaitu Ibnu Al Mufadhdhal], ia berkata; telah menceritakan kepada kami [Sa'id] dari [Ali bin Al Hakam] dari [Maimun bin Mahran] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam pada saat perang Khaibar melarang dari setiap yang memilki kuku dari burung dan dari segala yang memiliki taring dari hewan buas"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 86
      }
    },
    {
      "hadithNumber": 4349,
      "arabicNumber": 4349,
      "book": 42,
      "hadithInBook": 87,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ صُهَيْبٍ، مَوْلَى ابْنِ عَامِرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ إِنْسَانٍ قَتَلَ عُصْفُورًا فَمَا فَوْقَهَا بِغَيْرِ حَقِّهَا إِلاَّ سَأَلَهُ اللَّهُ عَزَّ وَجَلَّ عَنْهَا ‏\"‏ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا حَقُّهَا قَالَ ‏\"‏ يَذْبَحُهَا فَيَأْكُلُهَا وَلاَ يَقْطَعُ رَأْسَهَا يَرْمِي بِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah said:\"There is no person who kills a small bird or anything larger for no just reason, but Allah, the Mighty and Sublime, will ask him about it.\" It was said: \"O Messenger of Allah, what does just reason;' mean?\" Her said: \"That you slaughter it and eat it, and do not cut off its head and throw it aside",
          "fr": "Rapporté par ‘Abdullah ibn ‘Amr : Le Messager d’Allah a dit : « Toute personne qui tue un petit oiseau ou plus grand sans raison valable, Allah, le Tout-Puissant et Majestueux, l’interrogera à ce sujet. » On lui a demandé : « Ô Messager d’Allah, qu’est-ce qu’une raison valable ? » Il a répondu : « Que tu l’abattes pour le manger, et non pas que tu lui coupes la tête pour le jeter. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid Al Muqri`], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr] dari [Shuhaib] budak Ibnu 'Amir dari [Abdullah bin 'Amr] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang membunuh burung dan yang di atasnya tanpa hak kecuali Allah 'azza wajalla akan bertanya mengenainya.\" Dikatakan; wahai Rasulullah, apakah haknya? Beliau bersabda: \"Haknya adalah menyembelihnya, memakannya dan tidak memotong kepalanya dan membuangnya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 87
      }
    },
    {
      "hadithNumber": 4350,
      "arabicNumber": 4350,
      "book": 42,
      "hadithInBook": 88,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، عَنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي مَاءِ الْبَحْرِ ‏ \"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحَلاَلُ مَيْتَتُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Hurairah, that the Prophet (said), concerning the water of the sea:\"Its water is pure (and Purification) and its 'dead meat' is permissible (to eat)",
          "fr": "Rapporté par Abu Hurairah : Le Prophète, à propos de l’eau de mer, a dit : « Son eau est pure (et purifiante) et ses animaux morts sont permis à la consommation. »",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur], ia berkata; telah menceritakan kepada kami [Abdurrahman], ia berkata; telah menceritakan kepada kami [Malik] dari [Shafwan bin Sulaim] dari [Sa'id bin Salamah] dari [Al Mughirah bin Abu Burdah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam mengenai air laut; beliau bersabda: \"Laut itu suci airnya dan halal bangkainya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 88
      }
    },
    {
      "hadithNumber": 4351,
      "arabicNumber": 4351,
      "book": 42,
      "hadithInBook": 89,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ، قَالَ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَعَثَنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ ثَلاَثُمِائَةٍ نَحْمِلُ زَادَنَا عَلَى رِقَابِنَا فَفَنِيَ زَادُنَا حَتَّى كَانَ يَكُونُ لِلرَّجُلِ مِنَّا كُلَّ يَوْمٍ تَمْرَةٌ ‏.‏ فَقِيلَ لَهُ يَا أَبَا عَبْدِ اللَّهِ وَأَيْنَ تَقَعُ التَّمْرَةُ مِنَ الرَّجُلِ قَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَقَدْنَاهَا فَأَتَيْنَا الْبَحْرَ فَإِذَا بِحُوتٍ قَذَفَهُ الْبَحْرُ فَأَكَلْنَا مِنْهُ ثَمَانِيَةَ عَشَرَ يَوْمًا ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir bin 'Abdulah saida:\"The Prophet sent us, a group of three hundred, and we carried our provision on our mounts. Our supplies ran our until each man of us had one date per day.\" It was said to him: \"O Abu'Abdullah , what good is one date for a man?\" he said: \"When we ran out of dates it became very difficult for us. Then we found a whale that had been cast ashore by the sea. And we ate from it for eight days",
          "fr": "Rapporté par Jabir ibn ‘Abdullah : « Le Prophète nous a envoyés, un groupe de trois cents, et nous transportions nos provisions sur nos montures. Nos réserves se sont épuisées jusqu’à ce que chacun de nous n’ait plus qu’une datte par jour. » On lui a demandé : « Ô Abu ‘Abdullah, qu’est-ce qu’une datte pour un homme ? » Il a répondu : « Quand nous n’avons plus eu de dattes, cela est devenu très difficile pour nous. Puis nous avons trouvé une baleine échouée par la mer et nous en avons mangé pendant huit jours. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Adam], ia berkata; telah menceritakan kepada kami ['Abdah] dari [Hisyam] dari [Wahb bin Kaisan] dari [Jabir bin Abdullah], ia berkata; Nabi shallallahu 'alaihi wasallam mengutus kami sedang kami berjumlah tiga ratus, kami membawa perbekalan kami di atas punggung kami. Kemudian perbekalan kami habis hingga setiap orang diantara kami setiap hari memiliki satu buah kurma. Kemudian dikatakan; wahai Abu Abdullah, dimanakah kurma tersebut terjatuh dari orang tersebut? Ia berkata; sungguh kami telah benar-benar kehilangan kurma ketika kehilang kurma tersebut. Kemudian kami datang ke laut kemudian tiba-tiba terdapat ikan paus yang didamparkan oleh laut, kemudian kami memakan darinya selama delapan belas hari"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 89
      }
    },
    {
      "hadithNumber": 4352,
      "arabicNumber": 4352,
      "book": 42,
      "hadithInBook": 90,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرًا، يَقُولُ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَمِائَةِ رَاكِبٍ أَمِيرُنَا أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ نَرْصُدُ عِيرَ قُرَيْشٍ فَأَقَمْنَا بِالسَّاحِلِ فَأَصَابَنَا جُوعٌ شَدِيدٌ حَتَّى أَكَلْنَا الْخَبَطَ - قَالَ - فَأَلْقَى الْبَحْرُ دَابَّةً يُقَالُ لَهَا الْعَنْبَرُ فَأَكَلْنَا مِنْهُ نِصْفَ شَهْرٍ وَادَّهَنَّا مِنْ وَدَكِهِ فَثَابَتْ أَجْسَامُنَا وَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلاَعِهِ فَنَظَرَ إِلَى أَطْوَلِ جَمَلٍ وَأَطْوَلِ رَجُلٍ فِي الْجَيْشِ فَمَرَّ تَحْتَهُ ثُمَّ جَاعُوا فَنَحَرَ رَجُلٌ ثَلاَثَ جَزَائِرَ ثُمَّ جَاعُوا فَنَحَرَ رَجُلٌ ثَلاَثَ جَزَائِرَ ثُمَّ جَاعُوا فَنَحَرَ رَجُلٌ ثَلاَثَ جَزَائِرَ ثُمَّ نَهَاهُ أَبُو عُبَيْدَةَ ‏.‏ قَالَ سُفْيَانُ قَالَ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ فَسَأَلْنَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ هَلْ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ قَالَ فَأَخْرَجْنَا مِنْ عَيْنَيْهِ كَذَا وَكَذَا قُلَّةً مِنْ وَدَكٍ وَنَزَلَ فِي حِجَاجِ عَيْنِهِ أَرْبَعَةُ نَفَرٍ وَكَانَ مَعَ أَبِي عُبَيْدَةَ جِرَابٌ فِيهِ تَمْرٌ فَكَانَ يُعْطِينَا الْقَبْضَةَ ثُمَّ صَارَ إِلَى التَّمْرَةِ فَلَمَّا فَقَدْنَاهَا وَجَدْنَا فَقْدَهَا ‏.‏",
        "translations": {
          "en": "It was narrated that 'Amr said:\"I heard Jabir say: 'The Messenger of Allah sent us, three hundred riders led by Abu 'Ubaidah bin al-Jarrah, to lie in wait for the caravan of the Quraish. We stayed on the coast and became very hungry, so much so that we ate Khabat. Then the sea cast ashore a beast called (Al-'Anbar), and we ate from it for half a month, and daubed our bodies with its fat, and our health was restored. Abu 'Ubaidah took one it its ribs and looked for the tallest camel and the tallest man in the army, and he passed beneath it. Then they got hungry again and a man slaughtered three camels, then they got hungry and a man slaughtered three camels, then they got hungry and a man slaughtered three camels, then they got hungry and a man slaughtered three camels. Then Abu 'Ubaidah told him not to do that.\" (One of the narrators) Sufyan said: \"Abu Az-Zubair said, narrating from Jabir: \"We asked the Prophet and he said: 'Do you have anything left of it?\"' he said; \"We took out, such-and -such an amount of a fat from its (the whale's) eyes, and four men could fit into its eye socket. Abu 'Ubaidah had a sack of dates and he used to give them out by the handful, then he started to give one date at a time, and when we ran out of dates it became very difficult for us",
          "fr": "Rapporté par ‘Amr : « J’ai entendu Jabir dire : ‘Le Messager d’Allah nous a envoyés, trois cents cavaliers dirigés par Abu ‘Ubaidah ibn al-Jarrah, pour guetter la caravane des Quraysh. Nous sommes restés sur la côte et nous avons eu très faim, au point de manger du khabat. Puis la mer a rejeté une bête appelée (Al-‘Anbar), et nous en avons mangé pendant une quinzaine de jours, et nous nous sommes enduits de sa graisse, ce qui nous a redonné la santé. Abu ‘Ubaidah a pris une de ses côtes et a cherché le plus grand chameau et le plus grand homme de l’armée, et il est passé dessous. Ensuite, ils ont eu de nouveau faim et un homme a abattu trois chameaux, puis encore trois, et ainsi de suite. Puis Abu ‘Ubaidah lui a dit d’arrêter. » (Un des narrateurs), Sufyan, a dit : « Abu Az-Zubair, rapportant de Jabir : Nous avons demandé au Prophète et il a dit : ‘Est-ce qu’il vous en reste ?’ » Il a dit : « Nous avons extrait une certaine quantité de graisse de ses yeux, et quatre hommes pouvaient tenir dans son orbite. Abu ‘Ubaidah avait un sac de dattes et il les distribuait à la poignée, puis il a commencé à donner une datte à la fois, et quand nous avons manqué de dattes, cela est devenu très difficile pour nous. »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari ['Amr], ia berkata; saya mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami dan jumlah kami adalah tiga ratus orang, pemimpin kami adalah Abu 'Ubaidah bin Al Jarrah, kami mengintai kelompok dagang orang-orang Quraisy. Kemudian kami bermukim di tepi laut lalu kami tertimpa kelaparan yang sangat hingga kami makan daun yang terjatuh. Ia berkata; kemudian laut mendamparkan seekor binatang yang disebut ikan paus. Lalu kami memakan darinya selama setengah bulan. Dan kami berminyakan dari lemaknya, dan tubuh kami menjadi kuat. Kemudian Abu 'Ubaidah mengambil satu dari tulang-tulang rusuknya. Kemudian ia melihat kepada unta yang terpanjang serta orang yang tertinggi diantara pasukan. Lalu unta tersebut melewati di bawah tulang rusuk tersebut kemudian mereka merasa lapar, lalu seseorang menyembelih sebanyak tiga sembelihan kemudian mereka merasa lapar, lalu seseorang menyembelih tiga sembelihan kemudian mereka merasa lapar, lalu seseorang menyembelih tiga sembelihan kemudian Abu 'Ubaidah melarangnya. [Sufyan] berkata; telah berkata [Abu Az Zubair] dari [Jabir], kemudian kami bertanya kepada Nabi shallallahu 'alaihi wasallam lalu beliau bersabda: \"Apakah kalian membawa sebagiannya?\" ia berkata; kemudian kami mengeluarkan dari kedua mata ikan tersebut sekian dan sekian kendi dari lemak. Dan telah singgan di daerah Hajjaj 'ainih empat orang dan Abu 'Ubaidah memabawa kantong yang berisi kurma, dan ia memberi kami satu genggam hingga menjadi satu biji kurma, kemudian tatkala kami kehilangan kurma tersebut maka mendapatkannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 90
      }
    },
    {
      "hadithNumber": 4353,
      "arabicNumber": 4353,
      "book": 42,
      "hadithInBook": 91,
      "text": {
        "arabic": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنَا النَّبِيُّ صلى الله عليه وسلم مَعَ أَبِي عُبَيْدَةَ فِي سَرِيَّةٍ فَنَفِدَ زَادُنَا فَمَرَرْنَا بِحُوتٍ قَدْ قَذَفَ بِهِ الْبَحْرُ فَأَرَدْنَا أَنْ نَأْكُلَ مِنْهُ فَنَهَانَا أَبُو عُبَيْدَةَ ثُمَّ قَالَ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي سَبِيلِ اللَّهِ كُلُوا ‏.‏ فَأَكَلْنَا مِنْهُ أَيَّامًا فَلَمَّا قَدِمْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخْبَرْنَاهُ فَقَالَ ‏ \"‏ إِنْ كَانَ بَقِيَ مَعَكُمْ شَىْءٌ فَابْعَثُوا بِهِ إِلَيْنَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "It was narrated that Jabir said:\"The Prophet sent us with Abu 'Ubaidah on a campaign. Our supplies ran out. Then we passed by a whale that had been cast ashore by the sea. We wanted to eat from it, but Abu 'Ubaidah told us not to. Then he said: 'We are the envoys of the Messenger of Allah for the sake of Allah, so eat. So we ate from it for several days. When we came to the messenger of Allah we told him about that and he said: 'If you have anything left of it then send it to us",
          "fr": "Rapporté par Jabir : « Le Prophète nous a envoyés avec Abu ‘Ubaidah pour une expédition. Nos provisions se sont épuisées. Ensuite, nous avons trouvé une baleine rejetée par la mer. Nous voulions en manger, mais Abu ‘Ubaidah nous a dit de ne pas le faire. Puis il a dit : ‘Nous sommes les envoyés du Messager d’Allah pour la cause d’Allah, alors mangez.’ Nous en avons mangé pendant plusieurs jours. Quand nous sommes revenus auprès du Messager d’Allah, nous lui avons raconté cela et il a dit : ‘Si vous en avez encore, envoyez-m’en.’ »",
          "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir], ia berkata; Nabi shallallahu 'alaihi wasallam mengutus kami bersama dengan Abu 'Ubaidah dalam sebuah ekspedisi kemudian perbekalan kami habis, lalu kami melewati seekor ikan hiu yang telah didamparkan oleh laut, kemudian kami hendak makan darinya dan Abu 'Ubaidah melarang kami. Kemudian ia berkata; kita adalah utusan Rasulullah shallallahu 'alaihi wasallam dan di jalan Allah. Makanlah, maka kami memakannya selama beberapa hari. Kemudian tatkala kami datang kepada Rasulullah shallallahu 'alaihi wasallam kami khabarkan hal tersebut kepadanya. Kemudian beliau bersabda: \"Apabia ada yang tersisa bersama kalian maka kirimkan kepada kami"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 91
      }
    },
    {
      "hadithNumber": 4354,
      "arabicNumber": 4354,
      "book": 42,
      "hadithInBook": 92,
      "text": {
        "arabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيِّ بْنِ مُقَدَّمٍ الْمُقَدَّمِيُّ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ أَبِي عُبَيْدَةَ وَنَحْنُ ثَلاَثُمِائَةٍ وَبِضْعَةَ عَشَرَ وَزَوَّدَنَا جِرَابًا مِنْ تَمْرٍ فَأَعْطَانَا قَبْضَةً قَبْضَةً فَلَمَّا أَنْ جُزْنَاهُ أَعْطَانَا تَمْرَةً تَمْرَةً حَتَّى إِنْ كُنَّا لَنَمُصُّهَا كَمَا يَمُصُّ الصَّبِيُّ وَنَشْرَبُ عَلَيْهَا الْمَاءَ فَلَمَّا فَقَدْنَاهَا وَجَدْنَا فَقْدَهَا حَتَّى إِنْ كُنَّا لَنَخْبِطُ الْخَبَطَ بِقِسِيِّنَا وَنَسَفُّهُ ثُمَّ نَشْرَبُ عَلَيْهِ مِنَ الْمَاءِ حَتَّى سُمِّينَا جَيْشَ الْخَبَطِ ثُمَّ أَجَزْنَا السَّاحِلَ فَإِذَا دَابَّةٌ مِثْلُ الْكَثِيبِ يُقَالُ لَهُ الْعَنْبَرُ فَقَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ لاَ تَأْكُلُوهُ ‏.‏ ثُمَّ قَالَ جَيْشُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ وَنَحْنُ مُضْطَرُّونَ كُلُوا بِاسْمِ اللَّهِ ‏.‏ فَأَكَلْنَا مِنْهُ وَجَعَلْنَا مِنْهُ وَشِيقَةً وَلَقَدْ جَلَسَ فِي مَوْضِعِ عَيْنِهِ ثَلاَثَةَ عَشَرَ رَجُلاً - قَالَ - فَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلاَعِهِ فَرَحَلَ بِهِ أَجْسَمَ بَعِيرٍ مِنْ أَبَاعِرِ الْقَوْمِ فَأَجَازَ تَحْتَهُ فَلَمَّا قَدِمْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا حَبَسَكُمْ ‏\"‏ ‏.‏ قُلْنَا كُنَّا نَتَّبِعُ عِيرَاتِ قُرَيْشٍ وَذَكَرْنَا لَهُ مِنْ أَمْرِ الدَّابَّةِ فَقَالَ ‏\"‏ ذَاكَ رِزْقٌ رَزَقَكُمُوهُ اللَّهُ عَزَّ وَجَلَّ أَمَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ قَالَ قُلْنَا نَعَمْ ‏.‏",
        "translations": {
          "en": "(It was narrated that Jabir said:\"The Messenger of Allah sent us with Abu Ubaidah and we numbered over three hundred men. He supplied us with a sack of dates and gave them out by the handful. When he ran short, he gave us one date at a time, until we used to suck on it like an infant, and we would drink water with it. When we ran out of them it became very difficult for us. We used to hit the Khabat leaves with our bows to knock them down) and swallow them, then drink water with it. We became known as Jaish Al-Khabat (the Khabat army). Then, when we were about to turn inland, we saw a beast like a hill, caloled Al-'Anbar. Abu 'Ubaidah said: 'It is dead meat, do not eat it.' Then he said: 'The army of the Messenger of Allah in the cause of Allah, the Mighty and Sublime, and we are forced by necessity; eat in the name of Allah. 'So we arte from it and we made some if it into jerked meat. Thirteen men could sit in its eye-socket. Abu Ubaidah took one of its ribs and seated a man on the biggest camel that the people had, and they passed beneath it. When we came to the Messenger of Allah, he said: 'What kept you so long?' We said: The Quraish' and we told him about the beast. He said: 'That is provision that Allah granted to you. Do you have anything of it with you? \"We said: ' Yes",
          "fr": "Rapporté par Jabir : « Le Messager d’Allah nous a envoyés avec Abu ‘Ubaidah et nous étions plus de trois cents hommes. Il nous a donné un sac de dattes qu’il distribuait à la poignée. Quand il n’en restait plus beaucoup, il nous donnait une datte chacun, et nous la suçions comme un bébé, puis nous buvions de l’eau avec. Quand nous n’en avons plus eu, cela est devenu très difficile pour nous. Nous frappions les feuilles de khabat avec nos arcs pour les faire tomber et nous les mangions, puis nous buvions de l’eau avec. On nous a alors appelés l’armée du Khabat. Ensuite, alors que nous allions rentrer, nous avons vu une bête comme une colline, appelée Al-‘Anbar. Abu ‘Ubaidah a dit : ‘C’est une bête morte, n’en mangez pas.’ Puis il a dit : ‘C’est l’armée du Messager d’Allah pour la cause d’Allah, le Tout-Puissant et Majestueux, et nous sommes contraints par la nécessité ; mangez au nom d’Allah.’ Nous en avons donc mangé et nous en avons fait du séché. Treize hommes pouvaient s’asseoir dans son orbite. Abu ‘Ubaidah a pris une de ses côtes et a fait passer un homme sur le plus grand chameau dessous. Quand nous sommes arrivés auprès du Messager d’Allah, il a dit : ‘Qu’est-ce qui vous a retardés ?’ Nous avons répondu : ‘Les Quraysh’, et nous lui avons parlé de la bête. Il a dit : ‘C’est une provision qu’Allah vous a accordée. En avez-vous encore avec vous ?’ Nous avons répondu : ‘Oui.’ »",
          "id": "Telah mengabarkan kepada kami [Muhammad bin Umar bin Ali bin Muqaddam Al Muqadami], ia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam], ia berkata; telah menceritakan kepadaku [ayahku] dari [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami bersama Abu 'Ubaidah dan jumlah kami adalah seratus tiga belas dan beliau membekali satu kantong kurma, kemudian ia memberi kami satu genggam satu genggam. Kemudian setelah kami menghabiskannya lalu ia memberi kami satu kurma satu kurma hingga kami menghisab-hisab sebagaimana seorang bayi menghisab dan meminum air. Kemudian setelah kami kehilangan kurma tersebut maka kami benar-benar kehilangan kurma. Hingga kami memukul pohon agar daunnya rontok menggunakan busur kami memakannya dan minum airnya, hingga kami dinamai pasukan khabat (yang merontokkan daun pohon menggunakan busur). Kemudian kami melewati tepi laut, tiba-tiba terdapat hewan seperti bukit pasir yang disebut ikan paus. Kemudian Abu 'Ubaidah berkata; itu adalah bangkai janganlah kalian makan. Kemudian ia berkata; kalian adalah pasukan Rasulullah shallallahu 'alaihi wasallam dan berada di jalan Allah 'azza wajalla, dan kami dalam keadaan terdesak. Makanlah dengan menyebut nama Allah, maka kami makan sebagian darinya dan dendengnya. Sungguh tempat matanya telah diduduki oleh tiga belas orang. Kemudian Abu 'Ubaidah mengambil satu dari tulang-tulang rusuknya kemudian membawanya kepada unta yang terbesar kemudin unta tersebut melewati dibawahnya. Kemudian tatkala kami telah datang kepada Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Apakah yang menahan kalian?\" kami berkata; kami mengikuti kelompok dagang orang-orang Quraisy.... dan kami sebutkan kepada beliau perkara mengenai hewan tersebut. Kemudian beliau bersabda: \"Itu adalah rizqi yang telah Allah berikan kepada kalian, apakah kalian membawa sedikit darinya?\" kami mengatakan; ya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 92
      }
    },
    {
      "hadithNumber": 4355,
      "arabicNumber": 4355,
      "book": 42,
      "hadithInBook": 93,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ، أَنَّ طَبِيبًا، ذَكَرَ ضِفْدَعًا فِي دَوَاءٍ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ قَتْلِهِ ‏.‏",
        "translations": {
          "en": "It was narrated from 'Abdur-Rahman bin 'Uthman that:a physician made mention of the use of frogs in a remedy in the presence of the Messenger of Allah and the Messengher of Allah forbade killing them. (sahih)",
          "fr": "Rapporté par ‘Abdur-Rahman ibn ‘Uthman : Un médecin a parlé de l’utilisation des grenouilles dans un remède en présence du Messager d’Allah, et le Messager d’Allah a interdit de les tuer. (sahih)",
          "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Ibnu Abu Dzi`b] dari [Sa'id bin Khalid] dari [Sa'id bin Al Musayyab] dari [Abdurrahman bin Utsman] bahwa terdapat seorang dokter menyebutkan kodok sebagai obat di hadapan Rasulullah shallallahu 'alaihi wasallam, kemudian beliau melarang dari membunuhnya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 93
      }
    },
    {
      "hadithNumber": 4356,
      "arabicNumber": 4356,
      "book": 42,
      "hadithInBook": 94,
      "text": {
        "arabic": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ سُفْيَانَ، - وَهُوَ ابْنُ حَبِيبٍ - عَنْ شُعْبَةَ، عَنْ أَبِي يَعْفُورٍ، سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُ الْجَرَادَ ‏.‏",
        "translations": {
          "en": "It was narrated from Abu Ya fur that he heard 'Abdullah bin Abi Awfa says:\"We went on seven campaigns with the Messenger of Allah and we used to eat locusts",
          "fr": "Rapporté par Abu Ya fur : Il a entendu 'Abdullah bin Abi Awfa dire : \"Nous avons participé à sept expéditions avec le Messager d'Allah ﷺ et nous mangions des sauterelles",
          "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Sufyan] yaitu Ibnu Habib dari [Syu'bah] dari [Abu Ya'fur], ia mendengar [Abdullah bin Abu Aufa] berkata; kami berperang bersama Rasulullah shallallahu 'alaihi wasallam sebanyak tujuh peperangan, dan kami makan belalang"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 94
      }
    },
    {
      "hadithNumber": 4357,
      "arabicNumber": 4357,
      "book": 42,
      "hadithInBook": 95,
      "text": {
        "arabic": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ سُفْيَانَ، - وَهُوَ ابْنُ عُيَيْنَةَ - عَنْ أَبِي يَعْفُورٍ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنْ قَتْلِ الْجَرَادِ، فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سِتَّ غَزَوَاتٍ نَأْكُلُ الْجَرَادَ ‏.‏",
        "translations": {
          "en": "It was narrated that Abuy ya fur said:\"I asked 'Abdullah bin Abu Awfa about killing locusts and he said: I went on six campaigns with the Messenger of Allah hand we ate locusts",
          "fr": "Rapporté par Abu Ya fur : J'ai demandé à 'Abdullah bin Abi Awfa au sujet du fait de tuer des sauterelles et il a dit : \"J'ai participé à six expéditions avec le Messager d'Allah ﷺ et nous mangions des sauterelles",
          "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Sufyan yaitu Ibnu 'Uyainah] dari [Abu Ya'fur], ia berkata; saya bertanya kepada [Abdullah bin Abu Aufa] mengenai membunuh belalang, kemudian ia berkata; saya pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam sebanyak enam kali dan kami memakan belalang"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 95
      }
    },
    {
      "hadithNumber": 4358,
      "arabicNumber": 4358,
      "book": 42,
      "hadithInBook": 96,
      "text": {
        "arabic": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَّ نَمْلَةً قَرَصَتْ نَبِيًّا مِنَ الأَنْبِيَاءِ فَأَمَرَ بِقَرْيَةِ النَّمْلِ فَأُحْرِقَتْ فَأَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَيْهِ أَنْ قَدْ قَرَصَتْكَ نَمْلَةٌ أَهْلَكْتَ أُمَّةً مِنَ الأُمَمِ تُسَبِّحُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Was narrated from Abu Hurairah from the Messenger of Allah:\"An ant bit one of the prophets, and he ordered that the ant nest be burned. Then Allah revealed to him: \"One ant bit you, and you destroyed one of the nations that glorify Allah",
          "fr": "Rapporté par Abu Hurairah, du Messager d'Allah ﷺ : \"Une fourmi a mordu l'un des prophètes et il a ordonné de brûler la fourmilière. Alors Allah lui a révélé : 'Une seule fourmi t'a mordu, et tu as détruit toute une communauté qui glorifie Allah",
          "id": "Telah mengabarkan kepada kami [Wahb bin Bayan], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Sa'id] dan [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam bahwa seekor semut menggigit seorang Nabi dari nabi-nabi terdahulu, lalu ia memerintahkan untuk menghancurkan bangsa semut dan membakar mereka, Kemudian Allah Azza wa jalla mewahyukan bahwa engkau telah digigit seekor semut, dan engkau telah membinasakan sebuah umat diantara umat-umat yang bertasbih"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 96
      }
    },
    {
      "hadithNumber": 4359,
      "arabicNumber": 4359,
      "book": 42,
      "hadithInBook": 97,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ، - وَهُوَ ابْنُ شُمَيْلٍ - قَالَ أَنْبَأَنَا أَشْعَثُ، عَنِ الْحَسَنِ، نَزَلَ نَبِيٌّ مِنَ الأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ بِبَيْتِهِنَّ فَحُرِّقَ عَلَى مَا فِيهَا فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلاَّ نَمْلَةً وَاحِدَةً ‏.‏ وَقَالَ الأَشْعَثُ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ وَزَادَ فَإِنَّهُنَّ يُسَبِّحْنَ ‏.‏",
        "translations": {
          "en": "It was narrated from al-Hasan:\"One of the prophets stopped beneath a tree and an ant bit him, so he gave instructions that their nest be burned with all the ants inside it. Then Allah revealed to him\" 'Why did you not punish just one ant?\" Al-Ash' ath said: \"A similar report was narrated from Ibn Sirin, from Abu Hurairah, from the Prophet, in which were added the words: 'for they glorify Allah",
          "fr": "Rapporté par al-Hasan : \"L'un des prophètes s'est arrêté sous un arbre et une fourmi l'a mordu. Il a alors ordonné de brûler leur nid avec toutes les fourmis à l'intérieur. Puis Allah lui a révélé : 'Pourquoi n'as-tu pas puni seulement la fourmi qui t'a mordu ?'\" Al-Ash'ath a dit : \"Un récit similaire a été rapporté par Ibn Sirin, d'Abu Hurairah, du Prophète ﷺ, avec en plus les mots : 'car elles glorifient Allah",
          "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [An Nadhr yaitu Ibnu Syumail], ia berkata; telah memberitakan kepada kami [Asy'ats] dari [Al Hasan], ia berkata; seorang nabi telah singgal di bawah sebuah pohon kemudian ia disengat oleh seekor semut. Kemudian ia memerintahkan agar menghancurkan rumah semut tersebut, kemudian dibakarlah besarta penghuninya. Lalu Allah mewahyukan kepadanya; Apakah hanya satu ekor semut? [Al Asy'ats] berkata; dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu, dan Ia menambahkan; sesunggunya semut-semut tersebut sedang bertasbih. Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam], ia berkata; telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Al Hasan] dari [Abu Hurairah] seperti itu dan ia tidak memarfu'kannya"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Sahih Maqtu"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 97
      }
    },
    {
      "hadithNumber": 4360,
      "arabicNumber": 4360,
      "book": 42,
      "hadithInBook": 98,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَهُ وَلَمْ يَرْفَعْهُ ‏.‏",
        "translations": {
          "en": "Narrated from Abu Hurairah:A similar report was narrated from Abu Hurairah, but was not attributed to the Prophet",
          "fr": "Rapporté par Abu Hurairah : Un récit similaire a été rapporté par Abu Hurairah, mais il n'a pas été attribué au Prophète ﷺ"
        }
      },
      "grades": [
        {
          "name": "Abu Ghuddah",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "nasai",
        "book": 42,
        "hadith": 98
      },
      "narrator": {
        "en": "from Abu Hurairah"
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "71KB"
  }
}