{"chapter":1,"name":{"arabic":"الفاتحة","transliteration":"Al-Fatihah","translation":"The Opening","revelation":"meccan"},"revelation":"meccan","verses":7,"content":[{"verse":1,"arabic":"﻿بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ","transliteration":"Bismillaahir Rahmaanir Raheem","translations":{"en.ahmedali":"In the name of Allah, most benevolent, ever-merciful.","en.ahmedraza":"In the name of Allah, The Most Gracious, the Most Merciful","en.arberry":"In the Name of God, the Merciful, the Compassionate","en.asad":"In the name of God, The Most Gracious, The Dispenser of Grace:","en.daryabadi":"In the name of Allah, the Compassionate, the Merciful.","en.hilali":"In the Name of Allah, the Most Beneficent, the Most Merciful.","en.pickthall":"In the name of Allah, the Beneficent, the Merciful.","en.qaribullah":"In the Name of Allah, the Merciful, the Most Merciful","en.sahih":"In the name of Allah, the Entirely Merciful, the Especially Merciful.","en.sarwar":"In the Name of Allah, the Beneficent, the Merciful","en.yusufali":"In the name of Allah, Most Gracious, Most Merciful.","en.maududi":"In the name of Allah, the Merciful, the Compassionate","en.shakir":"In the name of Allah, the Beneficent, the Merciful.","en.itani":"In the name of God, the Gracious, the Merciful.","en.mubarakpuri":"In the Name of Allah, the Most Gracious, the Most Merciful.","en.qarai":"In the Name of Allah, the All-beneficent, the All-merciful.","en.wahiduddin":"﻿In the name of God, the Most Gracious, the Most Merciful."},"tafsir":{"ar.muyassar":"سورة الفاتحة سميت هذه السورة بالفاتحة؛ لأنه يفتتح بها القرآن العظيم، وتسمى المثاني؛ لأنها تقرأ في كل ركعة، ولها أسماء أخر. أبتدئ قراءة القرآن باسم الله مستعينا به، (اللهِ) علم على الرب -تبارك وتعالى- المعبود بحق دون سواه، وهو أخص أسماء الله تعالى، ولا يسمى به غيره سبحانه. (الرَّحْمَنِ) ذي الرحمة العامة الذي وسعت رحمته جميع الخلق، (الرَّحِيمِ) بالمؤمنين، وهما اسمان من أسمائه تعالى، يتضمنان إثبات صفة الرحمة لله تعالى كما يليق بجلاله.","ar.jalalayn":"«بسم الله الرحمن الرحيم»","ar.qurtubi":"القول في الاستعاذةوفيها اثنتا عشرة مسألة :الأولى : أمر الله تعالى بالاستعاذة عند أول كل قراءة فقال تعالى : فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم [ النحل : 98 ] أي إذا أردت أن تقرأ ; فأوقع الماضي موقع المستقبل كما قال الشاعر :وإني لآتيكم لذكري الذي مضى من الود واستئناف ما كان في غدأراد ما يكون في غد ; وقيل : في الكلام تقديم وتأخير ، وأن كل فعلين تقاربا في المعنى جاز تقديم أيهما شئت ; كما قال تعالى : ثم دنا فتدلى [ النجم : 8 ] المعنى فتدلى ثم دنا ; ومثله : اقتربت الساعة وانشق القمر [ القمر : 1 ] وهو كثير .الثانية : هذا الأمر على الندب في قول الجمهور في كل قراءة في غير الصلاة . واختلفوا فيه في الصلاة . حكى النقاش عن عطاء : أن الاستعاذة واجبة ، وكان ابن سيرين والنخعي وقوم يتعوذون في الصلاة كل ركعة ، ويمتثلون أمر الله في الاستعاذة على العموم ، وأبو حنيفة والشافعي يتعوذان في الركعة الأولى من الصلاة ويريان قراءة الصلاة كلها كقراءة واحدة ; ومالك لا يرى التعوذ في الصلاة المفروضة ويراه في قيام رمضان .الثالثة : أجمع العلماء على أن التعوذ ليس من القرآن ولا آية منه ، وهو قول القارئ : أعوذ بالله من الشيطان الرجيم . وهذا اللفظ هو الذي عليه الجمهور من العلماء في التعوذ لأنه لفظ كتاب الله تعالى . وروي عن ابن مسعود أنه قال : قلت أعوذ بالله السميع العليم من الشيطان الرجيم ; فقال لي النبي صلى الله عليه وسلم : يا ابن أم عبد أعوذ بالله من الشيطان الرجيم هكذا أقرأني جبريل عن اللوح المحفوظ عن القلم .الرابعة : روى أبو داود وابن ماجه في سننهما عن جبير بن مطعم أنه رأى رسول الله صلى الله عليه وسلم يصلي صلاة فقال عمرو : لا أدري أي صلاة هي ؟ فقال : \" الله أكبر كبيرا الله أكبر كبيرا - ثلاثا - الحمد لله كثيرا الحمد لله كثيرا - ثلاثا - وسبحان الله بكرة وأصيلا - ثلاثا - أعوذ بالله من الشيطان من نفخه ونفثه وهمزه . قال عمرو : همزه المؤتة ، ونفثه الشعر ، ونفخه الكبر . وقال ابن ماجه : [ ص: 84 ] المؤتة يعني الجنون . والنفث : نفخ الرجل من فيه من غير أن يخرج ريقه . والكبر : التيه . وروى أبو داود عن أبي سعيد الخدري قال : كان رسول الله صلى الله عليه وسلم إذا قام من الليل كبر ثم يقول : سبحانك اللهم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك - ثم يقول : لا إله إلا الله - ثلاثا ثم يقول : - الله أكبر كبيرا - ثلاثا - أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه ثم يقرأ . وروى سليمان بن سالم عن ابن القاسم رحمه الله أن الاستعاذة : أعوذ بالله العظيم من الشيطان الرجيم إن الله هو السميع العليم بسم الله الرحمن الرحيم . قال ابن عطية : \" وأما المقرئون فأكثروا في هذا من تبديل الصفة في اسم الله تعالى وفي الجهة الأخرى ، كقول بعضهم : أعوذ بالله المجيد ، من الشيطان المريد ; ونحو هذا مما لا أقول فيه : نعمت البدعة ، ولا أقول : إنه لا يجوز \" .الخامسة : قال المهدوي : أجمع القراء على إظهار الاستعاذة في أول قراءة سورة \" الحمد \" إلا حمزة فإنه أسرها . وروى السدي عن أهل المدينة أنهم كانوا يفتتحون القراءة بالبسملة . وذكر أبو الليث السمرقندي عن بعض المفسرين أن التعوذ فرض ، فإذا نسيه القارئ وذكره في بعض الحزب قطع وتعوذ ، ثم ابتدأ من أوله . وبعضهم يقول : يستعيذ ثم يرجع إلى موضعه الذي وقف فيه ; وبالأول قال أسانيد الحجاز والعراق ; وبالثاني قال أسانيد الشام ومصر .السادسة : حكى الزهراوي قال : نزلت الآية في الصلاة وندبنا إلى الاستعاذة في غير الصلاة وليس بفرض . قال غيره : كانت فرضا على النبي صلى الله عليه وسلم وحده ، ثم تأسينا به .السابعة : روي عن أبي هريرة أن الاستعاذة بعد القراءة ; وقاله داود . قال أبو بكر بن العربي : انتهى العي بقوم إلى أن قالوا : إذا فرغ القارئ من قراءة القرآن يستعيذ بالله من الشيطان الرجيم . وقد روى أبو سعيد الخدري أن النبي صلى الله عليه وسلم كان يتعوذ في صلاته قبل القراءة ، وهذا نص . فإن قيل : فما الفائدة في الاستعاذة من الشيطان الرجيم وقت القراءة ؟ قلنا : فائدتها امتثال الأمر ، وليس للشرعيات فائدة إلا القيام بحق الوفاء لها في امتثالها أمرا أو اجتنابها نهيا ; وقد قيل : فائدتها امتثال الأمر [ ص: 85 ] بالاستعاذة من وسوسة الشيطان عند القراءة ; كما قال تعالى وما أرسلنا من قبلك من رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته [ الحج : 52 ] . قال ابن العربي : ومن أغرب ما وجدناه قول مالك في المجموعة في تفسير هذه الآية : فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم [ النحل : 98 ] قال : ذلك بعد قراءة أم القرآن لمن قرأ في الصلاة ، وهذا قول لم يرد به أثر ، ولا يعضده نظر ; فإن كان هذا كما قال بعض الناس : إن الاستعاذة بعد القراءة ، كان تخصيص ذلك بقراءة أم القرآن في الصلاة دعوى عريضة ، ولا تشبه أصل مالك ولا فهمه ; فالله أعلم بسر هذه الرواية .الثامنة : في فضل التعوذ . روى مسلم عن سليمان بن صرد قال : استب رجلان عند النبي صلى الله عليه وسلم فجعل أحدهما يغضب ويحمر وجهه فنظر إليه النبي صلى الله عليه وسلم فقال : إني لأعلم كلمة لو قالها لذهب ذا عنه ، أعوذ بالله من الشيطان الرجيم . فقام إلى الرجل رجل ممن سمع النبي صلى الله عليه وسلم فقال : هل تدري ما قال رسول الله صلى الله عليه وسلم آنفا ؟ قال : إني لأعلم كلمة لو قالها لذهب ذا عنه أعوذ بالله من الشيطان الرجيم فقال له الرجل : أمجنونا تراني ! أخرجه البخاري أيضا . وروى مسلم أيضا عن عثمان بن أبي العاص الثقفي أنه أتى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إن الشيطان قد حال بيني وبين صلاتي وقراءتي يلبسها علي ، فقال له رسول الله صلى الله عليه وسلم : ذاك شيطان يقال له خنزب فإذا أحسسته فتعوذ بالله منه واتفل عن يسارك ثلاثا قال : ففعلت فأذهبه الله عني . وروى أبو داود عن ابن عمر قال : كان رسول الله صلى الله عليه وسلم إذا سافر فأقبل عليه الليل قال : يا أرض ربي وربك الله أعوذ بالله من شرك [ وشر ما فيك ] [ و ] شر ما خلق فيك ومن شر ما يدب عليك [ وأعوذ بالله ] من أسد وأسود ومن الحية والعقرب ومن [ ساكن ] البلد ووالد وما ولد وروت خولة بنت حكيم قالت : سمعت رسول الله صلى الله عليه وسلم يقول : من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق لم يضره شيء حتى يرتحل . أخرجه الموطأ ومسلم والترمذي وقال : حديث حسن غريب صحيح . وما يتعوذ منه كثير ثابت في الأخبار ، والله المستعان .[ ص: 86 ]التاسعة : معنى الاستعاذة في كلام العرب : الاستجارة والتحيز إلى الشيء ، على معنى الامتناع به من المكروه ; يقال : عذت بفلان واستعذت به ; أي لجأت إليه . وهو عياذي ; أي ملجئي . وأعذت غيري به وعوذته بمعنى . ويقال : عوذ بالله منك ; أي أعوذ بالله منك ; قال الراجزقالت وفيها حيدة وذعر عوذ بربي منكم وحجروالعرب تقول عند الأمر تنكره : حجرا له ، بالضم ، أي دفعا ، وهو استعاذة من الأمر . والعوذة والمعاذة والتعويذ كله بمعنى . وأصل أعوذ : أعوذ نقلت الضمة إلى العين لاستثقالها على الواو فسكنت .العاشرة : الشيطان واحد الشياطين ; على التكسير والنون أصلية ; لأنه من شطن إذا بعد عن الخير . وشطنت داره أي بعدت ; قال الشاعر [ النابغة الذبياني ] :نأت بسعاد عنك نوى شطون فبانت والفؤاد بها رهينوبئر شطون أي بعيدة القعر . والشطن : الحبل ; سمي به لبعد طرفيه وامتداده . ووصف أعرابي فرسا لا يحفى فقال : كأنه شيطان في أشطان . وسمي الشيطان شيطانا لبعده عن الحق وتمرده ; وذلك أن كل عات متمرد من الجن والإنس والدواب شيطان ; قال جرير :أيام يدعونني الشيطان من غزل     وهن يهوينني إذ كنت شيطاناوقيل : إن شيطانا مأخوذ من شاط يشيط إذا هلك ، فالنون زائدة . وشاط إذا احترق وشيطت اللحم إذا دخنته ولم تنضجه . واشتاط الرجل إذا احتد غضبا . وناقة مشياط التي يطير فيها السمن . واشتاط إذا هلك ; قال الأعشى :قد نخضب العير من مكنون فائله     وقد يشيط على أرماحنا البطلأي يهلك . ويرد على هذه الفرقة أن سيبويه حكى أن العرب تقول : تشيطن فلان إذا فعل أفعال الشياطين ، فهذا بين أنه تفيعل من شطن ، ولو كان من شاط لقالوا : تشيط ، ويرد عليهم أيضا بيت أمية بن أبي الصلت :أيما شاطن عصاه عكاه     ورماه في السجن والأغلالفهذا شاطن من شطن لا شك فيه .الحادية عشرة : الرجيم أي المبعد من الخير المهان . وأصل الرجم : الرمي بالحجارة ، وقد رجمته أرجمه ، فهو رجيم ومرجوم . والرجم : القتل واللعن والطرد والشتم ، وقد قيل هذا كله في [ ص: 87 ] قوله تعالى : لئن لم تنته يانوح لتكونن من المرجومين [ الشعراء : 116 ] . وقول أبي إبراهيم : لئن لم تنته لأرجمنك [ مريم : 46 ] . وسيأتي إن شاء الله تعالى .الثانية عشرة : روى الأعمش عن أبي وائل عن عبد الله قال : قال علي بن أبي طالب عليه السلام : رأيت النبي صلى الله عليه وسلم عند الصفا وهو مقبل على شخص في صورة الفيل وهو يلعنه ، قلت : ومن هذا الذي تلعنه يا رسول الله ؟ قال هذا الشيطان الرجيم فقلت : يا عدو الله ، والله لأقتلنك والله لأقتلنك ولأريحن الأمة منك ; قال : ما هذا جزائي منك ; قلت : وما جزاؤك مني يا عدو الله ؟ قال : والله ما أبغضك أحد قط إلا شركت أباه في رحم أمه .وفيها سبع وعشرون مسألة :الأولى : قال العلماء : ( بسم الله الرحمن الرحيم ) قسم من ربنا أنزله عند رأس كل سورة ، يقسم لعباده إن هذا الذي وضعت لكم يا عبادي في هذه السورة حق ، وإني أفي لكم بجميع ما ضمنت في هذه السورة من وعدي ولطفي وبري . و ( بسم الله الرحمن الرحيم ) مما أنزله الله تعالى في كتابنا وعلى هذه الأمة خصوصا بعد سليمان عليه السلام . وقال بعض العلماء : إن بسم الله الرحمن الرحيم تضمنت جميع الشرع ، لأنها تدل على الذات وعلى الصفات ; وهذا صحيح .الثانية : قال سعيد بن أبي سكينة : بلغني أن علي بن أبي طالب رضي الله عنه نظر إلى رجل يكتب : ( بسم الله الرحمن الرحيم ) فقال له : جودها فإن رجلا جودها فغفر له . قال سعيد : وبلغني أن رجلا نظر إلى قرطاس فيه ( بسم الله الرحمن الرحيم ) فقبله ووضعه على عينيه فغفر له . ومن هذا المعنى قصة بشر الحافي ، فإنه لما رفع الرقعة التي فيها اسم الله وطيبها طيب اسمه ، ذكره القشيري . وروى النسائي عن أبي المليح عن ردف رسول الله صلى الله عليه وسلم قال إن رسول الله صلى الله عليه وسلم قال إذا عثرت بك الدابة فلا تقل تعس الشيطان فإنه يتعاظم حتى يصير مثل البيت ويقول بقوته صرعته ولكن قل بسم الله الرحمن الرحيم فإنه يتصاغر حتى يصير مثل الذباب . وقال علي بن الحسين في تفسير قوله تعالى : وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا [ الإسراء : 46 ] قال معناه : إذا قلت : بسم الله الرحمن الرحيم . وروى وكيع عن الأعمش عن أبي وائل عن عبد الله بن مسعود قال : من أراد أن ينجيه الله من الزبانية التسعة عشر فليقرأ : بسم الله الرحمن الرحيم ليجعل الله تعالى له بكل حرف منها جنة من كل واحد . فالبسملة تسعة عشر حرفا على عدد ملائكة أهل النار الذين قال الله فيهم : عليها تسعة عشر [ المدثر : 30 ] وهم يقولون في كل أفعالهم : ( بسم الله الرحمن الرحيم ) فمن هنالك هي قوتهم ، [ ص: 89 ] وببسم الله استضلعوا . قال ابن عطية : ونظير هذا قولهم في ليلة القدر : إنها ليلة سبع وعشرين ، مراعاة للفظة ( هي ) من كلمات سورة : إنا أنزلناه [ القدر : 1 ] . ونظيره أيضا قولهم في عدد الملائكة الذين ابتدروا قول القائل : ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه ، فإنها بضعة وثلاثون حرفا ; فلذلك قال النبي صلى الله عليه وسلم : لقد رأيت بضعا وثلاثين ملكا يبتدرونها أيهم يكتبها أول . قال ابن عطية : وهذا من ملح التفسير وليس من متين العلم .الثالثة : روى الشعبي والأعمش أن رسول الله صلى الله عليه وسلم كان يكتب ( باسمك اللهم ) حتى أمر أن يكتب ( بسم الله ) فكتبها ; فلما نزلت : قل ادعوا الله أو ادعوا الرحمن [ الإسراء : 110 ] كتب ( بسم الله الرحمن ) فلما نزلت : إنه من سليمان وإنه بسم الله الرحمن الرحيم [ النمل : 30 ] كتبها . وفي مصنف أبي داود قال الشعبي وأبو مالك وقتادة وثابت بن عمارة : إن النبي صلى الله عليه وسلم لم يكتب بسم الله حتى نزلت سورة \" النمل \" .الرابعة : روي عن جعفر الصادق رضي الله عنه أنه قال : البسملة تيجان السور .قلت : وهذا يدل على أنها ليست بآية من الفاتحة ولا غيرها . وقد اختلف العلماء في هذا المعنى على ثلاثة أقوال :( الأول ) ليست بآية من الفاتحة ولا غيرها ; وهو قول مالك . ( الثاني ) أنها آية من كل سورة ; وهو قول عبد الله بن المبارك . ( الثالث ) قال الشافعي : هي آية في الفاتحة ; وتردد قوله في سائر السور ; فمرة قال : هي آية من كل سورة ، ومرة قال : ليست بآية إلا في الفاتحة وحدها . ولا خلاف بينهم في أنها آية من القرآن في سورة النمل .واحتج الشافعي بما رواه الدارقطني من حديث أبي بكر الحنفي عن عبد الحميد بن جعفر عن نوح بن أبي بلال عن سعيد بن أبي سعيد المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم قال : [ ص: 90 ] إذا قرأتم \" الحمد لله رب العالمين \" فاقرءوا \" بسم الله الرحمن الرحيم \" إنها أم القرآن وأم الكتاب والسبع المثاني و \" بسم الله الرحمن الرحيم \" ، إحداها . رفع هذا الحديث عبد الحميد بن جعفر وعبد الحميد هذا وثقه أحمد بن حنبل ويحيى بن سعيد ويحيى بن معين ; وأبو حاتم يقول فيه : محله الصدق ; وكان سفيان الثوري يضعفه ويحمل عليه . ونوح بن أبي بلال ثقة مشهور .وحجة ابن المبارك وأحد قولي الشافعي ما رواه مسلم عن أنس قال : بينا رسول الله صلى الله عليه وسلم ذات يوم بين أظهرنا إذ أغفى إغفاءة ثم رفع رأسه متبسما ; فقلنا : ما أضحكك يا رسول الله ؟ قال : أنزلت علي آنفا سورة فقرأ : بسم الله الرحمن الرحيم إنا أعطيناك الكوثر فصل لربك وانحر إن شانئك هو الأبتر وذكر الحديث ، وسيأتي بكماله في سورة الكوثر إن شاء الله تعالى .الخامسة : الصحيح من هذه الأقوال قول مالك ; لأن القرآن لا يثبت بأخبار الآحاد وإنما طريقه التواتر القطعي الذي لا يختلف فيه . قال ابن العربي : ويكفيك أنها ليست من القرآن اختلاف الناس فيها ، والقرآن لا يختلف فيه . والأخبار الصحاح التي لا مطعن فيها دالة على أن البسملة ليست بآية من الفاتحة ولا غيرها إلا في النمل وحدها . روى مسلم عن أبي هريرة قال : سمعت رسول الله صلى الله عليه وسلم يقول : قال [ تعالى ] : \" قسمت الصلاة بيني وبين عبدي نصفين ولعبدي ما سأل فإذا قال العبد : ( الحمد لله رب العالمين ) قال الله تعالى حمدني عبدي وإذا قال : ( الرحمن الرحيم ) قال الله تعالى : أثنى علي عبدي وإذا قال : ( مالك يوم الدين ) قال مجدني عبدي - وقال مرة : فوض إلى عبدي - فإذا قال : ( إياك نعبد وإياك نستعين ) قال : هذا بيني وبين عبدي ، ولعبدي ما سأل ، فإذا قال : ( اهدنا الصراط المستقيم صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين ) قال : هذا لعبدي ولعبدي ما سأل . فقوله سبحانه : \" قسمت الصلاة \" يريد الفاتحة ، وسماها صلاة لأن الصلاة لا تصح إلا بها ; فجعل الثلاث الآيات الأول لنفسه ، واختص بها تبارك اسمه ، ولم يختلف المسلمون فيها . ثم الآية الرابعة جعلها بينه وبين عبده ; لأنها تضمنت تذلل العبد وطلب الاستعانة منه ، وذلك يتضمن تعظيم الله تعالى ، ثم ثلاث آيات تتمة سبع آيات . ومما يدل على أنها ثلاث قوله : \" هؤلاء [ ص: 91 ] لعبدي \" أخرجه مالك ; ولم يقل : هاتان ; فهذا يدل على أن ( أنعمت عليهم ) آية . قال ابن بكير قال مالك : \" أنعمت عليهم \" آية ، ثم الآية السابعة إلى آخرها . فثبت بهذه القسمة التي قسمها الله تعالى وبقوله عليه السلام لأبي : كيف تقرأ إذا افتتحت الصلاة قال : فقرأت : الحمد لله رب العالمين حتى أتيت على آخرها - أن البسملة ليست بآية منها ، وكذا عد أهل المدينة وأهل الشام وأهل البصرة ; وأكثر القراء عدوا : ( أنعمت عليهم ) آية ، وكذا روى قتادة عن أبي نضرة عن أبي هريرة قال : الآية السادسة : ( أنعمت عليهم ) . وأما أهل الكوفة من القراء والفقهاء فإنهم عدوا فيها ( بسم الله الرحمن الرحيم ) ولم يعدوا ( أنعمت عليهم ) .فإن قيل : فإنها ثبتت في المصحف وهي مكتوبة بخطه ونقلت نقله ، كما نقلت في النمل ، وذلك متواتر عنهم . قلنا : ما ذكرتموه صحيح ; ولكن لكونها قرآنا ، أو لكونها فاصلة بين السور - كما روي عن الصحابة : كنا لا نعرف انقضاء السورة حتى تنزل \" بسم الله الرحمن الرحيم \" أخرجه أبو داود - أو تبركا بها ، كما قد اتفقت الأمة على كتبها في أوائل الكتب والرسائل ؟ كل ذلك محتمل . وقد قال الجريري : سئل الحسن عن ( بسم الله الرحمن الرحيم ) قال : في صدور الرسائل . وقال الحسن أيضا : لم تنزل ( بسم الله الرحمن الرحيم ) في شيء من القرآن إلا في \" طس \" إنه من سليمان وإنه بسم الله الرحمن الرحيم . والفيصل أن القرآن لا يثبت بالنظر والاستدلال ، وإنما يثبت بالنقل المتواتر القطعي الاضطراري . ثم قد اضطرب قول الشافعي فيها في أول كل سورة فدل على أنها ليست بآية من كل سورة ; والحمد لله .فإن قيل : فقد روى جماعة قرآنيتها ، وقد تولى الدارقطني جمع ذلك في جزء صححه . قلنا : لسنا ننكر الرواية بذلك وقد أشرنا إليها ، ولنا أخبار ثابتة في مقابلتها ، رواها الأئمة الثقات والفقهاء الأثبات . روت عائشة في صحيح مسلم قالت : كان رسول الله صلى الله عليه وسلم يستفتح الصلاة بالتكبير ، والقراءة ب \" الحمد لله رب العالمين \" ، الحديث . وسيأتي بكماله . وروى مسلم أيضا عن أنس بن مالك قال : صليت خلف النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان ، فكانوا يستفتحون [ ص: 92 ] بالحمد لله رب العالمين ; لا يذكرون \" بسم الله الرحمن الرحيم \" في أول قراءة ولا في آخرها .ثم إن مذهبنا يترجح في ذلك بوجه عظيم ، وهو المعقول ; وذلك أن مسجد النبي صلى الله عليه وسلم بالمدينة انقضت عليه العصور ، ومرت عليه الأزمنة والدهور ، من لدن رسول الله صلى الله عليه وسلم إلى زمان مالك ، ولم يقرأ أحد فيه قط \" بسم الله الرحمن الرحيم \" ؛ اتباعا للسنة ، وهذا يرد أحاديثكم .بيد أن أصحابنا استحبوا قراءتها في النفل ; وعليه تحمل الآثار الواردة في قراءتها أو على السعة في ذلك . قال مالك : ولا بأس أن يقرأ بها في النافلة ومن يعرض القرآن عرضا .وجملة مذهب مالك وأصحابه : أنها ليست عندهم آية من فاتحة الكتاب ولا غيرها ، ولا يقرأ بها المصلي في المكتوبة ولا في غيرها سرا ولا جهرا ; ويجوز أن يقرأها في النوافل . هذا هو المشهور من مذهبه عند أصحابه . وعنه رواية أخرى أنها تقرأ أول السورة في النوافل ، ولا تقرأ أول أم القرآن . وروى عنه ابن نافع ابتداء القراءة بها في الصلاة الفرض والنفل ولا تترك بحال . ومن أهل المدينة من يقول : إنه لابد فيها من ( بسم الله الرحمن الرحيم ) منهم ابن عمر ، وابن شهاب ; وبه قال الشافعي وأحمد وإسحاق وأبو ثور وأبو عبيد . وهذا يدل على أن المسألة مسألة اجتهادية لا قطعية ، كما ظنه بعض الجهال من المتفقهة الذي يلزم على قوله تكفير المسلمين ; وليس كما ظن لوجود الاختلاف المذكور ; والحمد لله .وقد ذهب جمع من العلماء إلى الإسرار بها مع الفاتحة ; منهم : أبو حنيفة والثوري ; وروى ذلك عن عمر وعلي وابن مسعود وعمار وابن الزبير ; وهو قول الحكم وحماد ; وبه قال أحمد بن حنبل وأبو عبيد ; وروي عن الأوزاعي مثل ذلك ; حكاه أبو عمر بن عبد البر في ( الاستذكار ) . واحتجوا من الأثر في ذلك بما رواه منصور بن زاذان عن أنس بن مالك قال : صلى بنا رسول الله صلى الله عليه وسلم فلم يسمعنا قراءة ( بسم الله الرحمن الرحيم ) . وما رواه عمار بن زريق عن الأعمش عن شعبة عن ثابت عن أنس قال : صليت مع رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان فلم أسمع أحدا منهم يقرأ بسم الله الرحمن الرحيم .[ ص: 93 ] قلت : هذا قول حسن ، وعليه تتفق الآثار عن أنس ولا تتضاد ويخرج به من الخلاف في قراءة البسملة . وقد روي عن سعيد بن جبير قال : كان المشركون يحضرون بالمسجد ; فإذا قرأ رسول الله صلى الله عليه وسلم : ( بسم الله الرحمن الرحيم ) قالوا : هذا محمد يذكر رحمان اليمامة - يعنون مسيلمة - فأمر أن يخافت ب \" بسم الله الرحمن الرحيم \" ، ونزل : ولا تجهر بصلاتك ولا تخافت بها . قال الترمذي الحكيم أبو عبد الله : فبقي ذلك إلى يومنا هذا على ذلك الرسم وإن زالت العلة ، كما بقي الرمل في الطواف وإن زالت العلة ، وبقيت المخافتة في صلاة النهار وإن زالت العلة .السادسة : اتفقت الأمة على جواز كتبها في أول كل كتاب من كتب العلم والرسائل ; فإن كان الكتاب ديوان شعر فروى مجالد عن الشعبي قال : أجمعوا ألا يكتبوا أمام الشعر : بسم الله الرحمن الرحيم . وقال الزهري : مضت السنة ألا يكتبوا في الشعر : ( بسم الله الرحمن الرحيم ) . وذهب إلى رسم التسمية في أول كتب الشعر سعيد بن جبير ، وتابعه على ذلك أكثر المتأخرين . قال أبو بكر الخطيب : وهو الذي نختاره ونستحبه .السابعة : قال الماوردي ويقال لمن قال بسم الله : مبسمل ، وهي لغة مولدة ، وقد جاءت في الشعر ; قال عمر بن أبي ربيعة :لقد بسملت ليلى غداة لقيتها فيا حبذا ذاك الحبيب المبسملقلت : المشهور عن أهل اللغة بسمل . قال يعقوب بن السكيت والمطرز والثعالبي وغيرهم من أهل اللغة : بسمل الرجل ، إذا قال : بسم الله . يقال : قد أكثرت من البسملة ; أي من قول بسم الله ، ومثله : حوقل الرجل ، إذا قال : لا حول ولا قوة إلا بالله ، وهلل ، إذا قال : لا إله إلا الله ، وسبحل ، إذا قال : سبحان الله ، وحمدل ، إذا قال : الحمد لله ، وحيصل ، إذا قال : حي على الصلاة ، وجعفل ، إذا قال : جعلت فداك . وطبقل ، إذا قال : أطال الله بقاءك . ودمعز ، إذا قال أدام الله عزك . وحيفل ، إذا قال : حي على الفلاح . ولم يذكر المطرز : الحيصلة ، إذا قال : حي على الصلاة . وجعفل ، إذا قال : جعلت فداك . وطبقل ، إذا قال أطال الله بقاءك . ودمعز إذا قال : أدام الله عزك .الثامنة : ندب الشرع إلى ذكر البسملة في أول كل فعل ; كالأكل والشرب والنحر ; والجماع والطهارة وركوب البحر ، إلى غير ذلك من الأفعال ; قال الله تعالى : فكلوا مما ذكر اسم الله عليه . وقال اركبوا فيها بسم الله مجريها ومرساها . وقال رسول الله صلى الله عليه وسلم : أغلق بابك واذكر اسم الله وأطفئ مصباحك واذكر اسم الله وخمر إناءك واذكر اسم الله وأوك سقاءك واذكر اسم الله . وقال لو أن أحدكم إذا أراد أن يأتي أهله قال : بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فإنه إن يقدر بينهما ولد في ذلك لم يضره شيطان أبدا . وقال لعمر بن أبي سلمة يا غلام سم الله وكل بيمينك وكل مما يليك وقال : إن الشيطان يستحل الطعام أن لا يذكر اسم الله عليه وقال : من لم يذبح فليذبح باسم الله . وشكا إليه عثمان بن أبي العاص وجعا يجده في جسده منذ أسلم ، فقال له رسول الله صلى الله عليه وسلم ضع يدك على الذي تألم من جسدك وقل بسم الله ثلاثا وقل سبع مرات أعوذ بعزة [ بالله ] وقدرته من شر ما أجد وأحاذر . هذا كله ثابت في الصحيح . وروى ابن ماجه والترمذي عن النبي صلى الله عليه وسلم قال : ستر ما بين الجن وعورات بني آدم إذا دخل الكنيف أن يقول : [ ص: 95 ] بسم الله . وروى الدارقطني عن عائشة قالت : كان رسول الله صلى الله عليه وسلم إذا مس طهوره سمى الله تعالى ، ثم يفرغ الماء على يديه .التاسعة : قال علماؤنا : وفيها رد على القدرية وغيرهم ممن يقول : إن أفعالهم مقدورة لهم ، وموضع الاحتجاج عليهم من ذلك أن الله سبحانه أمرنا عند الابتداء بكل فعل أن نفتتح بذلك ، كما ذكرنا .فمعنى بسم الله ، أي بالله . ومعنى ( بالله ) أي بخلقه وتقديره يوصل إلى ما يوصل إليه . وسيأتي لهذا مزيد بيان إن شاء الله تعالى . وقال بعضهم : معنى قوله ( بسم الله ) يعني بدأت بعون الله وتوفيقه وبركته ; وهذا تعليم من الله تعالى عباده ، ليذكروا اسمه عند افتتاح القراءة وغيرها ، حتى يكون الافتتاح ببركة الله جل وعز .العاشرة : ذهب أبو عبيدة معمر بن المثنى إلى أن ( اسم ) صلة زائدة ، واستشهد بقول لبيد :إلى الحول ثم اسم السلام عليكما ومن يبك حولا كاملا فقد اعتذرفذكر ( اسم ) زيادة ، وإنما أراد : ثم السلام عليكما .وقد استدل علماؤنا بقول لبيد هذا على أن الاسم هو المسمى . وسيأتي الكلام فيه في هذا الباب وغيره ، إن شاء الله تعالى .الحادية عشرة : اختلف في معنى زيادة : \" اسم \" ; فقال قطرب : زيدت لإجلال ذكره تعالى وتعظيمه . وقال الأخفش : زيدت ليخرج بذكرها من حكم القسم إلى قصد التبرك ; لأن أصل الكلام : بالله .الثانية عشرة : اختلفوا أيضا في معنى دخول الباء عليه ، هل دخلت على معنى الأمر ؟ والتقدير : ابدأ بسم الله . أو على معنى الخبر ؟ والتقدير : ابتدأت بسم الله ; قولان : الأول [ ص: 96 ] للفراء ، والثاني للزجاج . ف ( باسم ) في موضع نصب على التأويلين . وقيل : المعنى ابتدائي بسم الله ; ف ( بسم الله ) في موضع رفع خبر الابتداء . وقيل : الخبر محذوف ; أي ابتدائي مستقر أو ثابت بسم الله ; فإذا أظهرته كان \" بسم الله \" في موضع نصب بثابت أو مستقر ، وكان بمنزلة قولك : زيد في الدار . وفي التنزيل : فلما رآه مستقرا عنده قال هذا من فضل ربي ف ( عنده ) في موضع نصب ; روي هذا عن نحاة أهل البصرة . وقيل : التقدير ابتدائي ببسم الله موجود أو ثابت ، ف ( باسم ) في موضع نصب بالمصدر الذي هو ابتدائي .الثالثة عشرة : بسم الله ، تكتب بغير ألف استغناء عنها بباء الإلصاق في اللفظ والخط لكثرة الاستعمال ، بخلاف قوله : اقرأ باسم ربك فإنها لم تحذف ؛ لقلة الاستعمال . واختلفوا في حذفها مع الرحمن والقاهر ; فقال الكسائي وسعيد الأخفش : تحذف الألف . وقال يحيى بن وثاب : لا تحذف إلا مع بسم الله فقط ، لأن الاستعمال إنما كثر فيه .الرابعة عشر : واختلف في تخصيص باء الجر بالكسر على ثلاثة معان ; فقيل : ليناسب لفظها عملها . وقيل : لما كانت الباء لا تدخل إلا على الأسماء خصت بالخفض الذي لا يكون إلا في الأسماء . الثالث : ليفرق بينهما وبين ما قد يكون من الحروف اسما ; نحو الكاف في قول الشاعر :ورحنا بكابن الماء يجنب وسطناأي بمثل ابن الماء أو ما كان مثله .الخامسة عشرة : اسم ، وزنه افع ، والذاهب منه الواو ; لأنه من سموت ، وجمعه أسماء ، وتصغيره سمي . واختلف في تقدير أصله ، فقيل : فعل ، وقيل : فعل . قال الجوهري : وأسماء يكون جمعا لهذا الوزن ، وهو مثل جذع وأجذاع ، وقفل وأقفال ; وهذا لا تدرك صيغته إلا بالسماع . وفيه أربع لغات : إسم بالكسر ، وأسم بالضم . قال أحمد بن يحيى : من ضم الألف أخذه من سموت أسمو ، ومن كسر أخذه من سميت أسمي . ويقال : سم وسم ، وينشد :والله أسماك سما مباركا آثرك الله به إيثاركا[ ص: 97 ] وقال آخر :وعامنا أعجبنا مقدمه     يدعى أبا السمح وقرضاب سمهمبتركا كل عظم يلحمهقرضب الرجل : إذا أكل شيئا يابسا ، فهو قرضاب . ( سمه ) بالضم والكسر جميعا .ومنه قول الآخر :باسم الذي في كل سورة سمهوسكنت السين من ( باسم ) اعتلالا على غير قياس ، وألفه ألف وصل ، وربما جعلها الشاعر ألف قطع للضرورة ; كقول الأحوص :وما أنا بالمخسوس في جذم مالك     ولا من تسمى ثم يلتزم الإسماالسادسة عشرة : تقول العرب في النسب إلى الاسم : سموي ، وإن شئت \" اسمي \" ، تركته على حاله ، وجمعه أسماء ، وجمع الأسماء أسام . وحكى الفراء : أعيذك بأسماوات الله .السابعة عشرة : اختلفوا في اشتقاق الاسم على وجهين : فقال البصريون : هو مشتق من السمو وهو العلو والرفعة ، فقيل : اسم لأن صاحبه بمنزلة المرتفع به . وقيل : لأن الاسم يسموا بالمسمى فيرفعه عن غيره . وقيل : إنما سمي الاسم اسما لأنه علا بقوته على قسمي الكلام : الحرف والفعل ; والاسم أقوى منهما بالإجماع لأنه الأصل ; فلعلوه عليهما سمي اسما ; فهذه ثلاثة أقوال .وقال الكوفيون : إنه مشتق من السمة وهي العلامة ; لأن الاسم علامة لمن وضع له ; فأصل اسم على هذا ( وسم ) . والأول أصح ; لأنه يقال في التصغير سمي وفي الجمع أسماء ; والجمع والتصغير يردان الأشياء إلى أصولها ; فلا يقال : وسيم ولا أوسام . ويدل على صحته أيضا فائدة الخلاف وهي :الثامنة عشرة : فإن من قال الاسم مشتق من العلو يقول : لم يزل الله سبحانه موصوفا قبل وجود الخلق وبعد وجودهم وعند فنائهم ، ولا تأثير لهم في أسمائه ولا صفاته ; وهذا قول أهل السنة . ومن قال الاسم مشتق من السمة يقول : كان الله في الأزل بلا اسم ولا صفة ، فلما خلق الخلق جعلوا له أسماء وصفات ، فإذا أفناهم بقي بلا اسم ولا صفة ; وهذا قول المعتزلة وهو خلاف ما أجمعت عليه الأمة ، وهو أعظم في الخطأ من قولهم : إن كلامه مخلوق ، تعالى الله عن ذلك ! وعلى هذا الخلاف وقع الكلام في الاسم والمسمى وهي :[ ص: 98 ]التاسعة عشرة : فذهب أهل الحق - فيما نقل القاضي أبو بكر بن الطيب - إلى أن الاسم هو المسمى ، وارتضاه ابن فورك ; وهو قول أبي عبيدة وسيبويه . فإذا قال قائل : الله عالم ; فقوله دال على الذات الموصوفة بكونه عالما ، فالاسم لكونه عالما وهو المسمى بعينه . وكذلك إذا قال : الله خالق ; فالخالق هو الرب ، وهو بعينه الاسم . فالاسم عندهم هو المسمى بعينه من غير تفصيل .قال ابن الحصار : من ينفي الصفات من المبتدعة يزعم أن لا مدلول للتسميات إلا الذات ، ولذلك يقولون : الاسم غير المسمى ، ومن يثبت الصفات يثبت للتسميات مدلولات هي أوصاف الذات وهي غير العبارات وهي الأسماء عندهم . وسيأتي لهذه مزيد بيان في ( البقرة ) و ( الأعراف ) إن شاء الله تعالى .الموفية عشرين - قوله : ( الله ) هذا الاسم أكبر أسمائه سبحانه وأجمعها ، حتى قال بعض العلماء : إنه اسم الله الأعظم ولم يتسم به غيره ; ولذلك لم يثن ولم يجمع ، وهو أحد تأويلي قوله تعالى : هل تعلم له سميا أي من تسمى باسمه الذي هو ( الله ) . فالله اسم للموجود الحق الجامع لصفات الإلهية ، المنعوت بنعوت الربوبية ، المنفرد بالوجود الحقيقي ، لا إله إلا هو سبحانه . وقيل : معناه الذي يستحق أن يعبد . وقيل : معناه واجب الوجود الذي لم يزل ولا يزال ; والمعنى واحد .الحادية والعشرون : واختلفوا في هذا الاسم هل هو مشتق أو موضوع للذات علم ؟ فذهب إلى الأول كثير من أهل العلم . واختلفوا في اشتقاقه وأصله ; فروى سيبويه عن الخليل أن أصله إلاه ، مثل فعال ; فأدخلت الألف واللام بدلا من الهمزة . قال سيبويه : مثل الناس أصله أناس . وقيل : أصل الكلمة ( لاه ) وعليه دخلت الألف واللام للتعظيم ، وهذا اختيار سيبويه . وأنشد :لاه ابن عمك لا أفضلت في حسب عني ولا أنت دياني فتخزونيكذا الرواية : فتخزوني ، بالخاء المعجمة ومعناه : تسوسني .وقال الكسائي والفراء : معنى \" بسم الله \" بسم الإله ; فحذفوا الهمزة وأدغموا اللام الأولى في الثانية فصارتا لاما مشددة ; كما قال عز وجل : لكنا هو الله ربي ومعناه : لكن أنا ، كذلك قرأها الحسن . ثم قيل : هو مشتق من ( وله ) إذا تحير ; والوله : ذهاب العقل . يقال : [ ص: 99 ] رجل واله وامرأة والهة وواله ، وماء موله : أرسل في الصحاري . فالله سبحانه تتحير الألباب وتذهب في حقائق صفاته والفكر في معرفته . فعلى هذا أصل : ( إلاه ) ، ( ولاه ) وأن الهمزة مبدلة من واو كما أبدلت في إشاح ووشاح ، وإسادة ووسادة ، وروي عن الخليل . وروي عن الضحاك أنه قال : إنما سمي : ( الله ) إلها ، لأن الخلق يتألهون إليه في حوائجهم ، ويتضرعون إليه عند شدائدهم ، وذكر عن الخليل بن أحمد أنه قال : لأن الخلق يألهون إليه ( بنصب اللام ) ويألهون أيضا ( بكسرها ) وهما لغتان . وقيل : إنه مشتق من الارتفاع ، فكانت العرب تقول لكل شيء مرتفع لاها ، فكانوا يقولون إذا طلعت الشمس : لاهت . وقيل : هو مشتق من أله الرجل إذا تعبد . وتأله إذا تنسك ، ومن ذلك قوله تعالى : ( ويذرك وإلاهتك ) على هذه القراءة ; فإن ابن عباس وغيره قالوا : وعبادتك .قالوا : فاسم الله مشتق من هذا ، فالله سبحانه معناه المقصود بالعبادة ، ومنه قول الموحدين : لا إله إلا الله ، معناه لا معبود غير الله . و ( إلا ) في الكلمة بمعنى غير ، لا بمعنى الاستثناء . وزعم بعضهم أن الأصل فيه ( الهاء ) التي هي الكناية عن الغائب ، وذلك أنهم أثبتوه موجودا في فطر عقولهم فأشاروا إليه بحرف الكناية ثم زيدت فيه لام الملك إذ قد علموا أنه خالق الأشياء ومالكها فصار ( له ) ثم زيدت فيه الألف واللام تعظيما وتفخيما .القول الثاني : ذهب إليه جماعة من العلماء أيضا منهم الشافعي وأبو المعالي والخطابي والغزالي والمفضل وغيرهم ، وروي عن الخليل وسيبويه : أن الألف واللام لازمة له لا يجوز حذفهما منه . قال الخطابي : والدليل على أن الألف واللام من بنية هذا الاسم ، ولم يدخلا للتعريف : دخول حرف النداء عليه ; كقولك : يا الله ، وحروف النداء لا تجتمع مع الألف واللام للتعريف ; ألا ترى أنك لا تقول : يا الرحمن ولا : يا الرحيم ، كما تقول : يا الله ، فدل على أنهما من بنية الاسم . والله أعلم .الثانية والعشرون : واختلفوا أيضا في اشتقاق اسمه الرحمن ; فقال بعضهم : لا اشتقاق له لأنه من الأسماء المختصة به سبحانه ، ولأنه لو كان مشتقا من الرحمة لاتصل بذكر المرحوم ، فجاز أن يقال : الله رحمن بعباده ، كما يقال : رحيم بعباده . وأيضا لو كان مشتقا من الرحمة لم تنكره العرب حين سمعوه ، إذ كانوا لا ينكرون رحمة ربهم ، وقد قال الله عز وجل : وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن الآية . ولما كتب علي رضي الله عنه في صلح الحديبية بأمر النبي صلى الله عليه وسلم : بسم الله الرحمن الرحيم قال سهيل بن عمرو : أما ( بسم الله [ ص: 100 ] الرحمن الرحيم ) فما ندري ما ( بسم الله الرحمن الرحيم ) ! ولكن اكتب ما نعرف : باسمك اللهم ، الحديث . قال ابن العربي‏ : إنما جهلوا الصفة دون الموصوف ، واستدل على ذلك بقولهم : وما الرحمن ؟ ولم يقولوا : ومن الرحمن ؟ قال ابن الحصار : وكأنه رحمه الله لم يقرأ الآية الأخرى : \" وهم يكفرون بالرحمن \" . وذهب الجمهور من الناس إلى أن ( الرحمن ) مشتق من الرحمة مبني على المبالغة ; ومعناه ذو الرحمة الذي لا نظير له فيها ؛ فلذلك لا يثنى ولا يجمع كما يثنى ( الرحيم ) ويجمع .قال ابن الحصار : ومما يدل على الاشتقاق ما خرجه الترمذي وصححه عن عبد الرحمن بن عوف أنه سمع رسول الله صلى الله عليه وسلم يقول : قال الله عز وجل أنا الرحمن خلقت الرحم وشققت لها اسما من اسمي فمن وصلها وصلته ومن قطعها قطعته . وهذا نص في الاشتقاق ، فلا معنى للمخالفة والشقاق ، وإنكار العرب له لجهلهم بالله وبما وجب له .الثالثة والعشرون : زعم المبرد فيما ذكر ابن الأنباري في كتاب ( الزاهر ) له : أن ( الرحمن ) اسم عبراني فجاء معه ب ( الرحيم ) وأنشد :لن تدركوا المجد أو تشروا عباءكم بالخز أو تجعلوا الينبوت ضمرانا     أو تتركون إلى القسين هجرتكمومسحكم صلبهم رحمان قرباناقال أبو إسحاق الزجاج في ( معاني القرآن ) : وقال أحمد بن يحيى : \" الرحيم \" عربي و \" الرحمان \" عبراني ، فلهذا جمع بينهما . وهذا القول مرغوب عنه .وقال أبو العباس : النعت قد يقع للمدح ; كما تقول : قال جرير الشاعر : وروى مطرف عن قتادة في قول الله عز وجل ( بسم الله الرحمن الرحيم ) قال : مدح نفسه . قال أبو [ ص: 101 ] إسحاق : وهذا قول حسن . وقال قطرب : يجوز أن يكون جمع بينهما للتوكيد . قال أبو إسحاق : وهذا قول حسن ، وفي التوكيد أعظم الفائدة ، وهو كثير في كلام العرب ، ويستغنى عن الاستشهاد ; والفائدة في ذلك ما قاله محمد بن يزيد : إنه تفضل بعد تفضل ، وإنعام بعد إنعام ، وتقوية لمطامع الراغبين ، ووعد لا يخيب آمله .الرابعة والعشرون : واختلفوا هل هما بمعنى واحد أو بمعنيين ؟ فقيل : هما بمعنى واحد ; كندمان ونديم . قالهأبو عبيدة . وقيل : ليس بناء فعلان كفعيل ، فإن فعلان لا يقع إلا على مبالغة الفعل ; نحو قولك : رجل غضبان ، للممتلئ غضبا . وفعيل قد يكون بمعنى الفاعل والمفعول . قال عملس :فأما إذا عضت بك الحرب عضة فإنك معطوف عليك رحيمف ( الرحمن ) خاص الاسم عام الفعل . و ( الرحيم ) عام الاسم خاص الفعل . هذا قول الجمهور .قال أبو علي الفارسي : ( الرحمن ) اسم عام في جميع أنواع الرحمة ، يختص به الله . ( والرحيم ) إنما هو في جهة المؤمنين ; كما قال تعالى : وكان بالمؤمنين رحيما . وقال العرزمي ( الرحمن ) بجميع خلقه في الأمطار ونعم الحواس والنعم العامة ، و ( الرحيم ) بالمؤمنين في الهداية لهم ، واللطف بهم . وقال ابن المبارك : ( الرحمن ) إذا سئل أعطى ، و ( الرحيم ) إذا لم يسأل غضب . وروى ابن ماجه في سننه والترمذي في جامعه عن أبي صالح عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : من لم يسأل الله يغضب عليه لفظ الترمذي . وقال ابن ماجه : من لم يدع الله سبحانه غضب عليه . وقال : سألت أبا زرعة عن أبي صالح هذا ، فقال : هو الذي يقال له : الفارسي وهو خوزي ولا أعرف اسمه . وقد أخذ بعض الشعراء هذا المعنى فقال :الله يغضب إن تركت سؤاله     وبني آدم حين يسأل يغضبوقال ابن عباس : هما اسمان رقيقان ، أحدهما أرق من الآخر ، أي أكثر رحمة .قال الخطابي : وهذا مشكل ; لأن الرقة لا مدخل لها في شيء من صفات الله تعالى .[ ص: 102 ] وقال الحسين بن الفضل البجلي : هذا وهم من الراوي ، لأن الرقة ليست من صفات الله تعالى في شيء ، وإنما هما اسمان رفيقان أحدهما أرفق من الآخر ، والرفق من صفات الله عز وجل ; قال النبي صلى الله عليه وسلم : إن الله رفيق يحب الرفق ويعطي على الرفق ما لا يعطي على العنف .الخامسة والعشرون : أكثر العلماء على أن ( الرحمن ) مختص بالله عز وجل ، لا يجوز أن يسمى به غيره ، ألا تراه قال : قل ادعوا الله أو ادعوا الرحمن فعادل الاسم الذي لا يشركه فيه غيره . وقال : واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون فأخبر أن الرحمن هو المستحق للعبادة جل وعز . وقد تجاسر مسيلمة الكذاب - لعنه الله - فتسمى برحمان اليمامة ، ولم يتسم به حتى قرع مسامعه نعت الكذاب فألزمه الله تعالى نعت الكذاب لذلك ، وإن كان كل كافر كاذبا ، فقد صار هذا الوصف لمسيلمة علما يعرف به ، ألزمه الله إياه . وقد قيل في اسمه \" الرحمن \" : إنه اسم الله الأعظم ذكره ابن العربي .السادسة والعشرون : الرحيم صفة مطلقة للمخلوقين ، ولما في الرحمن من العموم قدم في كلامنا على الرحيم مع موافقة التنزيل ; قاله المهدوي . وقيل : إن معنى الرحيم أي بالرحيم وصلتم إلى الله وإلى الرحمن ، ف ( الرحيم ) نعت محمد صلى الله عليه وسلم ، وقد نعته تعالى بذلك فقال : ( رؤوف رحيم ) فكأن المعنى أن يقول بسم الله الرحمن وبالرحيم ، أي وبمحمد صلى الله عليه وسلم وصلتم إلي ، أي باتباعه وبما جاء به وصلتم إلى ثوابي وكرامتي والنظر إلى وجهي والله أعلم .السابعة والعشرون : روي عن علي بن أبي طالب كرم الله وجهه أنه قال في قوله ( بسم الله ) : إنه شفاء من كل داء ، وعون على كل دواء . وأما الرحمن فهو عون لكل من آمن به ، وهو اسم لم يسم به غيره . وأما الرحيم فهو لمن تاب وآمن وعمل صالحا .وقد فسره بعضهم على الحروف ; فروي عن عثمان بن عفان أنه سأل رسول الله صلى الله عليه وسلم عن تفسير ( بسم الله الرحمن الرحيم ) فقال : أما الباء فبلاء الله وروحه ونضرته وبهاؤه وأما السين [ ص: 103 ] فسناء الله وأما الميم فملك الله وأما الله فلا إله غيره وأما الرحمن فالعاطف على البر والفاجر من خلقه وأما الرحيم فالرفيق بالمؤمنين خاصة . وروي عن كعب الأحبار أنه قال : الباء بهاؤه والسين سناؤه فلا شيء أعلى منه والميم ملكه وهو على كل شيء قدير فلا شيء يعازه . وقد قيل : إن كل حرف هو افتتاح اسم من أسمائه ; فالباء مفتاح اسمه \" بصير \" ، والسين مفتاح اسمه \" سميع \" ، والميم مفتاح اسمه \" مليك \" ، والألف مفتاح اسمه \" الله \" ، واللام مفتاح اسمه \" لطيف \" ، والهاء مفتاح اسمه هاد ، والراء مفتاح اسمه \" رازق \" ، والحاء مفتاح اسمه \" حليم \" ، والنون مفتاح اسمه \" نور \" ; ومعنى هذا كله دعاء الله تعالى عند افتتاح كل شيء .الثامنة والعشرون : واختلف في وصل ( الرحيم ) ب ( الحمد لله ) ; فروي عن أم سلمة عن النبي صلى الله عليه وسلم : ( الرحيم ألحمد ) يسكن الميم ويقف عليها ، ويبتدئ بألف مقطوعة . وقرأ به قوم من الكوفيين . وقرأ جمهور الناس : ( الرحيم الحمد ) تعرب الرحيم بالخفض وبوصل الألف من ( الحمد ) . وحكى الكسائي عن بعض العرب أنها تقرأ ( الرحيم الحمد ) ، بفتح الميم وصلة الألف ; كأنه سكنت الميم وقطعت الألف ثم ألقيت حركتها على الميم وحذفت . قال ابن عطية : ولم ترو هذه قراءة عن أحد فيما علمت . وهذا نظر يحيى بن زياد في قوله تعالى : الم الله . [ ص: 104 ][ ص: 105 ]\n","ar.miqbas":"البسملة اسم لكلمة باسم الله، صيغ هذا الاسم على مادَّةٍ مؤلفة من حروف الكلمتين (باسم) و (الله) على طريقة تسمى النَّحْت، وهو صوغ فعلِ مُضِيٍ على زنة \" فَعْلَل \" مؤلفةٍ مادِّتُه من حروف جملة أو حروفِ مركَّب إِضَافِيَ، مما ينطق به الناس اختصاراً عن ذكر الجملة كلها لقصد التخفيف لكثرة دوران ذلك على الألسنة. وقد استعمل العرب النحت في النَّسَب إلى الجملة أو المركب إذا كان في النسبِ إلى صدر ذلك أو إلى عَجزه التباس، كما قالوا في النسبة إلى عبد شمس - عَبْشَمِيّ - خشية الالتباس بالنسب إلى عبدٍ أو إلى شمس، وفي النسبة إلى عبد الدار - عَبْدَرِيّ - كذلك وإلى حضرموت حضرمي قال سيبويه في باب الإضافة (أي النسَب) إلى المضاف من الأسماء: «وقد يجعلون للنسب في الإضافة اسماً بمنزلة جَعْفَري ويجعلون فيه من حروف الأول والآخر ولا يخرجونه من حروفهما ليُعْرَف» ا هـ، فجاء من خلفهم من مولدي العرب واستعملوا هذه الطريقة في حكاية الجمل التي يكثر دورانها في الألسنة لقصد الاختصار، وذلك من صدر الإسلام فصارت الطريقة عربية. قال الراعي:قَومٌ على الإسلام لَمَّا يمنعوا   ما عونَهم ويُضيِّعوا التَهْلِيلاأي لم يتركوا قول: لا إلٰه إلا الله. وقال عُمر بن أبي ربيعة:لقد بسملت ليلَى غداةَ لقيتُها   ألا حَبَّذا ذاك الحبيبُ المُبَسْمِلُأي قالت بسم الله فَرَقاً منه، فأصل بسمل قال: بسم الله ثم أطلقه المولدون على قول: بسم الله الرحمٰن الرحيم، اكتفاء واعتماداً على الشهرة وإن كان هذا المنحوتُ خِليَّاً من الحاء والراء اللذين هما من حروف الرحمان الرحيم، فشاع قولهم بسمل في معنى قال بسم الله الرحمٰن الرحيم، واشتق من فعل بسمل مصدر هو \" البسملة \" كما اشتق من هَلَّل مصدر هو \" الهيللة \" وهو مصدر قياسي لفعلل. واشتق منه اسم فاعل في بيت عمر بن أبي ربيعة ولم يسمع اشتقاق اسم مفعول.ورأيت في «شرح ابن هارون التونسي على مختصر ابن الحاجب» في باب الأذان عن المطرز في كتاب «اليواقيت»: الأفعالُ التي نحتت من أسمائها سبعة: بَسْمَلَ في بسم الله، وسَبْحَلَ في سبحان الله، وحَيْعَلَ في حي على الصلاة، وحَوْقَلَ في لا حول ولا قوة إلا بالله، وحَمْدَلَ في الحمدُ لله، وهَلَّل في لا إلٰه إلا الله، وجَيْعَل إذا قال: جُعلت فِداك، وزاد الطَّيْقَلَة في أَطال الله بقاءك، والدَّمْعَزَةَ في أدام الله عزك.ولَما كان كثير من أيمة الدين قائلاً بأنها آية من أوائل جميع السور غير براءة أو بعض السور تعين على المفسر أن يفسر معناها وحكمها وموقعها عند من عدوها آية من بعض السور.وينحصر الكلام عليها في ثلاثة مباحث. الأول: في بيان أهي آية من أوائل السور أم لا؟. الثاني: في حكم الابتداء بها عند القراءة. الثالث في تفسير معناها المختص بها.فأما المبحث الأول فهو أن لا خلاف بين المسلمين في أن لفظ { بسم الله الرحمٰن الرحيم } هو لفظ قرآني لأنه جزء آية من قوله تعالى:{ إنه من سليمان وإنه بسم الله الرحمٰن الرحيم }[النمل: 30] كما أنهم لم يختلفوا في أن الافتتاح بالتسمية في الأمور المهمة ذوات البال ورد في الإسلام، وروي فيه حديث: \" كل أمر ذي بال لا يُبدأ فيه بسم الله الرحمٰن الرحيم فهو أقطع \" لم يروه أصحاب «السنن» ولا «المستدركات»، وقد وصف بأنه حسن، وقال الجمهور إن البسملة رسمها الذين كتبوا المصاحف في أوائل السور ما عدا سورة براءة، كما يؤخذ من محادثة ابن عباس مع عثمان، وقد مضت في المقدمة الثامنة، ولم يختلفوا في أنها كتبت في المصحف في أول سورة الفاتحة وذلك ليس موضع فصل السورة عما قبلها، وإنما اختلفوا في أن البسملة هل هي آية من سورة الفاتحة ومن أوائل السور غير براءة، بمعنى أن الاختلاف بينهم ليس في كونها قرآناً، ولكنه في تكرر قرآنيتها كما أشار إليه ابن رشد الحفيد في «البداية»، فذهب مالك والأوزاعي وفقهاء المدينة والشام والبصرة - وقيل باستثناء عبد الله بن عمرو ابن شهاب من فقهاء المدينة - إلى أنها ليست بآية من أوائل السور لكنها جزء آية من سورة النمل، وذهب الشافعي في أحد قوليه وأحمد وإسحاق وأبو ثور وفقهاء مكة والكوفة غير أبي حنيفة، إلى أنها آية في أول سورة الفاتحة خاصة، وذهب عبد الله بن مبارك والشافعي في أحد قوليه وهو الأصح عنه إلى أنها آية من كل سورة. ولم ينقل عن أبي حنيفة من فقهاء الكوفة فيها شيء، وأخذ منه صاحب «الكشاف» أنها ليست من السور عنده فعَدَّه في الذين قالوا بعدم جزئيتها من السور وهو الصحيح عنه. قال عبد الحكيم لأنه قال بعدم الجهر بها مع الفاتحة في الصلاة الجهرية وكره قراءتها في أوائل السور الموصولة بالفاتحة في الركعتين الأوليين. وأَزِيدُ فأقول إنه لم ير الاقتصار عليها في الصلاة مجزئاً عن القراءة.أما حجة مذهب مالك ومن وافقه فلهم فيها مسالك: أحدها من طريق النظر، والثاني من طريق الأثر، والثالث من طريق الذوق العربي.فأما المسلك الأول: فللمالكية فيه مقالة فائقة للقاضي أبي بكر الباقلاني وتابَعَه أبو بكر ابن العربي في «أحكام القرآن» والقاضي عبد الوهاب في كتاب «الإشراف»، قال الباقلاني: «لو كانت التسمية من القرآن لكان طريق إثباتها إما التواتر أو الآحاد، والأول: باطل لأنه لوثبت بالتواتر كونها من القرآن لحصل العلم الضروري بذلك ولامتنع وقوع الخلاف فيه بين الأُمَّة، والثاني: أيضاً باطل لأن خبر الواحد لا يفيد إلا الظن فلو جعلناه طريقاً إلى إثبات القرآن لخرج القرآن عن كونه حجة يقينية، ولصار ذلك ظنياً، ولو جاز ذلك لجاز ادعاء الروافض أن القرآن دخله الزيادة والنقصان والتغيير والتحريف» ا هـ وهو كلام وجيه والأقيسة الاستثنائية التي طواها في كلامه واضحة لمن له ممارسة للمنطق وشرطياتها لا تحتاج للاستدلال لأنها بديهية من الشريعة فلا حاجة إلى بسطها.زاد أبو بكر بن العربي في «أحكام القرآن» فقال: يكفيك أنها ليست من القرآن الاختلافُ فيها، والقرآن لا يُختلف فيه ا هـ. وزاد عبد الوهاب فقال: «إن رسول الله صلى الله عليه وسلم بين القرآن بياناً واحداً متساوياً ولم تكن عادته في بيانه مختلفة بالظهور والخفاء حتى يختص به الواحد والاثنان؛ ولذلك قطعنا بمنع أن يكون شيء من القرآن لم ينقل إلينا وأبطلنا قول الرافضة إن القرآن حِمْل جَمَل عند الإمام المعصوم المنتظر فلو كانت البسملة من الحمد لبيّنها رسول الله بياناً شافياً» ا هـ. وقال ابن العربي في «العارضة»: إن القاضي أبا بكر بن الطيب، لم يتكلم من الفقه إلا في هذه المسألة خاصة لأنها متعلقة بالأصول.وقد عارض هذا الدليل أبو حامد الغزالي في «المستصفى» فقال: «نُفي كون البسملة من القرآن أيضاً إن ثبت بالتواتر لزم أن لا يبقى الخلاف (أي وهو ظاهر البطلان) وإن ثبت بالآحاد يصير القرآن ظنياً، قال: ولا يقال: إن كون شيء ليس من القرآن عدم والعدم لا يحتاج إلى الإثبات لأنه الأصل بخلاف القول بأنها من القرآن، لأنّا نجيب بأن هذا وإن كان عدماً إلا أن كون التسمية مكتوبة بخط القرآن يوهن كونها ليست من القرآن فهٰهنا لا يمكننا الحكم بأنها ليست من القرآن إلا بالدليل ويأتي الكلام في أن الدليل ما هو، فثبت أن الكلام الذي أورده القاضي لازم عليه ا هـ، وتبعه على ذلك الفخر الرازي في «تفسيره» ولا يخفى أنه آل في استدلاله إلى المصادرة إذ قد صار مرجع استدلال الغزالي وفخر الدين إلى رسم البسملة في المصاحف، وسنتكلم عن تحقيق ذلك عند الكلام على مدرك الشافعي. وتعقب ابن رشد في «بداية المجتهد» كلام الباقلاني والغزالي بكلام غير محرر فلا نطيل به.وأما المسلك الثاني: وهو الاستدلال من الأثر فلا نجد في صحيح السنة ما يشهد بأن البسملة آية من أوائل سور القرآن والأدلة ستة:الدليل الأول: ما روى مالك في «الموطأ» عن العلاء بن عبد الرحمٰن عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال: \" قال الله تعالى قسمت الصلاة نصفين بيني وبين عبدي فنصفها لي ونصفها لعبدي ولعبدي ما سأل، يقول العبد: { الحمد لله رب العالمين } ، فأقول: حمدني عبدي \" الخ، والمراد في الصلاة القراءة في الصلاة ووجه الدليل منه أنه لم يذكر بسم الله الرحمٰن الرحيم.الثاني: حديث أُبيّ بن كعب في «الموطأ» و«الصحيحين» أن رسول الله صلى الله عليه وسلم قال له: \" ألا أعلمك سورة لم يُنْزَل في التوراة ولا في الإنجيل مثُلها قبل أن تخرج من المسجد \" قال: بلى، فلما قارب الخروج قال له: كيف تقرأ إذا افتتحت الصلاة؟ قال أبيٌّ فقرأت { الحمد لله رب العالمين } حتى أتيت على آخرها، فهذا دليل على أنه لم يقرأ منها البسملة.الثالث: ما في «صحيح مسلم» و«سنن أبي داود» و«سنن النسائي» عن أنس بن مالك من طرق كثيرة أنه قال: صليت خلف رسول الله وأبي بكر وعمر فكانوا يستفتحون بالحمد لله رب العالمين لا يذكرون (بسم الله الرحمٰن الرحيم)، لا في أول قراءة ولا في آخرها.الرابع: حديث عائشة في «صحيح مسلم» و«سنن أبي داود» قالت: كان رسول الله يستفتح الصلاة بالتكبير والقراءةَ بالحمد لله رب العالمين.الخامس: ما في «سنن الترمذي والنسائي» عن عبد الله بن مغفل قال: صليت مع النبي وأبي بكر وعمر وعثمان، فلم أسمع أحداً منهم يقول: (بسم الله الرحمٰن الرحيم)، إذا أنت صليت فقل { الحمد لله رب العالمين }.السادس - وهو الحاسم -: عمل أهل المدينة، فإن المسجد النبوي من وقت نزول الوحي إلى زمن مالك صلى فيه رسول الله والخلفاء الراشدون والأمراء وصلى وراءهم الصحابة وأهل العلم ولم يسمع أحد قرأ (بسم الله الرحمٰن الرحيم) في الصلاة الجهرية، وهل يقول عالم أن بعض السورة جهر وبعضها سر، فقد حصل التواتر بأن النبي والخلفاء لم يجهروا بها في الجهرية، فدل على أنها ليست من السورة ولو جهروا بها لما اختلف الناس فيها.وهناك دليل آخر لم يذكروه هنا وهو حديث عائشة في بدء الوحي إلى رسول الله صلى الله عليه وسلم وهو معتبر مرفوعاً إلى النبي، وذلك قوله: «ففَجِئَه الملَك فقال: اقرأ قال رسول الله فقلت ما أنا بقارىء ــــ إلى أن قال ــــ فغطني الثالثة ثم قال:{ اقرأ باسم ربك الذي خلق }[العلق: 1] الحديث. فلم يقل فقال لي بسم الله الرحمٰن الرحيم { اقرأ بسم ربك } ، وقد ذكروا هذا في تفسير سورة العلق وفي شرح حديث بدء الوحي.وأما المسلك الثالث وهو الاستدلال من طريق الاستعمال العربي فيأتي القول فيه على مراعاة قول القائلين بأن البسملة آية من سورة الفاتحة خاصة، وذلك يوجب أن يتكرر لفظان وهما { الرحمٰن الرحيم } في كلام غير طويل ليس بينهما فصل كثير وذلك مما لا يحمد في باب البلاغة، وهذا الاستدلال نقله الإمام الرازي في «تفسيره» وأجاب عنه بقوله: إن التكرار لأجل التأكيد كثير في القرآن وإن تأكيد كونه تعالى رحماناً رحيماً من أعظم المهمات.وأَنَا أَدْفع جوابه بأن التكرار وإن كانت له مواقع محمودة في الكلام البليغ مثل التهويل، ومقام الرثاء أو التعديد أو التوكيد اللفظي، إلا أن الفاتحة لا مناسبة لها بأغراض التكرير ولا سيما التوكيد لأنه لا منكر لكونه تعالى رحماناً رحيماً، ولأن شأن التوكيد اللفظي أن يقترن فيه اللفظان بلا فصل فتعين أنه تكرير اللفظ في الكلام لوجود مقتضى التعبير عن مدلوله بطريق الاسم الظاهر دون الضمير، وذلك مشروط بأن يبعد ما بين المكرَّرَيْن بُعداً يقصيه عن السمع، وقد علمتَ أنهم عدوا في فصاحة الكلام خلوصه من كثرة التكرار، والقربُ بين الرحمٰن والرحيم حين كررا يمنع ذلك.وأجاب البيضاوي بأن نكتة التكرير هنا هي تعليل استحقاق الحمد، فقال السلكوتي أشار بهذا إلى الرد على ما قاله بعض الحنفية: إن البسملة لو كانت من الفاتحة للزم التكرار وهو جواب لا يستقيم لأنه إذا كان التعليل قاضياً بذكر صفتي { الرحمٰن الرحيم } فدفع التكرير يقتضي تجريد البسملة التي في أول الفاتحة من هاتين الصفتين بأن تصير الفاتحة هكذا: (بسم الله الحمد لله الخ).وأنا أرى في الاستدلال بمسلك الذوق العربي أن يكون على مراعاة قول القائلين بكون البسملة آية من كل سورة فينشأ من هذا القولِ أَنْ تكون فواتح سور القرآن كلُّها متماثلة وذلك مما لا يحمد في كلام البلغاء إذ الشأن أن يقع التفنن في الفواتح، بل قد عد علماء البلاغة أَهَمَّ مواضع التأنق فاتحةَ الكلام وخاتمتَه، وذكروا أن فواتح السور وخواتمها واردة على أحسن وجوه البيان وأكملها فكيف يسوغ أن يُدَّعَى أَن فواتح سوره جملةٌ واحدة، مع أن عامة البلغاء من الخطباء والشعراء والكتاب يتنافسون في تفنن فواتح منشآتهم ويعيبون من يلتزم في كلامه طريقة واحدة فما ظنك بأبلغ كلام.وأما حجة مذهب الشافعي ومن وافقه بأنها آية من سورة الفاتحة خاصة فأمور كثيرة أنهاها فخر الدين إلى سبع عشرة حجة لا يكاد يستقيم منها بعد طرح المتداخل والخارج عن محل النزاع وضعيف السند أو واهيه إلا أمران: أحدهما أحاديث كثيرة منها ما روى أبو هريرة أن النبي عليه الصلاة والسلام قال: \" فاتحة الكتاب سبع آيات أولاهن { بسم الله الرحمٰن الرحيم } \" وقول أم سلمة قرأ رسول الله صلى الله عليه وسلم الفاتحة وعدَّ: { بسم الله الرحمٰن الرحيم الحمد لله رب العالمين } آية. الثاني: الإجماع على أن ما بين الدفتين كلام الله.والجواب: أما عن حديث أبي هريرة فهو لم يخرجه أحد من رجال الصحيح إنما خرجه الطبراني وابن مردويه والبيهقي فهو نازل عن درجة الصحيح فلا يعارض الأحاديث الصحيحة، وأما حديث أم سلمة فلم يخرجه من رجال الصحيح غير أبي داود وأخرجه أحمد بن حنبل والبيهقي، وصحح بعض طرقه وقد طعن فيه الطحاوي بأنه رواه ابن أبي مليكة، ولم يثبت سماع ابن أبي مليكة من أم سلمة، يعني أنه مقطوع، على أنه روى عنها ما يخالفه، على أن شيخ الإسلام زكرياء قد صرح في «حاشيته على تفسير البيضاوي» بأنه لم يرو باللفظ المذكور وإنما روي بألفاظ تدل على أن { بسم الله } آية وحدها، فلا يؤخذ منه كونها من الفاتحة، على أن هذا يفضي إلى إثبات القرآنية بغير المتواتر وهو ما يأباه المسلمون.وأما عن الإجماع على أن ما بين الدفتين كلام الله، فالجواب أنه لا يقتضي إلا أن البسملة قرآن وهذا لانزاع فيه، وأما كون المواضع التي رسمت فيها في المصحف مما تجب قراءتها فيها، فذلك أمر يتبع رواية القراء وأخبار السنة الصحيحة فيعود إلى الأدلة السابقة.وهذا كله بناء على تسليم أن الصحابة لم يكتبوا أسماء السور وكونها مكية أو مدنية في المصحف وأن ذلك من صنع المتأخرين وهو صريح كلام عبد الحكيم في «حاشية البيضاوي»، وأما إذا ثبت أن بعض السلف كتبوا ذلك كما هو ظاهر كلام المفسرين والأصوليين والقراء كما في «لطائف الإشارات» للقسطلاني وهو مقتضى كتابة المتأخرين لذلك لأنهم ما كانوا يجرأون على الزيادة على ما فعله السلف فالاحتجاج حينئذٍ بالكتابة باطل من أصله ودعوى كون أسماء السور كتبت بلون مخالف لحِبْر القرآن، يرده أن المشاهد في مصاحف السلف أن حبرها بلون واحد ولم يكن التلوين فاشياً.وقد احتج بعضهم بما رواه البخاري عن أنس أنه سئل كيف كانت قراءة النبي؟ فقال كانت مدًّا ثم قرأ { بسم الله الرحمٰن الرحيم } يمد { بسم الله } ويمد بالرحمٰن ويمد بالرحيم، ا هـ، ولا حجة في هذا لأن ضمير قرأ وضمير يمد عائدان إلى أنس، وإنما جاء بالبسملة على وجه التمثيل لكيفية القراءة لشهرة البسملة.وحجةُ عبد الله بن المبارك وثاني قولي الشافعي ما رواه مسلم عن أنس قال: «بينا رسول الله بين أظهرنا ذات يوم إذْ أغفَى إِغفَاءَةً ثم رفع رأسه متبسماً فقلنا ما أضحكك يا رسول الله؟ قال: أنزلت عليَّ سورة آنفاً فقرأ بسم الله الرحمٰن الرحيم{ إنا أعطيناك الكوثر }[الكوثر: 1] السورة، قالوا وللإجماع على أن ما بين الدفتين كلام الله ولإثبات الصحابة إياها في المصاحف مع حرصهم على أن لا يدخلوا في القرآن ما ليس منه ولذلك لم يكتبوا (آمين) في الفاتحة.والجواب عن الحديث أنا نمنع أن يكون قرأ البسملة على أنها من السورة بل افتتح بها عند إرادة القراءة لأنها تغني عن الاستعاذة إذا نوى المبسمل تقديرَ أستعيذ باسم الله وحذَفَ متعلق الفعل، ويتعين حمله على نحو هذا لأن راويه أنساً بن مالك جزم في حديثه الآخر أنه لم يسمع رسول الله بسمل في الصلاة.فإن أبوا تأويله بما تأولناه لزم اضطراب أنس في روايته اضطراباً يوجب سقوطها.والحق البين في أمر البسملة في أوائل السور، أنها كتبت للفصل بين السور ليكون الفصل مناسباً لابتداء المصحف، ولئلا يكون بلفظ من غير القرآن، وقد روى أبو داود في «سننه» والترمذي وصححه عن ابن عباس أنه قال: قلت لعثمان بن عفان: «ما حملكم أن عمدتم إلى براءة وهي من المئين وإلى الأنفال وهي من المثاني فجعلتموهما في السبع الطوال ولم تكتبوا بينهما سطراً بسم الله الرحمٰن الرحيم»، قال عثمان كان النبي لما تنزل عليه الآياتُ فيدعو بعض من كان يكتب له ويقول له ضع هذه الآية بالسورة التي يذكر فيها كذا وكذا، أو تنزل عليه الآية والآيتان فيقول مثل ذلك، وكانت الأنفال من أول ما أنزل عليه بالمدينة، وكانت براءة من آخر ما أنزل من القرآن وكانت قصتها شبيهة بقصتها فقُبِض رسول الله ولم يبين لنا أنها منها، فظننتُ أنها منها، فمن هناك وضعتُها في السبع الطوال ولم أكتب بينهما سطر بسم الله الرحمٰن الرحيم».وأرى في هذا دلالة بينة على أن البسملة لم تكتب بين السور غيرِ الأنفال وبراءةَ إلا حينَ جُمع القرآن في مصحف واحد زمن عثمان، وأنها لم تكن مكتوبة في أوائل السور في الصحف التي جمعها زيد بن ثابت في خلافة أبي بكر إذ كانت لكل سورة صحيفة مفردة كما تقدم في المقدمة الثامنة من مقدمات هذا التفسير.وعلى أن البسملة مختلف في كونها آية من أول كل سورة غيرِ براءة، أو آية من أول سورة الفاتحة فقط، أو ليست بآية من أول شيء من السور؛ فإن القراء اتفقوا على قراءة البسملة عند الشروع في قراءة سورة من أولها غير براءة. ورووا ذلك عمن تلقَّوْا، فأما الذين منهم يروون اجتهاداً أو تقليداً أن البسملة آية من أول كل سورة غيرِ براءة، فأمرهم ظاهر، وقراءة البسملة في أوائل السور واجبة عندهم لا محالة في الصلاة وغيرها، وأما الذين لا يروون البسملة آية من أوائل السور كلها أو ما عدا الفاتحة فإن قراءتهم البسملة في أول السورة عند الشروع في قراءة سورة غير مسبوقة بقراءة سورة قبلها تُعلَّل بالتيمن باقتفاء أثر كُتَّاب المصحف، أي قصد التشبُه في مجرد ابتداء فعل تشبيهاً لابتداء القراءة بابتداء الكتابة. فتكون قراءتهم البسملة أمراً مستحباً للتأسي في القراءة بما فعله الصحابة الكاتبون للمصحف، فقراءة البسملة عند هؤلاء نظير النطْق بالاستعاذة ونظير التهليل والتكبير بين بعض السور مِن آخر المفصَّل، ولا يبسملون في قراءة الصلاة الفريضة، وهؤلاء إذا قرأوا في صلاة الفريضة تجري قراءتهم على ما انتهى إليه فهمهم من أمر البسملة من اجتهاد أو تقليد.وبهذا تعلم أنه لا ينبغي أن يؤخذ من قراءتهم قولٌ لهم بأن البسملة آية من أول كل سورة كما فعل صاحب «الكشاف» والبيضاوي.واختلفوا في قراءة البسملة في غير الشروع في قراءة سورةٍ من أولها، أي في قراءة البسملة بين السورتين.فورد عن نافع في أشهر الروايات عنه وابنُ عامر، وأبو عمرو، وحمزة، ويعقوبُ، وخلف، لا يبسملون بين السورتين وذلك يعلل بأن التشبُّه بفعل كتَّاب المصحف خاص بالابتداء، وبحملهم رسمَ البسملة في المصحف على أنه علامة على ابتداء السورة لا على الفصل، إذ لو كانت البسملة علامة على الفصل بين السورة والتي تليها لما كتبت في أول سورة الفاتحة، فكان صنيعُهم وجيهاً لأنهم جمعوا بين ما روَوه عن سلفهم وبين دليلِ قصد التيمن، ودليل رأيهم أن البسملة ليست آية من أول كل سورة.وقالون عن نافع وابنُ كثير وعاصمٌ والكسائي وأبو جعفر يبسملون بين السورتين سوى ما بين الأنفال وبراءة، وعدوه من سنة القراءة، وليس حظهم في ذلك إلا اتباع سلفهم، إذ ليس جميعهم من أهل الاجتهاد، ولعلهم طردوا قصد التيمن بمشابهة كُتَّاب المصحف في الإشعار بابتداء السورة والإشعار بانتهاء التي قبلها.واتفق المسلمون على ترك البسملة في أول سورة براءة وقد تبين وجه ذلك آنفاً، ووجَّهه الأئمة بوجوه أخر تأتي في أول سورة براءة، وذكر الجاحظ في «البيان والتبيين» أن مُؤرِّجاً السَّدُوسي البصري سمع رجلاً يقول: «أميرُ المؤمنين يَرُدُّ على المظلوم» فرجع مؤرج إلى مُصحفه فردَّ على براءة بسم الله الرحمٰن الرحيم، ويحمل هذا الذي صنعه مُؤَرج - إن صح عنه - نما هو على التمليح والهزل وليس على الجد.وفي هذا ما يدل على أن اختلاف مذاهب القراء في قراءة البسملة في مواضع من القرآن ابتداء ووصلاً كما تقدم لا أثر له في الاختلاف في حكم قراءتها في الصلاة، فإن قراءتها في الصلاة تجري على أحكام النظر في الأدلة، وليست مذاهب القراء بمعدودة من أدلة الفقه، وإنما قراءاتهم روايات وسنة متبعة في قراءة القرآن دون استناد إلى اعتبار أحكام رواية القرآن من تواتر ودونه، ولا إلى وجوب واستحباب وتخيير، فالقارىء يقرأ كما روى عن معلميه ولا ينظر في حكم ما يقرأه من لزوم كونه كما قرأ أو عدم اللزوم، فالقراء تجري أعمالهم في صلاتهم على نزعاتهم في الفقه من اجتهاد وتقليد، ويوضح غلط من ظن أن خلاف الفقهاء في إثبات البسملة وعدمه مبني على خلاف القراء، كما يوضح تسامح صاحب «الكشاف» في عده مذاهب القراء في نسق مذاهب الفقهاء. وإنما اختلف المجتهدون لأجل الأدلة التي تقدم بيانها، وأما الموافقة بينهم وبين قراء أمصارهم غالباً في هاته المسألة فسببه شيوع القول بين أهل ذلك العصر بما قال به فقهاؤه في المسائل، أو شيوع الأدلة التي تلقاها المجتهدون من مشائخهم بين أهل ذلك العصر ولو من قبل ظهور المجتهد مثل سَبْق نافِعِ بن أبي نعيم إلى عدم ذكر البسملة قبل أن يقول مالك بعدم جزئيتها؛ لأن مالكاً تلقى أدلة نفيِ الجزئية عن علماء المدينة وعنهم أو عن شيوخهم تلقى نافع بن أبي نعيم، وإذ قد كنا قد تقلدنا مذهب مالك واطمأننا لمداركه في انتفاء كون البسملة آية من أول سورة البقرة كان حقاً علينا أن لا نتعرض لتفسيرها هنا وأن نرجئه إلى الكلام على قوله تعالى في سورة النمل (30):{ إنه من سليمان وإنه بسم الله الرحمٰن الرحيم }غير أننا لما وجدنا من سلفنا من المفسرين كلهم لم يهملوا الكلام على البسملة في هذا الموضع اقتفينا أثرهم إذ صار ذلك مصطلح المفسرين.واعلم أن متعلق المجرور في { بسم الله } محذوف تقديره هنا أقرأ، وسبب حذف متعلق المجرور أن البسملة سنت عند ابتداء الأعمال الصالحة فَحُذف متعلق المجرور فيها حذفاً ملتزماً إيجازاً اعتماداً على القرينة، وقد حكى القرآن قول سحرة فرعون عند شروعهم في السحر بقوله:{ فألقوا حبالهم وعصيهم وقالوا بعزة فرعون }[الشعراء: 44] وذكر صاحب «الكشاف» أن أهل الجاهلية كانوا يقولون في ابتداء أعمالهم: «باسم اللاتِ باسم العُزَّى» فالمجرور ظرف لغو معمول للفعل المحذوف ومتعلق به وليس ظرفاً مستقراً مثل الظروف التي تقع أخباراً، وَدليل المتعلق ينبىء عنه العمل الذي شُرع فيه فتعين أن يكون فعلاً خاصاً من النوع الدال على معنى العمل المشروع فيه دون المتعلِّق العام مثل: أبتَدِىء لأن القرينة الدالة على المتعلق هي الفعل المشروع فيه المبدوء بالبسملة فتعين أن يكون المقدر اللفظ الدال على ذلك الفعل، ولا يجري في هذا الخلاف الواقع بين النحاة في كون متعلق الظروف هل يقدر اسماً نحو كائن أو مُستقر أم فعلاً نحو كان أو استقر لأن ذلك الخلاف في الظروف الواقعة أخباراً أو أحوالاً بناء على تعارض مقتضى تقدير الاسم وهو كونه الأصل في الأخبار والحالية، ومقتضى تقدير الفعل وهو كونه الأصل في العمل لأن ما هنا ظرف لغو، والأصل فيه أن يعدى الأفعال ويتعلق بها، ولأن مقصد المبتدىء بالبسملة أن يكون جميع عمله ذلك مقارناً لبركة اسم الله تعالى فلذلك ناسب أن يقدر متعلق الجار لفظاً دالاً على الفعل المشروع فيه. وهو أنسب لتعميم التيمن لإجزاء الفعل، فالابتداء من هذه الجهة أقل عموماً، فتقدير الفعل العام يخصص وتقدير الفعل الخاص يعمم وهذا يشبه أن يلغز به. وهذا التقدير من المقدرات التي دلت عليها القرائن كقول الداعي للمُعَرِّس «بالرفاء والبنين» وقول المسافر عند حلوله وترحاله «باسم الله والبركات» وقول نساء العرب عندما يَزفُفْنَ العروس «باليُمْنِ والبركة وعلَى الطائر الميمون» ولذلك كان تقدير الفعل هٰهنا واضحاً.وقد أسعف هذا الحذف بفائدة وهي صلوحية البسملة ليَبتَدِىءَ بها كلُّ شارع في فعل فلا يلجأ إلى مخالفة لفظ القرآن عند اقتباسه، والحذف هنا من قبيل الإيجاز لأنه حذف ما قد يصرح به في الكلام، بخلاف متعلقات الظروف المستقرة نحو عندك خير، فإنهم لا يظهرون المتعلق فلا يقولون خير كائن عندك ولذلك عدوا نحو قوله:فإنك كالليل الذي هو مُدركي   من المساواة دون الإيجاز (يعني مع ما فيه من حذف المتعلق). وإذ قد كان المتعلق محذوفاً تعين أن يقدر في موضعه متقدِّماً على المتعلِّق به كما هو أصل الكلام؛ إذ لا قصد هنا لإفادة البسملة الحَصر، ودعوى صاحب «الكشاف» تقديره مُؤخراً تعمق غير مقبول، لا سيما عند حالة الحذف، فالأنسب أن يقدر على حسب الأصل.والباء باء الملابسة والملابسة، هي المصاحبة، وهي الإلصاق أيضاً فهذه مترادفات في الدلالة على هذا المعنى وهي كما في قوله تعالى:{ تنبت بالدهن }[المؤمنون: 20] وقولهم: «بالرفاء والبنين» وهذا المعنى هو أكثر معاني الباء وأشهرها، قال سيبويه: الإلصاق لا يفارق الباء وإليه ترجع تصاريف معانيها ولذلك قال صاحب «الكشاف»: «وهذا الوجه (أي الملابسة) أعْرَبُ وأحسن» أي أحسن من جعل الباء للآلة أي أدخل في العربية وأحسن لما فيه من زيادة التبرك بملابسة جميع أجزاء الفعل لاسمه تعالى.والاسم لفظ جُعِل دالاً على ذات حسية أو معنوية بشخصها أو نوعها، وجعله أئمة البصرة مشتقاً من السمو وهو الرفعة لأنها تتحقق في إطلاقات الاسم ولو بتأويل فإن أصل الاسم في كلام العرب هو العلم ولا توضع الأعلام إلا لشيء مهتم به، وهذا اعتداد بالأصل والغالب، وإلا فقد توضع الأعلام لغير ما يهتم به كما قالوا فَجَارِ علم للفَجْرة. فأصل صيغته عند البصريين من الناقص الواوي فهو إما سِمْو بوزن حِمْل، أو سُمْو بوزن قفل فحذفت اللام حذفاً لمجرد التخفيف أو لكثرة الاستعمال ولذلك جرى الإعراب على الحرف الباقي، لأنه لو حذفت لامه لعلة صرفية لكان الإعراب مقدراً على الحرف المحذوف كما في نحو قاضٍ وجَوارٍ، فلما جرى الإعراب على الحرف الباقي الذي كان ساكناً نقلوا سكونه للمتحرك وهو أول الكلمة وجلبوا همزة الوصل للنطق بالساكن؛ إذ العرب لا تستحسن الابتداء بحرف ساكن لابتناء لغتهم على التخفيف، وقد قضوا باجتلاب الهمزة وطراً ثانياً من التخفيف وهوعود الكلمة إلى الثلاثي لأن الأسماء التي تبقى بالحذف على حرفين كيدٍ ودمٍ لا تخلو من ثِقل، وفي هذا دليل على أن الهمزة لم تجتلب لتعويض الحرف المحذوف وإلا لاجتلبوها في يدٍ ودمٍ وغدٍ.وقد احتجوا على أن أصله كذلك بجمعه على أسماء بوزن أفعال، فظهرت في آخره همزة وهي منقلبة عن الواو المتطرفة إثر ألف الجمع، وبأنه جمع على أساميّ وهو جمع الجمع بوزن أفاعيل بإدغام ياء الجمع في لام الكلمة ويجوز تخفيفها كما في أثافِي وأَماني، وبأنه صُغِّر على سُمَي.وأن الفعل منه سمَّيْت، وهي حجج بينة على أن أصله من الناقص الواوي. وبأنه يقال سُمىً كهدى؛ لأنهم صاغوه على فُعَل كرُطَب فتنقلب الواو المتحركة ألفاً إثر الفتحة وأنشدوا على ذلك قول أبي خالد القَنَاني الراجز:واللَّهُ أَسْمَاكَ سُمًى مُبارَكاً   آثَرَكَ اللَّهُ بِهِ إِيثَارَكاوقال ابن يعيش: لا حجة فيه لاحتمال كونه لغة من قال سُم والنصب فيه نصب إعراب لا نصب الإعلال، ورده عبد الحكيم بأن كتابته بالإمالة تدل على خلاف ذلك. وعندي فيه أن الكتابة لا تتعلق بها الرواية فلعل الذين كتبوه بالياء هم الذين ظنوه مقصوراً، على أن قياسها الكتابة بالألف مطلقاً لأنه واوي إلا إذا أريد عدم التباس الألف بألف النصب. ورَأْيُ البصريين أرجح من ناحية تصاريف هذا اللفظ. وذهب الكوفيون إلى أن أصله وِسْم بكسر الواو لأنه من السمة وهي العَلامة، فحذفت الواو وعوضت عنها همزة الوصل ليبقى على ثلاثة أحرف ثم يتوسل بذلك إلى تخفيفه في الوصل، وكأنهم رأوا أن لا وجه لاشتقاقه من السمو لأنه قد يستعمل لأشياء غير سامية وقد علمتَ وجه الجواب، ورأي الكوفيين أرجح من جانب الاشتقاق دون التصريف، على أن همزة الوصل لم يعهد دخولها على ما حذف صدره وردوا استدلال البصريين بتصاريفه بأنها يحتمل أن تكون تلك التصاريف من القلب المكاني بأن يكون أصل اسم وسم، ثم نقلت الواو التي هي فاء الكلمة فجعلت لاماً ليتوسل بذلك إلى حذفها ورد في تصرفاته في الموضع الذي حذف منه لأنه تنوسي أصله، وأجيب عن ذلك بأن هذا بعيد لأنه خلاف الأصل وبأن القلب لا يلزم الكلمة في سائر تصاريفها وإلا لما عرف أصل تلك الكلمة. وقد اتفق علماء اللغة على أن التصاريف هي التي يعرف بها الزائد من الأصلي والمنقلب من غيره. وزعم ابن حزم في كتاب «الملل والنحل» أن كلا قولي البصريين والكوفيين فاسد افتعله النحاة ولم يصح عن العرب وأن لفظ الاسم غير مشتق بل هو جامد وتطاول ببذاءته عليهم وهي جرأة عجيبة، وقد قال تعالى:{ فاسألوا أهل الذكر إن كنتم لا تعلمون }[النحل: 43].وإنما أقحم لفظ اسم مضافاً إلى علم الجلالة إذ قيل: (بسم الله) ولم يقل بالله لأن المقصود أن يكون الفعل المشروع فيه من شؤون أهل التوحيد الموسومة باسم الإلٰه الواحد فلذلك تقحم كلمة اسم في كل ما كان على هذا المقصد كالتسمية على النسك قال تعالى:{ فكلوا مما ذكر اسم الله عليه }[الأنعام: 118] وقال:{ وما لكم ألا تأكلوا مما ذكر اسم الله عليه }[الأنعام: 119] وكالأفعال التي يقصد بها التيمن والتبرك وحصول المعونة مثل:{ اقرأ باسم ربك }[العلق: 1] فاسم الله هو الذي تمكن مقارنته للأفعال لا ذاته، ففي مثل هذا لا يحسن أن يقال بالله لأنه حينئذٍ يكون المعنى أنه يستمد من الله تيسيراً وتصرفاً من تصرفات قدرته وليس ذلك هو المقصود بالشروع، فقوله تعالى:{ فسبح باسم ربك العظيم }[الواقعة: 74] أَمْرٌ بأن يقول سبحان الله، وقوله:{ وسبحه }[الإنسان: 26] أمْرٌ بتنزيه ذاته وصفاته عن النقائص، فاستعمال لفظ الاسم في هذا بمنزلة استعمال سمات الإبل عند القبائل، وبمنزلة استعمال القبائل شعار تعارفهم، واستعمال الجيوش شعارهم المصطلح عليه. والخلاصة أن كل مقام يقصد فيه التيمن والانتساب إلى الرب الواحد الواجب الوجود يعدى فيه الفعل إلى لفظ اسم الله كقوله:{ وقال اركبوا فيها بسم الله مجراها ومرساها }[هود: 41] وفي الحديث في دعاء الاضطجاع: \" باسمك ربي وضعت جنبي وباسمك أرفعه \" وكذلك المقام الذي يقصد فيه ذكر اسم الله تعالى كقوله تعالى: { فسبح باسم ربك العظيم } أي قل سبحان الله:{ سبح اسم ربك الأعلى }[الأعلى: 1] وكل مقام يقصد فيه طلب التيسير والعون من الله تعالى يعدى الفعل المسؤول إلى علم الذات باعتبار ما له من صفات الخلق والتكوين كما في قوله تعالى:{ فاسجد له }[الإنسان: 26] وقوله في الحديث: \" اللهم بك نصبح وبك نمسي \" أي بقدرتك ومشيئتك وكذلك المقام الذي يقصد فيه توجه الفعل إلى الله تعالى كقوله تعالى: { فاسجد له } { وسبحه } أي نزه ذاته وحقيقته عن النقائص. فمعنى (بسم الله الرحمٰن الرحيم) أقرأ قراءة ملابسة لبركة هذا الاسم المبارك.هذا وقد ورد في استعمال العرب توسعات في إطلاق لفظ الاسم مرة يعنون به ما يرادف المسمى كقول النابغة:نبئتُ زُرعة والسفاهةُ كاسمها   يُهدى إليَّ غرائبَ الأَشعاريعني أن السفاهة هي لا تُعرَّف للناس بأكثر من اسمها وهو قريب من استعمال اسم الإشارة في قوله تعالى:{ وكذلك جعلناكم أمة وسطاً }[البقرة: 143]. أي مثل ذلك الجعل الواضح الشهير ويطلقون الاسم مقحماً زائداً كما في قول لبيد:إلى الحولِ ثم اسم السلام عليكُما   يعني ثم السلام عليكما وليس هذا خاصاً بلفظ الاسم بل يجىء فيما يرادفه مثل الكلمة في قوله تعالى:{ وألزمهم كلمة التقوى }[الفتح: 26] وكذلك «لفظ» في قول بشار هاجياً:وكذاك، كان أبوك يؤثر بالهُنَى   ويظل في لَفْظِ النَّدى يتَرَدَّدوقد يطلق الاسم وما في معناه كنايةً عن وجود المسمى، ومنه قوله تعالى:{ وجعلوا لله شركاء قل سموهم }[الرعد: 33] والأمر للتعجيز أي أثبتوا وجودهم ووضعَ أسماء لهم. فهذه اطلاقات أخرى ليس ذكر اسم الله في البسملة من قبيلها، وإنما نبهنا عليها لأن بعض المفسرين خلط بها في تفسير البسملة، ذكرتها هنا توضيحاً ليكون نظركم فيها فسيحاً فشدوا بها يداً ولا تتبعوا طرائق قدداً.وقد تكلموا على ملحظ تطويل الباء في رسم البسملة بكلام كله غير مقنع، والذي يظهر لي أن الصحابة لما كتبوا المصحف طولوها في سورة النمل للإشارة إلى أنها مبدأ كتاب سليمان فهي من المحكي، فلما جعلوها علامة على فواتح السور نقلوها برسمها، وتطويل الباء فيها صالح لاتخاذه قدوة في ابتداء الغرض الجديد من الكلام بحرف غليظ أو ملون.والكلام على اسم الجلالة ووصفه يأتي في تفسير قوله تعالى:{ الحمد لله رب العالمين الرحمٰن الرحيم }[الفاتحة: 2، 3].ومناسبة الجمع في البسملة بين علم الجلالة وبين صفتي الرحمٰن الرحيم، قال البيضاوي إن المُسمِّي إذا قصَد الاستعانة بالمعبود الحق الموصوف بأنه مُولي النعم كلها جليلها ودقيقها يذكر عَلَم الذات إشارة إلى استحقاقه أن يستعان به بالذات، ثم يذكر وصف الرحمٰن إشارة إلى أن الاستعانة على الأعمال الصالحة وهي نعم، وذكر الرحيم للوجوه التي سنذكرها في عطف صفة الرحيم على صفة الرحمٰن.وقال الأستاذ الإمام محمد عبده: إن النصارى كانوا يبتدئون أدعيتهم ونحوها باسم الأب والابن والروح القدس إشارة إلى الأقانيم الثلاثة عندهم، فجاءت فاتحة كتابِ الإسلام بالرد عليهم موقظة لهم بأن الإلٰه الواحد وإن تعددت أسماؤه فإنما هو تعدد الأوصاف دون تعدد المسميات، يعني فهو رد عليهم بتغليظ وتبليد. وإذا صح أن فواتح النصارى وأدعيتهم كانت تشتمل على ذلك - إذ الناقل أمين - فهي نكتة لطيفة.وعندي أن البسملة كان ما يرادفها قد جرى على ألسنة الأنبياء من عهد إبراهيم عليه السلام فهي من كلام الحنيفية، فقد حكى الله عن إبراهيم أنه قال لأبيه:{ يا أبت إني أخاف أن يمسك عذاب من الرحمٰن }[مريم: 45]، وقال:{ سأستغفر لك ربي إنه كان بي حفياً }[مريم: 47] ومعنى الحفي قريب من معنى الرحيم. وحُكِي عنه قوله:{ وتُب علينا إنك أنت التواب الرحيم }[البقرة: 128]. وورد ذكر مرادفها في كتاب سليمان إلى ملكة سبأ:{ إنه من سليمان وإنه بسم الله الرحمٰن الرحيم ألا تعلوا علي وأتوني مسلمين }[النمل: 30، 31]. والمظنون أن سليمان اقتدى في افتتاح كتابه بالبسملة بسنة موروثة من عهد إبراهيم جعلها إبراهيم كلمة باقية في وارثي نبوته، وأن الله أحيا هذه السنة في الإسلام في جملة ما أوحى له من الحنيفية كما قال تعالى:{ ملة أبيكم إبراهيم هو سماكم المسلمين من قبل }[الحج: 78].\n","ar.waseet":"{ بسم ٱلله الرَّحْمٰنِ الرَّحِيـمِ }الاسم: اللفظ الذى يدل على ذات أو معنى. وقد اختلف النحويون فى اشتقاقه على وجهين، فقال البصريون: هو مشتق من السمو، وهو العلو والرفعة، فقيل: اسم، لأن صاحبه بمنزلة المرتفع به.وقال الكوفيون: إنه مشتق من السمة وهى العلامة، لأن الاسم علامة لمن وضع له، فأصل اسم على هذا \" وسم \".ويرى المحققون أن رأى البصريين أرجح، لأنه يقال فى تصغير \" اسم \" سُمىَ، وفى جمعه أسماء، والتصغير والجمع يردان الأشياء إلى أصولها. ولو كان أصله وسم - كما قال الكوفيون - لقيل فى جمعه: أوسام، وفى تصغيره وسيم.ولفظ الجلالة وهو \" الله \" علم على ذات الخالق - عز وجل - تفرد به - سبحانه - ولا يطلق على غيره، ولا يشاركه فيه أحد.قال القرطبى: قوله \" الله \" هذا الاسم أكبر أسمائه - سبحانه - وأجمعها حتى قال بعض العلماء: إنه اسم الله الأعظم ولم يتسم به غيره، ولذلك لم يثن ولم يجمع: فالله اسم للموجود الحق الجامع لصفات الإِلهية، المنعوت بنعوت الربوبيه، المنفرد بالوجود الحقيقى، لا إله إلا هو - سبحانه -و { ٱلرَّحْمـٰنِ ٱلرَّحِيمِ } صفتان مشتقتان من الرحمة. والرحمة فى أصل اللغة: رقة فى القلب تقتضى الإِحسان، وهذا المعنى لا يليق أن يكون وصفاً لله - تعالى-، ولذا فسرها بعض العلماء بإرادة الإِحسان. وفسرها آخرون بالإِحسان نفسه.والموافق لمذهب السلف أن يقال: هى صفة قائمة بذاته - تعالى - لا نعرف حقيقتها، وإنما نعرف أثرها الذى هو الإِحسان.وقد كثرت أقوال المفسرين فى العلاقة بين هاتين الصفتين، فبعضهم يرى أن { ٱلرَّحْمـٰنِ } هو المنعم على جميع الخلق. وأن { ٱلرَّحِيمِ } هو المنعم على المؤمنين خاصه. ويرى آخرون أن { ٱلرَّحْمـٰنِ } هو المنعم بجلائل النعم، وأن { ٱلرَّحِيمِ } هو المنعم بدقائقها.ويرى فريق ثالث أن الوصفين بمعنى واحد وأن الثانى منهما تأكيد للأول. والذى يراه المحققون من العلماء أن الصفتين ليستا بمعنى واحد، بل روعى فى كل منهما معنى لم يراع فى الآخر، فالرحمن بمعنى عظيم الرحمة، لأن فعلان صيغة مبالغة فى كثرة الشئ وعظمته، ويلزم منه الدوام كغضبان وسكران. والرحيم بمعنى دائم الرحمة، لأن صيغته فعيل تستعمل فى الصفات الدائمة ككريم وظريف. فكأنه قيل: العظيم الرحمة الدائمة.أو أن { ٱلرَّحْمـٰنِ } صفة ذاتية هى مبدأ الرحمة والإِحسان. و { ٱلرَّحِيمِ } صفة فعل تدل على وصول الرحمة والإِحسان وتعديهما إلى المنعم عليه.ولعل مما يؤيد ذلك أن لفظ الرحمن لم يذكر فى القرآن إلا مجرى عليه الصفات كما هو الشأنِ فى أسماء الذات. قال - تعالى-:{ ٱلرَّحْمَـٰنُ عَلَّمَ ٱلْقُرْآنَ } و{ ٱلرَّحْمَـٰنُ عَلَى ٱلْعَرْشِ ٱسْتَوَىٰ }{ قُلِ ٱدْعُواْ ٱللَّهَ أَوِ ٱدْعُواْ ٱلرَّحْمَـٰنَ }وهكذا...أما لفظ الرحيم فقد كثر فى القرآن استعماله وصفاً فعلياً، وجاء فى الغالب بأسلوب التعدية والتعلق بالمنعم عليه. قال - تعالى -{ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٌ رَّحِيمٌ }{ وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً }{ إِنَّهُ كَانَ بِكُمْ رَحِيماً }إلخ.قال بعض العلماء \" وهذا الرأى فى نظرنا هو أقوى الآراء، فإن تخصيص أحد الوصفين بدقائق النعم أو ببعض المنعم عليهم لا دليل عليه، كما أنه ليس مستساغاً أن يقال فى القرآن: إن كلمة ذكرت بعد أخرى لمجرد تأكيد المعنى المستفاد منها \".والجار والمجرور \" بسم \" متعلق بمحذوف تقديره ابتدئ.والمعنى: ابتدئ قراءتى متبركاً ومتيمناً باسم الله الذى هو الأول والآخر، والظاهر والباطن، والذى رحمته وسعت كل شئ، وأتبرأ مما كان يفعله المشركون والضالون، من ابتدائهم قراءتهم وأفعالهم باسم اللات أو باسم العزى أو باسم غيرهما من الآلهة الباطلة.هذا وقد أجمع العلماء على أن البسملة جزء آية من سورة النمل فى قوله - تعالى -{ إِنَّهُ مِن سُلَيْمَانَ وَإِنَّهُ بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ }ثم اختلفوا بعد ذلك فى كونها آية مستقلة أنزلت للفصل بين السور مرة واحدة، أو هى آية من سورة الفاتحة ومن كل سورة ألخ.فبعضهم يرى أن البسملة آية من الفاتحة ومن كل سورة، ومن حججهم أن السلف قد أثبتوها فى المصحف مع الأمر بتجريد القرآن مما ليس منه، ولذا لم يكتبوا \" آمين \". فثبت بهذا أن البسملة جزء من الفاتحة ومن كل سورة.وبهذا الرأى قال ابن عباس وابن عمر وأبو هريرة وسعيد بن جبير والشافعى، وأحمد فى أحد قوليه.ويرى آخرون أن البسملة ليست آية من الفاتحة ولا من غيرها من السور، وقالوا: إنها آية فذة. من القرآن أنزلت للفصل والتبرك للابتداء بها، ومن حججهم أنها لو كانت آية من الفاتحة ومن كل سورة، لما اختلف الناس فى ذلك، ولما اضطربت أقوالهم فى كونها آية من كل سورة أو من الفاتحة فقط.وكما وقع الخلاف بين العلماء فى كونها آية مستقلة أو آية من كل سورة، فقد وقع الخلاف بينهم - أيضاً - فى وجوب قراءتها فى الصلاة، وفى الجهر بها أو الإِسرار إذا قرئت.وتحقيق القول فى ذلك مرجعه إلى كتب الفقه، وإلى كتب التفسير التى عنيت بتفسير آيات الأحكام.\n","ar.baghawi":"( بسم الله الرحمن الرحيم ) بسم الله الباء أداة تخفض ما بعدها مثل من وعن والمتعلق به الباء محذوف لدلالة الكلام عليه تقديره أبدأ بسم الله أو قل بسم الله . وأسقطت الألف من الاسم طلبا للخفة وكثرة استعمالها وطولت الباء قال القتيبي ليكون افتتاح كلام كتاب الله بحرف معظم كان عمر بن عبد العزيز رحمه الله يقول لكتابه طولوا الباء وأظهروا السين وفرجوا بينهما ودوروا الميم . تعظيما لكتاب الله تعالى وقيل لما أسقطوا الألف ردوا طول الألف على الباء ليكون دالا على سقوط الألف ألا ترى أنه لما كتبت الألف في \" اقرأ باسم ربك \" ( 1 - العلق ) ردت الباء إلى صيغتها ولا تحذف الألف إذا أضيف الاسم إلى غير الله ولا مع غير الباء .والاسم هو المسمى وعينه وذاته قال الله تعالى : \" إنا نبشرك بغلام اسمه يحيى \" ( 7 - مريم ) أخبر أن اسمه يحيى ثم نادى الاسم فقال : يا يحيى \" وقال : ما تعبدون من دونه إلا أسماء سميتموها \" ( 40 - يوسف ) وأراد الأشخاص المعبودة لأنهم كانوا يعبدون المسميات وقال : سبح اسم ربك \" ( 1 - الأعلى ) ، وتبارك اسم ربك \" ثم يقال للتسمية أيضا اسم فاستعماله في التسمية أكثر من المسمى فإن قيل ما معنى التسمية من الله لنفسه؟ قيل هو تعليم للعباد كيف يفتتحون القراءة .واختلفوا في اشتقاقه قال المبرد من البصريين هو مشتق من السمو وهو العلو فكأنه علا على معناه وظهر عليه وصار معناه تحته وقال ثعلب من الكوفيين : هو من الوسم والسمة وهي العلامة وكأنه علامة لمعناه والأول أصح لأنه يصغر على السمي ولو كان من السمة لكان يصغر على الوسيم كما يقال في الوعد وعيد ويقال في تصريفه سميت ولو كان من الوسم لقيل وسمت . قوله تعالى \" الله \" قال الخليل وجماعة هو اسم علم خاص لله عز وجل لا اشتقاق له كأسماء الأعلام للعباد مثل زيد وعمرو . وقال جماعة هو مشتق ثم اختلفوا في اشتقاقه فقيل من أله إلاهة أي عبد عبادة وقرأ ابن عباس رضي الله عنهما \" ويذرك وآلهتك \" ( 127 - الأعراف ) أي عبادتك - معناه أنه مستحق للعبادة دون غيره وقيل أصله إله قال الله عز وجل \" وما كان معه من إله إذا لذهب كل إله بما خلق \" ( 91 - المؤمنون ) قال المبرد : هو من قول العرب ألهت إلى فلان أي سكنت إليه قال الشاعرألهت إليها والحوادث جمةفكأن الخلق يسكنون إليه ويطمئنون بذكره ويقال ألهت إليه أي فزعت إليه قال الشاعرألهت إليها والركائب وقفوقيل أصل الإله \" ولاه \" فأبدلت الواو بالهمزة مثل وشاح وإشاح اشتقاقه من الوله لأن العباد يولهون إليه أي يفزعون إليه في الشدائد ويلجئون إليه في الحوائج كما يوله كل طفل إلى أمه وقيل هو من الوله وهو ذهاب العقل لفقد من يعز عليك .قوله ( الرحمن الرحيم ) قال ابن عباس رضي الله عنهما هما اسمان رقيقان أحدهما أرق من الآخر . واختلفوا فيهما منهم من قال هما بمعنى واحد مثل ندمان ونديم ومعناهما ذو الرحمة وذكر أحدهما بعد الآخر تطميعا لقلوب الراغبين . وقال المبرد : هو إنعام بعد إنعام وتفضل بعد تفضل ومنهم من فرق بينهما فقال الرحمن بمعنى العموم والرحيم بمعنى الخصوص . فالرحمن بمعنى الرزاق في الدنيا وهو على العموم لكافة الخلق . والرحيم بمعنى المعافي في الآخرة والعفو في الآخرة للمؤمنين على الخصوص ولذلك قيل في الدعاء يا رحمن الدنيا ورحيم الآخرة فالرحمن من تصل رحمته إلى الخلق على العموم والرحيم من تصل رحمته إليهم على الخصوص ولذلك يدعى غير الله رحيما ولا يدعى غير الله رحمن . فالرحمن عام المعنى خاص اللفظ والرحيم عام اللفظ خاص المعنى والرحمة إرادة الله تعالى الخير لأهله . وقيل هي ترك عقوبة من يستحقها وإسداء الخير إلى من لا يستحق فهي على الأول صفة ذات وعلى الثاني صفة ( فعل ) .واختلفوا في آية التسمية فذهب قراء المدينة والبصرة وفقهاء الكوفة إلى أنها ليست من فاتحة الكتاب ولا من غيرها من السور والافتتاح بها للتيمن والتبرك . وذهب قراء مكة والكوفة وأكثر فقهاء الحجاز إلى أنها من الفاتحة وليست من سائر السور وأنها كتبت للفصل وذهب جماعة إلى أنها من الفاتحة ومن كل سورة إلا سورة التوبة وهو قول الثوري وابن المبارك والشافعي لأنها كتبت في المصحف بخط سائر القرآن .واتفقوا على أن الفاتحة سبع آيات فالآية الأولى عند من يعدها من الفاتحة ( بسم الله الرحمن الرحيم ) وابتداء الآية الأخيرة ( صراط الذين ) ومن لم يعدها من الفاتحة قال ابتداؤها \" الحمد لله رب العالمين \" وابتداء الآية الأخيرة \" غير المغضوب عليهم \" واحتج من جعلها من الفاتحة ومن السور بأنها كتبت في المصحف بخط القرآن وبما أخبرنا عبد الوهاب بن محمد الكسائي أنا أبو محمد عبد العزيز بن أحمد الخلال ثنا أبو العباس محمد بن يعقوب الأصم أنا الربيع بن سليمان أنا الشافعي أنا عبد المجيد عن ابن جريج قال أخبرني أبي عن سعيد بن جبير ( قال ) \" ولقد آتيناك سبعا من المثاني والقرآن العظيم \" ( 87 - الحجر ) هي أم القرآن قال أبي وقرأها علي سعيد بن جبير حتى ختمها ثم قال : بسم الله الرحمن الرحيم \" الآية السابعة قال سعيد : قرأتها على ابن عباس كما قرأتها عليك ثم قال بسم الله الرحمن الرحيم الآية السابعة ، قال ابن عباس : فذخرها لكم فما أخرجها لأحد قبلكم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/1.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/1.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/1.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","transliteration":"Alhamdu lillaahi Rabbil 'aalameen","translations":{"en.ahmedali":"ALL PRAISE BE to Allah, Lord of all the worlds,","en.ahmedraza":"All praise is to Allah, the Lord Of The Creation.","en.arberry":"Praise belongs to God, the Lord of all Being,","en.asad":"All praise is due to God alone, the Sustainer of all the worlds,","en.daryabadi":"All praise unto Allah, the Lord of all the worlds.","en.hilali":"All the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns and all that exists).","en.pickthall":"Praise be to Allah, Lord of the Worlds,","en.qaribullah":"Praise be to Allah, Lord of the Worlds,","en.sahih":"[All] praise is [due] to Allah, Lord of the worlds -","en.sarwar":"All praise belongs to God, Lord of the Universe,","en.yusufali":"Praise be to Allah, the Cherisher and Sustainer of the worlds;","en.maududi":"Praise be to Allah, the Lord of the entire universe.","en.shakir":"All praise is due to Allah, the Lord of the Worlds.","en.itani":"Praise be to God, Lord of the Worlds.","en.mubarakpuri":"Al-Hamd be to Allah, the Lord of all that exists.","en.qarai":"All praise belongs to Allah, Lord of all the worlds,","en.wahiduddin":"All praise is due to God, the Lord of the Universe;"},"tafsir":{"ar.muyassar":"(الحَمْدُ للهِ رَبِّ العَالَمِينَ) الثناء على الله بصفاته التي كلُّها أوصاف كمال، وبنعمه الظاهرة والباطنة، الدينية والدنيوية، وفي ضمنه أَمْرٌ لعباده أن يحمدوه، فهو المستحق له وحده، وهو سبحانه المنشئ للخلق، القائم بأمورهم، المربي لجميع خلقه بنعمه، ولأوليائه بالإيمان والعمل الصالح.","ar.jalalayn":"«الحمد لله» جملة خبرية قصد بها الثناء على الله بمضمونها من أنه تعالى: مالك لجميع الحمد من الخلق أو مستحق لأن يحمدوه، والله علم على المعبود بحق «ربِّ العالمين» أي مالك جميع الخلق من الإنس والجن والملائكة والدواب وغيرهم، وكل منها يُطلق عليه عالم، يقال عالم الإنس وعالم الجن إلى غير ذلك، وغلب في جمعه بالياء والنون أولي العلم على غيرهم، وهو من العلامة لأنه علامة على موجده.","ar.qurtubi":"الحمد للهسورة الفاتحة :وفيها أربعة أبواب :[ الباب الأول في فضائلها وأسمائها ] وفيه سبع مسائلالأولى : روى الترمذي عن أبي بن كعب قال قال رسول الله صلى الله عليه وسلم : ما أنزل الله في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل . أخرج مالك عن العلاء بن عبد الرحمن بن يعقوب : أن أبا سعيد مولى [ عبد الله بن ] عامر بن كريز أخبره أن رسول الله صلى الله عليه وسلم نادى أبي بن كعب وهو يصلي ; فذكر الحديث . قال ابن عبد البر : أبو سعيد لا يوقف له على اسم وهو معدود في أهل المدينة ، [ ص: 106 ] روايته عن أبي هريرة وحديثه هذا مرسل ; وقد روى هذا الحديث عن أبي سعيد بن المعلى رجل من الصحابة لا يوقف على اسمه أيضا رواه عنه حفص بن عاصم ، وعبيد بن حنين .قلت : كذا قال في ( التمهيد ) : لا يوقف له على اسم . وذكر في كتاب الصحابة الاختلاف في اسمه . والحديث خرجه البخاري عن أبي سعيد بن المعلى قال : كنت أصلي في المسجد فدعاني رسول الله صلى الله عليه وسلم فلم أجبه ، فقلت : يا رسول الله إني كنت أصلي ; فقال : ( ألم يقل الله استجيبوا لله وللرسول إذا دعاكم ) - ثم قال لي - ( إني لأعلمنك سورة هي أعظم السور في القرآن قبل أن تخرج من المسجد ) ثم أخذ بيدي ، فلما أراد أن يخرج قلت له : ألم تقل لأعلمنك سورة هي أعظم سورة في القرآن ؟ قال : الحمد لله رب العالمين هي السبع المثاني والقرآن العظيم الذي أوتيته . قال ابن عبد البر وغيره : أبو سعيد بن المعلى من جلة الأنصار ، وسادات الأنصار ، تفرد به البخاري ، واسمه رافع ، ويقال : الحارث بن نفيع بن المعلى ، ويقال : أوس بن المعلى ، ويقال : أبو سعيد بن أوس بن المعلى ; توفي سنة أربع وسبعين وهو ابن أربع وستين سنة ، وهو أول من صلى إلى القبلة حين حولت ، وسيأتي . وقد أسند حديث أبي يزيد بن زريع قال : حدثنا روح بن القاسم عن العلاء بن عبد الرحمن عن أبيه عن أبي هريرة قال : خرج رسول الله صلى الله عليه وسلم على أبي وهو يصلي ; فذكر الحديث بمعناه .وذكر ابن الأنباري في كتاب الرد له : حدثني أبو عبيد الله الوراق حدثنا أبو داود حدثنا شيبان عن منصور عن مجاهد قال : إن إبليس - لعنه الله - رن أربع رنات : حين لعن ، وحين أهبط من الجنة ، وحين بعث محمد صلى الله عليه وسلم ، وحين أنزلت فاتحة الكتاب ، وأنزلت بالمدينة .الثانية : اختلف العلماء في تفضيل بعض السور والآي على بعض ، وتفضيل بعض أسماء الله تعالى الحسنى على بعض ، فقال قوم : لا فضل لبعض على بعض ، لأن الكل كلام الله ، وكذلك أسماؤه لا مفاضلة بينها . ذهب إلى هذا الشيخ أبو الحسن الأشعري ، والقاضي أبو بكر بن الطيب ، وأبو حاتم محمد بن حبان البستي ، وجماعة من الفقهاء . وروي معناه عن مالك . قال يحيى بن يحيى : تفضيل بعض القرآن على بعض خطأ ، وكذلك كره مالك أن تعاد سورة أو تردد دون غيرها . وقال عن مالك في قول الله تعالى : نأت بخير منها أو مثلها [ ص: 107 ] قال : محكمة مكان منسوخة . وروى ابن كنانة مثل ذلك كله عن مالك . واحتج هؤلاء بأن قالوا : إن الأفضل يشعر بنقص المفضول ، والذاتية في الكل واحدة ، وهي كلام الله ، وكلام الله تعالى لا نقص فيه . قال البستي : ومعنى هذه اللفظة ( ما في التوراة ولا في الإنجيل مثل أم القرآن ) : أن الله تعالى لا يعطي لقارئ التوراة والإنجيل من الثواب مثل ما يعطي لقارئ أم القرآن ، إذ الله بفضله فضل هذه الأمة على غيرها من الأمم ، وأعطاها من الفضل على قراءة كلامه أكثر مما أعطى غيرها من الفضل على قراءة كلامه ، وهو فضل منه لهذه الأمة . قال ومعنى قوله : ( أعظم سورة ) أراد به في الأجر ، لا أن بعض القرآن أفضل من بعض . وقال قوم بالتفضيل ، وأن ما تضمنه قوله تعالى وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم وآية الكرسي ، وآخر سورة الحشر ، وسورة الإخلاص من الدلالات على وحدانيته وصفاته ليس موجودا مثلا في تبت يدا أبي لهب وما كان مثلها .والتفضيل إنما هو بالمعاني العجيبة وكثرتها ، لا من حيث الصفة ، وهذا هو الحق . وممن قال بالتفضيل إسحاق بن راهويه وغيره من العلماء والمتكلمين ، وهو اختيار القاضي أبي بكر بن العربي وابن الحصار ، لحديث أبي سعيد بن المعلى وحديث أبي بن كعب أنه قال : قال لي رسول الله صلى الله عليه وسلم : ( يا أبي أي آية معك في كتاب الله أعظم ) قال : الله لا إله إلا هو الحي القيوم . قال : فضرب في صدري وقال : ( ليهنك العلم أبا المنذر ) أخرجه البخاري ومسلم .قال ابن الحصار : عجبي ممن يذكر الاختلاف مع هذه النصوص .وقال ابن العربي : قوله : \" ما أنزل الله في التوراة ولا في الإنجيل ولا في القرآن مثلها \" وسكت عن سائر الكتب ، كالصحف المنزلة والزبور وغيرها ، لأن هذه المذكورة أفضلها ، وإذا كان الشيء أفضل الأفضل ، صار أفضل الكل . كقولك : زيد أفضل العلماء فهو أفضل الناس .[ ص: 108 ] وفي الفاتحة من الصفات ما ليس لغيرها ، حتى قيل : إن جميع القرآن فيها . وهي خمس وعشرون كلمة تضمنت جميع علوم القرآن . ومن شرفها أن الله سبحانه قسمها بينه وبين عبده ، ولا تصح القربة إلا بها ، ولا يلحق عمل بثوابها ، وبهذا المعنى صارت أم القرآن العظيم ، كما صارت قل هو الله أحد تعدل ثلث القرآن ، إذ القرآن توحيد وأحكام ووعظ ، و قل هو الله أحد فيها التوحيد كله ، وبهذا المعنى وقع البيان في قوله عليه السلام لأبي . ( أي آية في القرآن أعظم ) قال : الله لا إله إلا هو الحي القيوم . وإنما كانت أعظم آية لأنها توحيد كلها كما صار قوله : أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله وحده لا شريك له أفضل الذكر ; لأنها كلمات حوت جميع العلوم في التوحيد ، والفاتحة تضمنت التوحيد والعبادة والوعظ والتذكير ، ولا يستبعد ذلك في قدرة الله تعالى .الثالثة : روى علي بن أبي طالب رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : ( فاتحة الكتاب ، وآية الكرسي ، و شهد الله أنه لا إله إلا هو ، و قل اللهم مالك الملك ، هذه الآيات معلقات بالعرش ليس بينهن وبين الله حجاب ) . أسنده أبو عمرو الداني في كتاب ( البيان ) له .الرابعة : في أسمائها ، وهي اثنا عشر اسما :( الأول ) : الصلاة ، قال الله تعالى : ( قسمت الصلاة بيني وبين عبدي نصفين ) الحديث . وقد تقدم .( الثاني ) : الحمد ، لأن فيها ذكر الحمد ; كما يقال : سورة الأعراف ، والأنفال ، والتوبة ، ونحوها .( الثالث ) : فاتحة الكتاب ، من غير خلاف بين العلماء ; وسميت بذلك لأنه تفتتح قراءة القرآن بها لفظا ، وتفتتح بها الكتابة في المصحف خطا ، وتفتتح بها الصلوات .( الرابع ) : أم الكتاب ، وفي هذا الاسم خلاف ، جوزه الجمهور ، وكرهه أنس والحسن [ ص: 109 ] وابن سيرين . قال الحسن : أم الكتاب الحلال والحرام ، قال الله تعالى : آيات محكمات هن أم الكتاب وأخر متشابهات . وقال أنس وابن سيرين : أم الكتاب اسم اللوح المحفوظ . قال الله تعالى : وإنه في أم الكتاب .( الخامس ) : أم القرآن ، واختلف فيه أيضا ، فجوزه الجمهور ، وكرهه أنس وابن سيرين ; والأحاديث الثابتة ترد هذين القولين . روى الترمذي عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : الحمد لله أم القرآن وأم الكتاب والسبع المثاني قال : هذا حديث حسن صحيح . وفي البخاري قال : وسميت أم الكتاب لأنه يبتدأ بكتابتها في المصاحف ، ويبدأ بقراءتها في الصلاة . وقال يحيى بن يعمر : أم القرى : مكة ، وأم خراسان : مرو ، وأم القرآن : سورة الحمد . وقيل : سميت أم القرآن لأنها أوله ومتضمنة لجميع علومه ، وبه سميت مكة أم القرى لأنها أول الأرض ومنها دحيت ، ومنه سميت الأم أما لأنها أصل النسل ، والأرض أما ، في قول أمية بن أبي الصلت :فالأرض معقلنا وكانت أمنا فيها مقابرنا وفيها نولدويقال لراية الحرب : أم ; لتقدمها واتباع الجيش لها . وأصل أم أمهة ، ولذلك تجمع على أمهات ، قال الله تعالى : وأمهاتكم . ويقال أمات بغير هاء . قال :فرجت الظلام بأماتكاوقيل : إن أمهات في الناس ، وأمات في البهائم ; حكاه ابن فارس في المجمل .( السادس ) : المثاني ، سميت بذلك لأنها تثنى في كل ركعة . وقيل : سميت بذلك لأنها استثنيت لهذه الأمة فلم تنزل على أحد قبلها ذخرا لها .( السابع ) : القرآن العظيم ، سميت بذلك لتضمنها جميع علوم القرآن ، وذلك أنها تشتمل على الثناء على الله عز وجل بأوصاف كماله وجلاله ، وعلى الأمر بالعبادات والإخلاص فيها ، [ ص: 110 ] والاعتراف بالعجز عن القيام بشيء منها إلا بإعانته تعالى ، وعلى الابتهال إليه في الهداية إلى الصراط المستقيم ; وكفاية أحوال الناكثين ، وعلى بيانه عاقبة الجاحدين .( الثامن ) : الشفاء ، روى الدارمي عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : فاتحة الكتاب شفاء من كل سم .( التاسع ) : الرقية ، ثبت ذلك من حديث أبي سعيد الخدري وفيه : أن رسول الله صلى الله عليه وسلم قال للرجل ، الذي رقى سيد الحي : ( ما أدراك أنها رقية ) فقال : يا رسول الله شيء ألقي في روعي ; الحديث . خرجه الأئمة ، وسيأتي بتمامه .( العاشر ) : الأساس ، شكا رجل إلى الشعبي وجع الخاصرة ; فقال : عليك بأساس القرآن فاتحة الكتاب ، سمعت ابن عباس يقول : لكل شيء أساس ، وأساس الدنيا مكة ، لأنها منها دحيت ; وأساس السماوات عريبا ، وهي السماء السابعة ; وأساس الأرض عجيبا ، وهي الأرض السابعة السفلى ; وأساس الجنان جنة عدن ، وهي سرة الجنان عليها أسست الجنة ; وأساس النار جهنم ، وهي الدركة السابعة السفلى عليها أسست الدركات ، وأساس الخلق آدم ، وأساس الأنبياء نوح ; وأساس بني إسرائيل يعقوب ; وأساس الكتب القرآن ; وأساس القرآن الفاتحة ; وأساس الفاتحة بسم الله الرحمن الرحيم ; فإذا اعتللت أو اشتكيت فعليك بالفاتحة تشفى .( الحادي عشر ) : الوافية ، قاله سفيان بن عيينة ، لأنها لا تتنصف ولا تحتمل الاختزال ، ولو قرأ من سائر السور نصفها في ركعة ، ونصفها الآخر في ركعة لأجزأ ; ولو نصفت الفاتحة في ركعتين لم يجز .[ ص: 111 ] ( الثاني عشر ) : الكافية ، قال يحيى بن أبي كثير : لأنها تكفي عن سواها ولا يكفي سواها عنها . يدل عليه ما روى محمد بن خلاد الإسكندراني قال : قال النبي صلى الله عليه وسلم : أم القرآن عوض من غيرها وليس غيرها منها عوضا .الخامسة : قال المهلب : إن موضع الرقية منها إنما هو إياك نعبد وإياك نستعين . وقيل : السورة كلها رقية ، لقوله عليه السلام للرجل لما أخبره : ( وما أدراك أنها رقية ) ولم يقل : أن فيها رقية ; فدل هذا على أن السورة بأجمعها رقية ، لأنها فاتحة الكتاب ومبدؤه ، ومتضمنة لجميع علومه ، كما تقدم والله أعلم .السادسة : ليس في تسميتها بالمثاني وأم الكتاب ما يمنع من تسمية غيرها بذلك ، قال الله عز وجل : كتابا متشابها مثاني فأطلق على كتابه : مثاني ; لأن الأخبار تثنى فيه . وقد سميت السبع الطول أيضا مثاني ; لأن الفرائض والقصص تثنى فيها . قال ابن عباس : أوتي رسول الله صلى الله عليه وسلم سبعا من المثاني ; قال : السبع الطول . ذكره النسائي ، وهي من \" البقرة \" إلى \" الأعراف \" ست ، واختلفوا في السابعة ، فقيل : يونس ، وقيل : الأنفال والتوبة ; وهو قول مجاهد وسعيد بن جبير . وقال أعشى همدان :فلجوا المسجد وادعوا ربكم وادرسوا هذي المثاني والطولوسيأتي لهذا مزيد بيان في سورة \" الحجر \" إن شاء الله تعالى .السابعة : المثاني جمع مثنى ، وهي التي جاءت بعد الأولى ، والطول جمع أطول . وقد سميت الأنفال من المثاني لأنها تتلو الطول في القدر . وقيل : هي التي تزيد آياتها على المفصل وتنقص عن المئين . والمئون : هي السور التي تزيد كل واحدة منها على مائة آية .وفيه عشرون مسألةالأولى : أجمعت الأمة على أن فاتحة الكتاب سبع آيات ; إلا ما روي عن حسين الجعفي : أنها ست ; وهذا شاذ . وإلا ما روي عن عمرو بن عبيد أنه جعل إياك نعبد آية ، وهي على عدة ثماني آيات ; وهذا شاذ . وقوله تعالى : ولقد آتيناك سبعا من المثاني ، وقوله : ( قسمت الصلاة ) الحديث ، يرد هذين القولين .[ ص: 112 ] وأجمعت الأمة أيضا على أنها من القرآن . فإن قيل : لو كانت قرآنا لأثبتها عبد الله بن مسعود في مصحفه ، فلما لم يثبتها دل على أنها ليست من القرآن ، كالمعوذتين عنده .فالجواب ما ذكره أبو بكر الأنباري قال : حدثنا الحسن بن الحباب حدثنا سليمان بن الأشعث حدثنا ابن أبي قدامة حدثنا جرير عن الأعمش قال : أظنه عن إبراهيم قال : قيل لعبد الله بن مسعود : لم لم تكتب فاتحة الكتاب في مصحفك ؟ قال لو كتبتها لكتبتها مع كل سورة . قال أبو بكر : يعني أن كل ركعة سبيلها أن تفتتح بأم القرآن قبل السورة المتلوة بعدها ، فقال : اختصرت بإسقاطها ، ووثقت بحفظ المسلمين لها ، ولم أثبتها في موضع فيلزمني أن أكتبها مع كل سورة ، إذ كانت تتقدمها في الصلاة .الثانية : اختلفوا أهي مكية أم مدنية ؟ فقال ابن عباس وقتادة وأبو العالية الرياحي - واسمه رفيع - وغيرهم : هي مكية . وقال أبو هريرة ومجاهد وعطاء بن يسار والزهري وغيرهم : هي مدنية . ويقال : نزل نصفها بمكة ، ونصفها بالمدينة . حكاه أبو الليث نصر بن محمد بن إبراهيم السمرقندي في تفسيره . والأول أصح لقوله تعالى : ولقد آتيناك سبعا من المثاني والقرآن العظيم والحجر مكية بإجماع . ولا خلاف أن فرض الصلاة كان بمكة . وما حفظ أنه كان في الإسلام قط صلاة بغير الحمد لله رب العالمين ; يدل على هذا قوله عليه السلام : ( لا صلاة إلا بفاتحة الكتاب ) . وهذا خبر عن الحكم ، لا عن الابتداء ، والله أعلم . وقد ذكر القاضي ابن الطيب اختلاف الناس في أول ما نزل من القرآن ; فقيل : المدثر ، وقيل : اقرأ ، وقيل : الفاتحة . وذكر البيهقي في دلائل النبوة عن أبي ميسرة عمرو بن شرحبيل أن رسول الله صلى الله عليه وسلم قال لخديجة : إني إذا خلوت وحدي سمعت نداء وقد والله خشيت أن يكون هذا أمرا قالت : معاذ الله ! ما كان الله ليفعل بك ، فوالله إنك لتؤدي الأمانة ، وتصل الرحم ، وتصدق الحديث . فلما دخل أبو بكر - وليس رسول الله صلى الله عليه وسلم ثم - ذكرت خديجة حديثه له ، قالت : يا عتيق ، اذهب مع محمد إلى ورقة بن نوفل . فلما دخل رسول الله صلى الله عليه وسلم أخذ أبو بكر بيده ، فقال : انطلق بنا إلى ورقة ، فقال : ( ومن أخبرك ) . قال : خديجة ، فانطلقا إليه فقصا [ ص: 113 ] عليه ; فقال : إذا خلوت وحدي سمعت نداء خلفي يا محمد يا محمد فأنطلق هاربا في الأرض فقال : لا تفعل ، إذا أتاك فاثبت حتى تسمع ما يقول ثم ائتني فأخبرني . فلما خلا ناداه : يا محمد ، قل بسم الله الرحمن الرحيم ، الحمد لله رب العالمين - حتى بلغ ولا الضالين ، قل : لا إله إلا الله . فأتى ورقة فذكر ذلك له ; فقال له ورقة : أبشر ثم أبشر ، فأنا أشهد أنك الذي بشر به عيسى ابن مريم ، وأنك على مثل ناموس موسى ، وأنك نبي مرسل ، وأنك سوف تؤمر بالجهاد بعد يومك هذا ، وإن يدركني ذلك لأجاهدن معك . فلما توفي ورقة قال رسول الله صلى الله عليه وسلم : لقد رأيت القس في الجنة عليه ثياب الحرير لأنه آمن بي وصدقني يعني ورقة . قال البيهقي رضي الله عنه : هذا منقطع . يعني هذا الحديث ، فإن كان محفوظا فيحتمل أن يكون خبرا عن نزولها بعدما نزل عليه اقرأ باسم ربك و ياأيها المدثر .الثالثة : قال ابن عطية : ظن بعض العلماء أن جبريل عليه السلام لم ينزل بسورة الحمد ; لما رواه مسلم عن ابن عباس قال : بينما جبريل قاعد عند النبي صلى الله عليه وسلم ، سمع نقيضا من فوقه ، فرفع رأسه فقال : هذا باب من السماء فتح اليوم لم يفتح قط إلا اليوم ، فنزل منه ملك ، فقال : هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم ; فسلم وقال : أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك : فاتحة الكتاب ، وخواتيم سورة البقرة ; لن تقرأ بحرف منهما إلا أعطيته . قال ابن عطية : وليس كما ظن ، فإن هذا الحديث يدل على أن جبريل عليه السلام تقدم الملك إلى النبي صلى الله عليه وسلم معلما به وبما ينزل معه ; وعلى هذا يكون جبريل شارك في نزولها ; والله أعلم .قلت : الظاهر من الحديث يدل على أن جبريل عليه السلام لم يعلم النبي صلى الله عليه وسلم بشيء من ذلك . وقد بينا أن نزولها كان بمكة ، نزل بها جبريل عليه السلام ، لقوله تعالى : نزل به الروح الأمين وهذا يقتضي جميع القرآن ، فيكون جبريل عليه السلام نزل بتلاوتها بمكة ، ونزل الملك بثوابها بالمدينة . والله أعلم . وقد قيل : إنها مكية مدنية ، نزل بها جبريل مرتين ; حكاه الثعلبي . وما ذكرناه أولى . فإنه جمع بين القرآن والسنة ، ولله الحمد والمنة .الرابعة : قد تقدم أن البسملة ليست بآية منها على القول الصحيح ، وإذا ثبت ذلك فحكم المصلي إذا كبر أن يصله بالفاتحة ولا يسكت ، ولا يذكر توجيها ولا تسبيحا ، لحديث عائشة وأنس المتقدمين وغيرهما ، وقد جاءت أحاديث بالتوجيه والتسبيح والسكوت ، قال بها [ ص: 114 ] جماعة من العلماء ; فروي عن عمر بن الخطاب وعبد الله بن مسعود رضي الله عنهما أنهما كانا يقولان إذا افتتحا الصلاة : سبحانك اللهم وبحمدك ، تبارك اسمك ، وتعالى جدك ، ولا إله غيرك . وبه قال سفيان وأحمد وإسحاق وأصحاب الرأي . وكان الشافعي يقول بالذي روي عن علي عن النبي صلى الله عليه وسلم أنه كان إذا افتتح الصلاة كبر ثم قال : وجهت وجهي الحديث ، ذكره مسلم ، وسيأتي بتمامه في آخر سورة الأنعام ، وهناك يأتي القول في هذه المسألة مستوفى إن شاء الله .قال ابن المنذر : ثبت أن رسول الله صلى الله عليه وسلم كان إذا كبر في الصلاة سكت هنيهة قبل أن يقرأ يقول : اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياي بالماء والثلج والبرد واستعمل ذلك أبو هريرة . وقال أبو سلمة بن عبد الرحمن : للإمام سكتتان فاغتنموا فيهما القراءة . وكان الأوزاعي وسعيد بن عبد العزيز وأحمد بن حنبل يميلون إلى حديث النبي صلى الله عليه وسلم في هذا الباب .الخامسة : واختلف العلماء في وجوب قراءة الفاتحة في الصلاة ; فقال مالك وأصحابه : هي متعينة للإمام والمنفرد في كل ركعة . قال ابن خويز منداد البصري المالكي : لم يختلف [ ص: 115 ] قول مالك أنه من نسيها في صلاة ركعة من صلاة ركعتين أن صلاته تبطل ولا تجزيه . واختلف قوله فيمن تركها ناسيا في ركعة من صلاة رباعية أو ثلاثية ; فقال مرة : يعيد الصلاة ، وقال مرة أخرى : يسجد سجدتي السهو ; وهي رواية ابن عبد الحكم وغيره عن مالك . قال ابن خويز منداد وقد قيل : إنه يعيد تلك الركعة ويسجد للسهو بعد السلام . قال ابن عبد البر : الصحيح من القول إلغاء تلك الركعة ويأتي بركعة بدلا منها ، كمن أسقط سجدة سهوا . وهو اختيار ابن القاسم . وقال الحسن البصري وأكثر أهل البصرة والمغيرة بن عبد الرحمن المخزومي المدني : إذا قرأ بأم القرآن مرة واحدة في الصلاة أجزأه ولم تكن عليه إعادة ; لأنها صلاة قد قرأ فيها بأم القرآن ; وهي تامة لقوله عليه السلام : لا صلاة لمن لم يقرأ بأم القرآن وهذا قد قرأ بها .قلت : ويحتمل لا صلاة لمن لم يقرأ بها في كل ركعة ، وهو الصحيح على ما يأتي . ويحتمل لا صلاة لمن لم يقرأ بها في أكثر عدد الركعات ، وهذا هو سبب الخلاف والله أعلم .وقال أبو حنيفة والثوري والأوزاعي : إن تركها عامدا في صلاته كلها وقرأ غيرها أجزأه ; على اختلاف عن الأوزاعي في ذلك . وقال أبو يوسف ومحمد بن الحسن : أقله ثلاث آيات أو آية طويلة كآية الدين . وعن محمد بن الحسن أيضا قال : أسوغ الاجتهاد في مقدار آية ومقدار كلمة مفهومة ; نحو : الحمد لله ولا أسوغه في حرف لا يكون كلاما . وقال الطبري : يقرأ المصلي بأم القرآن في كل ركعة ، فإن لم يقرأ بها لم يجزه إلا مثلها من القرآن عدد آيها وحروفها . قال ابن عبد البر : وهذا لا معنى له ; لأن التعيين لها والنص عليها قد خصها بهذا الحكم دون غيرها ; ومحال أن يجيء بالبدل منها من وجبت عليه فتركها وهو قادر عليها ، وإنما عليه أن يجيء بها ويعود إليها ، كسائر المفروضات المتعينات في العبادات .السادسة : وأما المأموم فإن أدرك الإمام راكعا فالإمام يحمل عنه القراءة ; لإجماعهم على أنه إذا أدركه راكعا أنه يكبر ويركع ولا يقرأ شيئا وإن أدركه قائما فإنه يقرأ ، وهي المسألة :السابعة : ولا ينبغي لأحد أن يدع القراءة خلف إمامه في صلاة السر ; فإن فعل فقد أساء ; ولا شيء عليه عند مالك وأصحابه . وأما إذا جهر الإمام وهي المسألة :الثامنة : فلا قراءة بفاتحة الكتاب ولا غيرها في المشهور من مذهب مالك ; لقول الله [ ص: 116 ] تعالى : وإذا قرئ القرآن فاستمعوا له وأنصتوا ، وقول رسول الله صلى الله عليه وسلم : ما لي أنازع القرآن ، وقوله في الإمام : إذا قرأ فأنصتوا ، وقوله : من كان له إمام فقراءة الإمام له قراءة .وقال الشافعي فيما حكى عنه البويطي وأحمد بن حنبل : لا تجزئ أحدا صلاة حتى يقرأ بفاتحة الكتاب في كل ركعة ، إماما كان أو مأموما ، جهر إمامه أو أسر . وكان الشافعي بالعراق يقول في المأموم : يقرأ إذا أسر ولا يقرأ إذا جهر ; كمشهور مذهب مالك . وقال بمصر : فيما يجهر فيه الإمام بالقراءة قولان : أحدهما أن يقرأ والآخر يجزئه ألا يقرأ ويكتفي بقراءة الإمام . حكاه ابن المنذر . وقال ابن وهب وأشهب وابن عبد الحكم وابن حبيب والكوفيون : لا يقرأ المأموم شيئا ، جهر إمامه أو أسر ; لقوله عليه السلام : فقراءة الإمام له قراءة وهذا عام ، ولقول جابر : من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا وراء الإمام .التاسعة : الصحيح من هذه الأقوال قول الشافعي وأحمد ومالك في القول الآخر ، وأن الفاتحة متعينة في كل ركعة لكل أحد على العموم ; لقوله صلى الله عليه وسلم : لا صلاة لمن لم يقرأ فيها بفاتحة الكتاب ، وقوله : من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج ثلاثا . وقال أبو هريرة : أمرني رسول الله صلى الله عليه وسلم أن أنادي أنه : ( لا صلاة إلا بقراءة فاتحة الكتاب فما [ ص: 117 ] زاد ) أخرجه أبو داود . كما لا ينوب سجود ركعة ولا ركوعها عن ركعة أخرى ، فكذلك لا تنوب قراءة ركعة عن غيرها ; وبه قال عبد الله بن عون وأيوب السختياني وأبو ثور وغيره من أصحاب الشافعي وداود بن علي ، وروي مثله عن الأوزاعي ; وبه قال مكحول .وروي عن عمر بن الخطاب وعبد الله بن عباس وأبي هريرة وأبي بن كعب وأبي أيوب الأنصاري وعبد الله بن عمرو بن العاص وعبادة بن الصامت وأبي سعيد الخدري وعثمان بن أبي العاص وخوات بن جبير أنهم قالوا : لا صلاة إلا بفاتحة الكتاب . وهو قول ابن عمر والمشهور من مذهب الأوزاعي ; فهؤلاء الصحابة بهم القدوة ، وفيهم الأسوة ، كلهم يوجبون الفاتحة في كل ركعة .وقد أخرج الإمام أبو عبد الله محمد بن يزيد بن ماجه القزويني في سننه ما يرفع الخلاف ويزيل كل احتمال فقال : حدثنا أبو كريب حدثنا محمد بن فضيل ، ح ، وحدثنا سويد بن سعيد حدثنا علي بن مسهر جميعا عن أبي سفيان السعدي عن أبي نضرة عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم لا صلاة لمن لم يقرأ في كل ركعة بالحمد لله وسورة في فريضة أو غيرها . وفي صحيح مسلم عن أبي هريرة أنه عليه السلام قال للذي علمه الصلاة : وافعل ذلك في صلاتك كلها وسيأتي . ومن الحجة في ذلك أيضا ما رواه أبو داود عن نافع بن محمود بن الربيع الأنصاري قال : أبطأ عبادة بن الصامت عن صلاة الصبح ; فأقام أبو نعيم المؤذن الصلاة فصلى أبو نعيم بالناس ، وأقبل عبادة بن الصامت وأنا معه حتى صففنا خلف أبي نعيم ، وأبو نعيم يجهر بالقراءة ; فجعل عبادة يقرأ بأم القرآن ; فلما انصرف قلت لعبادة : سمعتك تقرأ بأم القرآن وأبو نعيم يجهر ؟ قال : أجل ! صلى بنا رسول الله صلى الله عليه وسلم بعض الصلوات التي يجهر فيها بالقراءة فالتبست عليه ; فلما انصرف أقبل علينا بوجهه فقال : هل تقرءون إذا جهرت بالقراءة ؟ فقال بعضنا : إنا نصنع ذلك ; قال : فلا . وأنا أقول ما لي ينازعني القرآن فلا تقرءوا بشيء من القرآن إذا جهرت إلا بأم القرآن . وهذا نص صريح في المأموم . وأخرجه [ ص: 118 ] أبو عيسى الترمذي من حديث محمد بن إسحاق بمعناه ; وقال : حديث حسن . والعمل على هذا الحديث في القراءة خلف الإمام عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ; وهو قول مالك بن أنس وابن المبارك والشافعي وأحمد وإسحاق ، يرون القراءة خلف الإمام . وأخرجه أيضا الدارقطني وقال : هذا إسناد حسن ، ورجاله كلهم ثقات ; وذكر أن محمود بن الربيع كان يسكن إيلياء ، وأن أبا نعيم أول من أذن في بيت المقدس . وقال أبو محمد عبد الحق : ونافع بن محمود لم يذكره البخاري في تاريخه ولا ابن أبي حاتم ; ولا أخرج له البخاري ومسلم شيئا . وقال فيه أبو عمر : مجهول . وذكر الدارقطني عن يزيد بن شريك قال : سألت عمر عن القراءة خلف الإمام ، فأمرني أن أقرأ ، قلت : وإن كنت أنت ؟ قال : وإن كنت أنا ; قلت : وإن جهرت ؟ قال : وإن جهرت . قال الدارقطني : هذا إسناد صحيح . وروي عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : الإمام ضامن فما صنع فاصنعوا . قال أبو حاتم : هذا يصح لمن قال بالقراءة خلف الإمام ; وبهذا أفتى أبو هريرة الفارسي أن يقرأ بها في نفسه حين قال له : إني أحيانا أكون وراء الإمام ، ثم استدل بقوله تعالى : قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل . قال رسول الله صلى الله عليه وسلم : اقرءوا يقول العبد الحمد لله رب العالمين الحديث .العاشرة : أما ما استدل به الأولون بقوله عليه السلام : وإذا قرأ فأنصتوا أخرجه مسلم من حديث أبي موسى الأشعري ; وقال : وفي حديث جرير عن سليمان عن قتادة من الزيادة وإذا قرأ فأنصتوا قال الدارقطني : هذه اللفظة لم يتابع سليمان التيمي فيها عن قتادة ; وخالفه الحفاظ من أصحاب قتادة فلم يذكروها ; منهم شعبة وهشام وسعيد بن أبي عروبة وهمام وأبو عوانة ومعمر وعدي بن أبي عمارة . قال الدارقطني : فإجماعهم يدل على وهمه . وقد روي عن عبد الله بن عامر عن قتادة متابعة التيمي ; ولكن ليس هو بالقوي ، تركه القطان . وأخرج أيضا هذه الزيادة أبو داود من حديث أبي هريرة وقال : هذه الزيادة إذا قرأ فأنصتوا ليست بمحفوظة . وذكر أبو محمد عبد الحق : أن مسلما صحح حديث أبي هريرة وقال : هو عندي صحيح .قلت : ومما يدل على صحتها عنده إدخالها في كتابه من حديث أبي موسى وإن كانت مما لم يجمعوا عليها . وقد صححها الإمام أحمد بن حنبل وابن المنذر . وأما قوله تعالى : وإذا قرئ القرآن فاستمعوا له وأنصتوا فإنه نزل بمكة ، وتحريم الكلام في الصلاة نزل بالمدينة - كما قال زيد بن أرقم فلا حجة فيها ; فإن المقصود كان المشركين ، على ما قال سعيد بن المسيب . وقد روى الدارقطني عن أبي هريرة أنها نزلت في رفع الصوت خلف رسول الله صلى الله عليه وسلم . وقال : عبد الله بن عامر ضعيف . وأما قوله عليه السلام : ( ما لي أنازع القرآن ) فأخرجه مالك عن ابن شهاب عن ابن أكيمة الليثي ، واسمه فيما قال مالك : عمرو ، وغيره يقول عامر ، وقيل يزيد ، وقيل عمارة ، وقيل عباد ، يكنى أبا الوليد توفي سنة إحدى ومائة وهو ابن تسع وسبعين سنة ، لم يرو عنه الزهري إلا هذا الحديث الواحد ، وهو ثقة ، وروى عنه محمد بن عمرو وغيره . والمعنى في حديثه : لا تجهروا إذا جهرت فإن ذلك [ ص: 120 ] تنازع وتجاذب وتخالج ، اقرءوا في أنفسكم . يبينه حديث عبادة وفتيا الفاروق وأبي هريرة الراوي للحديثين . فلو فهم المنع جملة من قوله : ( ما لي أنازع القرآن ) لما أفتى بخلافه ، وقول الزهري في حديث ابن أكيمة : فانتهى الناس عن القراءة مع رسول الله صلى الله عليه وسلم فيما جهر فيه رسول الله صلى الله عليه وسلم بالقراءة ، حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ، يريد بالحمد على ما بينا ; وبالله توفيقنا .وأما قوله صلى الله عليه وسلم : من كان له إمام فقراءة الإمام له قراءة فحديث ضعيف أسنده الحسن بن عمارة وهو متروك ، وأبو حنيفة وهو ضعيف ; كلاهما عن موسى بن أبي عائشة عن عبد الله بن شداد عن جابر . أخرجه الدارقطني وقال : رواه سفيان الثوري وشعبة وإسرائيل بن يونس وشريك وأبو خالد الدالاني وأبو الأحوص وسفيان بن عيينة وجرير بن عبد الحميد وغيرهم ، عن موسى بن أبي عائشة عن عبد الله بن شداد مرسلا عن النبي صلى الله عليه وسلم وهو الصواب . وأما قول جابر : من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا وراء الإمام ; فرواه مالك عن وهب بن كيسان عن جابر قوله . قال ابن عبد البر : ورواه يحيى بن سلام صاحب التفسير عن مالك عن أبي نعيم وهب بن كيسان عن جابر عن النبي صلى الله عليه وسلم وصوابه موقوف على جابر كما في الموطأ . وفيه من الفقه إبطال الركعة التي لا يقرأ فيها بأم القرآن ; وهو يشهد لصحة ما ذهب إليه ابن القاسم ورواه عن مالك في إلغاء الركعة والبناء على غيرها ولا يعتد المصلي بركعة لا يقرأ فيها بفاتحة الكتاب . وفيه أيضا أنالإمام قراءته لمن خلفه قراءة ; وهذا مذهب جابر وقد خالفه فيه غيره .الحادية عشرة : قال ابن العربي : لما قال صلى الله عليه وسلم : لا صلاة لمن لم يقرأ بفاتحة الكتاب واختلف الناس في هذا الأصل هل يحمل هذا النفي على التمام والكمال ، أو على الإجزاء ؟ اختلفت الفتوى بحسب اختلاف حال الناظر ، ولما كان الأشهر في هذا الأصل والأقوى أن النفي على العموم ، كان الأقوى من رواية مالك أن من لم يقرأ الفاتحة في صلاته بطلت . ثم نظرنا في تكرارها في كل ركعة ; فمن تأول قول النبي صلى الله عليه وسلم : ( ثم افعل ذلك في صلاتك كلها ) لزمه أن يعيد القراءة كما يعيد الركوع والسجود . والله أعلم .الثانية عشرة : ما ذكرناه في هذا الباب من الأحاديث والمعاني في تعيين الفاتحة يرد على [ ص: 121 ] الكوفيين قولهم في أن الفاتحة لا تتعين ، وأنها وغيرها من آي القرآن سواء . وقد عينها النبي صلى الله عليه وسلم بقوله كما ذكرناه ; وهو المبين عن الله تعالى مراده في قوله : وأقيموا الصلاة . وقد روى أبو داود عن أبي سعيد الخدري قال : أمرنا أن نقرأ بفاتحة الكتاب وما تيسر . فدل هذا الحديث على أن قوله عليه السلام للأعرابي : اقرأ ما تيسر معك من القرآن ما زاد على الفاتحة ، وهو تفسير قوله تعالى : فاقرءوا ما تيسر منه وقد روى مسلم عن عبادة بن الصامت أن رسول الله صلى الله عليه وسلم قال : لا صلاة لمن لم يقرأ بأم القرآن - زاد في رواية - فصاعدا . وقوله عليه السلام : ( هي خداج - ثلاثا - غير تمام ) أي غير مجزئة بالأدلة المذكورة . والخداج : النقص والفساد . قال الأخفش : خدجت الناقة ; إذا ألقت ولدها لغير تمام ، وأخدجت إذا قذفت به قبل وقت الولادة وإن كان تام الخلق .والنظر يوجب في النقصان ألا تجوز معه الصلاة ، لأنها صلاة لم تتم ; ومن خرج من صلاته وهي لم تتم فعليه إعادتها كما أمر ، على حسب حكمها . ومن ادعى أنها تجوز مع إقراره بنقصها فعليه الدليل ، ولا سبيل إليه من وجه يلزم ، والله أعلم .الثالثة عشرة : روي عن مالك أن القراءة لا تجب في شيء في الصلاة ; وكذلك كان الشافعي يقول بالعراق فيمن نسيها ، ثم رجع عن هذا بمصر فقال : لا تجزئ صلاة من يحسن فاتحة الكتاب إلا بها ، ولا يجزئه أن ينقص حرفا منها ; فإن لم يقرأها أو نقص منها حرفا أعاد صلاته وإن قرأ بغيرها . وهذا هو الصحيح في المسألة . وأما ما روي عن عمر رحمه الله أنه صلى المغرب فلم يقرأ فيها ، فذكر ذلك له فقال : كيف كان الركوع والسجود ؟ قالوا : حسن ، قال : لا بأس إذا ، فحديث منكر اللفظ منقطع الإسناد ، لأنه يرويه إبراهيم بن الحارث التيمي عن عمر ، ومرة يرويه إبراهيم عن أبي سلمة بن عبد الرحمن عن عمر ، وكلاهما منقطع لا حجة فيه ; وقد ذكره مالك في الموطأ ، وهو عند بعض الرواة وليس عند يحيى وطائفة معه ، لأنه رماه مالك من كتابه بأخرة ، وقال ليس عليه العمل لأن النبي صلى الله عليه وسلم قال : كل صلاة لا يقرأ فيها بأم [ ص: 122 ] القرآن فهي خداج وقد روي عن عمر أنه أعاد تلك الصلاة ; وهو الصحيح عنه . روى يحيى بن يحيى النيسابوري قال : حدثنا أبو معاوية عن الأعمش عن إبراهيم النخعي عن همام بن الحارث أن عمر نسي القراءة في المغرب فأعاد بهم الصلاة . قال ابن عبد البر : وهذا حديث متصل شهده همام من عمر ; روي ذلك من وجوه . وروى أشهب عن مالك قال : سئل مالك عن الذي نسي القراءة ، أيعجبك ما قال عمر ؟ فقال : أنا أنكر أن يكون عمر فعله - وأنكر الحديث - وقال : يرى الناس عمر يصنع هذا في المغرب ولا يسبحون به ! أرى أن يعيد الصلاة من فعل هذا .الرابعة عشرة : أجمع العلماء على أن لا صلاة إلا بقراءة ، على ما تقدم من أصولهم في ذلك . وأجمعوا على أن لا توقيت في ذلك بعد فاتحة الكتاب ، إلا أنهم يستحبون ألا يقرأ مع فاتحة الكتاب إلا سورة واحدة لأنه الأكثر مما جاء عن النبي صلى الله عليه وسلم . قال مالك : وسنة القراءة أن يقرأ في الركعتين الأوليين بأم القرآن وسورة ، وفي الأخريين بفاتحة الكتاب . وقال الأوزاعي : يقرأ بأم القرآن فإن لم يقرأ بأم القرآن وقرأ بغيرها أجزأه ، وقال : وإن نسي أن يقرأ في ثلاث ركعات أعاد . وقال الثوري : يقرأ في الركعتين الأوليين بفاتحة الكتاب وسورة ، ويسبح في الأخريين إن شاء ، وإن شاء قرأ ، وإن لم يقرأ ولم يسبح جازت صلاته ، وهو قول أبي حنيفة وسائر الكوفيين .قال ابن المنذر : وقد روينا عن علي بن أبي طالب رضي الله عنه أنه قال : اقرأ في الأوليين وسبح في الأخريين ، وبه قال النخعي . قال سفيان : فإن لم يقرأ في ثلاث ركعات أعاد الصلاة لأنه لا تجزئه قراءة ركعة . قال : وكذلك إن نسي أن يقرأ ركعة في صلاة الفجر . وقال أبو ثور : لا تجزئ صلاة إلا بقراءة فاتحة الكتاب في كل ركعة ، كقول الشافعي المصري ، وعليه جماعة أصحاب الشافعي . وكذلك قال ابن خويز منداد المالكي ; قال : قراءة الفاتحة واجبة عندنا في كل ركعة ، وهذا هو الصحيح في المسألة . روى مسلم عن أبي قتادة قال : كان رسول الله صلى الله عليه وسلم يصلي بنا فيقرأ في الظهر والعصر في الركعتين الأوليين بفاتحة الكتاب وسورتين ، ويسمعنا الآية أحيانا ، وكان يطول في الركعة الأولى من الظهر [ ص: 123 ] ويقصر الثانية ، وكذلك في الصبح . وفي رواية : ويقرأ في الركعتين الأخريين بفاتحة الكتاب ; وهذا نص صريح وحديث صحيح لما ذهب إليه مالك . ونص في تعين الفاتحة في كل ركعة ; خلافا لمن أبى ذلك ، والحجة في السنة لا فيما خالفها .الخامسة عشرة : ذهب الجمهور إلى أن ما زاد على الفاتحة من القراءة ليس بواجب ; لما رواه مسلم عن أبي هريرة قال : في كل صلاة قراءة ، فما أسمعنا النبي صلى الله عليه وسلم أسمعناكم ، وما أخفى منا أخفينا منكم ; فمن قرأ بأم القرآن فقد أجزأت عنه ، ومن زاد فهو أفضل . وفي البخاري : وإن زدت فهو خير . وقد أبى كثير من أهل العلم ترك السورة لضرورة أو لغير ضرورة ; منهم عمران بن حصين وأبو سعيد الخدري وخوات بن جبير ومجاهد وأبو وائل وابن عمر وابن عباس وغيرهم ; قالوا : لا صلاة لمن لم يقرأ فيها بفاتحة الكتاب وشيء معها من القرآن ; فمنهم من حد آيتين ، ومنهم من حد آية ، ومنهم من لم يحد ، وقال : شيء من القرآن معها ; وكل هذا موجب لتعلم ما تيسر من القرآن على كل حال مع فاتحة الكتاب ; لحديث عبادة وأبي سعيد الخدري وغيرهما . وفي المدونة : وكيع عن الأعمش عن خيثمة قال : حدثني من سمع عمر بن الخطاب يقول : لا تجزئ صلاة من لم يقرأ فيها بفاتحة الكتاب وشيء معها .واختلف المذهب في قراءة السورة على ثلاثة أقوال : سنة ، فضيلة ، واجبة .السادسة عشرة : من تعذر ذلك عليه بعد بلوغ مجهوده فلم يقدر على تعلم الفاتحة أو شيء من القرآن ولا علق منه بشيء ، لزمه أن يذكر الله في موضع القراءة بما أمكنه من تكبير أو تهليل أو تحميد أو تسبيح أو تمجيد أو لا حول ولا قوة إلا بالله ، إذا صلى وحده أو مع إمام فيما أسر فيه الإمام ; فقد روى أبو داود وغيره عن عبد الله بن أبي أوفى قال : جاء رجل إلى النبي صلى الله عليه وسلم فقال : إني لا أستطيع أن آخذ من القرآن شيئا ، فعلمني ما يجزئني منه ; قال : قل سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ; قال : يا رسول الله ، هذا لله ، فما لي ؟ قال : قل اللهم ارحمني وعافني واهدني وارزقني .السابعة عشرة : فإن عجز عن إصابة شيء من هذا اللفظ فلا يدع الصلاة مع الإمام جهده ; فالإمام يحمل ذلك عنه إن شاء الله ; وعليه أبدا أن يجهد نفسه في تعلم فاتحة الكتاب فما زاد ، إلى أن يحول الموت دون ذلك وهو بحال الاجتهاد فيعذره الله .الثامنة عشرة : من لم يواته لسانه إلى التكلم بالعربية من الأعجميين وغيرهم ترجم له الدعاء العربي بلسانه الذي يفقه لإقامة صلاته ; فإن ذلك يجزئه إن شاء الله تعالى .التاسعة عشرة : لا تجزئ صلاة من قرأ بالفارسية وهو يحسن العربية في قول الجمهور . وقال أبو حنيفة : تجزئه القراءة بالفارسية وإن أحسن العربية ; لأن المقصود إصابة المعنى . قال ابن المنذر : لا يجزئه ذلك ; لأنه خلاف ما أمر الله به ، وخلاف ما علم النبي صلى الله عليه وسلم ، وخلاف جماعات المسلمين . ولا نعلم أحدا وافقه على ما قال .الموفية عشرين : من افتتح الصلاة كما أمر وهو غير عالم بالقراءة ، فطرأ عليه العلم بها في أثناء الصلاة ويتصور ذلك بأن يكون سمع من قرأها فعلقت بحفظه من مجرد السماع فلا يستأنف الصلاة ; لأنه أدى ما مضى على حسب ما أمر به ; فلا وجه لإبطاله قاله في كتاب ابن سحنون .فيه ثمان مسائل :الأولى : ويسن لقارئ القرآن أن يقول بعد الفراغ من الفاتحة بعد سكتة على نون \" ولا الضالين \" : آمين ، ليتميز ما هو قرآن مما ليس بقرآن .الثانية : ثبت في الأمهات من حديث أبي هريرة أن رسول الله صلى الله عليه وسلم قال : إذا أمن الإمام فأمنوا فإنه من وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه . قال علماؤنا رحمة الله عليهم : فترتبت المغفرة للذنب على مقدمات أربع تضمنها هذا الحديث . الأولى : تأمين الإمام ، الثانية : تأمين من خلفه ، الثالثة : تأمين الملائكة ، الرابعة : موافقة التأمين ، قيل في [ ص: 125 ] الإجابة ، وقيل في الزمن ، وقيل في الصفة من إخلاص الدعاء ، لقوله عليه السلام : ادعوا الله وأنتم موقنون بالإجابة واعلموا أن الله لا يستجيب دعاء من قلب غافل لاه .الثالثة : روى أبو داود عن أبي مصبح المقرائي قال : كنا نجلس إلى أبي زهير النميري وكان من الصحابة ، فيحدث أحسن الحديث ، فإذا دعا الرجل منا بدعاء قال : اختمه بآمين . فإن آمين مثل الطابع على الصحيفة . قال أبو زهير ألا أخبركم عن ذلك ، خرجنا مع رسول الله صلى الله عليه وسلم ذات ليلة ، فأتينا على رجل قد ألح في المسألة ، فوقف النبي صلى الله عليه وسلم يسمع منه ، فقال النبي صلى الله عليه وسلم : أوجب إن ختم فقال له رجل من القوم : بأي شيء يختم ؟ قال : بآمين فإنه إن ختم بآمين فقد أوجب فانصرف الرجل الذي سأل النبي صلى الله عليه وسلم ، فأتى الرجل فقال له : اختم يا فلان وأبشر . قال ابن عبد البر : أبو زهير النميري اسمه يحيى بن نفير روى عن النبي صلى الله عليه وسلم لا تقتلوا الجراد فإنه جند الله الأعظم . وقال وهب بن منبه : آمين أربعة أحرف يخلق الله من كل حرف ملكا يقول : اللهم اغفر لكل من قال آمين . وفي الخبر ( لقنني جبريل آمين عند فراغي من فاتحة الكتاب وقال إنه كالخاتم على الكتاب ) وفي حديث آخر : آمين خاتم رب العالمين . قال الهروي قال أبو بكر : معناه أنه طابع الله على عباده ; لأنه يدفع [ به عنهم ] الآفات والبلايا ; فكان كخاتم الكتاب الذي يصونه ، ويمنع من إفساده وإظهار ما فيه . وفي حديث آخر آمين درجة في الجنة . قال أبو بكر : معناه أنه حرف يكتسب به قائله درجة في الجنة .الرابعة : معنى آمين عند أكثر أهل العلم : اللهم استجب لنا ; وضع موضع الدعاء . وقال قوم : هو اسم من أسماء الله ; روي عن جعفر بن محمد ومجاهد وهلال بن يساف ورواه ابن عباس عن النبي صلى الله عليه وسلم ولم يصح ; قاله ابن العربي . وقيل معنى آمين : كذلك فليكن ; قاله الجوهري . وروى الكلبي عن أبي صالح عن ابن عباس قال : سألت رسول الله صلى الله عليه وسلم ما معنى آمين ؟ قال : ( رب افعل ) . وقال مقاتل : هو قوة للدعاء ، واستنزال للبركة . وقال الترمذي : معناه لا تخيب رجاءنا .الخامسة : وفي آمين لغتان : المد على وزن فاعيل كياسين . والقصر على وزن يمين . قال الشاعر في المد :يا رب لا تسلبني حبها أبدا ويرحم الله عبدا قال آميناوقال آخر :آمين آمين لا أرضى بواحدة     حتى أبلغها ألفين آميناوقال آخر في القصر :تباعد مني فطحل إذ سألته     أمين فزاد الله ما بيننا بعداوتشديد الميم خطأ ; قال الجوهري . وقد روي عن الحسن وجعفر الصادق التشديد ; وهو قول الحسين بن الفضل ; من \" أم \" إذا قصد ، أي نحن قاصدون نحوك ; ومنه قوله : ولا آمين البيت الحرام . حكاه أبو نصر عبد الرحيم بن عبد الكريم القشيري . قال الجوهري : وهو مبني على الفتح مثل أين وكيف ; لاجتماع الساكنين . وتقول منه : أمن فلان تأمينا .السادسة : اختلف العلماء هل يقولها الإمام وهل يجهر بها ; فذهب الشافعي ومالك في رواية المدنيين إلى ذلك . وقال الكوفيون وبعض المدنيين : لا يجهر بها . وهو قول الطبري ، وبه قال ابن حبيب من علمائنا . وقال ابن بكير : هو مخير . وروى ابن القاسم عن مالك أن الإمام لا يقول آمين وإنما يقول ذلك من خلفه ; وهو قول ابن القاسم والمصريين من أصحاب مالك . وحجتهم حديث أبي موسى الأشعري أن رسول الله صلى الله عليه وسلم خطبنا فبين لنا سنتنا وعلمنا صلاتنا فقال : إذا صليتم فأقيموا صفوفكم ثم ليؤمكم أحدكم فإذا كبر فكبروا وإذا قال \" غير المغضوب عليهم ولا الضالين \" فقولوا آمين يجبكم الله وذكر الحديث ، أخرجه مسلم . ومثله حديث سمي عن أبي هريرة ; وأخرجه مالك . والصحيح الأول لحديث وائل بن حجر قال : كان رسول الله صلى الله عليه وسلم إذا قرأ ولا الضالين قال : \" آمين \" يرفع بها صوته ; أخرجه أبو داود والدارقطني ، وزاد \" قال أبو بكر : هذه سنة تفرد بها أهل الكوفة ، هذا صحيح والذي بعده \" . وترجم البخاري \" باب جهر الإمام بالتأمين \" .[ ص: 127 ] وقال عطاء : \" آمين \" دعاء ، أمن ابن الزبير ومن وراءه حتى إن للمسجد للجة . قال الترمذي : وبه يقول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم ، يرون أن يرفع الرجل صوته بالتأمين ولا يخفيها . وبه يقول الشافعي وأحمد وإسحاق . وفي الموطأ والصحيحين قال ابن شهاب : وكان رسول الله صلى الله عليه وسلم يقول \" آمين \" . وفي سنن ابن ماجه عن أبي هريرة قال : ترك الناس آمين ; وكان رسول الله صلى الله عليه وسلم إذا قال : غير المغضوب عليهم ولا الضالين قال : \" آمين \" حتى يسمعها أهل الصف الأول فيرتج بها المسجد . وأما حديث أبي موسى وسمي فمعناهما التعريف بالموضع الذي يقال فيه آمين ; وهو إذا قال الإمام : ولا الضالين ليكون قولهما معا ، ولا يتقدموه بقول : آمين ; لما ذكرناه ، والله أعلم . ولقوله عليه السلام : إذا أمن الإمام فأمنوا . وقال ابن نافع في كتاب ابن الحارث : لا يقولها المأموم إلا أن يسمع الإمام يقول : ولا الضالين . وإذا كان ببعد لا يسمعه فلا يقل . وقال ابن عبدوس : يتحرى قدر القراءة ويقول : آمين .السابعة : قال أصحاب أبي حنيفة : الإخفاء بآمين أولى من الجهر بها لأنه دعاء ، وقد قال الله تعالى : ادعوا ربكم تضرعا وخفية . قالوا : والدليل عليه ما روي في تأويل قوله تعالى : قد أجيبت دعوتكما . قال : كان موسى يدعو وهارون يؤمن ، فسماهما الله داعيين .[ ص: 128 ] الجواب : أن إخفاء الدعاء إنما كان أفضل لما يدخله من الرياء . وأما ما يتعلق بصلاة الجماعة فشهودها إشهار شعار ظاهر ، وإظهار حق يندب العباد إلى إظهاره ; وقد ندب الإمام إلى إشهار قراءة الفاتحة المشتملة على الدعاء والتأمين في آخرها ; فإذا كان الدعاء مما يسن الجهر فيه فالتأمين على الدعاء تابع له وجار مجراه ; وهذا بين .الثامنة : كلمة آمين لم تكن قبلنا إلا لموسى وهارون عليهما السلام . ذكر الترمذي الحكيم في ( نوادر الأصول ) : حدثنا عبد الوارث بن عبد الصمد قال حدثنا أبي قال حدثنا رزين مؤذن مسجد هشام بن حسان قال حدثنا أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : إن الله أعطى أمتي ثلاثا لم تعط أحدا قبلهم السلام وهو تحية أهل الجنة وصفوف الملائكة وآمين إلا ما كان من موسى وهارون قال أبو عبد الله : معناه أن موسى دعا على فرعون ، وأمن هارون ، فقال الله تبارك اسمه عندما ذكر دعاء موسى في تنزيله : قد أجيبت دعوتكما ولم يذكر مقالة هارون ; وقال موسى : ربنا ، فكان من هارون التأمين ، فسماه داعيا في تنزيله ، إذ صير ذلك منه دعوة . وقد قيل : إن أمين خاص لهذه الأمة ; لما روي عن النبي صلى الله عليه وسلم أنه قال : ما حسدتكم اليهود على شيء ما حسدتكم على السلام والتأمين أخرجه ابن ماجه من حديث حماد بن سلمة عن سهيل بن أبي صالح عن أبيه عن عائشة أن النبي صلى الله عليه وسلم قال . . . ; الحديث . وأخرج أيضا من حديث ابن عباس عن النبي صلى الله عليه وسلم قال : ما حسدتكم اليهود على شيء ما حسدتكم على آمين فأكثروا من قول آمين . قال علماؤنا رحمة الله عليهم : إنما حسدنا أهل الكتاب لأن أولها حمد لله وثناء عليه ثم خضوع له واستكانة ، ثم دعاء لنا بالهداية إلى الصراط المستقيم ، ثم الدعاء عليهم مع قولنا آمين .وفيه ست وثلاثون مسألة :الأولى : قوله سبحانه وتعالى : الحمد لله روى أبو محمد عبد الغني بن سعيد الحافظ من حديث أبي هريرة وأبي سعيد الخدري عن النبي صلى الله عليه وسلم قال : إذا قال العبد الحمد لله [ ص: 129 ] قال صدق عبدي الحمد لي . وروى مسلم عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : إن الله ليرضى عن العبد أن يأكل الأكلة فيحم\n","ar.miqbas":"الشأن في الخطاب بأمر مهم لم يسِبق للمخاطب به خطابٌ من نوعه أنْ يُسْتأنَس له قبل إلقاء المقصود وأن يهيَّأَ لتلقيه ، وأن يشوق إلى سماع ذلك وتُراضَ نفسه على الاهتمام بالعمل به ليستعد للتلقي بالتخلي عن كل ما شأنُه أن يكون عائقاً عن الانتفاع بالهدى من عناد ومكابرة أو امتلاء العقل بالأوهام الضالة ، فإن النفس لا تكاد تنتفع بالعِظات والنذُر ، ولا تُشرق فيها الحكمة وصحة النظر ما بقي يخالجها العناد والبهتان ، وتخامر رشدها نزغات الشيطان ، فلما أراد الله أن تكون هذه السورة أُولى سور الكتاب المجيد بتوقيف النبيء صلى الله عليه وسلم كما تقدم آنفاً نبه الله تعالى قُراء كتابه وفاتحي مصحفه إلى أصول هذه التزكية النفسية بما لقنهم أن يبتدئوا بالمناجاة التي تضمنتها سورة الفاتحة من قوله : { إياك نعبد } إلى آخر السورة ، فإنها تضمنت أصولاً عظيمة : أولها التخلية عن التعطيل والشرك بما تضمنه { إياك نعبد } . الثاني التخلي عن خواطر الاستغناء عنه بالتبرىء من الحول والقوة تجاه عظمته بما تضمنه { وإياك نستعين } . الثالث الرغبة في التحَلي بالرشد والاهتداء بما تضمنه { اهدنا الصراط المستقيم } . الرابع الرغبة في التحلي بالأسوة الحسنة بما تضمنه { صراط الذين أنعمت عليهم } . الخامس التهمم بالسلامة من الضلال الصريح بما تضمنه { غير المغضوب عليهم } . السادس التهمم بسلامة تفكيرهم من الاختلاط بشبهات الباطل المموَّه بصورة الحق وهو المسمى بالضلال لأن الضلال خطأ الطريق المقصود بما تضمنه { ولا الضالين } .وأنت إذا افتقدت أصول نجاح المرشِد في إرشاده والمسترشد في تلقيه على كثرتها وتفاريعها وجدتها عاكفة حول هذه الأركان الستة فكن في استقصائها لبيباً . وعسى أن أزيدك من تفصيلها قريباً . وإن الذي لقن أهل القرآن ما فيه جماع طرائق الرشد بوجه لا يحيط به غير علام الغيوب لم يهمل إرشادهم إلى التحلي بزينة الفضائل وهي أن يقدروا النعمة حق قدرها بشكر المنعم بها فأراهم كيف يُتَوِّجُون مناجاتَهم بحمد واهب العقل ومانح التوفيق ، ولذلك كان افتتاح كل كلام مهم بالتحميد سنة الكتاب المجيد . فسورة الفاتحة بما تقرر مُنَزَّلَةٌ من القرآن مَنْزلَة الديباجة للكتاب أو المقدمة للخطبة ، وهذا الأسلوب له شأن عظيم في صناعة الأدب العربي وهو أعون للفهم وأدعى للوعي .وقد رسم أسلوب الفاتحة للمنشئين ثلاث قواعد للمقدمة : القاعدة الأولى إيجاز المقدمة لئلا تمل نفوس السامعين بطول انتظار المقصود وهو ظاهر في الفاتحة ، وليكون سنة للخطباء فلا يطيلوا المقدمة كي لا ينسَبوا إلى العِي فإنه بمقدار ما تطال المقدمة يقصر الغرض ، ومن هذا يظهر وجه وضعها قبل السور الطوال مع أنها سورة قصيرة . الثانية أن تشير إلى الغرض المقصود وهو ما يسمى براعة الاستهلال لأن ذلك يهيىء السامعين لسماع تفصيل ما سيرد عليهم فيتأهبوا لتلقيه إن كانوا من أهل التلقي فحسب ، أو لنقده وإكماله إن كانوا في تلك الدرجة ، ولأن ذلك يدل على تمكن الخطيب من الغرض وثقته بسداد رأيه فيه بحيث ينبه السامعين لوعيه ، وفيه سنة للخطباء ليحيطوا بأغراض كلامهم .وقد تقدم بيان اشتمال الفاتحة على هذا عند الكلام على وجه تسميتها أم القرآن . الثالثة أن تكون المقدمة من جوامع الكلم وقد بين ذلك علماء البيان عند ذكرهم المواضع التي ينبغي للمتكلم أن يتأنق فيها . الرابع أن تفتتح بحمد الله .إن القرآن هدى للناس وتبياناً للأحكام التي بها إصلاح الناس في عاجلهم وآجلهم ومعاشهم ومعادهم ولما لم يكن لنفوس الأمة اعتياد بذلك لزم أن يُهَيَّأَ المخاطبون بها إلى تلقيها ويعرف تهيؤهم بإظهارهم استعداد النفوس بالتخلي عن كل ما من شأنه أن يعوق عن الانتفاع بهاته التعاليم النافعة وذلك بأن يجردوا نفوسهم عن العناد والمكابرة وعن خلط معارفهم بالأغلاط الفاقرة ، فلا مناص لها قبل استقبال تلك الحكمة والنظر من الاتسام بميسم الفضيلة والتخلية عن السفاسف الرذيلة .فالفاتحة تضمنت مناجاة للخالق جامعة التنزه عن التعطيل والإلحاد والدهرية بما تضمنه قوله : { ملك يوم الدين } ، وعن الإشراك بما تضمنه { إياك نعبد وإياك نستعين } ، وعن المكابرة والعناد بما تضمنه { اهدنا الصراط المستقيم صراط الذين أنعمت عليهم } فإن طلب الهداية اعتراف بالاحتياج إلى العلم ، ووصف الصراط بالمستقيم اعتراف بأن من العلم ما هو حق ومنه ما هو مشوب بشُبه وغلط ، ومَن اعترف بهذين الأمرين فقد أعد نفسه لاتباع أحسنهما ، وعن الضلالات التي تعتري العلوم الصحيحة والشرائع الحقة فتذهب بفائدتها وتنزل صاحبها إلى دَركةٍ أقل مما وقف عنده الجاهل البسيط ، وذلك بما تضمنه قوله : { غير المغضوب عليهم ولا الضالين } كما أجملناه قريباً ، ولأجل هذا سميت هاته السورة أم القرآن كما تقدم .ولما لُقِّن المؤمنون هاته المناجاة البديعة التي لا يهتدي إلى الإحاطة بها في كلامه غير علام الغيوب سبحانه قدم الحمد عليها ليضعه المناجون كذلك في مناجاتهم جرياً على طريقة بلغاء العرب عند مخاطبة العظماء أن يفتتحوا خطابهم إياهم وطلبتهم بالثناء والذكر الجميل . قال أمية ابن أبي الصلت يمدح عبد الله بن جُدْعان :أَأَذْكُرُ حاجتي أَم قَدْ كفاني ... حَيَاؤُكَ إِنَّ شيمتَك الحَياءإذا أَثنى عليك المرءُ يوماً ... كفاه عن تَعَرُّضِه الثَّناءُفكان افتتاح الكلام بالتحميد سنة الكتاب المجيد لكل بليغ مُجيد ، فلم يزل المسلمون من يومئذٍ يُلقِّبُون كل كلام نفيس لم يشتمل في طالعه على الحمد بالأبتر أخذاً من حديث أبي هريرة عن النبيء صلى الله عليه وسلم « كلُّ أَمْرٍ ذِي بال لا يُبْدَأ فيه بالحمدُ لله أو بالحمد فهو أقطع » وقد لُقبت خطبة زياد ابن أبي سفيان التي خطبها بالبصرة بالبتراء لأنه لم يفتتحها بالحمد ، وكانت سورة الفاتحة لذلك منزَّلة من القرآن منزلة الديباجة للكتاب أو المقدمة للخطبة ، ولذلك شأن مهم في صناعة الإنشاء فإن تقديم المقدمة بين يدي المقصود أعود للأَفهام وأدعى لوعيها .و ( الحمد ) هو الثناء على الجميل أي الوصف الجميل الاختياري فِعْلاً كان كالكرم وإغاثة الملهوف أم غيره كالشجاعة . وقد جعلوا الثناء جنساً للحمد فهو أعم منه ولا يكون ضده . فالثناء الذكر بخير مطلقاً وشذ من قال يستعمل الثناء في الذكر مطلقاً ولو بَشرَ ، ونسبا إلى ابن القطاع وغرَّه في ذلك ما رود في الحديث وهو قوله صلى الله عليه وسلم \" من أثنيتم عليه خيراً وجبت له الجنة ومن أثنيتم عليه شراً وجبت له النار \" وإنما هو مجاز دعت إليه المشاكلة اللفظية والتعريض بأن من كان متكلماً في مسلم فليتكلم بثناء أو ليدَعْ ، فسمَّى ذكرهم بالشر ثناء تنبيهاً على ذلك . وأما الذي يستعمل في الخير والشر فهو النثاء بتقديم النون وهو في الشر أكثر كما قيل .وأما المدح فقد اختلف فيه فذهب الجمهور إلى أن المدح أعم من الحمد فإنه يكون على الوصف الاختياري وغيره . وقال صاحب «الكشاف» الحمد والمدح أخوان فقيل أراد أخوان في الاشتقاق الكبير نحوجَبذ وجَذب ، وإن ذلك اصطلاح له في «الكشاف» في معنى أُخوة اللفظين لئلا يلزم من ظاهر كلامه أن المدح يطلق على الثناء على الجميل الاختياري ، لكن هذا فهم غير مستقيم والذي عليه المحققون من شراح «الكشاف» أنه أراد من الأخوة هنا الترادف لأنه ظاهر كلامه؛ ولأنه صريح قوله في «الفائق» : «الحمد هو المدح والوصف بالجميل» ولأنه ذكر الذم نقيضاً للحمد إذ قال في «الكشاف» : «والحمد نقيضه الذم» مع شيوع كون الذم نقيضاً للمدح ، وعُرفُ علماء اللغة أن يريدوا من النقيض المقابل لا ما يساوي النقيض حتى يجاب بأنه أراد من النقيض ما لا يجامع المعنى والذم لا يجامع الحمد وإن لم يكن معناه رفع معنى الحمد بل رفع معنى المدح إلا أن نفي الأعم وهو المدح يستلزم نفي الأخص وهو الحمد لأن هذا لا يقصده علماء اللغة ، يعني وإن اغتفر مثله في استعمال العرب كقول زهير :ومن يجعل المَعْروف في غير أهله ... يَكُنْ حمده ذمّاً عليه ويندملأن كلام العلماء مبني على الضبط والتدقيق .ثم اختلف في مراد صاحب «الكشاف» من ترادفهما هل هما مترادفان في تقييدهما بالثناء على الجميل الاختياري؟ أو مترادفان في عدم التقييد بالاختياري ، وعلى الأول حمله السيد الشريف وهو ظاهر كلام سعد الدين . واستدل السيد بأنه صرح بذلك في قوله تعالى : { ولكن الله حبب إليكم الإيمان } [ الحجرات : 7 ] إذ قال : «فإن قلت فإن العرب تمدح بالجمال وحسن الوجوه وهو مدح مقبول عند الناس ، قلت الذي سوغ ذلك أنهم رأوا حسن الرواء ووسامة المنظر في الغالب يسفر عن مخبر مرضضٍ وأخلاق محمودة على أن من محققة الثقات وعلماء المعاني من دفع صحة ذلك وخطأ المادح به وقصر المدح على النعت بأمهات الخير وهي كالفصاحة والشجاعة والعدل والعفة وما يتشعب عنها» ا ه .وعلى المحمل الثاني وهو أن يكون قُصد من الترادف إلغاء قيد الاختياري في كليهما حمله المحقق عبد الحكيم السلكوتي في «حواشي التفسير» فرضاً أو نقلاً لا ترجيحاً بناء على أنه ظاهر كلامه في «الكشاف» و«الفائق» إذ ألغى قيد الاختياري في تفسير المدح بالثناء على الجميل وجعلهما مع ذلك مترادفين .وبهذا يندفع الإشكال عن حمدنا الله تعالى على صفاته الذاتية كالعلم والقدرة دون صفات الأفعال وإن كان اندفاعه على اختيار الجمهور أيضاً ظاهراً؛ فإن ما ورد عليهم من أن مذهبهم يستلزم أن لا يحمد الله تعالى على صفاته لأنها ذاتية فلا توصف بالاختيار إذ الاختيار يستلزم إمكان الاتصاف ، وقد أجابوا عنه إما بأن تلك الصفات العلية نزلت منزلة الاختيارية لاستقلال موصوفها ، وإما بأن ترتب الآثار الاختيارية عليها يجعلها كالاختيارية ، وإما بأن المراد بالاختيارية أن يكون المحمود فاعلاً بالاختيار وإن لم يكن المحمود عليه اختيارياً .وعندي أن الجواب أن نقول إن شرط الاختياري في حقيقة الحمد عند مثبته لإخراج الصفات غير الاختيارية لأن غير الاختياري فينا ليس من صفات الكمال إذ لا تترتب عليها الآثار الموجبة للحمد ، فكان شرط الاختيار في حمدنا زيادة في تحقق كمال المحمود ، أما عدم الاختيار المختص بالصفات الذاتية الإلهية فإنه ليس عبارة عن نقص في صفاته ولكنه كمال نشأ من وجوب الصفة للذات لقدم الصفة فعدم الاختيار في صفات الله تعالى زيادةٌ في الكمال لأن أمثال تلك الصفات فينا لا تكون واجبة للذات ملازمة لها فكان عدم الاختيار في صفات الله تعالى دليلاً على زيادة الكمال وفينا دليلاً على النقص ، وما كان نقصاً فينا باعتبار مّا قد يكون كمالاً لله تعالى باعتبار آخر مثل عدم الولد ، فلا حاجة إلى الأجوبة المبنية على التنزيل إما باعتبار الصفة أو باعتبار الموصوف ، على أن توجيه الثناء إلى الله تعالى بمادة ( حمد ) هو أقصى ما تسمى به اللغة الموضوعة لأداء المعاني المتعارفة لدى أهل تلك اللغة ، فلما طرأت عليهم المدارك المتعلقة بالحقائق العالية عبر لهم عنها بأقصى ما يقربها من كلامهم .( الحمد ) مرفوع بالابتداء في جميع القراءات المروية وقوله ( لله ) خبره فلام ( لله ) متعلق بالكون والاستقرار العام كسائر المجرورات المخبر بها وهو هنا من المصادر التي أتت بدلاً عن أفعالها في معنى الإخبار ، فأصله النصب على المفعولية المطلقة على أنه بدل من فعله وتقدير الكلام نحمد حمداً لله ، فلذلك التزموا حذف أفعالها معها . قال سيبويه هذا باب ما ينصب من المصادر على إضمار الفعل غير المستعمل إظهاره وذلك قولك سقياً ورعياً وخيبةً وبؤساً ، والحذرَ بدلاً عن احذر فلا يحتاج إلى متعلق وأما قولهم سقياً لك نحو :سقْياً وَرعْياً لذاك العاتببِ الزَّارِي ... فإنما هو ليبينوا المعنيَّ بالدعاء . ثم قال بعد أبواب : هذا باب ما ينتصب على إضمار الفعل المتروك إظهاره من المصادر في غير الدعاء ، من ذلك قولك حمداً وشُكراً لا كفراً وعَجباً ، فإنما ينتصب هذا على إضمار الفعل كأنك قلت أحمد الله حمداً وإنما اختُزِل الفعل هاهنا لأنهم جعلوا هذا بدلاً من اللفظ بالفعل كما فعلوا ذلك في باب الدعاء وقد جاء بعض هذا رفعاً يُبتدأ به ثم يبنى عليه ( أي يخبر عنه ) ثم قال بعد باب آخر : هذا باب يختار فيه أن تكون المصادر مبتدأة مبنياً عليها ما بعدَها ، وذلك قولك { الحمد لله } ، والعجبُ لك ، والويل له ، وإنما استحبوا الرفع فيه لأنه صار معرفة وهو خبر ( أي غير إنشاء ) فقوي في الابتداء ( أي إنه لما كان خبراً لا دعاء وكان معرفة بأَلْ تهيأت فيه أسباب الابتداء لأن كونه في معنى الإخبار يهّيىء جانب المعنى للخبرية وكونه معرفة يصحح أن يكون مبتدأ ) بمنزلة عبد الله ، والرجل ، والذي تَعْلم ( من المعارف ) لأن الابتداء إنما هو خبر وأحسنه إذا اجتمع معرفة ونكرة أن تبدأ بالأعرف وهو أصل الكلام . وليس كل حرف ( أي تركيب ) يصنع به ذاك ، كما أنه ليس كل حرف ( أي كلمة من هذه المصادر ) يدخل فيه الألف واللام ، فلو قلت السقي لك والرعي لك لم يجز ( يعني يقتصر فيه على السماع ) . واعلم أن { الحمدُ لله } وإن ابتدأْتَه ففيه معنى المنصوب وهو بدل من اللفظ بقولك أحمد الله . وسمعنا ناساً من العرب كثيراً يقولون : الترابَ لك والعجبَ لك ، فتفسير نصب هذا كتفسيره حيث كان نكرة ، كأنك قلت حمداً وعجباً ، ثم جئت بِلَك لتبين من تعني ولم تجعله مبنياً عليه فتبتدئه» . انتهى كلام سيبويه باختصار . وإنما جلبناه هنا لأنه أفصح كلام عن أطوار هذا المصدر في كلام العرب واستعمالهم ، وهو الذي أشار له صاحب «الكشاف» بقوله : «وأصله النصب بإضمار فعله على أنه من المصادر التي ينصبها العرب بأفعال مضمرة في معنى الإخبار كقولهم شكراً ، وكفراً ، وعجباً ، ينزلونها منزلة أفعالها ويسدون بها مسدها ، ولذلك لا يستعملونها معها والعدول بها عن النصب إلى الرفع على الابتداء للدلالة على ثبات المعنى» الخ .ومن شأن بلغاء العرب أنهم لا يعدلون عن الأصل إلا وهم يرمون إلى غرض عدلوا لأجله ، والعدول عن النصب هنا إلى الرفع ليتأتى لهم الدلالةُ على الدوام والثبات بمصير الجملة اسمية؛ والدلالةُ على العموم المستفاد في المقام من أل الجنسية ، والدلالةُ على الاهتمام المستفاد من التقديم . وليس واحد من هذه الثلاثة بممكن الاستفادة لو بقي المصدر منصوباً إذ النصب يدل على الفعل المقدر والمقدر كالملفوظ فلا تكون الجملة اسمية إذ الاسم فيها نائب عن الفعل فهو ينادي على تقدير الفعل فلا يحصل الدوام .ولأنه لا يصح معه اعتبار التقديم فلا يحصل الاهتمام . ولأنه وإن صح اجتماع الألف واللام مع النصب كما قرىء بذلك وهي لغة تميم كما قال سيبويه فالتعريف حينئذٍ لا يكون دالاً على عموم المحامد لأنه إن قدر الفعل أَحمدُ بهمزة المتكلم فلا يعم إلا تحميدات المتكلم دون تحميدات جميع الناس ، وإن قدر الفعل نحمد وأريد بالنون جميع المؤمنين بقرينة { اهدنا الصراط المستقيم } وبقرينة { إياك نعبد } فإنما يعم محامد المؤمنين أو محامد الموحدين كلهم ، كيف وقد حمد أهل الكتاب الله تعالى وحمده العرب في الجاهلية . قال أمية بن أبي الصلت :الحمد لله حمداً لا انقطاعَ له ... فليس إحسانُه عنا بمقطوعأما إذا صار الحمد غير جار على فعل فإنه يصير الإخبار عن جنس الحمد بأنه ثابت لله فيعم كل حمد كما سيأتي . فهذا معنى ما نُقل عن سيبويه أنه قال : إن الذي يَرْفع الحمدَ يُخبرُ أنَّ الحمدَ منه ومن جميع الخلق والذي ينصب يُخبرُ أن الحمد منه وحدَه لله تعالى .واعلم أن قراءة النصب وإن كانت شاذة إلا أنها مجدية هنا لأنها دلت على اعتبار عربي في تطور هذا التركيب المشهور ، وأَن بعض العرب نطقوا به في حال التعريف ولم ينسوا أصل المفعولية المطلقة . فقد بان أن قوله { الحمد لله } أبلغ من { الحمدَ لله } بالنصب ، وأنَّ { الحمدَ لله } بالنصب والتعريف أبلغ من حمداً لله بالتنكير . وإنما كان { الحمد لله } بالرفع أبلغ لأنه دال على الدوام والثبات . قال في «الكشاف» : «إن العدول عن النصب إلى الرفع للدلالة على ثبات المعنى واستقراره ومنه قوله تعالى : { قالوا سلاماً قال سلام } [ الذاريات : 25 ] رفع السلام الثاني للدلالة على أن إبراهيم عليه السلام حيّاهم بتحيّة أحسنَ من تحيّتهم» ا ه .فإن قلت وقع الاهتمام بالحمد مع أن ذكر اسم الله تعالى أهم فكان الشأن تقديم اسم الله تعالى وإبقاء الحمد غير مهتم به حتى لا يلجأ إلى تغييره عن النصب إلى الرفع لأجل هذا الاهتمام ، قلت قدم الحمد لأن المقام هنا مقام الحمد إذ هو ابتداء أَوْلى النعم بالحمد وهي نعمة تنزيل القرآن الذي فيه نجاح الدارين ، فتلك المنة من أكبر ما يحمد الله عليه من جلائل صفات الكمال لا سيما وقد اشتمل القرآن على كمال المعنى واللفظ والغاية فكان خطوره عند ابتداء سماع إنزاله وابتداء تلاوته مذكراً بما لمنزِّله تعالى من الصفات الجميلة ، وذلك يذكِّر بوجوب حمده وأن لا يُغفل عنه فكان المقام مقام الحمد لا محالة ، فلذلك قدم وأزيل عنه ما يؤذن بتأخره لمنافاته الاهتمام ، ثم إن ذلك الاهتمام تأتَّى به اعتبار الاهتمام بتقديمه أيضاً على ذكر الله تعالى اعتداداً بأهمية الحمد العارضةِ في المقام وإن ذكر الله أهمَّ في نفسه لأن الأهمية العارضة تقدم على الأهمية الأصلية لأنها أمر يقتضيه المقام والحال والآخر يقتضيه الواقع ، والبلاغة هي المطابقة لمقتضى الحال والمقاممِ ، ولأن ما كان الاهتمام به لعارض هو المحتاج للتنبيه على عارضه إذ قد يخفى ، بخلاف الأمر المعروف المقرر فلا فائدة في التنبيه عليه بل ولا يفيته التنبيه على غيره .فإن قلت كيف يصح كون تقديم الحمد وهو مبتدأ مؤذناً بالاهتمام مع أنه الأصل ، وشأن التقديم المفيد للاهتمام هو تقديم ما حقه التأخير؟قلت لو سلم ذلك فإن معنى تقديمه هو قصد المتكلم للإتيان به مقدماً مع إمكان الإتيان به مؤخراً؛ لأن للبلغاء صيغتين متعارفتين في حمد الله تعالى إحداهما { الحمدُ الله } كما في الفاتحة والأخرى { لله } كما في سورة الجاثية ( 36 ) .وأما قصد العموم فسيتضح عند بيان معنى التعريف فيه .والتعريف فيه بالألف واللام تعريف الجنس لأن المصدر هنا في الأصل عوض عن الفعل فلا جرم أن يكون الدال على الفعل والساد مسده دالاً على الجنس فإذا دخل عليه اللام فهو لتعريف مدلوله لأن اللام تدل على التعريف للمسمى فإذا كان المسمى جنساً فاللام تدل على تعريفه . ومعنى تعريف الجنس أن هذا الجنس هو معروف عند السامع فإذا قلت الحمد لله أو العجب لك فكأنك تريد أن هذا الجنس معروف لديك ولدى مخاطبك لا يلتبس بغيره كما أنك إذا قلت الرجل وأردت معيناً في تعريف العهد النحوي فإنك تريد أن هذا الواحد من الناس معروف بينك وبين مخاطبك فهو في المعنى كالنكرة من حيث إن تعريف الجنس ليس معه كبير معنى إذ تعين الجنس من بين بقية الأجناس حاصل بذكر لفظه الدال عليه لغة وهو كاف في عدم الدلالة على غيره ، إذ ليس غيره من الأجناس بمشارك له في اللفظ ولا متوهم دخوله معه في ذهن المخاطب بخلاف تعريف العهد الخارجي فإنه يدل على واحد معين بينك وبين مخاطبك من بين بقية أفراد الجنس التي يشملها اللفظ ، فلا يفيد هذا التعريف أعني تعريف الجنس إلا توكيد اللفظ وتقريره وإيضاحه للسامع؛ لأنك لما جعلته معهوداً فقد دللت على أنه واضح ظاهر ، وهذا يقتضي الاعتناء بالجنس وتقريبه من المعروف المشهور ، وهذا معنى قول صاحب «الكشاف» : «وهو نحو التعريف في أُرسلَها العِراكَ ومعناه الإشارة إلى ما يعرفه كل أحد من أن الحمد ما هو والعراك ما هو من بين أجناس الأفعال» وهو مأخوذ من كلام سيبويه .وليست لام التعريف هنا للاستغراق لما علمت أنها لام الجنس ولذلك قال صاحب «الكشاف» : «والاستغراق الذي توهمه كثير من الناس وهم منهم» غير أن معنى الاستغراق حاصل هنا بالمثال لأن الحكم باختصاص جنس الحمد به تعالى لوجود لام تعريف الجنس في قوله : { الحمد } ولام الاختصاص في قوله : { لله } يستلزم انحصار أفراد الحمد في التعلق باسم الله تعالى لأنه إذا اختص الجنسُ اختصت الأفراد؛ إذ لو تحقق فرد من أفراد الحمد لغير الله تعالى لتحقق الجنس في ضمنه فلا يتم معنى اختصاص الجنس المستفاد من لام الاختصاص الداخلة على اسم الجلالة ، ثم هذا الاختصاص اختصاص ادعائي فهو بمنزلة القصر الادعائي للمبالغة .واللام في قوله تعالى : { للَّه } يجوز أن يكون للاختصاص على أنه اختصاص ادعائي كما مر ، ويجوز أن يكون لام التقوية قوت تعلق العامل بالمفعول لضعف العامل بالفرعية وزاده التعريف باللام ضعفاً لأنه أبعدَ شبهه بالأفعال ، ولا يفوت معنى الاختصاص لأنه قد استفيد من تعريف الجزأين .هذا وقد اختلف في أن جملة ( الحمد ) هل هي خبر أو إنشاء؟ فإن لذلك مزيد تعلق بالتفسير لرجوعه إلى المعنى بقول القائل ( الحمد لله ) .وجماع القول في ذلك أن الإنشاء قد يحصل بنقل المركب من الخبرية إلى الإنشاء وذلك كصيغ العقود مثل بعت واشتريت ، وكذلك أفعال المدح والذم والرجاء كعسى ونعم وبئس وهذا الأخير قسمان منه ما استعمل في الإنشاء مع بقاء استعماله في الخبر ومنه ما خص بالإنشاء فالأول كصيغ العقود فإنها تستعمل أخباراً تقول بعت الدار لزيد التي أخبرتك بأنه ساومني إياها فهذا خبر ، وتقول بعت الدار لزيد أو بعتك الدار بكذا فهذا إنشاء بقرينة أنه جاء للإشهاد أو بقرينة إسناد الخبر للمخاطب مع أن المخبر عنه حال من أحواله ، والثاني كنعم وعسى .فإذا تقرر هذا فقد اختلف العلماء في أن جملة { الحمد لله } هل هي إخبار عن ثبوت { الحمد لله } أو هي إنشاء ثناء عليه إلى مذهبين ، فذهب فريق إلى أنها خبر ، وهؤلاء فريقان منهم من زعم أنها خبر باق على الخبرية ولا إشعار فيه بالإنشائية ، وأورد عليه أن المتكلم بها لا يكون حامداً لله تعالى مع أن القصد أنه يثني ويحْمد الله تعالى ، وأجيب بأن الخبر بثبوت الحمد له تعالى اعتراف بأنه موصوف بالجميل إذ الحمد هو عين الوصف بالجميل ، ويكفي أن يحصل هذا الوصف من الناس وينقله المتكلم . ويمكن أن يجاب أيضاً بأن المخبر داخل في عموم خبره عند الجمهور من أهل أصول الفقه . وأجيب أيضاً بأن كون المتكلم حامداً قد يحصل بالالتزام من الخبر يريدون أنه لازم عرفي لأن شأن الأمر الذي تضافر عليه الناس قديماً أن يقتدي بهم فيه غيرهم من كل من علمه ، فإخبار المتكلم بأنه علم ذلك يدل عرفاً على أنه مقتد بهم في ذلك هذا وجه اللزوم ، وقد خفي على كثير أي فيكون مثل حصول لازم الفائدة من الخبر المقررة في علم المعاني ، مثل قولك سهرتَ الليلة وأنت تريد أنك علمتَ بسهره ، فلا يلزم أن يكون ذلك إنشاء لأن التقدير على هذا القول أن المتكلم يخبر عن كونه حامداً كما يخبر عن كون جميع الناس حامدين فهي خبر لا إنشاء والمستفاد منها بطريق اللزوم معنى إخباري أيضاً .ويرد على هذا التقدير أيضاً أن حمد المتكلم يصير غير مقصود لذاته بل حاصلاً بالتبع مع أن المقام مقام حمد المتكلم لا حمد غيره من الناس ، وأجيب بأن المعنى المطابقي قد يؤتى به لأجل المعنى الالتزامي لأنه وسيلة له ، ونظيره قولهم طويل النجاد والمرادُ طول القامة فإن طول النجاد أتى به ليدل على معنى طول القامة .وذهب فريق ثان إلى أن جملة { الحمد لله } هي خبر لا محالة إلا أنه أريد منه الإنشاء مع اعتبار الخبرية كما يراد من الخبر إنشاء التحسر والتحزن في نحو : { إني وصعتُها أنثى } [ آل عمران : 36 ] وقول جعفر بن عُلْبة الحارثي :هوايَ مع الركْببِ اليمانين مُصِعدُ ... فيكون المقصد الأصلي هو الإنشاء ولكن العدولَ إلى الإخبار لما يتأتى بواسطة الإخبار من الدلالة على استغراق والاختصاص والدوام والثبات ووجه التلازم بين الإخبار عن حمد الناس وبين إنشاء الحمد واضح مما علمته في وجه التلازم على التقرير الأول ، بل هو هنا أظهر لأن المخبر عن حمد الناس لله تعالى لا جَرَم أنه منشىء ثناء عليه بذلك ، وكونُ المعنى الالتزامي في الكناية هو المقصود دون المعنى المطابقي أظهر منه في اعتبار الخبرية المحضة لما عهد في الكناية من أنها لفظ أريد به لازم معناه مع جواز إرادة الأصل معه ، فدل على أن المعنى الأصلي إما غير مراد أو مراد تبعاً لأن مع تدخل على المتبوع .المذهب الثاني أن جملة { الحمد لله } إنشاء محض لا إشعار له بالخبرية ، على أنها من الصيغ التي نقلتْها العرب من الإخبار إلى إنشاء الثناء كما نقلتْ صيغَ العقود وأفعالَ المدح والذم أي نقلاً مع عدم إماتة المعنى الخبري في الاستعمال ، فإنك قد تقول الحمد لله جواباً لمن قال لمن الحمدُ أو من أَحمد ولكنَّ تعهد المعنى الأصلي ضعيف فيحتاج إلى القرينة . والحق الذي لا محيد عنه أن الحمد لله خبر مستعمل في الإنشاء فالقصد هو الإنشائية لا محالة ، وعدل إلى الخبرية لتحمل جملة الحمد من الخصوصيات ما يناسب جلالة المحمود بها من الدلالة على الدوام والثبات والاستغراق والاختصاص والاهتمام ، وشيءٌ من ذلك لا يمكن حصوله بصيغةِ إنشاءٍ نحو حمداً لله أو أحمد الله حمداً ومما يدل على اعتبار العرب إياها إنشاء لا خبراً قول ذي الرمة :ولما جَرَتْ في الجزل جرياً كأنَّه ... سنا الفجر أَحْدَثْنا لخالقها شكرافعبر عن ذكر لفظ الحمد أو الشكر بالإحداث ، والإحداث يرادف الإنشاء لغة فقوله أحدثنا خبر حكى به ما عبر عنه بالإحداث وهو حَمْده الواقع حين التهابها في الحطب .والله هو اسم الذاتتِ الواجببِ الوجود المستحق لجميع المحامد . وأصل هذا الاسم الإله بالتعريف وهو تعريف إلاه الذي هو اسم جنس للمعبود مشتق من أَلَهَ بفتح اللام بمعنى عبد ، أو من ألِه بكسر اللام بمعنى تحير أو سكن أو فزع أو ولع مما يرجع إلى معنى هو ملزوم للخضوع والتعظيم فهو فِعال بكسر الفاء بمعنى مفعول مثل كتاب ، أطلقه العرب على كل معبود من أصنامهم لأنهم يرونها حقيقةً بالعبادة ولذلك جمعوه على آلهة بوزن أَفعلة مع تخفيف الهمزة الثانية مَدَّةً ، وأحسب أن اسمه تعالى تقرر في لغة العرب قبل دخول الإشراك فيهم فكان أصل وضعه دالاً على انفراده بالألوهية إذ لا إله غيره فلذلك صار علماً عليه ، وليس ذلك من قبيل العلمَ بالغلبة بل من قبيل العلم بالانحصار مثل الشمس والقمر فلا بدع في اجتماع كونه اسمَ جنس وكونه علماً ، ولذلك أرادوا به المعبود بحق رداً على أهل الشرك قبل دخول الشرك في العرب وإننا لم نقف على أن العرب أطلقوا الإله معرَّفاً باللام مفرداً على أحد أصنامهم وإنما يضيفون فيقولون إلاه بني فلان والأكثر أن يقولوا رَب بني فلان أو يجمعون كما قالوا لعبد المطلب أَرْضضِ الآلهةَ ، وفي حديث فتح مكة : «وجد رسول الله البيتَ فيه الآلهة» . فلما اختص الإله بالإله الواحد واجببِ الوجود اشتقوا له من اسم الجنس علماً زيادة في الدلالة على أنه الحقيق بهذا الاسم ليصير الاسم خاصاً به غير جائز الإطلاق على غيره سَنن الأعلام الشخصية ، وأَراهم أبدعوا وأَعجبوا إذ جعلوا علم ذاته تعالى مشتقاً من اسم الجنس المؤذن بمفهوم الألوهية تنبيهاً على أن ذاته تعالى لا تستحضر عند واضع العَلَم وهو الناطق الأول بهذا الاسم من أهل اللسان إلا بوصف الألوهية وتنبيهاً على أنه تعالى أَوْلى من يُؤَلَّه ويُعبد لأنه خالق الجميع فحذفوا الهمزة من الإله لكثرة استعمال هذا اللفظ عند الدلالة عليه تعالى كما حذفوا همزة الأناس فقالوا النَّاس؛ ولذلك أظهروها في بعض الكلام . قال البَعِيث بن حُرَيث .معَاذَ الإله أَنْ تكون كظبيةٍ ... ولا دُميةٍ ولا عقيلةِ رَبْرَبكما أظهروا همزة الأناس في قول عَبيد بن الأبرص الأسدي :إن المنَايَا ليطَّلِعْ ... نَ على الأناس الآمِنِينَونُزِّل هذا اللفظ في طوره الثالث منزلة الأعلام الشخصية فتصرفوا فيه هذا التصرف لينتقلوا به إلى طَور جديد فيجعلُوه مثل علم جديد ، وهذه الطريقة مسلوكة في بعض الأعلام . قال أبو الفتح بن جني في شرح قول تأبط شرا في النشيد الثالث عشر من «الحماسة» :إِني لمُهْدٍ من ثَنائي فقَاصِدٌ ... به لابن عم الصدق شُمْسسِ بن مَالكشُمس بضم الشين وأصله شَمس بفتحها كما قالوا حُجْر وسُلْمَى فيكون مما غُير عن نظائره لأجْل العلمية ا ه .وفي «الكشاف» في تفسير سورة أبي لهب بعد أن ذكر أن من القراء من قرأ ( أبي لهْبٍ ) بسكون الهاء ما نصه وهي من تغيير الأعلام كقولهم شُمْس بن مالك بالضم ا ه . وقال قبله : «ولفُلَيْتَه بن قاسم أمير مكة ابنان أحدهما عبدِ الله بالجر ، والآخر عبدَ الله بالنصب ، وكان بمكة رجل يقال له عبدِ الله لا يعرف إلا هكذا» ا ه . يعني بكسر دال عبد في جميع أحوال إعرابه ، فهو بهذا الإيماء نوع مخصوص من العَلَم ، وهو أنه أقوى من العلم بالغلَبة لأن له لفظاً جديداً بعد اللفظ المغلَّب . وهذه الطريقة في العلمية التي عرضت لاسم الجلالة لا نظير لها في الأعلام فكان اسمه تعالى غيرَ مشابه لأسماء الحوادث كما أن مسمى ذلك الاسممِ غير مماثل لمسميات أسماء الحوادث . وقد دلوا على تناسيهم ما في الألف واللام من التعريف وأنهم جعلوهما جزءاً من الكلمة بتجويزهم ندَاء اسم الجلالة مع إبقاء الألف واللام إذ يقولون يا الله مع أنهم يمنعون نداء مدخول الألف واللام .وقد احتج صاحب «الكشاف» على كون أصله الإله ببيت البعيث المتقدم ، ولم يقررْ ناظروه وجه احتجاجه به ، وهو احتجاج وجيه لأن مَعَاذ من المصادر التي لم ترد في استعمالهم مضافة لغير اسم الجلالة ، مثل سبحان فأجريت مُجرى أمثال في لزومها لهاته الإضافة ، إذ تقول معاذالله فلما قال الشاعر معاذ الإله وهو من فصحاء اللسان علمنا أنهم يعتبرون الإله أصلاً للفظ الله ، ولذلك لم يكن هذا التصرف تغييراً إلا أنه تصرف في حروف اللفظ الواحد كاختلاففِ وجوه الأداء مع كون اللفظ واحداً ، ألا ترى أنهم احتجوا على أن لاَه مخفف الله بقول ذي الأَصبع العَدْواني :لاَه ابنُ عمِّكَ لا أُفْضِلْتَ في حَسَبٍ ... عنّى ولا أنتَ ديَّانِي فتَخْزُونيوبقولهم لاَه أبوكَ لأن هذا مما لزم حالة واحدة ، إذ يقولون لله أبوك ولله ابن عمك ولله أنتَ .وقد ذُكِرتْ وجوه أخر في أصل اسم الجلالة : منها أن أصله لاَهٌ مصدر لاه يليه ليهاً إذا احتجب سمي به الله تعالى ، ثم أدخلت عليه الألف واللام للمح الأصل كالفضل والمَجد اسمين ، وهذا الوجه ذكر الجوهري عن سيبويه أنه جوزه . ومنها أن أصله وِلاَهٌ بالواو فِعال بمعنى مفعول من وله إذا تحيَّر ، ثم قلبت الواو همزة لاستثقال الكسرة عليها ، كما قلبت في إعاء وإشاح ، أي وِعاء ووشاح ، ثم عرف بالألف واللام وحذفت الهمزة . ومنها أن أصله ( لاَها ) بالسريانية علم له تعالى فعرب بحذف الألف وإدخال اللام عليه . ومنها أنه علم وضع لاسم الجلالة بالقصد الأوَّلِي من غير أخذ من أَلِهَ وتصييرِه الإله فتكون مقاربته في الصورة لقولنا الإله مقاربةً اتفاقيةً غير مقصودة ، وقد قال بهذا جمع منهم الزجاج ونسب إلى الخليل وسيبويه ، ووجَّهه بعض العلماء بأن العرب لم تهمل شيئاً حتى وضعت له لفظاً فكيف يتأتى منهم إهمال اسم له تعالى لتجري عليه صفاته .وقد التُزم في لفظ الجلالة تفخيم لامه إذا لم ينكسر ما قبل لفظه وحاول بعض الكاتبين توجيه ذلك بما لا يسلَم من المنع ، ولذلك أبَى صاحب «الكشاف» التعريج عليه فقال : «وعلى ذلك ( أي التفخيم ) العرب كلهم ، وإطباقهم عليه دليل أنهم ورثوه كابراً عن كابر» .وإنما لم يقدم المسند المجرور وهو متضمن لاسم الجلالة على المسند إليه فيقال لله الحمد ، لأن المسند إليه حَمْد على تنزيل القرآن والتشرف بالإسلام وهما منة من الله تعالى فحمده عليهما عند ابتداء تلاوة الكتاب الذي به صلاح الناس في الدارين فكان المقام للاهتمام به اعتباراً لأهمية الحمد العارضة ، وإن كان ذكر الله أهم أصالة فإن الأهمية العارضة تقدم على الأهمية الأصلية لاقتضاء المقام والحاللِ ، والبلاغة هي المطالبة لمقتضى الحال ، على أن الحمد لما تعلق باسم الله تعالى كان في الاهتمام به اهتمام بشؤون الله تعالى .ومن أعجب الآراء ما ذكره صاحب «المنهل الأصفى في شرح الشفاء» التلمساني عن جمع من العلماء القول بأن اسم الجلالة يمسك عن الكلام في معناه نعظيماً وإجلالاً ولتوقف الكلام فيه على إذن الشارع .{ رَبِّ العالمين } .وصف لاسم الجلالة فإنه بعد أن أسند الحمد لاسم ذاته تعالى تنبيهاً على الاستحقاق الذاتي ، عقبَ بالوصف وهو الرب ليكون الحمد متعلقاً به أيضاً لأن وصف المتعلَّق متعلَّق أيضاً ، فلذلك لم يقل الحمد لرب العالمين كما قال : { يوم يقوم الناس لرب العالمين } [ المطففين : 6 ] ليؤذن باستحقاقه الوصفي أيضاً للحمد كما استحقه بذاته .وقد أجرى عليه أربعة أوصاف هي : رب العالمين ، الرحمن ، الرحيم ، ملك يوم الدين ، للإيذان بالاستحقاق الوصفي فإن ذكر هذه الأسماء المشعرة بالصفات يؤذن بقصد ملاحظة معانيها الأصلية ، وهذا من المستفادات من الكلام بطريق الاستتباع لأنه لما كان في ذكر الوصف غنية عن ذكر الموصوف لا سيما إذا كان الوصف منزلاً منزلة الاسم كأوصافه تعالى وكان في ذكر لفظ الموصوف أيضاً غُنية في التنبيه على استحقاق الحمد المقصود من الجملة عَلمنا أن المتكلم ما جمع بينهما إلا وهو يشير إلى أن كِلاَ مَدلُولَيْ الموصوف والصفة جدير بتعلق الحمد له مع ما في ذكر أوصافه المختصة به من التذكير بما يُميزه عن الآلاهة المزعومة عند الأمم من الأصنام والأوثان والعناصر كما سيأتي عند قوله تعالى : { ملك يوم الدين } .والرب إما مصدر وإما صفة مشبهة على وزن فَعْل مِنْ رَبَّه يَرُبُّه بمعنى رباه وهو رَب بمعنى مُرَبَ وسائس . والتربية تبليغ الشيء إلى كماله تدريجاً ، ويجوز أن يكون من ربه بمعنى ملَكَه ، فإن كان مصدراً على الوجهين فالوصف به للمبالغة ، وهو ظاهر ، وإن كان صفة مشبهة على الوجهين فهي واردة على القليل في أوزان الصفة المشبهة فإنها لا تكون على فَعْل من فعَل يفعُل إلا قليلاً ، من ذلك قولهم نمّ الحديث ينُمُّه فهو نَمٌّ للحديث .والأظهر أنه مشتق من ربَّه بمعنى رباه وساسه ، لا من ربه بمعنى ملكه لأن الأول الأنسب بالمقام هنا إذ المراد أنه مدبر الخلائق وسائس أمورها ومبلغها غاية كمالها ، ولأنه لو حمل على معنى المالك لكان قوله تعالى بعد ذلك { ملك يوم الدين } كالتأكيد والتأكيد خلاف الأصل ولا داعي إِليه هنا ، إلا أن يجاب بأن العالمين لا يشمل إلا عوالم الدنيا ، فيحتاج إلى بيان أنه ملك الآخرة كما أنه ملك الدنيا ، وإن كان الأكثر في كلام العرب ورود الرب بمعنى الملك والسيد وذلك الذي دعا صاحب «الكشاف» إلى الاقتصار على معنى السيد والملك وجوز فيه وجهي المصدرية والصفة ، إلا أن قرينة المقام قد تصرف عن حمل اللفظ على أكثر موارده إلى حمله على ما دونه فإن كلا الاستعمالين شهير حقيقي أو مجازي والتبادر العارض من المقام المخصوص لا يقضي بتبادر استعماله في ذلك المعنى في جميع المواقع كما لا يخفي . والعرب لم تكن تخص لفظ الرب به تعالى لا مطلقاً ولا مقيداً لما علمت من وزنه واشتقاقه . قال الحرث بن حلزة :وهُوَ الرب والشهيدُ على يو ... م الحِيارَيْن والبلاء بلاءيعني عَمْرو بن هند . وقال النابغة في النعمان بن الحارث :تخُبُّ إلى النعمان حتى تناله ... فِدًى لك من ربَ طرِيفي وتالديوقال في النعمان بن المنذر حين مرض :ورَبٌّ عليه الله أحسن صنعه ... وكان له على البرية ناصراوقال صاحب «الكشاف» ومن تابعه : إنه لم يطلق على غيره تعالى إلا مقيداً أو لم يأتوا على ذلك بسند وقد رأيتَ أن الاستعمال بخلافه ، أما إطلاقه على كل من آلهتهم فلا مرية فيه كما قال غاوي بن ظالم أو عباس بن مرداس :أَرَبٌّ يبولُ الثُّعْلُبَانُ برأْسِه ... لقد هان من بالت عليه الثعالبُوسموا العزى الرَّبة . وجمْعه على أرباب أدل دليل على إطلاقه على متعدد فكيف تصح دعوى تخصيص إطلاقه عندهم بالله تعالى؟ وأما إطلاقه مضافاً أو متعلقاً بخاص فظاهر وروده بكثرة نحو رب الدار ورب الفرس ورب بني فلان .وقد ورد الإطلاق في الإسلام أيضاً حين حكى عن يوسف عليه السلام قوله : { إنه ربي أحسن مثواي } [ يوسف : 23 ] إذا كان الضمير راجعاً إلى العزيز وكذا قوله : { أأرباب متفرقون خير } [ يوسف : 39 ] فهذا إطلاق للرب مضافاً وغير مضاف على غير الله تعالى في الإسلام لأن اللفظ عربي أطلق في الإسلام ، وليس يوسفُ أطلَقَ هذا اللفظ بل أطلق مرادفه فلو لم يصح التعبير بهذا اللفظ عن المعنى الذي عبر به يوسف لكان في غيره من ألفاظ العربية مَعْدَل ، إنما ورد في الحديث النهي عن أن يقول أحد لسيده ربي وليقل سيدي ، وهو نهي كراهة للتأديب ولذلك خص النهي بما إذا كان المضاف إليه ممن يعبد عرفاً كأسماء الناس لدفع تهمة الإشراك وقطع دابره وجوزوا أن يقول رب الدابة ورب الدار ، وأما بالإطلاق فالكراهة أشد فلا يقل أحد للملك ونحوه هذا رب .و ( العالمين ) جمع عالم قالوا ولم يجمع فاعَلٌ هذا الجمع إلا في لفظين عالَم وياسم ، اسم للزهر المعروف بالياسمين ، قيل جمعوه على يَاسَمُون وياسَمِين قال الأعشى :وقابَلَنَا الجُلُّ والياسم ... ونَ والمُسْمِعات وقَصَّابهاوالعالم الجنس من أجناس الموجودات ، وقد بنته العرب على وزن فاعل بفتح العين مشتقاً من العِلْم أو من العلامة لأن كل جنس له تميز عن غيره فهو له علامة ، أو هو سببُ العلم به فلا يختلط بغيره . وهذا البناء مختص بالدلالة على الآلة غالباً كخاتم وقالب وطابع فجعلوا العوالم لكونها كالآلة للعلم بالصانع ، أو العلم بالحقائق . ولقد أبدع العرب في هذه اللطيفة إذ بنوا اسم جنس الحوادث على وزن فاعل لهذه النكتة ، ولقد أبدعوا إذ جمعوه جمع العقلاء مع أن منه ما ليس بعاقل تغليباً للعاقل .وقد قال التفتزاني في «شرح الكشاف» : «العالم اسم لذوي العلم ولكل جنس يعلم به الخالق ، يقال عالم الملك ، عالم الإنسان ، عالم النبات يريد أنه لا يطلق بالإفراد إلا مضافاً لنوع يخصصه يقال عالم الإنس عالم الحيوان ، عالم النبات وليس اسماً لمجموع ما سواه تعالى بحيث لا يكون له إجراء فيمتنع جمعه» وهذا هو تحقيق اللغة فإنه لا يوجد في كلام العرب إطلاق عالم على مجموع ما سوى الله تعالى ، وإنما أطلقه على هذا علماء الكلام في قولهم العالم حادث فهو من المصطلحات .والتعرف فيه للاستغراق بقرينة المقام الخطابي فإنه إذا لم يكن عهد خارجي ولم يكن معنى للحمل على الحقيقة ولا على المعهود الذهني تمحض التعريف للاستغراق لجميع الأفراد دفعاً للتحكم فاستغراقه استغراق الأجناس الصادق هو عليها لا محالة وهو معنى قول صاحب «الكشاف» : «ليشمل كل جنس مما سُمِّي به» إلا أن استغراق الأجناس يستلزم استغراق أفرادها استلزاماً واضحاً إذ الأجناس لا تقصد لذاتها لا سيما في مقام الحكم بالمربوبية عليها فإنه لا معنى لمربوبية الحقائق .وإنما جمع العالم ولم يُؤت به مفرداً لأن الجمع قرينة على استغراق ، لأنه لو أُفرد لتوهم أن المراد من التعريف العهد أو الجنس فكان الجمع تنصيصاً على الاستغراق ، وهذه سنة الجموع مع ( ال ) الاستغراقية على التحقيق ، ولما صارت الجمعية قرينة على الاستغراق بطل منها معنى الجماعات فكان استغراق الجموع مساوياً لاستغراق المفردات أو أشمل منه . وبطل ما شاع عند متابعي السكاكي من قولهم استغراق المفرد أشْمَل كما سنبينه عند قوله تعالى : { وعلم آدم الاسماء كلها } [ البقرة : 31 ] .\n","ar.waseet":"{ الحمد } هو الثناء باللسان على الجميل الصادر عن اختيار من نعمة أو غيرها.{ رب العالمين } أى: مالكهم، إذ الرب مصدر \" ربه يربه \" إذا تعاهده بالتربية حتى يبلغ به شيئاً فشيئا درجة الكمال. وهو اسم من أسماء الله - تعالى - ولا يطلق على غيره إلا مقيداً فيقال: رب الدار، ورب الضيعة أى: صاحبها ومالكها.والعالمين: جمع عالم، وهو كل موجود سوى الله - تعالى -قال القرطبى: \" وهو مأخوذ من العلم والعلامة لأنه يدل على موجده \" وقيل: المراد بالعالمين أولو العلم من الإِنس والجن والملائكة.وقد افتتحت سورة الفاتحة بهذه الجملة الكريمة { ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَالَمِينَ } لأنه سبحانه أول كل شئ وآخر كل شئ، ولكى يعلمنا - سبحانه - أن نبدأ كتبنا وخطبنا بالحمد والثناء عليه، حتى نبدأ ونحن فى صلة بالله تكشف عن النفوس أغشيتها، وتجلو عن القلوب أصداءها.والمعنى - كما قال ابن جرير - \" الشكر خالصاً لله - جل ثناؤه - دون سائر ما يعبد من دونه، ودون كل ما برأ من خلقه بما أنعم على عباده من النعم التى لا يحصيها العدد. ولا يحيط بعددها غيره أحد، فى تصحيح الآلات لطاعته، وتمكين جوارح أجسام المكلفين لأداء فرائضه، مع ما بسط لهم فى دنياهم من الرزق، وغذاهم به من نعيم العيش، عن غير استحقاق لهم عليه، ومع ما نبههم عليه ودعاهم إليه، من الأسباب المؤدية إلى دوام الخلود فى دار المقام فى النعيم المقيم. لربنا الحمد على ذلك كله أولا وآخراً.فالآية الكريمة قد قررت بصراحة ووضوح ثبوت الثناء المطلق الذى لا يحد لله - تعالى - وانه ليس لأحد أن ينازعه إباه - سبحانه - هو رب العالمين.وجملة { ٱلْحَمْدُ للَّهِ } مفيدة لقصر الحمد عليه - سبحانه - نحو قولهم: \" الكرم فى العرب \". كما أن أل فى \" الحمد \" للاستغراق. أى: أن جميع أجناس الحمد ثابتة لله رب العالمين.وإنما كان الحمد مقصوراً فى الحقيقة على الله، لأن كل ما يستحق أن يقابل بالثناء فهو صادر عنه ومرجعه إليه، إذ هو الخالق لكل شئ، وما يقدم إلى بعض الناس من حمد جزاء إحسانهم، فهو فى الحقيقة حمد لله، لأنه - سبحانه - هو الذى وفقهم لذلك وأعانهم عليه.ولم تفتتح السورة بصيغة الأمر بأن يقال: احمدوا الله، وإنما افتتحت بصيغة الخبر { ٱلْحَمْدُ للَّهِ } ، لأن الأمر يقتضى التكليف: والتكليف قد تنفر منه النفوس أحياناً، فأراد - سبحانه - وهو يبادئهم بشرعة جديدة وتكاليف لم يعهدوها، أن يؤنس نفوسهم، ويؤلف قلوبهم، فساق لهم الخطاب بصيغة الخبر، ترفقا بهم، حتى يديموا الإِصغاء لما سيلقيه عليهم من تكاليف.وقد تكلم بعض المفسرين عن الحكمة فى ابتداء السورة الكريمة بقوله - تعالى - { ٱلْحَمْدُ للَّهِ } ، دون قوله - تعالى -: المدح لله، أو: الشكر لله. فقال:اعلم أن المدح أعم من الحمد، والحمد أعم من الشكر. أما بيان أن المدح أعم من الحمد فلأن المدح يحصل للعاقل وغير العاقل، ألا ترى أنه كما يحسن مدح الرجل العاقل على أنواع فضائله، فكذلك قد يمدح اللؤلؤ لحسن شكله.أما الحمد فإنه لا يحصل إلا للفاعل المختار على ما يصدر منه من الإِنعام والإِحسان، فثبت أن المدح أعم من الحمد.وأما بيان أن الحمد أعم من الشكر، فلأن الحمد عبارة عن تعظيم الفاعل لأجل ما صدر عنه من الإِنعام. سواء أكان ذلك الإِنعام واصلا إليك أم إلى غيرك. وأما الشكر فهو عبارة عن تعظيمه لأجل إنعام وصل إليك، فثبت بما ذكرنا أن المدح أعم من الحمد، وأن الحمد أعم من الشكر.إذا عرفت هذا فنقول: إنما لم يقل: المدح لله، لأننا بينا أن المدح كما يحصل للفاعل المختار فقد يحصل لغيره. وأما الحمد فإنه لا يحصل إلا للفاعل المختار. فكان قوله \" الحمد لله \" تصريحاً بأن المؤثر فى وجود هذا العالم فاعل مختار خلقه بالقدرة والمشيئة... وإنما لم يقل: الشكر لله، لأننا بينا أن الشكر عبارة عن تعظيمه بسبب إنعام صدر منه ووصل إليك، وهذا يشعر بأن العبد إذا ذكر تعظيمه بسبب ما وصل إليه من النعمة. فحينئذ يكون المطلوب الأصلى له وصول النعمة إليه. وهذه درجة حقيرة. فأما إذا قال \" الحمد لله \" ، فهذا يدل على أن العبد حمده لأجل كونه مستحقا للحمد لا لخصوص أنه - سبحانه - أوصل النعمة إليه، فيكون الإِخلاص أكمل، واستغراق القلب فى مشاهدة نور الحق أتم، وانقطاعه عما سوى الحق أقوى وأثبت.وقد أجرى - سبحانه - على لفظ الجلالة نعت الربوبيه للعالمين، ليكون كالاستدلال على استحقاقه - تعالى - للحمد وحده، وفى ذلك إشعار لعباده بأنهم مكرمون من ربهم، إذ الأمر بغير توجيه فيه إيماء إلى إهمال عقولهم، أما إذا كان موجهاً ومعللا فإنه يكون فيه إشعار لهم برعاية ناحية العقل فيهم، وفى تلك الرعاية تشريف وتكريم لهم.فكأنه - سبحانه - يقول لهم: اجعلوا حمدكم وثناءكم لى وحدى. لأنى أنا رب العالمين. وأنا الذى تعهدتكم برعايتى وتربيتى منذ تكوينكم من الطين حتى استويتم عقلاء مفكرين.\n","ar.baghawi":"قوله: {الحمد لله}: لفظه خبر كأنه يخبر أن المستحق للحمد هو الله عز وجل وفيه تعليم الخلق تقديره قولوا الحمد لله، والحمد يكون بمعنى الشكر على النعمة، ويكون بمعنى الثناء عليه بما فيه من الخصال الحميدة. يقال: حمدت فلاناً على ما أسدى إلي من النعمة وحمدته على علمه وشجاعته، والشكر لا يكون إلا على النعمة، فالحمد أعم من الشكر إذ لا يقال شكرت فلاناً على علمه فكل حامد شاكر وليس كل شاكر حامداً.وقيل: الحمد باللسان قولاً والشكر بالأركان فعلاً، قال الله تعالى: {وقل الحمد لله الذي لم يتخذ ولداً} [11 - الإسراء]، وقال: {اعملوا آل داود شكراً} [123 - سبأ].قوله: {لله} اللام فيه للاستحقاق؛ كما يقال الدار لزيد.قوله: {رب العالمين}: فالرب يكون بمعنى المالك؛ كما يقال لمالك الدار: رب الدار، ويقال: رب الشيء إذا ملكه، ويكون بمعنى التربية والإصلاح، يقال: رب فلان الضيعة يربها إذا أتممها وأصلحها فهو رب مثل طب، وبر.فالله تعالى مالك العالمين ومربيهم، ولا يقال للمخلوق هو الرب مُعَرَّفاً إنما يقال رب كذا مضافاً، لأن الألف واللام للتعميم وهو لا يملك الكل.و(العالمين) جمع عالم، لا واحد له في لفظه، واختلفوا في العالمين؛ قال ابن عباس:\" هم الجن والإنس لأنهم المكلفون بالخطاب\"، قال الله تعالى: {ليكون للعالمين نذيراً} [1 - الفرقان].وقال قتادة ومجاهد والحسن: \"هم جميع المخلوقات\"، قال الله تعالى: {قال فرعون وما رب العالمين * قال رب السماوات والأرض وما بينهما} [23 - 24 الشعراء].واشتقاقه من العلم والعلامة سموا به لظهور أثر الصنعة فيهم، قال أبو عبيد: \"هم أربعة أمم: الملائكة، والإنس، والجن، والشياطين\".مشتق من العلم، ولا يقال للبهائم عالم لأنها لا تعقل، واختلفوا في مبلغهم، قال سعيد بن المسيب: \"لله ألف عالم ستمائة في البحر وأربعمائة في البر\".وقال مقاتل بن حيان: \"لله ثمانون ألف عالم أربعون ألفاً في البحر وأربعون ألفاً في البر\".وقال وهب: \"لله ثمانية عشر ألف عالم الدنيا عالم منها، وما العمران في الخراب إلا كفسطاط في صحراء\".وقال كعب الأحبار: \"لا يحصي عدد العالمين أحد إلا الله\"، قال الله تعالى: {وما يعلم جنود ربك إلا هو} [31 - المدثر].\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/2.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/2.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/2.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"الرَّحْمَٰنِ الرَّحِيمِ","transliteration":"Ar-Rahmaanir-Raheem","translations":{"en.ahmedali":"Most beneficent, ever-merciful,","en.ahmedraza":"The Most Gracious, the Most Merciful","en.arberry":"the All-merciful, the All-compassionate,","en.asad":"The Most Gracious, the Dispenser of Grace,","en.daryabadi":"The Compassionate, the Merciful.","en.hilali":"The Most Beneficent, the Most Merciful.","en.pickthall":"The Beneficent, the Merciful.","en.qaribullah":"the Merciful, the Most Merciful,","en.sahih":"The Entirely Merciful, the Especially Merciful,","en.sarwar":"the Beneficent, the Merciful","en.yusufali":"Most Gracious, Most Merciful;","en.maududi":"The Merciful, the Compassionate","en.shakir":"The Beneficent, the Merciful.","en.itani":"The Most Gracious, the Most Merciful.","en.mubarakpuri":"Ar-Rahman (the Most Gracious), Ar-Rahim (the Most Merciful).","en.qarai":"the All-beneficent, the All-merciful,","en.wahiduddin":"the Beneficent, the Merciful;"},"tafsir":{"ar.muyassar":"(الرَّحْمَنِ) الذي وسعت رحمته جميع الخلق، (الرَّحِيمِ)، بالمؤمنين، وهما اسمان من أسماء الله تعالى.","ar.jalalayn":"«الرحمن الرحيم» أي ذي الرحمة وهي إرادة الخير لأهله.","ar.qurtubi":"قوله تعالى : الرحمن الرحيم وصف نفسه تعالى بعد رب العالمين ، بأنه الرحمن الرحيم ; لأنه لما كان في اتصافه ب رب العالمين ترهيب قرنه ب الرحمن الرحيم ، لما تضمن من الترغيب ; ليجمع في صفاته بين الرهبة منه ، والرغبة إليه ; فيكون أعون على طاعته وأمنع ; كما قال : نبئ عبادي أني أنا الغفور الرحيم . وأن عذابي هو العذاب الأليم . وقال : غافر الذنب وقابل التوب شديد العقاب ذي الطول . وفي صحيح مسلم عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : لو يعلم المؤمن ما عند [ ص: 137 ] الله من العقوبة ما طمع بجنته أحد ولو يعلم الكافر ما عند الله من الرحمة ما قنط من جنته أحد . وقد تقدم ما في هذين الاسمين من المعاني ، فلا معنى لإعادته .\n","ar.miqbas":"وصفان مشتقان من رَحِم ، وفي «تفسير القرطبي» عن ابن الأَنباري عن المبرد أن الرحمن اسم عبراني نقل إلى العربية قال وأصله بالخاء المعجمة ( أي فأبدلت خاؤه حاء مهملة عند أكثر العرب كشأن التغيير في التعريب ) وأنشد على ذلك قول جرير يخاطب الأخطل :أو تتركُنَّ إلى القسّيس هِجْرَتكم ... ومسْحَكُم صُلْبَكم رَخْمان قُربَانا( الرواية بالخاء المعجمة ) ولم يأت المبرد بحجة على ما زعمه ، ولم لا يكون الرحمن عربياً كما كان عبرانياً فإن العربية والعبرانية أختان وربما كانت العربية الأصلية أقدم من العبرانية ولعل الذي جرأه على ادعاء أن الرحمن اسم عبراني ما حكاه القرآن عن المشركين في قوله : { قالوا وما الرحمن } [ الفرقان : 60 ] ويقتضي أن العرب لم يكونوا يعلمون هذا الاسم لله تعالى كما سيأتي بعض عرب اليمن يقولون رَخِم رخمة بالمعجمة .واسم الرحمة موضوع في اللغة العربية لرقة الخاطر وانعطافه نحو حيّ بحيث تحمل من اتصف بها على الرفق بالمرحوم والإحسان إليه ودفع الضر عنه وإعانته على المشاق . فهي من الكيفيات النفسانية لأنها انفعال ، ولتلك الكيفية اندفاع يحمل صاحبها على أفعال وجودية بقدر استطاعته وعلى قدر قوة انفعاله ، فأصل الرحمة من مَقُولة الانفعال وآثارُها من مقولة الفِعل ، فإذا وصف موصوف بالرحمة كان معناه حصول الانفعال المذكور في نفسه ، وإذا أخبر عنه بأنه رحم غيره فهو على معنى صدَر عنه أثر من آثار الرحمة ، إذ لا تكون تعدية فعل رحم إلى المرحوم إلا على هذا المعنى فليس لماهية الرحمة جزئيات وجودية ولكنها جزئيات من آثارها . فوصف الله تعالى بصفات الرحمة في اللغات ناشىء على مقدار عقائد أهلها فيما يجوز على الله ويستحيل ، وكان أكثر الأمم مجسِّمة ثم يجيء ذلك في لسان الشرائع تعبيراً عن المعاني العالية بأقصَى ما تسمح به اللغات مع اعتقاد تنزيه الله عن أعراض المخلوقات بالدليل العام على التنزيه وهو مضمون قول القرآن : { ليس كمثله شيء } [ الشورى : 11 ] فأهل الإيمان إذا سمعوا أو أطلقوا وصفي الرحمن الرحيم لا يفهمون منه حصول ذلك الانفعال الملحوظ في حقيقةِ الرحمة في متعارف اللغة العربية لسطوع أدلة تنزيه الله تعالى عن الأعراض ، بل إنه يراد بهذا الوصف في جانب الله تعالى إثباتُ الغرض الاسمي من حقيقة الرحمة وهو صدور آثار الرحمة من الرفق واللطف والإحسان والإعانة؛ لأن ما عدا ذلك من القيود الملحوظة في مسمى الرحمة في متعارف الناس لا أهمية له لولا أنه لا يمكن بدونه حصول آثاره فيهم ألا ترى أن المرء قد يرحم أحداً ولا يملك له نفعاً لعَجز أو نحوه .وقد أشار إلى ما قلناه أبو حامد الغزالي في «المقصد الأسنى» بقوله : «الذي يريد قضاء حاجة المحتاج ولا يقضيها فإن كان قادراً على قضائها لم يسمَّ رحيماً إذ لو تمت الإرادة لوفَّى بها وإن كان عاجزاً فقد يسمى رحيماً باعتبار ما اعتوره من الرحمة والرقة ولكنه ناقص» .وبهذا تعلم أن إطلاق نحو هذا الوصف على الله تعالى ليس من المتشابه لتبادر المعنى المراد منه بكثرة استعماله وتحقق تنزه الله عن لوازم المعنى المقصود في الوضع مما لا يليق بجلال الله تعالى كما نطلق العليم على الله مع التيقن بتجرد علمه عن الحاجة إلى النظر والاستدلال وسبق الجهل ، وكما نطلق الحي عليه تعالى مع اليقين بتجرد حياته عن العادة والتكون ، ونطلق القدرة مع اليقين بتجرد قدرته عن المعالجة والاستعانة . فوصفه تعالى بالرحمن الرحيم من المنقولات الشرعية فقد أثبت القرآن رحمة الله في قوله : { ورحمتي وسعت كل شيء } [ الأعراف : 156 ] فهي منقولة في لسان الشرع إلى إرادة الله إيصال الإحسان إلى مخلوقاته في الحياة الدنيا وغالبُ الأسماء الحسنى من هذا القبيل . وأما المتشابه فهو ما كانت دلالته على المعنى المنزه عنه أقوى وأشد وسيأتي في سورة آل عمران ( 7 ) عند قوله تعالى : { وأخر متشابهات } والذي ذهب إليه صاحب الكشاف } وكثير من المحققين أن الرحمن صفة مشبهة كغضبان وبذلك مثله في «الكشاف» .وفعل رَحِم وإن كان متعدياً والصفة المشبهة إنما تصاغ من فِعللٍ لازم إلا أن الفعل المتعدي إذا صار كالسجية لموصوفه ينزل منزلة أفعال الغرائز فيحول من فِعَل بفتح العين أو كسرها إلى فَعُل بضم العين للدلالة على أنه صار سجية كما قالوا فقُه الرجل وظرف وفهم ، ثم تشتق منه بعد ذلك الصفة المشبهة ، ومثله كثير في الكلام ، وإنما يعرف هذا التحويل بأحد أمرين إما بسماع الفعل المحول مثل فقُه وإما بوجود أثره وهو الصفة المشبهة مثل بليغ إذا صارت البلاغة سجية له ، مع عدم أو قلة سماع بلغ . ومن هذا رحمن إذ لم يسمع رحم بالضم . ومن النحاة من منع أن يكون الرحمن صفة مشبهة بناء على أن الفعل المشتق هو منه فعل متعد وإليه مال ابن مالك في «شرح التسهيل» في باب الصفة المشبهة ونظره برب وملك . .وأما الرحيم فذهب سيبويه إلى أنه من أمثلة المبالغة وهو باق على دلالته على التعدي وصاحب «الكشاف» والجمهور لم يثبتوا في أمثلة المبالغة وزن فعيل فالرحيم عندهم صفة مشبهة أيضاً مثل مريض وسقيم ، والمبالغة حاصلة فيه على كلا الاعتبارين . والحق ما ذهب إليه سيبويه .ولا خلاف بين أهل اللغة في أن الوصفين دالان على المبالغة في صفة الرحمة أي تمكنها وتعلقها بكثير من المرحومين وإنما الخلاف في طريقة استفادة المبالغة منهما وهل هما مترادفان في الوصف بصفة الرحمة أو بينهما فارق؟ والحق أن استفادة المبالغة حاصلة من تتبع الاستعمال وأن الاستعمال جرى على نكتة في مراعاة واضعي اللغة زيادة المبنى لقصد زيادة في معنى المادة قال في «الكشاف» : «ويقولون إن الزيادة في البناء لزيادة المعنى وقال الزجاج في الغضبان هو الممتلىء غضباً ومما طن على أذني من ملح العرب أنهم يسمون مَرْكَباً من مراكبهم بالشُّقْدُف وهو مركب خفيف ليس في ثقل محامل العراق فقلت في طريق الطائف لرجل منهم ما اسم هذا المحمل أردت المحمل العراقي فقال أليس ذاك اسمه الشقندف؟ قلت بلى فقال هذا اسمه الشِّقِنْدَاف فزاد في بناء الاسم لزيادة المسمى» وهي قاعدة أغلبية لا تتخلف إلا في زيادات معروفة موضوعة لزيادة معنى جديد دون زيادة في أصل معنى المادة مثل زيادة ياء التصغير فقد أفادت معنى زائداً على أصل المادة وليس زيادة في معنى المادة .وأما نحو حَذِر الذي هو من أمثلة المبالغة وهو أقل حروفاً من حاذر فهو من مستثنيات القاعدة لأنها أغلبية .وبعد كون كل من صفتي الرحمن الرحيم دالة على المبالغة في اتصافه تعالى بالرحمة فقد قال الجمهور إن الرحمن أبلغ من الرحيم بناء على أن زيادة المبنى تؤذن بزيادة المعنى وإلى ذلك مال جمهور المحققين مثل أبي عبيدة وابن جني والزجاج والزمخشري وعلى رعي هذه القاعدة أعني أن زيادة المبنى تؤذن بزيادة المعنى فقد شاع ورود إشكال على وجه إرداف وصفه الرحمن بوصفه بالرحيم مع أن شأن أهل البلاغة إذا أجروا وصفين في معنى واحد على موصوف في مقام الكمال أن يرتقوا من الأعم إلى الأخص ومن القوي إلى الأقوى كقولهم شجاع باسل وجواد فياض ، وعالم نحرير ، وخطيب مصقع ، وشاعر مفلق ، وقد رأيت للمفسرين في توجيه الارتقاء من الرحمن إلى الرحيم أجوبة كثيرة مرجعها إلى اعتبار الرحمن أخص من الرحيم فتعقيب الأول بالثاني تعميم بعد خاص ولذلك كان وصف الرحمن مختصاً به تعالى وكان أول إطلاقه مما خصه به القرآن على التحقيق بحيث لم يكن التوصيف به معروفاً عند العرب كما سيأتي . ومدلول الرحيم كون الرحمة كثيرة التعلق إذ هو من أمثلة المبالغة ولذلك كان يطلق على غير الله تعالى كما في قوله تعالى في حق رسوله { بالمؤمنين رؤوف رحيم } [ التوبة : 128 ] فليس ذكر إحدى الصفتين بمغن عن الأخرى :وتقديم الرحمن على الرحيم لأن الصيغة الدالة على الإتصاف الذاتي أولى بالتقديم في التوصيف من الصفة الدالة على كثرة متعلقاتها . وينسب إلى قطرب أن الرحمن والرحيم يدلان على معنى واحد من الصفة المشبهة فهما متساويان وجعل الجمع بينهما في الآية من قبيل التوكيد اللفظي ومال إليه الزجاج وهو وجه ضعيف إذ التوكيد خلاف الأصل والتأسيس خير من التأكيد والمقام هنا بعيد عن مقتضى التوكيد . وقد ذكرت وجوه في الجمع بين الصفتين ليست بمقنعة .وقد ذكر جمهور الأئمة أن وصف الرحمن لم يطلق في كلام العرب قبل الإسلام وأن القرآن هو الذي جاء به صفة لله تعالى فلذلك اختص به تعالى حتى قيل إنه اسم له وليس بصفة واستدلوا على ذلك بقوله تعالى :{ وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن } [ الفرقان : 60 ] وقال : { وهم يكفرون بالرحمن } [ الرعد : 30 ] وقد تكرر مثل هاتين الآيتين في القرآن وخاصة في السور المكية مثل سورة الفرقان وسورة الملك وقد ذكر الرحمن في سورة الملك باسمه الظاهر وضميره ثماني مرات مما يفيد الاهتمام بتقرير هذا الاسم لله تعالى في نفوس السامعين فالظاهر أن هذا الوصف تنوسي في كلامهم ، أو أنكروا أن يكون من أسماء الله .ومن دقائق القرآن أنه آثر اسم الرحمن في قوله : { ما يمسكهن إلا الرحمن } في سورة الملك ( 19 ) ، وقال : { ما يمسكهن إلا الله } في سورة النحل ( 79 ) إذ كانت آية سورة الملك مكية وآية سورة النحل القدر النازل بالمدينة من تلك السورة ، وأما قول بعض شعراء بني حنيفة في مسيلمة :سموت بالمجد يا ابن الأكرمين أباً ... وأنت غيث الورى لا زلت رحمانافإنما قاله بعد مجىء الإسلام وفي أيام ردة أهل اليمامة ، وقد لقبوا مسيلمة أيامئذٍ رحمن اليمامة وذلك من غلوهم في الكفر . وإجراء هذين الوصفين العليين على اسم الجلالة بعد وصفه بأنه رب العالمين لمناسبة ظاهرة للبليغ لأنه بعد أن وصف بما هو مقتضى استحقاقه الحمد من كونه رب العالمين أي مدبر شؤونهم ومبلغهم إلى كمالهم في الوجودين الجثماني والروحاني ، ناسب أن يتبع ذلك بوصفه بالرحمن أي الذي الرحمة له وصف ذاتي تصدر عنه آثاره بعموم واطراد على ما تقدم ، فلما كان رباً للعالمين وكان المربوبون ضعفاء كان احتياجهم للرحمة واضحاً وكان ترقبهم إياها من الموصوف بها بالذات ناجحاً .فإن قلت إن الربوبية تقتضي الرحمة لأنها إبلاغ الشيء إلى كماله شيئاً فشيئاً وذلك يجمع النعم كلها ، فلماذا احتيج إلى ذكر كونه رَحماناً؟ قلت لأن الرحمة تتضمن أن ذلك الإبلاغ إلى الكمال لم يكن على وجه الإعنات بل كان برعاية ما يناسب كل نوع وفرد ويلائم طوقه واستعداده ، فكانت الربوبية نعمة ، والنعمة قد تحصل بضرب من الشدة والأذى ، فأتبع ذلك بوصفه بالرحمن تنبيهاً على أن تلك النعم الجليلة وصلت إلينا بطريق الرفق واليسر ونفي الحرج ، حتى في أحكام التكاليف والمناهي والزواجر فإنها مرفوقة باليسر بقدر ما لا يبطل المقصود منها ، فمعظم تدبيره تعالى بنا هو رحمات ظاهرة كالتمكين من الأرض وتيسير منافعها ، ومنه ما رحمته بمراعاة اليسر بقدر الإمكان مثل التكاليف الراجعة إلى منافعنا كالطهارة وبث مكارم الأخلاق ، ومنها ما منفعته للجمهور فتتبعها رحمات الجميع لأن في رحمة الجمهور رحمة بالبقية في انتظام الأحوال كالزكاة . :وقد اختلف في أن لفظ رحمن لو لم يقرن بلام التعريف هل يصرف أو يمنع من الصرف؟ قال في الكافية } : «النون والألف إذا كانا في صفة فشرط منعه من الصرف انتفاء فَعلانة ، وقيل وجود فَعْلى ، ومن ثم اختلف في رحمن ، وبنو أسد يصرفون جميع فَعلان لأنهم يقولون في كل مؤنث له فعلانة» واختار الزمخشري والرضى وابن مالك عدم صرفه .\n","ar.waseet":"وقد أتبع - سبحانه - هذا الوصف وهو { رَبِّ ٱلْعَالَمِينَ } ، بوصف آخر هو { ٱلرَّحْمـٰنِ ٱلرَّحِيمِ } لحكم سامية من أبرزها: أن وصفه - تعالى - بـ { رَبِّ ٱلْعَالَمِينَ } أى: مالكهم، قد يثير فى النفوس شيئاً من الخوف أو الرهبة، فإن المربى قد يكون خشناً جباراً متعنتاً، وذلك مما يخدش من جميل التربية، وينقص من فضل التعهد.لذا قرن - سبحانه - كونه مربياً، بكونه الرحمن الرحيم، لينفى بذلك هذا الاحتمال، وليفهم عباده بأن ربوبيته لهم مصدرها عموم رحمته وشمول إحسانه، فهم برحمته يوجدون، وبرحمته يتصرفون ويرزقون، وبرحمته يبعثون ويسألون.ولا شك أن فى هذا الإِفهام تحريضاً لهم على حمده وعبادته بقلوب مطمئنة، ونفوس مبتهجة، ودعوة لهم إلى أن يقيموا حياتهم على الرحمة والإِحسان، لا على الجبروت والطغيان، فالراحمون يرحمهم الرحمن.\n","ar.baghawi":"قوله ( الرحمن الرحيم ) قال ابن عباس رضي الله عنهما هما اسمان رقيقان أحدهما أرق من الآخر . واختلفوا فيهما منهم من قال هما بمعنى واحد مثل ندمان ونديم ومعناهما ذو الرحمة وذكر أحدهما بعد الآخر تطميعا لقلوب الراغبين . وقال المبرد : هو إنعام بعد إنعام وتفضل بعد تفضل ومنهم من فرق بينهما فقال الرحمن بمعنى العموم والرحيم بمعنى الخصوص . فالرحمن بمعنى الرزاق في الدنيا وهو على العموم لكافة الخلق . والرحيم بمعنى المعافي في الآخرة والعفو في الآخرة للمؤمنين على الخصوص ولذلك قيل في الدعاء يا رحمن الدنيا ورحيم الآخرة فالرحمن من تصل رحمته إلى الخلق على العموم والرحيم من تصل رحمته إليهم على الخصوص ولذلك يدعى غير الله رحيما ولا يدعى غير الله رحمن . فالرحمن عام المعنى خاص اللفظ والرحيم عام اللفظ خاص المعنى والرحمة إرادة الله تعالى الخير لأهله . وقيل هي ترك عقوبة من يستحقها وإسداء الخير إلى من لا يستحق فهي على الأول صفة ذات وعلى الثاني صفة ( فعل ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/3.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/3.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/3.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"مَالِكِ يَوْمِ الدِّينِ","transliteration":"Maaliki Yawmid-Deen","translations":{"en.ahmedali":"King of the Day of Judgement.","en.ahmedraza":"Owner of the Day of Recompense","en.arberry":"the Master of the Day of Doom.","en.asad":"Lord of the Day of Judgment!","en.daryabadi":"Sovereign of the Day of Requital.","en.hilali":"The Only Owner (and the Only Ruling Judge) of the Day of Recompense (i.e. the Day of Resurrection)","en.pickthall":"Master of the Day of Judgment,","en.qaribullah":"Owner of the Day of Recompense.","en.sahih":"Sovereign of the Day of Recompense.","en.sarwar":"and Master of the Day of Judgment","en.yusufali":"Master of the Day of Judgment.","en.maududi":"The Master of the Day of Recompense.","en.shakir":"Master of the Day of Judgment.","en.itani":"Master of the Day of Judgment.","en.mubarakpuri":"The Owner of the Day of Recompense.","en.qarai":"Master of the Day of Retribution.","en.wahiduddin":"Lord of the Day of Judgement."},"tafsir":{"ar.muyassar":"وهو سبحانه وحده مالك يوم القيامة، وهو يوم الجزاء على الأعمال. وفي قراءة المسلم لهذه الآية في كل ركعة من صلواته تذكير له باليوم الآخر، وحثٌّ له على الاستعداد بالعمل الصالح، والكف عن المعاصي والسيئات.","ar.jalalayn":"أي الجزاء وهو يوم القيامة، وخص بالذكر لأنه لا ملك ظاهرًا فيه لأحد إلا الله تعالى بدليل «لمن الملك اليوم؟ لله» ومن قرأ مالك فمعناه الأمر كله في يوم القيامة أو هو موصوف بذلك دائمًا «كغافر الذنب» فصح وقوعه صفة لمعرفة.","ar.qurtubi":"قوله تعالى : مالك يوم الدينقرأ محمد بن السميقع بنصب \" مالك \" ; وفيه أربع لغات : مالك وملك وملك - مخففة من ملك - ومليك . قال الشاعر :وأيام لنا غر طوال عصينا الملك فيها أن نديناوقال آخر :فاقنع بما قسم المليك فإنما     قسم الخلائق بيننا علامهاالخلائق : الطبائع التي جبل الإنسان عليها . وروي عن نافع إشباع الكسرة في \" ملك \" فيقرأ \" ملكي \" على لغة من يشبع الحركات ، وهي لغة للعرب ذكرها المهدوي وغيره .الخامسة عشر : اختلف العلماء أيما أبلغ : ملك أو مالك ؟ والقراءتان مرويتان عن النبي صلى الله عليه وسلم وأبي بكر وعمر . ذكرهما الترمذي ; فقيل : \" ملك \" أعم وأبلغ من \" مالك \" إذ كل ملك مالك ، وليس كل مالك ملكا ; ولأن الملك نافذ على المالك في ملكه ، حتى لا يتصرف إلا عن تدبير الملك ، قال أبو عبيدة والمبرد . وقيل : \" مالك \" أبلغ ; لأنه يكون مالكا للناس وغيرهم ; فالمالك أبلغ تصرفا وأعظم ; إذ إليه إجراء قوانين الشرع ، ثم عنده زيادة التملك . وقال أبو علي : حكى أبو بكر بن السراج عن بعض من اختار القراءة ب \" مالك \" أن الله سبحانه قد وصف نفسه بأنه مالك كل شيء بقول : رب العالمين فلا فائدة في قراءة من قرأ \" مالك \" لأنها تكرار . قال أبو علي : ولا حجة في هذا ; لأن في التنزيل أشياء على هذه الصورة ، تقدم العام ثم ذكر الخاص كقوله : هو الله الخالق البارئ المصور فالخالق يعم . وذكر \" المصور \" لما فيه من التنبيه على الصنعة ووجود الحكمة ، وكما قال تعالى : وبالآخرة هم يوقنون بعد قوله : الذين يؤمنون بالغيب . والغيب يعم الآخرة وغيرها ; ولكن ذكرها لعظمها ، والتنبيه على وجوب اعتقادها ، والرد على الكفرة الجاحدين [ ص: 138 ] لها ; وكما قال : الرحمن الرحيم فذكر الرحمن الذي هو عام وذكر الرحيم بعده ، لتخصيص المؤمنين به في قوله : وكان بالمؤمنين رحيما . وقال أبو حاتم : إن \" مالكا \" أبلغ في مدح الخالق من \" ملك \" ، و \" ملك \" أبلغ في مدح المخلوقين من مالك ; والفرق بينهما أن المالك من المخلوقين قد يكون غير ملك وإذا كان الله تعالى مالكا كان ملكا ، واختار هذا القول القاضي أبو بكر بن العربي وذكر ثلاثة أوجه ;الأول : أنك تضيفه إلى الخاص والعام ، فتقول : مالك الدار والأرض والثوب ، كما تقول : مالك الملوك .الثاني : أنه يطلق على مالك القليل والكثير ; وإذا تأملت هذين القولين وجدتهما واحدا .والثالث : أنك تقول : مالك الملك ; ولا تقول : ملك الملك .قال ابن الحصار : إنما كان ذلك لأن المراد من \" مالك \" الدلالة على الملك - بكسر الميم - وهو لا يتضمن \" الملك \" - بضم الميم - و \" ملك \" يتضمن الأمرين جميعا فهو أولى بالمبالغة . ويتضمن أيضا الكمال ، ولذلك استحق الملك على من دونه ; ألا ترى إلى قوله تعالى : إن الله اصطفاه عليكم وزاده بسطة في العلم والجسم ولهذا قال عليه السلام : الإمامة في قريش وقريش أفضل قبائل العرب ، والعرب أفضل من العجم وأشرف . ويتضمن الاقتدار والاختيار وذلك أمر ضروري في الملك ، إن لم يكن قادرا مختارا نافذا حكمه وأمره ، قهره عدوه وغلبه غيره وازدرته رعيته ، ويتضمن البطش والأمر والنهي والوعد والوعيد ; ألا ترى إلى قول سليمان عليه السلام : ما لي لا أرى الهدهد أم كان من الغائبين . لأعذبنه عذابا شديدا إلى غير ذلك من الأمور العجيبة والمعاني الشريفة التي لا توجد في المالك .قلت : وقد احتج بعضهم على أن مالكا أبلغ لأن فيه زيادة حرف ; فلقارئه عشر حسنات زيادة عمن قرأ ملك . قلت : هذا نظر إلى الصيغة لا إلى المعنى ، وقد ثبتت القراءة بملك وفيه من المعنى ما ليس في مالك ، على ما بينا والله أعلم .لا يجوز أن يتسمى أحد بهذا الاسم ولا يدعى به إلا الله تعالى ; روى البخاري ومسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : يقبض الله الأرض يوم القيامة [ ص: 139 ] ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض وعنه أيضا عن النبي صلى الله عليه وسلم قال : إن أخنع اسم عند الله رجل تسمى ملك الأملاك - زاد مسلم - لا مالك إلا الله عز وجل قال سفيان : مثل : شاهانشاه . وقال أحمد بن حنبل : سألت أبا عمرو الشيباني عن أخنع ; فقال : أوضع . وعنه قال : قال رسول الله صلى الله عليه وسلم : أغيظ رجل على الله يوم القيامة وأخبثه رجل [ كان ] يسمى ملك الأملاك لا ملك إلا الله سبحانه . قال ابن الحصار : وكذلك \" ملك يوم الدين \" و \" مالك الملك \" لا ينبغي أن يختلف في أن هذا محرم على جميع المخلوقين كتحريم ملك الأملاك سواء ، وأما الوصف بمالك وملك وهي :فيجوز أن يوصف بهما من اتصف بمفهومهما ; قال الله العظيم : إن الله قد بعث لكم طالوت ملكا . وقال صلى الله عليه وسلم : ناس من أمتي عرضوا علي غزاة في سبيل الله يركبون ثبج هذا البحر ملوكا على الأسرة أو مثل الملوك على الأسرة .إن قال قائل : كيف قال مالك يوم الدين ويوم الدين لم يوجد بعد ، فكيف وصف نفسه بملك ما لم يوجده ؟ قيل له : اعلم أن مالكا اسم فاعل من ملك يملك ، واسم الفاعل في كلام العرب قد يضاف إلى ما بعده وهو بمعنى الفعل المستقبل ويكون ذلك عندهم كلاما سديدا معقولا صحيحا ; كقولك : هذا ضارب زيد غدا ; أي سيضرب زيدا . وكذلك : هذا حاج بيت الله في العام المقبل ، تأويله سيحج في العام المقبل ; أفلا ترى أن الفعل قد ينسب إليه وهو لم يفعله بعد ، وإنما أريد به الاستقبال ; فكذلك قوله عز وجل : مالك يوم الدين على تأويل الاستقبال ، أي سيملك يوم الدين أو في يوم الدين إذا حضر .[ ص: 140 ] ووجه ثان : أن يكون تأويل المالك راجعا إلى القدرة ، أي إنه قادر في يوم الدين ، أو على يوم الدين وإحداثه ; لأن المالك للشيء هو المتصرف في الشيء والقادر عليه ; والله عز وجل مالك الأشياء كلها ومصرفها على إرادته ، لا يمتنع عليه منها شيء .والوجه الأول أمس بالعربية وأنفذ في طريقها ; قاله أبو القاسم الزجاجي .ووجه ثالث : فيقال لم خصص يوم الدين وهو مالك يوم الدين وغيره ؟ قيل له : لأن في الدنيا كانوا منازعين في الملك ، مثل فرعون ونمروذ وغيرهما ، وفي ذلك اليوم لا ينازعه أحد في ملكه ، وكلهم خضعوا له ، كما قال تعالى : لمن الملك اليوم فأجاب جميع الخلق : لله الواحد القهار فلذلك قال : مالك يوم الدين ; أي في ذلك اليوم لا يكون مالك ولا قاض ولا مجاز غيره ; سبحانه لا إله إلا هو .إن وصف الله سبحانه بأنه ملك كان ذلك من صفات ذاته وإن وصف بأنه مالك كان ذلك من صفات فعله .اليوم : عبارة عن وقت طلوع الفجر إلى وقت غروب الشمس ، فاستعير فيما بين مبتدأ القيامة إلى وقت استقرار أهل الدارين فيهما . وقد يطلق اليوم على الساعة منه ; قال الله تعالى : اليوم أكملت لكم دينكم وجمع يوم أيام ; وأصله أيوام فأدغم ; وربما عبروا عن الشدة باليوم ، يقال : يوم أيوم ، كما يقال : ليلة ليلاء . قال الراجز :نعم أخو الهيجاء في اليوم اليميوهو مقلوب منه ، أخر الواو وقدم الميم ثم قلبت الواو ياء حيث صارت طرفا ; كما قالوا : أدل في جمع دلو .الدين : الجزاء على الأعمال والحساب بها ; كذلك قال ابن عباس وابن مسعود وابن جريج وقتادة وغيرهم ، وروي عن النبي صلى الله عليه وسلم ; ويدل عليه قوله تعالى : يومئذ يوفيهم الله دينهم الحق أي حسابهم . وقال : اليوم تجزى كل نفس بما كسبت و اليوم تجزون ما كنتم تعملون وقال : أئنا لمدينون أي مجزيون محاسبون . وقال لبيد :حصادك يوما ما زرعت وإنما يدان الفتى يوما كما هو دائنوقال آخر :إذا ما رمونا رميناهم     ودناهم مثل ما يقرضوناوقال آخر :واعلم يقينا أن ملكك زائل     واعلم بأن كما تدين تدانوحكى أهل اللغة : دنته بفعله دينا ( بفتح الدال ) ودينا ( بكسرها ) جزيته ; ومنه الديان في صفة الرب تعالى أي المجازي ; وفي الحديث : الكيس من دان نفسه أي حاسب . وقيل : القضاء . روي عن ابن عباس أيضا ; ومنه قول طرفة :لعمرك ما كانت حمولة معبد     على جدها حربا لدينك من مضرومعاني هذه الثلاثة متقاربة . والدين أيضا : الطاعة ومنه قول عمرو بن كلثوم :وأيام لنا غر طوال     عصينا الملك فيها أن ندينافعلى هذا هو لفظ مشترك وهي :قال ثعلب : دان الرجل إذا أطاع ، ودان إذا عصى ، ودان إذا عز ، ودان إذا ذل ، ودان إذا قهر ; فهو من الأضداد . ويطلق الدين على العادة والشأن ، كما قال :كدينك من أم الحويرث قبلهاوقال المثقب [ يذكر ناقته ] :تقول إذا درأت لها وضيني     أهذا دينه أبدا وديني[ ص: 142 ] والدين : سيرة الملك . قال زهير :لئن حللت بجو في بني أسد     في دين عمرو وحالت بيننا فدكأراد في موضع طاعة عمرو . والدين : الداء ; عن اللحياني . وأنشد :يا دين قلبك من سلمى وقد دينا\n","ar.miqbas":"إتباع الأوصاف الثلاثة المتقدمة بهذا ليس لمجرد سرد صفات من صفاته تعالى ، بل هو مما أثارته الأوصاف المتقدمة ، فإنه لما وصف تعالى بأنه رب العالمين الرحمن الرحيم وكان ذلك مفيداً لما قدمناه من التنبيه على كمال رفقه تعالى بالمربوبين في سائر أكوانهم ، ثم التنبيه بأن تصرفه تعالى في الأكوان والأطوار تصرف رحمة عند المعتبر ، وكان من جملة تلك التصرفات تصرفات الأمر والنهي المعبر عنها بالتشريع الراجع إلى حفظ مصالح الناس عامة وخاصة ، وكان معظم تلك التشريعات مشتملاً على إخراج المكلف عن داعية الهوى الذي يلائمه اتباعه وفي نزعه عنه إرغام له ومشقة ، خيف أن تكون تلك الأوصاف المتقدمة في فاتحة الكتاب مخففاً عن المكلفين عِبءَ العصيان لما أمروا به ومثيراً لأطماعهم في العفو عن استخفافهم بذلك وأن يمتلكهم الطمع فيعتمدوا على ما علموا من الربوبية والرحمة المؤكَّدة فلا يخشوا غائلة الإعراض عن التكاليف ، لذلك كان من مقتضى المقام تعقيبه بذكر أنه صاحب الحُكم في يوم الجزاء : { اليوم تجزى كل نفس بما كسبت } [ غافر : 17 ] لأن الجزاء على الفعل سبب في الامتثال والاجتناب لحفظ مصالح العالم ، وأحيط ذلك بالوعد والوعيد ، وجعل مِصداقُ ذلك الجزاء يوم القيامة ، ولذلك اختير هنا وصف ملك أو مالك مضافاً إلى يوم الدين . فأما ملك فهو مؤذن بإقامة العدل وعدم الهوادة فيه لأن شأن الملك أن يدبر صلاح الرعية ويذب عنهم ، ولذلك أقام الناس الملوك عليهم . ولو قيل رب يوم الدين لكان فيه مطمع للمفسدين يجدون من شأن الرب رحمة وصفحاً ، وأما مالك فمثل تلك في إشعاره بإقامة الجزاء على أوفق كيفياته بالأفعال المجزى عليها .فإن قلت فإذا كان إجراء الأوصاف السابقة مؤذناً بأن جميع تصرفات الله تعالى فينا رحمة فقد كفى ذلك في الحث على الامتثال والانتهاء إذ المرء لا يخالف ما هو رحمة به فلا جرم أن ينساق إلى الشريعة باختياره . قلت المخاطبون مراتب : منهم من لا يهتدي لفهم ذلك إلا بعد تعقيب تلك الأوصاف بهذا الوصف ، ومنهم من يهتدي لفهم ذلك ولكنه يظن أن في فعل الملائم له رحمة به أيضاً فربما آثر الرحمة الملائمة على الرحمة المنافرة وإن كانت مفيدة له ، وربما تأول الرحمة بأنها رحمة للعموم وأنه إنما يناله منها حظ ضعيف فآثر رحمة حظه الخاص به على رحمة حظه التابع للعامة . وربما تأول أن الرحمة في تكاليف الله تعالى أمر أغلبي لا مطرد وأن وصفه تعالى بالرحمن بالنسبة لغير التشريع من تكوين ورزققٍ وإحياءٍ ، وربما ظن أن الرحمة في المآل فآثر عاجل ما يلائمه . وربما علم جميع ما تشتمل عليه التكاليف من المصالح باطراد ولكنه ملكته شهوته وغلبت عليه شقوته .فكل هؤلاء مظنة للإعراض عن التكاليف الشرعية ، ولأمثالهم جاء تعقيب الصفات الماضية بهذه الصفة تذكيراً لهم بما سيحصل من الجزاء يوم الحساب لئلا يفسد المقصود من التشريع حين تتلقفه أفهام كل متأول مضيع . ثم إن في تعقيب قوله : { رب العالمين الرحمن الرحيم } بقوله : { ملك يوم الدين } إشارة إلى أنه ولي التصرف في الدنيا والآخرة فهو إذن تتميم .وقوله ( ملك ) قرأه الجمهور بدون ألف بعد الميم وقرأه عاصم والكسائي ويعقوب وخلف ( مالك ) بالألف فالأول صفة مشبهة صارت اسماً لصاحب المُلك ( بضم الميم ) والثاني اسم فاعل من ملك إذا اتصف بالمِلك ( بكسر الميم ) وكلاهما مشتق من مَلَك ، فأصل مادة ملك في اللغة ترجع تصاريفها إلى معنى الشد والضبط كما قاله ابن عطية ، ثم يتصرف ذلك بالحقيقة والمجاز ، والتحقيق والاعتبار ، وقراءة ( ملك ) بدون ألف تدل على تمثيل الهيئة في نفوس السامعين لأن المَلِك بفتح الميم وكسر اللام هو ذو المُلك بضم الميم والمُلك أخص من المِلك ، إذ المُلك بضم الميم هو التصرف في الموجودات والاستيلاء ويختص بتدبير أمور العقلاء وسياسة جمهورهم وأفرادهم وموَاطنهم فلذالك يقال : مَلِك الناس ولا يقال : مَلك الدواب أو الدراهم ، وأما المِلك بكسر الميم فهو الاختصاص بالأشياء ومنافعها دون غيره .وقرأ الجمهور ( ملك ) بفتح الميم وكسر اللام دون ألف ورويت هذه القراءة عن النبيء صلى الله عليه وسلم وصاحبيه أبي بكر وعمر في «كتاب الترمذي» . قال ابن عطية : حكى أبو على عن بعض القراء أن أول من قرأ ( مَلِك يوم الدين ) مروان بن الحكم فرده أبو بكر بن السراج بأن الأخبار الواردة تبطل ذلك فلعل قائل ذلك أراد أنه أول من قرأ بها في بلد مخصوص . وأما قراءة ( مالك ) بألف بعد الميم بوزن اسم الفاعل فهي قراءة عاصم والكسائي ويعقوب وخلف ، ورويت عن عثمان وعلي وابن مسعود وأبي بن كعب ومعاذ بن جبل وطلحة والزبير ، ورواها الترمذي في «كتابه» أنها قرأَ بها النبيء صلى الله عليه وسلم وصاحباه أيضاً . وكلتاهما صحيحة ثابتة كما هو شأن القراءات المتواترة كما تقدم في المقدمة السادسة . وقد تصدى المفسرون والمحتجون للقراءات لبيان ما في كل من قراءة ( ملك ) بدون ألف وقراءة ( مالك ) بالألف من خصوصيات بحسب قَصْر النظر على مفهوم كلمة ملك ومفهوم كلمة ( مالك ) ، وغفلوا عن إضافة الكلمة إلى يوم الدين ، فأما والكلمة مضافة إلى يوم الدين فقد استويا في إفادة أنه المتصرف في شؤون ذلك اليوم دون شبهة مشارك . ولا محيصَ عن اعتبار التوسع في إضافة ( ملك ) أو ( مالك ) إلى ( يوم ) بتأويل شؤون يوم الدين . على أن ( مالك ) لغة في ( ملك ) ففي «القاموس» : «وكأمير وكتف وصاحب ذُو الملك» .ويوم الدين يوم القيامة ، ومبدأ الدار الآخرة ، فالدين فيه بمعنى الجزاء ، قال الفِنْد الزماني :فلما صرَّحَ الشرُّ ... فأَمسى وهْوَ عُريانُولم يَبْقَ سوى العُدوا ... ننِ دِنَّاهم كما دَانُواأي جازيناهم على صنعهم كما صنعوا مشاكلة ، أو كما جازَوْا من قبل إذا كان اعتداؤهم ناشئاً عن ثأر أيضاً ، وهذا هو المعنى المتعين هنا وإن كان للدين إطلاقات كثيرة في كلام العرب .واعلم أن وصفه تعالى بملك يوم الدين تكملة لإجراء مجامع صفات العظمة والكمال على اسمه تعالى ، فإنه بعد أن وُصف بأنه رب العالمين وذلك معْنى الإلهية الحقة إذ يفوق ما كانوا ينعتون به آلهتهم من قولهم إله بني فلان فقد كانت الأُمم تتخذ آلهة خاصة لها كما حكى الله عن بعضهم : { فقالوا هذا إلهكم وإله موسى } [ طه : 88 ] وقال : { قالوا يا موسى اجعل لنا إلها كما لهم آلهة } [ الأعراف : 138 ] وكانت لبعض قبائل العرب آلهة خاصة ، فقد عبدت ثقيف اللات قال الشاعر :ووقرت ثقيف إلى لاتها ... وفي حديث عائشة في «الموطأ» : «كان الأنصار قبل أن يسلموا يهلون لمَنَاةَ الطاغية التي كانوا يعبدونها عند المُشَلَّل» الحديث .فوُصِفَ اللَّهُ تعالى بأنه رب العالمين كلهم ، ثم عقب بوَصفي الرحمن الرحيم لإفادة عظم رحمته ، ثم وصف بأنه مَلِك يوم الدين وهو وَصْف بما هو أعظم مما قبله لأنه ينبىء عن عموم التصرف في المخلوقات في يوم الجزاء الذي هو أول أيام الخلود ، فمَلِك ذلك الزمان هو صاحب المُلك الذي لا يشذ شيء عن الدخول تحت مُلكه ، وهو الذي لا ينتهي ملكه ولا ينقضي ، فأين هذا الوصف من أوصاففِ المبالغة التي يفيضها الناس على أعظم الملوك مثل مَلِك الملوك ( شَاهَانْ شَاهْ ) ومَلِك الزمان ومَلِك الدنيَا ( شاهْ جَهان ) وما شابه ذلك . مع ما في تعريف ذلك اليوم بإضافته إلى الدين أي الجزاء من إدماج التنبيه على عدم حكم الله لأن إيثار لفظ الدين ( أي الجزاء ) للإشعار بأنه معاملة العَامل بما يعادِل أَعماله المَجْزِيَّ عليها في الخير والشر ، وذلك العدلُ الخاص قال تعالى : { اليوم تجزى كل نفس بما كسبت لا ظلم اليوم } [ غافر : 17 ] فلذلك لم يقلْ ملك يوم الحساب فوَصفُه بأنه ملك يَوممِ العدل الصِّرف وصف له بأشرف معنى المُلك فإن الملوك تتخلد محَامدهم بمقدار تفاضلهم في إقامة العدل وقد عرف العرب المِدْحةَ بذلك . قال النابغة يمدح الملك عَمْرو بن الحارث الغساني ملك الشام :وكَم جزَانَا بأَيْدٍ غَيرِ ظالمة ... عُرْفاً بعُرف وإنكاراً بإنكارِوقال الحارث بن حلزة يمدح الملك عَمرو بن هند اللخمي ملك الحِيرة :مَلِك مُقْسِطٌ وأَفْضَلُ مَنْ يَمْ ... شِي ومن دون مَا لَدَيْه القَضَاءوإجراء هذه الأوصاف الجليلة على اسمه تعالى إيماء بأن موصوفها حقيق بالحمد الكامل الذي أعربت عنه جملة { الحمد لله } ، لأن تقييد مُفاد الكلام بأوصاف مُتَعَلَّق ذلك المفاد يُشعر بمناسبة بين تلك الأوصاف وبين مُفاد الكلام مُناسبة تفهم من المقام مثل التعليل في مقام هذه الآية .\n","ar.waseet":"بعد أن بين - سبحانه - لعباده موجبات حمده، وأنه الجدير وحده بالحمد، لأنه المربى الرحيم، والمنعم الكريم، أتبع ذلك ببيان أنه - سبحانه - { مَـٰلِكِ يَوْمِ ٱلدِّينِ }.والمالك وصف من الملك - بكسر الميم - بمعنى حيازة الشئ مع القدرة على التصرف فيه. واليوم فى العرف: ما يكون من طلوع الشمس إلى غروبها، وليس هذا مراداً هنا، وإنما المراد مطلق الزمن وهو يوم القيامة.والدين: الجزاء والحساب، يقال: دنته بما صنع، أى: جازيته على صنيعه، ومنه قولهم. كما تدين تدان. أى: كما تفعل تجازى، وفى الحديث \" الكيس من دان نفسه وعمل لما بعد الموت \" أى: حاسب نفسه: والمعنى: أنه - تعالى - يتصرف فى أمور يوم الدين من حساب وثواب وعقاب، تصرف المالك فيما يملك، كما قال - تعالى -{ يَوْمَ لاَ تَمْلِكُ نَفْسٌ لِنَفْسٍ شَيْئاً وَٱلأَمْرُ يَوْمَئِذٍ لِلَّهِ }وهناك قراءة أخرى للآية وهى { مَـٰلِكِ يَوْمِ ٱلدِّينِ } من الملك - بضم الميم - وعليها يكون المعنى: أنه - تعالى - هو المدبر لأمور يوم الدين، وأن له على ذلك اليوم هيمنة الملوك وسيطرتهم، فكل شئ فى ذلك اليوم يجرى بأمره، وكل تصرف فيه ينفذ باسمه، كما قال - تعالى -{ لِّمَنِ ٱلْمُلْكُ ٱلْيَوْمَ لِلَّهِ ٱلْوَاحِدِ ٱلْقَهَّارِ }قال الإِمام ابن كثير: \" وتخصيص الملك بيوم الدين لا ينفيه عما عداه، لأنه قد تقدم الإِخبار بأنه رب العالمين، وذلك عام فى الدنيا والآخرة. وإنما أضيف إلى يوم الدين، لأنه لا يدعى أحد هنالك شيئاً، ولا يتكلم أحد إلا بإذنه، كما قال - تعالى -{ يَوْمَ يَقُومُ ٱلرُّوحُ وَٱلْمَلاَئِكَةُ صَفّاً لاَّ يَتَكَلَّمُونَ إِلاَّ مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ وَقَالَ صَوَاباً }والملك فى الحقيقة هو الله، قال - تعالى -{ هُوَ ٱللَّهُ ٱلَّذِي لاَ إِلَـٰهَ إِلاَّ هُوَ ٱلْمَلِكُ ٱلْقُدُّوسُ ٱلسَّلاَمُ }وفى الصحيحين عن أبى هريرة، عن رسول الله - صلى الله عليه وسلم - أنه قال: \" يقبض الله الأرض، ويطوى السماء بيمينه ثم يقول: أنا الملك أين ملوك الأرض؟ أين الجبارون، أين المتكبرون \" ثم قال: وأما تسمية غيره فى الدنيا بملك فعلى سبيل المجاز كما قال - تعالى -{ إِنَّ ٱللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكاً }وفى هذه الأوصاف التى أجريت على الله تعالى، من كونه ربا للعالمين وملكا للأمر كله يوم الجزاء، بعد الدلالة على اختصاص الحمد به فى قوله: { ٱلْحَمْدُ للَّهِ } فى كل ذلك دليل على أن من كانت هذه صفاته لم يكن أحد أحق منه للحمد والثناء عليه، بل لا يستحق ذلك على الحقيقة سواه، فإن ترتب الحكم على الوصف مشعر بعليته له \".والمتدبر لهذه الآية الكريمة يراها خير وسيلة لتربية الإِنسان وغرس الإِيمان العميق فى قلبه، لأنه إذا آمن بأن هناك يوما يظهر فيه إحسان المحسن وإساءة المسئ، وأن زمام الحكم فى ذلك اليوم لله الواحد القهار، فإنه فى هذه الحالة سيقوى عنده خلق المراقبة لخالقه، ويجتهد فى السير على الطريق المستقيم.\n","ar.baghawi":"قوله: {مالك يوم الدين}قرأ عاصم و الكسائي و يعقوب: \"مالك \"، وقرأ الآخرون: \" ملك \"؛ قال قوم: معناهما واحد مثل فرهين وفارهين، وحذرين وحاذرين، ومعناهما: الرب يقال رب الدار ومالكها.وقيل المالك والملك: هو القادر على اختراع الأعيان من العدم إلى الوجود ولا يقدرعليه أحد غير الله.قال أبو عبيدة: \"مالك أجمع وأوسع لأنه يقال مالك العبد والطير والدواب ولا يقال ملك هذه الأشياء. لأنه لا يكون مالكاً لشيء إلا وهو يملكه، وقد يكون ملك الشيء ولا يملكه\".وقال قوم: ملك أولى لأن كل ملك مالك وليس كل مالك ملكاً ولأنه أوفق لسائر القرآن؛ مثل: قوله تعالى: {فتعالى الله الملك الحق} [114 - طه]، {الملك القدوس} [23 - الحشر]، {ملك الناس}[الناس].قال مجاهد: \"الدين: الحساب\"، قال الله تعالى: {ذلك الدين القيم} [36 - التوبة] أي الحساب المستقيموقال ابن عباس ومقاتل والسدي: \"ملك يوم الدين: قاضي يوم الحساب\"وقال قتادة : \"الدين: الجزاء\".ويقع على الجزاء في الخير والشر جميعاً، يقال: كما تدين تدان.قال محمد بن كعب القرظي: \"ملك يوم لا ينفع فيه إلا الدين\"وقال يمان بن رباب: \"الدين القهر، يقال دنته فدان أي قهرته فذل\".وقيل: الدين الطاعة أي يوم الطاعة.وإنما خص يوم الدين بالذكر مع كونه مالكاً للأيام كلها لأن الأملاك يومئذ زائلة فلا ملك ولا أمر إلا له، قال الله تعالى: {الملك يومئذ الحق للرحمن} [26 - الفرقان]، وقال: {لمن الملك اليوم لله الواحد القهار} [16 - غافر]، وقال: {والأمر يومئذ لله} [19 - الانفطار]وقرأ أبو عمرو: (( الرحيم ملك )) بإدغام الميم في الميم وكذلك يدغم كل حرفين من جنس واحد أو مخرج واحد أو قريبي المخرج سواء كان الحرف ساكناً أو متحركاً إلا أن يكون الحرف الأول مشدداً أو مُنَوَّناً أو منقوصاً أو مفتوحاً أو تاء الخطاب قبله ساكن من غير المثلين فإنه لا يدغمهما، وإدغام المتحرك يكون في الإدغام الكبير وافقه حمزة في إدغام المتحرك في قوله: {بَيَّتَ طائفة} [81-النساء]، {والصافات صفا * فالزاجرات زجرا * فالتاليات ذكرا} [1-3: الصافات]، {والذاريات ذرواً} [1- الذاريات] أدغم التاء فيما بعدها من الحروف، وافقه الكسائي وحمزة في إدغام الصغير، وهو إدغام الساكن في المتحرك إلا في الراء عند اللام والدال عند الجيم وكذلك لا يدغم حمزة - وبرواية خلاد وخلف - الدال عند السين والصاد والزاي، ولا إدغام لسائر القراء إلا في أحرف معدودة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/4.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/4.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/4.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ","transliteration":"Iyyaaka na'budu wa lyyaaka nasta'een","translations":{"en.ahmedali":"You alone we worship, and to You alone turn for help.","en.ahmedraza":"You alone we worship and from You alone we seek help (and may we always).","en.arberry":"Thee only we serve; to Thee alone we pray for succour.","en.asad":"Thee alone do we worship; and unto Thee alone do we turn for aid.","en.daryabadi":"Thee alone do we worship and of Thee alone do we seek help,","en.hilali":"You (Alone) we worship, and you (Alone) we ask for help (for each and everything).","en.pickthall":"Thee (alone) we worship; Thee (alone) we ask for help.","en.qaribullah":"You (alone) we worship; and You (alone) we rely for help.","en.sahih":"It is You we worship and You we ask for help.","en.sarwar":"(Lord), You alone We do worship and from You alone we do seek assistance","en.yusufali":"Thee do we worship, and Thine aid we seek.","en.maududi":"You alone do we worship, and You alone do we turn for help","en.shakir":"Thee do we serve and Thee do we beseech for help.","en.itani":"It is You we worship, and upon You we call for help.","en.mubarakpuri":"You we worship, and You we ask for help.","en.qarai":"You [alone] do we worship, and to You [alone] do we turn for help.","en.wahiduddin":"You alone we worship, and to You alone we turn for help."},"tafsir":{"ar.muyassar":"إنا نخصك وحدك بالعبادة، ونستعين بك وحدك في جميع أمورنا، فالأمر كله بيدك، لا يملك منه أحد مثقال ذرة. وفي هذه الآية دليل على أن العبد لا يجوز له أن يصرف شيئًا من أنواع العبادة كالدعاء والاستغاثة والذبح والطواف إلا لله وحده، وفيها شفاء القلوب من داء التعلق بغير الله، ومن أمراض الرياء والعجب، والكبرياء.","ar.jalalayn":"«إيَّاك نعبد وإياك نستعين» أي نخصك بالعبادة من توحيد وغيره ونطلب المعونة على العبادة وغيرها.","ar.qurtubi":"قوله تعالى : إياك نعبد رجع من الغيبة إلى الخطاب على التلوين ; لأن من أول السورة إلى هاهنا خبرا عن الله تعالى وثناء عليه ، كقوله وسقاهم ربهم شرابا طهورا . ثم قال : إن هذا كان لكم جزاء . وعكسه : حتى إذا كنتم في الفلك وجرين بهم على ما يأتي .و ( نعبد ) معناه نطيع ; والعبادة الطاعة والتذلل . وطريق معبد إذا كان مذللا للسالكين ; قاله الهروي . ونطق المكلف به إقرار بالربوبية وتحقيق لعبادة الله تعالى ; إذ سائر الناس يعبدون سواه من أصنام وغير ذلك . وإياك نستعين أي نطلب العون والتأييد والتوفيق .قال السلمي في حقائقه : سمعت محمد بن عبد الله بن شاذان يقول : سمعت أبا حفص الفرغاني يقول : من أقر ب إياك نعبد وإياك نستعين فقد برئ من الجبر والقدر .إن قيل : لم قدم المفعول على الفعل ؟ قيل له : قدم اهتماما ، وشأن العرب تقديم الأهم . يذكر أن أعرابيا سب آخر فأعرض المسبوب عنه ; فقال له الساب : إياك أعني : فقال له الآخر : وعنك أعرض ; فقدما الأهم . وأيضا لئلا يتقدم ذكر العبد والعبادة على المعبود ; فلا يجوز نعبدك ونستعينك ، ولا نعبد إياك ونستعين إياك ; فيقدم الفعل على كناية المفعول ، وإنما يتبع لفظ القرآن . وقال العجاج :إياك أدعو فتقبل ملقي واغفر خطاياي وكثر ورقيويروى : وثمر . وأما قول الشاعر :إليك حتى بلغت إياكافشاذ لا يقاس عليه . والورق بكسر الراء من الدراهم ، وبفتحها المال . وكرر الاسم لئلا يتوهم إياك نعبد ونستعين غيرك .الجمهور من القراء والعلماء على شد الياء من إياك في الموضعين . وقرأ عمرو بن قائد : ( إياك ) بكسر الهمزة وتخفيف الياء ، وذلك أنه كره تضعيف الياء لثقلها وكون الكسرة قبلها . وهذه قراءة مرغوب عنها ، فإن المعنى يصير : شمسك نعبد أو ضوءك ; وإياة الشمس ( بكسر الهمزة ) : ضوءها ; وقد تفتح . وقال [ طرفة بن العبد ] :سقته إياة الشمس إلا لثاته أسف فلم تكدم عليه بإثمدفإن أسقطت الهاء مددت . ويقال : الإياة للشمس كالهالة للقمر ، وهي الدارة حولها . وقرأ الفضل الرقاشي : \" أياك \" ( بفتح الهمزة ) وهي لغة مشهورة . وقرأ أبو السوار الغنوي : \" هياك \" في الموضعين ، وهي لغة ; قال :فهياك والأمر الذي إن توسعت     موارده ضاقت عليك مصادرهوإياك نستعين عطف جملة على جملة . وقرأ يحيى بن وثاب والأعمش : ( نستعين ) بكسر النون ، وهي لغة تميم وأسد وقيس وربيعة ; ليدل على أنه من استعان ، فكسرت النون كما تكسر ألف الوصل . وأصل \" نستعين \" نستعون ، قلبت حركة الواو إلى العين فصارت ياء والمصدر استعانة ، والأصل استعوان ; قلبت حركة الواو إلى العين فانقلبت ألفا ولا يلتقي ساكنان فحذفت الألف الثانية لأنها زائدة ، وقيل الأولى لأن الثانية للمعنى ، ولزمت الهاء عوضا .\n","ar.miqbas":"إذا أتم الحامِدُ حَمْد ربه يأخذ في التوجه إليه بإظهار الإخلاص له انتقالاً من الإفصاح عن حق الرب إلى إظهار مراعة ما يقتضيه حقه تعالى على عبده من إفراده بالعبادة والاستعانة . فهذا الكلام استئناف ابتدائي .ومُفَاتَحَة العظماء بالتمجيد عند التوجه إليهم قَبْلَ أن يخاطَبوا طريقة عربية . روى أبو الفرج الأصفهاني عن حسان بن ثابت قال : كنتُ عند النعمان فَنادَمْتُه وأَكَلْتُ معه فبينَا أنا على ذلك معه في قُبَّة إذَا رجلٌ يَرْتجز حولَها :أَصمَّ أمْ يَسمع ربُّ القبه ... يا أَوْهَبَ النَّاسسِ لِعيسسٍ صُلْبَهضَرَّابَةٍ بالمِشْغَرِ الأَذِيَّهْ ... ذَاتتِ هِباببٍ في يَدَيْها خُلْبَهْفي لاَحب كأنَّه الأَطِبَّهْ ... فقال النعمان : أليس بأبي أُمَامَة؟ ( كنية النابغة ) قالوا : بلى ، قال : فأْذَنوا له فدخل .والانتقال من أسلوب الحديث بطريق الغائب المبتدإِ من قوله : { الحمد لله } إلى قوله : { ملك يوم الدين } ، إلى أسلوب طريق الخطاب ابتداءً من قوله { إياك نعبد } إلى آخر السورة ، فن بديع من فنون نظم الكلام البليغ عند العرب ، وهو المسمى في علم الأدب العربي والبلاغة التفاتاً . وفي ضابط أسلوب الالتفات رأيان لأئمة علم البلاغة : أحدهما رأي مَن عدا السكاكي من أئمة البلاغة وهو أن المتكلم بعد أن يعبِّر عن ذات بأحد طرق ثلاثة من تكلم أو غيبة أو خطاب ينتقل في كلامه ذلك فيعبر عن تلك الذات بطريق آخر من تلك الثلاثة ، وخالفهم السكاكي فجعل مسمى الالتفات أن يعبِّر عن ذات بطريق من طرق التكلم أو الخطاب أو الغيبة عادلاً عن أحدهما الذي هو الحقيق بالتعبير في ذلك الكلام إلى طريق آخر منها .ويظهر أثر الخلاف بين الجمهور والسكاكي في المحسِّن الذي يسمى بالتجريد في علم البديع مثل قول علقمة بن عبده في طالع قصيدته :طَحَا بكَ قلبٌ في الحسان طروب ... مخاطباً نفسه على طريقة التجريد ، فهذا ليس بالتفات عند الجمهور وهو معدود من الالتفات عند السكاكي ، فتسمية الالتفات التفاتاً على رأي الجمهور باعتبار أن عدول المتكلم عن الطريق الذي سلكه إلى طريق آخر يشبه حالة الناظر إلى شيء ثم يلتفت عنه ، وأما تسميته التفاتاً على رأي السكاكي فتجري على اعتبار الغالب من صور الالتفات دون صورة التجريد ، ولعل السكاكي التزم هذه التسمية لأنها تقررت من قبله فتابع هو الجمهور في هذا الاسم . ومما يجب التنبه له أن الاسم الظاهر معتبر من قبيل الغائب على كلا الرأيين ، ولذلك كان قوله تعالى : { إياك نعبد } التفاتاً على كلا الرأيين لأن ما سبق من أول السورة إلى قوله { إياك نعبد } تعْبير بالاسم الظاهر وهو اسم الجلالة وصفاته .ولأهل البلاغة عناية بالالتفات لأن فيه تجديدَ أسلوب التعْبير عن المعنى بعينه تحاشياً من تكرر الأسلوب الواحد عدة مرار فيحصل بتجديد الأسلوب تجديد نشاط السامع كي لا يمل من إعادة أسلوب بعينه .قال السكاكي في «المفتاح» بعد أن ذكر أن العرب يستكثرون من الالتفات : «أَفتراهم يحسنون قِرى الأشباح فيخالفون بين لون ولون وطَعْم وطَعْم ولا يحسنون قِرى الأرواح فيخالفون بين أسلوب وأسلوب» . فهذه فائدة مطردة في الالتفات . ثم إن البلغاء لا يقتصرون عليها غالباً بل يراعون للالتفات لطائف ومناسبات ولم يزل أهل النقد والأدب يستخرجون ذلك من مغاصه .وما هنا التفاتٌ بديع فإن الحامد لما حمد الله تعالى ووصفه بعظيم الصفات بلغت به الفكرة منتهاهَا فتخيل نفسه في حضرة الربوبية فخاطب ربه بالإقبال ، كعكس هذا الالتفاتتِ في قول محمد بن بشير الخارجي ( نسبَة إلى بني خارجة قبيلة ) :ذُممتَ ولم تُحمد وأدركتُ حاجةً ... تولَّى سواكم أَجرَها واصطناعهاأَبى لك كَسْبَ الحمدِ رأيٌ مقصِّرُ ... ونفسٌ أضاق اللَّهُ بالخير باعهاإذا هي حثتْه على الخير مرة ... عصاها وإنْ هَمَّت بشرَ أطاعهافخاطبه ابتداء ثم ذكر قصور رأيه وعدم انطباع نفسه على الخير فالتفت من خطابه إلى التعبير عنه بضمير الغيبة فقال : إذا هي حثته فكأنه تخيله قد تضاءل حتى غاب عنه ، وبعكس ذلك قوله تعالى : { والذين كفروا بآيات الله ولقائه أولئك يئسوا من رحمتي } [ العنكبوت : 23 ] لاعتبار تشنيع كفر المتحدَّث عنهم بأنهم كفروا بآيات صاحب ذلك الاسم الجليل ، وبعد تقرر ذلك انتقل إلى أسلوب ضمير المتكلم إذ هو الأصل في التعبير عن الأشياء المضافة إلى ذات المتكلم . ومما يزيد الالتفات وقعاً في الآية أنه تخلص من الثناء إلى الدعاء ولا شك أن الدعاء يقتضي الخطاب فكان قوله : { إياك نعبد } تخلصاً يجىء بعده : { اهدنا الصراط } ونظيره في ذلك قول النابغة في رثاء النعمان الغساني :أبى غفلتي أَني إذا ما ذكرته ... تحرك داء في فُؤَادِيَ داخلوأن تِلاَدِي إنْ نظرتُ وشكَّتِي ... ومُهري وما ضَمَّت إليَّ الأناملحِباؤُك والعيسُ العتاقُ كأنها ... هِجان المَهى تُزْجى عليها الرحائلوأبو الفتح ابن جني يسمى الالتفات «شَجاعة العربية» كأنه عنى أنه دليل على حدة ذهن البليغ وتمكنه من تصريف أساليب كلامه كيف شاء كما يتصرف الشجاع في مجال الوغي بالكر والفر .و ( إياك ) ضمير خطاب في حالة النصب . والأظهر أن كلمة إيا جعلت ليَعْتَمِد عليها الضمير عند انفصاله ولذلك لزمتها الضمائر نحو : إياي تعني ، وإيَّاك أعني ، وإيَّاهم أرجو . ومن هنالك التزم في التحذير لأن الضمير انفصل عند التزام حذف العامل . ومن النحاة من جعل ( إيَّا ) ضميراً منفصلاً ملازماً حالة واحدة وجعل الضمائر التي معه أضيفت إليه للتأكيد . ومنهم من جعل ( إيَّا ) هو الضمير وجعل ما بعده حروفاً لبيان الضمير . ومنهم من جعل ( إيَّا ) اعتماداً للضمير كما كانت أيٌّ اعتماداً للمنادى الذي فيه ال . ومنهم من جعل ( إيَّا ) اسماً ظاهراً مضافاً للمضمَرات .والعبادة فعل يدل على الخضوع أو التعظيم الزائدين على المتعارف بين الناس . وأما إطلاقها على الطاعة فهو مجاز .والعبادة في الشرع أخص فتُعرَّف بأنها فعل ما يرضي الرب من خضوع وامتثال واجتناب ، أو هي فعل المكلف على خلاف هوى نفسه تعظيماً لربه ، وقال الرازي في تفسير قوله تعالى : { وما خلقت الجن والإنس إلا ليعبدون } [ الذاريات : 56 ] ( ( العبادة تعظيم أمر الله والشفقة على الخلق ، وهذا المعنى هو الذي اتفقت عليه الشرائع وإن اختلفوا في الوضع والهيئة والقلة والكثرة ) ) ا ه فهي بهذا التفسير تشمل الامتثال لأحكام الشريعة كلها .وقد فسر الصوفية العبادة بأنها فعل ما يرضي الرب ، والعبودية بالرضا بما يفعل الرب . فهي أقوى . وقال بعضهم : العبودية الوفاء بالعهود ، وحفظ الحدود ، والرضا بالموجود . والصبر على المفقود . وهذه اصطلاحات لا مشاحة فيها .قال الفخر : ( ( مراتب العبادة ثلاث : الأولى أن يعبد الله طمعاً في الثواب وخوفاً من العقاب وهي العبادة ، وهي درجة نازلة ساقطة لأنه جعل الحق وسيلة لنيل المطلوب . الثانية أن يعبد الله لأجل أن يتشرف بعبادته والانتساب إليه بقبول تكاليفه وهي أعلى من الأولى إلا أنها ليست كاملة لأن المقصود بالذات غير الله . الثالثة أن يعبد الله لكونه إلها خالقاً مستحقاً للعبادة وكونه هو عبداً له ، وهذه أعلى المقامات وهو المسمى بالعبودية ) ) ا ه .قلت ولم يسم الإمام المرتبة الثالثة باسم والظاهر أنها ملحقة في الاسم بالمرتبة الثالثة أعني العبودية لأن الشيخ ابن سينا قال في «الإشارات» : ( ( العارف يريد الحق لا لشيء غيره ولا يُؤْثِر شيئاً على عرفانه وتعبُّدُه له فقط ولأنه مستحق للعبادة ولأنها نسبة شريفة إليه لا لرغبة أو رهبة ) ) ا ه فجعلهما حالة واحدة .وما ادعاه الفخر في سقوط الدرجة الأولى ونزول مرتبتها قد غلب عليه فيه اصطلاح غلاة الصوفية وإلا فإن العبادة للطمع والخوف هي التي دعا إليها الإسلام في سائر إرشاده ، وهي التي عليها جمهور المؤمنين وهي غاية التكليف ، كيف وقد قال تعالى : { إنما يخشى الله من عباده العلماء } [ فاطر : 28 ] فإن بلغ المكلف إلى المرتبتين الأخريين فذلك فضل عظيم وقليل ما هم ، على أنه لا يخلو من ملاحظة الخوف والطمع في أحوال كثيرة ، نعم إن أفاضل الأمة متفاوتون في الاحتياج إلى التخويف والإطماع بمقدار تفاوتهم في العلم بأسرار التكليف ومصالحه وتفاوتهم في التمكن من مغالبة نفوسهم ، ومع ذلك لا محيص لهم عن الرجوع إلى الخوف في أحوال كثيرة والطمع في أحوال أكثر . وأعظم دليل على ما قلنا أن الله تعالى مدح في كتابه المتقين في مواضع جمة ودعا إلى التقوى ، وهل التقوى إلا كاسمهما بمعنى الخوف والاتقاء من غضب الله قال تعالى : { ويرجون رحمته ويخافون عذابه إن عذاب ربك كان محذورا } [ الإسراء : 57 ] . والمرتبة الثالثة هي التي أشار لها قوله صلى الله عليه وسلم لمن قال له كيف تُجهد نفسك في العبادة وقد غَفَر لك الله ما تقدم من ذنبك وما تأخر فقال :\" أفلا أكون عبداً شكوراً \" لأن من الظاهر أن الشكر هنا على نعمة قد حصلت فليس فيه حظ للنفس بالطمع في المزيد لأن الغفران العام قد حصل له فصار الشكر لأجل المشكور لا غير وتمحض أنه لا لخوف ولا طمع .واعلم أن من أهم المباحث البحثَ عن سر العبادة وتأثيرها وسر مشروعيتها لنا وذلك أن الله تعالى خلق هذا العالم ليكون مظهراً لكمال صفاته تعالى : الوجود ، والعلم ، والقدرة . وجعل قبول الإنسان للكمالات التي بمقياسها يَعلم نسبة مبلغ علمه وقدرته من علم الله تعالى وقدرته ، وأودع فيه الروح والعقل اللذين بهما يزداد التدرج في الكمال ليكون غير قانع بما بلغه من المراتب في أوج الكمال والمعرفة ، وأرشده وهداه إلى ما يستعين به على مرامه ليحصل له بالارتقاء العاجل رُقيّ آجل لا يضمحل ، وجعل استعداده لقبول الخيرات كلها عاجلها وآجلها متوقفاً على التلقين من السَّفَرَة الموحَى إليهم بأصول الفضائل . ولما توقف ذلك على مراقبة النفس في نَفَرَاتها وشَرَدَاتها وكانت تلك المراقبة تحتاج إلى تذكر المُجازي بالخير وضده ، شُرعت العبادة لِتَذَكُّرِ ذلك المُجازي لأن عدم حضور ذاته واحتجابَه بسُبحات الجلال يُسَرِّب نسيانَه إلى النفوس ، كما أنه جعل نظامه في هذا العالم متصلَ الارتباط بين أفراده فأمرهم بلزوم آداب المعاشرة والمعاملة لئلا يفسُد النظام ، ولمراقبة الدوام على ذلك أيضاً شُرعت العبادة لتذكِّرَ به ، على أن في ذلك التذكر دوامَ الفكر في الخالق وشؤونه وفي ذلك تخلق بالكمالات تدريجاً فظهر أن العبادة هي طريق الكمال الذاتي والاجتماعي مَبدأً ونهايةً ، وبه يتضح معنى قوله تعالى : { وما خلقت الجن والإنس إلا ليعبدون } [ الذاريات : 56 ] فالعبادة على الجملة لا تخرج عن كونها محقِّقة للمقصد من الخلق ، ولما كان سرُّ الخلق والغايةُ منه خفيةَ الإدراككِ عَرَّفنا الله تعالى إياها بمظهرها وما يحققها جمعاً لعظيم المعاني في جملة واحدة وهي جملة : { إلا ليعبدون } ، وقريب من هذا التقرير الذي نحوناه وأقل منه قول الشيخ ابن سينا في «الإشارات» : ( ( لما لم يكن الإنسان بحيث يستقل وحده بأمر نفسه إلا بمشاركة آخر من بني جنسه وبمعاوضة ومعارضة تجريان بينهما يُفرغ كل واحد منهما لصاحبه عن مهم لو تولاه بنفسه لازدحم على الواحد كثير وكانَ مما يتعسر إنْ أمكن ، وجب أن يكون بين الناس معاملة وعدل يحفَظه شرعٌ يَفرِضه شارع متميزٌ باستحقاق الطاعة ووجب أن يكون للمحسن والمسيء جزاء من عند القدير الخبير ، فوجب معرفة المُجازي والشارع وأن يكون مع المعرفة سبب حافظ للمعرفة ففُرِضت عليهم العبادة المذكِّرة للمعبود ، وكررت عليهم ليُسْتَحْفَظ التذكيرُ بالتكرير ) ) ا ه .لا شك أن داعي العبادة التعظيم والإجلال وهو إما عن محبة أو عن خوف مجرد ، وأهمه ما كان عن محبة لأنه يرضي نفس فاعله قال :أهابككِ إجلالاً وما بككِ قدرةٌ ... عليّ ولكن ملء عين حبيبهاوهي تستلزم الخوف من غضب المحبوب قال محمود الوراق أو منصور الفقيه :تَعصي الإله وأنتَ تُظهر حبَّه ... هذا لعمري في القياس بديعلو كان حبك صادقاً لأَطَعْتَه ... إن المحبَّ لمن يُحِب مطيعولذلك قال تعالى : { قل إن كنتم تحبون الله فاتبعوني يحببكم الله } [ آل عمران : 31 ] فذلك يشعر بأن اتباع الشريعة يوجب محبة الله وأن المحب يود أن يحبه حبيبه كما قال المتنبي :أنت الحبيب ولكني أعوذ به ... من أن أكون مُحباً غير محبوبوإلى هذا النوع ترجع عبادة أكثر الأمم ، ومنها العبادة المشروعة في جميع الشرائع لأنها مبنية على حب الله تعالى ، وكذلك عبادة المشركين أصنامهم قال تعالى : { ومن الناس من يتخذ من دون الله أنداداً يحبونهم كحب الله } [ البقرة : 165 ] . ومن الأمم من عبدت عن خوف دون محبة وإنما هو لاتقاء شر كما عبدت بعض الأمم الشياطين وعبدت المانوية من المجوس المعبود ( أهْرُمُنْ ) وهو عندهم رب الشر والضر ويرمزون إليه بعنصر الظُلمة وأنه تولد من خاطر سوء خطر للرب ( يَزْدَان ) إله الخير ، قال المعري :فَكَّرَ يَزْدَانُ على غِرة ... فَصِيغَ من تفكيره أَهْرُمُنْوالحصر المستفاد من تقديم المعمول في قوله تعالى : { إياك نعبد } حصر حقيقي لأن المؤمنين الملقَّنين لهذا الحمد لا يعبدون إلا الله . وزعم ابن الحاجب في «إيضاح المفصل» في شرح ديباجة «المفصل» عند قول الزمخشري «اللهاَ أحمد» أن التقديم لا يفيد إلا الاهتمام دون حصر وأن قوله تعالى : { إياك نعبد } تقديم المفعول للاهتمام دون قصر وأن تمسكهم بقوله : { بل الله فاعْبُد } [ الزمر : 66 ] ضعيف لورود : { فاعبد الله مخلصا له الدين } [ الزمر : 2 ] وإبطال رأيه مقرر في كتب علم المعاني .وأنا أرى استدلاله بورود قوله تعالى : { فاعبد الله } لا يليق بمقامه العلمي إذ لا يظن أن محامل الكلام متماثلة في كل مقام ، { وإياك نستعين } جملة معطوفة على جملة { إياك نعبد } وإنما لم تفصل عن جملة { إياك نعبد } بطريقة تعداد الجمل مقام التضرع ونحوه من مقامات التعداد والتكرير كلاً أو بعضاً للإشارة إلى خطور الفعلين جميعاً في إرادة المتكلمين بهذا التخصيص ، أي نخصك بالاستعانة أيضاً مع تخصيصك بالعبادة .والاستعانةُ طلب العون . والعون والإعانة تسهيل فعللِ شيء يشُق ويعسُر على المستعين وحدَه ، فهي تحصل بإعداد طريق تحصيله من إعارة آلة ، أو مشاركة بعمل البدن كالحمل والقَوْد ، أو بقول كالإرشاد والتعليم ، أو برأي كالنصيحة . قال الحريري في المقامة : «وخُلُقي نعم العون» ، أو بمال كدفع المغرم ، بحيث يحصل الأمر بعسير من جهود المستعين والمعين .وأما الاستعانة بالله فهي طلب المعونة على ما لا قِبل للبشر بالإعانة عليه ولا قبل للمستعين بتحصيله بمفرده ، ولذلك فهي مشعرة بأن المستعين يصرف مقدرته لتحصيل الفعل ويطلب من الله العون عليه بتيسير ما لا قِبل لقدرة المستعين على تحصيله بمفرده ، فهذه هي المعونة شرعاً .وقد فسرها العلماء بأنها هي خَلْق ما به تمامُ الفعل أو تيسيرُه ، فتنقسم قسمين ضرورية أي ما يتوقف الفعل عليها فلا يحصل بدونها أي لا يحصل بدون توفر متعلقها وهي إعطاء الاقتدار للفاعل وتصوره للفعل وحصول المادة والآلة ، ومجموع هاته الأربعة يعبر عنه بالاستطاعة ، ويعبر عنها بسلامة الأسباب والآلات وبها يصح تكليف المستطيع .القسم الثاني المعونة غير الضرورية وينبغي أن تخص باسم الإعانة وهي إيجاد المُعين ما يتيسر به الفعل للمُعان حتى يسهل عليه ويقرب منه كإعداد الراحلة في السفر للقادر على المشي . وبانضمام هذا المعنى للمعنى الأول تتم حقيقة التوفيق المعرف عندهم بأنه خلق القدرة والداعية إلى الطاعة ، وسمى الراغب هذا القسم الثاني بالتوفيق ولا تعارض بين كلامه وبين تعريفهم إياه لما علمت من أنه لا يحصل إلا بعد حصول المعونة بالمعنى الأول فتم التوفيق؛ والمقصود هنا الاستعانة على الأفعال المهمة كلها التي أعلاها تلقي الدين وكلِّ ما يعسر على المرء تذليله من توجهات النفوس إلى الخير وما يستتبع ذلك من تحصيل الفضائل . وقرينة هذا المقصود رسمه في فاتحة الكتاب ووقوعُ تخصيص الإعانة عقب التخصيص بالعبادة . ولذلك حذف متعلِّق { نستعين } الذي حقه أن يذكر مجروراً بعلى ، وقد أفاد هذا الحذفُ الهامُّ عموم الاستعانة المقصورة على الطلب من الله تأدباً معه تعالى ، ومن توابع ذلك وأسبابه وهي المعارف والإرشادات والشرائع وأصول العلوم فكلها من الإعانة المطلوبة وكلها من الله تعالى فهو الذي ألهمنا مبادىء العلوم وكلفنا الشرائع ولقننا النطق ، قال : { ألم نجعل له عينين ولساناً وشفتين وهديناه النجدين } [ البلد : 8 10 ] فالأول إيماء إلى طريق المعارف وأصلُها المحسوسات وأعلاها المبصرات ، والثاني إيماء إلى النطق والبيان للتعليم ، والثالث إلى الشرائع .والحصر المستفاد من التقديم في قوله : { وإياك نستعين } حصر ادعائي للمبالغة لعدم الاعتداد بالاستعانات المتعارفة بين الناس بعضهم ببعض في شؤونهم ، ومعنى الحصر هنا لا نستعين على عظائم الأمور التي لا يستعان فيها بالناس إلا بالله تعالى . ويفيد هذا القصر فيهما التعريض بالمشركين الذين يعبدون غير الله ويستعينون بغيره لأنهم كانوا فريقين منهم من عبد غير الله على قصد التشريك إلا أَن وَلَعه واستهتاره بغير الله تعالى أنساه عبادة الله تعالى كما عبدت سَبأ الشمسَ وعبد الفُرس النورَ والظلمة ، وعبدَ القِبط العِجل وألَّهوا الفراعنة ، وعبدت أمم السودان الحيوانات كالثعابين . ومن المشركين من أشرك مع عبادة الله عبادة غيره وهذا حال معظم العرب ممن عبد الأصنام أو عبد الكواكب ، فقد عبدت ضبة وتَيْم وعُكْل الشمسَ ، وعبدت كنانةُ القمَر ، وعبدت لخم وخزاعةُ وبعض قريش الشِّعْرى ، وعبدت تميم الدبَران ، وعبدت طيىء الثُريا ، وهؤلاء كلهم جعلوا الآلاهة بزعمهم وسيلة يتقربون بها إلى الله تعالى ، فهؤلاء جمعوا العبادة والاستعانة بهم لأنَّ جَعْلَهم وسيلة إلى الله ضربٌ من الاستعانة ، وإنما قلنا إن استفادة الرد على المشركين ونحوهم بطريق التعريض أي بطريق عُرض الكلام لأن القصر الحقيقي لا يصلح أن يكون لرد الاعتقاد إلا تعريضاً لأن معناه حاصل على الحقيقة كما أشار إليه السلكوتي في «حاشية التفسير» .فإن قلت كيف أمرنا بأن لا نعبد إلا الله ولا نستعين إلا به حسبما تشير إليه هذه الآية ، وقد ورد في الصحيح أن النبي صلى الله عليه وسلم لما علَّم عبد الله بن عباس قال له « إذا سَأَلْتَ فاسأل الله وإذا استعنت فاستعن بالله » فلم يأت بصيغة قصر . قلت قد ذكر الشيخ الجد قدس الله روحه في تعليقه على هذا الحديث أن ترك طريقة القصر إيماء إلى أن المَقام لا يقبل الشركة وأن من حق السؤال أن لا يكون إلا لله القادر العليم ، وقد قال علماء البلاغة إذا كان الفعل مقصوراً في نفسه فارتكاب طريق القصر لغو من الكلام ا ه .وأقول تقفيةً على أثره إن مقام الحديث غير مقام الآية فمقام الحديث مقام تعليم خاص لمن نشأ وشب وترجل في الإسلام فتقرُّرُ قصر الحكم لديه على طَرَف الثمام ولذلك استغنى عنه وأما مقام هذه الآية فمقام مفتَتح الوحي والتشريع واستهلال الوعظ والتقريع ، فناسب تأكيد الحكم بالقصر مع التعريض بحال الشرك الشنيع على أن تعليق الأمر بهما في جواب الشرط على حصول أيّ سؤال وأية استعانة يفيد مفاد القصر تعريضاً بالمشركين وبراءة من صنيعهم فقد كانوا يستعينون بآلهتهم . ومن ذلك الاستقسام بالأزلام الموضوعة عند الآلهة والأصنام .وضميرا { نعبد ونَستعين } يعودَان إلى تالي السورة ذاكراً معه جماعة المؤمنين . وفي العدول عن ضمير الواحد إلى الإتيان بضمير المتكلم المشارَك الدلالة على أن هذه المحامد صادرة من جماعات ، ففيه إغاظة للمشركين إذ يعلمون أن المسلمين صاروا في عِزة ومَنَعة ، ولأنه أبلغ في الثناء من أعبد وأستعين لئلا تخلو المناجاة عن ثناء أيضاً بأن المحمود المعبود المستعان قد شهد له الجماعات وعرفوا فضله ، وقريب من هذا قول النابغة في رثاء النعمان بن الحارث الغساني :قعودا له غسان يرجون أوْبَة ... وتُركٌ ورهطُ الأعجمين وكابُلإذ قصد من تعداد أصناف من الأمم الكناية عن عظمة النعمان وكثرة رعيته . فكَأَنَّ الحامد لما انتقل من الحمد إلى المناجاة لم يغادر فرصة يقتنص منها الثناء إلا انتهزها .ووجهه تقديم قوله { إياك نعبد } على قوله : { وإياك نستعين } أن العبادة تقرُّب للخالق تعالى فهي أجدر بالتقديم في المناجاة ، وأما الاستعانة فهي لنفع المخلوق للتيسير عليه فناسب أن يقدِّم المناجي ما هو من عزمه وصنعه على ما يسأله مما يعين على ذلك ، ولأن الاستعانة بالله تتركب على كونه معبوداً للمستعين به ولأن من جملة ما تطلب الإعانة عليه العبادة فكانت متقدمة على الاستعانة في التعقل . وقد حصل من ذلك التقديم أيضاً إيفاء حق فواصل السورة المبنية على الحرف الساكن المتماثل أو القريب في مخرج اللسان .وأعيد لفظ { إياك } في الاستعانة دون أن يعطف فعل { نستعين } على { نعبد } مع أنهما مقصودان جميعاً كما أنبأ عنه عطف الجملة على الجملة لأن بين الحصرين فرقاً ، فالحصر في { إياك نعبد } حقيقي والقصر في { إياك نستعين ادعائي فإن المسلم قد يستعين غير الله تعالى كيف وقد قال تعالى : { وتعاونوا على البر والتقوى } [ المائدة : 2 ] ولكنه لا يستعين في عظائم الأمور إلا بالله ولا يعد الاستعانة حقيقة إلا الاستعانة بالله تعالى .\n","ar.waseet":"كانت الآيات الثلاث التى تقدمت هذه الآية تقريراً للحقيقة فى جانب الربوبية وعظمتها وعموم سلطانها وسعة رحمتها تقريرا جمع أمور الدنيا والآخرة ثم جاءت هذه الآية لتقرر أن الذى يجدر بنا أن نعبده وأن نسعتين به إنما هو الله الذى تجلت أوصافه، ووضحت عظمته، وثبتت هيمنته على هذا الكون.ولفظ \" إيا \" ضمير منفصل، و \" الكاف \" الملحقة به للخطاب.والعبارة تفيد أن الطاعة البالغة حد النهاية فى الخضوع والخشوع والتعظيم، والعبادة الصحيحة تتأتى للمسلم بتحقق أمرين: إخلاصها لله، وموافقتها لما جاء به النبى صلى الله عليه وسلم.قال ابن جرير: \" لأن العبودية عند جميع العرب أصلها الذلة، وأنها تسمى الطريق المذلل الذى وطئته الأقدام وذللته السابلة معبداً \".والاستعانة: طلب المعونة، من أجل الأقتدار على الشئ والتمكن من فعله.والمعنى: لك يا ربنا وحدك نخشع ونذل ونستكين، فقد توليتنا برعايتك وغمرتنا برحمتك، فنحن نخصك بطلب الإِعانة على طاعتك وعلى أمورنا كلها، ولا نتوجه بهذا الطلب إلى أحد سواك، فأنت المستحق للعبادة، وأنت القدير على كل شئ، والعليم ببواطن الأمور وظواهرها، لا تخفى عليك طوية، ولا تتوارى عنك نية.وقدم - سبحانه - المعبود على العبادة فقال: { إِيَّاكَ نَعْبُدُ } ، لإِفادة قصر العبادة عليه، وهو ما يقتضيه التوحيد الخالص.وقال: { نعبد } بنون الجماعة ولم يقل أعبد، ليدل على أن العبادة أحسن ما تكون فى جماعة المؤمنين، وللإِشعار بأن المؤمنين المخلصين يكونون فى اتحادهم وإخائهم بحيث يقوم كل واحد منهم فى الحديث عن شئونهم الظاهرة وغير الظاهرة مقام جميعهم، فهم كما قال النبى صلى الله عليه وسلم: \" المؤمنون تتكافأ دماؤهم، ويسعى بذمتهم أدناهم، وهم يد على من سواهم \".وقدمت العبادة على الاستعانة، لكون الأولى وسيلة إلى الثانية. وتقديم الوسائل سبب فى تحصيل المطالب، وليدل على أنهم لا يستقلون بإقامة العبادات، بل إن عون الله هو الذى ييسر لهم أداءها.ولم يذكر المستعان عليه من الأعمال، ليشمل الطلب كل ما تتجه إليه نفس الإِنسان من الأعمال الصالحة.وجاءت الآية الكريمة بأسلوب الخطاب على طريقة الالتفات، تلوينا لنظم الكلام من أسلوب إلى أسلوب. وقد وضح هذا المعنى صاحب الكشاف فقال: \" فإن قلت: لم عدل عن لفظ الغيبة إلى لفظ الخطاب؟ قلت: هذا يسمى الالتفات فى علم البيان.وهو قد يكون من الغيبة إلى الخطاب، ومن الخطاب إلى الغيبة، ومن الغيبة إلى التكلم... وذلك على عادة العرب فى افتنانهم فى الكلام وتصرفهم فيه. لأن الكلام إذا نقل من أسلوب إلى أسلوب، كان ذلك أحسن تطرية لنشاط السامع، وإيقاظاً للإِصغاء إليه من إجرائه على أسلوب واحد: وقد تختص مواضعه بفوائد. ومما اختص به هذا الموضع: أنه لما ذكر الحقيق بالحمد، وأجرى عليه تلك الصفات العظام، تعلق العلم بمعلوم عظيم الشأن، حقيق بالثناء وغاية للخضوع والاستعانة فى المهمات، فخوطب ذلك المعلوم المتميز بتلك الصفات فقيل: إياك يا من هذه صفاته نخصك بالعبادة والاستعانة، ولا نعبد غيرك ولا نستعينه... \".هذا، وقد جاءت فى فضل هذه الآية الكريمة آثار متعددة، ومن ذلك قول بعض العلماء: الفاتحة سر القرآن، وسرها هذه الكلمة { إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } فالأول تبرؤ من الشرك، والثانى تبرؤ من الحول والقوة والتفويض إلى الله \".\n","ar.baghawi":"قوله: {إياك نعبد}(( إياً )) كلمة ضمير خصت بالإضافة إلى المضمر ويستعمل مقدماً على الفعل؛ فيقال: إياك أعني، وإياك أسأل، ولا يستعمل مؤخراً إلا منفصلاً. فيقال: ما عنيت إلا إياك.قوله: {نعبد}: أي نوحدك ونطيعك خاضعين، والعبادة الطاعة مع التذلل والخضوع وسمي العبد عبداً لذلته وانقياده، يقال: طريق معبد أي مذلل.{وإياك نستعين}: نطلب منك المعونة على عبادتك وعلى جميع أمورنا، فإن قيل: لِمَ قَدَّم ذِكْر العبادة على الاستعانة والاستعانة تكون قبل العبادة؟ فلهذا يلزم من يجعل الاستطاعة قبل الفعل. ونحن بحمد الله نجعل التوفيق (والاستعانة) مع الفعل، فلا فرق بين التقديم والتأخير.ويقال: الاستعانة نوع تعبد فكأنه ذكر جملة العبادة أولاً ثم ذكر ما هو من تفاصيلها.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ","transliteration":"Ihdinas-Siraatal-Mustaqeem","translations":{"en.ahmedali":"Guide us (O Lord) to the path that is straight,","en.ahmedraza":"Guide us on the Straight Path.","en.arberry":"Guide us in the straight path,","en.asad":"Guide us the straight way.","en.daryabadi":"Guide us Thou unto the path straight","en.hilali":"Guide us to the Straight Way","en.pickthall":"Show us the straight path,","en.qaribullah":"Guide us to the Straight Path,","en.sahih":"Guide us to the straight path -","en.sarwar":"(Lord), guide us to the right path,","en.yusufali":"Show us the straight way,","en.maududi":"Direct us on to the Straight Way,","en.shakir":"Keep us on the right path.","en.itani":"Guide us to the straight path.","en.mubarakpuri":"Guide us to the straight path.","en.qarai":"Guide us on the straight path,","en.wahiduddin":"Guide us to the straight path:"},"tafsir":{"ar.muyassar":"دُلَّنا، وأرشدنا، ووفقنا إلى الطريق المستقيم، وثبتنا عليه حتى نلقاك، وهو الإسلام، الذي هو الطريق الواضح الموصل إلى رضوان الله وإلى جنته، الذي دلّ عليه خاتم رسله وأنبيائه محمد صلى الله عليه وسلم، فلا سبيل إلى سعادة العبد إلا بالاستقامة عليه.","ar.jalalayn":"«اهدنا الصراط المستقيم» أي أرشدنا إليه، ويبدَل منه:","ar.qurtubi":"قوله تعالى : اهدنا الصراط المستقيم اهدنا : دعاء ورغبة من المربوب إلى الرب ، والمعنى : دلنا على الصراط المستقيم وأرشدنا إليه ، وأرنا طريق هدايتك الموصلة إلى أنسك وقربك . قال بعض العلماء : فجعل الله جل وعز عظم الدعاء وجملته موضوعا في هذه السورة ، نصفها فيه مجمع الثناء ، ونصفها فيه مجمع الحاجات ، وجعل هذا الدعاء الذي في هذه السورة أفضل من الذي يدعو به [ الداعي ] لأن هذا الكلام قد تكلم به رب العالمين ، فأنت تدعو بدعاء هو كلامه الذي تكلم به ; وفي الحديث : ليس شيء أكرم على الله من الدعاء . وقيل المعنى : أرشدنا باستعمال السنن [ ص: 144 ] في أداء فرائضك ; وقيل : الأصل فيه الإمالة ; ومنه قوله تعالى : إنا هدنا إليك أي ملنا ; وخرج عليه السلام في مرضه يتهادى بين اثنين ; أي يتمايل . ومنه الهدية ; لأنها تمال من ملك إلى ملك . ومنه الهدي للحيوان الذي يساق إلى الحرم ; فالمعنى مل بقلوبنا إلى الحق . وقال الفضيل بن عياض : الصراط المستقيم طريق الحج ، وهذا خاص والعموم أولى . قال محمد بن الحنفية في قوله عز وجل اهدنا الصراط المستقيم : هو دين الله الذي لا يقبل من العباد غيره . وقال عاصم الأحول عن أبي العالية : الصراط المستقيم رسول الله صلى الله عليه وسلم وصاحباه من بعده . قال عاصم فقلت للحسن : إن أبا العالية يقول : الصراط المستقيم رسول الله صلى الله عليه وسلم وصاحباه ، قال : صدق ونصح .أصل الصراط في كلام العرب الطريق ; قال عامر بن الطفيل :شحنا أرضهم بالخيل حتى تركناهم أذل من الصراطوقال جرير :أمير المؤمنين على صراط     إذا اعوج الموارد مستقيموقال آخر :فصد عن نهج الصراط الواضحوحكى النقاش : الصراط الطريق بلغة الروم ; فقال ابن عطية : وهذا ضعيف جدا . وقرئ : السراط ( بالسين ) من الاستراط بمعنى الابتلاع ; كأن الطريق يسترط من يسلكه . وقرئ بين الزاي والصاد . وقرئ بزاي خالصة والسين الأصل . وحكى سلمة عن الفراء قال : الزراط بإخلاص الزاي لغة لعذرة وكلب وبني القين ، قال : وهؤلاء يقولون [ في أصدق ] : أزدق . وقد قالوا الأزد والأسد ولسق به ولصق به . و الصراط نصب على المفعول الثاني ; لأن الفعل من الهداية يتعدى إلى المفعول الثاني بحرف جر ; قال الله تعالى : فاهدوهم إلى صراط الجحيم . . وبغير حرف كما في هذه الآية . المستقيم صفة ل الصراط وهو الذي لا اعوجاج فيه ولا انحراف ; ومنه قوله تعالى : وأن هذا صراطي مستقيما فاتبعوه وأصله مستقوم ، نقلت الحركة إلى القاف وانقلبت الواو ياء لانكسار ما قبلها .\n","ar.miqbas":"تهيأ لأصحاب هذه المناجاة أن يسعوا إلى طلب حظوظهم الشريفة من الهداية بعد أن حمدوا الله ووصفوه بصفات الجلالة ثم أتبعوا ذلك بقولهم : { إياك نعبد وإياك نستعين } الذي هو واسطة جامع بين تمجيد الله تعالى وبين إظهار العبودية وهي حظ العبد بأنه عابد ومستعين وأنه قاصر ذلك على الله تعالى ، فكان ذلك واسطة بين الثناء وبين الطلب ، حتى إذا ظنوا بربهم الإقبال عليهم ورجَوا من فضله ، أفضوا إلى سُؤَل حظهم فقالوا : { اهدنا الصراط المستقيم } فهو حظ الطالبين خاصة لما ينفعهم في عاجلهم وآجلهم ، فهذا هو التوجيه المناسب لكون الفاتحة بمنزلة الديباجة للكتاب الذي أُنزل هدى للناس ورحمة فتتنزل هاته الجملة مما قبلها منزلة المقصد من الديباجة ، أو الموضوع من الخطبة ، أو التخلص من القصيدة ، ولاختلاف الجمل المتقدمة معها بالخبرية والإنشائية فصلت هذه عنهن ، وهذا أَوْلى في التوجيه من جعلها جواباً لسؤال مقدر على ما ذهب إليه صاحب «الكشاف» .والهداية الدلالة بتلطف ولذلك خصت بالدلالة لما فيه خير المدلول لأن التلطف يناسب من أريد به الخير ، وهو يتعدى إلى مفعول واحد بنفسه لأن معناه معنى الإرشاد ، ويتعدى إلى المفعول الثاني وهو المهدى إليه بإلى وباللام والاستعمالان وارداننِ ، تقول هديته إلى كذا على معنى أوصلته إلى معرفته ، وهديته لكذا على معنى أرشدته لأجل كذا : { فاهدوهم إلى صراط الجحيم } [ الصافات : 23 ] ، { الحمد لله الذي هدانا لهذا } [ الأعراف : 43 ] وقد يعدى إلى المفعول الثاني بنفسه كما هنا على تضمينه معنى عرف قيل هي لغة أهل الحجاز وأما غيرهم فلا يعديه بنفسه وقد جعلوا تعديته بنفسه من التوسع المعبر عنه بالحذف والإيصال . وقيل الفرق بين المتعدي وغيره أن المتعدي يستعمل في الهداية لمن كان في الطريق ونحوه ليزداد هدى ومصدره حينئذٍ الهداية ، وأما هداه إلى كذا أو لكذا فيستعمل لمن لم يكن سائراً في الطريق ومصدره هُدى ، وكأن صاحب هذا القول نظر إلى أن المتعدي بالحرف إنما عدي لتقويته والتقوية إما أن يقصد بها تقوية العامل لضعفه في العمل بالفرعية أو التأخير ، وإما أن يقصد بها تقوية معناه ، والحق أن هذا إن تم فهو أغلبي على أنه تخصيص من الاستعمال فلا يقتضي كون الفعل مختلف المعنى لأن الفعل لا تختلف معانيه باعتبار كيفية تعديته إلا إذا ضمن معنى فعل آخر ، على أن كلاً من الهُدَى والهداية اسم مصدر والمصدر هو الهَدْي . والذي أراه أن التعدية والقصور ليسا من الأشياء التي تصنع باليد أو يصطلح عليها أحد ، بل هي جارية على معنى الحدث المدلول للفعل فإن كان الحدث يتقوم معناه بمجرد تصور من قام به فهو الفعل القاصر وإن كان لا يتقوم إلا بتصور من قام به ومن وقع عليه فهو المتعدي إلى واحد أو أكثر ، فإن أشكلت أفعال فإنما إشكالها لعدم اتضاح تشخص الحدث المراد منها لأن معناها يحوم حول معان متعددة .وهدَى متعد لواحد لا محالة ، وإنما الكلام في تعديته لثان فالحق أنه إن اعتبر فيه معنى الإراءة والإبانة تعدى بنفسه وإن اعتبر فيه مطلق الإرشاد والإشارة فهو متعد بالحرف فحالة تعديته هي المؤذنة بالحدث المتضمن له .وقد قيل إن حقيقة الهداية الدلالة على الطريق للوصول إلى المكان المقصود فالهادي هو العارف بالطرق وفي حديث الهجرة : «إن أبا بكر استأجر رجلاً من بني الديل هادياً خِريتاً» وإن ما نشأ من معاني الهداية هو مجازات شاع استعمالها . والهداية في اصطلاح الشرع حين تسند إلى الله تعالى هي الدلالة على ما يرضي الله من فعل الخير ويقابلها الضلالة وهي التغرير .واختلف علماء الكلام في اعتبار قيد الإيصال إلى الخير في حقيقة الهداية فالجمهور على عدم اعتباره وأنها الدلالة على طريق الوصول سواء حصل الوصول أم لم يحصل وهو قول الأشاعرة وهو الحق . وذهب جماعة منهم الزمخشري إلى أن الهداية هي الدلالة مع الإيصال وإلا لما امتازت عن الضلالة أي حيث كان الله قادراً على أن يوصل من يهديه إلى ما هداه إليه ، ومرجع الخلاف إلى اختلافهم في أصل آخر وهو أصل معنى رضى الله ومشيئته وإرادته وأمره ، فأصحاب الأشعري اعتبروا الهداية التي هي من متعلق الأمر ، والمعتزلة نظروا إلى الهداية التي هي من متعلق التكوين والخلْق ، ولا خلاف في أن الهداية مع الوصول هي المطلوبة شرعاً من الهادي والمهدي مع أنه قد يحصل الخطأ للهادي وسوء القبول من المهدي وهذا معنى ما اختار عبد الحكيم أنها موضوعة في الشرع لقدر المشترك لورودها في القرآن في كل منهما قال : { إنك لا تهدي من أحببت } [ القصص : 56 ] وقال : { وأما ثمود فهديناهم فاستحبوا العمى على الهدى } [ فصلت : 17 ] والأصل عدم الاشتراك وعدم المجاز .والهداية أنواع تندرج كثرتها تحت أربعة أجناس مترتبة : الأول إعطاء القوى المحركة والمدركة التي بها يكون الاهتداء إلى انتظام وجود ذات الإنسان ، ويندرج تحتها أنواع تبتدىء من إلهام الصبي التقام الثدي والبكاء عند الألم إلى غاية الوجدانِيَّات التي بها يدفع عن نفسه كإدراك هول المهلكات وبشاعة المنافرات ، ويجلب مصالحه الوجودية كطلب الطعام والماء وذودِ الحشرات عنه وحك الجلد واختلاج العين عند مرور ما يؤذي تجاهها ، ونهايتها أحوال الفكر وهو حركة النفس في المعقولات أعني ملاحظة المعقول لتحصيل المجهول في البديهيات وهي القوة الناطقة التي انفرد بها الإنسان المنتزعة من العلوم المحسوسة .الثاني نصب الأدلة الفارقة بين الحق والباطل والصواب والخطأ ، وهي هداية العلوم النظرية . الثالث الهداية إلى ما قد تقْصُر عنه الأدلة أو يفضي إعمالها في مثله إلى مشقة وذلك بإرسال الرسل وإنزال الكتب وموازين القسط وإليها الإشارة بقوله تعالى في شأن الرسل :{ وجعلناهم أيمة يهدون بأمرنا } [ الأنبياء : 23 ] . الرابع أقصى أجناس الهداية وهي كشف الحقائق العُليا وإظهار أسرار المعاني التي حارت فيها أَلباب العقلاء إما بواسطة الوحي والإلهام الصحيح أو التجليات ، وقد سمى الله تعالى هذا هدى حين أضافه للأنبياء فقال : { أولئك الذين هدى الله فيهداهم اقتده } [ الأنعام : 90 ] .ولا شك أن المطلوب بقوله { اهدنا الملقَّن للمؤمنين هو ما يناسب حال الداعي بهذا إن كان باعتبار داع خاص أو طائفة خاصة عندما يقولون : اهدنا ، أو هو أنواع الهداية على الجملة باعتبار توزيعها على من تأهل لها بحسب أهليته إن كان دعاء على لسان المؤمنين كلهم المخاطبين بالقرآن ، وعلى كلا التقديرين فبعض أنواع الهداية مطلوب حصوله لمن لم يبلغ إليه ، وبعضها مطلوب دوامه لمن كان حاصلاً له خاصة أو لجميع الناس الحاصل لهم ، وذلك كالهداية الحاصلة لنا قبل أنْ نسألها مثل غالب أنواع الجنس الأول .وصيغة الطلب موضوعة لطلب حصول الماهية المطلوبة من فعل أو كف فإذا استعملت في طلب الدوام كان استعمالها مجازاً نحو : { يأيها الذين آمَنوا آمِنوا } [ النساء : 136 ] وذلك حيث لا يراد بها إلا طلب الدوام . وأما إذا استعملت في طلب الدوام للزيادة مما حصل بعضُه ولم يحصل بعضه فهي مستعملة في معناها وهو طلب الحصول لأن الزيادة في مراتب الهداية مثلاً تحصيل لمواد أخرى منها . ولما كان طلب الزيادة يستلزم طلب دوام ما حصل إذ لا تكاد تنفع الزيادة إذا انتقض الأصل كان استعمالها حينئذٍ في لازم المعنى مع المعنى فهو كناية . أما إذا قال : { اهدنا الصراط المستقيم } من بلَغَ جميع مراتب الهداية ورقَى إلى قمة غاياتها وهو النبي صلى الله عليه وسلم فإن دعاءه حينئذٍ يكون من استعمال اللفظ في مجاز معناه ويكون دعاؤه ذلك اقتباساً من الآية وليس عين المراد من الآية لأن المراد منها طلب الحصول بالمزيد مع طلب الدوام بطريقة الالتزام ولا محالة أن المقصود في الآية هو طلب الهداية الكاملة .والصراط الطريق وهو بالصاد وبالسين وقد قرىء بهما في المشهورة وكذلك نطقت به بالسين جمهور العرب إلا أهل الحجاز نطقوه بالصاد مبدلة عن السين لقصد التخفيف في الانتقال من السين إلى الراء ثم إلى الطاء قال في «لطائف الإشارات» عن الجعبري إنهم يفعلون ذلك في كل سين بعدها غين أو خاء أو قاف أو طاء وإنما قلبوها هنا صاداً لتُطابقَ الطاء في الإطباق والاستعلاء والتفخم مع الراء استثقالاً للانتقال من سفل إلى علو ا ه . أي بخلاف العكس نحو طَسْت لأن الأول عمل والثاني ترك . وقَيسٌ قلبوا السين بين الصاد والزاي وهو إشمام وقرأ به حمزة في رواية خلف عنه . ومن العرب من قلب السين زاياً خالصة قال القرطبي : وهي لغة عُذرة وكلب وبني القَيْن وهي مرجوحة ولم يُقرأ بها ، وقد قرأ باللغة الفصحى ( بالصاد ) جمهور القراء وقرأ بالسين ابن كثير في رواية قنبل ، والقراءة بالصاد هي الراجحة لموافقتها رسم المصحف وكونها اللغة الفصحى .فإن قيل كيف كتبت في المصحف بالصاد وقرأها بعض القراء بالسين؟ قلت إن الصحابة كتبوها بالصاد تنبيهاً على الأفصح فيها ، لأنهم يكتبون بلغة قريش واعتمدوا على علم العرب فالذين قرأوا بالسين تأولوا أن الصحابة لم يتركوا لغة السين للعلم بها فعادلوا الأفصح بالأصل ولو كتبوها بالسين مع أنها الأصل لتوهم الناس عدم جواز العدول عنه لأنه الأصل والمرسوم كما كتبوا المصيطر بالصاد مع العلم بأن أصله السين فهذا مما يَرجِع الخلاف فيه إلى الاختلاف في أداء اللفظ لا في مادة اللفظ لشهرة اختلاف لهجات القبائل في لفظ مع اتحاده عندهم .والصراط اسم عربي ولم يقل أحد من أهل اللغة إنه معرب ولكن ذَكر في «الإتقان» عن النقاش وابن الجوزي أنه الطريق بلغة الروم وذكر أن أبا حاتم ذكر ذلك في كتاب «الزينة» له وبنى على ذلك السيوطي فزاده في «منظومته في المعرب» .والصراط في هذه الآية مستعار لمعنى الحق الذي يبلغ به مدركه إلى الفوز برضاء الله لأن ذلك الفوز هو الذي جاء الإسلام بطلبه .والمستقيم اسم فاعل استقام مطاوع قومته فاستقام ، والمستقيم الذي لا عوج فيه ولا تعاريج ، وأحسن الطرق الذي يكون مستقيماً وهو الجادة لأنه باستقامته يكون أقرب إلى المكان المقصود من غيره فلا يضل فيه سالكه ولا يتردد ولا يتحير .والمستقيم هنا مستعار للحق البين الذي لا تخلطه شبهة باطل فهو كالطريق الذي لا تتخلله بُنَيَّات ، عن ابن عباس أن الصراط المستقيم دين الحق ، ونقل عنه أنه ملة الإسلام ، فكلامه يفسر بعضُه بعضاً ولا يريد أنهم لقنوا الدعاء بطلب الهداية إلى دين مضى وإن كانت الأديان الإلهية كلها صُرُطاً مستقيمة بحسب أحوال أممها يدل لذلك قوله تعالى في حكاية غَواية الشيطان : { قال فبما أغويتني لأقعدن لهم صراطك المستقيم } [ الأعراف : 16 ] .فالتعريف في ( الصراط المستقيم ) تعريف العهد الذهني ، لأنهم سألوا الهداية لهذا الجنس في ضمن فرد وهو الفرد المنحصر فيه الاستقامة لأن الاستقامة لا تتعدد كما قال تعالى : { فماذا بعد الحق إلا الضلال } [ يونس : 32 ] ولأن الضلال أنواع كثيرة كما قال : { ولو أعجبك كثرة الخبيث } [ المائدة : 100 ] وقد يوجه هذا التفسير بحصول الهداية إلى الإسلام فعلمهم الله هذا الدعاء لإظهار منته وقد هداهم الله بما سبق من القرآن قبل نزول الفاتحة ويهديهم بما لحق من القرآن والإرشاد النبوي . وإطلاق الصراط المستقيم على دين الإسلام ورد في قوله تعالى : { قل إنني هداني ربي إلى صراط مستقيم ديناً قيماً } [ الأنعام : 161 ] .والأظهر عندي أن المراد بالصراط المستقيم المعارف الصالحات كلها من اعتقاد وعمل بأن يوفقهم إلى الحق والتمييز بينه وبين الضلال على مقادير استعداد النفوس وسعة مجال العقول النيرة والأفعال الصالحة بحيث لا يعتريهم زيغ وشبهات في دينهم وهذا أولى ليكون الدعاء طلب تحصيل ما ليس بحاصل وقت الطلب وإنَّ المرء بحاجة إلى هذه الهداية في جميع شؤونه كلها حتى في الدوام على ما هو متلبس به من الخير للوقاية من التقصير فيه أو الزيغ عنه . والهداية إلى الإسلام لا تُقْصَر على ابتداء اتباعه وتقلده بل هي مستمرة باستمرار تشريعاته وأحكامه بالنص أو الاستنباط . وبه يظهر موقع قوله : { غير المغضوب عليهم ولا الضالين } مصادفاً المحز .\n","ar.waseet":"ثم بين - سبحانه - أن أفضل شئ يطلبه العبد من ربه، إنما هو هدايته إلى الطريق الذى يوصل إلى أسمى الغايات، وأعظم المقاصد، فقال - تعالى -:{ ٱهْدِنَا ٱلصِّرَاطَ ٱلْمُسْتَقِيمَ صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم وَلاَ ٱلضَّآلِّينَ }.والهداية: هى الإِرشاد والدلالة بلطف على ما يوصل إلى البغية، وتسند الهداية إلى الله وإلى النبى وإلى القرآن، وقد يراد منها الإِيصال إلى ما فيه خير، وهى بهذا المعنى لا تضاف إلى الله - تعالى -.قال أبو حيان فى البحر ما ملخصه: وقد تأتى بمعنى التبيين كما فى قوله - تعالى -{ وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ }أى بينا لهم طريق الخير. أو بمعنى الإِلهام كما فى قوله تعالى.{ قَالَ فَمَن رَّبُّكُمَا يٰمُوسَىٰ قَالَ رَبُّنَا ٱلَّذِيۤ أَعْطَىٰ كُلَّ شَيءٍ خَلْقَهُ ثُمَّ هَدَىٰ }قال المفسرون معناه: ألهم الحيوانات كلها إلى منافعها، أو بمعنى الدعاء كما فى قوله. تعالى:{ وَلِكُلِّ قَوْمٍ هَادٍ }أى: داع. والأصل فى هدى أن يصل إلى ثانى معموليه باللام كما فى قوله. تعالى.{ إِنَّ هَـٰذَا ٱلْقُرْآنَ يَِهْدِي لِلَّتِي هِيَ أَقْوَمُ }أو بإلى كما فى قوله تعالى:{ وَإِنَّكَ لَتَهْدِيۤ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ }ثم يتسع فيه فيعدى إليه بنفسه ومنه: { ٱهْدِنَا ٱلصِّرَاطَ ٱلْمُسْتَقِيمَ }.والصراط: الجادة والطريق، من سَرط الشئ إذا ابتلعه، وسمى الطريق بذلك لأنه يبتلع المارين فيه، وتبدل سينه صاد على لغة قريش.والمستقيم: المعتدل الذى لا اعوجاج فيه.وأنعمت عليهم: النعمة لين العيش وخفضه، ونعم الله كثيرة لا تحصى.{ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم } الغضب هيجان النفس وثورتها، عند الميل إلى الانتقام، وهو ضد الرضا. وإذا أسند إلى الله فسر بمعنى إرادة الانتقام أو بمعنى الانتقام نفسه.والموافق لمذهب السلف أن يقال: هو صفة له - تعالى - لائقة بجلاله لا نعلم حقيقتها مجردة عن اللوازم البشرية وإنما نعرف أثرها وهو الانتقام من العصاة، وإنزال العقوبة بهم.والمعنى: اهدنا يا ربنا إلى طريقك المستقيم، الذى يوصلنا إلى سعادة الدنيا والآخرة، ويجعلنا مع الذين أنعمت عليهم من خلقك، وجنبنا يا مولانا طريق الذين غضبت عليهم من الأمم السابقة أو الأجيال اللاحقة بسبب سوء أعمالهم وطريق الذين هاموا فى الضلالات، فانحرفوا عن القصد، وحق عليهم العذاب.وفى هذا الدعاء أسمى ألوان الأدب، لأن هذا الدعاء قد تضرع به المؤمنون إلى خالقهم بعد أن اعترفوا له - سبحانه - قبل ذلك بأنه هو المستحق لجميع المحامد، وأنه هو رب العالمين، والمتصرف فى أحوالهم يوم الدين.قال الإِمام ابن كثير: وهذا أكمل أحوال السائل. أن يمدح مسئوله ثم يسأل حاجته وحاجة إخوانه المؤمنين بقوله: { ٱهْدِنَا ٱلصِّرَاطَ ٱلْمُسْتَقِيمَ } لأنه أنجح للحاجة، وأنجع للإِجابة، ولهذا أرشدنا الله إليه لأنه الأكمل.وقد تكلم المفسرون كلاماً كثيراً عن المراد بالصراط المستقيم الذى جعل الله طلب الهداية إليه فى هذا السورة أول دعوة علمها لعباده. والذى نراه: أن أجمع الأقوال فى ذلك أن المراد بالصراط المستقيم، هو ما جاء به الإِسلام من عقائد وآداب وأحكام، توصل الناس متى اتبعوها إلى سعادة الدنيا والآخرة، فإن طريق السلام هو الطريق الذى ختم الله به الرسالات السماوية، وجعل القرآن دستوره الشامل، ووكل إلى النبى صلى الله عليه وسلم أمر تبليغه وبيانه.وقد ورد فى الأحاديث النبوية ما يؤيد هذا القول، ومن ذلك ما أخرجه الإِمام أحمد فى مسنده، عن النواس بن سمعان، عن رسول الله صلى الله عليه وسلم أنه قال: \" ضرب الله مثلا صراطا مستقيما، وعلى جنبتى الصراط سوران فيهما أبواب مفتحة، وعلى الأبواب ستور مرخاة، وعلى باب الصراط داع يقول: يا أيها الناس ادخلوا الصراط جميعاً ولا تعوجوا، وداع يدعو من فوق الصراط، فإذا أراد الإِنسان أن يفتح شيئاً من تلك الأبواب قال له: ويحك لا تفتحه، فإنك إن تفتحه تلجه، فالصراط الإِسلام، والسوران حدود الله، والأبواب المفتحة محارم الله، وذلك الداعى من فوق الصراط واعظ الله فى قلب كل مسلم \".والمراد بقوله - تعالى - { ٱهْدِنَا ٱلصِّرَاطَ ٱلْمُسْتَقِيمَ } أى: ثبتنا عليه، واجعلنا من المداومين على السير فى سبيله، فإن العبد مفتقر إلى الله فى كل وقت لكى يثبته على الهداية، ويزيده منها، ويعينه عليها. وقد أمر سبحانه المؤمنين أن يقولوا:{ رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ ٱلْوَهَّابُ }وجملة { صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ } بدل من الصراط المستقيم.ولم يقل: اهدنا صراط الذين أنعمت عليهم مستغنياً عن ذكر الصراط المستقيم، ليدل أن صراط هؤلاء المنعم عليهم هو الصراط المستقيم.\n","ar.baghawi":"قوله:{اهدنا الصراط المستقيم}(اهدنا): أرشدنا، وقال علي وأُبَي بن كعب:\"ثبتنا كما يقال للقائم قم حتى أعود إليك أي دُمْ على ما أنت عليه\".وهذا الدعاء من المؤمنين مع كونهم على الهداية بمعنى التثبيت وبمعنى طلب مزيد الهداية لأن الألطاف والهدايات من الله تعالى لا تتناهى على مذهب أهل السنة.(الصراط) وسراط بالسين رواه أويس عن يعقوب وهو الأصل.سمي سراطاً لأنه يسرط السابلة، ويقرأ بالزاي، وقرأ حمزة باشمام الزاي، وكلها لغات صحيحة، والاختيار: الصاد عند أكثر القراء لموافقة المصحف.و{الصراط المستقيم}: قال ابن عباس وجابر رضي الله عنهما: \"هو الإسلام\"، وهو قول (مُقَاتل).وقال ابن مسعود رضي الله عنه: \"هو القرآن\".وروي عن علي رضي الله عنه مرفوعاً: (( الصراط المستقيم كتاب الله ))وقال سعيد بن جبير رضي الله عنه: \"طريق الجنة\".وقال سهل بن عبد الله: \"طريق السُّنة والجماعة\".وقال بكر بن عبد الله المزني: \"طريق رسول الله صلى الله عليه وسلم\".وقال أبو العالية والحسن: \"رسول الله وآله وصاحباه\".وأصله في اللغة الطريق الواضح.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ","transliteration":"Siraatal-lazeena an'amta 'alaihim ghayril-maghdoobi 'alaihim wa lad-daaalleen","translations":{"en.ahmedali":"The path of those You have blessed, Not of those who have earned Your anger, nor those who have gone astray.","en.ahmedraza":"The path of those whom You have favoured – Not the path of those who earned Your anger – nor of those who are astray.","en.arberry":"the path of those whom Thou hast blessed, not of those against whom Thou art wrathful, nor of those who are astray.","en.asad":"The way of those upon whom Thou hast bestowed Thy blessings, not of those who have been condemned [by Thee], nor of those who go astray!","en.daryabadi":"The path of those whom Thou hast favoured. Not of those on whom is indignation brought down, nor of the astray.","en.hilali":"The Way of those on whom You have bestowed Your Grace, not (the way) of those who earned Your Anger, nor of those who went astray.","en.pickthall":"The path of those whom Thou hast favoured; Not the (path) of those who earn Thine anger nor of those who go astray.","en.qaribullah":"the Path of those upon whom You have favored, not those upon whom is the anger, nor the astray. (Amen please answer)","en.sahih":"The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.","en.sarwar":"the path of those to whom You have granted blessings, those who are neither subject to Your anger nor have gone astray.","en.yusufali":"The way of those on whom Thou hast bestowed Thy Grace, those whose (portion) is not wrath, and who go not astray.","en.maududi":"The way of those whom You have favoured, who did not incur Your wrath, who are not astray.","en.shakir":"The path of those upon whom Thou hast bestowed favors. Not (the path) of those upon whom Thy wrath is brought down, nor of those who go astray.","en.itani":"The path of those You have blessed, not of those against whom there is anger, nor of those who are misguided.","en.mubarakpuri":"The way of those upon whom You have bestowed Your grace, not (that) of those who earned Your anger, nor of those who went astray.","en.qarai":"the path of those whom You have blessed — such as have not incurred Your wrath, nor are astray.","en.wahiduddin":"the path of those You have blessed; not of those who have incurred Your wrath, nor of those who have gone astray."},"tafsir":{"ar.muyassar":"طريق الذين أنعمت عليهم من النبيين والصدِّيقين والشهداء والصالحين، فهم أهل الهداية والاستقامة، ولا تجعلنا ممن سلك طريق المغضوب عليهم، الذين عرفوا الحق ولم يعملوا به، وهم اليهود، ومن كان على شاكلتهم، والضالين، وهم الذين لم يهتدوا، فضلوا الطريق، وهم النصارى، ومن اتبع سنتهم. وفي هذا الدعاء شفاء لقلب المسلم من مرض الجحود والجهل والضلال، ودلالة على أن أعظم نعمة على الإطلاق هي نعمة الإسلام، فمن كان أعرف للحق وأتبع له، كان أولى بالصراط المستقيم، ولا ريب أن أصحاب رسول الله صلى الله عليه وسلم هم أولى الناس بذلك بعد الأنبياء عليهم السلام، فدلت الآية على فضلهم، وعظيم منزلتهم، رضي الله عنهم. ويستحب للقارئ أن يقول في الصلاة بعد قراءة الفاتحة: (آمين)، ومعناها: اللهم استجب، وليست آية من سورة الفاتحة باتفاق العلماء؛ ولهذا أجمعوا على عدم كتابتها في المصاحف.","ar.jalalayn":"«صراط الَّذين أنعمت عليهم» بالهداية ويبدل من الذين بصلته «غير المغضوب عليهم» وهم اليهود «ولا» وغير «الضالِّين» وهم النصارى ونكتة البدل إفادة أن المهتدين ليسوا يهوداً ولا نصارى. والله أعلم بالصواب، وإليه المرجع والمآب، وصلى الله على سيدنا محمد وعلى اَله وصحبه وسلم تسليما كثيراً دائما أبداً، وحسبنا الله ونعم الوكيل، ولا حول ولا قوة إلا بالله العلي العظيم.","ar.qurtubi":"صراط الذين أنعمت عليهمصراط بدل من الأول بدل الشيء من الشيء ; كقولك : جاءني زيد أبوك . ومعناه : أدم هدايتنا ، فإن الإنسان قد يهدى إلى الطريق ثم يقطع به . وقيل : هو صراط آخر ، ومعناه العلم بالله جل وعز والفهم عنه ; قاله جعفر بن محمد . ولغة القرآن الذين في الرفع والنصب والجر ، وهذيل تقول : ( اللذون ) في الرفع ، ومن العرب من يقول : ( اللذو ) ، ومنهم من يقول ( الذي ) وسيأتي .وفي ( عليهم ) عشر لغات ; قرئ بعامتها : \" عليهم \" بضم الهاء وإسكان الميم . \" وعليهم \" بكسر الهاء وإسكان الميم . و \" عليهمي \" بكسر الهاء والميم وإلحاق ياء بعد الكسرة . و \" عليهمو \" بكسر الهاء وضم الميم وزيادة واو بعد الضمة . و \" عليهمو \" بضم الهاء والميم كلتيهما وإدخال واو بعد الميم و \" عليهم \" بضم الهاء والميم من غير زيادة واو . وهذه الأوجه الستة مأثورة عن الأئمة من القراء . وأوجه أربعة منقولة عن العرب غير محكية عن القراء : \" عليهمي \" بضم الهاء وكسر الميم وإدخال ياء بعد الميم ; حكاها الحسن البصري عن العرب . و \" عليهم \" بضم الهاء وكسر الميم من غير زيادة ياء . و \" عليهم \" بكسر الهاء وضم الميم من غير إلحاق واو . و \" عليهم \" بكسر الهاء والميم ولا ياء بعد الميم . وكلها صواب ; قاله ابن الأنباري .قرأ عمر بن الخطاب وابن الزبير رضي الله عنهما \" صراط من أنعمت عليهم \" . واختلف الناس في المنعم عليهم ; فقال الجمهور من المفسرين : إنه أراد صراط النبيين والصديقين والشهداء والصالحين . وانتزعوا ذلك من قوله تعالى : ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا . فالآية تقتضي أن هؤلاء على صراط مستقيم ، وهو المطلوب في آية الحمد ; وجميع ما قيل إلى هذا يرجع ، فلا معنى لتعديد الأقوال والله المستعان .وفي هذه الآية رد على القدرية والمعتزلة والإمامية ، لأنهم يعتقدون أن إرادة الإنسان كافية في صدور أفعاله منه ، طاعة كانت أو معصية ; لأن الإنسان عندهم خالق لأفعاله ، فهو غير محتاج في صدورها عنه إلى ربه ; وقد أكذبهم الله تعالى في هذه الآية إذ سألوه الهداية إلى الصراط المستقيم ; فلو كان الأمر إليهم والاختيار بيدهم دون ربهم لما سألوه الهداية ، ولا كرروا السؤال في كل صلاة ; وكذلك تضرعهم إليه في دفع المكروه ، وهو ما [ ص: 146 ] يناقض الهداية حيث قالوا : صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين . فكما سألوه أن يهديهم سألوه ألا يضلهم ، وكذلك يدعون فيقولون : ربنا لا تزغ قلوبنا بعد إذ هديتنا الآية .غير المغضوب عليهم ولا الضاليناختلف في المغضوب عليهم و الضالين من هم ؟ فالجمهور أن المغضوب عليهم اليهود ، والضالين النصارى ; وجاء ذلك مفسرا عن النبي صلى الله عليه وسلم في حديث عدي بن حاتم وقصة إسلامه ، أخرجه أبو داود الطيالسي في مسنده ، والترمذي في جامعه . وشهد لهذا التفسير أيضا قوله سبحانه في اليهود : وباءوا بغضب من الله . وقال : وغضب الله عليهم وقال في النصارى : قد ضلوا من قبل وأضلوا كثيرا وضلوا عن سواء السبيل . وقيل : المغضوب عليهم المشركون . و الضالين المنافقون .وقيل : المغضوب عليهم هو من أسقط فرض هذه السورة في الصلاة ; و الضالين عن بركة قراءتها . حكاه السلمي في حقائقه والماوردي في تفسيره ; وليس بشيء . قال الماوردي : وهذا وجه مردود ، لأن ما تعارضت فيه الأخبار وتقابلت فيه الآثار وانتشر فيه الخلاف ، لم يجز أن يطلق عليه هذا الحكم . وقيل : المغضوب عليهم باتباع البدع ; و الضالين عن سنن الهدى .قلت : وهذا حسن ; وتفسير النبي صلى الله عليه وسلم أولى وأعلى وأحسن . و ( عليهم ) في موضع رفع ، لأن المعنى غضب عليهم . والغضب في اللغة الشدة . ورجل غضوب أي شديد الخلق . والغضوب : الحية الخبيثة لشدتها . والغضبة : الدرقة من جلد البعير يطوى بعضها على بعض ; سميت بذلك لشدتها . ومعنى الغضب في صفة الله تعالى إرادة العقوبة ، فهو صفة ذات ، وإرادة الله تعالى من صفات ذاته ; أو نفس العقوبة ، ومنه الحديث : إن الصدقة لتطفئ غضب الرب فهو صفة فعل .ولا الضالين الضلال في كلام العرب هو الذهاب عن سنن القصد وطريق الحق ; ومنه : ضل اللبن في الماء أي غاب . ومنه : أئذا ضللنا في الأرض أي غبنا بالموت وصرنا ترابا ; قال : [ ص: 147 ]ألم تسأل فتخبرك الديار عن الحي المضلل أين سارواوالضلضلة : حجر أملس يردده الماء في الوادي . وكذلك الغضبة : صخرة في الجبل مخالفة لونه ، قال : أو غضبة في هضبة ما أمنعاقرأ عمر بن الخطاب وأبي بن كعب \" غير المغضوب عليهم وغير الضالين \" وروي عنهما في الراء النصب والخفض في الحرفين ; فالخفض على البدل من ( الذين ) أو من الهاء والميم في ( عليهم ) ; أو صفة للذين والذين معرفة ولا توصف المعارف بالنكرات ولا النكرات بالمعارف ، إلا أن الذين ليس بمقصود قصدهم فهو عام ; فالكلام بمنزلة قولك : إني لأمر بمثلك فأكرمه ; أو لأن ( غير ) تعرفت لكونها بين شيئين لا وسط بينهما ، كما تقول : الحي غير الميت ، والساكن غير المتحرك ، والقائم غير القاعد ، قولان : الأول للفارسي ، والثاني للزمخشري . والنصب في الراء على وجهين : على الحال من الذين ، أو من الهاء والميم في عليهم ، كأنك قلت : أنعمت عليهم لا مغضوبا عليهم . أو على الاستثناء ، كأنك قلت : إلا المغضوب عليهم . ويجوز النصب بأعني ; وحكي عن الخليل .( لا ) في قوله ولا الضالين اختلف فيها ، فقيل هي زائدة ; قاله الطبري . ومنه قوله تعالى : ما منعك ألا تسجد . وقيل : هي تأكيد دخلت لئلا يتوهم أن الضالين معطوف على الذين ، حكاه مكي والمهدوي . وقال الكوفيون : \" لا \" بمعنى غير ، وهي قراءة عمر وأبي ; وقد تقدم .الأصل في الضالين : الضاللين حذفت حركة اللام الأولى ثم أدغمت اللام في اللام فاجتمع ساكنان مدة الألف واللام المدغمة . وقرأ أيوب السختياني : ولا الضألين بهمزة غير ممدودة ; كأنه فر من التقاء الساكنين وهي لغة . حكى أبو زيد قال : سمعت عمرو بن عبيد يقرأ : \" فيومئذ لا يسأل عن ذنبه إنس ولا جأن \" فظننته قد لحن حتى سمعت من العرب : دأبة وشأبة . قال أبو الفتح : وعلى هذه اللغة قول كثير :إذا ما العوالي بالعبيط احمأرتنجز تفسير سورة الحمد ; ولله الحمد والمنة .\n","ar.miqbas":"بدل أو عطف بيان من { الصراط المستقيم } ، وإنما جاء نظم الآية بأسلوب الإبدال أو البيان دون أن يقال : اهدنا صراط الذين أنعمت عليهم المستقيم ، لفائدتين : الأولى : أن المقصود من الطلب ابتداء هو كون المهدى إليه وسيلة للنجاة واضحة سمحة سهلة ، وأما كونها سبيل الذين أنعم الله عليهم فأمر زائد لبيان فضله . الفائدة الثانية : ما في أسلوب الإبدال من الإجمال المعقب بالتفصيل ليتمكن معنى الصراط للمطلوب فضل تمكن في نفوس المؤمنين الذين لقنوا هذا الدعاء فيكون له من الفائدة مثل ما للتوكيد المعنوي ، وأيضاً لما في هذا الأسلوب من تقرير حقيقة هذا الصراط وتحقيق مفهومه في نفوسهم فيحصل مفهومه مرتين فيحصل له من الفائدة ما يحصل بالتوكيد اللفظي واعتبار البدلية مساوٍ لاعتباره عطف بيان لا مزية لأحدهما على الآخر خلافاً لمن حاول التفاضل بينهما ، إذ التحقيق عندي أن عطف البيان اسم لنوع من البدل وهو البدل المطابق وهو الذي لم يفصح أحد من النحاة على تفرقة معنوية بينهما ولا شاهداً يعين المصير إلى أحدهما دون الآخر .قال في «الكشاف» : «فإن قلت ما فائدة البدل؟ قلت فائدته التوكيد لما فيه من التثنية والتكرير» ا ه فأفهم كلامه أن فائدة الإبدال أمران يرجعان إلى التوكيد وهما ما فيه من التثنية أي تكرار لفظ البدل ولفظ المبدل منه وعنى بالتكرير ما يفيده البدل عند النحاة من تكرير العامل وهو الذي مهد له في صدر كلامه بقوله : «وهو في حكم تكرير العامل كأنه قيل : اهدنا الصراط المستقيم اهدنا صراط الذين ، وسماه تكريراً لأنه إعادة للفظ بعينه ، بخلاف إعادة لفظ المبدل منه فإنه إعادة له بما يتحد مع ما صدقه فلذلك عبر بالتكرير وبالتثنية ، ومراده أن مثل هذا البدل وهو الذي فيه إعادة لفظ المبدل منه يفيد فائدة البدل وفائدة التوكيد اللفظي ، وقد علمت أن الجمع بين الأمرين لا يتأتى على وجه معتبر عند البلغاء إلا بهذا الصوغ البديع .وإن إعادة الاسم في البدل أو البيان لِيُبنى عليه ما يُراد تعلقه بالاسم الأول أسلوبٌ بهيج من الكلام البليغ لإشعار إعادة اللفظ بأن مدلولَه بمحلِّ العناية وأنه حبيب إلى النفس ، ومثله تكرير الفعل كقوله تعالى : { وإذا مروا باللغو مروا كراماً } [ الفرقان : 72 ] وقوله : { ربنا هؤلاء الذين أغوينا أغويناهم كما غوينا } [ القصص : 63 ] فإن إعادة فعل { مروا } وفعل { أغويناهم } وتعليق المتعلِّق بالفعل المعاد دون الفعل الأول تَجِدُ له من الروعة والبهجة ما لا تجده لتعليقه بالفعل الأول دون إعادة ، وليست الإعادة في مثله لمجرد التأكيد لأنه قد زيد عليه ما تعلق به . قال ابن جني في «شرح مشكل الحماسة» عند قول الأحوص :فإذَا تزولُ تزول عن مُتَخَمِّطٍ ... تُخْشَى بَوَادِرُه على الأَقرانِمحالٌ أن تقول إذا قُمتَ قُمتَ وإذا أقْعُدُ أقعد لأنه ليس في الثاني غير ما في الأول وإنما جاز أن يقول فإذَا تزولُ تزوللِ لما اتصل بالفعل الثاني من حَرْف الجر المفادة منه الفائدةُ ، ومثله قول الله تعالى : { هؤلاء الذين أغوينا أغويناهم كما غوينا } وقد كان أبو علي ( يعني الفارسي ) امتنع في هذه الآية مما أخذناه ا ه .قلت ولم يتضح توجيه امتناع أبي علي فلعله امتنع من اعتبار { أغويناهم } بدلاً من { أغوينا } وجعله استئنافاً وإن كان المآل واحداً . وفي استحضار المنعم عليهم بطريق الموصول ، وإسناد فعل الإنعام عليهم إلى ضمير الجلالة ، تنويه بشأنهم خلافاً لغيرهم من المغضوب عليهم والضالين .ثم إن في اختيار وصف الصراط المستقيم بأنه صراط الذين أنعمتَ عليهم دون بقية أوصافه تمهيداً لبساط الإجابة فإن الكريم إذا قلت له أعطني كما أعطيتَ فلاناً كان ذلك أَنْشَطَ لكرمه ، كما قرره الشيخ الجد قدس الله سره في قوله صلى الله عليه وسلم «كما صليتَ على إبراهيم» ، فيقول السائلون : إهدنا الصراط المستقيم الصراط الذين هديت إليه عبيد نعمك مع ما في ذلك من التعريض بطلب أن يكونوا لاحقين في مرتبة الهدى بأولئك المنعم عليهم ، وتهمماً بالاقتداء بهم في الأخذ بالأسباب التي ارتقوا بها إلى تلك الدرجات ، قال تعالى : { لقد كان لكم فيهم أسوة حسنة } [ الممتحنة : 6 ] ، وتوطئةً لما سيأتي بعد من التبرىء من أحوال المغضوب عليهم والضالين فتضمن ذلك تفاؤلاً وتعوذاً .والنعمة بالكسر وبالفتح مشتقة من النعيم وهو راحة العيش ومُلائم الإنسان والترفه ، والفعل كسمع ونصر وضرب . والنعمة الحالة الحسنة لأن بناء الفعلة بالكسر للهيئات ومتعلق النعمة اللذاتُ الحسية ثم استعملت في اللذات المعنوية العائدة بالنفع ولو لم يحس بها صاحبها . فالمراد من النعمة في قوله : { الذين أنعمت عليهم } النعمةُ التي لم يَشُبْها ما يكدرها ولا تكون عاقبتها سُوأَى ، فهي شاملة لخيرات الدنيا الخالصة من العواقب السيئة ولخيرات الآخرة ، وهي الأهم ، فيشمل النعم الدنيوية الموهوبيَّ منها والكسبيَّ ، والرُّوحانيَّ والجثماني ، ويشمل النعم الأخروية . والنعمة بهذا المعنى يرجع معظمها إلى الهداية ، فإن الهداية إلى الكسبي من الدنيويّ وإلى الأخرويّ كلِّه ظاهرة فيها حقيقة الهداية ، ولأن الموهوب في الدنيا وإن كان حاصلاً بلا كسب إلا أن الهداية تتعلق بحسن استعماله فيما وُهب لأجله .فالمراد من المنعم عليهم الذين أفيضت عليهم النعم الكاملة ولا تخفى تمام المناسبة بين المنعم عليهم وبين المهديين حينئذٍ فيكون في إبدال { صراط الذين } من { الصراط المستقيم } معنى بديع وهو أن الهداية نعمة وأن المنعَم عليهم بالنعمة الكاملة قد هُدوا إلى الصراط المستقيم . والذين أنعم الله عليهم هم خيار الأمم السابقة من الرسل والأنبياء الذين حصلت لهم النعمة الكاملة . وإنما يلتئم كون المسؤول طريق المنعم عليهم فيما مضى وكونه هو دينَ الإسلام الذي جاء من بعدُ باعتبار أن الصراط المستقيم جار على سَنن الشرائع الحقة في أصول الديانة وفروع الهداية والتقوى ، فسألوا ديناً قويماً يكون في استقامته كصراط المنعم عليهم فأجيبوا بدين الإسلام ، وقد جمع استقامة الأديان الماضية وزاد عليها ، أو المراد من المنعم عليهم الأنبياءُ والرسل فإنهم كانوا على حالة أكمل مما كان عليه أممهم ، ولذلك وصف الله كثيراً من الرسل الماضين بوصف الإسلام وقد قال يعقوب لأبنائه :{ فلا تموتن إلا وأنتم مسلمون } [ البقرة : 132 ] ذلك أن الله تعالى رفق بالأمم فلم يبلغ بهم غاية المراد من الناس لعدم تأهلهم للاضطلاع بذلك ولكنه أمر المرسلين بأكمل الحالات وهي مراده تعالى من الخلق في الغاية ، ولْنمثل لذلك بشرب الخمر فقد كان القدرُ غيرُ المسكر منه مباحاً وإنما يحرم السُّكر أوْ لا يحرم أصلاً غير أن الأنبياء لم يكونوا يتعاطون القليل من المسكرات وهو المقدار الذي هدى الله إليه هذه الأمة كلها ، فسواء فسرنا المنعم عليهم بالأنبياء أو بأفضل أَتْبَاعهم أو المسلمين السابقين فالمقصد الهداية إلى صراط كامل ويكون هذا الدعاء محمولاً في كل زمان على ما يناسب طرق الهداية التي سبقت زمانَه والتي لم يبلغ إلى نهايتها .والقول في المطلوب من { اهدنا } على هذه التقادير كلها كالقول فيما تقدم من كون { اهدنا } لطلب الحصول أو الزيادة أو الدوام .والدعاء مبني على عدم الاعتداد بالنعمة غير الخالصة ، فإن نعم الله على عباده كلهم كثيرة والكافر منعم عليه بما لا يمترَى في ذلك ولكنها نعم تحفها آلام الفكرة في سوء العاقبة ويعقبها عذاب الآخرة ، فالخلاف المفروض بين بعض العلماء في أن الكافر هل هو منعم عليه خلاف لا طائل تحته فلا فائدة في التطويل بظواهر أدلة الفريقين .{ غَيْرِ المغضوب عَلَيْهِمْ وَلاَ الضآلين } .كلمة غير مجرورة باتفاق القراء العشرة ، وهي صفة للذين أنعمت عليهم ، أو بدل منه والوصف والبدلية سواء في المقصود ، وإنما قدم في «الكشاف» بيان وجه البدلية لاختصار الكلام عليها ليفضي إلى الكلام على الوصفية ، فيورد عليها كيفية صحة توصيف المعرفة بكلمة ( غير ) التي لا تتعرف ، وإلا فإن جعل { غير المغضوب } صفة للذين هو الوجه وكذلك أعربه سيبويه فيما نقل عنه أبو حيان ووجهه بأن البدل بالوصف ضعيف إذ الشأن أن البدل هو عين المبدل منه أي اسم ذات له ، يريد أن معنى التوصيف في { غير } أغلب من معنى ذات أخرى ليست السابقة ، وهو وقوف عند حدود العبارات الاصطلاحية حتى احتاج صاحب «الكشاف» إلى تأويل { غير المغضوب } بالذين سلموا من الغضب ، وأنا لا أظن الزمخشري أراد تأويل غير بل أراد بيان المعنى . وإنما صح وقوع ( غير ) صفة للمعرفة مع قولهم إن غير لتوغلها في الإبهام لا تفيدها الإضافة تعريفاً أي فلا يكون في الوصف بها فائدة التمييز فلا توصف بها المعرفة لأن الصفة يلزم أن تكون أشهر من الموصوف ، فغير وإن كانت مضافة للمعرفة إلا أنها لما تضمنه معناها من الإبهام انعدمت معها فائدة التعريف ، إذ كل شيء سوى المضاف إليه هو غير ، فماذا يستفاد من الوصف في قولك مررت بزيد غير عمرو ، فالتوصيف هنا إما باعتبار كون { الذين أنعمت عليهم } ليس مراداً به فريق معين فكان وزان تعريفه بالصلة وزان المعرف بأل الجنسية المسماة عند علماء المعاني بلام العهد الذهني ، فكان في المعنى كالنكرة وإن كان لفظه لفظ المعرفة فلذلك عرف بمثله لفظاً ومعنى ، وهو { غير المغضوب } الذي هو في صورة المعرفة لإضافته لمعرفة وهو في المعنى كالنكرة لعدم إرادة شيء معين ، وإما باعتبار تعريف غير في مثل هذا لأن غير إذا أريد بها نفي ضد الموصوف أي مساوي نقيضه صارت معرفة ، لأن الشيء يتعرف بنفي ضده نحو عليك بالحركة غير السكون ، فلما كان من أُنعم عليه لا يعاقب كان المعاقب هو المغضوب عليه ، هكذا نقل ابن هشام عن ابن السراج والسيرافي وهو الذي اختاره ابن الحاجب في أماليه على قوله تعالى :{ غير أولي الضرر } [ النساء : 95 ] ونقل عن سيبوبه أن غيراً إنما لم تتعرف لأنها بمعنى المغاير فهي كاسم الفاعل وألْحَقَ بها مِثْلاً وسِوى وحَسب وقال : إنها تتعرف إذا قصد بإضافتها الثبوت . وكأن مآل المذهبين واحد لأن غيراً إذا أضيفت إلى ضد موصوفها وهو ضد واحد أي إلى مساوي نقيضه تعينت له الغيرية فصارت صفة ثابتة له غير منتقلة ، إذ غيرية الشيء لنقيضه ثابتة له أبداً فقولك عليك بالحركة غيرِ السكون هو غير قولك مررت بزيد غيرِ عمرو وقوله : { غير المغضوب عليهم } من النوع الأول .ومن غرض وصف { الذين أنعمتَ عليهم } بأنهم { غير المغضوب عليهم ولا الضالين } التعوذُ مما عرض لأمم أنعم الله عليهم بالهداية إلى صراط الخير بحسب زمانهم بدعوة الرسل إلى الحق فتقلدوها ثم طرأ عليهم سوء الفهم فيها فغيروها وما رعَوْها حق رعايتها ، والتبرُّؤ من أن يكونُوا مثلهم في بَطَر النعمة وسوء الامتثال وفساد التأويل وتغليب الشهوات الدنيوية على إقامة الدين حتى حق عليهم غضب الله تعالى ، وكذا التبرؤ من حال الذين هُدوا إلى صراط مستقيم فما صرفوا عنايتهم للحفاظ على السير فيه باستقامة ، فأصبحوا من الضالين بعد الهداية إذْ أساءوا صفة العلم بالنعمة فانقلبت هدايتهم ضلالاً .والظاهر أنهم لم يحق عليهم غضب الله قبل الإسلام لأنهم ضلوا عن غير تعمد فلم يسبق غضب الله عليهم قديماً واليهود من جملة الفريق الأول ، والنصارى من جملة الفريق الثاني كما يعلم من الاطلاع على تاريخ ظهور الدينين فيهم . وليس يلزم اختصاص أول الوصفين باليهود والثاني بالنصارى فإن في الأمم أمثالَهم وهذا الوجه في التفسير هو الذي يستقيم معه مقام الدعاء بالهداية إلى الصراط المستقيم ولو كان المرادين اليهودية ودين النصرانية لكان الدعاء تحصيلاً للحاصل فإن الإسلام جاء ناسخاً لهما .ويشمل المغضوب عليهم والضالون فِرَق الكفر والفسوق والعصيان ، فالمغضوب عليهم جنس للفرق التي تعمدت ذلك واستخفت بالديانة عن عمد أو عن تأويل بعيد جداً ، والضالون جنس للفِرَق التي أخطأت الدين عن سوء فهم وقلة إصغاء؛ وكلا الفريقين مذموم لأننا مأمورون باتباع سبيل الحق وصرف الجهد إلى إصابته ، واليهود من الفريق الأول والنصارى من الفريق الثاني . وما ورد في الأثر مما ظاهره تفسير المغضوب عليهم باليهود والضالين بالنصارى فهو إشارة إلى أن في الآية تعريضاً بهذين الفريقين اللذين حق عليهما هذان الوصفان لأن كلاً منهما صار عَلَماً فيما أريد التعريض به فيه . وقد تبين لك من هذا أن عطف { ولا الضالين } على { غير المغضوب عليهم } ارتقاء في التعوذ من شر سوء العاقبة لأن التعوذ من الضلال الذي جلب لأصحابه غَضَبَ اللَّهِ لا يغني عن التعوذ من الضلال الذي لم يبلغ بأصحابه تلك الدركات وذلك وجه تقديم { المغضوب عليهم } على { ولا الضالين } ، لأن الدعاء كان بسؤال النفي ، فالتدرج فيه يحصل بنفي الأضعف بعد نفي الأقوى ، مع رعاية الفواصل .والغضب المتعلق بالمغضوب عليهم هو غضبُ اللَّهِ . وحقيقة الغضب المعروففِ في الناس أنه كيفية تعرض للنفس يتبعها حركة الروح إلى الخارج وثورانها فتطلب الانتقام ، فالكيفيةُ سبب لطلب الانتقام وطلب الإنتقام سبب لحصول الانتقام . والذي يظهر لي أن إرادة الانتقام ليست من لوازم ماهية الغضب بحيث لا تنفك عنه ولكنها قد تكون من آثاره ، وأن الغضب هو كيفية للنفس تعرض من حصول ما لا يلائمها فتترتب عليه كراهية الفعل المغضوب منه وكراهية فاعله ، ويلازمه الإعراض عن المغضوب عليه ومعاملتُه بالعُنف وبقطع الإحسان وبالأذى وقد يفضى ذلك إلى طلب الانتقام منه فيختلف الحد الذي يثور عند الغضب في النفس باختلاف مراتب احتمال النفوس للمنافرات واختلاف العادات في اعتبار أسبابه ، فلعل الذين جعلوا إرادة الانتقام لازمة للغضب بنَوا على القوانين العربية .وإذْ كانت حقيقة الغضب يستحيل اتصاف الله تعالى بها وإسنادُها إليه على الحقيقة للأدلة القطعية الدالة على تنزيه الله تعالى عن التغيرات الذاتية والعرضية ، فقد وجب على المؤمن صَرف إسناد الغضب إلى الله عن معناه الحقيقي ، وطريقةُ أهل العلم والنظر في هذا الصرف أن يصرف اللفظ إلى المجاز بعلاقة اللزوم أو إلى الكناية باللفظ عن لازم معناه فالذي يكون صفة لله من معنى الغضب هو لازمه ، أعني العقاب والإهانة يوم الجزاء واللعنة أي الإبعاد عن أهل الدين والصلاح في الدنيا أو هو من قبيل التمثيلية .وكان السلف في القرن الأول ومنتصففِ القرن الثاني يمسكون عن تأويل هذه المتشابهات لما رأوا في ذلك الإمساك من مصلحة الاشتغال بإقامة الأعمال التي هي مراد الشرع من الناس فلما نشأ النظر في العلم وطَلَبُ معرفة حقائق الأشياء وحدَث قول الناس في معاني الدين بما لا يلائم الحق ، لم يجد أهل العلم بداً من توسيع أساليب التأويل الصحيح لإفهام المسلم وكبت الملحد ، فقام الدين بصنيعهم على قواعِده ، وتميز المخلص له عن ماكِره وجاحده .وكلٌّ فيما صنعوا على هُدى . وبعد البياننِ لا يُرْجَع إلى الإجمال أبداً . وما تأوَّلوه إلا بما هو معروف في لسان العرب مفهوم لأهله .فغضَبُ الله تعالى على العموم يرجع إلى معاملته الحائدين عن هديه العاصين لأوامره ويترتب عليه الانتقام وهو مراتب أَقصاها عقاب المشركين والمنافقين بالخلود في الدرك الأسفل من النار ودون الغضب الكراهية فقد ورد في الحديث : «ويَكْرَهُ لكم قيلَ وقال وكثرةَ السؤال» ، ويقابلهما الرضى والمحبة وكل ذلك غيرُ المشيئة والإرادةِ بمعنى التقدير والتكويننِ ، { ولا يرضى لعباده الكفر وإن تشكروا يرضه لكم } [ الزمر : 7 ] { ولو شاء ربك ما فعلوه } [ الأنعام : 112 ] { ولو شاء ربك لآمن من في الأرض كلهم جميعاً } [ يونس : 99 ] وتفصيل هذه الجملة في علم الكلام .واعلم أن الغضب عند حكماء الأخلاق مبدأ من مجموع الأخلاق الثلاثة الأصلية التي يعبر عن جميعها بالعدالة وهي : الحكمة والعفة والشجاعة ، فالغضب مبدأ الشجاعة إلا أن الغضب يعبر به عن مبدأ نفساني لأَخلاق كثيرة متطرفةٍ ومعتدلة فيلقِّبون بالقوة الغضبية ما في الإنسان من صفات السَّبُعِية وهي حب الغلبة ومن فوائدها دفع ما يضره ولها حد اعتدال وحد انحراف فاعتدالها الشجاعة وكِبَر الهمة ، وثباتُ القلب في المخاوف ، وانحرافُها إما بالزيادة فهي التهور وشدة الغضب من شيء قليل والكبرُ والعُجب والشراسةُ والحِقْد والحَسَد والقَساوة ، أو بالنقصان فالجبن وخور النفس وصغر الهمة فإذا أُطلق الغضب لغةً انصرف إلى بعض انحراف الغضبية ، ولذلك كان من جوامع كَلِم النبيء صلى الله عليه وسلم \" أن رجلاً قال له أوصني قال : لا تغضب فكرَّرَ مِراراً فقال : لا تغضب \" رواه الترمذي . وسُئل بعض ملوك الفرس بم دام ملككم؟ فقال : لأنا نعاقب على قدر الذنب لا على قدر الغضب . فالغضب المنهى عنه هو الغضب للنَّفس لأنه يصدر عنه الظلم والعدوان ، ومن الغضب محمودٌ وهو الغضب لحماية المصالح العامة وخصوصاً الدينية وقد ورد أن النبيء كان لا يغضب لنفسه فإذا انتهكت حرمة من حرمات الله غضب لله .وقوله : { ولا الضالين } معطوف على { المغضوب عليهم } كما هو متبادر ، قال ابن عطية ، قال مكي ابن أبي طالب إن دخول ( لا ) لدفع توهم عطف ( الضالين ) على ( الذين أَنْعَم عليهم ) ، وهو توجيه بعيد فالحق أن ( لا ) مزيدة لتأكيد النفي المستفاد من لفظ ( غير ) على طريقة العرب في المعطوف على ما في حيز النفي نحو قوله :{ أن تقولوا ما جاءنا من بشير ولا نذير } [ المائدة : 19 ] وهو أسلوب في كلام العرب . وقال السيد في «حواشي الكشاف» لئلا يتوهم أن المنفي هو المجموع فيجوِّز ثبوتَ أحدهما ، ولما كانت غير في معنى النفي أجريت إعادة النفي في المعطوف عليها ، وليست زيادة ( لا ) هنا كزيادتها في نحو : { ما منعك أن لا تسجد إذ أمرتك } [ الأعراف : 12 ] كما توهمه بعض المفسرين؛ لأن تلك الزيادة لفظية ومعنوية لأن المعنى على الإثبات والتي هنا زيادة لفظية فحسب والمعنى على النفي .والضلال سلوك غير الطريق المراد عن خطإٍ سواء علم بذلك فهو يتطلب الطريق أم لم يعلم ، ومنه ضالة الإبل ، وهو مقابل الهُدى وإطلاقُ الضال على المخطىء في الدين أو العلم استعارة كما هنا . والضلال في لسان الشرع مقابل الاهتداء والاهتداء هو الإيمان الكامل والضلال ما دون ذلك ، قالوا وله عَرض عريض أدناه ترك السنن وأقصاه الكفر . وقد فسرنا الهداية فيما تقدم أنها الدلالة بلطف ، فالضلال عدم ذلك ، ويطلق على أقصى أنواعه الختمُ والطبعُ والأَكِنَّةُ .والمراد من المغضوب عليهم والضالين جنسَا فِرَق الكفر ، فالمغضوب عليهم جنس للفِرق التي تعمدت ذلك واستحقت بالديانة عن عمد وعن تأويل بعيد جداً تَحمِل عليه غلبة الهوى ، فهؤلاء سلكوا من الصراط الذي خط لهم مسالك غير مستقيمة فاستحقوا الغضب لأنهم أخطأوا عن غير معذرة إذ ما حملهم على الخطأ إلا إيثار حظوظ الدنيا . 6والضالون جنس للفِرق الذين حرفوا الديانات الحق عن عمد وعن سوء فهم وكلا الفريقين مذموم معاقب لأن الخلق مأمورون باتباع سبيل الحق وبذل الجهد إلى إصابته والحذر من مخالفة مقاصده .وإذ قد تقدم ذكر المغضوب عليهم وعلم أن الغضب عليهم لأنهم حادُوا عن الصراط الذي هُدوا إليه فحرموا أنفسهم من الوصول به إلى مرضاة الله تعالى ، وأن الضالين قد ضلوا الصراط ، فحصل شِبْه الاحتباك وهو أن كلا الفريقين نال حظاً من الوصفين إلا أن تعليق كل وصف على الفريق الذي علق عليه يرشد إلى أن الموصوفين بالضالين هم دون المغضوب عليهم في الضلال فالمراد المغضوب عليهم غضباً شديداً لأن ضلالهم شنيع . فاليهود مَثَلٌ للفريق الأول والنصارى من جملة الفريق الثاني كما ورد به الحديث عن النبيء صلى الله عليه وسلم في «جامع الترمذي» وحسَّنه . وما ورد في الأثر من تفسير المغضوب عليهم باليهود والضالين بالنصارى ، فهو من قبيل التمثيل بأشْهَر الفرق التي حق عليها هذان الوصفَاننِ ، فقد كان العرب يعرفون اليهود في خيبر والنضير وبعض سكان المدينة وفي عرب اليمن . وكانوا يعرفون نصارى العرب مثل تغلب وكلب وبعض قضاعة ، وكل أولئك بدلوا وغيروا وتنكبوا عن الصراط المستقيم الذي أرشدهم الله إليه وتفرقوا في بنيات الطرق على تفاوت في ذلك .فاليهود تمردوا على أنبيائهم وأحبارهم غير مرة وبدلوا الشريعة عمداً فلزمهم وصفُ المغضوب عليهم وعَلِقَ بهم في آيات كثيرة .والنصارى ضلوا بعدَ الحواريين وأساءوا فهم معنى التقديس في عيسى عليه السلام فزعموه ابن الله على الحقيقة قال تعالى : { قل يا أهل الكتاب لا تغلوا في دينكم غير الحق ولا تتبعوا أهواء قوم قد ضلوا من قبل وأضلوا كثيراً وضلوا عن سواء السبيل } [ المائدة : 77 ] . وفي وصف الصراط المسؤول في قوله : { اهدنا الصراط المستقيم } بالمستقيم إيماء إلى أن الإسلام واضح الحجة قويم المحجة لا يَهْوى أهلُه إلى هُوة الضلالة كما قال تعالى : { قل إنني هداني ربي إلى صراط مستقيم ديناً قيماً } [ الأنعام : 161 ] وقال : { وأن هذا صراطي مستقيماً فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله } [ الأنعام : 153 ] ، على تفاوت في مراتب إصابة مراد الله تعالى ولذلك قال النبيء صلى الله عليه وسلم « من اجتهد وأصاب فله أجران ومن اجتهد وأخطأ فله أجر واحد » ولم يترك بيانُ الشريعة مجاريَ اشتباه بين الخلاففِ الذي تحيط به دائرة الإسلام والخلاففِ الذي يَخرج بصاحبه عن محيط الإسلام قال تعالى : { إنك على الحق المبين } [ النمل : 79 ] .واختلف القراء في حركة هاء الضمير من قوله : { أنعمت عليهم } ، وقوله : { غير المغضوب عليهم } ، وما ضاهاهما من كل ضمير جمع وتثنية مذكر ومؤنث للغائب وقع بعد ياء ساكنة ، فالجمهور قرأوها بكسر الهاء تخلصاً من الثقل لأن الهاء حاجز غير حصين فإذا ضمت بعد الياء فكأن ضمتها قد وليت الكسرة أو الياء الساكنة وذلك ثقيل وهذه لغة قيس وتميم وسعد بن بكر . وقرأ حمزة عليهم وإليهم ولديهم فقط بضم الهاء وما عداها بكسر الهاء نحو إليهما وصياصيهم وهي لغة قريش والحجازيين . وقرأ يعقوب كل ضمير من هذا القبيل مما قبل الهاء فيه ياء ساكنة بضم الهاء . وقد ذكرنا هذا هنا فلا نعيد ذكره في أمثاله وهو مما يرجع إلى قواعد علم القراءات في هاء الضمير .واختلفوا أيضاً في حركة ميم ضمير الجمع الغائب المذكر في الوصل إذا وقعت قبل متحرك فالجمهور قرأوا : { عليهم غير المغضوب عليهم } بسكون الميم وقرأ ابن كثير وأبو جعفر وقالون في رواية عنه بضمة مشبعة : { غير المغضوب عليهم } وهي لغة بعض العرب وعليها قول لبيد :وهمو فوارسها وهمْ حكامها ... فجاء باللغتين ، وقرأ ورش بضم الميم وإشباعها إذا وقع بعد الميم همز دون نحو : { غير المغضوب عليهم } وأجمع الكل على إسكان الميم في الوقف\n","ar.waseet":"وجملة { صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ } بدل من الصراط المستقيم.ولم يقل: اهدنا صراط الذين أنعمت عليهم مستغنياً عن ذكر الصراط المستقيم، ليدل أن صراط هؤلاء المنعم عليهم هو الصراط المستقيم.وقال: { صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ } ولم يقل صراط الأنبياء أو الصالحين، ليدل على أن الدين فى ذاته نعمة عظيمة، ويكفى للدلالة على عظمتها إسنادها إليه - تعالى - فى قوله: { أَنْعَمْتَ عَلَيْهِمْ } لأن المراد بالإِنعام هنا - على الراجح - الإِنعام الدينى. فالمنعم عليهم هم من عرفوا الحق فتمسكوا به، وعرفوا الخير فعملوا به.قال بعض العلماء: (وإنما اختار فى البيان أن يضيف الصراط إلى المنعم عليهم لمعنيين:أولهما: هو إبراز نفسية المحب المخلص، وأنه يكون شديد الاحتياط دقيق التحرى عن الطريق الموصل إلى ساحة الرضا فى ثقة تملأ نفسه، وتفعم قلبه، ولا يجد فى مثل هذا المقام ما يملأ نفسه ثقة إلا أن يبين الطريق، بأنه الطريق الذى وصل بالسير عليه من قبله الأنبياء والصديقون والشهداء والصالحون.وثانيهما: أن من خواطر المؤمل فى نعيم ربه أن يكون تمام أنسه فى رفقة من الناس صالحين، وصحب منهم محسنين).وقوله - تعالى - { غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم } بدل من { ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ } وأتى فى وصف الإِنعام بالفعل المسند إلى الله - تعالى - فقال: { أنعمت عليهم } فى وصف الغضب باسم المفعول فقال: { غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم } وفى ذلك تعليم لأدب جميل، وهو أن الإِنسان يجمل به أن يسند أفعال الإِحسان إلى الله، ويتحامى أن يسند إليه أفعال العقاب والابتلاء، وإن كان كل من الإِحسان والعقاب صادراً منه، ومن شواهد هذا قوله - تعالى - حكاية عن مؤمنى الجن{ وَأَنَّا لاَ نَدْرِيۤ أَشَرٌّ أُرِيدَ بِمَن فِي ٱلأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَداً }وحرف (لا) فى قوله { وَلاَ ٱلضَّآلِّينَ } جئ به لتأكيد معنى النفى المستفاد من كلمة غير. والمراد بالمغضوب عليهم اليهود. وبالضالين النصارى. وقد ورد هذا التفسير عن النبى صلى الله عليه وسلم فى حديث رواه الإِمام أحمد فى مسنده وابن حبان فى صحيحه.ومن المفسرين من قال بأن المراد بالمغضوب عليهم من فسدت إرادتهم حيث علموا الحق ولكنهم تركوه عناداً وجحودا، وأن المراد بالضالين من فقدوا العلم فهم تائهون فى الضلالات دون أن يهتدوا إلى طريق قويم.وقدم المغضوب عليهم على الضالين، لأن معنى المغضوب عليهم كالضد لمعنى المنعم عليهم، ولأن المقابلة بينهما أوضح منها بين المنعم عليهم والضالين، فكان جديراً بأن يوضع فى مقابلته قبل الضالين.قال العلماء: ويستحب لمن يقرأ الفاتحة أن يقول بعدها (آمين) ومعناه اللهم استجب وليس هذا اللفظ من القرآن بدليل أنه لم يثبت فى المصاحف والدليل على استحباب التأمين ما رواه الإِمام أحمد وأبو داود والترمذى عن وائل بن حجر قال: سمعت النبى صلى الله عليه وسلم قرأ { غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم وَلاَ ٱلضَّآلِّينَ } فقال: (آمين) مد بها صوته.وفى الصحيحين عن أبى هريرة أن رسول الله صلى الله عليه وسلم قال: \" إذا أمن الإِمام فأمنوا، فإن من وافق تأمينه تأمين الملائكة غفر الله له ما تقدم من ذنبه \".هذا، وقد أفاض العلماء فى الحديث عما اشتملت عليه سورة الفاتحة من آداب وعقائد وعبادات وأحكام، ومن ذلك قول ابن كثير.(اشتملت هذه السورة الكريمة، وهى سبع آيات - على حمد الله وتمجيده والثناء عليه بذكر أسمائه الحسنى المستلزمة لصفاته العليا، وعلى ذكر المعاد وهو يوم الدين، وعلى إرشاد عبيده إلى سؤاله والتضرع إليه والتبرى من حولهم وقوتهم، إلى إخلاص العبادة له وتوحيده بالألوهية، وتنزيهه عن أن يكون له شريك أو نظير، وإلى سؤالهم إياه الهداية إلى الصراط المستقيم، وهو الدين القويم وتثبيتهم عليه، واشتملت على الترغيب فى الأعمال الصالحة ليكونوا مع أهلها يوم القيامة، والتحذير من مسالك الباطل لئلا يحشروا مع سالكيها يوم القيامة، وهم المغضوب عليهم والضالون).وقال بعض العلماء: سورة الفاتحة مشتملة على أربعة أنواع من العلوم هى مناط الدين.أحدها: علم الأصول وإليه الإِشارة بقوله { ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَالَمِينَ ٱلرَّحْمـٰنِ ٱلرَّحِيمِ } ، ومعرفة النبوات وإليه الاشارة بقوله: { أَنْعَمْتَ عَلَيْهِمْ } ومعرفة المعاد وإليه الاشارة بقوله { مَـٰلِكِ يَوْمِ ٱلدِّينِ }.وثانيها: علم الفروع وأعظمه العبادات وإليه الإِشارة بقوله { إِيَّاكَ نَعْبُدُ }.وثالثها: علم الأخلاق، وإليه الإِشارة بقوله { وَإِيَّاكَ نَسْتَعِينُ ٱهْدِنَا ٱلصِّرَاطَ ٱلْمُسْتَقِيمَ }.ورابعها: علم القصص والأخبار عن الأمم السابقة السعداء منهم والأشقياء، وهو المراد بقوله { صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِم وَلاَ ٱلضَّآلِّينَ }.وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم.\n","ar.baghawi":"قوله: {صراط الذين أنعمت عليهم}: أي مننت عليهم بالهداية والتوفيق، قال عكرمة: \"مننت عليهم بالثبات على الإيمان والاستقامة وهم الأنبياء عليهم السلام\"، وقيل: هم كل من ثبته الله على الإيمان من النبيين والمؤمنين الذين ذكرهم الله تعالى في قوله: {فأولئك مع الذين أنعم الله عليهم من النبيين}[69- النساء]الآية، وقال ابن عباس: \"هم قوم موسى وعيسى عليهما السلام قبل أن يغيروا دينهم\".وقال عبد الرحمن بن زيد: \"هم النبي صلى الله عليه وسلم ومن معه\".وقال أبو العالية: \"هم آل الرسول صلى الله عليه وسلم وأبو بكر وعمر رضي الله عنهما وأهل بيته\".وقال شهر بن حوشب: \"هم أصحاب رسول الله صلى الله عليه وسلم وأهل بيته\".قرأ حمزة: (عليهم) و(لديهم) و(إليهم) بضم هاءاتها، ويضم يعقوب كل هاء قبلها ياء ساكنة تثنية وجمعاً إلا قوله: {بين أيديهن وأرجلهن} [12 - الممتحنة] وقرأ الآخرون بكسرهما، فمن ضم الهاء ردها إلى الأصل لأنها مضمومة عند الانفراد، ومن (كسرها) فلأجل الياء الساكنة والكسرة أخت الياء، وضم ابن كثير وأبو جعفر كل ميم جمعا مشبعاً في الوصل إذا لم يلقها ساكن فإن لقيها ساكن فلا يشبع، ونافع يخير،ويضم ورش عند ألف القطع، فإذا تلقته ألف وصل - وقبل الهاء كسر أو ياء ساكنة - ضم الهاء والميم حمزة و الكسائي وكسرهما أبو عمرو وكذلك يعقوب إذا انكسر ما قبله والآخرون يقرؤون بضم الميم وكسر الهاء في الكل لأجل الياء أو لكسر ما قبلها وضم الميم على الأصل.قوله تعالى: {غير المغضوب عليهم} يعني غير صراط الذين غضبت عليهم، والغضب: هو إرادة الانتقام من العُصاة، وغضب الله تعالى لا يلحق عُصاة المؤمنين إنما يلحق الكافرين.{ولا الضالين}: أي وغير الضالين عن الهدى.وأضل الضلال الهلاك والغيبوبة، يقال: ضل الماء في اللبن إذا هلك وغاب.و\"غير\" ها هنا بمعنى لا، ولا بمعنى غير ولذلك جاز العطف كما يقال: فلان غير محسن ولا مجمل. فإذا كان غير بمعنى سوى فلا يجوز العطف عليها بلا، ولا يجوز في الكلام: عندي سوى عبد الله ولا زيد. وقرأ عمر بن الخطاب رضي الله عنه: (صراط من أنعمت عليهم غير المغضوب عليهم وغير الضالين).وقيل: المغضوب عليهم: هم اليهود، والضالون: هم النصارى؛ لأن الله تعالى حكم على اليهود بالغضب فقال: {من لعنه الله وغضب عليه} [60 - المائدة]، وحَكَم على النصارى بالضلال فقال: {ولا تتبعوا أهواء قوم قد ضلوا من قبل} [77 - المائدة].وقال سهل بن عبد الله: \"غير المغضوب عليهم بالبدعة ولا الضالين عن السنة\".والسنة للقارئ أن يقول بعد فراغه من قراءة الفاتحة (( آمين )) بسكتة مفصولة عن الفاتحة وهومخفف ويجوز (عند النحويين) ممدوداً ومقصوراً ومعناه: اللهم اسمع واستجب.وقال ابن عباس وقتادة: \"معناه كذلك يكون\". وقال مجاهد: \"هو اسم من أسماء الله تعالى\".وقيل: هو طابع الدعاء.وقيل: هو خاتم الله على عباده يدفع به الآفات عنهم كخاتم الكتاب يمنعه من الفساد وظهور ما فيه.أخبرنا الإمام أبو علي الحسين بن محمد القاضي وأبو حامد أحمد بن عبد الله الصالحي قالا أنا أبو بكر أحمد بن حسن الحيري أنا أبو علي محمد بن أحمد بن محمد بن معقل الميداني ثنا محمد بن يحيى ثنا عبد الرزاق أنا معمر عن الزهري عن ابن المسيب  عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: \"إذا قال الإمام {غير المغضوب عليهم ولا الضالين} فقولوا: (آمين) فإن الملائكة تقول آمين وإن الإمام يقول آمين فمن وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه\" [صحيح].\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/7.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/7.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/7.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":29,"letters":262,"size":"254KB","priority":1,"commonlyRead":true}}