{"chapter":61,"name":{"arabic":"سورة 61","transliteration":"Chapter 61","translation":"Chapter 61","revelation":"unknown"},"revelation":"unknown","verses":14,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","transliteration":"Sabbaha lillaahi maa fisamaawaati wa maa fil ardi wa huwal 'Azeezul Hakeem","translations":{"en.ahmedali":"ALL THAT IS in the heavens and the earth sings the praises of God. He is all-mighty and all-wise.","en.ahmedraza":"All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah; and He only is the Most Honourable, the Wise.","en.arberry":"All that is in the heavens and the earth magnifies God; He is the All-mighty; the All-wise.","en.asad":"ALL THAT IS in the heavens and all that is on earth extols God's limitless glory: for He alone is almighty, truly wise!","en.daryabadi":"Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah. And He is the Mighty, the Wise.","en.hilali":"Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the All-Mighty, the All-Wise.","en.pickthall":"All that is in the heavens and all that is in the earth glorifieth Allah, and He is the Mighty, the Wise.","en.qaribullah":"All that is in the heavens and earth exalt Allah. He is the Almighty, the Wise.","en.sahih":"Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise.","en.sarwar":"All that is in the heavens and the earth glorify God. He is the Majestic and All-wise.","en.yusufali":"Whatever is in the heavens and on earth, let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise.","en.maududi":"All that is in the heavens and all that is on earth extols Allah's glory. He is the Most Mighty, the Most Wise.","en.shakir":"Whatever is in the heavens and whatever is in the earth declares the glory of Allah; and He is the Mighty, the Wise.","en.itani":"Everything in the heavens and the earth praises God. He is the Almighty, the Wise.","en.mubarakpuri":"Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the Almighty, the All-Wise.","en.qarai":"Whatever there is in the heavens and the earth glorifies Allah, and He is the All-mighty, the All-wise.","en.wahiduddin":"Everything in the heavens and earth glorifies God -- He is the Almighty, the Wise."},"tafsir":{"ar.muyassar":"نزَّه الله عن كل ما لا يليق به كلُّ ما في السموات وما في الأرض، وهو العزيز الذي لا يغالَب، الحكيم في أقواله وأفعاله.","ar.jalalayn":"«سبح لله ما في السماوات وما في الأرض» أي نزهه فاللام مزيدة وجيء بما دون من تغليبا للأكثر «وهو العزيز» في ملكه «الحكيم» في صنعه.","ar.qurtubi":"سورة الصف وهي أربع عشرة آية .مدنية في قول الجميع ، فيما ذكر الماوردي . وقيل : إنها مكية ، ذكره النحاس عن ابن عباس .بسم الله الرحمن الرحيمسبح لله ما في السماوات وما في الأرض وهو العزيز الحكيمتقدم .\n","ar.miqbas":"سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1)مناسبة هذه الفاتحة لما بعدها من السورة بيان أن الكافرين محقوقون بأن تقاتلوهم لأنهم شذوا عن جميع المخلوقات فلم يسبحوا الله ولم يصفوه بصفات الكمال إذ جعلوا له شركاء في الإلهية . وفيه تعريض بالذين أخلفوا ما وعدوا بأنهم لم يؤدُّوا حق تسبيح الله ، لأن الله مستحق لأن يوفّى بعهده في الحياة الدنيا وأن الله ناصر الذين آمنوا على عدوّهم .وتقدم الكلام على نظير قوله : { سبح لله } إلى { الحكيم } في أول سورة الحشر وسورة الحديد .وفي إجراء وصف { العزيز } عليه تعالى هنا إيماء إلى أنه الغالب لعدوّه فما كان لكم أن تَرهَبُوا أعداءه فتفرّوا منهم عند اللقاء .وإجراء صفة { الحكيم } إن حملت على معنى المتصف بالحكمة أن الموصوف بالحكمة لا يأمركم بجهاد العدوّ عبثاً ولا يخليهم يغلبونكم . وإن حملت على معنى المُحكِم للأمور فكذلك .\n","ar.waseet":"افتتحت سورة \" الصف \" - كما افتتحت قبلها سورة الحديد والحشر بتنزيه الله - تعالى - عن كل مالا يليق به .أى : نزه الله - تعالى - وقدسه ، جميع ما فى السموات وجميع ما فى الأرض من مخلوقات ، وهو - عز وجل - ( العزيز ) الذى لا يغلبه غالب ( الحكيم ) فى كل أقواله وأفعاله .\n","ar.baghawi":"مدنية\"سبح لله ما في السموات وما في الأرض وهو العزيز الحكيم\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5164.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5164.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5164.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ","transliteration":"Yaa ayyuhal lazeena aamanoo lima taqooloona maa laa taf'aloon","translations":{"en.ahmedali":"O you who believe, why do you profess what you do not practise?","en.ahmedraza":"O People who Believe! Why do you preach what you do not practice?","en.arberry":"O you who believe, wherefore do you say what you do not?","en.asad":"O YOU who have attained to faith! Why do you say one thing and do another?","en.daryabadi":"O ye who believe! wherefore say ye that which ye do not?","en.hilali":"O you who believe! Why do you say that which you do not do?","en.pickthall":"O ye who believe! Why say ye that which ye do not?","en.qaribullah":"Believers, why do you say what you never do?","en.sahih":"O you who have believed, why do you say what you do not do?","en.sarwar":"Believers, why do you preach what you do not practice?","en.yusufali":"O ye who believe! Why say ye that which ye do not?","en.maududi":"Believers, why do you profess that which you do not practise?","en.shakir":"O you who believe! why do you say that which you do not do?","en.itani":"O you who believe! Why do you say what you do not do?","en.mubarakpuri":"O you who believe! Why do you say that which you do not do","en.qarai":"O you who have faith! Why do you say what you do not do?","en.wahiduddin":"Believers! Why do you say one thing and do another."},"tafsir":{"ar.muyassar":"يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، لِمَ تَعِدون وعدًا، أو تقولون قولا ولا تفون به؟! وهذا إنكار على مَن يخالف فعلُه قولَه.","ar.jalalayn":"«يا أيها الذين آمنوا لم تقولون» في طلب الجهاد «ما لا تفعلون» إذ انهزمتم بأُحد.","ar.qurtubi":"قوله تعالى : يا أيها الذين آمنوا لم تقولون ما لا تفعلون روى الدارمي أبو محمد في مسنده أخبرنا محمد بن كثير عن الأوزاعي عن يحيى بن أبي كثير عن أبي سلمة عن عبد الله بن سلام قال : قعدنا نفر من أصحاب رسول الله صلى الله عليه وسلم فتذاكرنا فقلنا : لو نعلم أي الأعمال أحب إلى الله تعالى لعملناه ; فأنزل الله تعالى : سبح لله ما في السماوات وما في الأرض وهو العزيز الحكيم يا أيها الذين آمنوا لم تقولون ما لا تفعلون حتى ختمها . قال عبد الله : فقرأها علينا رسول الله صلى الله عليه وسلم حتى ختمها . قال أبو سلمة : فقرأها علينا ابن سلام . قال يحيى : فقرأها علينا أبو سلمة وقرأها علينا يحيى وقرأها علينا الأوزاعي وقرأها علينا [ ص: 70 ] محمد . وقال ابن عباس قال عبد الله بن رواحة : لو علمنا أحب الأعمال إلى الله لعملناه ; فلما نزل الجهاد كرهوه . وقال الكلبي : قال المؤمنون : يا رسول الله ، لو نعلم أحب الأعمال إلى الله لسارعنا إليها ; فنزلت هل أدلكم على تجارة تنجيكم من عذاب أليم فمكثوا زمانا يقولون : لو نعلم ما هي لاشتريناها بالأموال والأنفس والأهلين ; فدلهم الله تعالى عليها بقوله : تؤمنون بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم الآية . فابتلوا يوم أحد ففروا ; فنزلت تعيرهم بترك الوفاء . وقال محمد بن كعب : لما أخبر الله تعالى نبيه صلى الله عليه وسلم بثواب شهداء بدر قالت الصحابة : اللهم اشهد ! لئن لقينا قتالا لنفرغن فيه وسعنا ; ففروا يوم أحد فعيرهم الله بذلك . وقال مهران والضحاك : نزلت في قوم كانوا يقولون : نحن جاهدنا وأبلينا ولم يفعلوا . وقال صهيب : كان رجل قد آذى المسلمين يوم بدر وأنكاهم فقتلته . فقال رجل : يا نبي الله ، إني قتلت فلانا ، ففرح النبي صلى الله عليه وسلم بذلك . فقال عمر بن الخطاب وعبد الرحمن بن عوف : يا صهيب ، أما أخبرت رسول الله صلى الله عليه وسلم أنك قتلت فلانا ! فإن فلانا انتحل قتله ; فأخبره فقال : أكذلك يا أبا يحيى ؟ قال : نعم والله يا رسول الله ; فنزلت الآية في المنتحل . وقال ابن زيد : نزلت في المنافقين ; كانوا يقولون للنبي صلى الله عليه وسلم وأصحابه : إن خرجتم وقاتلتم خرجنا معكم وقاتلنا ; فلما خرجوا نكصوا عنهم وتخلفوا .هذه الآية توجب على كل من ألزم نفسه عملا فيه طاعة أن يفي بها . وفي صحيح مسلم عن أبي موسى أنه بعث إلى قراء أهل البصرة فدخل عليه ثلاثمائة رجل قد قرءوا القرآن ; فقال : أنتم خيار أهل البصرة وقراؤهم ، فاتلوه ولا يطولن عليكم الأمد فتقسو قلوبكم كما قست قلوب من كان قبلكم . وإنا كنا نقرأ سورة كنا نشبهها في الطول والشدة ب \" براءة \" فأنسيتها ; غير أني قد حفظت منها \" لو كان لابن آدم واديان من مال لابتغى واديا ثالثا ولا يملأ جوف ابن آدم إلا التراب \" . وكنا نقرأ سورة كنا نشبهها بإحدى المسبحات فأنسيتها ; غير أني حفظت منها : يا أيها الذين آمنوا لم تقولون ما لا تفعلون فتكتب شهادة في أعناقكم فتسألون عنها يوم [ ص: 71 ] القيامة . قال ابن العربي : وهذا كله ثابت في الدين . أما قوله تعالى : يا أيها الذين آمنوا لم تقولون ما لا تفعلون فثابت في الدين لفظا ومعنى في هذه السورة . وأما قوله : \" شهادة في أعناقكم فتسألون عنها يوم القيامة \" فمعنى ثابت في الدين ; فإن من التزم شيئا لزمه شرعا . والملتزم على قسمين : أحدهما : النذر ، وهو على قسمين ، نذر تقرب مبتدأ كقوله : لله علي صلاة وصوم وصدقة ، ونحوه من القرب . فهذا يلزم الوفاء به إجماعا . ونذر مباح وهو ما علق بشرط رغبة ، كقوله : إن قدم غائبي فعلي صدقة ، أو علق بشرط رهبة ، كقوله : إن كفاني الله شر كذا فعلي صدقة . فاختلف العلماء فيه ، فقال مالك وأبو حنيفة ، يلزمه الوفاء به . وقال الشافعي في أحد أقواله : إنه لا يلزمه الوفاء به . وعموم الآية حجة لنا ، لأنها بمطلقها تتناول ذم من قال ما لا يفعله على أي وجه كان من مطلق أو مقيد بشرط . وقد قال أصحابه : إن النذر إنما يكون بما القصد منه القربة مما هو من جنس القربة . وهذا وإن كان من جنس القربة لكنه لم يقصد به القربة ، وإنما قصد منع نفسه عن فعل أو الإقدام على فعل .قلنا : القرب الشرعية مشقات وكلف وإن كانت قربات . وهذا تكلف التزام هذه القربة بمشقة لجلب نفع أو دفع ضر ، فلم يخرج عن سنن التكليف ولا زال عن قصد التقرب . قال ابن العربي : فإن كان المقول منه وعدا فلا يخلو أن يكون منوطا بسبب كقوله : إن تزوجت أعنتك بدينار ، أو ابتعت حاجة كذا أعطيتك كذا . فهذا لازم إجماعا من الفقهاء . وإن كان وعدا مجردا فقيل يلزم بتعلقه . وتعلقوا بسبب الآية ، فإنه روي أنهم كانوا يقولون : لو نعلم أي الأعمال أفضل أو أحب إلى الله لعملناه ، فأنزل الله تعالى هذه الآية . وهو حديث لا بأس به . وقد روي عن مجاهد أن عبد الله بن رواحة لما سمعها قال : لا أزال حبيسا في سبيل الله حتى أقتل . والصحيح عندي أن الوعد يجب الوفاء به على كل حال إلا لعذر .قلت : قال مالك : فأما العدة مثل أن يسأل الرجل الرجل أن يهب له الهبة فيقول له نعم ; ثم يبدو له ألا يفعل فما أرى ذلك يلزمه . وقال ابن القاسم : إذا وعد الغرماء فقال : أشهدكم أني قد وهبت له من أن يؤدي إليكم ; فإن هذا يلزمه . وأما أن يقول نعم أنا أفعل ; ثم يبدو له ، فلا أرى عليه ذلك .[ ص: 72 ] قلت : أي لا يقضي عليه بذلك ; فأما في مكارم الأخلاق وحسن المروءة فنعم . وقد أثنى الله تعالى على من صدق وعده ووفى بنذره فقال : والموفون بعهدهم إذا عاهدوا ، وقال تعالى : واذكر في الكتاب إسماعيل إنه كان صادق الوعد وقد تقدم بيانه .قال المثنى : ثلاث آيات منعتني أن أقص على الناس أتأمرون الناس بالبر وتنسون أنفسكم ، وما أريد أن أخالفكم إلى ما أنهاكم عنه ، يا أيها الذين آمنوا لم تقولون ما لا تفعلون . وخرج أبو نعيم الحافظ من حديث مالك بن دينار عن ثمامة أن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : \" أتيت ليلة أسري بي على قوم تقرض شفاههم بمقاريض من نار كلما قرضت وفت . قلت : من هؤلاء يا جبريل ؟ قال : هؤلاء خطباء أمتك الذين يقولون ولا يفعلون ويقرءون كتاب الله ولا يعملون \" . وعن بعض السلف أنه قيل له : حدثنا ; فسكت . ثم قيل له : حدثنا . فقال : أترونني أن أقول ما لا أفعل فأستعجل مقت الله !قوله تعالى : لم تقولون ما لا تفعلون استفهام على جهة الإنكار والتوبيخ ، على أن يقول الإنسان عن نفسه من الخير ما لا يفعله . أما في الماضي فيكون كذبا ، وأما في المستقبل فيكون خلفا ، وكلاهما مذموم . وتأول سفيان بن عيينة قوله تعالى : لم تقولون ما لا تفعلون أي لم تقولون ما ليس الأمر فيه إليكم ، فلا تدرون هل تفعلون أو لا تفعلون . فعلى هذا يكون الكلام محمولا على ظاهره في إنكار القول .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ (2) ناداهم بوصف الإِيمان تعريضاً بأن الإِيمان من شأنه أن يزع المؤمن عن أن يخالف فعلُه قولَه في الوعد بالخير .واللام لتعليل المستفهم عنه وهو الشيء المبْهم الذي هو مدلول { ما } الاستفهامية لأنها تدل على أمر مبهم يطلب تعيينه .والتقدير : تقولون مَا لاَ تفعلون لأي سبب أو لأية علّة .وتتعلق اللام بفعل { تقولون } المجرور مع حرف الجر لصدارة الاستفهام .والاستفهام عن العلة مستعمل هنا في إنكار أن يكون سبب ذلك مرضياً لله تعالى ، أي أن ما يدعوهم إلى ذلك هو أمر منكر وذلك كناية عن اللوم والتحذير من ذلك كما في قوله تعالى : { قل فلم تقتلون أنبياء الله من قبل } في سورة البقرة ( 91 ) . فيجوز أن يكون القول الذي قالوه وعداً وعَدوه ولم يفوا به . ويجوز أن يكون خبراً أخبروا به عن أنفسهم لم يطابق الواقع . وقد مضى استيفاء ذلك في الكلام على صدر السورة .وهذا كناية عن تحذيرهم من الوقوع في مثل ما فعلوه يوم أحد بطريق الرمز ، وكناية عن اللوم على ما فعلوه يوم أحد بطريق التلويح .وتعقيب الآية بقوله : { إن الله يحب الذين يقاتلون في سبيله صفاً } [ الصف : 4 ] الخ . يؤذن بأن اللوم على وعد يتعلق بالجهاد في سبيل الله . وبذلك يلتئم معنى الآية مع حديث الترمذي في سبب النزول وتندحض روايات أخرى رويت في سبب نزولها ذكرها في «الكشاف» .وفيه تعريض بالمنافقين إذ يظهرون الإِيمان بأقوالهم وهم لا يعملون أعمال أهل الإِيمان بالقلب ولا بالجسد . قال ابن زيد : هو قول المنافقين للمؤمنين نحن منكم ومعكم ثم يظهر من أفعالهم خلاف ذلك .\n","ar.waseet":"ثم وجه - سبحانه - نداء إلى المؤمنين فقال : ( ياأيها الذين آمَنُواْ لِمَ تَقُولُونَ مَا لاَ تَفْعَلُونَ ) .وقد ذكروا فى سبب نزول هذه الآيات روايات منها : ما روى عن ابن عباس أنه قال : كان أناس من المؤمنين قبل أن يفرض الجهاد يقولون : لَوَدِدْنا أن الله - عز وجل - دلنا على أحب الأعمال إليه ، فنعمل به ، فأخبر الله نبيه أن أحب الأعمال إليه ، إيمان به لا شك فيه ، وجهاد أهل معصيته الذين خالفوا الإيمان ولم يقروا به .فلما نزل الجهاد كره ذلك أناس من المؤمنين وشق عليهم أمره ، فنزلت هذه الآيات .وقال قتادة والضحاك : نزلت توبيخا لقوم كانوا يقولون : قتَلْنَا ، ضرَبْنَا ، طَعَنَّا ، وفَعَلنْا ، ولم يكونوا فعلوا ذلك .والاستفهام فى قوله - تعالى - : ( لِمَ تَقُولُونَ ) للانكار والتوبيخ على أن يقول الإنسان قولا لا يؤيده فعله ، لأن هذا القول إما أن يكون كذبا ، وإما أن يكون خلفا للوعد ، وكلاهما يبغضه الله - تعالى - .و ( لِمَ ) مركبة من اللام الجارة ، وما الاستفهامية ، وحذفت ألف ما الاستفهامية مع حرف الجر ، تخفيفا لكثرة استعمالها معا ، كما فى قولهم : بِمَ ، وفِيمَ ، وعَمَّ .أى : يا من آمنتم بالله واليوم الآخر . . . لماذا تقولون قولا ، تخالفه أفعالكم ، بأن تزعموا بأنكم لو كلفتم بكذا لفعلتموه ، فلما كلفتم به قصرتم فيه ، أو أن تقولوا بأنكم فعلتم كذا وكذا ، مع أنكم لم تفعلوا ذلك .وناداهم بصفة الإيمان الحق ، لتحريك حرارة الإيمان فى قلوبهم ، وللتعريض بهم ، إذ من شأن الإيمان الحق أن يحمل المؤمن على أن يكون قوله مطابقا لفعله .\n","ar.baghawi":"\"يا أيها الذين آمنوا لم تقولون ما لا تفعلون\"، قال المفسرون : إن المؤمنين قالوا : لو علمنا أحب الأعمال إلى الله - عز وجل - لعملناه ولبذلنا فيه أموالنا وأنفسنا . فأنزل الله - عز وجل - : \" إن الله يحب الذين يقاتلون في سبيله صفا \" فابتلوا بذلك يوم أحد فولوا مدبرين فأنزل الله تعالى \" لم تقولون ما لا تفعلون \"وقال محمد بن كعب : لما أخبر الله تعالى رسوله - صلى الله عليه وسلم - بثواب شهداء بدر [ قالت الصحابة ] لئن لقينا بعده قتالا لنفرغن فيه وسعنا ففروا يوم أحد فعيرهم الله بهذه الآيةوقال قتادة والضحاك : نزلت في [ شأن ] القتال كان الرجل يقول : قاتلت ولم يقاتل وطعنت ولم يطعن وضربت ولم يضرب فنزلت هذه الآية قال ابن زيد : نزلت في المنافقين كانوا يعدون النصر للمؤمنين وهم كاذبون\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5165.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5165.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5165.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ","transliteration":"Kabura maqtan 'indal laahi an taqooloo maa laa taf'aloon","translations":{"en.ahmedali":"Saying what you do not practice is odious to God.","en.ahmedraza":"How despicable it is in the sight of Allah that you may preach what you do not practice.","en.arberry":"Very hateful is it to God, that you say what you do not.","en.asad":"Most loathsome is it in the sight of God that you say what you do not do!","en.daryabadi":"Most odious it is Unto Allah that ye should Say that which ye do not.","en.hilali":"Most hateful it is with Allah that you say that which you do not do.","en.pickthall":"It is most hateful in the sight of Allah that ye say that which ye do not.","en.qaribullah":"It is most hateful to Allah that you should say that which you do not do.","en.sahih":"Great is hatred in the sight of Allah that you say what you do not do.","en.sarwar":"It is most hateful in the sight of God if you say something and do not practice it.","en.yusufali":"Grievously odious is it in the sight of Allah that ye say that which ye do not.","en.maududi":"It is most loathsome in the sight of Allah that you should profess what you do not practise.","en.shakir":"It is most hateful to Allah that you should say that which you do not do.","en.itani":"It is most hateful to God that you say what you do not do.","en.mubarakpuri":"Most hateful it is with Allah that you say that which you do not do.","en.qarai":"It is greatly outrageous to Allah that you should say what you do not do.","en.wahiduddin":"It is most hateful to God that you do not practise what you preach;"},"tafsir":{"ar.muyassar":"عَظُم بغضًا عند الله أن تقولوا بألسنتكم ما لا تفعلونه.","ar.jalalayn":"«كبر» عظم «مقتا» تمييز «عند الله أن تقولوا» فاعل كبر «ما لا تفعلون».","ar.qurtubi":"الخامسة : قوله تعالى : كبر مقتا عند الله أن تقولوا ما لا تفعلون قد يحتج به في وجوب الوفاء في اللجاج والغضب على أحد قولي الشافعي . و \" أن \" وقع بالابتداء وما قبلها الخبر ; وكأنه قال : قولكم ما لا تفعلون مذموم ، ويجوز أن يكون خبر ابتداء محذوف . الكسائي : \" أن \" في موضع رفع ; لأن كبر فعل بمنزلة بئس رجلا أخوك . و \" مقتا \" نصب بالتمييز ; المعنى كبر قولهم ما لا يفعلون مقتا . وقيل : هو حال . والمقت والمقاتة مصدران ; يقال : رجل مقيت وممقوت إذا لم يحبه الناس .\n","ar.miqbas":"كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ (3)وجملة { كبر مقتاً عند الله أن تقولوا ما لا تفعلون } بيان لجملة { لم تقولون ما لا تفعلون } تصريحاً بالمعنى المكنَّى عنه بها .وهو خبر عن كون قولهم : { ما لا تفعلون } أمراً كبيراً في جنس المقت .والكِبَر : مستعار للشدة لأن الكبير فيه كثرة وشدة في نوعه .و { أن تقولوا } فاعل { كبر } .والمقت : البغض الشديد . وهو هنا بمعنى اسم المفعول .وانتصب { مقتاً } على التمييز لِجهة الكبر . وهو تمييز نسبة .والتقدير : كبر ممقوتاً قَولُكم ما لا تفعلونه .ونُظِم هذا الكلام بطريقة الإِجمال ثم التفصيل بالتمييز لتهويل هذا الأمر في قلوب السامعين لكون الكثير منهم بمِظنة التهاون في الحيطة منه حتى وقعوا فيما وقعوا يوم أُحد . ففيه وعيد على تجدد مثله ، وزيد المقصود اهتماماً بأن وصف المقت بأنه عند الله ، أي مقتٌ لا تسامح فيه .وعدل عن جعل فاعل { كبر } ضمير القول بأن يقتصر على { كبر مقتاً عند الله } أو يقال : كبر ذلك مقتاً ، لقصد زيادة التهويل بإعادة لفظه ، ولإِفادة التأكيد .و { مَا } في قوله : { ما لا تفعلون } في الموضعين موصولة ، وهي بمعنى لام العهد ، أي الفعل الذي وَعدتم أن تفعلوه وهو أحبّ الأعمال إلى الله أو الجهادُ . 4 فاقتضت الآية أن الوعد في مثل هذا يجب الوفاء به لأن الموعود به طاعة فالوعد به من قبيل النذر المقصودِ منه القُربة فيجب الوفاء به .\n","ar.waseet":"وقوله - سبحانه - : ( كَبُرَ مَقْتاً عِندَ الله أَن تَقُولُواْ مَا لاَ تَفْعَلُونَ ) بيان للآثار السيئة التى تترتب على القول الذى يخالفه الفعل .وقوله : ( كَبُرَ ) بمعنى عظم ، لأن الشىء الكبير ، لا يوصف بهذا الوصف ، إلا إذا كان فيه كثرة وشدة فى نوعه .والمقت : البغض الشديد ، ومنه قوله - تعالى - ( وَلاَ تَقْرَبُواْ الزنى ) ( إِنَّهُ كَانَ فَاحِشَةً وَمَقْتاً وَسَآءَ سَبِيلاً ) وهو منصوب على التمييز المحول عن الفاعل : للإشعار بأن قولهم هذا مقت خالص لا تشوبه شائبة من الرضا .أى : كبر وعظم المقت الناشىء عن قولكم قولا لا تطابقه أفعالكم .وقال - سبحانه - : ( كَبُرَ مَقْتاً عِندَ الله ) للإشعار بشناعة هذا البغض من الله - تعالى - لهم ، بسبب مخالفة قولهم لفعلهم ، لأنه إذا كانت هذه الصفة عظيمة الشناعة عند الله ، فعلى كل عاقل أن يجتنبها ، ويبتعد عنها .قال صاحب الكشاف ما ملخصه ، ونداؤهم بالإيمان تهكم بهم وبإيمانهم وهذا من أفصح الكلام وأبلغه فى معناه . وقصد فى \" كَبُرَ \" التعجب من غير لفظه . . . . ومعنى التعجب : تعظيم الأمر فى قلوب السامعين ، لأن التعجب لا يكون إلا من شىء خارج عن نظائره وأشكاله . وأُسْنِد إلى ( أَن تَقُولُواْ ) ونُصِب ( مَقْتاً ) على التمييز ، للدلالة على أن قولهم مالا يفعلون مقت خالص لا شوب فيه ، لفَرْط تمكن المقت منه . واختير لفظ المقت ، لأنه أشد البغض وأبلغه ، ومنه قيل : نكاح المقت - وهو أن يتزوج الرجل امرأة أبيه - .وإذا ثبت كِبر مقته عند الله ، فقد تم كبره وشدته ، وانزاحت عنه الشكوك . .فأنت ترى أن الله - تعالى - قد ذم الذين يقولون مالا يفعلون ذما شديدا ، ويندرج تحت هذا الذم ، الكذب فى القول ، والخلف فى الوعد ، وحب الشخص للثناء دون أن يكون قد قدم عملا يستحق من أجله الثناء .\n","ar.baghawi":"( كبر مقتا عند الله أن تقولوا ) في موضع الرفع فهو كقولك : بئس رجلا أخوك ومعنى الآية : أي عظم ذلك في المقت والبغض عند الله أي : إن الله يبغض بغضا شديدا أن تقولوا ( ما لا تفعلون ) أن تعدوا من أنفسكم شيئا ثم لم توفوا به .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5166.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5166.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5166.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ","transliteration":"Innal laaha yuhibbul lazeena yuqaatiloona fee sabeelihee saffan kaannahum bunyaanum marsoos","translations":{"en.ahmedali":"Surely God loves those who fight in His cause in full formations as though they were a compact wall.","en.ahmedraza":"Indeed Allah likes those who fight in His cause, positioned in rows, as if they were an edifice fortified.","en.arberry":"God loves those who fight in His way in ranks, as though they were a building well-compacted.","en.asad":"Verily, God loves [only] those who fight in His cause in [solid] ranks, as though they were a building firm and compact.","en.daryabadi":"Verily Allah loveth those who fight in His way drown up in ranks, as though they were a structure well compacted.","en.hilali":"Verily, Allah loves those who fight in His Cause in rows (ranks) as if they were a solid structure.","en.pickthall":"Lo! Allah loveth them who battle for His cause in ranks, as if they were a solid structure.","en.qaribullah":"Allah loves those who fight in His Way lining up as if they were a stacked building.","en.sahih":"Indeed, Allah loves those who fight in His cause in a row as though they are a [single] structure joined firmly.","en.sarwar":"God loves those who fight for His cause in battlefield formations firm as an unbreakable concrete wall.","en.yusufali":"Truly Allah loves those who fight in His Cause in battle array, as if they were a solid cemented structure.","en.maududi":"Allah indeed loves those who fight in His Way as though they are a solid wall cemented with molten lead.","en.shakir":"Surely Allah loves those who fight in His way in ranks as if they were a firm and compact wall.","en.itani":"God loves those who fight in His cause, in ranks, as though they were a compact structure.","en.mubarakpuri":"Verily, Allah loves those who fight in His cause in rows as if they were a solid structure.","en.qarai":"Indeed Allah loves those who fight in His way in ranks, as if they were a compact structure.","en.wahiduddin":"surely, God loves those who fight for His cause in ranks, as if they were a solid cemented structure."},"tafsir":{"ar.muyassar":"إن الله يحب الذين يقاتلون في سبيله صفًا كأنهم بنيان متراص محكم لا ينفذ منه العدو. وفي الآية بيان فضل الجهاد والمجاهدين؛ لمحبة الله سبحانه لعباده المؤمنين إذا صفُّوا مواجهين لأعداء الله، يقاتلونهم في سبيله.","ar.jalalayn":"«إن الله يحب» ينصر ويكرم «الذين يقاتلون في سبيله صفا» حال، أي صافين «كأنهم بنيان مرصوص» ملزق بعضه إلى بعض ثابت.","ar.qurtubi":"قوله تعالى : إن الله يحب الذين يقاتلون في سبيله صفا كأنهم بنيان مرصوص[ ص: 73 ] فيه ثلاث مسائل :الأولى : قوله تعالى : إن الله يحب الذين يقاتلون في سبيله صفا أي يصفون صفا : والمفعول مضمر ; أي يصفون أنفسهم صفا .كأنهم بنيان مرصوص قال الفراء : مرصوص بالرصاص . وقال المبرد : هو من رصصت البناء إذا أمت بينه وقاربت حتى يصير كقطعة واحدة . وقيل : هو من الرصيص وهو انضمام الأسنان بعضها إلى بعض . والتراص التلاصق ; ومنه وتراصوا في الصف . ومعنى الآية : يحب من يثبت في الجهاد في سبيل الله ويلزم مكانه كثبوت البناء . وقال سعيد بن جبير : هذا تعليم من الله تعالى للمؤمنين كيف يكونون عند قتال عدوهم .الثانية : وقد استدل بعض أهل التأويل بهذا على أن قتال الراجل أفضل من قتال الفارس ، لأن الفرسان لا يصطفون على هذه الصفة . المهدوي : وذلك غير مستقيم ، لما جاء في فضل الفارس في الأجر والغنيمة . ولا يخرج الفرسان من معنى الآية ; لأن معناه الثبات .الثالثة : لا يجوز الخروج عن الصف إلا لحاجة تعرض للإنسان ، أو في رسالة يرسلها الإمام ، أو في منفعة تظهر في المقام ، كفرصة تنتهز ولا خلاف فيها . وفي الخروج عن الصف للمبارزة خلاف على قولين أحدهما أنه لا بأس بذلك إرهابا للعدو ، وطلبا للشهادة وتحريضا على القتال . وقال أصحابنا : لا يبرز أحد طالبا لذلك ، لأن فيه رياء وخروجا إلى ما نهى الله عنه من لقاء العدو . وإنما تكون المبارزة إذا طلبها الكافر ; كما كانت في حروب النبي صلى الله عليه وسلم يوم بدر وفي غزوة خيبر ، وعليه درج السلف . وقد مضى القول مستوفى في هذا في \" البقرة \" عند قوله تعالى : ولا تلقوا بأيديكم إلى التهلكة .\n","ar.miqbas":"إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ (4)هذا جواب على تمنيهم معرفةَ أحب الأعمال إلى الله كما في حديث عبد الله بن سَلام عند الترمذي المتقدم وما قبله توطئة له على أسلوب الخطب ومقدماتها .والصف : عَدد من أشياء متجانبة منتظمة الأماكن ، فيطلق على صف المصلين ، وصفِّ الملائكة ، وصف الجيش في ميدان القتال بالجيش إذا حضر القتال كان صفّاً من رَجَّالة أو فرسان ثم يَقع تقدم بعضهم إلى بعض فرادى أو زرافات .فالصفّ هنا : كناية عن الانتظام والمقاتلة عن تدبّر .وأما حركات القتال فتعرض بحسب مصالح الحرب في اجتماع وتفرق وكرّ وفّر . وانتصب { صفاً } على الحال بتأويل : صافّين ، أو مصفوفين .والمرصوص : المتلاصق بعضه ببعض . والتشبيه في الثبات وعدم الانفلات وهو الذي اقتضاه التوبيخ السابق في قوله : { لم تقولون ما لا تفعلون } [ الصف : 2 ] .\n","ar.waseet":"وبعد أن وبخ - سبحانه - الذين يقولون مالا يفعلون ، أتبع ذلك ببيان من يحبهم الله - تعالى - فقال : ( إِنَّ الله يُحِبُّ الذين يُقَاتِلُونَ فِي سَبِيلِهِ صَفّاً كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ ) .ومبحة الله - تعالى - لشخص ، معناها : رضاه عنه ، وإكرامه له .والصف يطلق على الأشياء التى تكون منتظمة فى مظهرها ، متناسقة فى أماكنها ، والمرصوص : هو المتلاصق الذى انضم بعضه إلى بعض . يقال : رصصت البناء ، إذا ألزقت بعضه ببعض حتى صار كالقطعة الواحدة .والمعنى : أن الله - تعالى - يحب الذين يقاتلون فى سبيل إعلاء دينه قتالا شديدا ، حتى لكأنهم فى ثباتهم ، واجتماع كلمتهم ، وصدق يقينهم . . . بنيان قد التصق بعضه ببعض ، فلا يستطيع أحد أن ينفذ من بين صفوفه .فالمقصود بالآية الكريمة : الثناء على المجاهدين الصادقين ، الذين يثبتون أمام الأعداء وهم يقاتلونهم ، ثباتا لا اضطراب معه ولا تزلزل .قال الإمام الرازى : أخبر الله - تعالى - أنه يحب من يثبت فى الجهاد ، ويلزم مكانه ، كثبوت البناء المرصوص .ويجوز أن يكون على أن يستوى أمرهم فى حرب عدوهم ، حتى يكونوا فى اجتماع الكلمة ، وموالاة بعضهم بعضا ، كالبنيان المرصوص .\n","ar.baghawi":"( إن الله يحب الذين يقاتلون في سبيله صفا ) أي يصفون أنفسهم عند القتال صفا ولا يزولون عن أماكنهم ( كأنهم بنيان مرصوص ) قد رص بعضه ببعض [ أي ألزق بعضه ببعض ] وأحكم فليس فيه فرجة ولا خلل . وقيل كالرصاص .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5167.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5167.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5167.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَدْ تَعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","transliteration":"Wa iz qaala Moosa liqawmihee yaa qawmi lima tu'zoonanee wa qat ta'lamoona annee Rasoolul laahi ilaikum falammaa zaaghooo azaaghal laahu quloobahum; wallaahu laa yahdil qawmal faasiqeen","translations":{"en.ahmedali":"When Moses said to his people: \"O my people, why do you afflict me though you know that I have been sent to you by God?\" But when they turned aside God made their hearts turn farther away; for God does not show the transgressors the way.","en.ahmedraza":"And remember when Moosa said to his people, “O my people! Why do you trouble me, whereas you know that I am Allah’s Noble Messenger towards you?” So when they deviated, Allah deviated their hearts; and Allah does not guide the sinning people.","en.arberry":"And when Moses said to his people, 'O my people, why do you hurt me, though you know I am the Messenger of God to you?' When they swerved, God caused their hearts to swerve; and God. guides never the people of the ungodly.","en.asad":"Now when Moses spoke to his people, [it was this same truth that he had in mind:] \"O my people! Why do you cause me grief, the while you know that I am an apostle of God sent unto you?\" And so, when they swerved from the right way, God let their hearts swerve from the truth: for God does not bestow His guidance upon iniquitous folk.","en.daryabadi":"And recall what time Musa said Unto his people: O my people! wherefore hurt ye me, When surely ye know that verily I am Allah's apostle Unto you! Then when they sweryed, Allah made their hearts swerve; and Allah guideth not a transgressing people.","en.hilali":"And (remember) when Musa (Moses) said to his people: \"O my people! Why do you hurt me while you know certainly that I am the Messenger of Allah to you? So when they turned away (from the Path of Allah), Allah turned their hearts away (from the Right Path). And Allah guides not the people who are Fasiqun (rebellious, disobedient to Allah).","en.pickthall":"And (remember) when Moses said unto his people: O my people! Why persecute ye me, when ye well know that I am Allah's messenger unto you? So when they went astray Allah sent their hearts astray. And Allah guideth not the evil-living folk.","en.qaribullah":"And when Moses, said to his nation: 'Why do you harm me, when you know that I am the Messenger of Allah sent to you' But when they swerved away Allah caused their hearts to swerve. Allah never guides impious people.","en.sahih":"And [mention, O Muhammad], when Moses said to his people, \"O my people, why do you harm me while you certainly know that I am the messenger of Allah to you?\" And when they deviated, Allah caused their hearts to deviate. And Allah does not guide the defiantly disobedient people.","en.sarwar":"Moses said to his people, \"Why do you create difficulties for me when you know that I am God's Messenger to you?\" When they deviated (from the right path), God led their hearts astray. God does not guide the evil-doing people.","en.yusufali":"And remember, Moses said to his people: \"O my people! why do ye vex and insult me, though ye know that I am the messenger of Allah (sent) to you?\" Then when they went wrong, Allah let their hearts go wrong. For Allah guides not those who are rebellious transgressors.","en.maududi":"And call to mind when Moses said to his people: “O my people, why do you torment me when you know well that I am Allah's Messenger to you?” So when they deviated, Allah made their hearts deviant. Allah does not direct the evil-doers to the Right Way.","en.shakir":"And when Musa said to his people: O my people! why do you give me trouble? And you know indeed that I am Allah's apostle to you; but when they turned aside, Allah made their hearts turn aside, and Allah does not guide the transgressing people.","en.itani":"When Moses said to his people, “O my people, why do you hurt me, although you know that I am God’s Messenger to you?” And when they swerved, God swerved their hearts. God does not guide the sinful people.","en.mubarakpuri":"And when Musa said to his people: \"O my people! Why do you annoy me while you know certainly that I am the Messenger of Allah to you So, when they turned away (from the path of Allah), Allah turned their hearts away (from the right path). And Allah guides not the people who are rebellious.","en.qarai":"When Moses said to his people, ‘O my people! Why do you torment me, when you certainly know that I am Allah’s apostle to you?’ So when they swerved [from the right path], Allah made their hearts swerve, and Allah does not guide the transgressing lot.","en.wahiduddin":"Remember when Moses said to his people, \"O my people, why do you cause me grief when you know that I am God's Messenger to you?\" When they wavered, God let their hearts waver too. God does not guide transgressors."},"tafsir":{"ar.muyassar":"واذكر لقومك -أيها الرسول- حين قال نبي الله موسى عليه السلام لقومه: لِمَ تؤذونني بالقول والفعل، وأنتم تعلمون أني رسول الله إليكم؟ فلما عدلوا عن الحق مع علمهم به، وأصرُّوا على ذلك، صرف الله قلوبهم عن قَبول الهداية؛ عقوبة لهم على زيغهم الذي اختاروه لأنفسهم. والله لا يهدي القوم الخارجين عن الطاعة ومنهاج الحق.","ar.jalalayn":"«و» اذكر «إذ قال موسى لقومه يا قوم لم تؤذونني» قالوا: إنه آدر، أي منتفخ الخصية وليس كذلك، وكذبوه «وقد» للتحقيق «تعلمون أني رسول الله إليكم» الجملة حال، والرسول يحترم «فلما زاغوا» عدلوا عن الحق بإيذائه «أزاغ الله قلوبهم» أمالها عن الهدى على وفق ما قدره في الأزل «والله لا يهدي القوم الفاسقين» الكافرين في علمه.","ar.qurtubi":"قوله تعالى : وإذ قال موسى لقومه يا قوم لم تؤذونني وقد تعلمون أني رسول الله إليكم فلما زاغوا أزاغ الله قلوبهم والله لا يهدي القوم الفاسقين[ ص: 74 ] قوله تعالى : وإذ قال موسى لقومه لما ذكر أمر الجهاد بين أن موسى وعيسى أمرا بالتوحيد وجاهدا في سبيل الله ; وحل العقاب بمن خالفهما ; أي واذكر لقومك يا محمد هذه القصة .قوله تعالى : يا قوم لم تؤذونني ، وذلك حين رموه بالأدرة ; حسب ما تقدم في آخر سورة \" الأحزاب \" . ومن الأذى ما ذكر في قصة قارون : إنه دس إلى امرأة تدعي على موسى الفجور . ومن الأذى قولهم : اجعل لنا إلها كما لهم آلهة وقولهم فاذهب أنت وربك فقاتلا . وقولهم : إنك قتلت هارون . وقد تقدم هذا .وقد تعلمون أني رسول الله إليكم والرسول يحترم ويعظم . ودخلت قد على تعلمون للتأكيد ; كأنه قال : وتعلمون علما يقينا لا شبهة لكم فيه .فلما زاغوا ؛ أي مالوا عن الحقأزاغ الله قلوبهم ؛ أي أمالها عن الهدى . وقيل : فلما زاغوا عن الطاعة أزاغ الله قلوبهم عن الهداية . وقيل : فلما زاغوا عن الإيمان أزاغ الله قلوبهم عن الثواب . وقيل : أي لما تركوا ما أمروا به من احترام الرسول عليه السلام وطاعة الرب ، خلق الله الضلالة في قلوبهم عقوبة لهم على فعلهم .\n","ar.miqbas":"وَإِذْ قَالَ مُوسَى لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَدْ تَعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ (5)موقع هذه الآية هنا خفي المناسبة . فيجوز أن تكون الجملة معترضة استئنافاً ابتدائياً انتقل به من النهي عن عدم الوفاء بما وعدوا الله عليه إلى التعريض بقوم آذوا النبي صلى الله عليه وسلم بالقول أو بالعصيان أو نحو ذلك ، فيكون الكلام موجهاً إلى المنافقين ، فقد وسموا بأذى الرسول صلى الله عليه وسلم قوله تعالى : { إن الذين يؤذون الله ورسوله لعنهم الله في الدنيا والآخرة } [ الأحزاب : 57 ] الآية . وقوله تعالى : { والذين يؤذون رسول الله لهم عذاب أليم } [ التوبة : 61 ] وقوله : { ومنهم الذين يؤذون النبي ويقولون هو أذن } [ التوبة : 61 ] .وعلى هذا الوجه فهو اقتضاب نقل به الكلام من الغرض الذي قبله لتمامه إلى هذا الغرض ، أو تكون مناسبة وقعه في هذا الموقع حدوث سبب اقتضى نزوله من أذى قد حدث لم يطلع عليه المفسرون ورواة الأخبار وأسباب النزول .والواو على هذا الوجه عطف غرض على غرض . وهو المسمّى بعطف قصة على قصة .ويجوز أن يكون من تتمة الكلام الذي قبلها ضرب الله مثلاً للمسلمين لتحذيرهم من إتيان ما يؤذي رسوله صلى الله عليه وسلم ويسوؤوه من الخروج عن جادة الكمال الديني مثل عدم الوفاء بوعدهم في الإِتيان بأحبّ الأعمال إلى الله تعالى . وأشفقهم من أن يكون ذلك سبباً للزيغ والضلال كما حدث لقوم موسى لمَّا آذوه .وعلى هذا الوجه فالمراد بأذى قوم موسى إياه : عدم توخي طاعته ورضاه ، فيكون ذلك مشيراً إلى ما حكاه الله عنه من قوله : { يا قوم ادخلوا الأرض المقدسة التي كتب الله لكم ولا ترتدوا على أدباركم فتنقلبوا خاسرين } [ المائدة : 21 ] ، إلى قوله : { قالوا يا موسى إنا لن ندخلها أبداً ما داموا فيها فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون } [ المائدة : 24 ] . فإن قولهم ذلك استخفاف يدل لذلك قوله عَقِبَه { قال رب إني لا أملك إلا نفسي وأخي فافرق بيننا وبين القوم الفاسقين } [ المائدة : 25 ] .وقد يكون وصفهم في هذه الآية بقوله : { والله لا يهدي القوم الفاسقين } ناظراً إلى وصفهم بذلك مرتين في آية سورة العقود في قوله : { فافرق بيننا وبين القوم الفاسقين } [ المائدة : 25 ] وقوله : { فلا تأس على القوم الفاسقين } [ المائدة : 26 ] .فيكون المقصود الأهم من القصة هو ما تفرع على ذكرها من قوله : { فلما زاغوا أزاغ الله قلوبهم } . ويناسب أن تكون هذه الآية تحذيراً من مخالفة أمر الرسول صلى الله عليه وسلم وعبرة بما عرض لهم من الهزيمة يوم أُحُد لما خالفوا أمره من عدم ثبات الرماة في مكانهم .وقد تشابهت القصتان في أن القوم فرّوا يوم أُحُد كما فرّ قوم موسى يوم أريحا ، وفي أن الرماة الذين أمرهم رسول الله صلى الله عليه وسلم أن لا يبرحوا مكانهم «ولو تخطَّفَنا الطير» وأن ينضحوا عن الجيش بالنبال خشية أن يأتيه العدوّ من خلفه لم يفعلوا ما أمرهم به وعصوا أمر أميرهم عبد الله بن جبير وفارقوا موقفهم طلباً للغنيمة فكان ذلك سبب هزيمة المسلمين يوم أُحُد .والواو على هذا الوجه عطف تحذير مأخوذ من قوله : { فلما زاغوا أزاغ الله قلوبهم } على النهي الذي في قوله : { لم تقولون ما لا تفعلون } [ الصف : 2 ] الآية .ويتبع ذلك تسلية الرسول صلى الله عليه وسلم على ما حصل من مخالفة الرماة حتى تسببوا في هزيمة الناس .و { إذ } متعلقة بفعل محذوف تقديره : اذْكُر ، وله نظائر كثيرة في القرآن ، أي اذكر لهم أيضاً وقت قول موسى لقومه أو اذكر لهم مع هذا النهي وقت قول موسى لقومه .وابتداء كلام موسى عليه السلام ب { يا قوم } تعريض بأن شأن قوم الرسول أن يطيعوه بَلْهَ أن لا يؤذوه . ففي النداء بوصف { قوم } تمهيد للإِنكار في قوله : { لم تؤذونني } .والاستفهام للإِنكار ، أي إنكار أن يكون للإِذاية سبب كما تقدم في قوله تعالى : { لم تقولون ما لا تفعلون .وقد جاءت جملة الحال من قوله : وقد تعلمون أني رسول الله } مصادفة المحلّ من الترقّي في الإِنكار .و { قد } لتحقيق معنى الحالية ، أي وعلمكم برسالتي عن الله أمر محقق لما شاهدوه من دلائل رسالته ، وكما أكد علمهم ب { قَد } أكد حصول المعلوم ب ( أنّ ) المفتوحة ، فحصل تأكيدان للرسالة . والمعنى : فكيف لا يجري أمركم على وفق هذا العلم .والإِتيان بعد { قد } بالمضارع هنا للدلالة على أن علمهم بذلك مجدّد بتجدد الآيات والوحي ، وذلك أجدى بدوام امتثاله لأنه لو جيء بفعل المضي لما دلّ على أكثر من حصول ذلك العلم فيما مضى . ولعله قد طرأ عليه ما يبطله ، وهذا كالمضارع في قوله : { قد يعلم الله المعوقين منكم } في سورة [ الأحزاب : 18 ] .والزيغ : الميل عن الحق ، أي لما خالفوا ما أمرهم رسولهم جعل الله في قلوبهم زيغاً ، أي تمكن الزيغ من نفوسهم فلم ينفكوا عن الضلال .وجملة والله لا يهدي القوم الفاسقين } تذييل ، أي وهذه سنة الله في الناس فكان قوم موسى الذين آذوْه من أهل ذلك العموم .وذُكر وصف { الفاسقين } جارياً على لفظ { القوم } للإِيماء إلى الفسوق الذي دخل في مقوّمات قوميتهم . كما تقدم عند قوله تعالى : { إن في خلق السماوات والأرض إلى قوله : { لآيات لقوم يعقلون } في [ البقرة : 164 ] .فالمعنى : الذين كان الفسوق عن الحق سجية لهم لا يلطف الله بهم ولا يعتني بهم عناية خاصة تسوقهم إلى الهدى ، وإنما هو طوع الأسباب والمناسبات .\n","ar.waseet":"ثم ساق - سبحانه - جانبا مما قاله موسى - عليه السلام - لقومه . وكيف أنهم عندما انصرفوا عن الحق ، عاقبهم - سبحانه - بما يستحقون من عقاب فقال : ( وَإِذْ قَالَ موسى . . . ) .موسى - عليه السلام - هو انب عمران ، وهو واحد من أولى العزم من الرسل ، وينتهى نسبه إلى إبراهيم - عليه السلام - .وقد أرسله الله - تعالى - إلى فرعون وقومه وإلى بنى إسرائيل ، وقد لقى - عليه السلام - من الجميع أذى كثيرا .ومن ذلك أن فرعون وقومه وصفوه بأنه ساحر ، وبأنه مهين ، ولا يكاد يبين .وأن بنى إسرائيل قالوا له عندما أمرهم بطاعته : وسمعنا وعصينا ، وقالوا له : أرنا الله جهرة وقالوا له : اجعل لنا إلها كما لهم آلهة . . . وقالوا له : اذهب أنت وربك فقاتلا إنا هاهنا قاعدون .وقالوا عنه : إنه مصاب فى جسده بالأمراض ، فبرأه الله - تعالى - مما قالوا .قال ابن كثير : وفى هذا تسلية لرسوله - صلى الله عليه وسلم - فيما أصابه من الكفار من قومه وغيرهم ، وأمر له بالصبر ، ولهذا قال : \" رحمة الله على موسى ، لقد أوذى بأكثر من هذا فصبر \" .وفيه نهى للمؤمنين عن أن ينالوا من النبى - صلى الله عليه وسلم - ، أو يوصلوا إليه أذى ، كما قال - تعالى - ( ياأيها الذين آمَنُواْ لاَ تَكُونُواْ كالذين آذَوْاْ موسى فَبرَّأَهُ الله مِمَّا قَالُواْ وَكَانَ عِندَ الله وَجِيهاً ) أى : واذكر - أيها الرسول الكريم - وذكر أتباعك ليتعظوا ويعتبروا ، وقت أن قال موسى - عليه السلام - لقومه على سبيل الإنكار والتعجيب من حالهم .( ياقوم لِمَ تُؤْذُونَنِي ) : قال لهم : يا أهلى ويا عشيرتى لماذا تلحقون الأذى بى؟\" وقد \" فى قوله - تعالى - : ( وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ الله إِلَيْكُمْ ) للتحقيق ، والجملة حالية ، وجىء بالمضارعة بعد \" قد \" للدلالة على أن علمهم بصدقه متجدد بتجدد ما يأتيهم به من آيات ومعجزات .قال الجمل : قوله : ( وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ الله إِلَيْكُمْ ) قد للتحقيق . أى : تحقيق علمهم . أى : لا للتقريب ولا للتقليل ، وفائدة ذكرها التأكيد ، والمضارع بمعنى الماضى .أى : وقد علمتم ، وعبر بالمضارع ليدل على استصحاب الحال ، وعلى أنها مقررة للإنكار . فإن العلم برسالته يوجب تعظيمه ، ويمنع إيذاءه؛ لأن من عرف الله - تعالى - وعظمته ، عظَّم رسوله .ثم بين - سبحانه - ما ترتب على إيثارهم الغى على الهدى ، فقال : ( فَلَمَّا زاغوا أَزَاغَ الله قُلُوبَهُمْ ) .والزيغ : هو الميل عن طريق الحق ، يقال : زاغ يزيغ زيغا وزيغانا ، إذا مال عن الجادة ، وأزاغ فلان فلانا ، إذا حوله عن طريق الخير إلى طريق الشر .أى : فلما أصروا على الميل عن الحق مع علمهم به . واستمروا على ذلك دون أن تؤثر المواعظ فى قلوبهم . . . أمال الله - تعالى - قلوبهم عن قبول الهدى .لإيثارهم الباطل على الحق والضلالة على الهداية .كما قال - تعالى - : ( وَمَن يُشَاقِقِ الرسول مِن بَعْدِ مَا تَبَيَّنَ لَهُ الهدى وَيَتَّبِعْ غَيْرَ سَبِيلِ المؤمنين نُوَلِّهِ مَا تولى وَنُصْلِهِ جَهَنَّمَ وَسَآءَتْ مَصِيراً ) وقوله - سبحانه - : ( والله لاَ يَهْدِي القوم الفاسقين ) تذييل قصد به التقرير لما قبله ، من أن الزيغ يؤدى إلى عدم الهداية ، وبيان سنة من سنن الله فى خلقه ، وهى أن من استحب العمى على الهدى ، وأصر على ذلك . . . كانت عاقبه الخسران .أى : وقد اقتضت حكمة الله - تعالى - أن لا يهدى القوم الخارجين عن طريق الحق ، إلى ما يسعدهم فى حياتهم وبعد مماتهم ، لأنهم هم الذين اختاروا طريق الشقاء ، وأصروا على سولكها .\n","ar.baghawi":"( وإذ قال موسى لقومه ) من بني إسرائيل : ( يا قوم لم تؤذونني ) وذلك حين رموه بالأدرة ( وقد تعلمون أني رسول الله إليكم ) والرسول يعظم [ ويكرم ] ويحترم ( فلما زاغوا ) عدلوا عن الحق ( أزاغ الله قلوبهم ) أمالها عن الحق يعني أنهم لما تركوا الحق بإيذاء نبيهم أمال الله قلوبهم عن الحق ( والله لا يهدي القوم الفاسقين ) قال الزجاج : يعني لا يهدي من سبق في علمه أنه فاسق .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5168.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5168.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5168.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ ۖ فَلَمَّا جَاءَهُمْ بِالْبَيِّنَاتِ قَالُوا هَٰذَا سِحْرٌ مُبِينٌ","transliteration":"Wa iz qaala 'Eesab-nu-Mayama yaa Banee Israaa'eela innee Rasoolul laahi ilaikum musaddiqal limaa baina yadayya minat Tawraati wa mubashshiram bi Rasooliny yaatee mim ba'dis muhooo Ahmad; falammaa jaaa'ahum bil baiyinaati qaaloo haazaa sihrum mubeen","translations":{"en.ahmedali":"And when Jesus, son of Mary, said: \"O children of Israel, I am sent to you by God to confirm the Torah (sent) before me, and to give you good tidings of an apostle who will come after me, whose name is Ahmad (the praised one).\" Yet when he has come to them with clear proofs, they say: \"This is only magic.\"","en.ahmedraza":"And remember when Eisa the son of Maryam said, “O Descendants of Israel! Indeed I am Allah’s Noble Messenger towards you, confirming the Book Torah which was before me, and heralding glad tidings of the Noble Messenger who will come after me – his name is Ahmed (the Praised One)”; so when Ahmed came to them with clear proofs, they said, “This is an obvious magic.”","en.arberry":"And when Jesus son of Mary said, 'Children of Israel, I am indeed the Messenger of God to you, confirming the Torah that is before me, and giving good tidings of a Messenger who shall come after me, whose name shall be Ahmad.' Then, when he brought them the clear signs, they said, 'This is a manifest sorcery.'","en.asad":"And [this happened, too,] when Jesus, the son of Mary, said: \"O children of Israel! Behold, I am an apostle of God unto you, [sent] to confirm the truth of whatever there still remains of the Torah, and to give [you] the glad tiding of an apostle who shall come after me, whose name shall be Ahmad.\" But when he [whose coming Jesus had foretold] came unto them with all evidence of the truth, they said: \"This [alleged message of his] is [nothing but] spellbinding eloquence!\"","en.daryabadi":"And recall what time Isa, son of Maryam, said: children of Israi'l! verily I am Allah's apostle Unto you, confirming the Taurat which was before me, and giving the glad tidings of an apostle who cometh after me: his name will be Ahmad. Then when he brought Unto them evidences, they said: this is magic manifest.","en.hilali":"And (remember) when 'Iesa (Jesus), son of Maryam (Mary), said: \"O Children of Israel! I am the Messenger of Allah unto you confirming the Taurat [(Torah) which came] before me, and giving glad tidings of a Messenger to come after me, whose name shall be Ahmad. But when he (Ahmad i.e. Muhammad SAW) came to them with clear proofs, they said: \"This is plain magic.\"","en.pickthall":"And when Jesus son of Mary said: O Children of Israel! Lo! I am the messenger of Allah unto you, confirming that which was (revealed) before me in the Torah, and bringing good tidings of a messenger who cometh after me, whose name is the Praised One. Yet when he hath come unto them with clear proofs, they say: This is mere magic.","en.qaribullah":"And when (Prophet) Jesus, the son of Mary said: 'Children of Israel, I am sent to you by Allah to confirm the Torah that was before me, and to give news of a Messenger (Prophet Muhammad) who will come after me whose name shall be Ahmad' Yet when he came to them with clear proofs, they said: 'This is clearsorcery'","en.sahih":"And [mention] when Jesus, the son of Mary, said, \"O children of Israel, indeed I am the messenger of Allah to you confirming what came before me of the Torah and bringing good tidings of a messenger to come after me, whose name is Ahmad.\" But when he came to them with clear evidences, they said, \"This is obvious magic.\"","en.sarwar":"Jesus, son of Mary, said to the Israelites, \"I am the Messenger of God sent to you. I confirm the Torah which is in existence and give you the glad news of the coming of a Messenger who will come after me named Ahmad.\" When this Messenger came to them with all the proofs (to support his truthfulness), they said, \"He is simply a magician\".","en.yusufali":"And remember, Jesus, the son of Mary, said: \"O Children of Israel! I am the messenger of Allah (sent) to you, confirming the Law (which came) before me, and giving Glad Tidings of a Messenger to come after me, whose name shall be Ahmad.\" But when he came to them with Clear Signs, they said, \"this is evident sorcery!\"","en.maududi":"And call to mind when Jesus, son of Mary, said: “O Children of Israel, I am Allah's Messenger to you, I verify the Torah which has come before me, and I give you the glad tiding of a Messenger who shall come after me, his name being Ahmad.” Yet when he came to them with Clear Signs they said: “This is sheer trickery.”","en.shakir":"And when Isa son of Marium said: O children of Israel! surely I am the apostle of Allah to you, verifying that which is before me of the Taurat and giving the good news of an Apostle who will come after me, his name being Ahmad, but when he came to them with clear arguments they said: This is clear magic.","en.itani":"And when Jesus son of Mary said, “O Children of Israel, I am God’s Messenger to you, confirming what preceded me of the Torah, and announcing good news of a messenger who will come after me, whose name is Ahmad.” But when he showed them the miracles, they said, “This is obvious sorcery.”","en.mubarakpuri":"And (remember) when `Isa, son of Maryam, said: \"O Children of Israel! I am the Messenger of Allah unto you, confirming the Tawrah [which came] before me, and giving glad tidings of a Messenger to come after me, whose name shall be Ahmad. \"But when he came to them with clear proofs, they said: \"This is plain magic.\"","en.qarai":"And when Jesus son of Mary said, ‘O Children of Israel! Indeed I am the apostle of Allah to you, to confirm what is before me of the Torah, and to give the good news of an apostle who will come after me, whose name is Ahmad.’ But when he brought them manifest proofs, they said, ‘This is plain magic.’","en.wahiduddin":"Remember when Jesus, son of Mary, said, \"O Children of Israel, I am sent to you by God, confirming the Torah that came before me and bringing good news of a messenger to follow me, whose name will be Ahmad.\" Yet when he came to them with clear signs, they said, \"This is merely sorcery.\""},"tafsir":{"ar.muyassar":"واذكر -أيها الرسول لقومك- حين قال عيسى ابن مريم لقومه: إني رسول الله إليكم، مصدِّقًا لما جاء قبلي من التوراة، وشاهدًا بصدق رسول يأتي من بعدي اسمه \"أحمد\"، وهو محمد صلى الله عليه وسلم، وداعيًا إلى التصديق به، فلما جاءهم محمد صلى الله عليه وسلم بالآيات الواضحات، قالوا: هـذا الذي جئتنا به سحر بيِّن.","ar.jalalayn":"«و» اذكر «إذ قال عيسى ابن مريم يا بني إسرائيل» لم يقل: يا قوم لأنه لم يكن له فيهم قرابة «إني رسول الله إليكم مصدقا لما بين يديَّ» قبلي «من التوراة ومبشرا برسول يأتي من بعدي اسمه أحمد» قال تعالى «فلما جاءهم» جاء أحمد الكفار «بالبينات» الآيات والعلامات «قالوا هذا» أي المجيء به «سحر» وفي قراءة ساحر، أي الجائي به «مبين» بيِّن.","ar.qurtubi":"قوله تعالى : وإذ قال عيسى ابن مريم يا بني إسرائيل إني رسول الله إليكم مصدقا لما بين يدي من التوراة ومبشرا برسول يأتي من بعدي اسمه أحمد فلما جاءهم بالبينات قالوا هذا سحر مبينقوله تعالى : وإذ قال عيسى ابن مريم أي واذكر لهم هذه القصة أيضا . وقال : يا بني إسرائيل ولم يقل يا قوم كما قال موسى ; لأنه لا نسب له فيهم فيكونون قومه .إني رسول الله إليكم أي بالإنجيل .مصدقا لما بين يدي من التوراة لأن في التوراة صفتي ، وأني لم آتكم بشيء يخالف التوراة فتنفروا عني .ومبشرا برسول مصدقا . \" ومبشرا \" نصب على الحال ; والعامل فيها معنى الإرسال . و \" إليكم \" صلة الرسول .يأتي من بعدي اسمه أحمد قرأ نافع وابن كثير وأبو عمرو \" من بعدي \" بفتح الياء . وهي قراءة السلمي [ ص: 75 ] وزر بن حبيش وأبي بكر عن عاصم . واختاره أبو حاتم لأنه اسم ; مثل الكاف من بعدك ، والتاء من قمت . الباقون بالإسكان . وقرئ \" من بعدي اسمه أحمد \" بحذف الياء من اللفظ . و \" أحمد \" اسم نبينا صلى الله عليه وسلم . وهو اسم علم منقول من صفة لا من فعل ; فتلك الصفة أفعل التي يراد بها التفضيل . فمعنى \" أحمد \" أي أحمد الحامدين لربه . والأنبياء صلوات الله عليهم كلهم حامدون الله ، ونبينا أحمد أكثرهم حمدا . وأما محمد فمنقول من صفة أيضا ، وهي في معنى محمود ; ولكن فيه معنى المبالغة والتكرار . فالمحمد هو الذي حمد مرة بعد مرة . كما أن المكرم من الكرم مرة بعد مرة . وكذلك الممدح ونحو ذلك . فاسم محمد مطابق لمعناه ، والله سبحانه سماه قبل أن يسمي به نفسه . فهذا علم من أعلام نبوته ، إذ كان اسمه صادقا عليه ; فهو محمود في الدنيا لما هدي إليه ونفع به من العلم والحكمة . وهو محمود في الآخرة بالشفاعة . فقد تكرر معنى الحمد كما يقتضي اللفظ . ثم إنه لم يكن محمدا حتى كان أحمد ، حمد ربه فنبأه وشرفه ; فلذلك تقدم اسم أحمد على الاسم الذي هو محمد فذكره عيسى عليه السلام فقال : اسمه أحمد . وذكره موسى عليه السلام حين قال له ربه : تلك أمة أحمد ، فقال : اللهم اجعلني من أمة أحمد . فبأحمد ذكره قبل أن يذكره بمحمد ، لأن حمده لربه كان قبل حمد الناس له . فلما وجد وبعث كان محمدا بالفعل . وكذلك في الشفاعة يحمد ربه بالمحامد التي يفتحها عليه ، فيكون أحمد الناس لربه ثم يشفع فيحمد على شفاعته . وروي أن النبي صلى الله عليه وسلم قال : \" اسمي في التوراة أحيد ؛ لأني أحيد أمتي عن النار ، واسمي في الزبور الماحي ، محا الله بي عبدة الأوثان ، واسمي في الإنجيل أحمد واسمي في القرآن محمد لأني محمود في أهل السماء والأرض \" . وفي الصحيح : \" لي خمسة أسماء : أنا محمد ، وأحمد ، وأنا الماحي الذي يمحو الله بي الكفر ، وأنا الحاشر الذي تحشر الناس على قدمي ، وأنا العاقب \" . وقد تقدم .فلما جاءهم بالبينات قيل عيسى . وقيل : محمد صلى الله عليه وسلم .قالوا هذا سحر مبين قرأ الكسائي وحمزة \" ساحر \" نعتا للرجل . وروي أنها قراءة ابن مسعود . الباقون سحر نعتا لما جاء به الرسول .\n","ar.miqbas":"وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ فَلَمَّا جَاءَهُمْ بِالْبَيِّنَاتِ قَالُوا هَذَا سِحْرٌ مُبِينٌ (6)عطف على جملة { وإذ قال موسى لقومه } [ الصف : 5 ] فعلى الوجه الأول في موقع التي قبلها فموقع هذه مساوٍ له .وأما على الوجه الثاني في الآية السابقة فإن هذه مسوقة مساق التتميم لقصة موسى بذكر مثال آخر لقوم حادُوا عن طاعة رسول الله صلى الله عليه وسلم إليهم من غير إفادة تحذير للمخاطبين من المسلمين ، وللتخلص إلى ذكر أخبار عيسى بالرسول الذي يجيء بعده .ونادى عيسى قومه بعنوان { بني إسرائيل } دون { يا قوم } [ الصف : 5 ] لأن بني إسرائيل بعد موسى اشتهروا بعنوان «بني إسرائيل» ولم يطلق عليهم عنوان : قوم موسى ، إلا في مدة حياة موسى خاصة فإنهم إنما صاروا أمة وقوماً بسببه وشريعته .فأما عيسى فإنما كان مرسلاً بتأييد شريعة موسى ، والتذكير بها وتغيير بعض أحكامها ، ولأن عيسى حين خاطبهم لم يكونوا قد اتبعوه ولا صدّقوه فلم يكونوا قوماً له خالصين .وتقدم القول في معنى { مصدقاً لما بين يدي من التوراة } في أوائل سورة [ آل عمران : 50 ] وفي أثناء سورة العقود .والمقصود من تنبيههم على هذا التصديق حين ابتدأهم بالدعوة تقريب إجابتهم واستنزال طائرهم لشدة تمسكهم بالتوراة واعتقادهم أن أحكامها لا تقبل النسخ ، وأنها دائمة . ولذلك لما ابتدأهم بهذه الدعوة لم يزد عليها ما حكي عنه في سورة [ آل عمران : 50 ] من قوله : { ولأحل لكم بعض الذي حرم عليكم } ، فيحمل ما هنالك على أنه خطاب واقع بعد أول الدعوة فإن الله لم يوح إليه أوّل مرّة بنسخ بعض أحكام التوراة ثم أوحاه إليه بعد ذلك . فحينئذٍ أخبرهم بما أوحي إليه .وكذلك شأن التشريع أن يُلقَى إلى الأمة تدريجاً كما في حديث عائشة في صحيح البخاري } أنها قالت : «إنما أُنزل أوّل ما أُنزل منه ( أي القرآن ) سورة من المفصل فيها ذكر الجنة والنار حتى إذا ثاب الناس إلى الإِسلام نزل الحلال والحرام ، ولو أنزل أولَ شيء : لا تشربوا الخمر ، لقالوا : لا نترك الخمر أبداً ، ولو نزل : لا تزنوا : لقالوا : لا ندع الزنا أبداً . لقد نزل بمكة على محمد صلى الله عليه وسلم وإني لجاريةٌ ألعَب { بل الساعة موعدهم والساعة أدهى وأمر } [ القمر : 46 ] ، وما نزلت سورة البقرة والنساء إلا وأنا عنده» اه .فمعنى قوله : { مصدقاً لما بين يدي من التوراة } في كلتا الآيتين هو التصديق بمعنى التقرير والأعمال على وجه الجملة ، أي أعمال مجموعها وجمهرة أحكامها ولا ينافي ذلك أنه قد تغير بعض أحكامها بوحي من الله في أحوال قليلة .والتبشير : الإِخبار بحادث يسُرّ ، وأطلق هنا على الإِخبار بأمر عظيم النفع لهم لأنه يلزمه السرور الحق فإن مجيء الرسول إلى الناس نعمة عظيمة .ووجه إيثار هذا اللفظ الإِشارة إلى ما وقع في الإِنجيل من وصف رسالة الرسول الموعود به بأنها بشارة الملكوت .وإنما أخبرهم بمجيء رسول من بعده لأن بني إسرائيل لم يزالوا ينتظرون مجيء رسول من الله يخلصهم من براثن المتسلطين عليهم وهذا الانتظار ديدنهم ، وهم موعودون لهذا المخلّص لهم على لسان أنبيائهم بعد موسى . فكان وعد عيسى به كوعد من سبقه من أنبيائهم ، وفاتحهم به في أول الدعوة اعتناء بهذه الوصية .وفي الابتداء بها تنبيه على أن ليس عيسى هو المخلص المنتظر وأن المنتظر رسول يأتي من بعده وهو محمد صلى الله عليه وسلمولعظم شأن هذا الرسول الموعود به أراد الله أن يقيم للأمم التي يظهر فيها علامات ودلائل ليتبينوا بها شخصه فيكون انطباقها فاتحة لإِقبالهم على تلقّي دعوته ، وإنما يعرفها حقّ معرفتها الراسخون في الدين من أهل الكتاب لأنهم الذين يرجع إليهم الدهماء من أهل ملتهم قال تعالى : { الذين آتيناهم الكتاب يعرفونه كما يعرفون أبناءهم وإن فريقاً منهم ليكتمون الحق وهم يعلمون } [ البقرة : 146 ] . وقال : { قل كفى بالله شهيداً بيني وبينكم ومن عنده علم الكتاب } [ الرعد : 43 ] .وقد وصف الله بعض صفات هذا الرسول لموسى عليه السلام في قوله تعالى حكاية عن إجابته دعاء موسى { ورحمتي وسعت كل شيء فسأكتبها للذين يتقون إلى قوله : الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوباً عندهم في التوراة والإنجيل يأمرهم بالمعروف وينهاهم عن المنكر ويحل لهم الطيبات ويحرم عليهم الخبائث ويضع عنهم إصرهم والأغلال التي كانت عليهم } [ الأعراف : 157 ] .فلما أراد الله تعالى إعداد البشر لقبول رسالة هذا الرسول العظيم الموعود به صلى الله عليه وسلم استودعهم أشراطه وعلاماته على لسان كل رسول أرسله إلى الناس . قال تعالى : { وإذ أخذ الله ميثاق النبيئين لما آتيناكم من كتاب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه قال أأقررتم وأخذتم على ذلك إصري قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين فمن تولى بعد ذلك فأولئك هم الفاسقون } [ آل عمران : 81 - 82 ] أي أأخذتم إصري من أُممكم على الإِيمان بالرسول الذي يجيء مصدقاً للرسل . وقوله : { فاشهدوا } [ آل عمران : 81 ] ، أي على أُممكم وسيجيء من حكاية كلام عيسى في الإِنجيل ما يشرح هذه الشهادة .وقال تعالى في خصوص ما لَقّنه إبراهيمَ عليه السلام { ربنا وابعث فيهم رسولاً منهم يتلو عليهم آياتك ويعلمهم الكتاب والحكمة } [ البقرة : 129 ] الآية .وأوصى به عيسى عليه السلام في هذه الآية وصية جامعة لما تقدمها من وصايا الأنبياء وأجملها إجمالاً على طريق الرمز . وهو أسلوب من أساليب أهل الحكمة والرسالة في غير بيان الشريعة ، قال السّهروردي : في تلك حكمة الإِشراق «وكلمات الأوَّلين مرموزة» فقال قطب الدين الشيرازي في «شرحه» : «كانوا يرمزون في كلامهم إما تشحيذاً للخاطر باستكداد الفكر أو تشبهاً بالباري تعالى وأصحاببِ النواميس فيما أتوا به من الكتب المنزلة المرموزة لتكون أقرب إلى فهم الجمهور فينتفع الخواصّ بباطنها والعوام بظاهرها .ا ه» ، أي ليتوسمها أهل العلم من أهل الكتاب فيتحصل لهم من مجموع تفصيلها شمائل الرسول الموعود به ولا يلتبس عليهم بغيره ممن يدّعي ذلك كذباً . أو يدّعيه له طائفة من الناس كذباً أو اشتباهاً .ولا يحمل قوله : { اسمه أحمد } على ما يتبادر من لفظ اسم من أنه العلَم المجهول للدلالة على ذات معيَّنة لتميزه من بين من لا يشاركها في ذلك الاسم لأن هذا الحمل يمنع منه وأنه ليس بمطابق للواقع لأن الرسول الموعود به لم يدعه الناسُ أحمد فلم يكن أحد يدعو النبي محمداً صلى الله عليه وسلم باسم أحمد لا قبل نبوته ولا بعدها ولا يعْرف ذلك .وأما ما وقع في «الموطأ» و «الصحيحين» عن محمّد بن جبير بن مطعم عن أبيه عن النبي صلى الله عليه وسلم أنه قال : «لي خمسة أسماء : أنا محمد ، وأنا أحمد ، وأنا الماحي الذي يمحو الله به الكفر ، وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب» فتأويله أنه أطلق الأسماء على ما يشمل الاسم العَلَم والصفة الخاصة به على طريقة التغليب . وقد رويت له أسماء غيرها استقصاها أبو بكر ابن العربي في «العارضة» و«القَبس» .فالذي نُوقِن به أن محمل قوله : { اسمه أحمد } يجري على جميع ما تحمله جُزْءاً هذه الجملة من المعاني .فأما لفظ «اسم» فأشهر استعماله في كلام العرب ثلاثة استعمالات :أحدها : أن يكون بمعنى المسمّى . قال أبو عبيدة : الاسم هو المسمّى . ونَسب ثعلب إلى سيبويه أن الاسم غير المسمّى ( أي إذا أطلق لفظ اسم في الكلام فالمعنى به مسمّى ذلك الاسم ) لكن جَزم ابن السيد البَطَلْيَوسي في كتابه الذي جعله في معاني الاسم هَل هو عين المسمى ، أنه وقع في بعض مواضع من كتاب سيبويه أن الاسم هو المسمّى ، ووقع في بعضها أنه غير المسمّى ، فحمَله ابن السيد البطليوسي على أنهما إطلاقان ، وليس ذلك باختلاف في كلام سيبويه ، وتوقف أبو العباس ثعلب في ذلك فقال : ليس لي فيه قول . ولما في هذا الاستعمال من الاحتمال بطل الاستدلال به .الاستعمال الثاني : أن يكون الاسم بمعنى شهرة في الخير وأنشد ثعلب: ... لأعظمها قدراً وأكرمِها أباًوأحسنِها وجْهاً وأعلَنها سُمَى ... سُمىً لغة في اسم .الاستعمال الثالث : أن يطلق على لفظ جُعل دالاً على ذات لتميَّز من كثير من أمثالها ، وهذا هو العَلَم .ونحن نجري على أصلنا في حمل ألفاظ القرآن على جميع المعاني التي يسمح بها الاستعمال الفصيح كما في المقدمة التاسعة من مقدمات هذا التفسير ، فنحمل الاسم في قوله : { اسمه أحمد } على ما يجمع بين هذه الاستعمالات الثلاثة ، أي مسماه أحمد ، وِذكْره أحْمد ، وعَلَمه أحمَد ، ولنحمل لفظ أحمد على ما لا يأباه واحد من استعمالاتتِ اسم الثلاثةِ إذا قُرن به وهو أن أَحْمد اسم تفضيل يجوز أن يكون مسلوب المفاضلة معنياً به القوةُ فيم هو مشتق منه ، أي الحمدِ وهو الثناء ، فيكون أحمد هنا مستعملاً في قوةِ مفعولية الحَمد ، أي حَمْد الناس إياه ، وهذا مثل قولهم .«العَود أحمد» ، أي محمود كثيراً . فالوصف ب { أحمد } بالنسبة للمعنى الأول في اسم أن مسمّى هذا الرسول ونفسه موصوفة بأقوى ما يحمد عليه محمود فيشمل ذلك جميع صفات الكمال النفسانية والخُلقية والخَلقية والنسبية والقومية وغير ذلك مما هو معدود من الكمالات الذاتية والغرضية .ويصح اعتبار { أحمد } تفضيلاً حقيقياً في كلام عيسى عليه السّلام ، أي مسماه أحمد مني ، أي أفضل ، أي في رسالته وشريعته . وعبارات الإِنجيل تشعر بهذا التفضيل ، ففي إنجيل يوحنا في الإصحاح الرابع عشر «وأنا أطلب من الأب ( أي من ربنا ) فيعطيكم ( فارقليط ) آخر ليثبت معكم إلى الأبد روح الحق الذي لا يستطيع العالم أن يقبله لأنه لا يراه ولا يعرفه . ثم قال : وأما الفارقليط الروح القدس الذي سيرسله الأب ( الله ) باسمي فهو يعلِّمكم كل شيء ويذكركم بكل ما قلته لكم» ، أي في جملة ما يعلِّمكم أن يذكركم بكل ما قلته لكم . وهذا يفيد تفضيله على عيسى بفضيلة دوام شريعة المعبر عنها بقول الإِنجيل «ليثبت معكم إلى الأبد» وبفضيلة عموم شرعه للأحكام المعبر عنه بقوله : «يعلمكم كل شيء» .والوصف ب { أحمد } على المعنى الثاني في الاسم . أن سُمعتَه وذِكره في جيله والأجيال بعده موصوف بأنه أشدُّ ذكرٍ محمود وسمعةٍ محمودة .وهذا معنى قوله في الحديث «أنا حامل لواء الحمد يوم القيامة» وأن الله يبعثه مقاماً محموداً .ووصف { أحمد } بالنسبة إلى المعنى الثالث في الاسم رمز إلى أنه اسمه العَلَم يكون بمعنى : أحمد ، فإن لفظ محمَّد اسم مفعول من حَمَّد المضاعف الدال على كثرة حَمد الحامدين إياه كما قالوا : فلان ممَدَّح ، إذا تكرر مدحُه من مادحين كثيرين .فاسم «محمّد» يفيد معنى : المحمود حمداً كثيراً ورمز إليه بأحمد .وهذه الكلمة الجامعة التي أوحى الله بها إلى عيسى عليه السّلام أراد الله بها أن تكون شعاراً لجماع صفات الرسول الموعود به صلى الله عليه وسلم صيغت بأقصى صيغة تدل على ذلك إجمالاً بحسب ما تسمح اللغة بجمعه من معاني . ووُكل تفصيلها إلى ما يظهر من شمائله قبل بعثته وبعدها ليتوسمها المتوسمون ويتدبر مطاويها الراسخون عند المشاهدة والتجربة .جاء في إنجيل متَّى في الإِصحاح الرابع والعشرين قول عيسى «ويقوم أنبياء كذبة كثيرون ويضلون كثيراً ولكن الذي يصبر إلى المنتهى فهذا يخلص ويكرز ببشارة الملكوت هذه في كل المسكونة شهادة لجميع الأمم ثم يكون المنتهى» ، ومعنى يكرز يدعو وينبىء ، ومعنى يصير إلى المنتهى يتأخر إلى قرب الساعة .وفي إنجيل يوحنّا في الإِصحاح الرابع عشر «إن كنتم تحبونني فاحفظوا وصاياي وأنا أطلب من الأب فيعطيكم فارقليط آخر يثبت معكم إلى الأبد» . و ( فارقليط ) كلمة رومية ، أي بوانية تطلق بمعنى المُدافع أو المسلي ، أي الذي يأتي بما يدفع الأحزان والمصائب ، أي يأتي رحمة ، أي رسول مبشر ، وكلمة آخر صريحة في أنه رسول مثل عيسى .وفي الإصحاح الرابع عشر «والكلام الذي تسمعونه ليس لي بل الذي أرسلني . وبهذا كَلّمتُكم وأنا عندكم ( أي مدة وجودي بينكم ) ، وأما ( الفارقليط ) الروح القدسي الذي سيرسله الأب باسمي فهو يعلمكم كل شيء ويذكركم بكل ما قلته» ( ومعنى «باسمي» أي بصفة الرسالة ) لا أتكلم معكم كثيراً لأن رئيس هذا العالم يأتي وليس له فِيَّ شيء ولكن ليفهم العالم أني أحبّ الأب وكما أوصاني الأبُ أفعل» .وفي الإِصحاح الخامس عشر منه «ومتى جاء الفارقليط الذي سأرسله أنا إليكم من الأب روحُ الحق الذي من عند الأب ينبثق فهو يشهد لي» .وفي هذه الأخبار إثبات أن هذا الرسول المبشر به تعمّ رسالته جميع الأمم في جميع الأرض ، وأنه الخاتم ، وأن لشريعته مُلكاً لقول إنجيل متَّى «هو يكرز ببشارة الملكوت» والملكوت هو الملك ، وأن تعاليمه تتعلق بجميع الأشياء العارضة للناس ، أي شريعته تتعلق أحكامها بجميع الأحوال البشرية ، وجميعها مما تشمله الكلمة التي جاءت على لسان عيسى عليه السلام وهي كلمة { اسمه أحمد } فكانت من الرموز الإِلهية ولكونها مرادة لذلك ذكرها الله تعالى في القرآن تذكيراً وإعلاناً .وذِكر القرآن تبشيرَ عيسى بمحمدٍ عليهما الصلاة والسّلام إدماج في خلال المقصود الذي هو تنظير ما أوذي به موسى من قومه وما أوذي به عيسى من قومه إدماجاً يؤيد به النبي صلى الله عليه وسلم ويثبّت فؤاده ويزيده تسلية . وفيها تخلص إلى أن ما لقيه من قومه نظيرَ ما لقيه عيسى من بني إسرائيل .وقوله : { فلما جاءهم بالبينات قالوا هذا سحر مبين } هو مناط الأذى .فإن المتبادر أن يعود ضمير الرفع في قوله : { جاءهم } إلى عيسى ، وأن يعود ضمير النصب إلى الذين خاطبهم عيسى . والتقدير : فكذبوه ، فلما جاءهم بالمعجزات قالوا هذا سحر أو هُو ساحر .ويحتمل أن يكون ضمير الرفع عائداً إلى رسول يأتي من بعدي . وضمير النصب عائداً إلى لفظ بني إسرائيل ، أي بني إسرائيل غير الذين دعاهم عيسى عليه السلام من باب : عندي درهم ونصفه ، أي نصف ما يسمّى بدرهم ، أي فلما جاءهم الرسول الذي دعاه عيسى باسم أحمد بالبينات ، أي دلائل انطباق الصفات الموعود بها قالوا هذا سحر أو هذا ساحر مبين فيكون هذا التركيب مبين من قبيل الكلام الموجه . وحصل أذاهم بهذا القول لكلا الرسولين .فالجملة على هذا الاحتمال تُحمل على أنها اعتراض بين المتعاطفات وممهدة للتخلص إلى مذمة المشركين وغيرهم ممن لم يقبل دعوة محمد صلى الله عليه وسلموقرأ نافع وابن كثير وأبو عمرو وأبو بكر عن عاصم بفتح الياء من قوله : { بعديَ } . وقرأه الباقون بسكونها . قال في «الكشاف» : واختار الخليل وسيبويه الفتح .وقرأ الجمهور { هذا سحر } بكسر السين . وقرأه حمزة والكسائي وخلف { هذا ساحر } فعلى الأولى الإِشارة للبنات ، وعلى الثانية الإِشارة إلى عيسى أو إلى الرسول .\n","ar.waseet":"ثم ذكر - سبحانه - جانبا مما قاله عيسى - عليه السلام - لبنى إسرائيل ، فقا - تعالى - : ( وَإِذْ قَالَ عِيسَى . . . ) .أى : واذكر - أيضا - أيها الرسول الكريم - وذكِّر الناس ليعتبروا ويتعظوا ، وقت أن قال عيسى ابن مريم ، مخاطبا من أرسله الله إليهم بقوله : ( يابني إِسْرَائِيلَ إِنِّي رَسُولُ الله إِلَيْكُم ) لكى أخرجكم من ظلمات الكفر والشرك ، إلى نور الإيمان والتوحيد .ولم يقل لهم يا قوم - كما قال لهم - موسى - عليه السلام - بل قال : ( يابني إِسْرَائِيلَ ) لأنه لا أب له فيهم ، وإن كانت أمه منهم ، والأنساب إنما تكون من جهة الآباء ، لا من جهة الأمهات .وفى قوله ( إِنِّي رَسُولُ الله إِلَيْكُم ) إخبار صريح منه لهم ، بأنه ليس إلها وليس ابن إله - كما زعموا وإنما هو عبد الله ورسوله .وقوله ( مُّصَدِّقاً لِّمَا بَيْنَ يَدَيَّ مِنَ التوراة ) جملة حالية لإثبات حقيقة رسالته ، وحضهم على تأييده وتصديقه والإيمان به .أى : إنى رسول الله - تعالى - إليكم بالكتاب الذى أنزله الله علىَّ وهو الإنجيل ، حال كونى مصدقا للكتاب الذى أنزله الله - تعالى - على نبيه موسى - عليه السلام - وهذا الكتاب هو التوراة ، وما دام الأمر كذلك فمن حقى عليكم ، أن تؤمنوا به ، وأن تتبعونى ، لأنى لم آتكم بشىء يخالف التوراة ، بل هى مشتملة على ما يدل على صدقى ، فكيف تعرضون عن دعوتى .وقوله : ( مُّصَدِّقاً لِّمَا بَيْنَ يَدَيَّ ) فيه نوع مجاز ، لأن ما بين يدى الإنسان هو ما أمامه ، فسمى ما مضى كذلك لغاية ظهوره واشتهاره . واللام فى \" لما \" لتقوية العامل ، نحوه قوله - تعالى - ( فَعَّالٌ لِّمَا يُرِيدُ ) وقوله - سبحاه - : ( وَمُبَشِّراً بِرَسُولٍ يَأْتِي مِن بَعْدِي اسمه أَحْمَدُ ) معطوف على ما قبله .والتبشير : الإخبار بما يسر النفس ويبهجها ، بحيث يظهر أثر ذلك على بشرة الإنسان ، وكان إخباره بأن نبيا سيأتى من بعده اسمه تبشيرا ، لأنه سيأتيهم بما يسعدهم ، ويرفع الأغلال عنهم ، كما قال - تعالى - : ( وَيَضَعُ عَنْهُمْ إِصْرَهُمْ والأغلال التي كَانَتْ عَلَيْهِمْ ) ولفظ ( أَحْمَدُ ) اسم من أسماء نبينا - صلى الله عليه وسلم - وهو علم منقول من الصفة ، وهذه الصفة يصح أن تكون مبالغة من الفاعل . فيكون معناها : أنه - صلى الله عليه وسلم - أكثر حمدا لله - تعالى - من غيره .ويصح أن تكون من المفعول ، فيكون معناها أنه يحمده الناس لأجل ما فيه من خصال الخير ، أكثر مما يحمدوه غيره .قال الآلوسى : وهذا الاسم الجليل ، علم لنبينا محمد - صلى الله عليه وسلم - وصح من رواية مالك ، والبخارى ، ومسلم . . . عن جبير بن مطعم قال : قال رسول الله - صلى الله عليه وسلم - : \" إن لى أسماء؛ أنا محمد ، وأنا أحمد ، وأنا الحاشر الذى يحشر الناس على قدمى ، وأنا الماحى الذى يمحو الله بى الكفر ، وأنا العاقب \" .وبشارة عيسى - عليه السلام - بنبينا محمد - صلى الله عليه وسلم - ثابتة ثبوتا قطعيا بهذه الآية الكريمة ، وإذا كانت بعض الأناجيل قد خلت من هذه البشارة ، فبسبب ما اعتراها من تحريف وتبديل على أيدى علماء أهل الكتاب .ومع ذلك فقد وجدت هذه البشارة فى بعض الأناجيل ، كإنجيل يوحنا ، فى الباب الرابع عشر ، قال الإمام الرازى : فى الإصحاح الرابع عشر من إنجيل يوحنا هكذا : وأنا أطلب لكم إلى أبى ، حتى يمنحكم ويعطيكم الفارقليط حتى يكون معكم إلى الأبد .والفارقليط هو روح الحق واليقين .ومنهم من يرى أن لفظ فارقليط معناه باليونانية : أحمد أو محمد .ومن أصرح الأدلة على أن صفات الرسول - صلى الله عليه وسلم - موجودة فى التوراة والإنجيل ، قوله - تعالى - ( الذين يَتَّبِعُونَ الرسول النبي الأمي الذي يَجِدُونَهُ مَكْتُوباً عِندَهُمْ فِي التوراة والإنجيل ) وقوله - سبحانه - : ( فَلَمَّا جَاءَهُم بالبينات قَالُواْ هذا سِحْرٌ مُّبِينٌ ) بيان لموقف بنى إسرائيل الجحودى من أنبياء الله - تعالى - .والضمير فى قوله ( جَاءَهُم ) يرى بعضهم أنه يعود لعيسى ، ويرى آخرون أنه يعود لمحمد - صلى الله عليه وسلم - أى : فلما جاء عيسى - عليه السلام - أو محمد - صلى الله عليه وسلم - إلى بنى إسرئيل بالآيات البينات الدالة على صدقه ، قالوا على سبيل العناد والجحود : هذا سحر واضح فى بابه . لا يخفى على أى ناظر أو متأمل .ومن المعروف أن بنى إسرائيل قد كذبوا عيسى - عليه السلام - وكفروابه ، ونسبوا إلى أمه الطاهرة ، ما هى بريئة منه ، ومنزهة عنه .كما كذبوا محمدا - صلى الله عليه وسلم - وكفروا به ، وصدق الله إذ يقول : ( فَلَمَّا جَآءَهُمْ مَّا عَرَفُواْ كَفَرُواْ بِهِ فَلَعْنَةُ الله عَلَى الكافرين ) ووصفوا ما جاء به بأنه سحر مبين ، على سبيل المبالغة فكأنهم يقولون إن ما جاء به هو السحر بعينه ، مع أنهم يعرفون أن ما جاء به هو الحق كما يعرفون أبناءهم ، ولكن ما جلبوا عليه من جحود وعناد ، حال بينهم وبين النطق بكلمة الحق .\n","ar.baghawi":"( وإذ قال عيسى ابن مريم يا بني إسرائيل إني رسول الله إليكم مصدقا لما بين يدي من التوراة ومبشرا برسول يأتي من بعدي اسمه أحمد ) والألف فيه للمبالغة في الحمد وله وجهان : أحدهما : أنه مبالغة من الفاعل أي الأنبياء كلهم حمادون لله - عز وجل - وهو أكثر حمدا لله من غيره والثاني : أنه مبالغة في المفعول أي الأنبياء كلهم محمودون لما فيهم من الخصال الحميدة وهو [ أكثرهم مبالغة ] وأجمع للفضائل والمحاسن التي يحمد بها . ( فلما جاءهم بالبينات قالوا هذا سحر مبين ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5169.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5169.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5169.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَىٰ إِلَى الْإِسْلَامِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","transliteration":"Wa man azlamu mimma nif taraa 'alal laahil kaziba wa huwa yad'aaa ilal Islaam; wallaahu laa yahdil qawmaz zaalimeen","translations":{"en.ahmedali":"Who is more unjust than he who invents a lie against God when he is called to submit? God does not show the evil-doers the way.","en.ahmedraza":"And who is more unjust than one who fabricates a lie against Allah whereas he is being called towards Islam? And Allah does not guide the unjust people.","en.arberry":"And who does greater evil than he who forges against God falsehood, when he is being called unto surrender? And God guides never the people of the evildoers.","en.asad":"And who could be more wicked than one who invents [such] a lie about [a message from] God, seeing that he is [but] being called to self-surrender unto Him? But God does not bestow His guidance upon evil-doing folk.","en.daryabadi":"And who is a greater wrong-doer than he who fabricateth against Allah a lie even as he is summoned Unto Islam? And Allah guideth not a wrongdoing people.","en.hilali":"And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam? And Allah guides not the people who are Zalimun (polytheists, wrong-doers and disbelievers) folk.","en.pickthall":"And who doeth greater wrong than he who inventeth a lie against Allah when he is summoned unto Al-Islam? And Allah guideth not wrongdoing folk.","en.qaribullah":"And who does greater evil than he who forges a lie against Allah, when he is being called to Islam? Allah does not guide the harmdoing people.","en.sahih":"And who is more unjust than one who invents about Allah untruth while he is being invited to Islam. And Allah does not guide the wrongdoing people.","en.sarwar":"Who is more unjust than one who creates falsehood against God when he has already been invited to Islam? God does not guide the unjust people.","en.yusufali":"Who doth greater wrong than one who invents falsehood against Allah, even as he is being invited to Islam? And Allah guides not those who do wrong.","en.maududi":"Who would be more unjust than he who invents a lie about Allah the while he is being called to Islam? Allah does not direct such evildoing folk to the Right Way.","en.shakir":"And who is more unjust than he who forges a lie against Allah and he is invited to Islam, and Allah does not guide the unjust people.","en.itani":"And who is a greater wrongdoer than he who attributes falsehoods to God, when he is being invited to Islam? God does not guide the wrongdoing people.","en.mubarakpuri":"And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam And Allah guides not the people who are wrongdoers.","en.qarai":"Who is a greater wrongdoer than him who fabricates falsehoods against Allah, while he is being summoned to Islam? And Allah does not guide the wrongdoing lot.","en.wahiduddin":"Who could be more wicked than one who invents lies about God when called to submit to Him? God does not guide the wrongdoers:"},"tafsir":{"ar.muyassar":"ولا أحد أشد ظلمًا وعدوانًا ممن اختلق على الله الكذب، وجعل له شركاء في عبادته، وهو يُدعى إلى الدخول في الإسلام وإخلاص العبادة لله وحده. والله لا يوفِّق الذين ظلموا أنفسهم بالكفر والشرك، إلى ما فيه فلاحهم.","ar.jalalayn":"«ومن» أي لا أحد «أظلم» أشد ظلما «ممن افترى على الله الكذب» بنسبة الشريك والولد إليه ووصف آياته بالسحر «وهو يدعى إلى الإسلام والله لا يهدي القوم الظالمين» الكافرين.","ar.qurtubi":"قوله تعالى : ومن أظلم ممن افترى على الله الكذب وهو يدعى إلى الإسلام والله لا يهدي القوم الظالمين[ ص: 76 ] قوله تعالى : ومن أظلم أي لا أحد أظلم ممن افترى على الله الكذب تقدم في غير موضع .وهو يدعى إلى الإسلام هذا تعجب ممن كفر بعيسى ومحمد بعد المعجزات التي ظهرت لهما . وقرأ طلحة بن مصرف \" وهو يدعي \" بفتح الياء والدال وشدها وكسر العين ، أي ينتسب . ويدعي وينتسب سواء .والله لا يهدي القوم الظالمين أي من كان في حكمه أنه يختم له بالضلالة .\n","ar.miqbas":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَى إِلَى الْإِسْلَامِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ (7)كانت دعوة النبي صلى الله عليه وسلم مماثلة دعوة عيسى عليه السّلام وكان جواب الذين دعاهم إلى الإِسلام من أهل الكتابين والمشركين مماثلاً لجواب الذين دعاهم عليه السّلام . فلما أدمج في حكاية دعوة عيسى بشارته برسول يأتي من بعده ناسب أن ينقل الكلام إلى ما قابل به قوم الرسول الموعود دعوة رسولهم فلذلك ذكر في دعوة هذا الرسول دين الإِسلام فوصفوا بأنهم أظلم الناس تشنيعاً لحالهم .فالمراد من هذا الاستفهام هم الذين كذبوا النبي صلى الله عليه وسلم ولذلك عطف هذا الكلام بالوَاو ودون الفاء لأنه ليس مفرعاً على دعوة عيسى عليه السلام .وقد شمل هذا التشنيع جميع الذين كذبوا دعوة النبي صلى الله عليه وسلم من أهل الكتابين والمشركين .والمقصود الأول هم أهل الكتاب ، وسيأتي عند قوله تعالى : { يريدون ليطفئوا نور الله } إلى قوله : { ولو كره المشركون } [ الصف : 8 ، 9 ] فهما فريقان .والاستفهام ب { من أظلم } إنكار ، أي لا أحد أظلم من هؤلاء فالمكذبون مِن قبلهم ، إما أن يكونوا أظلم منهم وإمّا أن يساووهم على كل حال ، فالكلام مبالغة .وإنما كانوا أظلم الناس لأنهم ظلموا الرسول صلى الله عليه وسلم بنسْبِته إلى ما ليس فيه إذ قالوا : هو ساحر ، وظلموا أنفسهم إذ لم يتوخوا لها النجاة ، فيعرضوا دعوة الرسول صلى الله عليه وسلم على النظر الصحيح حتى يعلموا صدقه ، وظلموا ربهم إذ نسبوا ما جاءهم من هديه وحجج رسوله صلى الله عليه وسلم إلى ما ليس منه فسموا الآيات والحجج سحراً ، وظلموا الناس بحملهم على التكذيب وظلموهم بإخفاء الأخبار التي جاءت في التوراة والإِنجيل مُثبتة صدق رسول الإِسلام صلى الله عليه وسلم وكمل لهم هذا الظلم بقوله تعالى : { والله لا يهدي القوم الظالمين } ، فيعلم أنه ظلم مستمر .وقد كان لجملة الحال { وهو يدعى إلى الإسلام } موقع متين هنا ، أي فعلوا ذلك في حين أن الرسول يدعوهم إلى ما فيه خيرهم فعَاضوا الشكر بالكفر .وإنما جُعل افتراؤهم الكذب على الله لأنهم كذبوا رسولاً يخبرهم أنه مرسل من الله فكانت حُرمة هذه النسبة تقتضي أن يُقبلوا على التأمل والتدبر فيما دعاهم إليه ليصلوا إلى التصديق ، فلما بادروها بالإِعراض وانتحلوا للداعي صفات النقص كانوا قد نسبوا ذلك إلى الله دون توقير .فأما أهل الكتاب فجحدوا الصفات الموصوفة في كتابهم كما قال تعالى فيهم { ومن أظلم ممن كتم شهادة عنده من الله } في سورة [ البقرة : 140 ] . وذلك افتراء .وأما المشركون فإنهم افتروا على الله إذ قالوا : { ما أنزل الله على بشر من شيء } [ الأنعام : 91 ] .واسم { الإسلام } عَلم للدين الذي جاء به النبي صلى الله عليه وسلم وهو جامع لما فيه خير الدنيا والآخرة فكان ذكر هذا الاسم في الجملة الحالية زيادة في تشنيع حال الذين أعرضوا عنه ، أي وهو يُدعى إلى ما فيه خيره وبذلك حق عليه وصف { أظلم } .وجملة { والله لا يهدي القوم الظالمين } تأييس لهم من الإِقلاع عن هذا الظلم ، أي أن الذين بلغوا هذا المبلغ من الظلم لا طمع في صلاحهم لتمكُن الكفرِ منهم حتى خالط سجاياهم وتقوّم مع قوميتهم ، ولذلك أقحم لفظ { القوم } للدلالة على أن الظلم بلغ حدَّ أن صار من مقومات قَوميتهم كما تقدم في قوله تعالى : { لآيات لقوم يعقلون } في سورة [ البقرة : 164 ] . وتقدم غير مرة .وهذا يعم المخبر عنهم وأمثالهم الذين افتروا على عيسى ، ففيها معنى التذييل .وأسند نفي هديهم إلى الله تعالى لأن سبب انتفاء هذا الهدي عنهم أثر من آثار تكوين عقولهم ومداركهم على المكابرة بأسباب التكوين التي أودعها الله في نظام تكوّن الكائنات وتطورها من ارتباط المسببات بأسبابها مع التنبيه على أن الله لا يتدارك أكثرهم بعنايته ، فمُغَيِّر فيهم بعض القوى المانعة لهم من الهدى غضباً عليهم إذ لم يخلفوا بدعوة تستحق التبصر بسبب نسبتها إلى جانب الله تعالى حتى يتميز لهم الصدق من الكذب والحق من الباطل .\n","ar.waseet":"ثم بين - سبحانه - أن هؤلاء المشركين هم أشد الناس ظلما للحق ، وأنه - سبحانه - سيظهره لا محالة ، رضوا بذلك أم كرهوا وأن هذا الدين سيظهره الله - تعالى - على بقية الأديان ، مهما كره الكافرون . فقال - تعالى - : ( وَمَنْ أَظْلَمُ . . . ) .الاستفهام فى قوله : ( وَمَنْ أَظْلَمُ مِمَّنِ افترى عَلَى الله الكذب ) للإنكار والنفى . والافتراء : اختلاق الكذب واختراعه من جهة الشخص دون أن يكون له أساس من الصحة ، وقوله : ( وَهُوَ يدعى إِلَى الإسلام ) جملة حالية .أى : ولا أحد أشد ظلما من إنسان يختلق الكذب من عند نفسه على دين الله - تعالى - وشريعته ، والحال أن هذا الإنسان يدعوه الداعى إلى الدخول فى دين الإسلام الذى لا يرتضى الله - تعالى - سواه دينا .( والله ) - تعالى - ( لاَ يَهْدِي القوم الظالمين ) إلى ما فيه فلاحهم ، لسوء استعدادهم ، وإيثارهم الباطل على الحق .\n","ar.baghawi":"\"ومن أظلم ممن افترى على الله الكذب وهو يدعى إلى الإسلام والله لا يهدي القوم الظالمين\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5170.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5170.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5170.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ","transliteration":"Yureedoona liyutfi'oo nooral laahi bi afwaahimim wallaahu mutimmu noorihee wa law karihal kaafiroon","translations":{"en.ahmedali":"They want to extinguish the light of God by uttering blasphemies. But God wills to perfect His light, however the unbelievers may dislike it.","en.ahmedraza":"They wish to put out Allah’s light with their mouths, whereas Allah will perfect His light even if the disbelievers get annoyed.","en.arberry":"They desire to extinguish with their mouths, the light of God; but God will perfect His light, though the unbelievers be averse.","en.asad":"They aim to extinguish God's light with their utterances: but God has willed to spread His light in all its fullness, however hateful this may be to all who deny the truth","en.daryabadi":"Fain would they extinguish the light of Allah is with their mouths and Allah is going to perfect His light, even though averse may be the infidels.","en.hilali":"They intend to put out the Light of Allah (i.e. the religion of Islam, this Quran, and Prophet Muhammad SAW) with their mouths. But Allah will complete His Light even though the disbelievers hate (it).","en.pickthall":"Fain would they put out the light of Allah with their mouths, but Allah will perfect His light however much the disbelievers are averse.","en.qaribullah":"They seek to extinguish the Light of Allah with their mouths; but Allah will complete His Light, much as the unbelievers dislike it.","en.sahih":"They want to extinguish the light of Allah with their mouths, but Allah will perfect His light, although the disbelievers dislike it.","en.sarwar":"They want to put out the light of God with their mouths, but God will certainly make His light shine forever - even though the disbelievers may dislike this.","en.yusufali":"Their intention is to extinguish Allah's Light (by blowing) with their mouths: But Allah will complete (the revelation of) His Light, even though the Unbelievers may detest (it).","en.maududi":"They seek to extinguish Allah's light (by blowing) with their mouths, but Allah shall spread His light in all its fullness, howsoever the unbelievers may abhor this.","en.shakir":"They desire to put out the light of Allah with their mouths but Allah will perfect His light, though the unbelievers may be averse.","en.itani":"They want to extinguish God’s Light with their mouths; but God will complete His Light, even though the disbelievers dislike it.","en.mubarakpuri":"They intend to put out the Light of Allah with their mouths. But Allah will bring His Light to perfection even though the disbelievers hate (it).","en.qarai":"They desire to put out the light of Allah with their mouths, but Allah will perfect His light though the faithless should be averse.","en.wahiduddin":"they wish to put His light out with their mouths. But He will perfect His light, much as those who deny the truth may dislike it;"},"tafsir":{"ar.muyassar":"يريد هؤلاء الظالمون أن يبطلوا الحق الذي بُعِثَ به محمد صلى الله عليه وسلم- وهو القرآن- بأقوالهم الكاذبة، والله مظهر الحق بإتمام دينه ولو كره الجاحدون المكذِّبون.","ar.jalalayn":"«يريدون ليطفئوا» منصوب بأن مقدرة واللام مزيدة «نور الله» شرعه وبراهينه «بأفواههم» بأقوالهم إنه سحر وشعر وكهانة «والله متمٌّ» مظهر «نورهُ» وفي قراءة بالإضافة «ولو كره الكافرون» ذلك.","ar.qurtubi":"قوله تعالى : يريدون ليطفئوا نور الله بأفواههم والله متم نوره ولو كره الكافرونقوله تعالى : يريدون ليطفئوا نور الله بأفواههم الإطفاء هو الإخماد ، يستعملان في النار ، ويستعملان فيما يجري مجراها من الضياء والظهور . ويفترق الإطفاء والإخماد من وجه ; وهو أن الإطفاء يستعمل في القليل والكثير ، والإخماد إنما يستعمل في الكثير دون القليل ; فيقال : أطفأت السراج ; ولا يقال أخمدت السراج .وفي نور الله هنا خمسة أقاويل : أحدها : أنه القرآن ; يريدون إبطاله وتكذيبه بالقول ; قاله ابن عباس وابن زيد . والثاني : أنه الإسلام ; يريدون دفعه بالكلام ; قاله السدي . الثالث : أنه محمد صلى الله عليه وسلم ; يريدون هلاكه بالأراجيف ; قاله الضحاك . الرابع : حجج الله ودلائله ; يريدون إبطالها بإنكارهم وتكذيبهم ; قاله ابن بحر . الخامس : أنه مثل مضروب ; أي من أراد إطفاء نور الشمس بفيه فوجده مستحيلا ممتنعا فكذلك من أراد إبطال الحق ; حكاه ابن عيسى . وسبب نزول هذه الآية ما حكاه عطاء عن ابن عباس : أن النبي صلى الله عليه وسلم أبطأ عليه الوحي أربعين يوما ; فقال كعب بن الأشرف : يا معشر اليهود ، أبشروا ! فقد أطفأ الله نور محمد فيما كان ينزل عليه ، وما كان ليتم أمره ; فحزن رسول الله صلى الله عليه وسلم ; فأنزل الله تعالى هذه الآية واتصل الوحي بعدها ; حكى جميعه الماوردي رحمه الله .والله متم نوره أي بإظهاره في الآفاق . وقرأ ابن كثير وحمزة والكسائي وحفص عن عاصم والله متم نوره بالإضافة على نية الانفصال ; كقوله تعالى : كل نفس ذائقة الموت وشبهه ، حسب ما تقدم بيانه في \" آل عمران \" . الباقون \" متم نوره \" لأنه فيما يستقبل ; فعمل .ولو كره الكافرون من سائر الأصناف .\n","ar.miqbas":"يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ (8)استئناف بياني ناشىء عن الإِخبار عنهم بأنهم افتروا على الله الكذب في حال أنهم يُدعون إلا الإِسلام لأنه يثير سؤال سائل عما دعاهم إلى هذا الافتراء . فأجيب بأنهم يريدون أن يخفوا الإِسلام عن الناس ويعوقوا انتشاره ومثلت حالتهم بحالة نفر يبتغون الظلام للتّلصّص أو غيره مما يراد فيه الاختفاء .فلاحت له ذُبالة مصباح تضيء للناس ، فكرهوا ذلك وخشُوا أن يُشعَّ نوره على الناس فتفتضح ترهاتهم ، فعمدوا إلى إطفائه بالنفخ عليه فلم ينطَفِىءْ ، فالكلام تمثيل دال على حالة الممثل لهم . والتقدير : يريدون عوق ظهور الإِسلام كمثل قوم يريدون إطفاء النور ، فهذا تشبيه الهيئة بالهيئة تشبيه المعقول بالمحسوس .ثم إن ما تضمنه من المحاسن أنه قابِل لتفرقة التشبيه على أجزاء الهيئة ، فاليَهود في حال إرادتهم عوق الإِسلام عن الظهور مشبَّهون بقوم يريدون إطفاء نور الإِسلام فشبه بمصباح . والمشركون مثلُهم وقد مُثّل حال أهل الكتاب بنظير هذا التمثيل في قوله تعالى : { وقالت اليهود عزير ابن الله } إلى قوله : { يريدون أن يطفئوا نور الله بأفواههم ويأبى الله إلا أن يتم نوره } الآية في سورة [ براءة : 30 - 32 ] ، ووصفهم القرآن بأنه سحر ونحو ذلك من تمويهاتهم ، فشبه بنفخ النافخين على المصباح فكان لذكر بأفواههم } وقع عظيم في هذا التمثيل لأن الإِطفاء قد يكون بغير الأفواه مثل المروحة والكِير ، وهم أرادوا إبطال آيات القرآن بزعم أنها من أقوال السحر .وإضافة نور إلى اسم الجلالة إضافة تشريف ، أي نوراً أوقده الله ، أي أوجده وقدَّره فما ظنكم بكماله .واللام من قوله : { ليطفئوا } تسمّى اللام الزائدة ، وتفيد التأكيد . وأصلها لام التعليل ، ذُكِرت علةُ فعل الإِرادة عوضاً عن مفعوله بتنزيل المفعول منزلة العلة .والتقدير : يريدون إطفاء نور الله ليطفئوا . ويكثر وقوع هذه اللام بعد مادة الإِرادة ومادة الأمر . وقد سماها بعض أهل العربية : لام ( أَنْ ) لأن معنى ( أَنْ ) المصدرية ملازم لها . وتقدم الكلام عليها عند قوله تعالى : { يريد الله ليبين لكم } في سورة [ النساء : 26 ] . فلذلك قيل : إن هذه اللام بعد فعل الإِرادة مزيدة للتأكيد .وجملة والله متم نوره } معطوفة على جملة { يريدون } وهي إخبار بأنهم لا يبلغون مرادهم وأن هذا الدِّين سيتم ، أي يبلغ تمام الانتشار . وفي الحديث «والله لَيِتَمَّن هذا الأمرُ حتى يسيرَ الراكبُ من صنَعاء إلى حضرَموت لا يخاف إلا الله أو الذئب على غنمه ولكنكم تستعجلون» .والجملة الاسمية تفيد ثبوت هذا الإِتمام . والتمام : هو حصول جميع ما للشيء من كيفية أو كمية ، فتمام النور : حصول أقوى شعاعه وإتمامه إمداد آلته بما يقوى شعاعه كزيادة الزيت في المصباح وإزالة ما يغشاه .وجملة { ولو كره الكافرون } حالية و { لو } وصلية ، وهي تدل على أن مضمون شرطها أجدر ما يُظَنُّ أن لا يحصل عند حصوله مضمونُ الجوَاب .ولذلك يقدِّر المعربون قبله ما يدلّ على تقدير حصول ضد الشرط . فيقولون هذا إذا لم يكن كذا بل وإن كان كذا ، وهو تقدير معنى لا تقدير حذف لأن مثل ذلك المحذوف لا يطرد في كل موقع فإنه لا يستقيم في مثل قوله تعالى : { وما أنت بمؤمن لنا ولو كنا صادقين } [ يوسف : 17 ] ، إذ لا يقال : هذا إذا كنّا كاذبين ، بل ولو كنا صادقين . وكذلك ما في هذه الآية لأن المعنى : والله متمّ نورَه على فرض كراهة الكافرين ، ولما كانت كراهة الكافرين إتمام هذا النور محققةً كان سياقها في صورة الأمر المفروض تهكماً . وتقدم استعمال ( لو ) هذه عند قوله تعالى : { فلن يقبل من أحدهم ملء الأرض ذهباً ولو افتدى به } في سورة [ آل عمران : 91 ] .وإنما كانت كراهية الكافرين ظهور نور الله حالة يُظنّ انتفاء تمام النور معها ، لأن تلك الكراهية تبعثهم على أن يتألبوا على إحداث العراقيل وتضليل المتصدين للاهتداء وصرفهم عنه بوجوه المكر والخديعة والكيد والإِضرار .وشمل لفظ الكافرون } جميع الكافرين بالإِسلام من المشركين وأهل الكتاب وغيرهم .ولكن غلب اصطلاح القرآن على تخصيص وصف الكافرين بأهل الكتاب ومقابلتهم بالمشركين أو الظالمين ويتجه على هذا أن يكون الاهتمام بذكر هؤلاء بعد { لو } الوصلية لأن المقام لإِبطال مرادهم إطفاء نور الله فإتمام الله نوره إبطال لمرادهم إطفاءَه . وسيرد بعد هذا ما يبطل مراد غيرهم من المعاندين وهم المشركون .وقرأ نافع وأبو عَمرو وابن عامر وأبو بكر عن عاصم { متمٌ نورَه } بتنوين { متمٌ } ونصب { نورَه } . وقرأه ابن كثير وحمزة والكسائي وحفص وخلف بدون تنوين وجَرّ { نورِه } على إضافة اسم الفاعل على مفعوله وكلاهما فصيح .\n","ar.waseet":"ثم بين - سبحانه - ما يهدف إليه هؤلاء الظالمون من رواء افترائهم الكذب على الدين الحق ، فقال - تعالى - : ( يُرِيدُونَ لِيُطْفِئُواْ نُورَ الله بِأَفْوَاهِهِمْ ) .والمراد بنور الله : دين الإسلام الذى ارتضاه - سبحانه - لعباده دينا ، وبعث به رسوله - صلى الله عليه وسلم - وقيل المراد به : حججه الدالة على وحدانيته - تعالى - وقيل المراد به : القرآن . . . وهى معان متقاربة .والمراد بإطفاء نور الله : محاولة طمسه وإبطاله والقضاء عليه ، بكل وسيلة يستطيعها أعداؤه ، كإثارتهم للشبهات من حول تعاليمه ، وكتحريضهم لمن كان على شاكلتهم فى الضلال على محاربته .والمراد بأفواههم : أقوالهم الباطلة الخارجة من تلك الأفواه التى تنطق بما لا وزن له من الكلام .والمعنى : يريد هؤلاء الكافرون بالحق ، أن يقضوا على دين الإسلام ، وأن يطمسوا تعاليمه السامية التى جاء بها النبى - صلى الله عليه وسلم - عن طريق أقاويلهم الباطلة الصادرة عن أفواههم ، من غير أن يكون لها مصداق من الواقع تنبق عليه ، أو أصل تستند إليه ، وإنما هى أقوال من قبيل اللغو الساقط المهمل الذى لا وزن له ولا قيمة .قال صاحب الكشاف : مثَّل حالهم فى طلبهم إبطال نبوة النبى - صلى الله عليه وسلم - بالتكذيب ، بحال من يريد أن ينفخ فى نور عظيم منبثق فى الآفاق يريد الله أن يزيده ويبلغه الغاية القصوى فى الإشراق أو الإضاءة ، ليطفئه بنفخه ويطمسه .والجملة الكريمة فيها ما فيها من التهكم والاستهزاء بهؤلاء الكافرين ، حيث شبههم - سبحانه - فى جهالاتهم وغفلتهم ، بحال من يريد إطفاء نور الشمس الوهاج ، بنفخة من فمه الذى لا يستطيع إطفاء ما هو دون ذلك بما لا يحصى من المرات .وقوله - تعالى - : ( والله مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الكافرون ) بشارة للمؤمنين بأن ما هم عليه من حق ، لا بد أن يعم الآفاق .أى : والله - تعالى - بقدرته التى لا يعجزها شىء ، متم نوره ، ومظهر دينه ومؤيد نبيه - صلى الله عليه وسلم - ولو كره الكافرون ذلك فإن كراهيتهم لظهور دين الله - تعالى - لا أثر لها ولا قيمة .فالآية الكريمة وعد من الله - تعالى - للمؤمنين ، بإظهار دينهم ، وإعلاء كلمتهم ، لكى يزيدهم ذلك ثباتا على ثباتهم ، وقوة على قوتهم .\n","ar.baghawi":"\"يريدون ليطفئوا نور الله بأفواههم والله متم نوره ولو كره الكافرون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5171.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5171.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5171.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ","transliteration":"Huwal lazee arsala Rasoolahoo bilhudaa wa deenil haqqi liyuzhirahoo 'alad deeni kullihee wa law karihal mushrikoon","translations":{"en.ahmedali":"It is He who sent His Apostle with the guidance and the true way to raise it above all faiths, however the idolaters may dislike it.","en.ahmedraza":"It is He Who has sent His Noble Messenger with guidance and the religion of truth, in order that He may make it prevail over all other religions, even if the polytheists get annoyed.","en.arberry":"It is He who has sent His Messenger with the guidance and the religion of truth, that he may uplift it above every religion, though the unbelievers be averse.","en.asad":"He it is who has sent forth His Apostle with [the task of] spreading guidance and the religion of truth, to the end that He make it prevail over all [false] religion, however hateful this may be to those who ascribe divinity to aught but God.","en.daryabadi":"He it is Who hath sent His apostle with the guidance and the true religion, that He may make it triumph over all religion, even though averse may be associaters.","en.hilali":"He it is Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islamic Monotheism) to make it victorious over all (other) religions even though the Mushrikun (polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammed SAW) hate (it).","en.pickthall":"He it is Who hath sent His messenger with the guidance and the religion of truth, that He may make it conqueror of all religion however much idolaters may be averse.","en.qaribullah":"It is He who has sent His Messenger with guidance and the Religion of Truth, so that He raises it above all religions, much as the unbelievers dislike it.","en.sahih":"It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it.","en.sarwar":"It is He who has sent His Messenger with guidance and the true religion to stand supreme over all religions, even though the pagans may dislike it.","en.yusufali":"It is He Who has sent His Messenger with Guidance and the Religion of Truth, that he may proclaim it over all religion, even though the Pagans may detest (it).","en.maududi":"He it is Who has sent forth the Messenger with the Guidance and the True Religion that He may make it prevail over all religion, however those that associate aught with Allah in His Divinity might dislike this.","en.shakir":"He it is Who sent His Apostle with the guidance and the true religion, that He may make it overcome the religions, all of them, though the polytheists may be averse.","en.itani":"It is He who sent His Messenger with the guidance and the true religion, to make it prevail over all religions, even though the idolaters dislike it.","en.mubarakpuri":"He it is Who has sent His Messenger with guidance and the religion of truth to make it victorious over all religions even though idolators hate (it).","en.qarai":"It is He who has sent His Apostle with guidance and the true religion that He may make it prevail over all religions though the polytheists should be averse.","en.wahiduddin":"it is He who has sent His Messenger with guidance and the true religion, so that He may cause it to prevail over all religions, however much the polytheists may dislike it."},"tafsir":{"ar.muyassar":"الله هو الذي أرسل رسوله محمدًا بالقرآن ودين الإسلام؛ ليعليه على كل الأديان المخالفة له، ولو كره المشركون ذلك.","ar.jalalayn":"«هو الذي أرسل رسوله بالهدى ودين الحق ليظهره» يعليه «على الدين كله» جميع الأديان المخالفة له «ولو كره المشركون» ذلك.","ar.qurtubi":"قوله تعالى : هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركونقوله تعالى : هو الذي أرسل رسوله بالهدى أي محمدا بالحق والرشاد .ليظهره على الدين كله أي بالحجج . ومن الظهور الغلبة باليد في القتال ; وليس المراد بالظهور ألا يبقى دين آخر من الأديان ، بل المراد يكون أهل الإسلام عالين غالبين . ومن الإظهار ألا يبقى دين سوى الإسلام في آخر الزمان . قال مجاهد : وذلك إذا نزل عيسى لم يكن في الأرض دين إلا دين الإسلام . وقال أبو هريرة : ليظهره على الدين كله بخروج عيسى . وحينئذ لا يبقى كافر إلا أسلم . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" لينزلن ابن مريم حكما عادلا ، فليكسرن الصليب ، وليقتلن الخنزير ، وليضعن الجزية ، ولتتركن القلاص فلا يسعى عليها ، ولتذهبن الشحناء والتباغض والتحاسد ، وليدعون إلى المال فلا يقبله أحد \" . وقيل : ليظهره أي ليطلع محمدا صلى الله عليه وسلم على سائر الأديان ; حتى يكون عالما بها عارفا بوجوه بطلانها ، وبما حرفوا وغيروا منها . على الدين أي الأديان ; لأن الدين مصدر يعبر به عن جمع .\n","ar.miqbas":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ (9)هذا زيادة تحدِّ للمشركين وأحلافهم من أهل الكتاب فيه تقوية لمضمون قوله : { والله متم نوره ولو كره الكافرون } [ الصف : 8 ] . وفيه معنى التعليل للجملة التي قبله . فقد أفاد تعريفُ الجزأيْن في قوله : { هو الذي أرسل رسوله } قصراً إضافياً لقلببِ زَعْم الكافرين أن محمّداً صلى الله عليه وسلم أتى من قِبَللِ نفسه ، أي الله لا غيره أرسل محمداً صلى الله عليه وسلم بالهدى ودين الحق . وأن شيئاً تولى الله فعله لا يستطيع أحد أن يزيله .وتعليل ذلك بقوله : { ليظهره على الدين كله } إعلام بأن الله أراد ظهور هذا الدين وانتشاره كيلا يطمعوا أن يناله ما نال دين عيسى عليه السّلام من القمع والخفت في أول أمره واستمر زماناً طويلاً حتى تنصَّر قسطنطينُ سلطانُ الروم ، فلما أخبر الله بأنه أراد إظهار دين الإِسلام على جميع الأديان عُلم أن أمره لا يزال في ازدياد حتى يتمّ المراد .والإِظهار : النصر ويطلق على التفضيل والإِعلاء المعنوي .والتعريف في قوله : { على الدين } تعريف الجنس المفيد للاستغراق ، أي ليعلي هذا الدين الحق على جميع الأديان وينصر أهله على أهل الأديان الأخرى الذين يتعرضون لأهل الإسلام .ويظهر أن لفظ { الدين } مستعمل في كلا معنييه : المعنى الحقيقي وهو الشريعة . والمعنى المجازي وهو أهل الدّين كما تقول : دخلت قرية كذا وأكرمتني ، فإظهار الدين على الأديان بكونه أعلى منها تشريعاً وآداباً ، وأصلح بجميع الناس لا يخص أمة دون أخرى ولا جيلاً دون جيل .وإظهار أهله على أهل الأديان بنصر أهله على الذين يشاقُّونهم في مدة ظهوره حتى يتمّ أمره ويستغني عمن ينصره .وقد تمّ وعد الله وظهر هذا الدين وملك أهله أمماً كثيرة ثم عرضت عوارض من تفريط المسلمين في إقامة الدين على وجهه فغلبت عليهم أمم ، فأمّا الدين فلم يزل عالياً مشهوداً له من علماء الأمم المنصفين بأنه أفضل دين للبشر .وخص المشركون بالذكر هنا إتماماً للذين يكرهون إتمام هذا النور ، وظهور هذا الدين على جميع الأديان . ويعلم أن غير المشركين يكرهون ظهور هذا الدين لأنهم أرادوا إطفاء نور الدين لأنهم يكرهون ظهور هذا الدين فحصل في الكلام احتباك .\n","ar.waseet":"ثم أكد - سبحانه - وعده بإتمام نوره ، وبين كيفية هذا الإتمام فقال : ( هُوَ الذي أَرْسَلَ رَسُولَهُ بالهدى وَدِينِ الحق لِيُظْهِرَهُ عَلَى الدين كُلِّهِ . . . ) .والمراد بالهدى : القرآن الكريم : المشتمل على الإرشادات السامية ، والتوجيهات القويمة ، والأخبار الصادقة ، والتشريعات الحكيمة .والمراد بدين الحق : دين الإسلام الذى هو خاتم الأديان .وقوله : ( لِيُظْهِرَهُ عَلَى الدين كُلِّهِ ) من الإظهار بمعنى الإعلاء والغلبة بالحجة والبرهان ، والسيادة والسلطان .والجملة تعليلية لبيان سبب هذا الإرسال والغاية منه .والضمير فى \" ليظهره \" يعود على الدين الحق ، أوعلى الرسول - صلى الله عليه وسلم - أى : هو الله - سبحانه - الذى أرسل رسوله محمدا - صلى الله عليه وسلم - بالقرآن الهادى للتى هى أقوم . وبالدين الحق الثابت الذى لا ينسخه دين آخر ، وكان هذا الإرسال لإظهار هذا الدين الحق على سائر الأديان بالحجة والغلبة .( وَلَوْ كَرِهَ المشركون ) ذلك ، فإن كراهيتهم لا أثر لها فى ظهوره ، وفى إعلائه على جميع الأديان .ولقد أنجز الله - تعالى - وعده ، حيث جعل دين الإسلام ، هو الدين الغالب على جميع الأديان ، بحججه وبراهينه الدالة على أنه الدين الحق الذى لا يحوم حوله باطل .هذا ، وقد ساق الإمام ابن كثير بعض الأحاديث التى تؤيد ذلك ، ومنها : ما ثبت فى الصحيح عن رسول الله - صلى الله عليه وسلم - أنه قال : \" إن الله زوى لى الأرض مشارقها ومغاربها ، وسيبلغ ملك أمتى ما زوى لى منها \" .\n","ar.baghawi":"\" هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون \".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5172.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5172.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5172.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَىٰ تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ","transliteration":"Yaaa ayyuhal lazeena aammano hal adullukum 'alaa tijaaratin tunjeekum min 'azaabin aleem","translations":{"en.ahmedali":"O you who believe, may I offer you a bargain which will save you from a painful punishment?","en.ahmedraza":"O People who Believe! Shall I show you a trade that can save you from the painful punishment?","en.arberry":"O believers, shall I direct you to a commerce that shall deliver you from a painful chastisement?","en.asad":"O YOU who have attained to faith! Shall I point out to you a bargain that will save you from grievous suffering [in this world and in the life to come]?","en.daryabadi":"O ye who believe! shall direct you to a merchandise that will deliver you from a torment afflictive?","en.hilali":"O You who believe! Shall I guide you to a commerce that will save you from a painful torment.","en.pickthall":"O ye who believe! Shall I show you a commerce that will save you from a painful doom?","en.qaribullah":"Believers! Shall I direct you to a commerce that will save you from a painful punishment?","en.sahih":"O you who have believed, shall I guide you to a transaction that will save you from a painful punishment?","en.sarwar":"Believers, shall I show you a bargain which will save you from the painful torment?","en.yusufali":"O ye who believe! Shall I lead you to a bargain that will save you from a grievous Penalty?-","en.maududi":"Believers, shall I direct you to a commerce that will deliver you from a grievous chastisement?","en.shakir":"O you who believe! shall I lead you to a merchandise which may deliver you from a painful chastisement?","en.itani":"O you who believe! Shall I inform you of a trade that will save you from a painful torment?","en.mubarakpuri":"O you who believe! Shall I guide you to a trade that will save you from a painful torment","en.qarai":"O you who have faith! Shall I show you a deal that will deliver you from a painful punishment?","en.wahiduddin":"Believers! Shall I guide you to a profitable course that will save you from a painful punishment?"},"tafsir":{"ar.muyassar":"يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، هل أُرشِدكم إلى تجارة عظيمة الشأن تنجيكم من عذاب موجع؟","ar.jalalayn":"«يا أيها الذين آمنوا هل أدلكم على تجارة تنجيكم» بالتخفيف والتشديد «من عذاب أليم» مؤلم، فكأنهم قالوا نعم فقال:","ar.qurtubi":"قوله تعالى : يا أيها الذين آمنوا هل أدلكم على تجارة قال مقاتل : نزلت في عثمان بن مظعون ; وذلك أنه قال لرسول الله صلى الله عليه وسلم : لو أذنت لي فطلقت خولة ، وترهبت واختصيت وحرمت اللحم ، ولا أنام بليل أبدا ، ولا أفطر بنهار أبدا ! فقال رسول الله صلى الله عليه وسلم : \" إن من سنتي النكاح ، ولا رهبانية في الإسلام ، إنما رهبانية أمتي الجهاد في سبيل الله ، وخصاء أمتي الصوم ، ولا تحرموا طيبات ما أحل الله لكم . ومن سنتي أنام وأقوم ، وأفطر وأصوم ، فمن رغب عن سنتي فليس مني \" . فقال عثمان : والله لوددت يا نبي الله أي التجارات أحب إلى الله فأتجر فيها ; فنزلت . وقيل : \" أدلكم \" أي سأدلكم . والتجارة الجهاد ; قال الله تعالى : إن الله اشترى من المؤمنين أنفسهم وأموالهم الآية . وهذا خطاب لجميع المؤمنين . وقيل : لأهل الكتاب .قوله تعالى : \" تجارة \" أي تخلصكم ، وقراءة العامة تنجيكم بإسكان النون من الإنجاء . وقرأ الحسن وابن عامر وأبو حيوة \" تنجيكم \" مشددا من التنجية ، ثم بين التجارة وهي المسألة .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ (10) هذا تخلص إلى الغرض الذي افتتحت به السورة من قوله : { يأيها الذين آمنوا لم تقولون ما لا تفعلون } إلى قوله : { كأنهم بنيان مرصوص } [ الصف : 2 4 ] . فبعد أن ضربت لهم الأمثال ، وانتقل الكلام من مجال إلى مجال ، أعيد خطابهم هنا بمثل ما خوطبوا به بقوله : { يأيها الذين آمنوا لم تقولون ما لا تفعلون } [ الصف : 2 ] ، أي هل أدلكم على أحب العمل إلى الله لتعملوا به كما طلبتم إذْ قلتم لو نعلم أيَّ الأعمال أحبّ إلى الله لعملنا به فجاءت السورة في أُسلوب الخطابة .والظاهر أن الضمير المستتر في { أدلكم } عائد إلى الله تعالى لأن ظاهر الخطاب أنه موجه من الله تعالى إلى المؤمنين . ويجوز أن يجعل الضمير إلى النبي صلى الله عليه وسلم على تقدير قول محذوف وعلى اختلاف الاحتمال يختلف موقع قوله الآتي { وبشر المؤمنين } [ الصف : 13 ] .والاستفهام مستعمل في العَرض مجازاً لأن العارض قد يسأل المعروضَ عليه ليعلم رغبته في الأمر المعروض كما يقال : هل لك في كذا؟ أو هل لك إلى كذا؟والعرض هنا كناية عن التشويق إلى الأمر المعروض ، وهو دلالته إياهم على تجارة نافعة . وألفاظ الاستفهام تخرج عنه إلى معان كثيرة هي من ملازمات الاستفهام كما نبه عليه السكّاكي في «المفتاح» ، وهي غير منحصرة فيما ذكره .وجيء بفعل { أدلكم } لإِفادة ما يذكر بعده من الأشياء التي لا يهتدى إليها بسهولة .وأطلق على العمل الصالح لفظُ التجارة على سبيل الاستعارة لمشابهة العمل الصالح التجارةَ في طلب النفع من ذلك العمل ومزاولته والكد فيه ، وقد تقدم في قوله تعالى : { فما ربحت تجارتهم } في سورة [ البقرة : 16 ] .ووصف التجارة بأنها تنجي من عذاب أليم ، تجريد للاستعارة لقصد الصراحة بهذه الفائدة لأهميتها وليس الإِنجاء من العذاب من شأن التجارة فهو من مناسبات المعنى الحقيقي للعمل الصالح .وجملة تؤمنون بالله ورسوله } مستأنفة استئنافاً بيانياً لأن ذكر الدلالة مجمل والتشويقُ الذي سبقها مما يثير في أنفس السامعين التساؤل عن هذا الذي تدلنا عليه وعن هذه التجارة .\n","ar.waseet":"ثم وجه - سبحانه - نداء إلى المؤمنين ، أرشدهم فيه إلى ما يسعدهم ، وينجيهم من كل سوء ، فقال - تعالى - : ( ياأيها الذين آمَنُواْ . . . ) .هذه الآيات الكريمة جواب عما قاله بعض المؤمنين لرسول الله - صلى الله عليه وسلم - : لو نعلم أى الأعمال أحب إلى الله لعملناها ، كما سبق . أن ذكرنا فى سبب قوله - تعالى - ( ياأيها الذين آمَنُواْ لِمَ تَقُولُونَ مَا لاَ تَفْعَلُونَ ) فكأنه - سبحانه - بعد أن نهاهم عن أن يقولوا قولا ، تخالفه أفعالهم ، وضرب لهم الأمثال بجانب من قصة موسى وعيسى - عليهما السلام - وبشرهم بظهور دينهم على سائر الأديان .بعد كل ذلك أرشدهم إلى أحب الأعمال إليه - سبحانه - فقال : ( ياأيها الذين آمَنُواْ هَلْ أَدُلُّكمْ على تِجَارَةٍ ) .والتجارة فى الأصل معناها : التصرف فى رأس المال ، وتقليبه فى وجوه المعاملات المختلفة ، طلبا للربح .\n","ar.baghawi":"( يا أيها الذين آمنوا هل أدلكم على تجارة تنجيكم ) . قرأ ابن عامر \" تنجيكم \" بالتشديد والآخرون بالتخفيف ( من عذاب أليم ) . نزل هذا حين قالوا : لو نعلم أي الأعمال أحب إلى الله - عز وجل - لعملناه وجعل ذلك بمنزلة التجارة لأنهم يربحون بها رضا الله ونيل جنته والنجاة من النار .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5173.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5173.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5173.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ","transliteration":"Tu'minoona billaahi wa Rasoolihee wa tujaahidoona fee sabeelil laahi bi amwaalikum wa anfusikum; zaalikum khairul lakum in kuntum ta'lamoon","translations":{"en.ahmedali":"Come to believe in God and His Apostle, and struggle in the cause of God, wealth and soul. This will be good for you, if you can understand.","en.ahmedraza":"Have faith in Allah and His Noble Messenger, and fight in Allah’s cause with your wealth and your lives; this is better for you, if you understand.","en.arberry":"You shall believe in God and His Messenger, and struggle in the way of God with your possessions and your selves. That is better for you, did you but know.","en.asad":"You are to believe in God and His Apostle, and to strive hard in God's cause with your possessions and your lives: this is for your own good - if you but knew it!","en.daryabadi":"It is that ye should believe in Allah and His apostle and strive in the way of Allah with your riches and Your lives That is best for you, if ye only knew!","en.hilali":"That you believe in Allah and His Messenger (Muhammad SAW), and that you strive hard and fight in the Cause of Allah with your wealth and your lives, that will be better for you, if you but know!","en.pickthall":"Ye should believe in Allah and His messenger, and should strive for the cause of Allah with your wealth and your lives. That is better for you, if ye did but know.","en.qaribullah":"You shall believe in Allah and His Messenger and struggle for His Way with your possessions and yourselves. That is better for you, if you but knew.","en.sahih":"[It is that] you believe in Allah and His Messenger and strive in the cause of Allah with your wealth and your lives. That is best for you, if you should know.","en.sarwar":"Have faith in God and His Messenger and strive hard for His cause with your wealth and in persons. This is better for you if only you knew it.","en.yusufali":"That ye believe in Allah and His Messenger, and that ye strive (your utmost) in the Cause of Allah, with your property and your persons: That will be best for you, if ye but knew!","en.maududi":"Have faith in Allah and His Messenger and strive in the Way of Allah with your possessions and your lives. That is better for you if you only knew.","en.shakir":"You shall believe in Allah and His Apostle, and struggle hard in Allah's way with your property and your lives; that is better for you, did you but know!","en.itani":"That you believe in God and His Messenger, and strive in the cause of God with your possessions and yourselves. That is best for you, if you only knew.","en.mubarakpuri":"That you believe in Allah and His Messenger, and that you strive hard and fight in the cause of Allah with your wealth and your lives, that will be better for you, if you but know!","en.qarai":"Have faith in Allah and His Apostle, and wage jihad in the way of Allah with your persons and possessions. That is better for you, should you know.","en.wahiduddin":"You should believe in God and His Messenger, and strive for God's cause with your possessions and your lives. That will be better for you, if you only knew --"},"tafsir":{"ar.muyassar":"تداومون على إيمانكم بالله ورسوله، وتجاهدون في سبيل الله؛ لنصرة دينه بما تملكون من الأموال والأنفس، ذلك خير لكم من تجارة الدنيا، إن كنتم تعلمون مضارَّ الأشياء ومنافعها، فامتثلوا ذلك.","ar.jalalayn":"«تؤمنون» تدومون على الإيمان «بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم ذلكم خير لكم إن كنتم تعلمون» أنه خير لكم فافعلوه.","ar.qurtubi":"فقال : تؤمنون بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم ذكر الأموال أولا لأنها التي يبدأ بها في الإنفاق . و \" تؤمنون \" عند المبرد والزجاج في معنى آمنوا ، ولذلك جاء ( يغفر لكم ) مجزوما على أنه جواب الأمر . وفي قراءة عبد الله ( آمنوا بالله ) وقال الفراء يغفر لكم جواب الاستفهام ; وهذا إنما يصح على الحمل على المعنى ; وذلك أن يكون تؤمنون بالله وتجاهدون عطف بيان على قوله : هل أدلكم على تجارة تنجيكم من عذاب أليم كأن التجارة لم يدر ما هي ; فبينت بالإيمان والجهاد ; فهي هما في المعنى . فكأنه قال : هل تؤمنون بالله وتجاهدون يغفر لكم . الزمخشري : وجه قول الفراء أن متعلق الدلالة هو التجارة ، والتجارة مفسرة بالإيمان والجهاد . كأنه قيل : هل تتجرون بالإيمان [ ص: 79 ] والجهاد\n","ar.miqbas":"تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (11) وإذ قد كان الخطاب لقوم مؤمنين فإن فِعْل { تؤمنون بالله } مع { وتجاهدون } مراد به تجمعون بين الإِيمان بالله ورسوله وبين الجهاد في سبيل الله بأموالكم وأنفسكم تنويهاً بشأن الجهاد . وفي التعبير بالمضارع إفادة الأمر بالدوام على الإِيمان وتجديده في كل آن ، وذلك تعريض بالمنافقين وتحذير من التغافل عن ملازمة الإِيمان وشؤونه .وأما { وتجاهدون } فإنه لإِرادة تجدّد الجهاد إذا استُنفِروا إليه .\n","ar.waseet":"والمراد بها هنا : العقيدة السليمة ، والأعمال الصالحة ، التى فسرت بها بعد ذلك فى قوله - تعالى - ( تُؤْمِنُونَ بالله وَرَسُولِهِ ) .والاستفهام فى قوله - تعالى - : ( هَلْ أَدُلُّكمْ ) للتشويق والتحضيض إلى الأمر المدلول عليه .والمعنى : يا من آمنتم بالله - تعالى - وبملائكته وكتبه ورسله واليوم الآخر ألا تريدون أن أدلكم على تجارة رابحة ، تنجيكم مزاولتها ومباشرتها ، من عذاب شديد الأليم؟ إن كنتم تريدون ذلك ، فهاكم الطريق إليها ، وهى : ( تُؤْمِنُونَ بالله وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ الله بِأَمْوَالِكُمْ وَأَنفُسِكُمْ ) .فقوله - سبحانه - : ( تُؤْمِنُونَ بالله وَرَسُولِهِ ) استئناف مفسر وموضح لقوله ( هَلْ أَدُلُّكمْ ) ؟ فكأن سائلا قال : وما هذه التجارة؟ دلنا عليها ، فكان الجواب : تؤمنون بالله ورسوله .أى : تداومون تامة على الإيمان بالله - تعالى - وبرسوله - صلى الله عليه وسلم - وتجاهدون فى سبيل إعلاء كلم الله ونصرة دينه بأموالكم وأنفسكم .قالوا : وقوله ( تُؤْمِنُونَ ) خبر فى معنى الأمر ، ويدل عليه قراءة ابن مسعود : آمنوا بالله رسوله ، وجاهدوا فى سبيله .وفائدة العدول إلى الخبر : الإشعار بأنهم قد امتثلوا لما أرشدوا إليه ، فكأنه - سبحانه - يخبر عن هذا الامتثال الموجود عندهم .وجاء التعبير بقوله : ( هَلْ أَدُلُّكمْ ) لإفادة أن ما يذكر بعد ذلك من الأشياء التى تحتاج إلى من يهدى إليها ، لأنها أمور مرد تحديدها إلى الله - تعالى - .وتنكير لفظ التجارة ، للتهويل والتعظيم ، أى : هل أدلكم على تجارة عظيمة الشأن . . ؟وأطلقت التجارة هنا على الإيمان والعمل الصالح ، لأنهما يتلاقيان ويتشابهان فى أن كليهما المقصود من ورائه الربح العظيم ، والسعى من أجل الحصول على المنافع .وقدم - سبحانه - هنا الجهاد بالأموال على الجهاد بالأنفس ، لأن المقام قمام تفسير وتوضيح لمعنى التجارة الرابحة عن طريق الجهاد فى سبيل الله ، ومن المعلوم أن التجارة تقوم على تبادل الأموال ، وهذه الأموال هى عصب الجهاد ، فعن طريقها تشترى الأسلحة والمعدات التى لا غنى للمجاهدين عنها ، وفى الحديث الشريف \" من جهز غازيا فقد غزا \" .وقدم - سبحانه - فى قوله : ( إِنَّ الله اشترى مِنَ المؤمنين أَنفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ . . ) وقدم الأنفس على الأموال ، لأن الحديث هناك ، كان فى معرض الاستبدال والعرض والطلب ، والأخذ والعطاء . . . فقدم - سبحانه - الأنفس لأنها أعز ما يملكه الإنسان ، وجعل فى مقابلها الجنة لأنها أعز ما يوهب ، وأسمى ما تتطلع إلى نيله النفوس .واسم الإشارة فى قوله : ( ذَلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ ) يعود إلى ما سبق ذكره من الإيمان والجهاد . أى : ذلكم الذى أرشدناكم إلى التمسك به من الإيمان والجهاد فى سبيل الله ، هو خير لكم من كل شىء إن كنتم من أهل العلم والفهم .فقوله ( تَعْلَمُونَ ) منزلة منزلة الفعل اللازم ، للإشعار بأن من يخالف ذلك لا يكون لا من أهل العلم ، ولا من أهل الإدراك .وجعله بعضهم فعلا متعديا ، ومفعوله محذوف ، والتقدير : إن كنتم تعلمون أنه خير لكم فافعلوه ، ولا تتقاعسوا عن ذلك .\n","ar.baghawi":"ثم بين تلك التجارة فقال :  \"تؤمنون بالله ورسوله وتجاهدون في سبيل الله بأموالكم وأنفسكم ذلكم خير لكم إن كنتم تعلمون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5174.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5174.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5174.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","transliteration":"Yaghfir lakum zunoobakum wa yudkhilkum Jannaatin tajree min tahtihal anhaaru wa masaakina taiyibatan fee Jannaati 'Ad; zaalikal fawzul 'Azeem","translations":{"en.ahmedali":"He will forgive you your sins and admit you to gardens with rivers flowing by, and excellent mansions in the garden of Eden. This will be a great fulfilment.","en.ahmedraza":"He will forgive you your sins and admit you into Gardens beneath which rivers flow, and superb dwellings in everlasting Gardens of Eden; this is the greatest success.","en.arberry":"He will forgive you your sins and admit you into gardens underneath which rivers flow, and to dwelling-places goodly in Gardens of Eden; that is the mighty triumph;","en.asad":"[If you do so,] He will forgive you your sins, and [in the life to come] will admit you into gardens through which running waters flow, and into goodly mansions in [those] gardens of perpetual bliss: that [will be] the triumph supreme!","en.daryabadi":"He will forgive you your sins, and make YOu enter Gardens whereunder rivers flow, and happy abodes in Gardens Everlasting. That is the mighty achievement.","en.hilali":"(If you do so) He will forgive you your sins, and admit you into Gardens under which rivers flow, and pleasant dwelling in Gardens of 'Adn - Eternity ['Adn (Edn) Paradise], that is indeed the great success.","en.pickthall":"He will forgive you your sins and bring you into Gardens underneath which rivers flow, and pleasant dwellings in Gardens of Eden. That is the supreme triumph.","en.qaribullah":"He will forgive you your sins and admit you to Gardens underneath which rivers flow, and to fine dwelling places in the Gardens of Eden. That is the mightytriumph.","en.sahih":"He will forgive for you your sins and admit you to gardens beneath which rivers flow and pleasant dwellings in gardens of perpetual residence. That is the great attainment.","en.sarwar":"God will forgive your sins and admit you into Paradise wherein streams flow, and you live in the lofty mansions of the garden of Eden. This is indeed the greatest triumph.","en.yusufali":"He will forgive you your sins, and admit you to Gardens beneath which Rivers flow, and to beautiful mansions in Gardens of Eternity: that is indeed the Supreme Achievement.","en.maududi":"He will forgive you your sins and will admit you to Gardens beneath which rivers flow. He will lodge you in excellent mansions in the Gardens of eternity. That is the supreme triumph.","en.shakir":"He will forgive you your faults and cause you to enter into gardens, beneath which rivers flow, and goodly dwellings in gardens of perpetuity; that is the mighty achievement;","en.itani":"He will forgive you your sins; and will admit you into gardens beneath which rivers flow, and into beautiful mansions in the Gardens of Eden. That is the supreme success.","en.mubarakpuri":"(If you do so) He will forgive you your sins, and admit you into Gardens under which rivers flow, and pleasant dwellings in `Adn (Eternal) Paradise; that is indeed the great success.","en.qarai":"He will forgive your sins and admit you into gardens with streams running in them, and into good dwellings in the Gardens of Eden; that is the great success.","en.wahiduddin":"and He will forgive you your sins and admit you into Gardens with rivers flowing under them. He will lodge you in fine dwellings in the Gardens of Eternity; that is indeed the supreme achievement."},"tafsir":{"ar.muyassar":"إن فعلتم -أيها المؤمنون- ما أمركم الله به يستر عليكم ذنوبكم، ويدخلكم جنات تجري من تحت أشجارها الأنهار، ومساكن طاهرة زكية في جنات إقامة دائمة لا تنقطع، ذلك هو الفوز الذي لا فوز بعده. ونعمة أخرى لكم- أيها المؤمنون- تحبونها هي نصر من الله يأتيكم، وفتح عاجل يتم على أيديكم. وبشِّر المؤمنين -أيها النبي- بالنصر والفتح في الدنيا، والجنة في الآخرة.","ar.jalalayn":"«يغفر» جواب شرط مقدر، أي إن تفعلوه يغفر «لكم ذنوبكم ويدخلكم جنات تجري من تحتها الأنهار ومساكن طيبة في جنات عدن» إقامة «ذلك الفوز العظيم».","ar.qurtubi":"يغفر لكم . قال المهدوي : فإن لم تقدر هذا التقدير لم تصح المسألة ; لأن التقدير يصير إن دللتم يغفر لكم ; والغفران إنما نعت بالقبول والإيمان لا بالدلالة . قال الزجاج : ليس إذا دلهم على ما ينفعهم يغفر لهم ; إنما يغفر لهم إذا آمنوا وجاهدوا . وقرأ زيد بن علي \" تؤمنوا \" ، و \" تجاهدوا \" على إضمار لام الأمر ; كقوله :محمد تفد نفسك كل نفس إذا ما خفت من شيء تبالاأراد لتفد . وأدغم بعضهم فقال : \" يغفر لكم \" والأحسن ترك الإدغام ; لأن الراء حرف متكرر قوي فلا يحسن إدغامه في اللام ; لأن الأقوى لا يدغم في الأضعف .قوله تعالى : \" ومساكن طيبة \" خرج أبو الحسين الآجري عن الحسن قال : سألت عمران بن الحصين وأبا هريرة عن تفسير هذه الآية ( ومساكن طيبة ) فقالا : على الخبير سقطت ، سألنا رسول الله صلى الله عليه وسلم عنها فقال : \" قصر من لؤلؤة في الجنة فيه سبعون دارا من ياقوتة حمراء ، في كل دار سبعون بيتا من زبرجدة خضراء ، في كل بيت سبعون سريرا ، على كل سرير سبعون فراشا من كل لون ، على كل فراش سبعون امرأة من الحور العين ، في كل بيت سبعون مائدة ، على كل مائدة سبعون لونا من الطعام ، في كل بيت سبعون وصيفا ووصيفة ، فيعطي الله تبارك وتعالى المؤمن من القوة في غداة واحدة ما يأتي على ذلك كله \" . في جنات عدن أي إقامة .ذلك الفوز العظيم أي السعادة الدائمة الكبيرة . وأصل الفوز الظفر بالمطلوب .\n","ar.miqbas":"يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ذَلِكَ الْفَوْزُ الْعَظِيمُ (12)ومجيء { يغفر } مجْزوماً تنبيه على أن { تؤمنون } { وتجاهدون } وإن جاءا في صيغة الخبر فالمراد الأمرُ لأن الجزم إنما يكون في جواب الطلب لا في جواب الخبر . قاله المبرد والزمخشري .وقال الفراء : جزم { يغفرْ } لأنه جواب { هل أدلكم } ، أي لأن متعلق { أدلكم } هو التجارة المفسرة بالإِيمان والجهاد ، فكأنه قيل : هل تتَّجرون بالإِيمان والجهاد يَغفرْ لكم ذنوبكم .وإنما جيء بالفعلين الأولين على لفظ الخبر للإِيذان بوجوب الامتثال حتى يفرض المأمور كأنه سمع الأمر وامتثله .وقرأ الجمهور { تنجيكم } بسكون النون وتخفيف الجيم . وقرأه ابن عامر بفتح النون وتشديد الجيم ، يقال : أنجاه ونَجّاه .والإِشارة ب { ذلكم } إلى الإِيمان والجهاد بتأويل المذكور : خير .و { خير } هذا ليس اسم تفضيل الذي أصله : أخير ووزنه : أَفعل ، بل هو اسم لضد الشر ، ووزنه : فَعْل .وجمع قوله : { خير } ما هو خيرُ الدنيا وخيرُ الآخرة .وقوله : { إن كنتم تعلمون } تعريض لهم بالعتاب على تولّيهم يوم أُحُد بعد أن قالوا : لو نعلم أيَّ الأعمال أحب إلى الله لَعَمِلْنَاه ، فندبوا إلى الجهاد فكان ما كان منهم يوم أُحُد ، كما تقدم في أول السورة ، فنزلوا منزلة من يُشَك في عملهم بأنه خير لعدم جريهم على موجَب العلم .والمساكن الطيبة : هي القصور التي في الجنة ، قال تعالى : { ويجعل لك قصوراً } [ الفرقان : 10 ] .وإنما خُصّت المساكن بالذكر هنا لأن في الجهاد مفارقة مساكنهم ، فوعدوا على تلك المفارقة الموقتة بمساكن أبدية . قال تعالى : { قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم } إلى قوله : { ومساكن ترضونها أحب إليكم من الله ورسوله وجهاد في سبيله } [ التوبة : 24 ] الآية .\n","ar.waseet":"وقوله - سبحانه - : ( يَغْفِرْ لَكُمْ ذُنُوبَكُمْ ) مجزوم على أنه جواب لشرط مقدر ، أى : إن تمتثلوا أمره - تعالى - يغفر لكم ذنوبكم .ويصح أن يكون مجزوما على أنه جواب للأمر المدلول عليه بلفظ الخبر فى قوله - تعالى - قبل ذلك ( تُؤْمِنُونَ بالله وَرَسُولِهِ وَتُجَاهِدُونَ ) . لأنهما - كما قلنا - وإن جاءا بلفظ الخبر ، إلا أنهما فى معنى الأمر ، أى : آمنوا وجاهدوا .أى : آمنوا بالله - تعالى - إيمانا حقا ، وجاهدوا فى سبيل إعلاء كلمته بأموالكم وأنفسكم ، يغفر لكم - سبحانه - ذنوبكم ، بأن يزيلها عنكم ، ويسترها عليكم .( وَيُدْخِلْكُمْ ) فضلا عن ذلك ( جَنَّاتٍ ) عاليات ( تَجْرِي مِن تَحْتِهَا الأنهار ) أى : تجرى من تجت مساكنها وبساتيها الأنهار .ويعطيكم ( مَسَاكِنَ طَيِّبَةً ) أى : قصورا مشتملة على كل ما هو طيب ونافع .وخصت المساكن الطيبة بالذكر ، لأن المجاهدين قد فارقوا مساكنهم ، ومنهم من استشهد بعيدا عنها ، وفيها أهله وماله . . . فوعدهم - سبحانه - بما هو خير منها .وقوله ( فِي جَنَّاتِ عَدْنٍ ) أى : هذه المساكن الطيبة كائنة فى جنات باقية خالدة ، لا تزول ولا تنتهى ، بل أصحابها يقيمون فيها إقامة دائمة ، يقال : عدن فلان بالمكان ، إذا أقام فيه إقامة مؤبدة .( ذَلِكَ الفوز العظيم ) أى : ذلك الذى منحناكم إياه من مغفرة لذنوبكم ، ومن خلودكم فى الجنة . . . هو الفوز العظيم الذى لا يقاربه فوز ، ولا يدانيه ظفر .\n","ar.baghawi":"\"يغفر لكم ذنوبكم ويدخلكم جنات تجري من تحتها الأنهار ومساكن طيبةً في جنات عدن ذلك الفوز العظيم\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5175.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5175.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5175.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"وَأُخْرَىٰ تُحِبُّونَهَا ۖ نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","transliteration":"Wa ukhraa tuhibboonahaa nasrum minal laahi wa fat hun qaree; wa bashshiril mu 'mineen","translations":{"en.ahmedali":"And (He will give you) what is dearest to you -- help from God and early victory. So give good tidings to those who believe.","en.ahmedraza":"And He will give you another favour, which is dear to you – the help from Allah and an imminent victory; and O dear Prophet (Mohammed – peace and blessings be upon him), give glad tidings to the Muslims.","en.arberry":"and other things you love, help from God and a nigh victory. Give thou good tidings to the believers!","en.asad":"And [withal, He will grant you] yet another thing that you dearly love: succour from God [in this world], and a victory soon to come: and [thereof, O Prophet,] give thou a glad tiding to all who believe.","en.daryabadi":"And also another blessing which ye love: succour from Allah and a speedy victory. And bear thou the glad tidings Unto the believers.","en.hilali":"And also (He will give you) another (blessing) which you love, help from Allah (against your enemies) and a near victory. And give glad tidings (O Muhammad SAW) to the believers.","en.pickthall":"And (He will give you) another (blessing) which ye love: help from Allah and present victory. Give good tidings (O Muhammad) to believers.","en.qaribullah":"And other things that you love, victory from Allah and an opening that is near. (O Prophet Muhammad) give glad tidings to the believers.","en.sahih":"And [you will obtain] another [favor] that you love - victory from Allah and an imminent conquest; and give good tidings to the believers.","en.sarwar":"(Besides forgiveness) you will receive other favors which you will love: help from God and an immediate victory (Muhammad), give such glad news to the believers.","en.yusufali":"And another (favour will He bestow,) which ye do love,- help from Allah and a speedy victory. So give the Glad Tidings to the Believers.","en.maududi":"He will also grant you the other favour that you desire: help from Allah and a victory that will come soon. Give glad tidings of this to the believers.","en.shakir":"And yet another (blessing) that you love: help from Allah and a victory near at hand; and give good news to the believers.","en.itani":"And something else you love: support from God, and imminent victory. So give good news to the believers.","en.mubarakpuri":"And also (He will give you) another (blessing) which you love, help from Allah and a near victory. And give glad tidings to the believers.","en.qarai":"And other [blessings] you cherish: help from Allah and a victory near at hand, and give good news to the faithful.","en.wahiduddin":"He will give you another blessing which you desire: help from God and imminent victory. Give good tidings [O Muhammad] to believers!"},"tafsir":{"ar.muyassar":"إن فعلتم -أيها المؤمنون- ما أمركم الله به يستر عليكم ذنوبكم، ويدخلكم جنات تجري من تحت أشجارها الأنهار، ومساكن طاهرة زكية في جنات إقامة دائمة لا تنقطع، ذلك هو الفوز الذي لا فوز بعده. ونعمة أخرى لكم- أيها المؤمنون- تحبونها هي نصر من الله يأتيكم، وفتح عاجل يتم على أيديكم. وبشِّر المؤمنين -أيها النبي- بالنصر والفتح في الدنيا، والجنة في الآخرة.","ar.jalalayn":"«و» يؤتكم «أُخرى تحبونها نصر من الله وفتح قريب وبشر المؤمنين» بالنصر والفتح.","ar.qurtubi":"الخامسة : قوله تعالى : وأخرى تحبونها قال الفراء والأخفش : \" أخرى \" معطوفة على \" تجارة \" فهي في محل خفض . وقيل : محلها رفع ؛ أي ولكم خصلة أخرى وتجارة أخرى تحبونها .نصر من الله أي هو نصر من الله ; ف \" نصر \" على هذا تفسير وأخرى . وقيل : رفع على البدل من أخرى أي ولكم نصر من الله .\" وفتح قريب \" أي غنيمة في عاجل الدنيا ; وقيل فتح مكة . وقال ابن عباس : يريد فتح فارس والروم .( وبشر المؤمنين ) برضا الله عنهم .\n","ar.miqbas":"وَأُخْرَى تُحِبُّونَهَا نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ وَبَشِّرِ الْمُؤْمِنِينَ (13){ وأخرى تُحِبُّونَهَا نَصْرٌ مِّن الله وَفَتْحٌ قَرِيبٌ } .عطف على جملة { يغفر لكم ويدخلكم } [ الصف : 12 ] عطفَ الاسمية على الفعلية . وجيء بالاسمية لإِفادة الثبوت والتحقق . ف { أُخرى } مبتدأ خبره محذوف دل عليه قوله : { لكم } من قوله : { يغفر لكم } . والتقدير : أخرى لكم ، ولك أن تجعل الخبر قوله : { نصر من الله } .وجيء به وصفاً مؤنثاً بتأويل نعمة ، أو فضيلة ، أو خصلة مما يؤذن به قوله : { يغفر لكم ذنوبكم } [ الصف : 12 ] إلى آخره من معنى النعمة والخصلة كقوله تعالى : { وأخرى لم تقدروا عليها } في سورة [ الفتح : 21 ]ووصف أخرى بجملة { تحبونها } إشارة إلى الامتنان عليهم بإعطائهم ما يحبون في الحياة الدنيا قبل إعطاء نعيم الآخرة . وهذا نظير قوله تعالى : { فلنولينك قبلة ترضاها } [ البقرة : 144 ] .( و { نصر من الله } بدل من { أُخرى } ، ويجوز أن يكون خبراً عن { أخرى } . والمراد به النصر العظيم ، وهو نصر فتح مكة فإنه كان نصراً على أشد أعدائهم الذين فتنوهم وآذوهم وأخرجوهم من ديارهم وأموالهم وألَّبوا عليهم العرب والأحزاب . وراموا تشويه سمعتهم ، وقد انضم إليه نصر الدين بإسلام أولئك الذين كانوا من قبل أيمة الكفر ومساعير الفتنة ، فأصبحوا مؤمنين إخواناً وصدق الله وعده بقوله : { عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة } [ الممتحنة : 7 ] وقوله : { واذكروا نعمة الله عليكم إذ كنتم أعداء فألف بين قلوبكم فأصبحتم بنعمته إخواناً } [ آل عمران : 103 ] .وذكر اسم الجلالة يجوز أن يكون إظهاراً في مقام الإِضمار على احتمال أن يكون ضمير التكلم في قوله : { هل أدلكم } [ الصف : 10 ] كلاماً من الله تعالى ، ويجوز أن يكون جارياً على مقتضى الظاهر إن كان الخطاب أُمر به رسول الله صلى الله عليه وسلم بتقدير «قل» .ووصف الفتح ب { بقريب } تعجيل بالمسرة .وهذه الآية من معجزات القرآن الراجعة إلى الإِخبار بالغيب .{ قَرِيبٌ وَبَشِّرِ } .يجوز أن تكون عطفاً على مجموع الكلام الذي قبلها ابتداء من قوله : { يأيها الذين آمنوا هل أدلكم على تجارة } [ الصف : 10 ] على احتمال أن ما قبلها كلام صادر من جانب الله تعالى ، عطفَ غرض على غرض فيكون الأمر من الله لنبيئه صلى الله عليه وسلم بأن يبشر المؤمنين . ولا يتأتى في هذه الجملة فرضُ عطف الإِنشاء على الإِخبار إذ ليس عطف جملة بل جملة على جملة على مجموع جُمل على نحو ما اختاره الزمخشري عند تفسير قوله تعالى : { وبشر الذين آمنوا وعملوا الصالحات أن لهم جنات } الآية في أوائل سورة [ البقرة : 25 ] وما بيَّنه من كلام السيد الشريف في حاشية الكشاف } .وأما على احتمال أن يكون قوله : { يأيها الذين آمنوا هل أدلكم } إلى آخره مسوقاً لأمر رسول الله صلى الله عليه وسلم بأن يقول : { هل أدلكم على تجارة } بتقدير قول محذوف ، أي قل يأيها الذين آمنوا هل أدلكم ، إلى آخره ، فيكون الأمر في { وبشر } التفاتاً من قبيل التجريد . والمعنى : وأُبشّرُ المؤمنين .وقد تقدم القول في عطف الإِنشاء على الإِخبار عند قوله تعالى : { وبشر الذين آمنوا وعملوا الصالحات أن لهم جنات تجري من تحتها الأنهار } في أوائل سورة [ البقرة : 25 ] .والذي استقر عليه رأيي الآن أن الاختلاف بين الجملتين بالخبرية والإِنشائية اختلاف لفظي لا يؤثر بين الجملتين اتصالاً ولا انقطاعاً لأن الاتصال والانقطاع أمران معنويان وتابعان للأغراض فالعبرة بالمناسبة المعنوية دون الصيغة اللفظية وفي هذا مقنع حيث فاتني التعرض لهذا الوجه عند تفسير آية سورة البقرة .\n","ar.waseet":"وقوله - سبحانه - : ( وأخرى تُحِبُّونَهَا ) بيان لنعمة أخرى يعطيهم - سبحانه - إياها ، سوى ما تقدم من نعم عظمى .ولفظ \" أخرى \" مبتدأ خبره دل عليه ما تقدم ، وقوله : ( تُحِبُّونَهَا ) صفة للمبتدأ .أى : ولكم - فضلا عن كل ما تقدم - نعمة أخرى تحبونها وتتطلعون إليها .وهذه النعمة هى : ( نَصْرٌ ) عظيم كائن ( مِّن الله ) - تعالى - لكم ( وَفَتْحٌ قَرِيبٌ ) أى : عاجل ( وَبَشِّرِ المؤمنين ) أى : وبشر - أيها الرسول الكريم - المؤمنين بذلك ، حتى يزدادوا إيمانا على إيمانهم ، وحتى تزداد قلوبهم انشراحا وسرورا .ويدخل فى هذا النصر والفتح القريب دخولا أوليا : فتح مكة ، ودخول الناس فى دين الله أفواجا .وهذه الآية الكريمة من معجزات القرآن الكريم ، الراجعة إلى الإخبار بالغيب ، حيث أخبر - سبحانه - بالنصر والفتح ، فتم ذلك للنبى - صلى الله عليه وسلم - ولأصحابه ، فى أكمل صورة ، وأقرب زمن .\n","ar.baghawi":"( وأخرى تحبونها ) . أي : ولكم خصلة أخرى في العاجل مع ثواب الآخرة تحبونها وتلك الخصلة : ( نصر من الله وفتح قريب ) . قال الكلبي : هو النصر على قريش وفتح مكة . وقال عطاء : يريد فتح فارس والروم . ( وبشر المؤمنين ) . يا محمد بالنصر في الدنيا والجنة في الآخرة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5176.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5176.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5176.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنْصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنْصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ ۖ فَآمَنَتْ طَائِفَةٌ مِنْ بَنِي إِسْرَائِيلَ وَكَفَرَتْ طَائِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ","transliteration":"Yaaa ayyuhal lazeena aamaanoo koonooo ansaaral laahi kamaa qaala 'Eesab-nu-Maryama lil Hawaariyyeena man ansaareee ilal laah; qaalal Hawaariyyoona nahnu ansaa rul laahi fa aamanat taaa'ifatum mim Bannee Israaa'eela wa kafarat taaa'ifatun fa ayyadnal lazeena aammanoo 'alaa 'aduwwihim fa asbahoo zaahireen","translations":{"en.ahmedali":"O you who believe, be helpers of God, as Jesus, son of Mary, had said to the disciples: \"Who will help me in the way of God?\" and they had answered: \"We are the helpers of God.\" Then a section among the children of Israel believed, but a section among them did not. So We helped those who believed against their enemies, and they prevailed over them.","en.ahmedraza":"O People who Believe! Become the aides of Allah’s religion, the way Eisa the son of Maryam had said to the disciples, “Who will help me, inclining towards Allah?” The disciples said, “We are the aides of Allah’s religion” – so a group among the Descendants of Israel accepted faith and another group disbelieved; We therefore aided the believers against their enemies, so they were victorious.","en.arberry":"O believers, be you God's helpers, as Jesus, Mary's son, said to the Apostles. 'Who will be my helpers unto God?' The Apostles said, 'We will be helpers of God.' And a party of the Children of Israel believed, and a party disbelieved. So We confirmed those who believed against their enemy, and they became masters.","en.asad":"O YOU who have attained to faith! Be helpers [in the cause of God - even as Jesus, the son of Mary, said unto the white-garbed ones, \"Who will be my helpers in God's cause?\" - whereupon the white-garbed [disciples] replied, \"We shall be [thy] helpers [in the cause] of God!\" And so [it happened that] some of the children of Israel came to believe [in the apostleship of Jesus], whereas others denied the truth. But [now] We have given strength against their foes unto those who have [truly] attained to faith: and they have become the ones that shall prevail.","en.daryabadi":"O ye who believe! be Allah's helpers, even as 'Isa, son of Maryam, said Unto the disciples: who shall be my helpers Unto Allah? The disciples said: we are Allah's helpers. Then a part of the Children of Israil believed, and part disbelieved. Then We strengthened those who believed against their foe; wherefore they became triumphant.","en.hilali":"O you who believe! Be you helpers (in the Cause) of Allah as said 'Iesa (Jesus), son of Maryam (Mary), to Al-Hawariun (the disciples): \"Who are my helpers (in the Cause) of Allah?\" Al-Hawarieen (the disciples) said: \"We are Allah's helpers\" (i.e. we will strive in His Cause!). Then a group of the Children of Israel believed and a group disbelieved. So We gave power to those who believed against their enemies, and they became the uppermost.","en.pickthall":"O ye who believe! Be Allah's helpers, even as Jesus son of Mary said unto the disciples: Who are my helpers for Allah? They said: We are Allah's helpers. And a party of the Children of Israel believed, while a party disbelieved. Then We strengthened those who believed against their foe, and they became the uppermost.","en.qaribullah":"Believers, be the helpers of Allah. When (Prophet) Jesus, the son of Mary said to the disciples: 'Who will be my helpers unto Allah' The disciples replied:'We will be the helpers of Allah' A party of the Children of Israel believed, and a party disbelieved. So, We supported those who believed against their enemy, and they overcame.","en.sahih":"O you who have believed, be supporters of Allah, as when Jesus, the son of Mary, said to the disciples, \"Who are my supporters for Allah?\" The disciples said, \"We are supporters of Allah.\" And a faction of the Children of Israel believed and a faction disbelieved. So We supported those who believed against their enemy, and they became dominant.","en.sarwar":"Believers, be the helpers of God just as when Jesus, the son of Mary, asked the disciples, \"Who will be my helpers for the cause of God?\" and the disciples replied, \"We are the helpers of God.\" A group of the Israelites believed in him and others rejected him. We helped the believers against their enemies and they became victorious.","en.yusufali":"O ye who believe! Be ye helpers of Allah: As said Jesus the son of Mary to the Disciples, \"Who will be my helpers to (the work of) Allah?\" Said the disciples, \"We are Allah's helpers!\" then a portion of the Children of Israel believed, and a portion disbelieved: But We gave power to those who believed, against their enemies, and they became the ones that prevailed.","en.maududi":"Believers, become Allah's helpers, as Jesus, son of Mary, said to the disciples: “Who is my helper in (calling people) to Allah?” The disciples had responded by saying: “We are Allah's helpers.” Then a section of the Children of Israel believed and a section rejected the call. Thereafter We aided the believers against their enemies, and they prevailed.","en.shakir":"O you who believe! be helpers (in the cause) of Allah, as~ Isa son of Marium said to (his) disciples: Who are my helpers in the cause of Allah? The disciples said: We are helpers (in the cause) of Allah. So a party of the children of Israel believed and another party disbelieved; then We aided those who believed against their enemy, and they became uppermost.","en.itani":"O you who believe! Be supporters of God, as Jesus son of Mary said to the disciples, “Who are my supporters towards God?” The disciples said, “We are God's supporters.” So a group of the Children of Israel believed, while another group disbelieved. We supported those who believed against their foe, so they became dominant.","en.mubarakpuri":"O you who believe! Be you helpers (in the cause) of Allah as said `Isa, son of Maryam, to the Hawariyyin (the disciples): \"Who are my helpers (in the cause) of Allah\" The Hawariyyun said: \"We are Allah's helpers\" (i.e., we will strive in His cause!). Then a group of the Children of Israel believed and a group disbelieved. So, We gave power to those who believed against their enemies, and they became the victorious (uppermost).","en.qarai":"O you who have faith! Be Allah’s helpers, just as Jesus son of Mary said to his disciples, ‘Who will be my helpers for Allah’s sake?’ The Disciples said, ‘We will be Allah’s helpers!’ So a group of the Children of Israel believed, and a group disbelieved. Then We strengthened the faithful against their enemies, and they came to prevail [over them].","en.wahiduddin":"Believers, be God's helpers, as Jesus, son of Mary, said to the disciples, \"Who will be my helpers in the cause of God?\" The disciples said, \"We shall be God's helpers.\" Some of the Children of Israel believed in him and some denied the truth; We supported the believers against their enemies and they triumphed over them."},"tafsir":{"ar.muyassar":"يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، كونوا أنصارًا لدين الله، كما كان أصفياء عيسى أنصارًا لدين الله حين قال لهم عيسى: مَن يتولى منكم نصري وإعانتي فيما يُقرِّب إلى الله؟ قالوا: نحن أنصار دين الله، فاهتدت طائفة من بني إسرائيل، وضلَّت طائفة، فأيدنا الذين آمنوا بالله ورسوله، ونصرناهم على مَن عاداهم مِن فرق النصارى، فأصبحوا ظاهرين عليهم؛ وذلك ببعثة محمد صلى الله عليه وسلم.","ar.jalalayn":"«يا أيها الذين آمنوا كونوا أنصارا لله» لدينه وفي قراءة بالإضافة «كما قال» الخ المعنى: كما كان الحواريون كذلك الدال عليه قال «عيسى ابن مريم للحواريين من أنصاري إلى الله» أي من الأنصار الذين يكونون معي متوجها إلى نصرة الله «قال الحواريون نحن أنصار الله» والحواريون أصفياء عيسى وهم أول من آمن به وكانوا اثني عشر رجلا من الحور وهو البياض الخالص وقيل كانوا قصارين يحورون الثياب، أي يبيضونها «فآمنت طائفة من بني إسرائيل» بعيسى وقالوا إنه عبد الله رُفِع إلى السماء «وكفرت طائفة» لقولهم إنه ابن الله رفعه إليه فاقتتلت الطائفتان «فأيدنا» قوينا «الذين آمنوا» من الطائفتين «على عدوهم» الطائفة الكافرة «فأصبحوا ظاهرين» غالبين.","ar.qurtubi":"قوله تعالى : ياأيها الذين آمنوا كونوا أنصار الله كما قال عيسى ابن مريم للحواريين من أنصاري إلى الله قال الحواريون نحن أنصار الله فآمنت طائفة من بني إسرائيل وكفرت طائفة فأيدنا الذين آمنوا على عدوهم فأصبحوا ظاهرينأكد أمر الجهاد ; أي كونوا حواريي نبيكم ليظهركم الله على من خالفكم كما أظهر حواريي عيسى على من خالفهم . وقرأ ابن كثير وأبو عمرو ونافع \" أنصارا لله \" بالتنوين . قالوا : لأن معناه اثبتوا وكونوا أعوانا لله بالسيف على أعدائه . وقرأ الباقون منأهل البصرة والكوفة والشام \" أنصار الله \" بلا تنوين ; وحذفوا لام الإضافة من اسم الله تعالى . واختاره أبو عبيدة لقوله : \" نحن أنصار الله \" ولم ينون ; ومعناه كونوا أنصارا لدين الله . ثم قيل : في الكلام إضمار ; أي قل لهم يا محمد : كونوا أنصار الله . وقيل : هو ابتداء خطاب من الله ; أي كونوا أنصارا كما فعل أصحاب عيسى فكانوا بحمد الله أنصارا وكانوا حواريين . والحواريون خواص الرسل . قال معمر : كان ذلك بحمد الله ; أي نصروه وهم سبعون رجلا ، وهم الذين بايعوه ليلة العقبة . وقيل : هم من قريش . وسماهم قتادة : أبا بكر وعمر وعليا وطلحة والزبير وسعد بن مالك وأبا عبيدة - واسمه عامر - وعثمان بن مظعون وحمزة بن عبد المطلب ; ولم يذكر سعيدا فيهم ، وذكر جعفر بن أبي طالب رضي الله عنهم أجمعين .كما قال عيسى ابن مريم للحواريين وهم أصفياؤه اثنا عشر رجلا ، وقد مضت أسماؤهم في \" آل عمران \" وهم أول من آمن به من بني إسرائيل ، قاله ابن عباس . وقال مقاتل : قال الله لعيسى : إذا دخلت القرية فأت النهر الذي عليه القصارون فاسألهم النصرة ، فأتاهم عيسى وقال : من أنصاري إلى الله ؟ قالوا : نحن ننصرك . فصدقوه ونصروه .ومعنى من أنصاري إلى الله أي من أنصاري مع الله ، كما تقول : الذود إلى الذود إبل ، أي مع الذود . وقيل : أي من أنصاري فيما يقرب إلى الله . وقد مضى هذا في \" آل عمران \"فآمنت طائفة من بني إسرائيل وكفرت طائفة والطائفتان في زمن عيسى افترقوا بعد رفعه إلى السماء ، على ما تقدم في \" آل عمران \" بيانه .فأيدنا الذين آمنوا على عدوهم الذين كفروا بعيسى . فأصبحوا ظاهرين أي غالبين .[ ص: 81 ] قال ابن عباس : أيد الله الذين آمنوا في زمن عيسى بإظهار محمد على دين الكفار . وقال مجاهد : أيدوا في زمانهم على من كفر بعيسى . وقيل أيدنا الآن المسلمين على الفرقتين الضالتين ، من قال : كان الله فارتفع ، ومن قال : كان ابن الله فرفعه الله إليه ; لأن عيسى ابن مريم لم يقاتل أحدا ولم يكن في دين أصحابه بعده قتال . وقال زيد بن علي وقتادة : \" فأصبحوا ظاهرين \" غالبين بالحجة والبرهان ; لأنهم قالوا فيما روي : ألستم تعلمون أن عيسى كان ينام والله لا ينام ، وأن عيسى كان يأكل والله تعالى لا يأكل ! . وقيل : نزلت هذه الآية في رسل عيسى عليه الصلاة والسلام . قال ابن إسحاق : وكان الذي بعثهم عيسى من الحواريين والأتباع بطرس وبولس إلى رومية ، واندراييس ، ومشى إلى الأرض التي يأكل أهلها الناس . وتوماس إلى أرض بابل من أرض المشرق . وفيلبس إلى قرطاجنة وهي أفريقية . ويحنس إلى دقسوس قرية أهل الكهف . ويعقوبس إلى أورشليم وهي بيت المقدس ، وابن تلما إلى العرابية وهي أرض الحجاز . وسيمن إلى أرض البربر . ويهودا وبردس إلى الإسكندرية وما حولها . فأيدهم الله بالحجة . فأصبحوا ظاهرين أي عالين ; من قولك : ظهرت على الحائط أي علوت عليه . والله سبحانه وتعالى أعلم بالصواب ، وإليه المرجع والمآب .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا كُونُوا أَنْصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنْصَارِي إِلَى اللَّهِ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ فَآَمَنَتْ طَائِفَةٌ مِنْ بَنِي إِسْرَائِيلَ وَكَفَرَتْ طَائِفَةٌ فَأَيَّدْنَا الَّذِينَ آَمَنُوا عَلَى عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ (14)هذا خطاب آخر للمؤمنين تكملة لما تضمنه الخطاب بقوله تعالى : { يأيها الذين آمنوا هل أدلكم على تجارة } إلى قوله : { وتجاهدون في سبيل الله } [ الصف : 10 ، 11 ] الآية الذي هو المقصود من ذلك الخطاب ، فجاء هذا الخطاب الثاني تذكيراً بأسوة عظيمة من أحوال المخلصين من المؤمنين السابقين وهم أصحاب عيسى عليه السلام مع قلة عددهم وضعفهم .فأمر الله المؤمنين بنصر الدين وهو نصر غير النصر الذي بالجهاد لأن ذلك تقدم التحريض عليه في قوله : { وتجاهدون في سبيل الله بأموالكم وأنفسكم } [ الصف : 11 ] الآية ووَعَدهم عليه بأن ينصرهم الله ، فهذا النصر المأمور به هنا نصر دِين الله الذي آمنوا به بأن يبثّوه ويَثْبُتوا على الأخذ به دون اكتراث بما يلاقونه من أذى من المشركين وأهللِ الكتاب ، قال تعالى : { لتبلون في أموالكم وأنفسكم ولتسمعن من الذين أوتوا الكتاب من قبلكم ومن الذين أشركوا أذى كثيراً وإن تصبروا وتتقوا فإن ذلك من عزم الأمور } [ آل عمران : 186 ] وهذا هو الذي شبه بنصر الحواريين دين الله الذي جاء به عيسى عليه السّلام ، فإن عيسى لم يجاهد من عاندوه ، ولا كان الحواريون ممن جاهدوا ولكنه صبر وصبروا حتى أظهر الله دين النصرانية وانتشر في الأرض ثم دبّ إليه التغيير حتى جاء الإسلام فنسخه من أصله .والأنصار : جمع نصير ، وهو الناصر الشديد النصر .وقرأ نافع وابن كثير وأبو عمرو وأبو جعفر { كونوا أنصاراً لله } بتنوين { أنصاراً } وقرن اسم الجلالة باللام الجارة فيكون { أنصاراً } مراداً به دلالة اسم الفاعل المفيد للإِحداث ، أي محدثين النصر ، واللام للأجْل ، أي لأجل الله ، أي ناصرين له كما قال تعالى : { فلا ناصر لهم } [ محمد : 13 ] .وقرأه الباقون بإضافة { أنصار } إلى اسم الجلالة بدون لام على اعتبار أنصار كاللقب على نحو قوله : { من أنصاري } .والتشبيه بدعوة عيسى ابن مريم للحواريين وجواب الحواريين تشبيهُ تمثيل ، أي كونوا عند ما يدعوكم محمد صلى الله عليه وسلم إلى نصر الله كحالة قول عيسى ابن مريم للحواريين واستجابتهم له .والتشبيه لقصد التنظير والتأسّي فقد صدق الحواريون وعدهم وثبتوا على الدّين ولم تزعزعهم الفتن والتعذيب .و ( ما ) مصدرية ، أي كقول عيسى وقول الحواريين . وفيه حذف مضاف تقديره : لكوننِ قوللِ عيسى وقول الحواريين . فالتشبيه بمجموع الأمرين قول عيسى وجواب الحواريين لأن جواب الحواريين بمنزلة الكلام المفرع على دعوة عيسى وإنما تحذف الفاء في مثله من المقاولات والمحاورات للاختصار ، كما تقدم في قوله تعالى : { قالوا أتجعل فيها من يفسد فيها } في سورة [ البقرة : 30 ] .وقول عيسى من أنصاري إلى الله } استفهام لاختبار انتدَابهم إلى نصر دين الله معه نظير قول طرفة :إن القوم قالوا مَن فتىً خلت إنني ... عُنيت فلم أكسَل ولم أتبلدوإضافة { أنصار } إلى ياء المتكلم وهو عيسى باعتبارهم أنصارَ دعوته .و { إلى الله } متعلق ب { أنصاري } . ومعنى { إلى } الانتهاء المجازي ، أي متوجهين إلى الله ، شبه دعاؤهم إلى الدين وتعليمهم الناس ما يرضاه الله لهم بسعي ساعين إلى الله لينصروه كما يسعى المستنجَد بهم إلى مكان مستنجِدهم لينصروه على من غلبه .ففي حرف { إلى } استعارة تبعية ، ولذلك كان الجواب المحكي عن الحواريين مطابقاً للاستفهام إذ قالوا : نحن أنصار الله ، أي نحن ننصر الله على من حادّه وشاقَّه ، أي ننصر دينه .و { الحواريون : جمع حواري بفتح الحاء وتخفيف الواو وهي كلمة معربَة عن الحبشية ( حَواريا ) وهو الصاحب الصفي ، وليست عربية الأصل ولا مشتقة من مادة عربية ، وقد عدها الضحاك في جملة الألفاظ المعرّبة لكنه قال : إنها نبطية . ومعنى الحواري : الغسّال ، كذا في الإِتقان } .و { الحواريون } : اسم أطلقه القرآن على أصحاب عيسى الاثني عشر ، ولا شك أنه كان معروفاً عند نصارى العرب أخذوه من نصارى الحبشة . ولا يعرف هذا الاسم في الأناجيل .وقد سمى النبي صلى الله عليه وسلم الزبير بن العوام حواريَّهُ على التشبيه بأحد الحواريين فقال : «لكل نبيء حواري وحواري الزبير» . وقد تقدم ذكر الحواريين في قوله تعالى : { قال الحواريون نحن أنصار الله } في سورة [ آل عمران : 52 ] .واعلم أن مقالة عيسى عليه السّلام المحكية في هذه الآية غير مقالته المحكية في آية آل عمران فإن تلك موجهة إلى جماعة بني إسرائيل الذين أحسّ منهم الكفر لمَّا دعاهم إلى الإِيمان به . أمّا مقالته المحكية هنا فهي موجهة للذين آمنوا به طالباً منهم نصرته لقوله تعالى : كما قال عيسى ابن مريم للحواريين } الآية ، فلذلك تعين اختلاف مقتضى الكلامين المتماثلين .وعلى حسب اختلاف المقامين يجرى اختلاف اعتبار الخصوصيات في الكلامين وإن كانا متشابهين فقد جعلنا هنالك إضافة { أنصارُ الله } [ آل عمران : 52 ] إضافة لفظية وبذلك لم يكن قولهم : { نحن أنصار الله } مفيداً للقصر لانعدام تعريف المسند . فأما هنَا فالأظهر أن كلمة { أنصار الله } اعتبرت لقباً للحواريين عَرَّفوا أنفسهم به وخلعوه على أنفسهم فلذلك أرادوا الاستدلال به على أنهم أحق الناس بتحقيق معناه ، ولذلك تكون إضافة { أنصار } إلى اسم الجلالة هنا إضافة معنوية مفيدة تعريفاً فصارت جملة { نحن أنصار الله } هنا مشتملة على صيغة قصر على خلاف نظيرتها التي في سورة آل عمران .ففي حكاية جواب الحواريين هنا خصوصية صيغة القصر بتعريف المسند إليه والمسند . وخصوصيةُ التعريف بالإِضافة . فكان إيجازاً في حكاية جوابهم بأنهم أجابوا بالانتداب إلى نصر الرسول وبجعل أنفسهم محقوقين بهذا النصر لأنهم محضوا أنفسهم لنصر الدين وعُرِفوا بذلك وبحصر نصر الدين فيهم حصراً يفيد المبالغة في تمحضهم له حتى كأنه لا ناصر للدين غيرهم مع قلتهم وإفادته التعريض بكفر بقيّة قومهم من بني إسرائيل .وفرع على قول الحواريين { نحن أنصار } الإخبار بأن بني إسرائيل افترقوا طائفتين طائفة آمنت بعيسى وما جاء به ، وطائفة كفرت بذلك وهذا التفريع يقتضي كلاماً مقدراً وهو فَنصروا الله بالدعوة والمصابرة عليها فاستجاب بعض بني إسرائيل وكفر بعض وإنما استجاب لهم من بني إسرائيل عدد قليل فقد جاء في إنجيل ( لُوقَا ) أن أتباع عيسى كانوا أكثر من سبعين .والمقصود من قوله : { فآمنت طائفة من بني إسرائيل وكفرت طائفة } التوطئة لقوله : { فأيدنا الذين آمنوا على عدوهم فأصبحوا ظاهرين } والتأييد النصر والتقوية ، أيد الله أهل النصرانية بكثير ممن اتبع النصرانية بدعوة الحواريين وأتباعهم مثل بولس .وإنما قال : { فأيدنا الذين آمنوا } ولم يقل : فأيدناهم لأن التأييد كان لمجموع المؤمنين بعيسى لا لكل فرد منهم إذ قد قتل من أتباعه خلق كثير ومُثِّل بهم وأُلْقوا إلى السباع في المشاهد العامة تفترسهم ، وكان ممن قُتل من الحواريين الحواري الأكبر الذي سماه عيسى بطرس ، أي الصخرة في ثباته في الله .ويزعمون أن جثته في الكنيسة العظمى في رومة المعروفة بكنيسة القدِّيس بطرس والحكمُ على المجموع في مثل هذا شائع كما تقول : نصر الله المسلمين يوم بدر مع أن منهم من قتل . والمقصود نصر الدين .والمقصود من هذا الخبر وعد المسلمين الذين أُمروا أن يكونوا أنصاراً لله بأن الله مؤيدهم على عدوّهم .والعدوّ يطلق على الواحد والجمع ، قال تعالى : { وهم لكم عدو } [ الكهف : 50 ] وتقدم عند قوله تعالى : { يأيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء } في سورة [ الممتحنة : 1 ] .والظاهرُ : هو الغالب ، يقال : ظهر عليه ، أي غلبه ، وظهَر به أي غلب بسببه ، أي بإعانته وأصل فعله مشتق من الاسم الجامد . وهو الظَهْر الذي هو العمود الوسط من جسد الإِنسان والدَّواب لأن بالظهر قوة الحيوان . وهذا مثل فعل ( عَضَد ) مشتقاً من العضُد . و ( أيد ) مشتقاً من اليد ومن تصاريفه ظاهرَ عليه واستظهر وظَهير له قال تعالى : { والملائكة بعد ذلك ظهير } [ التحريم : 4 ] . فمعنى { ظاهرين } أنهم منصورون لأن عاقبة النصر كانت لهم فتمكنوا من الحكم في اليهود الكافرين بعيسى ومزقوهم كل ممزق .\n","ar.waseet":"ثم ختم - سبحانه - السورة الكريمة بنداء ثالث وجهه إلى المؤمنين ، دعاهم فيه إلى التشبه بالصالحين الصادقين من عباده فقال : ( ياأيها الذين آمَنُواْ . . . ) .الحواريون : جمع حوارى . وهم أنصار عيسى - عليه السلام - الذين آمنوا به وصدقوه ، وأخلصوا له ولازموه ، وكانوا عونا له فى الدعوة إلى الحق ، وكانوا اثنى عشر رجلا .يقال : فلان حوارى فلان ، أى : هو من خاصة أصحابه ، ومنه قول البنى - صلى الله عليه وسلم - فى الزبير بن العوام : \" لكل نبى حوارى ، وحواريى الزبير \" .وأصل الحور : شدة البياض والصفاء ، ومنه قولهم فى خالص لباب الدقيق : الحوارى ، وفى النساء البيض الحسان : الحواريات والحوريات .وسمى الله - تعالى - أصفياء عيسى وأنصاره بذلك لشدة إخلاصهم له ، وطهارة قلوبهم من الغش والنفاق ، فصاروا فى نقائهم وصفائهم كالشىء الأبيض الخالص .والأنصار : جمع نصير ، وهو من ينصر غيره نصرا شديدا مؤزرا .والمراد بنصر الله - تعالى - : نصر دينه وشريعته ونبيه الذى أرسله بالهدى ، وديم الحق .وقرأ نافع وابن كثير وأبو عمرو : كونوا أنصاراً لله .والمعنى : يا من آمنتم بالله - تعالى - حق الإيمان داوموا وواظبوا على أن تكونوا أنصاراً لدين الله فى كل حال ، كما كان الحواريون كذلك ، عندما دعاهم عيسى - عليه السلام - إلى نصرته والوقوف إلى جانبه .فالكلام محمول على المعنى ، والمقصود منه حض المؤمنين على طاعة الرسول - صلى الله عليه وسلم - وعلى الاستجابة التامة لما يدعوهم إليه ، كما فعل الحواريون مع عيسى ، حيث ثبتوا على دينهم ، وصدقوا مع نبيهم ، دون أن تنال منهم الفتن أو المصائب .قال صاحب الكشاف : فإن قلت : ما وجه صحة التشبيه - وظاهره تشبيه كونهم أنصاراً بقول عيسى ( مَنْ أنصاري إِلَى الله ) .قلت التشبيه محمول على المعنى ، وعليه يصح ، والمراد كونوا أنصار الله ، كما كان الحواريون أنصار عيسى كذلك حين قال لهم : من أنصارى إلى الله .فإن قتل : فما معنى قوله : ( مَنْ أنصاري إِلَى الله ) ؟ قلت : يجب أن يكون معناه مطابقا لجواب الحواريين : ( نَحْنُ أَنصَارُ الله ) والذى يطابقه أن يكون المعنى : من جندى متوجها إلى نصرة دين الله .والاستفهام فى قوله - تعالى - : ( مَنْ أنصاري إِلَى الله ) للحض على نصرته والوقوف إلى جانبه .وأضافهم - عليه السلام - إليه ، باعتبارهم أنصار دعوته ودينه .وقوله : ( إِلَى الله ) متعلق بأنصارى ، ومعنى \" إلى \" الانتهاء المجازى .أى : قال عيسى للحواريين على سبيل الامتحان لقوة إيمانهم : من الجند المخلصون الذين أعتمد عليهم بعد الله - تعالى - فى نصرة دينه ، وفى التوجه إليه بالعبادة والطاعة وتبليغ رسالته . . . ؟فأجابوه بقولهم : نحن أنصار دين الله - تعالى - ونحن الذين على استعداد أن نبذل نفوسنا وأموالنا فى سبيل تبليغ دعوته - عز وجل - ومن أجل إعلاء كلمته .وقوله - تعالى - : ( فَآمَنَت طَّآئِفَةٌ مِّن بني إِسْرَائِيلَ وَكَفَرَت طَّآئِفَةٌ ) مفرع على ما قبله ، لبيان موقف قومه منه .أى : قال الحواريون لعيسى عندما دعاهم إلى اتباع الحق : نحن أنصار دين الله ، ونحن الذين سنثبت على العهد . . . أما بقية بنى إسرائيل فقد افترقوا إلى فرقتين : فرقة آمنت بعيسى وبما جاء به من عند الله - تعالى - ، وفرقة أخرى كفرت به وبرسالته .وقوله : ( فَأَيَّدْنَا الذين آمَنُواْ على عَدُوِّهِمْ فَأَصْبَحُواْ ظَاهِرِينَ ) .بيان للنتائج التى تحققت لكل طائفة من الطائفتين : المؤمنين والكافرين .وقوله : ( ظَاهِرِينَ ) من الظهور بمعنى الغلبة ، يقال : ظهر فلان على فلان ، إذا تغلب عليه وقهره .أى : كان من قوم عيسى من آمن به ، ومنهم من كفر به ، فأيدنا وقوينا ونصرنا الذين آمنوا به ، على الذين كفروا به ، فصار المؤمنون ظاهرين ومنتصرين على أعدائهم بفضله - تعالى - ومشيئته .والمقصود من هذا الخبر حض المؤمنون فى كل زمان ومكان ، على الإيمان والعمل الصالح ، لأن سنة الله - تعالى - قد اقتضت أن يجعل العاقبة لهم ، كما جعلها لأتباع عيسى المؤمنين ، على أعدائهم الكافرين .قال بعض العلماء : وتأويل هذا النص يمكن أن ينصرف إلى أحد معنيين : إما أن الذين آمنوا برسالة عيسى - عليه السلام - ، هم المسيحيون إطلاقا ، من استقام ، ومن دخلت فى عقيدته الانحرافات ، وقد أيدهم الله - تعالى - على اليهود الذين لم يؤمنوا به أصلا ، كما حدث فى التاريخ .وإما أن الذين آمنوا : هم الذين أصروا على التوحيد فى وجه المؤهلين لعيسى ، والمثلثين وسائر النحل التى انحرفت عن التوحيد .ومعنى : أنهم أصبحوا ظاهرين ، أى : بالحجة والبرهان ، أو أن التوحيد الذى هم عليه ، هو الذى أظهره الله بهذا الدين الأخير - أى : دين الإسلام - وجعل له الجولة الأخيرة فى الأرض . كما وقع فى التاريخ .هذا المعنى الأخير هو الأرجح والأقرب فى هذا السياق .وبعد : فهذا تفسير لسورة \" الصف \" نسأل الله - تعالى - أن يجعله خالصاً لوجهه ، ونافعاً لعباده .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"ثم حضهم على نصر الدين وجهاد المخالفين فقال : ( يا أيها الذين آمنوا كونوا أنصار الله ) . قرأ أهل الحجاز وأبو عمرو : \" أنصارا \" بالتنوين \" لله \" بلام الإضافة وقرأ الآخرون : \" أنصار الله \" مضافا لقوله : \" نحن أنصار الله \" .( كما قال عيسى ابن مريم للحواريين ) . أي انصروا دين الله مثل نصرة الحواريين لما قال لهم عيسى عليه السلام : ( من أنصاري إلى الله ) . أي : من ينصرني مع الله ( قال الحواريون نحن أنصار الله فآمنت طائفة من بني إسرائيل وكفرت طائفة ) . قال ابن عباس : يعني في زمن عيسى عليه السلام وذلك أنه لما رفع تفرق قومه ثلاث فرق : فرقة قالوا : كان الله فارتفع ، وفرقة قالوا : كان ابن الله فرفعه الله إليه وفرقة قالوا : كان عبد الله ورسوله فرفعه إليه وهم المؤمنون واتبع كل فرقة منهم طائفة من الناس فاقتتلوا فظهرت الفرقتان الكافرتان على المؤمنين حتى بعث الله محمدا - صلى الله عليه وسلم - فظهرت الفرقة المؤمنة على الكافرة فذلك قوله تعالى : ( فأيدنا الذين آمنوا على عدوهم فأصبحوا ظاهرين ) . عالين غالبين . وروى مغيرة عن إبراهيم قال : فأصبحت حجة من آمن بعيسى ظاهرة بتصديق محمد - صلى الله عليه وسلم - أن عيسى كلمة الله وروحه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5177.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5177.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5177.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":242,"letters":1804,"size":"149KB","priority":3,"commonlyRead":false}}