{"chapter":62,"name":{"arabic":"سورة 62","transliteration":"Chapter 62","translation":"Chapter 62","revelation":"unknown"},"revelation":"unknown","verses":11,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ","transliteration":"Yusabbihu lilaahi maa fis samaawaati wa maa fil ardil Malikil Quddoosil 'Azeezil Hakeem","translations":{"en.ahmedali":"ALL THAT IS in the heavens and the earth sings the praises of God the King, the Holy, Omnipotent, the Wise.","en.ahmedraza":"All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah, the King, the Most Pure, the Most Honourable, the Wise.","en.arberry":"All that is in the heavens and the earth magnifies God, the King, the All-holy, the All-mighty, the All-wise.","en.asad":"ALL THAT IS in the heavens and all that is on earth extols the limitless glory of God, the Sovereign Supreme, the Holy, the Almighty, the Wise!","en.daryabadi":"Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah, the Sovereign, the Holy, the Mighty, the Wise.","en.hilali":"Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah, the King (of everything), the Holy, the All-Mighty, the All-Wise.","en.pickthall":"All that is in the heavens and all that is in the earth glorifieth Allah, the Sovereign Lord, the Holy One, the Mighty, the Wise.","en.qaribullah":"All that is in heavens and earth exalt Allah, the King, the Pure, the Almighty, the Wise.","en.sahih":"Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise.","en.sarwar":"All that is in the heavens and the earth glorify God, the King, the Holy, the Majestic and the All-wise.","en.yusufali":"Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah,- the Sovereign, the Holy One, the Exalted in Might, the Wise.","en.maududi":"All that is in the heavens and all that is in the earth extols the glory of Allah, the Sovereign, the Holy, the All- Mighty, the All-Wise.","en.shakir":"Whatever is in the heavens and whatever is in the earth declares the glory of Allah, the King, the Holy, the Mighty, the Wise.","en.itani":"Everything in the heavens and the earth glorifies God the Sovereign, the Holy, the Almighty, the Wise.","en.mubarakpuri":"Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah -- the King, the Holy, the Almighty, the All-Wise.","en.qarai":"Whatever there is in the heavens and in the earth glorifies Allah, the Sovereign, the All-holy, the All-mighty, the All-wise.","en.wahiduddin":"Whatever is in the heavens and on the earth glorifies God, the Sovereign Lord, the Holy One, the Mighty, the Wise."},"tafsir":{"ar.muyassar":"ينزِّه الله تعالى عن كل ما لا يليق به كلُّ ما في السموات وما في الأرض، وهو وحده المالك لكل شيء، المتصرف فيه بلا منازع، المنزَّه عن كل نقص، العزيز الذي لا يغالَب، الحكيم في تدبيره وصنعه.","ar.jalalayn":"«يسبح لله» ينزهه فاللام زائدة «ما في السماوات وما في الأرض» في ذكر ما تغليب للأكثر «الملك القدوس» المنزه عما لا يليق به «العزيز الحكيم» في ملكه وصنعه.","ar.qurtubi":"سورة الجمعةمدنية في قول الجميع ، وهي إحدى عشرة آية . وفي صحيح مسلم عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : \" خير يوم طلعت عليه الشمس يوم الجمعة ، فيه خلق آدم ، وفيه أدخل الجنة ، وفيه أخرج منها ، ولا تقوم الساعة إلا في يوم الجمعة \" . وعنه قال : قال رسول الله : \" نحن الآخرون الأولون يوم القيامة ، ونحن أول من يدخل الجنة بيد أنهم أوتوا الكتاب من قبلنا وأوتيناه من بعدهم فاختلفوا ، فهدانا الله لما اختلفوا فيه من الحق ، فهذا يومهم الذي اختلفوا فيه هدانا الله له - قال - يوم الجمعة ، فاليوم لنا وغدا لليهود وبعد غد للنصارى \" .بسم الله الرحمن الرحيميسبح لله ما في السماوات وما في الأرض الملك القدوس العزيز الحكيمتقدم الكلام فيه . وقرأ أبو العالية ونصر بن عاصم \" الملك القدوس العزيز الحكيم \" كلها رفعا ; أي هو الملك .\n","ar.miqbas":"يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ (1)افتتاح السورة بالإِخبار عن تسبيح أهل السماوات والأرض لله تعالى براعة استهلال لأن الغرض الأول من السورة التحريض على شهود الجمعة والنهي عن الأشغال التي تشغل عن شهودها وزجر فريق من المسلمين انصرفوا عن صلاة الجمعة حِرصاً على الابتياع من عِيرٍ وردت المدينة في وقت حضورهم لصلاة الجمعة .وللتنبيه على أن أهل السماوات والأرض يجددون تسبيح الله ولا يفترون عنه أوثر المضارع في قوله : { يسبح } .ومعاني هذه الآية تقدمت مفرقة في أوائل سورة الحديد وسورة الحشر .سوى أن هذه السورة جاء فيها فعل التسبيح مُضارعاً وجيء به في سواها ماضياً لمناسبةٍ فيها وهي : أن الغرض منها التنويه بصلاة الجمعة والتنديد على نفر قطعوا عن صلاتهم وخرجوا لتجارة أو لهو فمناسب أن يحكى تسبيح أهل السماوات والأرض بما فيه دلالة على استمرار تسبيحهم وتجدده تعريضاً بالذين لم يتموا صلاة الجمعة .ومعاني صفات الله تعالى المذكورة هنا تقدمت في خواتم سورة الحشر .ومناسبة الجمع بين هذه الصفات هنا أن العظيم لا يَنصرِف عن مجلس من كان عنده إلا عند انفضاض مجلسه أو إيذانه بانصرافهم .و { القُدوس } : المنزَّه عن النقص وهو يُرغب في حضرته . و { العزيز } : يَعتز الملتفون حوله . فمفارقتهم حضرته تفريط في العزة . وكذلك { الحكيم } إذا فارق أحد حضرته فاته في كل آن شيء من الحكمة كما فات الذين انفضوا إلى العِير مَا خطب به النبي صلى الله عليه وسلم إذْ تركوه قائماً في الخطبة .\n","ar.waseet":"افتتحت سورة \" الجمعة \" كغيرها من أخواتها \" المسبحات \" بالثناء على الله - تعالى - وببيان أن المخلوقات جميعها ، تسبح بحمده - تعالى - وتقدس له .والتسبيح : تنزيه الله - تعالى - عما لا يليق به ، اعتقادا وقولا وعملا مأخوذ من السبح وهو المر السريع فى الماء أو الهواء ، لأن المسبح لله ، - تعالى - مسرع فى تنزيهه - تعالى - وتبرئته من كل سوء .وقوله : ( القدوس ) من التقديس بمعنى والتطهير وغير ذلك من صفات الكمال .أى : أن التسبيح : نفى ما لا يليق بذاته - تعالى - ، والتقديس : إثبات ما يليق بجلاله - سبحانه - والمعنى : ينزه الله - تعالى - ويبعده عن كل نقص ، جميع ما فى السموات ، وجميع ما فى الأرض من مخلوقات ، فهو - سبحانه - ( الملك ) أى : المدبر لشئون هذا الكون ، المتصرف فيه تصرف المالك فيما يملكه . . .( القدوس ) أى : البليغ فى الطهارة وفى التنزه عن كل نقص ، من القُدْس - ضم القاف وسكون الدال - بمعنى الطهر ، وأصله القَدَس - بفتح القاف والدال - وهو الإناء الذى يكون فيه ما يتطهر به ، ومنه القادوس وهو إناء معروف .( العزيز ) الذى لا يغلبه غالب ( الحكيم ) فى كل أقواله وأفعاله وتصرفاته .هذا ، ومن الآيات الكثيرة الدالة على أن جميع من فى السموات ومن فى الأرض ، يسبحون لله - تعالى - قوله - عز وجل - : ( تُسَبِّحُ لَهُ السماوات السبع والأرض وَمَن فِيهِنَّ وَإِن مِّن شَيْءٍ إِلاَّ يُسَبِّحُ بِحَمْدِهِ ولكن لاَّ تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيماً غَفُوراً . . ).\n","ar.baghawi":"مدنية\"يسبح لله ما في السموات وما في الأرض الملك القدوس العزيز الحكيم\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5178.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5178.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5178.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِنْ كَانُوا مِنْ قَبْلُ لَفِي ضَلَالٍ مُبِينٍ","transliteration":"Huwal lazee ba'asa fil ummiyyeena Rasoolam min hum yatloo 'alaihim aayaatihee wa yuzakkeehim wa yu'allimuhumul Kitaaba wal Hikmata wa in kaano min qablu lafee dalaalim mubeen","translations":{"en.ahmedali":"It is He who raised among the gentiles an apostle from amongst them, who recites His revelations to them, reforms them and teaches them the Scripture and the Law, for before him they were clearly in error.","en.ahmedraza":"It is He Who has sent among the unlettered people a Noble Messenger from themselves, who recites His verses to them and purifies them, and bestows them the knowledge of the Book and wisdom; and indeed before this, they were in open error.","en.arberry":"It is He who has raised up from among the common people a Messenger from among them, to recite His signs to them and to purify them, and to teach them the Book and the Wisdom, though before that they were in manifest error,","en.asad":"He it is who has sent unto the unlettered people an apostle from among themselves, to convey unto them His messages, and to cause them to grow in purity, and to impart unto them the divine writ as well as wisdom - whereas before that they were indeed, most obviously, lost in error","en.daryabadi":"He it is Who hath raised amdist the unlettered ones an apostle from among themselves, rehearsing Unto them His revelations and purifying them and teaching them the Book and Wisdom, though they have been aforetime in error manifest.","en.hilali":"He it is Who sent among the unlettered ones a Messenger (Muhammad SAW) from among themselves, reciting to them His Verses, purifying them (from the filth of disbelief and polytheism), and teaching them the Book (this Quran, Islamic laws and Islamic jurisprudence) and Al-Hikmah (As-Sunnah: legal ways, orders, acts of worship, etc. of Prophet Muhammad SAW). And verily, they had been before in mainfest error;","en.pickthall":"He it is Who hath sent among the unlettered ones a messenger of their own, to recite unto them His revelations and to make them grow, and to teach them the Scripture and wisdom, though heretofore they were indeed in error manifest,","en.qaribullah":"It is He who has raised among the illiterate (Arabs), a Messenger from themselves, to recite to them His verses, to purify them, and to teach them the Book and the Wisdom, though before that they were in clear error,","en.sahih":"It is He who has sent among the unlettered a Messenger from themselves reciting to them His verses and purifying them and teaching them the Book and wisdom - although they were before in clear error -","en.sarwar":"It is He who has sent to the illiterate a Messenger from among their own people to recite to them His revelations and purify them. He will teach the Book to them","en.yusufali":"It is He Who has sent amongst the Unlettered a messenger from among themselves, to rehearse to them His Signs, to sanctify them, and to instruct them in Scripture and Wisdom,- although they had been, before, in manifest error;-","en.maududi":"He it is Who has sent to the gentiles a Messenger from among themselves, one who rehearses to them His verses, purifies their lives, and imparts to them the Book and the Wisdom although before that they were in utter error;","en.shakir":"He it is Who raised among the inhabitants of Mecca an Apostle from among themselves, who recites to them His communications and purifies them, and teaches them the Book and the Wisdom, although they were before certainly in clear error,","en.itani":"It is He who sent among the unlettered a messenger from themselves; reciting His revelations to them, and purifying them, and teaching them the Scripture and wisdom; although they were in obvious error before that.","en.mubarakpuri":"He it is Who sent among the unlettered ones a Messenger from among themselves, reciting to them His Ayat, purifying them, and teaching them the Book and the Hikmah. And verily, they had been before in manifest error.","en.qarai":"It is He who sent to the unlettered [people] an apostle from among themselves, to recite to them His signs, to purify them, and to teach them the Book and wisdom, and earlier they had indeed been in manifest error.","en.wahiduddin":"It is He who has raised among the unlettered people a messenger from among themselves who recites His revelations to them, and purifies them, and teaches them the Book and wisdom, for they had formerly been clearly misguided --"},"tafsir":{"ar.muyassar":"الله سبحانه هو الذي أرسل في العرب الذين لا يقرؤون، ولا كتاب عندهم ولا أثر رسالة لديهم، رسولا منهم إلى الناس جميعًا، يقرأ عليهم القرآن، ويطهرهم من العقائد الفاسدة والأخلاق السيئة، ويعلِّمهم القرآن والسنة، إنهم كانوا من قبل بعثته لفي انحراف واضح عن الحق. وأرسله سبحانه إلى قوم آخرين لم يجيئوا بعدُ، وسيجيئون من العرب ومن غيرهم. والله تعالى- وحده- هو العزيز الغالب على كل شيء، الحكيم في أقواله وأفعاله.","ar.jalalayn":"«هو الذي بعث في الأميين» العرب، والأمي: من لا يكتب ولا يقرأ كتابا «رسولا منهم» هو محمد صلى الله عليه وسلم «يتلو عليهم آياته» القرآن «ويزكيهم» يطهرهم من الشرك «ويعلمهم الكتاب» القرآن «والحكمة» ما فيه من الأحكام «وإن» مخففة من الثقيلة واسمها محذوف، أي وإنهم «كانوا من قبل» قبل مجيئه «لفي ضلال مبين» بيّن.","ar.qurtubi":"قوله تعالى : هو الذي بعث في الأميين رسولا منهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين[ ص: 83 ] قوله تعالى : هو الذي بعث في الأميين رسولا منهم قال ابن عباس : الأميون العرب كلهم ، من كتب منهم ومن لم يكتب ، لأنهم لم يكونوا أهل كتاب . وقيل : الأميون الذين لا يكتبون . وكذلك كانت قريش . وروى منصور عن إبراهيم قال : الأمي الذي يقرأ ولا يكتب . وقد مضى في \" البقرة \" .رسولا منهم يعني محمدا صلى الله عليه وسلم . وما من حي من العرب إلا ولرسول الله صلى الله عليه وسلم فيهم قرابة وقد ولدوه . قال ابن إسحاق : إلا حي تغلب ; فإن الله تعالى طهر نبيه صلى الله عليه وسلم منهم لنصرانيتهم ، فلم يجعل لهم عليه ولادة . وكان أميا لم يقرأ من كتاب ولم يتعلم صلى الله عليه وسلم . قال الماوردي : فإن قيل ما وجه الامتنان إن بعث نبيا أميا ؟ فالجواب عنه من ثلاثة أوجه : أحدها : لموافقته ما تقدمت به بشارة الأنبياء . الثاني : لمشاكلة حال لأحوالهم ، فيكون أقرب إلى موافقتهم . الثالث : لينتفي عنه سوء الظن في تعليمه ما دعا إليه من الكتب التي قرأها والحكم التي تلاها . قلت : وهذا كله دليل معجزته وصدق نبوته .قوله تعالى : يتلو عليهم آياته يعني القرآن\" ويزكيهم \" أي يجعلهم أزكياء القلوب بالإيمان ; قاله ابن عباس . وقيل : يطهرهم من دنس الكفر والذنوب ; قاله ابن جريج ومقاتل . وقال السدي : يأخذ زكاة أموالهمويعلمهم الكتاب يعني القرآنوالحكمة السنة ; قاله الحسن . وقال ابن عباس : الكتاب الخط بالقلم ; لأن الخط فشا في العرب بالشرع لما أمروا بتقييده بالخط . وقال مالك بن أنس : الحكمة الفقه في الدين . وقد مضى القول في هذا في \" البقرة \" .\" وإن كانوا من قبل \" أي من قبله وقبل أن يرسل إليهم .لفي ضلال مبين أي في ذهاب عن الحق .\n","ar.miqbas":"هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آَيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِنْ كَانُوا مِنْ قَبْلُ لَفِي ضَلَالٍ مُبِينٍ (2)استئناف بياني ناشىء عن إجراء الصفات المذكورة آنفاً على اسم الجلالة إذ يتساءل السامع عن وجه تخصيص تلك الصفات بالذكر من بين صفات الله تعالى فكأن الحال مقتضياً أن يبين شيء عظيم من تعلق تلك الصفات بأحوال خلقه تعالى إذ بعث فيهم رسولاً يطهر نفوسهم ويزكيهم ويعلمهم . فصفة { الملك } [ الجمعة : 1 ] تعلقت بأن يدبر أمر عباده ويصلح شؤونهم ، وصفة { القدوس } [ الجمعة : 1 ] تعلقت بأن يزكي نفوسهم ، وصفة { العزيز } [ الجمعة : 1 ] اقتضت أن يلحق الأميين من عباده بمراتب أهل العلم ويخرجهم من ذلة الضلال فينالوا عزة العلم وشرفه ، وصفة { الحكيم } [ الجمعة : 1 ] اقتضت أن يعلمهم الحكمة والشريعة .وابتداء الجملة بضمير اسم الجلالة لتكون جملة اسمية فتفيد تقوية هذا الحكم وتأكيده ، أي أن النبي صلى الله عليه وسلم مَبعوث من الله لا محالة .و { في } من قوله : { في الأميين } للظرفية ، أي ظرفية الجماعة ولأحد أفرادها . ويفهم من الظرفية معنى الملازمَة ، أي رسولاً لا يفارقهم فليس ماراً بهم كما يَمرّ المرسل بمقالةٍ أو بمالكةٍ يبلغها إلى القوم ويغادرهم .والمعنى : أن الله أقام رسوله للناس بين العرب يدعوهم وينشر رسالته إلى جميع النّاس من بلاد العرب فإن دلائل عموم رسالة محمد صلى الله عليه وسلم معلومة من مواضع أخرى من القرآن كما في سورة [ الأعراف : 158 ] { قل يأيها الناس إني رسول الله إليكم جميعاً } وفي سورة [ سبأ : 28 ] { وما أرسلناك إلا كافة للناس بشيراً ونذيراً . } والمراد بالأميين : العرب لأن وصف الأميّة غالب على الأمة العربية يومئذٍ . ووصف الرسول ب { منهم } ، أي لم يكن غريباً عنهم كما بعث لوطاً إلى أهل سدوم ولا كما بعث يونس إلى أهل نينوَى ، وبعث إلياس إلى أهل صيدا من الكنعانيين الذين يعبدون بَعل ، ف ( من ) تبعيضية ، أي رسولاً من العرب .وهذه منة موجهة للعرب ليشكروا نعمة الله على لطفه بهم ، فإن كون رسول القوم منهم نعمةٌ زائدة على نعمة الإِرشاد والهدي ، وهذا استجابة لدعوة إبراهيم إذ قال : { ربنا وابعث فيهم رسولاً منهم } [ البقرة : 129 ] فتذكيرهم بهذه النعمة استنزال لطائر نفوسهم وعنادهم .وفيه تورك عليهم إذ أعرضوا عن سماع القرآن فإن كون الرسول منهم وكتابه بلغتهم هو أعون على تلقي الإِرشاد منه إذ ينطلق بلسانهم ويحملهم على ما يصلح أخلاقهم ليكونوا حملة هذا الدين إلى غيرهم .و { الأميين } : صفة لموصوف محذوف دل عليه صيغة جمع العقلاء ، أي في الناس الأميين . وصيغة جمع الذكور في كلام الشارع تشمل النساء بطريقة التغليب الاصطلاحي ، أي في الأميين والأمِّيات فإن أدلة الشريعة قائمة على أنها تعم الرجال والنساء إلا في أحكام معلومة .والأميون : الذين لا يقرؤون الكتابة ولا يكتبون ، وهو جمع أمي نسبة إلى الأمة ، يعنون بها أمة العرب لأنهم لا يكتبون إلا نادراً ، فغلبت هذا التشبيه في الإطلاق عند العرب حتى صارت تطلق على من لا يكتب ولو من غيرهم ، قال تعالى في ذكر بني إسرائيل{ ومنهم أميون لا يعلمون الكتاب إلا أماني } وقد تقدم في سورة [ البقرة : 78 ] .وأوثر التعبير به هنا توركاً على اليهود لأنهم كانوا يقصدون به الغض من العرب ومن النبي جهلاً منهم فيقولون : هو رسول الأميين وليس رسولاً إلينا . وقد قال ابن صياد للنبي لما قال له : أتشهد أني رسول الله . أشهد أنكَ رسولُ الأميين . وكان ابن صياد متديناً باليهودية لأن أهله كانوا حلفاء لليهود .وكان اليهود ينتقصون المسلمين بأنهم أميون قال تعالى : { ذلك بأنهم قالوا ليس علينا في الأميين سبيل } [ آل عمران : 75 ] فتحدى الله اليهود بأنه بعث رسولاً إلى الأميين وبأن الرسول أمي ، وأعلمهم أن ذلك فضل الله يؤتيه من يشاء كما في آخر الآية وأن فضل الله ليس خاصاً باليهود ولا بغيرهم وقد قال تعالى من قبل لموسى { ونريد أن نمنّ على الذين استضعفوا في الأرض ونجعلهم أيمة ونجعلهم الوارثين ونمكن لهم في الأرض } [ القصص : 5 - 6 ] .ووصف الرسول بأنه منهم ، أي من الأميين شامل لمماثلته لهم في الأمية وفي القومية . وهذا من إيجاز القرآن البديع .وفي وصف الرسول الأمي بأنه يتلو على الأميين آيات الله ، أي وحيه ويزكيهم ويعلمهم الكتاب ، أي يلقنهم إياه كما كانت الرسل تلقن الأمم الكتاب بالكتابة ، ويعلمهم الحكمة التي علمتها الرسل السابقون أممهم في كل هذه الأوصاف تحد بمعجزة الأمية في هذا الرسول صلى الله عليه وسلم أي هو مع كونه أمّياً قد أتى أمته بجميع الفوائد التي أتى بها الرّسل غير الأميين أممهم ولم ينقص عنهم شيئاً ، فتمحضت الأمية للكون معجزة حصل من صاحبها أفضل مما حصل من الرسل الكاتبين مثل موسى .وفي وصف الأميّ بالتلاوة وتعليم الكتاب والحكمة وتزكية النفوس ضرب من محسن الطباق لأن المتعارف أن هذه مضادة للأمية .وابتدىء بالتلاوة لأن أول تبليغ الدعوة بإبلاغ الوحي ، وثني بالتزكية لأن ابتداء الدعوة بالتطهير من الرجس المعنوي وهو الشرك ، وما يعْلق به من مساوىء الأعمال والطباع .وعقب بذكر تعليمهم الكتاب لأن الكتاب بعد إبلاغه إليهم تُبيّن لهم مقاصده ومعانيه كما قال تعالى : { فإذا قرأناه فاتبع قرآنه ثم إن علينا بيانه } [ القيامة : 18 ، 19 ] ، وقال : { لتبين للناس ما نزل إليهم } [ النحل : 44 ] ، وتعليم الحكمة هو غاية ذلك كله لأن من تدبر القرآن وعمل به وفهم خفاياه نال الحكمة قال تعالى : { واذكروا نعمة الله عليكم وما أنزل عليكم من الكتاب والحكمة يعظكم به } [ البقرة : 231 ] ونظيرها قوله : { لقد من الله على المؤمنين إذ بعث فيهم رسولاً من أنفسهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين } في سورة [ آل عمران : 164 ] .وجملة وإن كانوا من قبل لفي ضلال مبين } في موضع الحال من الأميين ، أي ليست نعمة إرسال هذا الرسول إليهم قاصرة على رفع النقائص عنهم وعلى تحليتهم بكمال علم آيات الله وزكاة أنفسهم وتعليمهم الكتاب والحكمة بل هي أجل من ذلك إذ كانت منقذة لهم من ضلال مبين كانوا فيه وهو ضلال الإِشراك بالله . وإنما كان ضلالاً مبيناً لأنه أفحش ضلال وقد قامت على شناعته الدلائل القاطعة ، أي فأخرجهم من الضلال المبين إلى أفضل الهدى ، فهؤلاء هم المسلمون الذين نفروا إسلامهم في وقت نزول هذه السورة .و { إنْ } مخففة من الثقيلة وهي مهملة عن العمل في اسمها وخبرها . وقد سد مسدها فعل ( كان ) كما هو غالب استعمال { إنْ } المخففة . واللام في قوله : { لفي ضلال مبين } تسمى اللام الفارقة ، أي التي تفيد الفرق بين ( إنْ ) النافية و { إنْ } المخففة من الثقيلة وما هي إلا اللام التي أصلها أن تقترن بخبر ( إن ) إذ الأصل : وإنهم لفي ضلال مبين ، لكن ذكر اللام مع المخففة واجب غالباً لئلا تلتبس بالنافية ، إلا إذا أمن اللبس .\n","ar.waseet":"ثم بين - سبحانه - جانبا من مظاهر فضله على خلقه ، فقال : ( هُوَ الذي بَعَثَ فِي الأميين رَسُولاً مِّنْهُمْ يَتْلُواْ عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الكتاب والحكمة . . . ) .وقوله : ( الأميين ) جمع أمى ، وهو صفة لموصوف محذوف . أى : فى الناس أو فى القوم الأميين ، والمراد بهم العرب ، لأن معظمهم كانوا لا يعرفون القراءة والكتابة .وسمى من لا يعرف القراءة والكتابة بالأمى ، لغلبة الأمية عليه ، حتى لكأن حاله بعد تقدمه فى السن ، كحاله يوم ولدته أمه فى عدم معرفته للقراء ة والكتابة .و \" من \" فى قوله - تعالى - : ( مِّنْهُمْ ) للتبعيض ، باعتبار أنه واحد منهم ، ويشاركهم فى بعض صفاتهم وهى الأمية .وقوله : ( يَتْلُواْ . . . ) من التلاوة ، وهى القراءة المتتابعة المرتلة ، التى يكون بعضها تلو بعض .وقوله : ( وَيُزَكِّيهِمْ ) من التزكية بمعنى التطهير والتنقية من السوء والقبائح .والمراد بالكتاب : القرآن ، والمراد بتعليمه : بيان معانيه وحقائقه ، وشرح أحكامه وأوامره ونواهيه .والمراد بالحكمة : العلم النافع ، المصحوب بالعمل الصالح ، وفى وضعها إلى جانب الكتاب إشارة إلى أن المقصود بها السنة النبوية المطهرة ، إذ بالكتاب وبالسنة ، يعرف الناس أصلح الأقوال والأفعال ، وأعدل الأحكام وأقوم الآداب ، وأسمى الفضائل ..أى : هو - سحبانه - وحده ، الذى ( بَعَثَ ) بفضله وكرمه ، ( فِي ) العرب ( الأميين رَسُولاً ) كريما عظيما ، كائنا ( مِّنْهُمْ ) أى : من جنسهم يعرفون حسبه ونسبه وخلقه . . . هذا الرسول الكريم أرسلناه إليهم ، ليقرأ عليهم آيات الله - تعالى - التى أنزلها عليه لهدايتهم وسعادتهم ، متى آمنوا بها ، وعملوا بما اشتملت عليه من توجيهات سامية .وأرسلناه إليهم - أيضا - ليزكيهم ، أى : وليطهرهم من الكفر والقبائح والمنكرات وليعلمهم الكتاب ، بأن يحفظهم إياه ، ويشرح لهم أحكامه ، ويفسر لهم ما خفى عليهم من ألفاظه ومعانيه .وليعلمهم - أيضا - الحكمة . أى : العلم النافع المصحوب بالعمل الطيب وصدر - سبحانه - الآية الكريمة بضمير اسم الجلالة ، لتربية المهابة فى النفوس ، ولتقوية ما اشتملت عليه من نعم وأحكام ، إذ هو - سبحانه - وحده الذى فعل ذلك لا غيره .وعبر - سبحانه - بفى المفيدة للظرفية فى قوله - تعالى - : ( فِي الأميين ) . للإشعار بأن هذا الرسول الكريم الذى أرسله إليهم ، كان مقيما فيهم ، وملازما لهم ، وحريصا على أن يبلغهم رسالة الله - تعالى - فى كل الأوقات والأزمان .والتعبير بقوله : ( مِّنْهُمْ ) فيه ما فيه من دعوتهم إلى الإيمان به ، لأن هذا الرسول الكريم ، ليس غريبا عنهم ، بل هو واحد منهم شرفهم من شرفه ، وفضلهم من فضله . . .وهذه الآية الكريمة صريحة فى أن الله - تعالى - قد استجاب دعوة نبيه إبراهيم - عليه السلام - عندما دعاه بقوله : ( رَبَّنَا وابعث فِيهِمْ رَسُولاً مِّنْهُمْ يَتْلُواْ عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الكتاب والحكمة وَيُزَكِّيهِمْ إِنَّكَ أَنتَ العزيز الحكيم . . ) وقد جاء ترتيب هذه الآية الكريمة وأمثالها فى أسمى درجات البلاغة والحكمة ، لأن أول مراحل تبليغ الرسالة ، يكون بتلاوة القرآن ، ثم ثنى - سبحانه - بتزكيه النفوس من الأرجاس ، ثم ثلث بتعليم الكتاب والحكمة لأنهما يكونان بعد التبليغ والتزكية للنفوس .ولذا قالوا : إن تعليم الكتاب غير تلاوته ، لأن تلاوته معناها ، قراءته قراءة مرتلة ، أما تعليمه فمعناه : بيان أحكامه ، وشرح ما خفى من ألفاظه وأحكامه . . .فأنت ترى أن هذه الآية الكريمة ، قد اشتملت على جملة من الصفات الجليلة التى منحها - سبحانه - لنبيه محمد - صلى الله عليه وسلم - .ثم بين - سبحانه - بعد ذلك حال الناس قبل بعثته - صلى الله عليه وسلم - فقال : ( وَإِن كَانُواْ مِن قَبْلُ لَفِي ضَلاَلٍ مُّبِينٍ ) .وهذه الجملة الكريمة فى موضع الحال من قوله : ( هُوَ الذي بَعَثَ فِي الأميين . . ) و \" إن \" فى قوله ( وَإِن كَانُواْ . . ) مخففة من الثقيلة ، واسمها ضمير الشأن محذوف .أى : هو - سبحانه - بفضله وكرمه ، الذى بعث فى الأميين رسولا منهم ، وحالهم أنهم كانوا قبل إرسال هذا الرسول الكريم فيهم ، فى ضلال واضح لا يخفى أمره على عاقل ، ولا يلتبس قبحه على ذى ذوق سليم وحقا لقد كان الناس قبل أن يبزغ نور الإسلام ، الذى جاء به النبى - صلى الله عليه وسلم - من عند ربه ، فى ضلال واضح ، وظلام دامس ، من حيث العقائد والعبادات ، والأخلاق والمعاملات .فكان من رحمة الله - تعالى - بهم ، أن أرسل فيهم رسوله محمدا - صلى الله عليه وسلم - لكى يخرجهم من ظلمات الكفر والفسوق والعصيان ، إلى نور الهداية والاستقامة والإيمان .\n","ar.baghawi":"(  هو الذي بعث في الأميين ) يعني العرب كانت أمة أمية لا تكتب ولا تقرأ ( رسولا منهم ) يعني محمدا - صلى الله عليه وسلم - نسبه نسبهم [ ولسانه لسانهم ليكون أبلغ في إقامة الحجة عليهم ] ( يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين ) أي ما كانوا قبل بعثة الرسول إلا في ضلال مبين يعبدون الأوثان .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5179.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5179.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5179.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","transliteration":"Wa aakhareena minhum lammaa yalhaqoo bihim wa huwal 'azeezul hakeem","translations":{"en.ahmedali":"And for others among them who have not joined them yet. He is all-mighty and all-wise.","en.ahmedraza":"And he (the Holy Prophet) bestows knowledge to others along with them, who have not yet joined them; and He only is the Most Honourable, the Wise.","en.arberry":"and others of them who have not yet joined them. And He is the All-mighty, the All-wise.","en.asad":"and [to cause this message to spread] from them unto other people as soon as they come into contact with them: for He alone is almighty, truly wise!","en.daryabadi":"And also others of them who have not yet joined them. And He is the Mighty; the Wise.","en.hilali":"And He has sent him (Prophet Muhammad SAW) also to others among them (Muslims) who have not yet joined them (but they will come). And He (Allah) is the All-Mighty, the All-Wise.","en.pickthall":"Along with others of them who have not yet joined them. He is the Mighty, the Wise.","en.qaribullah":"together with others who have not as yet joined them. He is the Almighty, the Wise.","en.sahih":"And [to] others of them who have not yet joined them. And He is the Exalted in Might, the Wise.","en.sarwar":"and others who have not yet joined, and He will give them wisdom. Before this they had been in plain error. God is Majestic and All-wise.","en.yusufali":"As well as (to confer all these benefits upon) others of them, who have not already joined them: And He is exalted in Might, Wise.","en.maududi":"and (He has also) sent him to those others who have not yet joined them. He is the Most Mighty, the Most Wise.","en.shakir":"And others from among them who have not yet joined them; and He is the Mighty, the Wise.","en.itani":"And others from them, who have not yet joined them. He is the Glorious, the Wise.","en.mubarakpuri":"And others among them who have not yet joined them. And He is the Almighty, the All-Wise.","en.qarai":"And to others from among them [as well] who have not yet joined them. And He is the All-mighty, the All-wise.","en.wahiduddin":"and to others also, from among them, who have not yet joined them. He is the Mighty, the Wise One."},"tafsir":{"ar.muyassar":"الله سبحانه هو الذي أرسل في العرب الذين لا يقرؤون، ولا كتاب عندهم ولا أثر رسالة لديهم، رسولا منهم إلى الناس جميعًا، يقرأ عليهم القرآن، ويطهرهم من العقائد الفاسدة والأخلاق السيئة، ويعلِّمهم القرآن والسنة، إنهم كانوا من قبل بعثته لفي انحراف واضح عن الحق. وأرسله سبحانه إلى قوم آخرين لم يجيئوا بعدُ، وسيجيئون من العرب ومن غيرهم. والله تعالى- وحده- هو العزيز الغالب على كل شيء، الحكيم في أقواله وأفعاله.","ar.jalalayn":"«وآخرون» عطف على الأميين، أي الموجودين «منهم» والآتين منهم بعدهم «لما» لم «يلحقوا بهم» في السابقة والفضل «وهو العزيز الحكيم» في ملكه وصنعه وهم التابعون والإقتصار عليهم كاف في بيان فضل الصحابة المبعوث فيهم النبي صلى الله عليه وسلم على من عداهم ممن بعث إليهم وآمنوا به من جميع الإنس والجن إلى يوم القيامة لأن كل قرن خير ممن يليه.","ar.qurtubi":"قوله تعالى : وآخرين منهم لما يلحقوا بهم وهو العزيز الحكيمقوله تعالى : \" وآخرين منهم \" هو عطف على الأميين ؛ أي بعث في الأميين وبعث في آخرين منهم . ويجوز أن يكون منصوبا بالعطف على الهاء والميم في يعلمهم ويزكيهم ; أي يعلمهم ويعلم آخرين من المؤمنين ; لأن التعليم إذا تناسق إلى آخر الزمان كان كله مسندا إلى أوله فكأنه هو الذي تولى كل ما وجد منه .\" لما يلحقوا بهم \" أي لم يكونوا في زمانهم وسيجيئون بعدهم . قال ابن عمر وسعيد بن جبير : هم العجم . وفي صحيح البخاري ومسلم عن أبي هريرة قال : كنا جلوسا عند النبي صلى الله عليه وسلم إذ نزلت عليه سورة \" الجمعة \" فلما قرأ : وآخرين منهم لما يلحقوا بهم قال رجل : من هؤلاء يا رسول الله ؟ فلم يراجعه [ ص: 84 ] النبي صلى الله عليه وسلم حتى سأله مرة أو مرتين أو ثلاثا . قال : وفينا سلمان الفارسي . قال : فوضع النبي صلى الله عليه وسلم يده على سلمان ثم قال : \" لو كان الإيمان عند الثريا لناله رجال من هؤلاء \" . في رواية : \" لو كان الدين عند الثريا لذهب به رجل من فارس - أو قال - من أبناء فارس حتى يتناوله \" لفظ مسلم . وقال عكرمة : هم التابعون . مجاهد : هم الناس كلهم ; يعني من بعد العرب الذين بعث فيهم محمد صلى الله عليه وسلم . وقاله ابن زيد ومقاتل بن حيان . قالا : هم من دخل في الإسلام بعد النبي صلى الله عليه وسلم إلى يوم القيامة . وروى سهل بن سعد الساعدي : أن النبي صلى الله عليه وسلم قال : \" إن في أصلاب أمتي رجالا ونساء يدخلون الجنة بغير حساب \" ثم تلا : وآخرين منهم لما يلحقوا بهم . والقول الأول أثبت . وقد روي أن النبي صلى الله عليه وسلم قال : \" رأيتني أسقي غنما سودا ثم أتبعتها غنما عفرا ، أولها يا أبا بكر \" . فقال : يا رسول الله ، أما السود فالعرب ، وأما العفر فالعجم تتبعك بعد العرب . فقال النبي صلى الله عليه وسلم : \" كذا أولها الملك \" يعني جبريل عليه السلام . رواه ابن أبي ليلى عن رجل من أصحاب النبي صلى الله عليه وسلم ، وهو علي بن أبي طالب رضي الله عنه .\n","ar.miqbas":"وَآَخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ وَهُوَ الْعَزِيزُ الْحَكِيمُ (3)لا يجوز أن يكون { وآخرين } عطفاً على { الأميين } [ الجمعة : 2 ] لأن آخرين يقتضي المغايرة لما يقابله فيقتضي أنه صادق على غير الأميين ، أي غير العرب والرسول صلى الله عليه وسلم لم يكن بين غير العرب فتعين أن لا يعطف { وآخرين } على { الأميين } لئلا يتعلق بفعل { بعث مجرور القي ولا على الضمير في قوله : منهم } كذلك .فهو إما معطوف على الضمير في { عليهم } من قوله : { يتلوا عليهم } [ الجمعة : 2 ] والتقدير : ويتلو على آخرين وإذا كان يتلو عليهم فقد علم أنه مرسل إليهم لأن تلاوة الرسول صلى الله عليه وسلم لا تكون إلا تلاوة تبليغ لما أُوحي به إليه .وإما أن يجعل { وآخرين } مفعولاً معه . والواو للمعية ويتنازعه الأفعال الثلاثة وهي «يتلو ، ويزكي ، ويعلم» . والتقدير : يتلو على الأميين آياتنا ويزكيهم ويعلمهم الكتاب والحكمة مع آخرين .وجملة { وإن كانوا من قبل لفي ضلال مبين } [ الجمعة : 2 ] معترضة بين المعطوف والمعطوف عليها أو بين الضمائر والمفعول معه و { آخرين } : جمع آخر وهو المغاير في وصف مما دل عليه السياق . وإذ قد جعل { آخرين } هنا مقابلاً للأميين كان مراداً به آخرون غير الأميين ، أي من غير العرب المعنيين بالأميين .فلو حملنا المغايرة على المغايرة بالزمان أو المكان ، أي مغايرين للذين بعث فيهم الرسول ، وجعلنا قوله : { منهم } بمعنى أنهم من الأميين ، وقلنا : أريد وآخرين من العرب غير الذين كان النبي صلى الله عليه وسلم فيهم ، أي عَرباً آخرين غير أهل مكة ، وهم بقية قبائل العرب ناكده ما روى البخاري ومسلم والترمذي يزيد آخِرهم على الأوَّلَيْن عن أبي هريرة قال : كنّا جلوساً عند النبي صلى الله عليه وسلم فأنزلت عليه سورة الجمعة فتلاها فلما بلغ { وآخرين منهم لما يلحقوا بهم } قال له رجل : مَن هم يا رسول الله؟ فلم يراجعه حتى سأَل ثلاثاً ، وفينا سلمان الفارسي ووضع رسول الله يده على سلمان وقال : لو كان الإِيمانُ عند الثريا لناله رجال من هؤلاء؟ وهذا وارد مورد التفسير لقوله تعالى : { وآخرين } .والذي يلوح أنه تفسير بالجزئي على وجه المثال ليفيد أن { آخرين } صادق على أمم كثيرة منها أمةُ فارس ، وأما شموله لقبائل العرب فهو بالأوْلى لأنهم مما شملهم لفظ الأميين .ثم بِنَا أن ننظر إلى تأويل قوله تعالى : { منهم } . فلنا أن نجعل ( مِن ) تبعيضية كما هو المتبادر من معانيها فنجعلَ الضمير المجرور ب ( مِن ) عائداً إلى ما عاد إليه ضمير { كانوا } من قوله : { وإن كانوا من قبل لفي ضلال مبين } [ الجمعة : 2 ] ، فالمعنى : وآخرين من الضَّالين يتلو عليهم آيات الله ويزكيهم الكتاب والحكمة ولنا أن نجعل ( مِن ) اتصالية كالتي في قوله تعالى : { لست منهم في شيء } [ الأنعام : 159 ] .والمعنى : وآخرين يتصلون بهم ويصيرون في جملتهم ، ويكون قوله : { منهم } موضع الحال ، وهذا الوجه يناسب قوله تعالى : { لما يلحقوا بهم } لأن اللحوق هو معنى الاتصال .وموضع جملة { لما يلحقوا بهم } موضع الحال ، وينشأ عن هذا المعنى إيماء إلى أن الأمم التي تدخل في الإِسلام بعد المسلمين الأولِينَ يصيرون مثلهم ، وينشأ منه أيضاً رمز إلى أنهم يتعربون لفهم الدين والنطق بالقرآن فكم من معان جليلة حوتها هذه الآية سكت عنها أهل التفسير .وهذه بشارة غيبية بأن دعوة النبي صلى الله عليه وسلم ستبلغ أُمماً ليسوا من العرب وهم فارس ، والأرمن ، والأكراد ، والبربر ، والسودان ، والروم ، والترك ، والتتار ، والمغول ، والصين ، والهنود ، وغيرهم وهذا من معجزات القرآن من صنف الإِخبار بالمغيبات .وفي الآية دلالة على عموم رسالة النبي صلى الله عليه وسلم لجميع الأمم .والنفي ب ( لمَّا ) يقتضي أن المنفي بها مستمر الانتفاء إلى زمن التكلم فيشعر بأنه مترقَّب الثبوت كقوله تعالى : { ولما يدخل الإيمان في قلوبكم } [ الحجرات : 14 ] ، أي وسيدخل كما في «الكشاف» ، والمعنى : أن آخرين هم في وقت نزول هذه الآية لم يدخلوا في الإِسلام ولم يلتحقوا بمن أسلم من العرب وسيدخلون في أزمان أخرى .واعلم أن قول النبي صلى الله عليه وسلم «لو كان الإِيمان بالثريا لناله رجال من هؤلاء» إيماء إلى مثال مما يشمله قوله تعالى : { وآخرين منهم } لأنه لم يصرح في جواب سؤال السائل بلفظ يقتضي انحصار المراد ب { آخرين } في قوم سلمان . وعن عكرمة : هم التابعون . وعن مجاهد : هم الناس كلهم الذين بُعث إليهم محمد صلى الله عليه وسلم وقال ابن عمر : هم أهل اليمن .وقوله : { وهو العزيز الحكيم } تذييل للتعجيب من هذا التقدير الإلهي لانتشار هذا الدين في جميع الأمم . فإن { العزيز } لا يغلب قدرته شيء . و { الحكيم } تأتي أفعاله عن قدر محكم .\n","ar.waseet":"ثم بين - سبحانه - أن رسالة رسوله محمد - صلى الله عليه وسلم - لن يكون نفعها مقصورا على المعاصرين له والذين شاهدوه . . . بل سيعم نفعها من سيجيئون من بعدهم ، فقال - تعالى - : ( وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُواْ بِهِمْ وَهُوَ العزيز الحكيم . . ) .وقوله : ( وَآخَرِينَ ) جمع آخر بمعنى الغير ، والجملة معطوفة على قوله قبل ذلك ( فِي الأميين . . ) فيكون المعنى :هو - سبحانه - الذى بعث فى الأميين رسولا منهم ، كما بعثه فى آخرين منهم .( لَمَّا يَلْحَقُواْ بِهِمْ ) أى : لم يجيئوا بعد ، وهم كل من يأتى بعد الصحابة من أهل الإسلام إلى يوم القيامة ، بدليل قوله - تعالى - : ( وَأُوحِيَ إِلَيَّ هذا القرآن لأُنذِرَكُمْ بِهِ وَمَن بَلَغَ . . . ) أى : وأوحى إلى هذا القرآن لأنذركم به يا أهل مكة ، ولأنذر به جميع من بلغه هذا الكتاب ، ووصلت إليه دعوته من العرب وغيرهم إلى يوم القيامة . . .وفى الحديث الشريف : \" بلغوا عن الله - تعالى - فمن بلغته آية من كتاب الله ، فقد بلغه أمر الله \" .وعن محمد بن كعب قال : من بلغه القرآن فكأنما رأى النبى - صلى الله عليه وسلم - .ويصح أن يكون قوله : ( وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُواْ بِهِمْ . . ) معطوف على الضمير المنصوب فى قوله : ( وَيُعَلِّمُهُمُ . . ) فيكون المعنى :هو الذى بعث فى الأميين رسولا منهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة ، ويعلم آخرين منهم ( لَمَّا يَلْحَقُواْ بِهِمْ ) أى : لم يجيئوا بعد وسيجيئون . . . وهم كل من آمن بالرسول من بعد الصحابة إلى يوم القيامة .قال صاحب الكشاف : وقوله : ( وَآخَرِينَ ) مجرور عطف على الأميين يعنى : أنه بعثه فى الأميين الذين على عهده ، وفى آخرين من الأميين الذين لم يلحقوا بهم بعد ، وسيلحقون بهم ، وهم الذين بعد الصحابة . .وقيل : لما نزلت قيل : \" من هم يا رسول الله ، فوضع يده على سلمان ثم قال : \" لو كان الإيمان عند الثريا لتناوله رجال من هؤلاء \" \" .وقيل : هم الذين يأتون من بعدهم إلى يوم القيامة .ويجوز أن ينتصب عطفا عل المنصوب فى ( وَيُعَلِّمُهُمُ ) أى يعلمهم ويعلم آخرين ، لأن التعليم إذا تناسق إلى آخر الزمان كان كله مستندا إلى أوله ، فكأنه هو الذى تولى كل ما وجد منه .. .والمتأمل فى هذه الآية الكريمة يراها تشير ‘لى أن دعوة النبى - صلى الله عليه وسلم - ستبلغ غير المعاصرين له - صلى الله عليه وسلم - وأنهم سيتبعونها ، ويؤمنون بها ، ويدافعون عنها . .وهذا ما أيده الواقع ، فقد دخل الناس فى دين الله أفواجا من العرب ومن غير العرب ، ومن أهل المشارق والمغارب .فالآية الكريمة تخبر عن معجزة من معجزات القرآن الكريم ، ألا وهى الإخبار عن أمور مستقبلة أيدها الواقع المشاهد .وقوله - تعالى - : ( وَهُوَ العزيز الحكيم ) تذييل المقصود به بيان أن قدرته - تعالى - لا يعجزها شىء ، وأن حكمته هى أسمى الحكم وأسدها .أى : وهو - سبحانه - العزيز الذى لا يغلب قدرته شىء ، الحكيم فيما يريده ويقدره ويوجده .\n","ar.baghawi":"( وآخرين منهم ) وفي \" آخرين \" وجهان من الإعراب : أحدهما الخفض ، على الرد إلى الأميين مجازه : وفي آخرين . والثاني النصب ، على الرد إلى الهاء والميم في قوله \" ويعلمهم \" أي : ويعلم آخرين منهم ، أي من المؤمنين الذين يدينون بدينهم ، لأنهم إذا أسلموا صاروا منهم ، فإن المسلمين كلهم أمة واحدة .واختلف العلماء فيهم ، فقال قوم : هم العجم ، وهو قول ابن عمر وسعيد بن جبير ورواية ليث عن مجاهد ، والدليل عليه ما : أخبرنا أبو جعفر محمد بن عبد الله بن محمد المعلم الطوسي بها حدثنا أبو الحسن محمد بن يعقوب ، أخبرنا أبو النصر محمد بن محمد بن يوسف ، حدثنا الحسين بن سفيان ، وعلي بن طيفور ، وأبو العباس الثقفي قالوا : حدثنا قتيبة ، حدثنا عبد العزيز ، عن ثور ، عن أبي الغيث ، عن أبي هريرة قال : كنا جلوسا عند النبي - صلى الله عليه وسلم - إذ نزلت سورة الجمعة ، فلما قرأ : \" وآخرين منهم لما يلحقوا بهم \" قال رجل : من هؤلاء يا رسول الله ؟ فلم يراجعه النبي - صلى الله عليه وسلم - حتى سأله مرتين أو ثلاثا قال : وفينا سلمان الفارسي قال : فوضع النبي - صلى الله عليه وسلم - يده على سلمان ، ثم قال : \" لو كان الإيمان عند الثريا لناله رجال من هؤلاء \"أخبرنا أبو سعيد عبد الله بن أحمد الطاهري ، أخبرنا جدي عبد الصمد بن عبد الرحمن البزار ، أخبرنا محمد بن زكريا العذافري ، أخبرنا إسحاق الدبري ، حدثنا عبد الرزاق ، أخبرنا معمر ، عن جعفر الجزري عن يزيد بن الأصم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" لو كان الدين عند الثريا لذهب إليه رجل ، أو قال : رجال ، من أبناء فارس حتى يتناولوه \" وقال عكرمة ومقاتل : هم التابعون . وقال ابن زيد : هم جميع من دخل في الإسلام بعد النبي - صلى الله عليه وسلم - . إلى يوم القيامة وهي رواية [ ابن ] أبي نجيح عن مجاهد . قوله ( لما يلحقوا بهم ) أي [ لم ] يدركوهم ولكنهم يكونون بعدهم . وقيل : \" لما يلحقوا بهم \" أي في الفضل والسابقة لأن التابعين لا يدركون شأو الصحابة . ( وهو العزيز الحكيم ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5180.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5180.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5180.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ","transliteration":"Zaalika fadlul laahi yu'teehi many-yashaaa; wallaahu zul fadil 'azeem","translations":{"en.ahmedali":"This is the bounty of God, He gives whosoever He please. God is master of great bounty.","en.ahmedraza":"This is Allah’s munificence, which He may give to whomever He wills; and Allah is Extremely Munificent.","en.arberry":"That is the bounty of God; He gives it to whom He will, and God is of bounty abounding.","en.asad":"Such is God's bounty: He grants it to anyone who is willing [to receive it]: for God is limitless in His great bounty.","en.daryabadi":"That is the grace of Allah: He vouchsafeth it on whomsoever He will. And Allah is the Owner of mighty Grace.","en.hilali":"That is the Grace of Allah, which He bestows on whom He wills. And Allah is the Owner of Mighty Grace.","en.pickthall":"That is the bounty of Allah; which He giveth unto whom He will. Allah is of Infinite Bounty.","en.qaribullah":"Such is the Favor of Allah; He gives it to whom He will, and Allah is of abounding favors.","en.sahih":"That is the bounty of Allah, which He gives to whom He wills, and Allah is the possessor of great bounty.","en.sarwar":"Such is the favor of God which He grants to whomever He wants. God's favor is great.","en.yusufali":"Such is the Bounty of Allah, which He bestows on whom He will: and Allah is the Lord of the highest bounty.","en.maududi":"Such is Allah's favour: He bestows it on whomsoever He pleases. Allah is the Lord of abounding favour.","en.shakir":"That is Allah's grace; He grants it to whom He pleases, and Allah is the Lord of mighty grace.","en.itani":"That is God’s grace, which He grants to whomever He wills. God is Possessor of limitless grace.","en.mubarakpuri":"That is the grace of Allah, which He bestows on whom He wills. And Allah is the Owner of mighty grace.","en.qarai":"That is Allah’s grace, which He grants to whomever He wishes, and Allah is dispenser of a great grace.","en.wahiduddin":"That is God's grace; He bestows it on whom He pleases; for God is limitless in His grace."},"tafsir":{"ar.muyassar":"ذلك البعث للرسول صلى الله عليه وسلم، في أمة العرب وغيرهم، فضل من الله، يعطيه مَن يشاء من عباده. وهو - وحده- ذو الإحسان والعطاء الجزيل.","ar.jalalayn":"«ذلك فضل الله يؤتيه من يشاء» النبي ومن ذكر معه «والله ذو الفضل العظيم».","ar.qurtubi":"قوله تعالى : ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيمقال ابن عباس : حيث ألحق العجم بقريش ؛ يعني الإسلام : فضل الله يؤتيه من يشاء ; قاله الكلبي . وقيل : يعني الوحي والنبوة ; قاله مقاتل . وقول رابع : إنه المال ينفق في الطاعة ; وهو معنى قول أبي صالح . وقد روى مسلم عن أبي صالح عن أبي هريرة أن فقراء المهاجرين أتوا رسول الله صلى الله عليه وسلم ، فقالوا : ذهب أهل الدثور بالدرجات العلا والنعيم المقيم . فقال : \" وما ذاك ؟ \" قالوا : يصلون كما نصلي ، ويصومون كما نصوم ، ويتصدقون ولا نتصدق ، ويعتقون ولا نعتق . فقال رسول الله صلى الله عليه وسلم : \" أفلا أعلمكم شيئا تدركون به من سبقكم وتسبقون به من بعدكم ، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم ؟ \" قالوا : بلى يا رسول الله . قال : \" تسبحون وتكبرون وتحمدون دبر كل صلاة ثلاثا وثلاثين مرة \" . قال أبو صالح : فرجع [ ص: 85 ] فقراء المهاجرين إلى رسول الله صلى الله عليه وسلم فقالوا : سمع إخواننا أهل الأموال بما فعلنا ففعلوا مثله . فقال رسول الله صلى الله عليه وسلم : ذلك فضل الله يؤتيه من يشاء . وقول خامس : أنه انقياد الناس إلى تصديق النبي صلى الله عليه وسلم ، ودخولهم في دينه ونصرته . والله أعلم .\n","ar.miqbas":"ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (4)الإِشارة إلى جميع المذكورِ من إرسال محمد صلى الله عليه وسلم بالآيات والتزكية وتعليم الكتاب والحكمة والإِنقاذ من الضلال ومن إفاضة هذه الكمالات على الأميين الذين لم تكن لهم سابقة علم ولا كتاب ، ومن لحاق أمم آخرين في هذا الخبر فزال اختصاص اليهود بالكتاب والشريعة ، وهذا أجدع لأنفهم إذ حالوا أن يجيء رسول أمي بشريعة إلى أمة أمية فضلاً عن أن نلتحق بأمية أمم عظيمة كانوا أمكن في المعارف والسلطان .وقال : { قل إن الهدى هدى الله أن يؤتى أحد مثلما أوتيتم أو يحاجوكم عند ربكم قل إن الفضل بيد الله يؤتيه من يشاء والله واسع عليم } [ آل عمران : 13 ] يختص به . وهذا تمهيد ومقدمة لقوله تعالى : { مثل الذين حملوا التوراة } [ الجمعة : 5 ] الآيات .\n","ar.waseet":"واسم الإشارة فى قوله : ( ذَلِكَ فَضْلُ الله يُؤْتِيهِ مَن يَشَآءُ . . . ) يعود إلى ما تقدم ذكره من كرمه - تعالى - على عباده ، حيث اختص رسوله محمدا - صلى الله عليه وسلم - بهذه الرسالة الجامعة لكل خير وبركة ، وحيث موفق من وفق من الأميين وغيرهم ، إلى اتباع هذا الرسول الكريم . .أى : ذلك البعث منا لرسولنا محمد - صلى الله عليه وسلم - لكى يهدى الناس بإذننا إلى الصراط المستقيم ، هو فضلنا الذى نؤتيه ونخصه لمن نشاء اختصاصه به من عبادنا .( والله ) - تعالى - : هو ( ذُو الفضل العظيم ) الذى لا يقاربه فضل ، ولا يدانيه كرم .كما قال - سبحانه - : ( قُلْ إِنَّ الفضل بِيَدِ الله يُؤْتِيهِ مَن يَشَآءُ والله وَاسِعٌ عَلِيمٌ يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَآءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ ).\n","ar.baghawi":"\"ذلك فضل الله يؤتيه من يشاء\"، يعني الإسلام والهداية. \"والله ذو الفضل العظيم\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5181.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5181.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5181.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا ۚ بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","transliteration":"Masalul lazeena hum milut tawraata summa lam yahmiloonhaa kamasalil himaari yah milu asfaaraa; bi'sa masalul qawmil lazeena kaazzaboo bi aayaatil laah; wallaahu laa yahdil qawmazzaalimeen","translations":{"en.ahmedali":"The likeness of those who were charged with (the law of) the Torah which they did not observe, is that of a donkey who carries a load of books (oblivious of what they contain). How wretched the semblance of the people who deny the words of God! God does not show an unjust people the way.","en.ahmedraza":"The example of those who were entrusted with the Taurat, and did not carry out its commands, is like the donkey carrying books; what a wretched example is of the people who denied the signs of Allah; and Allah does not guide the unjust.","en.arberry":"The likeness of those who have been loaded with the Torah then they have not carried it, is as the likeness of an ass carrying books. Evil is the likeness of the people who have cried lies to God's signs. God guides never the people of the evildoers.","en.asad":"THE PARABLE of those who were graced with the burden of the Torah, and thereafter failed to bear this burden, is that of an ass that carries a load of books [but cannot benefit from them]. Calamitous is the parable of people who are bent on giving the lie to God's messages - for God does not bestow His guidance upon such evildoing folk!","en.daryabadi":"The likeness of those who were laden with the Taurat and then they bare it not, is as the likeness of the ass bearing tomes. Hapless is the likeness of the people who belie the signs of Allah. And Allah guideth not a wrong doing people. J","en.hilali":"The likeness of those who were entrusted with the (obligation of the) Taurat (Torah) (i.e. to obey its commandments and to practise its legal laws), but who subsequently failed in those (obligations), is as the likeness of a donkey who carries huge burdens of books (but understands nothing from them). How bad is the example (or the likeness) of people who deny the Ayat (proofs, evidences, verses, signs, revelations, etc.) of Allah. And Allah guides not the people who are Zalimun (polytheists, wrong-doers, disbelievers, etc.).","en.pickthall":"The likeness of those who are entrusted with the Law of Moses, yet apply it not, is as the likeness of the ass carrying books. Wretched is the likeness of folk who deny the revelations of Allah. And Allah guideth not wrongdoing folk.","en.qaribullah":"The likeness of those who were loaded with the Torah, but did not carry it, is like that of a donkey carrying books. Evil is the example of the people who have belied the verses of Allah. Allah does not guide the evildoers.","en.sahih":"The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah. And Allah does not guide the wrongdoing people.","en.sarwar":"Those who were to carry the responsibility of the Torah but ignored, are like donkeys laden with books. How terrible is the example of the people who reject the revelations of God. God does not guide the unjust.","en.yusufali":"The similitude of those who were charged with the (obligations of the) Mosaic Law, but who subsequently failed in those (obligations), is that of a donkey which carries huge tomes (but understands them not). Evil is the similitude of people who falsify the Signs of Allah: and Allah guides not people who do wrong.","en.maududi":"The parable of those who were charged with the Torah and then they failed to live up to it is that of a donkey laden with books. Even more evil is the parable of the people who gave the lie to the Signs of Allah. Allah does not direct such wrong-doers to the Right Way.","en.shakir":"The likeness of those who were charged with the Taurat, then they did not observe it, is as the likeness of the ass bearing books, evil is the likeness of the people who reject the communications of Allah; and Allah does not guide the unjust people.","en.itani":"The example of those who were entrusted with the Torah, but then failed to uphold it, is like the donkey carrying works of literature. Miserable is the example of the people who denounce God’s revelations. God does not guide the wrongdoing people.","en.mubarakpuri":"The likeness of those who were entrusted with the Tawrah, but did not carry it, is as the likeness of a donkey which carries huge burdens of books. How bad is the example of people who deny the Ayat of Allah. And Allah does not guide the people who are wrongdoers.","en.qarai":"The example of those who were charged with the Torah, then failed to carry it, is that of an ass carrying books. Evil is the example of the people who deny Allah’s signs, and Allah does not guide the wrongdoing lot.","en.wahiduddin":"Those who were charged with bearing the Torah, but did not do so are like an ass carrying a load of books. How unfortunate are those who belie the sign of God. God does not guide the wrongdoers."},"tafsir":{"ar.muyassar":"شَبَهُ اليهود الذين كُلِّفوا العمل بالتوراة ثم لم يعملوا بها، كشَبه الحمار الذي يحمل كتبًا لا يدري ما فيها، قَبُحَ مَثَلُ القوم الذين كذَّبوا بآيات الله، ولم ينتفعوا بها، والله لا يوفِّق القوم الظالمين الذين يتجاوزون حدوده، ويخرجون عن طاعته.","ar.jalalayn":"«مثل الذين حملوا التوراة» كلفوا العمل بها «ثم لم يحملوها» لم يعملوا بما فيها من نعته صلى الله عليه وسلم فلم يؤمنوا به «كمثل الحمار يحمل أسفارا» أي كتبا في عدم انتفاعه بها «بئس مثل القوم الذين كذبوا بآيات الله» المصدقة للنبي صلى الله عليه وسلم والمخصوص بالذم محذوف تقديره هذا المثل «والله لا يهدي القوم الظالمين» الكافرين.","ar.qurtubi":"قوله تعالى : مثل الذين حملوا التوراة ثم لم يحملوها كمثل الحمار يحمل أسفارا بئس مثل القوم الذين كذبوا بآيات الله والله لا يهدي القوم الظالمينضرب مثلا لليهود لما تركوا العمل بالتوراة ولم يؤمنوا بمحمد صلى الله عليه وسلم . حملوا التوراة أي كلفوا العمل بها ; عن ابن عباس . وقال الجرجاني : هو من الحمالة بمعنى الكفالة ; أي ضمنوا أحكام التوراة .كمثل الحمار يحمل أسفارا هي جمع سفر ، وهو الكتاب الكبير ; لأنه يسفر عن المعنى إذا قرئ . قال ميمون بن مهران : الحمار لا يدري أسفر على ظهره أم زنبيل ; فهكذا اليهود . وفي هذا تنبيه من الله تعالى لمن حمل الكتاب أن يتعلم معانيه ويعلم ما فيه ; لئلا يلحقه من الذم ما لحق هؤلاء . وقال الشاعر مروان بن سليمان بن يحيى بن أبي حفصة :زوامل للأسفار لا علم عندهم بجيدها إلا كعلم الأباعر     لعمرك ما يدري البعير إذا غدابأوساقه أو راح ما في الغرائروقال يحيى بن يمان : يكتب أحدهم الحديث ولا يتفهم ولا يتدبر ، فإذا سئل أحدهم عن مسألة جلس كأنه مكاتب . وقال الشاعر :إن الرواة على جهل بما حملوا     مثل الجمال عليها يحمل الودعلا الودع ينفعه حمل الجمال له     ولا الجمال بحمل الودع تنتفعوقال منذر بن سعيد البلوطي رحمه الله فأحسن :انعق بما شئت تجد أنصارا     وزم أسفارا تجد حمارا[ ص: 86 ] يحمل ما وضعت من أسفار     يحمله كمثل الحماريحمل أسفارا له وما درى     إن كان ما فيها صوابا وخطاإن سئلوا قالوا كذا روينا     ما إن كذبنا ولا اعتديناكبيرهم يصغر عند الحفل     لأنه قلد أهل الجهل\" ثم لم يحملوها \" ؛ أي لم يعملوا بها . شبههم - والتوراة في أيديهم وهم لا يعملون بها - بالحمار يحمل كتبا وليس له إلا ثقل الحمل من غير فائدة . و \" يحمل \" في موضع نصب على الحال ; أي حاملا . ويجوز أن يكون في موضع جر على الوصف ; لأن الحمار كاللئيم . قال :ولقد أمر على اللئيم يسبني     فمضيت ثمة قلت لا يعنينيبئس مثل القوم : المثل الذي ضربناه لهم ; فحذف المضاف .والله لا يهدي القوم الظالمين أي من سبق في علمه أنه يكون كافرا .\n","ar.miqbas":"مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآَيَاتِ اللَّهِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ (5)بعد أن تبين أنه تعالى آتى فضله قوماً أميين أعقبه بأنه قد آتى فضله أهل الكتاب فلم ينتفع به هؤلاء الذين قد اقتنعوا من العلم بأن يحملوا التوراة دون فهم وهم يحسبون أن ادخار أسفار التوراة وانتقالها من بيت إلى بيت كاففٍ في التبجح بها وتحقير من لم تكن التوراة بأيديهم ، فالمراد اليهود الذين قاوموا دعوة محمد صلى الله عليه وسلم وظاهروا المشركين .وقد ضرب الله لهؤلاء مثلاً بحال حمار يحمل أسفاراً لا حظّ له منها إلا الحَمل دون علم ولا فهم .ذلك أن علم اليهود بما في التوراة أدخلوا فيه ما صيره مخلوطَاً بأخطاء وضلالات ومتبعاً فيه هوى نفوسهم وما لا يعدو نفعهم الدنيوي ولم يتخلقوا بما تحتوي عليه من الهدى والدعاء إلى تزكية النفس وقد كتموا ما في كتبهم من العهد باتباع النبي الذي يأتي لتخليصهم من ربقة الضلال فهذا وجه ارتباط هذه الآية بالآيات التي قبلها ، وبذلك كانت هي كالتتمة لما قبلها . وقال في «الكشاف» عن بعضهم : افتخر اليهود بأنهم أهل كتاب . والعرب لا كتاب لهم . فأبطل الله ذلك بشَبَههم بالحمار يحمل أسفاراً .ومعنى { حملوا } : عُهد بها إليهم وكلفوا بما فيها فلم يفوا بما كلفوا ، يقال : حَمَّلت فلاناً أمر كذا فاحتمله ، قال تعالى : { إنا عرضنا الأمانة على السماوات والأرض والجبال فأبين أن يحملنها وأشفقن منها وحملها الإنسان إنه كان ظلوماً جهولاً } سورة [ الأحزاب : 72 ] .وإطلاق الحمل وما تصرف منه على هذا المعنى استعارة ، بتشبيه إيكال الأمر بحمل الحِمل على ظهر الدابة ، وبذلك كان تمثيل حالهم بحال الحمار يحمل أسفاراً تمثيلاً للمعنى المجازي بالمعنى الحقيقي . وهو من لطائف القرآن .وثم } للتراخي الرتبي فإن عدم وفائهم بما عُهد إليهم أعجب من تحملهم إياه . وجملة { يحمل أسفاراً } في موضع الحال من الحمار أو في موضع الصفة لأن تعريف الحمار هنا تعريف جنس فهو معرفة لفظاً نكرة معنى ، فصحّ في الجملة اعتبار الحاليَّة والوصف .وهذا التمثيل مقصود منه تشنيع حالهم وهو من تشبيه المعقول بالمحسوس المتعارف ، ولذلك ذيل بذم حالهم { بئس مثل القوم الذين كذبوا بآيات الله } .و { بئس } فعل ذم ، أي ساء حال الذين كذبوا بكتاب الله فهم قد ضموا إلى جهلهم بمعاني التوراة تكذيباً بآيات الله وهي القرآن .و { مثل القوم } ، فاعل { بئس } . وأغنى هذا الفاعل عن ذكر المخصوصصِ بالذم لحصول العلم بأن المذموم هو حَال القوم المكذبين فلم يسلك في هذا التركيب طريق الإِبهام على شرط التفسير لأنه قد سبقه ما بينه بالمثَل المذكور قبله في قوله : { كمثل الحمار يحمل أسفاراً } . فصار إعادة لفظ المثل ثقيلاً في الكلام أكثر من ثلاث مرات . وهذا من تفننات القرآن . و { الذين كذبوا } صفة { القوم } .وجملة { والله لا يهدي القوم الظالمين } تذييل إخباراً عنهم بأن سوء حالهم لا يرجى لهم منه انفكاك لأن الله حرمهم اللطف والعناية بإنقاذهم لظلمهم بالاعتداء على الرسول صلى الله عليه وسلم بالتكذيب دون نظر ، وعلى آيات الله بالجحد دون تدبر .قال في «الكشاف» : «وعن بعضهم قد أبطل الله قول اليهود في ثلاث» ، أي آيات من هذه السورة : افتخروا بأنهم أولياء الله وأحباؤه فكذبهم في قوله : { فتمنوا الموت إن كنتم صادقين } [ الجمعة : 6 ] . وبأنهم أهل الكتاب والعرب لا كتاب لهم ، فشبههم بالحمار يحمل أسفاراً ، وبالسبت وأنه ليس للمسلمين مثله فشرع الله لهم الجمعة .\n","ar.waseet":"ثم انتقلت السورة الكريمة - بعد هذا البيان - لفضل الله - تعالى - على نبيه - صلى الله عليه وسلم - ، وعلى من أرسله لهدايتهم ، إلى الحديث عن جانب من رذائل اليهود ، وأمرت النبى - صلى الله عليه وسلم - أن يتحداهم وأن يرد على أكاذيبهم . . . فقال - تعالى : ( مَثَلُ الذين . . . ) .المراد بالمثل فى قوله - تعالى - : ( مَثَلُ الذين حُمِّلُواْ التوراة . . ) الصفة والحال . .والمراد بالذين حملوا التوراة : اليهود الذين كلفهم الله - تعالى - بالعمل بما اشتملت عليه التوراة من هدايات وأحكام وآداب . . . ولكنهم نبذوها وتركوا العمل بها .والأسفار : جمع سفر ، وهو الكتاب الكبير المشتمل على ألوان من العلم النافع ، وسمى بذلك لأنه يسفر ويكشف عما فيه من المعانى المفيدة للمطلع عليها .والمعنى : حال هؤلاء اليهود الذين أنزل الله - تعالى - عليهم التوراة لهدايتهم . . . ولكنهم لم ينتفعوا بها . . . كحال الحمار الذى يحمل كتب العلم النافع ، ولكنه لم يستفد من ذلك شيئا ، لأنه لا يفقه شيئا مما يحمله . .ففى هذا المثل شبه الله - تعالى - اليهود الذين لم ينتفعوا بالتوارة التى فيها الهداية والنور ، بحال الحمار الذين يحمل كتب العلوم النافعة دون أن يستفيد بها .ووجه الشبه بين الاثنين : هو عدم الانتفاع بما من شأنه أن ينتفع به انتفاعا عظيما ، لسمو قيمته ، وجلال منزلته .قال صاحب الكشاف : شبه اليهود فى أنهم حملة التوراة وقراؤها وحفاظ ما فيها ، ثم إنهم غير عاملين بها ، ولا بمنتفعين بآياتها . . . بالحمار ، حمل أسفارا ، أى : كتبا كبارا من كتب العلم ، فهو يمشى بها ، ولا يدرى منها إلا ما يمر بجنبيه وظهره من الكد والتعب ، وكل من علم ولم يعمل بعلمه فهذا مثله ، وبئس المثل . .وقال الإمام ابن كثير : يقول - تعالى - ذا ما لليهود الذين أعطوا التوراة فلم يعملوا بها ، إن مثلهم فى ذلك كمثل الحمار يحمل أسفارا . . . فهو يحملها حملا حسيا ولا يدرى ما عليه ، وكذلك هؤلاء . لم يعملوا بمقتضى ما فى التوراة بل أولوه وحرفوه ، فهم أسوأ من الحمار ، لأن الحمار لا فهم له ، وهؤلاء لهم فهوم لم يستعملوها ، ولهذا قال - تعالى - : فى آية أخرى : ( أولئك كالأنعام بَلْ هُمْ أَضَلُّ أولئك هُمُ الغافلون ) وقال القرطبى : وفى هذا المثل تنبيه من الله - تعالى - لمن حمل الكتاب ، أن يتعلم معانيه ، ويعمل بما فيه ، لئلا يلحقه من الذم ما لحق هؤلاء اليهود ، قال الشاعر :زوامل للأسفار لا علم عندهم ... بجيِّدها ، إلا كعلم الأباعرلعمرك ما يدرى البعير إذا غدا ... بأوْساقِه ، أو راح ما فى الغرائروعبر - سبحانه - عن تكليفهم العمل بالتوراة وعن تركهم لذلك بقوله : ( حُمِّلُواْ التوراة ثُمَّ لَمْ يَحْمِلُوهَا ) للإشعار بأن هذا التكليف منه - تعالى - لهم ، كان عهدا مؤكدا عليهم ، حتى لكأنهم تحملوه كما يتحمل الإنسان شيئا قد وضع فوق ظهره أو كتفيه . ولكنهم نيذوا هذا العهد ، وألقوا بما فوق أكتافهم من أحمال ، وانقادوا لأهوائهم وشهواتهم انقياد الأعمى لقائده . .ولفظ \" ثم \" فى قوله ( ثُمَّ لَمْ يَحْمِلُوهَا ) للتراخى النسبى ، لأن عدم وفائهم بما عهد إليهم ، أشد عجبا من تحملهم لهذه العهود .وشبههم ، بالحمار الذى هو مثل فى البلادة والغباء ، لزيادة التشنيع عليهم ، والتقبيح لحالهم ، حيث زهدوا وأعرضوا عن الانتفاع بأثمن شىء نافع ، - وهو كتاب الله - كما هو شأن الحمار الذى لا يفرق فيما يحمله على ظهره بين الشىء النافع والشىء الضار .وجملة \" يحمل أسفارا \" فى موضع الحال من الحمار ، أو فى موضع جر على أنها صفة للحمار ، باعتبار أن المقصود به الجنس ، فهو معرفة لفظا ، نكرة معنى .قال صاحب الكشاف : فإن قلت : \" يحمل \" ما محلة؟ قلت : محله النصب على الحال ، أو الجر على الوصف ، لأن لفظ الحمار هنا ، كلفظ اللئيم فى قول الشاعر :ولقد أمر على اللئيم يسبنى ... ثم أضاف - سبحانه - إلى ذم هؤلاء اليهود ذما آخر فقال : ( بِئْسَ مَثَلُ القوم الذين كَذَّبُواْ بِآيَاتِ الله . . ) .و ( بِئْسَ ) فعل ذم ، وفاعله ما بعده وهو قوله : ( مَثَلُ القوم ) وقد أغنى هذا الفاعل عن ذكر المخصوص بالذم ، لحصول العلم بأن المذموم هو حال هؤلاء القوم الذين وصفهم - سبحانه - بأنهم قد كذبوا بآياته .أى : بئس المثل مثل هؤلاء القوم الذين كذبوا بآيات الله - تعالى - الدالة على وحدانيته وقدرته ، وعلى صدق أنبيائه فيما يبلغونه عنه - تعالى - .وقوله : ( والله لاَ يَهْدِي القوم الظالمين ) تذييل قصد به بيان الأسباب التى أدت إلى عدم توفيق الله - تعالى - لهم إلى الهداية .أى : والله - تعالى - قد اقتضت حكمته ، أن لا يهدى إلى طريق الخير ، من ظلم نفسه ، بأن آثر الغى على الرشد ، والعمى على الهدى ، والشقاوة على السعادة ، لسوء استعداه ، وإنطماس بصيرته .\n","ar.baghawi":"قوله - عز وجل - : ( مثل الذين حملوا التوراة ) أي كلفوا القيام بها والعمل بما فيها ( ثم لم يحملوها ) لم يعملوا بما فيها ولم يؤدوا حقها ( كمثل الحمار يحمل أسفارا ) أي كتبا من العلم ، واحدها سفر ، قال الفراء : هي الكتب العظام يعني كما أن الحمار يحملها ولا يدري ما فيها ولا ينتفع بها كذلك اليهود يقرؤن التوراة ولا ينتفعون بها لأنهم خالفوا ما فيها ( بئس مثل القوم الذين كذبوا بآيات الله والله لا يهدي القوم الظالمين ) الذين ظلموا أنفسهم بتكذيب الأنبياء عليهم السلام ، يعني من سبق في علمه أنه لا يؤمن لا يهديهم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5182.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5182.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5182.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِنْ زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِنْ دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِنْ كُنْتُمْ صَادِقِينَ","transliteration":"Qul yaaa ayyuhal lazeena haadoo in za'amtum annakum awliyaaa'u lilaahi min doonin naasi fatamannawul mawta in kuntum saadiqeen","translations":{"en.ahmedali":"Say: \"O you Jews, if you claim that you are the favourites of God apart from all men, then wish for death, if you speak the truth.","en.ahmedraza":"Say “O Jews! If you assume that you are Allah’s friends, others are not, then wish for death if you are truthful!”","en.arberry":"Say: 'You of Jewry, if you assert that you are the friends of God, apart from other men, then do you long for death, if you speak truly.'","en.asad":"Say: \"O you who follow the Jewish faith! If you claim that you [alone] are close to God, to the exclusion of all other people, then you should be longing for death - if what you say is true!\"","en.daryabadi":"Say thou: O ye e who are Judaised! if ye imagine at ye are the friends of Allah above mankind, then wish for death if ye be truthful.","en.hilali":"Say (O Muhammad SAW): \"O you Jews! If you pretend that you are friends of Allah, to the exclusion of (all) other mankind, then long for death if you are truthful.\"","en.pickthall":"Say (O Muhammad): O ye who are Jews! If ye claim that ye are favoured of Allah apart from (all) mankind, then long for death if ye are truthful.","en.qaribullah":"Say: 'O you who are Jews, if you claim that of all people, you alone are the guided by Allah, then long for death if you are truthful'","en.sahih":"Say, \"O you who are Jews, if you claim that you are allies of Allah, excluding the [other] people, then wish for death, if you should be truthful.\"","en.sarwar":"(Muhammad), ask the Jews, \"If you believe that you are the chosen people of God to the exclusion of all other people, wish for death if you are truthful\".","en.yusufali":"Say: \"O ye that stand on Judaism! If ye think that ye are friends to Allah, to the exclusion of (other) men, then express your desire for Death, if ye are truthful!\"","en.maududi":"Tell them: “O you who have become Judaised, if you arrogantly fancy that you are Allah's favourites to the exclusion of all people, then wish for death, if you are truthful in your claim.”","en.shakir":"Say: O you who are Jews, if you think that you are the favorites of Allah to the exclusion of other people, then invoke death If you are truthful.","en.itani":"Say, “O you who follow Judaism; if you claim to be the chosen of God, to the exclusion of the rest of mankind, then wish for death if you are sincere.”","en.mubarakpuri":"Say: \"O you Jews! If you pretend that you are friends of Allah, to the exclusion of (all) other people, then long for death if you are truthful.\"","en.qarai":"Say, ‘O Jews! If you claim that you are Allah’s favourites, to the exclusion of other people, then long for death, should you be truthful.’","en.wahiduddin":"Say, \"You who are Jews, if you claim that you are favoured by God out of all people, then long for death, if you are truthful.\""},"tafsir":{"ar.muyassar":"قل -أيها الرسول- للذين تمسكوا بالملة اليهودية المحرَّفة: إن ادَّعيتم- كذبًا- أنكم أحباء الله دون غيركم من الناس، فتمنَّوا الموت إن كنتم صادقين في ادِّعائكم حب الله لكم.","ar.jalalayn":"«قل يا أيها الذين هادوا إن زعمتم أنكم أولياء لله من دون الناس فتمنوا الموت إن كنتم صادقين» تعلق بتمنوا الشرطان على أن الأول قيد في الثاني، أي إن صدقتم في زعمكم أنكم أولياء لله، والولي يؤثر الآخرة ومبدؤها الموت فتمنوه.","ar.qurtubi":"قوله تعالى : قل ياأيها الذين هادوا إن زعمتم أنكم أولياء لله من دون الناس فتمنوا الموت إن كنتم صادقينلما ادعت اليهود الفضيلة وقالوا : نحن أبناء الله وأحباؤه قال الله تعالى : إن زعمتم أنكم أولياء لله من دون الناس فللأولياء عند الله الكرامة .فتمنوا الموت إن كنتم صادقين لتصيروا إلى ما يصير إليه أولياء الله .\n","ar.miqbas":"قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِنْ زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِنْ دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِنْ كُنْتُمْ صَادِقِينَ (6)أعقب تمثيل حال جهلهم بالتوراة بذكر زعم من آثار جهلهم بها إبطالاً لمفخرة مزعومة عندهم أنهم أولياء الله وبقية الناس ليسوا مثلهم . وذلك أصل كانوا يجعلونه حجة على أن شؤونهم أفضل من شؤون غيرهم . ومن ذلك أنهم كانوا يفتخرون بأن الله جعل لهم السبت أفضل أيام الأسبوع وأنه ليس للأميين مثله فلما جعل الله الجمعة للمسلمين اغتاظوا ، وفي «الكشاف» «افتخر اليهود بالسبت وأنه للمسلمين مثله فشرع الله لهم الجمعة» .وافتتح بفعل { قل } للاهتمام .و { الذين هادوا } : هم الذين كانوا يهوداً ، وتقدم وجه تسمية اليهود يهوداً عند قوله تعالى : { إن الذين آمنوا والذين هادوا } في سورة [ البقرة : 62 ] . ويجوز أن يكون هادوا } بمعنى تابوا لقول موسى عليه السّلام بعد أن أخذتهم الرجفة : { إنا هدنا إليك } كما تقدم في سورة [ الأعراف : 156 ] . وأشهر وصف بني إسرائيل في القرآن بأنهم هود جمع هائد مثل قعود جمع قاعد . وأصل هود هُوُود وقد تنوسي منه هذا المعنى وصار علماً بالغلبة على بني إسرائيل فنودوا به هنا بهذا الاعتبار لأن المقام ليس مقام ثناء عليهم أو هو تهكم .وجيء بإن } الشرطية التي الأصل فيها عدم الجزم بوقوع الشرط مع أن الشرط هنا محقق الوقوع إذ قد اشتهروا بهذا الزعم وحكاه القرآن عنهم في سورة [ العقود : 18 ] : { وقالت اليهود والنصارى نحن أبناء الله وأحباؤه } للإِشارة إلى أن زعمهم هذا لما كان باطلاً بالدلائل كان بمنزلة الشيء الذي يفرض وقوعه كما يفرض المستبعد وكأنه ليس واقعاً على طريقة قوله تعالى : { أفنضرب عنكم الذكر صفحاً إن كنتم قوماً مسرفين } [ الزخرف : 5 ] ويفيد ذلك توبيخاً بطريق الكناية .والمعنى : إن كنتم صادقين في زعمكم فتمنوا الموت . وهذا إلجاء لهم حتى يلزمهم ثبوت شكهم فيما زعموه .والأمر في قوله : { فتمنوا } مستعمل في التعجيز : كناية عن التكذيب مثل قوله تعالى : { قل فأتوا بالتوراة فاتلوها إن كنتم صادقين } [ آل عمران : 93 ] .ووجه الملازمة بين الشرط وجوابه أن الموْت رجوع الإِنسان بروحه إلى حياة أبدية تظهر فيها آثار رضى الله عن العبد أو غضبه ليجزيه على حسب فعله .والنتيجة الحاصلة من هذا الشرط تُحَصِّلُ أنهم مثل جميع الناس في الحياتين الدنيا والآخرة وآثارهما ، واختلاففِ أحواللِ أهلهما ، فيعلم من ذلك أنهم ليسوا أفضل من الناس . وهذا ما دل عليه قوله تعالى : { وقالت اليهود والنصارى نحن أبناء الله وأحباؤه قل فلم يعذبكم بذنوبكم بل أنتم بشر ممن خلق } [ المائدة : 18 ] .وبهذا يندفع ما قد يعرض للناظر في هذه الآية من المعارضة بينها وبين ما جاء في الأخبار الصحيحة من النهي عن تمني الموت . وما روي أن النبي صلى الله عليه وسلم قال : \" من أحبَّ لقاء الله أحب الله لقاءه ومن كَره لقاء الله كره الله لقاءه \"، فقالت عائشة : «إنا نكره الموت فقال لها ليس ذلك» الحديث . وما روي عنه أنه قال : \" ارسل ملك الموت إلى موسى فلما جاءه صكه فرجع إلى ربه فقال أرسلتني إلى عبد لا يريد الموت \" إلى قوله : «قال موسى فالآن» .ذلك أن شأن المؤمنين أن يكونوا بين الرجاء والخوف من الله ، وليسوا يتوهمون أن الفوز مضمون لهم كما توهم اليهود .فما تضمنته هذه الآية حكاية عن حال اليهود الموجودين يومئذٍ ، وهم عامة غلبت عليهم الأوقام والغرور بعد انقراض علمائهم ، فهو حكايه عن مجموع قوم ، وأما الأَخبار التي أوردناها فوصف لأحوال معيّنة وأشخاص معينين فلا تعارض مع اختلاف الأحوال والأزمان ، فلو حصل لأحد يقين بالتعجيل إلى النعيم لتمنى الموت إلا أن تكون حياته لتأييد الدين كحياة الأنبياء .فعلى الأول يحمل حال عُمَير بن الحُمَام في قوله :جَرْياً إلى الله بغير زاد ... وحال جعفر بن أبي طالب يوم مُوتَةَ وقد اقتحم صَفّ المشركين :يَا حَبَّذا الجنةُ واقترابها ... وقول عبد الله بن رواحة :لكنني أسأل الرحمان مغفرة ... وضربة ذات فَرْغغٍ تقذف الزبداالمتقدمة في سورة البقرة لأن الشهادة مضمونة الجزاء الأحسن والمغفرة التامة .وعلى الثاني يحمل قول النبي صلى الله عليه وسلم لعائشة في تأويل قوله : \" من أحب لقاء الله أحب الله لقاءه \" إن المؤمن إذا حضره الموت بُشر برضوان الله فليس شيء أحبَّ إليه مما أمَامَه فأحَب لقاء الله . وقول موسى عليه السلام لملَك الموت : «فالآن .\n","ar.waseet":"ثم أمر الله - تعالى - نبيه - صلى الله عليه وسلم - أن يتحدى اليهود ، وأن يرد على مزاعمهم ردا يخرس ألسنتهم ، ويكشف عن أكاذيبهم . . . فقال - سبحانه - : ( قُلْ ياأيها الذين هادوا إِن زَعمْتُمْ أَنَّكُمْ أَوْلِيَآءُ لِلَّهِ مِن دُونِ الناس فَتَمَنَّوُاْ الموت إِن كُنتُمْ صَادِقِينَ ) .قال الآلوسى : وأمر - الله - أن يقول لهم ذلك ، إظهارا لكذبهم ، فإنهم كانوا يقولون : ( نَحْنُ أَبْنَاءُ الله وَأَحِبَّاؤُهُ ) ويدعون أن الآخرة خالصة لهم عند الله .وروى أنه لما ظهر رسول الله - صلى الله عليه وسلم - كتب يهود المدينة إلى يهود خيبر : إن اتبعتم محمدا أطعناه ، وإن خالفتموه خالفناه . فقالوا - أى : يهود خيبر - : \" نحن أبناء خليل الرحمن ، ومنا عزير ابن الله ، ومنا الأنبياء ومتى كانت النبوة فى العرب؟ نحن أحق بها من محمد - صلى الله عليه وسلم - ، ولا سبيل إلى اتباعه ، فنزلت هذه الآيات . . .والمقصود بالذين هادوا ، أى : الذين ادعو أنهم على الديانة اليهودية ، يقال : هاد فلان وتَهَوَّدَ .إذا دخل فى اليهودية ، نسبة إلى يهوذا أحد أبناء يعقوب - عليه السلام - ، أو سموا بذلك حين تابوا عن عبادة العجل ، من هادَ يهوَدُ هَوْدًا بمعنى تاب ، ومنه قوله - تعالى - : ( واكتب لَنَا فِي هذه الدنيا حَسَنَةً وَفِي الآخرة إِنَّا هُدْنَآ إِلَيْكَ . . ) أى : تبنا إليك .ومعنى ، أولياء الله . . . مقربين منه ، كرماء عليه ، لهم منزلة خاصة عنده - تعالى - .وقوله : ( فَتَمَنَّوُاْ الموت . . ) جواب الشرط ، والتمنى معناه : ارتياح النفس ، ورغبتها القوية فى الحصول على الشىء .ويستعمل التمنى فى المعنى القائم بالقلب ، بأن تتطلع نفس الشخص إلى الحصول على الشىء . كما يستعمل عن طريق النطق باللسان ، بأن يقول الإنسان بلسانه ، ليتنى أحصل على كذا .وهذا المعنى الثانى هو المراد هنا ، لأن المعنى الكائن فى القلب لا يعلمه أحد سوى الله - تعالى - .ومعنى الآية الكريمة : قل يا محمد لهؤلاء اليهود الزاعمين أنهم أبناء الله وأحباؤه ، وأنهم أولياء الله - تعالى - المقربون إليه من دون سائر خلقه . . . قل لهم على سبيل التحدى والتعجيز والتبكيت - إن كان الأمر كما زعمتم ، فاذكروا أمام الناس بألسنتكم لفظا ، يدل على أنكم تحبون الموت وترغبون فيه ، كلى تظفروا بعد الموت بالمحبة الكاملة من الله ، ولكى تنتقلوا من شقاء الدنيا ومتاعبها إلى النعيم الخالص بعد موتكم .وجواب الشرط فى قوله : ( إِن كُنتُمْ صَادِقِينَ ) محذوف لدلالة ما قبله عليه .أى : إن كنتم صادقين فى دعواكم أنكم أولياء الله من دون الناس فتمنوا الموت .وافتتحت الآية الكريمة بلفظ ( قُلْ ) للاهتمام بشأن التحدى من الرسول - صلى الله عليه وسلم - لهم ، ولبيان أنه أمر من الله - تعالى - وليس للرسول - صلى الله عليه وسلم - سوى التنفيذ .وجىء بإن الشرطية المفيدة للشك ، مع أنهم قد زعموا أنهم أولياء لله فعلا ، للإشعار بأن زعمهم هذا وإن كانوا قد كرروا النطق والتباهى به . . إلا أنه بمنزلة الشىء الذى تلوكه الألسنة ، دون أن يكون له أساس من الواقع ، فهو لوضوح بطلانه صار بمنزلة الشىء الذى يفترض وقوعه افتراضا على سبيل التوبيخ لهم .قال الآلوسى ما ملخصه : قوله : ( قُلْ ياأيها الذين هادوا ) أى : تهودوا ( إِن زَعمْتُمْ أَنَّكُمْ أَوْلِيَآءُ لِلَّهِ ) أى : أحباء لله ، ولم يضف - سبحانه - لفظ أولياء إليه ، كما فى قوله : ( ألا إِنَّ أَوْلِيَآءَ الله لاَ خَوْفٌ عَلَيْهِمْ . . ) ليؤذن بالفرق بين مدعى الولاية ، ومن يخصه - تعالى - بها .وقوله : ( مِن دُونِ الناس . . ) حال من الضمير الراجع إلى اسم ( إِن ) أى : متجاوزين عن الناس .( فَتَمَنَّوُاْ الموت ) أى : فتمنوا من الله أن يميتكم وينقلكم من دار البلية إلى محل الكرامة . فإن من أين أنه من أهل الجنة أحب أن يخلص إليها من هذه الدنيا التى هى دار كدر وتعب .\n","ar.baghawi":"( قل ياأيها الذين هادوا إن زعمتم أنكم أولياء لله من دون الناس ) من دون محمد - صلى الله عليه وسلم - وأصحابه ( فتمنوا الموت ) فادعوا بالموت على أنفسكم ( إن كنتم صادقين ) ، أنكم أبناء الله وأحباؤه فإن الموت هو الذي يوصلكم إليه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5183.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5183.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5183.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۚ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ","transliteration":"Wa laa yatamannaw nahooo abadam bimaa qaddamat aydeehim; wallaahu 'aleemum bix zaalimeen","translations":{"en.ahmedali":"But they will never wish for death because of what they had done in the past, and God knows the sinners well.","en.ahmedraza":"And they will never wish for it because of the misdeeds their hands have sent ahead; and Allah well knows the unjust.","en.arberry":"But they will never long for it, because of that their hands have forwarded; God knows the evildoers.","en.asad":"But never will they long for it, because [they are aware] of what their hands have wrought in this world; and God has full knowledge of evildoers.","en.daryabadi":"And they will never wish there for, because of that which their hands have sent forward. And Allah is the Knower of he wrong-doers.","en.hilali":"But they will never long for it (death), because of what (deeds) their hands have sent before them! And Allah knows well the Zalimun (polytheists, wrong-doers, disbelievers, etc.).","en.pickthall":"But they will never long for it because of all that their own hands have sent before, and Allah is Aware of evil-doers.","en.qaribullah":"But, because of what their hands forwarded they will never long for it. Allah knows the harmdoers.","en.sahih":"But they will not wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers.","en.sarwar":"They will never wish for death because of what they have done! God knows best about the unjust people.","en.yusufali":"But never will they express their desire (for Death), because of the (deeds) their hands have sent on before them! and Allah knows well those that do wrong!","en.maududi":"But they shall never wish for death because of the (evil) deeds they have committed. Allah is well aware of these evil-doers.","en.shakir":"And they will never invoke it because of what their hands have sent before; and Allah is Cognizant of the unjust.","en.itani":"But they will not wish for it, ever, due to what their hands have advanced. God knows well the wrongdoers.","en.mubarakpuri":"But they will never long for it, because of what their hands have sent before them! And Allah knows well the wrongdoers.","en.qarai":"Yet they will never long for it, because of what their hands have sent ahead, and Allah knows best the wrongdoers.","en.wahiduddin":"They will never wish for it, because of what their hands have sent forward. God has full knowledge of evil-doers."},"tafsir":{"ar.muyassar":"ولا يتمنى هؤلاء اليهود الموت أبدًا إيثارًا للحياة الدنيا على الآخرة، وخوفًا من عقاب الله لهم؛ بسبب ما قدَّموه من الكفر وسوء الفعال. والله عليم بالظالمين، لا يخفى عليه من ظلمهم شيء.","ar.jalalayn":"«ولا يتمنوْنه أبدا بما قدمت أيديهم» من كفرهم بالنبي المستلزم لكذبهم «والله عليم بالظالمين» الكافرين.","ar.qurtubi":"ولا يتمنونه أبدا بما قدمت أيديهم أي أسلفوه من تكذيب محمد صلى الله عليه وسلم ; فلو تمنوه لماتوا ; فكان في ذلك بطلان قولهم وما ادعوه من الولاية . وفي حديث أن النبي صلى الله عليه وسلم قال لما نزلت هذه الآية : \" والذي نفس محمد بيده لو تمنوا الموت ما بقي على ظهرها يهودي إلا مات \" . وفي هذا إخبار عن الغيب ، ومعجزة للنبي صلى الله عليه وسلم . وقد مضى معنى هذه الآية في \" البقرة \" في قوله تعالى - : قل إن كانت لكم الدار الآخرة عند الله خالصة من دون الناس فتمنوا الموت إن كنتم صادقين .\n","ar.miqbas":"وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ (7)اعتراض بين جملتي القولين قصد به تحديهم لإِقامة الحجة عليهم أنهم ليسوا أولياء لله .وليس المقصود من هذا معذرة لهم من عدم تمنيهم الموت وإنما المقصود زيادة الكشف عن بطلان قولهم : { نحن أبناء الله وأحباؤه } [ المائدة : 18 ] وإثبات أنهم في شك من ذلك كما دل عليه استدلال القرآن عليهم بتحققهم أن الله يعذبهم بذنوبهم في قوله تعالى : { وقالت اليهود والنصارى نحن أبناء الله وأحباؤه قل فلم يعذبكم بذنوبكم . وقد مرّ ذلك في تفسير سورة العقود ( 18 .( والباء في بما قدمت أيديهم } سببية متعلقة بفعل { يتمنونه } المنفي فما قدمت أيديهم هو سَبب انتفاء تمنيهم الموت ألقى في نفوسهم الخوف مما قدمت أيديهم فكان سبب صرفهم عن تمنّي الموت لتقدم الحجة عليهم .و ( ما ) موصولة وعائدة الصلة محذوف وحذفه أغلبي في أمثاله .والأيدي مجاز في اكتساب الأعمال لأن اليد يلزمها الاكتساب غالباً . وَمَصْدَقُ «ما قدمت أيديهم» سيئاتهم ومعاصيهم بقرينة المقام .وتقدم نظير هذه الآية في سورة البقرة وما ذكرتُه هنا أتم مما هنالك فاجمع بينهما .والتقديم : أصله جعل الشيء مقدَّماً ، أي سابقاً غيرَه في مكان يقعوه فيه غيره . واستعير هنا لما سلف من العمل تشبيهاً له بشيء يسبِّقه المرء إلى مكان قبل وصوله إليه .وجملة { والله عليم بالظالمين } ، أي عليم بأحوالهم وبأحوال أمثالهم من الظالمين فشمل لفظ الظالمين اليهود فإنهم من الظالمين . وقد تقدم معنى ظلمهم في الآية قبلها . وقد وصف اليهود بالظالمين في آيات كثيرة ، وتقدم عند قوله تعالى : { ومن أظلم ممن كتم شهادة عنده من الله } [ البقرة : 140 ] والمقصود أن إحجامهم عن تمنّي الموت لما في نفوسهم من خوف العقاب على ما فعلوه في الدنيا ، فكني بعلم الله بأحوالهم عن عدم انفلاتهم من الجزاء عليها ففي هذا وعيد لهم .\n","ar.waseet":"ثم أخبر - سبحانه - عن واقعهم وعن حالتهم المستقبلة فقال : ( وَلاَ يَتَمَنَّونَهُ أَبَداً بِمَا قَدَّمَتْ أَيْديهِمْ والله عَلِيمٌ بالظالمين ) .أى : أن هؤلاء اليهود لا يتمنى أحدهم الموت أبدا . بسبب ما قدمته أيديهم من آثام ، والله - تعالى - لا تخفى عليه خافية من سيئاتهم واعتداءاتهم وظلمهم بل هو - سبحانه - يسجل ذلك عليهم ، ويجازيهم بما يستحقونه من عقاب .فالآية الكريمة خبر من الله - تعالى - عن اليهود بأنهم يكرهون الموت ، ولا يتمنونه ، ولا يستطيعون قبول ما تحداهم به - صلى الله عليه وسلم - من طلبهم تمنى الموت ، لعلمهم بأنهم لو أجابوه إلى طلبه ، لحل بهم الموت الذى يكرهونه .وقد صح من عدة طرق عن ابن عباس أنه قال : لو تمنوا الموت لشرق أحدهم بريقه . . .وقال ابن جرير : وبلغنا أن النبى - صلى الله عليه وسلم - قال : \" لو أن اليهود تمنوا الموت لماتوا ، ولرأوا مقاعدهم من النار . . \" .وقال ابن كثير : وروى الإمام أحمد عن ابن عباس قال : \" قال أبو جهل - لعنه الله - : إن رأيتُ محمدا عند الكعبة ، لآتينه حتى أطأ عنقه . قال : فقال رسول الله - صلى الله عليه وسلم - : \" لو فعل لأخذته الملائكة عيانا ، ولو أن اليهود تمنوا الموت لماتوا ولرأوا مقاعدهم من النار . ولو خرج الذين يباهلون رسول الله - صلى الله عليه وسلم - لرجعوا لا يجدون مالا ولا أهلا \" \" .وقال صاحب الكشاف ما ملخصه : وقوله : ( وَلاَ يَتَمَنَّونَهُ أَبَداً ) أى : بسبب ما قدموا من الكفر ، وقد قال لهم - صلى الله عليه وسلم - : \" والذى نفسى بيده لا يقولها أحد منكم إلا غص بريقه \" فلولا أنهم كانوا موقنين بصدق رسول الله - صلى الله عليه وسلم - لتمنوا ، ولكنهم علموا أنهم لم تمنوا لماتوا من ساعتهم ولحقهم الوعيد فما تمالك أحد منهم أن يتمنى ، وهى إحدى المعجزات - لأنها إخبار بالغيب وكانت كما أخبر - .فإن قلت : ما أدراك أنهم لم يتمنوا الموت؟ قلت : لو تمنوا لنقل ذلك عنهم ، كما نقلت سائر الحوادث ، ولكان ناقلوه من أهل الكتاب وغيرهم من أولى المطاعن فى الإسلام ، أكثر من الذر ، وليس أحد منهم نقل عنه ذلك .هذا ، ويكفى فى تحقيق هذه المعجزة ، ألا يصدر تمنى الموت عن اليهود الذين تحداهم النبى - صلى الله عليه وسلم - بذلك ، وهم الذين كانوا يضعون العراقيل فى طريق دعوته . . ولا يقدح فى هذه المعجزة ، أن ينطق يهودى بعد العهد النبوى بتمنى الموت ، وهو حريص على الحياة ، لأن المعنيين بالتحدى هم اليهود المعاصرون للعهد النبوى .والمقصود بقوله - تعالى - : ( والله عَلِيمٌ بالظالمين ) التهديد والوعيد .أى : والله - تعالى - عليم علما تاما بأحوال هؤلاء الظالمين ، وسيعاقبهم العقاب الذىيتناسب مع ظلمهم وبغيهم . فالمراد من العلم لازمه ، وهو الجزاء والحساب . . .وعبر - سبحانه - هنا بقوله : ( وَلاَ يَتَمَنَّونَهُ . . ) وفى سورة البقرة بقوله : ( وَلَنْ يَتَمَنَّوْهُ . . . ) للإشعار بأنهم يكرهون الموت فى الحال وفى المستقبل كراهة شديدة .\n","ar.baghawi":"\"ولا يتمنونه أبداً بما قدمت أيديهم والله عليم بالظالمين\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5184.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5184.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5184.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","transliteration":"Qul innal mawtal lazee tafirroona minhu fa innahoo mulaaqeekum summa turaddoona ilaa 'Aalimil Ghaibi wash shahaadati fa yunabbi'ukum bimaa kuntum ta'maloon","translations":{"en.ahmedali":"Tell them: \"Death from which you run, will surely come to you. You will then be sent back to Him who knows the unknown and the known, who will tell you what you used to do.","en.ahmedraza":"Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Indeed death which you run away from will surely confront you, then you will be returned to Him Who knows all the hidden and the visible – He will then inform you of what you did.”","en.arberry":"Say: 'Surely death, from which you flee, shall encounter you; then you shall be returned to the Knower of the Unseen and the Visible, and He will tell you that you have been doing.'","en.asad":"Say: \"Behold, the death from which you are fleeing is bound to overtake you - and then you will be brought back unto Him who knows all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind, whereupon He will make you truly understand all that you were doing [in life].","en.daryabadi":"Say thou: verily the death which ye flee from! then verily it will meet you and thereafter ye will be brought back Unto the Knower of the unseen and the seen, and He will declare Unto you that which ye have been working.","en.hilali":"Say (to them): \"Verily, the death from which you flee will surely meet you, then you will be sent back to (Allah), the All-Knower of the unseen and the seen, and He will tell you what you used to do.\"","en.pickthall":"Say (unto them, O Muhammad): Lo! the death from which ye shrink will surely meet you, and afterward ye will be returned unto the Knower of the Invisible and the Visible, and He will tell you what ye used to do.","en.qaribullah":"Say: 'Death from which you flee is sure to reach you. Then you shall be returned to the Knower of the Unseen and the Visible, and He will tell you all that you have done'","en.sahih":"Say, \"Indeed, the death from which you flee - indeed, it will meet you. Then you will be returned to the Knower of the unseen and the witnessed, and He will inform you about what you used to do.\"","en.sarwar":"(Muhammad), tell them, \"The death from which you run away will certainly approach you. Then you will be returned to the One who knows the unseen and the seen, and He will tell you what you have done\".","en.yusufali":"Say: \"The Death from which ye flee will truly overtake you: then will ye be sent back to the Knower of things secret and open: and He will tell you (the truth of) the things that ye did!\"","en.maududi":"Tell them: “The death from which you flee will certainly overtake you. Then you will be returned to Him Who fully knows what is hidden and what is manifest. Thereupon He will let you know all that you used to do.”","en.shakir":"Say: (As for) the death from which you flee, that will surely overtake you, then you shall be sent back to the Knower of the unseen and the seen, and He will inform you of that which you did.","en.itani":"Say, “The death from which you flee will catch up with you; then you will be returned to the Knower of the Invisible and the Visible, and He will inform you of what you used to do.”","en.mubarakpuri":"Say: \"Verily, the death from which you flee, will surely meet you, then you will be sent back to the Knower of the unseen and the seen, and He will inform you about what you used to do.\"","en.qarai":"Say, ‘The death that you flee will indeed encounter you. Then you will be returned to the Knower of the sensible and the Unseen, and He will inform you about what you used to do.’","en.wahiduddin":"So say, \"The death you run away from will certainly meet you, and thereafter you will be brought back to the Knower of the unseen and the seen, and He will declare to you what you have done.\""},"tafsir":{"ar.muyassar":"قل: إن الموت الذي تهربون منه لا مفرَّ منه، فإنه آتٍ إليكم عند مجيء آجالكم، ثم ترجعون يوم البعث إلى الله العالم بما غاب وما حضر، فيخبركم بأعمالكم، وسيجازيكم عليها.","ar.jalalayn":"«قل إن الموت الذي تفرون منه فإنه» الفاء زائدة «ملاقيكم ثم تردون إلى عالم الغيب والشهادة» السر والعلانية «فينبئكم بما كنتم تعملون» فيجازيكم به.","ar.qurtubi":"قوله تعالى : قل إن الموت الذي تفرون منه فإنه ملاقيكم ثم تردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون قال الزجاج : لا يقال : إن زيدا فمنطلق ، وهاهنا قال : فإنه ملاقيكم لما في معنى الذي من الشرط والجزاء ، أي إن فررتم منه فإنه ملاقيكم ، ويكون مبالغة في الدلالة على أنه لا ينفع الفرار منه . قال زهير :ومن هاب أسباب المنايا ينلنه ولو رام أسباب السماء بسلمقلت : ويجوز أن يتم الكلام عند قوله : \" الذي تفرون منه \" ثم يبتدئ \" فإنه ملاقيكم \" . وقال طرفة :وكفى بالموت فاعلم واعظا     لمن الموت عليه قد قدرفاذكر الموت وحاذر ذكره     إن في الموت لذي اللب عبركل شيء سوف يلقى حتفه     في مقام أو على ظهر سفروالمنايا حوله ترصده     ليس ينجيه من الموت الحذر\n","ar.miqbas":"قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ثُمَّ تُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ (8)تصريح بما اقتضاه التذييل من الوعيد وعدم الانفلات من الجزاء عن أعمالهم ولو بَعُد زمان وقوعها لأن طول الزمان لا يؤثر في علم الله نسياناً ، إذ هو عالم الغيب والشهادة . وموقع هذه الجملة موقع بدل الاشتمال من جملة { فتمنوا الموت إن كنتم صادقين } [ الجمعة : 6 ] ، وإعادة فعل { قل } من قبيل إعادة العامل في المبدل منه كقوله تعالى : { تكون لنا عيداً لأولنا وآخرنا } في سورة [ العقود : 114 ] .ووصف الموت } ب { الذي تفرون منه } للتنبيه على أن هلعهم من الموت خطأ كقول علقمة :إن الذين ترونهم إخوانكميشفي غليل صدورهم أن تُصرعواوأطلق الفرار على شدة الحذر على وجه الاستعارة .واقتران خبر ( إن ) بالفاء في قوله : { فإنه ملاقيكم } لأن اسم ( إن ) نُعِت باسم الموصول والموصول كثيراً ما يعامل معاملة الشرط فعومل اسم ( إن ) المنعوت بالموصول معاملة نعته .وإعادة { إِنّ } الأولى لزيادة التأكيد كقول جرير :إن الخليفةَ إن الله سربلهسِربال مُلْككٍ به تُزْجى الخَواتِيموتقدم عند قوله تعالى : { إن الذين آمنوا وعملوا الصالحات إنا لا نضيع أجر من أحسن عملاً } في سورة [ الكهف : 30 ] . وفي سورة الحج أيضاً .والإِنباء بما كانوا يعملون كناية عن الحساب عليه ، وهو تعريض بالوعيد .\n","ar.waseet":"ثم أمر الله - تعالى - رسوله - صلى الله عليه وسلم - بأن يخبرهم بأنهم لا مفر لهم من الموت ، مهما حرصوا على الهروب منه . فقال - تعالى - : ( قُلْ إِنَّ الموت الذي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلاَقِيكُمْ . . . ) .أى : قل - أيها الرسول الكريم - لهؤلاء اليهود الذين يكرهون الموت ، ويزعمون أنهم أحباب الله؟قل لهم على سبيل التوبيخ والتبكيت : إن الموت الذى تكرهونه ، وتحرصون على الفرار منه ، لا مهرب لكم منه ، ولا محيص لكم عنه ، فهو نازل بكم إن عاجلا أو آجلا كما قال - سبحانه - ( أَيْنَمَا تَكُونُواْ يُدْرِككُّمُ الموت وَلَوْ كُنتُمْ فِي بُرُوجٍ مُّشَيَّدَةٍ . . . ) فالمقصود بهذه الآية الكريمة إخبارهم بأن هلعهم من الموت مهما اشتد لن يفيدهم شيئا ، لأن الموت نازل بهم لا محالة .ثم بين - سبحانه - أنهم بعد الموت ، سيجدون الجزاء العادل فقال : ( ثُمَّ تُرَدُّونَ إلى عَالِمِ الغيب والشهادة فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ) .أى : قل لهم - أيها الرسول الكريم - : إن الموت نازل بكم لا محالة . ثم بعد هلاككم سترجعون إلى الله - تعالى - الذى يعلم السر والعلانية ، والجهر والخفاء ، فيجازيكم على أعمالكم السيئة ، بما تستحقونه من عقاب .فالمراد بالإنباء عما كانوا يعملونه ، الحساب على ذلك ، والمجازاة عليه .وشبيه بهذه الآيات قوله - تعالى - فى سورة البقرة : ( قُلْ إِن كَانَتْ لَكُمُ الدار الآخرة عِندَ الله خَالِصَةً مِّن دُونِ الناس فَتَمَنَّوُاْ الموت إِن كُنْتُمْ صَادِقِينَ وَلَنْ يَتَمَنَّوْهُ أَبَداً بِمَا قَدَّمَتْ أَيْدِيهِمْ والله عَلِيمٌ بالظالمين وَلَتَجِدَنَّهُمْ أَحْرَصَ الناس على حَيَاةٍ وَمِنَ الذين أَشْرَكُواْ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ وَمَا هُوَ بِمُزَحْزِحِهِ مِنَ العذاب أَن يُعَمَّرَ والله بَصِيرٌ بِمَا يَعْمَلُونَ ).\n","ar.baghawi":"\"قل إن الموت الذي تفرون منه فإنه ملاقيكم ثم تردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5185.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5185.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5185.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَىٰ ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ","transliteration":"Yaaa ayyuhal lazeena aamanoo izaa noodiya lis-Salaati miny yawmil Jumu'ati fas'aw ilaa zikril laahi wa zarul bai'; zaalikum khayrul lakum in kuntum ta'lamoon","translations":{"en.ahmedali":"O you who believe, when the call to prayer is made on the day of congregation, hasten to remember God, putting aside your business. This is better for you if you can understand.","en.ahmedraza":"O People who Believe! When the call for prayer is given on (Friday) the day of congregation, rush towards the remembrance of Allah and stop buying and selling; this is better for you if you understand.","en.arberry":"O believers, when proclamation is made for prayer on the Day of Congregation, hasten to God's remembrance and leave trafficking aside; that is better for you, did you but know.","en.asad":"O YOU who have attained to faith! When the call to prayer is sounded on the day of congregation, hasten to the remembrance of God, and leave all worldly commerce: this is for your own good, if you but knew it.","en.daryabadi":"O ye who believe! when the call to prayer is made on the day of Friday then repair Unto the remembrance of Allah and leave off bargaining. That is better for you if ye know","en.hilali":"O you who believe (Muslims)! When the call is proclaimed for the Salat (prayer) on the day of Friday (Jumu'ah prayer), come to the remembrance of Allah [Jumu'ah religious talk (Khutbah) and Salat (prayer)] and leave off business (and every other thing), that is better for you if you did but know!","en.pickthall":"O ye who believe! When the call is heard for the prayer of the day of congregation, haste unto remembrance of Allah and leave your trading. That is better for you if ye did but know.","en.qaribullah":"Believers, when you are called to prayer on the Day of the Congregation (Friday), hasten to the Remembrance of Allah and put your trading to oneside. That is the best for you, if you but knew.","en.sahih":"O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew.","en.sarwar":"Believers, on Friday when the call for prayer is made, try to attend prayer (remembering God) and leave off all business. This would be better for you if only you knew it.","en.yusufali":"O ye who believe! When the call is proclaimed to prayer on Friday (the Day of Assembly), hasten earnestly to the Remembrance of Allah, and leave off business (and traffic): That is best for you if ye but knew!","en.maududi":"Believers, when the call for Prayer is made on Friday, hasten to the remembrance of Allah and give up all trading. That is better for you, if you only knew.","en.shakir":"O you who believe! when the call is made for prayer on Friday, then hasten to the remembrance of Allah and leave off trading; that is better for you, if you know.","en.itani":"O you who believe! When the call is made for prayer on Congregation Day, hasten to the remembrance of God, and drop all business. That is better for you, if you only knew.","en.mubarakpuri":"O you who believe! When the call is proclaimed for the Salah on Al-Jumu`ah (Friday), then hasten (Fas`aw) to the remembrance of Allah and leave off business. That is better for you if you did but know!","en.qarai":"O you who have faith! When the call is made for prayer on Friday, hurry toward the remembrance of Allah, and leave all business. That is better for you, should you know.","en.wahiduddin":"Believers! When the call to prayer is made on the day of congregation, hasten to the remembrance of God, and leave all worldly commerce: this is for your own good, if you but knew it."},"tafsir":{"ar.muyassar":"يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، إذا نادى المؤذن للصلاة في يوم الجمعة، فامضوا إلى سماع الخطبة وأداء الصلاة، واتركوا البيع، وكذلك الشراء وجميع ما يَشْغَلُكم عنها، ذلك الذي أُمرتم به خير لكم؛ لما فيه من غفران ذنوبكم ومثوبة الله لكم، إن كنتم تعلمون مصالح أنفسكم فافعلوا ذلك. وفي الآية دليل على وجوب حضور الجمعة واستماع الخطبة.","ar.jalalayn":"«يا أيها الذين آمنوا إذا نودي للصلاة من» بمعني في «يوم الجمعة فاسعوْا» فامضوا «إلى ذكر الله» للصلاة «وذروا البيع» اتركوا عقده «ذلكم خير لكم إن كنتم تعلمون» أنه خير فافعلوه.","ar.qurtubi":"قوله تعالى : يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله وذروا البيع ذلكم خير لكم إن كنتم تعلمون .فيه ثلاث عشرة مسألة :الأولى : قوله تعالى : يا أيها الذين آمنوا إذا نودي للصلاة من يوم قرأ عبد الله بن الزبير والأعمش وغيرهما \" الجمعة \" بإسكان الميم على التخفيف . وهما لغتان . وجمعهما جمع وجمعات . قال الفراء : يقال الجمعة ( بسكون الميم ) والجمعة ( بضم الميم ) والجمعة ( بفتح الميم ) فيكون صفة اليوم ; أي تجمع الناس . كما يقال : ضحكة للذي يضحك . وقال ابن عباس : نزل القرآن بالتثقيل والتفخيم فاقرءوها جمعة ; يعني بضم الميم . وقال الفراء وأبو عبيد : والتخفيف أقيس وأحسن ; نحو غرفة وغرف ، وطرفة وطرف ، وحجرة وحجر . وفتح الميم لغة بني عقيل . وقيل : إنها لغة النبي صلى الله عليه وسلم . وعن سلمان أن النبي صلى الله عليه وسلم قال : [ ص: 88 ] \" إنما سميت جمعة لأن الله جمع فيها خلق آدم \" . وقيل : لأن الله تعالى فرغ فيها من خلق كل شيء فاجتمعت فيها المخلوقات . وقيل : لتجتمع الجماعات فيها . وقيل : لاجتماع الناس فيها للصلاة . و \" من \" بمعنى في ; أي في يوم ; كقوله تعالى : أروني ماذا خلقوا من الأرض أي في الأرض .الثانية : قال أبو سلمة : أول من قال : \" أما بعد \" كعب بن لؤي ، وكان أول من سمى الجمعة جمعة . وكان يقال ليوم الجمعة : العروبة . وقيل : أول من سماها جمعة الأنصار . قال ابن سيرين : جمع أهل المدينة من قبل أن يقدم النبي صلى الله عليه وسلم المدينة ، وقبل أن تنزل الجمعة ; وهم الذين سموها الجمعة ; وذلك أنهم قالوا : إن لليهود يوما يجتمعون فيه ، في كل سبعة أيام يوم وهو السبت . وللنصارى يوم مثل ذلك وهو الأحد فتعالوا فلنجتمع حتى نجعل يوما لنا نذكر الله ونصلي فيه - ونستذكر - أو كما قالوا - فقالوا : يوم السبت لليهود ، ويوم الأحد للنصارى ; فاجعلوه يوم العروبة . فاجتمعوا إلى أسعد بن زرارة ( أبو أمامة رضي الله عنه ) فصلى بهم يومئذ ركعتين وذكرهم ، فسموه يوم الجمعة حين اجتمعوا . فذبح لهم أسعد شاة فتعشوا وتغدوا منها لقلتهم . فهذه أول جمعة في الإسلام .قلت : وروي أنهم كانوا اثني عشر رجلا على ما يأتي . وجاء في هذه الرواية أن الذي جمع بهم وصلى أسعد بن زرارة ، وكذا في حديث عبد الرحمن بن كعب بن مالك عن أبيه كعب على ما يأتي . وقال البيهقي : وروينا عن موسى بن عقبة عن ابن شهاب الزهري أن مصعب بن عمير كان أول من جمع الجمعة بالمدينة للمسلمين قبل أن يقدمها رسول الله صلى الله عليه وسلم . قال البيهقي : يحتمل أن يكون مصعب جمع بهم بمعونة أسعد بن زرارة فأضافه كعب إليه . والله أعلم .[ ص: 89 ] وأما أول جمعة جمعها النبي صلى الله عليه وسلم بأصحابه ; فقال أهل السير والتواريخ : قدم رسول الله صلى الله عليه وسلم مهاجرا حتى نزل بقباء على بني عمرو بن عوف يوم الاثنين لاثنتي عشرة ليلة خلت من شهر ربيع الأول حين اشتد الضحى . ومن تلك السنة يعد التاريخ . فأقام بقباء إلى يوم الخميس وأسس مسجدهم . ثم خرج يوم الجمعة إلى المدينة ; فأدركته الجمعة في بني سالم بن عوف في بطن واد لهم قد اتخذ القوم في ذلك الموضع مسجدا ; فجمع بهم وخطب . وهي أول خطبة خطبها بالمدينة ، وقال فيها : \" الحمد لله . أحمده وأستعينه وأستغفره وأستهديه ، وأومن به ولا أكفره ، وأعادي من يكفر به . وأشهد أن لا إله إلا الله وحده لا شريك له . وأشهد أن محمدا عبده ورسوله ، أرسله بالهدى ودين الحق ، والنور والموعظة والحكمة على فترة من الرسل ، وقلة من العلم ، وضلالة من الناس ، وانقطاع من الزمان ، ودنو من الساعة ، وقرب من الأجل . من يطع الله ورسوله فقد رشد . ومن يعص الله ورسوله فقد غوى وفرط وضل ضلالا بعيدا . أوصيكم بتقوى الله ، فإنه خير ما أوصى به المسلم المسلم أن يحضه على الآخرة ، وأن يأمره بتقوى الله . واحذروا ما حذركم الله من نفسه ; فإن تقوى الله لمن عمل به على وجل ومخافة من ربه عون صدق على ما تبغون من أمر الآخرة . ومن يصلح الذي بينه وبين ربه من أمره في السر والعلانية ، لا ينوي به إلا وجه الله يكن له ذكرا في عاجل أمره ، وذخرا فيما بعد الموت ، حين يفتقر المرء إلى ما قدم . وما كان مما سوى ذلك يود لو أن بينه وبينه أمدا بعيدا . ويحذركم الله نفسه والله رءوف بالعباد . هو الذي صدق قوله ، وأنجز وعده ، لا خلف لذلك ; فإنه يقول تعالى : ما يبدل القول لدي وما أنا بظلام للعبيد . فاتقوا الله في عاجل أمركم وآجله في السر والعلانية ; فإنه من يتق الله يكفر عنه سيئاته ويعظم له أجرا . ومن يتق الله فقد فاز فوزا عظيما . وإن تقوى الله توقي مقته وتوقي عقوبته وتوقي سخطه . وإن تقوى الله تبيض الوجوه ، وترضي الرب ، وترفع الدرجة . فخذوا بحظكم ولا تفرطوا في جنب الله ، فقد علمكم كتابه ، ونهج لكم سبيله ; ليعلم الذين صدقوا ويعلم الكاذبين . فأحسنوا كما أحسن الله إليكم ، وعادوا أعداءه ، وجاهدوا في الله حق جهاده ; هو اجتباكم وسماكم المسلمين . ليهلك من هلك عن بينة ، ويحيا من حي عن بينة . ولا حول ولا قوة إلا بالله . فأكثروا ذكر الله تعالى ، واعملوا لما بعد الموت ; فإنه من يصلح ما بينه وبين الله يكفه الله ما بينه وبين الناس . ذلك بأن الله يقضي على الناس ولا يقضون عليه ، ويملك من الناس ولا يملكون منه . الله أكبر ، ولا حول ولا قوة إلا بالله العلي العظيم \" .[ ص: 90 ] وأول جمعة جمعت بعدها جمعة بقرية يقال لها : \" جواثي \" من قرى البحرين . وقيل : إن أول من سماها الجمعة كعب بن لؤي بن غالب لاجتماع قريش فيه إلى كعب ; كما تقدم . والله أعلم .الثالثة : خاطب الله المؤمنين بالجمعة دون الكافرين تشريفا لهم وتكريما فقال : يا أيها الذين آمنوا ، ثم خصه بالنداء ، وإن كان قد دخل في عموم قوله تعالى : وإذا ناديتم إلى الصلاة ليدل على وجوبه وتأكيد فرضه . وقال بعض العلماء : كون الصلاة الجمعة هاهنا معلوم بالإجماع لا من نفس اللفظ . قال ابن العربي : وعندي أنه معلوم من نفس اللفظ بنكتة وهي قول : \" من يوم الجمعة \" وذلك يفيده ; لأن النداء الذي يختص بذلك اليوم هو نداء تلك الصلاة . فأما غيرها فهو عام في سائر الأيام . ولو لم يكن المراد به نداء الجمعة لما كان لتخصيصه بها وإضافته إليها معنى ولا فائدة .‎ الرابعة : فقد تقدم حكم الأذان في سورة \" المائدة \" مستوفى . وقد كان الأذان على عهد رسول الله صلى الله عليه وسلم كما في سائر الصلوات ; يؤذن واحد إذا جلس النبي صلى الله عليه وسلم على المنبر . وكذلك كان يفعل أبو بكر وعمر وعلي بالكوفة . ثم زاد عثمان على المنبر أذانا ثالثا على داره التي تسمى \" الزوراء \" حين كثر الناس بالمدينة . فإذا سمعوا أقبلوا ; حتى إذا جلس عثمان على المنبر أذن مؤذن النبي صلى الله عليه وسلم ، ثم يخطب عثمان . خرجه ابن ماجه في سننه من حديث محمد بن إسحاق عن الزهري عن السائب بن يزيد قال : ما كان لرسول الله صلى الله عليه وسلم إلا مؤذن واحد ; إذا خرج أذن وإذا نزل أقام . وأبو بكر وعمر كذلك . فلما كان عثمان وكثر الناس زاد النداء الثالث على دار في السوق يقال لها \" الزوراء \" ; فإذا خرج أذن وإذا نزل أقام . خرجه [ ص: 91 ] البخاري من طرق بمعناه . وفي بعضها : أن الأذان الثاني يوم الجمعة أمر به عثمان بن عفان حين كثر أهل المسجد ، وكان التأذين يوم الجمعة حين يجلس الإمام . وقال الماوردي : فأما الأذان الأول فمحدث ، فعله عثمان بن عفان ليتأهب الناس لحضور الخطبة عند اتساع المدينة وكثرة أهلها . وقد كان عمر رضي الله عنه أمر أن يؤذن في السوق قبل المسجد ليقوم الناس عن بيوعهم ، فإذا اجتمعوا أذن في المسجد ، فجعله عثمان رضي الله عنه أذانين في المسجد . قاله ابن العربي . وفي الحديث الصحيح : أن الأذان كان على عهد رسول الله صلى الله عليه وسلم واحدا ، فلما كان زمن عثمان زاد الأذان الثالث على الزوراء ، وسماه في الحديث ثالثا لأنه أضافه إلى الإقامة ، كما قال عليه الصلاة والسلام : \" بين كل أذانين صلاة لمن شاء \" يعني الأذان والإقامة . ويتوهم الناس أنه أذان أصلي فجعلوا المؤذنين ثلاثة فكان وهما ، ثم جمعوهم في وقت واحد فكان وهما على وهم . ورأيتهم يؤذنون بمدينة السلام بعد أذان المنار بين يدي الإمام تحت المنبر في جماعة ، كما كانوا يفعلون عندنا في الدول الماضية . وكل ذلك محدث .الخامسة : قوله تعالى : فاسعوا إلى ذكر الله اختلف في معنى السعي هاهنا على ثلاثة أقوال : أولها : القصد . قال الحسن : والله ما هو بسعي على الأقدام ولكنه سعي بالقلوب والنية . الثاني : أنه العمل ، كقوله تعالى : ومن أراد الآخرة وسعى لها سعيها وهو مؤمن ، وقوله : إن سعيكم لشتى ، وقوله : وأن ليس للإنسان إلا ما سعى . وهذا قول الجمهور . وقال زهير : سعى بعدهم قوم لكي يدركوهم [ ص: 92 ] وقال أيضا :سعى ساعيا غيظ بن مرة بعدما تبزل ما بين العشيرة بالدمأي فاعملوا على المضي إلى ذكر الله ، واشتغلوا بأسبابه من الغسل والتطهير والتوجه إليه . الثالث : أن المراد به السعي على الأقدام . وذلك فضل وليس بشرط . ففي البخاري : أن أبا عبس بن جبر - واسمه عبد الرحمن وكان من كبار الصحابة - مشى إلى الجمعة راجلا وقال : سمعت رسول الله صلى الله عليه وسلم يقول : من اغبرت قدماه في سبيل الله حرمه الله على النار . ويحتمل ظاهره . رابعا : وهو الجري والاشتداد . قال ابن العربي : وهو الذي أنكره الصحابة الأعلمون والفقهاء الأقدمون . وقرأها عمر : \" فامضوا إلى ذكر الله \" فرارا عن طريق الجري والاشتداد الذي يدل على الظاهر . وقرأ ابن مسعود كذلك وقال : لو قرأت \" فاسعوا \" لسعيت حتى يسقط ردائي . وقرأ ابن شهاب : \" فامضوا إلى ذكر الله سالكا تلك السبيل \" . وهو كله تفسير منهم ; لا قراءة قرآن منزل . وجائز قراءة القرآن بالتفسير في معرض التفسير . قال أبو بكر الأنباري : وقد احتج من خالف المصحف بقراءة عمر وابن مسعود ، وأن خرشة بن الحر قال : رآني عمر رضي الله عنه ومعي قطعة فيها : فاسعوا إلى ذكر الله فقال لي عمر : من أقرأك هذا ؟ قلت : أبي . فقال : إن أبيا أقرؤنا للمنسوخ . ثم قرأ عمر \" فامضوا إلى ذكر الله \" . حدثنا إدريس قال : حدثنا خلف قال : حدثنا هشيم عن المغيرة عن إبراهيم عن خرشة ; فذكره . وحدثنا محمد بن يحيى أخبرنا محمد وهو ابن سعدان قال : حدثنا سفيان بن عيينة عن الزهري عن سالم عن أبيه قال : ما سمعت عمر يقرأ قط إلا \" فامضوا إلى ذكر الله \" . وأخبرنا إدريس قال : حدثنا خلف قال : حدثنا هشيم عن المغيرة عن إبراهيم أن عبد الله بن مسعود قرأ \" فامضوا إلى ذكر الله \" وقال : لو كانت \" فاسعوا \" لسعيت حتى يسقط ردائي . قال أبو بكر : فاحتج عليه بأن الأمة أجمعت على فاسعوا برواية ذلك عن الله رب العالمين ورسوله صلى الله عليه وسلم . فأما عبد الله بن مسعود فما صح عنه \" فامضوا \" لأن السند غير متصل ; إذ إبراهيم النخعي لم يسمع عن عبد الله بن مسعود شيئا ، وإنما ورد \" فامضوا \" عن عمر رضي الله عنه . فإذا انفرد أحد بما [ ص: 93 ] يخالف الآية والجماعة كان ذلك نسيانا منه . والعرب مجمعة على أن السعي يأتي بمعنى المضي ; غير أنه لا يخلو من الجد والانكماش . قال زهير :سعى ساعيا غيظ بن مرة بعدما     تبزل ما بين العشيرة بالدمأراد بالسعي المضي بجد وانكماش ، ولم يقصد للعدو والإسراع في الخطو . وقال الفراء وأبو عبيدة : معنى السعي في الآية المضي . واحتج الفراء بقولهم : هو يسعى في البلاد يطلب فضل الله ; معناه هو يمضي بجد واجتهاد . واحتج أبو عبيدة بقول الشاعر :أسعى على جل بني مالك     كل امرئ في شأنه ساعيفهل يحتمل السعي في هذا البيت إلا مذهب المضي بالانكماش ; ومحال أن يخفى هذا المعنى على ابن مسعود على فصاحته وإتقان عربيته .قلت : ومما يدل على أنه ليس المراد هاهنا العدو قوله عليه الصلاة والسلام : \" إذا أقيمت الصلاة فلا تأتوها تسعون ، ولكن ائتوها وعليكم السكينة \" . قال الحسن : أما والله ما هو بالسعي على الأقدام ، ولقد نهوا أن يأتوا الصلاة إلا وعليهم السكينة والوقار ; ولكن بالقلوب والنية والخشوع . وقال قتادة : السعي أن تسعى بقلبك وعملك . وهذا حسن ، فإنه جمع الأقوال الثلاثة . وقد جاء في الاغتسال للجمعة والتطيب والتزين باللباس أحاديث مذكورة في كتب الحديث .السادسة : قوله تعالى : \" يا أيها الذين آمنوا \" خطاب للمكلفين بإجماع . ويخرج منه المرضى والزمنى والمسافرون والعبيد والنساء بالدليل ، والعميان والشيخ الذي لا يمشي إلا بقائد عند أبي حنيفة . روى أبو الزبير عن جابر أن رسول الله صلى الله عليه وسلم قال : \" من كان يؤمن بالله واليوم الآخر فعليه الجمعة يوم الجمعة إلا مريض أو مسافر أو امرأة أو صبي أو مملوك ، فمن استغنى بلهو أو تجارة استغنى الله عنه والله غني حميد \" خرجه الدارقطني وقال علماؤنا رحمهم الله : ولا يتخلف أحد عن الجمعة ممن عليه إتيانها إلا بعذر لا يمكنه منه الإتيان إليها ; مثل المرض الحابس ، أو خوف الزيادة في المرض ، أو خوف جور السلطان عليه في مال أو بدن دون [ ص: 94 ] القضاء عليه بحق . والمطر الوابل مع الوحل عذر إن لم ينقطع . ولم يره مالك عذرا له ; حكاه المهدوي . ولو تخلف عنها متخلف على ولي حميم له قد حضرته الوفاة ، ولم يكن عنده من يقوم بأمره رجا أن يكون في سعة . وقد فعل ذلك ابن عمر . ومن تخلف عنها لغير عذر فصلى قبل الإمام أعاد ، ولا يجزيه أن يصلي قبله . وهو في تخلفه عنها مع إمكانه لذلك عاص لله بفعله .السابعة : قوله تعالى : إذا نودي للصلاة يختص بوجوب الجمعة على القريب الذي يسمع النداء ، فأما البعيد الدار الذي لا يسمع النداء فلا يدخل تحت الخطاب . واختلف فيمن يأتي الجمعة من الداني والقاصي ، فقال ابن عمر وأبو هريرة وأنس : تجب الجمعة على من في المصر على ستة أميال . وقال ربيعة : أربعة أميال . وقال مالك والليث : ثلاثة أميال . وقال الشافعي : اعتبار سماع الأذان أن يكون المؤذن صيتا ، والأصوات هادئة ، والريح ساكنة وموقف المؤذن عند سور البلد . وفي الصحيح عن عائشة : أن الناس كانوا ينتابون الجمعة من منازلهم ومن العوالي فيأتون في الغبار ويصيبهم الغبار فتخرج منهم الريح ، فقال رسول الله صلى الله عليه وسلم : \" لو اغتسلتم ليومكم هذا \" . قال علماؤنا : والصوت إذا كان منيعا والناس في هدوء وسكون فأقصى سماع الصوت ثلاثة أميال . والعوالي من المدينة أقربها على ثلاثة أميال . وقال أحمد بن حنبل وإسحاق : تجب الجمعة على من سمع النداء . وروى الدارقطني من حديث عمرو بن شعيب عن أبيه عن جده عن رسول الله صلى الله عليه وسلم قال : \" إنما الجمعة على من سمع النداء \" . وقال أبو حنيفة وأصحابه : تجب على من في المصر ، سمع النداء أو لم يسمعه ، ولا تجب على من هو خارج المصر وإن سمع النداء . حتى سئل : وهل تجب الجمعة على أهل زبارة - بينها وبين الكوفة مجرى نهر - ؟ فقال : لا . وروي عن ربيعة أيضا : أنها تجب على من إذا سمع النداء وخرج من بيته ماشيا أدرك الصلاة . وقد روي عن الزهري : أنها تجب عليه إذا سمع الأذان .الثامنة : قوله تعالى : إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله دليل على أن الجمعة لا تجب إلا بالنداء ، والنداء لا يكون إلا بدخول الوقت ، بدليل قوله عليه [ ص: 95 ] الصلاة والسلام : \" إذا حضرت الصلاة فأذنا ثم أقيما وليؤمكما أكبركما \" قاله لمالك بن الحويرث وصاحبه . وفي البخاري عن أنس بن مالك أن النبي صلى الله عليه وسلم كان يصلي الجمعة حين تميل الشمس . وقد روي عن أبي الصديق وأحمد بن حنبل أنها تصلى قبل الزوال . وتمسك أحمد في ذلك بحديث سلمة بن الأكوع : كنا نصلي مع النبي صلى الله عليه وسلم ثم ننصرف وليس للحيطان ظل . وبحديث ابن عمر : ما كنا نقيل ولا نتغدى إلا بعد الجمعة . ومثله عن سهل . خرجه مسلم . وحديث سلمة محمول على التبكير . رواه هشام بن عبد الملك عن يعلى بن الحارث عن إياس بن سلمة بن الأكوع عن أبيه . وروى وكيع عن يعلى عن إياس عن أبيه قال : كنا نجمع مع رسول الله صلى الله عليه وسلم إذا زالت الشمس ثم نرجع نتتبع الفيء . وهذا مذهب الجمهور من الخلف والسلف ، وقياسا على صلاة الظهر . وحديث ابن عمر وسهل ، دليل على أنهم كانوا يبكرون إلى الجمعة تبكيرا كثيرا عند الغداة أو قبلها ، فلا يتناولون ذلك إلا بعد انقضاء الصلاة . وقد رأى مالك أن التبكير بالجمعة إنما يكون قرب الزوال بيسير . وتأول قول النبي صلى الله عليه وسلم : \" من راح في الساعة الأولى فكأنما قرب بدنة . . . \" الحديث بكماله - أنه كان في ساعة واحدة . وحمله سائر العلماء على ساعات النهار الزمانية الاثنتي عشرة ساعة المستوية أو المختلفة بحسب زيادة النهار ونقصانه . ابن العربي : وهو أصح ; لحديث ابن عمر رضي الله عنهما : ما كانوا يقيلون ولا يتغدون إلا بعد الجمعة لكثرة البكور إليها .[ ص: 96 ] التاسعة : فرض الله تعالى الجمعة على كل مسلم ; ردا على من يقول : إنها فرض على الكفاية ; ونقل عن بعض الشافعية . ونقل عن مالك من لم يحقق أنها سنة . وجمهور الأمة والأئمة أنها فرض على الأعيان ; لقول الله تعالى : إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله وذروا البيع . وثبت عن النبي صلى الله عليه وسلم أنه قال : \" لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم ثم ليكونن من الغافلين \" . وهذا حجة واضحة في وجوب الجمعة وفرضيتها . وفي سنن ابن ماجه عن أبي الجعد الضمري - وكانت له صحبة - قال : قال رسول الله صلى الله عليه وسلم : \" من ترك الجمعة ثلاث مرات تهاونا بها طبع الله على قلبه \" . إسناده صحيح . وحديث جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" من ترك الجمعة ثلاثا من غير ضرورة طبع الله على قلبه \" . ابن العربي : وثبت عن النبي صلى الله عليه وسلم أنه قال : \" الرواح إلى الجمعة واجب على كل مسلم \" .العاشرة : أوجب الله السعي إلى الجمعة مطلقا من غير شرط . وثبت شرط الوضوء بالقرآن والسنة في جميع الصلوات ; لقوله عز وجل : إذا قمتم إلى الصلاة فاغسلوا وجوهكم الآية . وقال النبي صلى الله عليه وسلم : \" لا يقبل الله صلاة بغير طهور \" . وأغربت طائفة فقالت : إن غسل الجمعة فرض . ابن العربي : وهذا باطل ; لما روى النسائي وأبو داود في سننهما أن النبي صلى الله عليه وسلم قال : \" من توضأ يوم الجمعة فبها ونعمت . ومن اغتسل فالغسل أفضل \" . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" من توضأ يوم الجمعة [ ص: 97 ] فأحسن الوضوء ثم راح إلى الجمعة فاستمع وأنصت غفر الله له ما بين الجمعة إلى الجمعة وزيادة ثلاثة أيام . ومن مس الحصى فقد لغا \" وهذا نص . وفي الموطأ : أن رجلا دخل يوم الجمعة وعمر بن الخطاب يخطب . . . - الحديث ، إلى أن قال : - ما زدت على أن توضأت ، فقال عمر : والوضوء أيضا ؟ وقد علمت أن رسول الله صلى الله عليه وسلم كان يأمر بالغسل . فأمر عمر بالغسل ولم يأمره بالرجوع ، فدل على أنه محمول على الاستحباب . فلم يمكن وقد تلبس بالفرض - وهو الحضور والإنصات للخطبة - أن يرجع عنه إلى السنة ، وذلك بمحضر فحول الصحابة وكبار المهاجرين حوالي عمر ، وفي مسجد النبي صلى الله عليه وسلم .الحادية عشرة : لا تسقط الجمعة لكونها في يوم عيد ، خلافا لأحمد بن حنبل فإنه قال : إذا اجتمع عيد وجمعة سقط فرض الجمعة ; لتقدم العيد عليها واشتغال الناس به عنها . وتعلق في ذلك بما روي أن عثمان أذن في يوم عيد لأهل العوالي أن يتخلفوا عن الجمعة . وقول الواحد من الصحابة ليس بحجة إذا خولف فيه ولم يجمع معه عليه . والأمر بالسعي متوجه يوم العيد كتوجهه في سائر الأيام . وفي صحيح مسلم عن النعمان بن بشير قال : كان رسول الله صلى الله عليه وسلم يقرأ في العيدين وفي الجمعة : ب سبح اسم ربك الأعلى و هل أتاك حديث الغاشية قال : وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضا في الصلاتين . أخرجه أبو داود والترمذي والنسائي وابن ماجه .الثانية عشرة : قوله تعالى : إلى ذكر الله أي الصلاة . وقيل الخطبة والمواعظ ; قاله [ ص: 98 ] سعيد بن جبير . ابن العربي : والصحيح أنه واجب في الجميع ; وأوله الخطبة . وبه قال علماؤنا ; إلا عبد الملك بن الماجشون فإنه رآها سنة . والدليل على وجوبها أنها تحرم البيع ولولا وجوبها ما حرمته ; لأن المستحب لا يحرم المباح . وإذا قلنا : إن المراد بالذكر الصلاة فالخطبة من الصلاة . والعبد يكون ذاكرا لله بفعله كما يكون مسبحا لله بفعله . الزمخشري : فإن قلت : كيف يفسر ذكر الله بالخطبة وفيها غير ذلك ؟ ! قلت : ما كان من ذكر رسول الله صلى الله عليه وسلم والثناء عليه وعلى خلفائه الراشدين وأتقياء المؤمنين والموعظة والتذكير فهو في حكم ذكر الله . فأما ما عدا ذلك من ذكر الظلمة وألقابهم والثناء عليهم والدعاء لهم ، وهم أحقاء بعكس ذلك ; فهو من ذكر الشيطان ، وهو من ذكر الله على مراحل .الثالثة عشرة : قوله تعالى : وذروا البيع منع الله عز وجل منه عند صلاة الجمعة ، وحرمه في وقتها على من كان مخاطبا بفرضها . والبيع لا يخلو عن شراء فاكتفى بذكر أحدهما ، كقوله تعالى : سرابيل تقيكم الحر وسرابيل تقيكم بأسكم . وخص البيع لأنه أكثر ما يشتغل به أصحاب الأسواق . ومن لا يجب عليه حضور الجمعة فلا ينهى عن البيع والشراء . وفي وقت التحريم قولان : إنه من بعد الزوال إلى الفراغ منها ، قاله الضحاك والحسن وعطاء . الثاني : من وقت أذان الخطبة إلى وقت الصلاة ، قاله الشافعي . ومذهب مالك أن يترك البيع إذا نودي للصلاة ، ويفسخ عنده ما وقع من ذلك من البيع في ذلك الوقت . ولا يفسخ العتق والنكاح والطلاق وغيره ، إذ ليس من عادة الناس الاشتغال به كاشتغالهم بالبيع . قالوا : وكذلك الشركة والهبة والصدقة نادر لا يفسخ . ابن العربي : والصحيح فسخ الجميع ، لأن البيع إنما منع منه للاشتغال به . فكل أمر يشغل عن الجمعة من العقود كلها فهو حرام شرعا مفسوخ ردعا . المهدوي : ورأى بعض العلماء البيع في الوقت المذكور جائزا ، وتأول النهي عنه ندبا ، واستدل بقوله تعالى : ذلكم خير لكم .قلت : وهذا مذهب الشافعي ; فإن البيع ينعقد عنده ولا يفسخ . وقال الزمخشري في تفسيره : إن عامة العلماء على أن ذلك لا يؤدي فساد البيع . قالوا : لأن البيع لم يحرم لعينه ، ولكن لما فيه من الذهول عن الواجب ; فهو كالصلاة في الأرض المغصوبة والثوب المغصوب ، والوضوء بماء مغصوب . وعن بعض الناس أنه فاسد .[ ص: 99 ] قلت : والصحيح فساده وفسخه ; لقوله عليه الصلاة والسلام : \" كل عمل ليس عليه أمرنا فهو رد \" . أي مردود . والله أعلم .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (9) هذه الآيات هي المقصود من السورة وما قبلها مقدمات وتوطئات لها كما ذكرناه آنفاً . وقد تقدم ما حكاه «الكشاف» من أن اليهود افتخروا على المسلمين بالسبت فشرع الله للمسلمين الجمعة . فهذا وجه اتصال هذه الآية بالآيات الأربع التي قبلها فكن لهذه الآية تمهيداً وتوطئة . اللام في قوله : { للصلاة } لام التعليل ، أي نادى مناد لأجل الصلاة من يوم الجمعة ، فعلم أن النداء هنا هو أذان الصلاة .والجمعة بضم الجيم وضم الميم في لغة جمهور العرب وهو لغة أهل الحجاز . وبنُو عُقَيْل بسكون الميم .والتعريف في { الصلاة } تعريف العهد وهي الصلاة المعروفة الخاصة بيوم الجمعة . وقد ثبتت شرعاً بالتواتر ثم تقررت بهذه الآية فصار دليل وجوبها في الكتاب والسنة المتواترة وإجماع الأمة .وكانت صلاةُ الجمعة مشروعة من أول أيام الهجرة . رُوي عن ابن سيرين أن الأنصار جمَّعوا الجمعة قبل أن يقدمَ النبي صلى الله عليه وسلم المدينة قالوا : إن لليهود يوماً يجتمعون فيه وللنصارى يوم مثل ذلك فتعالَوا فلنجتمع حتى نجعل يوماً لنا نذكر الله ونصلي فيه . وقالوا : إن لليهود السبت وللنصارى الأحد فاجعلوه يوم العَروبة . فاجتمعَوا إلى أسعدَ بننِ زُرَارةَ فصلى بهم يومئذٍ ركعتين وذكَّرهم .وروى البيهقي عن الزهري أن مُصْعَب بن عُمير كان أول من جَمَّع الجمعة بالمدينة قبل أن يقدمها رسول الله صلى الله عليه وسلم ويتعين أن يكون ذلك قد عَلم به النبي صلى الله عليه وسلم ولعلهم بلغهم عن النبي صلى الله عليه وسلم حديثُ فضل يوم الجمعة وأنه يوم المسلمين .فمشروعية صلاة الجمعة والتجميع فيه إجابة من الله تعالى رغبة المسلمين مثل إجابته رغبة النبي صلى الله عليه وسلم استقبال الكعبة المذكورة في قوله تعالى : { قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فولّ وجهك شطر المسجد الحرام } [ البقرة : 144 ] .وأما أول جمعة جمَّعها النبي صلى الله عليه وسلم فقال أهل السِيرَ : كانت في اليوم الخامس للهجرة لأن رسول الله قدم المدينة يومَ الاثنين لاثنتيْ عشرةَ ليلةً خلتْ من ربيع الأول فأقام بِقُبَاء ثم خرج يوم الجمعة إلى المدينة فأدركه وقتُ الجُمعة في بطن واد لبني سَالم بننِ عوف كان لهم فيه مسجد ، فجمَّع بهم في ذلك المسجد ، وخطب فيه أول خطبة خطبها بالمدينة وهي طويلة ذكر نصها القرطبي في «تفسيره» .وقولهم : «فأدركه وقت الجمعة» ، يدل على أن صلاة الجمعة كانت مشروعة يومئذٍ وأن النبي صلى الله عليه وسلم كان عازماً أن يصليها بالمدينة فضاق عليه الوقت فأداها في مسجد بني سالم ، ثم صلّى الجمعة القابلة في مسجده بالمدينة وكانت جمعة المسجد النبوي بالمدينة الثانيةَ بالأخبار الصحيحة .وأول جُمعة جُمِّعت في مسجد من مساجد بلاد الإِسلام بعدَ المدينة كانت في مسجد جُؤَاثاء من بلاد البحرين وهي مدينة الخَطّ قرية لعبد القيس .ولما ارتدت العرب بعد وفاة النبي صلى الله عليه وسلم ثبت أهل جُؤَاثاء على الإِسلام .وتقرر أن يوم الجمعة اليوم السابع من أيام الأسبوع في الإِسلام وهو الذي كان يسمّى في الجاهلية عَروبَة . قال بعض الأيمة : ولا تدخل عليه اللام . قال السهيلي : معنى العَروبة الراحة فيما بلغني عن بعض أهل العلم اه . قلت وذلك مروي عن ثعلب ، وهو قبل يوم السبت وقد كان يوم السبت عيدَ الأسبوع عند اليهود وهو آخر أيام الأسبوع . وقد فرضت عليهم الراحة فيه عن الشغل بنص التوراة فكانوا يبتدئون عدد أيام الأسبوع من يوم الأحد وهو الموالي للسبت وتبعهم العرب في ذلك لأسباب غير معروفة ولذلك سمّى العرب القدماءُ يوم الأحد أولَ .فأيام الأسبوع عند العرب في القديم هي : أوَّلُ ، أَهونُ جُبَار ، ( كغُراب وكِتاب ) ، دُبار ( كذلك ) ، مُؤيِس ( مهموزاً ) ، عَروبة ، شِيار ( بشين معجمة مكسورة بعدها تحتية مخففة ) .ثم أحدثوا أسماءَ لهذه الأيام هي : الأحد ، الإثنين ، الثُّلاثاء بفتح المثلثة الأولى وبضمها ، الإِرْبِعاء بكسر الهمزة وكسر الموحدة ، الخميس ، عَروبة أو الجمعة في قول بعضهم السَّبْت . وأصل السبت : القطع ، سمي سبتاً عند الإِسرائيليين لأنهم يقطعون فيه العمل ، وشاع ذلك الاسم عند العرب .وسمّوا الأيام الأربعة بعدهُ بأسماء مشتقة عن أسماء العدد على ترتيبها وليس في التوراة ذكر أسماء للأيام . وفي سفر التكوين منها «ذُكرت أيامُ بدء الخلق بأعدادها أولُ وثانٍ» الخ ، وأن الله لم يخلق شيئاً في اليوم الذي بعد اليوم السادس . وسمتْه التوراة سَبْتاً ، قال السهيلي : قيل أول من سَمى يوم عَروبة الجمعةَ كَعبُ بن لُؤَي جدُّ أبي قُصي . وكان قريش يجتمعون فيه إلى كعب قال : وفي قول بعضهم .  لم يسم يوم عروبة يوم الجمعة إلا مذ جاء الإِسلام .جعل الله يوم الجمعة للمسلمين عيدَ الأُسبوع فشرع لهم اجتماع أهل البلد في المسجد وسماعَ الخطبة ليعلَّموا ما يهمهم في إقامة شؤون دينهم وإصلاحهم .قال القفّال : ما جعل الله الناس أشرف العالم السفلي لم يُخْففِ عظم المنة وجلالة قدر موهبتِه لهم فأمرهم بالشكر على هذه الكرامة في يوم من الأيام السبعة ليكون في اجتماعهم في ذلك اليوم تنبيه على عظم ما أنعم الله به عليهم . ولكل أهل ملةٍ معروفة يومٌ من الأسبوع معظم ، فلليهود يوم السبت وللنصارى الأحد وللمسلمين يوم الجمعة . وقد قال النبي صلى الله عليه وسلم \" نحن الآخِرون \" ، أي آخر الدنيا السابقون يوم القيامة ( يوم القيامة يتعلق ب«السابقون» ) . بيدَ أنهم ( أي اليهود والنصارى ) أوتوا الكتاب من قبلنا ثم كان هذا اليومَ الذي اختلفوا فيه فهدَانَا الله إليه ، فالناس لنا فيه تبع اليهود غداً والنصارى بعد غد .ولما جُعل يوم الجمعة يوم شكر وتعظيم نعمة احتيج فيه إلى الاجتماع الذي تقع به شهرته فجُمِّعت الجماعات لذلك ، واحتيج فيه إلى الخطبة تذكيراً بالنعمة وحثّاً على استدامتها . ولما كان مدار التعظيم إنما هو على الصلاة جعلت الصلاة لهذا اليوم وسط النهار ليتم الاجتماع ولم تُجْز هذه الصلاة إلا في مسجد واحد ليكون أدعى الاجتماع اه . كلام القفال . وقول النبي صلى الله عليه وسلم « والنصارى بعد غد » ، إشارة إلى ما عمله النصارى بعد المسيح وبعدَ الحواريين من تعويض يوم السبت بيوم الأحد لأنهم زعموا أن يومَ الأحد فيه قام عيسى من قبره . فعوضوا الأحد عن يوم السبت بأمر من قُسطنطين سلطاننِ الروم في سنة 321 المسيحي . وصار دِيناً لهم بأمر أحبارهم .وصلاة الجمعة هي صلاة ظُهرِ يوم الجمعة ، وليست صلاةً زائدة على الصلوات الخمس فأُسقط من صلاة الظهر ركعتان لأجْل الخطبتين . روي عن عمر بن الخطاب أنه قال : وإنما قُصِّرت الجمعة لأجل الخطبة .وأحسب أن ذلك تخفيف على الناس إذ وجبت عليهم خطبتان مع الصلاة فكانت كل خطبة بمنزلة ركعةٍ وهذا سبب الجلوس بين الخطبتين للإِيماء إلى أنهما قائمتان مقام الركعتين ولذلك كان الجلوس خفيفاً . غير أن الخطبتين لم تعطيَا أحكام الركعتين فلا يضر فوات إحداهما أو فواتهما معاً ولا يجب على المسبوق تعويضهما ولا سجودٌ لنقصهما عند جمهور فقهاء الأمصار ، روي عن عطاء ومجاهد وطاووس : أن من فاتته الخطبة يوم الجمعة صلى أربعاً صلاة الظهر . وعن عطاء : أن من أدرك ركعة من صلاة الجمعة أضاف إليها ثلاث ركعات وهو أراد إن فاتته الخطبة وركعة من صلاة الجمعة .وجعلت القراءة في الصلاة جهراً مع أن شأن صلوات النهار إسرار القراءة لفائدة إسماع الناس سُوراً من القرآن كما أسمِعوا الخطبة فكانت صلاةَ إرشاد لأهل البلد في يوم من كل أسبوع .والإِجماع على أن صلاة الجمعة قائمة مقام صلاة الظهر في يوم الجمعة فمن صلاها لا يصلي معها ظهراً فأما من لم يصلِها لعذر أو لغيره فيجب عليه أن يصلي الظهر . ورأيت في الجامع الأموي في دمشق قَام إمام يصلي بجماعة ظُهراً بعد الفراغ من صلاة الجمعة وذلك بدعة .وإنما اختلف الأيمة في أصل الفرض في وقت الظهر يوم الجمعة فقال مالك والشافعي في آخر قوليه وأحمد وزُفَر من أصحاب أبي حنيفة : صلاة الجمعة المعروفة فرضُ وقت الزوال في يوم الجمعة وصلاة الظهر في ذلك اليوم لا تكون إلا بَدلاً عن صلاة الجمعة ، أي لمن لم يصل الجمعة لعذر ونحوه .وقال أبو حنيفة والشافعي في أول قوليه ( المرجوع عنه ) وأبو يوسف ومحمدٌ في رواية : الفرضُ بالأصل هو الظهر وصلاة الجمعة بَدل عن الظهر ، وهو الذي صححه فقهاء الحنفية .وقال محمد في رواية عنه : الفرض إحدى الصلاتين من غير تعيين والتعيينُ للمكلف فأشبه الواجبَ المخير ( لأن الواجب المخير لا يأثم فيه فاعل أحد الأمرين وتارك الجمعة بدون عذر آثم ) .قالوا : تظهر فائدة الخلاف في حُرَ مقيم صلّى الظهر في أول الوقت؛ فقال أبو حنيفة وأصحابه : له صلاة الظهر مطلقاً حتى لو خرج بعد أن صلّى الظهرَ أو لم يخرج لم يبطل فرضُه ، لكن عند أبي حنيفة يبطل ظُهره بمجرد السعي مطلقاً وعند صاحبيه لا يبطل ظُهره إلا إذا أدرك الجمعة .وقال مالك والشافعي : لا يجوز أن يصلّي الظهر يوم الجمعة سواء أدرك الجمعةَ أم لا ، خرج إليها أم لا ( يعني فإن أدرك الجمعة فالأمرُ ظاهر وإن لم يدركها وجب عليه أن يصلي ظهراً آخر ) .والنداء للصلاة : الأذان المعروف وهو أذان الظهر ورد في «الصحيح» عن السائب بن يزيد قال : كان النداء يوم الجمعة إذا جلس الإِمام على المنبر على عهد النبي صلى الله عليه وسلم وأبي بكر وعُمر . قال السائب بن يزيد : فلما كان عثمان وكثُر الناس بالمدينة زاد أذاناً على الزوراء ( الزوراء موضع بسوق المدينة ) . وربما وصف في بعض الرّوايات بالأذان الثاني . ومعنى كونه ثانياً أنه أذانٌ مكرِّر للأذان الأصلي فهو ثان في المشروعية ولا يريد أنه يؤذن به بعد الفراغ من الأذان الذي يؤذن به وقت جلوس الإِمام على المنبر ، أي يؤذن به في باب المسجد ، إذْ لم يكن للناس يومئذٍ صومعة ، وربما وقع في بعض الروايات وصفه بالنداء الثالث وإنما يُعنَى بذلك أنه ثالث بضميمه الأذان الأول . ولا يراد أن الناس يؤذنون أذانين في المسجد وإنما زاده عثمان ليُسمعَ النداءُ من في أطراف المدينة ، وربما سموه الأذان الأول .والذي يظهر من تحقيق الروايات أن هذا الأذان الثاني يؤذّن به عقب الأذان الأول ، لأن المقصود حضور الناس للصلاة في وقت واحد ووقع في بعض عبارات الروايات والرواة أنه كان يؤذن بأذان الزوراء أولاً ثم يخرج الإِمام فيؤذن بالأذان بَين يديه .قال ابن العربي في «العارضة» : «لما كثر الناس في زمن عثمان زاد النداءَ على الزوراء ليشعر الناس بالوقت فيأخذوا بالإِقبال إلى الجمعة ثم يخرج عثمان فإذا جلس على المنبر أُذِّن الثاني الذي كان أولاً على عهد رسول الله صلى الله عليه وسلم ثم يخطب . ثم يؤذَّن الثالث يعني به الإِقامة» اه .وقال في «الأحكام» : «وسمّاه في الحديث ( أي حديثثِ السائب بن يزيد ) ثالثاً لأنه أضافه إلى الإِقامة فجعله ثالثَ الإِقامة ، ( أي لأنه أحدث بعد أن كانت الإِقامة مشروعة وسمّى الإِقامة أذاناً مشاكلة أو لأنها إيذان بالدخول في الصلاة ) كما قال النبي صلى الله عليه وسلم \" بينَ كل أذانَيْن صلاةٌ لمن شاء \"يعني بين الأذان والإِقامة ، فتوهم الناس أنه أذانٌ أصْليّ فجعلوا الأذانات ثلاثة فكان وهَماً . ثم جمعوهم في وقت واحد فكان وهَماً على وهَم اه . فتوهم كثير من أهل الأمصار أن الأذان لصلاة الجمعة ثلاث مرات لهذا تراهم يؤذنون في جوامع تونس ثلاثة أذانات وهو بدعة .قال ابن العربي في «العارضة» : فأما بالمَغْرب ( أي بلاد المغرب ) فيؤذن ثلاثة من المؤذنين لجهل المفتين قال في «الرسالة» : «وهذا الأذان الثاني أحدثه بنو أمية» فوصفه بالثاني وهو التحقيق ، ولكنه نسبه إلى بني أمية لعدم ثبوت أن الذي زاده عثمان ، ورواه البخاري وأهل السنن عن السائب بن يزيد ولم يروه مسلم ولا مالك في «الموطأ» .والسبب في نسبته إلى بني أمية : أن علي بن أبي طالب لما كان بالكوفة لم يُؤذّن للجمعة إلا أذاناً واحداً كما كان في زمن النبي صلى الله عليه وسلم وألغى الأذان الذي جعله عثمان بالمدينة . فلعل الذي أرجع الأذان الثاني بعضُ خلفاء بني أمية قال مالك في «المجموعة» : إن هشام بن عبد الملك أحدث أذاناً ثانياً بين يَدَيه في المسجد .واعلم أن النداء الذي نيط به الأمر بالسعي في هذه الآية هو النداء الأول ، وما كان النداء الثاني إلا تبليغاً للأذان لمن كان بعيداً فيجب على من سمعه السعي إلى الجمعة للعلم بأنه قد نُودي للجمعة .والسعي : أصله الاشتداد في المشي . وأطلق هنا على المشي بحرص وتوقي التأخر مجازاً .و { ذِكر الله } فُسر بالصلاة وفُسر بالخطبة ، بهذا فسره سعيد بن المسيب وسعيد بن جبير . قال أبو بكر بن العربي «والصحيح أنه الجميع أوله الخطبة» .\n","ar.waseet":"وبعد هذا التوبيخ والتحدى لليهود الذين زعموا أنهم أولياء لله من دون الناس . . . وجه - سبحانه - للمؤمنين نداء أمرهم فيه بالمسارعة إلى أداء فرائضه ونهاهم عن أن تشغلهم دنياهم عن ذكره وطاعته ، فقال - تعالى - : ( ياأيها الذين آمنوا . . . ) .المقصود بالنداء فى قوله - سبحانه - : ( ياأيها الذين آمنوا إِذَا نُودِيَ لِلصَّلاَةِ . . . ) جميع المكلفين بها ، الذين يجب عليهم أداؤها . .وناداهم - سبحانه - بصفة الإيمان ، لتحريك حرارة الإيمان فى قلوبهم ، ولتحريضهم على المسارعة إليها ، إذ من شأن المؤمن القوى ، أن يكون مطيعا لما يأمره خالقه به .والمراد بالنداء : الأذان والإعلام بوقت حلولها .والمقصود بالصلاة المنادى لها هنا : صلاة الجمعة ، بدليل قوله - تعالى - : ( مِن يَوْمِ الجمعة ) .واللام فى قوله ( لِلصَّلاَةِ ) للتعليل ، و ( مِن ) بمعنى فى ، أو للبيان ، أو للتبعيض ، لأن يوم الجمعة زمان ، تقع فيه أعمال ، منها الصلاة المعهودة فيه وهى صلاة الجمعة لأن الأمر بترك البيع خاص بها ، لوجود الخطبة فيها .وقوله : ( فاسعوا . . . ) جواب الشرط ، من السعى ، وهو المشى السريع .والمراد به هنا : المشى المتوسط بوقار وسكينة ، وحسن تهيؤ لصلاة الجمعة . . .قال الآلوسى ما ملخصه : قوله : ( فاسعوا إلى ذِكْرِ الله ) أى : امشوا إليه بدون إفراط فى السرعة . . .فقد أخرج الستة فى كتبهم عن أبى سلمة من حديث أبى هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا أقيمت الصلاة فلا تأتوها وأنتم تسعون ، وأتوها وأنتم تمشون ، وعليكم السكينة ، فما أدركتم فصلوا ، وما فاتكم فأتموا \" .والمراد بذكر الله : الخطبة والصلاة جميعا ، لاشتمالهما عليه ، واستظهر بعضهم أن المراد به الصلاة ، وقصره بعضهم على الخطبة . .وإنما عبر - سبحانه - بالسعى لتضمنه معنى زائدا على المشى ، وهو الجد والحرص على التبكير ، وعلى توقى التأخير .والمعنى : يامن آمنتم بالله حق الإيمان ، إذا نادى المنادى لأجل الصلاة فى يوم الجمعة ، فامضوا إليها بجد ، وإخلاص نية ، وحرص على الانتفاع بما تسمعونه من خطبة الجمعة ، التى هى لون من ألوان ذكر الله - تعالى - وطاعته .والأمر فى قوله - سبحانه - : ( فاسعوا إلى ذِكْرِ الله وَذَرُواْ البيع . . ) الظاهر أنه للوجوب ، لأن الأمر يقتضى الوجوب ، ما لم يوجد له صارف عن ذلك ، ولا صارف له هنا .والمراد من البيع هنا : المعاملة بجميع أنواعها ، فهو يعم البيع والشراء وسائر أنواع المعاملات .أى : إذا نودى للصلاة من يوم الجمعة ، فاخرجوا إليها بحرص وسكينة ووقار . واتركوا المعاملات الدنيوية من بيع ، وشراء ، وإجارة ، وغيرها .وإنما قال - سبحانه - : ( وَذَرُواْ البيع . . ) لأنه أهم أنواع المعاملات ، فهو من باب التعبير عن الشىء بأهم أجزائه .واسم الإشارة فى قوله - سبحانه - : ( ذَلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ ) يعود إلى ما سبق ذكره من الأمر بالسعى إلى ذكر الله ، متى نودى للصلاة ، وترك الاشتغال بالبيع وما يشبهه .أى : ذلك الذى أمرتكم به من السعى إلى ذكر الله عند النداء للصلاة من يوم الجمعة ، ومن ترك أعمالكم الدنيوية .. . خير لكم مما يحصل لكم من رزق فى هذه الأوقات ، عن طريق البيع أو الشراء أو غيرهما .فالمفضل عليه محذوف ، لدلالة الكلام عليه ، والمفضل هو السعى إلى ذكر الله - تعالى - .وهذا التفضيل باعتبار أن منافع السعى إلى ذكر الله - تعالى - باقية دائمة ، أما المنافع الدنيوة فهى زائلة فانية .وجواب الشرط فى قوله ( إِن كُنتُمْ تَعْلَمُونَ ) محذوف : أى : إن كنتم تعلمون ما هو خير لكم ، فاسعوا إلى ذكر الله عند النداء للصلاة ، واتركوا البيع والشراء .أو إن كنتم من أهل العلم والفقه السليم للأمور ، عرفتم أن امتثال أمر الله - تعلى - بأن تسعوا ، إلى ذكره عند النداء لصلاة الجمعة ، خير لكم من الاشتغال فى هذا الوقت بالبيع والشراء .إذ فى هذا الامتثال سعادتكم ونجاتكم من خزى الدنيا وعذاب الآخرة .\n","ar.baghawi":"قوله - عز وجل - : ( ياأيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة ) أي في يوم الجمعة كقوله : \" أروني ماذا خلقوا من الأرض أي في الأرض \" [ أي في الأرض ] وأراد بهذا النداء الأذان عند قعود الإمام على المنبر للخطبة .أخبرنا عبد الواحد المليحي أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا آدم ، حدثنا ابن أبي ذئب ، عن الزهري عن السائب بن يزيد قال : كان النداء يوم الجمعة أوله إذا جلس الإمام على المنبر على عهد النبي - صلى الله عليه وسلم - وأبي بكر وعمر ، فلما كان عثمان وكثر الناس زاد النداء الثاني على الزوراء قرأ الأعمش : \" من يوم الجمعة \" بسكون الميم ، وقرأ العامة بضمها .واختلفوا في تسمية هذا اليوم جمعة ، منهم من قال : لأن الله تعالى جمع فيه خلق آدم عليه السلام . وقيل : لأن الله تعالى فرغ من خلق الأشياء فاجتمعت فيه المخلوقات . وقيل : لاجتماع الجماعات فيه . وقيل : لاجتماع الناس فيها للصلاة .وقيل : أول من سماها جمعة كعب بن لؤي قال أبو سلمة : أول من قال \" أما بعد \" كعب بن لؤي وكان أول من سمى الجمعة جمعة ، وكان يقال له يوم العروبة .وعن ابن سيرين قال : جمع أهل المدينة قبل أن يقدم النبي - صلى الله عليه وسلم - المدينة . وقبل أن ينزل الجمعة وهم الذين سموها الجمعة . وقالوا : لليهود يوم يجتمعون فيه كل سبعة أيام ، وللنصارى يوم ، فهلم فلنجعل يوما نجتمع فيه ، فنذكر الله ونصلي فيه ، فقالوا : يوم السبت لليهود ، ويوم الأحد للنصارى ، فاجعلوه يوم العروبة ، فاجتمعوا إلى أسعد بن زرارة فصلى بهم ركعتين وذكرهم فسموه يوم الجمعة ، ثم أنزل الله - عز وجل - في ذلك بعد .وروي عن عبد الرحمن بن كعب بن مالك عن أبيه كعب ، أنه كان إذا سمع النداء يوم الجمعة ترحم لأسعد بن زرارة ، فقلت له : إذا سمعت النداء ترحمت لأسعد بن زرارة ؟ قال : لأنه أول من جمع بنا في هزم النبيت من حرة بني بياضة في بقيع يقال له بقيع الخضمات ، قلت له : كم كنتم يومئذ ؟ قال : أربعون وأول جمعة جمعها رسول الله - صلى الله عليه وسلم - بأصحابه على ما ذكر أهل السير : أن النبي - صلى الله عليه وسلم - لما قدم المدينة مهاجرا نزل قباء على بني عمرو بن عوف ، وذلك يوم الاثنين لثنتي عشرة [ ليلة ] خلت من شهر ربيع الأول حين امتد الضحى ، فأقام بقباء يوم الاثنين والثلاثاء والأربعاء ويوم الخميس ، وأسس مسجدهم ، ثم خرج من بين أظهرهم يوم الجمعة عامدا المدينة ، فأدركته صلاة الجمعة في بني سالم بن عوف في بطن واد لهم ، وقد اتخذ اليوم في ذلك الموضع مسجدا ، فجمع هناك وخطبقوله - عز وجل - : ( فاسعوا إلى ذكر الله ) أي : فامضوا إليه واعملوا له ، وليس المراد من السعي الإسراع ، إنما المراد منها العمل والفعل ، كما قال : \" وإذا تولى سعى في الأرض \" ( البقرة - 205 ) وقال : \" إن سعيكم لشتى \" ( الليل - 4 ) .وكان عمر بن الخطاب يقرأ : فامضوا إلى ذكر الله ، وكذلك هي في قراءة عبد الله بن مسعود . وقال الحسن : أما والله ما هو بالسعي على الأقدام ، ولقد نهوا أن يأتوا الصلاة إلا وعليهم السكينة والوقار ، ولكن بالقلوب والنية والخشوعوقال قتادة في هذه الآية : \" فاسعوا إلى ذكر الله \" قال : فالسعي أن تسعى بقلبك وعملك وهو المشي إليها وكان يتأول قوله : \" فلما بلغ معه السعي \" ( الصافات - 102 ) يقول فلما مشى معه .أخبرنا الإمام أبو [ علي ] الحسين بن محمد القاضي ، أخبرنا أبو بكر أحمد بن الحسن الحيري ، أخبرنا محمد بن أحمد بن معقل الميداني ، حدثنا محمد بن يحيى ، حدثنا عبد الرزاق ، أخبرنا معمر ، عن الزهري عن ابن المسيب ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا أقيمت الصلاة فلا تأتوها تسعون ، ولكن ائتوها تمشون وعليكم السكينة [ والوقار ] فما أدركتم فصلوا وما فاتكم فأتموها \" قوله ( إلى ذكر الله ) أي إلى الصلاة ، وقال سعيد بن المسيب : \" فاسعوا إلى ذكر الله \" قال هو موعظة الإمام ( وذروا البيع ) يعني البيع والشراء لأن اسم البيع يتناولهما جميعا . وإنما يحرم البيع والشراء عند الأذان الثاني وقال الزهري : عند خروج الإمام . وقال الضحاك : إذا زالت الشمس حرم البيع والشراء ( ذلكم ) الذي ذكرت من حضور الجمعة وترك البيع ، ( خير لكم ) من المبايعة ( إن كنتم تعلمون ) مصالح أنفسكم . واعلم أن صلاة الجمعة من فروض الأعيان ، فتجب على كل من جمع العقل ، والبلوغ ، والحرية والذكورة والإقامة إذا لم يكن له عذر . ومن تركها استحق الوعيد .وأما الصبي والمجنون فلا جمعة عليهما ، لأنهما ليسا من أهل أن يلزمهما فرض الأبدان لنقصان أبدانهما ، ولا جمعة على النساء بالاتفاق :أخبرنا عبد الوهاب بن محمد الخطيب ، أخبرنا عبد العزيز بن أحمد الخلال ، أخبرنا أبو العباس الأصم ، أخبرنا الربيع ، أخبرنا الشافعي ، أخبرنا إبراهيم بن محمد ، حدثني سلمة بن عبد الله الخطمي عن محمد بن كعب أنه سمع رجلا من بني وائل يقول : قال النبي - صلى الله عليه وسلم - : \" تجب الجمعة على كل مسلم إلا امرأة أو صبيا أو مملوكا \" وذهب أكثرهم إلى أنه لا جمعة على العبيد . وقال الحسن وقتادة والأوزاعي : تجب على العبد المخارج ، ولا تجب على المسافر عند الأكثرين .وقال النخعي والزهري : تجب على المسافر إذا سمع النداء ، وكل من له عذر من مرض أو تعهد مريض أو خوف ، جاز له ترك الجمعة ، وكذلك له تركها بعذر المطر والوحل .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل [ حدثنا مسدد حدثنا إسماعيل ] أخبرني عبد الحميد صاحب الزيادي ، حدثنا عبد الله بن الحارث بن عمر ، حدثنا محمد بن سيرين قال ابن عباس لمؤذنه في يوم مطير : إذا قلت : أشهد أن محمدا رسول الله ، فلا تقل : حي على الصلاة . قل : صلوا في بيوتكم . فكأن الناس استنكروا فقال : فعله من هو خير مني إن الجمعة عزمة ، وإني كرهت أن أخرجكم فتمشوا في الطين والدحض .وكل من لا يجب عليه حضور الجمعة ، فإذا حضر وصلى مع الإمام [ الجمعة ] سقط عنه فرض الظهر ، ولكن لا يكمل به عدد الجمعة إلا صاحب العذر ، فإنه إذا حضر يكمل به العدد . أخبرنا الإمام أبو الحسن عبد الرحمن بن محمد الداودي ، أخبرنا أبو محمد عبد الله بن أحمد بن حمويه السرخسي في سنة إحدى وثمانين وثلثمائة ، أخبرنا عيسى بن عمر بن العباس السمرقندي ، حدثنا أبو محمد عبد الله بن عبد الرحمن الدارمي السمرقندي ، أخبرنا يحيى بن حسان حدثنا معاوية بن سلام ، أخبرني زيد بن سلام أنه سمع أبا سلام يقول حدثني الحكم بن مينا أن ابن عمر حدثه وأبا هريرة أنهما سمعا رسول الله - صلى الله عليه وسلم - وهو على أعواد منبره : \" لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم ثم ليكونن من الغافلين \"أخبرنا أبو عثمان الضبي ، أخبرنا أبو محمد الجراحي ، حدثنا أبو العباس المحبوبي ، حدثنا أبو عيسى الترمذي ، حدثنا علي بن خشرم ، أخبرنا عيسى بن يونس ، عن محمد بن عمرو عن عبيدة بن سفيان ، عن أبي الجعد يعني الضميري قال : قال رسول الله - صلى الله عليه وسلم - : \" من ترك الجمعة ثلاث مرات تهاونا بها طبع الله على قلبه \"واختلف أهل العلم في موضع إقامة الجمعة ، وفي العدد الذي تنعقد به الجمعة ، وفي المسافة التي يجب أن يؤتى منها : أما الموضع : فذهب قوم إلى أن كل قرية اجتمع فيها أربعون رجلا من أهل الكمال ، بأن يكونوا أحرارا عاقلين [ بالغين ] مقيمين لا يظعنون عنها شتاء ولا صيفا إلا ظعن حاجة ، تجب عليهم إقامة الجمعة فيها . وهو قول عبيد الله بن عبد الله ، وعمر بن عبد العزيز وبه قال الشافعي وأحمد وإسحاق . وقالوا : لا تنعقد الجمعة بأقل من أربعين رجلا على هذه الصفة ، وشرط عمر بن عبد العزيز مع عدد الأربعين أن يكون فيهم وال ، والوالي غير شرط عند الشافعي . وقال علي : لا جمعة إلا في مصر جامع وهو قول أصحاب الرأي .ثم عند أبي حنيفة ، رضي الله عنه تنعقد بأربعة ، والوالي شرط وقال الأوزاعي وأبو يوسف : تنعقد بثلاثة إذا كان فيهم وال . وقال الحسن وأبو ثور : تنعقد باثنين كسائر الصلوات . وقال ربيعة : تنعقد باثني عشر رجلا . والدليل على جواز إقامتها في القرى ما : أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا محمد بن المثنى ، أخبرنا أبو عامر العقدي ، حدثنا إبراهيم بن طهمان ، عن أبي حمزة الضبعي عن ابن عباس قال : إن أول جمعة جمعت بعد جمعة في مسجد رسول الله - صلى الله عليه وسلم - في مسجد عبد القيس بجواثى من البحرينوإذا كان الرجل مقيما في قرية لا تقام فيها الجمعة ، أو كان مقيما في برية ، فذهب قوم إلى أنه إن كان يبلغهم النداء من موضع الجمعة يلزمهم حضور الجمعة ، وإن كان لا يبلغهم النداء فلا جمعة عليهم . وهو قول الشافعي وأحمد وإسحاق . والشرط أن يبلغهم نداء مؤذن جهوري الصوت يؤذن في وقت تكون الأصوات فيه هادئة والرياح ساكنة ، وكل قرية تكون في موضع الجمعة في القرب على هذا القدر يجب على أهلها حضور الجمعة .وقال سعيد بن المسيب : تجب على كل من آواه المبيت . وقال الزهري : تجب على من كان على ستة أميال . وقال ربيعة : على أربعة أميال . وقال مالك والليث : على ثلاثة أميال . وقال أبو حنيفة رضي الله عنه : لا جمعة على أهل السواد قريبة كانت القرية أو بعيدة .وكل من تلزمه صلاة الجمعة لا يجوز له أن يسافر يوم الجمعة بعد الزوال قبل أن يصلي الجمعة ، وجوز أصحاب الرأي أن يسافر بعد الزوال إذا كان يفارق البلد قبل خروج الوقت .أما إذا سافر قبل الزوال بعد طلوع الفجر فيجوز ، غير أنه يكره إلا أن يكون سفره سفر طاعة من حج أو غزو ، وذهب بعضهم إلى أنه إذا أصبح يوم الجمعة مقيما فلا يسافر حتى يصلي الجمعة ، والدليل على جوازه ما :أخبرنا أبو عثمان الضبي ، أخبرنا أبو محمد الجراحي ، أخبرنا أبو العباس المحبوبي ، أخبرنا أبو عيسى ، حدثنا أحمد بن منيع ، حدثنا أبو معاوية عن الحجاج عن الحكم عن مقسم عن ابن عباس قال : بعث النبي - صلى الله عليه وسلم - عبد الله بن رواحة في سرية فوافق ذلك يوم الجمعة ، فغدا أصحابه ، وقال : أتخلف فأصلي مع رسول الله - صلى الله عليه وسلم - ثم ألحقهم ، فلما صلى مع النبي - صلى الله عليه وسلم - رآه فقال : ما منعك أن تغدو مع أصحابك ؟ قال : أردت أن أصلي معك ثم ألحقهم ، فقال : \" لو أنفقت ما في الأرض جميعا ما أدركت فضل غدوتهم \" وروي أن عمر بن الخطاب رضي الله عنه سمع رجلا عليه هيئة السفر يقول : لولا أن اليوم يوم الجمعة لخرجت ، فقال عمر : اخرج فإن الجمعة لا تحبس عن سفروقد ورد أخبار في سنن يوم الجمعة وفضله منها : ما أخبرنا أبو الحسن محمد بن محمد السرخسي ، أخبرنا زاهر بن أحمد الفقيه ، أخبرنا أبو إسحاق إبراهيم بن عبد الصمد الهاشمي ، أخبرنا أبو مصعب ، عن مالك عن يزيد بن عبد الله بن الهاد ، عن محمد بن إبراهيم بن الحارث التيمي عن أبي سلمة بن عبد الرحمن ، عن أبي هريرة أنه قال : خرجت إلى [ الطور ] فلقيت كعب الأحبار ، فجلست معه فحدثني عن التوراة ، وحدثته عن رسول الله - صلى الله عليه وسلم - ، فكان فيما حدثته أن قلت له : قال رسول الله - صلى الله عليه وسلم - : \" خير يوم طلعت عليه الشمس يوم الجمعة فيه خلق آدم ، وفيه أهبط وفيه تيب عليه ، وفيه مات وفيه تقوم الساعة وما من دابة إلا وهي مصيخة يوم الجمعة من حين تصبح حين تطلع الشمس شفقا من الساعة إلا الجن والإنس وفيه ساعة لا يصادفها عبد مسلم وهو يصلي يسأل الله شيئا إلا أعطاه إياه \" قال كعب : ذلك في كل سنة يوم ، فقلت : بل في كل جمعة ، قال : فقرأ كعب التوراة فقال : صدق رسول الله - صلى الله عليه وسلم - . قال أبو هريرة : ثم لقيت عبد الله بن سلام فحدثته بمجلسي مع كعب الأحبار وما حدثته في يوم الجمعة ، فقال عبد الله بن سلام : قد علمت أية ساعة هي ، هي آخر ساعة في يوم الجمعة ، قال أبو هريرة : وكيف تكون آخر ساعة في يوم الجمعة ! وقد قال رسول الله - صلى الله عليه وسلم - : \" لا يصادفها عبد مسلم وهو يصلي \" وتلك ساعة لا يصلى فيها ؟ فقال عبد الله بن سلام : ألم يقل رسول الله - صلى الله عليه وسلم - من جلس مجلسا ينتظر الصلاة فهو في صلاة حتى يصليها ؟ قال أبو هريرة : بلى ، قال : فهو ذاك .أخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب عن مالك ، عن نافع ، عن عبد الله بن عمر أن رسول الله - صلى الله عليه وسلم - قال : \" إذا جاء أحدكم الجمعة فليغتسل \"أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، حدثنا محمد بن يوسف ، أخبرنا محمد بن إسماعيل ، حدثنا آدم ، حدثنا ابن أبي ذئب ، عن سعيد المقبري ، أخبرني أبي عن عبد الله بن وديعة عن سلمان الفارسي قال : قال رسول الله - صلى الله عليه وسلم - : \" لا يغتسل رجل يوم الجمعة ويتطهر ما استطاع من طهر ، ويدهن من دهنه ، أو يمس من طيب بيته ، ثم يخرج فلا يفرق بين اثنين ، ثم يصلي ما كتب له ، ثم ينصت إذا تكلم الإمام إلا غفر له ما بينه وبين الجمعة الأخرى \" .أخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور محمد بن محمد بن سمعان ، حدثنا أبو جعفر محمد بن أحمد بن عبد الجبار الرياني ، حدثنا حميد بن زنجويه ، حدثنا أحمد بن خالد ، حدثنا محمد بن إسحاق ، عن محمد بن إبراهيم ، عن أبي سلمة بن عبد الرحمن وعن أبي أمامة يعني سهل بن حنيف حدثاه عن أبي سعيد وعن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : \" من اغتسل يوم الجمعة واستن ومس من طيب إن كان عنده ولبس من أحسن ثيابه ثم خرج حتى يأتي المسجد ، فلم يتخط رقاب الناس ثم ركع ما شاء الله أن يركع ، وأنصت إذا خرج الإمام كانت كفارة ما بينها وبين الجمعة التي كانت قبلها \" قال أبو هريرة : وزيادة ثلاثة أيام لأن الله تعالى يقول : \" من جاء بالحسنة فله عشر أمثالها \" ( الأنعام - 160 ) .أخبرنا أبو طاهر عمر بن عبد العزيز القاشاني ، أخبرنا أبو القاسم بن جعفر الهاشمي ، أخبرنا أبو علي محمد بن أحمد بن عمر اللؤلؤي ، حدثنا أبو داود سليمان بن الأشعث السجستاني ، حدثنا محمد بن حاتم الجرجرائي ، حدثنا ابن المبارك عن الأوزاعي ، حدثني حسان بن عطية ، حدثني أبو الأشعث الصنعاني ، حدثني أوس بن أوس الثقفي قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من غسل يوم الجمعة واغتسل ثم بكر وابتكر ومشى ولم يركب ، ودنا من الإمام واستمع ، ولم يلغ كان له بكل خطوة عمل سنة أجر صيامها وقيامها \" أخبرنا عبد الوهاب بن محمد الخطيب ، أخبرنا عبد العزيز بن أحمد الخلال ، حدثنا أبو العباس الأصم ، أخبرنا الربيع ، أخبرنا الشافعي ، أخبرنا سفيان ، عن الزهري عن سعيد بن المسيب ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا كان يوم الجمعة كان على كل باب من أبواب المسجد ملائكة يكتبون الناس على منازلهم الأول فالأول فإذا خرج الإمام طويت الصحف واستمعوا الخطبة والمهجر إلى الصلاة كالمهدي بدنة ، ثم الذي يليه كالمهدي بقرة ، ثم الذي يليه كالمهدي شاة ثم الذي يليه كالمهدي كبشا حتى ذكر الدجاجة والبيضة \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5186.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5186.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5186.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ","transliteration":"Fa-izaa qudiyatis Salaatu fantashiroo fil ardi wabtaghoo min fadlil laahi wazkurul laaha kaseeral la'allakum tuflihoon","translations":{"en.ahmedali":"And when the service of prayer is over spread out in the land, and look for the bounty of God. and remember God a great deal that you may prosper.","en.ahmedraza":"And when the prayer ends, spread out in the land and seek Allah’s munificence, and profusely remember Allah, in the hope of attaining success.","en.arberry":"Then, when the prayer is finished, scatter in the land and seek God's bounty, and remember God frequently; haply you will prosper.","en.asad":"And when the prayer is ended, disperse freely on earth and seek to obtain [something] of God's bounty; but remember God often, so that you might attain to a happy state!","en.daryabadi":"Then, when the prayer is ended, disperse in the land and seek of Allah's grace, and remember Allah much, that haply ye may thrive.","en.hilali":"Then when the (Jumu'ah) Salat (prayer) is finished, you may disperse through the land, and seek the Bounty of Allah (by working, etc.), and remember Allah much, that you may be successful.","en.pickthall":"And when the prayer is ended, then disperse in the land and seek of Allah's bounty, and remember Allah much, that ye may be successful.","en.qaribullah":"Then, when the prayer has ended, disperse in the land and seek the favor of Allah, and, remember Allah often, so that you prosper.","en.sahih":"And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah, and remember Allah often that you may succeed.","en.sarwar":"When the prayer ends, disperse through the land and seek the favor of God. Remember Him often so that perhaps you will have everlasting happiness.","en.yusufali":"And when the Prayer is finished, then may ye disperse through the land, and seek of the Bounty of Allah: and celebrate the Praises of Allah often (and without stint): that ye may prosper.","en.maududi":"But when the Prayer is ended, disperse in the land and seek Allah's Bounty, and remember Allah much so that you may prosper.","en.shakir":"But when the prayer is ended, then disperse abroad in the land and seek of Allah's grace, and remember Allah much, that you may be successful.","en.itani":"Then, when the prayer is concluded, disperse through the land, and seek God’s bounty, and remember God much, so that you may prosper.","en.mubarakpuri":"Then when the Salah is complete, you may disperse through the land, and seek the bounty of Allah, and remember Allah much, that you may be successful.","en.qarai":"And when the prayer is finished disperse through the land and seek Allah’s grace, and remember Allah much so that you may be felicitous.","en.wahiduddin":"When the prayer is ended, disperse in the land and seek to obtain [something] of God's bounty; and remember God much, so that you may prosper."},"tafsir":{"ar.muyassar":"فإذا سمعتم الخطبة، وأدَّيتم الصلاة، فانتشروا في الأرض، واطلبوا من رزق الله بسعيكم، واذكروا الله كثيرًا في جميع أحوالكم؛ لعلكم تفوزون بخيري الدنيا والآخرة.","ar.jalalayn":"«فإذا قضيت الصلاة فانتشروا في الأرض» أمر إباحة «وابتغوا» اطلبوا الرزق «من فضل الله واذكروا الله» ذكرا «كثيرا لعلكم تفلحون» تفوزون، كان صلى الله عليه وسلم يخطب يوم الجمعة فقدمت عير وضرب لقدومها الطبل على العادة فخرج لها الناس من المسجد إلا اثني عشر رجلا فنزلت.","ar.qurtubi":"قوله تعالى : فإذا قضيت الصلاة فانتشروا في الأرض وابتغوا من فضل الله واذكروا الله كثيرا لعلكم تفلحون قوله تعالى : فإذا قضيت الصلاة فانتشروا في الأرض هذا أمر إباحة ; كقوله تعالى : وإذا حللتم فاصطادوا . يقول : إذا فرغتم من الصلاة فانتشروا في الأرض للتجارة والتصرف في حوائجكم .\" وابتغوا من فضل الله \" أي من رزقه . وكان عراك بن مالك إذا صلى الجمعة انصرف فوقف على باب المسجد فقال : اللهم إني أجبت دعوتك ، وصليت فريضتك ، وانتشرت كما أمرتني ، فارزقني من فضلك وأنت خير الرازقين . وقال جعفر بن محمد في قوله تعالى : وابتغوا من فضل الله إنه العمل في يوم السبب . وعن الحسن بن سعيد بن المسيب : طلب العمل . وقيل : التطوع . وعن ابن عباس : لم يؤمروا بطلب شيء من الدنيا ; إنما هو عيادة المرضى ، وحضور الجنائز ، وزيارة الأخ في الله تعالى .قوله تعالى : واذكروا الله كثيرا أي بالطاعة واللسان ، وبالشكر على ما به أنعم عليكم من التوفيق لأداء الفرائض .لعلكم تفلحون كي تفلحوا . قال سعيد بن جبير : الذكر طاعة الله تعالى ، فمن أطاع الله فقد ذكره ومن لم يطعه فليس بذاكر وإن كان كثير التسبيح . وقد مضى هذا مرفوعا في \" البقرة \" .\n","ar.miqbas":"فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ (10)قلت : وإيثار { ذكر الله } هنا دون أن يقول : إلى الصلاة ، كما قال : { فإذا قضيت الصلاة } لتتأتى إرادة الأمرين الخطبة والصلاة . وفيه دليل على وجوب الخطبة في صلاة الجمعة وشرطيته على الجملة . وتفصيل أحكام التخلف عن الخطبة ليست مساوية للتخلف عن الصلاة إلاّ في أصل حرمة التخلف عن حضور الخطبة بغير عذر .وفي حديث «الموطأ» «فإذا خرج الإِمام حضرت الملائكة يستمعون الذكر» ولا شك أن الإِمام إذا خرج ابتدأ بالخطبة فكانت الخطبة من الذكر وفي ذلك تفسير للفظ الذكر في هذه الآية . وإنما نهوا عن البيع لأنه الذي يشغلهم ولأن سبب نزول الآية كان لترك فريق منهم الجمعة إقبالاً على عِير تجارة وردت كما سيأتي في قوله تعالى : { وإذا رأوا تجارة أو لهوا انفضوا إليها } [ الجمعة : 11 ] .ومثل البيع كل ما يشغل عن السعي إلى الجمعة ، وبعد كون البيع وما قيس عليه منهياً عنه فقد اختُلف في فسخ العقود التي انعقدت وقت الجمعة . وهو مبني على الخلاف في اقتضاء النهي فساد المنهي عنه ، ومذهب مالك أن النهي يقتضي الفساد إلا لِدليل . وقول مالك في «المدونة» : إن البيع الواقع في وقت صلاة الجمعة بين من تجب عليهم الجمعة يفسخ .وقال الشافعي : لا يفسخ . وجعله كالصلاة في الأرض المغصوبة وهو قول أبي حنيفة أيضاً .وأما النكاح المعقود في وقت الجمعة : ففي «العتيبة» عن ابن القاسم : لا يفسخ . ولعله اقتصر على ما ورد النهي عنه في القرآن ولم ير القياس موجباً لفسخ المقيس . وكذلك قال أيمة المالكية : لا تفسخ الشركة والهبة والصدقة الواقعة في وقت الجمعة وعللوا ذلك بندرة وقوع أمثالها بخلاف البيع .وخطاب الآية جميعَ المؤمنين فدل على أن الجمعة واجبة على الأعيان . وشذ قوم قالوا : إنها واجبة على الكفاية قال ابن الفرس : ونسب إلى بعض الشافعية وخطاب القرآن الذين آمنوا عام خصصته السنة بعدم وجوب الجمعة على النساء والعبيد والمسافر إذا حل بقرية الجمعة ومن لا يستطيع السعي إليها .و { مِن } في قوله : { من يوم الجمعة } تبعيضية فإن يوم الجمعة زمان تقع فيه أعمال منها الصلاة المعهودة فيه ، فنزّل ما يقع في الزمان بمنزلة أجزاء الشيء .ويجوز كون { مِن } للظرفية مثل التي في قوله تعالى : { أروني ماذا خلقوا من الأرض } [ فاطر : 40 ] ، أي فيها من المخلوقات الأرضية .والإِشارة ب { ذلكم } إلى المذكور ، أي ما ذُكر من أمر بالسعي إليها ، وأمر بترك البيع حينئذٍ ، أي ذلك خير لكم مما يحصل لكم من البيوعات . فلفظ { خير } اسم تفضيل أصله : أخير ، حذفت همزته لكثرة الاستعمال . والمفضل عليه محذوف لدلالة الكلام عليه . والمفضل : الصلاة ، أي ثوابها . والمفضل عليه : منافع البيع للبائع والمشتري .وإنما أعقب بقوله تعالى : { فإذا قضيت الصلاة فانتشروا في الأرض وابتغوا من فضل الله } تنبيهاً على أن لهم سعة من النهار يجعلونها للبيع ونحوه من ابتغاء أسباب المعاش فلا يأخذوا ذلك من وقت الصلاة ، وذكر الله . والأمر في { فانتشروا في الأرض وابتغوا من فضل الله } للإباحة .والمراد ب { فضل الله } : اكتساب المال والرزق .وأما قوله : { واذكروا الله كثيراً } فهو احتراس من الانصباب في أشغال الدنيا انصباباً ينسي ذكر الله ، أو يشغل عن الصلوات فإن الفلاح في الإِقبال على مرضاة الله تعالى .\n","ar.waseet":"ثم بين - سبحانه - جانبا من مظاهر تيسيره عليهم فى تشريعاته فقال : ( فَإِذَا قُضِيَتِ الصلاة فانتشروا فِي الأرض وابتغوا مِن فَضْلِ الله . . ) .أى : فإذا فرغتم من أداء الصلاة وأقمتموها على أكل وجه ، فانتشروا فى الأرض ، وامشوا فى مناكبها ، لأداء أعمالكم التى كنتم قد تركتموها عند النداء للصلاة ، واطلبوا الربح واكتساب المال والرزق ، من فضل الله - تعالى - ومن فيض إنعامه ، والأمر هنا للإباحة ، لأنه وارد بعد حظر ، فهو كقوله - تعالى - : ( وَإِذَا حَلَلْتُمْ فاصطادوا . . ) أى : أن الانتشار فى الأرض بعد الصلاة لطلب الرزق ، ليس واجبا عليهم ، إذ طلب الرزق قد يكون فى هذا الوقت ، وقد يكون فى غيره . .والمقصود من الآية إنما هو تنبيه الناس ، إلى أن لهم فى غير وقت الصلاة ، سعة من الزمن فى طلب الرزق ، وفى الاشتغال بالأمور الدنيوية ، فعليهم أن يسعوا إلى ذكر الله ، إذا ما نودى للصلاة من يوم الجمعة ، وأن يحرصوا على ذلك حرصا تاما ، مصحوبا بالنية الطيبة ، وبالهيئة الحسنة . وبالمضى المبكر إلى المسجد .وقوله - سبحانه - : ( واذكروا الله كَثِيراً لَّعَلَّكُمْ تُفْلِحُونَ ) تحذير لهم من الانتشار فى الأرض لمصالحهم الدنيوية ، دون أن يعطو طاعة الله - تعالى - وعبادته ، ما تستحقه من عناية ومواظبة .أى : إذا قضيت الصلاة ، فانتشروا فى الأرض لتحصيل معاشكم ، دون أن يشغلكم ذلك عن الإكثار من ذكر الله - تعالى - فى كل أحوالكم ، فإن الفلاح كل الفلاح فى تقديم ما يتعلق بأمور الدين ، على ما يتعلق بأمور الدنيا ، وفى تفضيل ما يبقى على ما يفنى .والمتأمل فى هذه الآية الكريمة يراها ترسم للمسلم التوازن السامى ، بين ما يقتضيه دينه ، وما تقتضيه دنياه .إنا تأمره بالسعى فى الأرض ، ولكن فى غير وقت النداء للصلاة من يوم الجمعة ، ودون أن يشغله هذا السعى عن الإكثار من ذكر الله ، فإن الفلاح فى الإقبال على الطاعات التى ترضيه - سبحانه - : ومن بين هذه الطاعات أن يكثر الإنسان من ذكر الله - تعالى - ، حتى فى حالة سعيه لتحصيل رزقه .\n","ar.baghawi":"قوله - عز وجل - ( فإذا قضيت الصلاة فانتشروا في الأرض ) أي إذا فرغ من الصلاة فانتشروا في الأرض للتجارة والتصرف في حوائجكم ( وابتغوا من فضل الله ) يعني الرزق وهذا أمر إباحة ، كقوله : \" وإذا حللتم فاصطادوا \" ( المائدة - 2 ) قال ابن عباس : إن شئت فاخرج وإن شئت فاقعد وإن شئت فصل إلى العصر ، وقيل : فانتشروا في الأرض ليس لطلب الدنيا ولكن لعيادة مريض وحضور جنازة وزيارة أخ في الله . وقال الحسن وسعيد بن جبير ومكحول : \" وابتغوا من فضل الله \" هو طلب العلم .( واذكروا الله كثيرا لعلكم تفلحون )\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5187.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5187.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5187.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ","transliteration":"Wa izaa ra'aw tijaaratan aw lahwanin faddooo ilaihaa wa tarakooka qaaa'imaa; qul maa 'indal laahi khairum minal lahwi wa minat tijaarah; wallaahu khayrur raaziqeen","translations":{"en.ahmedali":"Yet when they see some buying and selling, or some sport, they go for it, leaving you standing. Tell them: \"What is with God is better than your sport and commerce. And God is the best of providers.\"","en.ahmedraza":"And when they see some trade or sport, they move towards it and leave you standing delivering the sermon; proclaim, “That which is with Allah, is better than sport and trade; and the sustenance of Allah is the best.”","en.arberry":"But when they see merchandise or diversion they scatter off to it, and they leave thee standing. Say: 'What is with God is better than diversion and merchandise. God is the best of providers.'","en.asad":"Yet [it does happen that] when people become aware of [an occasion for] worldly gain or a passing delight, they rush headlong towards it, and leave thee standing [and preaching]. Say: \"That which is with God is far better than all passing delight and all gain! And God is the best of providers!\"","en.daryabadi":"And when they beheld merchandise or sport, they flocked thereto, and left thee standing. Say thou: that which is with Allah is better than sport and better than merchandise; and Allah is the Best of providers.","en.hilali":"And when they see some merchandise or some amusement [beating of Tambur (drum) etc.] they disperse headlong to it, and leave you (Muhammad SAW) standing [while delivering Jumu'ah's religious talk (Khutbah)]. Say \"That which Allah has is better than any amusement or merchandise! And Allah is the Best of providers.\"","en.pickthall":"But when they spy some merchandise or pastime they break away to it and leave thee standing. Say: That which Allah hath is better than pastime and than merchandise, and Allah is the Best of providers.","en.qaribullah":"Yet when they see some commerce or amusement they flock to it, leaving you standing. Say: 'That which is with Allah is better than the amusement and commerce. Allah is the Best of Providers'","en.sahih":"But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing. Say, \"What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.\"","en.sarwar":"When they see some merchandise or some sport, they rush towards it and leave you alone standing. Say, \"(God's rewards for good deeds) are better than merriment or merchandise; God is the best Sustainer\".","en.yusufali":"But when they see some bargain or some amusement, they disperse headlong to it, and leave thee standing. Say: \"The (blessing) from the Presence of Allah is better than any amusement or bargain! and Allah is the Best to provide (for all needs).\"","en.maududi":"Yet no sooner than they saw some trading or amusement, they flocked to it and left you standing by yourself. Tell them: “That which is with Allah is far better than amusement and trading. Allah is the Best Provider of sustenance.”","en.shakir":"And when they see merchandise or sport they break up for It, and leave you standing. Say: What is with Allah is better than sport and (better) than merchandise, and Allah is the best of Sustainers.","en.itani":"Yet whenever they come across some business, or some entertainment, they scramble towards it, and leave you standing. Say, “What is with God is better than entertainment and business; and God is the Best of providers.”","en.mubarakpuri":"And when they see some merchandise or some amusement, they disperse headlong to it, and leave you standing. Say: \"That which Allah has is better than any amusement or merchandise! And Allah is the best of providers.\"","en.qarai":"When they sight a deal or a diversion, they scatter off towards it and leave you standing! Say, ‘What is with Allah is better than diversion and dealing, and Allah is the best of providers.’","en.wahiduddin":"Yet when they see some merchandise or entertainment, they break away to go to it and leave you standing. Say, \"That which God has in store is far better than any merchandise or entertainment.\" God is the most munificent Giver."},"tafsir":{"ar.muyassar":"إذا رأى بعض المسلمين تجارة أو شيئًا مِن لهو الدنيا وزينتها تفرَّقوا إليها، وتركوك -أيها النبي- قائمًا على المنبر تخطب، قل لهم-أيها النبي-: ما عند الله من الثواب والنعيم أنفع لكم من اللهو ومن التجارة، والله- وحده- خير مَن رزق وأعطى، فاطلبوا منه، واستعينوا بطاعته على نيل ما عنده من خيري الدنيا والآخرة.","ar.jalalayn":"«وإذا رأوا تجارةً أو لهوا انفضوا إليها» أي التجارة لأنها مطلوبهم دون اللهو «وتركوك» في الخطبة «قائما قل ما عند الله» من الثواب «خير» للذين آمنوا «من اللهو ومن التجارة والله خير الرازقين» يقال: كل إنسان يرزق عائلته، أي من رزق الله تعالى.","ar.qurtubi":"قوله تعالى : وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما قل ما عند الله خير من اللهو ومن التجارة والله خير الرازقين .فيه سبع عشرة مسألة :الأولى : قوله تعالى : وإذا رأوا تجارة أو لهوا انفضوا إليها في صحيح مسلم عن جابر بن عبد الله أن النبي صلى الله عليه وسلم كان يخطب قائما يوم الجمعة ، فجاءت عير من الشام فانفتل [ ص: 100 ] الناس إليها حتى لم يبق إلا اثنا عشر رجلا - في رواية : أنا فيهم - فأنزلت هذه الآية التي في الجمعة : وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما . في رواية : فيهم أبو بكر وعمر رضي الله عنهما . وقد ذكر الكلبي وغيره : أن الذي قدم بها دحية بن خليفة الكلبي من الشام عند مجاعة وغلاء سعر ، وكان معه جميع ما يحتاج الناس من بر ودقيق وغيره ، فنزل عند أحجار الزيت ، وضرب بالطبل ليؤذن الناس بقدومه ; فخرج الناس إلا اثني عشر رجلا . وقيل : أحد عشر رجلا . قال الكلبي : وكانوا في خطبة الجمعة فانفضوا إليها ، وبقي مع رسول الله صلى الله عليه وسلم ثمانية رجال ; حكاه الثعلبي عن ابن عباس ، وذكر الدارقطني من حديث جابر بن عبد الله قال : بينما رسول الله صلى الله عليه وسلم يخطبنا يوم الجمعة إذ أقبلت عير تحمل الطعام حتى نزلت بالبقيع ; فالتفتوا إليها وانفضوا إليها وتركوا رسول الله صلى الله عليه وسلم ليس معه إلا أربعون رجلا أنا فيهم . قال : وأنزل الله عز وجل على النبي صلى الله عليه وسلم وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما . قال الدارقطني : لم يقل في هذا الإسناد \" إلا أربعين رجلا \" غير علي بن عاصم عن حصين ، وخالفه أصحاب حصين فقالوا : لم يبق مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا . وروي عنه عليه الصلاة والسلام أنه قال : \" والذي نفسي بيده لو خرجوا جميعا لأضرم الله عليهم الوادي نارا \" ; ذكره الزمخشري . وروي في حديث مرسل أسماء الاثني عشر رجلا ، رواه أسد بن عمرو والد أسد بن موسى بن أسد . وفيه : أن رسول الله صلى الله عليه وسلم لم يبق معه إلا أبو بكر وعمر وعثمان وعلي ، وطلحة والزبير وسعد بن أبي وقاص ، وعبد الرحمن بن عوف وأبو عبيدة بن [ ص: 101 ] الجراح ، وسعيد بن زيد وبلال ، وعبد الله بن مسعود في إحدى الروايتين . وفي الرواية الأخرى عمار بن ياسر .قلت : لم يذكر جابرا ; وقد ذكر مسلم أنه كان فيهم ; والدارقطني أيضا . فيكونون ثلاثة عشر . وإن كان عبد الله بن مسعود فيهم فهم أربعة عشر . وقد ذكر أبو داود في مراسيله السبب الذي ترخصوا لأنفسهم في ترك سماع الخطبة ، وقد كانوا خليقا بفضلهم ألا يفعلوا ; فقال : حدثنا محمود بن خالد قال : حدثنا الوليد ، قال : أخبرني أبو معاذ بكر بن معروف أنه سمع مقاتل بن حيان قال : كان رسول الله صلى الله عليه وسلم يصلي الجمعة قبل الخطبة مثل العيدين ، حتى كان يوم جمعة والنبي صلى الله عليه وسلم يخطب ، وقد صلى الجمعة ، فدخل رجل فقال : إن دحية بن خليفة الكلبي قدم بتجارة ، وكان دحية إذا قدم تلقاه أهله بالدفاف ; فخرج الناس فلم يظنوا إلا أنه ليس في ترك الخطبة شيء ; فأنزل الله عز وجل : وإذا رأوا تجارة أو لهوا انفضوا إليها . فقدم النبي صلى الله عليه وسلم الخطبة يوم الجمعة وأخر الصلاة . وكان لا يخرج أحد لرعاف أو أحداث بعد النهي حتى يستأذن النبي صلى الله عليه وسلم ، يشير إليه بأصبعه التي تلي الإبهام ; فيأذن له النبي صلى الله عليه وسلم ثم يشير إليه بيده . فكان من المنافقين من ثقل عليه الخطبة والجلوس في المسجد ، وكان إذا استأذن رجل من المسلمين قام المنافق إلى جنبه مستترا به حتى يخرج ; فأنزل الله تعالى : قد يعلم الله الذين يتسللون منكم لواذا الآية . قال السهيلي : وهذا الخبر وإن لم ينقل من وجه ثابت فالظن الجميل بأصحاب النبي صلى الله عليه وسلم يوجب أن يكون صحيحا . وقال قتادة : وبلغنا أنهم فعلوه ثلاث مرات ; كل مرة عير تقدم من الشام ، وكل ذلك يوافق يوم الجمعة . وقيل : إن خروجهم لقدوم دحية الكلبي بتجارته ونظرهم إلى العير تمر - لهو لا فائدة فيه ; إلا أنه كان مما لا إثم فيه لو وقع على غير ذلك الوجه ، ولكنه لما اتصل به الإعراض عن رسول الله صلى الله عليه وسلم والانفضاض عن حضرته ، غلظ وكبر ونزل فيه من القرآن وتهجينه باسم اللهو ما نزل . وجاء عن رسول الله صلى الله عليه وسلم أنه قال : \" كل ما يلهو به الرجل باطل إلا رميه بقوسه \" . الحديث . وقد مضى في سورة \" الأنفال \" فلله الحمد . وقال جابر بن عبد الله : كانت الجواري إذا نكحن يمررن بالمزامير والطبل فانفضوا إليها ; فنزلت . وإنما رد الكناية إلى التجارة لأنها أهم . وقرأ طلحة بن [ ص: 102 ] مصرف \" وإذا رأوا التجارة واللهو انفضوا إليها \" . وقيل : المعنى وإذا رأوا تجارة انفضوا إليها ، أو لهوا انفضوا إليه فحذف لدلالته . كما قال :نحن بما عندنا وأنت بما عندك راض والرأي مختلفوقيل : الأجود في العربية أن يجعل الراجع في الذكر للآخر من الاسمين .الثانية : واختلف العلماء في العدد الذي تنعقد به الجمعة على أقوال ; فقال الحسن : تنعقد الجمعة باثنين . وقال الليث وأبو يوسف : تنعقد بثلاثة . وقال سفيان الثوري وأبو حنيفة : بأربعة . وقال ربيعة : باثني عشر رجلا . وذكر النجاد أبو بكر أحمد بن سليمان قال : حدثنا أبو خالد يزيد بن الهيثم بن طهمان الدقاق ، حدثنا صبح بن دينار قال : حدثنا المعافى بن عمران حدثنا معقل بن عبيد الله عن الزهري بسنده إلى مصعب بن عمير : أن النبي صلى الله عليه وسلم بعثه إلى المدينة ، وأنه نزل في دار سعد بن معاذ ، فجمع بهم وهم اثنا عشر رجلا ، ذبح لهم يومئذ شاة . وقال الشافعي : بأربعين رجلا . وقال أبو إسحاق الشيرازي في ( كتاب التنبيه على مذهب الإمام الشافعي ) : كل قرية فيها أربعون رجلا بالغين عقلاء أحرارا مقيمين ، لا يظعنون عنها صيفا ولا شتاء إلا ظعن حاجة ، وأن يكونوا حاضرين من أول الخطبة إلى أن تقام الجمعة وجبت عليهم الجمعة . ومال أحمد وإسحاق إلى هذا القول ولم يشترطا هذه الشروط . وقال مالك : إذا كانت قرية فيها سوق ومسجد فعليهم الجمعة من غير اعتبار عدد . وكتب عمر بن عبد العزيز : أي قرية اجتمع فيها ثلاثون بيتا فعليهم الجمعة . وقال أبو حنيفة : لا تجب الجمعة على أهل السواد والقرى ، لا يجوز لهم إقامتها فيها . واشترط في وجوب الجمعة وانعقادها : المصر الجامع ، والسلطان القاهر ، والسوق القائمة ، والنهر الجاري . واحتج بحديث علي : لا جمعة ولا تشريق إلا في مصر جامع ورفقة تعينهم . وهذا يرده حديث ابن عباس ، قال : إن أول جمعة جمعت بعد جمعة في مسجد رسول الله صلى الله عليه وسلم بقرية من قرى البحرين يقال لها جواثي . وحجة الإمام الشافعي في الأربعين حديث جابر المذكور الذي خرجه الدارقطني . وفي سنن ابن ماجه والدارقطني أيضا ودلائل النبوة للبيهقي عن عبد الرحمن بن كعب بن مالك قال : كنت قائد أبي حين ذهب بصره ، فإذا خرجت به إلى الجمعة فسمع الأذان ، صلى على أبي أمامة واستغفر له - قال - فمكث كذلك حينا لا يسمع الأذان بالجمعة إلا فعل ذلك ; فقلت له : يا أبة ، استغفارك [ ص: 103 ] لأبي أمامة كلما سمعت أذان الجمعة ، ما هو ؟ قال : أي بني ، هو أول من جمع بالمدينة في هزم من حرة بني بياضة يقال له نقيع الخضمات ; قال : قلت : كم أنتم يومئذ ؟ قال : أربعون رجلا . وقال جابر بن عبد الله : مضت السنة أن في كل ثلاثة إماما ، وفي كل أربعين فما فوق ذلك جمعة وأضحى وفطرا ، وذلك أنهم جماعة . خرجه الدارقطني . وروى أبو بكر أحمد بن سليمان النجاد : قرئ على عبد الملك بن محمد الرقاشي وأنا أسمع : حدثني رجاء بن سلمة قال : حدثنا أبي قال : حدثنا روح بن غطيف الثقفي قال حدثني الزهري عن أبي سلمة قال : قلت لأبي هريرة : على كم تجب الجمعة من رجل ؟ قال : لما بلغ أصحاب رسول الله صلى الله عليه وسلم خمسين رجلا جمع بهم رسول الله صلى الله عليه وسلم . قرئ على عبد الملك بن محمد وأنا أسمع قال : حدثنا رجاء بن سلمة قال : حدثنا عباد بن عباد المهلبي عن جعفر بن الزبير عن القاسم عن أبي أمامة قال : قال رسول الله صلى الله عليه وسلم : \" تجب الجمعة على خمسين رجلا ولا تجب على من دون ذلك \" . قال ابن المنذر : وكتب عمر بن عبد العزيز : أيما قرية اجتمع فيها خمسون رجلا فليصلوا الجمعة . وروى الزهري عن أم عبد الله الدوسية قالت : قال رسول الله صلى الله عليه وسلم : \" الجمعة واجبة على كل قرية وإن لم يكن فيها إلا أربعة \" . يعني بالقرى : المدائن . لا يصح هذا عن الزهري . في رواية : \" الجمعة واجبة على أهل كل قرية وإن لم يكونوا إلا ثلاثة رابعهم إمامهم \" . الزهري : لا يصح سماعه من الدوسية . والحكم هذا متروك .الثالثة : وتصح الجمعة بغير إذن الإمام وحضوره . وقال أبو حنيفة : من شرطها الإمام أو خليفته . ودليلنا أن الوليد بن عقبة والي الكوفة أبطأ يوما فصلى ابن مسعود بالناس من غير [ ص: 104 ] إذنه . وروي أن عليا صلى الجمعة يوم حصر عثمان ولم ينقل أنه استأذنه . وروي أن سعيد بن العاصي والي المدينة لما خرج من المدينة صلى أبو موسى بالناس الجمعة من غير استئذان . وقال مالك : إن لله فرائض في أرضه لا يضيعها ; وليها وال أو لم يلها .الرابعة : قال علماؤنا : من شرط أدائها المسجد المسقف . قال ابن العربي : ولا أعلم وجهه . قلت : وجهه قوله تعالى : وطهر بيتي للطائفين ، وقوله : في بيوت أذن الله أن ترفع . وحقيقة البيت أن يكون ذا حيطان وسقف . هذا العرف ، والله أعلم .الخامسة : قوله تعالى : وتركوك قائما شرط في قيام الخطيب على المنبر إذا خطب . قال علقمة : سئل عبد الله أكان النبي صلى الله عليه وسلم يخطب قائما أو قاعدا ؟ فقال : أما تقرأ \" وتركوك قائما \" . وفي صحيح مسلم عن كعب بن عجرة أنه دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال : انظروا إلى هذا الخبيث ، يخطب قاعدا ! وقال الله تعالى : وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما . وخرج عن جابر أن رسول الله صلى الله عليه وسلم كان يخطب قائما ثم يجلس ، ثم يقوم فيخطب ; فمن نبأك أنه كان يخطب جالسا فقد كذب ; فقد والله صليت معه أكثر من ألفي صلاة . وعلى هذا جمهور الفقهاء وأئمة العلماء . وقال أبو حنيفة : ليس القيام بشرط فيها . ويروى أن أول من خطب قاعدا معاوية . وخطب عثمان قائما حتى رق فخطب قاعدا . وقيل : إن معاوية إنما خطب قاعدا لسنه . وقد كان النبي صلى الله عليه وسلم يخطب قائما ثم يقعد ثم يقوم ولا يتكلم في قعدته . رواه جابر بن سمرة . ورواه ابن عمر في كتاب البخاري .السادسة : والخطبة شرط في انعقاد الجمعة لا تصح إلا بها ; وهو قول جمهور العلماء . وقال الحسن : هي مستحبة . وكذا قال ابن الماجشون : إنها سنة وليست بفرض . وقال سعيد بن جبير : هي بمنزلة الركعتين من صلاة الظهر ; فإذا تركها وصلى الجمعة فقد ترك الركعتين من صلاة الظهر . والدليل على وجوبها قوله تعالى : وتركوك قائما . وهذا ذم ، والواجب هو الذي يذم تاركه شرعا ، ثم إن النبي صلى الله عليه وسلم لم يصلها إلا بخطبة .[ ص: 105 ] السابعة : ويخطب متوكئا على قوس أو عصا . وفي سنن ابن ماجه قال : حدثنا هشام بن عمار حدثنا عبد الرحمن بن سعد بن عمار بن سعد قال : حدثني أبي عن أبيه عن جده أن رسول الله صلى الله عليه وسلم كان إذا خطب في الحرب خطب على قوس ، وإذا خطب في الجمعة خطب على عصا .الثامنة : ويسلم إذا صعد المنبر على الناس عند الشافعي وغيره . ولم يره مالك . وقد روى ابن ماجه من حديث جابر بن عبد الله أن النبي صلى الله عليه وسلم كان إذا صعد المنبر سلم .التاسعة : فإن خطب على غير طهارة الخطبة كلها أو بعضها أساء عند مالك ; ولا إعادة عليه إذا صلى طاهرا . وللشافعي قولان في إيجاب الطهارة ; فشرطها في الجديد ولم يشترطها في القديم . وهو قول أبي حنيفة .العاشرة : وأقل ما يجزي في الخطبة أن يحمد الله ويصلي على نبيه صلى الله عليه وسلم ، ويوصي بتقوى الله ويقرأ آية من القرآن . ويجب في الثانية أربع كالأولى ; إلا أن الواجب بدلا من قراءة الآية في الأولى الدعاء ; قاله أكثر الفقهاء . وقال أبو حنيفة : لو اقتصر على التحميد أو التسبيح أو التكبير أجزأه . وعن عثمان رضي الله عنه أنه صعد المنبر فقال : الحمد لله ، وارتج عليه فقال : إن أبا بكر وعمر كانا يعدان لهذا المقام مقالا ، وإنكم إلى إمام فعال أحوج منكم إلى إمام قوال ، وستأتيكم الخطب ; ثم نزل فصلى . وكان ذلك بحضرة الصحابة فلم ينكر عليه أحد . وقال أبو يوسف ومحمد : الواجب ما تناوله اسم خطبة . وهو قول الشافعي . قال أبو عمر بن عبد البر : وهو أصح ما قيل في ذلك .الحادية عشرة : في صحيح مسلم عن يعلى بن أمية أنه سمع النبي صلى الله عليه وسلم يقرأ على المنبر \" ونادوا يا مالك \" . وفيه عن عمرة بنت عبد الرحمن عن أخت لعمرة قالت : ما أخذت ق والقرآن المجيد إلا من في رسول الله صلى الله عليه وسلم يوم الجمعة وهو يقرأ بها على المنبر في كل جمعة . وقد مضى في أول \" ق \" . وفي مراسيل أبي داود عن الزهري قال : كان صدر خطبة النبي صلى الله عليه وسلم : \" الحمد لله ، نحمده ونستعينه ونستغفره ، ونعوذ به من شرور أنفسنا ، من يهد الله فلا مضل له ، ومن يضلل فلا هادي له . ونشهد أن لا إله إلا الله ; وأن محمدا عبده ورسوله ، أرسله [ ص: 106 ] بالحق بشيرا ونذيرا بين يدي الساعة . من يطع الله ورسوله فقد رشد ، ومن يعصهما فقد غوى . نسأل الله ربنا أن يجعلنا ممن يطيعه ويطيع رسوله ، ويتبع رضوانه ويجتنب سخطه ، فإنما نحن به وله \" . وعنه قال : بلغنا عن رسول الله صلى الله عليه وسلم أنه كان يقول إذا خطب : \" كل ما هو آت قريب ، ولا بعد لما هو آت ، لا يعجل الله لعجلة أحد ، ولا يخف لأمر الناس ، ما شاء الله لا ما شاء الناس . يريد الله أمرا ويريد الناس أمرا ، ما شاء الله كان ولو كره الناس . ولا مبعد لما قرب الله ، ولا مقرب لما بعد الله . لا يكون شيء إلا بإذن الله جل وعز \" . وقال جابر : كان النبي صلى الله عليه وسلم يوم الجمعة يخطب فيقول بعد أن يحمد الله ويصلي على أنبيائه : \" أيها الناس ، إن لكم معالم فانتهوا إلى معالمكم ، وإن لكم نهاية فانتهوا إلى نهايتكم . إن العبد المؤمن بين مخافتين ؛ بين أجل قد مضى لا يدري ما الله قاض فيه ، وبين أجل قد بقي لا يدري ما الله صانع فيه . فليأخذ العبد من نفسه لنفسه ، ومن دنياه لآخرته ، ومن الشبيبة قبل الكبر ، ومن الحياة قبل الممات . والذي نفسي بيده ما بعد الموت من مستعتب ، وما بعد الدنيا من دار إلا الجنة أو النار . أقول قولي هذا وأستغفر الله لي ولكم \" . وقد تقدم ما خطب به عليه الصلاة والسلام أول جمعة عند قدومه المدينة .الثانية عشرة : السكوت للخطبة واجب على من سمعها وجوب سنة . والسنة أن يسكت لها من يسمع ومن لم يسمع ، وهما إن شاء الله في الأجر سواء . ومن تكلم حينئذ لغا ; ولا تفسد صلاته بذلك . وفي الصحيح عن أبي هريرة أن النبي صلى الله عليه وسلم قال : \" إذا قلت لصاحبك أنصت يوم الجمعة والإمام يخطب فقد لغوت \" . الزمخشري : وإذا قال المنصت لصاحبه : صه ; فقد لغا ، أفلا يكون الخطيب الغالي في ذلك لاغيا ؟ نعوذ بالله من غربة الإسلام ونكد الأيام .[ ص: 107 ] الثالثة عشرة : ويستقبل الناس الإمام إذا صعد المنبر ; لما رواه أبو داود مرسلا عن أبان بن عبد الله قال : كنت مع عدي بن ثابت يوم الجمعة ; فلما خرج الإمام - أو قال صعد المنبر - استقبله وقال : هكذا أصحاب رسول الله صلى الله عليه وسلم يفعلون برسول الله صلى الله عليه وسلم . خرجه ابن ماجه عن عدي بن ثابت عن أبيه ; فزاد في الإسناد : عن أبيه قال : كان رسول الله صلى الله عليه وسلم إذا قام على المنبر استقبله أصحابه بوجوههم . قال ابن ماجه : أرجو أن يكون متصلا .قلت : وخرج أبو نعيم الحافظ قال : حدثنا محمد بن معمر قال : حدثنا عبد الله بن محمد بن ناجية قال : حدثنا عباد بن يعقوب قال : حدثنا محمد بن الفضل الخراساني عن منصور عن إبراهيم عن علقمة عن عبد الله قال : كان النبي صلى الله عليه وسلم إذا استوى على المنبر استقبلناه بوجوهنا . تفرد به محمد بن الفضل بن عطية عن منصور .الرابعة عشرة : ولا يركع من دخل المسجد والإمام يخطب ; عند مالك رحمه الله . وهو قول ابن شهاب رحمه الله وغيره . وفي الموطأ عنه : فخروج الإمام يقطع الصلاة ، وكلامه يقطع الكلام . وهذا مرسل . وفي صحيح مسلم من حديث جابر عن النبي صلى الله عليه وسلم : \" إذا جاء أحدكم يوم الجمعة والإمام يخطب فليركع ركعتين وليتجوز فيهما \" . وهذا نص في الركوع . وبه يقول الشافعي وغيره .الخامسة عشرة : ذكر ابن عون عن ابن سيرين قال : كانوا يكرهون النوم والإمام يخطب ويقولون فيه قولا شديدا . قال ابن عون : ثم لقيني بعد ذلك فقال : تدري ما يقولون ؟ قال : يقولون مثلهم كمثل سرية أخفقوا ; ثم قال : هل تدري ما أخفقوا ؟ لم تغنم شيئا . وعن سمرة بن جندب أن النبي صلى الله عليه وسلم قال : \" إذا نعس أحدكم فليتحول إلى مقعد صاحبه وليتحول صاحبه إلى مقعده \" .السادسة عشرة : نذكر فيها من فضل الجمعة وفرضيتها ما لم نذكره . روى الأئمة عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم ذكر يوم الجمعة فقال : \" فيه ساعة لا يوافقها عبد مسلم [ ص: 108 ] وهو يصلي يسأل الله عز وجل شيئا إلا أعطاه إياه \" وأشار بيده يقللها . وفي صحيح مسلم من حديث أبي موسى قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" هي ما بين أن يجلس الإمام إلى أن تقضى الصلاة \" . وروي من حديث أنس أن النبي صلى الله عليه وسلم أبطأ علينا ذات يوم ; فلما خرج قلنا : احتبست ! قال : \" ذلك أن جبريل أتاني بكهيئة المرآة البيضاء فيها نكتة سوداء ، فقلت : ما هذه يا جبريل ؟ قال : هذه الجمعة فيها خير لك ولأمتك ، وقد أرادها اليهود والنصارى فأخطئوها وهداكم الله لها . قلت : يا جبريل ما هذه النكتة السوداء ؟ قال : هذه الساعة التي في يوم الجمعة لا يوافقها عبد مسلم يسأل الله فيها خيرا إلا أعطاه إياه ، أو ادخر له مثله يوم القيامة ، أو صرف عنه من السوء مثله ، وإنه خير الأيام عند الله ، وإن أهل الجنة يسمونه يوم المزيد \" . وذكر الحديث . وذكر ابن المبارك ويحيى بن سلام قالا : حدثنا المسعودي عن المنهال بن عمرو عن أبي عبيدة بن عبد الله بن عتبة عن ابن مسعود قال : تسارعوا إلى الجمعة ، فإن الله تبارك وتعالى يبرز لأهل الجنة كل يوم جمعة في كثيب من كافور أبيض ، فيكونون منه في القرب - قال ابن المبارك - على قدر تسارعهم إلى الجمعة في الدنيا . وقال يحيى بن سلام : كمسارعتهم إلى الجمعة في الدنيا . وزاد : فيحدث لهم من الكرامة شيئا لم يكونوا رأوه قبل ذلك . قال يحيى : وسمعت غير المسعودي يزيد فيه : وهو قوله تعالى : ولدينا مزيد .قلت : قوله : \" في كثيب \" يريد أهل الجنة . أي وهم على كثيب ; كما روى الحسن قال : قال رسول الله صلى الله عليه وسلم : إن أهل الجنة ينظرون إلى ربهم في كل جمعة على كثيب من كافور لا يرى طرفاه ، وفيه نهر جار حافتاه المسك ، عليه جوار يقرأن القرآن بأحسن أصوات سمعها الأولون والآخرون ، فإذا انصرفوا إلى منازلهم أخذ كل رجل بيد ما شاء منهن ، ثم يمرون على قناطر من لؤلؤ إلى منازلهم ، فلولا أن الله يهديهم إلى منازلهم ما اهتدوا إليها لما يحدث الله لهم [ ص: 109 ] في كل جمعة \" ذكره يحيى بن سلام . وعن أنس قال : قال النبي صلى الله عليه وسلم : \" ليلة أسري بي رأيت تحت العرش سبعين مدينة ، كل مدينة مثل مدائنكم هذه سبعين مرة مملوءة من الملائكة يسبحون الله ويقدسونه ويقولون في تسبيحهم : اللهم اغفر لمن شهد الجمعة ، اللهم اغفر لمن اغتسل يوم الجمعة \" ذكره الثعلبي . وخرج القاضي الشريف أبو الحسن علي بن عبد الله بن إبراهيم الهاشمي العيسوي من ولد عيسى بن علي بن عبد الله بن عباس رضي الله عنه بإسناد صحيح عن أبي موسى الأشعري أن رسول الله صلى الله عليه وسلم قال : \" إن الله عز وجل يبعث الأيام يوم القيامة على هيئتها ويبعث الجمعة زهراء منيرة أهلها يحفون بها كالعروس تهدى إلى كريمها تضيء لهم يمشون في ضوئها ، ألوانهم كالثلج بياضا ، وريحهم يسطع كالمسك ، يخوضون في جبال الكافور ، ينظر إليهم الثقلان ما يطرقون تعجبا يدخلون الجنة لا يخالطهم أحد إلا المؤذنون المحتسبون \" . وفي سنن ابن ماجه عن أبي هريرة أن رسول الله صلى الله عليه وسلم : قال \" الجمعة إلى الجمعة كفارة ما بينهما ما لم تغش الكبائر \" خرجه مسلم بمعناه . وعن أوس بن أوس الثقفي قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" من غسل يوم الجمعة واغتسل ، وبكر وابتكر ، ومشى ولم يركب ، ودنا من الإمام فاستمع ولم يلغ ، كان له بكل خطوة عمل سنة ، أجر صيامها وقيامها \" . وعن جابر بن عبد الله قال : خطبنا رسول الله صلى الله عليه وسلم فقال : \" يا أيها الناس توبوا إلى الله قبل أن تموتوا . وبادروا بالأعمال الصالحة قبل أن تشغلوا . وصلوا الذي بينكم وبين ربكم بكثرة ذكركم له وكثرة الصدقة في السر والعلانية ترزقوا وتنصروا وتؤجروا . واعلموا أن الله قد فرض عليكم الجمعة في مقامي هذا في شهري هذا في عامي هذا إلى يوم القيامة ، فمن تركها في حياتي أو بعد مماتي ، وله إمام عادل أو جائر ، استخفافا بها ، أو جحودا لها ، فلا جمع الله شمله ، ولا بارك له في أمره . ألا ولا صلاة له ولا زكاة له ولا حج له . ألا ولا صوم له ولا بر له حتى يتوب ، فمن تاب تاب الله عليه . ألا لا تؤمن امرأة رجلا ، ولا يؤم أعرابي مهاجرا ، ولا يؤم فاجر مؤمنا إلا أن [ ص: 110 ] يقهره سلطان يخاف سيفه أو سوطه \" . وقال ميمون بن أبي شيبة : أردت الجمعة مع الحجاج فتهيأت للذهاب ، ثم قلت : أين أذهب أصلي خلف هذا الفاجر ؟ فقلت مرة : أذهب ، ومرة لا أذهب ، ثم أجمع رأيي على الذهاب ، فناداني مناد من جانب البيت يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله وذروا البيع . .السابعة عشرة : قوله تعالى قل ما عند الله خير من اللهو ومن التجارة فيه وجهان : أحدهما : ما عند الله من ثواب صلاتكم خير من لذة لهوكم وفائدة تجارتكم .الثاني : ما عند الله من رزقكم الذي قسمه لكم خير مما أصبتموه من لهوكم وتجارتكم . وقرأ أبو رجاء العطاردي : \" قل ما عند الله خير من اللهو ومن التجارة للذين آمنوا \" .والله خير الرازقين أي خير من رزق وأعطى ; فمنه فاطلبوا ، واستعينوا بطاعته على نيل ما عنده من خيري الدنيا والآخرة .\n","ar.miqbas":"وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ وَاللَّهُ خَيْرُ الرَّازِقِينَ (11)عطف على جملة { إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله } [ الجمعة : 9 ] الآية . عُطف التوبيخ على ترك المأمور به بعد ذكر الأمر وسُلكت في المعطوفة طريقة الالتفات لخطاب النبي صلى الله عليه وسلم إيذاناً بأنهم أحرياء أن يصرف للخطاب عنهم فحرموا من عز الحضور . وأخبر عنهم بحال الغائبين ، وفيه تعريض بالتوبيخ .ومقتضى الظاهر أن يقال : وإذا رأيتم تجارة أو لهواً فلا تنفضّوا إليها . ومن مقتضيات تخريج الكلام على خلاف مقتضى الظاهر هنا أن يكون هذا التوبيخ غير شامل لجميع المؤمنين فإن نفراً منهم بَقُوا مع النبي صلى الله عليه وسلم حين خطبته ولم يخرجوا للتجارة ولا للهو .وفي «الصحيح» عن جابر بن عبد الله قال : «بينما نحن نصلّي مع النبي صلى الله عليه وسلم وهو يخطب يوم الجمعة إذْ أقبلتْ عير من الشام تحمل طعاماً فانفتل الناس إليها حتى لم يبق مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلاً أنا فيهم» . وفي رواية : وفيهم أبو بكر وعمر ، فأنزل الله فيهم هذه الآية التي في الجمعة { وإذا رأوا تجارة أو لهواً انفضوا إليها وتركوك قائماً } اه . وقد ذكروا في روايات أخرى أنه بقي مع النبي صلى الله عليه وسلم أبو بكر ، وعمر ، وعثمان ، وعلي ، وطلحة ، والزبير ، وسعد بن أبي وقاص ، وعبد الرحمان بن عوف ، وأبو عبيدة بن الجراح ، وسعيد بن زيد ، وبلال ، وعبد الله بن مسعود ، وعمار بن ياسر ، وجابر بن عبد الله ، فهؤلاء أربعة عشر . وذكر الدارقطني في حديث جابر : «أنه قال ليس مع رسول الله صلى الله عليه وسلم إلا أربعون رجلاً» .وعن مجاهد ومقاتل : «كان النبي صلى الله عليه وسلم يخطب فقدم دِحية بن خليفة الكلبي بتجارة فتلقاه أهله بالدفوف فخرج الناس» . وفي رواية «أن أهل المدينة أصابهم جوع وغلاء شديد فقدم دحية بتجارة من زيت الشام» . وفي رواية «وطعام وغير ذلك فخرج الناس من المسجد خشية أن يُسبقوا إلى ذلك» . وقال جابر بن عبد الله «كانت الجواري إذا نَكحن يمرّرن بالمزامير والطَّبْل فانفضّوا إليها» ، فلذلك قال الله تعالى : { وإذا رأوا تجارة أو لهواً انفضوا إليها وتركوك قائماً } ، فقد قيل إن ذلك تكرر منهم ثلاث مرات ، فلا شك أن خروجهم كان تارة لأجل مجيء العِير وتارة لحضور اللهو .وروي أن العِير نزلت بموضع يقال له : أحجار الزيت فتوهم الراوي فقال : بتجارة الزيت .وضمير { إليها } عائد إلى التجارة لأنها أهم عندهم من اللهو ولأن الحدث الذي نزلت الآية عنده هو مجيء عِير دحية من الشام . واكتفى به عن ضمير اللهو كما في قول قيس بن الخطيم ، أو عمرو بن الحارث بن امرىء القيس :نحن بما عندنا وأنت بما ... عندك راضضٍ والرأيُ مختلفولعل التقسيم الذي أفادته { أو } في قوله : { أو لهواً } تقسيم لأحوال المنفضّين إذ يكون بعضهم من ذوي العائلات خرجوا ليَمْتَاروا لأهلهم ، وبعضهم من الشباب لا همة لهم في الميرة ولكن أحبوا حضور اللهو .و { إذا } ظرف للزمان الماضي مجرد عن معنى الشرط لأن هذا الانفضاض مضى . وليس المراد أنهم سيعودون إليه بعد ما نزل هذا التوبيخ وما قبله من الأمر والتحريض . ومثله قوله تعالى : { وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به } [ النساء : 83 ] وقوله : { ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه تولوا } [ التوبة : 92 ] الآية .والانفضاض : مطاوع فَضَّه إذا فرقه ، وغلب إطلاقه على غير معنى المطاوعة ، أي بمعنى مطلق كما تفرق . قال تعالى : { هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضّوا } [ المنافقون : 7 ] .وقوله : { أو لهواً } فيه للتقسيم ، أي منهم من انفضّ لأجل التجارة ، ومنهم من انفضّ لأجل اللهو ، وتأنيث الضمير في قوله : { إليها } تغليب للفظ ( تجارة ) لأن التجارة كانت الداعي الأقوى لانفضاضهم .وجملة { وتركوك قائماً } تفظيع لفعلهم إذ فرطوا في سماع وعظ النبي صلى الله عليه وسلم أي تركوك قائماً على المنبر . وذلك في خطبة الجمعة ، والظاهر أنها جملة حالية ، أي تركوك في حال الموعظة والإِرشاد فأضاعوا علماً عظيماً بانفضاضهم إلى التجارة واللهو . وهذه الآية تدل على وجوب حضور الخطبة في صلاة الجمعة إذ لم يقل : وتركوا الصلاة .وأمر الله نبيئه صلى الله عليه وسلم أن يعظهم بأن ما عند الله من الثواب على حضور الجمعة خير من فائدة التجارة ولذة اللهو . وكذلك ما أعد الله من الرزق للذين يؤثرون طاعة الله على ما يشغل عنها من وسائل الارتزاق جزاء لهم على إيثارهم جزاء في الدنيا قبل جزاء الآخرة ، فرب رزق لم ينتفع به الحريص عليه وإن كان كثيراً ، وربّ رزق قليل ينتفع به صاحبه ويعود عليه بصلاح ، قال تعالى : { من عمل صالحاً من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون } [ النحل : 97 ] . وقال حكاية عن خطاب نوع قومه { فقلت استغفروا ربكم إنه كان غفّاراً يرسل السماء عليكم مدراراً ويمددكم بأموال وبنين ويجعل لكم جنات ويجعل لكم أنهاراً } [ نوح : 10 12 ] .وذيل الكلام بقوله : { والله خير الرازقين } لأن الله يرزق الرزق لمن يرضى عنه سليماً من الأكدار والآثام ، ولأنه يرزق خير الدنيا وخير الآخرة ، وليس غير الله قادراً على ذلك ، والناس في هذا المقام درجات لا يعلمها إلا الله وهو العالم بالسرائر .\n","ar.waseet":"ثم ختم - سبحانه - السورة الكريمة بعتاب يحمل فى طياته ثوب التأديب والإرشاد والتأنيب ، لمن آثر مطالب الدنيا على مطالب الآخرة فقال - تعالى - : ( وَإِذَا رَأَوْاْ تِجَارَةً أَوْ لَهْواً انفضوا إِلَيْهَا وَتَرَكُوكَ . . ) .قال الإمام ابن كثير ما ملخصه : يعاتب - تبارك وتعالى - على ما كان وقع من الانصراف عن الخطبة يوم الجمعة إلى التجارة ، التى قدمت المدينة يومئذ ، فقال : ( وَإِذَا رَأَوْاْ تِجَارَةً أَوْ لَهْواً انفضوا إِلَيْهَا وَتَرَكُوكَ قَآئِماً . . ) .فقد أخرج الشيخان وغيرهما عن جابر قال : قدمت عِيرٌ - أى : تجارة - المدينة ، ورسول الله - صلى الله عليه وسلم - يخطب يوم الجمعة - فخرج الناس ، وبقى اثنا عشر رجلا ، فنزلت هذه الآية .وفى رواية عن جابر - أيضا - أنه قال : \" بينما النبى - صلى الله عليه وسلم - يخطب يوم الجمعة ، فقدمت عير إلى المدينة ، فابتدرها الناس ، حتى لم يبق مع الرسول - صلى الله عليه وسلم - إلا اثنا عشر رجلا ، فقال - صلى الله عليه وسلم - : \" والذى نفسى بيده ، لو تتابعتم حتى لم يبق منكم أحد ، لسال بكم الوادى نارا \" ونزلت هذه الآية . . \"وفى رواية أن الذين بقوا فى المسجد كانوا أربعين ، وأن العير كانت لعبد الرحمن بن عوف ، وكان قد أصاب أهل المدينة جوع وغلاء سعر .وفى رواية أن الرسول - صلى الله عليه وسلم - كان يخطب ، فقدم دحية الكلى بتجارة له . فتلقاه أهله بالدفوف . فخرج الناس .و \" إذا \" فى قوله - تعالى - : ( وَإِذَا رَأَوْاْ تِجَارَةً . . ) ظرف للزمان الماضى المجرد عن الشرط ، لأن هذه الآية نزلت على الرسول - صلى الله عليه وسلم - بعد أن انفض عنه من انفض وهو يخطب وقوله : ( انفضوا ) من الانفضاض ، بمعنى التفرق . يقال : انفض فلان عن فلان إذا تركه وانصرف عنه ، وهو من الفض ، بمعنى كسر الشىء والتفريق بين أجزائه .والضمير فى قوله ( إِلَيْهَا ) يعود للتجارة ، وكانت عودته إليها دون اللهو ، لأن الانفضاض كان لها بالأصالة ، والمراد باللهو هنا : فرحهم بمجىء التجارة واستقبالهم لها بالدفوف ، لأنهم كانوا فى حالة شديدة من الفقر وغلاء الأسعار .والتعبير بأو يشير إلى أن بعض المنفضين قد انفضوا من أجل التجارة ، وأن البعض الآخر قد انفض من أجل اللهو .قال الجمل فى حاشيته : والذى سوغ لهم الخروج وترك الرسول - صلى الله عليه وسلم - يخطب ، أنهم ظنوا أن الخروج بعد تمام الصلاة جائز ، لانقضاء المقصود وهو الصلاة ، لأنه كان - صلى الله عليه وسلم - فى أول الإسلام يصلى الجمعة قبل الخطبة كالعيدين ، فلما وقعت هذه الواقعة ، ونزلت الآية ، قدم الخطبة وأخر الصلاة .وقوله - سبحانه - : ( وَتَرَكُوكَ قَآئِماً ) جملة حالية من فاعل ( انفضوا ) والمقصود بها توبيخ على هذا التصرف ، حيث تركوا رسول الله - صلى الله عليه وسلم - واقفا يخطب على المبنر ، وانصرفوا إلى التجارة واللهو .وقوله - سبحانه - : ( قُلْ مَا عِندَ الله خَيْرٌ مِّنَ اللهو وَمِنَ التجارة والله خَيْرُ الرازقين ) إرشاد لهم إلى ما هو الأنفع والأبقى والأكرم لهم .أى : قل - أيها الرسول الكريم - لهؤلاء الذين انفضوا عنك وأنت تخطب . . . قل لهم : ما عند الله - تعالى - من ثواب ومن عطاء خير من اللهو الذى يشغلكم عن ذكر الله ، ومن التجارة التى تبتغون من ورائها الربح المادى ، والمنافع العاجلة .والله - تعالى - هو خير الرازقين لأنه - سبحانه - هو وحده الذى يقسم الأرزاق ، وهو الذى يعطى ويمنع ، كما قال - سبحانه - : ( مَّا يَفْتَحِ الله لِلنَّاسِ مِن رَّحْمَةٍ فَلاَ مُمْسِكَ لَهَا وَمَا يُمْسِكْ فَلاَ مُرْسِلَ لَهُ مِن بَعْدِهِ وَهُوَ العزيز الحكيم ) وقدمت التجارة على اللهو فى صدر الآية ، لأن رؤيتها كانت الباعث الأعظم على الانفضاض إليها ، وترك الرسول - صلى الله عليه وسلم - قائما يخطب على المنبر ، ولم يبق معه إلا عدد قليل من أصحابه .وأخرت فى آخر الآية وقدم اللهو عليها ، ليكون ذمهم على انفضاضهم أشد وأوجع ، حتى لا يعودوا إلى مثل ذلك .هذا ، ومن الأحكام والآداب التى أخذها العلماء من هذه الآيات ما يأتى :1 - فضل يوم الجمعة ، وفضل صلاة يوم الجمعة ، والتحذير من ترك أدائها .ومن الأحاديث التى وردت فى هذا المعنى ، ما رواه مسلم وأبو داود والنسائى عن أبى هرير ، أن رسول الله - صلى الله عليه وسلم - قال : \" خير يوم طلعت فيه الشمس يوم الجمع ، فيه خلق آدم . وفيه أدخل الجنة ، وفيه أخرج منها ، ولا تقوم الساعة إلا فى يوم الجمعة \" .وروى الشيخان عن أبى هريرة أنه سمع النبى - صلى الله عليه وسلم - يقول : \" نحن الآخرون - أى : زمنا - السابقون يوم القيامة قبل غيرهم - ، بيد أنهم - أى : اليهود والنصارى - أوتوا الكتاب من قبلنا ، وأوتيناه من بعدهم ، ثم هذا يومهم الذى فرض عليهم - أى : تعظيمه - فاختلفوا فيه فهدانا الله ، فالناس لنا فيه تبع : اليهود غدا - أى : السبت - والنصارى بعد غد - أى : الأحد - \" .وروى مسلم والنسائى عن ابن عمر أنه سمع النبى - صلى الله عليه وسلم - يقول على أعواد مبره : \" لينتهين أقوام عن وَدْعِهم الجمعات - أى : تركهم صلاة الجمعة - أو ليختمن الله على قلوبهم ، ثم ليكونن من الغافلين .. \" .قال القربطى ما ملخصه : وإنما سميت الجمعة جمعة ، لأنها مشتقة من الجمع حيث يجتمع الناس فيها للصلاة . . . وكان يقال ليوم الجمعة : العَرُوبة . .قال البيهقى : وروينا عن موسى بن عقبة ، عن ابن شهاب الزهرى ، أن مصعب بن عمير ، كان أول من جمَّع الجمعة بالمدينة بالمسلمين ، قبل أن يهاجر إليها الرسول - صلى الله عليه وسلم - .ثم قال القرطبى : وأما أول جمعة جمعها - صلى الله عليه وسلم - بأصحابه ، قال أهل السير والتاريخ : قدم رسول الله - صلى الله عليه وسلم - مهاجرا حتى نزل بقباء ، على بنى عمروا بن عوف ، يوم الاثنين لاثنتى عشرة ليلة خلت من شهر ربيع الأول حين اشتد الضحى - ومن تلك السنة يعد التاريخ - فأقام بقباء إلى يوم الخميس ، وأسس مسجدهم ثم خرج يوم الجمعة إلى المدينة ، فأدركته الجمعة فى بنى سالم بن عوف ، فى بطن وادٍ لهم ، فجمع بهم وخطب ، وهى أول خطبة خطبها بالمدينة ، وقال فيها : الحمد لله ، أحمده وأستعينه ، وأستغفره ، وأستهديه . . .2 - الآية الكريمة وإن كانت قد أمرت المؤمنين بالسعى إلى صلاة الجمعة عند النداء لها ، إلا أن هناك أحاديث متعددة تحض على التبكير بالحضور إليها ، وبالغسل لها ، وبمس الطب ، وبالحضور إليها على أحسن حالة . . .ومن تلك الأحاديث ما رواه الشيخان وغيرهما عن أبى هريرة أن رسول الله - صلى الله عليه وسلم - قال : \" من اغتسل يوم الجمعة غسل الجنابة - أى : كغسل الجنابة - ثم راح إلى المسجد ، فكأنما قرب بدنة - أى : ناقة ضخمة . . . . ومن راح فى الساعة الثانية فكأنما قرب بقرة ، ومن راح فى الساعة الثالثة فكأنما قرب كبشا أقرن - أى له قرون - ومن راح فى الساعة الرابعة فكأنما قرب دجاجة ، ومن راح فى الساعة الخامسة فكأنما قرب بيضة ، فإذا خرج الإمام حضرت الملائكة يستمعون الذكر \" .وروى ابن ماجه عن ابن مسعود قال : سمعت النبى - صلى الله عليه وسلم - يقول : \" إن الناس يجلسون يوم القيامة على قدر تراوحهم إلى الجمعات ، الأول ثم الثانى ثم الثالث ثم الرابع ، وما رابع أربعة من الله ببعيد \" .وروى الشيخان عن أبى سعيد الخدرى ، عن النبى - صلى الله عليه وسلم - أنه قال : \" على كل مسلم الغسل يوم الجمعة ، ويلبس من صالح ثيابه ، وإن كل طيب مس منه . . . \" .3 - أخذ العلماء من قوله - تعالى - : ( . . . إِذَا نُودِيَ لِلصَّلاَةِ مِن يَوْمِ الجمعة فاسعوا إلى ذِكْرِ الله وَذَرُواْ البيع . . . ) أن صلاة الجمعة فريضة محكمة ، وأن السعى لأدائها واجب ، وأن ترك ذلك محرم شرعا .. .ومن المعروف بين العلمءا أن الأمر يقتضى الوجوب ، ما لم يوجد له صارف ، ولا صارف له هنا . . .قال الإمام القرطبى : فرض الله - تعالى - الجمعة على كل مسلم ، ردا على من يقول : إنها فرض على الكفاية ، ونقل عن بعض الشافعية أنها سنة .وجمهور الأمة الأئمة أنها فرض على الأعيان ، لقوله - تعالى - : ( . . . إِذَا نُودِيَ لِلصَّلاَةِ مِن يَوْمِ الجمعة فاسعوا إلى ذِكْرِ الله وَذَرُواْ البيع . . . ) .وثبت عن رسول الله - صلى الله عليه وسلم - أنه قال : \" لينتهِيَنَّ أقوامٌ عن وَدْعِهم الجُمُعَاتِ أو ليخَتِمَنَّ الله على قلوبهم ثم ليكونُنَّ من الغافلين \" .وهذا حجة واضحة فى وجوب الجمعة وفرضيتها . .قال بعض العلماء : جاء فى الآية الكريمة الأمر بالسعى ، والأمر للوجوب فيكون السعى واجبا ، وقد أخذ العلماء من ذلك أن الجمعة فريضة ، لأنه - سبحانه - قد رتب الأمر للذكر على النداء للصلاة ، فأذا كان المراد بالذكر هو الصلاة ، فالدلالة ظاهرة ، لأنه لا يكون السعى لشىء واجبا ، حتى يكون ذلك الشىء واجبا .وأما إذا كان المراد بالذكر الخطبة فقط ، فهو كذلك لأن الخطبة شرط الصلاة ، وقد أمر بالسعى إليه ، والأمر للوجوب ، فإذا وجب السعى للمقصود تبعا ، فما ذلك إلا لأن المقصود بالذات واجب . .كما أن الاشتغال بالبيع أو الشراء وقت النداء محرم ، لأن الأمر للوجوب ، وقال بعضهم : هو مكروه كراهة تحريم .ومما يدل على أن صلاة الجمعة فريضة محكمة ، وأن السعى إليها واجب ، وأن الاشتغال عنها بالبيع أبو الشراء محرم ، ما جاء فى الأحاديث من الأمر بالمحافظة عليها ، ومن التحذير من تركها ، ومن ذلك ما رواه أبو داود من حديث أبى الجعد ، أن رسول الله - صلى الله عليه وسلم - قال : \" من ترك ثلاث جمع تهاونا بها ، طبع الله على قلبه \" .4 - قوله - تعالى - : ( فَإِذَا قُضِيَتِ الصلاة فانتشروا فِي الأرض . . ) يدل دلالة واضحة ، على سمو شريعة الإسلام ، وعلى سماحتها ويسرها ، وجمعها بين مطالب الدنيا ومطالب الآخرة .ومع أن هذا الأمر بالانتشار بعد الصلاة للإباحة - كما سبق أن قلنا - إلا أن بعض السف كان إذا انتهت الصلاة ، خرج من المسجد ، ودار فى السوق ساعة ، ثم رجع إلى المسجد فصلى ما شاء أن يصلى .قال الإمام ابن كثير : كان عراك بن مالك - أحد كبار التابعين - أحد كبار التابعين - إذا صلى الجمعة ، انصرف فوقف على باب المسجد وقال : اللهم إنى أجبت دعوتك وصليت فريضتك ، وانتشرت كما أمرتنى ، فارزقنى من فضلك وأنت خير الرازقين .هذا ، وهناك أحكام أخرى توسع المفسرون والفقهاء فى الحديث عنها ، فليرجع إليها من شاء المزيد من معرفة هذه الأحكام والآداب .\n","ar.baghawi":"قوله - عز وجل - ( وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ) الآية ، أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا حفص بن عمر ، حدثنا خالد بن عبد الله [ أخبرنا حصين ] عن سالم بن أبي الجعد وعن أبي سفيان عن جابر بن عبد الله قال : أقبلت عير يوم الجمعة ونحن مع النبي - صلى الله عليه وسلم - فثار الناس إلا اثني عشر رجلا فأنزل الله : \" وإذا رأوا تجارة أو لهوا انفضوا إليها \" .ويحتج بهذا الحديث من يرى [ إقامة ] الجمعة باثني عشر رجلا . وليس فيه بيان أنه أقام بهم الجمعة حتى يكون حجة لاشتراط هذا العدد . وقال ابن عباس في رواية الكلبي : لم يبق في المسجد إلا ثمانية رهط .وقال الحسن وأبو مالك : أصاب أهل المدينة جوع وغلاء سعر فقدم دحية بن خليفة الكلبي بتجارة زيت من الشام والنبي - صلى الله عليه وسلم - يخطب يوم الجمعة ، فلما رأوه قاموا إليه بالبقيع خشوا أن يسبقوا إليه ، فلم يبق مع النبي - صلى الله عليه وسلم - إلا رهط منهم أبو بكر وعمر فنزلت هذه الآية ، فقال رسول الله - صلى الله عليه وسلم - \" والذي نفس محمد بيده لو تتابعتم حتى لا يبقى منكم أحد لسال بكم الوادي نارا \"وقال مقاتل : بينا رسول الله - صلى الله عليه وسلم - يخطب يوم الجمعة إذ قدم دحية بن خليفة الكلبي من الشام بالتجارة ، وكان إذا قدم لم تبق بالمدينة عاتق إلا أتته ، وكان يقدم إذا قدم بكل ما يحتاج إليه من دقيق وبر وغيره ، فينزل عند أحجار الزيت ، وهو مكان في سوق المدينة ، ثم يضرب بالطبل ليؤذن الناس بقدومه فيخرج إليه الناس ليبتاعوا منه فقدم ذات جمعة وكان ذلك قبل أن يسلم ورسول الله - صلى الله عليه وسلم - قائم على المنبر يخطب فخرج إليه الناس فلم يبق في المسجد إلا اثنا عشر رجلا وامرأة ، فقال النبي - صلى الله عليه وسلم - : \" كم بقي في المسجد ؟ فقالوا : اثنا عشر رجلا وامرأة ، فقال النبي - صلى الله عليه وسلم - : \" لولا هؤلاء لسومت لهم الحجارة من السماء \" فأنزل الله هذه الآية وأراد باللهو الطبل .وقيل : كانت العير إذا قدمت المدينة استقبلوها بالطبل والتصفيق . وقوله : \" انفضوا إليها \" رد الكناية إلى التجارة لأنها أهم . وقال علقمة : سئل عبد الله بن عمر : أكان النبي - صلى الله عليه وسلم - يخطب قائما أو قاعدا ؟ قال : أما تقرأ \" وتركوك قائما \" .أخبرنا عبد الوهاب بن محمد الخطيب ، أخبرنا عبد العزيز بن أحمد الخلال ، حدثنا أبو العباس الأصم ، أخبرنا الربيع ، أخبرنا الشافعي ، أخبرنا إبراهيم بن محمد ، أخبرني جعفر بن محمد عن أبيه عن جابر بن عبد الله : كان النبي - صلى الله عليه وسلم - يخطب يوم الجمعة خطبتين قائما يفصل بينهما بجلوس .أخبرنا إسماعيل بن عبد القاهر ، أخبرنا عبد الغافر بن محمد ، أخبرنا محمد بن عيسى ، حدثنا إبراهيم بن محمد بن سفيان ، حدثنا مسلم بن الحجاج ، حدثنا أبو بكر بن أبي شيبة ، أخبرنا أبو الأحوص ، عن سماك عن جابر بن سمرة قال : كان للنبي - صلى الله عليه وسلم - خطبتان يجلس بينهما يقرأ القرآن ويذكر الناسوبهذا الإسناد عن جابر بن سمرة قال : كنت أصلي مع النبي - صلى الله عليه وسلم - فكانت صلاته قصدا وخطبته قصداوالخطبة فريضة في صلاة الجمعة ، ويجب أن يخطب قائما خطبتين ، وأقل ما يقع عليه اسم الخطبة : أن يحمد الله ، ويصلي على النبي - صلى الله عليه وسلم - ويوصي بتقوى الله ، هذه الثلاثة فرض في الخطبتين جميعا ويجب أن يقرأ في الأولى آية من القرآن ، ويدعو للمؤمنين في الثانية ، فلو ترك واحدة من هذه الخمس لا تصح جمعته عند الشافعي وذهب أبو حنيفة رضي الله عنه إلى أنه لو أتى بتسبيحة أو تحميدة أو تكبيرة أجزأه . وهذا القدر لا يقع عليه اسم الخطبة ، وهو مأمور بالخطبة .أخبرنا الإمام أبو علي الحسين بن محمد القاضي ، أخبرنا عبد الله بن يوسف بن محمد بن مامويه ، أخبرنا أبو سعيد أحمد بن محمد بن زياد البصري بمكة ، حدثنا الحسن بن الصباح الزعفراني ، حدثنا عبد الوهاب بن عبد المجيد الثقفي عن جعفر بن محمد عن أبيه عن عبيد الله بن أبي رافع أن مروان استخلف أبا هريرة على المدينة ، فصلى بهم أبو هريرة الجمعة فقرأ سورة الجمعة في الركعة الأولى وفي الثانية : \" إذا جاءك المنافقون \" ( المنافقون - 1 ) فقال عبيد الله : فلما انصرفنا مشيت إلى جنبه فقلت له : لقد قرأت بسورتين سمعت علي بن أبي طالب يقرأ بهما في الصلاة ؟ فقال سمعت النبي - صلى الله عليه وسلم - يقرأ بهماأخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب ، عن مالك ، عن ضمرة بن سعيد المازني عن عبيد الله بن عبد الله بن عتبة أن الضحاك بن قيس سأل النعمان بن بشير ماذا كان يقرأ به رسول الله - صلى الله عليه وسلم - يوم الجمعة على إثر سورة الجمعة ؟ فقال : كان يقرأ ب \" هل أتاك حديث الغاشية \" .أخبرنا أبو عثمان الضبي ، أخبرنا أبو محمد الجراحي ، حدثنا أبو العباس المحبوبي ، حدثنا أبو عيسى حدثنا قتيبة ، حدثنا أبو عوانة عن إبراهيم بن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن النعمان بن بشير قال : كان النبي - صلى الله عليه وسلم - يقرأ في العيدين وفي الجمعة ب \" سبح اسم ربك الأعلى \" و \" هل أتاك حديث الغاشية \" وربما اجتمع في يوم واحد فيقرأ بهما .ولجواز الجمعة خمس شرائط : الوقت وهو : وقت الظهر ما بين زوال الشمس إلى دخول وقت العصر ، والعدد والإمام والخطبة ودار الإقامة فإذا فقد شرط من هذه الخمسة يجب أن يصلوها ظهرا . .ولا يجوز للإمام أن يبتدئ الخطبة قبل اجتماع العدد ، وهو عدد الأربعين عند الشافعي فلو اجتمعوا وخطب بهم ثم انفضوا قبل افتتاح الصلاة أو انتقص واحد من العدد لا يجوز أن يصلي بهم الجمعة ، بل يصلي الظهر ، ولو افتتح بهم الصلاة ثم انفضوا فأصح أقوال الشافعي أن بقاء الأربعين شرط إلى آخر الصلاة ، [ كما أن بقاء الوقت شرط إلى آخر الصلاة ] فلو انتقص واحد منهم قبل أن يسلم الإمام يجب على الباقين أن يصلوها أربعا . وفيه قول آخر : إن بقي معه اثنان أتمها جمعة . وقيل : إن بقي معه واحد أتمها جمعة ، وعند المزني إذا نقصوا بعد ما صلى الإمام بهم ركعة أتمها جمعة ، وإن بقي وحده فإن كان في الركعة الأولى يتمها أربعا وإن انتقص من العدد واحد ، وبه قال أبو حنيفة في العدد الذي شرطه كالمسبوق إذا أدرك مع الإمام ركعة من الجمعة فإذا سلم الإمام أتمها جمعة وإن أدرك أقل من ركعة أتمها أربعا . .قوله - عز وجل - : ( قل ما عند الله خير من اللهو ومن التجارة ) أي ما عند الله من الثواب على الصلاة والثبات مع النبي - صلى الله عليه وسلم - خير من اللهو ومن التجارة ( والله خير الرازقين ) لأنه موجد الأرزاق فإياه فاسألوا ومنه فاطلبوا .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5188.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5188.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5188.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":190,"letters":1441,"size":"184KB","priority":2,"commonlyRead":false}}