{"chapter":64,"name":{"arabic":"سورة 64","transliteration":"Chapter 64","translation":"Chapter 64","revelation":"unknown"},"revelation":"unknown","verses":18,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","transliteration":"Yusabbihu lillaahi maa fis samaawaati wa maa fil ardi lahul mulku wa lahul hamd, wa Huwa 'alaa kulli shai 'in Qadeer","translations":{"en.ahmedali":"ALL THAT THERE is in the heavens and the earth sings the praises of God. His the sovereignty and His is the praise, and He has power over everything.","en.ahmedraza":"All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah; His only is the kingship and His only is all praise; and He is Able to do all things.","en.arberry":"All that is in the heavens and the earth magnifies God. His is the Kingdom, and His is the praise, and He is powerful over everything.","en.asad":"ALL THAT IS in the heavens and all that is on earth extols God's limitless glory: His is all dominion, and to Him all praise is due; and He has the power to will anything.","en.daryabadi":"Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah. His is the dominion; and His is the praise; and He is over everything potent.","en.hilali":"Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belong all the praises and thanks, and He is Able to do all things.","en.pickthall":"All that is in the heavens and all that is in the earth glorifieth Allah; unto Him belongeth Sovereignty and unto Him belongeth praise, and He is Able to do all things.","en.qaribullah":"All that is in heavens and earth exalt Allah. His is the Kingdom, and His the Praise. He is powerful over all things.","en.sahih":"Whatever is in the heavens and whatever is on the earth is exalting Allah. To Him belongs dominion, and to Him belongs [all] praise, and He is over all things competent.","en.sarwar":"All that is in the heavens and the earth glorify God. To Him belongs the Kingdom and all praise. He has power over all things.","en.yusufali":"Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah: to Him belongs dominion, and to Him belongs praise: and He has power over all things.","en.maududi":"All that is in the heavens and all that is in the earth extols Allah's glory. His is the sovereignty and to Him is all praise due; He has power over everything.","en.shakir":"Whatever is in the heavens and whatever is in the earth declares the glory of Allah; to Him belongs the kingdom, and to Him is due (all) praise, and He has power over all things.","en.itani":"Everything in the heavens and the earth praises God. To Him belongs the Kingdom, and to Him all praise is due, and He is Able to do all things.","en.mubarakpuri":"Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belongs the praise, and He is Able to do all things.","en.qarai":"Whatever there is in the heavens and the earth glorifies Allah. To Him belongs all sovereignty and to Him belongs all praise, and He has power over all things.","en.wahiduddin":"All that is in the heavens and on the earth extols the glory of God. To Him belongs the Kingdom and to Him all praise is due. He has power over all things."},"tafsir":{"ar.muyassar":"ينزِّه الله عما لا يليق به كل ما في السموات وما في الأرض، له سبحانه التصرف المطلق في كل شيء، وله الثناء الحسن الجميل، وهو على كل شيء قدير.","ar.jalalayn":"«يسبح لله ما في السماوات وما في الأرض» ينزهه فاللام زائدة، وأتى بما دون من تغليبا للأكثر «له الملك وله الحمد وهو على كل شيء قدير».","ar.qurtubi":"وهي مدنية في قول الأكثرين .وقال الضحاك : مكية .وقال الكلبي : هي مكية ومدنية .وهي ثماني عشرة آية .وعن ابن عباس أن \" سورة التغابن \" نزلت بمكة ; إلا آيات من آخرها نزلت بالمدينة في عوف بن مالك الأشجعي , شكا إلى رسول الله صلى الله عليه وسلم جفاء أهله وولده , فأنزل الله عز وجل : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم \" [ التغابن : 14 ] إلى آخر السورة .وعن عبد الله بن عمر قال : قال النبي صلى الله عليه وسلم : ( ما من مولود يولد إلا وفي تشابيك رأسه مكتوب خمس آيات من فاتحة \" سورة التغابن \" .قال ابن عباس : صلى لله \" ما في السموات \" ممن خلق من الملائكة \" والأرض \" من شيء فيه روح أو لا روح فيه .وقيل : هو تسبيح الدلالة .وأنكر الزجاج هذا وقال : لو كان هذا تسبيح الدلالة وظهور آثار الصنعة لكانت مفهومة , فلم قال : \" ولكن لا تفقهون تسبيحهم \" [ الإسراء : 44 ] وإنما هو تسبيح مقال .واستدل بقوله تعالى : \" وسخرنا مع داود الجبال يسبحن \" [ الأنبياء : 79 ] فلو كان هذا تسبيح دلالة فأي تخصيص لداود ؟ !وقيل المراد به تسبيح الدلالة , وكل محدث يشهد على نفسه بأن الله عز وجل خالق قادر .وقالت طائفة : هذا التسبيح حقيقة , وكل شيء على العموم يسبح تسبيحا لا يسمعه البشر ولا يفقهه , ولو كان ما قاله الأولون من أنه أثر الصنعة والدلالة لكان أمرا مفهوما , والآية تنطق بأن هذا التسبيح لا يفقه .وأجيبوا بأن المراد بقوله : \" لا تفقهون \" الكفار الذين يعرضون عن الاعتبار فلا يفقهون حكمة الله سبحانه وتعالى في الأشياء .وقالت فرقة : قوله \" من شيء \" عموم , ومعناه الخصوص في كل حي ونام , وليس ذلك في الجمادات .ومن هذا قول عكرمة : الشجرة تسبح والأسطوان لا يسبح .وقال يزيد الرقاشي للحسن وهما في طعام وقد قدم الخوان : أيسبح هذا الخوان يا أبا سعيد ؟ فقال : قد كان يسبح مرة ; يريد أن الشجرة في زمن ثمرها واعتدالها كانت تسبح , وأما الآن فقد صار خوانا مدهونا .قلت : ويستدل لهذا القول من السنة بما ثبت عن ابن عباس رضي الله تعالى عنهما أن النبي صلى الله عليه وسلم مر على قبرين فقال : ( إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان يمشي بالنميمة وأما الآخر فكان لا يستبرئ من البول ) قال : فدعا بعسيب رطب فشقه اثنين , ثم غرس على هذا واحدا وعلى هذا واحدا ثم قال : ( لعله يخفف عنهما ما لم ييبسا ) .فقوله عليه الصلاة والسلام .( ما لم ييبسا ) إشارة إلى أنهما ما داما رطبين يسبحان , فإذا يبسا صارا جمادا .والله أعلم .وفي مسند أبي داود الطيالسي : فتوضع على أحدهما نصفا وعلى الآخر نصفا وقال : ( لعله أن يهون عليهما العذاب ما دام فيهما من بلولتهما شيء ) .قال علماؤنا : ويستفاد من هذا غرس الأشجار وقراءة القرآن على القبور , وإذا خفف عنهم بالأشجار فكيف بقراءة الرجل المؤمن القرآن .وقد بينا هذا المعنى في كتاب التذكرة بيانا شافيا , وأنه يصل إلى الميت ثواب ما يهدى إليه .والحمد لله على ذلك .وعلى التأويل الثاني لا يحتاج إلى ذلك ; فإن كل شيء من الجماد وغيره يسبح .قلت : ويستدل لهذا التأويل وهذا القول من الكتاب بقوله سبحانه وتعالى : \" واذكر عبدنا داود ذا الأيد إنه أواب .إنا سخرنا الجبال معه يسبحن بالعشي والإشراق \" [ ص : 17 - 18 ] , وقوله : \" وإن منها لما يهبط من خشية الله \" [ البقرة : 74 ] - على قول مجاهد - , وقوله : \" وتخر الجبال هدا .أن دعوا للرحمن ولدا \" [ مريم : 90 - 91 ] .وذكر ابن المبارك في ( دقائقه ) أخبرنا مسعر عن عبد الله بن واصل عن عوف بن عبد الله قال قال عبد الله بن مسعود رضي الله عنه : إن الجبل يقول للجبل : يا فلان , هل مر بك اليوم ذاكر لله عز وجل ؟ فإن قال نعم سر به .ثم قرأ عبد الله \" وقالوا اتخذ الرحمن ولدا \" الآية .قال : أفتراهن يسمعن الزور ولا يسمعن الخير .وفيه عن أنس بن مالك رضي الله عنه قال : ما من صباح ولا رواح إلا تنادي بقاع الأرض بعضها بعضا .يا جاراه ; هل مر بك اليوم عبد فصلى لله أو ذكر الله عليك ؟ فمن قائلة لا , ومن قائلة نعم , فإذا قالت نعم رأت لها بذلك فضلا عليها .وقال رسول الله صلى الله عليه وسلم : ( لا يسمع صوت المؤذن جن ولا إنس ولا شجر ولا حجر ولا مدر ولا شيء إلا شهد له يوم القيامة ) .رواه ابن ماجه في سننه , ومالك في موطئه من حديث أبي سعيد الخدري رضي الله عنه .وخرج البخاري عن عبد الله رضي الله عنه قال : لقد كنا نسمع تسبيح الطعام وهو يؤكل .في غير هذه الرواية عن ابن مسعود رضي الله تعالى عنه : كنا نأكل مع رسول الله صلى الله عليه وسلم الطعام ونحن نسمع تسبيحه .وفي صحيح مسلم عن جابر بن سمرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم : ( إني لأعرف حجرا بمكة كان يسلم علي قبل أن أبعث إني لأعرفه الآن ) .قيل : إنه الحجر الأسود , والله أعلم .والأخبار في هذا المعنى كثيرة ; وقد أتينا على جملة منها في اللمع اللؤلئية في شرح العشرينيات النبوية للفاداري رحمه الله , وخبر الجذع أيضا مشهور في هذا الباب خرجه البخاري في موضع من كتابه .وإذا ثبت ذلك في جماد واحد جاز في جميع الجمادات , ولا استحالة في شيء من ذلك ; فكل شيء يسبح للعموم .وكذا قال النخعي وغيره : هو عام فيما فيه روح وفيما لا روح فيه حتى صرير الباب .واحتجوا بالأخبار التي ذكرنا .وقيل : تسبيح الجمادات أنها تدعو الناظر إليها إلى أن يقول : سبحان الله ! لعدم الإدراك منها .وقال الشاعر : تلقى بتسبيحة من حيث ما انصرفت وتستقر حشا الرائي بترعاد أي يقول من رآها : سبحان خالقها .فالصحيح أن الكل يسبح للأخبار الدالة على ذلك لو كان ذلك التسبيح تسبيح دلالة فأي تخصيص لداود , وإنما ذلك تسبيح المقال بخلق الحياة والإنطاق بالتسبيح كما ذكرنا .وقد نصت السنة على ما دل عليه ظاهر القرآن من تسبيح كل شيء فالقول به أولى .والله أعلم .\n","ar.miqbas":"يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (1)لما كان جُلّ ما اشتملت عليه هذه السورة إبطالَ إشراك المشركين وزجرهم عن دين الإِشراك بأسره وعن تفاريعه التي أعظمها إنكارهم البعث وتكذيبهم الرسول صلى الله عليه وسلم وتكذيب القرآن وتلك أصول ضلالهم ابتُدئت السورة بالإِعلان بضلالهم وكفرانهم المنعم عليهم ، فإن ما في السماوات والأرض يسبح لله تعالى عن النقائص : إما بلسان المقال مثل الملائكة والمؤمنين أو بلسان الحال مثل عبادة المطيعين من المخلوقات المدركة كالملائكة والمؤمنين ، وإما بلسان الحال مثل دلالة حال الاحتياج إلى الإِيجاد والإِمداد كحاجة الحيوان إلى الرزق وحاجة الشجرة إلى المطر وما يشهد به حال جميع تلك الكائنات من أنها مربوبة لله تعالى ومسخرة لما أراده منها . وكل تلك المخلوقات لم تنقض دلالة حالها بنقائض كفر مقالها فلم يخرج عن هذا التسبيح إلا أهل الضلال من الإِنس والشياطين فإنهم حَجبوا بشهادة حالهم لما غشوها به من صرح الكفر .فالمعنى : يسبح لله ما في السماوات والأرض وأنتم بخلاف ذلك .وهذا يفيد ابتداء تقرير تنزيه الله تعالى وقوة سلطانه ليزداد الذين آمنوا إيماناً ويكون لهم تعليماً وامتناناً ويفيد ثانياً بطريق الكناية تعريضاً بالمشركين الذين لم ينزهوه ولا وقروه فنسبوا إليه شركاء .وجيء بفعل التسبيح مضارعاً للدلالة على تجدّد ذلك التسبيح ودوامه وقد سبق نظيره في فاتحة سورة الجمعة .وجيء به في فواتح سُور : الحديد ، والحشر ، والصف بصيغة الماضي للدلالة على أن التسبيح قد استقر في قديم الأزمان . فحصل من هذا التفنن في فواتح هذه السورة كلا المعنيين زيادة على ما بيناه من المناسبة الخاصة بسورة الجمعة ، وما في هاته السورة من المناسبة بين تجدد التسبيح والأمر بالعفو عن ذوي القربى والأمر بالتقوى بقدر الاستطاعة والسمع والطاعة لكي لا يكتفي المؤمنون بحصول إيمانهم ليجتهدوا في تعزيزه بالأعمال الصالحة .وإعادة { ما } الموصولة في قوله : { وما في الأرض } لقصد التوكيد اللفظي .وجملة { له الملك } استئناف واقع موقع التعليل والتسبب لمضمون يسبح لله ما في السماوات وما في الأرض فإن ملابسة جميع الموجودات لدلائل تنزيه الله تعالى عن الشركاء وعن النقائص لا مقتضى لها إلا انفرادُه بتملكها وإيجادها وما فيها من الاحتياج إليه وتصرفه فيها تصرف المالك المتفرد في ملكه .وفي هذه الجملة تنويه بإقبال أهل السماوات والأرض على تسبيح الله وتجديد ذلك التسبيح .فتقديم المسند على المسند إليه لإِفادة تخصيصه بالمسند إليه ، أي قصر تعلق لام الاستحقاق بالملك عليه تعالى فلا ملك لغيره وهو قصر ادعائي مبني على عدم الاعتداد بما لغير الله من ملك لنقصه وعدم خلوّه عن الحاجة إلى غيره من هو له بخلاف ملكه تعالى فهو الملك المطلق الداخل في سلطانه كل ذي ملك .وجملة { وله الحمد } مضمونها سبب لتسبيح الله ما في السماوات وما في الأرض ، إذ التسبيح من الحمد ، فلا جرم أن كان حمد ذوي الإِدراك مختصاً به تعالى إذ هو الموصوف بالجميل الاختياري المطلق فهو الحقيق بالحمد والتسبيح .فهذا القصر ادعائي لعدم الاعتداد بحمد غيره لنقصان كمالاتهم وإذا أريد بالحمد ما يشمل الشكر أو يفضي إليه كما في الحديث « الحمد رأس الشكر لم يشكر الله عبد لم يحمده » وهو مقتضى المقام من تسفيه أحلام المشركين في عبادتهم غيره فالشكر أيضاً مقصور عليه تعالى لأنه المنعم الحق بنعم لا قبل لغيره بإسدائها ، وهو المفيض على المنعمين ما ينعمون به في الظاهر ، قال تعالى : { وما بكم من نعمة فمن الله } [ النحل : 53 ] كما تقدم في تفسير أول سورة الفاتحة .وجملة { وهو على كل شيء قدير } معطوفة على اللتين قبلها وهي بمنزلة التذييل لهما والتبيين لوجه القصرين فيهما ، فإن التقدير على كل شيء هو صاحب الملك الحق وهو المختص بالحمد الحق .وفي هذا التذييل وعد للشاكرين ووعيد وترهيب للمشركين .والاقتصار على ذكر وَصف { قدير } هنا لأن المخلوقات التي تسبح الله دالة على صفة القدرة أولاً لأن من يشاهد المخلوقات يعلم أن خالقها قادر .\n","ar.waseet":"سورة \" التغابن \" هى آخر السور المفتتحة بالتسبيح ، فقد قال - سبحانه - فى مطلعها .( يُسَبِّحُ لِلَّهِ مَا فِي السماوات وَمَا فِي الأرض . . . ) أى : ينزه الله - تعالى - عن كل نقص ، ويجله عن كل مالا يليق به ، جميع الكائنات التى فى سماواته - سبحانه - وفى أرضه ، كما قال - عز وجل - : ( تُسَبِّحُ لَهُ السماوات السبع والأرض وَمَن فِيهِنَّ وَإِن مِّن شَيْءٍ إِلاَّ يُسَبِّحُ بِحَمْدِهِ ولكن لاَّ تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيماً غَفُوراً ) وجىء هنا وفى سورة الجمعة بصيغة المضارع ( يُسَبِّحُ ) للدلالة على تجدد هذا التسبيح ، وحدوثه فى كل وقت وآن .وجىء فى سورة الحديد ، والصف ، بصيغة الماضى ( سَبَّحَ ) . للدلالة على أن التسبيح قد استقر وثبت لله - تعالى - وحده ، من قديم الزمان .وقوله - سبحانه - : ( لَهُ الملك وَلَهُ الحمد وَهُوَ على كُلِّ شَيْءٍ قَدِيرٌ ) مؤكد لما قبله ، من بيان أن جميع الكائنات تسبح لله - تعالى - لأنه مالكها وصاحب الفضل المطلق عليها .وتقديم الجار والمجرور ( لَهُ ) لإفادة الاختصاص والقصر .أى : له - سبحانه - وحده ملك هذا الكون ، وله وحده الحمد التام المطلق من جميع مخلوقاته ، وليس لغيره شىء منهما ، وإذا وجد شىء منهما لغيره فهو من فيضه وعطائه ، إذ هو - سبحانه - القدير الذى لا يقف فى وجه قدرته وإرادته شىء .\n","ar.baghawi":"مدنيةقال عطاء هي مكية إلا ثلاث آيات من قوله: \"يا أيها الذين آمنوا إن من أزواجكم وأولادكم\" إلى آخرهن. \"يسبح لله ما في السموات وما في الأرض له الملك وله الحمد وهو على كل شيء قدير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5200.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5200.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5200.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","transliteration":"Huwal lazee khalaqakum faminkum kaafirunw wa min kum mu'min ; wallaahu bimaa ta'maloona Baseer","translations":{"en.ahmedali":"It is He who created you, though one of you is an infidel and one of you a believer; yet God perceives what you do.","en.ahmedraza":"It is He Who has created you, so among you one is a disbeliever whereas another is a Muslim; and Allah is seeing your deeds.","en.arberry":"It is He who created you. One of you is an unbeliever, and one of you a believer; and God sees the things you do.","en.asad":"He it is who has created you: and among you are such as deny this truth, and among you are such as believe [in it]. And God sees all that you do.","en.daryabadi":"He it is Who hath created you; then of you some are Infidels and of you some are believers; and Allah is of that which ye Work Beholder.","en.hilali":"He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do.","en.pickthall":"He it is Who created you, but one of you is a disbeliever and one of you is a believer, and Allah is Seer of what ye do.","en.qaribullah":"It is He who created you. Amongst you is an unbeliever and amongst you is a believer. Allah sees the things you do.","en.sahih":"It is He who created you, and among you is the disbeliever, and among you is the believer. And Allah, of what you do, is Seeing.","en.sarwar":"It is He who has created you all but some of you have accepted the faith and some of you have not. God is Well Aware of what you do.","en.yusufali":"It is He Who has created you; and of you are some that are Unbelievers, and some that are Believers: and Allah sees well all that ye do.","en.maududi":"He it is Who has created you: and among you are those that deny the Truth and among you are those that believe in it. Allah observes all that you do.","en.shakir":"He it is Who created you, but one of you is an unbeliever and another of you is a believer; and Allah sees what you do.","en.itani":"It is He who created you. Some of you are unbelievers, and some of you are believers. And God perceives what you do.","en.mubarakpuri":"He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do.","en.qarai":"It is He who created you. Then some of you are faithless and some of you are faithful, and Allah watches what you do.","en.wahiduddin":"It was He who created you; and some of you are those who deny this truth, and some who believe [in it]. God sees everything you do."},"tafsir":{"ar.muyassar":"الله هو الذي أوجدكم من العدم، فبعضكم جاحد لألوهيته، وبعضكم مصدِّق به عامل بشرعه، وهو سبحانه بصير بأعمالكم لا يخفى عليه شيء منها، وسيجازيكم بها.","ar.jalalayn":"«هو الذي خلقكم فمنكم كافر ومنكم مؤمن» في أصل الخلقة ثم يميتكم ويعيدكم على ذلك «والله بما تعملون بصير».","ar.qurtubi":"هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌقال ابن عباس : إن الله خلق بني آدم مؤمنا وكافرا , ويعيدهم في يوم القيامة مؤمنا وكافرا .وروى أبو سعيد الخدري قال : خطبنا النبي صلى الله عليه وسلم عشية فذكر شيئا مما يكون فقال : ( يولد الناس على طبقات شتى .يولد الرجل مؤمنا ويعيش مؤمنا ويموت مؤمنا .ويولد الرجل كافرا ويعيش كافرا ويموت كافرا .ويولد الرجل مؤمنا ويعيش مؤمنا ويموت كافرا .ويولد الرجل كافرا ويعيش كافرا ويموت مؤمنا ) .وقال ابن مسعود : قال النبي صلى الله عليه وسلم : ( خلق الله فرعون في بطن أمه كافرا وخلق يحيى بن زكريا في بطن أمه مؤمنا ) .وفي الصحيح من حديث ابن مسعود : ( وإن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع أو باع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها .وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع أو باع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها ) .خرجه البخاري والترمذي وليس فيه ذكر الباع .وفي صحيح مسلم عن سهل بن سعد الساعدي أن رسول الله صلى الله عليه وسلم قال : ( إن الرجل ليعمل عمل أهل الجنة فيما يبدو للناس وهو من أهل النار .وإن الرجل ليعمل عمل أهل النار فيما يبدو للناس وهو من أهل الجنة ) .قال علماؤنا : والمعنى تعلق العلم الأزلي بكل معلوم ; فيجري ما علم وأراد وحكم .فقد يريد إيمان شخص على عموم الأحوال , وقد يريده إلى وقت معلوم .وكذلك الكفر .وقيل في الكلام محذوف : فمنكم مؤمن ومنكم كافر ومنكم فاسق ; فحذف لما في الكلام من الدلالة عليه ; قاله الحسن .وقال غيره : لا حذف فيه ; لأن المقصود ذكر الطرفين .وقال جماعة من أهل العلم : إن الله خلق الخلق ثم كفروا وآمنوا .قالوا : وتمام الكلام \" هو الذي خلقكم \" .ثم وصفهم فقال : \" فمنكم كافر ومنكم مؤمن \" كقوله تعالى : \" والله خلق كل دابة من ماء فمنهم من يمشي على بطنه \" [ النور : 45 ] الآية .قالوا : فالله خلقهم ; والمشي فعلهم .واختاره الحسين بن الفضل , قال : لو خلقهم مؤمنين وكافرين لما وصفهم بفعلهم في قوله \" فمنكم كافر ومنكم مؤمن \" .واحتجوا بقوله عليه الصلاة والسلام : ( كل مولود يولد على الفطرة فأبواه يهودانه وينصرانه ويمجسانه ) الحديث .وقد مضى في \" الروم \" مستوفى .قال الضحاك : فمنكم كافر في السر مؤمن في العلانية كالمنافق , ومنكم مؤمن في السر كافر في العلانية كعمار وذويه .وقال عطاء بن أبي رباح : فمنكم كافر بالله مؤمن بالكواكب , ومنكم مؤمن بالله كافر بالكواكب ; يعني في شأن الأنواء .وقال الزجاج - وهو أحسن الأقوال , والذي عليه الأئمة والجمهور من الأمة - : إن الله خلق الكافر , وكفره فعل له وكسب ; مع أن الله خالق الكفر .وخلق المؤمن , وإيمانه فعل له وكسب ; مع أن الله خالق الإيمان .والكافر يكفر ويختار الكفر بعد خلق الله إياه ; لأن الله تعالى قدر ذلك عليه وعلمه منه .ولا يجوز أن يوجد من كل واحد منهما غير الذي قدر عليه وعلمه منه ; لأن وجود خلاف المقدور عجز , ووجود خلاف المعلوم جعل , ولا يليقان بالله تعالى .وفي هذا سلامة من الجبر والقدر ; كما قال الشاعر : يا ناظرا في الدين ما الأمر لا قدر صح ولا جبر وقال سيلان : قدم أعرابي البصرة فقيل له : ما تقول في القدر ؟ فقال : أمر تغالت فيه الظنون , واختلف فيه المختلفون ; فالواجب أن نرد ما أشكل علينا من حكمه إلى ما سبق من علمه .وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌقال العلماء : وصف الله عز وجل نفسه بأنه بصير على معنى أنه عالم بخفيات الأمور .والبصير في كلام العرب : العالم بالشيء الخبير به ; ومنه قولهم : فلان بصير بالطب , وبصير بالفقه , وبصير بملاقاة الرجال ; قال : فإن تسألوني بالنساء فإنني بصير بأدواء النساء طبيب قال الخطابي : البصير العالم , والبصير المبصر .وقيل : وصف تعالى نفسه بأنه بصير على معنى جاعل الأشياء المبصرة ذوات إبصار , أي مدركة للمبصرات بما خلق لها من الآلة المدركة والقوة ; فالله بصير بعباده , أي جاعل عباده مبصرين .\n","ar.miqbas":"هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (2)هذا تقرير لما أفاده قوله : { يسبح لله ما في السموات وما في الأرض } [ التغابن : 1 ] ، وتخلصٌ للمقصود منه على وجه التصريح بأن الذين أشركوا بالله قد كفروا بنعمته وبخلقهم زيادة على جحدهم دلائل تنزهه تعالى عن النقص الذي اعتقدوه له . ولذلك قدم { فمنكم كافر } على { ومنكم مؤمن } لأن الشق الأول هو المقصود بهذا الكلام تعريضاً وتصريحاً .وأفاد تعريف الجزأين من جملة { هو الذي خلقكم } قصر صفة الخالقية على الله تعالى ، وهو قصر حقيقي قصد به الإِشارة بالكناية بالرد على المشركين إذ عمدوا إلى عبادة أصنام يعلمون أنها لم تخلقهم فَما كانت مستحقة لأن تعبد ، لأن العبادة شكر . قال تعالى : { أفمن يخلق كمن لا يخلق أفلا تذكرون } [ النحل : 17 ] .والخطاب في قوله : { خلقكم } لِجميع الناس الذين يدعوهم القرآن بقرينة قوله : { فمنكم كافر ومنكم مؤمن } ، فإن الناس لا يعْدون هذين القسمين .والفاء في { فمنكم كافر } عاطفة على جملة { هو الذي خلقكم } وليست عاطفة على فعل { خلقكم } وهي للتفريع في الوقوع دون تسبب .ونظيره قوله : { وجعلنا في ذريتهما النبوءة والكتاب فمنهم مهتدٍ وكثير منهم فاسقون } [ الحديد : 26 ] ومثل هذا التفريع يستتبع التعجيب من جري أحوال بعض الناس على غير ما يقتضيه الطبع { وتجعلون رزقكم أنكم تكذبون } [ الواقعة : 82 ] فجملة { فمنكم كافر } هي المقصود من التفريع ، وهو تفريع في الحصول . وقدم ذكر الكافر لأنه الأهم في هذا المقام كما يشير إليه قوله تعالى في { ألم يأتكم نبؤا الذين كفروا من قبل } [ التغابن : 5 ] .وجملة { ومنكم مؤمن } تتميم وتنويه بشأن أهل الإِيمان ومضادَّة حالهم لحال أهل الكفر ومقابلة الحال بالحال .وقوله : { والله بما تعملون بصير } تتميم واحتراس واستطراد ، فهو تتميم لما يكمِّل المقصود من تقسيمهم إلى فريقين لإِبداء الفرق بين الفريقين في الخير والشر وهو عليم بذلك وعليم بأنه يقع وليس الله مغلوباً على وقوعه ولكن حكمته وعلمه اقتضيا ذلك . ودون تفصيل هذا تطويل نخصهُ بتأليف في معنى القدر وجريان أعمال الناس في الدنيا إن شاء الله . ونقتصر هنا على أن نقول : خلق الله الناس وأودع فيهم العقول التي تتوصل بالنظر السليم من التقصير وشوائب الهوى وغشاوات العناد إلى معرفة الله على الوصف اللائق به وخلق فيهم القُدرة على الأعمال الصالحة وغيرها المسماة عند الأشعري بالكسب وعند المعتزلة بقُدرة العبد ( والخلاف في التعبير ) . وأرشدهم إلى الصلاح وحذرهم من الفساد ، والله عالم بما يكتسبه كل أحد ولو شاء لصرف مقترف الفساد عن فعله ولكنه أوجد نُظُماً مرتبطاً بعضها ببعض ومنتشرة فقضت حكمته بالحفاظ على تلك النظم الكثيرة بأن لا يعوق سيرَها في طرائقها ولا يعطلَ عمَلها لأجل إصلاح أشخاص هم جزء من كلَ لأن النظُم العامة أعم فالحفاظ على اطرادها أصلح وأرجح ، فلا تتنازل إرادة الله وقدرته إلى التدخل فيما سُمي بالكسب على أصولنا أو بالقدرة الحادثة على أصول المعتزلة ، بل جعل بحكمته بين الخَلْققِ والكسب حاجزاً هو نظام تكوين الإِنسان بما فيه من إرادة وإدراك وقدرة ، وقد أشار إلى هذا قوله : { والله بما تعملون بصير } أي هو بصير به من قَبل أن تعملوه ، وبعد أن عملتموه .فالبصير : أريد به العالم عِلمَ انكشاف لا يقبل الخفاء فهو كعلم المشاهدة وهذا إطلاق شائع في القرآن لا سيما إذا أفردت صفة { بصير } بالذكر ولم تذكر معها صفة «سميع» .واصطلح بعض المتكلمين على أن صفة البصيرة : العالم بالمرْئيات . وقال بعضهم : هي تعلق العلم الإلهي بالأمور عند وقوعها . والحق أنها استعمالات مختلفة . وبهذا يتضح وجه الجمع بين ما يبدو من تعارض بين آيات القرآن وإخبارٍ من السنة فاجعلوه مِثالاً يُحتدى ، وقولوا هكذا . هكذا .وهو احتراس من أن يتوهم من تقسيمهم إلى فريقين أن ذلك رضى بالحالين كما حكي عن المشركين { وقالوا لو شاء الرحمان ما عبدناهم } [ الزخرف : 20 ] .وهو استطراد بطريق الكناية به عن الوعد والوعيد .وشمل قوله : { بما تعملون } أعمالَ القلوب كالإِيمان وهي المقصود ابتداء هنا .\n","ar.waseet":"ثم بين - سبحانه - أقسام خلقه فى هذه الحياة فقال : ( هُوَ الذي خَلَقَكُمْ فَمِنكُمْ كَافِرٌ وَمِنكُمْ مُّؤْمِنٌ ) .والخطاب فى قوله : ( خَلَقَكُمْ ) لجيمع المكلفين من هذه الأمة .والفاء فى قوله : ( فَمِنكُمْ كَافِرٌ ) للتفريع المشعر بالتعجب من وجود من هو كافر بالله - تعالى - مع أنه - سبحانه - هو الذى خلقه ، وخلق كل شىء .وقدم ذكر الكافر ، لأنه الأهم فى هذا المقام ، ولأنه الأكثر عددا فى هذه الحياة .أي هو سبحانه - الذى خلقكم بقدرته ، دون أن يشاركه فى ذلك مشارك ، وزودكم بالعقول التى تعينكم على معرفة الخير من الشر ، والنافع من الضار وأرسل إليكم رسوله محمدا - صلى الله عليه وسلم - لكى يخرجكم من ظلمات الكفر إلى نور الإيمان ، وأنزل معه الكتاب الذى يدلكم على أنه رسول الله - صلى الله عليه وسلم - وأنه صادق فيما يبلغه عن ربه ، وأمركم هذا الرسول الكريم بإخلاص العبادة لله - تعالى - وحده ، ولم يترك رسولنا - صلى الله عليه وسلم - وسيلة تهديكم إلى الحق إلا وأرشدكم إليها . . .ومع ذلك وجد منكم المختار للكفر بالحق ، المعرض عن الإيمان بوحدانية الله - تعالى - وكان منكم المستجيب للحق باختياره المخلص فى عقيدته لله - تعالى - المؤمن بوحدانيته ، المؤدى لجميع التكاليف التى كلفه - سبحانه - بها .قال القرطبى - بعد أن ذكر جملة من الأقوال فى معنى هذه الآية - : وقال الزجاج - وقوله أحسن الأقوال ، والذى عليه الأئمة والجمهور من الأمة - : إن الله خلق الكافر ، وكفره فعل له وكسب ، مع أن الله خالق الكفر . وخلق المؤمن ، وإيمانه فعل له وكسب ، مع أن الله خالق الإيمان .والكافر يكفر ويختار الكفر بعد خلق الله إياه ، لأن الله - تعالى - قدر ذلك عليه وعلمه منه ، ولا يجوز أن يوجد من كل واحد منهما ، غير الذى قدر عليه ، وعلمه منه .وقوله : ( والله بِمَا تَعْمَلُونَ بَصِيرٌ ) أى : والله - تعالى - لا تخفى عليه خافية من أعمالكم ، وسيحاسبكم عليها يوم القيامة ، وسيجازى الذين أساءوا بما عملوا ، ويجازى الذين أحسنوا بالحسنى .\n","ar.baghawi":"( هو الذي خلقكم فمنكم كافر ومنكم مؤمن والله بما تعملون بصير ) ، قال ابن عباس : [ إن ] الله خلق بني آدم مؤمنا وكافرا ، ثم يعيدهم يوم القيامة كما خلقهم مؤمنا وكافرا .وروينا عن ابن عباس عن أبي بن كعب قال : قال رسول الله - صلى الله عليه وسلم - : \" إن الغلام الذي قتله الخضر عليه السلام طبع كافرا \"وقال - جل ذكره - \" ولا يلدوا إلا فاجرا كفارا \" ( نوح - 27 ) .أخبرنا عبد الواحد بن أحمد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا سليمان بن حرب ، حدثنا حماد ، عن عبيد الله بن أبي بكر بن أنس [ عن أنس ] عن النبي - صلى الله عليه وسلم - قال : \" وكل الله بالرحم ملكا فيقول : أي رب نطفة أي رب علقة ، أي رب مضغة ، فإذا أراد الله أن يقضي خلقها قال : يا رب أذكر أم أنثى أشقي أم سعيد ؟ فما الرزق فما الأجل ؟ فيكتب كذلك في بطن أمه \"وقال جماعة : معنى الآية : إن الله خلق الخلق ثم كفروا وآمنوا لأن الله تعالى ذكر الخلق ثم وصفهم بفعلهم ، فقال : \" فمنكم كافر ومنكم مؤمن \" كما قال الله تعالى : \" والله خلق كل دابة من ماء فمنهم من يمشي \" ( النور - 45 ) والله خلقهم والمشي فعلهم . ثم اختلفوا في تأويلها : روي عن أبي سعيد الخدري أنه قال : \" فمنكم كافر \" في حياته \" مؤمن \" في العاقبة \" ومنكم مؤمن \" في حياته كافر في العاقبة .وقال عطاء بن أبي رباح : فمنكم كافر بالله مؤمن بالكواكب ، ومنكم مؤمن بالله كافر بالكواكب .وقيل فمنكم كافر بأن الله تعالى خلقه ، وهو مذهب الدهرية ، ومنكم مؤمن بأن الله خلقهوجملة القول فيه : أن الله خلق الكافر ، وكفره فعل له وكسب وخلق المؤمن ، وإيمانه فعل له وكسب ، فلكل واحد من الفريقين كسب واختيار وكسبه واختياره بتقدير الله ومشيئته فالمؤمن بعد خلق الله إياه يختار الإيمان لأن الله تعالى أراد ذلك منه وقدره عليه وعلمه منه ، والكافر بعد خلق الله تعالى إياه يختار الكفر لأن الله تعالى أراد ذلك منه وقدره عليه وعلمه منه . وهذا طريق أهل السنة والجماعة من سلكه أصاب الحق وسلم من الجبر والقدر .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5201.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5201.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5201.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ وَإِلَيْهِ الْمَصِيرُ","transliteration":"Khalaqas samaawaati wal arda bilhaqqi wa sawwarakum fa ahsana suwarakum wa ilaihil maseer","translations":{"en.ahmedali":"He created the heavens and the earth with deliberation, and gave you form, and shaped you well; and to Him is your returning.","en.ahmedraza":"He created the heavens and the earth with the truth, and fashioned you thereby making you in best shapes; and towards Him only is the return.","en.arberry":"He created the heavens and the earth with the truth, and He shaped you, and shaped you well; and unto Him is the homecoming.","en.asad":"He has created the heavens and the earth in accordance with [an inner] truth, and has formed you - and formed you so well; and with Him is your journey's end.","en.daryabadi":"He hath created the heavens and the earth with truth, and hath formed you, and hath made-your forms goodly; and Unto Him Is the return.","en.hilali":"He has created the heavens and the earth with truth, and He shaped you and made good your shapes, and to Him is the final Return.","en.pickthall":"He created the heavens and the earth with truth, and He shaped you and made good your shapes, and unto Him is the journeying.","en.qaribullah":"He created the heavens and the earth in truth and He shaped you and gave you good shapes. To Him is the arrival.","en.sahih":"He created the heavens and earth in truth and formed you and perfected your forms; and to Him is the [final] destination.","en.sarwar":"He has created the heavens and the earth for a genuine purpose and has formed you in the best shape. To Him all things return.","en.yusufali":"He has created the heavens and the earth in just proportions, and has given you shape, and made your shapes beautiful: and to Him is the final Goal.","en.maududi":"He created the heavens and the earth with Truth and shaped you, giving you excellent shapes. And to Him is your ultimate return.","en.shakir":"He created the heavens and the earth with truth, and He formed you, then made goodly your forms, and to Him is the ultimate resort.","en.itani":"He created the heavens and the earth with truth, and He designed you, and designed you well, and to Him is the final return.","en.mubarakpuri":"He has created the heavens and the earth with truth, and He shaped you and made good your shapes. And to Him is the return.","en.qarai":"He created the heavens and the earth with consummate wisdom, and He formed you and perfected your forms, and toward Him is your destination.","en.wahiduddin":"He created the heavens and the earth for a purpose. He formed you and gave you the best of forms. To Him you shall all return."},"tafsir":{"ar.muyassar":"خلق الله السموات والأرض بالحكمة البالغة، وخلقكم في أحسن صورة، إليه المرجع يوم القيامة، فيجازي كلا بعمله.","ar.jalalayn":"«خلق السماوات والأرض بالحق وصوركم فأحسن صوركم» إذ جعل شكل الآدمي أحسن الأشكال «وإليه المصير».","ar.qurtubi":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّتقدم في غير موضع أي خلقها حقا يقينا لا ريب فيه .وقيل : الباء بمعنى اللام أي خلقها للحق وهو أن يجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى .وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْيعني آدم عليه السلام , خلقه بيده كرامة , له ; قاله مقاتل .الثاني : جميع الخلائق .وقد مضى معنى التصوير , وأنه التخطيط والتشكيل .فإن قيل : كيف أحسن صورهم ؟ قيل له : جعلهم أحسن الحيوان كله وأبهاه صورة بدليل أن الإنسان لا يتمنى أن تكون صورته على خلاف ما يرى من سائر الصور .ومن حسن صورته أنه خلق منتصبا غير منكب ; كما قال عز وجل : \" لقد خلقنا الإنسان في أحسن تقويم \" [ التين : 4 ] على ما يأتي بيانه إن شاء الله تعالى .وَإِلَيْهِ الْمَصِيرُأي المرجع ; فيجازي كلا بعمله .\n","ar.miqbas":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَإِلَيْهِ الْمَصِيرُ (3){ خَلَقَ السماوات والارض } } .استئناف بياني نَاشىء عن قوله : { فمنكم كافر ومنكم مؤمن } [ التغابن : 2 ] يبيِّن أن انقسامهم إلى قسمي الكافرين والمؤمنين نشأ عن حياد فريق من الناس عن الحق الذي أقيم عليه خلق السماوات والأرض لأن الحق أن يؤمن الناس بوجود خالقهم ، وبأنه واحد وأن يفردوه بالعبادة فذلك الذي أراده الله من خلقهم ، قال تعالى : { وما خلقت الجن والإنس إلا ليعبدون } [ الذاريات : 56 ] . وقال : { فأقم وجهك للدين حنيفاً فطرة الله التي فطر الناس عليها لا تبديل لخلق الله } [ الروم : 30 ] فمن حَاد عن الإِيمان ومالَ إلى الكفر فقد حاد عن الحق والفطرة .{ والارض } .وقوله : { بالحق } معترض بين جملة { خلق السموات والأرض } وجملة { وصوّركم } .وفي قوله : { بالحق } إيماء إلى إثبات البعث والجزاء لأن قوله بالحق متعلق بفعل { خلق } تعلَّق الملابسة المفاد بالباء ، أي خلقاً ملابساً للحق ، والحق ضد الباطل ، ألا ترى إلى قوله تعالى : { إن في خلق السماوات والأرض إلى قوله : ربنا ما خلقت هذا باطلاً } [ آل عمران : 190 - 191 ] . والباطل مَصْدَقهُ هنالك هو العبث لقوله تعالى : { وما خلقنا السماوات والأرض وما بينهما لاعبين ما خلقناهما إلا بالحق } [ الدخان : 38 ، 39 ] فتعين أن مَصْدَقَ الحقّ في قوله : { خلق السموات والأرض بالحق } أنه ضد العبث والإِهمال .والمراد ب { خلق السموات والأرض } خلق ذوَاتهن وخلق ما فيهن من المخلوقات كما أنبأ عنه قوله : { وما خلقنا السماوات والأرض وما بينهما لاعبين ما خلقناهما إلا بالحق ، أي ما خلقناهما وما بينهما إلا بالحقّ ، فكذلك يكون التقدير في الآية من هذه السورة .وملابسة الحق لخلق السماوات والأرض يلزم أن تكون ملابسة عامة مطردة لأنه لو اختلت ملابسة حال من أحوال مخلوقات السماوات للحق لكان ناقضاً لمعنى ملابسة خلقِها للحقّ ، فكان نفي البعث للجزاء على أعمال المخلوقات موجباً اختلال تلك الملابسة في بعض الأحوال . وتخلّف الجزاء عن الأعمال في الدنيا مشاهد إذ كثيراً ما نرى الصالحين في كرب ونرى أهل الفساد في نعمة ، فلو كانت هذه الحياة الدنيا قصارى حياة المكلفين لكان كثيرٌ من أهل الصلاح غيرَ لاقٍ جزاءً على صلاحه . وانقلب أكثر أهل الفساد متمتعاً بإرضاء خباثة نفسه ونوال مشتهياته ، فكان خلق كلا هذين الفريقين غيرَ ملابس للحق ، بالمعنى المراد .ولزيادة الإِيقاظ لهذا الإِيمان عطف عليه قوله : وإليه المصير } وكل ذلك توطئة إلى ما سبقه من قوله تعالى : { زعم الذين كفروا أن لن يبعثوا } [ التغابن : 7 ] الآية .وفي قوله { بالحق } رمز إلى الجزاء وهو وعيد ووعد .وفي قوله : { خلق السموات } إلى آخره إظهار أيضاً لعظمة الله في ملكوته .{ بالحق وَصَوَّرَكُمْ فَأَحْسَنَ } .إدماج امتنان على الناس بأنهم مع ما خلقوا عليه من ملابسة الحق على وجه الإِجمال وذلك من الكمال وهو ما اقتضته الحكمة الإلهية فقد خُلقوا في أحسن تقويم إذ كانت صورة الإِنسان مستوفية الحسن متماثلة فيه لا يعتورها من فظاعة بعض أجزائها ونقصان الانتفاع بها ما يُناكد محاسن سائرها بخلاف محَاسن أحاسن الحيوان من الدواب والطيرِ والحيتان من مَشي على أرْبَع مع انتكاس الرأس غالباً ، أو زحف ، أو نقز في المشي في البعض .ولا تَعْتَوِرُ الإِنسان نقائصُ في صورته إلا من عوارضَ تعرض في مدة تكوينه من صَدَمَات لبطون الأمهات ، أو علل تحلّ بهن ، أو بالأجنة أو من عوارض تعرض له في مدة حياته فتشوه بعض محاسن الصور . فلا يعد ذلك من أصل تصوير الإِنسان على أن ذلك مع ندرته لا يعد فظاعة ولكنه نقص نسبي في المحاسن فقد جمع بين الإِيماء إلى ما اقتضته الحكمة قد نبههم إلى ما اقتضاه الإِنعام . وفيه إشارة إلى دليل إمكان البعث كما قال : { أفعيينا بالخلق الأول } [ ق : 15 ] ، وقال : { أو ليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم } [ يس : 81 ] .( ه4س64ش3ن7/ن8-->صُوَرَكُمْ وَإِلَيْهِ } .عطف على جملة { وصوركم } لأن التصوير يقتضي الإِيجاد فأعقب بالتذكير بأن بعد هذا الإِيجادِ فناءً ثم بعثاً للجزاء .والمَصير مصدر ميمي لفعل صادر بمعنى رَجع وانتهى ، ولذلك يُعدَّى بحرف الانتهاء ، أي ومرجعكم إليه يعني بعد الموت وهو مصير الحشر للجزاء .وتقديم { إليه } على { المصير } للرعاية على الفاصلة مع إفادة الاهتمام بتعلق ذلك المصير بتصرف الله المحض . وليس مراداً بالتقديم قصر لأن المشركين لا يصدقون بهذا المصير من أصله بَلْهَ أن يدَّعوا أنه مصير إلى غيره حتى يُردّ عليهم بالقصر .وهذه الجملة أشد ارتباطاً بجملة { خلق السموات والأرض بالحق } منها بجملة { وصوركم فأحسن صوركم } كما يظهر بالتأمل .\n","ar.waseet":"( خَلَقَ السماوات والأرض بالحق ) أى : خلقهن خلقا ملتبسا بالحق الذى لا يحوم حوله باطل ، وبالحكمة التى لا يشوبها اضطراب أو عبث ، فالباء فى قوله \" بالحق \" للملابسة .والمراد بالسموات والأرض : ذواتهن وأجرامهن التى هى أكبر من خلق الناس .والمراد بالحق : المقصد الصحيح ، والغرض السليم ، الواقع على أتم الوجوه وأفضلها وأحكمها .ثم بين - سبحانه - بعض مظاهر نعمه على الناس فقال : ( وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ) .وقوله : ( وَصَوَّرَكُمْ ) من التصوير ، وهو جعل الشىء على صورة لم يكن عليها ، وهو ماخوذ من مادة صار الشىء إلى كذا ، بمعنى تحول إليه ، أو من صاره إلى كذا ، بمعنى أماله وحوله .أى : وأوجدكم - سبحانه - يا بنى آدم على أحسن الصور وأكملها وأبدعها وأجملها ، بدليل أن الإنسان لا يتمنى أن يكون على غير صورته التى خلقه الله عليها ، كأن يكون على صورة حيوان أو غيره .وصدق الله إذ يقول : ( لَقَدْ خَلَقْنَا الإنسان في أَحْسَنِ تَقْوِيمٍ ) قال الآلوسى : ولعمرى إن الإنسان أعجب نسخة فى هذا العالم ، قد اشتملت على دقائق وأسرار شهدت ببعضها الآثار ، وعلم ما علم منها أولو الأبصار ، وكل ما يشاهد من الصور الإنسانية حسن ، لكن الحسن كغيره من المعانى على طبقات ومراتب . . . كما قال بعض الحكماء : شيئان لا غاية لهما الجمال والبيان .وقوله - تعالى - ( وَإِلَيْهِ المصير ) معطوف على ما قبله ، لأن التصوير يقتضى الإيجاد ، فبين - سبحانه - أن هذا الإيجاد يعقبه الفناء لكل شىء سوى وجهه الكريم .أى : وإليه وحده - تعالى - مرجعكم بعد انتهاء آجالكم فى هذه الحياة ، لكى يجازيكم على أعمالكم الدنيوية .\n","ar.baghawi":"\"خلق السموات والأرض بالحق وصوركم فأحسن صوركم وإليه المصير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5202.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5202.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5202.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","transliteration":"Ya'lamu maa fis samaawaati wal ardi wa ya'lamu maa tusirroona wa maa tu'linoon; wallaahu 'Aleemum bizaatis sudoor","translations":{"en.ahmedali":"He knows what is in the heavens and the earth, and knows what you hide and what you disclose; God knows what is in the hearts.","en.ahmedraza":"He knows all whatever is in the heavens and in the earth, and He knows all what you hide and all what you disclose; and Allah knows what lies within the hearts.","en.arberry":"He knows whatever is in the heavens and the earth, and He knows what you conceal and what you publish. God knows the thoughts within the breasts.","en.asad":"He knows all that is in the heavens and on earth; and He knows all that you keep secret as well as all that you bring into the open: for God has full knowledge of what is in the hearts [of men].","en.daryabadi":"He knoweth whatsoever is In the heavens and the earth, and He knoweth whatsoever ye keep secret, and whatsoever ye make known; and Allah is the Knower of whatsoever is in the breasts.","en.hilali":"He knows what is in the heavens and on earth, and He knows what you conceal and what you reveal. And Allah is the All-Knower of what is in the breasts (of men).","en.pickthall":"He knoweth all that is in the heavens and the earth, and He knoweth what ye conceal and what ye publish. And Allah is Aware of what is in the breasts (of men).","en.qaribullah":"He knows whatever is in the heavens and the earth and He knows all what you conceal and what you reveal. Allah knows the innermost of the chests.","en.sahih":"He knows what is within the heavens and earth and knows what you conceal and what you declare. And Allah is Knowing of that within the breasts.","en.sarwar":"He knows all that is in the heavens and the earth and all that you reveal or conceal. God knows best whatever the hearts contain.","en.yusufali":"He knows what is in the heavens and on earth; and He knows what ye conceal and what ye reveal: yea, Allah knows well the (secrets) of (all) hearts.","en.maududi":"He knows what is in the heavens and the earth, and knows what you conceal and what you disclose. Allah even knows what lies hidden in the breasts of people.","en.shakir":"He knows what is in the heavens and the earth, and He knows what you hide and what you manifest; and Allah is Cognizant of what is in the hearts.","en.itani":"He knows everything in the heavens and the earth, and He knows what you conceal and what you reveal. And God knows what is within the hearts.","en.mubarakpuri":"He knows what is in the heavens and on earth, and He knows what you conceal and what you reveal. And Allah is the All-Knower of what is in the breasts.","en.qarai":"He knows whatever there is in the heavens and the earth, and He knows whatever you hide and whatever you disclose, and Allah knows best what is in your breasts.","en.wahiduddin":"He knows whatever is in the heavens and the earth. He knows all that you conceal and all that you reveal. God is aware of what is in your hearts."},"tafsir":{"ar.muyassar":"يعلم سبحانه وتعالى كل ما في السموات والأرض، ويعلم ما تخفونه -أيها الناس- فيما بينكم وما تظهرونه. والله عليم بما تضمره الصدور وما تخفيه النفوس.","ar.jalalayn":"«يعلم ما في السماوات والأرض ويعلم ما تسرون وما تعلنون والله عليم بذات الصدور» بما فيها من الأسرار والمعتقدات.","ar.qurtubi":"تقدم في غير موضع فهو عالم الغيب والشهادة , لا يخفى عليه شيء مما في صدوركم .\n","ar.miqbas":"يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ (4)كانوا ينفون الحشر بعلة أنه إذا تفرقت أجزاء الجسد لا يمكن جمعها ولا يحاط بها . { وقالوا أإذا ضللنا في الأرض أإنا لفي خلق جديد } [ السجدة : 10 ] ، فكان قوله تعالى : { يعلم ما في السماوات والأرض ويعلم ما تسرون وما تعلنون } دحضا لشبهتهم ، أي أن الذي يعلم ما في السماوات والأرض لا يعجزه تفرق أجزاء البدن إذا أراد جمعها . والذي يعلم السرّ في نفس الإِنسان ، والسرُّ أدق وأخفى من ذرات الأجساد المتفرقة ، لا تخفى عليه مواقع تلك الأجزاء الدقيقة ولذلك قال تعالى : { أيحسب الإِنسانُ أن لن نجمع عظامه بلى قادرين على أن نسوي بنانه } [ القيامة : 3 - 4 ] .فالمقصود هو قوله : { ويعلم ما تسرون } كما يقتضيه الاقتصار عليه في تذييله بقوله : { والله عليم بذات الصدور } ولم يذكر أنه عليم بأعمال الجوارح ، ولأن الخطاب للمشركين في مكة على الراجح . وذلك قبل ظهور المنافقين فلم يكن قوله : { ويعلم ما تسرون وما تعلنون } تهديداً على ما يبطنه الناس من الكفر .وأما عطف { وما تعلنون } فتتميم للتذكير بعموم تعلق علمه تعالى بالأعمال .وقد تضمن قوله : { ويعلم ما تسرون وما تعلنون } وعيداً ووعداً ناظريْن إلى قوله : { فمنكم كافر ومنكم مؤمن } [ التغابن : 2 ] فكانت الجملة لذلك شديدة الاتصال بجملة { هو الذي خلقكم فمنكم كافر ومنكم مؤمن } [ التغابن : 2 ] .وإعادة فعل { يعلم } للتنبيه على العناية بهذا التعلق الخاص للعلم الإِلهي بعد ذكر تعلقه العام في قوله : { يعلم ما في السموات والأرض } تنبيهاً على الوعيد والوعد بوجه خاص .وجملة { والله عليم بذات الصدور } تذييل لجملة { ويعلم ما تسرون } لأنه يعلم ما يُسِرُّه جميع الناس من المخاطبين وغيرهم .و { ذات الصدور } صفة لموصوف محذوف نزلت منزلة موصوفها ، أي صاحبات الصدور ، أي المكتومة فيها .والتقدير : بالنوايا والخواطر ذات الصدور كقوله : { وحملناه على ذات ألواح } [ القمر : 13 ] وتقدم بيانه عند قوله تعالى : { إنه عليم بذات الصدور } في سورة [ الأنفال : 43 ] .\n","ar.waseet":"ثم بين - سبحانه - شمول علمه لكل شىء فقال : ( يَعْلَمُ مَا فِي السماوات والأرض ) أى : هو - سبحانه - لا يخفى عليه شىء فى السموات والأرض .( وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ) - أيها الناس - والتصريح بذلك مع اندراجه فيما قبله ، من علم ما فى السموات وما فى الأرض ، لمزيد التأكيد فى الوعد والوعيد .( والله عَلِيمٌ بِذَاتِ الصدور ) والمراد بذات الصدور ، النوايا والخواطر التى تخفيها الصدور ، وتكتمها القلوب .أى : والله - تعالى - عليم علما تاما بالنوايا والخواطر التى اشتملت عليها الصدور ، فأنت ترى أن هذه الآية الكريمة قد اشتملت على ثلاث جمل ، كل جملة منها أخص من سابقتها .وجمع - سبحانه - بينها للإشارة إلى أن علمه - تعالى - محيط بالجزئيات والكليات ، دون أن يعزب عن علمه - تعالى - شىء منها .وفى هذا رد على أولئك الكفار الجاحدين ، الذين استبعدوا إعادتهم إلى الحياة ، بعد أن أكلت الأرض أجسادهم ، وقالوا - كما حكى القرآن عنهم - ( وقالوا أَإِذَا ضَلَلْنَا فِي الأرض أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ).\n","ar.baghawi":"\"يعلم ما في السموات والأرض ويعلم ما تسرون وما تعلنون والله عليم بذات الصدور\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5203.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5203.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5203.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","transliteration":"Alam yaatikum naba'ul lazeena kafaroo min qablu fazaaqoo wabaala amrihim wa lahum 'azaabun aleem","translations":{"en.ahmedali":"Has not the account of those who disbelieved before come to you, who tasted the torment of their action, and for whom is grievous punishment?","en.ahmedraza":"Did not the news of those who disbelieved before you reach you? So they tasted the evil outcome of their deeds, and for them is a painful punishment.","en.arberry":"Has there not come to you the tidings of those that disbelieved before, then tasted the mischief of their action, and there yet awaits them a painful chastisement?","en.asad":"HAVE THE STORIES of those who, in earlier times, refused to acknowledge the truth never yet come within your ken? [They denied it -] and so they had to taste the evil outcome of their own doings, with [more] grievous suffering awaiting them [in the life to come]:","en.daryabadi":"Hath not the tidings reached you of those who disbelieved aforetime, and so tasted the evil consequence of their affair, and theirs will be a torment afflictive?","en.hilali":"Has not the news reached you of those who disbelieved aforetime? And so they tasted the evil result of their disbelief, and theirs will be a painful torment.","en.pickthall":"Hath not the story reached you of those who disbelieved of old and so did taste the ill-effects of their conduct, and theirs will be a painful doom.","en.qaribullah":"Have you not heard the news of those before you who disbelieved? They tasted the mischief of their action, and for them is a painful punishment.","en.sahih":"Has there not come to you the news of those who disbelieved before? So they tasted the bad consequence of their affair, and they will have a painful punishment.","en.sarwar":"Have you not received the news about the disbelievers living before you who suffered the consequences of their deeds and will suffer a painful torment?","en.yusufali":"Has not the story reached you, of those who rejected Faith aforetime? So they tasted the evil result of their conduct; and they had a grievous Penalty.","en.maududi":"Has the news of the unbelievers of the past not reached you? (They disbelieved) and then tasted its evil consequence. A grievous chastisement awaits them.","en.shakir":"Has there not come to you the story of those who disbelieved before, then tasted the evil result of their conduct, and they had a painful punishment?","en.itani":"Has the news not reached you, of those who disbelieved before? They tasted the ill consequences of their conduct, and a painful torment awaits them.","en.mubarakpuri":"Has not the news reached you of those who disbelieved aforetime And so they tasted the evil result of their disbelief, and theirs will be a painful torment.","en.qarai":"Has there not come to you the account of those who were faithless before? They tasted the evil consequence of their conduct, and there is a painful punishment for them.","en.wahiduddin":"Have you not heard about those who denied the truth before you and tasted the evil consequences of their conduct? They will have a painful punishment."},"tafsir":{"ar.muyassar":"ألم يأتكم- أيها المشركون- خبر الذين كفروا من الأمم الماضية قبلكم، إذ حلَّ بهم سوء عاقبة كفرهم وسوء أفعالهم في الدنيا، ولهم في الآخرة عذاب أليم موجع؟","ar.jalalayn":"«ألم يأتكم» يا كفار مكة «نبأُ» خبر «الذين كفروا من قبل فذاقوا وبال أمرهم» عقوبة الكفر في الدنيا «ولهم» في الآخرة «عذاب أليم» مؤلم.","ar.qurtubi":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُالخطاب لقريش أي ألم يأتكم خبر كفار الأمم الماضية .فَذَاقُوا وَبَالَ أَمْرِهِمْأي عوقبوا .وَلَهُمْفي الآخرةعَذَابٌ أَلِيمٌأي موجع .وقد تقدم\n","ar.miqbas":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ (5)انتقال من التعريض الرمزي بالوعيد الأخروي في قوله : { والله بما تعملون بصير } [ التغابن : 2 ] ، إلى قوله : { وإليه المصير } [ التغابن : 3 ] ، وقوله : { ويعلم ما تسرون وما تعلنون } [ التغابن : 4 ] ، إلى تعريض أوضح منه بطريق الإِيماء إلى وعيد لعذاب دنيوي وأخروي معاً فإن ما يسمّى في باب الكناية بالإِيمان أقل لوازم من التعريض والرمز فهو أقرب إلى التصريح . وهذا الإِيماء بضرب المَثل بحال أمم تلقوا رسلهم بمثل ما تلقّى به المشركون محمداً صلى الله عليه وسلم تحذيراً لهم من أن يحلّ بهم مثل ما حلّ بأولئك ، فالجملة ابتدائية لأنها عَدٌّ لصنف ثاننٍ من أصناف كفرهم وهو إنكار الرسالة .فالخطاب لخصوص الفريق الكافر بقرينة قوله : { الذين كفروا من قبل } فهذا الخطاب موجه للمشركين الذين حالهم كحال من لم يبلغهم نبأ الذين كفروا مثلَ كفرهم ، مثلُ عاد وثمود ومَدين وقوم إبراهيم .والاستفهام تقريري ، والتقريري يؤتى معه بالجملة منفية توسعة على المقرر إن كان يريد الإِنكار حتى إذا أَقرّ لم يستطع بعد إقراره إنكاراً لأنه قد أعذر له من قبل بتلقينه النفي وقد تقدم غير مرة .وحُذف ما أضيف إليه { قبلُ } ونوي معناه ، والتقدير : من قبلِكم ، أي في الكفر بقرينة قوله : { فمنكم كافر } [ التغابن : 2 ] . والكافرون يعلمون أنهم المقصود لأنهم مُقدمون على الكفر ومستمرون عليه .والوبال : السوء وما يكره .والأمر : الشأن والحال .والذَّوق مجاز في مطلق الإِحساس والوِجدان ، شبه ما حلّ بهم من العذاب بشيء ذي طعم كريه يذوقه من حلّ به ويبتلعه لأن الذوق باللسان أشد من اللمس باليد أو بالجلد .والمعنى : أحسوا العذاب في الدنيا إحساساً مكيناً .وقوله : { ولهم عذاب أليم } مراد به عذاب الآخرة لأن العطف يقتضي المغايرة .\n","ar.waseet":"ثم وبخهم - سبحانه - على عدم اعتبارهم بالسابقين من قبلهم فقال : ( أَلَمْ يَأْتِكُمْ نَبَأُ الذين كَفَرُواْ مِن قَبْلُ فَذَاقُواْ وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ) .والاستفهام فى قوله ( أَلَمْ يَأْتِكُمْ . . . ) للتقرير والتبكيت .والمراد بالذين كفروا من قبل : قوم نوح وعاد وثمود وغيرهم ، من الأقوام الذين أعرضوا عن الحق ، فكانت عاقبتهم الدمار والهلاك .والخطاب لمشركى قريش وأمثالهم ، ممن استحبوا العمى على الهدى .والوبال فى الأصل : الشدة المترتبة على أمر من الأمور ، ومنه الوبيل للطعام الثقيل على المعدة . المضر لها . . . والمراد به هنا : العقاب الشديد الذى نزل بهم فأهلكهم ، وعبر عن هذا العقاب بالوبال ، للإشارة إلى أنه عذابا ثقيلا جدا ، لم يستطيعوا الفرار أو الهرب منه .والمراد بأمرهم : كفرهم وفسوقهم عن أمر ربهم ، ومخالفتهم لرسلهم .وقوله ( فَذَاقُواْ ) معطوف على كفروا ، عطف المسبب على السبب والذوق مجاز فى مطلق الإحساس والوجدان . شبه ما حل بهم من عقاب ، بشىء كريه الطعم والمذاق .وعبر عن كفرهم بالأمر ، للإشعار بأنه أمر قد بلغ النهاية فى القبح والسوء .والمعنى : لقد أتاكم ووصف إلى عملكم - أيها المشركون - حال الذين كفروا من قبلكم من أمثال قوم نوح وعاد وثمود وغيرهم ، وعلمتم أن إصرارهم على كفرهم قد أدى بهم إلى الهلاك وإلى العذاب الأليم ، فعليكم أن تعتبروا بهم . وأن تفيئوا إلى رشدكم ، وأن تتبعوا رسول الله - صلى الله عليه وسلم - الذى أرسله الله - تعالى - لإخراجكم من ظلمات الكفر إلى نور الإيمان .فالمقصود من الآية الكريمة تحذير الكافرين الذين أرسل الرسول - صلى الله عليه وسلم - إليهم من سوء عاقبة إصرارهم على كفرهم .\n","ar.baghawi":"( ألم يأتكم ) يخاطب كفار مكة ( نبأ الذين كفروا من قبل ) يعني : الأمم الخالية ( فذاقوا وبال أمرهم ) يعني ما لحقهم من العذاب في الدنيا ( ولهم عذاب أليم ) في الآخرة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5204.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5204.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5204.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"ذَٰلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوْا ۚ وَاسْتَغْنَى اللَّهُ ۚ وَاللَّهُ غَنِيٌّ حَمِيدٌ","transliteration":"Zaalika bi annahoo kaanat taateehim Rusuluhum bilbaiyinaati faqaaloo a basharuny yahdoonanaa fakafaroo wa tawallaw; wastaghnal laah; wallaahu ghaniyyun hameed","translations":{"en.ahmedali":"This was so because their apostles came to them with clear proofs, but they said: \"What. Can a mortal show us the way?\" And they denied and turned away; but God was unconcerned. God is all-sufficient, worthy of praise.","en.ahmedraza":"This is because their Noble Messengers used to bring clear proofs to them, in response they said, “What! Will humans show us the way?”; they therefore became disbelievers and turned away, and Allah acted independently; and Allah is the Independent, the Most Praiseworthy.","en.arberry":"That is because their Messengers came to them with the clear signs, and then they said, 'What, shall mortals be our guides?' Therefore they disbelieved, and turned away; and God was in no need of them. And God is All-sufficient, All-laudable.","en.asad":"this, because time and again there came unto them their apostles with all evidence of the truth, but they [always] replied, \"Shall mere mortal men be our guides?\" And so they. denied the truth and turned away. But God was not in need [of them]: for God is self-sufficient, ever to be praised.","en.daryabadi":"That was because their apostles were wont to come Unto them with evidences, but they said: shall a mere human bein guide us? Wherefore they disbelieved and turned away; and Allah needed them not. And Allah is Self Sufficient, Praiseworthy.","en.hilali":"That was because there came to them their Messengers with clear proofs (signs), but they said: \"Shall mere men guide us?\" So they disbelieved and turned away (from the truth), and Allah was not in need (of them). And Allah is Rich (Free of all wants), Worthy of all praise.","en.pickthall":"That was because their messengers (from Allah) kept coming unto them with clear proofs (of Allah's Sovereignty), but they said: Shall mere mortals guide us? So they disbelieved and turned away, and Allah was independent (of them). Allah is Absolute, Owner of Praise.","en.qaribullah":"That is because, when their Messengers came to them with clear proofs they said: 'Shall humans be our guides' They disbelieved and turned away, but Allah was not in need (of them). Allah is the Rich and the Praised.","en.sahih":"That is because their messengers used to come to them with clear evidences, but they said, \"Shall human beings guide us?\" and disbelieved and turned away. And Allah dispensed [with them]; and Allah is Free of need and Praiseworthy.","en.sarwar":"This was because their messengers came to them with clear proof (to support their prophethood) and they said, \"Can mere mortals provide us with guidance?\" They rejected the Messengers and turned away. God does not need the worship of anyone. He is Self-sufficient and Praiseworthy.","en.yusufali":"That was because there came to them messengers with Clear Signs, but they said: \"Shall (mere) human beings direct us?\" So they rejected (the Message) and turned away. But Allah can do without (them): and Allah is free of all needs, worthy of all praise.","en.maududi":"This was because their Messengers would come to them with Clear Signs, but they would say: “Shall mortals (like ourselves) guide us to the Right Way?” They rejected the Truth and turned away. Thereupon Allah became unconcerned with them, for Allah is Self-Sufficient, Innately Praiseworthy.","en.shakir":"That is because there came to them their apostles with clear arguments, but they said: Shall mortals guide us? So they disbelieved and turned back, and Allah does not stand in need (of anything), and Allah is Self-sufficient, Praised.","en.itani":"That is because their messengers came to them with clear explanations, but they said, “Are human beings going to guide us?” So they disbelieved and turned away. But God is in no need. God is Independent and Praiseworthy.","en.mubarakpuri":"That was because there came to them their Messengers with Bayyinat, but they said: \"Shall mere men guide us\" So they disbelieved and turned away. But Allah was not in need. And Allah is not in need, Worthy of all praise.","en.qarai":"That was because their apostles would bring them manifest proofs, but they said, ‘Will humans be our guides?!’ So they disbelieved and turned away, and Allah had no need [of their faith] and Allah is all-sufficient, all-laudable.","en.wahiduddin":"That was because their messengers came to them with clear signs, but they replied, \"Shall mortals be our guides?\" And so they rejected the truth and turned away. God has no need of such people; God is self-sufficient and worthy of all praise."},"tafsir":{"ar.muyassar":"ذلك الذي أصابهم في الدنيا، وما يصيبهم في الآخرة؛ بسبب أنهم كانت تأتيهم رسل الله بالآيات البينات والمعجزات الواضحات، فقالوا منكرين: أبشر مثلنا يرشدوننا؟ فكفروا بالله وجحدوا رسالة رسله، وأعرضوا عن الحق فلم يقبلوه. واستغنى الله، والله غني، له الغنى التام المطلق، حميد في أقواله وأفعاله وصفاته لا يبالي بهم، ولا يضره ضلالهم شيئًا.","ar.jalalayn":"«ذلك» أي عذاب الدنيا «بأنه» ضمير الشأن «كانت تأتيهم رسلهم بالبينات» الحجج الظاهرات على الإيمان «فقالوا أبَشَرٌ» أريد به الجنس «يهدوننا فكفروا وتولوْا» عن الإيمان «واستغنى الله» عن إيمانهم «والله غني» عن خلقه «حميد» محمود في أفعاله.","ar.qurtubi":"ذَلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْأي هذا العذاب لهم بكفرهم بالرسل تأتيهمبِالْبَيِّنَاتِأي بالدلائل الواضحة .فَقَالُوا أَبَشَرٌ يَهْدُونَنَاأنكروا أن يكون الرسول من البشر .وارتفع \" أبشر \" على الابتداء .وقيل : بإضمار فعل , والجمع على معنى بشر ; ولهذا قال : \" يهدوننا \" ولم يقل يهدينا .وقد يأتي الواحد بمعنى الجمع فيكون اسما للجنس ; وواحده إنسان لا واحد له من لفظه .وقد يأتي الجمع بمعنى الواحد ; نحو قوله تعالى : \" ما هذا بشرا \" [ يوسف : 31 ] .فَكَفَرُوا وَتَوَلَّوْاأي بهذا القول ; إذ قالوه استصغارا ولم يعلموا أن الله يبعث من يشاء إلى عباده .وقيل : كفروا بالرسل وتولوا عن البرهان وأعرضوا عن الإيمان والموعظة .وَاسْتَغْنَى اللَّهُأي بسلطانه عن طاعة عباده ; قاله مقاتل .وقيل : استغنى الله بما أظهره لهم من البرهان وأوضحه لهم من البيان , عن زيادة تدعو إلى الرشد وتقود إلى الهداية .وَاللَّهُ غَنِيٌّأي لا يلحقه بذلك نقص بل هو الغنيحَمِيدٌالمحمود بكل لسان والممجد في كل مكان على كل حال\n","ar.miqbas":"ذَلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوْا وَاسْتَغْنَى اللَّهُ وَاللَّهُ غَنِيٌّ حَمِيدٌ (6)ارتقاء في التعريض إلى ضرب منه قريببٍ من الصريح . وهو المسمى في الكناية بالإِشارة . كانت مقالةُ الذين من قبلُ مماثلة لمقالة المخاطبين فإذا كانت هي سبب ما ذاقوه من الوبال فيوشك أن يذوق مماثلوهم في المقالة مثل ذلك الوبال .فاسم الإِشارة عائد إلى المذكور من الوبال والعذاب الأليم .فهذا عَدّ لكفر آخر من وجوه كفرهم وهو تكذيبهم الرسول صلى الله عليه وسلم وتكذيبهم بالقرآن فإن القرآن بيِّنة من البيّنات لأنه معجزة .والباء للسببية فالجملة في موقع العلة . والضمير ضمير الشأن لقصد تهويل ما يفسر الضمير ، وهو جملة { كانت تأتيهم رسلهم بالبينات } إلى آخرها .والاستفهام في { أبشر } استفهام إنكار وإبطال فهم أحالوا أن يكون بشر مثلهم يهدون بشراً أمثالهم ، وهذا من جهلهم بمراتب النفوس البشرية ومن يصطفيه الله منها ، ويخلقه مضطلعاً بتبليغ رسالته إلى عباده . كما قال : { وقالوا ما لهذا الرسول يأكل الطعام ويمشي في الأسواق } [ الفرقان : 7 ] وجهلوا أنه لا يصلح لإِرشاد الناس إلا مَن هو من نوعهم قال تعالى : { قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكاً رسولاً } [ الإسراء : 95 ] ولمَّا أحالوا أن يكون البشر أهلاً لهداية بشر مثله جعلوا ذلك كافياً في إعراضهم عن قبول القرآن والتدبر فيه .والبشر : اسم جنس للإِنسان يصدق على الواحد كما في قوله تعالى : { قل إنما أنا بشر مثلكم } [ الكهف : 110 ] ويقال على الجمع كما هنا . وتقدم في قوله : { وقلن حاش لله ما هذا بشراً } في سورة [ يوسف : 31 ] وفي سورة [ مريم : 17 ] عند قوله : { فتمثل لها بشراً سوياً }وتنكير بشر } للنوعية لأن محط الإِنكار على كونهم يَهدونهم ، هو نوعُ البشرية .وتقديم المسند إليه على الخبر الفعلي لقصد تقوّي حكم الإِنكار ، وما قالوا ذلك حتى اعتقدوه فلذلك أقدموا على الكفر برسلهم إذ قد اعتقدوا استحالة إرسال الله إياهم فجزموا بكذبهم في دعوى الرسالة فلذلك فرع عليه { فكفروا وتولوا } .والتولي أصله : الانصراف عن المكان الذي أنت فيه ، وهو هنا مستعار للإِعراض عن قبول دعوة رسلهم ، وتقدم عند قوله تعالى : { ثم توليتم من بعد ذلك } في سورة [ البقرة : 64 ] .واستغنى } غَنِيَ فالسين والتاء للمبالغة كقوله : { أما من استغنى } [ عبس : 5 ] . والمعنى : غَنِي الله عن إيمانهم قال تعالى : { إن تكفروا فإن الله غني عنكم } [ الزمر : 7 ] .والواو واو الحال ، أي والحال أن الله غني عنهم من زمن مضى فإن غنى الله عن إيمانهم مقرر في الأزل .ويجوز أن يراد : واستغنى الله عن إعادة دعوتهم لأن فيما أظهر لهم من البينات على أيدي رسلهم ما هو كاف لحصول التصديق بدعوة رسلهم لولا المكابرة فلذلك عجّل لهم بالعذاب .وعلى الوجهين فمتعلق { استغنى } محذوف دل عليه قوله : { فكفروا } وقوله : { بالبينات } والتقدير : واستغنى الله عن إيمانهم .وجملة { والله غني حميد } تذييل ، أي غني عن كل شيء فيما طلب منهم ، حميد لمن امتثل وشكر .\n","ar.waseet":"ثم بين - سبحانه - الأسباب التى أدت إلى سوء عاقبة هؤلاء السابقين فقال : ( ذَلِكَ بِأَنَّهُ كَانَت تَّأْتِيهِمْ رُسُلُهُم بالبينات فقالوا أَبَشَرٌ يَهْدُونَنَا ) .أى : ذلك الذى أصاب الأقوام السابقين من هلاك ودمار ، سببه أنهم كانت تأتيهم رسلهم بالآيات البينات ، وبالمعجزات الواضحات ، الدالة على صدقهم ، فما كان من هؤلاء الأقوام إلا أن أعرضوا عن دعوة الرسل ، وقال كل قوم منهم لرسولهم على سبيل الإنكار والتكذيب والتعجب : أبشر مثلنا يهدوننا إلى الحق والرشد؟!فالباء فى قوله ( بِأَنَّهُ ) للسببية ، والضمير ضمير الشأن لقصد التهويل والاستفهام فى قوله ( أَبَشَرٌ ) للإنكار والمراد بالبشر : الجنس ، وهو مرفوع على أنه مبتدأ وخبره جملة ( يَهْدُونَنَا ) .وشبيه بهذه الآية ما حكاه القرآن من قول قوم صالح له : ( فقالوا أَبَشَراً مِّنَّا وَاحِداً نَّتَّبِعُهُ إِنَّآ إِذاً لَّفِي ضَلاَلٍ وَسُعُرٍ أَأُلْقِيَ الذِّكْرُ عَلَيْهِ مِن بَيْنِنَا بَلْ هُوَ كَذَّابٌ أَشِرٌ . . . ) والفاء فى قوله : ( فَكَفَرُواْ وَتَوَلَّواْ واستغنى الله ) للسببية .أى : فكفروا بسبب هذا القول الفاسد : ( وَتَوَلَّواْ ) أى : وأعرضوا عن الحق إعراضا تاما ( واستغنى الله ) أى : واستغنى الله - تعالى - عنهم وعن إيمانهم ، والسين والتاء للمبالغة فى غناه - سبحانه - عنهم .( والله غَنِيٌّ حَمِيدٌ ) أى : والله - تعالى - غنى عنهم وعن العالمين ، محمود من كل مخلوقاته بلسان الحال والمقال وهو - تعالى - يجازى الشاكرين له بما يستحقونه من جزاء كريم .\n","ar.baghawi":"( ذلك ) العذاب ( بأنه كانت تأتيهم رسلهم بالبينات فقالوا أبشر يهدوننا ) ولم يقل : يهدينا لأن البشر وإن كان لفظه واحدا فإنه في معنى الجمع ، وهو اسم الجنس لا واحد له من لفظه وواحده إنسان ، ومعناها : ينكرون ويقولون آدمي مثلنا يهدينا ! ( فكفروا وتولوا واستغنى الله ) عن إيمانهم ( والله غني ) عن خلقه ( حميد ) في أفعاله .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5205.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5205.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5205.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا ۚ قُلْ بَلَىٰ وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ۚ وَذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","transliteration":"Za'amal lazeena kafarooo al-lany yub'asoo; qul balaa wa rabbee latub'asunna summa latunabba'unna bimaa 'amiltum; wa zaalika 'alal laahi yaseer","translations":{"en.ahmedali":"The unbelievers claim that they will not be raised again. Tell them: \"Why not? By my Lord, you will certainly be raised again, and then informed of what you had done. That is how the law of God works inevitably.\"","en.ahmedraza":"The disbelievers alleged that they will surely not be raised again; proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Surely yes, why not? By oath of Lord, you will surely be raised again and you will then be informed of your misdeeds; and this is easy for Allah.”","en.arberry":"The unbelievers assert that they will never be raised up. Say: 'Yes indeed, by my Lord! You shall be raised up, then you shall be told the things you did. That is easy for God.'","en.asad":"They who are bent on denying the truth claim that they will never be raised from the dead! Say: \"Yea, by my Sustainer! Most surely will you be raised from the dead, and then, most surely, will you be made to understand what you did [in life]! For, easy is this for God!\"","en.daryabadi":"Those who dlsbelieve assert that they shall not be raised. Say thou 'Yea! by my Lord, ye shall surely be raised, and then Unto you shall be declared that which ye have worked; and that is for Allah easy.","en.hilali":"The disbelievers pretend that they will never be resurrected (for the Account). Say (O Muhammad SAW): \"Yes! By my Lord, you will certainly be resurrected, then you will be informed of (and recompensed for) what you did, and that is easy for Allah.","en.pickthall":"Those who disbelieve assert that they will not be raised again. Say (unto them, O Muhammad): Yea, verily, by my Lord! ye will be raised again and then ye will be informed of what ye did; and that is easy for Allah.","en.qaribullah":"The unbelievers think that they will never be raised up. Say: 'By my Lord, yes indeed, you shall assuredly be raised up! Then you shall be told of all that you have done. That is easy for Allah'","en.sahih":"Those who disbelieve have claimed that they will never be resurrected. Say, \"Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did. And that, for Allah, is easy.\"","en.sarwar":"The disbelievers have thought that they would never be resurrected (Muhammad). Say, \"I swear by my Lord that you will certainly be resurrected and will be told about all that you have done.\" All this is certainly very easy for God.","en.yusufali":"The Unbelievers think that they will not be raised up (for Judgment). Say: \"Yea, By my Lord, Ye shall surely be raised up: then shall ye be told (the truth) of all that ye did. And that is easy for Allah.\"","en.maududi":"The unbelievers have vehemently contended that they shall not be raised to life. Say to them: “Yes, by my Lord, you shall surely be raised to life, and you shall certainly be fully informed of all that you did. That is easy enough for Allah.”","en.shakir":"Those who disbelieve think that they shall never be raised. Say: Aye! by my Lord! you shall most certainly be raised, then you shall most certainly be informed of what you did; and that is easy to Allah.","en.itani":"Those who disbelieve claim that they will not be resurrected. Say, “Yes indeed, by my Lord, you will be resurrected; then you will be informed of everything you did; and that is easy for God.”","en.mubarakpuri":"The disbelievers pretend that they will never be resurrected. Say: \"Yes! By my Lord, you will certainly be resurrected, then you will be informed of what you did; and that is easy for Allah.\"","en.qarai":"The faithless claim that they will not be resurrected. Say, ‘Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did, and that is easy for Allah.’","en.wahiduddin":"Those who deny the truth claim that they will never be raised up again. Say, \"By my Lord, most surely you will be raised up again and then you will be told of all that you have done; and that is easy enough for God.\""},"tafsir":{"ar.muyassar":"ادَّعى الذين كفروا بالله باطلا أنهم لن يُخْرَجوا من قبورهم بعد الموت، قل لهم -أيها الرسول-: بلى وربي لتُخْرَجُنَّ من قبوركم أحياء، ثم لتُخْبَرُنَّ بالذي عملتم في الدنيا، وذلك على الله يسير هيِّن.","ar.jalalayn":"«زعم الذين كفروا أن» مخففة واسمها محذوف، أي أنهم «لن يبعثوا قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير».","ar.qurtubi":"زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُواأي ظنوا .والزعم هو القول بالظن .وقال شريح : لكل شيء كنية وكنية الكذب زعموا .قيل : نزلت في العاص بن وائل السهمي مع خباب حسب ما تقدم بيانه في آخر سورة \" مريم \" , ثم عمت كل كافر .قُلْيا محمدبَلَى وَرَبِّي لَتُبْعَثُنَّأي لتخرجن من قبوركم أحياء .ثُمَّ لَتُنَبَّؤُنَّلتخبرن .بِمَا عَمِلْتُمْأي بأعمالكم .وَذَلِكَ عَلَى اللَّهِ يَسِيرٌإذ الإعادة أسهل من الابتداء .\n","ar.miqbas":"زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا قُلْ بَلَى وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ وَذَلِكَ عَلَى اللَّهِ يَسِيرٌ (7)هذا ضرب ثالث من ضروب كفر المشركين المخاطبين بقوله : { ألم يأتكم } [ التغابن : 5 ] الخ ، وهو كفرهم بإنكارهم البعث والجزاءَ .والجملة ابتدائية . وهذا الكلام موجه إلى النبي صلى الله عليه وسلم بقرينة قوله : { قل بلى } . وليس هذا من الإِظهار في مقام الإِضمار ولا من الالتفات بل هو ابتداء غرض مخاطببٍ به غيرُ من كان الخطاب جارياً معهم .وتتضمن الجملة تصريحاً بإثبات البعث ذلك الذي أوتي إليه فيما مضى يفيد بالحق في قوله : { خلق السموات والأرض بالحق } [ التغابن : 3 ] وبقوله : { يعلم ما في السموات والأرض } [ التغابن : 4 ] كما علمته آنفاً .والزعم : القول الموسوم بمخالفة الواقع خَطَأ فمنه الكذب الذي لم يتعمد قائله أن يخالف الواقع في ظن سامعه . ويطلق على الخبر المستغرب المشكوك في وقوع ما أُخبر به ، وعن شُريح : لكل شيء كنية وكنية الكذب زعموا ( أراد بالكنية الكناية ) . فَبَيْن الزعم والكذب عموم وخصوص وجهي .وفي الحديث «بئس مطية الرجل إلى الكذب زعموا» ، أي قول الرجل زعموا كذا . وروى أهل الأدب أن الأعشى لما أنشد قيس بن معد يكرب الكِندي قوله في مدحه :ونبئتُ قيساً ولم أَبلُه ... كما زَعموا خيرَ أهل اليمنغضب قيس وقال له : «وما هو إلا الزعم» .ولأجل ما يصاحب الزعم من توهم قائله صدق ما قاله أُلحق فعلُ زعم بأفعال الظن فنصب مفعولين . وليس كثيراً في كلامهم ، ومنه قول أبي ذؤيب :فإن تزعميني كنتُ أجهلُ فيكم ... فإني شَرَيْتُ الحِلم بَعدَككِ بالجهلومن شواهد النحو قول أبي أمية أوس الحنفي: ... زعمتْني شيخاً ولستُ بشيخإنما الشيخ من يَدبّ دبيباً ... والأكثر أن يقع بعد فعل الزعم ( أَنَّ ) المفتوحة المشددة أو المخففة مثل التي في هذه الآية فيسد المصدرُ المنسبك مسدّ المفعولين . والتقدير : زعم الذين كفروا انتفاء بعثهم .وتقدم الكلام على فعل الزعم في قوله تعالى : { ألم تر إلى الذين يزعمون أنهم آمنوا بما أنزل إليك } الآية في سورة [ النساء : 60 ] ، وقوله : { ثم نقول للذين أشركوا أين شركاؤكم الذين كنتم تزعمون } في سورة [ الأنعام : 22 ] وما ذكرته هنا أوفى .والمراد ب الذين كفروا } هنا المشركون من أهل مكة ومن على دينهم .واجتلاب حرف { لن } لتأكيد النفي فكانوا موقنين بانتفاء البعث .ولذلك جيء إبطال زعمهم مؤكَّداً بالقَسَم لينْقض نفيهم بأشد منه ، فأُمر النبي صلى الله عليه وسلم بأن يبلغهم عن الله أن البعث واقع وخاطبهم بذلك تسجيلاً عليهم أن لا يقولوا ما بلغناه ذلك .وجملة { قل بلى } معترضة بين جملة { زعم الذين كفروا } وجملةِ { فآمنوا بالله ورسوله } [ التغابن : 8 ] .وحرف { بلَى } حرف جواب للإِبطال خاصصٍ بجواب الكلام المنفي لإِبطاله .وجملة { ثم لتنبؤن بما عملتم } ارتقاء في الإِبطال .و { ثم } للتراخي الرتبي فإن إنباءهم بما عملوا أهم من إثبات البعث إذ هو العلة للبعث .والإِنباء : الإِخبار ، وإنباؤهم بما عملوا كناية عن محاسبتهم عليه وجزائهم عما عملوه ، فإن الجزاء يستلزم علم المجازَى بعمله الذي جوزي عليه فكانَ حصول الجزاء بمنزلة إخباره بما عمله كقوله تعالى : { إلينا مرجعهم فننبئهم بما عملوا } [ لقمان : 23 ] .وهذا وعيد وتهديد بجزاء سَيّىءٍ لأن المقام دليل على أن عملهم سَيىء وهو تكذيب الرسول صلى الله عليه وسلم وإنكار ما دعاهم إليه .وجملة { وذلك على الله يسير } تذييل ، والواو اعتراضية .واسم الإِشارة : إما عائد إلى البعث المفهوم من { لتبعثن } مثل قوله : { اعدلوا هو أقرب للتقوى } [ المائدة : 8 ] أي العدل أقرب للتقوى ، وإما عائد إلى معنى المذكور من مجموع { لتبعثن ثم لتنبؤن بما عملتم } .وأخبر عنه ب { يسير } دون أن يقال : وَاقِع كما قال : { وإن الدين لواقع } [ الذاريات : 6 ] ، لأن الكلام لردّ إحالتهم البعث بعلة أن أجزاء الجسد تفرقت فيتعذر جمعها فذكِّروا بأن العسير في متعارف الناس لا يعسر على الله وقد قال في الآية الأخرى { وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه } [ الروم : 27 ] .\n","ar.waseet":"ثم حكى - سبحانه - مزاعم الجاحدين للبعث والحساب ، ورد عليهم بما يبطلها ، ودعاهم إلى الإيمان بالحق ، وحضهم على العمل الصالح الذى ينفعهم يوم القيامة ، وبشر المؤمنين بما يشرح صدورهم ، وبين أن كل شىء فى هذا الكون يسير بإذنه - تعالى - وإرادته ، فقال - سبحانه - : ( زَعَمَ الذين . . . ) .قال صاحب الكشاف : قوله : ( زَعَمَ الذين كفروا أَن لَّن يُبْعَثُواْ ) . الزعم : ادعاء العلم ، ومنه قوله صلى الله عليه وسلم : \" زعموا مطية الكذب \" وعن شريح : لكل شىء كنية وكنية الكذب زعموا ، ويتعدى المفعولين تعدى العلم ، كما قال الشاعر :وإن الذى قد عاش يا أم مالك ... يموت ، ولم أزعمك عن ذاك معزلاو \" أنْ \" مع ما فى حيزها قائم مقامهما .و ( بلى ) حرف يذكر فى الجواب لإثبات النفى فى كلام سابق ، والمراد هنا : إثبات ما نفوه وهو البعث .أى : زعم الذين كفروا من أهل مكة وأشباههم من المشركين ، أنهم لن يبعثوا يوم القيامة ، لأن البعث وما يترتب عليه من حساب ، فى زعمهم محال .قل لهم - أيها الرسول الكريم - على سبيل الجزم واليقين ، كذبتم فيما تزعمونه من أنه لا بعث ولا حساب . . . . والله لتبعثن يوم القيامة ، ثم لتنبؤن بما عملتموه فى الدنيا من أعمال سيئة ، ولتحاسبن عليها حسابا عسيرا ، يترتب عليه الإلقاء بكم فى النار .وجىء فى نفى زعمهم بالجملة القسمية ، لتأكيد أمر البعث الذى نفوه بحرف ( لَّن ) ولبيان أن البعث وما يترتب عليه من ثواب وعقاب ، أمر ثابت ثبوتا قطعيا . وجملة ( ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ) ارتقاء فى الإيطال . و ( ثُمَّ ) للتراخى النسبى .أى : قل لهم إنكم لا تبعثون فحسب ، بل ستبعثون ، ثم تجدون بعد ذلك ما هو أشد من البعث ، ألا وهو إخباركم بأعمالكم السيئة ، ثم الإلقاء بكم فى النار بعد ذلك .فالمراد بالإنباء لازمه ، وهو ما يترتب عليه من حساب وعقاب .واسم الإشارة فى قوله : ( وَذَلِكَ عَلَى الله يَسِيرٌ ) يعود إلى البعث وما يترتب عليه من حساب .أى : وذلك البعث والحساب ، يسير وهين على الله - تعالى - لأنه - سبحانه - لا يعجزه شىء ، ولا يحول دون تنفيذ قدرته حائل .فهذا التذييل المقصود به إزالة ما توهموه وعموه من أن البعث أمر محال ، كما قالوا : ( أَإِذَا ضَلَلْنَا فِي الأرض أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ).\n","ar.baghawi":"ثم أخبر عن إنكارهم البعث فقال - جل ذكره - : ( زعم الذين كفروا أن لن يبعثوا قل ( زعم الذين كفروا أن لن يبعثوا قل ) يا محمد ( بلى وربي لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير)\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5206.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5206.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5206.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"فَآمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنَا ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","transliteration":"Fa-aaminoo billaahi wa rasoolihee wannooril lazeee anzalnaa; wallaahu bima ta'maloona khabeer","translations":{"en.ahmedali":"So believe in God, His Apostle and the Light We have sent down. God is well aware of what you do.","en.ahmedraza":"Therefore accept faith in Allah and His Noble Messenger and the light which We have sent down; and Allah is Well Aware of what you do.","en.arberry":"Therefore believe in God and His Messenger, and in the Light which We have sent down. And God is aware of the things you do.","en.asad":"Believe then, [O men,] in God and His Apostle, and in the light [of revelation] which We have bestowed [on you] from on high! And God is fully aware of all that you do.","en.daryabadi":"Wherefore believe in Allah and His apostle and the Light which We have sent down: And Allah is of that which ye work Aware.","en.hilali":"Therefore, believe in Allah and His Messenger (Muhammad SAW), and in the Light (this Quran) which We have sent down. And Allah is All-Aware of what you do.","en.pickthall":"So believe in Allah and His messenger and the light which We have revealed. And Allah is Informed of what ye do.","en.qaribullah":"Believe in Allah, and His Messenger, and in the Light which We have sent down. Allah is Aware of all that you do.","en.sahih":"So believe in Allah and His Messenger and the Qur'an which We have sent down. And Allah is Acquainted with what you do.","en.sarwar":"Thus, have faith in God, His Messenger and the Light which We have revealed. God is Well-Aware of what you do.","en.yusufali":"Believe, therefore, in Allah and His Messenger, and in the Light which we have sent down. And Allah is well acquainted with all that ye do.","en.maududi":"So believe in Allah and in His Messenger and in the Light that We have sent down. Allah is fully aware of what you do.","en.shakir":"Therefore believe in Allah and His Apostle and the Light which We have revealed; and Allah is Aware of what you do.","en.itani":"So believe in God and His Messenger, and the Light which We sent down. God is Aware of everything you do.","en.mubarakpuri":"Therefore, believe in Allah and His Messenger and in the Light which We have sent down. And Allah is All-Aware of what you do.","en.qarai":"So have faith in Allah and His Apostle and the light, which We have sent down, and Allah is well aware of what you do.","en.wahiduddin":"Believe then in God and His Messenger, and in the light which We have sent down. God is fully aware of all that you do."},"tafsir":{"ar.muyassar":"فآمنوا بالله ورسوله- أيها المشركون- واهتدوا بالقرآن الذي أنزله على رسوله، والله بما تفعلون خبير لا يخفى عليه شيء من أعمالكم وأقوالكم، وهو مجازيكم عليها يوم القيامة.","ar.jalalayn":"«فآمنوا بالله ورسوله والنور» القرآن «الذي أنزلنا والله بما تعملون خبير».","ar.qurtubi":"فَآمِنُوا بِاللَّهِ وَرَسُولِهِأمرهم بالإيمان بعد أن عرفهم قيام الساعة .وَالنُّورِ الَّذِي أَنْزَلْنَا وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌوهو القرآن , وهو نور يهتدى به من ظلمة الضلال .\n","ar.miqbas":"فَآَمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنَا وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (8)من جملة القول المأمور رسول الله صلى الله عليه وسلم بأن يقوله .والفاء فصيحة تفصح عن شرط مقدّر ، والتقدير : فإذا علمتم هذه الحجج وتذكّرتم ما حلّ بنظرائكم من العقاب وما ستَنبّؤونَ به من أعمالكم فآمنوا بالله ورسوله والقرآن ، أي بنصه .والمراد بالنور الذي أنْزَل الله ، القرآن ، وُصف بأنه نور على طريقة الاستعارة لأنه أشبه النور في إيضاح المطلوب باستقامة حجته وبلاغة كلامه قال تعالى : { وأنزلنا إليكم نوراً مبيناً } [ النساء : 174 ] . وأشبه النور في الإِرشاد إلى السلوك القويم وفي هذا الشبه الثاني تشاركه الكتب السماوية ، قال تعالى : { إنا أنزلنا التوراة فيها هدى ونور } [ المائدة : 44 ] ، وقرينة الاستعارة قوله : { الذي أنزلنا } ، لأنه من مناسبات المشبَّه لاشتهار القرآن بين الناس كلهم بالألقاب المشتقة من الإِنزال والتنزيل عَرَف ذلك المسلمون والمعاندون . وهو إنزال مجازي أريد به تبليغ مراد الله إلى الرسول صلى الله عليه وسلم وقد تقدم عند قوله تعالى : { والذين يؤمنون بما أنزل إليك وما أنزل من قبلك } في سورة البقرة ( 4 ) وفي آيات كثيرة .وإنما جعل الإِيمان بصدق القرآن داخلاً في حيّز فاء التفريع لأن ما قبل الفاء تضمن أنهم كذبوا بالقرآن من قوله : { ذلك بأنه كانت تأتيهم رسلهم بالبينات فقالوا أبشر يهدوننا } [ التغابن : 6 ] كما قال المشركون من أهل مكة ، والإِيمان بالقرآن يشمل الإِيمان بالبعث فكان قوله تعالى : { والنور الذي أنزلنا } شاملاً لما سبق الفاء من قوله : { زعم الذين كفروا أن لن يبعثوا } [ التغابن : 7 ] الخ .وفي قوله : { الذي أنزلنا } التفات من الغيبة إلى المتكلم لزيادة الترغيب في الإِيمان بالقرآن تذكيراً بأنه منزل من الله لأن ضمير التكلم أشد دلالة على معاده من ضمير الغائب ، ولتقوية داعي المأمور .وجملة { والله بما تعملون خبير } تذييل لجملة { فآمنوا بالله ورسوله } يقتضي وعداً إنْ آمنوا ، ووعيداً إن لم يؤمنوا .وفي ذكر اسم الجلالة إظهار في مقام الإِضمار لتكون الجملة مستقلة جارية مجرى المثل والكلممِ الجوامع ، ولأن الاسم الظاهر أقوى دلالة من الضمير لاستغنائه عن تطلب المعاد . وفيه من تربيَة المهابة ما في قول الخليفة «أمير المؤمنين يأمركم بكذا» .والخبير : العَليم ، وجيء هنا بصفة «الخبير» دون : البصير ، لأن ما يعلمونه منه محسوسات ومنه غير محسوسات كالمعتقدات ، ومنها الإِيمان بالبعث ، فعُلق بالوصف الدال على تعلق العلم الإلهي بالموجودات كلها ، بخلاف قوله فيما تقدم { هو الذي خلقكم فمنكم كافر ومنكم مؤمن والله بما تعملون بصير } [ التغابن : 2 ] فإن لكفر الكافرين وإيمان المؤمنين آثاراً ظاهرة محسوسة فعلقت بالوصف الدال على تعلق العلم الإلهي بالمحسوسات .\n","ar.waseet":"والفاء فى قوله - تعالى - ( فَآمِنُواْ بالله وَرَسُولِهِ والنور الذي أَنزَلْنَا . . . ) هى الفصيحة ، أى : التى تفصح عن شرط مقدر . والمراد بالنور : القرآن الكريم ، كما قال - تعالى - : ( وَكَذَلِكَ أَوْحَيْنَآ إِلَيْكَ رُوحاً مِّنْ أَمْرِنَا مَا كُنتَ تَدْرِي مَا الكتاب وَلاَ الإيمان ولكن جَعَلْنَاهُ نُوراً نَّهْدِي بِهِ مَن نَّشَآءُ مِنْ عِبَادِنَا ) والمعنى : إذا علمتم ما ذكرناه لكم - أيها المشركون - فاتركوا العناد ، وآمنوا بالله - تعالى - ورسوله - صلى الله عليه وسلم - إيمانا حقا ، وآمنوا - أيضا - بالقرآن الكريم الذى أنزلناه على عبدنا ورسولنا محمد - صلى الله عليه وسلم - ليكون هذا القرآن معجزة ناطقة بصدقه - صلى الله عليه وسلم - .وجملة ( والله بِمَا تَعْمَلُونَ خَبِيرٌ ) تذييل قصد به الوعد والوعيد ، أى : والله - تعالى - مطلع إطلاعا تاما على كل تصرفاتكم ، وسيمنحكم الخير إن آمنتم ، وسيلقى بكم فى النار إن بقيتم على كفركم .\n","ar.baghawi":"( فآمنوا بالله ورسوله والنور الذي أنزلنا ) وهو القرآن ( والله بما تعملون خبير)\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5207.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5207.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5207.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ۖ ذَٰلِكَ يَوْمُ التَّغَابُنِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","transliteration":"Ywma yajma'ukum li yawmil jam'i zaalika yawmut taghaabun; wa many-yumim billaahi wa ya'mal saalihany yukaffir 'anhu sayyi aatihee wa yudkhilhu jannaatin tajree min tahtihal anhaaru khaalideena feehaaa abadaa; zaalikal fawzul 'azeem","translations":{"en.ahmedali":"The day He will gather you together on the Day of Gathering, will be the day of Judgement. He who believed and did the right, will have his evil deeds expunged by God and admitted to gardens with rivers flowing by, and abide there perpetually. This will be the great achievement of success.","en.ahmedraza":"The day when He will gather you, on the Day of Collective Assembly – that is the day when the loss of the losers will be laid bare; and whoever believes in Allah and does good deeds, Allah will relieve him of his sins and admit him into Gardens beneath which rivers flow, for them to abide in it forever; this is the greatest success.","en.arberry":"Upon the day when He shall gather you for the Day of Gathering; that shall be the Day of Mutual Fraud. And whosoever believes in God, and does righteousness, God will acquit him of his evil deeds, and admit him into gardens underneath which rivers flow, therein to dwell for ever and ever; that is the mighty triumph.","en.asad":"[Think of] the time when He shall gather you all together unto the Day of the [Last] Gathering - that Day of Loss and Gain! For, as for him who shall have believed in God and done what is just and right, He will [on that Day] efface his bad deeds, and will admit him into gardens through which running waters flow, therein to abide beyond the count of time: that will be a triumph supreme!","en.daryabadi":"Remember the Day whereon He shall assemble you, the Day of Assembly; that shall be the Day of Mutual Loss and Gain. And whosoever believeth in Allah and worketh righteously from him He will expiate His misdeeds and will make him enter Gardens whereunder rivers flow, as abiders therein for evermore. That is the mighty achievement.","en.hilali":"(And remember) the Day when He will gather you (all) on the Day of Gathering, that will be the Day of mutual loss and gain (i.e. loss for the disbelievers as they will enter the Hell-fire and gain for the believers as they will enter Paradise). And whosoever believes in Allah and performs righteous good deeds, He will remit from him his sins, and will admit him to Gardens under which rivers flow (Paradise) to dwell therein forever, that will be the great success.","en.pickthall":"The day when He shall gather you unto the Day of Assembling, that will be a day of mutual disillusion. And whoso believeth in Allah and doeth right, He will remit from him his evil deeds and will bring him unto Gardens underneath which rivers flow, therein to abide for ever. That is the supreme triumph.","en.qaribullah":"The Day on which He will gather you for the Day of Gathering; that is the Day of Loss and Gain. He who believes in Allah and does good deeds, Allah willacquit him of his evil deeds and admit him to Gardens underneath which rivers flow, where he shall live for ever. That is the mighty triumph.","en.sahih":"The Day He will assemble you for the Day of Assembly - that is the Day of Deprivation. And whoever believes in Allah and does righteousness - He will remove from him his misdeeds and admit him to gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.","en.sarwar":"On the day when We shall gather you all together (for the Day of Judgment), all cheating will be exposed. Those who believe in God and act righteously will receive forgiveness for their sins. They will be admitted into Paradise wherein streams flow and they will live forever. This certainly is the greatest triumph.","en.yusufali":"The Day that He assembles you (all) for a Day of Assembly,- that will be a Day of mutual loss and gain (among you), and those who believe in Allah and work righteousness,- He will remove from them their ills, and He will admit them to Gardens beneath which Rivers flow, to dwell therein for ever: that will be the Supreme Achievement.","en.maududi":"(You shall come to know that) when He will assemble you on the Day of Gathering. That shall be the Day (to determine) mutual gains and losses. Whoever believes in Allah and acts righteously, Allah will have his evil deeds expunged and will admit him to Gardens beneath which rivers flow. Therein they shall abide forever. That is the supreme triumph.","en.shakir":"On the day that He will gather you for the day of gathering, that is the day of loss and gain; and whoever believes in Allah and does good, He will remove from him his evil and cause him to enter gardens beneath which rivers flow, to abide therein forever; that is the great achievement.","en.itani":"The Day when He gathers you for the Day of Gathering—that is the Day of Mutual Exchange. Whoever believes in God and acts with integrity, He will remit his misdeeds, and will admit him into gardens beneath which rivers flow, to dwell therein forever. That is the supreme achievement.","en.mubarakpuri":"The Day when He will gather you on the Day of Gathering, that will be the Day of At-Taghabun. And whosoever believes in Allah and performs righteous deeds, He will expiate from him his sins, and will admit him to Gardens beneath which rivers flow, to dwell therein forever; that will be the great success.","en.qarai":"When He will you bring you together for the Day of Gathering, it will be a day of privation [and regret]. As for those who have faith in Allah and act righteously, He shall absolve them of their misdeeds and admit them into gardens with streams running in them, to remain in them forever. That is the great success.","en.wahiduddin":"When He shall gather you all for the Day of Gathering, that will be the Day of loss and gain; and whoever believes in God and does good deeds shall be forgiven their sins and admitted to Gardens through which rivers flow, where they shall dwell forever. That is the supreme triumph."},"tafsir":{"ar.muyassar":"اذكروا يوم الحشر الذي يحشر الله فيه الأولين والآخرين، ذلك اليوم الذي يظهر فيه الغُبْن والتفاوت بين الخلق، فيغبن المؤمنون الكفار والفاسقين: فأهل الإيمان يدخلون الجنة برحمة الله، وأهل الكفر يدخلون النار بعدل الله. ومن يؤمن بالله ويعمل بطاعته، يمح عنه ذنوبه، ويدخله جنات تجري من تحت قصورها الأنهار، خالدين فيها أبدًا، ذلك الخلود في الجنات هو الفوز العظيم الذي لا فوز بعده.","ar.jalalayn":"اذكر «يوم يجمعكم ليوم الجمع» يوم القيامة «ذلك يوم التغابن» يغبن المؤمنون الكافرين بأخذ منازلهم وأهليهم في الجنة لو آمنوا «ومن يؤمن بالله ويعمل صالحا يكفر عنه سيئاته ويدخله» وفي قراءة بالنون في الفعلين «جنات تجري من تحتها الأنهار خالدين فيها أبدا ذلك الفوز العظيم».","ar.qurtubi":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِالعامل في \" يوم \" \" لتنبؤن \" أو \" خبير \" لما فيه من معنى الوعيد ; كأن قال : والله يعاقبكم يوم يجمعكم .أو بإضمار اذكر .والغبن : النقص .يقال : غبنه غبنا إذا أخذ الشيء منه بدون قيمته .وقراءة العامة \" يجمعكم \" بالياء ; لقوله تعالى : \" والله بما تعملون خبير \" فاخبر .ولذكر اسم الله أولا .وقرأ نصر وابن أبي إسحاق والجحدري ويعقوب وسلام \" نجمعكم \" بالنون ; اعتبارا بقوله : \" والنور الذي أنزلنا \" .ويوم الجمع يوم يجمع الله الأولين والآخرين والإنس والجن وأهل السماء وأهل الأرض .وقيل : هو يوم يجمع الله بين كل عبد وعمله .وقيل : لأنه يجمع فيه بين الظالم والمظلوم .وقيل : لأنه يجمع فيه بين كل نبي وأمته .وقيل : لأنه يجمع فيه بين ثواب أهل الطاعات وعقاب أهل المعاصي .ذَلِكَ يَوْمُ التَّغَابُنِأي يوم القيامة .قال : وما أرتجي بالعيش في دار فرقة ألا إنما الراحات يوم التغابن وسمى يوم القيامة يوم التغابن ; لأنه غبن فيه أهل الجنة أهل النار .أي أن أهل الجنة أخذوا الجنة , وأخذ أهل النار النار على طريق المبادلة ; فوقع الغبن لأجل مبادلتهم الخير بالشر , والجيد بالرديء , والنعيم بالعذاب .يقال : غبنت فلانا إذا بايعته أو شاريته فكان النقص عليه والغلبة لك .وكذا أهل الجنة وأهل النار ; على ما يأتي بيانه .ويقال : غبنت الثوب وخبنته إذا طال عن مقدارك فخطت منه شيئا ; فهو نقصان أيضا .والمغابن : ما انثنى من الخلق نحو الإبطين والفخذين .قال المفسرون : فالمغبون من غبن أهله ومنازله في الجنة .ويظهر يومئذ غبن كل كافر بترك الإيمان , وغبن كل مؤمن بتقصيره في الإحسان وتضييعه الأيام .قال الزجاج : ويغبن من ارتفعت منزلته في الجنة من كان دون منزلته .فإن قيل : فأي معاملة وقعت بينهما حتى يقع الغبن فيها .قيل له : هو تمثيل الغبن في الشراء والبيع ; كما قال تعالى : \" أولئك الذين اشتروا الضلالة بالهدى \" [ البقرة : 16 ] .ولما ذكر أن الكفار اشتروا الضلالة بالهدى وما ربحوا في تجارتهم بل خسروا , ذكر أيضا أنهم غبنوا ; وذلك أن أهل الجنة اشتروا الآخرة بترك الدنيا , واشترى أهل النار الدنيا بترك الآخرة .وهذا نوع مبادلة اتساعا ومجازا .وقد فرق الله سبحانه وتعالى الخلق فريقين : فريقا للجنة وفريقا للنار .ومنازل الكل موضوعة في الجنة والنار .فقد يسبق الخذلان على العبد - كما بيناه في هذه السورة وغيرها - فيكون من أهل النار , فيحصل الموفق على منزل المخذول ومنزل الموفق في النار للمخذول ; فكأنه وقع التبادل فحصل التغابن .والأمثال موضوعة للبيان في حكم اللغة والقرآن .وذلك كله مجموع من نشر الآثار وقد جاءت مفرقة في هذا الكتاب .وقد يخبر عن هذا التبادل بالوراثة كما بيناه في \" قد أفلح المؤمنون \" [ المؤمنون : 1 ] والله أعلم .وقد يقع التغابن في غير ذلك اليوم على ما يأتي بيانه بعد ; ولكنه أراد التغابن الذي لا جبران لنهايته .وقال الحسن وقتادة : بلغنا أن التغابن في ثلاثة أصناف : رجل علم علما فعلمه وضيعه هو ولم يعمل به فشقي به , وعمل به من تعلمه منه فنجا به .ورجل اكتسب مالا من وجوه يسأل عنها وشح عليه , وفرط في طاعة ربه بسببه , ولم يعمل فيه خيرا , وتركه لوارث لا حساب عليه فيه ; فعمل ذلك الوارث فيه بطاعة ربه .ورجل كان له عبد فعمل العبد بطاعة ربه فسعد , وعمل السيد بمعصية ربه فشقي .وروي عن النبي صلى الله عليه وسلم أنه قال : ( إن الله تعالى يقيم الرجل والمرأة يوم القيامة بين يديه فيقول الله تعالى لهما قولا فما أنتما بقائلين فيقول الرجل يا رب أوجبت نفقتها علي فتعسفتها من حلال وحرام وهؤلاء الخصوم يطلبون ذلك ولم يبق لي ما أوفي به فتقول المرأة يا رب وما عسى أن أقول اكتسبه حراما وأكلته حلالا وعصاك في مرضاتي ولم أرض له بذلك فبعدا له وسحقا فيقول الله تعالى قد صدقت فيؤمر به إلى النار ويؤمر بها إلى الجنة فتطلع عليه من طبقات الجنة وتقول له غبناك غبناك سعدنا بما شقيت أنت به ) فذلك يوم التغابن .قال ابن العربي : استدل علماؤنا بقوله تعالى : \" ذلك يوم التغابن \" على أنه لا يجوز الغبن في المعاملة الدنيوية ; لأن الله تعالى خصص التغابن بيوم القيامة فقال : \" ذلك يوم التغابن \" وهذا الاختصاص يفيد أنه لا غبن في الدنيا ; فكل من اطلع على غبن في مبيع فإنه مردود إذا زاد على الثلث .واختاره البغداديون واحتجوا عليه بوجوه : منها قوله صلى الله عليه وسلم لحبان بن منقذ : ( إذا بايعت فقل لا خلابة ولك الخيار ثلاثا ) .وهذا فيه نظر طويل بيناه في مسائل الخلاف .نكتته أن الغبن في الدنيا ممنوع بإجماع في حكم الدين ; إذ هو من باب الخداع المحرم شرعا في كل ملة , لكن اليسير منه لا يمكن الاحتراز عنه لأحد , فمضى في البيوع ; إذ لو حكمنا برده ما نفذ بيع أبدا ; لأنه لا يخلو منه , حتى إذا كان كثيرا أمكن الاحتراز منه فوجب الرد به .والفرق بين القليل والكثير أصل في الشريعة معلوم , فقدر علماؤنا الثلث لهذا الحد ; إذ رأوه في الوصية وغيرها .ويكون معنى الآية على هذا : ذلك يوم التغابن الجائز مطلقا من غير تفصيل .أو ذلك يوم التغابن الذي لا يستدرك أبدا ; لأن تغابن الدنيا يستدرك بوجهين : إما برد في بعض الأحوال , وإما بربح في بيع آخر وسلعة أخرى .فأما من خسر الجنة فلا درك له أبدا .وقد قال بعض علماء الصوفية : إن الله كتب الغبن على الخلق أجمعين , فلا يلقى أحد ربه إلا مغبونا , لأنه لا يمكنه الاستيفاء للعمل حتى يحصل له استيفاء الثواب .وفي الأثر قال النبي صلى الله عليه وسلم : ( لا يلقى الله أحد إلا نادما إن كان مسيئا إن لم يحسن , وإن كان محسنا إن لم يزدد ) .وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍوالجنات : البساتين , وإنما سميت جنات لأنها تجن من فيها أي تستره بشجرها , ومنه : المجن والجنين والجنة .تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًاأي من تحت أشجارها , ولم يجر لها ذكر , لأن الجنات دالة عليها .\" الأنهار \" أي ماء الأنهار , فنسب الجري إلى الأنهار توسعا , وإنما يجري الماء وحده فحذف اختصارا , كما قال تعالى : \" واسأل القرية \" [ يوسف : 82 ] أي أهلها .وقال الشاعر : نبئت أن النار بعدك أوقدت واستب بعدك يا كليب المجلس أراد : أهل المجلس ; فحذف .والنهر : مأخوذ من أنهرت , أي وسعت , ومنه قول قيس بن الخطيم : ملكت بها كفي فأنهرت فتقها يرى قائم من دونها ما وراءها أي وسعتها , يصف طعنة .ومنه قول النبي صلى الله عليه وسلم : ( ما أنهر الدم وذكر اسم الله عليه فكلوه ) .معناه : ما وسع الذبح حتى يجري الدم كالنهر .وجمع النهر : نهر وأنهار .ونهر نهر : كثير الماء ; قال أبو ذؤيب : أقامت به فابتنت خيمة على قصب وفرات نهر وروي : أن أنهار الجنة ليست في أخاديد , إنما تجري على سطح الجنة منضبطة بالقدرة حيث شاء أهلها .والوقف على \" الأنهار \" حسن وليس بتامذَلِكَ الْفَوْزُ الْعَظِيمُالكبير\n","ar.miqbas":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذَلِكَ يَوْمُ التَّغَابُنِ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ذَلِكَ الْفَوْزُ الْعَظِيمُ (9) { يَوْمَ يَجْمَعُكُمْ } .متعلقٌ بفعل { لتنبؤن بما عملتم } [ التغابن : 7 ] الذي هو كناية عن «تُجَازوْنَ» على تكذيبكم بالبعث فيكون من تمام ما أُمر النبي صلى الله عليه وسلم بأن يقوله لهم ابتداء من قوله تعالى : { قل بلى وربي لتبعثن } [ التغابن : 7 ] .والضمير المستتر في { يجمعكم } عائد إلى اسم الجلالة في قوله : { والله بما تعملون خبير } [ التغابن : 8 ] .ومعنى { يجمعكم } يجمع المخاطبين والأمم من الناس كلهم ، قال تعالى : { هذا يوم الفصل جمعناكم والأولين } [ المرسلات : 38 ] .ويجوز أن يراد الجمع الذي في قوله تعالى : { أيحسب الإِنسان أن لن نجمع عظامه } [ القيامة : 3 ] ، وهذا زيادة تحقيق للبعث الذي أنكروه .واللام في { ليوم الجمع } يجوز أن يكون للتعليل ، أي يجمعكم لأجل اليوم المعروف بالجمع المخصوص . وهو الذي لأجل جمع الناس ، أي يبعثكم لأجل أن يجمع الناس كلهم للحساب ، فمعنى { الجمع } هذا غيرُ معنى الذي في { يجمعكم } . فليس هذا من تعليل الشيء بنفسه بل هو من قبيل التجنيس .ويجوز أن يكون اللام بمعنى ( في ) على نحو ما قيل في قوله تعالى : { لا يجليها لوقتها إلا هو } [ الأعراف : 187 ] ، وقوله : { يا ليتني قدمت لحياتي } [ الفجر : 24 ] وقول العرب : مضى لسبيله ، أي في طريقه وهو طريق الموت .والأحسن عندي أن يكون اللام للتوقيت ، وهي التي بمعنى ( عند ) كالتي في قولهم : كُتب لكَذا مَضِينَ مثلاً ، وقوله تعالى : { أقم الصلاة لدلوك الشمس } [ الإسراء : 78 ] . وهو استعمال يدل على شدة الاقتراب ولذلك فسروه بمعنى ( عند ) ، ويفيد هنا : أنهم مجموعون في الأجل المعين دون تأخير ردّاً على قولهم : { لن يبعثوا } [ التغابن : 7 ] ، فيتعلق قوله : { ليوم الجمع } بفعل { يجمعكم } .ف«يوم الجمع» هو يوم الحشر . وفي الحديث \" يجمع الله الأولين والآخرين \" الخ . جعل هذا المركب الإِضافي لقباً ليوم الحشر ، قال تعالى : { وتنذر يوم الجمع لا ريب فيه فريق في الجنة وفريق في السعير } [ الشورى : 7 ] .وقرأ الجمهور { يجمعكم } بياء الغائب . وقرأه يعقوب بنون العظمة .{ الجمع ذَلِكَ يَوْمُ } .اعتراض بين جملة { ثم لتنبؤن بما عملتم } [ التغابن : 7 ] بمتعلقها وبين جملة { ومن يؤمن بالله ويعمل صالحاً نكفر عنه سيئاته } اعتراضاً يفيد تهويل هذا اليوم تعريضاً بوعيد المشركين بالخسارة في ذلك اليوم : أي بسوء المنقلب .والإِتيان باسم الإِشارة في مقام الضمير لقصد الاهتمام بهذا اليوم بتمييزه أكمل تمييز مع ما يفيده اسم إشارة البعيد من علوّ المرتبة على نحو ما تقدم في قوله : { ذلك الكتاب } في سورة [ البقرة : 2 ] .والتغابن } : مصدر غابَنه من باب المفاعلة الدالة على حصول الفعل من جانبين أو أكثر .وحقيقة صيغة المفاعلة أن تدل على حصول الفعل الواحد من فاعلين فأكثر على وجه المشاركة في ذلك الفعل .والغبن أن يعطى البائع ثمَناً لمبيعه دون حَقِّ قيمته التي يعوَّض بها مثلُه .فالغبن يؤول إلى خسارة البائع في بيعه ، فلذلك يطلق الغبن على مطلق الخسران مجازاً مرسلاً كما في قول الأعشى: ... لا يقبَلُ الرَشْوَة في حُكمهولا يبالي غَبن الخَاسر ... فليست مادة التغابن في قوله : { يوم التغابن } مستعملة في حقيقتها إذ لا تعارض حتى يكون فيه غبن بل هو مستعمل في معنى الخسران على وجه المجاز المرسل .وأما صيغة التفاعل فحملها جمهور المفسرين على حقيقتها من حصول الفعل من جانبين ففسروها بأن أهل الجنة غبنوا أهل النار إذ أهل الجنة أخذوا الجنة وأهل جهنم أخذوا جهنم قاله مجاهد وقتادة والحسن . فحمل القرطبي وغيره كلام هؤلاء الأيمة على أن التغابن تمثيل لحال الفريقين بحال مُتَبايَعَيْن أخذ أحدهما الثمن الوافيَ ، وأخذ الآخر الثمنَ المغبون ، يعني وقوله عقبه { ومن يؤمن بالله ويعمل صالحاً نكفر عنه سيئاته } ، إلى قوله : { وبئس المصير } قرينة على المراد من الجانبين وعلى كلا المعنيين يكون قوله : { ومن يؤمن بالله ويعمل صالحاً } إلى قوله : { وبئس المصير } تفصيلاً للفريقين ، فيكون في الآية مجاز وتشبيه وتمثيل ، فالمجاز في مادة الغبن ، والتمثيل في صيغة التغابن ، وهو تشبيه مركب بمنزلة التشبيه البليغ إذ التقدير : ذلك يوم مِثْل التغَابن .وحمل قليل من المفسرين ( وهو ما فسر إليه كلام الراغب في مفرداته ) وصرح ابن عطية صيغَة التفاعل على معنى الكثرة وشدة الفعل ( كما في قولنا : عافاك الله وتبارك الله ) فتكون استعارة ، أي خسارة للكافرين إذ هم مناط الإِنذار . وهذا في معنى قوله تعالى : { أولئك الذين اشتروا الضلالة بالهدى فما ربحت تجارتهم } في سورة [ البقرة : 16 ] ، وقوله : { يأيها الذين آمنوا هل أدلكم على تجارة تنجيكم من عذاب أليم } الآية في سورة [ الصف : 10 ] .فصيغة التفاعل مستعملة مجازاً في كثرة حصول الغبن تشبيهاً للكثرة بفعل من يحصل من متعدد .والكلام تهديد للمشركين بسوء حالتهم في يوم الجمع ، إذ المعنى : ذلك يوم غبنكم الكثير الشديد بقرينة قوله قبله { فآمنوا بالله ورسوله والنور الذي أنزلنا } [ التغابن : 8 ] . والغابن لهم هو الله تعالى .ولولا قصد ذلك لما اقتصر على أن ذلك يوم تغابن فإن فيه ربحاً عظيماً للمؤمنين بالله ورسوله والقرآن ، فوزان هذا القصر وزان قوله : { فما ربحت تجارتهم } [ البقرة : 16 ] وقول النبي صلى الله عليه وسلم « إنما المُفلس الذي يفلس يوم القيامة »وأفاد تعريف جزأي جملة { ذلك يوم التغابن } قصرَ المسند على المسند إليه أي قصر جنس يوم التغابن على يوم الجمعة المشار إليه باسم الإِشارة ، وهو من قبيل قصر الصفة على الموصوف قصراً ادعائياً ، أي ذلك يوم الغبن لا أيام أسواقكم ولا غيرُها ، فإن عدم أهمية غبن الناس في الدنيا جعل غبن الدنيا كالعدم وجعل يوم القيامة منحصراً فيه جنس الغبن .وأما لام التعريف في قوله : { التغابن } فهي لام الجنس ، ومن هذا المعنى قوله تعالى : { قل إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة }[ الزمر : 15 ] . وقوله في ضده { يرجون تجارة لن تبور } [ فاطر : 29 ] . هذا هو المتعين في تفسير هذه الآية وأكثر المفسرين مرّ بها مَرّاً . ولم يحتلب منها دَرّاً . وها أنا ذَا كددت ثمادي ، فعَسَى أن يقع للناظر كوقْع القراححِ من الصادي ، والله الهادي .{ } لله .معطوفة على جملة { فآمنوا بالله ورسوله خَبِيرٌ * يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الجمع ذَلِكَ يَوْمُ التغابن وَمَن يُؤْمِن بالله وَيَعْمَلْ صالحا يُكَفِّرْ عَنْهُ سيئاته وَيُدْخِلْهُ جنات تَجْرِى مِن تَحْتِهَا الانهار خالدين فِيهَآ أَبَداً ذَلِكَ الفوز العظيم *\n","ar.waseet":"ثم حذرهم - سبحانه - من أهوال يوم القيامة فقال - تعالى - : ( يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الجمع ذَلِكَ يَوْمُ التغابن ) .والظرف ( يَوْمَ ) متعلق بقوله - تعالى - قبل ذلك : ( ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ) .والمراد بيوم الجمع : يوم القيامة سمى بذلك لأنه اليوم الذى يجتمع فيه الأولون والآخرون؟ فى مكان واحد للحساب والجزاء .وسمى - أيضا بيوم التغابن ، لأنه اليوم الذى يغبن فيه أهل الحق أهل الباطل .والتغابن تفاعل من الغبن بمعنى الخسران والنقص ، يقال غبن فلان فلانا إذا بخسه حقه ، بأن أخذ منه سلعة بثمن أقل من ثمنها المعتاد ، وأكثر ما يستعمل الغبن فى البيع والشراء ، وفعله من باب ضرب ، ويطلق الغبن على مطلق الخسران أى : قل - أيها الرسول الكريم - لهؤلاء الجاحدين للبعث : لتبعثن يوم القيامة ثم لتنبؤن بما عملتم يوم القيامة يوم يجتمع الخلائق للحساب فيغبن فيه أهل الحق أهل الباطل ، ويغبن فيه المؤمنون الكافرين ، لأن أهل الإيمان ظفروا بالجنة ، وبالمقاعد التى كان سيظفر بها الكافرون لو أنهم آمنوا ، ولكن الكافرين استمروا على كفرهم فخسروا مقاعدهم فى الجنة ، ففاز بها المؤمنون .قال القرطبى : ( يَوْمُ التغابن ) أى : يوم القيامة . . وسمى يوم القيامة بيوم التغابن ، لأنه غبن أهلُ الجنة أهلَ النار .أى : أن أهل اجنة أخذوا الجنة ، وأهل النار أخذوا النار على طريق المبادلة فوقع الغبن على الكافرين لأجل مبادلتهم الخير بالشر ، والنعيم بالعذاب .يقال : عبنت فلانا ، إذا بايعَته أو ساريتَه ، فكان النقص عليه ، والغلبة لك .فإن قيل : فأى معاملة وقعت بينهما حتى يقع الغبن فيها؟ قيل له : هو تمثيل الغبن فى الشراء والبيع .وقال الآلوسى ما ملخصه : ( ذَلِكَ يَوْمُ التغابن ) أى يومُ غبنَ فيه أهل الجنة أهل النار ، فالتفاعلل ليس على ظاهره ، كما فى التواضع والتحامل لوقوعه من جانب واحد ، واختير للمبالغة .وقد ورد هذا التفسير عن ابن عباس ومجاهد وقتادة . واختاره الواحدى .وقال غير واحد : ( ذَلِكَ يَوْمُ التغابن ) أى : اليوم الذى غبن فيه بعض الناس بعضا ، بنزول السعداء منازل الأشقياء لو كانوا سعداء ، وبالعكس ففى الحديث الصحيح : \" ما من عبد يدخل الجنة إلا أُرِى مقعده من النار - لو أساء - ليزداد شكرا ، وما من عبد يدخل النار إلا أرى مقعده من الجنة - لو أحسن ليزداد حسرة - \" وهو مستعار من تغابن القوم فى التجارة ، وفيه تهكم بالأشقياء لأنهم لا يغبنون حقيقة السعداء ، بنزولهم فى منازلهم من النار .ثم فصل - سبحانه - أحوال الناس فى هذا اليوم الهائل الشديد فقال؛ ( وَمَن يُؤْمِن بالله وَيَعْمَلْ صَالِحاً يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأنهار ) .أى : ومن يؤمن بالله - تعالى - إيمانا حقا ، ويعمل عملا صالحا ، يكفر الله - تعالى - عنه سيئاته التى عملها فى الدنيا بأن يزيلها من صحيفة علمه - فضلا منه - تعالى - وكرما - وفوق ذلك يدخله بفضله وإحسانه جنات تجرى من تحت ثمارها الأنهار ( خَالِدِينَ فِيهَآ أَبَداً ) أى : خلودا أبديا .( ذَلِكَ ) الذى ذكرناه لكم من تكفير السيئات ، ومن دخول الجنات . . . هو ( الفوز العظيم ) الذى لا فوز يقاربه أو يدانيه .\n","ar.baghawi":"( يوم يجمعكم ليوم الجمع ) يعني يوم القيامة يجمع فيه أهل السماوات والأرض ( ذلك يوم التغابن ) وهو تفاعل من الغبن وهو فوت الحظ ، والمراد بالمغبون من غبن عن أهله ومنازله في الجنة ، فيظهر يومئذ غبن كل كافر بتركه الإيمان ، وغبن كل مؤمن بتقصيره في الإحسان ( ومن يؤمن بالله ويعمل صالحا يكفر عنه سيئاته ويدخله جنات تجري من تحتها الأنهار ) قرأ أهل المدينة والشام : \" نكفر \" \" وندخله \" وفي سورة الطلاق \" ندخله \" بالنون فيهن ، وقرأ الآخرون بالياء ( خالدين فيها أبدا ذلك الفوز العظيم ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5208.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5208.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5208.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا ۖ وَبِئْسَ الْمَصِيرُ","transliteration":"Wallazeena kafaroo wa kazzaboo bi aayaaatinaaa ulaaa'ika ashaabun naari khaalideena feehaa bi'sal maseer","translations":{"en.ahmedali":"Those who did not believe and denied Our revelations will be inmates of Hell, where they will abide for ever, and how evil a journey's end!","en.ahmedraza":"And those who disbelieved and denied Our signs, are the people of the fire – to remain in it forever; and what a wretched outcome!","en.arberry":"And those who disbelieved and cried lies to Our signs, those shall be the inhabitants of the Fire. therein to dwell forever -- an evil homecoming!","en.asad":"But as for those who are bent on denying the truth and on giving the lie to Our messages - they are destined for the fire, therein to abide: and how vile a journey’s end!","en.daryabadi":"And they who disbelieve and belie Our Signs! those shall be fellows of the Fire, as abiders therein; a hapless destination.","en.hilali":"But those who disbelieved (in the Oneness of Allah - Islamic Monotheism) and denied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination.","en.pickthall":"But those who disbelieve and deny Our revelations, such are owners of the Fire; they will abide therein - a hapless journey's end!","en.qaribullah":"As for those who disbelieved and belied Our verses, they shall be the inhabitants of the Fire and shall live therein for ever. Evil shall be their arrival.","en.sahih":"But the ones who disbelieved and denied Our verses - those are the companions of the Fire, abiding eternally therein; and wretched is the destination.","en.sarwar":"As for those who have disbelieved and rejected Our revelations, they will dwell forever in hell fire, a terrible fate.","en.yusufali":"But those who reject Faith and treat Our Signs as falsehoods, they will be Companions of the Fire, to dwell therein for aye: and evil is that Goal.","en.maududi":"As for those who disbelieved and gave the lie to Our Signs: they shall be the inmates of the Fire, and will abide in it. That is a woeful resort!","en.shakir":"And (as for) those who disbelieve and reject Our communications, they are the inmates of the fire, to abide therein and evil is the resort.","en.itani":"But as for those who disbelieve and denounce Our revelations—these are the inmates of the Fire, dwelling therein forever; and what a miserable fate!","en.mubarakpuri":"But those who disbelieved and denied Our Ayat, they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination","en.qarai":"But as for those who are faithless and deny Our signs, they will be the inmates of the Fire, to remain in it [forever], and it is an evil destination.","en.wahiduddin":"But those who denied the truth and rejected Our signs shall be the inmates of the Fire, there to remain -- what an evil destination!"},"tafsir":{"ar.muyassar":"والذين جحدوا أن الله هو الإله الحق وكذَّبوا بدلائل ربوبيته وبراهين ألوهيته التي أرسل بها رسله، أولئك أهل النار ماكثين فيها أبدًا، وساء المرجع الذي صاروا إليه، وهو جهنم.","ar.jalalayn":"«والذين كفروا وكذبوا بآياتنا» القرآن «أولئك أصحاب النار خالدين فيها وبئس المصير» هي.","ar.qurtubi":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَايعني القرآنأُولَئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا وَبِئْسَ الْمَصِيرُلما ذكر ما للمؤمنين ذكر ما للكافرين كما تقدم في غير موضع\n","ar.miqbas":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآَيَاتِنَا أُولَئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا وَبِئْسَ الْمَصِيرُ (10)والذين كَفَرُواْ وَكَذَّبُواْ بھاياتنآ أولئك أصحاب النار خالدين فِيهَا وَبِئْسَ المَصِيرُ } معطوفة على جملة { فآمنوا بالله ورسوله } [ التغابن : 8 ] وهو تفصيل لما أجمل في قوله : { والله بما تعملون خبير } [ التغابن : 8 ] الذي هو تذييل .و { مَن } شرطية والفعل بعدها مستقبل ، أي من يؤمن من المشركين بعد هذه الموعظة نكفر عنه ما فرط من سيئاته .والمراد بالسيئات : الكفر وما سبقه من الأعمال الفاسدة .وتكفير السيئات : العفو عن المؤاخذة بها وهو مصدر كفّر مبالغة في كفَر . وغلب استعماله في العفو عما سلف من السيّئات وأصله : استعارة الستر للإِزالة مثل الغفران أيضاً .وانتصب { صالحاً } على الصفة لمصدر وهو مفعول مطلق محذوف تقديره : عملاً صالحاً .وقرأ نافع وابن عامر وأبو جعفر { نكفر } و { ندخله } بنون العظمة على الالتفات من الغيبة إلى التكلم لأن مقام الوعد مقام إقبال فناسبه ضمير التكلم .وقرأهما الباقون بياء الغيبة على مقتضى الظاهر لأن ضمير الجلالة يؤذن بعناية الله بهذا الفريق . وجملة { ذلك الفوز العظيم } تذييل .وقوله : { والذين كفروا وكذبوا } ، أي كفروا وكذبوا من قبلُ واستمرُّوا على كفرهم وتكذيبهم فلم يستجيبوا لهذه الدعوة ثبت لهم أنهم أصحاب النار . ولذلك جيء في جانب الخبر عنهم بالجملة الاسمية الدالة على الثبات لعراقتهم في الكفر والتكذيب .وجيء لهم باسم الإِشارة لتمييزهم تمييزاً لا يلتبس معه غيرهم بهم مثل قوله : { أولئك على هدى من ربهم } [ البقرة : 5 ] مع ما يفيده اسم الإِشارة من أن استحقاقهم لملازمة النار ناشىء عن الكفر والتكذيب بآيات الله وهذا وعيد .وجملة { وبئس المصير } اعتراض تذييلي لزيادة تهويل الوعيد .\n","ar.waseet":"( والذين كَفَرُواْ ) بربهم بأن أشركوا معه فى العبادة آلهة أخرى .( وَكَذَّبُواْ بِآيَاتِنَآ ) الدالة على وحدانيتنا ، وعلى صدق نبينا - صلى الله عليه وسلم - .( أولئك ) الكافرون المكذبون هم ( أَصْحَابُ النار خَالِدِينَ فِيهَا ) خلودا أبديا ( وَبِئْسَ المصير ) مصيرهم النار .ففى هاتين الآيتين الكريمتين ، بيان للتغابن ، وتفصيل له ، لاحتوائهما على بيان منازل السعداء والأشقياء ، وهو ما وقع فيه التغابن .\n","ar.baghawi":"\"والذين كفروا وكذبوا بآياتنا أولئك أصحاب النار خالدين فيها وبئس المصير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5209.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5209.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5209.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","transliteration":"Maaa asaaba mim musee batin illaa bi-iznil laah; wa many yu'mim billaahi yahdi qalbah; wallaahu bikulli shai;in Aleem","translations":{"en.ahmedali":"No calamity befalls unless God dispenses. He guides the heart of whosoever believes in God; and God has knowledge of everything.","en.ahmedraza":"No misfortune befalls except by Allah’s command; and Allah will guide the heart of whoever accepts faith in Him; and Allah knows all things.","en.arberry":"No affliction befalls, except it be by the leave of God. Whosoever believes in God, He will guide his heart. And God has knowledge of everything.","en.asad":"NO CALAMITY can ever befall [man] unless it be by God's leave: hence, whoever believes in God guides his [own] heart [towards this truth]; and God has full knowledge of everything.","en.daryabadi":"No calamity befalleth save by Allah's leave. And whosoever believeth in Allah, his heart He guideth. And Allah is of everything Knower.","en.hilali":"No calamity befalls, but with the Leave [i.e. decision and Qadar (Divine Preordainments)] of Allah, and whosoever believes in Allah, He guides his heart [to the true Faith with certainty, i.e. what has befallen him was already written for him by Allah from the Qadar (Divine Preordainments)], and Allah is the All-Knower of everything.","en.pickthall":"No calamity befalleth save by Allah's leave. And whosoever believeth in Allah, He guideth his heart. And Allah is Knower of all things.","en.qaribullah":"No affliction falls except by the permission of Allah. For those who believe in Allah, Allah will guide his heart. Allah has knowledge of all things.","en.sahih":"No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things.","en.sarwar":"No one will be afflicted with any hardship without it being the will of God. The hearts of whoever believed in God will receive guidance. God has the knowledge of all things.","en.yusufali":"No kind of calamity can occur, except by the leave of Allah: and if any one believes in Allah, (Allah) guides his heart (aright): for Allah knows all things.","en.maududi":"No misfortune ever befalls unless it be by Allah's leave. And whosoever has faith in Allah, Allah directs his heart along the Right Path. Allah has knowledge of everything.","en.shakir":"No affliction comes about but by Allah's permission; and whoever believes in Allah, He guides aright his heart; and Allah is Cognizant of all things.","en.itani":"No disaster occurs except by God’s leave. Whoever believes in God, He guides his heart. God is Aware of everything.","en.mubarakpuri":"No calamity occurs, but by the permission of Allah, and whosoever believes in Allah, He guides his heart. And Allah is the All-Knower of everything.","en.qarai":"No affliction visits [anyone] except by Allah’s leave. Whoever has faith in Allah, He guides his heart, and Allah has knowledge of all things.","en.wahiduddin":"No affliction can befall man but by God's permission -- He guides the hearts of those who believe in Him: God has knowledge of all things --"},"tafsir":{"ar.muyassar":"ما أصاب أحدًا شيءٌ من مكروه يَحُلُّ به إلا بإذن الله وقضائه وقدره. ومَن يؤمن بالله يهد قلبه للتسليم بأمره والرضا بقضائه، ويهده لأحسن الأقوال والأفعال والأحوال؛ لأن أصل الهداية للقلب، والجوارح تبع. والله بكل شيء عليم، لا يخفى عليه شيء من ذلك.","ar.jalalayn":"«ما أصاب من مصيبة إلا بإذن الله» بقضائه «ومن يؤمن بالله» في قوله إن المصيبة بقضائه «يهد قلبه» للصبر عليها «والله بكل شىء عليم».","ar.qurtubi":"مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِأي بإرادته وقضائه .وقال الفراء : يريد إلا بأمر الله .وقيل : إلا بعلم الله .وقيل : سبب نزولها أن الكفار قالوا : لو كان ما عليه المسلمون حقا لصانهم الله عن المصائب في الدنيا ; فبين الله تعالى أن ما أصاب من مصيبة في نفس أو مال أو قول أو فعل , يقتضي هما أو يوجب عقابا عاجلا أو آجلا فبعلم الله وقضائه .وَمَنْ يُؤْمِنْ بِاللَّهِأي يصدق ويعلم أنه لا يصيبه مصيبة إلا بإذن الله .يَهْدِ قَلْبَهُللصبر والرضا .وقيل : يثبته على الإيمان .وقال أبو عثمان الجيزي : من صح إيمانه يهد الله قلبه لاتباع السنة .وقيل : \" ومن يؤمن بالله يهد قلبه \" عند المصيبة فيقول : \" إنا لله وإنا إليه راجعون \" [ البقرة : 156 ] ; قاله ابن جبير .وقال ابن عباس : هو أن يجعل الله في قلبه اليقين ليعلم أن ما أصابه لم يكن ليخطئه , وأن ما أخطأه لم يكن ليصيبه .وقال الكلبي : هو إذا ابتلي صبر , وإذا أنعم عليه شكر , وإذا ظلم غفر .وقيل : يهد قلبه إلى نيل الثواب في الجنة .وقراءة العامة \" يهد \" بفتح الياء وكسر الدال ; لذكر اسم الله أولا .وقرأ السلمي وقتادة \" يهد قلبه \" بضم الياء وفتح الدال على الفعل المجهول ورفع الباء ; لأنه اسم فعل لم يسم فاعله .وقرأ طلحة بن مصرف والأعرج \" نهد \" بنون على التعظيم \" قلبه \" بالنصب .وقرأ عكرمة \" يهدأ قلبه \" بهمزة ساكنة ورفع الباء , أي يسكن ويطمئن .وقرأ مثله مالك بن دينار , إلا أنه لين الهمزة .وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌلا يخفى عليه تسليم من انقاد وسلم لأمره , ولا كراهة من كرهه .\n","ar.miqbas":"مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ (11)استئناف انتقل إليه بعد أن تُوُعِّد المشركون بما يحصل لهم من التغابن يوم يجمع الله الناس يوم الحساب . ويشبه أن يكون استئنافاً بيانياً لأن تهديد المشركين بيوم الحساب يثير في نفوس المؤمنين التساؤل عن الانتصاف من المشركين في الدنيا على ما يلقاه المسلمون من إضرارهم بمكة فإنهم لم يكفوا عن أذى المسلمين وإصابتهم في أبدَانهم وأموالهم والفتنة بينهم وبين أزواجهم وأبنائهم .فالمراد : المصائبُ التي أصابت المسلمين من معاملة المشركين فأنبأهم الله بما يسليهم عن ذلك بأن الله عالم بما ينالهم . وقال القرطبي «قيل سبب نزولها أن الكفار قالوا : لو كان ما عليه المسلمون حقاً لصانهم الله عن المصائب» .واختصت المصيبة في استعمال اللغة بما يَلحق الإِنسان من شر وضر وإن كان أصل فعلها يقال كما يصيب الإِنسان مطلقاً ولكن غلب إطلاق فعل أصاب على لحاق السوء ، وقد قيل في قوله تعالى : { ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك } [ النساء : 79 ] ، أن إسناد الإِصابة إلى الحسنة من قبيل المشاكلة .وتأنيث المصيبة لتأويلها بالحادثة وتقدم عند قوله تعالى : { أو لما أصابتكم مصيبة قد أصبتم مثليها } في سورة [ آل عمران : 165 ] .والإِذن : أصله إجازة الفعل لمن يفعله وأطلق على إباحة الدخول إلى البيت وإزالة الحجاب لأنه مشتق من أذِن له إذا سمع كلامه . وهو هنا مستعار لتكوين أسباب الحوادث . وهي الأسباب التي تفضي في نظام العادة إلى وقوععِ واقعات ، وهي من آثار صنع الله في نظام هذا العالم من ربط المسببات بأسبابها مع علمه بما تفضي إليه تلك الأسباب فلما كان هو الذي أوجد الأسباب وأسبابَ أسبابها ، وكان قد جعل ذلك كله أصولاً وفروعاً بعلمه وحكمته ، أطلق على ذلك التقدير والتكوين لفظُ الإِذن ، والمشابهة ظاهرة ، وهذا في معنى قوله : { ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها } [ الحديد : 22 ] .ومقتضى هذه الاستعارة تقريب حقيقة التقلبات الدنيوية إلى عقول المسلمين باختصار العبارة لضيق المقام عن الإِطناب في بيان العلل والأسباب ، ولأن أكثر ذلك لا تبلغ إليه عقول عموم الأمة بسهولة . والقصد من هذا تعليم المسلمين الصبر على ما يغلبهم من مصائب الحوادث لكيلا تُفَلّ عزائمهم ولا يهنوا ولا يلهيهم الحزن عن مهمات أمورهم وتدبير شؤونهم كما قال في سورة [ الحديد : 23 ] { لكيلا تأسَوا على ما فاتكم }ولذلك أعقبه هنا بقوله : ومن يؤمن بالله يهد قلبه } ، أي يهد قلبه عندما تصيبه مصيبة ، فحذف هذا المتعلق لظهوره من السياق قال : { ولا تهنوا ولا تحزنوا وأنتم الأعلون إن كنتم مؤمنين إن يَمْسَسْكُم قَرح فقد مسّ القوم قرْح مثلُه وتلك الأيام نداولها بين الناس }[ آل عمران : 139 - 140 ] .والمعنى : أن المؤمن مرتاض بالأخلاق الإِسلامية متبع لوصايا الله تعالى فهو مجاف لفاسد الأخلاق من الجزع والهلع يتلقى ما يصيبه من مصيبة بالصبر والتفكر في أن الحياة لا تخلو من عوارض مؤلمة أو مكدرة . قال تعالى : { وبشر الصابرين الذين إذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون أولئك عليهم صلوات من ربهم ورحمة وأولئك هم المهتدون } [ البقرة : 155 - 157 ] ، أي أصحاب الهدى الكامل لأنه هدىً متلقىًّ من التعاليم الإلهية الحق المعصومة من الخطل كقوله هنا : { يهد قلبه } .وهذا الخبر في قوله : { ومن يؤمن بالله يهد قلبه } إيماء إلى الأمر بالثبات والصبر عند حلول المصائب لأنه يلزم من هدْي الله قلب المؤمن عند المصيبة ترغيب المؤمنين في الثبات والتصبر عند حلول المصائب فلذلك ذيل بجملة { والله بكل شيء عليم } فهو تذييل للجملة التي قبلها وارد على مراعاة جميع ما تضمنته من أن المصائب بإذن الله ، ومن أن الله يهدي قلوب المؤمنين للثبات عند حلول المصائب ومن الأمر بالثبات والصبر عند المصائب ، أي يعلم جميع ذلك .وفيه كناية عن مجازاة الصابرين بالثواب لأن فائدة علم الله التي تهم الناس هو التخلق ورجاء الثواب ورفع الدرجات .\n","ar.waseet":"ثم بين - سبحانه - أن كل شىء بقضائه وقدره فقال : ( مَآ أَصَابَ مِن مُّصِيبَةٍ إِلاَّ بِإِذْنِ الله ) .والمراد بالمصيبة : الرزية والنكبة ، وكل ما يسوء الإنسان فى نفسه أو ماله أو ولده . . . والمفعول محذوف ، و \" من \" للتأكيد ، و ( مُّصِيبَةٍ ) فاعل .أى : ما أصاب أحدا مصيبة فى نفسه أو ماله أو ولده . . إلا بإذن الله - تعالى - وأمره وإرادته ، لأن كل شىء بقضائه - سبحانه - وقدره .قال القرطبى : قيل : سبب نزولها أن الكفار قالوا : لو كان ما عليه المسلمون حقا لصانهم الله - تعالى - عن المصائب .فأنزل الله - تعالى - هذه الآية للرد على المشركين ، ولبيان أن كل شىء بإرادته - سبحانه - .ثم بين - سبحانه - أن الإيمان الحق يعين على استقبال المصائب بصبر جميل فقال : ( وَمَن يُؤْمِن بالله يَهْدِ قَلْبَهُ والله بِكُلِّ شَيْءٍ عَلِيمٌ ) أى : ومن يؤمن بالله - تعالى - إيمانا حقا يهد قلبه إلى الصبر الجميل ، وإلى الاستسلام لقضائه - سبحانه - لأن إيمانه الصادق يجعله يعتقد أن ما أصابه لم يكن ليخطئه ، وما أخطأه لم يكن ليصيبه ، والله - تعالى - عليم بكل شىء ، لا تخفى عليه خافية فى الأرض ولا فى السماء .قال الإمام ابن كثير : قوله - تعالى - : ( وَمَن يُؤْمِن بالله يَهْدِ قَلْبَهُ ) أى : ومن أصابته مصيبة فعلم أنها بقضاء الله وقدره : فصبر واحتسب واستسلم لقضائه - تعالى - هدى الله قلبه ، وعوضه عما فاته من الدنيا .وفى الحديث المتفق عليه : عجبا للمؤمن ، لا يقضى الله له قضاء إلا كان خيرا له ، إن أصابته ضراء صبر فكان خيرا له ، وإن أصابته سراء شكر فكان خيراً له ، وليس ذلك لأحد إلا للمؤمن .\n","ar.baghawi":"( ما أصاب من مصيبة إلا بإذن الله ) [ بإرادته وقضائه ] ( ومن يؤمن بالله ) فيصدق أنه لا يصيبه مصيبة إلا بإذن الله ( يهد قلبه ) يوفقه لليقين حتى يعلم أن ما أصابه لم يكن ليخطئه ، وما أخطأه لم يكن ليصيبه فيسلم [ لقضائه ] ( والله بكل شيء عليم ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5210.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5210.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5210.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ۚ فَإِنْ تَوَلَّيْتُمْ فَإِنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ","transliteration":"Wa atee'ul laaha wa atee'ur Rasool; fa in tawallaitum fa innamaa 'alaa Rasoolinal balaaghul mubeen","translations":{"en.ahmedali":"Obey God and obey His Apostle. If you turn away, the duty of the Apostle is to convey the message clearly.","en.ahmedraza":"And obey Allah and obey His Noble Messenger; then if you turn away, know that the duty upon Our Noble Messenger is only to plainly convey.","en.arberry":"And obey God, and obey the Messenger; but if you turn your backs, it is only for the Messenger to deliver the Manifest Message.","en.asad":"Pay heed, then, unto God, and pay heed unto the Apostle; and if you turn away, [know that] Our Apostle's only duty is a clear delivery of this message:","en.daryabadi":"Obey Allah and obey the apostlle; then if ye turn away, on Our apostle is only the preaching manifest.","en.hilali":"Obey Allah, and obey the Messenger (Muhammad SAW), but if you turn away, then the duty of Our Messenger is only to convey (the Message) clearly.","en.pickthall":"Obey Allah and obey His messenger; but if ye turn away, then the duty of Our messenger is only to convey (the message) plainly.","en.qaribullah":"Obey Allah and obey the Messenger. But, if you turn away, Our Messenger's duty is only to deliver the Clear Message.","en.sahih":"And obey Allah and obey the Messenger; but if you turn away - then upon Our Messenger is only [the duty of] clear notification.","en.sarwar":"Obey God and the Messenger, but if you turn away, know that the only duty of Our Messenger is to clearly preach.","en.yusufali":"So obey Allah, and obey His Messenger: but if ye turn back, the duty of Our Messenger is but to proclaim (the Message) clearly and openly.","en.maududi":"Obey Allah and obey the Messenger. But if you turn away from obedience, (then know that) Our Messenger has no other duty than to clearly convey the Truth.","en.shakir":"And obey Allah and obey the Apostle, but if you turn back, then upon Our Apostle devolves only the clear delivery (of the message).","en.itani":"So obey God, and obey the Messenger. But if you turn away—it is only incumbent on Our Messenger to deliver the clear message.","en.mubarakpuri":"Obey Allah, and obey the Messenger; but if you turn away, then the duty of Our Messenger is only to convey clearly.","en.qarai":"Obey Allah and obey the Apostle; but if you turn away, then Our Apostle’s duty is only to communicate in clear terms.","en.wahiduddin":"obey God and obey the Messenger; but if you turn away, remember that Our Messenger is only responsible for clearly conveying the message."},"tafsir":{"ar.muyassar":"وأطيعوا الله -أيها الناس- وانقادوا إليه فيما أمر به ونهى عنه، وأطيعوا الرسول صلى الله عليه وسلم، فيما بلَّغكم به عن ربه، فإن أعرضتم عن طاعة الله ورسوله، فليس على رسولنا ضرر في إعراضكم، وإنما عليه أن يبلغكم ما أرسل به بلاغًا واضح البيان.","ar.jalalayn":"«وأطيعوا الله وأطيعوا الرسول فإن توليتم فإنما على رسولنا البلاغ المبين» البيَّن.","ar.qurtubi":"أي هونوا على أنفسكم المصائب , واشتغلوا بطاعة الله , واعملوا بكتابه , وأطيعوا الرسول في العمل بسنته ; فإن توليتم عن الطاعة فليس على الرسول إلا التبليغ .\n","ar.miqbas":"وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ فَإِنْ تَوَلَّيْتُمْ فَإِنَّمَا عَلَى رَسُولِنَا الْبَلَاغُ الْمُبِينُ (12)عطف على جملة { ومن يؤمن بالله يهد قلبه } [ التغابن : 11 ] لأنها تضمنت أن المؤمنين متهيئون لطاعة الله ورسوله صلى الله عليه وسلم فيما يدعوانهم إليه من صالح الأعمال كما يدل عليه تذييل الكلام بقوله : { وعلى الله فليتوكل المؤمنون } [ آل عمران : 122 ] ، ولأن طلب الطاعة فرع عن تحقق الإِيمان كما في حديث معاذ « أن النبي صلى الله عليه وسلم لما بعثه إلى اليمن قال له : إنك ستأتي قوماً أهل كتاب فأولُ ما تدعوهم إليه فادْعُهم إلى أن يشهدوا أن لا إله إلاّ الله وأن محمداً رسول الله فإن هم أطاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم صدقة » الحديث .وتفريع { فإن توليتم } تحذير من عصيان الله ورسوله صلى الله عليه وسلموالتولي مستعار للعصيان وعدم قبول دعوة الرسول .وحقيقة التولّي الانصراف عن المكان المستقر فيه واستعير التولي للعصيان تشنيعاً له مبالغة في التحذير منه ، ومثله قوله تعالى في خطاب المؤمنين { وإن تتولوا يستبدل قوماً غيركم } [ محمد : 38 ] ، وقال : { يأيها الذين آمنوا أطيعوا الله ورسوله ولا تولوا عنه وأنتم تسمعون } [ الأنفال : 20 ] .والتعريف في قوله : { رسولنا } بالإِضافة لقصد تعظيم شأنه بأنه صلى الله عليه وسلم رسول ربّ العالمين . وهذا الضمير التفات من الغيبة إلى التكلم يفيد تشريف الرسول بعزّ الإضافة إلى المتكلم .ومعنى الحَصْر قوله : { فإنما على رسولنا البلاغ المبين } قصر الرسول صلى الله عليه وسلم على كون واجبه البلاغ ، قصرَ موصوف على صفةِ فالرسول صلى الله عليه وسلم مقصور على لزوم البلاغ له لا يعدُو ذلك إلى لزوم شيء آخر . وهو قصر قلب تنزيلاً لهم في حالة العصيان المفروض منزلة من يعتقد أن الله لو شاء لألجأهم إلى العمل بما أمرهم به إلهاباً لنفوسهم بالحث على الطاعة .ووصف البلاغ ب { المبين } ، أي الواضح عُذر للرسول صلى الله عليه وسلم بأنه ادعى ما أمر به على الوجه الأكمل قطعاً للمعذر عن عدم امتثال ما أمر به .وباعتبار مفهوم القصر جملة { فإنما على رسولنا البلاغ المبين } كانت جواباً للشرط دون حاجة إلى تقدير جواب تكون هذه الجملة دليلاً عليه أو علة له .\n","ar.waseet":"ثم ختم - سبحانه - هذه الآيات الكريمة بحض الناس على الطاعة والإخلاص فى العبادة ، وحذرهم من اقتراف المعاصى فقال : ( وَأَطِيعُواْ الله وَأَطِيعُواْ الرسول فَإِن تَولَّيْتُمْ فَإِنَّمَا على رَسُولِنَا البلاغ المبين ) .أى : وعليكم - أيها الناس - أن تطيعوا الله - تعالى - طاعة تامة ، وأن تطيعوا رسوله فى كل ما يأمركم به أو ينهاكم عنه .فإن أعرضتم عن ذلك ، وانصرفتم عما أمرناكم به أو نهيناكم عنه فلا ضرر على رسولنا بسبب إعراضكم لأن حسابكم وجزاءكم علينا يوم القيامة ، وليس على رسولنا - صلى الله عليه وسلم - بالنسبة لكم سوى البلاغ الواضح البين ، بحيث لا يترك باباً من أبواب الخير إلا ويبينه لكم ، ولا يترك باباً من أبواب الشر إلا وحذركم منه .\n","ar.baghawi":"\"وأطيعوا الله وأطيعوا الرسول فإن توليتم فإنما على رسولنا البلاغ المبين\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5211.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5211.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5211.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","transliteration":"Allaahu laaa ilaaha illaa Hoo; wa 'alal laahi falyata wakkalil mu'minoon","translations":{"en.ahmedali":"God: There is no god but He; and in God should believers place their trust.","en.ahmedraza":"Allah – there is none worthy of worship except Him; and only upon Allah must the Muslims rely.","en.arberry":"God -- there is no god but He. And in God let the believers put their trust.","en.asad":"God - there is no deity save Him! In God then let the believers place their trust.","en.daryabadi":"Allah! there is no God but He! In Allah, therefore, let the believers put their trust.","en.hilali":"Allah! La ilaha illa Huwa (none has the right to be worshipped but He), and in Allah (Alone), therefore, let the believers put their trust.","en.pickthall":"Allah! There is no Allah save Him. In Allah, therefore, let believers put their trust.","en.qaribullah":"Allah, there is no god except He. In Allah let the believers put their trust.","en.sahih":"Allah - there is no deity except Him. And upon Allah let the believers rely.","en.sarwar":"God is the only Lord and in Him the believers should trust.","en.yusufali":"Allah! There is no god but He: and on Allah, therefore, let the Believers put their trust.","en.maududi":"Allah there is no god but He; in Allah should the believers put all their trust.","en.shakir":"Allah, there is no god but He; and upon Allah, then, let the believers rely.","en.itani":"God, there is no god but He; and in God let the believers put their trust.","en.mubarakpuri":"Allah! La ilaha illa Huwa. And in Allah therefore let the believers put their trust.","en.qarai":"Allah—there is no god except Him—in Allah let all the faithful put their trust.","en.wahiduddin":"God! There is no god but He, so let the faithful put their trust in Him."},"tafsir":{"ar.muyassar":"الله وحده لا معبود بحق سواه، وعلى الله فليعتمد المؤمنون بوحدانيته في كل أمورهم.","ar.jalalayn":"«الله لا إله إلا هو وعلى الله فليتوكل المؤمنون».","ar.qurtubi":"أي لا معبود سواه , ولا خالق غيره ; فعليه توكلوا .\n","ar.miqbas":"اللَّهُ لَا إِلَهَ إِلَّا هُوَ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ (13)1649;للَّهُ لاَ إله إِلاَّ هُوَ } .جملة معترضة بين جملة { وأطيعوا الله وأطيعوا الرسول } [ التغابن : 12 ] وجملة : { وعلى الله فليتوكل المؤمنون .واسم الجلالة مبتدأ وجملة : الله لا إله إلا هو } خبر . وهذا تذكير للمؤمنين بما يعلمونه . أي من آمن بأن الله لا إله إلا هو كان حقاً عليه أن يطيعه وأن لا يعبأ بما يصيبه في جانب طاعة الله من مصائب وأذى كما قال حُبيب بن عدي: ... لستُ أبالي حين أُقتل مسلماًعلى أيّ جنب كان لله مصرعي ... ويجوز أن تكون جملة { الله لا إله إلا هو } في موقع العلة لجملة { وأطيعوا الله } [ التغابن : 12 ] وتفيد أيضاً تعليل جملة { وأطيعوا الرسول } [ التغابن : 12 ] لأن طاعة الرسول ترجع إلى طاعة الله قال تعالى : { من يطع الرسول فقد أطاع الله } [ النساء : 80 ] .وافتتاح الجملة باسم الجلالة إظهار في مقام الإضمار إذ لم يقُل هو لا إِله إلاّ هو لاستحضار عظمة الله تعالى بما يَحويه اسم الجلالة من معاني الكمال ، ولتكون الجملة مستقلة بنفسها فتكون جارية مجرى الأمثال والكلممِ الجوامع .{ هُوَ وَعَلَى الله فَلْيَتَوَكَّلِ } .عطف على { وأطيعوا الله } فهو في معنى : وتوكلوا على الله ، فإن المؤمنين يتوكلون على الله لا على غيره وأنتم مؤمنون فتوكلوا عليه .وتقدم المجرور لإِفادة الاختصاص ، أي أن المؤمنين لا يتوكلون إلا على الله .وجيء في ذلك بصيغة أمر المؤمنين بالتوكل على الله دون غيره ربطاً على قلوبهم وتثبيتاً لنفوسهم كيلا يأسفوا من إعراض المشركين وما يصيبهم منهم وأن ذلك لن يضرهم .فإن المؤمنين لا يعتزُّون بهم ولا يتقوون بأمثالهم ، لأن الله أمرهم أن لا يتوكلوا إلا عليه ، وفيه إيذان بأنهم يخالفون أمر الله وذلك يغيظ الكافرين .والإِتيان باسم الجلالة في قوله : { وعلى الله فليتوكل المؤمنون } إظهار في مقام الإِضمار لتكون الجملة مستقلة فتسيرَ مَسرى المثَل ، ولذلك كان إظهار لفظ { المؤمنون } ولم يقل : وعلى الله فليتوكلوا ، ولما في { المؤمنون } من العموم الشامل للمخاطبين وغيرهم ليكون معنى التمثيل .\n","ar.waseet":"( الله ) - تعالى - ( لاَ إله إِلاَّ هُوَ ) أى : هو المستحق للعبادة دون غيره ، فأخلصوا له هذه العبادة والطاعة ( وَعَلَى الله ) - تعالى - وحده ( فَلْيَتَوَكَّلِ المؤمنون ) أى : فليفوضوا أمورهم إليه ، وليعقدوا رجاءهم عليه فهو - سبحانه - صاحب الخلق والأمر ، تبارك الله رب العالمين .\n","ar.baghawi":"\"الله لا إله إلا هو وعلى الله فليتوكل المؤمنون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5212.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5212.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5212.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَكُمْ فَاحْذَرُوهُمْ ۚ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","transliteration":"Yaaa ayyuhal lazeena aamanooo inna min azwaaji kum wa awlaadikum 'aduwwal lakum fahzaroohum; wa in ta'foo wa tasfahoo wa taghfiroo fa innal laaha ghafoorur Raheem","translations":{"en.ahmedali":"O believers, some of your spouses and children are your enemies, so beware of them! Yet if you forbear, overlook, and forgive, God is indeed forgiving and kind.","en.ahmedraza":"O People who Believe! Some of your wives and children are your enemies, therefore be wary of them; and if you pardon and overlook and forgive, then indeed Allah is Oft Forgiving, Most Merciful.","en.arberry":"O believers, among your wives and children there is an enemy to you; so beware of them. But if you pardon, and overlook, and if you forgive, surely God is All-forgiving, All-compassionate.","en.asad":"O YOU who have attained to faith! Behold, some of your spouses and your children are enemies unto you: so beware of them! But if you pardon [their faults] and forbear, and forgive-then, behold, God will be much-forgiving, a dispenser of grace.","en.daryabadi":"O ye who believe! verily of your wives and your children there is an enemy Unto you; wherefore beware of them. And if ye pardon and pass over and forgive, then verily Allah is Forgiving, Merciful.","en.hilali":"O you who believe! Verily, among your wives and your children there are enemies for you (i.e. may stop you from the obedience of Allah), therefore beware of them! But if you pardon (them) and overlook, and forgive (their faults), then verily, Allah is Oft-Forgiving, Most Merciful.","en.pickthall":"O ye who believe! Lo! among your wives and your children there are enemies for you, therefor beware of them. And if ye efface and overlook and forgive, then lo! Allah is Forgiving, Merciful.","en.qaribullah":"Believers, some of your wives and children are enemies; so beware of them. But if you pardon, overlook and forgive them, then Allah is the Forgiving, the Most Merciful.","en.sahih":"O you who have believed, indeed, among your wives and your children are enemies to you, so beware of them. But if you pardon and overlook and forgive - then indeed, Allah is Forgiving and Merciful.","en.sarwar":"Believers, some of your wives and children may prove to be your enemies so beware of them. However, if you would pardon, ignore and forgive, know that God is All-forgiving and All-merciful.","en.yusufali":"O ye who believe! Truly, among your wives and your children are (some that are) enemies to yourselves: so beware of them! But if ye forgive and overlook, and cover up (their faults), verily Allah is Oft-Forgiving, Most Merciful.","en.maududi":"Believers, there are enemies to you from among your spouses and your off-spring, so beware of them. But if you forgive and overlook their offences and pardon them, then surely Allah is Most Forgiving, Most Compassionate.","en.shakir":"O you who believe! surely from among your wives and your children there is an enemy to you; therefore beware of them; and if you pardon and forbear and forgive, then surely Allah is Forgiving, Merciful.","en.itani":"O you who believe! Among your wives and your children are enemies to you, so beware of them. But if you pardon, and overlook, and forgive—God is Forgiver and Merciful.","en.mubarakpuri":"O you who believe! Verily, among your wives and your children there are enemies for you; therefore beware of them! But if you pardon (them) and overlook, and forgive, then verily, Allah is Oft-Forgiving, Most Merciful.","en.qarai":"O you who have faith! Indeed, you have enemies among your spouses and children; so beware of them. Yet if you excuse, forbear, and forgive, then Allah is indeed all-forgiving, all-merciful.","en.wahiduddin":"Believers! [Even] among your wives and your children you have enemies: so beware of them. But if you overlook their offences and forgive and pardon them, then surely, God is most forgiving and merciful."},"tafsir":{"ar.muyassar":"يا أيها الذين آمنوا بالله ورسوله، إنَّ مِن أزواجكم وأولادكم أعداء لكم يصدونكم عن سبيل الله، ويثبطونكم عن طاعته، فكونوا منهم على حذر، ولا تطيعوهم، وإن تتجاوزوا عن سيئاتهم وتعرضوا عنها، وتستروها عليهم، فإن الله غفور رحيم، يغفر لكم ذنوبكم؛ لأنه سبحانه عظيم الغفران واسع الرحمة.","ar.jalalayn":"«يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوّا لكم فاحذروهم» أن تطيعوهم في التخلف عن الخير كالجهاد والهجرة فإن سبب نزول الآية الإطاعة في ذلك «وإن تعفوا» عنهم في تثبيطهم إياكم عن ذلك الخير معتلين بمشقة فراقكم عليهم «وتصفحوا وتغفروا فإن الله غفور رحيم».","ar.qurtubi":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّاقال ابن عباس : نزلت هذه الآية بالمدينة في عوف بن مالك الأشجعي ; شكا إلى النبي صلى الله عليه وسلم جفاء أهله وولده ; فنزلت .ذكره النحاس .وحكاه الطبري عن عطاء بن يسار قال : نزلت سورة \" التغابن \" كلها بمكة إلا هؤلاء الآيات : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم \" نزلت في عوف بن مالك الأشجعي كان ذا أهل وولد , وكان إذا أراد الغزو بكوا إليه ورققوه فقالوا : إلى من تدعنا ؟ فيرق فيقيم ; فنزلت : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم \" الآية كلها بالمدينة في عوف بن مالك الأشجعي .وبقية الآيات إلى آخر السورة بالمدينة .وروى الترمذي عن ابن عباس - وسأله رجل عن هذه الآية \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم \" - قال : هؤلاء رجال أسلموا من أهل مكة وأرادوا أن يأتوا النبي صلى الله عليه وسلم , فأبى أزواجهم وأولادهم أن يدعوهم أن يأتوا النبي صلى الله عليه وسلم , فلما أتوا النبي صلى الله عليه وسلم رأوا الناس قد فقهوا في الدين هموا أن يعاقبوهم ; فأنزل الله تعالى : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم \" الآية .هذا حديث حسن صحيح .قال القاضي أبو بكر بن العربي : هذا يبين وجه العداوة ; فإن العدو لم يكن عدوا لذاته وإنما كان عدوا بفعله .فإذا فعل الزوج والولد فعل العدو كان عدوا , ولا فعل أقبح من الحيلولة بين العبد وبين الطاعة .وفي صحيح البخاري من حديث أبي هريرة عن النبي صلى الله عليه وسلم قال : ( إن الشيطان قعد لابن آدم في طريق الإيمان فقال له أتؤمن وتذر دينك ودين آبائك فخالفه فآمن ثم قعد له على طريق الهجرة فقال له أتهاجر وتترك مالك وأهلك فخالفه فهاجر ثم قعد له على طريق الجهاد فقال له أتجاهد فتقتل نفسك فتنكح نساؤك ويقسم مالك فخالفه فجاهد فقتل , فحق على الله أن يدخله الجنة ) .وقعود الشيطان يكون بوجهين : أحدهما : يكون بالوسوسة .والثاني : بأن يحمل على ما يريد من ذلك الزوج والولد والصاحب ; قال الله تعالى : \" وقيضنا لهم قرناء فزينوا لهم ما بين أيديهم وما خلفهم \" [ فصلت : 25 ] .وفي حكمة عيسى عليه السلام : من اتخذ أهلا ومالا وولدا كان للدنيا عبدا .وفي صحيح الحديث بيان أدنى من ذلك في حال العبد ; قال النبي صلى الله عليه وسلم : ( تعس عبد الدينار تعس عبد الدرهم تعس عبد الخميصة تعس عبد القطيفة تعس وانتكس وإذا شيك فلا انتقش ) .ولا دناءة أعظم من عبادة الدينار والدرهم , ولا همة أخس من همة ترتفع بثوب جديد .كما أن الرجل يكون له ولده وزوجه عدوا كذلك المرأة يكون لها زوجها وولدها عدوا بهذا المعنى بعينه .وعموم قوله : \" من أزواجكم \" يدخل فيه الذكر والأنثى لدخولهما في كل آية .والله أعلم .لَكُمْمعناه على أنفسكم .والحذر على النفس يكون بوجهين : إما لضرر في البدن , وإما لضرر في الدين .وضرر البدن يتعلق بالدنيا , وضرر الدين يتعلق بالآخرة .فحذر الله سبحانه العبد من ذلك وأنذره به .فَاحْذَرُوهُمْ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌروى الطبري عن عكرمة في قوله تعالى : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم \" قال : كان الرجل يريد أن يأتي النبي صلى الله عليه وسلم فيقول له أهله : أين تذهب وتدعنا ؟ قال : فإذا أسلم وفقه قال : لأرجعن إلى الذين كانوا ينهون عن هذا الأمر , فلأفعلن ولأفعلن ; قال : فأنزل الله عز وجل : \" وإن تعفوا وتصفحوا وتغفروا فإن الله غفور رحيم \" .وقال مجاهد في قوله تعالى : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم \" قال : ما عادوهم في الدنيا ولكن حملتهم مودتهم على أن أخذوا لهم الحرام فأعطوه إياهم .والآية عامة في كل معصية يرتكبها الإنسان بسبب الأهل والولد .وخصوص السبب لا يمنع عموم الحكم .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَكُمْ فَاحْذَرُوهُمْ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (14)إقبال على خطاب المؤمنين بما يفيدهم كمالاً ويجنبهم ما يفتنهم .أخرج الترمذي «عن ابن عباس أن رجلاً سأله عن هذه الآية فقال : هؤلاء رجال من أهل مكة أسلموا وأرادوا أن يأتوا النبي صلى الله عليه وسلم فأبَى أزواجهم وأولادُهم أن يَدعوهم ، فلما أتوا النبي صلى الله عليه وسلم أي بعد مدة وجاء معهم أزواجهم وأولادهم ورأوا الناس قد فقهوا في الدين أي سبقوهم بالفقه في الدين لتأخر هؤلاء عن الهجرة فَهَمُّوا أن يعاقبوهم على ما تسببوا لهم حتى سبقهم الناس إلى الفقه في الدين فأنزل الله هذه الآية : أي حتى قوله : { وإن تعفوا وتصفحوا وتغفروا فإن الله غفور رحيم } . وهو الذي اقتصر عليه الواحدي في «أسباب النزول» ومقتضاه أن الآية مدنية» .وعن عطاء بن يسار وابن عباس أيضاً أن هذه الآية نزلت بالمدينة في شأن عوف بن مالك الأشجعي كان ذا أهل وولد فكان إذا أراد الغزو بَكَوا إليه ورققوه وقالوا : إلى من تَدعنا ، فيرقُّ لهم فيقعد عن الغزو . وشكا ذلك إلى النبي صلى الله عليه وسلم فنزلت هذه الآية في شأنهم . فهذه الآية مستأنفة استئنافاً ابتدائياً ويكون موقعها هذا سبب نزولها صادف أن كان عقب ما نزل قبلها من هذه السورة .والمناسبة بينها وبين الآية التي قبلها لأن كلتيهما تسلية على ما أصاب المؤمنين من غَمّ من معاملة أعدائهم إياهم ومن انحراف بعض أزواجهم وأولادهم عليهم .وإذا كانت السورة كلها مكية كما هو قول الضحاك كانت الآية ابتداء إقبال على تخصيص المؤمنين بالخطاب بعد قضاء حق الغرض الذي ابتدئت به السورة على عادة القرآن في تعقيب الأغراض بأضدادها من ترغيب أو ترهيب ، وثناء أو ملام ، أو نحو ذلك ليوفّى الطرفان حقيهما ، وكانت تنبيهاً للمسلمين لأحوال في عائلاتهم قد تخفى عليهم ليأخذوا حذرهم ، وهذا هو المناسب لما قبل الهجرة كان المسلمون بمكة ممتزجين مع المشركين بوشائج النسب والصهر والولاء فلما ناصبهم المشركون العداء لمفارقتهم دينهم وأضمروا لهم الحقد وأصبحوا فريقين كان كل فريق غير خال من أفراد متفاوتين في المضادة تبعاً للتفاوت في صلابة الدين ، وفي أواصر القرابة والصهر ، وقد يبلغ العداء إلى نهاية طرفه فتندحض أمامة جميع الأواصر فيصبح الأشد قرباً أشد مضرة على قريبه من مضرة البعيد .فأيقظت هذه الآية المؤمنين لئلا يغرّهم أهل قرابتهم فيما توهم من جانب غرورهم فيكون ضرهم أشد عليهم وفي هذا الإيقاظ مصلحة للدين وللمسلمين ولذلك قال تعالى : { فاحذروهم } ولم يأمر بأن يضروهم ، وأعقبه بقوله : { وإن تعفوا وتصفحوا وتغفروا فإن الله غفور رحيم } ، جمعاً بين الحذر وبين المسالمة وذلك من الحزم .و { مِن } تبعيضية . وتقديم خبر { إنَّ } على اسمها للاهتمام بهذا الخبر ولما فيه من تشويق إلى الاسم ليتمكن مضمون هذا الخبر في الذهن أتم تمكن لما فيه من الغرابة والأهمية . وقد تقدم مثله عند قوله تعالى : { ومن الناس من يقول آمنا بالله وباليوم الآخر } في سورة [ البقرة : 8 ] .وعَدُوّ وصف من العداوة بوزن فَعول بمعنى فاعل فلذلك لزم حالة الإفراد والتذكير إذا كان وصفاً ، وقد مضى ذلك عند قوله تعالى : { فإن كان من قوم عدوّ لكم } في سورة [ النساء : 92 ] . فأما إذا أريد منه معنى الاسمية فيطابق ما أجري عليه ، قال تعالى : { يكونوا لكم أعداء } [ الممتحنة : 2 ] .والإِخبار عن بعض الأزواج والأولاد بأنهم عدوٌّ يجوز أن يحمل على الحقيقة فإن بعضهم قد يضمر عداوة لزوجه وبعضهم لأبويه من جراء المعاملة بما لا يروق عنده مع خباثة في النفس وسوء تفكير فيصير عدوًّا لمن حقه أن يكون له صديقاً ، ويكثر أن تأتي هذه العداوة من اختلاف الدين ومن الانتماء إلى الأعداء .ويجوز أن يكون على معنى التشبيه البليغ ، أي كالعدوّ في المعاملة بما هو من شأن معاملة الأعداء كما قيل في المَثَل : يفعل الجاهل بنفسه ما يفعل العدوّ لعدوّه . وهذا من استعمال اللفظ في حقيقته ومجازه .وعُطف على قوله : { فاحذروهم } جملة { وإن تعفوا وتصفحوا } إلى آخرها عَطف الاحتراس لأنه إذا كان العفو مطلوباً محبوباً إلى الله تعالى وهو لا يكون إلا بعد حصول الذنب فإن عدم المؤاخذة على مجرد ظنّ العداوة أجدر بالطلب ففهم النهي عن معاملة الأزواج والأبناء معاملةَ الأعداء لأجل إيجاس العداوة ، بل المقصود من التحذير التوقِّي وأخذُ الحيطة لابتداء المؤاخذة ، ولذلك قيل : «الحزم سوء الظن بالناس» ، أي لكن دون أن يبنى على ذلك الظن معاملة من صدر منه ما ظننت به قال تعالى : { إن بعض الظن إثم } [ الحجرات : 12 ] وقال : { أن تصيبوا قوماً بجهالة فتصبحوا على ما فعلتم نادمين } [ الحجرات : 6 ] .والعفو : ترك المعاقبة على الذنب بعد الاستعداد لها . ولو مع توبيخ .والصفح : الإِعراض عن المذنب ، أي ترك عقابه على ذنبه دون التوبيخ .والغفر : ستر الذنب وعدم إشاعته .والجمع بينها هنا إيماء إلى تراتب آثار هذه العداوة وما تقتضيه آثارها من هذه المعاملات الثلاث . وحذف متعلق الأفعال الثلاثة لظهور أن المراد من أولادكم وأزواجكم فيما يصدر منهم مما يؤذيكم ، ويجوز أن يكون حذف المتعلق لإِرادة عموم الترغيب في العفو .وإنما يعفو المرء ويصفح ويغفر عن المذنب إذا كان ذنبه متعلقاً بحق ذلك المرء وبهذه الأفعال المذكورة هنا مطلقة وفي أدلة الشريعة تقييدات لها .وجملة { فإن الله غفور رحيم } دليل جواب الشرط المحذوف المؤذن بالترغيب في العفو والصفح والغفر فالتقدير وأن تعفوا وتصفحوا وتغفروا يحب الله ذلك منكم لأن الله غفور رحيم ، أي للذين يغفرون ويرحمون ، وجمع وصف رحيم الخصال الثلاث .\n","ar.waseet":"وفى نهاية السورة الكريمة ، وجه - سبحانه - نداء إلى المؤمنين ، حذرهم فيه من فتنة الأزواج والأولاد والأموال ، وحضهم على مراقبته وتقواه ، وحذرهم من البخل والشح ، ووعدهم بالأجر العظيم متى أطاعوه . . . . فقال - تعالى - : ( ياأيها الذين آمنوا إِنَّ مِنْ . . . ) .ذكر المفسرون فى سبب نزول هذه الآيات روايات منها ما روى عن ابن عباس - رضى الله عنهما - أن رجلا يسأله عن هذه الآيات فقال : هؤلاء رجال أسلموا من مكة ، فأرادوا أن يأتوا رسول الله - صلى الله عليه وسلم - فأبى أولادهم وأزواجهم أن يتركوهم - ليهاجروا .فلما أتوا رسول الله - صلى الله عليه وسلم - أى بالمدينة - رأوا الناس قد تفقهوا فى الدين ، فهموا أن يعاقبوهم - أى : يعاقبوا أولادهم وأزواجهم - فأنزل الله - تعالى - هذه الآيات .وفى رواية أخرى عن ابن عباس أن هذه الآيات نزلت بالمدينة فى عوف بن مالك الأشجعى ، شكى إلى النبى - صلى الله عليه وسلم - جفاء أهله وولده فنزلت .وصدرت الآيات الكريمة بالنداء بصفة الإيمان ، لحضهم على الاستجابة لما اشتملت عليه هذه الآيات من توجيهات سامية وإرشادات عالية . . . فإن من شأن الإيمان الحق ، أن يحمل صاحبه على طاعة الله - عز وجل - .و \" من \" فى قوله ( إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلاَدِكُمْ . . ) للتبعيض .والمراد بالعداوة ما يشمل العداوة الدينية والدنيوية ، بأن يكون هؤلاء الأولاد والأزواج يضمرون لآبائهم وأزواجهم العداوة والبغضاء وسوء النية ، يسبب الاختلاف فى الطباع أو فى العقيدة والأخلاق .والعفو : ترك المعاقبة على الذنب بعد العزم على هذه المعاقبة .والصفح : الإعراض عن الذنب وإخفاؤه ، وعدم إشاعته .أى : يا من آمنتم بالله حق الإيمان ، إن بعض أزواجم وأولادكم ، يعادونكم ويخالفونكم فى أمر دينكم . وفى أمور دنياكم ، ( فاحذروهم ) أى : فاحذروا أن تطيعوهم فى أمر يتعارض مع تعاليم دينكم ، فإنه لا طاعة لمخلوق فى معصية الخالق .( وَإِن تَعْفُواْ ) - أيها المؤمنون - عنهم ، بأن تتركوا عقابهم بعد التصميم عليه ( وَتَصْفَحُواْ ) عنهم ، بأن تتركوا عقابهم بدون عزم عليه . . . ( وَتَغْفِرُواْ ) ما فرط منهم من أخطاء ، بأن تخفوها عليهم .وقوله : ( فَإِنَّ الله غَفُورٌ رَّحِيمٌ ) قائم مقام جواب الشرط . أى : وإن تفعلوا ذلك من العفو والصفح والمغفرة ، يكافئكم الله - تعالى - على ذلك مكافأة حسنة ، فإن الله - تعالى - واسع المغفرة والرحمة لمن يعفون ويصفحون ويغفرون .\n","ar.baghawi":"قوله - عز وجل - : ( ياأيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم ) قال ابن عباس : هؤلاء رجال من أهل مكة أسلموا وأرادوا أن يهاجروا إلى المدينة ، فمنعهم أزواجهم وأولادهم ، وقالوا : صبرنا على إسلامكم فلا نصبر على فراقكم فأطاعوهم وتركوا الهجرة [ فقال تعالى : ( فاحذروهم ) أن تطيعوهم وتدعوا الهجرة ] .( وإن تعفوا وتصفحوا وتغفروا فإن الله غفور رحيم ) هذا فيمن أقام على الأهل والولد ولم يهاجر ، فإذا هاجر رأى الذين سبقوه بالهجرة قد فقهوا في الدين هم أن يعاقب زوجه وولده الذين ثبطوا عن الهجرة ، وإن لحقوا به في دار الهجرة لم ينفق عليهم ولم يصبهم بخير ، فأمرهم الله تعالى بالعفو عنهم والصفح .وقال عطاء بن يسار : نزلت في عوف بن مالك الأشجعي : كان ذا أهل وولد ، وكان إذا أراد الغزو بكوا إليه ورققوه ، وقالوا : إلى من تدعنا ؟ فيرق لهم ويقيم فأنزل الله : \" إن من أزواجكم وأولادكم عدوا لكم \" بحملهم إياكم على ترك الطاعة ، فاحذروهم أن تقبلوا منهم .( وإن تعفوا وتصفحوا وتغفروا ) فلا تعاقبوهم على خلافهم إياكم فالله غفور رحيم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5213.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5213.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5213.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ ۚ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ","transliteration":"Innamaa amwaalukum wa awlaadukum fitnah; wallaahu 'indahooo ajrun 'azeem","translations":{"en.ahmedali":"Your wealth and children are surely meant as trial for you: But with God is the great reward.","en.ahmedraza":"Your wealth and your children are just a test; and with Allah is a tremendous reward.","en.arberry":"Your wealth and your children are only a trial; and with God is a mighty wage.","en.asad":"Your worldly goods and your children are but a trial and a temptation, whereas with God there is a tremendous reward.","en.daryabadi":"Your riches and your children are but a temptation; and Allah! with Him is a mighty hire.","en.hilali":"Your wealth and your children are only a trial, whereas Allah! With Him is a great reward (Paradise).","en.pickthall":"Your wealth and your children are only a temptation, whereas Allah! with Him is an immense reward.","en.qaribullah":"Your wealth and children are but a trial, and with Allah is a mighty wage.","en.sahih":"Your wealth and your children are but a trial, and Allah has with Him a great reward.","en.sarwar":"Your property and children are a trial for you, but the reward (which one may receive from God) is great.","en.yusufali":"Your riches and your children may be but a trial: but in the Presence of Allah, is the highest, Reward.","en.maududi":"Your possessions and your offspring are nothing but a trial for you. And there awaits a great reward for you with Allah.","en.shakir":"Your possessions and your children are only a trial, and Allah it is with Whom is a great reward.","en.itani":"Your possessions and your children are a test, but with God is a splendid reward.","en.mubarakpuri":"Your wealth and your children are only a Fitnah, whereas Allah! With Him is a great reward.","en.qarai":"Rather, your possessions, and children are a test, and Allah—with Him is a great reward!","en.wahiduddin":"Your wealth and your children are only a trial; God's reward is great:"},"tafsir":{"ar.muyassar":"ما أموالكم ولا أولادكم إلا بلاء واختبار لكم. والله عنده ثواب عظيم لمن آثر طاعته على طاعة غيره، وأدَّى حق الله في ماله.","ar.jalalayn":"«إنما أموالكم وأولادكم فتنة» لكم شاغلة عن أمور الآخرة «والله عنده أجر عظيم» فلا تفوتوه باشتغالكم بالأموال والأولاد.","ar.qurtubi":"إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌأي بلاء واختبار يحملكم على كسب المحرم ومنع حق الله تعالى فلا تطيعوهم في معصية الله .وفي الحديث : ( يؤتى برجل يوم القيامة فيقال أكل عياله حسناته ) .وعن بعض السلف : العيال سوس الطاعات .وقال القتبي : \" فتنة \" أي إغرام ; يقال : فتن الرجل بالمرأة أي شغف بها .وقيل : \" فتنة \" محنة .ومنه قول الشاعر : لقد فتن الناس في دينهم وخلى ابن عفان شرا طويلا وقال ابن مسعود : لا يقولن أحدكم اللهم اعصمني من الفتنة ; فإنه ليس أحد منكم يرجع إلى مال وأهل وولد إلا وهو مشتمل على فتنة ; ولكن ليقل : اللهم إني أعوذ بك من مضلات الفتن .وقال الحسن في قوله تعالى : \" إن من أزواجكم \" : أدخل \" من \" للتبعيض ; لأن كلهم ليسوا بأعداء .ولم يذكر \" من \" في قوله تعالى : \" إنما أموالكم وأولادكم فتنة \" لأنهما لا يخلوان من الفتنة واشتغال القلب بهما .روى الترمذي وغيره عن عبد الله بن بريدة عن أبيه قال : رأيت النبي صلى الله عليه وسلم يخطب ; فجاء الحسن والحسين - عليهما السلام - وعليهما قميصان أحمران , يمشيان ويعثران ; فنزل صلى الله عليه وسلم فحملهما بين يديه , ثم قال : ( صدق الله عز وجل إنما أموالكم وأولادكم فتنة .نظرت إلى هذين الصبيين يمشيان ويعثران فلم أصبر حتى قطعت حديثي ورفعتهما ) ثم أخذ في خطبته .وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌيعني الجنة , فهي الغاية , ولا أجر أعظم منها في قول المفسرين .وفي الصحيحين واللفظ للبخاري - عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : ( إن الله يقول لأهل الجنة يا أهل الجنة فيقولون لبيك ربنا وسعديك فيقول هل رضيتم فيقولون وما لنا لا نرضى وقد أعطيتنا ما لم تعط أحدا من خلقك فيقول ألا أعطيكم أفضل من ذلك قالوا يا رب وأي شيء أفضل من ذلك فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا ) .وقد تقدم ولا شك في أن الرضا غاية الآمال .وأنشد الصوفية في تحقيق ذلك : امتحن الله به خلقه فالنار والجنة في قبضته فهجره أعظم من ناره ووصله أطيب من جنته\n","ar.miqbas":"إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ (15)تذييل لأن فيه تعميمَ أحوال الأولاد بعد أن ذُكر حال خاص ببعْضهم .وأدمج فيه الأموال لأنها لم يشملها طلب الحذر ولا وصف العداوة . وقدم ذكر الأموال على الأولاد لأن الأموال لم يتقدم ذكرها بخلاف الأولاد .ووجه إدماج الأموال هنا أن المسلمين كانوا قد أصيبوا في أموالهم من المشركين فغلبوهم على أموالهم ولم تُذكر الأموال في الآية السابقة لأن الغرض هو التحذير من أشد الأشياء اتصالاً بهم وهي أزواجهم وأولادهم . ولأن فتنة هؤلاء مضاعفة لأن الداعي إليها يكون من أنفسهم ومن مساعي الآخرين وتسويلهم . وجُرد عن ذكر الأزواج هنا اكتفاء لدلالة فتنة الأولاد عليهن بدلالة فحوى الخطاب ، فإن فتنتهن أشد من فتنة الأولاد لأن جُرْأتهن على التسويل لأزواجهن ما يحاولنه منهم أشد من جرأة الأولاد .والقصر المستفاد من { إنما } قصر موصوف على صفة ، أي ليست أموالكم وأولادكم إلا فتنةً . وهو قصر ادعائي للمبالغة في كثرة ملازمة هذه الصفة للموصوف إذ يندُر أن تخلو أفرادُ هذين النوعين ، وهما أموال المسلمين وأولادهم عن الاتصاف بالفتنة لمن يتلبس بهما .والإِخبار ب { فتنة } للمبالغة . والمراد : أنهم سبب فتنة سواء سعوا في فعل الفَتْن أم لم يسعوا . فإن الشغل بالمال والعناية بالأولاد فيه فتنة .ففي هذه الآية من خصوصيات علم المعاني التذييلُ والإِدماج ، وكلاهما من الإِطناب ، والاكتفاءُ وهو من الإِيجاز ، وفيها الإِخبار بالمصدر وهو { فتنة } ، والإِخبار به من المبالغة فهذه أربعة من المحسنات البديعية ، وفيها القصر ، وفيها التعليل ، وهو من خصوصيات الفصل ، وقد يعد من محسنات البديع أيضاً فتلك ست خصوصيات .وفصلت هذه الجملة عن التي قبلها لأنها اشتملت على التذييل والتعليل وكلاهما من مقتضيات الفصل .والفتنة : اضطراب النفس وحيرتها من جراء أحوال لا تلائم مَن عرضت له ، وتقدم عند قوله تعالى { والفتنة أشد من القتل } في سورة [ البقرة : 191 ] .أخرج أبو داود عن بريدة قال : إن رسول الله كان يخطب يوم الجمعة حتى جاء الحسن والحسين يعثران ويقومان فنزل رسول الله عن المنبر فأخذهما وجذبهما ثم قرأ إنما أموالكم وأولادكم فتنة } . وقال : رأيت هذين فلم أصبر ، ثُم أخذ في خطبته» .وذكر ابن عطية : أن عمر قال لحذيفة : كيف أصبحتَ فقال : أصبحتُ أحب الفتنة وأكره الحق . فقال عمر : ما هذا؟ فقال : أحب ولدي وأكره الموت .وقوله : { والله عنده أجر عظيم } عطف على جملة { إنما أموالكم وأولادكم فتنة } لأن قوله : { عنده أجر عظيم } كناية عن الجزاء عن تلك الفتنة لمن يصابر نفسه على مراجعة ما تسوله من الانحراف عن مرضاة الله إن كان في ذلك تسويل . والأجر العظيم على إعطاء حق المال والرأفة بالأولاد ، أي والله يؤجركم عليها . لقول النبي صلى الله عليه وسلم \" من ابتُلي من هذه البنات بشيء وكنّ له ستراً من النار \" وفي حديث آخر \" إن الصبر على سوء خلق الزوجة عبادة \" .والأحاديث كثيرة في هذا المعنى منها ما رواه حذيفة : فتنة الرجل في أهله وماله تكفرها الصلاة والصدقة .\n","ar.waseet":"وقوله - تعالى - : ( إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ ) تعميم بعد تخصيص ، وتأكيد التحذير الذى اشتملت عليه الآية السابقة .والمراد بالفتنة هنا : ما يفتن الإنسان ويشغله ويلهيه عن المداومة على طاعة الله - تعالى - .أى : إن أموالكم وأولادكم - أيها المؤمنون - على رأس الأمور التى تؤدى المبالغة والمغالاة فى الاشتغال بها ، إلى التقصير فى طاعة الله - تعالى - ، وإلى مخالفة أمره . والإخبار عنهم بأنهم ( فِتْنَةٌ ) للمبالغة ، والمراد أنهم سبب للفتنة أى : لما يشغل عن رضاء الله وطاعته ، إذا ما جاوز الإنسان الحد المشروع فى الاشتغال بهما .قال الآلوسى : قوله - تعالى - ( إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ ) أى : بلاء ومحنة ، لأنهم يترتب عليهم الوقوع فى الإثم والشدائد الدنيوية وغير ذلك . وفى الحديث . يؤتى بالرجل يوم القيامة ، فيقال : أكل عياله حسناته .وأخرج الإمام أحمد وأبو داود والترمذى . . . عن بريدة قال . كان النبى - صلى الله عليه وسلم - يخطب ، فأقبل الحسن والحسين عليهما قميصان أحمران يمشيان ويعثران فنزل صلى الله عليه وسلم من فوق المنبر ، فحملهما . . . ثم صعد المنبر فقال : صدق الله إذ يقول : ( إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ ) ، إنى لما نظرت إلى هذين الغلامين يمشيان ويعثران ، لم أصبر أن قطعت كلامى ، ونظرت إليهما .وقال الجمل : قال الحسن فى قوله - تعالى - : ( إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلاَدِكُمْ عَدُوّاً لَّكُمْ ) أدخل - سبحانه - ( مِنْ ) للتبعيض ، لأنهم كلهم ليسوا بأعداء ، ولم يذكر ( مِنْ ) فى قوله ( إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ ) ، لأنهما لا يخلوان من الفتنة ، واستغال القلب بهما ، وقدم الأموال على الأولاد ، لأن الفتنة بالمال أكثر . وترك ذكر الأزواج فى الفتنة ، لأن منهن من يكن صلاحا وعونا على الآخرة .وقوله - سبحانه - : ( والله عِنْدَهُ أَجْرٌ عَظِيمٌ ) معطوف على جملة ( إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ ) .أى : والله - تعالى - عنده أجر عظيم ، لمن آثر محبة الله - تعالى - وطاعته ، على محبة الأزواج والأولاد والأموال .\n","ar.baghawi":"( إنما أموالكم وأولادكم فتنة ) بلاء واختبار وشغل عن الآخرة يقع بسببها الإنسان في العظائم ومنع الحق وتناول الحرام ( والله عنده أجر عظيم ) قال بعضهم : لما ذكر الله العداوة أدخل فيه \" من \" للتبعيض ، فقال : \" إن من أزواجكم وأولادكم عدوا لكم \" لأن كلهم ليسوا [ بأعداء ] ولم يذكر \" من \" في قوله : \" إنما أموالكم وأولادكم فتنة \" لأنها لا تخلو عن الفتنة واشتغال القلب .وكان عبد الله بن مسعود يقول : لا يقولن أحدكم : اللهم إني أعوذ بك من الفتنة ، فإنه ليس منكم أحد يرجع إلى مال وأهل وولد إلا وهو مشتمل على فتنة ، ولكن ليقل : اللهم إني أعوذ بك من مضلات الفتنأخبرنا أبو منصور محمد بن عبد الملك المظفري ، أخبرنا أبو سعيد أحمد بن محمد بن الفضل الفقيه ، أخبرنا أبو الحسن أحمد بن إسحاق الفقيه ، حدثنا أحمد بن بكر بن يوسف حدثنا علي بن الحسن ، أخبرنا الحسين بن واقد ، عن عبد الله بن بريدة قال سمعت أبي بريدة يقول : كان رسول الله - صلى الله عليه وسلم - يخطبنا ، فجاء الحسن والحسين وعليهما قميصان أحمران يمشيان ويعثران ، فنزل رسول الله - صلى الله عليه وسلم - من المنبر ، فحملهما فوضعهما بين يديه ، ثم قال : \" صدق الله : إنما أموالكم وأولادكم فتنة ، نظرت إلى هذين الصبيين يمشيان ويعثران ، فلم أصبر حتى قطعت حديثي ورفعتهما \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5214.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5214.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5214.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنْفِقُوا خَيْرًا لِأَنْفُسِكُمْ ۗ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","transliteration":"Fattaqul laaha mastat'tum wasma'oo wa atee'oo waanfiqoo khairal li anfusikum; wa many-yooqa shuha nafsihee fa-ulaaa'ika humul muflihoon","translations":{"en.ahmedali":"So fear God as much as you can, and listen and obey, and spend in charity for your own good. He who is saved from his own avarice will be successful.","en.ahmedraza":"Therefore fear Allah as much as possible, and heed the commands, and obey, and spend in Allah’s cause, for your own good; and whoever is rescued from the greed of his own soul – is they who will be successful.","en.arberry":"So fear God as far as you are able, and give ear, and obey, and expend well for yourselves. And whosoever is guarded against the avarice of his own soul, those -- they are the prosperers.","en.asad":"Remain, then, conscious of God as best you can, and listen [to Him], and pay heed. And spend in charity for the good of your own selves: for, such as from their own covetousness are saved – it is they, they that shall attain to a happy state!","en.daryabadi":"Wherefore fear Allah as much as ye are able, and hearken and obey, and expend, for the benefit of your souls. And whosoever is protected from niggardliness of his soul - those! they are the blissful.","en.hilali":"So keep your duty to Allah and fear Him as much as you can; listen and obey; and spend in charity, that is better for yourselves. And whosoever is saved from his own covetousness, then they are the successful ones.","en.pickthall":"So keep your duty to Allah as best ye can, and listen, and obey, and spend; that is better for your souls. And whoso is saved from his own greed, such are the successful.","en.qaribullah":"Therefore fear Allah as much as you can, and listen, obey, and spend well for yourselves. And whosoever is saved from the greed of his own soul; those are the winners.","en.sahih":"So fear Allah as much as you are able and listen and obey and spend [in the way of Allah]; it is better for your selves. And whoever is protected from the stinginess of his soul - it is those who will be the successful.","en.sarwar":"Have as much fear of God as best as you can. Listen to the Messenger, obey him, and spend for your own sake good things for the cause of God. Those who control their greed will have everlasting happiness.","en.yusufali":"So fear Allah as much as ye can; listen and obey and spend in charity for the benefit of your own soul and those saved from the covetousness of their own souls,- they are the ones that achieve prosperity.","en.maududi":"So hold Allah in awe as much as you can, and listen and obey, and be charitable. This is for your own good. And whoever remains safe from his own greediness, it is such that will prosper.","en.shakir":"Therefore be careful of (your duty to) Allah as much as you can, and hear and obey and spend, it is better for your souls; and whoever is saved from the greediness of his soul, these it is that are the successful.","en.itani":"So be conscious of God as much as you can, and listen, and obey, and give for your own good. He who is protected from his stinginess—these are the prosperous.","en.mubarakpuri":"So have Taqwa of Allah as much as you can; listen and obey, and spend in charity; that is better for yourselves. And whosoever is saved from his own greed, then they are the successful ones.","en.qarai":"So be wary of Allah, as much as you can, and listen and obey, and spend [in the way of Allah]; that is better for yourselves. Those who are saved from their own greed—it is they who are the felicitous.","en.wahiduddin":"so be mindful of God as best as you can; and listen, and obey; and spend in charity: it is for your own good. Those who guard themselves against their own greed will surely prosper:"},"tafsir":{"ar.muyassar":"فابذلوا- أيها المؤمنون- في تقوى الله جهدكم وطاقتكم، واسمعوا لرسول الله صلى الله عليه وسلم سماع تدبُّر وتفكر، وأطيعوا أوامره واجتنبوا نواهيه، وأنفقوا مما رزقكم الله يكن خيرًا لكم. ومن سَلِم من البخل ومَنْعِ الفضل من المال، فأولئك هم الظافرون بكل خير، الفائزون بكل مطلب.","ar.jalalayn":"«فاتقوا الله ما استطعتم» ناسخة لقوله (اتقوا الله حق تقاته) «واسمعوا» ما أُمرتم به سماع قبول «وأطيعوا وأنفقوا» في الطاعة «خيرا لأنفسكم» خبر يكن مقدرة جواب الأمر «ومن يوق شح نفسه فأولئك هم المفلحون» الفائزون.","ar.qurtubi":"فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْذهب جماعة من أهل التأويل إلى أن هذه الآية ناسخة لقوله تعالى : \" اتقوا الله حق تقاته \" [ آل عمران : 102 ] منهم قتادة والربيع بن أنس والسدي وابن زيد .ذكر الطبري : وحدثني يونس بن عبد الأعلى قال أخبرنا ابن وهب قال : قال ابن زيد في قوله تعالى : \" يا أيها الذين آمنوا اتقوا الله حق تقاته \" [ آل عمران : 102 ] قال : جاء أمر شديد , قالوا : ومن يعرف قدر هذا أو يبلغه ؟ فلما عرف الله أنه قد اشتد ذلك عليهم نسخها عنهم وجاء بهذه الآية الأخرى فقال : \" اتقوا الله ما استطعتم \" .وقيل : هي محكمة لا نسخ فيها .وقال ابن عباس : قوله تعالى : \" اتقوا الله حق تقاته \" [ آل عمران : 102 ] إنها لم تنسخ , ولكن حق تقاته أن يجاهد لله حق جهاده , ولا يأخذهم في الله لومة لائم , ويقوموا لله بالقسط ولو على أنفسهم وآبائهم وأبنائهم .وقد تقدم .فإن قيل : فإذا كانت هذه الآية محكمة غير منسوخة فما وجه قوله في سورة التغابن : \" فاتقوا الله ما استطعتم \" وكيف يجوز اجتماع الأمر باتقاء الله حق تقاته , والأمر باتقائه ما استطعنا .والأمر باتقائه حق تقاته إيجاب القرآن بغير خصوص ولا وصل بشرط , والأمر باتقائه ما استطعنا أمر باتقائه موصولا بشرط .قيل له : قوله : \" فاتقوا الله ما استطعتم \" بمعزل مما دل عليه قوله تعالى : \" اتقوا الله حق تقاته \" [ آل عمران : 102 ] وإنما عنى بقوله : \" فاتقوا الله ما استطعتم \" فاتقوا الله أيها الناس وراقبوه فيما جعل فتنة لكم من أموالكم وأولادكم أن تغلبكم فتنتهم , وتصدكم عن الواجب لله عليكم من الهجرة من أرض الكفر إلى أرض الإسلام ; فتتركوا الهجرة ما استطعتم ; بمعنى وأنتم للهجرة مستطيعين .وذلك أن الله جل ثناؤه قد كان عذر من لم يقدر على الهجرة بتركها بقوله تعالى : \" إن الذين توفاهم الملائكة ظالمي أنفسهم \" إلى قوله \" فأولئك عسى الله أن يعفو عنهم \" [ النساء : 97 - 99 ] .فأخبر أنه قد عفا عمن لا يستطيع حيلة ولا يهتدي سبيلا بالإقامة في دار الشرك ; فكذلك معنى قوله : \" فاتقوا الله ما استطعتم \" في الهجرة من دار الشرك إلى دار الإسلام أن تتركوها بفتنة أموالكم وأولادكم .ومما يدل على صحة هذا أن قوله : \" فاتقوا الله ما استطعتم \" عقيب قوله : \" يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم \" .ولا خلاف بين السلف من أهل العلم بتأويل القرآن أن هذه الآيات نزلت بسبب قوم كفار تأخروا عن الهجرة من دار الشرك إلى دار الإسلام بتثبيط أولادهم إياهم عن ذلك ; حسب ما تقدم .وهذا كله اختيار الطبري .وقيل : \" فاتقوا الله ما استطعتم \" فيما تطوع به من نافلة أو صدقة ; فإنه لما نزل قوله تعالى : \" اتقوا الله حق تقاته \" [ آل عمران : 102 ] اشتد على القوم فقاموا حتى ورمت عراقيبهم وتقرحت جباههم , فأنزل الله تعالى تخفيفا عنهم : \" فاتقوا الله ما استطعتم \" فنسخت الأولى ; قاله ابن جبير .قال الماوردي : ويحتمل إن لم يثبت هذا النقل أن المكره على المعصية غير مؤاخذ بها ; لأنه لا يستطيع اتقاءها .وَاسْمَعُوا وَأَطِيعُواأي اسمعوا ما توعظون به وأطيعوا فيما تؤمرون به وتنهون عنه .وقال مقاتل : اسمعوا \" أي اصغوا إلى ما ينزل عليكم من كتاب الله ; وهو الأصل في السماع .\" وأطيعوا \" لرسوله فيما أمركم أو نهاكم .وقال قتادة : عليهما بويع النبي صلى الله عليه وسلم على السمع والطاعة .وقيل : \" واسمعوا \" أي اقبلوا ما تسمعون ; وعبر عنه بالسماع لأنه فائدته .قلت : وقد تغلغل في هذه الآية الحجاج حين تلاها وقصرها على عبد الملك بن مروان فقال : \" فاتقوا الله ما استطعم واسمعوا وأطيعوا \" هي لعبد الملك بن مروان أمين الله وخليفته , ليس فيها مثنوية , والله لو أمرت رجلا أن يخرج من باب المسجد فخرج من غيره لحل لي دمه .وكذب في تأويلها بل هي للنبي صلى الله عليه وسلم أولا ثم لأولي الأمر من بعده .دليله \" و أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم \" [ النساء : 59 ] .وَأَنْفِقُواقيل : هو الزكاة ; قاله ابن عباس .وقيل : هو النفقة في النفل .وقال الضحاك : هو النفقة في الجهاد .وقاله الحسن : هو نفقة الرجل لنفسه .قال ابن العربي : وإنما أوقع قائل هذا قوله : \" لأنفسكم \" وخفي عليه أن نفقة النفل والفرض في الصدقة هي نفقة الرجل على نفسه ; قال الله تعالى : \" إن أحسنتم أحسنتم لأنفسكم وإن أسأتم فلها \" .[ الإسراء : 7 ] .وكل ما يفعله الرجل من خير فإنما هو لنفسه .والصحيح أنها عامة .وروي عن النبي صلى الله عليه وسلم أنه قال له رجل : عندي دينار ؟ قال : ( أنفقه على نفسك ) قال : عندي آخر ؟ قال : ( أنفقه على عيالك ) قال : عندي آخر ؟ قال : ( أنفقه على ولدك ) قال : عندي آخر ؟ قال : ( تصدق به ) فبدأ بالنفس والأهل والولد وجعل الصدقة بعد ذلك .وهو الأصل في الشرع .خَيْرًا لِأَنْفُسِكُمْ\" خيرا \" نصب بفعل مضمر عند سيبويه ; دل عليه \" وأنفقوا \" كأنه قال : ايتوا في الإنفاق خيرا لأنفسكم , أو قدموا خيرا لأنفسكم من أموالكم .وهو عند الكسائي والفراء نعت لمصدر محذوف ; أي أنفقوا إنفاقا خيرا لأنفسكم .وهو عند أبي عبيدة خبر كان مضمرة ; أي يكن خيرا لكم .ومن جعل الخير المال فهو منصوب ب \" أنفقوا \" .وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَئِكَ هُمُ الْمُفْلِحُونَالشح والبخل سواء ; يقال : رجل شحيح بين الشح والشح والشحاحة .قال عمرو بن كلثوم : ترى اللحز الشحيح إذا أمرت عليه لماله فيها مهينا وجعل بعض أهل اللغة الشح أشد من البخل .وفي الصحاح : الشح البخل مع حرص ; تقول : شححت ( بالكسر ) تشح .وشححت أيضا تشح وتشح .ورجل شحيح , وقوم شحاح وأشحة .والمراد بالآية : الشح بالزكاة وما ليس بفرض من صلة ذوي الأرحام والضيافة , وما شاكل ذلك .فليس بشحيح ولا بخيل من أنفق في ذلك وإن أمسك عن نفسه .ومن وسع على نفسه ولم ينفق فيما ذكرناه من الزكوات والطاعات فلم يوق شح نفسه .وروى الأسود عن ابن مسعود أن رجلا أتاه فقال له : إني أخاف أن أكون قد هلكت ؟ قال : وما ذاك ؟ قال : سمعت الله عز وجل يقول : \" ومن يوق شح نفسه فأولئك هم المفلحون \" وأنا رجل شحيح لا أكاد أن أخرج من يدي شيئا .فقال ابن مسعود : ليس ذلك بالشح الذي ذكره الله تعالى في القرآن , إنما الشح الذي ذكره الله تعالى في القرآن أن تأكل مال أخيك ظلما , ولكن ذلك البخل , وبئس الشيء البخل .ففرق رضي الله عنه بين الشح والبخل .وقال طاوس : البخل أن يبخل الإنسان بما في يده , والشح أن يشح بما في أيدي الناس , يحب أن يكون له ما في أيديهم بالحل والحرام , لا يقنع .ابن جبير : الشح منع الزكاة وادخار الحرام .ابن عيينة : الشح الظلم .الليث : ترك الفرائض وانتهاك المحارم .ابن عباس : من اتبع هواه ولم يقبل الإيمان فذلك الشحيح .ابن زيد : من لم يأخذ شيئا لشيء نهاه الله عنه , ولم يدعه الشح على أن يمنع شيئا من شيء أمره الله به , فقد وقاه الله شح نفسه .وقال أنس : قال النبي عليه الصلاة والسلام : ( بريء من الشح من أدى الزكاة وقرى الضيف وأعطى في النائبة ) .وعنه أن النبي عليه الصلاة السلام كان يدعو ( اللهم إني أعوذ بك من شح نفسي وإسرافها ووساوسها ) .وقال أبو الهياج الأسدي : رأيت رجلا في الطواف يدعو : اللهم قني شح نفسي .لا يزيد على ذلك شيئا , فقلت له ؟ فقال : إذا وقيت شح نفسي لم أسرق ولم أزن ولم أفعل .فإذا الرجل عبد الرحمن بن عوف .قلت : يدل على هذا قول النبي صلى الله عليه وسلم : ( اتقوا الظلم فإن الظلم ظلمات يوم القيامة واتقوا الشح فإن الشح أهلك من كان قبلكم حملهم على أن سفكوا دماءهم واستحلوا محارمهم ) .وقد بيناه في آخر \" آل عمران \" .وقال كسرى لأصحابه : أي شيء أضر بابن آدم ؟ قالوا : الفقر .فقال كسرى : الشح أضر من الفقر ; لأن الفقير إذا وجد شبع , والشحيح إذا وجد لم يشبع أبدا .\n","ar.miqbas":"فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنْفِقُوا خَيْرًا لِأَنْفُسِكُمْ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَئِكَ هُمُ الْمُفْلِحُونَ (16)فاء فصيحة وتفريع على ما تقدم ، أي إذا علمتم هذا فاتقوا الله فيما يجب من التقوى في معاملة الأولاد والأزواج ومصارِف في الأموال فلا يصدّكم حب ذلك والشغل به عن الواجبات ، ولا يخرجكم الغضب ونحوه عن حدّ العدل المأمور به ، ولا حُبُّ المال عن أداء حقوق الأموال وعن طلبها من وجوه الحلال . فالأمر بالتقوى شامل للتحذير المتقدم وللترغيب في العفو كما تقدم ولما عدا ذلك .والخطاب للمؤمنين .وحذف متعلق ( اتقوا ) لقصد تعميم ما يتعلق بالتقوى من جميع الأحوال المذكورة وغيرها وبذلك يكون هذا الكلام كالتذييل لأن مضمونه أعم من مضمون ما قبله . /ولما كانت التقوى في شأن المذكورات وغيرها قد يعرض لصاحبها التقصير في إقامتها حرصاً على إرضاء شهوة النفس في كثير من أحوال تلك الأشياء زيد تأكيد الأمر بالتقوى بقوله : { ما استطعتم } .و { مَا } مصدرية ظرفية ، أي مدة استطاعتكم ليعم الأزمان كلها ويعم الأحوال تبعاً لعموم الأزمان ويعم الاستطاعات ، فلا يتخلوا عن التقوى في شيء من الأزمان . وجعلت الأزمان ظرفاً للاستطاعة لئلا يقصروا بالتفريط في شيء يستطيعونه فيما أمروا بالتقوى في شأنه ما لم يخرج عن حدّ الاستطاعة إلى حدّ المشقة قال تعالى : { يريد الله بكم اليسر ولا يريد بكم العسر } [ البقرة : 185 ] .فليس في قوله : { ما استطعتم } تخفيف ولا تشديد ولكنه عَدل وإنصافٌ . ففيه ما عليهم وفيه ما لهم .روى البخاري عن جابر بن عبد الله قال : «بايعت رسول الله صلى الله عليه وسلم على السمع والطاعة فلقَّنني : «فيما استطعت» ، وعن ابن عمر : كنّا إذا بايعنا النبي صلى الله عليه وسلم على السمع والطاعة يقول لنا «فيما استطعتُ» .وعطفُ { واسمعوا وأطيعوا } على ( اتقوا الله ) من عطف الخاص على العام للاهتمام به ، ولأن التقوى تتبادر في ترك المنهيات فإنها مشتقة من وقَى . فتقوى الله أن يقي المرء نفسه مما نهاه الله عنه ، ولما كان ترك المأمورات فيؤول إلى إتيان المنهيات ، لأن ترك الأمر منهي عنه إذ الأمر بالشيء نهي عن ضده . كان التصريح به بخصوصه اهتماماً بكلا الأمرين لتحصل حقيقة التقوى الشرعية وهي اجتناب المنهيات وامتثال المأمورات .والمراد : اسمعوا الله ، أي أطيعوه بالسمع للرسول صلى الله عليه وسلم وطاعته .والأمر بالسمع أمر يتلقَّى الشريعة والإِقبال على سماع مواعظ النبي صلى الله عليه وسلم وذلك وسيلة التقوى قال تعالى : { فبشر عبادي الذين يستمعون القول فيتبعون أحسنه } [ الزمر : 17 ، 18 ] .وعطف عليه { وأطيعوا } : أي أطيعوا ما سمعتم من أمر ونهي .وعَطْف { وأنفقوا } تخصيصٌ بعد تخصيص فإن الإنفاق مما أمر الله به فهو من المأمورات .وصيغة الأمر تشتمل واجب الإِنفاق والمندوبَ ففيه التحريض على الإِنفاق بمرتبتيه وهذا من الاهتمام بالنزاهة عن فتنة المال التي ذكرت في قوله :{ إنما أموالكم وأولادكم فتنة } [ التغابن : 15 ] .وانتصب { خيراً } على الصفة لمصدرٍ محذوف دل عليه { أنفقوا } . والتقدير : إنفاقاً خيراً لأنفسكم . هذا قول الكسائي والفرّاء فيكون { خيراً } اسم تفضيل . وأصله : أَخْير ، وهو محذوف الهمزة لكثرة الاستعمال ، أي الإِنفاق خير لكم من الإِمساك . وعن سيبويه أنه منصوب على أنه مفعول به لفعل مضمر دل عليه { أنفقوا } . والتقدير : ائتوا خيراً لأنفسكم . وجملة { ومن يوق شح نفسه فأولئك هم المفلحون } تذييل .و { مَن } اسم شرط وهي من صيغ العموم : أي كل من يوق شحّ نفسه والعموم يدل على أن { من } مراد بها جنس لا شخص معين ولا طائفة ، وهذا حب اقتضاه حرص أكثر الناس على حفظ المال وادخاره والإِقلاللِ من نفع الغير به وذلك الحرص يسمى الشح .والمعنى : أن الإِنفاق يقي صاحبه من الشحّ المنهي عنه فإذا يُسر على المرء الإِنفاق فيما أمر الله به فقد وُقي شُحّ نفسه وذلك من الفلاح .ولما كان ذلك فلاحاً عظيماً جيء في جانبه بصيغة الحصر بطريقة تعريف المسند ، وهو قصر جنس المفلحين على جنس الذين وُقُوا شحّ أنفسهم ، وهو قصر ادعائي للمبالغة في تحقق وصف المفلحين الذين وقُوا شحّ أنفسهم نزّل الآن فلاح غيرهم بمنزلة العدم .وإضافة { شح } إلى النفس للإِشارة إلى أن الشح من طباع النفس فإن النفوس شحيحة بالأشياء المحببة إليها قال تعالى : { وأحضرت الأنفس الشحّ } [ النساء : 128 ] .وفي الحديث لما سئل رسول الله صلى الله عليه وسلم عن أفضل الصدقة قال : « أن تَصدَّق وأنت صحيح شَحِيح تخشى الفقر وَتَأَمُل الغنى . وأنْ لا تَدعَ حتى إذا بلغت الحلقومَ قلتَ لفلان كذا ولفلان كذا وقد كان لفلان » وتقدم نظيره { ومن يوق شح نفسه فأولئك هم المفلحون } في سورة [ الحشر : 9 ] .\n","ar.waseet":"والفاء فى قوله - سبحانه - : ( اتقوا الله مَا استطعتم ) للإفصاح والتفريع على ما تقدم .و ( مَا استطعتم ) مصدرية ظرفية .والمراد بالاستطاعة : نهاية الطاقة والجهد .أى : إذا كان الأمر كما ذكرت لكم من أن المؤمن الصادق فى إيمانه هو الذى لا يشغله ماله أو ولده أو زوجه عن ذكر الله - تعالى - فابذلوا نهاية قدرتكم واستطاعتكم فى طاعة الله - تعالى - وداوموا على ذلك فى جميع الأوقات والأزمان .وليس بين هذه الآية ، وبين قوله - تعالى - ( اتقوا الله حَقَّ تُقَاتِهِ ) تعارض ، لأن كلتا الآيتين تأمران المسلم بأن يبذل قصارى جهده ، ونهاية طاقته ، فى المواظبة على أداء ما كلفه الله به ، ولذلك فلا نرى ما يدعو إلى قول من قال : إن الآية التى معنا نسخت الآية التى تقول : ( ياأيها الذين آمَنُواْ اتقوا الله حَقَّ تُقَاتِهِ ) قال الآلوسى : أخرج ابن أبى حاتم عند سعيد بن جبير قال : لما نزلت : ( اتقوا الله حَقَّ تُقَاتِهِ ) اشتد على القوم العمل ، فقاموا حتى ورمت أقدامهم . فأنزل الله هذه الآية ( فاتقوا الله مَا استطعتم ) تخفيفا على المسلمين .وحذف متعلق التقوى ، لقصد التعميم ، أى : فاتقوا الله مدة استطاعتكم فى كل ما تأتون وما تذرون ، واعلموا أنه - تعالى - ( يُرِيدُ الله بِكُمُ اليسر وَلاَ يُرِيدُ بِكُمُ العسر ) و( وَمَا جَعَلَ عَلَيْكُمْ فِي الدين مِنْ حَرَجٍ ) ومن الأحاديث التى وردت فى معنى الآية الكريمة ، ما رواه البخارى عن جابر بن عبد الله قال : \" بايعت رسول الله - صلى الله - عليه وسلم - على السمع والطاعة ، فلقننى \" فيما استطعت \" \" .وعطف قوله - تعالى - ( واسمعوا وَأَطِيعُواْ ) على قوله ( فاتقوا الله ) من باب عطف الخاص على العام ، للاهتمام به .أى : فاتقوا الله - تعالى - فى كل ما تأتون وما تذرون ، واسمعوا ما يبلغكم إياه رسولنا عنا سماع تدبر وتفكر ، وأطيعوه فى كل ما يأمركم به أو ينهاكم عنه .( وَأَنْفِقُواْ ) مما رزقكم الله - تعالى - من خير ، يكن ذلك الإنفاق ( خَيْراً لأَنفُسِكُمْ ) فى دنياكم وفى آخرتكم .( وَمَن يُوقَ شُحَّ نَفْسِهِ ) أى : ومن يستطع أن يبعد نفسه عن الشح والبخل .( فأولئك هُمُ المفلحون ) أى : الفائزون فوزا تاما لا نقص معه .\n","ar.baghawi":"( فاتقوا الله ما استطعتم ) أطقتم ، هذه الآية ناسخة لقوله تعالى : \" اتقوا الله حق تقاته \" ( آل عمران - 102 ( واسمعوا وأطيعوا ) الله ورسوله ( وأنفقوا خيرا لأنفسكم ) أنفقوا من أموالكم خيرا لأنفسكم . ( ومن يوق شح نفسه ) حتى يعطي حق الله من ماله ( فأولئك هم المفلحون ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5215.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5215.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5215.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"إِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ شَكُورٌ حَلِيمٌ","transliteration":"In tuqridul laaha qardan hasanany yudd'ifhu lakum wa yaghfir lakum; wallaahu Shakoorun Haleem","translations":{"en.ahmedali":"If you lend a goodly loan to God, He will double it for you, and forgive you. God knows the worth of good deeds and is clement,","en.ahmedraza":"If you lend an excellent loan to Allah, He will double it for you and forgive you; and Allah is Most Appreciative, Most Forbearing.","en.arberry":"If you lend to God a good loan, He will multiply it for you, and will forgive you. God is All-thankful, All-clement,","en.asad":"If you offer up to God a goodly loan, He will amply repay you for it, and will forgive you your sins: for God is ever responsive to gratitude, forbearing,","en.daryabadi":"If ye lend Unto Allah a goodly loan, He will multiply it Unto you and will forgive you; and Allah is Appreciator, Forbearing.","en.hilali":"If you lend to Allah a goodly loan (i.e. spend in Allah's Cause) He will double it for you, and will forgive you. And Allah is Most Ready to appreciate and to reward, Most Forbearing,","en.pickthall":"If ye lend unto Allah a goodly loan, He will double it for you and will forgive you, for Allah is Responsive, Clement,","en.qaribullah":"If you lend a good loan to Allah He will multiply it for you and will forgive you. Allah is the Thankful, the Clement.","en.sahih":"If you loan Allah a goodly loan, He will multiply it for you and forgive you. And Allah is Most Appreciative and Forbearing.","en.sarwar":"If you give a virtuous loan to God, He will pay back double and forgive your sins. God is the Most Appreciating and the Most Forbearing.","en.yusufali":"If ye loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you Forgiveness: for Allah is most Ready to appreciate (service), Most Forbearing,-","en.maududi":"If you give Allah a goodly loan, He will increase it for you several fold and will forgive you. Allah is Most Appreciative, Most Forbearing.","en.shakir":"If you set apart for Allah a goodly portion, He will double it for you and forgive you; and Allah is the Multiplier (of rewards), Forbearing,","en.itani":"If you lend God a good loan, He will multiply it for you, and will forgive you. God is Appreciative and Forbearing.","en.mubarakpuri":"If you lend to Allah a handsome loan, He will double it for you, and will forgive you. And Allah is Shakur, Halim,","en.qarai":"If you lend Allah a good loan, He shall multiply it for you and forgive you, and Allah is all-appreciative, all-forbearing,","en.wahiduddin":"if you give a good loan to God, He will multiply it for you and forgive you, for God is appreciative and forbearing;"},"tafsir":{"ar.muyassar":"إن تنفقوا أموالكم في سبيل الله بإخلاص وطيب نفس، يضاعف الله ثواب ما أنفقتم، ويغفر لكم ذنوبكم. والله شكور لأهل الإنفاق بحسن الجزاء على ما أنفقوا، حليم لا يعجل بالعقوبة على مَن عصاه.","ar.jalalayn":"«إن تقرضوا الله قرضا حسنا» بأن تتصدقوا عن طيب قلب «يضاعفه لكم» وفي قراءة يضعفه بالتشديد بالواحدة عشرا إلى سبعمائة وأكثر «ويغفر لكم» ما يشاء «والله شكور» مجاز على الطاعة «حليم» في العقاب على المعصية.","ar.qurtubi":"إِنْ تُقْرِضُوا اللَّهَبالصدقة والنفقة في سبيل الله .قال الحسن : كل ما في القرآن من القرض الحسن فهو التطوع .وقيل : هو العمل الصالح من الصدقة وغيرها محتسبا صادقا .وإنما عطف بالفعل على الاسم , لأن ذلك الاسم في تقدير الفعل , أي إن الذين تصدقوا وأقرضوا أخبرنا الشيخ الفقيه الإمام المحدث القاضي أبو عامر يحيى بن عامر بن أحمد بن منيع الأشعري نسبا ومذهبا بقرطبة - أعادها الله - في ربيع الآخر عام ثمانية وعشرين وستمائة قراءة مني عليه قال : أخبرنا أبي إجازة قال : قرأت على أبي بكر عبد العزيز بن خلف بن مدين الأزدي عن أبي عبد الله بن سعدون سماعا عليه ; قال : حدثنا أبو الحسن علي بن مهران قال : حدثنا أبو الحسن محمد بن عبد الله بن زكريا بن حيوة النيسابوري سنة ست وستين وثلاثمائة , قال : أنبأنا عمي أبو زكريا يحيى بن زكريا قال : حدثنا محمد بن معاوية بن صالح قال : حدثنا خلف بن خليفة عن حميد الأعرج عن عبد الله بن الحارث عن عبد الله بن مسعود قاله : لما نزلت : \" من ذا الذي يقرض الله قرضا حسنا \" قال أبو الدحداح : يا رسول الله أوإن الله تعالى يريد منا القرض ؟ قال : ( نعم يا أبا الدحداح ) قال : أرني يدك ; قال فناوله ; قال : فإني أقرضت الله حائطا فيه ستمائة نخلة ., ثم جاء يمشي حتى أتى الحائط وأم الدحداح فيه وعياله ; فناداها : يا أم الدحداح ; قالت : لبيك ; قال : اخرجي , قد أقرضت ربي عز وجل حائطا فيه ستمائة نخلة .وقال زيد بن أسلم : لما نزل : \" من ذا الذي يقرض الله قرضا حسنا \" قال أبو الدحداح : فداك أبي وأمي يا رسول الله إن الله يستقرضنا وهو غني عن القرض ؟ قال : ( نعم يريد أن يدخلكم الجنة به ) .قال : فإني إن أقرضت ربي قرضا يضمن لي به ولصبيتي الدحداحة معي الجنة ؟ قال : ( نعم ) قال : فناولني يدك ; فناوله رسول الله صلى الله عليه وسلم يده : فقال : إن لي حديقتين إحداهما بالسافلة والأخرى بالعالية , والله لا أملك غيرهما , قد جعلتهما قرضا لله تعالى .قال رسول الله صلى الله عليه وسلم : ( اجعل إحداهما لله والأخرى دعها معيشة لك ولعيالك ) قال : فأشهدك يا رسول الله أني قد جعلت خيرهما لله تعالى , وهو حائط فيه ستمائة نخلة .قال : ( إذا يجزيك الله به الجنة ) .فانطلق أبو الدحداح حتى جاء أم الدحداح وهي مع صبيانها في الحديقة تدور تحت النخل فأنشأ يقول : هداك ربي سبل الرشاد إلى سبيل الخير والسداد بيني من الحائط بالوداد فقد مضى قرضا إلى التناد أقرضته الله على اعتمادي بالطوع لا من ولا ارتداد إلا رجاء الضعف في المعاد فارتحلي بالنفس والأولاد والبر لا شك فخير زاد قدمه المرء إلى المعاد قالت أم الدحداح : ربح بيعك بارك الله لك فيما اشتريت , ثم أجابته أم الدحداح وقالت : بشرك الله بخير وفرج مثلك أدى ما لديه ونصح قد متع الله عيالي ومنح بالعجوة السوداء والزهو البلح والعبد يسعى وله ما قد كدح طول الليالي وعليه ما اجترح ثم أقبلت أم الدحداح على صبيانها تخرج ما في أفواههم وتنفض ما في أكمامهم حتى أفضت إلى الحائط الآخر ; فقال النبي صلى الله عليه وسلم : ( كم من عذق رداح ودار فياح لأبي الدحداح ) .قال ابن العربي : \" انقسم الخلق بحكم الخالق وحكمته وقدرته ومشيئته وقضائه وقدره حين سمعوا هذه الآية أقساما , فتفرقوا فرقا ثلاثة : [ الفرقة الأولى ] الذين قالوا : إن رب محمد محتاج فقير إلينا ونحن أغنياء , فهذه جهالة لا تخفى على ذي لب , فرد الله عليهم بقوله : \" لقد سمع الله قول الذين قالوا إن الله فقير ونحن أغنياء \" [ آل عمران : 181 ] .[ الفرقة الثانية ] لما سمعت هذا القول آثرت الشح والبخل وقدمت الرغبة في المال فما أنفقت في سبيل الله ولا فكت أسيرا ولا أعانت أحدا تكاسلا عن الطاعة وركونا إلى هذه الدار .[ الفرقة الثالثة ] لما سمعت بادرت إلى امتثاله وآثر المجيب منهم بسرعة بماله كأبي الدحداح رضي الله عنه وغيره .والله أعلم .قَرْضًاالقرض : اسم لكل ما يلتمس عليه الجزاء وأقرض فلان فلانا أي أعطاه ما يتجازاه قال الشاعر وهو لبيد : وإذا جوزيت قرضا فأجزه إنما يجزي الفتى ليس الجمل والقرض بالكسر لغة فيه حكاها الكسائي .واستقرضت من فلان أي طلبت منه القرض فأقرضني .واقترضت منه أي أخذت القرض .وقال الزجاج : القرض في اللغة البلاء الحسن والبلاء السيئ قال أمية : كل امرئ سوف يجزى قرضه حسنا أو سيئا ومدينا مثل ما دانا وقال آخر : تجازى القروض بأمثالها فبالخير خيرا وبالشر شرا وقال الكسائي : القرض ما أسلفت من عمل صالح أو سيئ .وأصل الكلمة القطع ; ومنه المقراض .وأقرضته أي قطعت له من مالي قطعة يجازى عليها .وانقرض القوم : انقطع أثرهم وهلكوا .والقرض ههنا : اسم , ولولاه لقال ههنا إقراضا .واستدعاء القرض في هذه الآية إنما هي تأنيس وتقريب للناس بما يفهمونه , والله هو الغني الحميد ; لكنه تعالى شبه عطاء المؤمن في الدنيا بما يرجو به ثوابه في الآخرة بالقرض كما شبه إعطاء النفوس والأموال في أخذ الجنة بالبيع والشراء .وقيل المراد بالآية الحث على الصدقة وإنفاق المال على الفقراء والمحتاجين والتوسعة عليهم , وفي سبيل الله بنصرة الدين .وكنى الله سبحانه عن الفقير بنفسه العلية المنزهة عن الحاجات ترغيبا في الصدقة , كما كنى عن المريض والجائع والعطشان بنفسه المقدسة عن النقائص والآلام .ففي صحيح الحديث إخبارا عن الله تعالى : ( يا بن آدم مرضت فلم تعدني واستطعمتك فلم تطعمني واستسقيتك فلم تسقني ) قال يا رب كيف أسقيك وأنت رب العالمين ؟ قال : ( استسقاك عبدي فلان فلم تسقه أما إنك لو سقيته وجدت ذلك عندي ) وكذا فيما قبل ; أخرجه مسلم والبخاري وهذا كله خرج مخرج التشريف لمن كنى عنه ترغيبا لمن خوطب به .يجب على المستقرض رد القرض ; لأن الله تعالى بين أن من أنفق في سبيل الله لا يضيع عند الله تعالى بل يرد الثواب قطعا وأبهم الجزاء .وفي الخبر : ( النفقة في سبيل الله تضاعف إلى سبعمائة ضعف وأكثر على ما سبق بيانه عند قوله تعالى : \" مثل الذين ينفقون أموالهم في سبيل الله كمثل حبة أنبتت سبع سنابل \" [ البقرة : 261 ] الآية .وقال ههنا : \" فيضاعفه له أضعافا كثيرة \" وهذا لا نهاية له ولا حد .ثواب القرض عظيم , لأن فيه توسعة على المسلم وتفريجا عنه .خرج ابن ماجه في سننه عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : ( رأيت ليلة أسري بي على باب الجنة مكتوبا الصدقة بعشر أمثالها والقرض بثمانية عشر فقلت لجبريل : ما بال القرض أفضل من الصدقة قال لأن السائل يسأل وعنده والمستقرض لا يستقرض إلا من حاجة ) .قال : حدثنا محمد بن خلف العسقلاني حدثنا يعلى حدثنا سليمان بن يسير , عن قيس بن رومي قال : كان سليمان بن أذنان يقرض علقمة ألف درهم إلى عطائه , فلما خرج عطاؤه تقاضاها منه , واشتد عليه فقضاه , فكأن علقمة غضب فمكث أشهرا ثم أتاه فقال : أقرضني ألف درهم إلى عطائي , قال : نعم وكرامة يا أم عتبة هلمي تلك الخريطة المختومة التي عندك , قال : فجاءت بها ; فقال : أما والله إنها لدراهمك التي قضيتني ما حركت منها درهما واحدا ; قال : فلله أبوك ؟ ما حملك على ما فعلت بي ؟ قال : ما سمعت منك ; قال : ما سمعت مني ؟ قال : سمعتك تذكر عن ابن مسعود أن النبي صلى الله عليه وسلم قال : ( ما من مسلم يقرض مسلما قرضا مرتين إلا كان كصدقتها مرة ) قال : كذلك أنبأني ابن مسعود .قرض الآدمي للواحد واحد , أي يرد عليه مثله ما أقرضه .وأجمع أهل العلم على أن استقراض الدنانير والدراهم والحنطة والشعير والتمر والزبيب وكل ما له مثل من سائر الأطعمة جائز .وأجمع المسلمون نقلا عن نبيهم صلى الله عليه وسلم أن اشتراط الزيادة في السلف ربا ولو كان قبضة من علف - كما قال ابن مسعود - أو حبة واحدة .ويجوز أن يرد أفضل مما يستلف إذا لم يشترط ذلك عليه ; لأن ذلك من باب المعروف ; استدلالا بحديث أبي هريرة في البكر : ( إن خياركم أحسنكم قضاء ) رواه الأئمة : البخاري ومسلم وغيرهما .فأثنى صلى الله عليه وسلم على من أحسن القضاء , وأطلق ذلك ولم يقيده بصفة .وكذلك قضى هو صلى الله عليه وسلم في البكر وهو الفتي المختار من الإبل جملا خيارا رباعيا , والخيار : المختار , والرباعي هو الذي دخل في السنة الرابعة ; لأنه يلقي فيها رباعيته وهي التي تلي الثنايا وهي أربع رباعيات - مخففة الباء - وهذا الحديث دليل على جواز قرض الحيوان , وهو مذهب الجمهور , ومنع من ذلك أبو حنيفة وقد تقدم .ولا يجوز أن يهدي من استقرض هدية للمقرض , ولا يحل للمقرض قبولها إلا أن يكون عادتهما ذلك ; بهذا جاءت السنة : خرج ابن ماجه حدثنا هشام بن عمار قال : حدثنا إسماعيل بن عياش حدثنا عتبة بن حميد الضبي عن يحيى بن أبي إسحاق الهنائي قال : سألت أنس بن مالك عن الرجل منا يقرض أخاه المال فيهدي إليه ؟ قال : قال رسول الله صلى الله عليه وسلم : ( إذا أقرض أحدكم أخاه قرضا فأهدى له أو حمله على دابته فلا يقبلها ولا يركبها إلا أن يكون جرى بينه وبينه قبله ذلك ) .القرض يكون من المال - وقد بينا حكمه - ويكون من العرض ; وفي الحديث عن النبي صلى الله عليه وسلم : ( أيعجز أحدكم أن يكون كأبي ضمضم كان إذا خرج من بيته قال اللهم إني قد تصدقت بعرضي على عبادك ) .وروي عن ابن عمر : أقرض من عرضك ليوم فقرك ; يعني من سبك فلا تأخذ منه حقا ولا تقم عليه حدا حتى تأتي يوم القيامة موفر الأجر .وقال أبو حنيفة : لا يجوز التصدق بالعرض لأنه حق الله تعالى , وروي عن مالك .ابن العربي : وهذا فاسد , قال عليه السلام في الصحيح : ( إن دماءكم وأموالكم وأعراضكم عليكم حرام .. .) الحديث .وهذا يقتضي أن تكون هذه المحرمات الثلاث تجري مجرى واحدا في كونها باحترامها حقا للآدمي .حَسَنًاقال الواقدي : محتسبا طيبة به نفسه .وقال عمرو بن عثمان الصدفي : لا يمن به ولا يؤذي .وقال سهل بن عبد الله : لا يعتقد في قرضه عوضا .يُضَاعِفْهُ لَكُمْقرأ عاصم وغيره \" يضاعفه \" بالألف ونصب الفاء .وقرأ ابن عامر ويعقوب بالتشديد في العين مع سقوط الألف ونصب الفاء .وقرأ ابن كثير وأبو جعفر وشيبة بالتشديد ورفع الفاء .وقرأ الآخرون بالألف ورفع الفاء .فمن رفعه نسقه على قوله : \" يقرض \" وقيل : على تقدير هو يضاعفه .ومن نصب فجوابا للاستفهام بالفاء .وقيل : بإضمار \" أن \" والتشديد والتخفيف لغتان .وقال الحسن والسدي : لا نعلم هذا التضعيف إلا لله وحده , لقوله تعالى : \" ويؤت من لدنه أجرا عظيما \" [ النساء : 40 ] .قاله أبو هريرة : هذا في نفقة الجهاد , وكنا نحسب والنبي صلى الله عليه وسلم بين أظهرنا نفقة الرجل على نفسه ورفقائه وظهره بألفي ألف .وَيَغْفِرْ لَكُمْ وَاللَّهُ شَكُورٌ حَلِيمٌالشكر في اللغة الظهور من قولهم دابة شكور إذا ظهر عليها من السمن فوق ما تعطى من العلف وحقيقته الثناء على الإنسان بمعروف يوليكه كما تقدم في الفاتحة قال الجوهري الشكر الثناء على المحسن بما أولاكه من المعروف يقال شكرته وشكرت له وباللام أفصح والشكران خلاف الكفران وتشكرت له مثل شكرت له وروى الترمذي وأبو داود عن أبي هريرة عن النبي صلى الله عليه وسلم قال ( لا يشكر الله من لا يشكر الناس ) قال الخطابي هذا الكلام يتأول على معنيين أحدهما أن من كان من طبعه كفران نعمة الناس وترك الشكر لمعروفهم كان من عادته كفران نعمة الله عز وجل وترك الشكر له والوجه الآخر أن الله سبحانه لا يقبل شكر العبد على إحسانه إليه إذا كان العبد لا يشكر إحسان الناس إليه ويكفر معروفهم لاتصال أحد الأمرين بالآخر .في عبارات العلماء في معنى الشكر فقال سهل بن عبد الله الشكر الاجتهاد في بذل الطاعة مع الاجتناب للمعصية في السر والعلانية وقالت فرقة أخرى الشكر هو الاعتراف في تقصير الشكر للمنعم ولذلك قال تعالى \" اعملوا آل داود شكرا \" [ سبأ : 13 ] فقال داود كيف أشكرك يا رب والشكر نعمة منك قال الآن قد عرفتني وشكرتني إذ قد عرفت أن الشكر مني نعمة قال يا رب فأرني أخفى نعمك علي قال يا داود تنفس فتنفس داود فقال الله تعالى من يحصي هذه النعمة الليل والنهار وقال موسى عليه السلام كيف أشكرك وأصغر نعمة وضعتها بيدي من نعمك لا يجازى بها عملي كله فأوحى الله إليه يا موسى الآن شكرتني وقال الجنيد حقيقة الشكر العجز عن الشكر وعنه قال كنت بين يدي السري السقطي ألعب وأنا ابن سبع سنين وبين يديه جماعة يتكلمون في الشكر فقال لي يا غلام ما الشكر فقلت ألا يعصى الله بنعمه فقال لي أخشى أن يكون حظك من الله لسانك قال الجنيد فلا أزال أبكي على هذه الكلمة التي قالها السري لي وقال الشبلي الشكر التواضع والمحافظة على الحسنات ومخالفة الشهوات وبذل الطاعات ومراقبة جبار الأرض والسموات وقال ذو النون المصري أبو الفيض الشكر لمن فوقك بالطاعة ولنظيرك بالمكافأة ولمن دونك بالإحسان والإفضال\" حليم \" الحليم : الذي لا يعجل .\n","ar.miqbas":"إِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ شَكُورٌ حَلِيمٌ (17) استئناف بياني ناشىء عن قوله : { وأنفقوا خيراً لأنفسكم } [ التغابن : 16 ] ، فإن مضاعفة الجزاء على الإِنفاق مع المغفرة خير عظيم ، وبهذا الموقع يعلم السامع أن القرض أطلق على الإِنفاق المأمور به إطلاقاً بالاستعارة ، والمقصود الاعتناء بفضل الإِنفاق المأمور به اهتماماً مكرراً فبعد أن جُعل خيراً جُعل سببَ الفلاح وعُرف بأنه قرض من العبد لربّه وكفى بهذا ترغيباً وتلطفاً في الطلببِ إذ جُعل المنفق كأنه يعطي الله تعالى مالاً وذلك من معنى الإِحسان في معاملة العبد ربّه وقد بينه النبي صلى الله عليه وسلم في حديث جبريل إذ قال جبريل للنبيء عليهما الصلاة والسّلام : أخبرني عن الإِحسان فقال النبي صلى الله عليه وسلم «الإِحسان أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك» فمما ينضوي تحت معنى عبادة الله عبادةَ من يراه أن يستشعر العبدُ أن امتثال أمر ربه بالإِنفاق المأمور به منه كأنه معاملة بين مُقرض ومستقرض .وقد تقدم ذلك عند قوله تعالى : { من ذا الذي يُقرض الله قرضاً حسناً فيضاعفه له أضعافاً كثيرة } في سورة [ البقرة : 245 ] .وقرأ الجمهور يضاعفه } بألف بعد الضاد وقرأ ابن كثير وابن عامر ويعقوب { يضعِّفه } بتشديد العين مضارع ضَعَّف ، وهما بمعنى واحد وهو لفظي الضعف .والمضاعفة : إعطاء الضِعف بكسر الضاد وهو مِثل الشيء في الذات أو الصفة . وتصدُق بمثل وبعدة أمثال كما قال تعالى : { أضعافاً كثيرة } [ البقرة : 245 ] .وجعل الإِنفاق سبب للغفران كما قال النبي صلى الله عليه وسلم \" الصدقة تطفىء الخطايا كما يطفىء الماء النار \" .والشكور : فَعول بمعنى فاعل مبالغة ، أي كثير الشكر وأطلق الشكر فيه على الجزاء بالخير على فعل الصالحات تشبيهاً لفعل المتفضل بالجزاء بشكر المنعَم عليه على نعمة ولا نعمة على الله فيما يفعله عباده من الصالحات . فإنما نفعها لأنفسهم ولكن الله تفضّل بذلك حثاً على صلاحهم فرتب لهم الثواب بالنعيم على تزكية أنفسهم ، وتلطف لهم فسمى ذلك الثواب شكراً وجعل نفسه شاكراً .وقد أوما إلى هذا المقصد إتباع صفة { شكور } بصفة { حليم } تنبيهاً على أن ذلك من حِلمه بعباده دون حق لهم عليه سبحانه .\n","ar.waseet":"ثم ختم - سبحانه - السورة الكريمة بالحض على الإنفاق فى سبيله فقال : ( إِن تُقْرِضُواْ الله قَرْضاً حَسَناً يُضَاعِفْهُ لَكُمْ ) .أى : إن تبذلوا أموالكم فى وجوه الخير التى يحبها الله - تعالى - ، بذلا مصحوبا بالإخلاص وطيب النفس ، يضاعف الله - تعالى - لكم ثواب هذا الإنفاق والإقراض بأن يجعل لكم الحسنة بعشر أمثالها إلى سبعمائة ضعف .( وَيَغْفِرْ لَكُمْ ) فضلا عن ذلك ذنوبكم ببركة هذا الإنفاق الخالص لوجهه الكريم .( والله شَكُورٌ ) أى : كثير الشكر لمن أطاعه ( حَلِيمٌ ) لا يعاجل بالعقوبة المذنبين .\n","ar.baghawi":"\"إن تقرضوا الله قرضاً حسناً يضاعفه لكم ويغفر لكم والله شكور حليم\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5216.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5216.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5216.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ","transliteration":"'Aalimul-Ghaibi wash-shahaadatil 'Azeezul Hakeem","translations":{"en.ahmedali":"The knower of the unknown and the known, all-mighty and all-wise.","en.ahmedraza":"The All Knowing of all things hidden and visible, the Most Honourable, the Wise.","en.arberry":"Knower He of the Unseen and the Visible, the All-mighty, the All-wise.","en.asad":"knowing all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind - the Almighty, the Wise!","en.daryabadi":"Knower of the unseen and the seen, the Mighty, the Wise.","en.hilali":"All-Knower of the unseen and seen, the All-Mighty, the All-Wise.","en.pickthall":"Knower of the Invisible and the Visible, the Mighty, the Wise.","en.qaribullah":"He is the Knower of the Unseen and the Visible, the Almighty, the Wise.","en.sahih":"Knower of the unseen and the witnessed, the Exalted in Might, the Wise.","en.sarwar":"He knows the unseen and the seen. He is the Majestic and All-wise.","en.yusufali":"Knower of what is open, Exalted in Might, Full of Wisdom.","en.maududi":"He knows that which is beyond the ken of perception as well as that which can be perceived. He is the Most Mighty, the Most Wise.","en.shakir":"The Knower of the unseen and the seen, the Mighty, the Wise.","en.itani":"The Knower of the Unseen and the Seen, the Almighty, the Wise.","en.mubarakpuri":"All-Knower of the unseen and seen, the Almighty, the All-Wise.","en.qarai":"Knower of the sensible and the Unseen, the All-mighty, the All-wise.","en.wahiduddin":"God is the Knower of the unseen and the seen: He is the Almighty, the Wise One."},"tafsir":{"ar.muyassar":"وهو سبحانه العالم بكل ما غاب وما حضر، العزيز الذي لا يغالَب، الحكيم في أقواله وأفعاله.","ar.jalalayn":"«عالم الغيب» السر «والشهادة» العلانية «العزيز» في ملكه «الحكيم» في صنعه.","ar.qurtubi":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِأي ما غاب وحضرالْعَزِيزُأي الغالب القاهر .فهو من صفات الأفعال , ومنه قوله عز وجل : \" تنزيل الكتاب من الله العزيز الحكيم \" [ الجاثية : 2 ] .أي من الله القاهر المحكم خالق الأشياء .وقال الخطابي : وقد يكون بمعنى نفاسة القدر , يقال منه : عز يعز ( بكسر العين ) فيتناول معنى العزيز على هذا أنه لا يعادله شيء وأنه لا مثل له .والله أعلم .الْحَكِيمُفي تدبير خلقه .وقال ابن الأنباري : \" الحكيم \" هو المحكم لخلق الأشياء , صرف عن مفعل إلى فعيل , ومنه قوله عز وجل : \" الر تلك آيات الكتاب الحكيم \" [ يونس : 1 ] معناه المحكم , فصرف عن مفعل إلى فعيل , والله أعلم .\n","ar.miqbas":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ (18)وأمّا وصف ب { عالم الغيب والشهادة العزيز الحكيم } فتتميم للتذكير بعظمة الله تعالى مع مناسبتها للترغيب والترهيب اللذين اشتملت عليهما الآيات السابقة كلها لأن العالم بالأفعال ظاهرها وخفيّها لا يفيت شيئاً من الجزاء عليها بما رتب لها ، ولأن العزيز لا يعجزه شيء .و { الحكيم } : الموصوف بالحكمة لا يدع معاملة الناس بما تقتضيه الحكمة من وضع الأشياء مواضعها ونوط الأمور بما يناسب حقائقها .والحكيم فعيل بمعنى : المحكم ، أي المتقن في صنعه ومعاملته وهما معاً من صفاته تعالى فهو وصف جامع للمعنيين .\n","ar.waseet":"( عَالِمُ الغيب والشهادة العزيز الحكيم ) أى : هو - سبحانه - يعلم علما تاما ما كان خافيا عليكم وما كان ظاهرا لكم ، وهو - عز وجل - القوى الذى لا يغلبه غالب ، الحكيم فى كل أقواله وأفعاله .\n","ar.baghawi":"\"عالم الغيب والشهادة العزيز الحكيم\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5217.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5217.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5217.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":268,"letters":2060,"size":"189KB","priority":3,"commonlyRead":false}}