{"chapter":66,"name":{"arabic":"سورة 66","transliteration":"Chapter 66","translation":"Chapter 66","revelation":"unknown"},"revelation":"unknown","verses":12,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ","transliteration":"Yaaa ayyuhan nabiyyu lima tuharrimu maaa ahallal laahu laka tabtaghee mardaata azwaajik; wallaahu ghafoorur raheem","translations":{"en.ahmedali":"O PROPHET, WHY should you forbid (yourself) what God has made lawful for you, in order to please your wives? Yet God is forgiving and kind.","en.ahmedraza":"O dear Prophet (Mohammed – peace and blessings be upon him)! Why do you forbid for yourself the things that Allah has made lawful for you? You wish to please some of your wives; and Allah is Oft Forgiving, Most Merciful.","en.arberry":"O Prophet, why forbiddest thou what God has made lawful to thee, seeking the good pleasure of thy wives? And God is All-forgiving, All-compassionate.","en.asad":"O PROPHET! Why dost thou, out of a desire to please [one or another of] thy wives, impose [on thyself] a prohibition of something that God has made lawful to thee? But God is much-forgiving, a dispenser of grace:","en.daryabadi":"O prophet! why makest thou unlawful that which Allah hath made lawful Unto thee, seeking the good-will of thy wives! And Allah is Forgiving, Merciful.","en.hilali":"O Prophet! Why do you ban (for yourself) that which Allah has made lawful to you, seeking to please your wives? And Allah is Oft-Forgiving, Most Merciful.","en.pickthall":"O Prophet! Why bannest thou that which Allah hath made lawful for thee, seeking to please thy wives? And Allah is Forgiving, Merciful.","en.qaribullah":"O Prophet, why do you forbid that which Allah has made lawful to you. Do you seek to please your wives' Allah is the Forgiving, the Most Merciful.","en.sahih":"O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful.","en.sarwar":"Prophet, in seeking the pleasure of your wives, why do you make unlawful that which God has made lawful. God is All-forgiving and All-merciful.","en.yusufali":"O Prophet! Why holdest thou to be forbidden that which Allah has made lawful to thee? Thou seekest to please thy consorts. But Allah is Oft-Forgiving, Most Merciful.","en.maududi":"O Prophet, why do you forbid what Allah has made lawful for you? Is it to please your wives? Allah is Most Forgiving, Most Compassionate.","en.shakir":"O Prophet! why do you forbid (yourself) that which Allah has made lawful for you; you seek to please your wives; and Allah is Forgiving, Merciful.","en.itani":"O prophet! Why do you prohibit what God has permitted for you, seeking to please your wives? God is Forgiving and Merciful.","en.mubarakpuri":"O Prophet! Why do you forbid that which Allah has allowed to you, seeking to please your wives And Allah is Oft-Forgiving, Most Merciful.","en.qarai":"O Prophet! Why do you disallow [yourself] what Allah has made lawful for you, seeking to please your wives? And Allah is all-forgiving, all-merciful.","en.wahiduddin":"Prophet, why in your desire to please your wives, do you impose a ban on what God has made lawful to you? God is forgiving and merciful."},"tafsir":{"ar.muyassar":"يا أيها النبي لِمَ تمنع نفسك عن الحلال الذي أحله الله لك، تبتغي إرضاء زوجاتك؟ والله غفور لك، رحيم بك.","ar.jalalayn":"«يا أيها النبي لم تحرم ما أحل الله لك» من أمَتِكَ مارية القبطية لما واقعها في بيت حفصة وكانت غائبة فجاءت وشق عليها كون ذلك في بيتها وعلى فراشها حيث قلت: هي حرام عليَّ «تبتغي» بتحريمها «مرضات أزواجك» أي رضاهن «والله غفور رحيم» غفر لك هذا التحريم.","ar.qurtubi":"سورة التحريممدنية في قول الجميعوهي اثنتا عشرة آية . وتسمى سورة \" النبي \" .بسم الله الرحمن الرحيمياأيها النبي لم تحرم ما أحل الله لك تبتغي مرضاة أزواجك والله غفور رحيمقوله تعالى : يا أيها النبي لم تحرم ما أحل الله لك فيه خمس مسائل :الأولى : قوله تعالى : يا أيها النبي لم تحرم ما أحل الله لك ثبت في صحيح مسلم عن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش فيشرب عندها عسلا ، قالت فتواطأت أنا وحفصة أن أيتنا ما دخل عليها رسول الله صلى الله عليه وسلم فلتقل : إني أجد منك ريح مغافير ! أكلت مغافير ؟ فدخل على إحداهما فقالت له ذلك . فقال : \" بل شربت عسلا عند زينب بنت جحش ولن أعود له \" . فنزل : لم تحرم ما أحل الله لك إلى قوله إن تتوبا : ( لعائشة وحفصة ) ، وإذ أسر النبي إلى بعض أزواجه حديثا لقوله : \" بل شربت عسلا \" . وعنها أيضا قالت : كان رسول الله صلى الله عليه وسلم يحب الحلواء والعسل ، فكان إذا صلى العصر دار على [ ص: 165 ] نسائه فيدنو منهن ، فدخل على حفصة فاحتبس عندها أكثر مما كان يحتبس ، فسألت عن ذلك فقيل لي : أهدت لها امرأة من قومها عكة من عسل ، فسقت رسول الله صلى الله عليه وسلم منه شربة . فقلت : أما والله لنحتالن له ، فذكرت ذلك لسودة وقلت : إذا دخل عليك فإنه سيدنو منك فقولي له : يا رسول الله ، أكلت مغافير ؟ فإنه سيقول لك : لا . فقولي له : ما هذه الريح ؟ - وكان رسول الله صلى الله عليه وسلم يشتد عليه أن يوجد منه الريح - فإنه سيقول لك سقتني حفصة شربة عسل . فقولي له : جرست نحله العرفط . وسأقول ذلك له ، وقوليه أنت يا صفية . فلما دخل على سودة - قالت : تقول سودة : والله الذي لا إله إلا هو لقد كدت أن أبادئه بالذي قلت لي ، وإنه لعلى الباب ، فرقا منك . فلما دنا رسول الله صلى الله عليه وسلم قالت : يا رسول الله ، أكلت مغافير ؟ قال : \" لا \" . قالت : فما هذه الريح ؟ قال : \" سقتنيحفصة شربة عسل \" . قال : جرست نحله العرفط . فلما دخل علي قلت له مثل ذلك . ثم دخل على صفية فقالت بمثل ذلك . فلما دخل على حفصة قالت : يا رسول الله ، ألا أسقيك منه . قال : لا حاجة لي به . قالت : تقول سودة : سبحان الله ! والله لقد حرمناه . قالت : قلت لها اسكتي . ففي هذه الرواية أن التي شرب عندها العسل حفصة . وفي الأولى زينب . وروى ابن أبي مليكة عن ابن عباس أنه شربه عند سودة . وقد قيل : إنما هي أم سلمة ، رواه أسباط عن السدي . وقاله عطاء بن أبي مسلم . ابن العربي : وهذا كله جهل أو تصور بغير علم . فقال باقي نسائه حسدا وغيرة لمن شرب ذلك عندها : إنا لنجد منك ريح المغافير . والمغافير : بقلة أو صمغة متغيرة الرائحة ، فيها حلاوة . واحدها مغفور ، وجرست : أكلت . والعرفط : نبت له ريح كريح الخمر . وكان عليه السلام يعجبه أن يوجد منه الريح الطيبة أو يجدها ، ويكره الريح الخبيثة لمناجاة الملك . فهذا قول . وقول آخر : أنه أراد بذلك المرأة التي وهبت نفسها للنبي صلى الله عليه وسلم فلم يقبلها لأجل أزواجه ، قاله ابن عباس وعكرمة . والمرأة أم شريك . وقول ثالث : إن التي حرم مارية القبطية ، وكان قد أهداها له المقوقس ملك الإسكندرية . قال ابن إسحاق : هي من كورة أنصنا من بلد يقال له حفن فواقعها في بيت حفصة . روى الدارقطني عن ابن عباس عن عمر قال : دخل رسول الله صلى الله عليه وسلم بأم ولده مارية في بيت حفصة ، فوجدته حفصة معها - وكانت حفصة غابت إلى بيت أبيها - فقالت له : تدخلها بيتي ! ما صنعت بي هذا من بين نسائك إلا من هواني عليك . فقال لها : \" لا تذكري هذا لعائشة فهي علي حرام إن قربتها \" . قالت حفصة : وكيف تحرم عليك وهي جاريتك ؟ فحلف [ ص: 166 ] لها ألا يقربها . فقال النبي صلى الله عليه وسلم : \" لا تذكريه لأحد \" . فذكرته لعائشة ، فآلى لا يدخل على نسائه شهرا ، فاعتزلهن تسعا وعشرين ليلة ، فأنزل الله عز وجل لم تحرم ما أحل الله لك الآية .الثانية : أصح هذه الأقوال أولها . وأضعفها أوسطها . قال ابن العربي : أما ضعفه في السند فلعدم عدالة رواته ، وأما ضعفه في معناه فلأن رد النبي صلى الله عليه وسلم للموهوبة ليس تحريما لها ، لأن من رد ما وهب له لم يحرم عليه ، إنما حقيقة التحريم بعد التحليل . وأما من روى أنه حرم مارية القبطية فهو أمثل في السند وأقرب إلى المعنى ، لكنه لم يدون في الصحيح . وروي مرسلا . وقد روى ابن وهب عن مالك عن زيد بن أسلم قال : حرم رسول الله صلى الله عليه وسلم أم إبراهيم فقال : \" أنت علي حرام ، والله لا آتينك \" . فأنزل الله عز وجل في ذلك : يا أيها النبي لم تحرم ما أحل الله لك وروى مثله ابن القاسم عنه . وروى أشهب عن مالك قال : راجعت عمر امرأة من الأنصار في شيء فاقشعر من ذلك وقال : ما كان النساء هكذا ! قالت : بلى ، وقد كان أزواج النبي صلى الله عليه وسلم يراجعنه . فأخذ ثوبه فخرج إلى حفصة فقال لها : أتراجعين رسول الله صلى الله عليه وسلم ؟ قالت : نعم ، ولو أعلم أنك تكره ما فعلت . فلما بلغ عمر أن رسول الله صلى الله عليه وسلم هجر نساءه قال : رغم أنف حفصة . وإنما الصحيح أنه كان في العسل وأنه شربه عند زينب ، وتظاهرت عليه عائشة وحفصة فيه ، فجرى ما جرى فحلف ألا يشربه وأسر ذلك . ونزلت الآية في الجميع .الثالثة : قوله تعالى : \" لم تحرم \" إن كان النبي صلى الله عليه وسلم حرم ولم يحلف فليس ذلك بيمين عندنا . ولا يحرم قول الرجل : \" هذا علي حرام \" شيئا حاشا الزوجة . وقال أبو حنيفة : إذا أطلق حمل على المأكول والمشروب دون الملبوس ، وكانت يمينا توجب الكفارة . وقال زفر : هو يمين في الكل حتى في الحركة والكون . وعول المخالف على أن النبي صلى الله عليه وسلم حرم العسل فلزمته الكفارة . وقد قال الله تعالى : قد فرض الله لكم تحلة أيمانكم فسماه يمينا . ودليلنا قول الله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا ، وقوله تعالى : قل أرأيتم ما أنزل الله لكم من رزق فجعلتم منه حراما وحلالا قل آلله أذن لكم أم على الله تفترون [ ص: 167 ] فذم الله المحرم للحلال ولم يوجب عليه كفارة . قال الزجاج : ليس لأحد أن يحرم ما أحل الله . ولم يجعل لنبيه صلى الله عليه وسلم أن يحرم إلا ما حرم الله عليه . فمن قال لزوجته أو أمته : أنت علي حرام ; ولم ينو طلاقا ولا ظهارا فهذا اللفظ يوجب كفارة اليمين . ولو خاطب بهذا اللفظ جمعا من الزوجات والإماء فعليه كفارة واحدة . ولو حرم على نفسه طعاما أو شيئا آخر لم يلزمه بذلك كفارة عند الشافعي ومالك . وتجب بذلك كفارة عند ابن مسعود والثوري وأبي حنيفة .الرابعة : واختلف العلماء في الرجل يقول لزوجته : \" أنت علي حرام \" على ثمانية عشر قولا : أحدها : لا شيء عليه . وبه قال الشعبي ومسروق وربيعة وأبو سلمة وأصبغ . وهو عندهم كتحريم الماء والطعام ; قال الله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم والزوجة من الطيبات ومما أحل الله . وقال تعالى : ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام . وما لم يحرمه الله فليس لأحد أن يحرمه ، ولا أن يصير بتحريمه حراما . ولم يثبت عن رسول الله صلى الله عليه وسلم أنه قال لما أحله الله هو علي حرام . وإنما امتنع من مارية ليمين تقدمت منه وهو قوله : والله لا أقربها بعد اليوم فقيل له : لم تحرم ما أحل الله لك ; أي لم تمتنع منه بسبب اليمين . يعني أقدم عليه وكفر .وثانيها : أنها يمين يكفرها ; قاله أبو بكر الصديق وعمر بن الخطاب وعبد الله بن مسعود وابن عباس وعائشة - رضي الله عنهم - والأوزاعي ; وهو مقتضى الآية . قال سعيد بن جبير عن ابن عباس : إذا حرم الرجل عليه امرأته فإنما هي يمين يكفرها . وقال ابن عباس : لقد كان لكم في رسول الله أسوة حسنة ; يعني أن النبي صلى الله عليه وسلم كان حرم جاريته فقال الله تعالى : لم تحرم ما أحل الله لك إلى قوله تعالى قد فرض الله لكم تحلة أيمانكم فكفر عن يمينه وصير الحرام يمينا . خرجه الدارقطني .وثالثها : أنها تجب فيها كفارة وليست بيمين ; قاله ابن مسعود وابن عباس أيضا في إحدى روايتيه ، والشافعي في أحد قوليه ، وفي هذا القول نظر . والآية ترده على ما يأتي .ورابعها : هي ظهار ; ففيها كفارة الظهار ، قاله عثمان وأحمد بن حنبل وإسحاق .[ ص: 168 ] وخامسها : أنه إن نوى الظهار وهو ينوي أنها محرمة كتحريم ظهر أمه كان ظهارا . وإن نوى تحريم عينها عليه بغير طلاق تحريما مطلقا وجبت كفارة يمين . وإن لم ينو شيئا فعليه كفارة يمين ، قاله الشافعي .وسادسها : أنها طلقة رجعية ، قاله عمر بن الخطاب والزهري وعبد العزيز بن أبي سلمة وابن الماجشون . وسابعها : أنها طلقة بائنة ، قاله حماد بن أبي سليمان وزيد بن ثابت . ورواه ابن خويز منداد عن مالك .وثامنها : أنها ثلاث تطليقات ، قاله علي بن أبي طالب وزيد بن ثابت أيضا وأبو هريرة .وتاسعها : هي في المدخول بها ثلاث ، وينوي في غير المدخول بها ، قاله الحسن وعلي بن زيد والحكم . وهو مشهور مذهب مالك .وعاشرها : هي ثلاث ; ولا ينوي بحال ولا في محل وإن لم يدخل ; قاله عبد الملك في المبسوط ، وبه قال ابن أبي ليلى .وحادي عشرها : هي في التي لم يدخل بها واحدة ، وفي التي دخل بها ثلاث ; قاله أبو مصعب ومحمد بن عبد الحكم .وثاني عشرها : أنه إن نوى الطلاق أو الظهار كان ما نوى . فإن نوى الطلاق فواحدة بائنة إلا أن ينوي ثلاثا . فإن نوى ثنتين فواحدة . فإن لم ينو شيئا كانت يمينا وكان الرجل موليا من امرأته ; قاله أبو حنيفة وأصحابه . وبمثله قال زفر ; إلا أنه قال : إذا نوى اثنتين ألزمناه .وثالث عشرها : أنه لا تنفعه نية الظهار وإنما يكون طلاقا ; قاله ابن القاسم .ورابع عشرها : قال يحيى بن عمر : يكون طلاقا ; فإن ارتجعها لم يجز له وطؤها حتى يكفر كفارة الظهار .وخامس عشرها : إن نوى الطلاق فما أراد من أعداده . وإن نوى واحدة فهي رجعية . وهو قول الشافعي رضي الله عنه . وروي مثله عن أبي بكر وعمر وغيرهم من الصحابة والتابعين .وسادس عشرها : إن نوى ثلاثا فثلاثا ، وإن واحدة فواحدة . وإن نوى يمينا فهي يمين . وإن لم ينو شيئا فلا شيء عليه . وهو قول سفيان . وبمثله قال الأوزاعي وأبو ثور ; إلا أنهما قالا : إن لم ينو شيئا فهي واحدة .[ ص: 169 ] وسابع عشرها : له نيته ولا يكون أقل من واحدة ; قاله ابن شهاب . وإن لم ينو شيئا لم يكن شيء ; قاله ابن العربي . ورأيت لسعيد بن جبير وهو :الثامن عشر : أن عليه عتق رقبة وإن لم يجعلها ظهارا . ولست أعلم لها وجها ، ولا يبعد في المقالات عندي .قلت : قد ذكره الدارقطني في سننه عن ابن عباس فقال : حدثنا الحسين بن إسماعيل قال : حدثنا محمد بن منصور قال : حدثنا روح قال : حدثنا سفيان الثوري عن سالم الأفطس عن سعيد بن جبير عن ابن عباس أنه أتاه رجل فقال : إني جعلت امرأتي علي حراما . فقال : كذبت ! ليست عليك بحرام ; ثم تلا : يا أيها النبي لم تحرم ما أحل الله لك عليك أغلظ الكفارات : عتق رقبة . وقد قال جماعة من أهل التفسير : إنه لما نزلت هذه الآية كفر عن يمينه بعتق رقبة ، وعاد إلى مارية صلى الله عليه وسلم ; قاله زيد بن أسلم وغيره .الخامسة : قال علماؤنا : سبب الاختلاف في هذا الباب أنه ليس في كتاب الله ولا في سنة رسول الله صلى الله عليه وسلم نص ولا ظاهر صحيح يعتمد عليه في هذه المسألة ، فتجاذبها العلماء لذلك . فمن تمسك بالبراءة الأصلية فقال : لا حكم ، فلا يلزم بها شيء . وأما من قال إنها يمين ; فقال : سماها الله يمينا . وأما من قال : تجب فيها كفارة وليست بيمين ; فبناه على أحد أمرين : أحدهما أنه ظن أن الله تعالى أوجب الكفارة فيها وإن لم تكن يمينا . والثاني أن معنى اليمين عنده التحريم ، فوقعت الكفارة على المعنى . وأما من قال : إنها طلقة رجعية ; فإنه حمل اللفظ على أقل وجوهه ، والرجعية محرمة الوطء كذلك ; فيحمل اللفظ عليه . وهذا يلزم مالكا ، لقوله : إن الرجعية محرمة الوطء . وكذلك وجه من قال : إنها ثلاث ، فحمله على أكبر معناه وهو الطلاق الثلاث . وأما من قال : إنه ظهار ، فلأنه أقل درجات التحريم ، فإنه تحريم لا يرفع النكاح . وأما من قال : إنه طلقة بائنة ، فعول على أن الطلاق الرجعي لا يحرم المطلقة ، وأن الطلاق البائن يحرمها . وأما قول يحيى بن عمر فإنه احتاط بأن جعله طلاقا ، فلما ارتجعها احتاط بأن يلزمه الكفارة . ابن العربي : وهذا لا يصح ، لأنه جمع بين المتضادين ، فإنه لا يجتمع ظهار وطلاق في معنى لفظ واحد ، فلا وجه للاحتياط فيما لا يصح اجتماعه في الدليل .[ ص: 170 ] وأما من قال : إنه ينوى في التي لم يدخل بها ، فلأن الواحدة تبينها وتحرمها شرعا إجماعا . وكذلك قال من لم يحكم باعتبار نيته : إن الواحدة تكفي قبل الدخول في التحريم بالإجماع ، فيكفي أخذا بالأقل المتفق عليه . وأما من قال : إنه ثلاث فيهما ، فلأنه أخذ بالحكم الأعظم ، فإنه لو صرح بالثلاث لنفذت في التي لم يدخل بها نفوذها في التي دخل بها . ومن الواجب أن يكون المعنى مثله وهو التحريم . والله أعلم .وهذا كله في الزوجة . وأما في الأمة فلا يلزم فيها شيء من ذلك ، إلا أنه ينوي به العتق عند مالك . وذهب عامة العلماء إلى أن عليه كفارة يمين . ابن العربي : والصحيح أنها طلقة واحدة ، لأنه لو ذكر الطلاق لكان أقله وهو الواحدة إلا أن يعدده . كذلك إذا ذكر التحريم يكون أقله إلا أن يقيده بالأكثر ، مثل أن يقول : أنت علي حرام إلا بعد زوج ، فهذا نص على المراد .قلت : أكثر المفسرين على أن الآية نزلت في حفصة لما خلا النبي صلى الله عليه وسلم في بيتها بجاريته ; ذكره الثعلبي . وعلى هذا فكأنه قال : لا يحرم عليك ما حرمته على نفسك ولكن عليك كفارة يمين ، وإن كان في تحريم العسل والجارية أيضا . فكأنه قال : لم يحرم عليك ما حرمته ، ولكن ضممت إلى التحريم يمينا فكفر عن اليمين . وهذا صحيح ، فإن النبي صلى الله عليه وسلم حرم ثم حلف ، كما ذكره الدارقطني . وذكر البخاري معناه في قصة العسل عن عبيد بن عمير عن عائشة قالت : كان رسول الله صلى الله عليه وسلم يشرب عند زينب بنت جحش عسلا ويمكث عندها ، فتواطأت أنا وحفصة على أيتنا دخل عليها فلتقل : أكلت مغافير ؟ إني لأجد منك ريح مغافير ! قال : \" لا ، ولكن شربت عسلا ولن أعود له ، وقد حلفت ، لا تخبري بذلك أحدا \" . يبتغي مرضات أزواجه . فيعني بقوله : ولن أعود له على جهة التحريم . وبقوله : حلفت ؛ أي بالله ، بدليل أن الله تعالى أنزل عليه عند ذلك معاتبته على ذلك ، وحوالته على كفارة اليمين بقوله تعالى : يا أيها النبي لم تحرم ما أحل الله لك يعني العسل المحرم بقوله : لن أعود له . تبتغي مرضات أزواجك أي تفعل ذلك طلبا لرضاهن . والله غفور رحيم غفور لما أوجب المعاتبة ، رحيم برفع المؤاخذة . وقد قيل : إن ذلك كان ذنبا من الصغائر . والصحيح أنه معاتبة على ترك الأولى ، وأنه لم تكن له صغيرة ولا كبيرة .\n","ar.miqbas":"يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ تَبْتَغِي مَرْضَاةَ أَزْوَاجِكَ وَاللَّهُ غَفُورٌ رَحِيمٌ (1)افتتاح السورة بخطاب النبي صلى الله عليه وسلم بالنداء تنبيه على أن ما سيذكر بعده مما يهتم به النبي صلى الله عليه وسلم والأمة ولأن سبب النزول كان من علائقه .والاستفهام في قوله : { لم تحرم } مستعمل في معنى النفي ، أي لا يوجد ما يدعو إلى أن تحرّم على نفسك ما أحلّ اللَّه لك ذلك أنه لما التزم عدم العود إلى ما صدر منه التزاماً بيمين أو بدون يمين أراد الامتناع منه في المستقبل قاصداً بذلك تطمين أزواجه اللاء تمالأْنَ عليه لِفرط غيرتهن ، أي ليست غيرتهن مما تجب مراعاته في المعاشرة إن كانت فيما لا هضم فيه لحقوقهن ، ولا هي من إكرام إحداهن لزوجها إن كانت الأخرى لم تتمكن من إكرامه بمثل ذلك الإِكرام في بعض الأيام .وهذا يومىء إلى ضبط ما يراعى من الغيرة وما لا يراعَى .وفعل { تحرم } مستعمل في معنى : تجعل ما أحلّ لك حراماً ، أي تحرّمه على نفسك كقوله تعالى : { إلا ما حرم إسرائيل على نفسه } [ آل عمران : 93 ] وقرينتهُ قوله هنا : { ما أحل الله لك } .وليس معنى التحريم هنا نسبة الفعل إلى كونه حراماً كما في قوله تعالى : { قل من حرم زينة الله التي أخرج لعباده والطيبات من الرزق } [ الأعراف : 32 ] ، وقوله : { يحلونه عاماً ويحرمونه عاماً } [ التوبة : 37 ] ، فإن التفعيل يأتي بمعنى التصبير كما يقال : وسِّعْ هذا الباب ويأتي بمعنى إيجاد الشيء على حالة مثل ما يقال للخياط : وسِّعْ طَوْق الجبّة .ولا يخطر ببال أحد أن يتوهم منه أنك غيّرت إباحته حراماً على الناس أو عليك . ومن العجيب قول «الكشاف» : ليس لأحد أن يُحرّم ما أحلّ الله لأن الله إنما أحله لمصلحة عرفها في إحلاله إلخ .وصيغة المضارع في قوله : { لم تحرم } لأنه أوقع تحريماً متجدداً .فجملة { تبتغي } حال من ضمير { تحرم } . فالتعجيب واقع على مضمون الجملتين مثل قوله : { لا تأكلوا الربا أضعافاً مضاعفة } [ آل عمران : 130 ] .وفي الإِتيان بالموصول في قوله : { ما أحل الله لك } لما في الصلة من الإِيماء إلى تعليل الحكم هو أن ما أحله الله لعبده ينبغي له أن يتمتع به ما لم يعرض له ما يوجب قطعه من ضر أو مرض لأن تناوله شكرٌ لله واعترافٌ بنعمته والحاجة إليه .وفي قوله : { تبتغي مرضات أزواجك } عذر للنبي صلى الله عليه وسلم فيما فعله من أنه أراد به خيراً وهو جلب رضا الأزواج لأنه أعون على معاشرته مع الإشعار بأن مثل هذه المرضاة لا يعبأ بها لأن الغيرة نشأت عن مجرد معاكسة بعضهن بعضاً وذلك مما يختل به حسن المعاشرة بينهن ، فأنبأه الله أن هذا الاجتهاد معارَض بأن تحريم ما أحلّ الله له يفضي إلى قطع كثير من أسباب شكر الله عند تناول نعمه وأن ذلك ينبغي إبطاله في سيرة الأمة .وذيل بجملة { والله غفور رحيم } استئناساً للنبيء صلى الله عليه وسلم من وحشة هذا الملام ، أي والله غفور رحيم لك مثل قوله : { عفا الله عنك لما أذنت لهم } [ التوبة : 43 ] .\n","ar.waseet":"قد افتتح سبحانه - السورة الكريمة بقوله - تعالى - : ( ياأيها النبي لِمَ تُحَرِّمُ . . . . ثَيِّبَاتٍ وَأَبْكَاراً ) .وقد ذكر المفسرون فى سبب نزول هذه الآيات روايات متعددة ، منها ما رواه الشيخان وغيرهما عن عائشة - رضى الله عنها - قالت : \" كان رسول الله - صلى الله عليه وسلم - يشرب عسلا عند زينب بنت جحش ، ويمكث عندها فتواطأت أنا وحفصة على أيتنا دخل عليها فلتقل له : أكلت مغافير؟ - والمغافير : صمغ حلو له رائحة كريهة - إنى أجد منك ريح مغافير .فدخل على إحداهما فقالت له ذلك ، فقال : بل شربت عسلا عند زينب بنت جحش ولن أعود إليه ، وقد حلفت ، فلا تخبرى بذلك أحدا ، فنزلت هذه الآيات \" .وفى رواية أن التى شرب عندها العسل : حفصة بنت عمر ، وأن القائلة له ذلك : سودة بنت زمعة ، وصفية بنت حيى .قالوا : والاشتباه فى الاسم لا يضر ، بعد ثبوت أصل القصة .وأخرج النسائى والحاكم وصححه وابن مردويه عن أنس ، أن رسول الله - صلى الله عليه وسلم - كانت له أمة يطؤها ، فلم تزل به عائشة وحفصة حتى جعلها على نفسه حراما ، فأنزل الله - تعالى - ( ياأيها النبي لِمَ تُحَرِّمُ مَآ أَحَلَّ الله لَكَ . . . الآيات . . . ) .وروى ابن جرير عن زيد بن أسلم : أن رسول الله - صلى الله عليه وسلم - أصاب أم إبراهيم مارية ، فى بيت بعض نسائه - وفى رواية فى بيت حفصة فقالت : يا رسول الله فى بيتى وعلى فراشى؟ فجعلها أى مارية - عليه حراما ، وحلف بهذا . . . فأنزل الله هذه الآيات .قال القرطبى ما ملخصه : \" وأصح هذه الأقوال أولها . . . والصحيح أن التحريم كان فى العسل ، وأنه شربه عند زينب ، وتظاهرت عليه عائشة وحفصة فيه ، فجرى ما جرى فحلف أن لا يشربه وأسر ذلك ، ونزلت الآية فى الجميع \" .وقال الإمام ابن كثير - بعد أن ساق عددا من الروايات فى هذا الشأن : والصحيح أن ذلك كان فى تحريمه - صلى الله عليه وسلم - للعسل .وقال الآلوسى : قال النووى فى شرح مسلم : الصحيح أن الآية فى قصة العسل ، لا فى قصة مارية المروية فى غير الصحيحين ، ولم تأت قصة مارية من طريق صحيح .والصواب أن شرب العسل كان عند زينب بنت جحش .وقد افتتح - سبحانه - السورة الكريمة بتوجيه النداء إلى النبى - صلى الله عليه وسلم - فقال : ( ياأيها النبي لِمَ تُحَرِّمُ مَآ أَحَلَّ الله لَكَ ) .وفى توجيه النداء إليه - صلى الله عليه وسلم - تنبيه إلى أن ما سيذكر بعد النداء ، شىء مهم ، بالنسبة له ولسائر المسلمين .والاستفهام فى قوله - تعالى - ( لِمَ تُحَرِّمُ مَآ أَحَلَّ الله لَكَ . . ) للنفى المصحوب بالعتاب منه - سبحانه - لنبيه - صلى الله عليه وسلم - .وجملة ( تَبْتَغِي مَرْضَاةَ أَزْوَاجِكَ ) حال من فاعل ( تُحَرِّمُ ) ، والعتاب واقع على مضمون هذه الجملة والتى قبلها ، وهى قوله ( لِمَ تُحَرِّمُ مَآ أَحَلَّ الله لَكَ ) .والمعنى : يا أيها الرسول الكريم ، لماذا حرمت على نفسك ما أحله الله - تعالى - لك من شراب أو غيره؟ أفعلت ذلك من أجل إرضاء أزواجك؟إنه لا ينبغى لك أن تفعل ذلك ، لأن ما أباحه الله - تعالى - لك ، لا يصح أن تحرمه على نفسك أو أن تمتنع عن تعاطيه ، فتشق على نفسك من أجل إرضاء غيرك .قال بعض العلماء : \" ناداه بلفظ \" النبى \" إشعارا بأنه الذى نُبئَ بأسرار التحليل والتحريم الإلهى ، والمراد بتحريمه ما أُحِل له ، امتناعه منه ، وحظره إياه على نفسه .وهذا المقدار مباح ، ليس فى ارتكابه جناح ، وإنما قيل له ( لِمَ تُحَرِّمُ مَآ أَحَلَّ الله لَكَ ) رفقا به ، وشفقة عليه ، وتنويها لقدره ولمنصبه - صلى الله عليه وسلم - أن يراعى مرضاة أزواجه بما يشق عليه ، جريا على ما ألف من لطف الله - تعالى - به ، ورفعه عن أن يحرج بسبب أحد من البشر الذين هم أتباعه . . . \" .وقوله - سبحانه - : ( والله غَفُورٌ رَّحِيمٌ ) تسلية للرسول - صلى الله عليه وسلم - عما أصابه من وقع هذا اللوم ، ومن أثر هذا العتاب ، وإرشاد له - صلى الله عليه وسلم - بأن ما فعله داخل تحت مغفرة الله - تعالى - ورحمته .أى : والله - تعالى - واسع المغفرة والرحمة وقد غفر لك - بفضله وكرمه ما فعلته بسبب بعض أزواجك ، وجعلك على رأس من تظلهم رحمته .\n","ar.baghawi":"مدنية( ياأيها النبي لم تحرم ما أحل الله لك تبتغي مرضاة أزواجك والله غفور رحيم ) وسبب نزولها ما أخبرنا عبد الواحد بن أحمد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا عبيد الله بن إسماعيل ، حدثنا أبو أسامة ، عن هشام ، عن أبيه ، عن عائشة رضي الله عنها قالت : كان رسول الله - صلى الله عليه وسلم - يحب الحلواء [ ويحب ] العسل وكان إذا صلى العصر جاز على نسائه فيدنو منهن ، فدخل على حفصة فاحتبس عندها أكثر مما كان يحتبس ، فسألت عن ذلك فقيل لي : أهدت لها امرأة من قومها عكة عسل فسقت رسول الله - صلى الله عليه وسلم - منها شربة ، فقلت : أما والله لنحتالن له فذكرت ذلك لسودة ، وقلت : إذا دخل عليك فإنه سيدنو منك فقولي له : يا رسول الله أكلت مغافير ؟ فإنه سيقول : لا فقولي له : ما هذه الريح وكان رسول الله - صلى الله عليه وسلم - يشتد عليه أن يوجد منه الريح ، فإنه سيقول : سقتني حفصة شربة عسل ، فقولي له : جرست نحله العرفط ، وسأقول ذلك وقوليه أنت يا صفية ، فلما دخل على سودة ، تقول سودة : والله الذي لا إله إلا هو لقد كدت أن أباديه بالذي قلت لي وإنه لعلى الباب ، فرقا منك فلما دنا رسول الله - صلى الله عليه وسلم - قلت : يا رسول الله أكلت مغافير ؟ قال : لا ، قلت : فما بال هذه الريح ! قال : سقتني حفصة شربة عسل ، قالت : جرست نحله العرفط ، فلما دخل علي قلت له مثل ذلك ، ودخل على صفية فقالت له مثل ذلك ، فلما دخل على حفصة قالت له : يا رسول الله ألا أسقيك منه قال : لا حاجة لي به تقول سودة : سبحان الله لقد حرمناه ، قالت : قلت لها : اسكتيأخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا الحسن بن محمد الصباح ، حدثنا الحجاج عن ابن جريج قال : زعم عطاء أنه سمع عبيد بن عمير يقول سمعت عائشة رضي الله عنها أن النبي - صلى الله عليه وسلم - كان يمكث عند زينب بنت جحش ويشرب عندها عسلا فتواصيت أنا وحفصة أن أيتنا دخل عليها النبي - صلى الله عليه وسلم - فلتقل إني أجد منك ريح مغافير ، أكلت مغافير ؟ فدخل على إحداهما فقالت له ذلك ، فقال : لا بأس شربت عسلا عند زينب بنت جحش ولن أعود له ، فنزلت : ياأيها النبي لم تحرم ما أحل الله لك تبتغي مرضاة أزواجك إلى قوله : إن تتوبا إلى الله لعائشة وحفصة ( وإذ أسر النبي إلى بعض أزواجه حديثا ) لقوله : بل شربت عسلاوبهذا الإسناد قال : حدثنا محمد بن إسماعيل ، أخبرنا إبراهيم بن موسى ، أخبرنا هشام بن يوسف ، عن ابن جريج ، عن عطاء بإسناده وقال : قال : لا ولكن كنت أشرب عسلا عند زينب بنت جحش فلن أعود له ، وقد حلفت ، لا تخبري بذلك أحدا ، يبتغي بذلك مرضاة أزواجه .وقال المفسرون : وكان رسول الله - صلى الله عليه وسلم - يقسم بين نسائه فلما كان يوم حفصة استأذنت رسول الله - صلى الله عليه وسلم - في زيارة أبيها فأذن لها ، فلما خرجت أرسل رسول الله - صلى الله عليه وسلم - إلى جاريته مارية القبطية فأدخلها بيت حفصة ، فوقع عليها فلما رجعت حفصة وجدت الباب مغلقا فجلست عند الباب فخرج رسول الله - صلى الله عليه وسلم - ووجهه يقطر عرقا ، وحفصة تبكي فقال : ما يبكيك ؟ فقالت : إنما أذنت لي من أجل هذا أدخلت أمتك بيتي ، ثم وقعت عليها في يومي وعلى فراشي ، أما رأيت لي حرمة وحقا ؟ ما كنت تصنع هذا بامرأة منهن . فقال رسول الله - صلى الله عليه وسلم - : أليست هي جاريتي أحلها الله لي ؟ اسكتي فهي حرام علي ألتمس بذاك رضاك ، فلا تخبري بهذا امرأة منهن . فلما خرج رسول الله - صلى الله عليه وسلم - قرعت حفصة الجدار الذي بينها وبين عائشة فقالت : ألا أبشرك إن رسول الله - صلى الله عليه وسلم - قد حرم عليه أمته مارية ، وإن الله قد أراحنا منها وأخبرت عائشة بما رأت ، وكانتا متصافيتين متظاهرتين على سائر أزواج النبي - صلى الله عليه وسلم - ، فغضبت عائشة فلم تزل بنبي الله - صلى الله عليه وسلم - حتى حلف أن لا يقربها فأنزل الله - عز وجل - \" ياأيها النبي لم تحرم ما أحل الله لك \" يعني العسل ومارية \" تبتغي مرضاة أزواجك والله غفور رحيم \" وأمره أن يكفر يمينه ويراجع أمته ، فقال :\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5230.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5230.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5230.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ","transliteration":"Qad faradal laahu lakum tahillata aymaanikum; wallaahu mawlaakum wa huwal'aleemul hakeem","translations":{"en.ahmedali":"Surely God has sanctioned the dissolution of your vows. God is your Lord: He is all-knowing, and all-wise.","en.ahmedraza":"Allah has ordained expiation for your oaths; and Allah is your Master; and Allah is the All Knowing, the Wise.","en.arberry":"God has ordained for you the absolution of your oaths. God is your Protector, and He is the All-knowing, the All-wise.","en.asad":"God has already enjoined upon you [O believers] the breaking and expiation of [such of] your oaths [as may run counter to what is right and just]: for, God is your Lord Supreme, and He alone is all-knowing, truly wise.","en.daryabadi":"Surely Allah hath ordained for you absolution from your oaths; and Allah is your Patron and He is the Knower, the Wise.","en.hilali":"Allah has already ordained for you (O men), the dissolution of your oaths. And Allah is your Maula (Lord, or Master, or Protector, etc.) and He is the All-Knower, the All-Wise.","en.pickthall":"Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind), and Allah is your Protector. He is the Knower, the Wise.","en.qaribullah":"Allah has absolved you from your oaths. Allah is your Guardian, the Knowing, the Wise.","en.sahih":"Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.","en.sarwar":"God has shown you how to absolve yourselves of your oaths. He is your Guardian and is All-knowing and All-wise.","en.yusufali":"Allah has already ordained for you, (O men), the dissolution of your oaths (in some cases): and Allah is your Protector, and He is Full of Knowledge and Wisdom.","en.maududi":"Allah has prescribed for you a way for the absolution of your oaths. Allah is your Guardian. He is All-Knowing, Most Wise.","en.shakir":"Allah indeed has sanctioned for you the expiation of your oaths and Allah is your Protector, and He is the Knowing the Wise.","en.itani":"God has decreed for you the dissolution of your oaths. God is your Master. He is the All-Knowing, the Most Wise.","en.mubarakpuri":"Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Protector and He is the All-Knower, the All-Wise.","en.qarai":"Allah has certainly made lawful for you the dissolution of your oaths, and Allah is your master and He is the All-knowing, the All-wise.","en.wahiduddin":"God has already ordained that you be absolved of such oaths. God is your patron. He is the All Knowing, the Wise One."},"tafsir":{"ar.muyassar":"قد شرع الله لكم -أيها المؤمنون- تحليل أيمانكم بأداء الكفارة عنها، وهي: إطعام عشرة مساكين، أو كسوتهم، أو تحرير رقبة، فمن لم يجد فصيام ثلاثة أيام. والله ناصركم ومتولي أموركم، وهو العليم بما يصلحكم فيشرعه لكم، الحكيم في أقواله وأفعاله.","ar.jalalayn":"(قد فرض الله) شرع (لكم تحلة أيمانكم) تحليلها بالكفارة المذكورة في سورة \"\" المائدة \"\" ومن الإيمان تحريم الأمة وهل كفّر صلى الله عليه وسلم؟ قال مقاتل: أعتق رقبة في تحريم مارية، وقال الحسن: لم يكفّر لأنه صلى الله عليه وسلم مغفور له (والله مولاكم) ناصركم (وهو العليم الحكيم).","ar.qurtubi":"قوله تعالى : قد فرض الله لكم تحلة أيمانكم والله مولاكم وهو العليم الحكيمفيه ثلاث مسائل :الأولى : قوله تعالى : قد فرض الله لكم تحلة أيمانكم تحليل اليمين كفارتها . أي إذا أحببتم استباحة المحلوف عليه ، وهو قوله تعالى في سورة \" المائدة \" : فكفارته إطعام عشرة مساكين . ويتحصل من هذا أن من حرم شيئا من المأكول والمشروب لم يحرم عليه عندنا ، لأن الكفارة لليمين لا للتحريم على ما بيناه . وأبو حنيفة يراه يمينا في كل شيء ، ويعتبر الانتفاع المقصود فيما يحرمه ، فإذا حرم طعاما فقد حلف على أكله ، أو أمة فعلى وطئها ، أو زوجة فعلى الإيلاء منها إذا لم يكن له نية ، وإن نوى الظهار فظهار ، وإن نوى الطلاق فطلاق بائن . وكذلك إن نوى ثنتين أو ثلاثا . وإن قال : نويت الكذب دين فيما بينه وبين الله تعالى . ولا يدين في القضاء بإبطال الإيلاء . وإن قال : كل حلال عليه حرام ; فعلى الطعام والشراب إذا لم ينو ، وإلا فعلى ما نوى . ولا يراه الشافعي يمينا ولكن سببا في الكفارة في النساء وحدهن . وإن نوى الطلاق فهو رجعي عنده ، على ما تقدم بيانه . فإن حلف ألا يأكله حنث ويبر بالكفارة .الثانية : فإن حرم أمته أو زوجته فكفارة يمين ، كما في صحيح مسلم عن ابن عباس قال : إذا حرم الرجل عليه امرأته ، فهي يمين يكفرها . وقال : لقد كان لكم في رسول الله أسوة حسنة .الثالثة : قيل : إن النبي صلى الله عليه وسلم كفر عن يمينه . وعن الحسن : لم يكفر ، لأن النبي صلى الله عليه وسلم قد غفر له ما تقدم من ذنبه وما تأخر ، وكفارة اليمين في هذه السورة إنما أمر بها الأمة . والأول أصح ، وأن المراد بذلك النبي صلى الله عليه وسلم . ثم إن الأمة تقتدي به في ذلك . وقد قدمنا عن زيد بن أسلم أنه عليه السلام كفر بعتق رقبة . وعن مقاتل أن رسول الله صلى الله عليه وسلم أعتق رقبة في تحريم مارية . والله أعلم . وقيل : أي قد فرض الله لكم تحليل ملك اليمين ، فبين في قوله تعالى : ما كان على النبي من حرج فيما فرض الله له أي فيما شرعه له في النساء المحللات . أي حلل [ ص: 172 ] لكم ملك الأيمان ، فلم تحرم مارية على نفسك مع تحليل الله إياها لك . وقيل : تحلة اليمين الاستثناء ، أي فرض الله لكم الاستثناء المخرج عن اليمين . ثم عند قوم يجوز الاستثناء من الأيمان متى شاء وإن تحلل مدة . وعند المعظم لا يجوز إلا متصلا ، فكأنه قال : استثن بعد هذا فيما تحلف عليه . وتحلة اليمين تحليلها بالكفارة ، والأصل تحللة ، فأدغمت . وتفعلة من مصادر فعل ; كالتسمية والتوصية . فالتحلة تحليل اليمين . فكأن اليمين عقد ، والكفارة حل . وقيل : التحلة الكفارة ; أي إنها تحل للحالف ما حرم على نفسه ; أي إذا كفر صار كمن لم يحلف .\" والله مولاكم \" وليكم وناصركم بإزالة الحظر فيما تحرمونه على أنفسكم ، وبالترخيص لكم في تحليل أيمانكم بالكفارة ، وبالثواب على ما تخرجونه في الكفارة .\n","ar.miqbas":"قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ وَاللَّهُ مَوْلَاكُمْ وَهُوَ الْعَلِيمُ الْحَكِيمُ (2)استئناف بياني بيّن الله به لنبيئه صلى الله عليه وسلم أن له سعة في التحلل مما التزم تحريمه على نفسه ، وذلك فيما شرع الله من كفارة اليمين فأفتاه الله بأن يأخذ برخصته في كفارة اليمين المشروعة للأمة كلها ومن آثار حكم هذه الآية ما قاله النبي صلى الله عليه وسلم لوفد عبد القيس بعد أن استحملوه وحلف أن لا يحملهم إذ ليس عنده ما يحملهم عليه ، فجاءه ذود من إبل الصدقة فقال لهم : «وإني والله لا أحلف على يمين فأرى غيرها خيراً منها إلا كفرت عن يميني وفعلت الذي هو خير» .وافتتاح الخبر بحرف التحقيق لتنزيل النبي صلى الله عليه وسلم منزلة من لا يعلم أن الله فرض تَحِلَّة الأيمان بآية الكفارة بناء على أنه لم يأخذ بالرخصة تعظيماً للقَسَم . فأعلمه الله أن الأخذ بالكفارة لا تقصير عليه فيه فإن في الكفارة ما يكفي للوفاء بتعظيم اليمين بالله إلى شيء هذا قوله تعالى في قصة أيوب { وخذ بيدك ضغثاً فاضرب به ولا تحنث } [ ص : 44 ] كما ذكرناه في تفسيرها و { فرض } عيَّن ومنه قوله تعالى : { نصيباً مفروضاً } [ النساء : 7 ] . وقال : فرض له في العطاء والمعنى : قد بيَّن الله لكن تحلة أيمانكم .واعلم أنه إن كان النبي صلى الله عليه وسلم لم يصدر منه في تلك الحادثة إلا أنه التزم أن لا يعود لشرب شيء عند بعض أزواجه في غير يوم نوبتها أو كان وعد أن يحرّم مارية على نفسه بدون يمين على الرواية الأخرى . كان ذلك غير يمين فكان أمرُ الله إياه بأن يكفر عن يمينه إما لأن ذلك يجري مجرى اليمين لأنه إنما وعد لذلك تطميناً لخاطر أزواجه فهو التزام لهن فكان بذلك ملحقاً باليمين وبذلك أخذ أبو حنيفة ولم يره مالك يميناً ولا نذراً فقال في «الموطأ» : ومعنى قول رسول الله صلى الله عليه وسلم \" من نذر أن يعصي الله فلا يعصه \" أن ينذر الرجل أن يمشي إلى الشام أو إلى مصر مما ليس لله بطاعة إن كلم فلاناً ، فليس عليه في ذلك شيء إنْ هو كلّمه لأنه ليس لله في هذه الأشياء طاعة فإن حَلف فقال : «والله لا آكل هذا الطعام ولا ألبس هذا الثوب فإنما عليه كفارة يمين» اه .وقد اختلف هل كفّر النبي صلى الله عليه وسلم عن يمينه تلك .فالتحلّة على هذا التفسير عند مالك هي : جعل الله ملتزم مثل هذا في حلِّ مننِ التزاممِ ما التزمه . أي مُوجب التحلل من يمينه .وعند أبي حنيفة : هي ما شرعه الله من الخروج من الأيمان بالكفارات وإن كان النبي صلى الله عليه وسلم صدر منه يمين عند ذلك على أن لا يعود فتحِلَّة اليمين هي الكفارة عند الجميع .وجملة { والله مولاكم } تذييل لجملة { قد فرض الله لكم تحلة أيمانكم } . والمولى : الولي ، وهو الناصر ومتولي تدبير ما أضيف إليه ، وهو هنا كناية عن الرؤوف والميسّر ، كقوله تعالى : { يريد الله بكم اليسر ولا يريد بكم العسر } [ البقرة : 185 ] .وعطف عليها جملة { وهو العليم الحكيم } أي العليم بما يصلحكم فيحملكم على الصواب والرشد والسداد وهو الحكيم فيما يشرعه ، أي يجري أحكامه على الحكمة . وهي إعطاء الأفْعال ما تقتضيه حقائقها دون الأوهام والتخيلات .واختلف فقهاء الإِسلام فيمن حرّم على نفسه شيئاً مما أحل الله له على أقوال كثيرة أنهاها القرطبي إلى ثمانية عشر قولاً وبعضها متداخل في بعض باختلاف الشروط والنيات فتؤول إلى سبعة .أحدها : لا يلزمه شيء سواء كان المحرَّم زوجاً أو غيرها . وهو قول الشعبي ومسروق وربيعة من التابعين وقاله أصبغ بن الفرج من أصحاب مالك .الثاني : تجب كفارة مثل كفارة اليمين . وروي عن أبي بكر وعمر وابن مسعود وابن عباس وعائشة وسعيد بن جبير ، وبه قال الأوزاعي والشافعي في أحد قوليه . وهذا جار على ظاهر الآية من قوله : { قد فرض الله لكم تحلة أيمانكم } .الثالث : لا يلزمه في غير الزوجة وأما الزوجة فقيل : إن كان دخل بها كان التحريم ثلاثاً ، وإن لم يدخل بها ينوّ فيما أراد وهو قول الحسن والحكم ومالك في المشهور . وقيل هي ثلاث تطليقات دخل بها أم لم يدخل . ونسب إلى علي بن أبي طالب وزيد بن ثابت وأبي هريرة . وقاله ابن أبي ليلى وهو عند عبد الملك بن الماجشون في «المبسوط» . وقيل طلقة بائنة . ونسب إلى زيد بن ثابت وحماد بن سليمان ونسبه ابن خُويز منداد إلى مالك وهو غير المشهور عنه . وقيل : طلقة رجعية في الزوجة مطلقاً ، ونسب إلى عمر بن الخطاب فيكون قيداً لما روي عنه في القول الثاني . وقاله الزهري وعبد العزيز بن أبي سلمة وابن الماجشون ، وقال الشافعي يعني في أحد قوليه : إن نوى الطلاق فعليه ما نوى من أعداده وإلا فَهي واحدة رجعية . وقيل : هي ثلاث في المدخول بها وواحدة في التي لم يدخل بها دون تنوية .الرابع : قال أبو حنيفة وأصحابه إن نوى بالحرام الظهار كان ما نوى فإن نوى الطلاق فواحدة بائنة إلا أن يكون نوى الثلاث . وإن لم ينو شيئاً كانت يميناً وعليه كفارة فإنْ أباها كان مولياً .وتحريم النبي صلى الله عليه وسلم سريته مارية على نفسه هو أيضاً من قبيل تحريم أحد شيئاً مما أحلّ الله له غير الزوجة لأن مارية لم تكن زوجة له بل هي مملوكته فحكم قوله : { قد فرض الله لكم تحلة أيمانكم } جار في قضية تحريم مارية بيمين أو بغير يمين بلا فرق . و { تحلة } تفعِلة مِن حلَّل جعل الفعل حلالاً . وأصله تَحْلِلة فأدغم اللامان وهو مصدر سماعي لأن الهاء في آخره ليست بقياس إذ لم يحذف منه حرف حتى يعوض عنه الهاء مثل تزكية ولكنه كثير في الكلام مثل تعلة .\n","ar.waseet":"ثم بين - سبحانه - جانبا من مظاهر رحمته فقال : ( قَدْ فَرَضَ الله لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ) .وقوله ( فَرَضَ ) هنا بمعنى شرع ، والتحلة : مصدر بمعنى التحليل ، والمراد بها الكفارة ، وهى مصدر حلّل كالتكرمة مصدر كرْم ، من الحل الذى هو ضد العقد .أى : قد شرع الله - تعالى - لكم تحليل الإيمان التى عقد تموها ، عن طريق الكفارة ، لأن اليمين إذا كانت فى أمر لا يحبه الله - تعالى - فالعدول عنها أولى وأفضل .وفى الحديث الشريف يقول - صلى الله عليه وسلم - \" إنى والله لا أحلف على يمين فأرى غيرها خيرا منها إلا كفرت عن يمينى وفعلت الذى هو خير \" .وقد اختلف العلماء فى التحريم الذى كن من النبى - صلى الله عليه وسلم - أكان بيمين أم لا .وظاهر الآية يؤيد القول بالإيجاب لقوله - تعالى - : ( قَدْ فَرَضَ الله لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ) لأن هذه الجملة الكريمة تشعر بأن هناك يمينا تحتاج إلى كفارة .وقد جاء فى بعض الروايات الصحيحة أنه قال : \" بل شربت عسلا عند زينب بنت جحش ، فلن أعود له ، وقد حلفت . لا تخبرى بذلك أحدا . . \" .قال الآلوسى ما ملخصه : واختلفوا هل كفر النبى - صلى الله عليه وسلم - عن يمينه هذه أولا؟فعن الحسن أنه - صلى الله عليه وسلم - لم يكفر لأنه كان مغفورا له ما تقدم من ذنبه وما تأخر ، وإنما هو تعليم للمؤمنين .وعن مقاتل : أنه - صلى الله عليه وسلم - أعتق رقبة . . . ونقل مالك عن زيد بن أسلم أنه - صلى الله عليه وسلم - أعطى الكفارة .وقوله - سبحانه - : ( والله مَوْلاَكُمْ ) أى : وهو - سبحانه - سيدكم ومتولى أموركم وناصركم . وهو - تعالى - : ( العليم الحكيم ) أى : العليم بجميع أحوالكم وشئونكم ، الحكيم فى كل أقواله وأفعاله وتدبير شئون عباده .\n","ar.baghawi":"( قد فرض الله لكم تحلة أيمانكم ) أي بين وأوجب أن تكفروها إذا حنثتم وهي ما ذكر في سورة المائدة ( والله مولاكم ) وليكم وناصركم ( وهو العليم الحكيم )واختلف أهل العلم في لفظ التحريم ، فقال قوم : ليس هو بيمين ، فإن قال لزوجته : أنت علي حرام ، أو حرمتك ، فإن نوى به طلاقا فهو طلاق ، وإن نوى به ظهارا فظهار . وإن نوى تحريم ذاتها أو أطلق فعليه كفارة اليمين بنفس اللفظ . وإن قال ذلك لجاريته فإن نوى عتقا عتقت ، وإن نوى تحريم ذاتها أو أطلق فعليه كفارة اليمين ، وإن قال لطعام : حرمته على نفسي فلا شيء عليه ، وهذا قول ابن مسعود وإليه ذهب الشافعي .وذهب جماعة إلى أنه يمين ، فإن قال ذلك لزوجته أو جاريته فلا تجب عليه الكفارة ما لم يقربها كما لو حلف أن لا يطأها . وإن حرم طعاما فهو كما لو حلف أن لا يأكله ، فلا كفارة عليه ما لم يأكل ، يروى ذلك عن أبي بكر وعائشة وبه قال الأوزاعي وأبو حنيفة رضي الله عنه :أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا معاذ بن فضالة ، حدثنا هشام عن يحيى ، عن ابن حكيم ، وهو يعلى بن حكيم ، عن سعيد بن جبير ، عن ابن عباس رضي الله عنهما قال في الحرام : يكفر . وقال ابن عباس : \" لقد كان لكم في رسول الله أسوة حسنة \" ( الأحزاب - 21 ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5231.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5231.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5231.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَنْ بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنْبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ","transliteration":"Wa iz asarran nabiyyu ilaa ba'di azwaajihee hadeesan falammaa nabba at bihee wa azharahul laahu 'alaihi 'arrafa ba'dahoo wa a'rada 'am ba'din falammaa nabba ahaa bihee qaalat man amba aka haaza qaala nabba aniyal 'aleemul khabeer","translations":{"en.ahmedali":"When the Prophet told one of his wives something in confidence and she disclosed it, God revealed this to him. So he made some of it known to her, and held back some. When, however, he informed her about it, she asked: \"Who told you this?\" He said: \"I was told this by the All-knowing, All-Informed.\"","en.ahmedraza":"And when the Holy Prophet confided a matter to one of his wives; so when she disclosed it and Allah conveyed this to the Holy Prophet, he told her part of it and held back a part; so when the Holy Prophet informed her about it, she said, “Who informed you?”; he said, “The All Knowing, the All Aware has informed me.”","en.arberry":"And when the Prophet confided to one of his wives a certain matter; and then, when she told of it, and God disclosed that to him, he made known part of it, and turned aside from part; then, when he told her of it, she said, 'Who told thee this?' He said, 'I was told of it by the All-knowing, the All-aware.'","en.asad":"And lo! [It so happened that] the Prophet told something in confidence to one of his wives; and when she thereupon divulged it, and God made this known to him, he acquainted [others] with some of it and passed over some of it. And as soon as he let her know it, she asked, \"Who has told thee this?\" - [to which] he replied, \"The All-Knowing, the All-Aware has told me.\"","en.daryabadi":"And recall what time the Prophet confided a story Unto one of his spouses, then she disclosed it, and Allah apprised him thereof, he made known part thereof and Withheld part. Then, when he had apprised her of it, she said: who hath acquainted thee therewith! He said the Knower, the Aware hath acquainted me.","en.hilali":"And (remember) when the Prophet (SAW) disclosed a matter in confidence to one of his wives (Hafsah), so when she told it (to another i.e. 'Aishah), and Allah made it known to him, he informed part thereof and left a part. Then when he told her (Hafsah) thereof, she said: \"Who told you this?\" He said: \"The All-Knower, the All-Aware (Allah) has told me\".","en.pickthall":"When the Prophet confided a fact unto one of his wives and when she afterward divulged it and Allah apprised him thereof, he made known (to her) part thereof and passed over part. And when he told it her she said: Who hath told thee? He said: The Knower, the Aware hath told me.","en.qaribullah":"The Prophet confided a certain matter to one of his wives but thereafter she disclosed it, then Allah revealed what she had done to him. He made part of it known and another part not. And when he acquainted her with it, she said: 'Who has told you this' He replied: 'I was told of it by the Knower, the Aware'","en.sahih":"And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\"","en.sarwar":"The Prophet told a secret to one of his wives telling her not to mention it to anyone else. When she divulged it, God informed His Prophet about this. The Prophet told his wife part of the information which he had received from God and ignored the rest. Then she asked, \"Who informed you about this?\" He replied, \"The All-aware and All-knowing one has told me\".","en.yusufali":"When the Prophet disclosed a matter in confidence to one of his consorts, and she then divulged it (to another), and Allah made it known to him, he confirmed part thereof and repudiated a part. Then when he told her thereof, she said, \"Who told thee this? \"He said, \"He told me Who knows and is well-acquainted (with all things).\"","en.maududi":"The Prophet confided something to one of his wives and then she disclosed it (to another); so after Allah revealed to the Prophet (that she had disclosed that secret), he made a part of it known to her and passed over a part of it. And when he told her about this (i.e., that she had disclosed the secret entrusted to her), she asked: “Who informed you of this?” He said: “I was told of it by He Who is All-Knowing, All-Aware.”","en.shakir":"And when the prophet secretly communicated a piece of information to one of his wives-- but when she informed (others) of it, and Allah made him to know it, he made known part of it and avoided part; so when he informed her of it, she said: Who informed you of this? He said: The Knowing, the one Aware, informed me.","en.itani":"The Prophet told something in confidence to one of his wives. But when she disclosed it, and God made it known to him; he communicated part of it, and he avoided another part. Then, when he informed her of it, she said, “Who informed you of this?” He said, “The All-Knowing, the All-Informed, informed me.”","en.mubarakpuri":"And (remember) when the Prophet disclosed a matter in confidence to one of his wives, then she told it. And Allah made it known to him; he informed part thereof and left a part. Then when he told her thereof, she said: \"Who told you this\" He said: \"The All-Knower, the All-Aware has told me.\"","en.qarai":"When the Prophet confided a matter to one of his wives, but when she divulged it [instead of guarding the secret] and Allah apprised him about it, he acquainted [her] with part of the matter and ignored part of it. So when he told her about it, she said, ‘Who informed you about it?’ He said, ‘The All-knowing and the All-aware has informed me.’","en.wahiduddin":"The Prophet once told one of his wives something in confidence. She did not keep it secret and God informed him of this; he made known a part of it, and avoided [mentioning] part of it. When he spoke to his wife of this, she asked him who had told him about it. He replied, \"The All Knowing, the All Aware One.\""},"tafsir":{"ar.muyassar":"وإذ أسرَّ النبي إلى زوجته حفصة - رضي الله عنها- حديثا، فلما أخبرت به عائشة رضي الله عنها، وأطلعه الله على إفشائها سرَّه، أعلم حفصة بعض ما أخبرت به، وأعرض عن إعلامها بعضه تكرما، فلما أخبرها بما أفشت من الحديث، قالت: مَن أخبرك بهذا؟ قال: أخبرني به الله العليم الخبير، الذي لا تخفى عليه خافية.","ar.jalalayn":"«و» اذكر «إذ أسرَّ النبي إلى بعض أزواجه» هي حفصة «حديثا» هو تحريم مارية وقال لها لا تفشيه «فلما نبأت به» عائشة ظنا منها أن لا حرج في ذلك «وأظهره الله» أطلعه «عليه» على المنبأ به «عرَّف بعضه» لحفصة «وأعرض عن بعض» تكرما منه «فلما نبأها به قالت من أنبأك هذا قال نبأني العليم الخبير» أي الله.","ar.qurtubi":"قوله تعالى : وإذ أسر النبي إلى بعض أزواجه حديثا فلما نبأت به وأظهره الله عليه عرف بعضه وأعرض عن بعض فلما نبأها به قالت من أنبأك هذا قال نبأني العليم الخبيرقوله تعالى : وإذ أسر النبي إلى بعض أزواجه حديثا أي واذكر إذ أسر النبي إلى حفصة حديثا يعني تحريم مارية على نفسه واستكتامه إياها ذلك . وقال الكلبي : أسر إليها أن أباك وأبا عائشة يكونان خليفتي على أمتي من بعدي ; وقاله ابن عباس . قال : أسر أمر الخلافة بعده إلى حفصة فذكرته حفصة . روى الدارقطني في سننه عن الكلبي عن أبي صالح عن ابن عباس في قوله تعالى : وإذ أسر النبي إلى بعض أزواجه حديثا قال : اطلعت حفصة على النبي صلى الله عليه وسلم مع أم إبراهيم فقال : \" لا تخبري عائشة \" وقال لها : \" إن أباك وأباها سيملكان أو سيليان بعدي فلا تخبري عائشة \" قال : فانطلقت حفصة فأخبرت عائشة فأظهره الله عليه ، فعرف بعضه وأعرض عن بعض . قال أعرض عن قوله : \" إن أباك وأباها يكونان بعدي \" . كره رسول الله صلى الله عليه وسلم أن ينشر ذلك في الناس .فلما نبأت به أي أخبرت به عائشة لمصافاة [ ص: 173 ] كانت بينهما ، وكانتا متظاهرتين على نساء النبي صلى الله عليه وسلم .وأظهره الله عليه أي أطلعه الله على أنها قد نبأت به . وقرأ طلحة بن مصرف \" فلما أنبأت \" وهما لغتان : أنبأ ونبأ .ومعنى عرف بعضه وأعرض عن بعض عرف حفصة بعض ما أوحي إليه من أنها أخبرت عائشة بما نهاها عن أن تخبرها ، وأعرض عن بعض تكرما ; قاله السدي . وقال الحسن : ما استقصى كريم قط ، قال الله تعالى : عرف بعضه وأعرض عن بعض . وقال مقاتل : يعني أخبرها ببعض ما قالت لعائشة ، وهو حديث أم ولده ولم يخبرها ببعض وهو قول حفصة لعائشة : إن أبا بكر وعمر سيملكان بعده . وقراءة العامة عرف مشددا ، ومعناه ما ذكرناه . واختاره أبو عبيد وأبو حاتم ، يدل عليه قوله تعالى : وأعرض عن بعض أي لم يعرفها إياه . ولو كانت مخففة لقال في ضده وأنكر بعضا . وقرأ علي وطلحة بن مصرف وأبو عبد الرحمن السلمي والحسن وقتادة والكلبي والكسائي والأعمش عن أبي بكر \" عرف \" مخففة . قال عطاء : كان أبو عبد الرحمن السلمي إذا قرأ عليه الرجل عرف مشددة حصبه بالحجارة . قال الفراء : وتأويل قوله عز وجل : \" عرف بعضه \" بالتخفيف ، أي غضب فيه وجازى عليه ; وهو كقولك لمن أساء إليك : لأعرفن لك ما فعلت ، أي لأجازينك عليه . وجازاها النبي صلى الله عليه وسلم بأن طلقها طلقة واحدة . فقال عمر : لو كان في آل الخطاب خير لما كان رسول الله صلى الله عليه وسلم طلقك . فأمره جبريل بمراجعتها وشفع فيها . واعتزل النبي صلى الله عليه وسلم نساءه شهرا ، وقعد في مشربة مارية أم إبراهيم حتى نزلت آية التحريم على ما تقدم . وقيل : هم بطلاقها حتى قال له جبريل : \" لا تطلقها فإنها صوامة قوامة ، وإنها من نسائك في الجنة \" فلم يطلقها .فلما نبأها به أي أخبر حفصة بما أظهره الله عليه .قالت من أنبأك هذا يا رسول الله عني . فظنت أن عائشة أخبرته ، فقال عليه السلام :نبأني العليم الخبير أي الذي لا يخفى عليه شيء . وهذا سد مسد مفعولي \" أنبأ \" . و \" نبأ \" الأول تعدى إلى مفعولين ، و \" نبأ \" الثاني تعدى إلى مفعول واحد ، لأن نبأ وأنبأ إذا لم يدخلا على المبتدأ والخبر جاز أن يكتفى فيهما بمفعول واحد وبمفعولين ، فإذا دخلا على الابتداء والخبر تعدى كل واحد منهما إلى ثلاثة مفاعيل . ولم يجز الاقتصار على الاثنين دون الثالث ، لأن الثالث هو خبر المبتدأ في الأصل فلا يقتصر دونه ، كما لا يقتصر على المبتدأ دون الخبر .\n","ar.miqbas":"وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَنْ بَعْضٍ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنْبَأَكَ هَذَا قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ (3)هذا تذكير وموعظة بما جرى في خلال تينك الحادثتين ثني إليه عنان الكلام بعد أن قضي ما يهم من التشريع للنبيء صلى الله عليه وسلم بما حرّم على نفسه من جرَّائهما .وهو معطوف على جملة { يأيها النبي لم تحرم ما أحل الله لك } [ التحريم : 1 ] بتقدير واذكر .وقد أعيد ما دلت عليه الآية السابقة ضمناً بما تضمنته هذه الآية بأسلوب آخر ليبن عليه ما فيه من عبر ومواعظ وأدب ، ومكارم وتنبيه وتحذير .فاشتملت هذه الآيات على عشرين معنى من معاني ذلك . إحداها ما تضمنه قوله : { إلى بعض أزواجه } .الثاني : قوله : { فلما نبأت به } .والثالث : { وأظهره الله عليه } .الرابع : { عرف بعضه } .الخامس : { وأعرض عن بعض } .السادس : { قالت من أنبأك هذا } .السابع : { قال نبأني العليم الخبير } .الثامن والتاسع والعاشر : { إن تتوبا إلى الله إلى فإن الله هو مولاه } [ التحريم : 4 ] .الحادي عشر والثاني عشر والثالث عشر : { وجبريل وصالح المؤمنين والملائكة } [ التحريم : 4 ] .الرابع عشر والخامس عشر : { عسى ربه إن طلقكن أن يبدله أزواجاً } [ التحريم : 5 ] .السادس عشر : { خيراً منكن } [ التحريم : 5 ] .( السابع عشر : { مسلمات } [ التحريم : 5 ] إلخ .الثامن عشر : { سائحات } [ التحريم : 5 ] .التاسع عشر : { ثيبات وأبكاراً } [ التحريم : 5 ] ، وسيأتي بيانها عند تفسير كل آية منها .العشرون : ما في ذكر حفصة أو غيرها بعنوان { بعض أزواجه } دون تسميته من الاكتفاء في الملام بذكر ما تستشعِر به أنها المقصودة باللوم .وإنما نبّأها النبي صلى الله عليه وسلم بأنه علم إفشاءها الحديث بأمر من الله ليبني عليه الموعظة والتأديب فإن الله ما أطلعه على إفشائها إلا لغرض جليل .والحديث هو ما حصل من اختلاء النبي صلى الله عليه وسلم بجاريته مارية وما دار بينه وبين حفصة وقوله لحفصة : «هي عليّ حرام ولا تخبري عائشة» وكانتا متصافيتين وأطلع الله نبيئه صلى الله عليه وسلم على أن حفصة أخبرت عائشة بما أسرّ إليها .والواو عاطفة قصة على قصة لأن قصة إفشاء حفصة السرّ غير قصة تحريم النبي صلى الله عليه وسلم على نفسه بعض ما أحلّ له .ولم يختلف أهل العلم في أن التي أسر إليها النبي صلى الله عليه وسلم الحديث هي حفصة ويأتي أن التي نَبأتْها حفصة هي عائشة . وفي «الصحيح» عن ابن عباس قال : مكثت سنة وأنا أريد أن أسأل عمر بن الخطاب عن آية فما أستطيع أن أسأله هيبة له حتى خرج حاجاً فخرجت معه فلما رجع ببعض الطريق قلت : يا أمير المؤمنين مَن اللتان تظاهرتا على رسول الله من أزواجه؟ فقال : تلك حفصة وعائشة وساق القصة بطولها .وأصل إطلاق الحديث على الكلام مجاز لأنه مشتق من الحدثان فالذي حدث هو الفعل ونحوه ثم شاع حتى صار حقيقة في الخبر عنه وصار إطلاقه على الحادثة هو المجاز فانقلب حال وضعه واستعماله .و { أسر } أخبر بما يراد كتمانه عن غير المخبر أو سأله عدم إفشاء شيء وقع بينهما وإن لم يكن إخباراً وذلك إذا كان الخبر أو الفعل يراد عدم فشوّه فيقوله صاحبه سرّاً والسرّ ضد الجهر ، قال تعالى : { ويعلم ما تسرون وما تعلنون } [ التغابن : 4 ] فصار { أسر } يطلق بمعنى الوصاية بعدم الإِفشاء ، أي عدم الإِظهار قال تعالى : { فأسرها يوسف في نفسه ولم يبدها لهم } [ يوسف : 77 ] .و { أسر } : فعل مشتق من السرّ فإن الهمزة فيه للجعل ، أي جعله ذا سرّ ، يقال : أسرّ في نفسه ، إذا كتم سرّه . ويقال : أسرّ إليه ، إذا حدثه بسرّ فكأنه أنهاه إليه ، ويقال : أسرّ له إذا أسرّ أمراً لأجله ، وذلك في إضمار الشر غالباً وأسرّ بكذا ، أي أخبر بخبر سرّ ، وأسرّ ، إذا وضع شيئاً خفياً . وفي المثَل «يُسِرّ حَسْواً في ارتغاء» .و { بعض أزواجه } هي حفصة بنت عمر بن الخطاب . وعدل عن ذكر اسمها ترفعاً عن أن يكون القصد معرفة الأعيان وإنما المراد العلم بمغزى القصة وما فيها مما يجتنب مثله أو يقتدى به . وكذلك طي تعيين المنبَّأة بالحديث وهي عائشة .وذكرت حفصة بعنوان بعض أزواجه للإِشارة إلى أن النبي صلى الله عليه وسلم وضع سِرّه في موضعه لأن أولى الناس بمعرفة سرّ الرجل زوجهُ . وفي ذلك تعريض بملامها على إفشاء سرّه لأن واجب المرأة أن تحفظ سرّ زوجها إذا أمرها بحفظه أو كان مثله مما يجب حفظه .وهذا المعنى الأول من المعاني التهذيبية التي ذكرناها آنفاً .ونبَّأ : بالتضعيف مرادف أنبأ بالهمز ومعناهما : أخبر ، وقد جمعهما قوله : { فلما نبأها به قالت من أنبأك هذا قال نبأني العليم الخبير } .وقد قيل : السرّ أمانة ، أي وإفشاؤه خيانة .وفي حديث أم زرع من آدابهم العربية القديمة قالت الحادية عشرة : «جَارية أبي زرع فَما جارية أبي زرع لا تَبث حديثنا تبثيثاً ولا تنفث ميرثنا تنفيثاً» .وكلام الحكماء والشعراء في السرّ وحفظه أكثر من أن يحصى . وهو المعنى الثاني من المعاني التهذيبية التي ذكرناها .ومعنى و { وأظهره الله عليه } أطلعه عليه وهو مشتق من الظهور بمعنى التغلب .استعير الإِظهار إلى الإِطْلاَع لأن إطلاع الله نبيئه صلى الله عليه وسلم على السرّ الذي بين حفصة وعائشة كان غلبةً له عليهما فيما دبرتاه فشبهت الحالة الخاصة من تآمر حفصة وعائشة على معرفة سرّ النبي صلى الله عليه وسلم ومن علمه بذلك بحال من يغالب غيره فيغلبه الغير ويكشف أمره فالإِظهار هنا من الظهور بمعنى الانتصار . وليس هو من الظهور ضد الخفاء ، لأنه لا يتعدى بحرف ( على ) .وضمير { عليه } عائد إلى الإِنباء المأخوذ من { نبأت به } أو على الحديث بتقدير مضاف يدل عليه قوله : { نبأت به } تقديره : أظهره الله على إفشائه .وهذا تنبيه إلى عناية الله برسوله صلى الله عليه وسلم وانتصاره له لأن إطلاعه على ما لا علم له به مما يهمه ، عناية ونصح له .وهذا حاصل المعنى الثالث من المعاني التي اشتملت عليها الآيات وذكرناها آنفاً .ومعفول { عرف } الأولُ محذوف لدلالة الكلام عليه ، أي عرفها بعضه ، أي بعض ما أطْلعه الله عليه ، وأعرض عن تعريفها ببعضه . والحديث يحتوي على أشياء : اختلاء النبي بسريته مارية ، وتحريمها على نفسه ، وتناوله العسل في بيت زينب ، وتحريمه العودة إلى مثل ذلك ، وربّما قد تخلل ذلك كلام في وصف عثور حفصة على ذلك بغتة ، أو في التطاول بأنها استطاعت أن تريحهن من ميله إلى مارية . وإنما عرّفها النبي صلى الله عليه وسلم بذلك ليوقفها على مخالفتها واجب الأدب من حفظ سرّ زوجها .وهذا هو المعنى الرابع من المعاني التي سبقت إشارتي إليها .وإعراض الرسول صلى الله عليه وسلم عن تعريف زوجه ببعض الحديث الذي أفشته من كرم خلقه صلى الله عليه وسلم في معاتبة المفشية وتأديبها إذ يحصل المقصود بأن يعلم بعضَ ما أفشته فتوقن أن الله يغار عليه .قال سفيان : ما زَال التغافل من فعل الكرام ، وقال الحسن : ما استقصى كريمٌ قط ، وما زاد على المقصود بقلب العتاب من عتاب إلى تقريع .وهذا المعنى الخامس من مقاصد ذكر هذا الحديث كما أشرنا إليه آنفاً .وقولها : { من أنبأك هذا } يدل على ثقتها بأن عائشة لا تفشي سرّها وعلمت أنه لا قبل للرسول صلى الله عليه وسلم بعلم ذلك إلا من قبل عائشة أو من طريق الوحي فرامت التحقق من أحد الاحتمالين .والاستفهام حقيقي ولك أن تجعله للتعجب من علمه بذلك .وفي هذا كفاية من تيقظها بأن إفشاءها سرّ زوجها زَلة خُلقية عظيمة حجبها عن مراعاتها شدة الصفاء لعائشة وفرط إعجابها بتحريم مارية لأجلها ، فلم تتمالك عن أن تبشر به خليلتها ونصيرتها ولو تذكرت لتبين لها أن مقتضى كتم سرّ زوجها أقوى من مقتضى إعلامها خليلتها فإن أواصر الزوجية أقوى من أواصر الخلة وواجب الإِخلاص لرسول الله أعلى من فضيلة الإِخلاص للخلائل .وهذا هو الأدب السادس من معاني الآداب التي اشتملت عليها القصة وأجملنا ذكرها آنفاً .وإيثار وصفي { العليم الخبير } هنا دون الاسم العَلَم لما فيهما من التذكير بما يجب أن يعلمه الناس من إحاطة الله تعالى علماً وخُبْراً بكل شيء .و { العليم } : القوي العلم وهو في أسمائه تعالى دالّ على أكمل العلم ، أي العلم المحيط بكل معلوم .و { الخبير } : أخص من العليم لأنه مشتق من خبر الشيء إذا أحاط بمعانيه ودخائله ولذلك يُقال خبرته ، أي بلوته وتطلعتُ بواطن أمره ، قال ابن بُرَّجان ( بضم الموحدة وبجيم مشددة ) في «شرح الأسماء» : «الفرق بين الخُبر والعلم وسائر الأشياء الدالة على صفة العلم أن تتعرف حصول الفائدة من وجه وأضِف ذلك إلى تلك الصفة وسَم الفائدة بذلك الوجه الذي عنه حَصَلَتْ فمتى حصلت من موضع الحُضور سميت مشاهدة والمتصف بها هو الشاهد والشهيد .وكذلك إن حصلت من وجه سمع أو بصر فالمتصف بها سميع وبصير . وكذلك إن حصَلت من عِلْم أو علامة فهو العلم والمتصف به العالم والعليم ، وإن حصلت عن استكشاف ظاهر المخبُور عن باطنه بِبَلوى أو امتحان أو تجربة أو تبليغ فهو الخبْر . والمسمّى به الخبير» اه . وقال الغزالي في «المقصد الأسنى» : «العلم إذا أضيف إلى الخفايا الباطنة سمي خِبرة وسمي صاحبها خبيراً اه» .فيتضح أن أتباع وصف { العليم } بوصف { الخبير } إيماء إلى أن الله علم دخيلة المخاطبة وما قصدته من إفشاء السرّ للأخرى .وقد حصل من هذا الجواب تعليمها بأن الله يطلع رسول صلى الله عليه وسلم على ما غاب إن شاء قال تعالى : { عالم الغيب فلا يظهر على غيبه أحداً إلا من ارتضى من رسول } [ الجن : 26 ، 27 ] وتنبيهاً على ما أبطنته من الأمر .وهو الأدب السابع من آداب هذه الآيات .واعلم أن نبّأ وأنبأ مُترادفان وهما بمعنى أخبر وأن حقهما التعدية إلى مفعول واحد لأجل ما فيهما من همزة تعدية أو تضعيف . وإن كان لم يسمع فعل مجرد لهما وهو مما أميت في كلامهم استغناء بفعل علم . والأكثر أن يتعديا إلى ما زاد على المفعول بحرف جر نحو : نَبأتُ به . وقد يحذف حرف الجر فيعدّيان إلى مفعولين ، كقوله هنا : { من أنبأك هذا } أي بهذا ، وقول الفرزدق: ... نبئت عبد الله بالجو أصبحتكراماً مواليها لآماً ما صميمها ... حمله سيبويه على حذف الحرف .وقد يضمنان معنى : اعلم ، فيعديان إلى ثلاثة مفاعيل كقول النابغة: ... نبئت زرعة والسفاهة كاسمهايهدي إليّ غرائب الأشعار ... ولكثرة هذا الاستعمال ظن أنه معنى لهما وأغفل التضمين فنسب إلحاقهما ب ( اعلم ) إلى سيبويه والفارسي والجرجاني وألْحَق الفراء خبّر وأخبر ، وألحق الكوفيون حدَّث .قال زكريا الأنصاري : لم تسمع تعديتها إلى ثلاثة في كلام العرب إلا إذا كانت مبنية إلى المجهول .وقرأ الجمهور { عرف } بالتشديد . وقرأه الكسائي { عَرَف } بتخفيف الراء ، أي علم بعضه وذلك كناية عن المجازاة ، أي جازى عن بعضه التي أفشته باللوم أو بالطلاق على رواية أن رسول الله صلى الله عليه وسلم طلق حفصة ولم يصح وقد يكنى عن التوعد بفعل العلم . ونحوه كقوله تعالى : { أولئك الذين يعلم الله ما في قلوبهم } [ النساء : 63 ] . وقول العرب للمسيء : لأعرفن لك هذا . وقولك : لقد عرفت ما صنعت .\n","ar.waseet":"والظرف فى قوله - تعالى - ( وَإِذَ أَسَرَّ النبي إلى بَعْضِ أَزْوَاجِهِ حَدِيثاً ) متعلق بمحذوف تقديره اذكر ، وقوله : ( أَسَرَّ ) من الإسرار بالشىء بمعنى كتمانه وعدم إشاعته .والمراد ببعض أزواجه : حفصة - رضى الله عنها - .والمراد بالحديث قوله لها - كما جاء فى بعض الروايات - : \" بل شربت عسلا عند زينب ، ولن أعود ، وقد حلفت فلا تخبرى بذلك أحدا . . \" .أو قوله لها فى شأن مارية : \" إنى قد حرمتها على نفسى ، فاكتمى ذلك فأخبرت بذلك عائشة \" .أى : واذكر - أيها العاقل لتعتتبر وتتعظ - وقت أن أسر النبى - صلى الله عليه وسلم - إلى زوجه حفصة حديثا ، يتعلق بشربه العسل فى بيت زينب بنت جحش ، وقوله - صلى الله عليه وسلم - لحفصة لا تخبرى بذلك أحدا \" .( فَلَمَّا نَبَّأَتْ بِهِ ) أى : فلما أخبرت حفصة عائشة بهذا الحديث الذى أمرت بكتمانه ( وَأَظْهَرَهُ الله عَلَيْهِ ) أى : وأطلع الله - تعالى - نبيه - صلى الله عليه وسلم - على ما قالته حفصة لعائشة .فالمراد بالإظهار : الاطلاع ، وهو مشتق من الظهور بمعنى التغلب .وعبر بالإظهار عن الاطلاع ، لأن حفصة وعائشة كانتا حريصتين على عدم معرفة ما دار بينهما فى هذا الشأن ، فلما أطلع الله - تعالى - نبيه على ذلك كانتا بمنزلة من غلبتا على أمرهما .وقوله - سبحانه - : ( عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَن بَعْضٍ ) بيان للمسلك السامى الذى سلكه - صلى الله عليه وسلم - فى معاتبته لحفصة على إفشائها لما أمرها أن تكتمه والمفعول الأول لعرف محذوف أى : عرفها بعضه .أى : فحين خاطب - صلى الله عليه وسلم - حفصة فى شأن الحديث الذى أفشته ، اكتفى بالإشارة إلى جانب منه ، ولم يذكر لها تفاصيل ما قاله لها سابقا .لسمو أخلاقه - صلى الله عليه وسلم - إذ فى ذكر التفاصيل مزيد من الخجل والإحراج لها .قال بعضهم : ما زال التغافل من فعل الكرام وما استقصى كريم قط وقال الشاعر :ليس الغبى بسيد فى قومه ... لكن سيد قومه المتغابىوإنما عرفها - صلى الله عليه وسلم - ببعض الحديث ، ليوقفها على خطئها وعلى أنه كان من الواجب عليها أن تحفظ سره - صلى الله عليه وسلم - .قالوا : ولعل حفصة رضى الله عنها - قد فعلت ذلك ، ظنا منها أنه لا حرج فى إخبار عائشة بذلك ، أو أنها اجتهدت فأخطأت ، ثم تابت وندمت على خطئها .ثم حكى - سبحانه - ما قالته حفصة للرسول - صلى الله عليه وسلم - وما رد به عليها فقال : ( فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنبَأَكَ هذا قَالَ نَبَّأَنِيَ العليم الخبير ) .أى : فلما سمعت من الرسول - صلى الله عليه وسلم - ما يدل على أنه قد أطلع على ما قالته لعائشة ، قالت له : من أخبرك بما دار بينى وبينها؟ فأجابها - صلى الله عليه وسلم - بقوله : أخبرنى بذلك الله - تعالى - العليم بجميع أحوال عباده وتصرفاتهم . . الخبير بما تكنه الصدور ، وبما يدور فى النفوس من هواجس وخواطر .وإنما قالت له - صلى الله عليه وسلم - : ( مَنْ أَنبَأَكَ هذا ) لتتأكد من أن عائشة لم تخبره - صلى الله عليه وسلم - بما دار بينهما فى هذا الشأن . . . فلما قالت لها - صلى الله عليه وسلم - : ( نَبَّأَنِيَ العليم الخبير ) تحقق ظنها فى كتمان عائشة لما قالته لها ، وتيقنت أن الذى أخبره بذلك هو الله - عز موجل - .وفى تذلل الآية الكريمة بقوله : ( العليم الخبير ) إشارة حكيمة وتنبيه بليغ ، إلى أن من الواجب على كل عاقل ، أن يكون ملتزما لكتمان الأسرار التى يؤتمن عليها ، وأن إذاعتها - ولو فى أضيق الحدود - لا تخفى على الله - عز وجل - لأنه - سبحانه - عليم بكل معلوم ، ومحيطب بخبايا النفوس وخلجاتها .\n","ar.baghawi":"( وإذ أسر النبي إلى بعض أزواجه حديثا ) وهو تحريم فتاته على نفسه ، وقوله لحفصة : لا تخبري بذلك أحدا .وقال سعيد بن جبير عن ابن عباس : أسر أمر الخلافة بعده فحدثت به حفصة . قال الكلبي : أسر إليها أن أباك وأبا عائشة يكونان خليفتين على أمتي من بعدي . وقال ميمون بن مهران : أسر أن أبا بكر خليفتي من بعدي .( فلما نبأت به ) أخبرت به حفصة عائشة ( وأظهره الله عليه ) أي أطلع الله تعالى نبيه على أنها أنبأت به ( عرف بعضه ) قرأ عبد الرحمن السلمي والكسائي : \" عرف \" بتخفيف الراء ، أي : عرف بعض الفعل الذي فعلته من إفشاء سره ، أي : غضب من ذلك عليها وجازاها به ، من قول القائل لمن أساء إليه : لأعرفن لك ما فعلت ، أي : لأجازينك عليه ، وجازاها به عليه بأن طلقها فلما بلغ ذلك عمر قال : لو كان في آل الخطاب خير لما طلقك رسول الله - صلى الله عليه وسلم - . فجاء جبريل وأمره بمراجعتها واعتزل رسول الله - صلى الله عليه وسلم - نساءه شهرا وقعد في مشربة أم إبراهيم مارية ، حتى نزلت آية التخيير .وقال مقاتل بن حيان : لم يطلق رسول الله - صلى الله عليه وسلم - حفصة وإنما هم بطلاقها فأتاه جبريل عليه السلام ، وقال : لا تطلقها فإنها صوامة قوامة وإنها من نسائك في الجنة ، فلم يطلقها .وقرأ الآخرون \" عرف \" بالتشديد ، أي : عرف حفصة بعد ذلك الحديث ، أي أخبرها ببعض القول الذي كان منها .( وأعرض عن بعض ) يعني لم يعرفها إياه ، ولم يخبرها به . قال الحسن : ما استقصى كريم قط قال الله تعالى : ( عرف بعضه وأعرض عن بعض ) وذلك أن النبي - صلى الله عليه وسلم - لما رأى الكراهية في وجه حفصة أراد أن يتراضاها فأسر إليها شيئين : تحريم الأمة على نفسه ، وتبشيرها بأن الخلافة بعده في أبي بكر وفي أبيها عمر رضي الله عنها فأخبرت به حفصة عائشة وأطلع الله تعالى نبيه عليه ، عرف [ بعضه ] حفصة وأخبرها ببعض ما أخبرت به عائشة وهو تحريم الأمة وأعرض عن بعض ، يعني ذكر الخلافة كره رسول الله - صلى الله عليه وسلم - أن ينتشر ذلك في الناس ( فلما نبأها به ) أي أخبر حفصة بما أظهره الله عليه ( قالت ) حفصة ( من أنبأك هذا ) أي : من أخبرك بأني أفشيت السر ؟ ( قال نبأني العليم الخبير ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5232.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5232.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5232.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ","transliteration":"In tatoobaaa ilal laahi faqad saghat quloobukumaa wa in tazaaharaa 'alihi fa innal laaha huwa mawlaahu wa jibreelu wa saalihul mu'mineen; walma laaa'ikatu ba'dazaalika zaheer","translations":{"en.ahmedali":"If both of you two (women) turn to God in penitence (it would be better). Your hearts have been impaired; and if you assist one another against him, then surely his helper is God, and Gabriel and the righteous believers, and, besides them, the angels are his helpers.","en.ahmedraza":"If you both, the wives of the Holy Prophet, incline towards Allah, for indeed your hearts have deviated a little; and if you come together against him (the Holy Prophet – peace and blessings be upon him) then indeed Allah is his Supporter, and Jibreel and the virtuous believers are also his aides; and in addition the angels are also his aides. (Allah has created several supporters for the believers.)","en.arberry":"If you two repent to God, yet your hearts certainly inclined; but if you support one another against him, God is his Protector, and Gabriel, and the righteous among the believers; and, after that, the angels are his supporters.","en.asad":"[Say, O Prophet:] \"Would that you two turn unto God in repentance, for the hearts of both of you have swerved [from what is right]! And if you uphold each other against him [who is God's message-bearer, know that] God Himself is his Protector, and [that,] therefore, Gabriel, and all the righteous among the believers and all the [other] angels will come to his aid.\"","en.daryabadi":"If ye twain turn Unto Allah repentant, it is well, surely your hearts are so inclined, and if ye support each other against him, then verily Allah! his friend is He and Jibril and so are the righteous believers; and furthermore the angels are his aiders.","en.hilali":"If you two (wives of the Prophet SAW, namely 'Aishah and Hafsah) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet SAW likes), but if you help one another against him (Muhammad SAW), then verily, Allah is his Maula (Lord, or Master, or Protector, etc.), and Jibrael (Gabriel), and the righteous among the believers, and furthermore, the angels are his helpers.","en.pickthall":"If ye twain turn unto Allah repentant, (ye have cause to do so) for your hearts desired (the ban); and if ye aid one another against him (Muhammad) then lo! Allah, even He, is his Protecting Friend, and Gabriel and the righteous among the believers; and furthermore the angels are his helpers.","en.qaribullah":"If both of you (wives) turn to Allah in repentance, even though your hearts inclined; but if you support one another against him, (know that) Allah is hisGuardian, and Gabriel, and the righteous among the believers; and thereafter the angels are his reinforcers.","en.sahih":"If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants.","en.sarwar":"Would that you two (wives of the Prophet) had turned to God in repentance. Your hearts have sinned. If you conspire with each other against him, know that God is his Guardian. Gabriel, the righteous (ones) among the believers and the angels will all support him.","en.yusufali":"If ye two turn in repentance to Him, your hearts are indeed so inclined; But if ye back up each other against him, truly Allah is his Protector, and Gabriel, and (every) righteous one among those who believe,- and furthermore, the angels - will back (him) up.","en.maududi":"If the two of you turn in repentance to Allah (that is better for you), for the hearts of both of you have swerved from the Straight Path. But if you support one another against the Prophet, then surely Allah is his Protector; and after that Gabriel and all righteous believers and the angels are all his supporters.","en.shakir":"If you both turn to Allah, then indeed your hearts are already inclined (to this); and if you back up each other against him, then surely Allah it is Who is his Guardian, and Jibreel and -the believers that do good, and the angels after that are the aiders.","en.itani":"If you repent to God, then your hearts have listened. But if you band together against him, then God is his Ally, as is Gabriel, and the righteous believers. In addition, the angels will assist him.","en.mubarakpuri":"If you two turn in repentance to Allah, your hearts are indeed so inclined; but if you help one another against him, then verily, Allah is his Protector, and Jibril, and the righteous among the believers; and after that the angels are his helpers.","en.qarai":"If the two of you repent to Allah... for your hearts have certainly swerved, and if you back each other against him, then [know that] Allah is indeed his guardian, and his supporters are Gabriel, the righteous among the faithful and, thereafter, the angels.","en.wahiduddin":"If only both of you would turn to God in repentance -- and your hearts are already so inclined. But if you uphold each other against him, then surely God is his protector, and Gabriel and the righteous among the believers; and the angels too are his helpers."},"tafsir":{"ar.muyassar":"إن ترجعا (حفصة وعائشة) إلى الله فقد وُجد منكما ما يوجب التوبة حيث مالت قلوبكما إلى محبة ما كرهه رسول الله صلى الله عليه وسلم، من إفشاء سرِّه، وإن تتعاونا عليه بما يسوءه، فإن الله وليه وناصره، وجبريل وصالح المؤمنين، والملائكة بعد نصرة الله أعوان له ونصراء على مَن يؤذيه ويعاديه.","ar.jalalayn":"«إن تتوبا» أي حفصة وعائشة «إلى الله فقد صغت قلوبكما» مالت إلى تحريم مارية، أي سركما ذلك مع كراهة النبي صلى الله عليه وسلم له وذلك ذنب، وجواب الشرط محذوف أي تقبلا، وأطلق قلوب على قلبين ولم يعبر به لاستثقال الجمع بين تثنيتين فيما هو كالكلمة الواحدة «وإن تظَّاهرا» بإدغام التاء الثانية في الأصل في الظاء، وفي قراءة بدونها تتعاونا «عليه» أي النبي فيما يكرهه «فإن الله هو» فصل «مولاه» ناصره «وجبريل وصالح المؤمنين» أبو بكر وعمر رضي الله عنهما معطوف على محل اسم إن فيكونون ناصريه «والملائكة بعد ذلك» بعد نصر الله والمذكورين «ظهير» ظهراء أعوان له في نصره عليكما.","ar.qurtubi":"قوله تعالى : إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهيرقوله تعالى : إن تتوبا إلى الله يعني حفصة وعائشة ، حثهما على التوبة على ما كان منهما من الميل إلى خلاف محبة رسول الله صلى الله عليه وسلم .فقد صغت قلوبكما أي زاغت ومالت عن الحق . وهو أنهما أحبتا ما كره النبي صلى الله عليه وسلم من اجتناب جاريته واجتناب العسل ، وكان عليه السلام يحب العسل والنساء . قال ابن زيد : مالت قلوبهما بأن سرهما أن يحتبس عن أم ولده ، فسرهما ما كرهه رسول الله صلى الله عليه وسلم . وقيل : فقد مالت قلوبكما إلى التوبة . وقال : فقد صغت قلوبكما ولم يقل : فقد صغى قلباكما ، ومن شأن العرب إذا ذكروا الشيئين ، من اثنين جمعوهما ، لأنه لا يشكل . وقد مضى هذا المعنى في \" المائدة \" في قوله تعالى : فاقطعوا أيديهما . وقيل : كلما ثبتت الإضافة فيه مع التثنية فلفظ الجمع أليق به ، لأنه أمكن وأخف . وليس قوله : فقد صغت قلوبكما جزاء للشرط ، لأن هذا الصغو كان سابقا ، فجواب الشرط محذوف للعلم به . أي إن تتوبا كان خيرا لكما ، إذ قد صغت قلوبكما .قوله تعالى : وإن تظاهرا عليه أي تتظاهرا وتتعاونا على النبي صلى الله عليه وسلم بالمعصية والإيذاء . وفي صحيح مسلم عن ابن عباس قال : مكثت سنة وأنا أريد أن أسأل عمر بن الخطاب عن آية فما أستطيع أن أسأله هيبة له ، حتى خرج حاجا فخرجت معه ، فلما رجع فكنا ببعض الطريق عدل إلى الأراك لحاجة له ، فوقفت حتى فرغ ، ثم سرت معه فقلت : يا أمير المؤمنين ، من اللتان تظاهرتا على رسول الله صلى الله عليه وسلم من أزواجه ؟ فقال : تلك حفصة وعائشة . قال : فقلت له : والله إن كنت لأريد أن أسألك عن هذا منذ سنة فما أستطيع هيبة لك . قال : فلا [ ص: 175 ] تفعل ، ما ظننت أن عندي من علم فسلني عنه ، فإن كنت أعلمه أخبرتك . . . وذكر الحديث .فإن الله هو مولاه أي وليه وناصره ، فلا يضره ذلك التظاهر منهما .وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير قال عكرمة وسعيد بن جبير : أبو بكر وعمر ، لأنهما أبوا عائشة وحفصة ، وقد كانا عونا له عليهما . وقيل : صالح المؤمنين علي رضي الله عنه . وقيل : خيار المؤمنين . وصالح : اسم جنس كقوله تعالى : والعصر إن الإنسان لفي خسر ، قاله الطبري . وقيل : صالح المؤمنين هم الأنبياء ، قاله العلاء بن زيادة وقتادة وسفيان . وقال ابن زيد : هم الملائكة . السدي : هم أصحاب محمد صلى الله عليه وسلم . وقيل : صالح المؤمنين ليس لفظ الواحد وإنما هو صالحو المؤمنين : فأضاف الصالحين إلى المؤمنين ، وكتب بغير واو على اللفظ لأن لفظ الواحد والجمع واحد فيه . كما جاءت أشياء في المصحف متنوع فيها حكم اللفظ دون وضع الخط . وفي صحيح مسلم عن ابن عباس قال : حدثني عمر بن الخطاب رضي الله عنه قال : لما اعتزل نبي الله صلى الله عليه وسلم نساءه قال دخلت المسجد فإذا الناس ينكتون بالحصى ويقولون : طلق رسول الله صلى الله عليه وسلم نساءه - وذلك قبل أن يؤمرن بالحجاب - فقال عمر : فقلت لأعلمن ذلك اليوم ، قال : فدخلت على عائشة فقلت : يا بنت أبي بكر ، أقد بلغ من شأنك أن تؤذي رسول الله صلى الله عليه وسلم ! فقالت : مالي ومالك يا ابن الخطاب ! عليك بعيبتك ! قال : فدخلت على حفصة بنت عمر فقلت لها : يا حفصة ، أقد بلغ من شأنك أن تؤذي رسول الله صلى الله عليه وسلم ! والله لقد علمت أن رسول الله صلى الله عليه وسلم لا يحبك ، ولولا أنا لطلقك رسول الله صلى الله عليه وسلم . فبكت أشد البكاء ، فقلت لها : أين رسول الله صلى الله عليه وسلم ؟ قالت : هو في خزانته في المشربة . فدخلت فإذا أنا برباح غلام رسول الله صلى الله عليه وسلم قاعدا على أسكفة المشربة مدل رجليه على نقير من خشب ، وهو جذع يرقى عليه رسول الله صلى الله عليه وسلم وينحدر . فناديت : يا رباح ، استأذن لي عندك على رسول الله ، فنظر رباح إلى الغرفة ثم نظر إلي فلم يقل شيئا . ثم قلت : يا رباح ، استأذن لي عندك على رسول الله صلى الله عليه وسلم ، فنظر رباح إلى الغرفة ثم نظر إلي فلم يقل شيئا . ثم رفعت صوتي فقلت : يا رباح ، استأذن لي عندك على رسول الله صلى الله عليه وسلم ، فإني أظن أن رسول الله صلى الله عليه وسلم ظن أني [ ص: 176 ] جئت من أجل حفصة ، والله لئن أمرني رسول الله صلى الله عليه وسلم بضرب عنقها لأضربن عنقها ، ورفعت صوتي فأومأ إلي أن ارقه ; فدخلت على رسول الله صلى الله عليه وسلم وهو مضطجع على حصير ، فجلست فأدنى عليه إزاره وليس عليه غيره ; وإذا الحصير قد أثر في جنبه ، فنظرت ببصري في خزانة رسول الله صلى الله عليه وسلم فإذا أنا بقبضة من شعير نحو الصاع ، ومثلها قرظا في ناحية الغرفة ; وإذا أفيق معلق - قال - فابتدرت عيناي . قال : \" ما يبكيك يا ابن الخطاب ؟ \" قلت : يا نبي الله ، ومالي لا أبكي وهذا الحصير قد أثر في جنبك ، وهذه خزانتك لا أرى فيها إلا ما أرى ! وذاك قيصر وكسرى في الثمار والأنهار وأنت رسول الله صلى الله عليه وسلم وصفوته ، وهذه خزانتك ! فقال : \" يا ابن الخطاب ألا ترضى أن تكون لنا الآخرة ولهم الدنيا \" . قلت : بلى . قال : ودخلت عليه حين دخلت وأنا أرى في وجهه الغضب ، فقلت : يا رسول الله ، ما يشق عليك من شأن النساء ; فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكائيل ، وأنا وأبو بكر والمؤمنون معك . وقلما تكلمت - وأحمد الله - بكلام إلا رجوت أن يكون الله عز وجل يصدق قولي الذي أقول ، ونزلت هذه الآية ، آية التخيير : عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن . وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير . وكانت عائشة بنت أبي بكر وحفصة تظاهران على سائر نساء رسول الله صلى الله عليه وسلم . فقلت : يا رسول الله ، أطلقتهن ؟ قال : \" لا \" . قلت : يا رسول الله ، إني دخلت المسجد والمسلمون ينكتون بالحصى يقولون : طلق رسول الله صلى الله عليه وسلم نساءه أفأنزل فأخبرهم أنك لم تطلقهن ؟ قال : \" نعم إن شئت \" . فلم أزل أحدثه حتى تحسر الغضب عن وجهه ، وحتى كشر فضحك ، وكان من أحسن الناس ثغرا . ثم نزل نبي الله صلى الله عليه وسلم ونزلت ; فنزلت أتشبث بالجذع ، ونزل رسول الله صلى الله عليه وسلم كأنما يمشي على الأرض ما يمسه بيده . فقلت : يا رسول الله ، إنما كنت في الغرفة تسعا وعشرين . قال : \" إن الشهر يكون تسعا وعشرين \" فقمت على باب المسجد فناديت بأعلى صوتي : لم يطلق رسول الله صلى الله عليه وسلم نساءه . ونزلت هذه الآية : وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم . فكنت أنا استنبطت ذلك الأمر ; وأنزل الله آية التخيير .قوله تعالى : وجبريل فيه لغات تقدمت في سورة \" البقرة \" . ويجوز أن يكون معطوفا على \" مولاه \" والمعنى : الله وليه وجبريل وليه ; فلا يوقف على مولاه ويوقف على [ ص: 177 ] جبريل ويكون \" وصالح المؤمنين \" مبتدأ والملائكة معطوفا عليه . و \" ظهير \" خبرا ; وهو بمعنى الجمع . وصالح المؤمنين أبو بكر ; قاله المسيب بن شريك . وقال سعيد بن جبير : عمر . وقال عكرمة : أبو بكر وعمر . وروى شقيق عن عبد الله عن النبي صلى الله عليه وسلم في قول الله تعالى : فإن الله هو مولاه وجبريل وصالح المؤمنين قال : إن صالح المؤمنين أبو بكر وعمر . وقيل : هو علي . عن أسماء بنت عميس قالت : سمعت رسول الله صلى الله عليه وسلم يقول : وصالح المؤمنين علي بن أبي طالب . وقيل غير هذا مما تقدم القول فيه . ويجوز أن يكون وجبريل مبتدأ وما بعده معطوفا عليه . والخبر ظهير وهو بمعنى الجمع أيضا . فيوقف على هذا على مولاه . ويجوز أن يكون جبريل وصالح المؤمنين معطوفا على مولاه فيوقف على المؤمنين ويكون والملائكة بعد ذلك ظهير ابتداء وخبرا . ومعنى \" ظهير \" أعوان . وهو بمعنى ظهراء ; كقوله تعالى : وحسن أولئك رفيقا . وقال أبو علي : قد جاء فعيل للكثرة كقوله تعالى : ولا يسأل حميم حميما يبصرونهم وقيل : كان التظاهر منهما في التحكم على النبي صلى الله عليه وسلم في النفقة ، ولهذا آلى منهن شهرا واعتزلهن . وفي صحيح مسلم عن جابر بن عبد الله قال : دخل أبو بكر يستأذن على رسول الله صلى الله عليه وسلم فوجد الناس جلوسا ببابه لم يؤذن لأحد منهم ، قال : فأذن لأبي بكر فدخل ، ثم أقبل عمر فاستأذن فأذن له ، فوجد النبي صلى الله عليه وسلم جالسا حوله نساؤه واجما ساكتا - قال - فقال : لأقولن شيئا أضحك النبي صلى الله عليه وسلم ; فقال : يا رسول الله ، لو رأيت بنت خارجة سألتني النفقة فقمت إليها فوجأت عنقها ; فضحك رسول الله صلى الله عليه وسلم وقال : \" هن حولي كما ترى يسألنني النفقة \" . فقام أبو بكر إلى عائشة يجأ عنقها ، وقام عمر إلى حفصة يجأ عنقها ; كلاهما يقول : تسألن رسول الله صلى الله عليه وسلم ما ليس عنده ! فقلن : والله لا نسأل رسول الله صلى الله عليه وسلم شيئا أبدا ليس عنده . ثم اعتزلهن شهرا أو تسعا وعشرين . ثم نزلت عليه هذه الآية : يا أيها النبي قل لأزواجك حتى بلغ للمحسنات منكن أجرا عظيما الحديث . وقد ذكراه في سورة \" الأحزاب \" .\n","ar.miqbas":"إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلَائِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ (4)التفات من ذكر القصتين إلى موعظة من تعلقت بهما فهو استئناف خطاب وجهه الله إلى حفصة وعائشة لأن إنباء النبي صلى الله عليه وسلم بعلمه بما أفشته القصد منه الموعظة والتحذير والإِرشاد إلى رأْب ما انثلم من واجبها نحو زوجها . وإذ قد كان ذلك إثماً لأنه إضاعة لحقوق الزوج وخاصة بإفشاء سرّه ذكَّرها بواجب التوبة منه .وخطاب التّثنية عائدة إلى المنبئة والمنأبة فأمّا المنبئة فمعادها مذكور في الكلام بقوله : { إلى بعض أزواجه } [ التحريم : 3 ] .وأما المنبَّأة فمعادها ضمنيّ لأن فعل { نبأت } [ التحريم : 3 ] يقتضيه فأما المنبَّئة فأمرها بالتوبة ظاهر . وأما المُذاع إليها فلأنها شريكة لها في تلقي الخبر السر ولأن المذيعة ما أذاعت به إليها إلا لعلمها بأنها ترغب في تطلع مثل ذلك فهاتان موعظتان لمذيع السرّ ومشاركة المذاع إليه في ذلك وكان عليها أن تنهاها عن ذلك أو أن تخبر زوجها بما أذاعته عنه ضرتها .و { صَغت } : مالت ، أي مالت إلى الخير وحق المعاشرة مع الزوج ، ومنه سمي سماع الكلام إصغاء لأن المستمع يُميل سمعه إلى من يكلمه ، وتقدم عند قوله تعالى : { ولتصغى إليه أفئدة الذين لا يؤمنون بالآخرة } في سورة [ الأنعام : 113 ] . وفيه إيماء إلى أن فيما فعَلَتَاه انحرافاً عن أدب المعاشرة الذي أمر الله به وأن عليهما أن تتوبا مما صنعتاه ليقع بذلك صلاح ما فسد من قلوبهما .وهذان الأدَبَان الثامن والتاسع من الآداب التي اشتملت عليها هذه الآيات .والتوبة : الندم على الذنب ، والعزم على عدم العودة إليه وسيأتي الكلام عليها في هذه السورة .وإذْ كان المخاطب مثنَّى كانت صيغة الجمع في ( قلوب ) مستعملة في الاثنين طلباً لخفة اللفظ عند إضافته إلى ضمير المثنى كراهية اجتماع مثنيين فإن صيغة التثنية ثقيلة لقلة دورانها في الكلام . فلما أُمن اللبس ساغ التعبير بصيغة الجمع عن التثنية .وهذا استعمال للعرب غير جار على القياس . وذلك في كل اسم مثنى أضيف إلى اسم مثنى فإن المضاف يصير جمعاً كما في هذه الآية وقول خطام المجُاشعي: ... ومَهمهين قَذَفين مَرْتَيْنْظهراهما مثلُ ظُهور التُرسين ... وأكثر استعمال العرب وأفصحه في ذلك أن يعبروا بلفظ الجمع مضافاً إلى اسم المثنى لأن صيغة الجمع قد تطلق على الاثنين في الكلام فهما يتعاوران . ويقلّ أن يؤتى بلفظ المفرد مضافاً إلى الاسم المثنى . وقال ابن عصفور : هو مقصور على السماع .وذكر له أبو حيّان شاهداً قول الشاعر: ... حمامةَ بطننِ الواديين ترنّميسقاك من الغُرّ الغوادي مطيرها ... وفي التسهيل } : ترجيح التعبير عن المثنى المضاففِ إلى مثنى باسممٍ مفرد ، على التعبير عنه بلفظ المثنى . وقال أبو حيّان في «البحر المحيط» : إن ابن مالك غلط في ذلك . قلت : وزعم الجاحظ في كتاب «البيان والتبيين» ، أن قول القائل : اشترِ رأسَ كبشين يريد رأسَيْ كبشين خطأ .قال : لأن ذلك لا يكون اه . وذلك يؤيد قول ابن عصفور بأن التعبير عن المضاففِ المثنى بلفظ الإِفراد مقصور على السماع ، أي فلا يصار إليه . وقيّد الزمخشري في «المفصل» هذا التعبير بقيد أن لا يكون اللفظان متصلين . فقال : «ويُجعل الاثنان على لفظ جمع إذا كانا متصلين كقوله : { فقد صغت قلوبكما } ولم يقولوا في المنفصلين : أفراسهما ولا غلمانهما . وقد جاء وضَعا رحالهما» . فخالف إطلاق ابن مالك في «التسهيل» وطريقة صاحب «المفصل» أظهر .وقوله : { وإن تظّاهرا عليه } هو ضد { إن تتوبا } أي وإن تصرّا على العود إلى تألبكما عليه فإن الله مولاه الخ .والمظاهرة : التعاون ، يقال : ظاهره ، أي أيده وأعانه . قال تعالى : { ولم يظاهروا عليكم أحداً } في سورة [ براءة : 4 ] . ولعلّ أفعال المظاهر ووصف ظهير كلها مشتقة من الاسم الجامد ، وهو الظَّهر لأن المعين والمؤيد كأنه يشد ظَهر من يعينه ولذلك لم يسمع لهذه الأفعال الفرعية والأوصاف المتفرعة عنها فعل مجرد . وقريب من هذا فعل عَضَد لأنهم قالوا : شَد عضده .وأصل تظّاهرا } تتظاهرا فقلبت التاء ظاء لقرب مخرجيها وأدغمت في ظاء الكلمة وهي قراءة الجمهور . وقرأه عاصم وحمزة والكسائي { تَظَاهرا } بتخفيف الظاء على حذف إحدى التاءين للتخفيف .{ وصالحُ } مفرد أريد به معنى الفريق الصالح أو الجنس الصالح من المؤمنين كقوله تعالى : { فمنهم مهتد } [ الحديد : 26 ] . والمراد ب { صالح المؤمنين } المؤمنون الخالصون من النفاق والتردد .وجملة { فإن الله هو مولاه } قائمة من مقام جواب الشرط معنى لأنها تفيد معنى يتولّى جزاءكما على المظاهرة عليه ، لأن الله مولاه . وفي هذا الحذف مجال تذهب فيه نفس السامع كل مذهب من التهويل .وضمير الفصل في قوله : { هو مولاه } يفيد القصر على تقدير حصول الشرط ، أي إن تظاهرتما متناصرتين عليه فإن الله هو ناصره لا أنتما ، أي وبطل نصركما الذي هو واجبكما إذْ أخللتما به على هذا التقدير . وفي هذا تعريف بأن الله ناصر رسولَه صلى الله عليه وسلم لئلا يقع أحد من بعد في محاولة التقصير من نصره .فهذا المعنى العاشر من معاني الموعظة والتأديب التي في هذه الآيات .وعطفُ { وجبريل وصالح المؤمنين } في هذا المعنى تنويه بشأن رسول الوحي من الملائكة وشأن المؤمنين الصالحين . وفيه تعريض بأنهما تكونان ( على تقدير حصول هذا الشرط ) من غير الصالحين .وهذان التنويهان هما المعنيان الحادي عشر والثاني عشر من المعاني التي سبقت إشارتي إليها .وقوله : { والملائكة بعد ذلك ظهير } عطف جملةٍ على التي قبلها ، والمقصود منه تعظيم هذا النصر بوفرة الناصرين تنويهاً بمحبة أهل السماء للنبيء صلى الله عليه وسلم وحسننِ ذكره بينهم فإن ذلك مما يزيد نصر الله إياه شأناً .وفي الحديث «إذا أحب الله عبداً نادى جبريل إني قد أحببت فلاناً فأحِبَّه فيحبُّه جبريل ثم ينادي جبريلُ في أهل السماء إن الله قد أحب فلاناً فأحِبُّوه فيحبُّه أهل السماء ثم يوضع له القبول في أهل الأرض» .فالمراد بأهل الأرض فيه المؤمنون الصالحون منهم لأن الذي يحبه الله يحبّه لصلاحه والصالح لا يحبّه أهل الفساد والضلال . فهذه الآية تفسيرها ذلك الحديث .وهذا المعنى الثالث عشر من معاني التعليم التي حوتها الآيات .وقوله : { بعد ذلك } اسم الإِشارة فيه للمذكور ، أي بعد نصر الله وجبريل وصالح المؤمنين .وكلمة { بعد } هنا بمعنى ( مع ) فالبَعدية هنا بَعدية في الذّكر كقوله : { عتل بعد ذلك زنيم } [ القلم : 13 ] .وفائدة ذكر الملائكة بعد ذكر تأييد الله وجبريل وصالح والمؤمنين أن المذكورين قبلهم ظاهره آثار تأييدهم بوحي الله للنبي صلى الله عليه وسلم بواسطة جبريل ونصره إياه بواسطة المؤمنين فنبه الله المرأتين على تأييد آخر غيرِ ظاهرة آثاره وهو تأييد الملائكة بالنصر في يوم بدر وغير النصر من الاستغفار في السماوات ، فلا يتوهم أحد أن هذا يقتضي تفضيل نصرة الملائكة على نصرة جبريل بَلْه نصرة الله تعالى .و { ظهير } وصف بمعنى المظاهر ، أي المؤيد وهو مشتقّ من الظهر ، فهو فعيل بمعنى مفاعل مثل حكيم بمعنى محكم كما تقدم آنفاً في قوله : { وإن تظاهرا عليه } ، وفعيل الذي ليس بمعنى مفعول أصله أن يطابق موصوفه في الإِيراد وغيره فإن كان هنا خبراً عن الملائكة كما هو الظاهر كان إفراده على تأويل جمع الملائكة بمعنى الفَوج المظاهر أو هو من إجراء فعيل الذي بمعنى فاعل مجرى فعيل بمعنى مفعول . كقوله تعالى : { إن رحمة الله قريب من المحسنين } [ الأعراف : 56 ] ، وقوله : { وكان الكافر على ربه ظهيراً } [ الفرقان : 55 ] وقوله : { وحسن أولئك رفيقاً } [ النساء : 69 ] ، وإن كان خبراً عن جبريل كان { صالح المؤمنين والملائكة } عطفاً على جبريل وكان قولُه { بعد ذلك } حالاً من الملائكة .وفي الجمع بين { أظهره الله عليه } [ التحريم : 3 ] وبين { وإن تظاهرا عليه } وبين { ظهير } تجنيسات .\n","ar.waseet":"ثم وجه - سبحانه - بعد ذلك خطابه إلى حفصة وعائشة ، فأمرهما بالتوبة عما صدر منهما .فقال : ( إِن تَتُوبَآ إِلَى الله فَقَدْ صَغَتْ قُلُوبُكُمَا ) .ولفظ ( صَغَتْ ) بمعنى مالت وانحرفت عن الواجب عليهما . يقال صغا فلان يصغو ويصغى صغوا ، إذا مال نحو شىء معين . ويقال : صغت : الشمس ، إذا مالت نحو الغروب ، ومنه قوله - تعالى - : ( ولتصغى إِلَيْهِ أَفْئِدَةُ الذين لاَ يُؤْمِنُونَ بالآخرة ) وجواب الشرط محذوف ، والتقدير : إن تتوبا إلى الله ، فلتوبتكما موجب أو سبب ، فقد مالت قلوبكما عن الحق ، وانحرفت عما يجب عليكما نحو الرسول - صلى الله عليه وسلم - من كتمان لسره ، ومن حرص على راحته ، ومن احترام لكل تصرف من تصرفاته .. . وجاء الخطاب لهما على سبيل الالتفات من الغيبة إلى الخطاب ، مبالغة فى المعاتبة ، فإن المبالغ فى ذلك يوجه الخطاب إلى من يريد معاتبته مباشرة .وقال - سبحانه - ( فَقَدْ صَغَتْ قُلُوبُكُمَا ) بصيغة الجمع للقلوب ، ولم يقل قلبا كما بالتثنية ، لكراهة اجتماع تثنيتين فيما هو كالكلمة الواحدة ، مع ظهور المراد ، وأمن اللبس .ثم ساق - سبحانه - ما هو أشد فى التحذير والتأديب فقال : ( إِن تَتُوبَآ إِلَى الله فَقَدْ صَغَتْ قُلُوبُكُمَا وَإِن تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلاَهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلاَئِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ ) .وقوله ( تَظَاهَرَا ) أصله تتظاهرا فحذفت إحدى التاءين تخفيفا . والمراد بالتظاهر : التعاون والتآزر ، يقال : ظاهر فلان فلانا إذا أعانه على ما يريده ، وأصله من الظهر ، لأن من يعين غيره فكأنه يشد ظهره ، ويقوى أمرهقال - تعالى - : ( إِلاَّ الذين عَاهَدتُّم مِّنَ المشركين ثُمَّ لَمْ يَنقُصُوكُمْ شَيْئاً وَلَمْ يُظَاهِرُواْ عَلَيْكُمْ أَحَداً فأتموا إِلَيْهِمْ عَهْدَهُمْ إلى مُدَّتِهِمْ ) وجواب الشرط - أيضا - محذوف - أى : وإن تتعاونا عليه بما يزعجه ، ويغضبه ، من الإفراط فى الغيرة ، وإفشاء سره . فلا يعدم ناصرا ولا معينا بل سيجد الناصر الذى ينصره عليكما ، فإن الله - تعالى - ( هُوَ مَوْلاَهُ ) أى : ناصره ومعينه ( وَجِبْرِيلُ ) كذلك ناصره ومعينه عليكما .( وَصَالِحُ الْمُؤْمِنِينَ ) أى : وكذلك الصالحون من المؤمنين من أنصاره وأعوانه .( وَالْمَلاَئِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ ) أى : والملائكة بعد نصر الله - تعالى - له ، وبعد نصر جبريل وصالح المؤمنين له ، مؤيدونه ومناصرونه وواقفون فى صفه ضدكما .وفى هذه الآية الكريمة أقوى ألوان النصر والتأييد للرسول - صلى الله عليه وسلم - وأسمى ما يتصوره الإنسان من تكريم الله - تعالى - لنبيه - صلى الله عليه وسلم - ومن غيرته - عز وجل - عليه ، ومن دفاعه عنه - صلى الله عليه وسلم - .وفيها تعريض بأن من يحاول إغضاب الرسول - صلى الله عليه وسلم - فإن لا يكون من صالح المؤمنين .وقوله : ( وَجِبْرِيلُ ) مبتدأ ، وقوله : ( وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلاَئِكَةُ ) معطوف عليه .وقوله : ( بَعْدَ ذَلِكَ ) متعلق بقوله ( ظَهِيرٌ ) الذى هو خبر عن الجميع .وقد جاء بلفظ المفرد ، لأن صيغة فعيل يستوى فيها الواحد وغيره . فكأنه - تعالى - قال : الجمع بعد ذلك مظاهرون له ، واختير الإفراد للإشعار بأنهم جميعا كالشىء الواحد فى تأييده ونصرته ، وبأنهم يد واحدة على من يعاديه .قال صاحب الكشاف : فإن قلت : قوله : ( بَعْدَ ذَلِكَ ) تعظيم للملائكة ومظاهرتهم ، وقد تقدمت نصرة الله وجبريل وصالح المؤمنين ، ونصرة الله - تعالى - أعظم وأعظم؟قلت : مظاهرة الملائكة من جملة نصرة الله ، فكأنه فضل نصرته - تعالى - بهم وبمظاهرتهم على غيرها من وجوه نصرته ، لفضلهم . . \" .وخص جبريل بالذكر مع أنه من الملائكة ، للتنويه بمزيد فضله ، فهو أمين الوحى ، والمبلغ عن الله - تعالى - إلى رسله .هذا ، ومما يدل على أن الخطاب فى قوله - تعالى - : ( إِن تَتُوبَآ إِلَى الله ) ، لحفصة وعائشة ، ما أخرجه الشيخان وغيرهما عن ابن عباس أنه قال : لم أزل حريصا على أن أسأل عمر عن المرأتين من أزواج رسول الله - صلى الله عليه وسلم - اللتين قال الله - تعالى - فيهما : ( إِن تَتُوبَآ إِلَى الله فَقَدْ صَغَتْ قُلُوبُكُمَا ) .فلما كان ببعض الطريق . . . قلت : يا أمير المؤمنين ، من المرأتان من أزواج النبى - صلى الله عليه وسلم - اللتان قال الله تعالى - فيهما : ( إِن تَتُوبَآ إِلَى الله فَقَدْ صَغَتْ قُلُوبُكُمَا ) .فقال عمر : واعجبا لك يا ابن عباس . . . هما حفصة وعائشة .\n","ar.baghawi":"( إن تتوبا إلى الله ) أي من التعاون على النبي - صلى الله عليه وسلم - بالإيذاء . يخاطب عائشة وحفصة ( فقد صغت قلوبكما ) أي زاغت ومالت عن الحق واستوجبتما التوبة . قال ابن زيد : مالت قلوبهما بأن سرهما ما كره رسول الله - صلى الله عليه وسلم - من اجتناب جاريته .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا أبو اليمان ، أخبرنا شعيب عن الزهري ، أخبرني عبيد الله بن عبد الله بن أبي ثور عن عبد الله بن عباس قال : لم أزل حريصا على أن أسأل عمر بن الخطاب عن المرأتين من أزواج النبي - صلى الله عليه وسلم - اللتين قال الله تعالى لهما : \" إن تتوبا إلى الله فقد صغت قلوبكما \" حتى حج وحججت معه وعدل وعدلت معه بإداوة ، فتبرز ثم جاء فسكبت على يديه منها فتوضأ فقلت له : يا أمير المؤمنين من المرأتان من أزواج النبي - صلى الله عليه وسلم - اللتان قال الله تعالى لهما : \" إن تتوبا إلى الله فقد صغت قلوبكما \" ؟ فقال : واعجبا لك يا ابن عباس هما عائشة وحفصة .ثم استقبل عمر الحديث يسوقه فقال : إني كنت أنا وجار لي من الأنصار في بني أمية بن زيد ، وهي من عوالي المدينة ، وكنا نتناوب النزول على النبي - صلى الله عليه وسلم - فينزل يوما وأنزل يوما فإذا نزلت جئته بما حدث من خبر ذلك اليوم من الوحي أو غيره ، وإذا نزل فعل مثل ذلك .وكنا معشر قريش نغلب النساء ، فلما قدمنا على الأنصار إذا هم قوم تغلبهم نساؤهم ، فطفق نساؤنا يأخذن من أدب نساء الأنصار فصخبت علي امرأتي فراجعتني فأنكرت أن تراجعني فقالت : ولم تنكر أن أراجعك ! فوالله إن أزواج النبي - صلى الله عليه وسلم - ليراجعنه ، وإن إحداهن لتهجره اليوم حتى الليل . فأفزعني وقلت : خاب من فعل ذلك منهن .ثم جمعت علي ثيابي [ فنزلت ] فدخلت على حفصة ، فقلت لها : أي حفصة أتغاضب إحداكن النبي - صلى الله عليه وسلم - اليوم حتى الليل ؟ قالت : نعم ، فقلت : خبت وخسرت ، أفتأمنين أن يغضب الله تعالى لغضب رسوله فتهلكي لا تستكثري للنبي - صلى الله عليه وسلم - ولا تراجعيه في شيء ولا تهجريه وسليني ما بدا لك ، ولا يغرنك أن كانت [ جارتك ] [ أوضأ ] منك وأحب إلى النبي - صلى الله عليه وسلم - يريد عائشة - .قال عمر : وكنا تحدثنا أن غسان تنعل الخيل لتغزونا فنزل صاحبي الأنصاري يوم نوبته فرجع إلينا عشاء فضرب بابي ضربا شديدا وقال : أثم هو ؟ففزعت فخرجت إليه فقال : قد حدث اليوم أمر عظيم ؟ فقلت : ما هو أجاء غسان ! قال : لا بل أعظم منه وأهول ، طلق النبي - صلى الله عليه وسلم - نساءه . فقلت : قد خابت حفصة وخسرت كنت أظن أن هذا يوشك أن يكون .فجمعت علي ثيابي وصليت صلاة الفجر مع رسول الله - صلى الله عليه وسلم - ، فدخل رسول الله - صلى الله عليه وسلم - مشربة فاعتزل فيها فدخلت على حفصة فإذا هي تبكي ، فقلت : ما يبكيك ألم أكن حذرتك ؟ أطلقكن النبي - صلى الله عليه وسلم - ؟قالت : لا أدري ها هو ذا معتزل في المشربة . فجئت إلى المنبر فإذا حوله رهط يبكي بعضهم ، فجلست معهم قليلا ثم غلبني ما أجد ، فجئت المشربة التي فيها النبي - صلى الله عليه وسلم - فقلت لغلام له أسود : استأذن لعمر ، فدخل فكلم النبي - صلى الله عليه وسلم - ثم رجع فقال : كلمت النبي - صلى الله عليه وسلم - فذكرتك له فصمت ، فانصرفت حتى جلست مع الرهط الذين عند المنبر ، ثم غلبني ما أجد فجئت فقلت إلى الغلام فقلت : استأذن فاستأذن ثم رجع إلي فقال : قد ذكرتك له فصمت [ فرجعت فجلست مع الرهط الذين عند المنبر ، ثم غلبني ما أجد فجئت الغلام فقلت : استأذن لعمر ، فاستأذن ثم رجع إلي فقال : قد ذكرتك له فصمت ] .فلما وليت منصرفا قال إذا الغلام يدعوني فقال : قد أذن لك النبي - صلى الله عليه وسلم - فدخلت على رسول الله - صلى الله عليه وسلم - فإذا هو مضطجع على رمال حصير ليس بينه وبينه فراش قد أثر الرمال بجنبه متكئا على وسادة من أدم حشوها ليف ، فسلمت عليه ثم قلت وأنا قائم : يا رسول الله أطلقت نساءك ؟ فرفع إلي بصره فقال : لا ، فقلت : الله أكبر . ثم قلت وأنا قائم أستأنس : يا رسول الله لو رأيتني وكنا معشر قريش نغلب النساء فلما قدمنا المدينة إذا قوم تغلبهم نساؤهم ، فتبسم رسول الله - صلى الله عليه وسلم - ، ثم قلت : يا رسول الله لو رأيتني ودخلت على حفصة فقلت لها : لا يغرنك أن كانت جارتك [ أوضأ ] منك وأحب إلى النبي - صلى الله عليه وسلم - يريد عائشة - فتبسم النبي - صلى الله عليه وسلم - تبسمة أخرى ، فجلست حين رأيته يبتسم فرفعت بصري في بيته ، فوالله ما رأيت فيه شيئا يرد البصر غير أهبة ثلاثة ، فقلت يا رسول الله ادع الله فليوسع على أمتك فإن فارس والروم قد وسع عليهم وأعطوا من الدنيا وهم لا يعبدون الله .فجلس النبي - صلى الله عليه وسلم - وكان متكئا فقال : \" أو في هذا أنت يا ابن الخطاب ؟ إن أولئك قوم عجلوا طيباتهم في الحياة الدنيا \" .فقلت : يا رسول الله استغفر لي .فاعتزل النبي - صلى الله عليه وسلم - نساءه من أجل ذلك الحديث حين أفشته حفصة إلى عائشة تسعا وعشرين ليلة ، وكان قال : ما أنا بداخل عليهن شهرا - من شدة موجدته عليهن حين عاتبه الله - عز وجل -فلما مضت تسع وعشرون ليلة ، دخل على عائشة رضي الله عنها فبدأ بها فقالت له عائشة : يا رسول الله إنك كنت أقسمت أن لا تدخل علينا شهرا وإنما أصبحت من تسع وعشرين ليلة أعدها عدا ! فقال : الشهر تسع وعشرون ، وكان ذلك الشهر تسعا وعشرين ليلة .قالت عائشة : ثم أنزل الله التخيير فبدأ بي أول امرأة من نسائه ، فاخترته ثم خير نساءه كلهن فقلن مثل ما قالتعائشة .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا أبو اليمان ، أخبرنا شعيب عن الزهري ، أخبرني أبو سلمة بن عبد الرحمن أن عائشة زوج النبي - صلى الله عليه وسلم - أخبرته أن رسول الله - صلى الله عليه وسلم - جاءها حين أمره الله أن يخير أزواجه فبدأ بي رسول الله - صلى الله عليه وسلم - فقال : إني ذاكر لك أمرا فلا عليك [ أن لا تعجلي ] حتى تستأمري أبويك ، وقد علم أن أبوي لم يكونا يأمراني بفراقه قالت ثم قال إن الله قال : \" يا أيها النبي قل لأزواجك \" إلى تمام الآيتين ، فقلت : أو في هذا أستأمر أبوي ؟ فإني أريد الله ورسوله والدار الآخرةأخبرنا إسماعيل بن عبد القاهر ، أخبرنا عبد الغافر بن محمد ، أخبرنا محمد بن عيسى ، حدثنا إبراهيم بن محمد بن سفيان ، حدثنا مسلم بن الحجاج ، حدثني زهير بن حرب ، حدثنا عمر بن يونس الحنفي ، حدثنا عكرمة بن عمار ، عن سماك [ بن زميل ] حدثنا عبد الله بن عباس ، حدثني عمر بن الخطاب قال : لما اعتزل النبي - صلى الله عليه وسلم - نساءه وذكر الحديث . وقال : دخلت عليه فقلت : يا رسول الله ما يشق عليك من شأن النساء ؟ فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكائيل وأنا وأبو بكر والمؤمنون معك . وقلما تكلمت - وأحمد الله تعالى - بكلام إلا رجوت أن الله يصدق قولي الذي أقول ، ونزلت هذه الآية : \" عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن \" . \" وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير \" .قوله : ( وإن تظاهرا عليه ) أي تتظاهرا وتتعاونا على أذى النبي - صلى الله عليه وسلم - . قرأ أهل الكوفة بتخفيف الظاء ، والآخرون بتشديدها .( فإن الله هو مولاه ) أي وليه وناصره : ( وجبريل وصالح المؤمنين ) روي عن ابن مسعود وأبي بن كعب : ( وصالح المؤمنين ) أبو بكر وعمر رضي الله عنهما قال الكلبي : هم المخلصون الذي ليسوا بمنافقين . ( والملائكة بعد ذلك ظهير ) قال مقاتل : بعد الله وجبريل \" وصالح المؤمنين والملائكة بعد ذلك ظهير \" أي : أعوان للنبي - صلى الله عليه وسلم - . وهذا من الواحد الذي يؤدي عن الجمع ، كقوله : \" وحسن أولئك رفيقا \" ( النساء - 69 ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5233.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5233.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5233.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"عَسَىٰ رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا","transliteration":"'Asaa rabbuhooo in tallaqakunna anyyubdilahooo azwaajan khairam mnkunna muslimaatim mu'minaatin qaanitaatin taaa'ibaatin 'aabidaatin saaa'ihaatin saiyibaatinw wa abkaaraa","translations":{"en.ahmedali":"In case he divorces you, his Lord will give him better wives in return, who will be modest, true believers, obedient to God, repentant, observant of prayer and fasting, both widows and virgins.","en.ahmedraza":"It is likely that, if he divorces you, his Lord will give him wives better than you in your place -widows and maidens who are obedient, believing, respectful, penitent, serving and fasting.","en.arberry":"It is possible that, if he divorces you, his Lord will give him in exchange wives better than you, women who have surrendered, believing, obedient, penitent, devout, given to fasting, who have been married and virgins too.","en.asad":"[O wives of the Prophet!] Were he to divorce [any of] you, God might well give him in your stead spouses better than you - women who surrender themselves unto God, who truly believe, devoutly obey His will, turn [unto Him] in repentance [whenever they have sinned] worship [Him alone] and go on and on [seeking His goodly acceptance] - be they women previously married or virgins.","en.daryabadi":"Belike his Lord, if he divorce you, will give him in exchange wives better than you, Muslims, believers, devout, penitent, worshippers, given to fasting, both non-virgins and virgins.","en.hilali":"It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you, Muslims (who submit to Allah), believers, obedient to Allah, turning to Allah in repentance, worshipping Allah sincerely, fasting or emigrants (for Allah's sake), previously married and virgins.","en.pickthall":"It may happen that his Lord, if he divorce you, will give him in your stead wives better than you, submissive (to Allah), believing, pious, penitent, devout, inclined to fasting, widows and maids.","en.qaribullah":"It may be that if he divorces you his Lord will give him in your place better wives than yourselves, women who have surrendered, believing, obedient, penitent worshippers and given to fasting; who were (previously) married, and virgins too.","en.sahih":"Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.","en.sarwar":"If he divorces you, perhaps his Lord will replace you with better wives, either widows or virgins who will be Muslims: believers, faithful, obedient, repentant, and devout in prayer and fasting.","en.yusufali":"It may be, if he divorced you (all), that Allah will give him in exchange consorts better than you,- who submit (their wills), who believe, who are devout, who turn to Allah in repentance, who worship (in humility), who travel (for Faith) and fast,- previously married or virgins.","en.maududi":"Maybe if he were to divorce you, your Lord might grant him in exchange wives better than you – those who truly submit to Allah, are full of faith, obedient, disposed to repentance, and given to worship and fasting – both previously wedded ones and virgins.","en.shakir":"Maybe, his Lord, if he divorce you, will give him in your place wives better than you, submissive, faithful, obedient, penitent, adorers, fasters, widows and virgins.","en.itani":"Perhaps, if he divorces you, his Lord will give him in exchange wives better than you: submissive, believing, obedient, penitent, devout, fasting—previously married, or virgins.","en.mubarakpuri":"Maybe his Lord, if he divorces you, will give him instead of you, wives better than you - submitting, believers, obedient, turning to Allah in repentance, worshipping Allah sincerely, Sa'ihat, previously married, and virgins.","en.qarai":"It may be that if he divorces you his Lord will give him, in [your] stead, wives better than you: [such as are] muslim, faithful, obedient, penitent, devout and given to fasting, virgins and non-virgins.","en.wahiduddin":"Were he to divorce you, his Lord might well replace you with better wives -- submissive [to God], believing, pious, penitent, devout in worship, given to fasting -- previously married and virgins."},"tafsir":{"ar.muyassar":"عسى ربُّه إن طلقكنَّ- أيتها الزوجات- أن يزوِّجه بدلا منكن زوجات خاضعات لله بالطاعة، مؤمنات بالله ورسوله، مطيعات لله، راجعات إلى ما يحبه الله مِن طاعته، كثيرات العبادة له، صائمات، منهنَّ الثيِّبات، ومنهن الأبكار.","ar.jalalayn":"«عسى ربه إن طلقكن» أي طلق النبي أزواجه «أن يبدِّله» بالتشديد والتخفيف «أزواجا خيرا منكن» خبر عسى والجملة جواب الشرط ولم يقع التبديل لعدم وقوع الشرط «مسلمات» مقرات بالإسلام «مؤمنات» مخلصات «قانتات» مطيعات «تائبات عابدات سائحات» صائمات أو مهاجرات «ثيبات وأبكارا».","ar.qurtubi":"قوله تعالى : عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن مسلمات مؤمنات قانتات تائبات عابدات سائحات ثيبات وأبكاراقوله تعالى : عسى ربه إن طلقكن قد تقدم في الصحيح أن هذه الآية نزلت على لسان عمر رضي الله عنه . ثم قيل : كل \" عسى \" في القرآن واجب ; إلا هذا . وقيل : هو واجب ، ولكن الله عز وجل علقه بشرط وهو التطليق ولم يطلقهن .أن يبدله أزواجا خيرا منكن لأنكن لو كنتن خيرا منهن ما طلقكن رسول الله صلى الله عليه وسلم قال معناه السدي . وقيل : هذا وعد من الله تعالى لرسوله صلى الله عليه وسلم ، لو طلقهن في الدنيا أن يزوجه في الدنيا نساء خيرا منهن . وقرئ \" أن يبدله \" بالتشديد والتخفيف . والتبديل والإبدال بمعنى ، كالتنزيل والإنزال . والله كان عالما بأنه كان لا يطلقهن ، ولكن أخبر عن قدرته ، على أنه إن طلقهن أبدله خيرا منهن تخويفا لهن . وهو كقوله تعالى : وإن تتولوا يستبدل قوما غيركم . وهو إخبار عن القدرة وتخويف لهم ، لا أن في الوجود من هو خير من أصحاب رسول الله صلى الله عليه وسلم .قوله تعالى : مسلمات يعني مخلصات ، قاله سعيد بن جبير . وقيل : معناه مسلمات لأمر الله تعالى وأمر رسوله .مؤمنات مصدقات بما أمرن به ونهين عنه .قانتات مطيعات . والقنوت : الطاعة . وقد تقدم .تائبات أي من ذنوبهن ; قاله السدي . وقيل : راجعات إلى أمر رسول الله صلى الله عليه وسلم تاركات لمحاب أنفسهن .عابدات أي كثيرات العبادة لله تعالى . وقال ابن عباس : كل عبادة في القرآن فهو التوحيد .سائحات صائبات ; قال ابن عباس والحسن وابن جبير . وقال زيد بن أسلم وابنه عبد الرحمن ويمان : مهاجرات . قال زيد : وليس في أمة محمد صلى الله عليه وسلم سياحة إلا الهجرة . والسياحة الجولان في الأرض . وقال الفراء والقتبي وغيرهما : سمي الصائم سائحا لأن السائح لا زاد معه ، وإنما يأكل من حيث يجد الطعام . وقيل : ذاهبات في طاعة الله عز وجل ; من ساح الماء إذا ذهب . وقد مضى في سورة \" التوبة \" والحمد لله .ثيبات وأبكارا أي منهن ثيب ومنهن بكر . وقيل : إنما سميت الثيب ثيبا لأنها راجعة إلى زوجها إن أقام معها ، أو إلى غيره إن فارقها . وقيل : لأنها ثابت إلى بيت أبويها . وهذا أصح ; لأنه ليس كل ثيب تعود إلى زوج . وأما البكر فهي العذراء ; سميت بكرا [ ص: 179 ] لأنها على أول حالتها التي خلقت بها . وقال الكلبي : أراد بالثيب مثل آسية امرأة فرعون ، وبالبكر مثل مريم ابنة عمران .قلت : وهذا إنما يمشي على قول من قال : إن التبديل وعد من الله لنبيه لو طلقهن في الدنيا زوجه في الآخرة خيرا منهن . والله أعلم .\n","ar.miqbas":"عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا (5)ليس هذا مما يتعلق بالشرط في قوله : { وإن تظاهرا عليه } [ التحريم : 4 ] بل هو كلام مستأنف عدل به إلى تذكير جميع أزواجه بالحذر من أن يضيق صدره عن تحمل أمثال هذا الصنيع فيفارقهن لتقلع المتلبسة وتحذر غيرها من مثل فعلها .فالجملة مستأنفة استئنافاً ابتدائياً عقبت بها جملة { إن تتوبا إلى الله فقد صغت قلوبكما } [ التحريم : 4 ] التي أفادت التحذير من عقاب في الآخرة إن لم تتوبا مما جرى منهما في شأن رسول الله صلى الله عليه وسلم أفاد هذا الإِيماء إلى التحذير من عقوبة دنيوية لهن يأمر الله فيها نبيئه صلى الله عليه وسلم وهي عقوبة الطلاق عليه ما يحصل من المؤاخذة في الآخرة إن لم تتوبا ، ولذلك فصلت عن التي قبلها لاختلاف الغرضين .وفي قوله : { عسى ربه إن طلقكن } إيجاز بحذف ما يترتب عليه إبدالهن من تقدير إن فارقكن . فالتقدير : عسى أن يطلقكن هو ( وإنما يطلق بإذن ربه ) أن يُبدله ربُّه بأزواج خيرٍ منكن .وفي هذا ما يشير إلى المعْنى الرابع عشر والخامس عشر من معاني الموعظة والإِرشاد التي ذكرناها آنفاً .و { عسى } هنا مستعملة في التحقيق وإيثارها هنا لأن هذا التبديل مجرد فرض وليس بالواقع لأنهن لا يظن بهن عدم الارعواء عما حذرن منه ، وفي قوله : { خيراً منكن } تذكير لهن بأنهن ما اكتسبن التفضيل على النساء إلا من فضل زوجهن عند الله وإجراء الأوصاف المفصلة بعد الوصف المجمل وهو { خيراً منكن } للتنبيه على أن أصول التفضيل موجودة فيهن فيكمل اللاء يتزوجهن النبي صلى الله عليه وسلم فضل على بقية النساء بأنهن صرن أزواجاً للنبيء صلى الله عليه وسلموهذه الآية إلى قوله : { خيراً منكن } نزلت موافِقة لقول عمر لابنته حفصة رضي الله عنهما مثل هذا اللفظ وهذا من القرآن الذي نزل وفاقاً لقول عمر أو رأيه تنويهاً بفضله . وقد وردت في حديث في «الصحيحين» واللفظ للبخاري «عن عمر قال : وافقت ربي في ثلاث : قلت : يا رسول الله لو اتخذت من مقام إبراهيم مصلّى ، فنزلت { واتخذوا من مقام إبراهيم مصلى } [ البقرة : 125 ] ، وقلت : «يدخلُ عليك البرّ والفاجر فلو أمرت أمهاتتِ المؤمنين بالحجاب» فأنزل الله آية الحجاب . وبلغنِي معاتبة النبي بعضَ نسائه فدخلت عليهن فقلت : إن انتهيتن أو ليبدلَنَّ الله رسولَه خيراً منكن فأنزل الله { عسى ربه إن طلقكن أن يبدله أزواجاً خيراً منكن مسلمات } الآية .وهي موعظة بأن يأذن الله له بطلاقهن وأنه تصير له أزواجٌ خيرٌ منهن .وهذا إشارة إلى المعنى السادس عشر من مواعظ هذه الآي . .وقرأ الجمهور { أن يبدّله } بتشديد الدال مضارع بدّل . وقرأه يعقوب بتخفيف مضارع أبدل .والمسلمات : المتصفات بالإِسلام . والمؤمنات : المصدّقات في نفوسهن .والقانتات : القائمات بالطاعة أحسن قيام . وتقدم القنوت في قوله تعالى : { وقوموا لله قانتين } في سورة [ البقرة : 238 ] . وقوله : { ومن يقنت منكن لله ورسوله } في سورة [ الأحزاب : 31 ] .وفي هذا الوصف إشعار بأنهن مطيعات لله ورسوله ففيه تعريض لما وقع من تقصير إحداهن في ذلك فعاتبها الله وأيقظها للتوبة .والتائبات : المقلعات عن الذنب إذا وقعن فيه . وفيه تعريض بإعادة التحريض على التوبة من ذنبهما التي أُمرتا بها بقوله : { إن تتوبا إلى الله } [ التحريم : 4 ] .والعابدات : المقبلات على عبادة الله وهذه الصفات تفيد الإِشارة إلى فضل هذه التقوى وهو المعنى السابع عشر من معاني العبرة في هذه الآيات .والسائحات : المهاجرات وإنما ذكر هذا الوصف لتنبيههن على أنهنّ إن كنّ يمتُنّ بالهجرة فإن المهاجرات غيرَهن كثير ، والمهاجرات أفضل من غيرهن ، وهذه الصفة تشير إلى المعنى الثامن عشر من معاني الاعتبار في هذه الآي .وهذه الصفات انتصبت على أنها نعوت ل { أزواجاً } ، ولم يعطف بعضُها على بعض الواو ، لأجل التنصيص على ثبوت جميع تلك الصفات لكل واحدة منهن ولو عطفت بالواو لاحتمل أن تكون الواو للتقسيم ، أي تقسيم الأزواج إلى من يثبت لهن بعض تلك الصفات دون بعض ، ألا ترى أنه لما أريدت إفادة ثبوت إحدى صفتين دون أخرى من النعتين الواقعين بعد ذلك كيف عطف بالواو قولُه : { وأبكاراً } لأن الثّيبات لا يوصفن بأبكار . والأبكار لا يوصفن بالثيّبات . قُلت وفي قوله تعالى : { مسلمات } ، إلى قوله : { سائحات } مُحسن الكلام المتزن إذْ يَلتئم من ذلك بيت من بحر الرمل التام: ... فاعلتن فاعلتن فاعلتنفاعلاتن فاعلاتن فاعلتن ... ووجه هذا التفصيل في الزوجات المقدرات لأن كلتا الصفتين محاسنها عند الرجال؛ فالثيب أرعى لواجبات الزوج وأميل مع أهوائه وأقوم على بيته وأحسن لِعاباً وأبهى زينة وأحلى غنجاً .والبكر أشد حياء وأكثر غرارة ودلاً وفي ذلك مجلبة للنفس ، والبكر لا تعرف رجلاً قبل زوجها ففي نفوس الرجال خلق من التنافس في المرأة التي لم يسبق إليها غيرهم .فما اعتزت واحدة من أزواج النبي صلى الله عليه وسلم بمزية إلا وقد أنبأها الله بأن سيبدله خيراً منها في تلك المزية أيضاً .وهذا هو المعنى التاسع عشر من معاني الموعظة والتأديب في هذه الآيات .وتقديم وصف { ثيبات } لأن أكثر أزواج النبي صلى الله عليه وسلم لمّا تزوجهن كن ثيبات . ولعله إشارة إلى أن الملام الأشد موجه إلى حفصة قبل عائشة وكانت حفصة ممن تزوجهن ثيبات وعائشة هي التي تزوجها بكراً . وهذا التعريض أسلوب من أساليب التأديب كما قيل : «الحر تكفيه الإِشارة» .وهذا هو المعنى العشرون من مغزى آداب هذه الآيات .ومن غرائب المسائل الأدبية المتعلقة بهذه الآية أن الواو في قوله تعالى : { ثيبات وأبكاراً } زَعمها ابنُ خَالويه واواً لها استعمال خاص ولقبها بواو الثمانية ( بفتح المثلثة وتخفيف التحتية بعد النون ) وتبعهُ جماعة ذكروا منهم الحريري والثعلبي النيسابوري المفسر والقاضي الفاضل .أنهم استخرجوا من القرآن أن ما فيه معنى عدد ثمانية تدخل عليه واو ويظهر من الأمثلة التي مثلوا بها أنهم يعتبرون ما دل على أمر معدود بعدد كما فيه سواء كان وصفاً مشتقاً من عدد ثمانية أو كان ذاتاً ثامنة أو كان يشتمل على ثمانية سواء كان ذلك مفرداً أو كان جملة . فقد مثلوا بقوله تعالى في سورة [ براءة : 112 ] : { التائبون العابدون الحامدون السائحون الراكعون الساجدون الآمرون بالمعروف والناهون عن المنكر } قالوا لم يعطف الصفات المسرودة بالواو إلا عند البلوغ إلى الصفة الثامنة وهي الناهون عن المنكر } . وجعلوا من هذا القبيل آية سورة التحريم إذ لم يعطف من الصفات المبدوءة بقوله : { مسلمات } إلا الثامنة وهي { وأبكاراً } ومثلوا لما وصف فيه بوصف ثامن بقوله تعالى : { ويقولون سبعة وثامنهم كلبهم } في سورة [ الكهف : 22 ] . فلم يعطف رابعهم } ولا { سادسهم } وعطفت الجملة التي وقع فيها وصف الثامن بواو عطف الجمل . ومثلوا لما فيه كلمة ثمانية بقوله تعالى : { سخرها عليهم سبع ليال وثمانية أيام حسوماً } في سورة [ الحاقة : 7 ] . ومثلوا لما يشتمل على ثمانية أسماء بقوله تعالى في سورة [ الزمر : 73 ] : { وسيق الذين اتقوا ربهم إلى الجنة زمراً حتى إذا جاءوها وفتحت أبوابها قالوا جاءت جملة وفتحت } هذه بالواو ولم تجىء أختها المذكورة قبلها وهي { وسيق الذين كفروا إلى جهنم زمراً حتى إذا جاءوها فتحت أبوابها } [ الزمر : 71 ] . لأن أبواب الجنة ثمانية .وترددت كلماتهم في أن هذه الواو من صنف الواو العاطفة يمتاز عن الصنف الآخر يلزم ذكره إذا كان في المعطوف معنى الثامن أو من صنف الواو الزائدة .وذكر الدمَاميني في الحواشي } الهندية على «المغني» أنه رأى في «تفسير العماد الكندي» قاضي الإِسكندرية ( المتوفى في نحو عشرين وسبعمائة ) نسبة القول بإثبات واو الثمانية إلى عبد الله الكفيف المالقي النحوي الغرناطي من علماء غرناطة في مدة الأمير ابن حَبوس ( بموحدة بعد الحاء المهملة ) هو باديس بن حبوس صاحب غرناطة سنة 420 .وذكر السهيلي في «الروض الأنف» عند الكلام على نزول سورة الكهف أنه أفرد الكلام على الواو التي يسميها بعض الناس واو الثمانية باباً طويلاً ولم يبد رأيه في إثباتها ولم أقف على الموضع الذي أفرد فيه الكلام عليها . ويظهر أنه غير موافق على إثبات هذا الاستعمال لها . ومن عجيب الصدف ما اتفق في هذه الآيات الأربع من مثير شبهة للذين أثبتوا هذا المعنى في معاني الواو . ومن غريب الفطنة تنبه الذي أنبأ بهذا .وذكر ابن المنير في «الانتصاف» أن شيخه ابن الحاجب ذكر له أن القاضي الفاضل عبد الرحيم البيساني الكاتب كان يعتقد أن الواو في قوله تعالى : { وأبكاراً } هي الواو التي سماها بعض ضعفة النحاة واو الثمانية .وكان الفاضلُ يتبجح باستخراجها زائدة على المواضع الثلاثة المشهورة إلى أن ذكره يوماً بحضيرة أبي الجود النحوي المقري ، فبين لهم أنه واهم في عدها من ذلك القبيل وأحال البيان على المعنى الذي ذكره الزمخشري في دعاء اللزوم إلى الإِتيان بالواو هنا لامتناع اجتماع هذين الصنفين في موصوف واحد . فأنصفه الفاضل وقال : أرشدتنا يا أبا الجود .قلت : وأرى أن القاضي الفاضل تعجل التسليم لأبي الجُود إذ كان له أن يقول : إنا لم نلتزم أن يكون المعدود الثامن مستقلاً أو قسيماً لغيره وإنما تتبعنا ما فيه إشعار بعدد ثمانية .ونقل الطيبي والقزويني في «حاشيتي الكشاف» أنه روى عن صاحب «الكشاف» أنه قال : الواو تدخل في الثامن كقوله تعالى : { وثامنهم كلبهم } [ الكهف : 22 ] ، وقوله : { وفتحت أبوابها } [ الزمر : 73 ] ويسمونه واو الثمانية وهي كذلك ، وليس بشيء . قال الراوي عنه وقد قال لنا عند قراءة هذا الموضع : أنسيتم واو الثمانية عند جوابي هذا ( أي يلومهم على إهمالهم ذلك المعنى في تلك الآية ) أي هو جواب حسن وذلك خطأ محض لا يجوز أن يؤخذ به اه .قلت : وهذا يخالف صريح كلامه في «الكشاف» فلعل الراوي لم يحسن تحرير مراد صاحب «الكشاف» ، أو لعل صاحب «الكشاف» لم ير منافاة بين لزوم ذكر الواوين اقتضاء المقام ذكرها بأن المعطوف بها ثامن في الذكر فإن النكت لا تتزاحم فتأمل بتدقيق .وتقدم الكلام على واو الثمانية عند قوله تعالى : { التائبون العابدون } الآية في سورة [ براءة : 112 ] . وعند قوله : { ويقولون سبعة وثامنهم كلبهم } في سورة [ الكهف : 22 ] ، وتقدمت في سورة الزمر وفي سورة الحاقة .\n","ar.waseet":"ثم أضاف - سبحانه - إلى تكريمه لنبيه تكريما آخر ، وإلى تهديده لمن تسىء إليه من أزواجه تهديدا آخر فقال - تعالى - : ( عسى رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَاجاً خَيْراً مِّنكُنَّ ) .قال الجمل ما ملخصه : سبب نزولها أنه - صلى الله عليه وسلم - لما أشاعت حفصة ما أسرها به ، اغتم - صلى الله عليه وسلم - وحلف أن لا يدخل عليهن شهرا مؤاخذة لهن .ولما بلغ عمر - رضى الله عنه - أن النبى - صلى الله عليه وسلم - قد اعتزل نساءه . . . قال له يا رسول الله : لا يشق عليك أمر النساء ، فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكائيل ، وأنا وأبو بكر والمؤمنون معك .قال عمر : وقلما تكلمت بكلام إلا رجوت أن الله يصدق قولى الذى أقوله فنزلت هذه الآية .فاستأذن عمر النبى - صلى الله عليه وسلم - أن يخبر الناس أنه لم يطلق نساءه فأذن له فقام على باب المسجد ، ونادى بأعلى صوته : لم يطلق النبى - صلى الله عليه وسلم - نساءه .و ( عسى ) كلمت تستعمل فى الرجاء ، والمراد بها هنا التحقيق ، لأنها صادرة عن الله - عز وجل - .قال الآلوسى : ( عسى ) فى كلامه - تعالى - للوجوب ، وأن الوجوب هنا إنما هو بعد تحقق الشرط وقيل : هى كذلك إلا هنا ، والشرط معترض بين اسم ( عسى ) وخبرها .والجواب محذوف . أى : إن طلقكن فعسى . . . و ( أَزْوَاجاً ) مفعلو ثان ل ( يُبْدِلَ ) و ( خَيْراً ) صفته .أى : عسى إن طلقكن رسولنا محمد - صلى الله عليه وسلم - بإذن ربه ومشيئته ، أن يبدله - سبحانه - أزواجا خيرا منكن .ثم وصف - سبحانه - هؤلاء الأزواج بقوله ( مُسْلِمَاتٍ ) منقادات ومطيعات لله ولرسوله ، ومتصفات بكل الصفات التى أمر بها الإسلام .( مُّؤْمِنَاتٍ ) أى : مذعنات ومصدقات بقلوبهن لكل ما جاء به النبى - صلى الله عليه وسلم - من عند ربه .( قَانِتَاتٍ ) أى : قائمات بالطاعة لله ولرسوله على أكمل وجه .( تَائِبَاتٍ ) أى : مقلعات عن الذنوب والمعاصى ، وإذا مسهن شىء منها ندمن وتبن إليه - تعالى - توبة صادقة نصوحا .( عَابِدَاتٍ ) أى : مقبلات على عبادته - تعالى - إقبالا عظيما .( سَائِحَاتٍ ) أى : ذاهبات فى طاعة الله أى مذهب ، من ساح الماء : إذا سال فى انحاء متعددة ، وقيل معناه : مهاجرات . وقيل : صائمات . تشبيها لهن بالسائح الذى لا يصحب معه الزاد غالبا فلا يزال ممسكا عن الطعام حتى يجده .( ثَيِّبَاتٍ ) جمع ثيب - بوزن سيد - وهى المرأة التى سبق لها الزواج ، من ثاب يثوب ثوبا ، إذا رجع ، وسميت المرأة التى سبق لها الزواج بذلك . لأنها ثابت إلى بيت أبويها بعد زواجها ، أو رجعت إلى زوج آخر غير زوجها الأول .( وَأَبْكَاراً ) جمع بكر ، وهى الفتاة العذراء التى لم يسبق لها الزواج ، وسميت بذلك لأنها لا تزال على أول حالتها التى خلقت عليها .وهذه الصفات جاءت منصوبة على أنها نعت لقوله ( أَزْوَاجاً ) . أو حال .ولم يعطف بعضها على بعض بالواو ، لأجل التنصيص على ثبوت جميع تلك الصفات لكل واحدة منهن .وعطف - سبحانه - ( وَأَبْكَاراً ) على ما قبله لتنافى الوصفين ، إذ الثيبات لا يوصفن بالأبكار ، وكذلك الأبكار لا يوصفن بالثيبات ، ولا يجتمع الوصفان فى ذات واحدة .قال صاحب الكشاف : فإن قلت : كيف تكون المبدلات خيراً منهن ، ولم يكن على وجه الأرض نساء خير من أمهات المؤمنين؟قلت : إذا طلقهن رسول الله - صلى الله عليه وسلم - لعصيانهن له ، وإيذائهن إياه ، لم يبقين على تلك الصفة ، وكان غيرهن من الموصوفات بهذه الأوصاف مع الطاعة لرسول الله - صلى الله عليه وسلم - والنزول على هذاه ورضاه خيرا منهن .فإن قلت : لم أخليت الصفات كلها من العاطف ، ووسط بين الثبات والأبكار؟ قلت : لأنهما صفتان متنافيتان لا يجتمعان فيهن اجتماع سائر الصفات فيهن ، فلم يكن بد من الواو .هذا ، موال متأمل فى هذه الآيات الكريمة يراها ترسم جانبا من حياة الرسول - صلى الله عليه وسلم - مع أزواجه ، وهذا الجانب فيه ما فيه من العظات التى من أبرزها تكريم الله - تعالى - لنبيه - صلى الله عليه وسلم - وإرشاده إلى ما هو أهدى وأقوم ، وسمو أخلاقه - صلى الله عليه وسلم - فى معاملته لأهله ، وتحذير أزواجه من أن يتصرفن أى تصرف لا يرغب فيه ، ولا يميل إليه : وتعليم المؤمنين والمؤمنات - فى كل زمان ومكان - كيف تكون العلاقة الطيبة بين الرجال والنساء .ثم وجه - سبحانه - بعد ذلك نداءين إلى المؤمنين ، أمرهم فى أولهما أن يؤدوا واجبهم نحو أنفسهم ونحو أهليهم ، حتى ينجو من عذاب النار ، وأمرهم فى ثانيهما بالمداومة على التوبة الصادقة النصوح ، ووجه نداء إلى الكافرين بين لهم فيه سوء عاقبة كفرهم .\n","ar.baghawi":"( عسى ربه إن طلقكن ) أي : واجب من الله إن طلقكن رسوله ( أن يبدله أزواجا خيرا منكن مسلمات ) خاضعات لله بالطاعة ( مؤمنات ) مصدقات بتوحيد الله ( قانتات ) طائعات ، وقيل : داعيات . وقيل : مصليات ( تائبات عابدات سائحات ) صائمات ، وقال زيد بن أسلم : مهاجرات وقيل : يسحن معه حيث ما ساح ( ثيبات وأبكارا ) وهذا في الإخبار عن القدرة لا عن الكون لأنه قال : \" إن طلقكن \" وقد علم أنه لا يطلقهن وهذا كقوله : وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم ( محمد - 38 ) وهذا في الإخبار عن القدرة لأنه ليس في الوجود أمة خير من أمة محمد - صلى الله عليه وسلم - .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5234.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5234.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5234.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ","transliteration":"Yaaa ayyuhal lazeena samanoo qooo anfusakum wa ahleekum naaranw waqoodu han naasu wal hijaaratu 'alaihaa malaaa'ikatun ghilaazun shidaadul laa ya'soonal laaha maa amarahum wa yaf'aloona maa yu'maroon","translations":{"en.ahmedali":"O you who believe, save yourselves and your families from the Fire whose fuel is men and rocks, over which are appointed angels stern and severe as wardens who never disobey what God commands them, and do what they are commanded;","en.ahmedraza":"O People who Believe! Save yourselves and your families from the fire, the fuel of which is men and stones – appointed over it are the extremely strict angels, who do not refuse the command of Allah and carry out whatever they are commanded.","en.arberry":"Believers, guard yourselves and your families against a Fire whose fuel is men and stones, and over which are harsh, terrible angels who disobey not God in what He commands them and do what they are commanded.","en.asad":"O YOU who have attained to faith! Ward off from yourselves and those who are close to you that fire [of the hereafter] whose fuel is human beings and stones: [lording] over it are angelic powers awesome [and] severe, who do not disobey God in whatever He has commanded them, but [always] do what they are bidden to do.","en.daryabadi":"O ye who believe! protect yourselves and your households from a Fire the fuel whereof is mankind and stones, over which are angels, stern, strong; they disobey not Allah in that which He commandeth them, and do that which they are commanded.","en.hilali":"O you who believe! Ward off from yourselves and your families a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not, (from executing) the Commands they receive from Allah, but do that which they are commanded.","en.pickthall":"O ye who believe! Ward off from yourselves and your families a Fire whereof the fuel is men and stones, over which are set angels strong, severe, who resist not Allah in that which He commandeth them, but do that which they are commanded.","en.qaribullah":"Believers, guard yourselves and your families against the Fire the fuel of which is people and stones, over which there are harsh, and stern angels who never disobey Allah in that which He orders and do what they are ordered.","en.sahih":"O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.","en.sarwar":"Believers, save yourselves and your families from the fire which is fueled by people and stones and is guarded by stern angels who do not disobey God's commands and do whatever they are ordered to do.","en.yusufali":"O ye who believe! save yourselves and your families from a Fire whose fuel is Men and Stones, over which are (appointed) angels stern (and) severe, who flinch not (from executing) the Commands they receive from Allah, but do (precisely) what they are commanded.","en.maududi":"Believers, guard yourselves and your kindred against a Fire whose fuel is human beings and stones, a Fire held in the charge of fierce and stern angels who never disobey what He has commanded them, and always do what they are bidden.","en.shakir":"O you who believe! save yourselves and your families from a fire whose fuel is men and stones; over it are angels stern and strong, they do not disobey Allah in what He commands them, and do as they are commanded.","en.itani":"O you who believe! Protect yourselves and your families from a Fire, whose fuel is people and stones. Over it are angels, fierce and powerful. They never disobey God in anything He commands them, and they carry out whatever they are commanded.","en.mubarakpuri":"O you who believe! Protect yourselves and your families against a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not the commands they receive from Allah, but do that which they are commanded.","en.qarai":"O you who have faith! Save yourselves and your families from a Fire whose fuel will be people and stones, over which are [assigned] severe and mighty angels, who do not disobey whatever Allah commands them and carry out what they are commanded.","en.wahiduddin":"Believers, safeguard yourselves and your families from a Fire fuelled by people and stones, and watched over by angels, stern and strong: angels who never disobey God's commands to them, but promptly do as they are commanded."},"tafsir":{"ar.muyassar":"يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، احفظوا أنفسكم بفعل ما أمركم الله به وترك ما نهاكم عنه، واحفظوا أهليكم بما تحفظون به أنفسكم من نار وقودها الناس والحجارة، يقوم على تعذيب أهلها ملائكة أقوياء قساة في معاملاتهم، لا يخالفون الله في أمره، وينفذون ما يؤمرون به.","ar.jalalayn":"«‌يا أيها الذين آمنوا قوا أنفسكم وأهليكم» بالحمل على طاعة الله «نارًا وقودها الناس» الكفار «والحجارة» كأصنامهم منها، يعني أنها مفرطة الحرارة تتقد بما ذكر لا كنار الدنيا تتقد بالحطب ونحوه «عليها ملائكة» خزنتها عدتهم تسعة عشر كما سيأتي في (المدثر) «غلاظ» من غلظ القلب «شداد» في البطش «لا يعصون الله ما أمرهم» بدل من الجلالة، أي لا يعصون أمر الله «ويفعلون ما يؤمرون» تأكيد والآية تخويف للمؤمنين عن الارتداد وللمنافقين المؤمنين بألسنتهم دون قلوبهم.","ar.qurtubi":"قوله تعالى : ياأيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة عليها ملائكة غلاظ شداد لا يعصون الله ما أمرهم ويفعلون ما يؤمرونفيه مسألة واحدة :وهي الأمر بوقاية الإنسان نفسه وأهله النار . قال الضحاك : معناه قوا أنفسكم ، وأهلوكم فليقوا أنفسهم نارا . وروى علي بن أبي طلحة عن ابن عباس : قوا أنفسكم وأمروا أهليكم بالذكر والدعاء حتى يقيهم الله بكم . وقال علي رضي الله عنه وقتادة ومجاهد : قوا أنفسكم بأفعالكم وقوا أهليكم بوصيتكم . ابن العربي : وهو الصحيح ، والفقه الذي يعطيه العطف الذي يقتضي التشريك بين المعطوف والمعطوف عليه في معنى الفعل ; كقوله :علفتها تبنا وماء بارداوكقوله :ورأيت زوجك في الوغى     متقلدا سيفا ورمحافعلى الرجل أن يصلح نفسه بالطاعة ، ويصلح أهله إصلاح الراعي للرعية . ففي صحيح الحديث أن النبي صلى الله عليه وسلم قال : \" كلكم راع وكلكم مسئول عن رعيته ، فالإمام الذي على الناس راع وهو مسئول عنهم ، والرجل راع على أهل بيته وهو مسئول عنهم \" . وعن هذا عبر الحسن في هذه الآية بقوله : يأمرهم وينهاهم . وقال بعض العلماء لما قال : قوا أنفسكم دخل فيه الأولاد ; لأن الولد بعض منه . كما دخل في قوله تعالى : ولا على أنفسكم أن تأكلوا من بيوتكم [ ص: 180 ] فلم يفردوا بالذكر إفراد سائر القرابات . فيعلمه الحلال والحرام ، ويجنبه المعاصي والآثام ، إلى غير ذلك من الأحكام . وقال عليه السلام : حق الولد على الوالد أن يحسن اسمه ويعلمه الكتابة ويزوجه إذا بلغ . وقال عليه السلام : \" ما نحل والد ولدا أفضل من أدب حسن \" . وقد روى عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم \" مروا أبناءكم بالصلاة لسبع ، واضربوهم عليها لعشر ، وفرقوا بينهم في المضاجع \" . خرجه جماعة من أهل الحديث . وهذا لفظ أبي داود . وخرج أيضا عن سمرة بن جندب قال : قال النبي صلى الله عليه وسلم : \" مروا الصبي بالصلاة إذا بلغ سبع سنين ، فإذا بلغ عشر سنين فاضربوه عليها \" . وكذلك يخبر أهله بوقت الصلاة ووجوب الصيام ووجوب الفطر إذا وجب ; مستندا في ذلك إلى رؤية الهلال . وقد روى مسلم أن النبي صلى الله عليه وسلم كان إذا أوتر يقول : \" قومي فأوتري يا عائشة \" . وروي أن النبي صلى الله عليه وسلم قال : \" رحم الله امرأ قام من الليل فصلى فأيقظ أهله ، فإن لم تقم رش وجهها بالماء ، رحم الله امرأة قامت من الليل تصلي وأيقظت زوجها ، فإذا لم يقم رشت على وجهه من الماء \" . ومنه قوله صلى الله عليه وسلم : \" أيقظوا صواحب الحجر \" . ويدخل هذا في عموم قوله تعالى : وتعاونوا على البر والتقوى . وذكر القشيري أن عمر رضي الله عنه قال لما نزلت هذه الآية : [ ص: 181 ] يا رسول الله ، نقي أنفسنا ، فكيف لنا بأهلينا ؟ . فقال : \" تنهونهم عما نهاكم الله وتأمرونهم بما أمر الله \" . وقال مقاتل : ذلك حق عليه في نفسه وولده وأهله وعبيده وإمائه . قال الكيا : فعلينا تعليم أولادنا وأهلينا الدين والخير ، وما لا يستغنى عنه من الأدب . وهو قوله تعالى : وأمر أهلك بالصلاة واصطبر عليها . ونحو قوله تعالى للنبي صلى الله عليه وسلم : وأنذر عشيرتك الأقربين . . وفي الحديث : \" مروهم بالصلاة وهم أبناء سبع \" .وقودها الناس والحجارة تقدم في سورة \" البقرة \" .عليها ملائكة غلاظ شداد يعني الملائكة الزبانية غلاظ القلوب لا يرحمون إذا استرحموا ، خلقوا من الغضب ، وحبب إليهم عذاب الخلق كما حبب لبني آدم أكل الطعام والشراب . شداد أي شداد الأبدان . وقيل : غلاظ الأقوال شداد الأفعال . وقيل غلاظ في أخذهم أهل النار شداد عليهم . يقال : فلان شديد على فلان ; أي قوي عليه يعذبه بأنواع العذاب . وقيل : أراد بالغلاظ ضخامة أجسامهم ، وبالشدة القوة . قال ابن عباس : ما بين منكبي الواحد منهم مسيرة سنة ، وقوة الواحد منهم أن يضرب بالمقمع فيدفع بتلك الضربة سبعين ألف إنسان في قعر جهنم . وذكر ابن وهب قال : وحدثنا عبد الرحمن بن زيد قال : قال رسول الله صلى الله عليه وسلم في خزنة جهنم : \" ما بين منكبي أحدهم كما بين المشرق والمغرب \" .قوله تعالى : لا يعصون الله ما أمرهم أي لا يخالفونه في أمره من زيادة أو نقصان .ويفعلون ما يؤمرون أي في وقته ، فلا يؤخرونه ولا يقدمونه . وقيل أي لذتهم في امتثال أمر الله ; كما أن سرور أهل الجنة في الكون في الجنة ; ذكره بعض المعتزلة . وعندهم أنه يستحيل التكليف غدا . ولا يخفى معتقد أهل الحق في أن الله يكلف العبد اليوم وغدا ، ولا ينكر التكليف في حق الملائكة . ولله أن يفعل ما يشاء .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ (6)كانت موعظة نساء النبي صلى الله عليه وسلم مناسبة لتنبيه المؤمنين لعدم الغفلة عن موعظة أنفسهم وموعظة أهليهم وأن لا يصدّهم استبقاء الودّ بينهم عن إسداء النصح لهم وإن كان في ذلك بعض الأذى .وهذا نداء ثان موجه إلى المؤمنين بعد استيفاء المقصود من النداء الأول نداءِ النبي صلى الله عليه وسلم بقوله تعالى : { يا أيها النبي لم تحرم ما أحل الله لك } [ التحريم : 1 ] .وجه الخطاب إلى المؤمنين ليأتنسوا بالنبي صلى الله عليه وسلم في موعظة أهليهم .وعبر عن الموعظة والتحذير بالوقاية من النار على سبيل المجاز لأن الموعظة سبب في تجنب ما يفضي إلى عذاب النار أو على سبيل الاستعارة بتشبيه الموعظة بالوقاية من النار على وجه المبالغة في الموعظة .وتنكير «نار» للتعظيم وأجرى عليها وصف بجملة { وقودها الناس والحجارة } زيادة في التحذير لئلا يكونوا من وقود النار . وتذكيراً بحال المشركين الذي في قوله تعالى : { إنكم وما تعبدون من دون الله حصب جهنم } في سورة [ الأنبياء : 98 ] . وتفظيعاً للنار إذ يكون الحجر عِوضاً لها عن الحَطب .ووصفت النار بهذه الجملة لأن مضمون هذه الجملة قد تقرر في علم المسلمين من قبل نزول هذه الآية بما تقدم في سورة [ البقرة : 24 ] من قوله تعالى : { فاتقوا النار التي وقودها الناس والحجارة أعدت للكافرين } وبما تقدمهما معاً من قوله : { إنكم وما تعبدون من دون الله حصب جهنم } في سورة [ الأنبياء : 98 ] .والحجارة } : جمع الحجر على غير قياس فإن قياسه أحجار فجمعوه على حِجارٍ بوزن فِعال وألحقوا به هاء التأنيث كما قالوا : بِكارة جمع بَكر ، ومِهارة جمع مُهْر .وزيد في تهويل النار بأنَّ عليها ملائكة غلاظاً شداداً وجملة { عليها ملائكة } إلى آخرها صفة ثانية .ومعنى { عليها } أنهم موكلون بها . فالاستعلاء المفاد من حرف ( على ) مستعار للتمكن كما تقدم في قوله تعالى : { أولئك على هدى من ربهم } [ البقرة : 5 ] . وفي الحديث \" فلم يكن على بابه بوّابون \"و { غلاظ } جمع غليظ وهو المتصف بالغلظة . وهي صفة مشبهة وفعلها مِثل كَرُم . وهي هنا مستعارة لقساوة المعاملة كقوله تعالى : { ولو كنتَ فظّاً غليظ القلب لانفضوا من حولك } [ آل عمران : 159 ] أي لو كنت قاسياً لما عاشروك .و«شداد» : جمع شديد . والشدة بكسر الشين حقيقتها قوة العمل المؤذي والموصوف بها شديد . والمعنى : أنهم أقوياء في معاملة أهل النار الذين وكلوا بهم : يقال : اشتدّ فلان على فلان ، أي أساء معاملته ، ويقال : اشتدّت الحرب ، واشتدت البأساء . والشدة من أسماء البؤس والجوع والقحط .وجملة { لا يعصون الله ما أمرهم } ثناء عليهم أعقب به وصفهم بأنهم غلاظ شداد تعديلاً لما تقتضيانه من كراهية نفوس الناس إياهم ، وهذا مؤذن بأنهم مأمورون بالغلظة والشدة في تعذيب أهل النار .وأما قوله : { ويفعلون ما يؤمرون } فهو تصريح بمفهوم { لا يعصون الله ما أمرهم } دعا إليه مقام الإِطناب في الثناء عليهم ، مع ما في هذا التصريح من استحضار الصورة البديعة في امتثالهم لما يؤمرون به . وقد عُطف هذا التأكيد عطفاً يقتضي المغايرة تنويهاً بهذه الفضيلة لأن فعل المأمور أوضح في الطاعة من عدم العصيان واعتبار لمغايرة المعنيين وإن كان قالهما واحد ولك أن تجعل مرجع { لا يعصون الله ما أمرهم } أنهم لا يعصون فيما يكلفون به من أعمالهم الخاصة بهم ، ومرجع { ويفعلون ما يؤمرون } إلى ما كلفوا بعمله في العصاة في جهنم .\n","ar.waseet":"ثم وجه - سبحانه - نداء إلى النبى - صلى الله عليه وسلم - أمره فيه بأن يجاهد الكفار والمنافقين جهاداً مصحوبا بالغلظة والخشونة . . . فقال - تعالى - : ( ياأيها الذين آمَنُواْ . . . ) .قوله - تعالى - : ( قوا ) أمر من الوقاية ، يقال : وقى يَقِى ، كضرب يضرب .والمعنى : يا من آمنتم بالله - تعالى - حق الإيمان ، أبعدوا أنفسكم عن النار عن طريق فعل الحسنات . واجتناب السيئات ، وأبعدوا أهليكم - أيضا - عنها ، عن طريق نصحهم وإرشادهم وأمرهم بالمعروف . ونهيهم عن المنكر .قال القرطبى ، قال قتادة ومجاهد : قوا أنفسكم بأفعالكم ، وقوا أهليكم بوصيتكم .ففى الحديث الصحيح أن النبى - صلى الله عليه وسلم - قال : \" كلكم راع وكلكم مسئول عن رعيته فالإمام الذى على الناس راع وهو مسئول عنهم ، والرجل راع على أهل بيته وهو مسئول عنهم \" .وقال - صلى الله عليه وسلم - : \" ما نحل والد ولدا ، أفضل من أدب حسن \" .وقال - صلى الله عليه وسلم - : \" مروا أبناءكم بالصلاة لسبع ، واضربوهم عليها لعشر ، وفرقوا بينهم فى المضاجع \" .وقد روى مسلم فى صحيحه \" أن النبى - صلى الله عليه وسلم - كان إذا أوتر يقول : قومى فأوترى يا عائشة \" .وذكر القشيرى \" أن عمر - رضى الله عنه - لما نزلت هذه الآية قال يا رسول الله : نقى أنفسنا فكيف بأهلينا؟فقال : \" تنهونهم عما نهاكم الله عنه ، وتأمرونهم بما أمركم الله به \" \" .وجاء لفظ النار منكراً ، للتهويل . أى : نارا عظيمة لا يعلم مقدار حرها إلا الله - تعالى - .وقوله : ( وَقُودُهَا الناس والحجارة ) أى : هذه النار لا توقد كما يوقد غيرها بالحطب وما يشبهها ، وإنما مادة اشتعالها تتكون من الناس الذين كانوا فى الدنيا يشركون مع الله - تعالى - آلهة أخرى فى العبادة ، ومن الحجارة التى كانت تعبد من دونه - تعالى - .ثم أضاف - سبحانه - إلى تهويلها أمرا آخر وصفة أخرى فقال : ( عَلَيْهَا مَلاَئِكَةٌ غِلاَظٌ شِدَادٌ لاَّ يَعْصُونَ الله مَآ أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ ) .والغلاظ : جمع غليظ وهو المتصف بالضخامة والغلظة التى هى ضد الرقة .وهذا اللفظ صفة مشبهة ، وفعله غلظ ككرم .وشداد : جمع شديد ، وهو المتصف بالقوة والشدة ، يقال : فلان شديد على فلان ، أى : قوى عليه ، بحيث يستطيع أن ينزل به ما يريد من الأذى والعقاب .أى : هذه النار من صفاتها - أيضا - أن الموكلين بإلقاء الكافر والفساق فيها ، ملائكة قساة فى أخذهم أهل النار ، أقوياء عليهم ، بحيث لا يستطيع أهل النار أن يفلتوا منهم ، أو أن يعصوا لهم أمرا .وهؤلاء الملائكة من صفاتهم كذلك أنهم لا يعصون لله - تعالى - أمرا . وإنما ينفذون ما يكلفهم - سبحانه - به تنفيذا تاما .قال صاحب الكشاف : فإن قلت أليس الجملتان - لا يعصون .. . ويفعلون فى معنى واحد؟قلت : لا فإن معنى الأولى أنهم يتقلبون أوامره ويلتزمونها ولا يأبونها ولا ينكرونها ، ومعنى الثانية : أنهم يؤدون ما يؤمرون به ، ولا يتثاقلون عنه ولا يتوانون فيه .\n","ar.baghawi":"قوله - عز وجل - ( ياأيها الذين آمنوا قوا أنفسكم ) قال عطاء عن ابن عباس : أي بالانتهاء عما نهاكم الله تعالى عنه والعمل بطاعته ( وأهليكم نارا ) يعني : مروهم بالخير وانهوهم عن الشر وعلموهم وأدبوهم تقوهم بذلك نارا ( وقودها الناس والحجارة عليها ملائكة ) يعني خزنة النار ( غلاظ ) فظاظ على أهل النار ( شداد ) أقوياء يدفع الواحد منهم بالدفعة الواحدة سبعين ألفا في النار وهم الزبانية ، لم يخلق الله فيهم الرحمة ( لا يعصون الله ما أمرهم ويفعلون ما يؤمرون)\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5235.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5235.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5235.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ","transliteration":"Yaaa ayyuhal lazeena kafaroo la ta'tazinul yawma innamaa tujzawna maa kuntum ta'maloon","translations":{"en.ahmedali":"(And say:) \"O you who do not believe, make no excuses today. You will be requited only for what you had done.\"","en.ahmedraza":"“O disbelievers! Do not feign excuses this day; you will only be repaid what you used to do.”","en.arberry":"'O you unbelievers, do not excuse yourselves today; you are only being recompensed for what you were doing.'","en.asad":"[Hence,] O you who are bent on denying the truth, make no [empty] excuses today: [in the life to come] you shall be but recompensed for what you were doing [in this world].","en.daryabadi":"O ye who disbelieve! excuse not yourselves To-day; ye are only being requited for that which ye have been working.","en.hilali":"(It will be said in the Hereafter) O you who disbelieve (in the Oneness of Allah - Islamic Monotheism)! Make no excuses this Day! You are being requited only for what you used to do.","en.pickthall":"(Then it will be said): O ye who disbelieve! Make no excuses for yourselves this day. Ye are only being paid for what ye used to do.","en.qaribullah":"Unbelievers, make no excuse for yourselves this Day. You shall be recompensed only according to your deeds.","en.sahih":"O you who have disbelieved, make no excuses that Day. You will only be recompensed for what you used to do.","en.sarwar":"Disbelievers (will be told on the Day of Judgment), \"Do not make any excuses on this day; you are only receiving recompense for what you have done\".","en.yusufali":"(They will say), \"O ye Unbelievers! Make no excuses this Day! Ye are being but requited for all that ye did!\"","en.maududi":"(It will then be said): “Unbelievers, make no excuses today. You are being recompensed for nothing else but your deeds.”","en.shakir":"O you who disbelieve! do not urge excuses today; you shall be rewarded only according to what you did.","en.itani":"O you who disbelieved! Make no excuses today. You are being repaid for what you used to do.","en.mubarakpuri":"(It will be said in the Hereafter) O you who disbelieve! Make no excuses this Day! You are being requited only for what you used to do.","en.qarai":"[They will call out to the faithless:] ‘O faithless ones! Do not make any excuses today. You are being requited only for what you used to do.’","en.wahiduddin":"You who are bent on denying the truth, make no excuses today: you are only being rewarded according to your deeds."},"tafsir":{"ar.muyassar":"ويقال للذين جحدوا أن الله هو الإله الحق وكفروا به عند إدخالهم النار: لا تلتمسوا المعاذير في هذا اليوم؛ إنما تعطون جزاء الذي كنتم تعملونه في الدنيا.","ar.jalalayn":"«يا أيها الذين كفروا لا تعتذروا اليوم» يقال لهم ذلك عند دخولهم النار، أي لأنه لا ينفعكم «إنما تجزون ما كنتم تعملون» أي جزاءه.","ar.qurtubi":"قوله تعالى : ياأيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملونقوله تعالى : يا أيها الذين كفروا لا تعتذروا اليوم فإن عذركم لا ينفع . وهذا النهي لتحقيق اليأس .إنما تجزون ما كنتم تعملون في الدنيا . ونظيره : فيومئذ لا ينفع الذين ظلموا معذرتهم ولا هم يستعتبون . وقد تقدم .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ (7)هو من قول الملائكة الذين على النار . وذكر هذه المقالة هنا استطرَاد يُفيد التنفير من جهنم بأنها دار أهل الكفر كما قال تعالى : { فاتقوا النار التي وقودها الناس والحجارة أعدت للكافرين } [ البقرة : 24 ] ، وإلاّ فإن سياق الآية تحذير للمؤمنين من الموبقات في النار .ومعنى { ما كنتم تعملون } مماثل { ما كنتم تعملون } ، وأفادت { إنما } قصرَ الجزاء على مماثلة العمل المجزى عليه قصرَ قلب لتنزيلهم منزلة من اعتذر وطلب أن يكون جزاؤه أهون مما شاهده .والاعتذار : افتعال مشتق من العُذر . ومادة الافتعال فيه دالة على تكلف الفعل مثل الاكتساب والاختلاق ، والعذر : الحجة التي تُبرىء صاحبها من تِبعة عمل مّا . وليس لمادة الاعتذار فعل مجرد دال على إيجاد العذر وإنما الموجود عَذَر بمعنى قِبل العُذر ، وقد تقدم عند قوله تعالى : { وجاء المعذرون من الأعراب } في سورة [ براءة : 90 ] .\n","ar.waseet":"ثم بين - سبحانه - ما تقوله الملائكة لأهل النار عند ما يعرضون عليها فقال : ( ياأيها الذين كَفَرُواْ لاَ تَعْتَذِرُواْ اليوم ) والمراد باليوم ، يوم القيامة فأل فيه للعهد .أى : تقول الملائكة لهم فى هذا اليوم العسير على سبيل التبكيت والتوبيخ - لا تعتذروا - أيها الكافرون عن كفركم ، بأن تقولوا ما جاءنا من بشير ولا نذير أو بأن غيرنا أضلنا ، أو بأننا ما كنا مشركين . . . فإن هذه الأعذار لن تنفعكم ، وأنتم فى هذا اليوم إنما تعاقبون على كفركم فى الدنيا ، وعلى إصراركم على ذلك حتى أدرككم الموت .فالآية الكريمة تبيوخ الكافرين ، وتيئيس لهم من قبلو أعذارهم الكاذبة .\n","ar.baghawi":"\"يا أيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5236.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5236.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5236.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَىٰ رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","transliteration":"Yaaa ayyuhal lazeena aammano toobooo ilal laahi tawbatan nasoohan 'asaa rabbukum any-yukaffira 'ankum sayyi aatikum wa yudkhilakum jannaatin tajree min tahtihal anhaaru yawma laa yukhzil laahun nabiyya wallazeena aamanoo ma'ahoo nooruhum yas'aa baina aydeehim wa bi aymaanihim yaqooloona rabbanaaa atmim lanaa nooranaa waghfir lana innaka 'alaa kulli shai'in qadeer","translations":{"en.ahmedali":"O you who believe, turn to God truly in repentance. Perhaps your Lord may forgive your ills and admit you to gardens with rivers flowing by on the day when God will not humiliate the Prophet and those who believe with him. Their light will move in front of them and to their right, and they will say: \"O Lord, perfect our light and forgive us. You have power over every thing.\"","en.ahmedraza":"O People who Believe! Incline towards Allah in a repentance that becomes a guidance for the future; it is likely that your Lord will relieve you of your sins and admit you into Gardens beneath which rivers flow – on the day when Allah will not humble the Prophet and the believers along with him; their light will be running ahead of them and on their right; they will say, “Our Lord! Perfect our light for us, and forgive us; indeed You are Able to do all things.”","en.arberry":"Believers, turn to God in sincere repentance; it may be that your Lord will acquit you of your evil deeds, and will admit you into gardens underneath which rivers flow. Upon the day when God will not degrade the Prophet and those who believe with him, their light running before them, and on their right hands; and they say, 'Our 'Lord, perfect for us our light, and forgive us; surely Thou art powerful over everything.'","en.asad":"O you who have attained to faith! Turn unto God in sincere repentance: it may well be that your Sustainer will efface from you your bad deeds, and will admit you into gardens through which running waters flow, on a Day on which God will not shame the Prophet and those who share his faith: their light will spread rapidly before them, and on their right; [and] they will pray: \"O our Sustainer! Cause this our light to shine for us forever, and forgive us our sins: for, verily, Thou hast the power to will anything!\"","en.daryabadi":"O ye who believe! turn Unto Allah with a sincere repentance. Belike your Lord will expiate from you your misdeeds and cause you to enter Gardens whereunder rivers flow, on the Day whereon Allah will not humiliate the prophet and those who believe with him. Their light will be running before them and on their right hands, and they will say: our Lord! perfect for us our light, and forgive us; verily Thou art over everything Potent.","en.hilali":"O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will remit from you your sins, and admit you into Gardens under which rivers flow (Paradise) the Day that Allah will not disgrace the Prophet (Muhammad SAW) and those who believe with him, their Light will run forward before them and with (their Records Books of deeds) in their right hands they will say: \"Our Lord! Keep perfect our Light for us [and do not put it off till we cross over the Sirat (a slippery bridge over the Hell) safely] and grant us forgiveness. Verily, You are Able to do all things.\"","en.pickthall":"O ye who believe! Turn unto Allah in sincere repentance! It may be that your Lord will remit from you your evil deeds and bring you into Gardens underneath which rivers flow, on the day when Allah will not abase the Prophet and those who believe with him. Their light will run before them and on their right hands; they will say: Our Lord! Perfect our light for us, and forgive us! Lo! Thou art Able to do all things.","en.qaribullah":"Believers, turn to Allah in sincere repentance. Your Lord may acquit you of your sins, and admit you to Gardens underneath which rivers flow on a Day whenAllah will not degrade the Prophet and those who believe with him. Their light will run before them and on their right hands, and they will say: 'Our Lord, completeour light for us and forgive us. Surely, You have power over all things'","en.sahih":"O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"","en.sarwar":"Believers, turn to God in repentance with the intention of never repeating the same sin. Perhaps your Lord will expiate your evil deeds and admit you to Paradise wherein streams flow. On the Day of Judgment, God will not disgrace the Prophet and those who have believed in him. Their lights will shine in front of them and to their right. They will say, \"Our Lord, perfect our light for us and forgive our sins. You have power over all things\".","en.yusufali":"O ye who believe! Turn to Allah with sincere repentance: In the hope that your Lord will remove from you your ills and admit you to Gardens beneath which Rivers flow,- the Day that Allah will not permit to be humiliated the Prophet and those who believe with him. Their Light will run forward before them and by their right hands, while they say, \"Our Lord! Perfect our Light for us, and grant us Forgiveness: for Thou hast power over all things.\"","en.maududi":"Believers, turn to Allah in sincere repentance; maybe your Lord will expunge your evil deeds and admit you to the Gardens beneath which rivers flow. This will be on the Day when Allah will not disgrace the Prophet and those who have embraced faith and are with him; their light will be running before them and on their right hands, and they will say: “Our Lord, perfect for us our light and forgive us. Surely You have power over everything.”","en.shakir":"O you who believe! turn to Allah a sincere turning; maybe your Lord will remove from you your evil and cause you to enter gardens beneath which rivers flow, on the day on which Allah will not abase the Prophet and those who believe with him; their light shall run on before them and on their right hands; they shall say: Our Lord! make perfect for us our light, and grant us protection, surely Thou hast power over all things.","en.itani":"O you who believe! Repent to God with sincere repentance. Perhaps your Lord will remit your sins, and admit you into gardens beneath which rivers flow, on the Day when God will not disappoint the Prophet and those who believed with him. Their light streaming before them, and to their right, they will say, “Our Lord, complete our light for us, and forgive us; You are capable of all things.”","en.mubarakpuri":"O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will expiate from you your sins, and admit you into Gardens under which rivers flow -- the Day that Allah will not disgrace the Prophet and those who believe with him. Their light will run forward before them and in their right hands. They will say: \"Our Lord! Keep perfect our light for us and grant us forgiveness. Verily, You are Able to do all things.\"","en.qarai":"O you who have faith! Repent to Allah with sincere repentance! Maybe your Lord will absolve you of your misdeeds and admit you into gardens with streams running in them, on the day when Allah will not let down the Prophet and the faithful who are with him. Their light will move swiftly before them and on their right. They will say, ‘Our Lord! Perfect our light for us, and forgive us! Indeed You have power over all things.’","en.wahiduddin":"Believers, turn to God in sincere repentance. Your Lord may well forgive your bad deeds and admit you into gardens watered by running streams, on a Day when God will not abase the Prophet and those who have believed with him. Their light will shine out ahead of them and on their right, and they will say: \"Lord perfect our light for us, and forgive us; You have power over all things.\""},"tafsir":{"ar.muyassar":"يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، ارجعوا عن ذنوبكم إلى طاعة الله رجوعا لا معصية بعده، عسى ربكم أن يمحو عنكم سيئات أعمالكم، وأن يدخلكم جنات تجري من تحت قصورها الأنهار، يوم لا يخزي الله النبي والذين آمنوا معه، ولا يعذبهم، بل يُعلي شأنهم، نور هؤلاء يسير أمامهم وبأيمانهم، يقولون: ربنا أتمم لنا نورنا حتى نجوز الصراط، ونهتدي إلى الجنة، واعف عنَّا وتجاوز عن ذنوبنا واسترها علينا، إنك على كل شيء قدير.","ar.jalalayn":"«يا أيها الذين آمنوا توبا إلى الله توبة نصوحا» بفتح النون وضمها صادقة، بأن لا يعاد إلى الذنب ولا يُراد العود إليه «عسى ربكم» ترجية تقع «أن يكفر عنكم سيئاتكم ويدخلكم جنات» بساتين «تجري من تحتها الأنهار يوم لا يجزي الله» بإدخال النار «النبي والذين آمنوا معه نورهم يسعى بين أيديهم» أمامهم «و» يكون «بأيمانهم يقولون» مستأنف «ربنا أتمم لنا نورنا» إلى الجنة والمنافقون يطفأ نورهم «واغفر لنا» ربنا «إنك على كل شيءٍ قدير».","ar.qurtubi":"قوله تعالى : ياأيها الذين آمنوا توبوا إلى الله توبة نصوحا عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار يوم لا يخزي الله النبي والذين آمنوا معه نورهم يسعى بين أيديهم وبأيمانهم يقولون ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قديرقوله تعالى : يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا فيه مسألتان :الأولى : قوله تعالى : يا أيها الذين آمنوا توبوا إلى الله أمر بالتوبة وهي فرض على الأعيان في كل الأحوال وكل الأزمان . وقد تقدم بيانها والقول فيها في \" النساء \" وغيرها . توبة نصوحا اختلفت عبارة العلماء وأرباب القلوب في التوبة النصوح على ثلاثة وعشرين قولا ; فقيل : هي التي لا عودة بعدها كما لا يعود اللبن إلى الضرع ; وروي عن عمر وابن مسعود وأبي بن كعب ومعاذ بن جبل رضي الله عنهم . ورفعه معاذ إلى النبي صلى الله عليه وسلم . وقال قتادة : النصوح الصادقة الناصحة . وقيل الخالصة ; يقال : نصح أي أخلص له القول . وقال الحسن : النصوح أن يبغض الذنب الذي أحبه ويستغفر منه إذا ذكره . وقيل : هي التي لا يثق بقبولها ويكون على وجل منها . وقيل : هي التي لا يحتاج معها إلى توبة . وقال الكلبي : التوبة النصوح الندم بالقلب ، والاستغفار باللسان ، والإقلاع عن الذنب ، والاطمئنان على أنه لا يعود . وقال سعيد بن جبير : هي التوبة المقبولة ; ولا تقبل ما لم يكن فيها ثلاثة شروط : خوف ألا تقبل ، ورجاء أن تقبل ، وإدمان الطاعات . وقال سعيد بن المسيب : توبة تنصحون بها أنفسكم . وقال [ ص: 183 ] القرظي : يجمعها أربعة أشياء : الاستغفار باللسان ، وإقلاع بالأبدان ، وإضمار ترك العود بالجنان ، ومهاجرة سيئ الخلان . وقال سفيان الثوري : علامة التوبة النصوح أربعة : القلة والعلة والذلة والغربة . وقال الفضيل بن عياض : هو أن يكون الذنب بين عينيه ، فلا يزال كأنه ينظر إليه . ونحوه عن ابن السماك : أن تنصب الذنب الذي أقللت فيه الحياء من الله أمام عينك وتستعد لمنتظرك . وقال أبو بكر الوراق : هو أن تضيق عليك الأرض بما رحبت ، وتضيق عليك نفسك ; كالثلاثة الذين خلفوا . وقال أبو بكر الواسطي : هي توبة لا لفقد عوض ; لأن من أذنب في الدنيا لرفاهية نفسه ثم تاب طلبا لرفاهيتها في الآخرة ; فتوبته على حفظ نفسه لا لله . وقال أبو بكر الدقاق المصري : التوبة النصوح هي رد المظالم ، واستحلال الخصوم ، وإدمان الطاعات . وقال رويم : هو أن تكون لله وجها بلا قفا ، كما كنت له عند المعصية قفا بلا وجه . وقال ذو النون : علامة التوبة النصوح ثلاث : قلة الكلام ، وقلة الطعام ، وقلة المنام . وقال شقيق : هو أن يكثر صاحبها لنفسه الملامة ، ولا ينفك من الندامة ; لينجو من آفاتها بالسلامة . وقال سري السقطي : لا تصلح التوبة النصوح إلا بنصيحة النفس والمؤمنين ; لأن من صحت توبته أحب أن يكون الناس مثله . وقال الجنيد : التوبة النصوح هو أن ينسى الذنب فلا يذكره أبدا ; لأن من صحت توبته صار محبا لله ، ومن أحب الله نسي ما دون الله . وقال ذو الأذنين : هو أن يكون لصاحبها دمع مسفوح ، وقلب عن المعاصي جموح . وقال فتح الموصلي : علامتها ثلاث : مخالفة الهوى ، وكثرة البكاء ، ومكابدة الجوع والظمأ . وقال سهل بن عبد الله التستري : هي التوبة لأهل السنة والجماعة ; لأن المبتدع لا توبة له ; بدليل قوله صلى الله عليه وسلم : حجب الله على كل صاحب بدعة أن يتوب . وعن حذيفة : بحسب الرجل من الشر أن يتوب من الذنب ثم يعود فيه . وأصل التوبة النصوح من الخلوص ; يقال : هذا عسل ناصح إذا خلص من الشمع . وقيل : هي مأخوذة من النصاحة وهي الخياطة . وفي أخذها منها وجهان : أحدهما : لأنها توبة قد أحكمت طاعته وأوثقتها كما يحكم الخياط الثوب بخياطته ويوثقه . والثاني : لأنها قد جمعت بينه وبين أولياء الله وألصقته بهم ; كما يجمع الخياط الثوب [ ص: 184 ] ويلصق بعضه ببعض . وقراءة العامة نصوحا بفتح النون ، على نعت التوبة ، مثل امرأة صبور ، أي توبة بالغة في النصح . وقرأ الحسن وخارجة وأبو بكر عن عاصم بالضم ; وتأويله على هذه القراءة : توبة نصح لأنفسكم . وقيل : يجوز أن يكون نصوحا ، جمع نصح ، وأن يكون مصدرا ، يقال : نصح نصاحة ونصوحا . وقد يتفق فعالة وفعول في المصادر ، نحو الذهاب والذهوب . وقال المبرد : أراد توبة ذات نصح ، يقال : نصحت نصحا ونصاحة ونصوحا .الثانية : في الأشياء التي يتاب منها وكيف التوبة منها . قال العلماء : الذنب الذي تكون منه التوبة لا يخلو ، إما أن يكون حقا لله أو للآدميين . فإن كان حقا لله كترك صلاة فإن التوبة لا تصح منه حتى ينضم إلى الندم قضاء ما فات منها . وهكذا إن كان ترك صوم أو تفريطا في الزكاة . وإن كان ذلك قتل نفس بغير حق فأن يمكن من القصاص إن كان عليه وكان مطلوبا به . وإن كان قذفا يوجب الحد فيبذل ظهره للجلد إن كان مطلوبا به . فإن عفي عنه كفاه الندم والعزم على ترك العود بالإخلاص . وكذلك إن عفي عنه في القتل بمال فعليه أن يؤديه إن كان واجدا له ، قال الله تعالى : فمن عفي له من أخيه شيء فاتباع بالمعروف وأداء إليه بإحسان . وإن كان ذلك حدا من حدود الله كائنا ما كان فإنه إذا تاب إلى الله تعالى بالندم الصحيح سقط عنه . وقد نص الله تعالى على سقوط الحد عن المحاربين إذا تابوا قبل القدرة عليهم . وفي ذلك دليل على أنها لا تسقط عنهم إذا تابوا بعد القدرة عليهم ; حسب ما تقدم بيانه . وكذلك الشراب والسراق والزناة إذا أصلحوا وتابوا وعرف ذلك منهم ، ثم رفعوا إلى الإمام فلا ينبغي له أن يحدهم . وإن رفعوا إليه فقالوا : تبنا لم يتركوا ، وهم في هذه الحالة كالمحاربين إذا غلبوا . هذا مذهب الشافعي . فإن كان الذنب من مظالم العباد فلا تصح التوبة منه إلا برده إلى صاحبه والخروج عنه - عينا كان أو غيره - إن كان قادرا عليه ، فإن لم يكن قادرا فالعزم أن يؤديه إذا قدر في أعجل وقت وأسرعه . وإن كان أضر بواحد من المسلمين وذلك الواحد لا يشعر به أو لا يدري من أين أتي ، فإنه يزيل ذلك الضرر عنه ، ثم يسأله أن يعفو عنه ويستغفر له ، فإذا عفا عنه فقد سقط الذنب عنه . وإن أرسل من يسأل ذلك له ، فعفا ذلك المظلوم عن ظالمه - عرفه بعينه أو لم يعرفه - فذلك صحيح . وإن أساء رجل إلى رجل بأن فزعه بغير حق ، أو غمه أو لطمه ، أو صفعه بغير حق ، أو ضربه بسوط فآلمه ، ثم جاءه مستعفيا نادما [ ص: 185 ] على ما كان منه ، عازما على ألا يعود ، فلم يزل يتذلل له حتى طابت نفسه فعفا عنه ، سقط عنه ذلك الذنب . وهكذا إن كان شانه بشتم لا حد فيه .قوله تعالى : عسى ربكم أن يكفر عنكم سيئاتكم عسى من الله واجبة . وهو معنى قوله عليه السلام : \" التائب من الذنب كمن لا ذنب له \" . و \" أن \" في موضع رفع اسم عسى .قوله تعالى : \" ويدخلكم \" معطوف على \" يكفر \" . وقرأ ابن أبي عبلة \" ويدخلكم \" مجزوما عطفا على محل عسى أن يكفر . كأنه قيل : توبوا يوجب تكفير سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار .يوم لا يخزي الله النبي العامل في \" يوم \" : يدخلكم أو فعل مضمر . ومعنى \" يخزي \" هنا يعذب ، أي لا يعذبه ولا يعذب الذين آمنوا معه .نورهم يسعى بين أيديهم وبأيمانهم تقدم في سورة \" الحديد \" .يقولون ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قال ابن عباس ومجاهد وغيرهما : هذا دعاء المؤمنين حين أطفأ الله نور المنافقين ; حسب ما تقدم بيانه في سورة \" الحديد \" .\n","ar.miqbas":"يَا أَيُّهَا الَّذِينَ آَمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَى رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آَمَنُوا مَعَهُ نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (8){ ياأيها الذين ءَامَنُواْ توبوا إِلَى الله تَوْبَةً نَّصُوحاً عسى رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سيئاتكم وَيُدْخِلَكُمْ جنات تَجْرِى مِن تَحْتِهَا الانهار } .أعيد خطاب المؤمنين وأعيد نداؤهم وهو نداء ثالث في هذه السورة . والذي قبله نداء للواعظين . وهذا نداء للموعوظين وهذا الأسلوب من أساليب الإِعراض المهتم بها .أُمر المؤمنون بالتوبة من الذنوب إذا تلبسوا بها لأن ذلك من إصلاح أنفسهم بعد أن أمروا بأن يجنِّبوا أنفسهم وأهليهم ما يَزِجّ بهم في عذاب النار ، لأن اتقاء النار يتحقق باجتناب ما يرمي بهم فيها ، وقد يذهلون عما فرط من سيئاتهم فهُدُوا إلى سبيل التوبة التي يمحون بها ما فرط من سيئاتهم .وهذا ناظر إلى ما ذكر من موعظة امرأتي النبي صلى الله عليه وسلم بقوله : { إن تتوبا إلى الله } [ التحريم : 4 ] .والتوبة : العزم على عدم العود إلى العصيان مع الندم على ما فرط منه فيما مضى . وتقدمت عند قوله تعالى : { فتلقى آدم من ربه كلمات فتاب عليه } في سورة [ البقرة : 37 ] . وفي مواضع أخرى وخاصة عند قوله تعالى : { إنما التوبة على الله للذين يعملون السوء بجهالة } في سورة [ النساء : 17 ] . وتعديتها بحرف ( إلى ) لأنها في معنى الرجوع لأن ( تاب ) أخو ( ثاب ) .والنصوح : ذُو النصح .والنصح : الإِخلاص في العمل والقول ، أي الصدق في إرادة النفع بذلك . ووصف التوبة بالنصوح مجاز جعلت التوبة التي لا تردد فيها ولا تخالطها نية العودة إلى العمل المتوب منه بمنزلة الناصح لغيره ففي ( نصوح ) استعارة وليس من المجاز العقلي إذ ليس المراد نصوحاً صاحبها .وإنما لم تلحق وصف ( نصوح ) هاء التأنيث المناسبة لتأنيث الموصوف به لأن فعولاً بمعنى فاعل يلازم الإِفراد والتذكير .وقرأ الجمهور نصوحاً } بفتح النون على معنى الوصف كما علمت . وقرأه أبو بكر عن عاصم بضم النون على أنه مصدر ( نصح ) مثل : القُعود من قعد . وزعم الأخفش أن الضم غير معروف والقراءة حجة عليه .ومن شروط التوبة تدارك ما يمكن تداركه مما وقع التفريط فيه مثل المظالم للقادر على ردّها . روي عن علي رضي الله عنه : يجمع التوبة ستة أشياء : الندامة على الماضي من الذنوب ، وإعادة الفرائض . ورد المظالم ، واستحلال الخصوم ، وأن تذيب نفسك في طاعة الله كما ربيتها في المعصية ، وأن تذيقها مرارة الطاعات كما أذقتها حلاوة المعاصي .وتقوم مقام ردّ المظالم استحلال المظلوم حتى يعفو عنه .ومن تمام التوبة تمكين التائب من نفسه أن ينفذ عليها الحدود كالقود والضرب . قال إمام الحرمين : هذا التمكين واجب خارج عن حقيقة التوبة لأن التائب إذا ندم ونوى أن لا يعود صحت توبته عند الله وكان منَعه من تمكين نفسه معصية متجددة تستدعي توبة .وهو كلام وجيه إذ التمكين من تنفيذ ذلك يشق على النفوس مشقة عظيمة فلها عذر في الإِحجام عن التمكين منه .وتصح التوبة من ذنب دون ذنب خلافاً لأبي هاشم الجبائي المعتزلي ، وذلك فيما عدا التوبة من الكفر .وأما التوبة من الكفر بالإِيمان فصحيحة في غفران إثم الكفر ولو بقي متلبساً ببعض الكبائر بإجماع علماء الإِسلام .والذنوب التي تجب منها التوبة هي الكبائر ابتداء ، وكذلك الصغائر وتمييز الكبائر من الصغائر مسألة أخرى محلها أصول الدين وأصول الفقه والفقهُ .إلا أن الله تفضّل على المسلمين فغفر الصغائر لمن اجتنب الكبائر ، أخذ ذلك من قوله تعالى : { الذين يجتنبون كبائر الإِثم والفواحش إلا اللمم وقد مضى القول فيه } في تفسير سورة [ النجم : 32 ] .ولو عاد التائب إلى بعض الذنوب أو جميعها ما عدا الكفر اختلف فيه علماء الأمة فالذي ذهب إليه أهل السنة أن التوبة تنتقض بالعودة إلى بعض الذنوب في خصوص الذنب المعود إليه ولا تنتقض فيما سواه . وأن العود معصية تجب التوبة منها . وقال المعتزلة : تنتقض بالعودة إلى بعض الذنوب فتعود إليه ذنوبه ووافقهم الباقلاني .وليس في أدلة الكتاب والسنة ما يشهد لأحد الفريقين .والرجاء المستفاد من فعل عسى } مستعمل في الوعد الصادر عن المتفضل على طريقة الاستعارة وذلك التائب لا حق له في أن يعفى عنه ما اقترفه لأن العصيان قد حصل وإنما التوبة عزم على عدم العودة إلى الذنب ولكن ما لصاحبها من الندم والخوف الذي بعث على العزم دل على زكاء النفس فجعل الله جزاءه أن يمحو عنه ما سلف من الذنوب تفضلاً من الله فذلك معنى الرجاء المستفاد من { عسى } .وقد أجمع علماء الإِسلام على أن التوبة من الكفر بالإِيمان مقبولة قطعاً لكثرة أدلة الكتاب والسنة ، واختلفوا في تعيُّن قبول توبة العاصي من المؤمنين ، فقال جمهور أهل السنة : قبولها مرجوّ غير مقطوع ، وممن قال به الباقلاني وإمام الحرمين وعن الأشعري أنه مقطوع به سمعاً ، والمعتزلة مقطوع به عقلاً .وتكفير السيئات : غفرانها ، وهو مبالغة في كَفَر المخفف المتعدي الذي هو مشتق من الكَفر بفتح الكاف ، أي الستر .{ الانهار يَوْمَ لاَ يُخْزِى الله النبى والذين ءَامَنُواْ مَعَهُ نُورُهُمْ يسعى بَيْنَ أَيْدِيهِمْ وبأيمانهم يَقُولُونَ رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا واغفر لَنَآ إِنَّكَ على كُلِّ شَىْءٍ } .{ يوم } ظرف متعلق ب { يدخلكم جنات } وهو تعليقُ تخلص إلى الثناء على الرسول صلى الله عليه وسلم والمؤمنين معه . وهو يوم القيامة وهذا الثناء عليهم بانتفاء خزي الله عنهم تعريض بأن الذين لم يؤمنوا معه يخزيهم الله يوم القيامة وذكر النبي صلى الله عليه وسلم مع الذين آمنوا لتشريف المؤمنين ولا علاقة له بالتعريض .والخزي : هو عذاب النار ، وحكى الله تعالى عن إبراهيم عليه السلام قوله : { ولا تخزني يوم يبعثون } [ الشعراء : 87 ] على أن انتفاء الخزي يومئذٍ يستلزم الكرامة إذ لا واسطة بينهما كما أشعر به قوله تعالى :{ فمن زحزح عن النار وأدخل الجنة فقد فاز } [ آل عمران : 185 ] .وفي صلة { الذين آمنوا معه } إيذان بأن سبب انتفاء الخزي عنهم هو إيمانهم .ومعية المؤمنين مع النبي صلى الله عليه وسلم صحبتهم النبي صلى الله عليه وسلمو ( مع ) يجوز تعلقها بمحذوف حال من { الذين آمنوا } أي حال كونهم مع الشيء في انتفاء خزي الله عنهم فيكون عموم { الذين آمنوا } مخصوصاً بغير الذين يتحقق فيهم خزي الكفر وهم الذين ارتدوا وماتوا على الكفر .وفي هذه الآية دليل على المغفرة لجميع أصحاب النبي صلى الله عليه وسلمويجوز تعلق ( مع ) بفعل { آمنوا } أي الذين آمنوا به وصحبوه ، فيكون مراداً به أصحاب النبي صلى الله عليه وسلم الذين آمنوا به ولم يرتدوا بعده ، فتكون الآية مؤذنة بفضيلة للصحابة .وضمير { نورهم } عائد إلى النبي صلى الله عليه وسلم والذين آمنوا معه .وإضافة نور إلى ضمير هم مع أنه لم يسبق إخبار عنهم بنور لهم ليست إضافة تعريف إذ ليس المقصود تعريف النور وتعيينه ولكن الإِضافة مستعملة هنا في لازم معناها وهو اختصاص النور بهم في ذلك اليوم بحيث يميزه الناس من بين الأنوار يومئذٍ .وسعي النور : امتداده وانتشاره . شبه ذلك باشتداد مشي الماشي وذلك أنه يحفّ بهم حيثما انتقلوا تنويهاً بشأنهم كما تنشر الأعلام بين يدي الأمير والقائد وكما تساق الجياد بين يدي الخليفة .وإنما خص بالذكر من الجهات الأمامُ واليمين لأن النور إذا كان بين أيديهم تمتعوا بمشاهدته وشعروا بأنه كرامة لهم ولأن الأيدي هي التي تمسك بها الأمور النفيسة وبها بايعوا النبي صلى الله عليه وسلم على الإِيمان والنصر . وهذا النور نور حقيقي يجعله الله للمؤمنين يوم القيامة . والباء للملابسة ، ويجوز أن تكون بمعنى ( عن ) .وقد تقدم نظير هذا في سورة الحديد وما ذكرناه هنا أوسع .وجملة { يقولون ربنا أتمم لنا نورنا } إلى آخرها حال من ضمير { نورهم } ، وظاهره أن تكون حالاً مقارنة ، أي يقولون ذلك في ذلك اليوم ، ودعاؤهم طلب للزيادة من ذلك النور ، فيكون ضمير { يقولون } عائد إلى جميع الذين آمنوا مع النبي صلى الله عليه وسلم يومئذٍ ، أو يقول ذلك من كان نوره أقل من نور غيره ممن هو أفضل منه يومئذٍ فيكون ضمير { يقولون } على إرادة التوزيع على طوائف الذين آمنوا في ذلك اليوم .وإتمام النور إدامته أو الزيادة منه على الوجهين المذكورين آنفاً وكذلك الدعاء بطلب المغفرة لهم هو لطلب دوام المغفرة ، وذلك كله أدب مع الله وتواضع له مثل ما قيل في استغفار النبي صلى الله عليه وسلم في اليوم سبعين مرة .ويظهر بذلك وجه التذييل بقولهم : { إنك على كل شيء قدير } المشعر بتعليل الدعاء كناية عن رجاء إجابته لهم .\n","ar.waseet":"ثم يرشد - سبحانه - المؤمنين ، إلى ما يعينهم على الوقاية من النار فيقول : ( ياأيها الذين آمَنُواْ توبوا إِلَى الله تَوْبَةً نَّصُوحاً . . ) .والتوبة : العزم الصادق على عدم العودة إلى المعصية والندم على ما فعله منها فى الماضى ، والنصوح صيغة مبالغة من النصح ، وصفت بها التوبة على سبيل الإسناد المجازى ، والمقصود وصف التائبين بها ، من نصح فلان التوب إذا خاطه ، فكأن التائب يرقع ما مزقه بالمعصية . أو من قولهم : عسل ناصح .وقد ذكروا فى معنى هذه الجملة أكثر من عشرين وجهاً .قال القرطبى ما ملخصه : اختلفت عبارة العلماء ، وأرباب القلوب ، فى التوبة النصوح على ثلاثة وعشرين قولا ، فقيل : هى التى لا عودة بعدها ، كما لا يعود اللبن إلى الضرع .وقال قتادة : النصوح الصادقة الناصحة . . . الخالصة .وقال القرطبى : التوبة النصوح يجمعها أربعة أشياء : الاستغفار باللسان ، والإقلاع بالأبدان ، وإضمار ترك العود بالجنان ، ومهاجرة سىء الإخوان .وقال الفقهاء : التوبة التى لا تعلق لها بحق آدمى لها ثلاثة شروط : احدها أن يقلع عن المعصية ، وثانيها : أن يندم على ما فعله ، وثالثها : أن يعزم على أن لا يعود إليها .فإذا اجتمعت هذه الشروط فى التوبة كانت نصوحا .وإن كانت تتعلق بحق آدمى ، فشروطها أربعة ، هذه الثلاثة المتقدمة ، والرابع أن يبرأ من حق صاحبها ، فإن كانت المعصية مالا أو نحوه رده إليه ، وإن كانت حد قذف ونحوه مكنه من نفسه ، أو طلب العفو منه ، وإن كانت غيبة استحله منها .وهى واجبة من كل معصية على الفور ، ولا يجوز تأخريها .وقوله - سبحانه - ( عسى رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأنهار ) .والرجاء المستفاد من فعل ( عسى ) مستعمل هنا فى الوعد الصادق منه - تعالى - على سبيل الكرم والفضل ، فقد قالوا إن كل ترج فى القرآن واقع منه - تعالى - فضلا منه وكرما .أى : يا من آمنتم بالله حق الإيمان ، توبوا إلى الله - تعالى - \" توبة صادقة \" بحيث تندمون على ما فرط منكم من ذنوب ، وتعزمون على عدم العودة إليها ، وتستمرون على توبتكم طوال حياتكم . . . فإنكم متى فعلتم ذلك غفر الله - تعالى - لكم ذنوبكم : وكفر عنكم سيئاتكم ، وأدخلكم جنات تجرى من تحت أشجارها وثمارها الأنهار .قال صاحب الكشاف : قوله : ( عسى رَبُّكُمْ ) : إطماع من الله لعباده . وفيه وجهان : أحدهما أن يكون على ما جرت به عادة الجبابرة من الإجابة بعسى ولعل . و وقوع ذلك منهم موقع القطع والبت . والثانى : أن يجىء به تعليما للعباد وجوب الترجح بين الخوف والرجاء .والظرف فى قوله - سبحانه - : ( يَوْمَ لاَ يُخْزِى الله النبي والذين آمَنُواْ مَعَهُ نُورُهُمْ يسعى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ ) منصوب بقوله - تعالى - قبل ذلك : ( وَيُدْخِلَكُمْ ) ، أو بفعل مضمر تقديره : اذكر .وقوله : ( لاَ يُخْزِى ) من الخزى بمعنى الافتضاح : يقال أخزى الله فلانا إذا فضحه ، والمراد به هنا : عذاب النار .وقوله : ( والذين آمَنُواْ مَعَهُ ) معطوف على النبى ، وجملة ( نُورُهُمْ يسعى ) مستأنفة .أى : يدخلكم الله - بفضله وكرمه - ( جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأنهار ) يوم القيامة ، يوم ينجى - سبحانه - النبى - صلى الله عليه وسلم - وينجى الذين آمنوا معه من عذاب النار ، ومن خزى هذا اليوم العصيب .وهم جميعا وعلى رأسهم الرسول - صلى الله عليه وسلم - نورهم وهم على الصراط ، يسعى ويمتد وينتشر ( بَيْنَ أَيْدِيهِمْ ) .أى أمامهم ( وَبِأَيْمَانِهِمْ ) أى : وعن أيمانهم .ويقولون - على سبيل الحمد والشكر لله - تعالى - يا ربنا ( أَتْمِمْ لَنَا نُورَنَا ) بأن تزيده ولا تنقصه حتى ندخل جنتك .( واغفر لَنَآ ) يا ربنا ذنوبنا ( إِنَّكَ ) يا ربنا ، ( على كُلِّ شَيْءٍ قَدِيرٌ ) .وفى عطف الذين آمنوا على النبى - صلى الله عليه وسلم - إشعار بأن سبب انتفاء خزيهم ، هو إيمانهم الصادق ، وعملهم الصالح ، وصحبتهم الكريمة للنبى - صلى الله عليه وسلم - .والضمير فى قوله ( نُورُهُمْ ) يعود إلى النبى - صلى الله عليه وسلم - والذين آمنوا معه .وخص - سبحانه - الأَمامَ واليمين بالذكر ، لفضل هذين المكانين ، إذ النور عندما يكون من الأمام يستمتع الإنسان بمشاهدته ، وعندما يكون من جهة اليمين يزداد تفاؤلا وانشراحا به .والتخصيص بذلك لا ينفى أن يكون النور محيطا بهم من كل جوانبهم ، وهو نور حقيقى يكرم الله - تعالى - به عباده الصالحين .وختموا دعاءهم بقولهم - كما حكى القرآن عنهم - : ( إِنَّكَ على كُلِّ شَيْءٍ قَدِيرٌ ) للإشارة إلى أنهم كانوا على جانب كبير من رجاء تحقيق دعائهم ، لأنهم يسألون ويدعون الله - تعالى - الذى لا يقف أمام قدرته شىء .\n","ar.baghawi":"( ياأيها الذين آمنوا توبوا إلى الله توبة نصوحا ) قرأ الحسن وأبو بكر عن عاصم : \" نصوحا \" بضم النون ، وقرأ العامة بفتحها أي : توبة ذات نصح تنصح صاحبها بترك العود إلى ما تاب منه .واختلفوا في معناها قال عمر وأبي ومعاذ : \" التوبة النصوح \" أن يتوب ثم لا يعود إلى الذنب ، كما لا يعود اللبن إلى الضرع .قال الحسن : هي أن يكون العبد نادما على ما مضى; مجمعا على ألا يعود فيه .قال الكلبي : أن يستغفر باللسان ويندم بالقلب ويمسك بالبدن .قال سعيد بن المسيب : توبة تنصحون بها أنفسكم .قال القرظي : يجمعها أربعة أشياء : الاستغفار باللسان والإقلاع بالأبدان وإضمار ترك العود بالجنان ومهاجرة سيئ الإخوان .( عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار يوم لا يخزي الله النبي والذين آمنوا معه ) أي لا يعذبهم الله بدخول النار ( نورهم يسعى بين أيديهم وبأيمانهم ) على الصراط ( يقولون ) إذ طفئ نور المنافقين ( ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قدير ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5237.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5237.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5237.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ","transliteration":"yaaa ayyuuhan nabiyyu jaahidil kuffaara walmunaa-fiqeena waghluz 'alaihim; wa maawaahum jahannamu wa bi'sal maseer","translations":{"en.ahmedali":"O Prophet, fight the unbelievers and the hypocrites, and be severe with them. Their abode is Hell, an evil destination?","en.ahmedraza":"O dear Prophet (Mohammed – peace and blessings be upon him), wage holy war against the disbelievers and the hypocrites, and be strict with them; and their destination is hell; and what a wretched outcome!","en.arberry":"O Prophet, struggle with the unbelievers and the hypocrites, and be thou harsh with them; their refuge shall be Gehenna -- an evil homecoming!","en.asad":"O PROPHET! Strive hard against the deniers of the truth and the hypocrites, and be adamant with them. And [if they do not repent,] their goal shall be hell - and how vile a journey’s end!","en.daryabadi":"O Prophet! strive hard against the infidels and the hypocrites, and be stern Unto them. And their abode is Hell: a hapless destination!","en.hilali":"O Prophet (Muhammad SAW)! Strive hard against the disbelievers and the hypocrites, and be severe against them, their abode will be Hell, and worst indeed is that destination.","en.pickthall":"O Prophet! Strive against the disbelievers and the hypocrites, and be stern with them. Hell will be their home, a hapless journey's end.","en.qaribullah":"O Prophet, struggle with the unbelievers and the hypocrites and deal harshly with them. Gehenna (Hell) shall be their refuge, an evil arrival!","en.sahih":"O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.","en.sarwar":"Prophet, fight against the disbelievers and the hypocrites and be stern against them. Their dwelling will be hell fire, the most terrible fate.","en.yusufali":"O Prophet! Strive hard against the Unbelievers and the Hypocrites, and be firm against them. Their abode is Hell,- an evil refuge (indeed).","en.maududi":"O Prophet, strive against the unbelievers and the hypocrites, and be severe with them. Hell shall be their resort. What a grievous end!","en.shakir":"O Prophet! strive hard against the unbelievers and the hypocrites, and be hard against them; and their abode is hell; and evil is the resort.","en.itani":"O prophet! Strive hard against the disbelievers and the hypocrites, and be stern with them. Their abode is Hell. What a miserable destination!","en.mubarakpuri":"O Prophet! Strive hard against the disbelievers and the hypocrites, and be severe against them; their abode will be Hell, and worst indeed is that destination.","en.qarai":"O Prophet! Wage jihad against the faithless and the hypocrites, and be severe with them. Their refuge will be hell, and it is an evil destination.","en.wahiduddin":"Prophet, exert yourself to the utmost against those who deny the truth and the hypocrites. Deal severely with them. Hell will be their abode -- a vile destination."},"tafsir":{"ar.muyassar":"يا أيها النبي جاهد الذين أظهروا الكفر وأعلنوه، وقاتلهم بالسيف، وجاهد الذين أبطنوا الكفر وأخفوه بالحجة وإقامة الحدود وشعائر الدين، واستعمل مع الفريقين الشدة والخشونة في جهادهما، ومسكنهم الذي يصيرون إليه في الآخرة جهنم، وقَبُح ذلك المرجع الذي يرجعون إليه.","ar.jalalayn":"«يا أيها النبي جاهد الكفار» بالسيف «والمنافقين» باللسان والحجة «واغلظ عليهم» بالانتهار والمقت «ومأواهم جهنم وبئس المصير» هي.","ar.qurtubi":"قوله تعالى : ياأيها النبي جاهد الكفار والمنافقين واغلظ عليهم ومأواهم جهنم وبئس المصيرقوله تعالى : يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم فيه مسألة واحدة : وهو التشديد في دين الله . فأمره أن يجاهد الكفار بالسيف والمواعظ الحسنة والدعاء إلى الله . والمنافقين بالغلظة وإقامة الحجة ; وأن يعرفهم أحوالهم في الآخرة ، وأنهم لا نور لهم يجوزون به الصراط مع المؤمنين . وقال الحسن : أي جاهدهم بإقامة الحدود عليهم ; فإنهم كانوا يرتكبون موجبات الحدود . وكانت الحدود تقام عليهم .ومأواهم جهنم يرجع إلى الصنفين .وبئس المصير أي المرجع .\n","ar.miqbas":"يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ وَمَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمَصِيرُ (9)لما أبلغ الكفار ما سيحل بهم في الآخرة تصريحاً بقوله : { يأيها الذين كفروا لا تعتذروا اليوم } [ التحريم : 7 ] ، وتعريضاً بقوله : { يوم لا يخزي الله النبي والذين آمنوا معه } [ التحريم : 8 ] ، أمَرَ رسولَه صلى الله عليه وسلم بمسمع منهم بأن يجاهدهم ويجاهد المستترين لكفرهم بظاهر الإِيمان نفاقاً ، حتى إذا لم تؤثر فيهم الموعظة بعقاب الآخرة يخشون أن يسلط عليهم عذاب السيف في العاجلة فيقلعوا عن الكفر فيصلح نفوسهم وإنما أمر رسوله صلى الله عليه وسلم بذلك لأن الكفار تألبُوا مع المنافقين بعد هجرة النبي صلى الله عليه وسلم فاتخذوهم عيوناً لهم وأيدي يدسُّون بها الأذى للنبيء صلى الله عليه وسلم وللمؤمنين .فهذا نداء ثان للنبيء صلى الله عليه وسلم يأمره بإقامة صلاح عموم الأمة بتطهيرها من الخبثاء بعد أن أمره بإفاقة من عليهما الغفلة عن شيء من واجب حسن المعاشرة مع الزوج .وجهاد الكفار ظاهر ، وأما عطف { المنافقين } على { الكفار } المفعول ل { جاهد } فيقتضي أن النبي صلى الله عليه وسلم مأمور بجهاد المنافقين وكان حال المنافقين ملتبساً إذ لم يكن أحد من المنافقين معلناً بالكفر ولا شُهد على أحد منهم بذلك ولم يعين الله لرسوله صلى الله عليه وسلم منافقاً يوقن بنفاقه وكفره أو أطلعه إطلاعاً خاصاً ولم يأمره بإعلانه بين المسلمين كما يؤخذ ذلك من أخبار كثيرة في الآثار .فتعين تأويل عطف { المنافقين } على { الكفار } إما بأن يكون فعل { جاهد } مستعملاً في حقيقته ومجازه وهما الجهاد بالسيف والجهاد بإقامة الحجة والتعريض للمنافق بنفاقه فإن ذلك يطلق عليه الجهاد مجازاً كما في قوله صلى الله عليه وسلم \" رجعنا من الجهاد الأصغر إلى الجهاد الأكبر \" ، وقوله للذي سأله الجهاد فقال له : «ألك أبوان؟ قال : نعم ، قال : ففيهما فجاهد» .وعندي أن الأقرب في تأويل هذا العطف أن يكون المراد منه إلقاء الرعب في قلوب المنافقين ليشعروا بأن النبي صلى الله عليه وسلم والمؤمنين بالمرصاد بهم فلو بدت من أحدهم بادرة يعلم منها نفاقه عومل معاملة الكافر في الجهاد بالقتل والأسر فيحذروا ويكفوا عن الكيد للمسلمين خشية الافتضاح فتكون هذه الآية من قبيل قوله تعالى : { لئن لم ينته المنافقون والذين في قلوبهم مرض والمرجفون في المدينة لنغرينك بهم ثم لا يجاورونك فيها إلا قليلاً ملعونين أينما ثقفوا أخذوا وقتلوا تقتيلاً } [ الأحزاب : 60 ، 61 ] .والغلظة : حقيقتها صلابة الشيء وهي مستعارة هنا للمعاملة بالشدة بدون عفو ولا تسامح ، أي كن غليظاً ، أي شديداً في إقامة ما أمر الله به أمثالهم . وتقدم عند قوله تعالى : { وليجدوا فيكم غلظة } في سورة [ براءة : 123 ] ، وقوله : { ولو كنت فظاً غليظ القلب } في سورة [ آل عمران : 159 ] .والمأوى : المسكن ، وهو مفعل من أوى إذا رجع لأن الإِنسان يرجع إلى مسكنه .\n","ar.waseet":"ثم أمر - سبحانه - نبيه - صلى الله عليه وسلم - أن يجاهد الكفار والمنافقين جهادا كبيرا فقال : ( ياأيها النبي جَاهِدِ الكفار والمنافقين واغلظ عَلَيْهِمْ ) .وخص النبى - صلى الله عليه وسلم - بالأمر بالجهاد ، مع أن الأمر به يشمل المؤمنين معه ، لأنه - صلى الله عليه وسلم - بالأمر بالجهاد ، مع أن الأمر به يشمل المؤمنين معه ، لأنه - صلى الله عليه وسلم - هو قائدهم ورائدهم .وجهاده - صلى الله عليه وسلم - للكفار يكون بدعوتهم إلى الحق حتى يسلموا ، فإذا لم يستجيبوا جاهدهم بالسيف والسلاح حتى يزهق باطلهم .وجهاده للمنافقين يكون بتأديبهم وزجرهم وإلقاء الرعب فى قلوبهم ، حتى يأمن المؤمنون شرهم ، وحتى يشعروا بأن النبى والمؤمنين لهم بالمرصاد .والغلظة فى الأصل : تطلق على الشىء الصلب الغليظ ، والمراد بها هنا : معاملتهم بالشدة والخشونة والقسوة . . . حتى يأمن المؤمنون جانبهم ، ويتقوا شرهم .أى : يا أيها النبى الكريم جاهد أنت ومن معك من المؤمنين ، الكفار والمنافقين . وعاملهم جميعا بالخشونة والغلظة . . . حتى يهابوك أنت ومن معك ، وحتى تكونوا فى مأمن منهم ومن أذاهم إذ الحق لا بد له من قوة تحميه وتدفع عنه كيد أعدائه .وقوله - تعالى - : ( وَمَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ المصير ) بيان لسوء مصيرهم فى الآخرة .أى : أن هؤلاء الكافرين والمنافقين ، حالهم فى الدنيا المجاهدة والمعاملة التى لا تسامح معها ولا تساهل ، حتى تكون كلمتهم السفلى ، وكلمة الله - تعالى - هى العليا .أما حالهم فى الآخرة ، فالإلقاء بهم فى جهنم ، وبئس المأوى والمسكن جهنم ، فالمخصوص بالذم محذوف ، وهو جهنم ، أو المأوى .وبذلك نرى الآيات الكريمة قد أرشدت النبى - صلى الله عليه وسلم - والمؤمنين ، إلى ما يسعدهم فى دنياهم وآخرتهم .\n","ar.baghawi":"\"يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم ومأواهم جهنم وبئس المصير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5238.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5238.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5238.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا امْرَأَتَ نُوحٍ وَامْرَأَتَ لُوطٍ ۖ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ","transliteration":"Darabal laahu masalal lillazeena kafarum ra ata Noobinw wamra ata Loot, kaanataa tahta 'abdaini min 'ibaadinaa saalihaini fakhaanataahumaa falam yughniyaa 'anhumaa minal laahi shai anw-wa qeelad khulan naara ma'ad Daakhileen","translations":{"en.ahmedali":"God advances the example of Noah's wife and the wife of Lot for those who do not believe. They were married to Our two pious devotees, but they were unfaithful to them, and even (the apostles) could not avail them in the least against God; and it was said to them: \"Enter Hell with those (who are condemned) to enter it.\"","en.ahmedraza":"Allah illustrates the example of the disbelievers – the wife of Nooh and the wife of Lut; they were bonded in marriage to two of Our bondmen deserving Our proximity – they then betrayed them so they did not benefit them the least against Allah and it was declared, “Both of you women enter the fire, along with others who enter.”","en.arberry":"God has struck a similitude for the unbelievers -- the wife of Noah, and the wife of Lot; for they were under two of Our righteous servants, but they betrayed them, so they availed them nothing whatsoever against God; so it was said, 'Enter, you two, the Fire with those who enter.'","en.asad":"For those who are bent on denying the truth God has propounded a parable in [the stories of] Noah's wife and Lot's wife: they were wedded to two of Our righteous servants, and each one betrayed her husband; and neither of the two [husbands] will be of any avail to these two women when they are told [on Judgment Day], \"Enter the fire with all those [other sinners] who enter it!\"","en.daryabadi":"Allah propoundeth for those who disbelieve the similitude of the wife of Nuh and the wife of Lut. They were under two of our righteous bondmen; then they defrauded them. Wherefore the twain availed them naught against Allah, and it was said: enter ye twain the Fire with those who enter.","en.hilali":"Allah sets forth an example for those who disbelieve, the wife of Nuh (Noah) and the wife of Lout (Lot). They were under two of our righteous slaves, but they both betrayed their (husbands by rejecting their doctrine) so they [Nuh (Noah) and Lout (Lot)] benefited them (their respective wives) not, against Allah, and it was said: \"Enter the Fire along with those who enter!\"","en.pickthall":"Allah citeth an example for those who disbelieve: the wife of Noah and the wife of Lot, who were under two of Our righteous slaves yet betrayed them so that they (the husbands) availed them naught against Allah and it was said (unto them): Enter the Fire along with those who enter.","en.qaribullah":"Allah has given as an example for the unbelievers, the wife of Noah and the wife of Lot. They were married to two of Our righteous worshipers, but theybetrayed them. It was not for (Noah and Lot) to avail them a thing. It was said to them both: 'Enter the Fire with those who shall enter'","en.sahih":"Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\"","en.sarwar":"God has told the disbelievers the story of the wives of Noah and Lot as a parable. They were married to two of Our righteous servants but were unfaithful to them. Nothing could protect them from the (wrath) of God and they were told to enter hell fire with the others.","en.yusufali":"Allah sets forth, for an example to the Unbelievers, the wife of Noah and the wife of Lut: they were (respectively) under two of our righteous servants, but they were false to their (husbands), and they profited nothing before Allah on their account, but were told: \"Enter ye the Fire along with (others) that enter!\"","en.maududi":"Allah has set forth for the unbelievers the parable of the wives of Noah and Lot. They were wedded to two of Our righteous servants, but each acted treacherously with her husband, and their husbands could be of no avail to them against Allah. The two of them were told: “Enter the Fire with all the others who enter it.”","en.shakir":"Allah sets forth an example to those who disbelieve the wife of Nuh and the wife of Lut: they were both under two of Our righteous servants, but they acted treacherously towards them so they availed them naught against Allah, and it was said: Enter both the fire with those who enter.","en.itani":"God illustrates an example of those who disbelieve: the wife of Noah and the wife of Lot. They were under two of Our righteous servants, but they betrayed them. They availed them nothing against God, and it was said, “Enter the Fire with those who are entering.”","en.mubarakpuri":"Allah sets forth an example for those who disbelieve: the wife of Nuh and the wife of Lut. They were under two of our righteous servants, but they both betrayed them. So, they availed them not against Allah and it was said: \"Enter the Fire along with those who enter!\"","en.qarai":"Allah cites an example of the faithless: the wife of Noah and the wife of Lot. They were under two of our righteous servants, yet they betrayed them. So they did not avail them in any way against Allah, and it was said [to them], ‘Enter the Fire, along with those who enter [it].’","en.wahiduddin":"As an example to those who are bent on denying the truth, God cited the wife of Noah and the wife of Lot, who were married to two of Our righteous servants, but who betrayed them. So they could not help them against God, and they were told, \"Enter the Fire along with all the others.\""},"tafsir":{"ar.muyassar":"ضرب الله مثلا لحال الكفرة - في مخالطتهم المسلمين وقربهم منهم ومعاشرتهم لهم، وأن ذلك لا ينفعهم لكفرهم بالله- بحال زوجة نبي الله نوح، وزوجة نبي الله لوط: حيث كانتا في عصمة عبدَين من عبادنا صالحين، فوقعت منهما الخيانة لهما في الدين، فقد كانتا كافرتين، فلم يدفع هذان الرسولان عن زوجتيهما من عذاب الله شيئًا، وقيل للزوجتين: ادخلا النار مع الداخلين فيها. وفي ضرب هذا المثل دليل على أن القرب من الأنبياء، والصالحين، لا يفيد شيئا مع العمل السيِّئ.","ar.jalalayn":"«ضرب الله مثلا للذين كفروا امرأة نوح وامرأة لوط كانتا تحت عبدين من عبادنا صالحين فخانتاهما» في الدين إذ كفرتا وكانت امرأة نوح واسمها واهلة تقول لقومه: إنه مجنون، وامرأة لوط واسمها واعلة تدل قومه على أضيافه إذا نزلوا به ليلا بإيقاد النار ونهارا بالتدخين «فلم يغنيا» أي نوح ولوط «عنهما من الله» من عذابه «شيئا وقيل» لهما «ادخلا النار مع الداخلين» من كفار قوم نوح وقوم لوط.","ar.qurtubi":"قوله تعالى : ضرب الله مثلا للذين كفروا امرأة نوح وامرأة لوط كانتا تحت عبدين من عبادنا صالحين فخانتاهما فلم يغنيا عنهما من الله شيئا وقيل ادخلا النار مع الداخلينضرب الله تعالى هذا المثل تنبيها على أنه لا يغني أحد في الآخرة عن قريب ولا نسيب إذا فرق بينهما الدين . وكان اسم امرأة نوح والهة ، واسم امرأة لوط والعة ; قاله مقاتل . وقال الضحاك عن عائشة رضي الله عنها : إن جبريل نزل على النبي صلى الله عليه وسلم فأخبره أن اسم امرأة نوح واغلة واسم امرأة لوط والهة .\" فخانتاهما \" قال عكرمة والضحاك : بالكفر . وقال سليمان بن رقية والضحاك : بالكفر . وقال سليمان بن رقية عن ابن عباس : كانت امرأة نوح تقول للناس إنه مجنون . وكانت امرأة لوط تخبر بأضيافه . وعنه : ما بغت امرأة نبي قط . وهذا إجماع من المفسرين فيما ذكر القشيري . إنما كانت خيانتهما في الدين وكانتا مشركتين . وقيل : كانتا منافقتين . وقيل : خيانتهما النميمة إذا أوحى الله إليهما شيئا أفشتاه إلى المشركين ; قاله الضحاك . وقيل : كانت امرأة لوط إذا نزل به ضيف دخنت لتعلم قومها أنه قد نزل به ضيف ; لما كانوا عليه من إتيان الرجال .فلم يغنيا عنهما من الله شيئا أي لم يدفع نوح ولوط مع كرامتهما على الله تعالى عن زوجتيهما - لما عصتا - شيئا من عذاب الله ; تنبيها بذلك على أن العذاب يدفع بالطاعة لا بالوسيلة . ويقال : إن كفار مكة استهزءوا وقالوا : إن محمدا صلى الله عليه وسلم يشفع لنا ; فبين الله تعالى أن شفاعته لا تنفع كفار مكة وإن كانوا أقرباء ، كما لا تنفع شفاعة نوح لامرأته وشفاعة لوط لامرأته ، مع قربهما لهما ؛ لكفرهما . وقيل لهما :ادخلا النار مع الداخلين في الآخرة ; كما يقال لكفار مكة وغيرهم . ثم قيل : يجوز أن تكون امرأة نوح بدلا من قوله : \" مثلا \" على تقدير حذف المضاف ; أي ضرب الله مثلا امرأة نوح . ويجوز أن يكونا مفعولين .\n","ar.miqbas":"ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا اِمْرَأَةَ نُوحٍ وَامْرَأَةَ لُوطٍ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ (10)أعقبت جملة { يا أيها النبي جاهد الكفار والمنافقين } [ التحريم : 9 ] الآية المقصود منها تهديدهم بعذاب السيف في الدنيا وإنذارهم بعذاب الآخرة وما قارن ذلك من مقابلة حالهم بحال المؤمنين ، بأن ضرَب مثلين للفريقين بنظيرين في حاليهما لتزداد الموعظة وضوحاً ويزداد التنويه بالمؤمنين استنارة . وقد تقدمت فائدة ذكر الأمثال في قوله تعالى : { مثلهم كمثل الذي استوقد ناراً } في سورة [ البقرة : 17 ] .وضربُ المثل : إلقاؤه وإيضاحه ، وتقدم ذلك عند قوله تعالى : { إن الله لا يستحي أن يضرب مثلاً ما } في سورة [ البقرة : 26 ] .فالجملة مستأنفة استئنافاً ابتدائياً . وهذا المثل لا يخلو من تعريض بحث زوْجي النبي على طاعته وبأنَّ رضى الله تعالى يتبع رضى رسله . فقد كان الحديث عن زوجتي النبي قريباً وكان عَملهما ما فيه بارقة من مخالفة ، وكان في المثلين ما فيه إشعار بالحالين .وتعدية ضرب باللام الدال على العلة تفيد أن إلقاء المثل لأجل مدخول اللام . فمعنى ضرب الله مثلاً للذين كروا } أنه ألقى هذا التنظير لأجلهم ، أي اعتبارهم بهم وقياسسِ حالهم على حال الممثل به ، فإذا قيل : ضرب لفلان مثلاً ، كان المعنى : أنه قصده به وأعلمه إياه ، كقوله تعالى : { ما ضربوه لك إلا جدلاً } [ الزخرف : 58 ] . { ولقد ضربنا للناس في هذا القرآن من كل مثل } [ الروم : 58 ] . ونحو ذلك وتقديم المجرور باللام على المفعول للاهتمام بإيقاظ الذين كفروا .فمعنى { ضرب الله مثلاً للذين كفروا امرأت نوح وامرأت لوط } ، أن الله جعل حالة هاتين المرأتين عظة وتنبيهاً للذين كفروا ، أي ليُذكرهم بأن الله لا يصرفه عن وعيده صَارِف فلا يحسبوا أن لهم شفعاء عند الله ، ولا أن مكانهم من جوار بيتِه وعمارة مسجده وسقاية حجيجه تصرف غضب الله عنهم ، فإن هم أقلعوا عن هذا الحسبان أقبلوا على التدبر في النجاة من وعيده بالنظر في دلائل دعوة القرآن وصدق الرسول صلى الله عليه وسلم فلو كان صارف يصرف الله عن غضبه لكان أولى الأشياء بذلك مكانة هاتين المرأتين من زوجيهما رسولي رب العالمين .ومناسبة ضرب المثل بامرأة نوح وامرأة لوط دون غيرهما من قرابة الأنبياء نحو أبي إبراهيم وابن نوح عليهما السلام لأن ذكر هاتين المرأتين لم يتقدم . وقد تقدم ذكر أبي إبراهيم وابن نوح ، لتكون في ذكرهما فائدة مستجدة ، وليكون في ذكرهما عقب ما سبق من تمالُؤِ أُمي المؤمنين على زوجهما صلى الله عليه وسلم تعريض لطيف بالتحذير من خاطر الاعتزاز بغناء الصلة الشريفة عنهما في الوفاء بحق ما يجب من الإِخلاص للنبيء صلى الله عليه وسلم ليكون الشَّبه في التمثيل أقوى . فعن مقاتل «يقول الله سبحانه لعائشة وحفصة : لا تكونا بمنزلة امرأة نوح وامرأة لوط في المعصية وكونا بمنزلة امرأة فرعون ومريم» .ووضحه في «الكشاف» بأنه من قبيل التعريض . ومنعه الفخر ، وقال ابن عطية : «قال بعض الناس في المثلين عبرة لزوجات النبي صلى الله عليه وسلم حين تقدم عتابهن . وفي هذا بُعد لأن النص أنه للكفار يبعد هذا» اه .ويدفع استبعاده أن دلالة التعريض لا تنافي اللفظ الصريح ، ومن لطائف التقييد بقوله تعالى : { للذين كفروا } أن المقصد الأصلي هو ضرب المثل للذين كفروا وذلك من الاحتراس من أن تحمل التمثيل على المشابهة من جميع الوجوه والاحتراس بكثرة التشبيهات ومنه تجريد الاستعارة .وقصة امرأة نوح لم تذكر في القرآن في غير هذه الآية والذي يظهر أنها خانت زوجها بعد الطوفان وأن نوحاً لم يعلم بخونها لأن الله سمى عملها خيانة .وقد ورد في سفر التكوين من التوراة ذكر امرأة نوح مع الذين ركبوا السفينة وذِكر خروجها من السفينة بعد الطوفان ثم طوي ذكرها لما ذكر الله بركته نوحاً وبنيه وميثاقه معهم فلم تذكر معهم زوجه . فلعلها كفرت بعد ذلك أو لعل نوحاً تزوج امرأة أخرى بعد الطوفان لم تذكر في التوراة .ووصف الله فعل امرأة نوح بخيانة زوجها ، فقال المفسرون : هي خيانة في الدين ، أي كانت كافرة مسرة الكفر ، فلعل الكفر حدث مرة أخرى في قوم نوح بعد الطوفان ولم يذكر في القرآن .وأما حديث امرأة لوط فقد ذكر في القرآن مرات . وتقدم في سورة الأعراف ويقال : فلانةُ كانت تحت فلان ، أي كانت زوجاً له .والتحتية هنا مجاز في معنى الصيانة والعصمة ومنه قول أنس بن مالك في الحديث المروي في «الموطأ» وفي «صحيح البخاري» عن أم حرام بنت ملحان : «وكانت أم حرام تحت عبادة بن الصامت» .ومن بدائع الأجوبة أن أحد الأمراء من الشيعة سأل أحد علماء السنة : من أفضل الناس بعد رسول الله صلى الله عليه وسلم فأجابه : «الذي كانت ابنتُه تحتَه» فظن أنه فضل علياً إذْ فهم أن الضمير المضاف إليه «ابنَة» ضميرَ رسول الله صلى الله عليه وسلم وأن الضمير المضاف إليه ( تحت ) ضمير اسم الموصول ، وإنما أراد السنيّ العكس بأن يكون ضمير «ابنته» ضمير الموصول «تحته» ضمير رسول الله صلى الله عليه وسلم وذلك هو أبو بكر .وقد ظهر أن المراد بالعبدين نوح ولوط وإنما خصّا بوصف «عبدين صالحين» مع أن وصف النبوة أخص من وصف الصلاح تنويهاً بوصف الصلاح وإيماء إلى أن النبوة صلاح ليعظم بذلك شأن الصالحين كما في قوله تعالى : { وبشرناه بإسحاق نبياً من الصالحين } [ الصافات : 112 ] . ولتكون الموعظة سارية إلى نساء المسلمين في معاملتهن أزواجهن فإن وصف النبوءة قد انتهى بالنسبة للأمة الإِسلامية ، مع ما في ذلك من تهويل الأذى لعباد الله الصالحين وعناية ربهم بهم ومدافعته عنهم .والخيانة والخون ضد الأمانة وضد الوفاء ، وذلك تفريط المرء ما اؤتمن عليه وما عهد به إليه . وقد جمعها قوله تعالى : { يأيها الذين آمنوا لا تخونوا الله والرسول وتخونوا أماناتكم وأنتم تعلمون } [ الأنفال : 27 ] .وانتصب { شيئاً } على المفعولية المطلقة ل { يغنيا } لأن المعنى شيئاً من الغنى ، وتنكير { شيئاً } للتحقير ، أي أقل غنى وأجحفه بَلْهَ الغنى المهم ، وتقدم في قوله تعالى : { إنهم لن يغنوا عنك من الله شيئاً } في سورة [ الجاثية : 19 ] .وزيادة مع الداخلين } لإِفادة مساواتهما في العذاب لغيرهما من الكفرة الخونة . وذلك تأييس لهما من أن ينتفعا بشيء من حظوة زوجيهما كقوله تعالى : { ويوم نحشرهم جميعاً ثم نقول للذين أشركوا أين شركاؤكم الذين كنتم تزعمون } [ الأنعام : 22 ] .\n","ar.waseet":"وبعد هذه النداءات ، للمؤمنين ، وللكافرين وللنبى - صلى الله عليه وسلم - ضرب - سبحانه - مثلين لنساء كافرات فى بيوت أنبياء ، ولنساء مؤمنات فى بيوت كفار ، لتزداد الموعظة وضوحا ، وليزداد المؤمنون إيمانا على إيمانهم ، وليشعر الجميع - ولا سيما أزواج النبى - صلى الله عليه وسلم - أنهم مسئولون أمام الله - تعالى - عن أعمالهم . . . فقال - تعالى - : ( ضَرَبَ الله مَثَلاً . . . ) .المراد بضرب المثل . إيراد حالة غريبة ، ليعرف بها حالة أخرى مشابهة لها فى الغرابة . وقوله ( مَثَلاً ) مفعول ثان لضرب ، والمفعول الأول ( امرأت نُوحٍ . . . ) .والمتدبر للقرآن الكريم ، يراه قد أكثر من ضرب الأمثال ، لأن فيها تقريبا للبعيد ، وتوضيحا للغريب وتشبيه الأمر المعقول بالأمر المحسوس ، حتى يرسخ فى الأذهان . .أى : جعل الله - تعالى - مثلا لحال الكافرين ، وأنه لا يغنى أحد عن أحد ( امرأت نُوحٍ وامرأت لُوطٍ ) عليهما السلام .وعدى الفعل ( ضَرَبَ ) باللام ، للإشعار بأن هذا المثل إنما سيق من أجل أن يعتبر به الذين كفروا ، وأن يقلعوا عن جهالاتهم التى جعلتهم يعتقدون أن أصنامهم ستشفع لهم يوم القيامة .وقوله - تعالى - : ( كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا . . ) بيان لحال هاتين المرأتين ، ولما قامتا به من أفعال شائنة ، تتنافى مع صلتهما بهذين النبيين الكريمين . .والمراد بالتحتية هنا : كونهما زوجين لهذين النبيين الكريمين ، وتحت عصمتهما وصيانتهما ، وأشد الناس التصاقا بهما .وقال - سبحانه - ( كَانَتَا تَحْتَ عَبْدَيْنِ . . ) للتعظيم ، أى : كانتا فى عصمة نبيين لهما من سمو المنزلة ما لهما عند الله - تعالى - .ووصفهما - سبحانه - بالصلاح ، مع أنهما نبيان والنبوة أعظم هبة من الله لعبد من عباده - للتنويه بشأن الصالحين من الناس ، حتى يحرصوا على هذه الصفة ، ويتمسكوا بها ، فقد مدح الله - تعالى - من هذه صفاته فى آيات كثيرة ، منها قوله - تعالى - : ( وَبَشَّرْنَاهُ بِإِسْحَاقَ نَبِيّاً مِّنَ الصالحين ) وخيانة امرأة نوح له ، كانت عن طريق إفشاء أسراره ، وقولها لقومه : إنه مجنون .وخيانة امرأة لوط له ، كانت عن طريق إرشاد قومه إلى ضيوفه . . . مع استمرار هاتين المرأتين على كفرهما .قال الإمام ابن كثير : قوله : ( فَخَانَتَاهُمَا ) أى : فى الإيمان ، لم يوافقا هما على الإيمان ، ولا صدقاهما فى الرسالة .وليس المراد بقوله : ( فَخَانَتَاهُمَا ) فى فاحشة ، بل فى الدين ، فإن نساء الأنبياء معصومات عن الوقوع فى الفاحشة .وعن ابن عباس : قال : مازنتا ، أما امرأة نوح ، فكانت تخبر أنه مجنون ، وأما خيانة امرأة لوط ، فكانت تدل على قومها على أضيافه .وفى رواية عنه قال : كانت خيانتهما أن امرأة نوح ، كانت تفشى سره ، فإذا آمن معه نوح أحد أخبرت الجبابرة من قوم نوح به ، وأما امرأة لوط ، فكانت إذا أضاف لوط أحدا ، أخبرت به أهل المدينة ممن يعلم السوء . .وقوله - تعالى - : ( فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ الله شَيْئاً وَقِيلَ ادخلا النار مَعَ الداخلين ) بيان لما أصابهما من سوء العاقبة بسبب خيانتهما .أى : أن نوحا ولوطا - عليهما السلام - مع جلالة قدرهما ، لم يستطيعا أن يدفعا شيئا من العذاب عن زوجتيهما الخائنتين لهما ، وإنما قيل لهاتين المرأتين عند موتهما .أو يوم القيامة ، ادخلا النار مع سائر الداخلين من الكفرة الفجرة .وقوله ( شَيْئاً ) منصوب على أنه مفعول مطلق لقوله : ( يُغْنِيَا ) ، وجاء منكرا للتقليل والتحقير ، أى : فلم يغنيا عنهما شيئا من الإغناء حتى ولو كان قليلا . .وقوله : ( مَعَ الداخلين ) بعد قوله : ( ادخلا النار ) لزيادة تبكيتها ، ولتأكيد مساواتهما فى العذاب مع غيرهما من الكافرين الخائنين الذين لا صلة لهما بالأنبياء من حيث القرابة أو ما يشبهها .\n","ar.baghawi":"ثم ضرب الله مثلا للصالحين والصالحات من النساء فقال - جل ذكره - : ( ( ضرب الله مثلا للذين كفروا امرأة نوح ) واسمها واعلة ( وامرأة لوط ) واسمها واهلة . وقال مقاتل : والعة ووالهة .( كانتا تحت عبدين من عبادنا صالحين ) وهما نوح ولوط عليهما السلام ( فخانتاهما ) قال ابن عباس : ما بغت امرأة نبي قط وإنما كانت خيانتهما أنهما كانتا على غير دينهما فكانت امرأة نوح تقول للناس : إنه مجنون ، وإذا آمن به أحد أخبرت به الجبابرة وأما امرأة لوط [ فإنها كانت ] تدل قومه على أضيافه إذا نزل به ضيف بالليل أوقدت النار ، وإذا نزل بالنهار دخنت ليعلم قومه أنه نزل به ضيف .وقال الكلبي : أسرتا النفاق وأظهرتا الإيمان .( فلم يغنيا عنهما من الله شيئا ) لم يدفعا عنهما مع نبوتهما عذاب الله ( وقيل ادخلا النار مع الداخلين ) قطع الله بهذه الآية طمع كل من يركب المعصية أن ينفعه صلاح غيره .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5239.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5239.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5239.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"وَضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ آمَنُوا امْرَأَتَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِنْ فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ","transliteration":"Wa darabal laahu masa lal-lillazeena aamanumra ata Fir'awn; iz qaalat rabbibni lee 'indaka baitan fil jannati wa najjinee min Fir'awna wa 'amalihii wa najjinee minal qawmiz zaalimeen","translations":{"en.ahmedali":"And God presents the example of Pharaoh's wife for those who believe, when she said: \"O Lord, build me a house in Paradise, and save me from Pharaoh and his deeds, and save me from a wicked people;\"","en.ahmedraza":"And Allah illustrates an example of the Muslims – the wife of Firaun; when she prayed, “My Lord! Build a house for me near You, in Paradise, and deliver me from Firaun and his works, and rescue me from the unjust people.”","en.arberry":"God has struck a similitude for the believers -- the wife of Pharaoh, when she said, 'My Lord, build for me a house in Paradise, in Thy presence, and deliver me from Pharaoh and his work, and do Thou deliver me from the people of the evildoers.'","en.asad":"And for those who have attained to faith God has propounded a parable in [the story of] Pharaoh's wife as she prayed \"O my Sustainer! Build Thou for me a mansion in the paradise [that is] with Thee, and save me from Pharaoh and his doings, and save me, from all evildoing folk!","en.daryabadi":"And Allah propoundeth for those who believe the similitude of the wife Of Fir'awn, when she said: 'my Lord! build me in Thine presence a house in the Garden, and deliver me from Fir'awn and his handiwork, and deliver me from the transgressing people.","en.hilali":"And Allah has set forth an example for those who believe, the wife of Fir'aun (Pharaoh), when she said: \"My Lord! Build for me a home with You in Paradise, and save me from Fir'aun (Pharaoh) and his work, and save me from the people who are Zalimun (polytheists, wrong-doers and disbelievers in Allah).","en.pickthall":"And Allah citeth an example for those who believe: the wife of Pharaoh when she said: My Lord! Build for me a home with thee in the Garden, and deliver me from Pharaoh and his work, and deliver me from evil-doing folk;","en.qaribullah":"But to those who believe Allah has given as an example Pharaoh's wife, who said: 'My Lord, build me a house before You in Paradise and save me fromPharaoh and his work, and save me from a harmdoing nation'","en.sahih":"And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\"","en.sarwar":"To the believers, as a parable, God has told the story of the wife of the Pharaoh who said, \"Lord, establish for me a house in Paradise in your presence. Rescue me from Pharaoh and his deeds and save me from the unjust people.","en.yusufali":"And Allah sets forth, as an example to those who believe the wife of Pharaoh: Behold she said: \"O my Lord! Build for me, in nearness to Thee, a mansion in the Garden, and save me from Pharaoh and his doings, and save me from those that do wrong\";","en.maududi":"Allah has set forth for the believers the parable of Pharaoh's wife. She prayed: “My Lord, build for me a house with You in Paradise and deliver me from Pharaoh and his misdeeds; and deliver me from the iniquitous people.”","en.shakir":"And Allah sets forth an example to those who believe the wife of Firon when she said: My Lord! build for me a house with Thee in the garden and deliver me from Firon and his doing, and deliver me from the unjust people:","en.itani":"And God illustrates an example of those who believe: the wife of Pharaoh, when she said, “My Lord, build for me, with you, a house in Paradise, and save me from Pharaoh and his works, and save me from the wrongdoing people.”","en.mubarakpuri":"And Allah has set forth an example for those who believe: the wife of Fir`awn, when she said: \"My Lord! Build for me a home with You in Paradise, and save me from Fir`awn and his work, and save me from the people who are wrongdoers.","en.qarai":"Allah cites an example of the faithful: the wife of Pharaoh, when she said, ‘My Lord! Build me a home near You in paradise, and deliver me from Pharaoh and his conduct, and deliver me from the wrongdoing lot.’","en.wahiduddin":"To the believers God has given the example of Pharaoh's wife who said: \"My Lord, build me a house in nearness to You in Paradise and save me from Pharaoh and his misdeeds. Save me from all evil-doers.\""},"tafsir":{"ar.muyassar":"وضرب الله مثلا لحال المؤمنين- الذين صدَّقوا الله، وعبدوه وحده، وعملوا بشرعه، وأنهم لا تضرهم مخالطة الكافرين في معاملتهم- بحال زوجة فرعون التي كانت في عصمة أشد الكافرين بالله، وهي مؤمنة بالله، حين قالت: رب ابْنِ لي دارًا عندك في الجنة، وأنقذني من سلطان فرعون وفتنته، ومما يصدر عنه من أعمال الشر، وأنقذني من القوم التابعين له في الظلم والضلال، ومن عذابهم.","ar.jalalayn":"«وضرب الله مثلا للذين آمنوا امرأة فرعون» آمنت بموسى واسمها آسية فعذبها فرعون بأن أوتد يديها ورجليها وألقى على صدرها رحى عظيمة واستقبل بها الشمس فكانت إذا تفرق عنها من وكل بها ظللتها الملائكة «إذ قالت» في حال التعذيب «رب ابن لي عندك بيتا في الجنة» فكشف لها فرأته فسهل عليها التعذيب «ونجني من فرعون وعمله» وتعذيبه «ونجني من القوم الظالمين» أهل دينه فقبض الله روحها، وقال ابن كيسان: رفعت إلى الجنة حية فهي تأكل وتشرب.","ar.qurtubi":"قوله تعالى : وضرب الله مثلا للذين آمنوا امرأة فرعون إذ قالت رب ابن لي عندك بيتا في الجنة ونجني من فرعون وعمله ونجني من القوم الظالمين[ ص: 187 ] قوله تعالى : وضرب الله مثلا للذين آمنوا امرأة فرعون واسمها آسية بنت مزاحم . قال يحيى بن سلام : قوله ضرب الله مثلا للذين كفروا مثل ضربه الله يحذر به عائشة وحفصة في المخالفة حين تظاهرتا على رسول الله صلى الله عليه وسلم ، ثم ضرب لهما مثلا بامرأة فرعون ومريم ابنة عمران ; ترغيبا في التمسك بالطاعة والثبات على الدين . وقيل : هذا حث للمؤمنين على الصبر في الشدة ; أي لا تكونوا في الصبر عند الشدة أضعف من امرأة فرعون حين صبرت على أذى فرعون . وكانت آسية آمنت بموسى . وقيل : هي عمة موسى آمنت به . قال أبو العالية : اطلع فرعون على إيمان امرأته فخرج على الملأ فقال لهم : ما تعلمون من آسية بنت مزاحم ؟ فأثنوا عليها . فقال لهم : إنها تعبد ربا غيري . فقالوا له : اقتلها . فأوتد لها أوتادا وشد يديها ورجليها فقالت : رب ابن لي عندك بيتا في الجنة ووافق ذلك حضور فرعون ، فضحكت حين رأت بيتها في الجنة . فقال فرعون : ألا تعجبون من جنونها ! إنا نعذبها وهي تضحك ; فقبض روحها . وقال سلمان الفارسي فيما روى عنه عثمان النهدي : كانت تعذب بالشمس ، فإذا أذاها حر الشمس أظلتها الملائكة بأجنحتها . وقيل : سمر يديها ورجليها في الشمس ووضع على ظهرها رحى ; فأطلعها الله حتى رأت مكانها في الجنة . وقيل : لما قالت : رب ابن لي عندك بيتا في الجنة أريت بيتها في الجنة يبنى . وقيل : إنه من درة ; عن الحسن .ولما قالت : \" ونجني \" نجاها الله أكرم نجاة ، فرفعها إلى الجنة ، فهي تأكل وتشرب وتتنعم .من فرعون وعمله تعني بالعمل : الكفر . وقيل : \" من عمله \" : من عذابه وظلمه وشماتته . وقال ابن عباس : الجماع .ونجني من القوم الظالمين قال الكلبي : أهل مصر . مقاتل : القبط . قال الحسن وابن كيسان : نجاها الله أكرم نجاة ، ورفعها إلى الجنة ; فهي فيها تأكل وتشرب .\n","ar.miqbas":"وَضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ آَمَنُوا اِمْرَأَةَ فِرْعَوْنَ إِذْ قَالَتْ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ وَنَجِّنِي مِنْ فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ (11)لما ضرب المثل { للذين كفروا } [ الممتحنة : 10 ] أعقب بضرب مثل للذين آمنوا لتحصل المقابلة فيتضح مقصود المثَلَين معاً ، وجريا على عادة القرآن في إتباع الترهيب بالترغيب .وجعل المثل للذين آمنوا بحال امرأتين لتحصل المقابلة للمثَلَين السابقين ، فهذا من مراعاة النظير في المثلين .وجاء أحد المثلين للذين آمنوا مثلاً لإِخلاص الإِيمان . والمثل الثاني لشدة التقوى .فكانت امرأة فرعون مثلاً لمتانة إيمان المؤمنين ومريم مثلاً للقانتين لأن المؤمنين تبرأوا من ذوي قرابتهم الذين بقوا على الكفر بمكة .وامرأة فرعون هذه هي امرأة فرعون الذي أُرسل إليه موسى وهو منفط الثالث وليست امرأة فرعون التي تبنتْ موسى حين التقطتْه من اليَمّ ، لأن ذلك وقع في زمن فرعون رعمسيس الثاني وكان بين الزمنين ثمانون سنة . ولم يكن عندهم علم بدين قبل أن يرسل إليهم موسى .ولعل امرأة فرعون هذه كانت من بنات إسرائيل تزوجها فرعون فكانت مؤمنة برسالة موسى عليه السلام . وقد حكى بعض المفسرين أنها عمة موسى ، أو تكون هداها الله إلى الإِيمان بموسى كما هدى الرجل المؤمن من آل فرعون الذي تقدم ذكره في سورة غافر . وسماها النبي صلى الله عليه وسلم آسية في قوله : « كَمُل من الرجال كثير ولم يكمل من النساء إلا مريمُ ابنة عمران وآسيةُ امرأة فرعون » رواه البخاري .وأرادت بعمل فرعون ظلمه ، أي نجّني من تبعة أعماله فيكون معنى { نجّني من فرعون } من صحبته طلبت لنفسها فرجاً وهو من عطف الخاص على العام .ومعنى { قالت } أنها أعلنت به ، فقد روي أن فرعون اطّلع عليها وأعلن ذلك لقومه وأمر بتعذيبها فماتت في تعذيبه ولم تحس ألماً .والقوم الظالمون : هم قوم فرعون . وظلمهم : إشراكهم بالله .والظاهر أن قولها : { ابن لي عندك بيتاً في الجنة } مؤذن بأن فرعون وقومه صدّوها عن الإِيمان به وزيّنوا لها أنا إن آمنت بموسى تضيع ملكاً عظيماً وقصراً فخيماً أو أن فرعون وعظها بأنها إن أصرّت على ذلك تقتل ، فلا يكون مدفنها الهرم الذي بناه فرعون لنفسه لدفنه في بادىء الملوك . ويؤيد هذا ما رواه المفسرون أن بيتها في الجنة من درّة واحدة فتكون مشابهة الهرم الذي كان معدّاً لحفظ جثتها بعد موتها وزوجها . فقولها ذلك كقول السحرة الذين آمنوا جواباً عن تهديد فرعون { لن نؤثرك على ما جاءنا من البينات والذي فطرنا فاقض ما أنت قاض } الآية في سورة [ طه : 72 ] .\n","ar.waseet":"ثم ضرب - سبحانه - مثلا للمؤمنين فقال : ( وَضَرَبَ الله مَثَلاً لِّلَّذِينَ آمَنُواْ امرأت فِرْعَوْنَ ) وهى آسية ابنة مزاحم ، التى لم يمنعها ظلام الكفر الذى كانت تعيش فيه فى بيت فرعون ، ولم يشغلها ما كانت فيه من متاع الحياة الدنيا وزينتها . . . عن أن تطلب الحق ، وتعرض عن الباطل ، وأن تكفر بكل ما يدعيه زوجها من كذب وطغيان .قال الجمل : آمنت بموسى - عليه السلام - لما غلب السحرة ، وتبين لها أنه على الحق . ولم تضرها الوصلة بالكافر ، وهى الزوجية التى هى من أعظم الوصل ولا نفعه إيمانها ، لأن كل امرىء بما كسب رهين . . .وروى الشيخان عن أبى موسى الأشعرى \" أنه قال : كمل من الرجال كثير ، ولم يكمل من النساء إلا أربع : مريم ابنة عمران ، وخديجة بنت خويلد ، وفاطمة بنت محمد - صلى الله عليه وسلم - وآسية بنت مزاحم ، امرأة فرعون \" .قيل : إنها إسرائيلية وأنها عمة موسى . وقيل إنها ابنة عم فرعون . . . ومن فضائلها أنها اختارت القتل على الملك ، وعذاب الدنيا على النعيم الذى كانت فيه - بعد أن خالط الإيمان قلبها .أى : وجعل الله - تعالى - حال امرأة فرعون ، مثلا للمؤمنين ، حيث آمنت بالحق بعد أن تبين لها ، دون أن يصرفها عن ذلك أى صارف ، فكان ما فعلته فى أسمى درجات الإخلاص وصدق اليقين .والظرف فى قوله : ( إِذْ قَالَتْ . . ) متعلق بمحذوف ، أو بقوله : ( مَثَلاً ) .أى : وضرب الله - تعالى - مثلا للذين آمنوا ، حال امرأة فرعون وقت أن قالت ( رَبِّ ابن لِي عِندَكَ بَيْتاً فِي الجنة ) أى : ابن لى بيتا فى مستقر رحمتك ، أو فى جنتك التى لا يستطيع أحد التصرف فيها إلا بإذنك .وقوله : ( فِي الجنة ) بدل أو عطف بيان لقوله - تعالى - ( عِندَكَ ) وقدم عندك ، للإشعار بأن محبتها للقرب من رحمته - تعالى - أهم من أى شىء آخر .( وَنَجِّنِي مِن فِرْعَوْنَ وَعَمَلِهِ ) أى : ونجنى من طغيان فرعون ، ومن عمله الذى بلغ النهاية فى السوء والقبح .( وَنَجِّنِي ) - أيضا - من القوم الظالمين ، وهم أتباع فرعون وحاشيته وملؤه ، وشيعته . .وفى هذا الدعاء أسمى ألوان الأدب ، فهى تسأل الله - تعالى - أن يعوضها عن دار فرعون ، دارا فى أعلى درجات الجنة .. .وهذا الدعاء يشعر بأن فرعون وقومه ، قد صدوها عن الإيمان ، وهددوها بأنها إن آمنت . . حرموها من قصر فرعون ، وزينته وفخامته .كما أنها سألت ربها - عز وجل - أن ينجيها من ذات فرعون ، ومن علمه السىء ، ومن كل من حام حول فرعون ، واتبعه فى طغيانه وكفره .\n","ar.baghawi":"ثم أخبر أن معصية غيره لا تضره إذا كان مطيعا فقال : ( وضرب الله مثلا للذين آمنوا امرأة فرعون ) وهي آسية بنت مزاحم .قال المفسرون : لما غلب موسى السحرة آمنت امرأة فرعون ، ولما تبين لفرعون إسلامها أوتد يديها ورجليها بأربعة أوتاد وألقاها في الشمس .قال سلمان : كانت امرأة فرعون تعذب بالشمس فإذا انصرفوا عنها أظلتها الملائكة .( إذ قالت رب ابن لي عندك بيتا في الجنة ) فكشف الله لها عن بيتها في الجنة حتى رأته .وفي القصة : أن فرعون أمر بصخرة عظيمة لتلقى عليها فلما أتوها بالصخرة قالت : رب ابن لي عندك بيتا في الجنة فأبصرت بيتها في الجنة من درة بيضاء ، وانتزع روحها فألقيت الصخرة على جسد لا روح فيه ولم تجد ألما .وقال الحسن وابن كيسان : رفع الله امرأة فرعون إلى الجنة فهي فيها تأكل وتشرب .( ونجني من فرعون وعمله ) قال مقاتل : وعمله يعني الشرك . وقال أبو صالح عن ابن عباس \" وعمله \" قال : جماعه . ( ونجني من القوم الظالمين ) الكافرين .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5240.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5240.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5240.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِنْ رُوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ","transliteration":"Wa Maryamab nata 'Imraanal lateee ahsanat farjahaa fanafakhnaa feehi mir roobinaa wa saddaqat bikali maati Rabbihaa wa Kutubihee wakaanat minal qaaniteen","translations":{"en.ahmedali":"And of Mary, daughter of 'Imran, who guarded her chastity, so that We breathed into her a new life from Us, and she believed the words of her Lord and His Books, and was among the obedient.","en.ahmedraza":"And the example of Maryam the daughter of Imran, who guarded her chastity – We therefore breathed into her a Spirit from Ourselves – and she testified for the Words of her Lord and His Books, and was among the obedient.","en.arberry":"And Mary, Imran's daughter, who guarded her virginity, so We breathed into her of Our Spirit, and she confirmed the Words of her Lord and His Books, and became one of the obedient.","en.asad":"And [We have propounded yet another parable of God-consciousness in the story of] Mary, the daughter of Imran, who guarded her chastity, whereupon We breathed of Our spirit into that [which was in her womb], and who accepted the truth of her Sustainer’s words - and [thus,] of His revelations - and was one of the truly devout.","en.daryabadi":"And the similitude of Maryram daughter of lmran, who preserved her chastity, wherefore We breathed in it Of Our Spirit. And she testified to the words of her Lord and His Books and she was of the devout.","en.hilali":"And Maryam (Mary), the daughter of 'Imran who guarded her chastity; and We breathed into (the sleeve of her shirt or her garment) through Our Ruh [i.e. Jibrael (Gabriel)], and she testified to the truth of the Words of her Lord [i.e. believed in the Words of Allah: \"Be!\" and he was; that is 'Iesa (Jesus) - son of Maryam (Mary); as a Messenger of Allah], and (also believed in) His Scriptures, and she was of the Qanitin (i.e. obedient to Allah).","en.pickthall":"And Mary, daughter of 'Imran, whose body was chaste, therefor We breathed therein something of Our Spirit. And she put faith in the words of her Lord and His scriptures, and was of the obedient.","en.qaribullah":"And, Mary, 'Imran's daughter, who guarded her chastity so We breathed into her of Our Spirit (Gabriel); and she put her trust in the Words of her Lord andHis Books, and was among the devout.","en.sahih":"And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.","en.sarwar":"He has also told, as a parable, the story of Mary, daughter of Imran who preserved her virginity and (into whose womb) We breathed Our spirit. She made the words of her Lord and the predictions in His Books come true. She was an obedient woman.","en.yusufali":"And Mary the daughter of 'Imran, who guarded her chastity; and We breathed into (her body) of Our spirit; and she testified to the truth of the words of her Lord and of His Revelations, and was one of the devout (servants).","en.maududi":"Allah has also set forth the parable of Mary, the daughter of Imran, who guarded her chastity, and into whom We breathed of Our Spirit, and who testified to the words of her Lord and His Books. She was among the obedient.","en.shakir":"And Marium, the daughter of Imran, who guarded her chastity, so We breathed into her of Our inspiration and she accepted the truth of the words of her Lord and His books, and she was of, the obedient ones.","en.itani":"And Mary, the daughter of Imran, who guarded her womb, and so We breathed into her of Our Spirit; and she believed in the truth of her Lord’s Words and His Books, and was one of the devout.","en.mubarakpuri":"And Maryam, the daughter of `Imran who guarded her chastity (private part). And We breathed into it through Our Ruh, and she testified to the truth of her Lords Kalimat, and His Kutub, and she was of the Qanitin.","en.qarai":"And Mary, daughter of Imran, who guarded the chastity of her womb, so We breathed into it of Our spirit. She confirmed the words of her Lord and His Books, and she was one of the obedient.","en.wahiduddin":"[God gave another example in the story of] Mary, 'Imran's daughter, who preserved her chastity and We breathed Our spirit into her; she testified to the words of her Lord and His Scriptures, and was truly devout."},"tafsir":{"ar.muyassar":"وضرب الله مثلا للذين آمنوا مريم بنت عمران التي حفظت فرجها، وصانته عن الزنى، فأمر الله تعالى جبريل عليه السلام أن ينفخ في جيب قميصها، فوصلت النفخة إلى رحمها، فحملت بعيسى عليه السلام، وصدَّقت بكلمات ربها، وعملت بشرائعه التي شرعها لعباده، وكتبه المنزلة على رسله، وكانت من المطيعين له.","ar.jalalayn":"«ومريم» عطف على امرأة فرعون «ابنة عمران التي أحصنت فرجها» حفظته «فنفخنا فيه من روحنا» أي جبريل حيث نفخ في جيب درعها بخلق الله تعالى فعله الواصل إلى فرجها فحملت بعيسى «وصدقت بكلمات ربها» شرائعه «وكتبه» المنزلة «وكانت من القانتين» من القوم المطيعين.","ar.qurtubi":"قوله تعالى : ومريم ابنت عمران التي أحصنت فرجها فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه وكانت من القانتينقوله تعالى : ومريم ابنة عمران أي واذكر مريم . وقيل : هو معطوف على امرأة فرعون . والمعنى : وضرب الله مثلا لمريم ابنة عمران وصبرها على أذى اليهود .التي أحصنت فرجها أي عن الفواحش . وقال المفسرون : إنه أراد بالفرج هنا الجيب لأنه قال : [ ص: 188 ] فنفخنا فيه من روحنا ، وجبريل عليه السلام إنما نفخ في جيبها ولم ينفخ في فرجها . وهي في قراءة أبي \" فنفخنا في جيبها من روحنا \" . وكل خرق في الثوب يسمى جيبا ; ومنه قوله تعالى : وما لها من فروج . ويحتمل أن تكون أحصنت فرجها ونفخ الروح في جيبها . ومعنى فنفخنا أرسلنا جبريل فنفخ في جيبها من روحنا أي روحا من أرواحنا وهي روح عيسى . وقد مضى في آخر سورة \" النساء \" بيانه مستوفى والحمد لله .وصدقت بكلمات ربها قراءة العامة وصدقت بالتشديد . وقرأ حميد والأموي \" وصدقت \" بالتخفيف . \" بكلمات ربها \" : قول جبريل لها : إنما أنا رسول ربك الآية . وقال مقاتل : يعني بالكلمات عيسى وأنه نبي وعيسى كلمة الله . وقد تقدم .وقرأ الحسن وأبو العالية \" بكلمة ربها وكتابه \" وقرأ أبو عمرو وحفص عن عاصم : \" وكتبه \" جمعا . وعن أبي رجاء \" وكتبه \" مخفف التاء . والباقون \" بكتابه \" على التوحيد . والكتاب يراد به الجنس ; فيكون في معنى كل كتاب أنزل الله تعالى .وكانت من القانتين أي من المطيعين . وقيل : من المصلين بين المغرب والعشاء . وإنما لم يقل من القانتات ; لأنه أراد وكانت من القوم القانتين . ويجوز أن يرجع هذا إلى أهل بيتها ; فإنهم كانوا مطيعين لله . وعن معاذ بن جبل رضي الله عنه أن النبي صلى الله عليه وسلم قال لخديجة وهي تجود بنفسها : \" أتكرهين ما قد نزل بك ولقد جعل الله في الكره خيرا ، فإذا قدمت على ضراتك فأقرئيهن مني السلام : مريم بنت عمران وآسية بنت مزاحم وكليمة - أو قال : حكيمة - بنت عمران أخت موسى بن عمران \" . فقالت : بالرفاء والبنين يا رسول الله . وروى قتادة عن أنس عن رسول الله صلى الله عليه وسلم قال : \" حسبك من نساء العالمين أربع مريم ابنة عمران وخديجة بنت خويلد وفاطمة بنت محمد وآسية امرأة فرعون بنت مزاحم \" . وقد مضى في ( آل عمران ) الكلام في هذا مستوفى ، والحمد لله\n","ar.miqbas":"وَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِنْ رُوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ (12)عطف على { امرأت فرعون } ، أي وضرب الله مثلاً للذين آمنوا مريم ابنة عمران ، فضرَب مثلَيْن في الشرّ ومثلين في الخير .ومريم ابنة عمران تقدم الكلام على نسبها وكرامتها في سورة آل عمران وغيرها ، وقد ذكر الله باسمها في عدة مواضع من القرآن ، وقال ابن التلمساني في «شرح الشفاء» لعياض : لم يَذكُر الله امرأة في القرآن باسمها إلا مريم للتنبيه على أنها أمةُ الله إبطالاً لعقائد النصارى .والإِحصان : جعل الشيء حصيناً ، أي لا يُسلك إليه . ومعناه : منعت فرجها عن الرجال .وتفريع { فنفخنا فيه من روحنا } تفريع العطية على العمل لأجله . أي جزيناها على إحصان فرجها ، أي بأن كوّن الله فيه نبيئاً بصفة خارقة للعادة فخلد بذلك ذكرها في الصالحات .والنفخ : مستعار لسرعة إبداع الحياة في المكوّن في رحمها . وإضافة الروح إلى ضمير الجلالة لأن تكوين المخلوق الحيّ في رحمها كان دون الأسباب المعتادة ، أو أُريد بالروح الملك الذي يؤمر بنفخ الأرواح في الأجنة ، فعلى الأول تكون { من } تبعيضية ، وعلى الثاني تكون ابتدائية ، وتقدم قوله تعالى : { فنفخنا فيها من روحنا } في سورة [ الأنبياء : 91 ] .وتصديقها : يقينها بأن ما أبلغ إليها الملَكُ من إرادة الله حملها .وكلمات ربها } : هي الكلمات التي ألقاها إليها بطريق الوحي .و { وكتابه } يجوز أن يكون المراد به «الإِنجيل» الذي جاء به ابنها عيسى وهو إن لم يكن مكتوباً في زمن عيسى فقد كتبه الحواريون في حياة مريم .ويجوز أن يراد ب { كتابه } ، أراده الله وقدّره أن تحمل من دون مس رجل إياها من باب وكان كتاباً مفعولاً .والقانت : المتمحض للطاعة . يجوز أن يكون و { من } للابتداء .والمراد بالقانتين : المكثرون من العبادة . والمعنى أنها كانت سليلة قوم صالحين ، أي فجاءت على طريقة أصولها في الخير والعفاف. ... وهل ينبت الخَطِّيُّ إلا وشيجَهُوهذا إيماء إلى تبرئتها مما رماها به القوم البهت .وهذا نظير قوله تعالى : { والطيبات للطيبين والطيبون للطيبات أولئك مبرءون مما يقولون } [ النور : 26 ] .ويجوز أن تجعل { من } للتعبيض ، أي هي بعض من قنت لله . وغلبت صيغة جمع الذكور ولم يقل : من القانتات ، جرياً على طريقة التغليب وهو من تخريج الكلام على مقتضى الظاهر . وهذه الآية مثال في علم المعاني .ونكتته هنا الإِشارة إلى أنها في عداد أهل الإِكثار من العبادة وأن شأن ذلك أن يكون للرجال لأن نساء بني إسرائيل كن معفيات من عبادات كثيرة .ووصفت مريم بالموصول وصلته لأنها عُرفت بتلك الصلة من قصتها المعروفة من تكرر ذكرها فيما نزل من القرآن قبل هذه السورة .وفي ذكر { القانتين } إيماء إلى ما أوصى الله به أمهات المؤمنين بقوله تعالى : { ومن يقنت منكن لله ورسوله وتعمل صالحاً نؤتها أجرها مرتين } [ الأحزاب : 31 ] الآية .وقرأ الجمهور { وكتابه } . وقرأه حفص وأبو عمرو ويعقوب { وكُتُبه } بصيغة الجمع ، أي آمنت بالكتب التي أنزلت قبل عيسى وهي «التوراة» و«الزبور» وكتب الأنبياء من بني إسرائيل ، و«الإِنجيل» إن كان قد كتبه الحواريون في حياتها .\n","ar.waseet":"وقوله - سبحانه - : ( وَمَرْيَمَ ابنت عِمْرَانَ . . ) معطوف على ( امرأت فِرْعَوْنَ . . ) .أى : وضرب الله - تعالى - مثلا آخر للمؤمنين مريم ابنة عمران .( التي أَحْصَنَتْ فَرْجَهَا ) أى حفظته وصانته ، إذ الإحصان جعل الشىء حصينا ، بحيث لا يتوصل إليه ، وهو كناية عن عفتها وطهارتها وبعدها عن كل فاحشة .وقوله ( فَنَفَخْنَا فِيهِ ) النافخ رسوله جبريل - عليه السلام - فالإسناد مجازى . وقيل الكلام على حذف مضاف ، أى : فنفخ رسولنا ، وضمير ( فِيهِ ) للفرج .واشتهر أن جبريل - عليه السلام - نفخ فى جيبها فوصل أثر ذلك إلى الفرج .وقال الفراء : ذكر المفسرون أن الفرج جيب درعها ، وهو محتمل لأن الفرج معناه فى اللغة ، كل فرجة بين شيئين ، وموضع جيب درع المرأة مشقوق فهو فرج ، وهذا أبلغ فى الثناء عليها ، لأنها إذا منعت جيب درعها ، فهى للنفس أمنع . . .أى : فنفخ رسولنا جبريل فى فرجها أو فى جيب درعها ، روحا من أرواحنا هى روح عبدنا ونبينا عيسى - عليه السلام - .وإضافة الروح إلى ذاته - تعالى - لأنه هو الخالق والموجد وللإشارة إلى أن تكوين المخلوق الحى فى رحمها ، كان على غير الأسباب المعتادة .وقوله - تعالى - : ( وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ القانتين ) زيادة فى مدحها ، وفى الثناء عليها . . .أى : وكان من صفات مريم ابنة عمران أنها آمنت إيمانا حقا ( بِكَلِمَاتِ رَبِّهَا ) أى : بشرائعه التى شرعها لعباده ، وبما ألقاه إليها من إرشادات عن طريق وحيه .و ( وَكُتُبِهِ ) أى : وصدقت بكتبه التى أنزلها على أنبيائه ، وقرأ الجمهور ( وكتابه ) بالإفراد ، على أن المراد به جنس الكتب ، أو الإنجيل الذى أنزله - سبحانه - على ابنها عيسى .و ( مِنَ ) فى قوله - تعالى - ( وَكَانَتْ مِنَ القانتين ) للابتداء ، أى : وكانت من نسل الرجال القانتين ، الذين بذلوا أقصى جهدهم فى طاعة الله - تعالى - ، وفى إخلاص العبادة له .ويصح أن تكون ( مِنَ ) للتبعيض . أى : وكانت من عداد المواظبين على الطاعة ، وجىء بجمع الذكور على سبيل التغليب ، وللإشعار بأن طاعتها لا تقل عن طاعة الرجال ، الذين بلغوا الغاية فى المواظبة على طاعة الله - تعالى - .وبذلك نرى أن هذه الآيات الكريمة ، قد اشتملت على ثلاثة أمثال : مثل للكافرين ، ومثلين للمؤمنين .وقد تضمن مثل الكفار ، أن الكافر يعاقب على كفره ، دون أن ينفعه ما بينه وبين المؤمنين من قرابة أو نسب . . . كما حدث لامرأة نوح وامرأة لوط . .وأما المثلان اللذان للمؤمنين ، فقد تضمنا أن اتصال المؤمن بالكافر ، لا يضره شيئا إذا فارقه فى كفره وعمله ..وقد وضح صاحب الكشاف هذا المعنى فقال : ما ملخصه مثَّل الله - تعالى - حال الكفار ، فى أنهم يعاقبون على كفرهم وعداوتهم للمؤمنين . دون أن ينفعهم ما بينهم وبينهم من صلة أو قرابة - بحال امرأة نوح وامرأة لوط : فإنهما لما نافقتا وخانتا الرسولين . لم يغن عنهما ما بينهما وبينهما من وصلة الزواج شيئا . .ومثل حال المؤمنين - فى أن وصلة الكافرين لا تضرهم . ولا تنقص شيئا من ثوابهم وزلفاهم عند الله - بحال امرأة فرعون ، فإنها مع كونها زوجة أعدى أعداء الله ، فإنها بسبب إيمانها قد رفع منزلتها عنده . .وبحال مريم ابنة عمران ، فقد أعطاها الله ما أعطاها من الكرامة . . . مع أن قومها كانوا كافرين .وفى طى هذين التمثيلين تعريض بأمى المؤمنين المذكورتين فى أول السورة ، وما فرط منهما من التظاهر على رسول الله - صلى الله عليه وسلم - بما كرهه ، وتحذير لهما على أغلظ وجه وأشده . .وإشارة إلى أن من حقهما أن تكونا فى الإخلاص والكمال فيه ، كمثل هاتين المؤمنتين ، وأن لا تتكلا على أنهما زوجا رسول الله - صلى الله عليه وسلم - فإن ذلك الفضل لا ينفعهما إلا مع كونهما مخلصتين . . .وأسرار التنزيل ورموزه فى كل باب ، بالعة من اللطف والخفاء ، حدا يدق عن تفطن العالم ، ويزل عن تبصره . .\n","ar.baghawi":"( ومريم ابنت عمران التي أحصنت فرجها فنفخنا فيه ) أي في جيب درعها ولذلك ذكر الكناية ( من روحنا وصدقت بكلمات ربها ) يعني الشرائع التي شرعها الله للعباد بكلماته المنزلة ( وكتبه ) قرأ أهل البصرة وحفص : \" وكتبه \" على الجمع ، وقرأ الآخرون : \" وكتابه \" على التوحيد . والمراد منه الكثرة أيضا . وأراد بكتبه التي أنزلت على إبراهيم وموسى وداود وعيسى عليهم السلام . ( وكانت من القانتين ) أي من القوم القانتين المطيعين لربها ولذلك لم يقل من القانتات .وقال عطاء : \" من القانتين \" أي من المصلين . ويجوز أن يريد بالقانتين رهطها وعشيرتها فإنهم كانوا أهل صلاح مطيعين لله .وروينا عن النبي - صلى الله عليه وسلم - قال : \" حسبك من نساء العالمين : مريم بنت عمران وخديجة بنت خويلد وفاطمة بنت محمد وآسية امرأة فرعون \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5241.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5241.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5241.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":272,"letters":2083,"size":"212KB","priority":3,"commonlyRead":false}}