{"chapter":67,"name":{"arabic":"الملك","transliteration":"Al-Mulk","translation":"The Kingdom","revelation":"meccan"},"revelation":"meccan","verses":30,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","transliteration":"Tabaarakal lazee biyadihil mulku wa huwa 'alaa kulli shai-in qadeer","translations":{"en.ahmedali":"BLESSED BE HE who holds the (reins of) Kingship in His hand, who has power over everything,","en.ahmedraza":"Most Auspicious is He in Whose control is the entire kingship; and He is Able to do all things.","en.arberry":"Blessed be He in whose hand is the Kingdom -- He is powerful over everything --","en.asad":"HALLOWED be He in whose hand all dominion rests, since He has the power to will anything:","en.daryabadi":"Blest be He in whose hand is the dominion, and He is over everything Potent.","en.hilali":"Blessed is He in Whose Hand is the dominion, and He is Able to do all things.","en.pickthall":"Blessed is He in Whose hand is the Sovereignty, and, He is Able to do all things.","en.qaribullah":"Blessed be He in whose Hand is the Kingdom, He is powerful over all things,","en.sahih":"Blessed is He in whose hand is dominion, and He is over all things competent -","en.sarwar":"Blessed is He in whose hands is the Kingdom and who has power over all things.","en.yusufali":"Blessed be He in Whose hands is Dominion; and He over all things hath Power;-","en.maududi":"Blessed is He in Whose Hand is the dominion of the Universe, and Who has power over everything;","en.shakir":"Blessed is He in Whose hand is the kingdom, and He has power over all things,","en.itani":"Blessed is He in whose hand is the sovereignty, and Who has power over everything.","en.mubarakpuri":"Blessed be He in Whose Hand is the dominion; and He is Able to do all things.","en.qarai":"Blessed is He in whose hands is all sovereignty, and He has power over all things.","en.wahiduddin":"Blessed is He in whose hand is the Kingdom: He has power over all things;"},"tafsir":{"ar.muyassar":"تكاثر خير الله وبرُّه على جميع خلقه، الذي بيده مُلك الدنيا والآخرة وسلطانهما، نافذ فيهما أمره وقضاؤه، وهو على كل شيء قدير. ويستفاد من الآية ثبوت صفة اليد لله سبحانه وتعالى على ما يليق بجلاله.","ar.jalalayn":"«تبارك» تنزه عن صفات المحدثين «الذي بيده» في تصرفه «الملك» السلطان والقدرة «وهو على كل شيءٍ قدير».","ar.qurtubi":"سورة الملكمكية في قول الجميعوتسمى الواقية والمنجية . وهي ثلاثون آيةروى الترمذي عن ابن عباس قال : ضرب رجل من أصحاب رسول الله صلى الله عليه وسلم خباءه على قبر وهو لا يحسب أنه قبر ، فإذا قبر إنسان يقرأ سورة \" الملك \" حتى ختمها ، فأتى النبي صلى الله عليه وسلم فقال : يا رسول الله ، ضربت خبائي على قبر وأنا لا أحسب أنه قبر ، فإذا قبر إنسان يقرأ سورة \" الملك \" حتى ختمها ؟ فقال رسول الله صلى الله عليه وسلم : \" هي المانعة ، هي المنجية تنجيه من عذاب القبر \" . قال : حديث حسن غريب . وعنه قال : قال رسول الله صلى الله عليه وسلم : \" وددت أن \" تبارك الذي بيده الملك \" في قلب كل مؤمن \" ذكره الثعلبي . وعن أبي هريرة قال : قال النبي صلى الله عليه وسلم : ( إن سورة من كتاب الله ما هي إلا ثلاثون آية شفعت لرجل حتى أخرجته من النار يوم القيامة وأدخلته الجنة وهي سورة \" تبارك \" ) . خرجه الترمذي بمعناه ، وقال فيه : حديث حسن . وقال ابن مسعود : إذا وضع الميت في قبره فيؤتى من قبل رجليه ، فيقال : ليس لكم عليه سبيل ، فإنه كان يقوم بسورة \" الملك \" على قدميه . ثم يؤتى من قبل رأسه ، فيقول لسانه : ليس لكم عليه سبيل ، إنه كان يقرأ بي سورة \" الملك \" ثم قال : هي المانعة من عذاب الله ، وهي في التوراة [ ص: 190 ] سورة \" الملك \" من قرأها في ليلة فقد أكثر وأطيب . وروي أن من قرأها كل ليلة لم يضره الفتان .بسم الله الرحمن الرحيمتبارك الذي بيده الملك وهو على كل شيء قديرتبارك تفاعل من البركة وقد تقدم . وقال الحسن : تقدس . وقيل دام . فهو الدائم الذي لا أول لوجوده ولا آخر لدوامه .الذي بيده الملك أي ملك السموات والأرض في الدنيا والآخرة . وقال ابن عباس : بيده الملك يعز من يشاء ويذل من يشاء ، ويحيي ويميت ، ويغني ويفقر ، ويعطي ويمنع . وقال محمد بن إسحاق : له ملك النبوة التي أعز بها من اتبعه وذل بها من خالفه .وهو على كل شيء قدير من إنعام وانتقام .\n","ar.miqbas":"تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (1)افتتحت السورة بما يدل على منتهى كمال الله تعالى افتتاحاً يؤذن بأن ما حَوتْه يحوم حول تنزيه الله تعالى عن النقص الذي افتراه المشركون لمّا نسبوا إليه شركاء في الربوبية والتصرف معه والتعطيل لبعض مراده . ففي هذا الافتتاح براعة الاستهلال كما تقدم في طالع سورة الفرقان .وفعل { تَبَاركَ } يدل على المبالغة في وفرة الخير ، وهو في مقام الثناء يقتضي العموم بالقرينة ، أي يفيد أن كل وفرة من الكمال ثابتة لله تعالى بحيث لا يتخلف نوع منها عن أن يكون صفة له تعالى .وصيغة تفاعَل إذا أسندت إلى واحد تدل على تكلف فعل ما اشتقت منه نحو تَطاول وتغابن ، وترد كناية عن قوة الفعل وشدته مثل : تواصل الحبل .وهو مشتق من البَركة ، وهي زيادة الخير ووفرته ، وتقدمت البركة عند قوله تعالى : { وبركات عليك في } [ سورة هود : 48 ] .وتقدم { تَبَارَكَ } عند قوله تعالى : { تبارك الله رب العالمين في أول } [ الأعراف : 54 ] .وهذا الكلام يجوز أن يكون مراداً به مجرد الإخبار عن عظمة الله تعالى وكماله ويجوز أن يكون مع ذلك إنشاء ثناء على الله أثناه على نفسه ، وتعليماً للناس كيف يثنون على الله ويحمدونه كما في { الحمد لله ربَ العالمين } [ الفاتحة : 2 ] : إمّا على وجه الكناية بالجملة عن إنشاء الثناء ، وإمّا باستعمال الصيغة المشتركة بين الإخبار والإنشاء في معنييها ، ولو صيغ بغير هذا الأسلوب لما احتمل هاذين المعنيين ، وقد تقدم في قوله تعالى : { تبارك الذي نزل الفرقان على عبده } [ الفرقان : 1 ] .وجُعل المسندُ إليه اسمَ موصول للإِيذان بأن معنى الصلة ، مما اشتهر به كما هو غالب أحوال الموصول فصارت الصلة مغنية عن الاسم العلم لاستوائهما في الاختصاص به إذ يعلم كل أحد أن الاختصاص بالملك الكامل المطلق ليس إلاّ لله .وذكر { الذي بيده الملك } هنا نظير ذكر مثله عقب نظيره في قوله تعالى : { تبارك الذي نزل الفرقان على عبده إلى قوله : { الذي له ملك السماوات والأرض } [ الفرقان : 1 2 ] .والباء في { بِيَدِهِ } يجوز أن تكون بمعنى ( في ) مثل الباء التي تدخل على أسماء الأمكنة نحو { ولقد نصركم الله ببدر } [ آل عمران : 123 ] وقول امرء القيس :بسقط اللوى ... فالظرفية هنا مجازية مستعملة في معنى إحاطة قدرته بحقيقة المُلك ، والمُلك على هذا اسم للحالة التي يكون صاحبها مَلِكاً .والتعريف في { المُلك } على هذا الوجه تعريف الجنس الذي يشمل جميع أفراد الجنس ، وهو الاستغراق فما يوجد من أفراده فرد إلاّ وهو مما في قدرة الله فهو يعطيه وهو يمنعه .واليَد على هذا الوجه استعارة للقدرة والتصرف كما في قوله تعالى : { والسماء بنيناها بأيد } [ الذاريات : 47 ] وقول العرب : مَا لي بهذا الأمر يَدَان .ويجوز أن تكون الباء للسببية ، ويكون { المُلكُ } اسماً فيأتي في معناه ما قرر في الوجه المتقدم .وتقديم المسند وهو { بِيَدِهِ } على المسند إليه لإفادة الاختصاص ، أي الملك بيده لا بيد غيره .وهو قصر ادعائي مبني على عدم الاعتداد بمُلك غيره ، ولا بما يتراءى من إعطاء الخلفاء والملوك الأصقاع للأمراء والسلاطين وولاة العهد لأن كل ذلك مُلك غير تام لأنه لا يعمّ المملوكات كلها ، ولأنه معرض للزوال ، ومُلك الله هو الملك الحقيقي ، قال : { فتعالى الله الملك الحق } [ طه : 114 ] .فالناس يتوهمون أمثال ذلك مُلكاً وليس كما يتوهمون .واليد : تمثيل بأن شبهت الهيئة المعقولة المركبة من التصرف المطلق في الممكنات الموجودة والمعدومة بالإمداد والتغيير والإعدام والإيجاد؛ بهيئة إمساك اليد بالشيء المملوك تشبيه معقول بمحسوس في المركبات .وفي معنى هذه الآية قوله تعالى : { قل اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء في } [ سورة آل عمران : 26 ] .و { المُلك } بضم الميم : اسم لأكمل أحوال المِلك بكسر الميم ، والمِلك بالكسر جنس للمُلك بالضم ، وفسر المُلك المضموم بضبط الشيء المتصرَّف فيه بالحُكم ، وهو تفسير قاصر ، وأرى أن يُفسر بأنه تصرف في طائفة من الناس ووطنهم تصرفاً كاملاً بتدبير ورعاية ، فكل مُلك ( بالضم ) مِلك ( بالكسر ) وليس كل مِلك مُلكاً .وقد تقدم في قوله : { مَلِك يوم الدين في } [ الفاتحة : 4 ] وعند قوله : { أنّى يكون له الملك علينا في } [ سورة البقرة : 247 ] ، وجملة : { وهو على كل شيء قدير } معطوفة على جملة : { بِيده المُلك } التي هي صلة الموصول وهي تعميم بعد تخصيص لتكميل المقصود من الصلة ، إذ أفادت الصلة عموم تصرفه في الموجودات ، وأفادت هذه عموم تصرفه في الموجودات والمعدومات بالإعدام للموجودات والإيجاد للمعدومات ، فيكون قوله : { وهو على كل شيء قدير } مفيداً معنى آخر غير ما أفاده قوله : { بيده الملك } تفادياً من أن يكون معناه تأكيداً لمعنى { بيده الملك } وتكون هذه الجملة تتميماً للصلة . وفي معنى صلة ثانية ثمّ عطفت ولم يكرر فيها اسم موصول بخلاف قوله : { الذي خلق الموت } [ الملك : 2 ] وقوله : { الذي خلق سبع سموات } [ الملك : 3 ] .و { شيء } ما يصح أن يعلم ويخبر عنه ، وهذا هو الإطلاق الأصلي في اللغة . وقد يطلق ( الشيء ) على خصوص الموجود بحسب دلالة القرائن والمقامات . وأما التزام الأشاعرة : أن الشيء لا يطلق إلاّ على الموجود فهو التزام ما لا يلزم دعا إليه سد باب الحجاج مع المعتزلة في أن الوجود عين الموجود أو زائد على الموجود ، فتفرعت عليه مسألة : أن المعدوم شيء عند جمهور المعتزلة وأن الشيء لا يطلق إلاّ على الموجود عند الأشعري وبعض المعتزلة وهي مسألة لا طائل تحتها ، والخلاف فيها لفظي ، والحق أنها مبنية على الاصطلاح في مسائل علم الكلام لا على تحقيق المعنى في اللغة .وتقديم المجرور في قوله : { على كل شيء قدير } للاهتمام بما فيه من التعميم ، ولإبطال دعوى المشركين نسبتهم الإلهية لأصنامهم مع اعترافهم بأنها لا تقدر على خلق السموات والأرض ولا على الإحياء والإماتة .\n","ar.waseet":"لفظ ( تَبَارَكَ ) فعل ماض لا ينصرف . وهو مأخوذ من البركة ، بمعنى الكثرة من كل خير . وأصلها النماء والزيادة أى : كثر خيره وإحسانه ، وتزايدت بركاته .أو مأخوذ من البركة بمعنى الثبوت . يقال : برك البعير ، إذا أناخ فى موضعه فلزمه وثبت فيه . وكل شئ ثبت ودام فقد برك . أى : ثبت ودام خيره على خلقه .والملك - بضم الميم وسكون اللام - : السلطان والقدرة ونفاذ الأمر .أى : جل شأن الله - تعالى - وكثر خيره وإحسانه ، وثبت فضله على جميع خلقه ، فهو - سبحانه - الذى بيده وقدرته التمكن والتصرف فى كل شئ على حسب ما يريد ويرضى ، وهو - عز وجل - الذى لا يعجزه أمر فى الأرض أو فى السماء .واختار - سبحانه - الفعل \" تبارك \" للدلالة على المبالغة فى وفرة العظمة والعطاء ، فإن هذه الصيغة ترد للكناية عن قوة الفعل وشدته . . كما فى قولهم : تواصل الخير ، إذا تتابع بكثرة مع دوامه . .والتعريف فى لفظ \" الملك \" للجنس . وتقديم المسند وهو \" بيده \" على المسند إليه ، لإِفادة الاختصاص . أى : بيده وحده لا بيد أحد سواه جميع أنواع السلطان والقدرة ، والأمر والنهى . .قال الإِمام الرازى : وهذه الكلمة تستعمل لتأكيد كونه - تعالى - ملكا ومالكا ، تقول بيد فلان الأمر والنهى ، والحل والعقد . وذكر اليد إنما هو تصوير للإحاطة ولتمام قدرته ، لأنها محلها مع التنزه عن الجارحة . .وجملة ( وَهُوَ على كُلِّ شَيْءٍ قَدِيرٌ ) معطوفة على قوله ( بِيَدِهِ الملك ) الذى هو صلة الموصول ، وذلك لإِفادة التعميم بعد التخصيص ، لأن الجملة الأولى وهى ( الذي بِيَدِهِ الملك ) أفادت عموم تصرفه فى سائر الموجودات ، وهذه أفادت عموم تصرفه - سبحانه - فى سائر الموجودات والمعدومات ، إذ بيده - سبحانه - إعدام الموجود ، وإيجاد المعدوم .\n","ar.baghawi":"مكية\"تبارك الذي بيده الملك وهو على كل شيء قدير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5242.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5242.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5242.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"الَّذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۚ وَهُوَ الْعَزِيزُ الْغَفُورُ","transliteration":"Allazee khalaqal mawta walhayaata liyabluwakum ayyukum ahsanu 'amalaa; wa huwal 'azeezul ghafoor","translations":{"en.ahmedali":"Who created death and life in order to try you to see who of you are best of deed. He is all-mighty and forgiving,","en.ahmedraza":"The One Who created death and life to test you – who among you has the better deeds; and He only is the Most Honourable, the Oft Forgiving.","en.arberry":"who created death and life, that He might try you which of you is fairest in works; and He is the All-mighty, the All-forgiving --","en.asad":"He who has created death as well as life, so that He might put you to a test [and thus show] which of you is best in conduct, and [make you realize that] He alone is almighty, truly forgiving.","en.daryabadi":"Who hath created death and life that He might prove you, as to which of you is excellent in work. And He is the Mighty, the Forgiver.","en.hilali":"Who has created death and life, that He may test you which of you is best in deed. And He is the All-Mighty, the Oft-Forgiving;","en.pickthall":"Who hath created life and death that He may try you which of you is best in conduct; and He is the Mighty, the Forgiving,","en.qaribullah":"who created death and life that He might examine which of you is best in deeds, and He is the Almighty, the Forgiving,","en.sahih":"[He] who created death and life to test you [as to] which of you is best in deed - and He is the Exalted in Might, the Forgiving -","en.sarwar":"It is He who has created death and life to put you to the test and see which of you is most virtuous in your deeds. He is Majestic and All-forgiving.","en.yusufali":"He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-","en.maududi":"Who created death and life that He might try you as to which of you is better in deed. He is the Most Mighty, the Most Forgiving;","en.shakir":"Who created death and life that He may try you-- which of you is best in deeds; and He is the Mighty, the Forgiving,","en.itani":"He who created death and life—to test you—as to which of you is better in conduct. He is the Almighty, the Forgiving.","en.mubarakpuri":"Who has created death and life that He may test you which of you is best in deed. And He is the Almighty, the Oft-Forgiving;","en.qarai":"He, who created death and life that He may test you [to see] which of you is best in conduct. And He is the All-mighty, the All-forgiving.","en.wahiduddin":"He created death and life so that He might test you, and find out which of you is best in conduct. He is the Mighty, the Most Forgiving One."},"tafsir":{"ar.muyassar":"الذي خلق الموت والحياة؛ ليختبركم - أيها الناس-: أيكم خيرٌ عملا وأخلصه؟ وهو العزيز الذي لا يعجزه شيء، الغفور لمن تاب من عباده. وفي الآية ترغيب في فعل الطاعات، وزجر عن اقتراف المعاصي.","ar.jalalayn":"«الذي خلق الموت» في الدنيا «والحياة» في الآخرة أو هما في الدنيا فالنطفة تعرض لها الحياة وهي ما به الإحساس، والموت ضدها أو عدمها قولان، والخلق على الثاني بمعنى لتقدير «ليبلوكم» ليختبركم في الحياة «أيكم أحسن عملا» أطوع لله «وهو العزيز» في انتقامه ممن عصاه «الغفور» لمن تاب إليه.","ar.qurtubi":"قوله تعالى : الذي خلق الموت والحياة ليبلوكم أيكم أحسن عملا وهو العزيز الغفورفيه مسألتان :الأولى : قوله تعالى : الذي خلق الموت والحياة فيه مسألتان : قيل : المعنى خلقكم للموت والحياة ; يعني للموت في الدنيا والحياة في الآخرة وقدم الموت على الحياة ; لأن الموت إلى القهر أقرب ; كما قدم البنات على البنين فقال : يهب لمن يشاء إناثا . وقيل : قدمه لأنه أقدم ; لأن الأشياء في الابتداء كانت في حكم الموت كالنطفة والتراب ونحوه . وقال قتادة : كان رسول الله صلى الله عليه وسلم يقول : \" إن الله تعالى أذل بني آدم بالموت ، وجعل الدنيا دار حياة ثم دار موت ، وجعل الآخرة دار جزاء ثم دار بقاء \" . وعن أبي الدرداء أن النبي صلى الله عليه وسلم قال : \" لولا ثلاث ما [ ص: 191 ] طأطأ ابن آدم رأسه : الفقر والمرض والموت ، وإنه مع ذلك لوثاب \" .المسألة الثانية : الموت والحياة قدم الموت على الحياة ، لأن أقوى الناس داعيا إلى العمل من نصب موته بين عينيه ; فقدم لأنه فيما يرجع إلى الغرض المسوق له الآية أهم ، قال العلماء : الموت ليس بعدم محض ولا فناء صرف ، وإنما هو انقطاع تعلق الروح بالبدن ومفارقته ، وحيلولة بينهما ، وتبدل حال وانتقال من دار إلى دار . والحياة عكس ذلك . وحكي عن ابن عباس والكلبي ومقاتل أن الموت والحياة جسمان ، فجعل الموت في هيئة كبش لا يمر بشيء ولا يجد ريحه إلا مات ، وخلق الحياة على صورة فرس أنثى بلقاء - وهي التي كان جبريل والأنبياء عليهم السلام يركبونها - خطوتها مد البصر ، فوق الحمار ودون البغل ، لا تمر بشيء يجد ريحها إلا حيي ، ولا تطأ على شيء إلا حيي . وهي التي أخذ السامري من أثرها فألقاه على العجل فحيي . حكاه الثعلبي والقشيري عن ابن عباس . والماوردي : معناه عن مقاتل والكلبي .قلت : وفي التنزيل : قل يتوفاكم ملك الموت الذي وكل بكم ، ولو ترى إذ يتوفى الذين كفروا الملائكة ثم توفته رسلنا ، ثم قال : الله يتوفى الأنفس حين موتها . فالوسائط ملائكة مكرمون صلوات الله عليهم . وهو سبحانه المميت على الحقيقة ، وإنما يمثل الموت بالكبش في الآخرة ويذبح على الصراط ; حسب ما ورد به الخبر الصحيح . وما ذكر عن ابن عباس يحتاج إلى خبر صحيح يقطع العذر . والله أعلم . وعن مقاتل أيضا : خلق الموت ; يعني النطفة والعلقة والمضغة ، وخلق الحياة ; يعني خلق إنسانا ونفخ فيه الروح فصار إنسانا .قلت : وهذا قول حسن ; يدل عليه قوله تعالى : ليبلوكم أيكم أحسن عملا وتقدم الكلام فيه في سورة \" الكهف \" . وقال السدي في قوله تعالى : الذي خلق الموت والحياة ليبلوكم أيكم أحسن عملا [ ص: 192 ] أي أكثركم للموت ذكرا وأحسن استعدادا ، ومنه أشد خوفا وحذرا . وقال ابن عمر : تلا النبي صلى الله عليه وسلم : تبارك الذي بيده الملك حتى بلغ : أيكم أحسن عملا فقال : أورع عن محارم الله وأسرع في طاعة الله . وقيل : معنى ليبلوكم ليعاملكم معاملة المختبر ; أي ليبلو العبد بموت من يعز عليه ليبين صبره ، وبالحياة ليبين شكره . وقيل : خلق الله الموت للبعث والجزاء ، وخلق الحياة للابتلاء . فاللام في ليبلوكم تتعلق بخلق الحياة لا بخلق الموت ; ذكره الزجاج . وقال الفراء والزجاج أيضا : لم تقع البلوى على \" أي \" لأن فيما بين البلوى و \" أي \" إضمار فعل ; كما تقول : بلوتكم لأنظر أيكم أطوع . ومثله قوله تعالى : سلهم أيهم بذلك زعيم أي سلهم ثم انظر أيهم . ف \" أيكم \" رفع بالابتداء و \" أحسن \" خبره . والمعنى : ليبلوكم فيعلم أو فينظر أيكم أحسن عملا .وهو العزيز في انتقامه ممن عصاه .الغفور لمن تاب .\n","ar.miqbas":"الَّذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا وَهُوَ الْعَزِيزُ الْغَفُورُ (2)صفة ل { الذي بيده الملك } [ الملك : 1 ] فلما شمل قوله : { وهو على كل شيء قدير } [ الملك : 1 ] تعلق القدرة بالموجود والمعدوم أتبع بوصفه تعالى بالتصرف الذي منه خلق المخلوقات وأعراضِها لأن الخلق أعظم تعلق القدرةِ بالمقدور لدلالته على صفة القدرة وعلى صفة العلم .وأوثر بالذكر من المخلوقات الموتُ والحياة لأنهما أعظم العوارض لجنس الحيوان الذي هو أعجب الموجود على الأرض والذي الإنسان نوع منه ، وهو المقصود بالمخاطبة بالشرائع والمواعظ ، فالإماتة تصرف في الموجود بإعداده للفناء ، والإحياء تصرف في المعدوم بإيجاده ثم إعطائه الحياة ليستكمل وجود نوعه .فليس ذكر خلق الموت والحياة تفصيلاً لمعنى المُلك بل هو وصف مستقل .والاقتصار على خلق الموت والحياة لأنهما حالتان هما مظهرا تعلق القدرة بالمقدور في الذاتتِ والعرض لأن الموت والحياة عرضان والإنسان معروض لهما .والعَرَض لا يقوم بنفسه فلما ذُكر خلق العَرَض علم من ذكره خَلْق معروضه بدلالة الاقتضاء .وأوثر ذكر الموت والحياة لِما يدلان عليه من العبرة بتداول العرضين المتضاديْن على معروض واحد ، وللدلالة على كمال صنع الصانع ، فالموت والحياة عرضان يعرضان للموجود من الحيوان ، والموتُ يُعِد الموجود للفناء والحياة تُعِد الموجود للعمل للبقاء مدة . وهما عند المتكلمين من الأعراض المختصة بالحي ، وعند الحكماء من مقولة الكيف ومن قسم الكيفيات النفسانية منه .فالحياة : قوة تَتْبَع اعتدالَ المزاج النوعي لتَفيضَ منها سائر القوى .و { الموت } : كيفية عدمية هو عدم الحياة عما شأنه أن يوصف بالحياة أو الموت ، أي زوال الحياة عن الحي ، فبين الحياة والموت تقابُلُ العَدَم والمَلَكة .ومعنى خلق الحياة : خلق الحي لأن قوام الحي هو الحياة ، ففي خَلقه خلقُ ما به قوامه ، وأما معنى { خلق الموت } فإيجاد أسبابه وإلاّ فإن الموت عدم لا يتعلق به الخلق بالمعنى الحقيقي ، ولكنه لما كان عرضاً للمخلوق عبّر عن حصوله بالخَلق تبعاً كما في قوله تعالى : { والله خلقكم وما تَعْمَلون } [ الصافات : 96 ] .وأيضاً لأن الموت تصرف في الموجود القادر الذي من شأنه أن يدفع عن نفسه ما يكرهه . والموت مكروه لكل حي فكانت الإماتة مظهراً عظيماً من مظاهر القدرة لأن فيها تجلي وصْف القاهِر .فأما الإِحياء فهو من مظاهر وصف القادر ولكن مع وصفه المنعم .فمعنى القدرة في الإِماتة أظهر وأقوى لأن القهر ضرب من القدرة .ومعنى القدرة في الإِحياء خفي بسبب أمرين بدقة الصنع وذلك من آثار صفة العلم ، وبنعمة كمال الجنس وذلك من آثار صفة الإِنعام . وقد تقدم بيان ذلك عند قوله تعالى : { وكنتم أمواتاً فأحياكم } [ سورة البقرة : 28 ] .وفي ذكرهما تخلص إلى ما يترتب عليهما من الآثار التي أعظمها العملُ في الحياة والجزاءُ عليه بعد الموت ، وذلك ما تضمنه قوله : { ليبلوكم أيكم أحسن عملاً } فإن معنى الابتلاء مشعر بترتب أثر له وهو الجزاء على العمل للتذكير بحكمة جعل هذين الناموسين البديعين في الحيوان لتظهر حكمة خلق الإنسان ويُفضِيا به إلى الوجود الخالد ، كما أشار إليه قوله تعالى :{ أفحسبتم أنما خلقناكم عَبثاً وأنكم إلينا لا ترجعون } [ المؤمنون : 115 ] .وهذا التعليل من قبيل الإِدماج .وفيه استدلال على الوحدانية بدلالة في أنفسهم قال تعالى : { وفي أنفسكم أفلا تبصرون } [ الذاريات : 21 ] .والمعنى : أنه خلق الموت والحياة ليكون منكم أحياء يعملون الصالحات والسيئات ، ثم أمواتاً يَخلُصون إلى يوم الجزاء فيجزون على أعمالهم بما يناسبها .فالتعريف في { الموتَ } و { والحياة } تعريف الجنس . وفي الكلام تقديرُ : هو الذي خلق الموت والحياة لتحيَوا فيبلوكم أيكم أحسن عملاً ، وتموتوا فتُجزوا على حسب تلك البلوى ، ولكون هذا هو المقصود الأهم من هذا الكلام قدم الموت على الحياة .وجملة { ليبلوكم } إلى آخرها معترضة بين الموصولين .واللام في { ليبلوكم } لام التعليل ، أي في خلق الموت والحياة حكمة أن يبلوكم . الخ .وتعليل فعل بعلةٍ لا يقتضي انحصار علله في العلة المذكورة فإن الفعل الواحد تكون له علل متعددة فيذكر منها ما يستدعيه المقامَ ، فقوله تعالى : { ليبلوكم أيكم أحسن عملاً } تعليلٌ لفعل { خَلَقَ } باعتبار المعطوف على مفعوله ، وهو { والحياة } لأن حياة الإِنسان حياة خاصة تصحح للموصوف بمن قامت به الإدراك الخاص الذي يندفع به إلى العمل باختياره ، وذلك العمل هو الذي يوصف بالحسن والقبح ، وهو ما دل عليه بالمنطوق والمفهوم قوله تعالى : { أيكم أحسن عملاً } أي وأيكم أقبح عملاً .ولذلك فذكر خلق الموت إتمام للاستدلال على دقيق الصنع الإلهي وهو المسوق له الكلام ، وذكِر خلق الحياة إدماج للتذكير ، وهو من أغراض السورة .ولا أشك في أن بناء هذا العالم على ناموس الموت والحياة له حكمة عظيمة يعسر على الأفهام الاطلاع عليها .والبلوى : الاختبار وهي هنا مستعارة للعلم ، أي ليعلم علم ظَهورٍ أو مستعارةٌ لإظهار الأمر الخفي ، فجعل إظهار الشيء الخفي شبيهاً بالاختبار .وجملة { أيكم أحسن عملاً } مرتبطة ب { يبلوكم } .و ( أيُّ ) اسم استفهام ورفعه يعيّن أنه مبتدأ وأنه غير معمول للفظٍ قبله فوجب بيان موقع هذه الجملة ، وفيه وجهان :أحدهما قول الفراء والزجاج والزمخشري في تفسير أول سورة هود أن جملة الاستفهام سادة مَسدَّ المفعول الثاني ، وأن فعل { يبلوكم } المضمن معنى ( يَعْلَمكم ) معلق عن العمل في المفعول الثاني ، وليس وجود المفعول الأول مانعاً من تعليق الفعل عن العمل في المفعول الثاني وإن لم يكن كثيراً في الكلام .الوجه الثاني أن تكون الجملة واقعة في محل المفعول الثاني { ليبلوكم } أي تؤول الجملة بمعنى مفردٍ تقديره : ليعلمكم أهذا الفريق أحسنُ عملاً أم الفريقُ الآخر .وهذا مختار صاحب «الكشاف» في تفسير هذه الآية . ومبناه على أن تعليق أفعال العلم عن العمل لا يستقيم إلاّ إذا لم يذكر للفعل مفعول فإذا ذكر مفعول لم يصح تعليق الفعل عن المفعول الثاني ، وحاصله : أن التقدير ليَعلم الذين يقال في حقهم { أيهم أحسن عملاً } على نحو قوله تعالى :{ ثم لننزعن من كل شيعة أيهم أشدُّ على الرحمان عتياً } [ مريم : 69 ] أي : لنَنْزِعَنّ الذين يقال فيهم : أيهم أشد .وجوز صاحب «التقريب» أن يكون التقدير : ليعلم جواب سؤال سائلٍ : أيكُم أحسنُ عملاً .قلت : ولك أن تجعل جملة : { أيكم أحسن عملاً } مستأنفة وتجعلَ الوقف على قوله : { ليبلوكم } ويكون الاستفهام مستعملاً في التحْضيض على حُسن العمل كما هو في قول طرفة :إذا القوم قالوا مَن فتًى خلتُ أنني ... عُنيت فلم أكسل ولَم أتبلَّدفجعل الاستفهام تحضيضاً .و { أحسن } تفضيل ، أي أحسن عملاً من غيره ، فالأعمال الحسنة متفاوتة في الحسن إلى أدناها ، فأما الأعمال السيئة فإنها مفهومة بدلالة الفحوى لأن البلوى في أحسن الأعمال تقتضي البلوى في السيئات بالأوْلى لأن إحصاءها والإِحاطة بها أولى في الجزاء لما يترتب عليها من الاجتراء على الشارع ، ومن الفساد في النفس ، وفي نظام العالم ، وذلك أولى بالعقاب عليه ففي قوله : { ليبلوكم أيكم أحسن عملاً } إيجاز .وجملة : { وهو العزيز الغفور } تذييل لجملة : { ليبلوكم أيكم أحسن عملاً } إشارة إلى أن صفاته تعالى تقتضي تعلقاً بمتعلقاتها لئلا تكون معطلة في بعض الأحوال والأزمان فيفضي ذلك إلى نقائضها ، فأما { العزيز } فهو الغالب الذي لا يعجز عن شيء ، وذكره مناسب للجزاء المستفاد من قوله : { ليبلوكم أيكم أحسن عملاً } كما تقدم آنفاً ، أي ليجزيكم جزاء العزيز ، فعلم أن المراد الجزاء على المخالفات والنكول عن الطاعة . وهذا حظ المشركين الذين شملهم ضمير الخطاب في قوله { ليبلوكم } .وأما { الغفور } فهو الذي يكرم أولياءه ويصفح عن فلتاتهم فهو مناسب للجزاء على الطاعات وكناية عنه ، قال تعالى : { وإني لغفار لمن تاب وآمن وعمل صالحاً ثم اهتدى } [ طه : 82 ] فهو إشارة إلى حظ أهل الصلاح من المخاطبين .\n","ar.waseet":"ثم ساق - سبحانه - بعد ذلك ، ما يدل على شمول قدرته ، وسمو حكمته ، فقال ( الذي خَلَقَ الموت والحياة لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلاً . . ) .والموت : صفة وجودية تضاد الحياة : والمراد بخلقه : إيجاده . أو هو عدم الحياة عما هى من شأنه . والمراد بخلقه على هذا المعنى : تقديره أزلا .واللام فى قوله : ( لِيَبْلُوَكُمْ . . . ) متعلقة بقوله : ( خَلَقَ ) وقوله : ( لِيَبْلُوَكُمْ ) بمعنى يختبركم ويمتحنكم . . .وقوله ( أَيُّكُمْ ) مبتدأ ، و ( أَحْسَنُ ) خبره ، و ( عَمَلاً ) تمييز ، والجملة فى محل نصب مفعول ثان لقوله ( لِيَبْلُوَكُمْ ) .والمعنى : ومن مظاهر قدرته - سبحانه - التى لا يعجزها شئ ، أنه خلق الموت لمن يشاء إماتته ، وخلق الحياة لمن يشاء إحياءه ، ليعاملكم معاملة من يختبركم ويمتحنكم ، أيكم أحسن عملا فى الحياة ، لكى يجازيكم بما تستحقونه من ثواب . .أو المعنى : خلق الموت والحياة ، ليختبركم أيكم أكثر استعدادا للموت ، وأسرع إلى طاعة ربه - عز وجل - .قال القرطبى ما ملخصه : قوله : ( الذي خَلَقَ الموت والحياة ) . . قيل : الذى خلقكم للموت والحياة ، يعنى : للموت فى الدنيا والحياة فى الآخرة .وقدم الموت على الحياة ، لأن المخوت إلى القهر أقرب . . وقيل : لأنه أقدم ، لأن الأشياء فى الابتداء كانت فى حكم الموت . . وقيل : لأن أقوى الناس داعيا إلى العمل ، من نصب موته بين عينيه ، فقدم لأنه ف يما يرجع على الغرض الذى سبقت له الآية لهم .قال قتادة : كان رسول الله صلى الله عليه وسلم يقول : \" إن الله - تعالى - أذل ابن آدم بالموت ، وجعل الدنيا دار حياة ، ثم دار موت ، وجعل الآخرة دار جزاء ثم دار بقاء . . \" .وعن أبى الدرداء أن النبى صلى الله عليه وسلم قال : \" لولا ثلاث ما طأطأ ابن آدم رأسه : الفقر والمرض والموت ، وإنه مع ذلك لوَثَّاب . . \" .وقال العلماء : الموت ليس بعدم محض ، ولا فناء صرف ، وإنما هو انقطاع تعلق الروح بالبدن ومفارقته ، وحيلولة بينهما ، وتبدل حال ، وانتقال من دار إلى دار ، والحياة عكس ذلك . .وأوثر بالذكر من المخلوقات الموت والحياة ، لأنهما أعظم العوارض لجنس الحيوان ، الذى هو أعجب موجود على ظهر الأرض ، والذى الإِنسان نوع منه ، وهو المقصود بالمخاطبة ، إذ هو الذى رضى بحمل الأمانة التى عجزت عن حملها السموات والأرض . .والتعريف فى الموت والحياة للجنس . و \" أحسن \" أفعل تفضيل ، لأن الأعمال التى يقوم بها الناس فى هذه الحياة متفاوته فى الحسن من الأدنى إلى الأعلى .وجملة ( وَهُوَ العزيز الغفور ) تذييل قصد به أن جميع الأعمال تحت قدرته وتصرفه .أى : وهو - سبحانه - الغالب الذى لا يعجزه شئ الواسع المغفرة لمن شاء أن يغفر له ويرحمه من عباده ، كما قال - تعالى - : ( وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحَاً ثُمَّ اهتدى ).\n","ar.baghawi":"( الذي خلق الموت والحياة ) قال عطاء عن ابن عباس : يريد الموت في الدنيا والحياة في الآخرة .وقال قتادة : أراد موت الإنسان وحياته في الدنيا جعل الله الدنيا دار حياة وفناء ، وجعل الآخرة دار جزاء وبقاء .قيل إنما قدم الموت لأنه إلى القهر أقرب : وقيل : قدمه لأنه أقدم لأن الأشياء في الابتداء كانت في حكم الموت كالنطفة والتراب ونحوهما ثم اعترضت عليها الحياة .وقال ابن عباس : خلق الموت على صورة كبش أملح لا يمر بشيء ولا يجد ريحه شيء إلا مات وخلق الحياة على صورة فرس بلقاء [ أنثى ] وهي التي كان جبريل والأنبياء يركبونها لا تمر بشيء ولا يجد ريحها شيء إلا حيي ، وهي التي أخذ السامري قبضة من أثرها فألقى على العجل فحيي .( ليبلوكم ) فيما بين [ الحياة إلى الموت ] ( أيكم أحسن عملا ) روي عن ابن عمر مرفوعا : \" أحسن عملا \" أحسن عقلا وأورع عن محارم الله ، وأسرع في طاعة اللهوقال فضيل بن عياض \" أحسن عملا \" أخلصه وأصوبه . وقال : العمل لا يقبل حتى يكون خالصا صوابا ، الخالص : إذا كان لله ، والصواب : إذا كان على السنة .وقال الحسن : أيكم أزهد في الدنيا وأترك لها .وقال الفراء : لم يوقع البلوى على \" أي \" [ إلا ] وبينهما إضمار كما تقول بلوتكم لأنظر أيكم أطوع . ومثله : \" سلهم أيهم بذلك زعيم \" ( القلم - 40 ) أي : سلهم وانظر أيهم ف \" أي \" : رفع على الابتداء \" وأحسن \" خبره ( وهو العزيز ) في انتقامه ممن عصاه ( الغفور ) لمن تاب إليه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5243.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5243.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5243.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا ۖ مَا تَرَىٰ فِي خَلْقِ الرَّحْمَٰنِ مِنْ تَفَاوُتٍ ۖ فَارْجِعِ الْبَصَرَ هَلْ تَرَىٰ مِنْ فُطُورٍ","transliteration":"Allazee khalaqa sab'a samaawaatin tibaaqam maa taraa fee khalqir rahmaani min tafaawutin farji'il basara hal taraa min futoor","translations":{"en.ahmedali":"Who created the seven skies one above the other. Do you see any disproportion in the creations of Ar-Rahman? Turn your eyes again. Do you see any fissures?","en.ahmedraza":"The One Who created the seven heavens atop each other; do you see any discrepancy in the creation of the Most Gracious? Therefore lift your gaze – do you see any cracks?","en.arberry":"who created seven heavens one upon another. Thou seest not in the creation of the All-merciful any imperfection. Return thy gaze; seest thou any fissure?","en.asad":"[Hallowed be] He who has created seven heavens in full harmony with one another: no fault will thou see in the creation of the Most Gracious. And turn thy vision [upon it] once more: canst thou see any flaw?","en.daryabadi":"Who hath created seven heavens in storeys. Thou shalt not behold in the Compassionates creation any over-sight; then repeat thy look, beholdest thou any crack?","en.hilali":"Who has created the seven heavens one above another, you can see no fault in the creations of the Most Beneficent. Then look again: \"Can you see any rifts?\"","en.pickthall":"Who hath created seven heavens in harmony. Thou (Muhammad) canst see no fault in the Beneficent One's creation; then look again: Canst thou see any rifts?","en.qaribullah":"who created the seven heavens, one above the other. You cannot see any inconsistency in the creation of the Merciful. Return your gaze, do you see anycrack!","en.sahih":"[And] who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision [to the sky]; do you see any breaks?","en.sarwar":"It is He who has created seven heavens, one above the other. You can see no flaw in the creation of the Beneficent God. Look again. Can you see faults?","en.yusufali":"He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (Allah) Most Gracious. So turn thy vision again: seest thou any flaw?","en.maududi":"Who created the seven heavens one upon another. You will see no incongruity in the Merciful One's creation. Turn your vision again, can you see any flaw?","en.shakir":"Who created the seven heavens one above another; you see no incongruity in the creation of the Beneficent Allah; then look again, can you see any disorder?","en.itani":"He who created seven heavens in layers. You see no discrepancy in the creation of the Compassionate. Look again. Can you see any cracks?","en.mubarakpuri":"Who has created the seven heavens one above the other; you can see no fault in the creation of the Most Gracious. Then look again. Can you see any rifts","en.qarai":"He created seven heavens in layers. You do not see any discordance in the creation of the All-beneficent. Look again! Do you see any flaw?","en.wahiduddin":"He created seven heavens one above the other in layers. You will not find any flaw in the creation of the Gracious One. Then look once again: can you see any flaw?"},"tafsir":{"ar.muyassar":"الذي خلق سبع سموات متناسقة، بعضها فوق بعض، ما ترى في خلق الرحمن- أيها الناظر- من اختلاف ولا تباين، فأعد النظر إلى السماء: هل ترى فيها مِن شقوق أو صدوع؟","ar.jalalayn":"«الذي خلق سبع سماوات طباقا» بعضها فوق بعض من غير مماسة «ما ترى في خلق الرحمن» لهن أو لغيرهن «من تفاوت» تباين وعدم تناسب «فارجع البصر» أعده إلى السماء «هل ترى» فيها «من فطور» صدوع وشقوق.","ar.qurtubi":"قوله تعالى : الذي خلق سبع سماوات طباقا ما ترى في خلق الرحمن من تفاوت فارجع البصر هل ترى من فطورقوله تعالى : الذي خلق سبع سماوات طباقا أي بعضها فوق بعض . والملتزق منها أطرافها ; كذا روي عن ابن عباس . و \" طباقا \" نعت ل \" سبع \" فهو وصف بالمصدر . وقيل : مصدر بمعنى المطابقة ; أي خلق سبع سموات وطبقها تطبيقا أو مطابقة . أو على طوبقت طباقا . وقال سيبويه : نصب طباقا لأنه مفعول ثان .قلت : فيكون خلق بمعنى جعل وصير . وطباق جمع طبق ; مثل جمل وجمال . وقيل : جمع طبقة . وقال أبان بن تغلب : سمعت بعض الأعراب يذم رجلا فقال : شره طباق ، وخيره غير باق . ويجوز في غير القرآن سبع سموات طباق ; بالخفض على النعت لسموات . ونظيره ( وسبع سنبلات خضر ) .ما ترى في خلق الرحمن من تفاوت قراءة حمزة والكسائي \" من تفوت \" بغير ألف مشددة . وهي قراءة ابن مسعود وأصحابه . الباقون ( من تفاوت ) بألف . وهما لغتان مثل التعاهد والتعهد ، والتحمل والتحامل ، والتظهر [ ص: 193 ] والتظاهر ، وتصاغر وتصغر ، وتضاعف وتضعف ، وتباعد وتبعد ; كله بمعنى . واختار أبو عبيد \" من تفوت \" واحتج بحديث عبد الرحمن بن أبي بكر : \" أمثلي يتفوت عليه في بناته ! \" النحاس : وهذا أمر مردود على أبي عبيد ، لأن يتفوت يفتات بهم . وتفاوت في الآية أشبه . كما يقال تباين يقال : تفاوت الأمر إذا تباين وتباعد ; أي فات بعضها بعضا . ألا ترى أن قبله قوله تعالى : الذي خلق سبع سموات طباقا . والمعنى : ما ترى في خلق الرحمن من اعوجاج ولا تناقض ولا تباين - بل هي مستقيمة مستوية دالة على خالقها - وإن اختلفت صوره وصفاته . وقيل : المراد بذلك السموات خاصة ; أي ما ترى في خلق السموات من عيب . وأصله من الفوت ، وهو أن يفوت شيء شيئا فيقع الخلل لقلة استوائها ; يدل عليه قول ابن عباس رضي الله عنه : من تفرق . وقال أبو عبيدة : يقال : تفوت الشيء أي فات .ثم أمر بأن ينظروا في خلقه ليعتبروا به فيتفكروا في قدرته : فقال :فارجع البصر هل ترى من فطور أي اردد طرفك إلى السماء . ويقال : قلب البصر في السماء . ويقال : اجهد بالنظر إلى السماء . والمعنى متقارب . وإنما قال : فارجع بالفاء وليس قبله فعل مذكور ; لأنه قال : ما ترى . والمعنى انظر ثم ارجع البصر هل ترى من فطور ; قاله قتادة . والفطور : الشقوق ، عن مجاهد والضحاك . وقال قتادة : من خلل . السدي : من خروق . ابن عباس : من وهن . وأصله من التفطر والانفطار وهو الانشقاق . قال الشاعر :بنى لكم بلا عمد سماء وزينها فما فيها فطوروقال آخر :شققت القلب ثم ذررت فيه     هواك فليم فالتأم الفطورتغلغل حيث لم يبلغ شراب     ولا سكر ولم يبلغ سرور\n","ar.miqbas":"الَّذِي خَلَقَ سَبْعَ سَمَوَاتٍ طِبَاقًا مَا تَرَى فِي خَلْقِ الرَّحْمَنِ مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرَى مِنْ فُطُورٍ (3) صفة ثانية للذي بيده الملك ، أعقب التذكيرُ بتصرف الله بخلق الإِنسان وأهم أعراضه بذكر خلق أعظم الموجودات غير الإِنسان وهي السماوات ، ومفيدةٌ وصفاً من عظيم صفات الأفعال الإلهية ، ولذلك أعيد فيها اسم الموصول لتكون الجُملُ الثلاث جارية على طريقة واحدة .والسماوات تكرر ذكرها في القرآن ، والظاهر أن المراد بها الكواكب التي هي مجموع النظام الشمسي ما عدا الأرض ، كما تقدم عند قوله تعالى : { فسواهن سبع سماوات } [ سورة البقرة : 29 ] فإنها هي المشاهدة بأعين المخاطبين ، فالاستدلال بها استدلال بالمحسوس .والطباق يجوز أن يكون مصدر طابق وُصفت به السماوات للمبالغة ، أي شديدة المطابقة ، أي مناسبة بعضها لبعض في النظام .ويجوز أن تكون { طِباقاً } جمع طَبَق ، والطبَق المساوي في حالةٍ ما ، ومنه قولهم في المثَل : «وافَقَ شَنٌّ طبَقَه» .والمعنى : أنها مرتفع بعضها فوق بعض في الفضاء السحيق ، أو المعنى : أنها متماثلة في بعض الصفات مثل التكوير والتحرّك المنتظم في أنفسها وفي تحرك كل واحدة منها بالنسبة إلى تحرك بقيتها بحيث لا تَرْتَطِمُ ولا يتداخل سيرها .وليس في قوله : { طباقاً } ما يقتضي أن بعضها مظروف لبعض لأن ذلك ليس من مفاد مادة الطباق ( فلا تَكُن طَبَاقاء ) .وجاءت جملة { ما ترى في خلق الرحمان من تفاوت } تقريراً لقوله : { خلق سبع سموات طباقاً } .فإن نفي التفاوت يحقق معنى التطابق ، أي التماثل . والمعنى : ما ترى في خلق الله السماوات تفاوتاً . وأصل الكلام : ما ترى فيهن ولا في خلق الرحمان من تفاوت فعبر بخلق الرحمان لتكون الجملة تذييلاً لمضمون جملة : { خلق سبع سماوات طباقاً } ، لأن انتفاء التفاوت عما خلقه الله متحقق في خلق السماوات وغيرها ، أي كانت السماوات طباقاً لأنها من خلق الرحمان ، وليس فيما خلق الرحمان من تفاوت ومن ذلك نظام السماوات .والتفاوت بوزن التفاعل : شدة الفَوت ، والفوت : البعد ، وليست صيغة التفاعل فيه لحصول فعل من جانبين ولكنها مفيدة للمبالغة .ويقال : تفوَّت الأمر أيضاً ، وقيل : إن تفوَّت ، بمعنى حصل فيه عيب .وقرأ الجمهور { من تفاوت } . وقرأه حمزة والكسائي وخلف { من تفوُّت } بتشديد الواو دون ألف بعد الفاء ، وهي مرسومة في المصحف بدون ألف كما هو كثير في رسم الفتحات المشبعة .وهو هنا مستعار للتخالف وانعدام التناسق لأن عدم المناسبة يشبه البعد بين الشيئين تشبيه معقول بمحسوس .والخطاب لغير معين ، أي لا تَرى أيها الرائي تفاوتاً .والمقصود منه التعريض بأهل الشرك إذ أضاعوا النظر والاستدلال بما يدل على وحدانية الله تعالى بما تشاهده أبصارهم من نظام الكواكب ، وذلك مُمكن لكل من يبصر ، قال تعالى : { أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيّناها وما لها من فروج } [ ق : 6 ] فكأنه قال : ما تَرون في خلق الرحمان من تفاوت ، فيجوز أن يكون { خلق الرحمان } بمعنى المفعول كما في قوله تعالى :{ هذا خَلْق الله فأروني ماذا خلق الذين من دونه } [ لقمان : 11 ] ، ويراد منه السماوات ، والمعنى : ما ترى في السماوات من تفاوت ، فيكون العدول عن الضمير لتتأتى الإضافة إلى اسمه { الرحمان } المشعر بأن تلك المخلوقات فيها رحمة بالناس كما سيأتي .ويجوز أن يكون { خلق } مصدراً فيشمل خلق السماوات وخلقَ غيرها فإن صنع الله رحمة للناس لو استقاموا كما صنع لهم وأوصاهم ، فتفيد هذه الجملة مفاد التذييل في أثناء الكلام على وجه الاعتراض ولا يكون إظهاراً في مقام الإِضمار .والتعبير بوصف { الرحمان } دون اسم الجلالة إيماء إلى أن هذا النظام مما اقتضته رحمته بالناس لتجري أمورهم على حالة تلائم نظام عيشهم ، لأنه لو كان فيما خلق الله تفاوت لكان ذلك التفاوت سبباً لاختلال النظام فيتعرض الناس بذلك لأهوال ومشاق ، قال تعالى : { وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر } [ الأنعام : 97 ] وقال : { هو الذي جعل الشمس ضياء والقمر نوراً وقدره منازل لتعلموا عدد السنين والحساب ما خلق الله ذلك إلاّ بالحق } [ يونس : 5 ] .وأيضاً في ذلك الوصف تورك على المشركين إذْ أنكروا اسمه تعالى : { الرحمان } { وإذا قيل لهم اسجدوا للرحمان قالوا وما الرحمان أنسجد لما تأمرنا وزادهم نفوراً } [ الفرقان : 60 ] . وفرع عليه قوله : { فارجع البصر } الخ . والتفريع للتسبب ، أي انتفاء رؤية التفاوت ، جعل سبباً للأمر بالنظر ليكون نفي التفاوت معلوماً عن يقين دون تقليد للمخبِر .ورَجْع البصر : تكريره والرجْع : العود إلى الموضع الذي يجاء منه\n","ar.waseet":"ثم بين - سبحانه - مظهرا آخر من مظاهرقدرته التى لا يعجزها شئ فقال : ( الذي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقاً . . . ) .والجملة الكريمة صفة للعزيز الغفور ، أو عطف بيان أو بدل ، أو خبر لمبتدأ محذوف .وطباقا صفة لسبع سموات . وهى مصدر طابق مطابقة وطباقا ، من قولك : طابق فلان النعل ، إذا جعله طبقة فوق أخرى ، وهو جمع طبَق ، كجبل وجبال ، أو جمع طبقة كرَحبة ورحاب . . أى : هو - سبحانه - لا غيره الذى أوجد وخلق على غير مثال سابق سبع سموات متطابقة ، أى : بعضها فوق بعض ، بطريقة متقنة محكمة . . لا يقدر على خلقها بتلك الطريقة إلا هو ، ولا يعلم كنه تكوينها وهيئاتها . . أحد سواه - عز وجل - .وقوله - سبحانه - ( مَّا ترى فِي خَلْقِ الرحمن مِن تَفَاوُتٍ ) مؤكد لما قبله ، والتفاوت مأخوذ من الفوت ، وأصله الفرجة بين الإِصبعين .تقول : تفاوت الشيئان تفاوتا ، إذا حدث تباعد بينهما ، والجملة صفة ثانية لسبع سماوات ، أو مستأنفة لتقرير وتأكيد ما قبلها . . والخطاب لكل من يصلح له .أى : هو - سبحانه - الذى خلق سبع سماوات بعضها فوق بعض ، مع تناسقها ، وإتقان تكوينها ، وإحكام صنعها . . بحيث لا ترى - أيها العاقل - فى خلق السموات السبع شيئا من الاختلاف ، أو الاضطراب ، أو عدم التناسب . . بل كلها محكمة ، جارية على مقتضى نهاية النظام والإبداع .وقال - سبحانه - : ( مَّا ترى فِي خَلْقِ الرحمن . . ) ولم يقل : ما ترى فى السموات السبع من تفاوت ، للإشعار بأن هذا الخلق البديع ، هو ما اقتضته رحمته - تعالى - بعباده ، لكى تجرى أمورهم على حالة تلائم نظام معيشتهم . . وللتنبيه - أيضا - على أن جميع مخلوقاته تسير على هذا النمط البديع فى صنعها وإيجادها ، كما قال - تعالى - : ( صُنْعَ الله الذي أَتْقَنَ كُلَّ شَيْءٍ ) وكما قال - سبحانه - : ( الذي أَحْسَنَ كُلَّ شَيْءٍ خَلَقَهُ . . . ) قال صاحب الكشاف : قوله : ( مَّا ترى فِي خَلْقِ الرحمن مِن تَفَاوُتٍ ) أى : من اختلاف واضطراب فى الخلقة ولا تناقض ، إنما هى مستوية ومستقيمة ، وحقيقة التفاوت : عدم التناسب ، كأن بعض الشئ يفوت بعضا ولا يلائمه ، ومنه قولهم : خلق متفاوت ، وفى نقيضه متناصف .فإن قلت : ما موقع هذه الجملة مما قبلها؟ قلت : هى صفة مشايعة لقوله ( طِبَاقاً ) وأصلها : ما ترى فيهن من تفاوت ، فوضع مكان الضمير قوله : ( خَلْقِ الرحمن ) تعظيما لخلقهن ، وتنبيها على سبب سلامتهن من التفاوت ، وهو أنه خلق الرحمن ، وأنه يباهر قدرته هو الذى يخلق مثل ذلك الخلق المتناسب . .ثم ساق - سبحانه - بأسلوب فيه ما فيه من التحدى ، ما يدل على أن خلقه خال من التفاوت والخلل فقال : ( فارجع البصر هَلْ ترى مِن فُطُورٍ . ثُمَّ ارجِعِ البَصَرَ كَرَّتَيْنِ يَنْقَلِبْ إِلَيْكَ البَصَرُ خَاسِئاً وَهُوَ حَسِيرٌ )و ( الفطور ) جمع فَطْر ، وهو الشق والصدع ، يقال : فطر فلان الشئ فانفطر ، إذا شقه ، وبابه نصر .وقوله ( كَرَّتَيْنِ ) مثنى كرَّة ، وهى المرة من الكَرّ ، وهو الرجوع إلى الشئ مرة أخرى ، يقال كر المقاتل على عدوه ، إذا عاد إلى مهاجمته بعد أن تركه .والمراد بالكرتين هنا : معاودة النظر وتكريره كثيرا ، بدون اقتصار على المرتين ، فالتثنية هنا : كناية عن مطلق التكرير ، كما فى قولهم : لبيك وسعديك .وقوله : ( خَاسِئاً ) أى صاغراً خائبا لأنه لم يجد ما كان يطلبه ويتمناه .وقوله : ( حَسِيرٌ ) بمعنى كليل ومتعب ، من حسَر بصرُ فلان يَحسُر حسورا إذا كَلَّ وتعب من طول النظر والتأمل والفحص ، وفعله من باب قعد .والمعنى : ما ترى - أيها الناظر - فى خلق الرحمن من تفاوت أو خلل . . فإن كنت لا تصدق ما أخبرناك به ، أو فى أدنى شك من ذلك ، فكرر النظر فيما خلقنا حتى يتضح لك الأمر ، ولا يبقى عندك أدنى شك أو شبهه .والاستفهام فى قوله : ( هَلْ ترى مِن فُطُورٍ ) للتقرير : أى : إنك مهما نظرت فى خلق الرحمن . وشددت فى التفحص والتأمل . . فلن ترى فيه من شقوق أو خلل أو تفاوت . .\n","ar.baghawi":"( الذي خلق سبع سماوات طباقا ) طبقا على طبق بعضها فوق بعض ( ما ترى في خلق الرحمن من تفاوت ) قرأ حمزة والكسائي : \" من تفوت \" بتشديد الواو بلا ألف ، وقرأ الأخرون بتخفيف الواو وألف قبلها . وهما لغتان كالتحمل والتحامل والتطهر والتطاهر . ومعناه : ما ترى يا ابن آدم في خلق الرحمن من اعوجاج واختلاف وتناقض بل هي مستقيمة مستوية . وأصله من \" الفوت \" وهو أن يفوت بعضها بعضا لقلة استوائها ( فارجع البصر ) كرر النظر ، معناه : انظر ثم ارجع ( هل ترى من فطور ) شقوق وصدوع .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5244.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5244.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5244.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ إِلَيْكَ الْبَصَرُ خَاسِئًا وَهُوَ حَسِيرٌ","transliteration":"Summar ji'il basara karrataini yanqalib ilaikal basaru khaasi'anw wa huwa haseer","translations":{"en.ahmedali":"Turn your eyes again and again. Your gaze turns back dazed and tired.","en.ahmedraza":"Then lift your gaze again, your gaze will return towards you, unsuccessful and weak.","en.arberry":"Then return thy gaze again, and again, and thy gaze comes back to thee dazzled, aweary.","en.asad":"Yea, turn thy vision [upon it] again and yet again: [and every time] thy vision will fall back upon thee, dazzled and truly defeated….","en.daryabadi":"Then repeat thy look twice over, and thy look will return Unto thee dim and It will have become wearied out.","en.hilali":"Then look again and yet again, your sight will return to you in a state of humiliation and worn out.","en.pickthall":"Then look again and yet again, thy sight will return unto thee weakened and made dim.","en.qaribullah":"Then return your gaze once more and yet again, your gaze comes back to you dazzled, and tired.","en.sahih":"Then return [your] vision twice again. [Your] vision will return to you humbled while it is fatigued.","en.sarwar":"Look twice (and keep on looking), your eyes will only become dull and tired.","en.yusufali":"Again turn thy vision a second time: (thy) vision will come back to thee dull and discomfited, in a state worn out.","en.maududi":"Then turn your vision again, and then again; in the end your vision will come back to you, worn out and frustrated.","en.shakir":"Then turn back the eye again and again; your look shall come back to you confused while it is fatigued.","en.itani":"Then look again, and again, and your sight will return to you dazzled and exhausted.","en.mubarakpuri":"Then look again and yet again, your sight will return to you Khasi', and worn out.","en.qarai":"Look again, once more. Your look will return to you humbled and weary.","en.wahiduddin":"Then look again and again. Your gaze will come back to you confused and exhausted."},"tafsir":{"ar.muyassar":"ثم أعد النظر مرة بعد مرة، يرجع إليك البصر ذليلا صاغرًا عن أن يرى نقصًا، وهو متعب كليل.","ar.jalalayn":"«ثم ارجع البصر كرتين» كرة بعد كرة «ينقلب» يرجع «إليك البصر خاسئا» ذليلا لعدم إدراك خلل «وهو حسير» منقطع عن رؤية خلل.","ar.qurtubi":"قوله تعالى : ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسيرقوله تعالى : ثم ارجع البصر كرتين كرتين في موضع المصدر ; لأن معناه رجعتين ، أي مرة بعد أخرى . وإنما أمر بالنظر مرتين لأن الإنسان إذا نظر في الشيء مرة لا يرى [ ص: 194 ] عيبه ما لم ينظر إليه مرة أخرى . فأخبر تعالى أنه وإن نظر في السماء مرتين لا يرى فيها عيبا بل يتحير بالنظر إليها ; فذلك قوله تعالى : ينقلب إليك البصر خاسئا أي خاشعا صاغرا متباعدا عن أن يرى شيئا من ذلك . يقال : خسأت الكلب أي أبعدته وطردته . وخسأ الكلب بنفسه ، يتعدى ولا يتعدى . وانخسأ الكلب أيضا . وخسأ بصره خسأ وخسوءا أي سدر ، ومنه قوله تعالى :ينقلب إليك البصر خاسئا وقال ابن عباس : الخاسئ الذي لم ير ما يهوى .وهو حسير أي قد بلغ الغاية في الإعياء . فهو بمعنى فاعل ; من الحسور الذي هو الإعياء . ويجوز أن يكون مفعولا من حسره بعد الشيء ، وهو معنى قول ابن عباس . ومنه قول الشاعر :من مد طرفا إلى ما فوق غايته ارتد خسآن منه الطرف قد حسرايقال : قد حسر بصره يحسر حسورا ، أي كل وانقطع نظره من طول مدى وما أشبه ذلك ، فهو حسير ومحسور أيضا . قال :نظرت إليها بالمحصب من منى     فعاد إلي الطرف وهو حسيروقال آخر يصف ناقة هو قيس بن خويلد :إن العسير بها داء يخامرها     فشطرها نظر العينين محسورنصب \" شطرها \" على الظرف ، أي نحوها . وقال آخر :والخيل شعث ما تزال جيادها     حسرى تغادر بالطريق سخالهاوقيل : إنه النادم . ومنه قول الشاعر :ما أنا اليوم على شيء خلا     يا ابنة القين تولى بحسرالمراد ب \" كرتين \" هاهنا التكثير . والدليل على ذلك : ينقلب إليك البصر خاسئا وهو حسير وذلك دليل على كثرة النظر .\n","ar.miqbas":"ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنْقَلِبْ إِلَيْكَ الْبَصَرُ خَاسِئًا وَهُوَ حَسِيرٌ (4)، وفِعل : رَجع يكون قاصراً ومتعدياً إلى مفعول بمعنى : أرْجَعَ ، فأرجع هنا فعل أمر من رجع المتعدي .والرَّجع يقتضي سبق حلول بالموضع ، فالمعنى : أعِد النظر ، وهو النظر الذي دل عليه قوله : { ما تَرى في خلق الرحمان من تفاوت } أي أعد رؤية السماوات وأنها لا تفاوت فيها إعادة تحقيق وتبصر ، كما يقال : أعِدْ نَظَراً .والخطاب في قوله : { ما ترى في خلق الرحمان من تفاوت } وقوله : { فارجع البصر } الخ . خطاب لغير معين .وصيغة الأمر مستعملة في الإرشاد للمشركين مع دلالته على الوجوب للمسلمين فإن النظر في أدلة الصفات واجب لمن عرض له داع إلى الاستدلال . والبصر مستعمل في حقيقته . والمراد به البصر المصحوب بالتفكر والاعتبار بدلالة الموجودات على موجدها .وهذا يتصل بمسألة إيمان المقلد وما اختلف فيه من الرواية عن الشيخ أبي الحسن الأشعري .والاستفهام في { هل ترى من فطور } تقريري ووقع ب { هل } لأن { هل } تفيد تأكيد الاستفهام إذ هي بمعنى ( قد ) في الاستفهام ، وفي ذلك تأكيد وحث على التبصر والتأمل ، أي لا تقتنع بنظرة ونظرتين ، فتقول : لم أجد فُطوراً ، بل كَرّر النظر وعاوده باحثاً عن مصادفة فطور لعلك تجده .والفطور : جمع فَطْر بفتح الفاء وسكون الطاء ، وهو الشَق والصدع ، أي لا يسعك إلاّ أن تعترف بانتفاء الفطور في نظام السماوات فتراها ملتئمة محبوكة لا ترى في خلالها انشقاقاً ، ولذلك كان انفطار السماء وانشقاقها علامة على انقراض هذا العالم ونظامِه الشمسي ، قال تعالى :{ وفُتحت السماء فكانت أبواباً } [ النبأ : 19 ] وقال : { إذا السماء انشقت } [ الانشقاق : 1 ] { إذا السماء انفطرت } [ الانفطار : 1 ] .وعطْف { ثم ارجع البصر كرتين } دال على التراخي الرتبي كما هو شأن { ثم } في عطف الجمل ، فإن مضمون الجملة المعطوفة ب { ثم } هنا أهمّ وأدخل في الغرض من مضمون الجملة المعطوف عليها لأن إعادة النظر تزيد العلم بانتفاء التفاوت في الخَلق رسوخاً ويقيناً .و { كرتين } تثنية كرَّة وهي المرة وعبر عنها هنا بالكَرَّة مشتقة من الكر وهو العود لأنها عَود إلى شيء بعد الانفصال عنه ككَرة المقاتل يحمِل على العدوّ بعد أن يفر فراراً مصنوعاً . وإيثار لفظ كرتين في هذه الآية دون مرادفة نحو مرتين وتارتين لأن كلمة كرة لم يغلب إطلاقها على عدد الاثنين ، فكان إيثارها في مقام لا يراد فيه اثنين أظهر في أنها مستعملة في مطلق التكرير دون عدد اثنين أو زوج وهذا من خصائص الإعجاز ، ألا ترى أن مقام إرادة عدد الزوج كان مقتضياً تثنية مرة في قوله تعالى : { الطلاق مرتان } [ البقرة : 229 ] لأنه أظهر في إرادة العدد إذ لفظ مرة أكثر تداولاً .وتثنية { كرتين } ليس المراد بها عدد الاثنين الذي هو ضعف الواحد إذ لا يتعلق غرض بخصوص هذا العدد ، وإنما التثنية مستعملة كناية عن مطلق التكرير فإن من استعمالات صيغة التثنية في الكلام أن يراد بها التكرير وذلك كما في قولهم : «لَبَّيك وسَعديك» يريدون تلبيات كثيرة وإسعاداً كثيراً ، وقولهم : دَواليك ، ومنه المثل «دُهْدُرَّيْن ، سَعْدُ القَين» ( الدُّهْدُرُّ الباطل ، أي باطلاً على باطل ، أي أتيتَ يا سعدُ القَيْن دهدرين وهو تثنية دُهْدرّ الدال المهملة في أوله مضمومة فهاء ساكنة فدال مهملة مضمومة فراء مشددة ) وأصله كلمة فارسية نقلها العرب وجعلوها بمعنى الباطل . وسبب النقل مختلف فيه وتثنيته مكنّى بها عن مضاعفة الباطل ، وكانوا يقولون هذا المثل عند تكذيب الرجل صاحبَه وأما سعد القين فهو اسم رجل كان قيناً وكان يمرّ على الأحياء لصقل سيوفهم وإصلاححِ أسلحتهم فكان يُشيع أنه راحل غَداً ليُسرع أهل الحي بجلب ما يحتاج للإِصلاح فإذا أتوه بها أقام ولم يرحل فضُرب به المثل في الكذب فكان هذا المثل جامعاً لمثلين؛ وقد ذكره الزمخشري في «المستقصى» ، والميداني في «مجمع الأمثال» وأطال .وأصل استعمال التثنية في معنى التكرير أنهم اختصروا بالتثنية تعداد ذكر الاسم تعداداً مشيراً إلى التكثير .وقريب من هذا القبيل قولهم : وقَع كذَا غيرَ مرة ، أي مرات عديدة .فمعنى { ثم ارجع البصر كرتين } عاوِد التأمّلَ في خلق السماوات وغيرها غير مرة والانقلاب : الرجوع يقال : انقلب إلى أهله ، أي رجع إلى منزله قال تعالى : { وإذا انقلبوا إلى أهلهم انقلبوا فاكهين } [ المطففين : 31 ] وإيثار فعل : { ينقلب } هنا دون : يرجع ، لئلا يلتبس بفعل { ارجع } المذكور قبله . وهذا من خصائص الإِعجاز نظير إيثار كلمة { كرتين } كما ذكرناه آنفاً .والخاسىء : الخائب ، أي الذي لم يجد ما يطلبه ، وتقدم عند قوله تعالى : { قال اخسأوا فيها } [ سورة المؤمنين : 108 ] .والحَسير : الكليل . وهو كلل ناشىء عن قوة التأمل والتحديق مع التكرير ، أي يرجع البصر غير واجد ما أُغْري بالحرص على رؤيته بعد أن أدام التأمل والفحص حتى عيي وكلّ ، أي لا تجدْ بعد الَّلأْي فطوراً في خلق الله .\n","ar.waseet":"وقوله : ( ثُمَّ ارجِعِ البَصَرَ كَرَّتَيْنِ ) تعجيز إثر تعجيز ، وتحد فى أعقاب تحد . . أى : ثم لا تكتف بإعادة النظر مرة واحدة ، فربما يكون قد فاتك شئ فى النظرة الأولى والثانية . . بل أعد النظر مرات ومرات . . فتكون النتيجة التى لا مفر لك منها ، أن بصرك - بعد طول النظر والتأمل - ينقلب إليك خائبا وهو كليل متعب . . لأنه - بعد هذا النظر الكثير - لم يجد فى خلقنا شيئا من الخلل أو الوهن أو التفاوت .قال صاحب الكشاف ما ملخصه : قوله ( يَنْقَلِبْ إِلَيْكَ البَصَرُ ) أى : إن رجعت البصر ، وكررت النظر ، لم يرجع إليك بصرك بما التمسته من رؤية الخلل ، وإدراك العيب ، بل يرجع إليك بالخسوء والحسور . . أى : بالبعد عن إصابة الملتمس .فإن قلت : كيف ينقلب البصر خاسئا حسيرا برجعه كرتين اثنتين؟قلت : معنى التثنية هنا التكرير بكثرة كقولك لبيك وسعديك . .فإن قلت : فما معنى ( ثُمَّ ارجِعِ البَصَرَ ) ؟ قلت : أمره برجع البصر ، ثم أمره بأن لا يقتنع بالرجعة الأولى ، وبالنظرة الحمقاء وأن يتوقف بعدها ، ويُجِم بصره ثم يعاود ويعاود ، إلى أن يَحْسِر بصرُه من طول المعاودة ، فإنه لا يعثر على شئ من فطور . .هذا ، والمتأمل فى هذه الآيات الكريمة ، يراها قد ساقت ما يدل على وحدانية الله - تعالى - وقدرته بأبلغ أسلوب ، ودعت الغافلين الذين فسقوا عن أمر ربهم ، إلى التدبر فى هذا الكون الذى أوجده - سبحانه - فى أبدع صورة وأتقنها ، فإن هذا التدبر من شأنه أن يهدى إلى الحق ، ويرشد إلى الصواب . .\n","ar.baghawi":"( ثم ارجع البصر كرتين ) قال ابن عباس : مرة بعد مرة ( ينقلب ) ينصرف ويرجع ( إليك البصر خاسئا ) صاغرا ذليلا مبعدا لم ير ما يهوى ( وهو حسير ) كليل منقطع لم يدرك ما طلب . وروي عن كعب أنه قال : السماء الدنيا موج مكفوف والثانية مرمرة بيضاء والثالثة حديد والرابعة [ صفراء ] وقال : نحاس والخامسة فضة والسادسة ذهب والسابعة ياقوتة حمراء بين [ السماء ] السابعة إلى الحجب السبعة صحاري من نور .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5245.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5245.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5245.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَجَعَلْنَاهَا رُجُومًا لِلشَّيَاطِينِ ۖ وَأَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيرِ","transliteration":"Wa laqad zaiyannas samaaa'ad dunyaa bimasaa beeha wa ja'alnaahaa rujoomal lish shayaateeni wa a'tadnaa lahum 'azaabas sa'eer","translations":{"en.ahmedali":"We have adorned the lowest sky with lamps, and made them missiles against the devils, for whom We have prepared a torment of most intense fire.","en.ahmedraza":"And indeed We have beautified the lower heaven with lamps, and have made them weapons against the devils, and have kept prepared for them the punishment of the blazing fire.","en.arberry":"And We adorned the lower heaven with lamps, and made them things to stone Satans; and We have prepared for them the chastisement of the Blaze.","en.asad":"And, indeed, We have adorned the skies nearest to the earth with lights, and have made them the object of futile guesses for the evil ones [from among men]: and for them have We readied suffering through a blazing flame –","en.daryabadi":"And assuredly We have bedecked the nearest heaven with lamps, and We have made them missiles for satans: and for them We have gotten ready the torment of the Blaze.","en.hilali":"And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin (devils), and have prepared for them the torment of the blazing Fire.","en.pickthall":"And verily We have beautified the world's heaven with lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame.","en.qaribullah":"We have adorned the lower heaven with lamps, and We made them a stoning for the satans, We have prepared the punishment of the Blaze for them.","en.sahih":"And We have certainly beautified the nearest heaven with stars and have made [from] them what is thrown at the devils and have prepared for them the punishment of the Blaze.","en.sarwar":"We have decked the lowest heavens with torches. With these torches We have stoned the devils and We have prepared for them the torment of hell.","en.yusufali":"And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire.","en.maududi":"We have adorned the lower heaven with lamps, and have made them a means to drive away the satans. We have prepared for them the chastisement of the Blazing Fire.","en.shakir":"And certainly We have adorned this lower heaven with lamps and We have made these missiles for the Shaitans, and We have prepared for them the chastisement of burning.","en.itani":"We have adorned the lower heaven with lanterns, and made them missiles against the devils; and We have prepared for them the punishment of the Blaze.","en.mubarakpuri":"And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin, and have prepared for them the torment of the blazing Fire.","en.qarai":"We have certainly adorned the lowest heaven with lamps, and made them [the means of pelting] missiles against the devils, and We have prepared for them a punishment of the Blaze.","en.wahiduddin":"We have adorned the lowest heaven with lamps, and We have made them for driving away devils. For them We have prepared the punishment of the blazing Fire."},"tafsir":{"ar.muyassar":"ولقد زيَّنا السماء القريبة التي تراها العيون بنجوم عظيمة مضيئة، وجعلناها شهبًا محرقة لمسترقي السمع من الشياطين، وأعتدنا لهم في الآخرة عذاب النار الموقدة يقاسون حرها.","ar.jalalayn":"«ولقد زيَّنا السماء الدنيا» القربى إلى الأرض «بمصابيح» بنجوم «وجعلناها رجوما» مراجم «للشياطين» إذا استرقوا السمع بأن ينفصل شهاب عن الكوكب كالقبس يؤخذ من النار فيقتل الجني أو يخبله لا أن الكوكب يزول عن مكانه «وأعتدنا لهم عذاب السعير» النار الموقدة.","ar.qurtubi":"قوله تعالى : ولقد زينا السماء الدنيا بمصابيح وجعلناها رجوما للشياطين وأعتدنا لهم عذاب السعير وللذين كفروا بربهم عذاب جهنم وبئس المصير[ ص: 195 ] قوله تعالى : ولقد زينا السماء الدنيا بمصابيح جمع مصباح وهو السراج . وتسمى الكواكب مصابيح لإضاءتها .وجعلناها رجوما للشياطين أي جعلنا شهبها ; فحذف المضاف . دليله : إلا من خطف الخطفة فأتبعه شهاب ثاقب . وعلى هذا فالمصابيح لا تزول ولا يرجم بها . وقيل : إن الضمير راجع إلى المصابيح على أن الرجم من أنفس الكواكب ، ولا يسقط الكوكب نفسه إنما ينفصل منه شيء يرجم به من غير أن ينقص ضوءه ولا صورته . قاله أبو علي جوابا لمن قال : كيف تكون زينة وهي رجوم لا تبقى . قال المهدوي : وهذا على أن يكون الاستراق من موضع الكواكب . والتقدير الأول على أن يكون الاستراق من الهوى الذي هو دون موضع الكواكب . القشيري : وأمثل من قول أبي علي أن نقول : هي زينة قبل أن يرجم بها الشياطين . والرجوم جمع رجم ; وهو مصدر سمي به ما يرجم به . قال قتادة : خلق الله تعالى النجوم لثلاث : زينة للسماء ، ورجوما للشياطين ، وعلامات يهتدى بها في البر والبحر والأوقات . فمن تأول فيها غير ذلك فقد تكلف ما لا علم له به ، وتعدى وظلم . وقال محمد بن كعب : والله ما لأحد من أهل الأرض في السماء نجم ، ولكنهم يتخذون الكهانة سبيلا ، ويتخذون النجوم علة .وأعتدنا لهم عذاب السعير أي أعتدنا للشياطين أشد الحريق ; يقال : سعرت النار فهي مسعورة وسعير ; مثل مقتولة وقتيل .\n","ar.miqbas":"وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَجَعَلْنَاهَا رُجُومًا لِلشَّيَاطِينِ وَأَعْتَدْنَا لَهُمْ عَذَابَ السَّعِيرِ (5)انتقل من دلائل انتفاء الخلل عن خِلقة السماوات ، إلى بيان ما في إحدى السماوات من إتقان الصنع فهو مما شمله عموم الإِتقان في خلق السماوات السبع وذكره من ذِكر بعض أفراد العام كذكر المثال بعد القاعدة الكلية ، فدقائق السماء الدنيا أوضح دلالةً على إتقان الصنع لكونها نصب أعين المخاطبين ، ولأن من بعضها يحصل تخلص إلى التحذير من حيل الشياطين وسوء عواقب أتباعهم . وتأكيد الخبر ب ( قد ) لأنه إلى أنه نتيجة الاستفهام التقريري المؤكد ب ( هل ) أختتِ ( قد ) في الاستفهام .والكلام على السماء الدنيا ولماذا وصفت بالدنيا وعن الكواكب تقدم في أول سورة الصافات .وسميت النّجوم هنا مصابيح على التشبيه في حسن المنظر فهو تشبيه بليغ .وذكر التزيين إدماج للامتنان في أثناء الاستدلال ، أي زيَّنَاها لكم مثل الامتنان في قوله : { ولكم فيها جَمال } في سورة النحل ( 6 ) .والمقصد : التخلص إلى ذكر رجم الشياطين ليتخلص منه إلى وعيدهم ووعيد متبعيهم .وعدل عن تعريف ( مصابيح ) باللام إلى تنكيره لما يفيده التنكير من التعظيم .والرجوم : جمع رَجْم وهو اسْم لما يُرجم به ، أي ما يرمي به الرامي من حجر ونحوه تسميةً للمفعول بالمصدر مثل الخَلْق بمعنى المخلوق في قوله تعالى : { هذا خَلق الله } [ لقمان : 11 ] .والذي جُعل رُجوماً للشياطين هو بعض النجوم التي تبدو مضيئة ثم تلوح منقَضَّة ، وتسمى الشُهُب ومضى القول عليها في سورة الصافات .وضمير الغائبة في { جعلناها } المتبادر أنه عائد إلى المصابيح ، أي أن المصابيح رجوم للشياطين .ومعنى جعل المصابيح رجوماً جار على طريقة إسناد عمل بعض الشيء إلى جميعه مثل إسناد الأعمال إلى القبائل لأن العاملين من أفراد القبيلة كقوله تعالى : { ثم أنتم هؤلاء تقتلون أنفسكم } [ البقرة : 85 ] وقول العرب : قتلت هُذيل رضيع بني ليث تمَّام بن ربيعة بن الحارث بن عبد المطلب .وجعل بعض المفسرين الضمير المنصوب في { جعلناها } عائد إلى { السماء الدنيا } على تقدير : وجعلنا منها رجوماً إما على حذف حرف الجر . وإمّا على تنزيل المكان الذي صدر منه الرجوم منزلة نفس الرجوم فهو مجاز عقلي ومنه قوله تعالى : { فجعلناها نكالاً لما بين يديها وما خلفها } في سورة البقرة ( 66 ) ولكنها على جعل الضمير المنصوب راجعاً إلى القرية وإن لم تذكر في تلك الآية ولكنها ذكرت في آية سورة الأعراف ( 163 ) { واسألهم عن القرية التي كانت حاضرة البحر } وقصتها هي المشار إليها بقوله : { ولقد علمتم الذين اعتدوا منكم في السبت } [ البقرة : 65 ] فالتقدير : فجعلنا منها ، أي من القرية نكالاً ، وهم القوم الذين قيل لهم { كونوا قردة خاسئين } [ البقرة : 65 ] .والشياطين هي التي تسترق السمع فتطردها الشهب كما تقدم في سورة الصافات .وأصل { أعتدنا } أعدَدْنا أي هيّأنا ، قلبت الدال الأولى تاء لتقارب مخرجيهما ليتأتى الإِدغَام طلباً للخفة .و { السعير } : اسم صيغ على مثال فعيل بمعنى مفعول من : سَعَرَ النار ، إذا أوقدها وهو لهب النار ، أي أعددنا للشياطين عذاب طبقة أشد طبقات النار حرارة وتوقداً فإن جهنم طبَقَات .وكان السعير عذاباً لشياطين الجن مع كونهم من عنصر النار لأنّ نار جهنم أشد من نار طبعهم ، فإذا أصابتهم صارت لهم عذاباً .وتسمية عذابهم { السعير } دون النار ، أو جهنم مراد لهذا المعنى ومثله قوله تعالى في عذاب الجن { ومن يَزغ منهم عن أمرنا نُذقه من عذاب السعير } [ سبأ : 12 ] وقال { إنما يدعو حزبه ليكونوا من أصحاب السعير } [ فاطر : 6 ] يعني الشيطان .ومعنى الإِعداد يحتمل أنه إعداد تقدير وإيجاد فلا يقتضي أن تكون جهنم مخلوقة قبل يوم القيامة ويحتمل أنه إعداد استعمال ، فتكون جهنم مخلوقة حين نزول الآية وقد اختلف علماؤنا في أن النار موجودة أو توجد يوم الجزاء إذ لا دليل في الكتاب والسنة على أحد الاحتمالين وإنما دعاهم إلى فرض هذه المسألة تأويل بعض الآيات والأحاديث .\n","ar.waseet":"ثم ساق - سبحانه - بعد ذلك أدلة أخرى على وحدانيته وقدرته ، وبين ما أعده للكافرين من عذاب ، بسبب إصرارهم على كفرهم . . فقال - تعالى - :( وَلَقَدْ زَيَّنَّا السمآء الدنيا بِمَصَابِيحَ . . . )قال الإِمام الرازى : اعلم أن هذا هو الدليل الثانى على كونه - تعالى - قادرا عالما ، وذلك لأن هذه الكواكب نظرا إلى أنها محدثة ومختصة بمقدار معين ، وموضع خاص ، وسير معين ، تدل على أن صانعها قادر .ونظرا إلى كونها محكمة متقنة موافقة لمصالح العباد ، ومن كونهاه زينة لأهل الدنيا ، وسببا لانتفاعهم بها ، تدل على أن صانعها عالم .ونظير هذه الآية قوله - تعالى - فى سورة الصافات : ( إِنَّا زَيَّنَّا السمآء الدنيا بِزِينَةٍ الكواكب . وَحِفْظاً مِّن كُلِّ شَيْطَانٍ مَّارِدٍ ) وقوله : ( زَيَّنَّا ) من التزيين بمعنى التحسين والتجميل . و ( الدنيا ) صيغة تفضيل من الدنو بمعنى القرب .والمصابيح : جمع مصباح وهو السراج المضئ . والمراد بها النجوم . وسميت بالمصابيح على التشبيه بها فى حسن المنظر ، وفى الإضاءة ليلا . .والرجوم : جمع رَجْم ، وهو فى الأصل مصدر رَجَمه رَجْماً - من باب نصر - إذا رماه بالرِّجام أى : بالحجارة ، فهو اسم لما يُرْجَم به ، أى : ما يَرْمِى به الرامى غيره من حجر ونحوه ، تسمية للمفعول بالمصدر ، مثل الخَلْق بمعنى المخلوق .وصدرت الآية الكريمة بالقسم ، لإِبراز كال العناية بمضمونها .والمعنى : وبالله لقد زينا وجملنا السماء القريبة منكم بكواكب مضيئة كإضاءة السُّرُجِ ، وجعلنا - بقدرتنا - من هذه الكواكب ، ما يرجم الشياطين ويحرقها ، إذا ما حاولوا أن يسترقوا السمع ، كما قال - تعالى - ( وَأَنَّا لَمَسْنَا السمآء فَوَجَدْنَاهَا مُلِئَتْ حَرَساً شَدِيداً وَشُهُباً . وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ فَمَن يَسْتَمِعِ الآن يَجِدْ لَهُ شِهَاباً رَّصَداً ) قال الإِمام ابن كثير : قوله : ( وَجَعَلْنَاهَا رُجُوماً لِّلشَّيَاطِينِ ) عاد الضمير فى قوله ( وَجَعَلْنَاهَا ) على جنس المصابيح لاعلى عينها ، لأنه لا يرمى بالكواكب التى فى السماء ، بل بشهب من دونها ، وقد تكون مستمدة منها - والله أعلم - .قال قتادة : إنما خلقت هذه النجوم لثلاث خصال : خلقها زينة للسماء ، ورجوما للشياطين ، وعلامات يهتدى بها ، فمن تأول فيها غير ذلك فقد قال برأيه ، وأخطأ حظه ، وأضاع نصيبه ، وتكلف ما لا علم له به . .فالضمير فى قوله : ( وَجَعَلْنَاهَا ) يعود إلى المصابيح ، ومنه من أعاده إلى السماء الدنيا ، على تقدير : وجعلنا منها رجوما للشياطين الذين يسترقون السمع .وقوله - تعالى - : ( وَأَعْتَدْنَا لَهُمْ عَذَابَ السعير ) بيان لسوء مصيرهم فى الآخرة ، بعد بيان سوء مصيرهم فى الدنيا عن طريق إحراقهم بالشهب .أى : وهيأنا لهؤلاء الشياطين فى الآخرة - بعد إحراقهم فى الدنيا بالشهب - عذاب النار المشتعلة المستعرة .فالسعير - بزنة فعيل - اسم لأشد النار اشتعالا . يقال : سعر فلان النار - كمنع - إذا أوقدها بشدة .وكان السعير عذابا للشياطين - مع أنهم مخلوقان من النار ، لأن نار جهنم أشد من النار التى خلقوا منها ، فإذا ألقوا فيها صارت عذابا لهم ، إذ السعير أشد أنواع النار التهابا واشتعالا وإحراقا ..\n","ar.baghawi":"( ولقد زينا السماء الدنيا ) أراد الأدنى من الأرض وهي التي يراها الناس . ( بمصابيح ) [ أي : الكواكب واحدها : مصباح وهو السراج سمي الكوكب مصباحا ] لإضاءته ( وجعلناها رجوما ) مرامي ( للشياطين ) إذا استرقوا السمع ( وأعتدنا لهم ) في الآخرة ( عذاب السعير ) النار الموقدة\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5246.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5246.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5246.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ ۖ وَبِئْسَ الْمَصِيرُ","transliteration":"Wa lillazeena kafaroo bi rabbihim 'azaabu jahannama wa bi'sal maseer","translations":{"en.ahmedali":"For those who believe not in their Lord there is the punishment of Hell; and what a wretched destination","en.ahmedraza":"And for those who disbelieved in their Lord, is the punishment of hell; and what a wretched outcome!","en.arberry":"And for those who disbelieve in their Lord there awaits the chastisement of Gehenna -- an evil homecoming!","en.asad":"for, suffering in hell awaits all who are [thus] bent on blaspheming against their Sustainer: and how vile a journey's end!","en.daryabadi":"And for those who disbelieve in their Lord will be the torment of Hell; and a hapless destination!","en.hilali":"And for those who disbelieve in their Lord (Allah) is the torment of Hell, and worst indeed is that destination.","en.pickthall":"And for those who disbelieve in their Lord there is the doom of hell, a hapless journey's end!","en.qaribullah":"And for those who disbelieve in their Lord there awaits the punishment of Gehenna (Hell) an evil arrival!","en.sahih":"And for those who disbelieved in their Lord is the punishment of Hell, and wretched is the destination.","en.sarwar":"For those who have disbelieved in their Lord, We have prepared the torment of hell, the most terrible place to return.","en.yusufali":"For those who reject their Lord (and Cherisher) is the Penalty of Hell: and evil is (such), Destination.","en.maududi":"The chastisement of Hell awaits those who disbelieve in their Lord. What a wretched destination!","en.shakir":"And for those who disbelieve in their Lord is the punishment of hell, and evil is the resort.","en.itani":"For those who reject their Lord, there is the torment of Hell. What an evil destination!","en.mubarakpuri":"And for those who disbelieve in their Lord is the torment of Hell, and worst indeed is that destination.","en.qarai":"For those who defy their Lord is the punishment of hell, and it is an evil destination.","en.wahiduddin":"Those who are bent on blaspheming against their Lord will have the punishment of Hell: an evil destination."},"tafsir":{"ar.muyassar":"وللكافرين بخالقهم عذاب جهنم، وساء المرجع لهم جهنم.","ar.jalalayn":"«وللذين كفروا بربهم عذاب جهنم وبئس المصير» هي.","ar.qurtubi":"وللذين كفروا بربهم عذاب جهنم وبئس المصير\n","ar.miqbas":"وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ عَذَابُ جَهَنَّمَ وَبِئْسَ الْمَصِيرُ (6)هذا تتميم لئلا يتوهم أن العذاب أُعد للشياطين خاصة ، والمعنى : ولجميع الذين كفروا بالله عذاب جهنم فالمراد عامة المشركين ولأجل ما في الجملة من زيادة الفائدة غايرت الجملةَ التي قبلها فلذلك عطفت عليها .وتقديم المجرور للاهتمام بتعلقه بالمسند إليه والمبادرة به .وجملة { وبئس المصير } حال أو معترضة لإِنشاء الذم وحذف المخصوص بالذم لدلالة ما قبل { بئس } عليه . والتقدير : وبئس المصير عذابُ جهنم .والمعنى : بئست جهنم مصيراً للذين كفروا .\n","ar.waseet":"وقوله : ( وَلِلَّذِينَ كَفَرُواْ بِرَبِّهِمْ عَذَابُ جَهَنَّمَ وَبِئْسَ المصير ) معطوف على ما قبله .أى : هيأنا للشياطين عذاب السعير ، وهيأنا - أيضا - للذين كفروا بربهم من الإِنس عذاب جهنم ، وبئس المصير عذاب جهنم .\n","ar.baghawi":"\"وللذين كفروا بربهم عذاب جهنم وبئس المصير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5247.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5247.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5247.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"إِذَا أُلْقُوا فِيهَا سَمِعُوا لَهَا شَهِيقًا وَهِيَ تَفُورُ","transliteration":"Izaaa ulqoo feehaa sami'oo lahaa shaheeqanw wa hiya tafoor","translations":{"en.ahmedali":"When they are cast into it, they will hear it roar and raging","en.ahmedraza":"They will hear it hissing when they will be thrown into it, and it is boiling.","en.arberry":"When they are cast into it they will hear it sighing, the while it boils","en.asad":"When they are cast into that [hell], they will hear its breath indrawing as it boils up,","en.daryabadi":"When they will be cast thereinto, they will hear thereof a braying even as it balleth up,","en.hilali":"When they are cast therein, they will hear the (terrible) drawing in of its breath as it blazes forth.","en.pickthall":"When they are flung therein they hear its roaring as it boileth up,","en.qaribullah":"When they are cast into it they shall hear it sighing, while it boils","en.sahih":"When they are thrown into it, they hear from it a [dreadful] inhaling while it boils up.","en.sarwar":"When they are thrown into hell, they will hear its roaring while it boils.","en.yusufali":"When they are cast therein, they will hear the (terrible) drawing in of its breath even as it blazes forth,","en.maududi":"When they will be cast into it, they will hear it roar as it boils,","en.shakir":"When they shall be cast therein, they shall hear a loud moaning of it as it heaves,","en.itani":"When they are thrown into it, they will hear it roaring, as it seethes.","en.mubarakpuri":"When they are cast therein, they will hear its Shahiq while it is simmering.","en.qarai":"When they are thrown in it, they hear it blaring, as it seethes,","en.wahiduddin":"When they are cast into it, they will hear its roaring as it boils up,"},"tafsir":{"ar.muyassar":"إذا طُرح هؤلاء الكافرون في جهنم سمعوا لها صوتًا شديدًا منكرًا، وهي تغلي غليانًا شديدًا.","ar.jalalayn":"«إذا ألقوا فيها سمعوا لها شهيقا» صوتا منكرا كصوت الحمار «وهي تفور» تغلي.","ar.qurtubi":"قوله تعالى : إذا ألقوا فيها سمعوا لها شهيقا وهي تفورقوله تعالى : إذا ألقوا فيها يعني الكفار .سمعوا لها شهيقا أي صوتا . قال ابن عباس : الشهيق لجهنم عند إلقاء الكفار فيها ; تشهق إليهم شهقة البغلة للشعير ، ثم تزفر زفرة لا [ ص: 196 ] يبقى أحد إلا خاف . وقيل : الشهيق من الكفار عند إلقائهم في النار قاله عطاء . والشهيق في الصدر ، والزفير في الحلق . وقد مضى في سورة \" هود \" .وهي تفور أي تغلي ; ومنه قول حسان :تركتم قدركم لا شيء فيها وقدر القوم حامية تفورقال مجاهد : تفور بهم كما يفور الحب القليل في الماء الكثير . وقال ابن عباس : تغلي بهم على المرجل ; وهذا من شدة لهب النار من شدة الغضب ; كما تقول فلان يفور غيظا .\n","ar.miqbas":"إِذَا أُلْقُوا فِيهَا سَمِعُوا لَهَا شَهِيقًا وَهِيَ تَفُورُ (7){ المصير * إِذَآ أُلْقُواْ فِيهَا سَمِعُواْ لَهَا شَهِيقًا وَهِىَ } { تَفُورُ * تَكَادُ تَمَيَّزُ مِنَ الغَيْظِ كُلَّمَا أُلْقِىَ فِيهَا فَوْجٌ } .الجملة مستأنفة استئنافاً بيانياً لبيان ذمَ مصيرهم في جهنم ، أي من جملة مذام مصيرهم مذمة ما يسمعونه فيها من أصوات مؤلمة مخيفة .و { إذا } ظرف متعلق ب { سمعوا } يدل على الاقتران بين زمن الإِلقاء وزمن سماع الشهيق .والشهيق : تردد الأنفاس في الصدر لا تستطيع الصعود لبُكاء ونحوه أطلق على صوت التهاب نار جهنم الشهيق تفظيعاً له لأن قوله : { سمعوا لها } يقتضي أن الشهيق شهيقها لأن أصل اللام أن تكون لشبه الملك .وجملة { وهي تفور } حال من ضمير { فيها } وتفور : تغلي وترتفع ألسنَة لهيبها .و { الغيظ } أشد الغضب . وقوله : { تكاد تميز من الغيظ } خبر ثان عن ضمير { وهي } ، مثلت حالة فورانها وتصاعد ألسنة لهيبها ورطمها ما فيها والتهام من يُلقون إليها ، بحال مغتاظ شديد الغيظ لا يترك شيئاً مما غاظه إلاّ سلط عليه ما يستطيع من الإِضرار .واستعمل المركب الدال على الهيئة المشبه بها مع مرادفاته كقولهم : يكاد فلان يتميز غيظاً ويتقصف غَضَباً ، أي يكاد تتفرق أجزاؤه فيتميز بعضها عن بعض وهذا من التمثيلية المكنية وقد وضحناها في تفسير قوله تعالى : { أولئك على هدى من ربهم } في سورة البقرة ( 5 ) .ونظير هذه الاستعارة قوله تعالى : { فوجدا فيها جداراً يريد أن ينقضّ } في سورة الكهف ( 77 ) إذ مثل الجدار بشخص له إرادة .وتميَّز } أصله تتميز ، أي تنفصل ، أي تتجزأ أجزاءً تخييلاً لشدة الاضطراب بأن أجزاءها قاربت أن تتقطع ، وهذا كقولهم : غضب فلان فطارت منه شقة في الأرض وشقة في السماء .\n","ar.waseet":"ثم بين - سبحانه - أحوالهم الأليمة حينما يلقون جميعا فى النار فقال : ( إِذَآ أُلْقُواْ فِيهَا سَمِعُواْ لَهَا شَهِيقاً وَهِيَ تَفُورُ . . )والظرف \" إذا \" متعلق بقوله ( سَمِعُواْ ) والشهيق : تردد النفس فى الصدر بصعوبة وعناء . .أى : أن هؤلاء الكافرين بربهم ، عندما يلقون فى النار ، يسمعون لها صوتا فظيعا منكرا ، ( وَهِيَ تَفُورُ ) أى : وحالها أنها تغلى بهم غليان المرجل بما فيه ، إذا الفوز : شدة الغليان ، ويقال ذلك فى النار إذا هاجت ، وفى القدر إذا غلت . .\n","ar.baghawi":"( إذا ألقوا فيها سمعوا لها شهيقا ) وهو أول نهيق الحمار وذلك أقبح الأصوات ( وهي تفور ) تغلي بهم كغلي المرجل . وقال مجاهد : تفور بهم كما يفور الماء الكثير بالحب القليل .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5248.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5248.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5248.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ ۖ كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ نَذِيرٌ","transliteration":"Takaadu tamayyazu minal ghaizi kullamaaa uliqya feehaa fawjun sa alahum khazanatuhaaa alam yaatikum nazeer","translations":{"en.ahmedali":"As though it would burst with fury. Every time a crowd is thrown into it, its wardens will ask: \"Did no warner come to you?\"","en.ahmedraza":"As if about to explode with rage; whenever a group is thrown into it, the guardians of hell will ask them, “Did not a Herald of Warning come to you?”","en.arberry":"and wellnigh bursts asunder with rage. As often as a troop is cast into it, its keepers ask them, 'Came there no warner to you?';","en.asad":"well-nigh bursting with fury; [and] every time a host [of such sinners] is flung into it, its keepers will ask them, \"Has no warner ever come to you?\"","en.daryabadi":"Well-nigh it bursteth with rage. So oft as a company is cast thereinto, the keepers thereof will ask them: came there not Unto you a warner?","en.hilali":"It almost bursts up with fury. Every time a group is cast therein, its keeper will ask: \"Did no warner come to you?\"","en.pickthall":"As it would burst with rage. Whenever a (fresh) host is flung therein the wardens thereof ask them: Came there unto you no warner?","en.qaribullah":"nearly bursting apart out of rage. Every time a host is cast therein, its keepers will ask them: 'Did no one come to warn you'","en.sahih":"It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, \"Did there not come to you a warner?\"","en.sarwar":"It almost explodes in rage. Whenever a group is thrown into it, its keepers will ask them, \"Did no one come to warn you?\"","en.yusufali":"Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\"","en.maududi":"as though it will burst with rage. Every time a multitude is cast into it, its keepers will ask them: “Did no warner come to you?”","en.shakir":"Almost bursting for fury. Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner?","en.itani":"It almost bursts with fury. Every time a batch is thrown into it, its keepers will ask them, “Has no warner come to you?”","en.mubarakpuri":"It almost bursts up with fury. Every time a group is cast therein, its keepers will ask: \"Did no warner come to you\"","en.qarai":"almost exploding with rage. Whenever a group is thrown in it, its keepers will ask them, ‘Did not any warner come to you?’","en.wahiduddin":"as though bursting with rage. Each time a group is cast into it, its keepers will ask them, \"Did no warner come to you?\""},"tafsir":{"ar.muyassar":"تكاد جهنم تتمزق مِن شدة غضبها على الكفار، كلما طُرح فيها جماعة من الناس سألهم الموكلون بأمرها على سبيل التوبيخ: ألم يأتكم في الدنيا رسول يحذركم هذا العذاب الذي أنتم فيه؟","ar.jalalayn":"«تكاد تميز» وقرئ تتميز على الأصل تتقطع «من الغيظ» غضبا على الكافر «كلما ألقي فيها فوج» جماعة منهم «سألهم خزنتها» سؤال توبيخ «ألم يأتكم نذير» رسول ينذركم عذاب الله تعالى.","ar.qurtubi":"قوله تعالى : تكاد تميز من الغيظ يعني تتقطع وينفصل بعضها من بعض ; قاله سعيد بن جبير . وقال ابن عباس والضحاك وابن زيد : تتفرق . من الغيظ من شدة الغيظ على أعداء الله تعالى . وقيل : من الغيظ من الغليان . وأصل \" تميز \" تتميز .كلما ألقي فيها فوج أي جماعة من الكفار .سألهم خزنتها على جهة التوبيخ والتقريعألم يأتكم نذير أي رسول في الدنيا ينذركم هذا اليوم حتى تحذروا .\n","ar.miqbas":"تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ نَذِيرٌ (8) أُتبع وصف ما يجده أهل النار عند إلقائهم فيها من فظائع أهوالها بوصف ما يتلقاهم به خزنة النار .فالجملة استئناف بياني أثاره وصف النار عند إلقاء أهل النار فيها إذ يَتساءل السامع عن سبب وقوع أهل النار فيها فجاء بيانه بأنه تكذيبهم رسل الله الذين أرسلوا إليهم ، مع ما انضمّ إلى ذلك من وصف ندامة أهل النار على ما فرط منهم من تكذيب رسل الله وعلى إهمالهم النظر في دعوة الرسل والتدبر فيما جاءوهم به .و { كلمالغَيْظِ كُلَّمَا أُلْقِىَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَآ أَلَمْ يَأْتِكُمْ نَذِيرٌ * قَالُواْ بلى قَدْ جَآءَنَا } مركب من ( كل ) اسم دال على الشمول ومن ( ما ) الظرفية المصدرية وهي حرف يؤوَّل مع الفعل الذي بعده بمصدره .والتقدير : في كل وقت إلقاء فوج يسألهم خزنتُها الفوجَ .وباتصال ( كل ) بحرف ( ما ) المصدرية الظرفية اكتسبَ التركيب معنى الشرط وشابه أدوات الشرط في الاحتياج إلى جملتين مُرتبة إحداهما على الأخرى .وجيء بفعلى { أُلقي } و { سألهم } ماضيين لأن أكثر ما يقع الفعل بعد { كلما } أن يكون بصيغة المضي لأنها لما شابهت الشرط استوى الماضي والمضارع معها لظهور أنه للزمن المستقبل فأوثر فعل المضي لأنه أخف .والفوج : الجماعة أي جماعة ممن حق عليهم الخلود ، وتقدم عند قوله تعالى : { ويوم نحشر من كل أمة فوجاً } في سورة النمل ( 83 ) .وجيء بالضمائر العائدة إلى الفوج ضمائر جمع في قوله : سألهم } الخ . لتأويل الفوج بجماعة أفراده كما في قوله : { وإن طائفتان من المؤمنين اقتتلوا } [ الحجرات : 9 ] .وخزنة النار : الملائكة الموكل إليهم أمر جهنم وهو جمع خازن للموكل بالحفظ وأصل الخازن : الذي يخزن شيئاً ، أي يحفظه في مكان حصين ، فإطلاقه على الموكلين مجاز مرسل .وجملة { ألم يأتكم نذير } بيان لجملة { سألهم } كقوله : { فوسوس إليه الشيطان قال يا ءادم هل أدلك على شجرة الخلد } [ طه : 120 ] .والاستفهام في { ألم يأتكم نذير } للتوبيخ والتنديم ليزيدهم حسرة .والنذير : المنذر ، أي رسول منذر بعقاب الله وهو مصوغ على غير قياس كما صيغ بمعنى المسمع السميع في قول عمرو بن معد يكرب :أمن رياحنة الداعي السميع ... والمراد أفواج أهل النار من جميع الأمم التي أرسلت إليهم الرسل فتكون جملة : { كلما أُلقي فيها فوج } الخ بمعنى التذييل .وجملة : { قالوا بلى قد جاءنا نذير } معترضة بين كلام خزنة جهنم اعتراضاً يشير إلى أن الفوج قاطَعَ كلام الخزنة بتعجيل الاعتراف بما وبّخوهم عليه وذلك من شدة الخوف .وفصلت الجملة لوجهين لأنها اعتراض ، ولوقوعها في سياق المحَاورة كما تقدم غير مرة كقوله تعالى : { قالوا أتجعل فيها من يفسد فيها } في سورة البقرة ( 30 ) . وكان جوابهم جواب المتحسر المتندم ، فابتدأوا الجواب دفعة بحرف بلى } المفيد نقيض النفي في الاستفهام ، فهو مفيد معنى : جاءنا نذير .\n","ar.waseet":"( تَكَادُ تَمَيَّزُ مِنَ الغَيْظِ ) أى تكاد النار تتقطع وينفصل عن بعض ، لشدة غضبها عليهم ، والتهامها لهم ، وتميز أصله تتميز فحذفت إحدى التاءين تخفيفا .والغيظ أشد الغضب ، والجملة فى محل نصب على الحال ، أو فى محل رفع على أنها خبر لمبتدأ محذوف . أى : هى تكاد تتقطع من شدة غضبها عليهم . .وقوله : ( كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَآ . . ) كلام مستأنف لبيان حال أهلها .والفوج : الجماعة من الناس ولفظ ( كلما ) مركب من كل الدال على الشمول ، ومن ما المصدرية الظرفية .أى : فى كل وقت وآن ، يلقى بجامعة من الكافرين فى النار ، يسألهم خزنتها من الملائكة ، سؤال تبكيت وتقريع ، بقولهم :( أَلَمْ يَأْتِكُمْ نَذِيرٌ ) أى : ألم يأتكم يا معشر الكافرين نذير فى الدنيا ، ينذركم ويخوفكم من أهوال هذا اليوم ، ويدعوكم إلى إخلاص العبادة لله - تعالى - وحده .\n","ar.baghawi":"( تكاد تميز ) تنقطع ( من الغيظ ) من تغيظها عليهم ، قال ابن قتيبة : تكاد تنشق غيظا على الكفار ( كلما ألقي فيها فوج ) جماعة منهم ( سألهم خزنتها ) سؤال توبيخ ( ألم يأتكم نذير ) رسول ينذركم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5249.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5249.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5249.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"قَالُوا بَلَىٰ قَدْ جَاءَنَا نَذِيرٌ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللَّهُ مِنْ شَيْءٍ إِنْ أَنْتُمْ إِلَّا فِي ضَلَالٍ كَبِيرٍ","transliteration":"Qaaloo balaa qad jaaa'anaa nazeerun fakazzabnaa wa qulnaa maa nazzalal laahu min shai in in antum illaa fee dalaalin kabeer","translations":{"en.ahmedali":"And they will answer: \"Surely; a warner came to us, but we denied him, and said: 'God did not send down any thing; you are greatly deluded, in fact.'\"","en.ahmedraza":"They will say, “Yes, why not – indeed a Herald of Warning did come to us – in response we denied and said ‘Allah has not sent down anything – you are not except in a great error’.”","en.arberry":"They say, 'Yes indeed, a warner came to us; but we cried lies, saying, \"God has not sent down anything; you are only in great error.","en.asad":"They will reply: \"Yea, a warner did indeed come unto us, but we gave him the lie and said, 'Never has God sent down anything [by way of revelation]! You [self-styled warners] are but lost in a great delusion!\"'","en.daryabadi":"They will say: yea! surely there came a warner Unto us, but we belied, and said: God hath not sent down aught, are naught but in a great error.","en.hilali":"They will say: \"Yes indeed; a warner did come to us, but we belied him and said: 'Allah never sent down anything (of revelation), you are only in great error.'\"","en.pickthall":"They say: Yea, verily, a warner came unto us; but we denied and said: Allah hath naught revealed; ye are in naught but a great error.","en.qaribullah":"'Yes, indeed' they will reply, 'but we belied the Warner (Messenger) saying: 'Allah has not sent down anything, you are but in great error'","en.sahih":"They will say,\" Yes, a warner had come to us, but we denied and said, 'Allah has not sent down anything. You are not but in great error.'\"","en.sarwar":"They will say, \"Yes, someone did come to warn us, but we rejected him saying, 'God has revealed nothing. You are in great error\".","en.yusufali":"They will say: \"Yes indeed; a Warner did come to us, but we rejected him and said, 'Allah never sent down any (Message): ye are nothing but an egregious delusion!'\"","en.maududi":"They will say: “Yes, a warner came to us, but we gave the lie to him and said: 'Allah has revealed nothing. You are surely in huge error.'","en.shakir":"They shall say: Yea! indeed there came to us a warner, but we rejected (him) and said: Allah has not revealed anything, you are only in a great error.","en.itani":"They will say, “Yes, a warner did come to us, but we disbelieved, and said, ‘God did not send down anything; you are very much mistaken.’”","en.mubarakpuri":"They will say: \"Yes, indeed a warner did come to us, but we rejected him and said: `Allah never sent down anything; you are only in great error.\"'","en.qarai":"They will say, ‘Yes, a warner did come to us, but we impugned [him] and said, ‘Allah did not send down anything; you are only in great error.’","en.wahiduddin":"They will say, \"Of course, a warner did come to us, but we belied him and we said, 'God has revealed nothing; you are in gross error.'\""},"tafsir":{"ar.muyassar":"أجابوهم قائلين: بلى قد جاءنا رسول مِن عند الله وحذَّرنا، فكذَّبناه، وقلنا فيما جاء به من الآيات: ما نزَّل الله على أحد من البشر شيئًا، ما أنتم - أيها الرسل- إلا في ذهاب بعيد عن الحق.","ar.jalalayn":"«قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن» ما «أنتم إلا في ضلال كبير» يحتمل أن يكون من كلام الملائكة للكفار حين أخبروا بالتكذيب وأن يكون كلام الكفار للنذر.","ar.qurtubi":"قالوا بلى قد جاءنا نذير أنذرنا وخوفنا .فكذبنا وقلنا ما نزل الله من شيء أي على ألسنتكم .إن أنتم يا معشر الرسل .إلا في ضلال كبير اعترفوا بتكذيب الرسل ، ثم اعترفوا بجهلهم فقالوا وهم في النار :\n","ar.miqbas":"قَالُوا بَلَى قَدْ جَاءَنَا نَذِيرٌ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ اللَّهُ مِنْ شَيْءٍ إِنْ أَنْتُمْ إِلَّا فِي ضَلَالٍ كَبِيرٍ (9)ولذلك كان قولهم : { قد جاءنا نذير } موكداً لما دلت عليه { بلى } ، وهو من تكرير الكلام عند التحسر ، مع زيادة التحقيق ب { قد } ، وذلك التأكيد هو مناط الندامة والاعتراف بالخطأ .وجملة : { إن أنتم إلاَّ في ضلال كبير } الأظهر أنها بقية كلام خزنة جهنم فصل بينها وبين ما سبقها من كلامهم اعتراضُ جواببِ الفوج الموجه إليهم الاستفهام التوبيخي كما ذكرناه آنفاً ، ويؤيد هذا إعادة فعل القول في حكاية بقية كلام الفوج في قوله تعالى : { وقَالوا لو كنا نسمع } [ الملك : 10 ] الخ لانقطاعه بالاعتراض الواقع خلال حكايته .ويجوز أن تكون جملة { إن أنتم إلا في ضلال كبير } من تمام كلام كل فوج لنذيرهم . وأتي بضمير جمع المخاطبين مع أن لكل قوم رسولاً واحداً في الغالب باستثناء موسى وهارون وباستثناء رسل أصحاب القرية المذكورة في سورة يس؛ إما على اعتبار الحكاية بالمعنى بأن جُمع كلام جميع الأفواج في عبارة واحدة فجيء بضمير الجمع والمراد التوزيع على الأفواج ، أي قال جميع الأفواج : { بلى قد جاءنا نذير } إلى قوله : { إن أنتم إلا في ضلال كبير } ، على طريقة المثال المشهور : «ركِب القوم دوابهم» ، وإما على إرادة شمول الضمير للنذير وأتباعِه الذين يؤمنون بما جاء به .وعموم { شيء } في قوله : { ما نزَّل الله من شيء } المرادِ منه شيء من التنزيل ، يدل على أنهم كانوا يحيلون أن يُنزل الله وحياً على بشر ، وهذه شنشنة أهل الكفر قال تعالى : { وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء } وقد تقدم في آخر [ الأنعام : 91 ] .ووصف الضلال ب { كبير } معناه شديد بالغ غاية ما يبلغ إليه جنسه حتى كأنه جسم كبير .ومعنى القصر المستفادِ من النفي والاستثناء في { إن أنتم إلا في ضلال كبير } قصرُ قلب ، أي ما حالكم التي أنتم متلبسون بها إلاّ الضلال ، وليس الوحَي الإِلهي والهدى كما تزعمون .والظرفية مجازية لتشبيههم تَمَحُّضَهم للضلال بإحاطة الظرف بالمظروف .\n","ar.waseet":"ثم حكى - سبحانه - ما رد به الكافرون على خزنة جهنم فقال : ( قَالُواْ بلى قَدْ جَآءَنَا نَذِيرٌ فَكَذَّبْنَا وَقُلْنَا مَا نَزَّلَ الله مِن شَيْءٍ . . ) .أى : قال الكافرون - على سبيل التحسر والتفجع - فى ردهم على خزنة جهنم : بلى لقد جاءنا المنذر الذى أنذرنا وحذرنا من سوء عاقبة الكفر . . ولكننا كذبناه ، وأعرضنا عن دعوته ، بل وتجاوزونا ذلك بأن قلنا له على سبيل العناد والجحود والغرور : ما نزل الله على أحد من شئ من الأشياء التى تتلوها علينا ، وتأمرنا بها ، أو تنهانا عن مخالفتها .وقوله : ( إِنْ أَنتُمْ إِلاَّ فِي ضَلاَلٍ كَبِيرٍ ) يحتمل أنه من كلام الكافرين لرسلهم الذين أنذروهم وحذروهم من الإصرار على الكفر .أى : جاءنا الرسل الذين أنذرونا . . فكذبناهم ، وقلنا لهم : ما نزل الله من شئ من الأشياء على ألسنتكم . . وقلنا لهم - ما أنتم إلا فى ضلال كبير ، أى : فى ذهاب واضح عن الحق ، وبعدٍ شديد عن الصواب .ويحتمل أن يكون من كلام الملائكة ، أى : قال لهم الملائكة على سبيل التجهيل والتوبيخ : ما أنتم - أيها الكافرون - إلا فى ضلال كبير ، بسبب تكذيبكم لرسلكم ، وإعراضكم عمن حذركم وأنذركم .قال صاحب الكشاف : فإن قلت : ( إِنْ أَنتُمْ إِلاَّ فِي ضَلاَلٍ كَبِيرٍ ) من المخاطبون به؟قلت : هو من جملة قول الكفار وخطابهم للمنذرين ، على أن النذير بمعنى الإِنذار . والمعنى : ألم يأتكم أهل نذير : أو وصف به منذروهم لغلوهم فى الإِنذار ، كأنهم ليسوا إلا إنذارا . .ويجوز أن يكون من كلام الخزنة للكفار على إرادة القول : أرادوا حكاية ما كانوا عليه من ضلالهم فى الدنيا ، أو أرادوا بالضلال : الهلاك . . .وجمع - سبحانه - الضمير فى قوله ( إِنْ أَنتُمْ . . . ) مع أن الملائكة قد سألوهم ( أَلَمْ يَأْتِكُمْ نَذِيرٌ ) بالإفراد ، للإشعار بأن هؤلاء الكافرين لم يكتفوا بتكذيب النذير الذى أنذرهم ، بل كذبوه وأتباعه الذين آمنوا به .فكأن كل فوج منهم كان يقول للرسول الذى جاء لهدايته : أنت وأتباعك فى ضلال كبير .\n","ar.baghawi":"( قالوا بلى قد جاءنا نذير فكذبنا وقلنا ) للرسل ( ما نزل الله من شيء إن أنتم إلا في ضلال كبير )\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5250.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5250.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5250.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ","transliteration":"Wa qaaloo law kunnaa nasma'u awna'qilu maa kunnaa feee as haabis sa'eer","translations":{"en.ahmedali":"They will say: \"If we had listened and been wise, we would not have been among the inmates of Hell.\"","en.ahmedraza":"And they will say, “Had we listened or understood, we would not have been among the people of hell.”","en.arberry":"They also say, 'If we had only heard, or had understood, we would not have been of the inhabitants of the Blaze.'","en.asad":"And they will add: \"Had we but listened [to those warnings], or [at least] used our own reason, we would not [now] be among those who are destined for the blazing flame!\"","en.daryabadi":"And they will say: had we been wont to hearken or to reflect, we had not been among the fellows of the Blaze.","en.hilali":"And they will say: \"Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!\"","en.pickthall":"And they say: Had we been wont to listen or have sense, we had not been among the dwellers in the flames.","en.qaribullah":"And they will then say: 'If only we had listened and understood we should not now be among the inhabitants of the Blaze'","en.sahih":"And they will say, \"If only we had been listening or reasoning, we would not be among the companions of the Blaze.\"","en.sarwar":"They will also say, \"Had We listened or used our minds, we would not have become the dwellers of hell\".","en.yusufali":"They will further say: \"Had we but listened or used our intelligence, we should not (now) be among the Companions of the Blazing Fire!\"","en.maududi":"They will say: 'If we had only listened and understood, we would not be among the inmates of the Blazing Fire.'”","en.shakir":"And they shall say: Had we but listened or pondered, we should not have been among the inmates of the burning fire.","en.itani":"And they will say, “Had we listened or reasoned, we would not have been among the inmates of the Blaze.”","en.mubarakpuri":"And they will say: \"Had we but listened or used our intelligence, we would not have been among the dwellers of the blazing Fire!\"","en.qarai":"And they will say, ‘Had we listened or applied reason, we would not have been among inmates of the Blaze.’","en.wahiduddin":"They will say, \"If we had only listened or understood, we should not now be among the inmates of Hell,\""},"tafsir":{"ar.muyassar":"وقالوا معترفين: لو كنا نسمع سماع مَن يطلب الحق، أو نفكر فيما نُدْعى إليه، ما كنا في عداد أهل النار.","ar.jalalayn":"«وقالوا لو كنا نسمع» أي سماع تفهم «أو نعقل» أي عقل تفكر «ما كنا في أصحاب السعير».","ar.qurtubi":"وقالوا لو كنا نسمع من النذر - يعني الرسل - ما جاءوا بهأو نعقل عنهم . قال ابن عباس : لو كنا نسمع الهدى أو نعقله ، أو لو كنا نسمع سماع من يعي ويفكر ، أو نعقل عقل من يميز وينظر . ودل هذا على أن الكافر لم يعط من العقل شيئا . وقد مضى في \" الطور \" بيانه والحمد لله .ما كنا في أصحاب السعير يعني ما كنا من أهل النار . وعن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم أنه قال : لقد ندم الفاجر يوم القيامة قالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير\n","ar.miqbas":"وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا فِي أَصْحَابِ السَّعِيرِ (10)أعيد فعل القول للإِشارة إلى أن هذا كلام آخر غير الذي وقع جواباً عن سؤال خزنة جهنم وإنما هذا قول قالوه في مجامعهم في النار تحسراً وتندماً ، أي وقال بعضهم لبعض في النار فهو من قبيل قوله تعالى : { حتى إذا ادَّاركوا فيها جميعاً قالت أخراهم لأولاهم ربنا هؤلاء أضلونا } [ الأعراف : 38 ] الخ . لتأكيد الإِخبار على حسب الوجهين المتقدمين في موقع جملة { إن أنتم إلاّ في ضلال كبير } [ الملك : 9 ] .وذكروا ما يدل على انتفاء السمع والعقل عنهم في الدنيا ، وهم يريدون سمعاً خاصاً وعقلاً خاصاً ، فانتفاء السمع بإعراضهم عن تلقي دعوة الرسل مثل ما حكى الله عن المشركين { وقال الذين كفروا لا تسمعوا لهذا القرآن } [ فصلت : 26 ] وانتفاء العقل بترك التدبر في آيات الرسل ودلائل صدقهم فيما يدْعون إليه .ولا شك في أن أقل الناس عقلاً المشركون لأنهم طرحوا ما هو سبب نجاتهم لغير معارض يعارضه في دينهم ، إذ ليس في دين أهل الشرك وعيد على ما يخالف الشرك من معتقدات ، ولا على ما يخالف أعمال أهله من الأعمال ، فكان حكم العقل قاضياً بأن يتلقوا ما يدعوهم إليه الرسل من الإِنذار بالامتثال إذ لا معارض له في دينهم لولا الإلف والتكبر بخلاف حال أهل الأديان أتباع الرسل الذين كانوا على دين فهم يخشون إن أهملوه أن لا يغني عنهم الدين الجديد شيئاً فكانوا إلى المعذرة أقرب لولا أن الأدلة بعضها أقوى من بعض .وذكر القرطبي في تفسير قوله تعالى : { أم تأمرهم أحلامهم بهذا } [ سورة الطور : 32 ] عن كتاب الحكيم الترمذي أنه أخرج حديثاً \" أن رجلاً قال : يا رسول الله ما أعقلَ فلاناً النصراني ، فقال النبي صلى الله عليه وسلم مَهْ ، إن الكافر لا عقل له أما سمعتَ قول الله تعالى : { وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير } \" قال وفي حديث ابن عمر فزجره النبي صلى الله عليه وسلم وقال : \" مَهْ إن العاقل من يعمل بطاعة الله \" ولم أقف عليه فيما رأيت من كتب التفسير ولم يذكره السيوطي في التفسير بالمأثور في سورة الطور ولا في سورة الملك .ويؤخذ من هذه الآية أن قوام الصلاح في حسن التلقي وحسن النظر وأن الأثر والنظر ، أي القياس هما أصلا الهدى ، ومن العجيب ما ذكره صاحب «الكشاف» : أن من المفسرين من قال : إن المراد من الآية : لو كنا على مذهب أصحاب الحديث أو على مذهب أصحاب الرأي . ولم أقف على تعيين من فسر الآية بهذا ولا أحسبه إلاّ من قبيل الاسترواح .و { أو } للتقسيم وهو تقسيم باعتبار نوعي الأحوال التي تقتضي حسن الاستماع تارة إذا ألقي إليها إرشاد ، وحسنَ التفهم والنظر تارة إذا دعيت إلى النظر من داع غير أنفسها ، أو من دواعي أنفسها ، قال تعالى : { فبشر عبادي الذين يستمعون القول فيتبعون أحسنه أولئك الذين هداهم الله وأولئك هم أولوا الألباب } [ الزمر : 1718 ] .ووجه تقديم السمع على العقل أن العقل بمنزلة الكليّ والسمع بمنزلة الجُزئي ورعياً للترتيب الطبيعي لأن سمع دعوة النذير هو أول ما يتلقاه المنذَرون ، ثم يُعمِلون عقولهم في التدبر فيها .\n","ar.waseet":"ثم بين - سبحانه - جانبا آخر من حسراتهم فى هذا اليوم فقال : ( وَقَالُواْ لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ مَا كُنَّا في أَصْحَابِ السعير . . ) .أى : وقال الكافرون بربهم - على سبيل الحسرة والندامة - لو كنا فى الدنيا نسمع ما يقال لنا على لسان رسولنا ، سماع طاعة وتفكر واستجابة ، أو نعقل ما يوجه إلينا من هدايات وإرشادات . .لو كنا كذلك ، ما صرنا فى هذا اليوم من جملة أصحاب النار المسعرة ، الذين هم خالدون فيها أبدا .وقدم - سبحانه - السماع على التعقل ، مراعاة للترتيب الطبيعى ، لأن السماع يكون أولا ، ثم يعقبه التعقل والتدبر لما يسمع .\n","ar.baghawi":"( وقالوا لو كنا نسمع ) من الرسل ما جاءونا به ( أو نعقل ) منهم . وقال ابن عباس : لو كنا نسمع الهدى أو نعقله فنعمل به ( ما كنا في أصحاب السعير ) قال الزجاج : لو كنا نسمع سمع من يعي ويتفكر أو نعقل عقل من يميز وينظر ما كنا من أهل النار .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5251.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5251.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5251.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"فَاعْتَرَفُوا بِذَنْبِهِمْ فَسُحْقًا لِأَصْحَابِ السَّعِيرِ","transliteration":"Fa'tarafoo bizambihim fasuhqal li as haabis sa'eer","translations":{"en.ahmedali":"So will they confess their guilt. Deprived (of all joys) will be the inmates of Hell.","en.ahmedraza":"So now they admit their sins! Therefore accursed be the people of hell!","en.arberry":"So they confess their sins. Curse the inhabitants of the Blaze!","en.asad":"Thus will they come to realize their sins: but [by that time,] remote will have become all good from those who are destined for the blazing flame.","en.daryabadi":"So they shall confess their sin. Far away they-be, the fellows of the Blaze!","en.hilali":"Then they will confess their sin. So, away with the dwellers of the blazing Fire.","en.pickthall":"So they acknowledge their sins; but far removed (from mercy) are the dwellers in the flames.","en.qaribullah":"So it is that they confess their sins. Curse the inhabitants of the Blaze!","en.sahih":"And they will admit their sin, so [it is] alienation for the companions of the Blaze.","en.sarwar":"They will confess to their sins, but the dwellers of hell will be far away from God's (mercy).","en.yusufali":"They will then confess their sins: but far will be (Forgiveness) from the Companions of the Blazing Fire!","en.maududi":"Thus will they confess their sins. Damned are these inmates of the Blazing Fire.","en.shakir":"So they shall acknowledge their sins, but far will be (forgiveness) from the inmates of the burning fire.","en.itani":"So they will acknowledge their sins. So away with the inmates of the Blaze.","en.mubarakpuri":"Then they will confess their sin. So, away with the dwellers of the blazing Fire!","en.qarai":"Thus they will admit their sin. So away with the inmates of the Blaze!","en.wahiduddin":"and thus they will confess their sin; far from God's mercy are the inmates of Hell."},"tafsir":{"ar.muyassar":"فاعترفوا بتكذيبهم وكفرهم الذي استحقوا به عذاب النار، فبعدًا لأهل النار عن رحمة الله.","ar.jalalayn":"«فاعترفوا» حيث لا ينفع الأعتراف «بذنبهم» وهو تكذيب النذر «فسحقا» بسكون الحاء وضمها «لأصحاب السعير» فبعدا لهم عن رحمة الله.","ar.qurtubi":"فقال الله تعالى : فاعترفوا بذنبهم أي بتكذيبهم الرسل . والذنب [ ص: 197 ] هاهنا بمعنى الجمع ; لأن فيه معنى الفعل . يقال : خرج عطاء الناس أي أعطيتهم .فسحقا لأصحاب السعير أي فبعدا لهم من رحمة الله . وقال سعيد بن جبير وأبو صالح : هو واد في جهنم يقال له السحق . وقرأ الكسائي وأبو جعفر \" فسحقا \" بضم الحاء ، ورويت عن علي . الباقون بإسكانها ، وهما لغتان مثل السحت والرعب . الزجاج : وهو منصوب على المصدر ; أي أسحقهم الله سحقا ; أي باعدهم بعدا . قال امرؤ القيس :يجول بأطراف البلاد مغربا وتسحقه ريح الصبا كل مسحقوقال أبو علي : القياس إسحاقا ; فجاء المصدر على الحذف ; كما قيل : وإن أهلك فذلك كان قدري أي تقديري . وقيل : إن قوله تعالى : إن أنتم إلا في ضلال كبير من قول خزنة جهنم لأهلها .\n","ar.miqbas":"فَاعْتَرَفُوا بِذَنْبِهِمْ فَسُحْقًا لِأَصْحَابِ السَّعِيرِ (11)الفاء الأولى فصيحة ، والتقدير : إذ قالوا بذلك فقد تبين أنهم اعترفوا هنالك بذنبهم ، أي فهم محقوقون بما هم فيه من العذاب .والسُحق : اسم مصدر معناه البعد ، وهو هنا نائب عن الإسحاق لأنه دعاء بالإِبعاد فهو مفعول مطلق نائب عن فعله ، أي أسحقهم الله إسحاقاً ، ويجوز أن يراد من هذا الدعاء التعجيب من حالهم كما يقال : قاتله الله ، وويل له ، في مقام التعجب .والفاء الثانية للتسبب ، أي فهم جديرون بالدعاء عليهم بالإبعاد أو جديرون بالتعجيب من بُعدهم عن الحق ، أو عن رحمة الله تعالى . ويحتمل أيضاً أن يقال لهم يومَ الحساب عقبَ اعترافهم ، تنديماً يزيدهم ألماً في نفوسهم فوق ألم الحريق في جلودهم .واللام الداخلة على ( سحقاً ) لام التقوية إن جعل ( سحقاً ) دعاء عليهم بالإِبعاد لأن المصدر فرع في العمل في الفعل ، ويجوز أن يكون اللام لام التبيين لآياته تعلق العامل بمعموله كقولهم : شكراً لك ، فكل من ( سحقاً ) واللام المتعلقة به مستعمل في معنييه .و { لأصحاب السعير } يعمّ المخاطبين بالقرآن وغيرهم فكان هذا الدعاء بمنزلة التذييل لما فيه من العموم تبعاً للجمل التي قبله .وقرأ الجمهور { فسحقاً } بسكون الحاء . وقرأه الكسائي وأبو جعفر بضم الحاء وهو لغة فيه وذلك لإتباع ضمة السين .\n","ar.waseet":"والفاء الأولى فى قوله - تعالى - : ( فاعترفوا بِذَنبِهِمْ فَسُحْقاً لأَصْحَابِ السعير ) للإفصاح ، والثانية للسببية ، والسُّحقُ : البُعد ، يقال : سَحُق - ككَرم وعَلِم - سُحقا ، أى بَعُدَ بُعْداً ، وفلان أسحقه الله ، أى : أبعده عن رحمته ، وهو مصدر ناب عن فعله فى الدعاء ، ونصبه على أنه مفعول به لفعل مقدر ، أى : ألزمهم الله سحقا ، أو منصوب على المصدرية ، أى : فسحقهم الله سحقا .أى : إذا كان الأمر كما أخبروا عن أنفسهم ، فقد أقروا واعترفوا بذنوبهم ، وأن الله - تعالى - ما ظلمهم ، وأن ندمهم لن ينفعهم فى هذا اليوم . . بل هم جديرون بالدعاء عليهم بالطرد من رحمة الله - تعالى - وبخلودهم فى نار السعير .واللام فى قوله ( لأَصْحَابِ ) للتبين ، كما فى قولهم : سَقياً لك .فالآية الكريمة توضح أن ما أصابهم من عذاب كان بسبب إقرارهم بكفرهم ، وإصرارهم عليه حتى الممات ، وفى الحديث الشريف : \" لن يدخل أحد النار ، إلا وهو يعلم أن النار أولى به من الجنة \" وفى حديث آخر : \" لن يهلك الناس حتى يعذروا من أنفسهم \" .\n","ar.baghawi":"( فاعترفوا بذنبهم فسحقا ) بعدا ( لأصحاب السعير ) قرأ أبو جعفر والكسائي \" فسحقا \" بضم الحاء ، وقرأ الباقون بسكونها وهما لغتان مثل الرعب والرعب والسحت والسحت .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5252.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5252.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5252.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ","transliteration":"Innal lazeena yakhshawna rabbahum bilghaibi lahum maghfiratunw wa ajrun kabeer","translations":{"en.ahmedali":"For those who fear their Lord in secret is forgiveness and a great reward.","en.ahmedraza":"Indeed for those who fear their Lord without seeing is forgiveness, and a great reward.","en.arberry":"Surely those who fear their Lord in the Unseen -- there awaits them forgiveness and a great wage.","en.asad":"[As against this,] behold, for those who stand in awe of God although He is beyond the reach of their perception, there is forgiveness in store and a great reward.","en.daryabadi":"Verily those who dread their Lord unseen, theirs shall be forgiveness and a great hire.","en.hilali":"Verily! Those who fear their Lord unseen (i.e. they do not see Him, nor His Punishment in the Hereafter, etc.), theirs will be forgiveness and a great reward (i.e. Paradise).","en.pickthall":"Lo! those who fear their Lord in secret, theirs will be forgiveness and a great reward.","en.qaribullah":"But those who fear their Lord in the Unseen, for them there is forgiveness and a great wage.","en.sahih":"Indeed, those who fear their Lord unseen will have forgiveness and great reward.","en.sarwar":"Those who fear their Lord in secret will receive forgiveness and a great reward.","en.yusufali":"As for those who fear their Lord unseen, for them is Forgiveness and a great Reward.","en.maududi":"Surely forgiveness and a mighty reward await those who fear Allah without seeing Him.","en.shakir":"(As for) those who fear their Lord in secret, they shall surely have forgiveness and a great reward.","en.itani":"As for those who fear their Lord in secret—for them is forgiveness and a great reward.","en.mubarakpuri":"Verily, those who fear their Lord unseen, theirs will be forgiveness and a great reward.","en.qarai":"Indeed for those who fear their Lord in secret there will be forgiveness and a great reward.","en.wahiduddin":"As for those who fear their Lord in the unseen will have forgiveness and a rich reward."},"tafsir":{"ar.muyassar":"إن الذين يخافون ربهم، فيعبدونه، ولا يعصونه وهم غائبون عن أعين الناس، ويخشون العذاب في الآخرة قبل معاينته، لهم عفو من الله عن ذنوبهم، وثواب عظيم وهو الجنة.","ar.jalalayn":"«إن الذين يخشون ربهم» يخافونه «بالغيب» في غيبتهم عن أعين الناس فيطيعونه سرا فيكون علانية أولى «لهم مغفرة وأجر كبير» أي الجنة.","ar.qurtubi":"قوله تعالى : إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبيرقوله تعالى : إن الذين يخشون ربهم بالغيب نظيره : من خشي الرحمن بالغيب وقد مضى الكلام فيه . أي يخافون الله ويخافون عذابه الذي هو بالغيب ; وهو عذاب يوم القيامة .لهم مغفرة لذنوبهموأجر كبير وهو الجنة .\n","ar.miqbas":"إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ (12)اعتراض يفيد استئنافاً بيانياً جاء على سنن أساليب القرآن من تعقيب الرهبة بالرغبة ، فلما ذكر ما أعد للكافرين المعرضين عن خشية الله أعقبه بما أعد للذين يخشون ربهم بالغيب من المغفرة والثواب للعلم بأنهم يترقبون ما يميزهم عن أحوال المشركين .وقدم المغفرة تطميناً لقلوبهم لأنهم يخشون المؤاخذة على ما فرط منهم من الكفر قبل الإسلام ومن اللمم ونحوه ، ثم أعقبت بالبشارة بالأجر العظيم ، فكان الكلام جارياً على قانون تقديم التخلية على التحْلية ، أو تقديم دفع الضر على جلب النفع ، والوصف بالكبير بمعنى العظيم نظير ما تقدم آنفاً في قوله : { إن أنتم إلاّ في ضلال كبير } [ الملك : 9 ] .وتنكير { مغفرة } للتعظيم بقرينة مقارنته ب { أجر كبير } وبقرينة التقديم .وتقديم المسند على المسند إليه في جملة { لهم مغفرة } ليتأتى تنكير المبتدأ ، ولإِفادة الاهتمام ، وللرعاية على الفاصلة وهي نُكت كثيرة .\n","ar.waseet":"وكعادة القرآن الكريم فى قرنه الترغيب والترهيب أو العكس ، أخذت السورة فى بيان حسن عاقبة المؤمنين ، بعد بيا سوء عاقبة الكافرين ، وفى لفت أنظار الناس إلى نعم الله - تعالى - عليهم ، لكى يشكروه ويخلصوا له العبادة . . قال - تعالى - :( إِنَّ الذين يَخْشَوْنَ . . . ) .قوله : ( يَخْشَوْنَ ) من الخشية ، وهى أشد الخوف وأعظمه ، والغيب : مصدر غاب يغيب ، وكثيرا ما يستعمل بمعنى الغائب ، وهو ما لا تدركه الحواس ولا يعلم ببداهة العقل .أى : إن الذين يخشون ربهم فيخافون عذابه ، ويعبدونه كأنهم يرونه ، مع أنهم لا يرونه بأعينهم . . هؤلاء الذين تلك صفاتهم ، لهم من خالقهم - عز وجل - مغفرة عظيمة ، وأجر بالغ الغاية فى الكبر والضخامة .وقوله ( بالغيب ) حال من الفاعل ، أى : غائبا عنهم ، أو من المفعول . أى : غائبين عنه . أى . يخشون عذابه دون أن يروه - سبحانه - .ويجوز أن يكون المعنى : يخشون عذابه حال كونهم غائبين عن أعين الناس ، فهم يراقبونه - سبحانه - فى السر ، كما يراقبونه فى العلانية كما قال الشاعر :يتجنب الهفوات فى خلواته ... عف السريرة ، غَيبُه كالمشهدوالحق أن هذه الصفة ، وهى خوف الله - تعالى - بالغيب ، على رأس الصفات التى تدل على قوة الإِيمان ، وعلى طهارة القلب ، وصفاء النفس . .\n","ar.baghawi":"\"إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5253.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5253.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5253.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ ۖ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","transliteration":"Wa asirroo qawlakum awijharoo bihee innahoo 'aleemum bizaatis sudoor","translations":{"en.ahmedali":"Whether you say a thing secretly or openly, He knows the innermost secrets of your hearts.","en.ahmedraza":"And whether you speak softly or proclaim it aloud; He indeed knows what lies within the hearts!","en.arberry":"Be secret in your speech, or proclaim it, He knows the thoughts within the breasts.","en.asad":"AND [know, O men, that] whether you keep your beliefs secret or state them openly, He has full knowledge indeed of all that is in [your] hearts.","en.daryabadi":"And whather ye keep your discourse secret or publish it, verily He is the Knower of that which is in the breasts.","en.hilali":"And whether you keep your talk secret or disclose it, verily, He is the All-Knower of what is in the breasts (of men).","en.pickthall":"And keep your opinion secret or proclaim it, lo! He is Knower of all that is in the breasts (of men).","en.qaribullah":"(Whether you) speak in secret or aloud, He knows the innermost of the chests.","en.sahih":"And conceal your speech or publicize it; indeed, He is Knowing of that within the breasts.","en.sarwar":"Whether you conceal what you say or reveal it, God knows best all that the hearts contain.","en.yusufali":"And whether ye hide your word or publish it, He certainly has (full) knowledge, of the secrets of (all) hearts.","en.maududi":"Whether you speak in secrecy or aloud, (it is all the same to Allah). He even knows the secrets that lie hidden in the breasts of people.","en.shakir":"And conceal your word or manifest it; surely He is Cognizant of what is in the hearts.","en.itani":"Whether you keep your words secret, or declare them—He is Aware of the inner thoughts.","en.mubarakpuri":"And whether you keep your talk secret or disclose it, verily, He is the All-Knower of what is in the breasts.","en.qarai":"Speak secretly, or do so openly, indeed He knows well what is in the breasts.","en.wahiduddin":"Whether you speak in secret or aloud, He knows what is in every heart."},"tafsir":{"ar.muyassar":"وأخفوا قولكم- أيها الناس- في أي أمر من أموركم أو أعلنوه، فهما عند الله سواء، إنه سبحانه عليم بمضمرات الصدور، فكيف تخفى عليه أقوالكم وأعمالكم؟","ar.jalalayn":"«وأسِرّوا» أيها الناس «قولكم أو اجهروا به إنه» تعالى «عليم بذات الصدور» بما فيها فكيف بما نطقتم به، وسبب نزول ذلك أن المشركين قال بعضهم لبعض: أسرّوا قولكم لا يسمعكم إله محمد.","ar.qurtubi":"قوله تعالى : وأسروا قولكم أو اجهروا به إنه عليم بذات الصدورقوله تعالى : وأسروا قولكم أو اجهروا به اللفظ لفظ الأمر والمراد به الخبر ; يعني إن أخفيتم كلامكم في أمر محمد صلى الله عليه وسلم أو جهرتم به ف إنه عليم بذات الصدور يعني بما في القلوب من الخير والشر . ابن عباس : نزلت في المشركين ، كانوا ينالون من النبي صلى الله عليه وسلم فيخبره جبريل عليه السلام ; فقال بعضهم لبعض : أسروا قولكم كي لا يسمع رب محمد ; فنزلت : \" وأسروا قولكم أو اجهروا به \" . يعني : أسروا قولكم في أمر محمد صلى الله عليه وسلم . وقيل في سائر الأقوال . أو اجهروا به ; أعلنوه .إنه عليم بذات الصدور ذات الصدور : ما فيها ; كما يسمى ولد المرأة وهو جنين \" ذا بطنها \" .\n","ar.miqbas":"وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ (13) عطف على الجمل السابقة عطف غرض على غرض ، وهو انتقال إلى غرض آخر لِمناسبة حكاية أقوالهم في الآخرة بذكر أقوالهم في الدنيا وهي الأقوال التي كانت تصدر منهم بالنيل من رسول الله صلى الله عليه وسلم فكان الله يطلعه على أقوالهم فيخبرهم النبي صلى الله عليه وسلم بأنكم قلتم كذا وكذا ، فقال بعضهم لبعض : أسروا قولكم كيلا يسمعه رب محمد فأنزل الله { وأسروا قولكم أو اجهروا به } كذا روي عن ابن عباس .وصيغة الأمر في { وأسروا } و { اجهروا } مستعملة في التسوية كقوله تعالى : { فاصبروا أو لا تصبروا } [ الطور : 16 ] ، وهذا غالب أحوال صيغة افعل إذا جاءت معها { أو } عاطفة نقيض أحد الفعلين على نقيضه .فقوله : { إنه عليم بذات الصدور } تعليل للتسوية المستفادة من صيغة الأمر بقرينة المقام وسبب النزول ، أي فسواء في علم الله الإِسرار والإِجهار لأن علمه محيط بما يختلج في صدور الناس بَلْهَ ما يسرون به من الكلام ، ولذلك جيء بوصف عليم إذ العليم من أمثلة المبالغة وهو القويّ علمُه .وضمير { إنه } عائد إلى الله تعالى المعلوم من المقام ، ولا معاد في الكلام يعود إليه الضمير ، لأن الاسم الذي في جملة { إن الذين يخشون ربهم بالغيب } [ الملك : 12 ] لا يكون معاداً لكلام آخر .و ( ذات الصدور ) مَا يتردد في النفس من الخواطر والتقادير والنوايا على الأعمال . وهو مركب من ( ذات ) التي هي مؤنث ( ذُو ) بمعنى صاحب ، و { الصدور } بمعنى العقول وشأن ( ذُو ) أن يضاف إلى ما فيه رفعة .\n","ar.waseet":"ثم بين - سبحانه - بأبلغ أسلوب ، أن السر يتساوى مع العلانية بالنسبة لعلمه - تعالى - فقال : ( وَأَسِرُّواْ قَوْلَكُمْ أَوِ اجهروا بِهِ إِنَّهُ عَلِيمٌ بِذَاتِ الصدور . . . ) .وقد ذكروا فى سبب نزول هذه الآية ، أن المشركين كانوا ينالون من النبى صلى الله عليه وسلم فلما أطلعه الله - تعالى - على أمرهم ، فقال بعضهم لبعض : أسروا قولكم كى لا يسمعه رب محمد . .وصيغة الأمر فى قوله : ( وَأَسِرُّواْ ) و ( اجهروا ) مستعملة فى التسوية بين الأمرين ، كما فى قوله - تعالى - ( فاصبروا أَوْ لاَ تَصْبِرُواْ . . . )أى : إن إسراركم - أيها الكافرون - بالإِساءة إلى نبينا محمد صلى الله عليه وسلم - أو جهركم بهذه الإِساءة ، يستويان فى علمنا ، لأننا لا يخفى علينا شئ من أحوالكم ، فسواء عندنا من أسر منكم القول ومن جهر به .وجملة ( إِنَّهُ عَلِيمٌ بِذَاتِ الصدور ) تعليق للتسوية المستفادة من صيغة الأمر أى : سواء فى علمه - تعالى- إسراركم وجهركم ، لأنه - سبحانه - عليم علما تاما بما يختلج فى صدوركم ، وما يدور فى نياتكم التى هى بداخل قلوبكم .وشبيه بهذه الآية قوله - تعالى - : ( وَلَقَدْ خَلَقْنَا الإنسان وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الوريد ) .\n","ar.baghawi":"\"وأسروا قولكم أو اجهروا به إنه عليم بذات الصدور\"، قال ابن عباس : نزلت في المشركين كانوا ينالون من رسول الله - صلى الله عليه وسلم - فيخبره جبريل عليه السلام بما قالوا فقال بعضهم لبعض : أسروا قولكم كي لا يسمع إله محمد .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5254.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5254.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5254.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ","transliteration":"Alaa ya'lamu man khalaq wa huwal lateeful khabeer","translations":{"en.ahmedali":"Can He who has created not know (His creation)? He is all-penetrating, all-aware.","en.ahmedraza":"What! Will He Who has created not know? Whereas He knows every detail, the All Aware!","en.arberry":"Shall He not know, who created? And He is the All-subtle, the All-aware.","en.asad":"How could it be that He who has created [all] should not know [all]? Yea, He alone is unfathomable [in His wisdom], aware!","en.daryabadi":"Shall not He Who hath created know? And He is the Subtile, the Aware.","en.hilali":"Should not He Who has created know? And He is the Most Kind and Courteous (to His slaves) All-Aware (of everything).","en.pickthall":"Should He not know what He created? And He is the Subtile, the Aware.","en.qaribullah":"Shall He who has created (all things) not know? He is the Subtle, the Aware.","en.sahih":"Does He who created not know, while He is the Subtle, the Acquainted?","en.sarwar":"Does the One Who is Subtle, All-aware, and Who created all things not know all about them?","en.yusufali":"Should He not know,- He that created? and He is the One that understands the finest mysteries (and) is well-acquainted (with them).","en.maududi":"Would He not know, He Who has created, when He is All-Subtle, All-Aware?","en.shakir":"Does He not know, Who created? And He is the Knower of the subtleties, the Aware.","en.itani":"Would He not know, He Who created? He is the Refined, the Expert.","en.mubarakpuri":"Should not He Who has created know And He is the Most Kind and Courteous, All-Aware.","en.qarai":"Would He who has created not know? And He is the All-attentive, the All-aware.","en.wahiduddin":"How could He who created not know His own creation, when He alone is the Most Subtle in His wisdom and the All Aware?"},"tafsir":{"ar.muyassar":"ألا يعلم ربُّ العالمين خَلْقه وشؤونهم، وهو الذي خَلَقهم وأتقن خَلْقَهُمْ وأحسنه؟ وهو اللطيف بعباده، الخبير بهم وبأعمالهم.","ar.jalalayn":"«ألا يعلم من خلق» ما تسرون أي، أينتفي علمه بذلك «وهو اللطيف» في علمه «الخبير» فيه.","ar.qurtubi":"ثم قال : ألا يعلم من خلق يعني ألا يعلم السر من خلق [ ص: 198 ] السر . يقول أنا خلقت السر في القلب أفلا أكون عالما بما في قلوب العباد . وقال أهل المعاني : إن شئت جعلت \" من \" اسما للخالق جل وعز ; ويكون المعنى : ألا يعلم الخالق خلقه . وإن شئت جعلته اسما للمخلوق ، والمعنى : ألا يعلم الله من خلق . ولا بد أن يكون الخالق عالما بما خلقه وما يخلقه . قال ابن المسيب : بينما رجل واقف بالليل في شجر كثير وقد عصفت الريح فوقع في نفس الرجل : أترى الله يعلم ما يسقط من هذا الورق ؟ فنودي من جانب الغيضة بصوت عظيم : ألا يعلم من خلق وهو اللطيف الخبيروقال الأستاذ أبو إسحاق الإسفراييني : من أسماء صفات الذات ما هو للعلم ; منها \" العليم \" ومعناه تعميم جميع المعلومات . ومنها \" الخبير \" ويختص بأن يعلم ما يكون قبل أن يكون . ومنها \" الحكيم \" ويختص بأن يعلم دقائق الأوصاف . ومنها \" الشهيد \" ويختص بأن يعلم الغائب والحاضر ومعناه أن لا يغيب عنه شيء ،ومنها الحافظ ويختص بأنه لا ينسى . ومنها \" المحصي \" ويختص بأنه لا تشغله الكثرة عن العلم ; مثل ضوء النور واشتداد الريح وتساقط الأوراق ; فيعلم عند ذلك أجزاء الحركات في كل ورقة . وكيف لا يعلم وهو الذي يخلق ! وقد قال : ألا يعلم من خلق وهو اللطيف الخبير .\n","ar.miqbas":"أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ (14)وجملة { ألا يعلم من خلق } استئناف بياني ناشىء عن قوله : { إنه عليم بذات الصدور } بأن يسأل سائل منهم : كيف يعلم ذات الصدور ، والمعروف أن ما في نفس المرء لا يعلمه غير نفسه؟ فأجيبوا بإنكار انتفاء علمه تعالى بما في الصدور فإنه خالق أصحاب تلك الصدور ، فكما خلقهم وخلق نفوسهم جعل اتصالاً لتعلق علمه بما يختلج فيها وليس ذلك بأعجب من علم أصحاب الصدور بما يدور في خَلدها ، فالإِتيان ب { مَن } الموصولة لإِفادة التعليل بالصلة .فيجوز أن يكون { مَن خَلَق } مفعول { يعلم } فيكون { يعلم } و { خلَق } رافعين ضميرين عائديْن إلى ما عاد إليه ضمير { إنه عليم بذات الصدور } ، فيكون { مَن } الموصولة صادقة على المخلوقين وحُذف العائد من الصلة لأنه ضمير نصب يكثر حذفه . والتقدير : من خلقهم .ويجوز أن يكون { من خلق } فاعل { يعلم } والمراد الله تعالى ، وحُذف مفعول { يعلم } لدلالة قوله : { وأسروا قولَكم أو اجهروا به } . والتقدير : ألا يعلم خالقكم سركم وجهركم وهو الموصوف بلطيف خبير .والعلم يتعلق بذوات الناس وأحوالهم لأن الخلق إيجاد وإيجاد الذوات على نظام مخصوص دالٌ على إرادة ما أودع فيه من النظام وما ينشأ عن قوى ذلك النظام ، فالآية دليل على عموم علمه تعالى ولا دلالة فيها على أنه تعالى خالق أفعال العباد للانفكاك الظاهر بين تعلق العلم وتعلق القدرة .وجملة { وهو اللطيف الخبير } الأحسن أن تجعل عطفاً على جملة { ألا يعلم من خلق } لتفيد تعليماً للناس بأن علم الله محيط بذوات الكائنات وأحوالها فبعد أن أنكر ظنهم انتفاء على الله بما يسرون ، أعلمهم أنه يعلم ما هو أعم من ذلك وما هو أخفى من الإِسرار من الأحوال .و { اللطيف } : العالم خبايا الأمور والمدبر لها برفق وحكمة .و { الخبير } : العليم الذي لا تعزب عنه الحوادثُ الخفية التي من شأنها أن يخبر الناس بعضهم بعضاً بحدوثها فلذلك اشتق هذا الوصف من مادة الخبر ، وتقدم عند قوله تعالى : { وهو يدرك الأبصار وهو اللطيف الخبير } في الأنعام ( 103 ) وعند قوله : { إن الله لطيف خبير } في سورة لقمان ( 16 ) .\n","ar.waseet":"ثم أكد - سبحانه - شمول علمه لكل شئ بقوله : ( أَلاَ يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللطيف الخبير ) .واللطيف من اللطف ، وهو العالم بخبايا الأمور ، والمدبر لها برفق وحكمة ويسر . .والخبير : من الخُبْر ، وهو العلم بجزئيات الأشياء الخفية ، التى من شأنها أن يخبر الناس بعضهم بعضا بحدوثها ، لأنها كانت خافية عليهم .ولفظ ( من ) فى قوله ( مَنْ خَلَقَ ) يصح أن يكون مفعولا لقوله ( يَعْلَمُ ) ، والعائد محذوف أى : ألا يعلم الله - تعالى - شأن الذين خلقهم ، والحال أنه - سبحانه - هو الذى لطف علمه ودق ، إذ هو المدبر لأمور خلقه برفق وحكمة ، العليم علما تاما بأسرار النفوس وخبايا ما توسوس به ..ويجوز أن يكون ( من ) فاعلا لقوله ( يعلم ) على أن المقصود به ذاته - تعالى - ويكون مفعول يعلم محذوفا للعلم به ، والمعنى : ألا يعلم السر ومضمرات القلوب الله الذى خلق كل شئ وأوجده - وهو - سبحانه - الموصوف بأنه لطيف خبير .والاستفهام على الوجهين لإِنكار ما زعمه المشركون من انتفاء علمه - تعالى - بما يسرونه فيما بينهم ، حيث قال بعضهم لبعض : أسروا قولكم كى لا يسمعه رب محمد .\n","ar.baghawi":"فقال الله - جل ذكره - : ( ألا يعلم من خلق ) ألا يعلم ما في الصدور من خلقها ( وهو اللطيف الخبير ) لطيف علمه في القلوب الخبير بما فيها من الخير والشر والوسوسة . وقيل \" من \" يرجع إلى المخلوق ، أي ألا يعلم الله مخلوقه ؟\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5255.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5255.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5255.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"هُوَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ ذَلُولًا فَامْشُوا فِي مَنَاكِبِهَا وَكُلُوا مِنْ رِزْقِهِ ۖ وَإِلَيْهِ النُّشُورُ","transliteration":"Huwal lazee ja'ala lakumul arda zaloolan famshoo fee manaakibihaa wa kuloo mir rizqihee wa ilaihin nushoor","translations":{"en.ahmedali":"It is He who made the earth subservient to you that you may travel all around it, and eat of things He has provided; and to Him will be your resurrection.","en.ahmedraza":"It is He Who subjected the earth for you, therefore tread its paths and eat from Allah’s sustenance; and towards Him is the resurrection.","en.arberry":"It is He who made the earth submissive to you; therefore walk in its tracts, and eat of His provision; to Him is the Uprising.","en.asad":"He it is who has made the earth easy to live upon: go about, then, in all its regions, and partake the sustenance which He provides: but [always bear in mind that] unto Him you shall be resurrected.","en.daryabadi":"He it is Who hath made the earth Unto you subservient, so go forth in the regions thereof, and eat of His provision. And Unto Him is the Resurrection.","en.hilali":"He it is, Who has made the earth subservient to you (i.e. easy for you to walk, to live and to do agriculture on it, etc.), so walk in the path thereof and eat of His provision, and to Him will be the Resurrection.","en.pickthall":"He it is Who hath made the earth subservient unto you, so Walk in the paths thereof and eat of His providence. And unto Him will be the resurrection (of the dead).","en.qaribullah":"It is He who has made the earth submissive to you. Walk about in its land and eat of His provision. To Him is the Resurrection.","en.sahih":"It is He who made the earth tame for you - so walk among its slopes and eat of His provision - and to Him is the resurrection.","en.sarwar":"It is He who has made the earth subservient to you. You walk through its vast valleys and eat of its sustenance. Before Him you will all be resurrected.","en.yusufali":"It is He Who has made the earth manageable for you, so traverse ye through its tracts and enjoy of the Sustenance which He furnishes: but unto Him is the Resurrection.","en.maududi":"He it is Who made the earth subservient to you. So traverse in its tracks and partake of the sustenance He has provided. To Him will you be resurrected.","en.shakir":"He it is Who made the earth smooth for you, therefore go about in the spacious sides thereof, and eat of His sustenance, and to Him is the return after death.","en.itani":"It is He who made the earth manageable for you, so travel its regions, and eat of His provisions. To Him is the Resurgence.","en.mubarakpuri":"He it is Who has made the earth subservient to you; so walk in the paths thereof and eat of His provision. And to Him will be the resurrection.","en.qarai":"It is He who made the earth tractable for you; so walk on its flanks and eat of His provision, and towards Him is the resurrection.","en.wahiduddin":"It is He who has made the earth subservient to you, so traverse its regions and eat its provisions. To Him you shall all be resurrected."},"tafsir":{"ar.muyassar":"الله وحده هو الذي جعل لكم الأرض سهلة ممهدة تستقرون عليها، فامشوا في نواحيها وجوانبها، وكلوا من رزق الله الذي يخرجه لكم منها، وإليه وحده البعث من قبوركم للحساب والجزاء. وفي الآية إيماء إلى طلب الرزق والمكاسب، وفيها دلالة على أن الله هو الإله الحق وحده لا شريك له، وعلى قدرته، والتذكير بنعمه، والتحذير من الركون إلى الدنيا.","ar.jalalayn":"«هو الذي جعل لكم الأرض ذلولا» سهلة للمشي فيها «فامشوا في مناكبها» جوانبها «وكلوا من رزقه» المخلوق لأجلكم «وإليه النشور» من القبور للجزاء.","ar.qurtubi":"قوله تعالى : هو الذي جعل لكم الأرض ذلولا فامشوا في مناكبها وكلوا من رزقه وإليه النشورقوله تعالى : هو الذي جعل لكم الأرض ذلولا أي سهلة تستقرون عليها . والذلول المنقاد الذي يذل لك والمصدر الذل وهو اللين والانقياد . أي لم يجعل الأرض بحيث يمتنع المشي فيها بالحزونة والغلظة . وقيل : أي ثبتها بالجبال لئلا تزول بأهلها ; ولو كانت تتكفأ متمائلة لما كانت منقادة لنا . وقيل : أشار إلى التمكن من الزرع والغرس وشق العيون والأنهار وحفر الآبار .فامشوا في مناكبها هو أمر إباحة ، وفيه إظهار الامتنان . وقيل : هو خبر بلفظ الأمر ; أي لكي تمشوا في أطرافها ونواحيها وآكامها وجبالها . وقال ابن عباس وقتادة وبشير بن كعب : في مناكبها في جبالها . وروي أن بشير بن كعب كانت له سرية فقال لها : إن أخبرتني ما مناكب الأرض فأنت حرة ؟ فقالت : مناكبها جبالها . فصارت حرة ، فأراد أن يتزوجها [ ص: 199 ] فسأل أبا الدرداء فقال : دع ما يريبك إلى ما لا يريبك . مجاهد : في أطرافها . وعنه أيضا : في طرقها وفجاجها . وقاله السدي والحسن . وقال الكلبي : في جوانبها . ومنكبا الرجل : جانباه . وأصل المنكب الجانب ; ومنه منكب الرجل . والريح النكباء . وتنكب فلان عن فلان . يقول : امشوا حيث أردتم فقد جعلتها لكم ذلولا لا تمتنع . وحكى قتادة عن أبي الجلد أن الأرض أربعة وعشرون ألف فرسخ ; فللسودان اثنا عشر ألفا ، وللروم ثمانية آلاف ، وللفرس ثلاثة آلاف ، وللعرب ألف .وكلوا من رزقه أي مما أحله لكم ; قاله الحسن . وقيل : مما أتيته لكم .وإليه النشور المرجع . وقيل : معناه أن الذي خلق السماء لا تفاوت فيها ، والأرض ذلولا قادر على أن ينشركم .\n","ar.miqbas":"هُوَ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ ذَلُولًا فَامْشُوا فِي مَنَاكِبِهَا وَكُلُوا مِنْ رِزْقِهِ وَإِلَيْهِ النُّشُورُ (15)استئناف فيه عود إلى الاستدلال ، وإدماج للامتنان ، فإن خلق الأرض التي تحوي الناس على وجهها أدل على قدرة الله تعالى وعلمه من خلق الإِنسان إذ ما الإِنسان إلاّ جزء من الأرض أو كجزء منها قال تعالى : { منها خلقناكم } [ طه : 55 ] ، فلما ضَرب لهم بخلق أنفسهم دليلاً على علمه الدال على وحدانيته شفَّعه بدليل خلق الأرض التي هم عليها ، مع المنة بأنه خلقها هيّنة لهم صالحة للسير فيها مخرِجة لأرزاقهم ، وذُيّل ذلك بأن النشور منها وأن النشور إليه لا إلى غيره .والذَّلول من الدواب المنقادة المطاوعة ، مشتق من الذل وهو الهوان والانقياد ، فَعول بمعنى فاعل يستوي فيه المذكر والمؤنث ، وتقدم في قوله تعالى : { إنها بقرة لا ذلول } الآية في سورة البقرة ( 71 ) ، فاستعير الذلول للأرض في تذليل الانتفاع بها مع صلابة خلقتها تشبيهاً بالدابة المسوسة المرتاضة بعد الصعوبة على طريقة المصرحة .والمناكب : تخييل للاستعارة لزيادة بيان تسخير الأرض للناس فإن المنكب هو ملتقى الكتف مع العضد ، جعل المناكب استعارة لأطراف الأرض أو لسعتها .وفُرع على هذه الاستعارة الأمر في فامشوا في مناكبها } فصيغة الأمر مستعملة في معنى الإِدامة تذكيراً بما سخّر الله لهم من المشي في الأرض امتناناً بذلك .ومناسبة { وكلوا من رزقه } أن الرزق من الأرض . والأمر مستعمل في الإِدامة أيضاً للامتنان ، وبذلك تمت استعارة الذلول للأرض لأن فائدة تذليل الذلول ركوبها والأكل منها . فالمشي على الأرض شبيه بركوب الذلول ، والأكلُ مما تنبته الأرض شبيه بأكل الألبان والسمن وأكل العجول والخرفان ونحو ذلك . وجمع المناكب تجريد للاستعارة لأن الذلول لها منكبان والأرض ذات متسعات كثيرة .وكل هذا تذكير بشواهد الربوبية والإِنعام ليتدبروا فيتركوا العناد ، قال تعالى : { كذلك يتم نعمته عليكم لعلكم تسلمون } [ النحل : 81 ] .وأما عطف { وإليه النشور } فهو تتميم وزيادة عبر استطرون لمناسبة ذكر الأرض فإنها مثوى الناس بعد الموت .والمعنى : إليه النشور منها ، وذلك يقتضي حذفاً ، أي وفيها تعودون .وتعريف { النشور } تعريف الجنس فيعم أي كل نشور ، ومنه نشور المخاطبين فكان قوله : { وإليه النشور } بمنزلة التذييل .والقصر المستفاد من تعريف جزأي { هو الذي جعل لكم الأرض } قصر قلب بتنزيل المخاطبين منزلة من يعتقد أن الأصنام خلقت الأرض لأن اعتقادهم إلهيتها يقتضي إلزامهم بهذا الظن الفاسد وإن لم يقولوه .وتقديم المجرور في جملة { وإليه النشور } للاهتمام .ومناسبة ذكر النشور هو ذكر خلق الأرض فإن البعث يكون من الأرض .\n","ar.waseet":"ثم ذكر - سبحانه - جانبا من مظاهر فضله على عباده فقال : ( هُوَ الذي جَعَلَ لَكُمُ الأرض ذَلُولاً فامشوا فِي مَنَاكِبِهَا وَكُلُواْ مِن رِّزْقِهِ وَإِلَيْهِ النشور ) .والذلول : السهلة المذللة المسخرة لما يراد منها؛ من مَشْى عليها ، أو غَرْس فيها ، أو بناء فوقها . . من الذِّل وهو سهولة الانقياد للغير ، ومنه قوله - تعالى - : ( قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لاَّ ذَلُولٌ . . . ) أى : غير مذللة ولا مدربة على حرث الأرض . .والأمر فى قوله ( فامشوا فِي مَنَاكِبِهَا ) للإباحة ، والمناكب جمع منكب وهو ملتقى الكتف مع العضد والمراد به هنا : جوانبها أو طرقها وفجاجها أو أطرافها . .وهو مثل لفرط التذليل ، وشدة التسخير . .أى : هو - سبحانه - الذى جعل لكم - لفضله ورحمته - الأرض المتسعة الأرجاء ، مذللة مسخرة لكم ، لتتمكنوا من الانتفاع بها عن طريق المشى عليها ، أو البناء فوقها . أو غرس النبات فيها . .وما دام الأمر كذلك فامشوا فى جوانبها وأطرافها وفجاجها . . ملتمسين رزق ربكم فيها وداوموا على ذلك ، ففى الحديث الشريف : \" التمسوا الرزق فى خبايا الأرض \" .والمراد بقوله : ( وَكُلُواْ مِن رِّزْقِهِ ) الانتفاع بما فيها من وجوه النعم ، وعبر عنه بالأكل لأنه أهم وجوه الانتفاع .فالآية الكريمة دعوة حارة للمسلمين لكى ينتفعوا بما فى الأرض من كنوز ، حتى يستغنوا عن غيرهم فى مطعمهم ومشربهم وملبسهم وسائر أمور معاشهم . . فإنه بقدر تقصيرهم فى استخراج كنوزها ، تكون حاجتهم لغيرهم .قال بعض العلماء : قال الإِمام النووى فى مقدمة المجموع : إن على الأمة الإِسلامية أن تعمل على استثمار وإنتاج كل حاجاتها حتى الإبرة ، لتستغنى عن غيرها ، وإلا احتاجت إلى الغير بقدر ما قصرت فى الإِنتاج . .وقد أعطى الله - تعالى - العالم الإِسلامى الأولوية فى هذا كله ، فعليهم أن يحتلوا مكانهم ، ويحافظوا على مكانتهم ، ويشيدوا كيانهم بالدين والدنيا معا . .وقد أفاض بعض العلماء فى بيان معنى قوله - تعالى - : ( هُوَ الذي جَعَلَ لَكُمُ الأرض ذَلُولاً . . ) فقال ما ملخصه : والناس لطول إلفهم لحياتهم على هذه الأرض وسهولة استقرارهم عليها .. ينسون نعمة الله فى تذليلها لهم وتسخيرها ، والقرآن يذكرهم هذه النعمة الهائلة ، ويبصرهم بها ، فى هذا التعبير الذى يدرك منه كل أحد ، وكل جيل ، ما ينكشف له من علم هذه الأرض الذلول . .والله - تعالى - جعل الأرض ذلولا للبشر من حيث جاذبيتها . . ومن حيث سطحها . . ومن حيث تكوينها ، ومن حيث إحاطة الهواء بها . . ومن حيث حجمها . .وقوله : ( وَإِلَيْهِ النشور ) معطوف على ما قبله ، لبيان أن مصيرهم إليه - تعالى - بعد قضائهم فى الأرض المذللة لهم ، مدة حياتهم . .أى : وإليه وحده مرجعكم ، وبعثكم من قبوركم ، بعد أن قضيتم على هذه الأرض ، الأجل الذى قدره - سبحانه - لكم .\n","ar.baghawi":"( هو الذي جعل لكم الأرض ذلولا ) سهلا لا يمتنع المشي فيها بالحزونة ( فامشوا في مناكبها ) قال ابن عباس وقتادة : في جبالها . وقال الضحاك : في آكامها . وقال مجاهد : في طرقها وفجاجها . قال الحسن : في سبلها . وقال الكلبي : في أطرافها . وقال مقاتل : في نواحيها . قال الفراء : في جوانبها والأصل في الكلمة الجانب ، ومنه منكب الرجل والريح النكباء وتنكب فلان [ أي جانب ] ( وكلوا من رزقه ) مما خلقه رزقا لكم في الأرض . ( وإليه النشور ) أي : وإليه تبعثون من قبوركم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5256.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5256.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5256.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"أَأَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذَا هِيَ تَمُورُ","transliteration":"'A-amintum man fissamaaa'i aiyakhsifa bi kumul arda fa izaa hiya tamoor","translations":{"en.ahmedali":"Are you so unafraid that He who is in Heaven will not open up the earth to swallow you, when it will begin to tremble?","en.ahmedraza":"Have you become unafraid of the One Who controls the heavens, that He will not cause you to sink into the earth when it trembles?","en.arberry":"Do you feel secure that He who is in heaven will not cause the earth to swallow you, the while it rocks?","en.asad":"Can you ever feel secure that He who is in heaven will not cause the earth to swallow you up when, lo and behold, it begins to quake?","en.daryabadi":"Are ye secure that He who is in the heaven will not sink the earth with you and then it should quake?","en.hilali":"Do you feel secure that He, Who is over the heaven (Allah), will not cause the earth to sink with you, then behold it shakes (as in an earthquake)?","en.pickthall":"Have ye taken security from Him Who is in the heaven that He will not cause the earth to swallow you when lo! it is convulsed?","en.qaribullah":"Do you feel secure that He who is in the heaven will not cause the earth to swallow you up while it shakes?","en.sahih":"Do you feel secure that He who [holds authority] in the heaven would not cause the earth to swallow you and suddenly it would sway?","en.sarwar":"Do you feel secure that the One in the heavens will not cause you to sink into the earth when it is violently shaking?","en.yusufali":"Do ye feel secure that He Who is in heaven will not cause you to be swallowed up by the earth when it shakes (as in an earthquake)?","en.maududi":"Do you feel secure that He Who is in the heaven will not cause the earth to cave in with you, and then suddenly it will begin to rock violently?","en.shakir":"Are you secure of those in the heaven that He should not make the earth to swallow you up? Then lo! it shall be in a state of commotion.","en.itani":"Are you confident that the One in heaven will not cause the earth to collapse beneath you as it spins?","en.mubarakpuri":"Do you feel secure that He, Who is over the heaven, will not cause the earth to sink with you, and then it should quake","en.qarai":"Are you secure that He who is in the sky will not make the earth swallow you while it quakes?","en.wahiduddin":"Do you feel secure that He who is in heaven will not cause the earth to sink beneath you and then begin to quake?"},"tafsir":{"ar.muyassar":"هل أمنتم- يا كفار \"مكة\"- الله الذي فوق السماء أن يخسف بكم الأرض، فإذا هي تضطرب بكم حتى تهلكوا؟ هل أمنتم الله الذي فوق السماء أن يرسل عليكم ريحا ترجمكم بالحجارة الصغيرة، فستعلمون- أيها الكافرون- كيف تحذيري لكم إذا عاينتم العذاب؟ ولا ينفعكم العلم حين ذلك. وفي الآية إثبات العلو لله تعالى، كما يليق بجلاله سبحانه.","ar.jalalayn":"«أأمنتم» بتحقيق الهمزتين وتسهيل الثانية وإدخال ألف بينهما وبين الأخرى وتركه وإبدالها ألفا «من في السماء» سلطانه وقدرته «أن يخسف» بدل من مَن «بكم الأرض فإذا هي تمور» تتحرك بكم وترتفع فوقكم.","ar.qurtubi":"قوله تعالى : أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمورقال ابن عباس : أأمنتم عذاب من في السماء إن عصيتموه . وقيل : تقديره أأمنتم من في السماء قدرته وسلطانه وعرشه ومملكته . وخص السماء وإن عم ملكه تنبيها على أن الإله الذي تنفذ قدرته في السماء لا من يعظمونه في الأرض . وقيل : هو إشارة إلى الملائكة . وقيل : إلى جبريل وهو الملك الموكل بالعذاب .قلت : ويحتمل أن يكون المعنى : أأمنتم خالق من في السماء أن يخسف بكم الأرض كما خسفها بقارون .فإذا هي تمور أي تذهب وتجيء . والمور : الاضطراب بالذهاب والمجيء . قال الشاعر :رمين فأقصدن القلوب ولن ترى دما مائرا إلا جرى في الحيازمجمع حيزوم وهو وسط الصدر . وإذا خسف بإنسان دارت به الأرض فهو المور . وقال المحققون : أمنتم من فوق السماء ; كقوله : فسيحوا في الأرض أي فوقها لا بالمماسة والتحيز لكن بالقهر والتدبير . وقيل : معناه أمنتم من على السماء ; كقوله تعالى : ولأصلبنكم في جذوع النخل أي عليها . ومعناه أنه مديرها ومالكها ; كما يقال : فلان على العراق والحجاز ; أي واليها وأميرها . والأخبار في هذا الباب كثيرة صحيحة منتشرة ، مشيرة إلى العلو ; [ ص: 200 ] لا يدفعها إلا ملحد أو جاهل معاند . والمراد بها توقيره وتنزيهه عن السفل والتحت . ووصفه بالعلو والعظمة لا بالأماكن والجهات والحدود لأنها صفات الأجسام . وإنما ترفع الأيدي بالدعاء إلى السماء لأن السماء مهبط الوحي ، ومنزل القطر ، ومحل القدس ، ومعدن المطهرين من الملائكة ، وإليها ترفع أعمال العباد ، وفوقها عرشه وجنته ; كما جعل الله الكعبة قبلة للدعاء والصلاة ، ولأنه خلق الأمكنة وهو غير محتاج إليها ، وكان في أزله قبل خلق المكان والزمان . ولا مكان له ولا زمان . وهو الآن على ما عليه كان . وقرأ قنبل عن ابن كثير \" النشور وامنتم \" بقلب الهمزة الأولى واوا وتخفيف الثانية . وقرأ الكوفيون والبصريون وأهل الشام سوى أبي عمرو وهشام بالتخفيف في الهمزتين ، وخفف الباقون . وقد تقدم جميعه .\n","ar.miqbas":"أَأَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذَا هِيَ تَمُورُ (16)انتقال من الاستدلال إلى التخويف لأنه لما تقرر أنه خالق الأرض ومذللها للناس وتقرر أنهم ما رعوا خالقها حق رعايته فقد استحقوا غضبه وتسليط عقابه بأن يُصيّر مشيهم في مناكب الأرض إلى تَجَلْجل في طبقات الأرض . فالجملة معترضة والاستفهام إنكار وتوبيخ وتحذير .و { مَن } اسم موصول وصلته صادِق على موجود ذي إدراك كائن في السماء . وظاهر وقوع هذا الموصول عقب جُمل { هو الذي جَعل لكم الأرض ذلولاً إلى قوله : { وإليه النشور } [ الملك : 15 ] أن الإتيان بالموصول من قبيل الإِظهار في مقام الإِضمار ، وأن مقتضى الظاهر أن يقال أأمنتموه أن يخسف بكم الأرض؛ فيتأتى أن الإِتيان بالموصول لِما تأذن به الصلة من عظيم تصرفه في العالم العلوي الذي هو مصدر القُوى والعناصر وعجائب الكائنات فيصير قوله : { من في السماء } في الموضعين من قبيل المتشابه الذي يعطي ظاهره معنى الحلول في مكان وذلك لا يليق بالله ، ويجيء فيه ما في أمثاله من طريقتي التفويض للسلف والتأويل للخلَف رحمهم الله أجمعين .وقد أوَّلوه بمعنى : من في السماء عذابُه أو قدرتُه أو سلطانه على نحو تأويل قوله تعالى : { وجاء ربك } [ الفجر : 22 ] وأمثاله ، وخُص ذلك بالسماء لأن إثباته لله تعالى ينفيه عن أصنامهم .ولكن هذا الموصول غير مَكين في باب المتشابه لأنه مجمل قابل للتأويل بما يَحتمله { من } أن يَكون مَا صْدَقُه مخلوقات ذات إدراك مقرها السماء وهي الملائكة فيصح أن تصدق { مَن } على طوائف من الملائكة الموكلين بالأمر التكويني في السماء والأرض قال تعالى : { يتنزل الأمر بينهن } [ الطلاق : 12 ] ، ويصح أن يراد باسم الموصل ملك واحد معيَّن وظيفته فعل هذا الخسف ، فقد قيل : إن جبريل هو الملَك الموكّل بالعذاب .وإسناد فعل { يخسف } إلى «الملائكة» أو إلى واحد منهم حقيقة لأنه فاعل الخسف قال تعالى حكاية عن الملائكة { قالوا إنا مهلكوا أهل هذه القرية . . . إنا مُنجوك وأهلك . . . إنَّا منزلون على أهل هذه القرية رجزاً من السماء } [ العنكبوت : 31 34 ] .وإفراد ضمير { يخسف } مراعاة للفظ { مَن } إذا أريد طائفة من الملائكة أو مراعاة للفظ والمعنى إذا كان ما صْدق { مَن } ملكاً واحداً .والمعنى : توبيخهم على سوء معاملتهم ربهم كأنهم آمنون من أن يَأمر الله ملائكته بأن يخسفوا الأرض بالمشركين .والخسف : انقلاب ظاهر السطح من بعض الأرض باطناً وباطنه ظاهراً وهو شدة الزلزال .وفعل خسف يستعمل قاصراً ومتعدياً وهو من باب ضرب ، وتقدم عند قوله تعالى : { أفأمن الذين مكروا السيئات أن يخسف الله بهم الأرض } سورة النحل ( 45 ) .والباء في قوله : بكم } للمصاحبة ، أي يخسف الأرض مصاحبة لذواتكم . وفي الجمع بين السماء والأرض محسّن الطباق .والمصدر المُنسبك من { أن يخسف } يجوز أن يكون بدل اشتمال من اسم الموصول لأن الخسف من شأن مَن في السماء ، ويجوز أن يكون منصوباً على نزع الخافض وهو مطّرد مع { أنْ } ، والخافض المحذوف حرف ( مِن ) .وفُرع على الخسف المتوقع المهدد به أن تمور الأرضُ تفريعَ الأثر على المؤثر لأن الخسف يحدث المَور ، فإذا خسفت الأرض فاجأها المَور لا محالة ، لكن نظم الكلام جرى على مَا يناسبُ جعل التهديد بمنزلة حادث وقع فلذلك جيء بعده بالحرف الدال على المفاجأة لأن حق المفاجأة أن تكون حاصلة زمن الحال لا الاستقبال كما في «مغني اللبيب» فإذا أريد تحقيق حصول الفعل المستقبل نُزل منزلة الواقع في الحال كقوله تعالى : { ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون } [ الروم : 25 ] ، وإذا أريد استحضار حالة فعل حصل فيما مضى نُزل كذلك منزلة المشاهد في الحال كقوله تعالى : { وإذا أذقنا الناس رحمة من بعد ضراء مستهم إذا لهم مكر في آياتنا } [ يونس : 21 ] ، فكان قوله : { فإذا هي تمور } مؤذناً بتشبيه حالة الخسف المتوقع المهدد به بحالة خسف حصل بجامع التحقق كما قالوا في التعبير عن المستقبل بلفظ الماضي ، وحُذف المركب الدال على الحالة المشبه بها ورمز إليه بما هو من آثاره ويتفرع عنه فكان في الكلام تمثيلية مَكْنيّة .والمور : الارتجاج والاضطراب وتقدم في قوله تعالى : { يوم تمور السماء موراً } في سورة الطور ( 9 ) .\n","ar.waseet":"ثم حذر - سبحانه - من بطشه وعقابه فقال : ( أَأَمِنتُمْ مَّن فِي السمآء أَن يَخْسِفَ بِكُمُ الأرض فَإِذَا هِيَ تَمُورُ ) . .والخسف : انقلاب ظاهر السطح من بعض الأرض فصير باطنا ، والباطن ظاهرا . .والمَوْر : شدة الاضطراب والتحرك . يقال : مار الشئ مَوْرا ، إذا ارتج واضطرب ، والمراد بمن فى السماء : الله - عز وجل - بدون تحيز أو تشبيه أو حلول فى مكان .قال الإمام الآلوسى : قوله : ( أَأَمِنتُمْ مَّن فِي السمآء ) وهو الله - عز وجل - كما ذهب إليه غير واحد ، فقيل على تأويل : من فى السماء أمره وقضاؤه ، يعنى أنه من التجوز فى الإِسناد ، أو أن فيه مضافا مقدرا ، وأصله : من فى السماء أمره ، فلما حذف وأقيم المضاف إليه مقامه ارتفع واستتر ، وقيل على تقدير : خالق من فى السماء . .وقيل فى بمعنى على ، ويراد العلو بالقهر والقدرة . .وأئمة السلف لم يذهبوا إلى غيره - والآية عندهم من المتشابه وقد قال صلى الله عليه وسلم آمنوا بمتشابهه ولم يقل أولوه . فهم مؤمنون بأنه - عز وجل - فى السماء : على المعنى الذى أراده - سبحانه - مع كمال التنزيه . وحديث الجارية - التى قال لها الرسول صلى الله عليه وسلم أين الله؟ فأشارت إلى السماء - من أقوى الأدلة فى هذا الباب . وتأويله بما أول به الخلف ، خروج عن دائرة الإِنصاف عند ذوى الألباب . .والمعنى : أأمنتم - أيها الناس - من فى السماء وهو الله - عز وجل - أن يذهب الأرض بكم ، فيجعل أعلاها أسفلها . . فإذا هى تمور بكم وتضطرب ، وترتج ارتجاجا شديدا تزول معه حياتكم .فالمقصود بالآية الكريمة تهديد الذين يخالفون أمره ، بهذا العذاب الشديد ، وتحذيرهم من نسيان بطشه وعقابه .والباء فى قوله ( بِكُم ) للمصاحبة . أى : يخسفها وأنتم مصاحبون لها بذواتكم ، بعد أن كانت مذللة ومسخرة لمنفعتكم . .\n","ar.baghawi":"ثم خوف الكفار فقال:  ثم خوف الكفار فقال : ( أأمنتم من في السماء ) قال ابن عباس : أي : عذاب من في السماء إن عصيتموه ( أن يخسف بكم الأرض فإذا هي تمور ) قال الحسن : تتحرك بأهلها . وقيل : تهوي بهم . والمعنى : أن الله تعالى يحرك الأرض عند الخسف بهم حتى تلقيهم إلى أسفل ، تعلو عليهم وتمر فوقهم . يقال : مار يمور ، أي : جاء وذهب .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5257.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5257.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5257.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"أَمْ أَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا ۖ فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ","transliteration":"Am amintum man fissamaaa'i ai yursila 'alaikum haasiban fasata'lamoona kaifa nazeer","translations":{"en.ahmedali":"Or have you become so unafraid that He who is in Heaven will not send a violent wind to shower stones at you? Then you will know the import of My commination!","en.ahmedraza":"Or have you become unafraid of the One Who controls the heavens, that He will not send a torrent of stones upon you? So now you will realise, how My warning turned out!","en.arberry":"Do you feel secure that He who is in heaven will not loose against you a squall of pebbles, then you shall know how My warning is?","en.asad":"Or can you ever feel secure that He who is in heaven will not let loose against you a deadly stormwind, whereupon you would come to know how [true] My warning was?","en.daryabadi":"Or are ye secure that He Who is in the heaven will not send against you a whirlwind? Anon ye shall know what wise hath been My warning.","en.hilali":"Or do you feel secure that He, Who is over the heaven (Allah), will not send against you a violent whirlwind? Then you shall know how (terrible) has been My Warning?","en.pickthall":"Or have ye taken security from Him Who is in the heaven that He will not let loose on you a hurricane? But ye shall know the manner of My warning.","en.qaribullah":"Do you feel secure that He who is in the heaven will not loose against you a squall of pebbles then you shall know how was My warning.","en.sahih":"Or do you feel secure that He who [holds authority] in the heaven would not send against you a storm of stones? Then you would know how [severe] was My warning.","en.sarwar":"Do you feel secure that the One in the heavens will not strike you with a sandstorm? You will soon know, with the coming of the torment, how serious Our warning was.","en.yusufali":"Or do ye feel secure that He Who is in Heaven will not send against you a violent tornado (with showers of stones), so that ye shall know how (terrible) was My warning?","en.maududi":"Do you feel secure that He Who is in the heaven will not let loose upon you a storm of stones? Then shall you know what My warning is like!","en.shakir":"Or are you secure of those in the heaven that He should not send down upon you a punishment? Then shall you know how was My warning.","en.itani":"Or are you confident that the One in Heaven will not unleash against you a violent storm? Then you will know what My warning is like.","en.mubarakpuri":"Or do you feel secure that He, Who is over the heaven, will not send against you a Hasib Then you shall know how has been My warning.","en.qarai":"Are you secure that He who is in the sky will not unleash upon you a rain of stones? Soon you will know how My warning has been!","en.wahiduddin":"Do you feel secure that the One in heaven will not send against you a whirlwind to pelt you with stones, so that you will know how [true] My warning was?"},"tafsir":{"ar.muyassar":"هل أمنتم- يا كفار \"مكة\"- الله الذي فوق السماء أن يخسف بكم الأرض، فإذا هي تضطرب بكم حتى تهلكوا؟ هل أمنتم الله الذي فوق السماء أن يرسل عليكم ريحا ترجمكم بالحجارة الصغيرة، فستعلمون- أيها الكافرون- كيف تحذيري لكم إذا عاينتم العذاب؟ ولا ينفعكم العلم حين ذلك. وفي الآية إثبات العلو لله تعالى، كما يليق بجلاله سبحانه.","ar.jalalayn":"«أم أمنتم من في السماء أن يرسل» بدل من مَن «عليكم حاصبا» ريحا ترميكم بالحصباء «فستعلمون» عند معاينة العذاب «كيف نذير» إنذاري بالعذاب، أي أنه حق.","ar.qurtubi":"قوله تعالى : أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذيرقوله تعالى : أم أمنتم من في السماء أن يرسل عليكم حاصبا أي حجارة من السماء كما أرسلها على قوم لوط وأصحاب الفيل . وقيل : ريح فيها حجارة وحصباء . وقيل : سحاب فيه حجارة .فستعلمون كيف نذير أي إنذاري . وقيل : النذير بمعنى المنذر . يعني محمدا صلى الله عليه وسلم فستعلمون صدقه وعاقبة تكذيبكم .\n","ar.miqbas":"أَمْ أَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ (17){ أم } لإِضراب الانتقال من غرض إلى غرض ، وهو انتقال من الاستفهام الإِنكاري التعجيبي إلى آخر مثله باعتبار اختلاف الأثرين الصادرين عن مفعول الفعل المستفهَم عنه اختلافاً يوجب تفاوتاً بين كنهي الفعلين وإن كانا متحدين في الغاية ، فالاستفهام الأول إنكار على أمنهم الذي في السماء من أن يفعل فعلاً أرضياً .والاستفهام الواقع مع { أم } إنكار عليهم أن يأمنوا من أن يرسل عليهم من السماء حاصب وذلك أمكن لمن في السماء وأشد وقعاً على أهل الأرض . والكلام على قوله : { من في السماء } تقدم في الآية قبلها ما يغني عنه .وتفريع جملة { فستعلمون كيف نذير } على الاستفهام الإِنكاري كتفريع ملة { فإذا هي تمور } [ الملك : 16 ] أي فحين يُخسف بكم أو يرسل عليهم حَاصب تعلمون كيف نذيري ، وحرف التنفيس حقه الدخول على الأخبار التي ستقع في المستقبل ، وإرسال الحاصب غير مخبر بحصوله وإلاّ لَمَا تخلف لأن خبر الله لا يتخلف ، وإنما هو تهديد وتحذير فإنهم ربما آمنوا وأقلعوا فسلموا من إرسال الحاصب عليهم ولكن لما أريد تحقيق هذا التهديد شبه بالأمر الذي وقع فكان تفريع صيغة الإِخبار على هذا مؤذناً بتشبيه المهدد به بالأمر الواقع على طريقة التمثيلية المكنية ، وجملة { فستعلمون } قرينتها لأنها من روادف المشبه به كما تقدم .و { كيف نذير } ، استفهام مُعلِّق فعل ( تعلمون ) عن العمل ، وهو استفهام للتهديد والتهويل ، والجملة مستأنفة .وحذفت ياء المتكلم من { نذيري } تخفيفاً وللرعي على الفاصلة .والنذير مصدر بمعنى الإِنذار مثل النكير بمعنى الإِنكار .وقدم التهديد بالخسف على التهديد بالحاصب لأن الخسف من أحوال الأرض ، والكلام على أحوالها أقرب هنا فسُلك شبه طريق النشر المعكوس ، ولأن إرسال الحاصب عليهم جزاء على كفرهم بنعمة الله التي منها رزقهم في الأرض المشار إليه بقوله : { وكلوا من رزقه } [ الملك : 15 ] فإن منشأ الأرزاق الأرضية من غيوث السماء قال تعالى { وفي السماء رزقكم } [ الذاريات : 22 ] .\n","ar.waseet":"ثم انتقل - سبحانه - من تهديدهم بالخسف إلى تهديدهم بعذاب آخر فقال : ( أَمْ أَمِنتُمْ مِّن فِي السمآء أَن يُرْسِلَ عَلَيْكُمْ حَاصِباً فَسَتَعْلَمُونَ كَيْفَ نَذِيرِ ) .أى : بل أأمنتم - أيها الناس - من السماء ، وهو الله - عز وجل - بسلطانه وقدرته .. أن يرسل عليكم ( حَاصِباً ) أى : ريحا شديدة مصحوبة بالحصى والحجارة التى تهلك ، فحينئذ ستعلمون عند معاينتكم للعذاب ، كيف ان إنذارى لكم متحققا وواقعا وحقا . .فالاستفهام فى الآيتين المقصود به التعجيب من أمنهم عذاب الله - تعالى - عند مخالفتهم لأمره ، وخروجهم عن طاعته .وقدم - سبحانه - من تهديدهم بالخسف على التهديد بإرسال الحصب ، لأن الخسف من أحوال الأرض ، التى سبق أن بين لهم أنه خلقها مذللة لهم ، وفيها ما فيها من منافعهم ، فهذه المنافع ليس عسيرا على الله - تعالى - أن يحولها إلى عذاب لهم . . .\n","ar.baghawi":"( أم أمنتم من في السماء أن يرسل عليكم حاصبا ) ريحا ذات حجارة كما فعل بقوم لوط . ( فستعلمون ) في الآخرة وعند الموت ( كيف نذير ) أي إنذاري إذا عاينتم العذاب .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5258.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5258.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5258.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"وَلَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيرِ","transliteration":"Wa laqad kazzabal lazeena min qablihim fakaifa kaana nakeer","translations":{"en.ahmedali":"Those before them had also denied. And how was My punishment then!","en.ahmedraza":"And indeed those before them had denied – therefore how did My rejection turn out!","en.arberry":"Those that were before them also cried lies; then how was My horror!","en.asad":"And, indeed, [many of] those who lived aforetime did give the lie [to My warnings]: and how awesome was My rejection [of them]!","en.daryabadi":"And assuredly those before them belied; then what wise hath been My wrath!","en.hilali":"And indeed those before them belied (the Messengers of Allah), then how terrible was My denial (punishment)?","en.pickthall":"And verily those before them denied, then (see) the manner of My wrath (with them)!","en.qaribullah":"Those who have gone before you also belied (their Messengers) then how was My disapproval!","en.sahih":"And already had those before them denied, and how [terrible] was My reproach.","en.sarwar":"Those who lived before them had also rejected Our warning, and how terrible was Our retribution!","en.yusufali":"But indeed men before them rejected (My warning): then how (terrible) was My rejection (of them)?","en.maududi":"Those who came before them also gave the lie (to the Messengers): then how awesome was My chastisement!","en.shakir":"And certainly those before them rejected (the truth), then how was My disapproval.","en.itani":"Those before them also denied the truth; and how was My disapproval?","en.mubarakpuri":"And indeed those before them rejected, then how terrible was My reproach","en.qarai":"Certainly those who were before them had impugned [My apostles]; but then how was My rebuttal!","en.wahiduddin":"Those who went before them belied [the truth]: then how great was My rejection of them."},"tafsir":{"ar.muyassar":"ولقد كذَّب الذين كانوا قبل كفار \"مكة\" كقوم نوح وعاد وثمود رسلهم، فكيف كان إنكاري عليهم، وتغييري ما بهم من نعمة بإنزال العذاب بهم وإهلاكهم؟","ar.jalalayn":"«ولقد كذب الذين من قبلهم» من الأمم «فكيف كان نكير» إنكاري عليهم بالتكذيب عند إهلاكهم، أي أنه حق.","ar.qurtubi":"قوله تعالى : ولقد كذب الذين من قبلهم فكيف كان نكيرقوله تعالى : ولقد كذب الذين من قبلهم يعني كفار الأمم ; كقوم نوح وعاد وثمود وقوم لوط وأصحاب مدين وأصحاب الرس وقوم فرعونفكيف كان نكير أي إنكاري وقد تقدم . وأثبت ورش الياء في \" نذيري \" ، و \" نكيري \" في الوصل . وأثبتها يعقوب في الحالين . وحذف الباقون اتباعا للمصحف .\n","ar.miqbas":"وَلَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَكَيْفَ كَانَ نَكِيرِ (18)بعد أن وَجه الله إليهم الخطاب تذكيراً واستدلالاً وامتناناً وتهديداً وتهويلاً ابتداء من قوله : { وأسروا قولكم أو اجهروا به } [ الملك : 13 ] التفتَ عن خطابهم إلى الإِخبار عنهم بحالة الغيبة ، تعريضاً بالغضب عليهم بما أتوه من كل تكذيب الرسول صلى الله عليه وسلم فكانوا جديرين بإبعادهم عِزّ الحضور للخطاب ، فلذلك لم يقل ( ولقد كذب الذين من قبلكم ) ولم يقطع توجيه التذكير إليهم والوعيد لعلهم يتدبرون في أن الله لم يدخرهم نصحاً .فالجملة عطف على جملة { أم أمنتم مَن في السماء أن يرسل عليكم حاصباً } [ الملك : 17 ] لمناسبة أن مما عوقب به بعض الأمم المكذبين من خسف أو إرسال حجارة من السماء وهم قوم لوط ، ومنهم من خُسف بهم مثل أصحاب الرس .ولك أن تجعل الواو للحال ، أي كيف تأمنون ذلك عندما تكذبون الرسول في حال أنه قد كذب الذين من قبلكم فهل علمتم ما أصابهم على تكذيبهم الرسل .ضرب الله لهم مثلاً بأمم من قبلهم كذبوا الرسل فأصابهم من الاستئصال ما قد علموا أخباره لعلّهم أن يتّعظوا بقياس التمثيل إن كانت عقولهم لم تبلغ درجة الانتفاع بأقيسة الاستنتاج ، فإن المشركين من العرب عرفوا آثار عاد وثمود وتناقلوا أخبار قوم نوح وقوم لوط وأصحاب الرسّ وفرع { فكيف كان نكيرِ } استفهاماً تقريرياً وتنكيرياً وهو كناية عن تحقيق وقوعه وأنه وقع في حال فظاعة .وقد أكد الخبر باللام و ( قد ) لتنزيل المعرّض بهم منزلة من يظن أن الله عاقب الذين من قبلهم لغير جرم أو لجرم غير التكذيب . فهو مفرع على المؤكد ، فالمعنى : لقد كذب الذين من قبلهم ولقد كان نكيري عليهم بتلك الكيفية .و { نكير } ؛ أصله نكيري بالإضافة إلى ياء المتكلم المحذوفة تخفيفاً ، كما في قوله : { فستعلمون كيف نذير } [ الملك : 17 ] ، والمعنى : كيف رأيتم أثر نكيري عليهم فاعلموا أن نكيري عليكم صائر بكم إلى مثل ما صار بهم نكيري عليهم .والمراد بالنكير المنظر بنكير الله على الذين مِن قبلهم ، ما أفاده استفهام الإِنكار في قوله : { أأمنتم مَن في السماء أن يخسف بكم الأرض } [ الملك : 16 ] وقوله : { أم أمنتم مَن في السماء أن يرسل عليكم حاصباً } [ الملك : 17 ] .\n","ar.waseet":"ثم ذكرهم - سبحانه - بما جرى للكافرين السابقين فقال : ( وَلَقَدْ كَذَّبَ الذين مِن قَبْلِهِمْ فَكَيْفَ كَانَ نكِيرِ ) . .أى : ووالله لقد كذب الذين من قبل كفار مكة من الأمم السابقة ، كقوم نوح وعاد وثمود . . فكان إنكارى عليهم ، وعقابى لهم ، شديدا ومبيرا ومدمرا لهم تدميرا تاما .فالنكير بمعنى الإِنكار ، والاستفهام فى قوله : ( فَكَيْفَ كَانَ نكِيرِ ) للتهويل .أى : إن إنكارى عليهم كفرهم كان إنكارا عظيما ، لأنه ترتب عليه ، أن أخذتهم أخذ عزيز مقتدر .كما قال - تعالى - : ( فَكُلاًّ أَخَذْنَا بِذَنبِهِ فَمِنْهُم مَّن أَرْسَلْنَا عَلَيْهِ حَاصِباً وَمِنْهُمْ مَّنْ أَخَذَتْهُ الصيحة وَمِنْهُمْ مَّنْ خَسَفْنَا بِهِ الأرض وَمِنْهُمْ مَّنْ أَغْرَقْنَا وَمَا كَانَ الله لِيَظْلِمَهُمْ ولكن كانوا أَنفُسَهُمْ يَظْلِمُونَ )\n","ar.baghawi":"( ولقد كذب الذين من قبلهم ) يعني كفار الأمم الماضية ( فكيف كان نكير ) أي إنكاري عليهم بالعذاب .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5259.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5259.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5259.mp3","format":"mp3","local_path":null}}},{"verse":19,"arabic":"أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صَافَّاتٍ وَيَقْبِضْنَ ۚ مَا يُمْسِكُهُنَّ إِلَّا الرَّحْمَٰنُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ","transliteration":"Awalam yaraw ilat tairi fawqahum saaaffaatinw wa yaqbidn; maa yumsikuhunna illaar rahmaan; innahoo bikulli shai im baseer","translations":{"en.ahmedali":"Do they not see the birds above them flying wings spread out or folded? Nothing holds them aloft but God. All things are within His purview.","en.ahmedraza":"And did they not see the birds above them, spreading and closing their wings? None except the Most Gracious holds them up; indeed He sees all things.","en.arberry":"Have they not regarded the birds above them spreading their wings, and closing them? Naught holds them but the All-merciful. Surely He sees everything.","en.asad":"Have they, then, never beheld the birds above them, spreading their wings and drawing them in? None but the Most Gracious upholds them: for, verily, He keeps all things in His sight.","en.daryabadi":"Behold they not the birds above them, outstretching their wings and they also withdraw them? Naught holdeth them except the Compassionate. Verily He is of everything Beholder.","en.hilali":"Do they not see the birds above them, spreading out their wings and folding them in? None upholds them except the Most Beneficent (Allah). Verily, He is the All-Seer of everything.","en.pickthall":"Have they not seen the birds above them spreading out their wings and closing them? Naught upholdeth them save the Beneficent. Lo! He is Seer of all things.","en.qaribullah":"Do they not observe the birds above them, spreading their wings and folding them? None, except the Merciful holds them. Surely, He sees all things.","en.sahih":"Do they not see the birds above them with wings outspread and [sometimes] folded in? None holds them [aloft] except the Most Merciful. Indeed He is, of all things, Seeing.","en.sarwar":"Did they not see the birds above them, stretching out, and flapping their wings. No one keeps them up in the sky except the Beneficent God. He certainly watches over all things.","en.yusufali":"Do they not observe the birds above them, spreading their wings and folding them in? None can uphold them except (Allah) Most Gracious: Truly (Allah) Most Gracious: Truly it is He that watches over all things.","en.maududi":"Have they not seen birds above them spreading and closing their wings, with none holding them except the Merciful One? He oversees everything.","en.shakir":"Have they not seen the birds above them expanding (their wings) and contracting (them)? What is it that withholds them save the Beneficent Allah? Surely He sees everything.","en.itani":"Have they not seen the birds above them, spreading their wings, and folding them? None holds them except the Compassionate. He is Perceiver of everything.","en.mubarakpuri":"Do they not see the birds above them, spreading out their wings and folding them in None upholds them except the Most Gracious. Verily, He is the All-Seer of everything.","en.qarai":"Have they not regarded the birds above them spreading and closing their wings? No one sustains them except the All-beneficent. Indeed, He watches all things.","en.wahiduddin":"Do they not see the birds above them spreading and closing their wings? None save the Merciful sustains them. Surely, He observes all things."},"tafsir":{"ar.muyassar":"أغَفَل هؤلاء الكافرون، ولم ينظروا إلى الطير فوقهم، باسطات أجنحتها عند طيرانها في الهواء، ويضممنها إلى جُنوبها أحيانًا؟ ما يحفظها من الوقوع عند ذلك إلا الرحمن. إنه بكل شيء بصير لا يُرى في خلقه نقص ولا تفاوت. بل مَن هذا الذي هو في زعمكم- أيها الكافرون- حزب لكم ينصركم من غير الرحمن، إن أراد بكم سوءًا؟ ما الكافرون في زعمهم هذا إلا في خداع وضلال من الشيطان. بل مَن هذا الرازق المزعوم الذي يرزقكم إن أمسك الله رزقه ومنعه عنكم؟ بل استمر الكافرون في طغيانهم وضلالهم في معاندة واستكبار ونفور عن الحق، لا يسمعون له، ولا يتبعونه.","ar.jalalayn":"«أوَلم يروا» ينظروا «إلى الطير فوقهم» في الهواء «صافات» باسطات أجنحتهن «ويقبضن» أجنحتهن بعد البسط، أي وقابضات «ما يمسكهن» عن الوقوع في حال البسط والقبض «إلا الرحمن» بقدرته «إنه بكل شيء بصير» المعنى: ألم يستدلوا بثبوت الطير في الهواء على قدرتنا أن نفعل بهم ما تقدم وغيره من العذاب.","ar.qurtubi":"قوله تعالى : أولم يروا إلى الطير فوقهم صافات ويقبضن ما يمسكهن إلا الرحمن إنه بكل شيء بصير [ ص: 201 ] قوله تعالى : أولم يروا إلى الطير فوقهم صافات أي كما ذلل الأرض للآدمي ذلل الهواء للطيور . و \" صافات \" أي باسطات أجنحتهن في الجو عند طيرانها ; لأنهن إذا بسطنها صففن قوائمها صفا . ويقبضن أي يضربن بها جنوبهن . قال أبو جعفر النحاس : يقال للطائر إذا بسط جناحيه : صاف ، وإذا ضمهما فأصابا جنبه : قابض ; لأنه يقبضهما . قال أبو خراش :يبادر جنح الليل فهو موائل يحث الجناح بالتبسط والقبضوقيل : ويقبضن أجنحتهن بعد بسطها إذا وقفن من الطيران . وهو معطوف على صافات عطف المضارع على اسم الفاعل ; كما عطف اسم الفاعل على المضارع في قول الشاعر :بات يعشيها بعضب باتر     يقصد في أسوقها وجائرما يمسكهن أي ما يمسك الطير في الجو وهي تطير إلا الله عز وجل . إنه بكل شيء بصير .\n","ar.miqbas":"أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ صَافَّاتٍ وَيَقْبِضْنَ مَا يُمْسِكُهُنَّ إِلَّا الرَّحْمَنُ إِنَّهُ بِكُلِّ شَيْءٍ بَصِيرٌ (19)عطف على جملة : { هو الذي جعل لكم الأرض ذلولاً } [ الملك : 15 ] استرسالاً في الدلائل على انفراد الله تعالى بالتصرف في الموجودات ، وقد انتقل من دلالة أحوال البشر وعالمهم ، إلى دلالة أعجب أحوال العجماوات وهي أحوال الطيرِ في نظام حركاتها في حال طيرانها إذ لا تمشي على الأرض كما هو في حركات غيرها على الأرض ، فحالها أقوى دلالة على عجيب صنع الله المنفردِ به .واشتمل التذكير بعجيب خلقة الطير في طيرانها على ضرب من الإِطناب لأن الأوصاف الثلاثة المستفادة من قوله : { فوقهم صافات ويقبضن } تُصَوِّر صورة حركات الطيران للسامعين فتنبههم لدقائق ربما أغفلهم عن تدقيق النظر فيها نشأتُهم بينها من وقت ذهول الإدراك في زمن الصِّبا ، فإن المرء التونسي أو المغربي مثلاً إذا سافر إلى بلاد الهند أو إلى بلاد السودان فرأى الفِيلَة وهو مكتمل العقل دَقيق التمييز أدرك من دقائق خلقة الفيل ما لا يدركه الرجل من أهل الهند الناشىء بين الفِيلة ، وكم غفل الناس عن دقائق في المخلوقات من الحيوان والجماد ما لو تتبعوه لتجلى لهم منها مَا يَمْلأ وصفُه الصحف قال تعالى : { أفلا ينظرون إلى الإبل كيف خلقت وإلى السماء كيفَ رفعت وإلى الجبال كيف نصبت وإلى الأرض كيف سطحت } [ الغاشية : 1720 ] ، وقال : { وفي أنفسكم أفلا تبصرون } [ الذاريات : 21 ] .وقد رأيت بعض من شاهد البحر وهو كبير ، ولم يكن شاهده من قبل ، كيفَ امتلكه من العجب ما ليس لأحدٍ ممن ألفوه معشاره .وهذا الإطناب في هذه السورة مخالف لما في نظير هذه الآية من سورة النحل ( 79 ) في قوله : { ألم يَروا إلى الطير مسخرات في جَوّ السماء ما يمسكهن إلاّ الله } وذلك بحسب ما اقتضاه اختلاف المقامين فسورة النحل رابعة قبل سورة الملك ، فلما أوقظت عقولهم فيها للنظر إلى ما في خلقة الطير من الدلائل فلم يتفطنوا وسُلك في هذه السورة مسلك الإِطناب بزيادة ذكر أوصاف ثلاثة :فالوصف الأول : ما أفاده قوله : فوقهم } فإن جميع الدواب تمشي على الأرض والطير كذلك فإذا طار الطائر انتقل إلى حالة عجيبة مخالفة لبقية المخلوقات وهي السير في الجوّ بواسطة تحريك جناحيه وذلك سرّ قوله تعالى : { يطير بجناحيه } [ الأنعام : 38 ] بعد قوله : { ولا طائر في } [ سورة الأنعام : 38 ] لقصد تصوير تلك الحالة .الوصف الثاني : { صافات } وهو وصف بوزن اسم الفاعل مشتق من الصَّف ، وهو كون أشياء متعددة متقاربة الأمكنة وباستواء ، وهو قاصر ومتعد ، يقال : صَفّوا ، بمعنى اصطفوا كما حكى الله عن الملائكة : { وإنا لنحن الصَّافُّون } [ الصافات : 165 ] وقال تعالى في البُدْن { فاذكروا اسم الله عليها صَوافَّ } [ الحج : 36 ] . ويقال : صفهم إذا جعلهم مستوين في الموقف ، وفي حديث ابن عباس في الجنائز «مرَّ رسول الله صلى الله عليه وسلم بقبر منبوذ» إلى قوله : «فصفَّنا خلفه وكبَّر» .والمراد هنا أن الطير صافّة أجنحتها فحذف المفعول لعلمه من الوصف الجاري على الطير إذ لا تجعل الطير أشياء مصفوفة إلاّ ريش أجنحتها عند الطيران فالطائر إذا طار بسط جناحيه ، أي مدها فصفّ ريش الجناح فإذا تمدد الجناحُ ظهر ريشه مصطّفاً فكان ذلك الاصطفاف من أثر فعل الطير فوصفت به ، وتقدم عند قوله تعالى : { والطير صافات } في سورة النور ( 41 ) . وبسط الجناحين يُمكّن الطائرَ من الطيران فهو كمدّ اليدين للسابح في الماء .الوصف الثالث : ويقبضن } وهو عطف على { صافات } من عطف الفعل على الاسم الشبيه بالفعل في الاشتقاق وإفادةِ الاتصاف بحدوث المصدر في فاعله ، فلم يفت بعطفه تماثل المعطوفين في الاسمية والفعلية الذي هو من محسنات الوصل .والقَبض : ضد البسط . والمراد به هنا ضد الصّف المذكور قبله ، إذ كان ذلك الصف صادقاً على معنى البسط ومفعوله المحذوف هنا هو عين المحذوف في المعطوف عليه ، أي قابضات أجنحتهن حين يدنينها من جُنوبهن للازدياد من تحريك الهواء للاستمرار في الطيران .وأوثر الفعل المضارع في { يَقْبضن } لاستحضار تلك الحالة العجيبة وهي حالة عكس بسط الجناحين إذ بذلك العكس يزداد الطيران قوة امتداد زمان .وجيء في وصف الطير ب { صافات } بصيغة الاسم لأن الصف هو أكثر أحوالها عند الطيران فناسبه الاسم الدال على الثبات ، وجيء في وصفهن بالقبض بصيغة المضارع لدلالة الفعل على التجدد ، أي ويجددن قبض أجنحتهن في خلال الطيران للاستعانة بقبض الأجنحة على زيادة التحرك عندما يَحسسن بتغلب جاذبية الأرض على حركات الطيران ، ونظيره قوله تعالى في الجِبال والطيرِ { يسبحن بالعشيّ والإِشراق والطيرَ محشورة } [ ص : 18 19 ] لأن التسبيح في وقتين والطير محشورة دَوْماً .وانتصَب { فوقهم } على الحال من { الطير } وكذلك انتصب { صافات } .وجملة { ويقبضن } في موضع نصب على الحال لعطفها على الوصف الذي هو حال فالرؤية بصرية مضمنة معنى النظر ، ولذلك عُديت إلى المرئي ب ( إلى ) . والاستفهام في { أو لم يَروا } إنكاري ، ونزلوا منزلة من لم يرَ هاته الأحوال في الطير لأنهم لم يعتبروا بها ولم يهتدوا إلى دلالتها على انفراد خالقها بالإِلهية .وجملة { ما يمسكهن إلاّ الرحمان } مبينة لجملة { أو لم يروا إلى الطير } وما فيها من استفهام إنكار ، أي كان حقهم أن يعلموا أنهن ما يُمسكُهن إلاّ الرحمان إذ لا ممسك لها ترونه كقوله تعالى : { ويمسك السماء أن تقع على الأرض } [ الحج : 65 ] .وفي هذا إيماء إلى أن الذي أمسك الطير عن الهُوِيّ المفضي إلى الهلاك هو الذي أهلك الأمم الذين من قبللِ هؤلاء فلو لم يشركوا به ولو استعصموا بطاعته لأنجاهم من الهلاك كما أنجى الطيْر من الهُوِيّ .ومعنى إمساك الله إياها : حفظها من السقوط على الأرض بما أودع في خلقتها من الخصائص في خفة عظامها وقوة حركة الجوانح وما جعل لهن من القوادم ، وهي ريشات عشر هي مقاديم ريش الجناح ، ومن الخوافي وهي ما دونها من الجناح إلى منتهى ريشه ، وما خلقه من شكل أجسادها المعين على نفوذها في الهواء فإن ذلك كله بخلق الله إياها مانعاً لها من السقوط وليس ذلك بمعاليق يعلقها بها أحد كما يعلق المشعوذ بعض الصور بخيوط دقيقة لا تبدو للناظرين .وإيثار اسم { الرحمان } هنا دون الاسم العلَم بخلاف ما في سورة النحل ( 79 ) { ألم يروا إلى الطير مسخرات في جو السماء ما يمسكهن إلاّ الله } لعله للوجه الذي ذكرناه آنفاً في خطابهم بطريقة الإِطناب من قوله : أو لم يروا إلى الطير فوقهم صافات } الآية .فمن جملة عنادهم إنكارهم اسم { الرحمان } فلما لم يرعووا عما هم عليه ذكر وصف { الرحمان } في هذه السورة أربع مرات .وجملة { إنه بكل شيء بصير } تعليل لمضمون { ما يمسكهُنّ إلاّ الرحمان } أي أمسكهن الرحمان لعموم علمه وحكمته ولا يمسكهن غيره لقصور علمهم أو انتفائه .والبصير : العليم ، مشتق من البصيرة ، فهو هنا غير الوصف الذي هو من الأسماء الحسنى في نحو : السميع البصير ، وإنما هو هنا من باب قولهم : فلان بصير بالأمور . وقوله تعالى : { إن الله بصير بالعباد } [ غافر : 44 ] ، فهو خبر لا وصف ولا منزل منزلة الاسم . وتقديم { بكل شيء } على متعلقه لإفادة القصر الإِضافي وهو قصر قلب ردّاً على من يزعمون أنه لا يعلم كل شيء كالذين قيل لهم { وأسروا قولكم أو اجهروا به } [ الملك : 13 ] .\n","ar.waseet":"ثم تنتقل السورة بعد هذا التهديد والإِنذار ، إلى دعوتهم إلى التأمل والتفكر ، فى مشهد الطير صافات فى الجو . . وفى أحوال أنفسهم عند اليأس والفقر ، وعند الهزيمة والإعراض عن الحق . . فيقول - سبحانه - :( أَوَلَمْ يَرَوْا إِلَى الطير . . ) .قال بعض العلماء : قوله : ( أَوَلَمْ يَرَوْا إِلَى الطير . . ) عطف على جملة ( هُوَ الذي جَعَلَ لَكُمُ الأرض ذَلُولاً . . ) استرسالا فى الدلائل على انفراد الله - تعالى - بالتصرف فى الموجودات ، وقد انتقل من دلالة أحوال البشر وعالمهم ، إلى دلالة أعجب أحوال العجماوات ، وهى أحوال الطير فى نظام حركاتها فى حال طيرانها ، إذ لا تمشى على الأرض كما هو فى حركات غيرها على الأرض ، فحالها أقوى دلالة على عجيب صنع الله المنفرد به . .والاستفهام فى قوله - تعالى - : ( أَوَلَمْ يَرَوْا . . . ) للتعجيب من حال المشركين ، لعدم تفكرهم فيما يدعو إلى التفكر والاعتبار . .والواو للعطف على مقدر يقتضيه المقام ، والطير : جمع طائر كصحب وصاحب . .والمعنى : أغفل هؤلاء المشركون ، وانطمست أعينهم عن رؤية الطير فوقهم ، وهن ( صَافَّاتٍ ) أى : باسطات أجنحتهن فى الهواء عند الطيران فى الجو ، ( وَيَقْبِضْنَ ) أى : ويضممن أجنحتهن تارة على سبيل الاستظهار بها على شدة التحرك فى الهواء . . ( مَا يُمْسِكُهُنَّ ) فى حالتى البسط والقبض ( إِلاَّ الرحمن ) الذى وسعت رحمته وقدرته كل شئ ، والذى أحسن كل شئ خلقه . .( إِنَّهُ ) - سبحانه - ( بِكُلِّ شَيْءٍ بَصِيرٌ ) أى : إنه - سبحانه - مطلع على أحوال كل شئ ، ومدبر لأمره على أحسن الوجوه وأحكمها . .قال صاحب الكشاف : ( صَافَّاتٍ ) باسطات أجنحتهن فى الجو عند طيرانها ، لأنهن إذا بسطنها صففن قوادمها صفا ( وَيَقْبِضْنَ ) أى : ويضممها إذا ضربن بها جنوبهن .فإن قلت : لم قيل ( وَيَقْبِضْنَ ) ولم يقل : وقابضات؟قلت : لأن الأصل فى الطيران هو صف الأجنحة ، لأن الطيران فى الهواء كالسباحة فى الماء ، والأصل فى السباحة مد الأطراف وبسطها . وأما القبض فطارئ على البسط . للاستظهار به على التحرك ، فجئ بما هو طارئ غير أصل بلفظ الفعل ، على معنى أنهن صافات ، ويكون منهن القبض تارة كما يكون من السابح . .والمراد بإمساكهن : عدم سقوطهن إلى الأرض بقدرته وحكمته - تعالى - حيث أودع فيها من الخصائص ما جعلها تطير فى الجو ، كالسابح فى الماء .وشبيه بهذه الآية قوله - تعالى - : ( أَلَمْ يَرَوْاْ إلى الطير مُسَخَّرَاتٍ فِي جَوِّ السمآء مَا يُمْسِكُهُنَّ إِلاَّ الله . . . ).\n","ar.baghawi":"( أولم يروا إلى الطير فوقهم صافات ) تصف أجنحتها في الهواء ( ويقبضن ) أجنحتها بعد البسط ( ما يمسكهن ) في حال القبض [ والبسط ] أن يسقطن ( إلا الرحمن إنه بكل شيء بصير )\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5260.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5260.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5260.mp3","format":"mp3","local_path":null}}},{"verse":20,"arabic":"أَمَّنْ هَٰذَا الَّذِي هُوَ جُنْدٌ لَكُمْ يَنْصُرُكُمْ مِنْ دُونِ الرَّحْمَٰنِ ۚ إِنِ الْكَافِرُونَ إِلَّا فِي غُرُورٍ","transliteration":"Amman haazal lazee huwa jundul lakum yansurukum min doonir rahmaan; inilkaafiroona illaa fee ghuroor","translations":{"en.ahmedali":"What other army do you have to help you apart from Ar-Rahman? The unbelievers are surely lost in delusion.","en.ahmedraza":"Or which army do you have that will help you against the Most Gracious? The disbelievers are in nothing except an illusion.","en.arberry":"Or who is this that shall be a host for you to help you, apart from the All-merciful? The unbelievers are only in delusion.","en.asad":"[And] is there any, besides the Most Gracious, that could be a shield for you, and could succour you [against danger]? They who deny this truth are but lost in self- delusion!","en.daryabadi":"Who. is he that can be an army Unto you and succour you, beside the Compassionate! The infidelsjb are but in delusion.","en.hilali":"Who is he besides the Most Beneficent that can be an army to you to help you? The disbelievers are in nothing but delusion.","en.pickthall":"Or who is he that will be an army unto you to help you instead of the Beneficent? The disbelievers are in naught but illusion.","en.qaribullah":"Or, who is it that shall be your host to help you, other than the Merciful? Indeed, the unbelievers are only deluded.","en.sahih":"Or who is it that could be an army for you to aid you other than the Most Merciful? The disbelievers are not but in delusion.","en.sarwar":"Do you have any armies who will help you against the Beneficent God? The disbelievers are certainly deceived (by satan).","en.yusufali":"Nay, who is there that can help you, (even as) an army, besides (Allah) Most Merciful? In nothing but delusion are the Unbelievers.","en.maududi":"Which is your army that will come to your aid against the Merciful Lord? But the unbelievers are in utter delusion.","en.shakir":"Or who is it that will be a host for you to assist you besides the Beneficent Allah? The unbelievers are only in deception.","en.itani":"Or who is this who is a force for you to protect you against the Compassionate? The disbelievers are in nothing but delusion.","en.mubarakpuri":"Who is it besides the Most Gracious that can be an army to you to help you The disbelievers are in nothing but delusion.","en.qarai":"Who is it that is your host who may help you, besides the All-beneficent? The faithless only dwell in delusion.","en.wahiduddin":"Who is there to defend you like an army, besides the Lord of Mercy? Those who deny the truth are in deception."},"tafsir":{"ar.muyassar":"أغَفَل هؤلاء الكافرون، ولم ينظروا إلى الطير فوقهم، باسطات أجنحتها عند طيرانها في الهواء، ويضممنها إلى جُنوبها أحيانًا؟ ما يحفظها من الوقوع عند ذلك إلا الرحمن. إنه بكل شيء بصير لا يُرى في خلقه نقص ولا تفاوت. بل مَن هذا الذي هو في زعمكم- أيها الكافرون- حزب لكم ينصركم من غير الرحمن، إن أراد بكم سوءًا؟ ما الكافرون في زعمهم هذا إلا في خداع وضلال من الشيطان. بل مَن هذا الرازق المزعوم الذي يرزقكم إن أمسك الله رزقه ومنعه عنكم؟ بل استمر الكافرون في طغيانهم وضلالهم في معاندة واستكبار ونفور عن الحق، لا يسمعون له، ولا يتبعونه.","ar.jalalayn":"«أمَّن» مبتدأ «هذا» خبره «الذي» بدل من هذا «هو جند» أعوان «لكم» صلة الذي «ينصركم» صفة الجند «من دون الرحمن» أي غيره يدفع عنكم عذابه، أي لا ناصر لكم «إن» ما «الكافرون إلا في غرور» غرهم الشيطان بأن العذاب لا ينزل بهم.","ar.qurtubi":"قوله تعالى : أم من هذا الذي هو جند لكم قال ابن عباس : حزب ومنعة لكم .ينصركم من دون الرحمن فيدفع عنكم ما أراد بكم إن عصيتموه . ولفظ الجند يوحد ; ولهذا قال : هذا الذي هو جند لكم وهو استفهام إنكار ; أي لا جند لكم يدفع عنكم عذاب الله من دون الرحمن أي من سوى الرحمن .إن الكافرون إلا في غرور من الشياطين ; تغرهم بأن لا عذاب ولا حساب .\n","ar.miqbas":"أَمْ مَنْ هَذَا الَّذِي هُوَ جُنْدٌ لَكُمْ يَنْصُرُكُمْ مِنْ دُونِ الرَّحْمَنِ إِنِ الْكَافِرُونَ إِلَّا فِي غُرُورٍ (20)( أم ) منقطعة وهي للإِضراب الانتقالي من غرض إلى غرض فبعد استيفاء غرض إثبات الإلهية الحق لله تعالى بالوحدانية وتذكيرهم بأنهم مفتقرون إليه ، انتقل إلى إبطال أن يكون أحد يدفع عنهم العذاب الذي توعدهم الله به فوُجه إليهم استفهام أن يدلّوا على أحد من أصنامهم أو غيرها يقال فيه هذا هو الذي ينصر من دون الله ، فإنهم غير مستطيعين تعيين أحد لذلك إلاّ إذا سلكوا طريق البهتان وما هم بسالكيه في مثل هذا لافتضاح أمره .وهذا الكلام ناشىء عن قوله : { أأمنتم من في السماء } [ الملك : 16 ] الآية فهو مثله معترض بين حجج الاستدلال .و ( أم ) المنقطعة لا يفارقها معنى الاستفهام ، والأكثر أن يكون مقدراً فإذا صرح به كما هنا فأوضح ولا يتوهم أن الاستفهام يقدر بعدها ولو كان يليها استفهام مصرح به فيشكل اجتماع استفهامين .والاستفهام مستعمل في التعجيز عن التعيين فيؤول إلى الانتفاء ، والإشارة مشار بها إلى مفهوم { جند } مفروض في الأذهان استُحضر للمخاطبين ، فجعل كأنه حاضر في الخارج يشاهده المخاطبون ، فيطلب المتكلم منهم تعيين قبيله بأن يقولوا : بنو فلان . ولما كان الاستفهام مستعملاً في التعجيز استلزم ذلك أن هذا الجند المفروض غير كائن .وقريب من ذلك قوله تعالى : { من ذا الذي يشفع عنده إلا بإذنه } [ البقرة : 255 ] ونحوه .و ( مَن ) في موضع مبتدأ واسم الإشارة خبر عن المبتدأ .وكتب في المصحف { أمَّن } بميم واحدة بعد الهمزة وهما ميم ( أم ) وميم ( مَن ) المدغمتين بجعلهما كالكلمة الواحدة كما كتب { عمّ يتساءَلون } [ النبأ : 1 ] بميم واحدة بعد العين ، ولا تقرأ إلاّ بميم مشددة إذ المعتبر في قراءة القرآن الرواية دون الكتابة وإنما يكتب القرآن للإعانة على مراجعته .و { الذي هو جند } صفة لاسم الإِشارة و { لكم } صفة ل { جند } و { ينصركم } جملة في موضع الحال من { جُندٌ } أو صفة ثانية ل { جند } .ويجوز أن يكون اسم الإشارة مشاراً به إلى جماعة الأصنام المعروفة عندهم الموضوعة في الكعبة وحولَها الذي اتخذتموه جنداً فمَن هو حتى ينصرَكم من دون الله .فتكون ( مَنْ ) استفهامية مستعملة في التحقير مثل قوله : { من فرعون } [ الدخان : 31 ] في قراءة فتح ميم ( مَن ) ورفع فرعون ، أي من هذا الجند فإنه أحقر من أن يعرف ، واسم الإِشارة صفة لاسم الاستفهام مبينة له ، و { الذي هو جند لكم } صفة لاسم الإِشارة وجملة { ينصركم } خبر عن اسم الاستفهام ، أي هو أقل من أن ينصركم من دون الرحمان . وجيء بالجملة الإسمية { الذي هو جند لكم } لدلالتها على الدوام والثبوت لأن الجند يكون على استعداد للنصر إذا دعي إليه سواء قاتل أم لم يقاتل لأن النصر يحتاج إلى استعداد وتهيُّؤ كما قال النبي صلى الله عليه وسلم « خير الناس رجل ممسك بعنان فرسه كلما سمع هيعة طار إليها »أي هيعة جهاد .فالمعنى : ينصركم عند احتياجكم إلى نصره ، فهذا وجه الجمع بين جملة { هو جند لكم } وجملة { ينصركم } ولم يُستغن بالثانية عن الأولى .و { دون } أصله ظرف للمكان الأسفل ضِد ( فَوق ) ، ويطلق على المغاير فيكون بمعنى غير على طريقة المجاز المرسل .فقوله : { مِن دون الرحمان } يجوز أن يكون ظرفاً مستقراً في موضع الحال من الضمير المستتر في { ينصركم } . أي حالة كون الناصر من جانب غير جانب الله ، أي مَن مستطيع غير الله يدفع عنكم السوء على نحو قوله تعالى : { أم لهم ءالهة تمنعهم من دوننا } [ الأنبياء : 43 ] فتكون { مِن } زائدة مؤكدة للظرف وهي تزاد مع الظروف غير المتصرفة ، ولا تجر تلك الظروف بغير { مِن } ، قال الحريري في المقامة الرابعة والعشرين : ومَا منصوب على الظرف لا يخفضه سوى حرف . وفسره بظرف ( عند ) ولا خصوصية ل ( عند ) بل ذلك في جميع الظروف غير المتصرفة .وتكرير وصف { الرحمان } عقب الآية السابقة للوجه الذي ذكرنا في إيثار هذا الوصف في الآية السابقة .وذيل هذا بالاعتراض بقوله : { إن الكافرون إلا في غرور } ، أي ذلك شأن الكافرين كلهم وهم أهل الشرك من المخاطبين وغيرهم ، أي في غرور من الغفلة عن توقع بأس الله تعالى ، أو في غرور من اعتمادهم على الأصنام فكما غَر الأمم السالفة دينُهم بأن الأوثان تنفعهم وتدفع عنهم العذاب فلم يجدوا ذلك منهم وقت الحاجة فكذلك سيقع لأمثالهم قال تعالى : { وللكافرين أمثالها } [ محمد : 10 ] وقال { أكفّاركُم خير من أولئكم } [ القمر : 43 ] فتعريف { الكافرون } للاستغراق . وليس المراد به كافرون معهودون حتى يكون من وضع المظهر موضع الضمير .والغرور : ظن النفس وقوع أمر نافع لها بمخائل تتوهمها ، وهو بخلاف ذلك أو هو غير واقع . وتقدم في قوله تعالى : { لا يغرنك تقلب الذين كفروا في البلاد } في آخر آل عمران ( 196 ) وقوله : { يوحي بعضهم إلى بعض زخرف القول غرورا } في الأنعام ( 112 ) وقوله : { فلا تغرنكم الحياة الدنيا } في سورة فاطر ( 5 ) .والظرفية مجازية مستعملة في شدة التلبس بالغرور حتى كأنَّ الغرور محيط بهم إحاطة الظرف .والمعنى : ما الكافرون في حال من الأحوال إلاّ في حال الغرور ، وهذا قصر إضافي لقلب اعتقادهم أنهم في مأمن من الكوارث بحماية آلهتهم .\n","ar.waseet":"ثم لفت أنظارهم للمرة الثانية إلى قوة بأسه ، ونفاذ إرادته ، وعدم وجود من يأخذ بيدهم إذا ما أنزل بهم عقابه فقال : ( أَمَّنْ هذا الذي هُوَ جُندٌ لَّكُمْ يَنصُرُكُمْ مِّن دُونِ الرحمن ) .والاستفهام للتحدى والتعجيز ، و ( أم ) منقطعة بمعنى بل ، فهى للإِضراب الانتقالى من غرض إلى آخر ، ومن حجة إلى أخرى .و ( من ) اسم استفهام مبتدأ ، وخبره اسم الإِشارة ، وما بعده صفته .والمراد بالجند : الجنود الذين يهرعون لنصرة من يحتاج إلى نصرتهم . ولفظ ( دُونِ ) أصله ظرف للمكان الأسل . . ويطلق على الشئ المغاير ، فيكون بمعنى غير كما هنا ، والمقصود بالآية تحقير شأن هؤلاء الجند ، والتهوين من شأنهم .والمعنى : بل أخبرونى - أيها المشركون - بعد أن ثبتت غفلتكم وعدم تفكيركم تفكيرا ينفعكم ، من هذا الحقير الذى تستعينون به فى نصركم ودفع الضر عنكم ، متجاوزين فى ذلك إرادة الرحمن ومشيئته ونصره . أو من هذا الذى ينصركم نصرا كائنا غير نصرا الرحمن ، أو من ينصركم من عذاب كائن من عنده - تعالى - .والجواب الذى لا تستطيعون جوابا سواه : هو أنه لا ناصر لكم يستطيع أن ينصركم من دون الله - تعالى - ، كما قال - سبحانه - ( وَإِن يَمْسَسْكَ الله بِضُرٍّ فَلاَ كَاشِفَ لَهُ إِلاَّ هُوَ وَإِن يُرِدْكَ بِخَيْرٍ فَلاَ رَآدَّ لِفَضْلِهِ . . . ) وكما قال - عز وجل - : ( مَّا يَفْتَحِ الله لِلنَّاسِ مِن رَّحْمَةٍ فَلاَ مُمْسِكَ لَهَا وَمَا يُمْسِكْ فَلاَ مُرْسِلَ لَهُ مِن بَعْدِهِ ) وقوله - سبحانه - : ( إِنِ الكافرون إِلاَّ فِي غُرُورٍ ) كلام معترض بين ما قبله وما بعده ، لبيان حالهم القبيح وواقعهم المنكر .\n","ar.baghawi":"( أمن هذا الذي هو جند لكم ) استفهام إنكار . قال ابن عباس : أي منعة لكم ( ينصركم من دون الرحمن ) يمنعكم من عذابه ويدفع عنكم ما أراد بكم . ( إن الكافرون إلا في غرور ) أي في غرور من الشيطان يغرهم بأن العذاب لا ينزل بهم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5261.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5261.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5261.mp3","format":"mp3","local_path":null}}},{"verse":21,"arabic":"أَمَّنْ هَٰذَا الَّذِي يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ ۚ بَلْ لَجُّوا فِي عُتُوٍّ وَنُفُورٍ","transliteration":"Amman haazal lazee yarzuqukum in amsaka rizqah; bal lajjoo fee 'utuwwinw wa nufoor","translations":{"en.ahmedali":"Who is there to give you food in case He withholds His bounty? Yet they persist in rebellion and aversion.","en.ahmedraza":"Or who is such that will give you sustenance if Allah stops His sustenance? In fact they persist in rebellion and hatred.","en.arberry":"Or who is this that shall provide for you if He withholds His provision? No, but they persist in disdain and aversion.","en.asad":"Or is there any that could provide you with sustenance if He should withhold His provision [from you]? Nay, but they [who are bent on denying the truth] stubbornly persist in their disdain [of God's messages] and in their headlong flight [from Him]!","en.daryabadi":"Who is he that can provide for you, should He withhold His provision? Aye! they persists in perverseness and aversion.","en.hilali":"Who is he that can provide for you if He should withhold His provision? Nay, but they continue to be in pride, and (they) flee (from the truth).","en.pickthall":"Or who is he that will provide for you if He should withhold His providence? Nay, but they are set in pride and frowardness.","en.qaribullah":"Or, who is it that shall provide for you if He withholds His provision? Yet they persist in arrogance and aversion.","en.sahih":"Or who is it that could provide for you if He withheld His provision? But they have persisted in insolence and aversion.","en.sarwar":"Is there anyone who will provide you with sustenance if God were to deny you sustenance? In fact, they obstinately persist in their transgression and hatred.","en.yusufali":"Or who is there that can provide you with Sustenance if He were to withhold His provision? Nay, they obstinately persist in insolent impiety and flight (from the Truth).","en.maududi":"Who shall provide for you if He withholds His sustenance? Nay; but they persist in rebellion and aversion.","en.shakir":"Or who is it that will give you sustenance if He should withhold His sustenance? Nay! they persist in disdain and aversion.","en.itani":"Or who is this that will provide for you, if He withholds His provision? Yet they persist in defiance and aversion.","en.mubarakpuri":"Who is it that can provide for you if He should withhold His provision Nay, but they continue to be in pride, and flee.","en.qarai":"Who is it that may provide for you if He withholds His provision? Indeed, they persist in defiance and aversion.","en.wahiduddin":"Who can provide for you, if He withholds His provision? Yet they obstinately persist in rebellion and avoidance of the truth."},"tafsir":{"ar.muyassar":"أغَفَل هؤلاء الكافرون، ولم ينظروا إلى الطير فوقهم، باسطات أجنحتها عند طيرانها في الهواء، ويضممنها إلى جُنوبها أحيانًا؟ ما يحفظها من الوقوع عند ذلك إلا الرحمن. إنه بكل شيء بصير لا يُرى في خلقه نقص ولا تفاوت. بل مَن هذا الذي هو في زعمكم- أيها الكافرون- حزب لكم ينصركم من غير الرحمن، إن أراد بكم سوءًا؟ ما الكافرون في زعمهم هذا إلا في خداع وضلال من الشيطان. بل مَن هذا الرازق المزعوم الذي يرزقكم إن أمسك الله رزقه ومنعه عنكم؟ بل استمر الكافرون في طغيانهم وضلالهم في معاندة واستكبار ونفور عن الحق، لا يسمعون له، ولا يتبعونه.","ar.jalalayn":"«أمَّن هذا الذي يرزقكم إن أمسك» الرحمن «رزقه» أي المطر عنكم وجواب الشرط محذوف دل عليه ما قبله، أي فمن يرزقكم، أي لا رازق لكم غيره «بل لجوا» تمادوا «في عتو» تكبر «ونفور» تباعد عن الحق.","ar.qurtubi":"قوله تعالى : أم من هذا الذي يرزقكم أي يعطيكم منافع الدنيا . وقيل المطر من [ ص: 202 ] آلهتكم .إن أمسك - يعني الله تعالى - رزقه .بل لجوا أي تمادوا وأصروا .في عتو طغيانونفور عن الحق\n","ar.miqbas":"أَمْ مَنْ هَذَا الَّذِي يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُ بَلْ لَجُّوا فِي عُتُوٍّ وَنُفُورٍ (21)انتقال آخر والكلام على أسلوب قوله : { أم مَن هذا الذين هو جند لكم } [ الملك : 20 ] ، وهذا الكلام ناظر إلى قوله : { وكُلوا من رزقه } [ الملك : 15 ] على طريقة اللف والنشر المعكوس .والرزق : ما يَنتفِع به الناس ، ويطلق على المطر ، وعلى الطعام ، كما تقدم في قوله تعالى : { وَجَد عندها رزقاً } [ آل عمران : 37 ] .وضمير { أمسَكَ } وضمير { رزقه } عائدان إلى لفظ { الرحمان الواقع في قوله : { مِن دون الرحمان } [ الملك : 20 ] .وجيء بالصلة فعلاً مضارعاً لدلالته على التجدد لأن الرزق يقتضي التكرار إذ حاجة البشر إليه مستمرة . وكتب { أمَّن } في المصحف بصورة كلمة واحدة كما كتبت نظيرتها المتقدمة آنفاً .استئناف بَياني وقع جواباً عن سؤال ناشىء عن الدلائل والقوارع والزواجر والعظات والعبر المتقدمة ابتداء من قوله : { الذي خلق الموت والحياة >رِزْقَهُ بَل لَّجُّواْ فِى عُتُوٍّ } [ الملك : 2 ] إلى هنا ، فيتجه للسائل أن يقول : لعلهم نفعت عندهم الآيات والنذر ، واعتبروا بالآيات والعِبر ، فأجيب بإبطال ظنه بأنهم لَجُّوا في عُتُوّ ونفور .و { بل } للإضراب أو الإبطال عما تضمنه الاستفهامان السابقان أو للانتقال من غرض التعجيز إلى الإِخبار عن عنادهم .يقال : لجّ في الخصومة من باب سمع ، أي اشتد في النزاع والخصام ، أي استمروا على العناد يكتنفهم العُتّو والنفور ، أي لا يترك مخلصاً للحق إليهم ، فالظرفية مجازية ، والعتوّ : التكبر والطغيان .والنفور : هو الاشمئزاز من الشيء والهروب منه .والمعنى : اشتدوا في الخصام متلبسين بالكبر عن اتباع الرسول حرصاً على بقاء سيادتهم وبالنفور عن الحق لكراهية ما يخالف أهواءهم وما ألفوه من الباطل .\n","ar.waseet":"أى : بل أخبرونى من هذا الذى يزعم أنه يستطيع أن يوصل إليكم الرزق والخير ، إذا أمسك الله - تعالى - عنكم ذلك ، أو منع عنكم الأسباب التى تؤدى إلى نفعكم وإلى قوام حياتكم ، كمنع نزول المطر إليكم ، وكإهلاك الزروع والثمار التى تنبتها الأرض . .إنه لا أحد يستطيع أن يرزقكم سوى الله - تعالى - .وقوله : ( بَل لَّجُّواْ فِي عُتُوٍّ وَنُفُورٍ ) جملة مستأنفة جواب لسؤال تقديره : فهل انتفع المشركون بتلك المواعظ فكان الجواب كلا إنهم لم ينتفعوا ، بل ( لجوا ) أى تمادوا فى اللجاج والجدال بالباطلو ( فِي عُتُوٍّ ) أى : وفى استكبار وطغيان ، وفى ( وَنُفُورٍ ) أى : شرود وتباعد عن الطريق المستقيم .أى : أنهم ساروا فى طريق أهوائهم حتى النهاية ، دون أن يستمعوا إلى صوت نذير أو واعظ أو مرشد .\n","ar.baghawi":"( أمن هذا الذي يرزقكم إن أمسك رزقه ) أي من الذي يرزقكم المطر إن أمسك الله [ عنكم ] ( بل لجوا في عتو ) تماد في الضلال ( ونفور ) تباعد من الحق . وقال مجاهد : كفور .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5262.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5262.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5262.mp3","format":"mp3","local_path":null}}},{"verse":22,"arabic":"أَفَمَنْ يَمْشِي مُكِبًّا عَلَىٰ وَجْهِهِ أَهْدَىٰ أَمَّنْ يَمْشِي سَوِيًّا عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ","transliteration":"Afamai yamshee mukibban 'alaa wajhihee ahdaaa ammany yamshee sawiyyan 'alaa siratim mustaqeem","translations":{"en.ahmedali":"Will he find the way who grovels flat on his face, or he who walks straight on the right path?","en.ahmedraza":"So is one who walks inverted upon his face more rightly guided, or one who walks upright on the Straight Path?","en.arberry":"What, is he who walks prone upon his face better guided than he who walks upright on a straight path?","en.asad":"But then, is he that goes along with his face close to the ground better guided than he that walks upright on a straight way?","en.daryabadi":"Is he, then, who goeth about grovelling upon his face better directed, or he who walketh evenly on a straight path?","en.hilali":"Is he who walks without seeing on his face, more rightly guided, or he who (sees and) walks on a Straight Way (i.e. Islamic Monotheism).","en.pickthall":"Is he who goeth groping on his face more rightly guided, or he who walketh upright on a straight road?","en.qaribullah":"What, is he who walks, falling upon his face, more guided than he who walks upright on a Straight Path!","en.sahih":"Then is one who walks fallen on his face better guided or one who walks erect on a straight path?","en.sarwar":"Can one who walks with his head hanging down be better guided that one who walks with his head upright?","en.yusufali":"Is then one who walks headlong, with his face grovelling, better guided,- or one who walks evenly on a Straight Way?","en.maududi":"Who is better guided: he who walks grovelling on his face, or he who walks upright on a Straight Path?","en.shakir":"What! is he who goes prone upon his face better guided or he who walks upright upon a straight path?","en.itani":"Is he who walks bent on his own design better guided, or he who walks upright on a straight path?","en.mubarakpuri":"Is he who walks prone on his face, more rightly guided, or he who walks upright on a straight path","en.qarai":"Is he who walks prone on his face better guided, or he who walks upright on a straight path?","en.wahiduddin":"Is he who walks grovelling upon his face better guided, or he who walks upright upon a straight path?"},"tafsir":{"ar.muyassar":"أفمن يمشي منكَّسًا على وجهه لا يدري أين يسلك ولا كيف يذهب، أشد استقامة على الطريق وأهدى، أَمَّن يمشي مستويًا منتصب القامة سالمًا على طريق واضح لا اعوجاج فيه؟ وهذا مثل ضربه الله للكافر والمؤمن.","ar.jalalayn":"«أفمن يمشي مُكِبا» واقعا «على وجهه أهدى أمَّن يمشي سويا» معتدلا «على صراط» طريق «مستقيم» وخبر مَن الثانية محذوف دل عليه خبر الأولى، أي أهدى، والمثل في المؤمن والكافر أيهما على هدى.","ar.qurtubi":"قوله تعالى : أفمن يمشي مكبا على وجهه أهدى أمن يمشي سويا على صراط مستقيمقوله تعالى : أفمن يمشي مكبا على وجهه ضرب الله مثلا للمؤمن والكافر مكبا أي منكسا رأسه لا ينظر أمامه ولا يمينه ولا شماله ; فهو لا يأمن من العثور والانكباب على وجهه . كمن يمشي سويا معتدلا ناظرا ما بين يديه وعن يمينه وعن شماله . قال ابن عباس : هذا في الدنيا ; ويجوز أن يريد به الأعمى الذي لا يهتدي إلى الطريق فيعتسف ; فلا يزال ينكب على وجهه . وأنه ليس كالرجل السوي الصحيح البصير الماشي في الطريق المهتدي له . وقال قتادة : هو الكافر أكب على معاصي الله في الدنيا فحشره الله يوم القيامة على وجهه . وقال ابن عباس والكلبي : عنى بالذي يمشي مكبا على وجهه أبا جهل ، وبالذي يمشي سويا رسول الله صلى الله عليه وسلم . وقيل : أبو بكر . وقيل : حمزة . وقيل : عمار بن ياسر ; قاله عكرمة . وقيل : هو عام في الكافر والمؤمن ; أي أن الكافر لا يدري أعلى حق هو أم على باطل . أي أهذا الكافر أهدى أو المسلم الذي يمشي سويا معتدلا يبصر للطريق وهو على صراط مستقيم وهو الإسلام . ويقال : أكب الرجل على وجهه ; فيما لا يتعدى بالألف . فإذا تعدى قيل : كبه الله لوجهه ; بغير ألف .\n","ar.miqbas":"أَفَمَنْ يَمْشِي مُكِبًّا عَلَى وَجْهِهِ أَهْدَى أَمْ مَنْ يَمْشِي سَوِيًّا عَلَى صِرَاطٍ مُسْتَقِيمٍ (22)هذا مثَل ضربه الله للكافرين والمؤمنين أو لرجلين : كافر ومؤمن ، لأنه جاء مفرعاً على قوله : { إن الكافرون إلاّ في غرور } [ الملك : 20 ] وقوله : { بل لَجُّوا في عتوّ ونفور } [ الملك : 21 ] وما اتصل ذلك به من الكلام الذي سيق مساق الحجة عليهم بقوله : { أمَّنْ هذا الذي هو جندٌ لكم } [ الملك : 20 ] { أمن هذا الذي يرزقكم إن أمسك رزقه } [ الملك : 21 ] ، وذلك مما اتفق عليه المفسرون على اختلاف مناحيهم ولكن لم يعرج أحد منهم على بيان كيف يتعين التمثيل الأول للكافرين والثاني للمؤمنين حتى يظهر وجه إلزام الله المشركين بأنهم أهل المثل الأول مثَللِ السوء ، فإذا لم يتعين ذلك من الهيئة المشبهة لم يتضح إلزام المشركين بأن حالهم حال التمثيل الأول ، فيخال كل من الفريقين أن خصمه هو مضرب المثل السوء . ويتوهم أن الكلام ورد على طريقة الكلام المُنصِف نحو { وإنا أو إياكم لعلى هدى أو في ضلال مبين } [ سبأ : 24 ] بذلك ينبو عنه المقام هنا لأن الكلام هنا وارد في مقام المحاجة والاستدلال وهنالك في مقام المتاركة أو الاستنزال .والذي انقدح لي : أن التمثيل جرى على تشبيه حال الكافر والمؤمن بحالة مشي إنسان مختلفة وعلى تشبيه الدين بالطريق المسلوكة كما يقتضيه قوله : { على صراط مستقيم } فلا بد من اعتبار مَشي المكبّ على وجهه مشياً على صراط مُعْوجّ ، وتعين أن يكون في قوله : { مكباً على وجهه } استعارة أخرى بتشبيه حال السالك صراطاً معوجاً في تأمله وترسُّمه آثار السير في الطريق غير المستقيم خشية أن يضلّ فيه ، بحال المكِبّ على وجهه يتوسم حال الطريق وقرينة ذلك مقابلته بقوله : { سَوِيّاً } المشعر بأن { مُكباً } أطلق على غير السوي وهو المنحني المطاطىء يتوسم الآثار اللائحة من آثار السائرين لعله يعرف الطريق الموصلة إلى المقصود .فالمشرك يتوجه بعبادته إلى آلهة كثيرة لا يدري لعل بعضها أقوى من بعض وأعطفُ على بعض القبائل من بعض ، فقد كانت ثقيف يعبدون اللات ، وكان الأوس والخزرج يعبدون مناة ولكل قبيلة إله أو آلهة فتقسموا الحاجات عندها واستنصر كل قوم بآلهتهم وطمعوا في غنائها عنهم وهذه حالة يعرفونها فلا يمترون في أنهم مضرب المثل الأول ، وكذلك حال أهل الإِشراك في كل زمان ، ألا تسمع ما حكاه الله عن يوسف عليه السلام من قوله : { أأرباب متفرقون خير أم الله الواحد القهار } [ يوسف : 39 ] . ويُنَور هذا التفسير أنه يفسره قوله تعالى : { وأن هذا صراطي مستقيماً فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله } [ الأنعام : 153 ] وقوله : { قل هذه سبيلي أدعو إلى الله على بصيرة أنا ومن اتبعن وسبحان الله وما أنا من المشركين } [ يوسف : 108 ] ، فقابل في الآية الأولى الصراط المستقيم المشبه به الإِسلام بالسُّبل المتفرقة المشبه بها تعداد الأصنام ، وجعل في الآية الثانية الإسلام مشبهاً بالسبيل وسالكُه يدعو ببصيرة ثم قابل بينه وبين المشركين بقوله :{ وما أنا من المشركين } [ يوسف : 108 ] .فالآية تشتمل على ثلاث استعارات تمثيلية فقوله { يمشي مكبّاً على وجهه } تشبيه لحال المشرك في تقسُّم أمره بين الآلهة طلباً للذي ينفعه منها الشاكّ في انتفاعه بها ، بحال السائر قاصداً أرضاً معينة ليست لها طريق جادة فهو يتتبع بنيات الطريق الملتوية وتلتبس عليه ولا يوقن بالطريقة التي تبلُغ إلى مقصده فيبقى حائراً متوسماً يتعرف آثار أقدام الناس وأخفاف الإِبل فيعلم بها أن الطريق مسلوكة أو متروكة .وفي ضمن هذه التمثيلية تمثيلية أخرى مبنية عليها بقوله : { مكباً على وجهه } بتشبيه حال المتحيّر المتطلب للآثار في الأرض بحال المكب على وجهه في شدة اقترابه من الأرض .0 وقوله : { أمَّن يمشي سويّاً } تشبيه لحال الذي آمن بربّ واحد الواثق بنصر ربه وتأييده وبأنه مصادف للحق ، بحال الماشي في طريق جادة واضحة لا ينظر إلاّ إلى اتجاه وجهه فهو مستو في سيره .وقد حصل في الآية إيجاز حذف إذ استغني عن وصف الطريق بالالتواء في التمثيل الأول لدلالة مقابلته بالاستقامة في التمثيل الثاني .والفاء التي في صدر الجملة للتفريع على جميع ما تقدم من الدلائل والعبر من أول السورة إلى هنا ، والاستفهام تقريري .والمُكِب : اسم فاعل من أكَب ، إذا صار ذا كَبّ ، فالهمزة فيه أصلها لإِفادة المصير في الشيء مثل همزة : أقشع السحابُ ، إذا دخل في حالة القشع ، ومنه قولهم : أنفض القوم إذا هلكت مواشيهم ، وأرملوا إذا فني زادهم ، وهي أفعال قليلة فيما جاء فيه المجرد متعدياً والمهموز قاصراً .و { أهدى } مشتق من الهُدَى ، وهو معرفة الطريق وهو اسم تفضيل مسلوب المفاضلة لأن الذي يمشي مكباً على وجهه لا شيء عنده من الاهتداء فهو من باب قوله تعالى : { قال رب السجن أحب إليّ مما يدعونني إليه } [ يوسف : 33 ] في قول كثير من الأيمة . ومثل هذا لا يخلو من تهكم أو تمليح بحسب المقام .والسويّ : الشديد الاستواء فعيل بمعنى فاعل قال تعالى : { أهْدِك صراطاً سوياً } [ مريم : 43 ] . و ( أم ) في قوله : { أمن يمشي سوياً } حرف عطف وهي ( أم ) المعادلة لهمزة الاستفهام . و ( مَن ) الأولى والثانية في قوله : { أفمن يمشي مكباً } أو قوله : { أمن يمشي سوياً } موصولتان ومحْملهما أن المراد منهما فريق المؤمنين وفريق المشركين ، وقيل : أريد شخص معيّن أريد بالأولى أبو جهل ، وبالثانية النبي صلى الله عليه وسلم أو أبو بكر أو حمزة رضي الله عنهما .\n","ar.waseet":"ثم ضرب - سبحانه - مثلا لأهل الإِيمان وأهل الكفر ، وأهل الحق وأهل الباطل ، فقال - سبحانه - : ( أَفَمَن يَمْشِي مُكِبّاً على وَجْهِهِ أهدى أَمَّن يَمْشِي سَوِيّاً عَلَى صِرَاطٍ مُّسْتَقِيمٍ ) .والمُكِب : هو الإِنسان الساقط على وجهه ، يقال : كبَّ فلان فلانا وأكبه ، إذا صرعه وقلبه بأن جعل وجهه على الأرض . . فهو اسم فاعل من أكب .وقوله : ( أهدى ) مشتق من الهدى ، وهو معرفة طريق الحق والسير فيها ، والمفاضلة هنا ليست مقصودة ، لأن الذى يمشى مكبا على وجهه ، لا شئ عنده من الهداية أو الرشد إطلاقا حتى يفاضل مع غيره ، وفيه لون من التهكم بهذا المكب على وجهه .و \" السوى \" هو الإِنسان الشديد الاستواء والاستقامة ، فهو فعيل بمعنى فاعل .ومنه قوله - تعالى - حكاية عما قاله إبراهيم - عليه السلام - لأبيه - : ( ياأبت إِنِّي قَدْ جَآءَنِي مِنَ العلم مَا لَمْ يَأْتِكَ فاتبعني أَهْدِكَ صِرَاطاً سَوِيّاً )أى : مستويا .قال الإمام ابن كثير عند تفسيره لهذه الآية : ( أَفَمَن يَمْشِي مُكِبّاً على وَجْهِهِ أهدى . . . ) : هذا مثل ضربه الله للمؤمن والكافر ، فالكافر مثله فيما هو فيه ، كمثل من يمشى مكبا على وجهه ، أى : يمشى منحنيا لا مستويا على وجهه ، أى : لا يدرى أين يسلك ، ولا يكف يذهب ، بل هو تائه حائر ضال ، أهذا أهدى ( أَمَّن يَمْشِي سَوِيّاً ) أى : منتصب القامة ( عَلَى صِرَاطٍ مُّسْتَقِيمٍ ) أى على طريق واضح بين ، وهو فى نفسه وهو فى نفسه مستقيم وطريقه مستقيمة .هذا مثلهم فى الدنيا ، وكذلك يكونون فى الآخرة ، فالمؤمن يحشر يمشى سويا على صراط مستقيم . . وأما الكافر فإنه يحشر يمشى على وجهه إلى النار . .وروى الإِمام أحمد عن أنس قال : \" قيل يا رسول الله ، كيف يحشر الناس على وجوههم؟ فقال : \" أليس الذى أمشاهم على أرجلهم قادرا على أن يمشيهم على وجوههم \"وقال الجمل : هذا مثل للمؤمن والكافر ، حيث شبه - سبحانه - المؤمن فى تمسكه بالدين الحق ، ومشيه على منهاجه ، بمن يمشى فى الطريق المعتدل ، الذى ليس فيه ما يتعثر به . .وشبه الكافر فى ركوبه ومشيه على الدين الباطل ، بمن يمشى فى الطريق الذى فيه حفر وارتفاع وانخفاض ، فيتعثر ويسقط على وجهه ، وكلما تخلص من عثرة وقع فى أخرى .فالمذكور فى الآية هو المشبه به ، والمشبه محذوف ، لدلالة السياق عليه . .وبذلك نرى هذه الآيات الكريمة قد لفتت أنظار الناس إلى التفكر والاعتبار ، ووبخثت المشركين على جهالاتهم وطغيانهم ، وساقت مثالا واضحا للمؤمن والكافر ، ليهلك من هلك عن بينة ويحيى من حى عن بينة .\n","ar.baghawi":"ثم ضرب مثلا فقال : ( أفمن يمشي مكبا على وجهه ) راكبا رأسه في الضلالة والجهالة أعمى القلب والعين لا يبصر يمينا ولا شمالا وهو الكافر . قال قتادة : أكب على المعاصي في الدنيا فحشره الله على وجهه يوم القيامة ( أهدى أمن يمشي سويا ) معتدلا يبصر الطريق وهو ( على صراط مستقيم ) وهو المؤمن . قال قتادة : يمشي يوم القيامة سويا .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5263.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5263.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5263.mp3","format":"mp3","local_path":null}}},{"verse":23,"arabic":"قُلْ هُوَ الَّذِي أَنْشَأَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۖ قَلِيلًا مَا تَشْكُرُونَ","transliteration":"Qul huwal lazee ansha akum wa ja'ala lakumus sam'a wal absaara wal af'idata qaleelam maa tashkuroon","translations":{"en.ahmedali":"Say: \"It is He who raised you and gave you ears and eyes and hearts. How little are the thanks you offer!\"","en.ahmedraza":"Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is He Who created you, and made ears and eyes and hearts for you; very little thanks do you offer!”","en.arberry":"Say: 'It is He who produced you, and appointed for you hearing and sight and hearts; little thanks you show!'","en.asad":"SAY: \"[God is] He who has brought you [all] into being, and has endowed you with hearing, and sight, and hearts: [yet] how seldom are you grateful!\"","en.daryabadi":"Say thou: He it is who hath brought you forth and hath endowed you with hearing and sights and hearts. Little thanks it is ye give!","en.hilali":"Say it is He Who has created you, and endowed you with hearing (ears), seeing (eyes), and hearts. Little thanks you give.","en.pickthall":"Say (unto them, O Muhammad): He it is who gave you being, and hath assigned unto you ears and eyes and hearts. Small thanks give ye!","en.qaribullah":"Say: 'It is He who has created you and given to you hearing, sight and hearts but little is it that you thank'","en.sahih":"Say, \"It is He who has produced you and made for you hearing and vision and hearts; little are you grateful.\"","en.sarwar":"(Muhammad), say, \"It is God who has brought you into being and made ears, eyes, and hearts for you, but you give very little thanks\".","en.yusufali":"Say: \"It is He Who has created you (and made you grow), and made for you the faculties of hearing, seeing, feeling and understanding: little thanks it is ye give.","en.maududi":"Say: “He it is Who has brought you into being, and has given you hearing and sight, and has given you hearts to think and understand. How seldom do you give thanks!”","en.shakir":"Say: He it is Who brought you into being and made for you the ears and the eyes and the hearts: little is it that you give thanks.","en.itani":"Say, “It is He who produced you; and made for you the hearing, and the vision, and the organs. But rarely do you give thanks.”","en.mubarakpuri":"Say: \"It is He Who has created you, and endowed you with hearing and seeing, and hearts. Little thanks you give.\"","en.qarai":"Say, ‘It is He who created you, and made for you hearing, eyesight, and hearts. Little do you thank.’","en.wahiduddin":"Say, \"It is He who brought you into being, and made ears and eyes and hearts for you, yet you are seldom grateful.\""},"tafsir":{"ar.muyassar":"قل لهم -أيها الرسول-: الله هو الذي أوجدكم من العدم، وجعل لكم السمع لتسمعوا به، والأبصار لتبصروا بها، والقلوب لتعقلوا بها، قليلا- أيها الكافرون- ما تؤدون شكر هذه النعم لربكم الذي أنعم بها عليكم. قل لهم: الله هو الذي خلقكم ونشركم في الأرض، وإليه وحده تُجمعون بعد هذا التفرق للحساب والجزاء.","ar.jalalayn":"«قل هو الذي أنشأكم» خلقكم «وجعل لكم السمع والأبصار والأفئدة» القلوب «قليلا ما تشكرون» ما مزيدة والجملة مستأنفة مخبرة بقلة شكرهم جدا على هذه النعم.","ar.qurtubi":"قوله تعالى : قل هو الذي أنشأكم وجعل لكم السمع والأبصار والأفئدة قليلا ما تشكرونقوله تعالى : قل هو الذي أنشأكم أمر نبيه أن يعرفهم قبح شركهم مع اعترافهم بأن الله خلقهم .وجعل لكم السمع والأبصار والأفئدة يعني القلوبقليلا ما تشكرون أي لا تشكرون هذه النعم ، ولا توحدون الله تعالى . تقول : قلما أفعل كذا ; أي لا أفعله .\n","ar.miqbas":"قُلْ هُوَ الَّذِي أَنْشَأَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ قَلِيلًا مَا تَشْكُرُونَ (23)هذا انتقال من توجيه الله تعالى الخطاب إلى المشركين للتبصير بالحجج والدلائل وما تخلل ذلك من الوعيد أو التهديد إلى خطابهم على لسان رسوله صلى الله عليه وسلم بأن يقُول لهم ما سيُذكر تفنناً في البيان وتنشيطاً للأذهان حتى كأنَّ الكلامَ صدَر من قائلين وترفيعاً لقدر نبيئه صلى الله عليه وسلم بإعطائه حظاً من التذكير معه كما قال تعالى : { فإنما يسرناه بلسانك } [ الدخان : 58 ] .والانتقال هنا إلى الاستدلال بفُروع المخلوقات بعد الاستدلال بأصولها ، ومن الاستدلال بفروع أعراض الإِنسان بعد أصلها ، فمن الاستدلال بخلق السماوات والأرض والموت والحياة ، إلى الاستدلال بخلق الإِنسان ومداركه ، وقد أتبع الأمر بالقول بخمسةٍ مِثْلِه بطريقة التكرير بدون عاطف اهتماماً بما بعد كل أمر من مقالة يبلغها إليهم الرسول صلى الله عليه وسلم قال : { هو الذي أنشأكم وجعل لكم السمع والأبصار } ، الخ .والضمير { هو } إلى { الرحمان } من قوله : { من دون الرحمان } [ الملك : 20 ] .والإِنشاء : الإيجاد .وإفراد { السمع } لأن أصله مصدر ، أي جعل لكم حاسة السمع ، وأما { الأبصار } فهو جمع البصر بمعنى العَين ، وقد تقدم وجه ذلك عند قوله تعالى { ختم الله على قلوبهم وعلى سمعهم وعلى أبصارهم غشاوة } في سورة البقرة ( 7 ) والأفئدة } القلوب ، والمراد بها العقول ، وهو إطلاق شائع في استعمال العرب .والقصر المستفاد من تعريف المسند إليه والمسندِ في قوله : { هو الذي أنشأكم } إلى آخره قصرُ إفراد بتنزيل المخاطبين لشركهم منزلةَ من يعتقد أن الأصنام شاركت الله في الإِنشاء وإعطاء الإِحساس والإِدراك .و { قليلاً ما تشكرون } حال من ضمير المخاطبين ، أي أنعم عليكم بهذه النعم في حال إهمالكم شكرها .و { مَا } مصدرية والمصدر المنسبك في موضع فاعل { قليلاً } لاعتماد { قليلاً } على صاحب حال . و { قليلاً } صفة مشبَّهة .وقد استعمل { قليلاً } في معنى النفي والعدم ، وهذا الإِطلاق من ضروب الكناية والاقتصاد في الحكم على طريقة التمليح وتقدم عند قوله تعالى : { فقليلاً ما يؤمنون } [ البقرة : 88 ] وقوله تعالى : { فلا يؤمنون إلاّ قليلاً } في سورة النساء ( 155 ) ، وتقول العرب : هذه أرض قلما تنبت .\n","ar.waseet":"ثم أمر الله - تعالى - رسوله صلى الله عليه وسلم فى بضع آيات أن يذكر الكافرين بنعم الله - تعالى - عليهم ، وأن يرد على شبهاتهم وأكاذيبهم بما يدحضها ، وأن بكل أمره وأمرهم إليه وحده - تعالى - فقال :( قُلْ هُوَ الذي أَنشَأَكُمْ . . . ) .أى : قل - أيها الرسول الكريم - لهؤلاء المشركين - على سبيل تبصيرهم بالحج والدلائل الدالة على قدرتنا ووحدانيتنا ، وعلى سبيل التنويع فى الإرشاد والتوجيه . . قل لهم : الرحمن - عز وجل - هو الذى أنشأكم وأوجدكم فى كل طور من أطوار حياتكم ، وهو سبحانه - الذى أوجد لكم السمع الذى تسمعون به ، والأبصار التى تبصرون بها الكائنات ، والأفئدة أى والقلوب التى يدركونها بها . .ولكنكم - مع كل هذه النعم - ( قَلِيلاً مَّا تَشْكُرُونَ ) خالقكم - عز وجل - .وجمع - سبحانه - الأفئدة والأبصار ، وأفرد السمع ، لأن القلوب تختلف باختلاف مقدار ما تفهمه مما يلقى إليها من إنذار أو تبشير ، ومن حجة أو دليل ، فكان من ذلك تعدد القلوب بتعدد الناس على حسب استعدادهم .وكذلك شأن الناس فيما تنتظمه أبصارهم من آيات الله فى كونه ، فإن أنظارهم تختلف فى عمق تدبرها وضحولته ، فكان من ذلك تعدد المبصرين ، بتعدد مقادير ما يستنبطون من آيات الله فى الآفاق .وأما المسموع فهو بالنسبة للناس جميعا شئ واحد ، هو الحجة يناديهم بها المرسلون ، والدليل يوضحه لهم النبيون .لذلك كان الناس جميعا كأنهم سمع واحد ، فكان إفراد السمع إيذانا من الله بأن حجته واحدة ، ودليله واحد لا يتعدد .وقوله : ( قَلِيلاً مَّا تَشْكُرُونَ ) صفة لمصدر محذوف ، أى : شكرا قليلا ، و ( ما ) مزيدة لتأكيد التقليل .وعبر - سبحانه - بقوله ( قَلِيلاً ) لحضهم على الإِكثار من شكره - تعالى - ، وذلك عن طريق إخلاص العبادة له - عز وجل - : ونبذ عبادة غيره .\n","ar.baghawi":"\"قل هو الذي أنشأكم وجعل لكم السمع والأبصار والأفئدة قليلاً ما تشكرون\"، قال مقاتل: يعني أنهم لا يشكرون رب هذه النعم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5264.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5264.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5264.mp3","format":"mp3","local_path":null}}},{"verse":24,"arabic":"قُلْ هُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ","transliteration":"Qul huwal lazee zara akum fil ardi wa ilaihi tuhsharoon","translations":{"en.ahmedali":"Say: \"It is He who dispersed you all over the earth, and to Him you will be gathered.\"","en.ahmedraza":"Say, “It is He Who has spread you out in the earth, and towards Him you will be raised.”","en.arberry":"Say: 'It is He who scattered you in the earth, and unto Him you shall be mustered.'","en.asad":"Say: \"It is He who has multiplied you on earth; and it is unto Him that you shall be gathered [on resurrection].\"","en.daryabadi":"Say thou: He it is Who hath spread you over the earth, and Unto Him ye shall be gathered.","en.hilali":"Say: \"It is He Who has created you from the earth, and to Him shall you be gathered (in the Hereafter).\"","en.pickthall":"Say: He it is Who multiplieth you in the earth, and unto Whom ye will be gathered.","en.qaribullah":"Say: 'It was He who created you, dispersing you in the earth, and to Him you shall be gathered'","en.sahih":"Say, \"It is He who has multiplied you throughout the earth, and to Him you will be gathered.\"","en.sarwar":"Say, \"It is God who has settled you on the earth and to Him you will be resurrected\".","en.yusufali":"Say: \"It is He Who has multiplied you through the earth, and to Him shall ye be gathered together.\"","en.maududi":"Say: “Allah it is Who multiplied you in the earth and to Him you will be mustered.”","en.shakir":"Say: He it is Who multiplied you in the earth and to Him you shall be gathered.","en.itani":"Say, “It is He who scattered you on earth, and to Him you will be rounded up.”","en.mubarakpuri":"Say: \"It is He Who has created you on the earth, and to Him shall you be gathered.\"","en.qarai":"Say, ‘It is He who created you on the earth, and toward Him you will be mustered.’","en.wahiduddin":"Say, \"It is He who has scattered you on the earth; and it is to Him that you shall all be gathered [on the Day of Resurrection]."},"tafsir":{"ar.muyassar":"قل لهم -أيها الرسول-: الله هو الذي أوجدكم من العدم، وجعل لكم السمع لتسمعوا به، والأبصار لتبصروا بها، والقلوب لتعقلوا بها، قليلا- أيها الكافرون- ما تؤدون شكر هذه النعم لربكم الذي أنعم بها عليكم. قل لهم: الله هو الذي خلقكم ونشركم في الأرض، وإليه وحده تُجمعون بعد هذا التفرق للحساب والجزاء.","ar.jalalayn":"«قل هو الذي ذرأكم» خلقكم «في الأرض وإليه تحشرون» للحساب.","ar.qurtubi":"قوله تعالى : قل هو الذي ذرأكم في الأرض أي خلقكم في الأرض ; قاله ابن عباس . وقيل : نشركم فيها وفرقكم على ظهرها ; قاله ابن شجرة .وإليه تحشرون حتى يجازي كلا بعمله .\n","ar.miqbas":"قُلْ هُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ (24)إعادة فعل { قل } من قبيل التكرير المشعر بالاهتمام بالغرض المسوقة فيه تلك الأقوال .والذرْء : الإِكثار من الموجود ، فهذا أخص من قوله : { هو الذي أنشأكم } [ الملك : 23 ] أي هو الذي كثَّركم على الأرض كقوله : { هو أنشأكم من الأرض واستعمركم فيها } [ هود : 61 ] أي أعمركم إياها .والقول في صيغة القصر في قوله : { هو الذي ذرأكم في الأرض } . مثل القول في قوله : { هو الذي أنشأكم } [ الملك : 23 ] الآية .وقوله : { وإليه تحشرون } أي بعد أن أكثركم في الأرض فهو يزيلكم بموت الأجيال فكني عن الموت بالحشر لأنهم قد علموا أن الحشر الذي أُنذروا به لا يكون إلاّ بعد البعث والبعث بعد الموت ، فالكناية عن الموت بالحشر بمرتبتين من الملازمة ، وقد أدمج في ذلك تذكيرهم بالموت الذي قد علموا أنه لا بد منه ، وإنذارهم بالبعث والحشر .فتقديم المعمول في { وإليه تحشرون } للاهتمام والرعاية على الفاصلة ، وليس للاختصاص لأنهم لم يكونوا يدعون الحشر أصلاً فضلاً عن أن يدعوه لغير الله .\n","ar.waseet":"ثم أمره - سبحانه - للمرة الثانية أن يذكرهم بنعمة أخرى فقال ( قُلْ هُوَ الذي ذَرَأَكُمْ فِي الأرض وَإِلَيْهِ تُحْشَرُونَ ) . أى : وقل لهم - أيها الرسول الكريم - الرحمن - تعالى - وحده ( هُوَ الذي ذَرَأَكُمْ فِي الأرض ) .أى : هو الذى خلقكم وبثكم وكثركم فى الأرض ، إذ الذرء معناه : الإِكثار من الموجود . .وقوله : ( وَإِلَيْهِ تُحْشَرُونَ ) بيان لمصيرهم بعد انتهاء آجالهم فى هذه الدنيا .أى : وإليه وحده - لا إلى غيره - يكون مرجعكم للحساب والجزاء يوم القيامة .\n","ar.baghawi":"\"قل هو الذي ذرأكم في الأرض وإليه تحشرون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5265.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5265.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5265.mp3","format":"mp3","local_path":null}}},{"verse":25,"arabic":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِنْ كُنْتُمْ صَادِقِينَ","transliteration":"Wa yaqooloona mataa haazal wa'du in kuntum saadiqeen","translations":{"en.ahmedali":"But they say: \"When will this promise come to pass, if what you say is true?\"","en.ahmedraza":"And they say, “When will this promise come, if you are truthful?”","en.arberry":"They say, 'When shall this promise come to pass, if you speak truly?'","en.asad":"But they [only] ask, \"When is this promise to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!\"","en.daryabadi":"And they say: when will this promise be fulfilled, if ye say sooth?","en.hilali":"They say: \"When will this promise (i.e. the Day of Resurrection) come to pass? if you are telling the truth.\"","en.pickthall":"And they say: When (will) this promise (be fulfilled), if ye are truthful?","en.qaribullah":"They ask: 'When will this promise come, if you speak truthfully'","en.sahih":"And they say, \"When is this promise, if you should be truthful?\"","en.sarwar":"They say, \"When will this torment take place if what you say is true?\"","en.yusufali":"They ask: When will this promise be (fulfilled)? - If ye are telling the truth.","en.maududi":"They say: “If you are truthful, tell us when will this promise (of the Hereafter) be fulfilled?”","en.shakir":"And they say: When shall this threat be (executed) if you are truthful?","en.itani":"And they say, “When will this promise be fulfilled, if you are truthful?”","en.mubarakpuri":"They say: \"When will this promise come to pass, if you are telling the truth\"","en.qarai":"They say, ‘When will this promise be fulfilled, if you are truthful?’","en.wahiduddin":"They ask, \"When will this promise be fulfilled, if you are truthful?\""},"tafsir":{"ar.muyassar":"ويقول الكافرون: متى يتحقق هذا الوعد بالحشر يا محمد؟ أخبرونا بزمانه أيها المؤمنون، إن كنتم صادقين فيما تدَّعون، قل -أيها الرسول- لهؤلاء: إن العلم بوقت قيام الساعة اختصَّ الله به، وإنما أنا نذير لكم أخوِّفكم عاقبة كفركم، وأبيِّن لكم ما أمرني الله ببيانه غاية البيان.","ar.jalalayn":"«ويقولون» للمؤمنين «متى هذا الوعد» وعد الحشر «إن كنتم صادقين» فيه.","ar.qurtubi":"ويقولون متى هذا الوعد إن كنتم صادقين أي متى يوم القيامة ومتى هذا العذاب الذي تعدوننا به وهذا استهزاء منهم . وقد تقدم .\n","ar.miqbas":"وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ إِنْ كُنْتُمْ صَادِقِينَ (25) لما لم تكن لهم معارضة للحجة التي في قوله : { هو الذي أنشأكم } [ الملك : 23 ] إلى { هو الذي ذرأكم في الأرض } [ الملك : 24 ] انحصر عنادهم في مضمون قوله : { وإليه تحشرون } [ الملك : 24 ] فإنهم قد جحدوا البعث وأعلنوا بجحده وتعجبوا من إنذار القرآن به ، وقال بعضهم لبعض { هل ندلكم على رجل ينبئكم إذا مزقتم كل ممزق إنكم لفي خلق جديد أفترى على الله كذباً أم به جِنة } [ سبأ : 78 ] وكانوا يقولون : { متى هذا الوعد إن كنتم صادقين } [ سبأ : 29 ] واستمروا على قوله ، فلذلك حكاه الله عنهم بصيغة المضارع المقتضية للتكرير .و { الوعد } مصدر بمعنى اسم المفعول ، أي متى هذا الوعد فيجوز أن يراد به الحشر المستفاد من قوله : { وإليه تحشرون } [ الملك : 24 ] فالإشارة إليه بقوله : { هذا } ظاهرة ، ويجوز أن يراد به وعد آخر بنصر المسلمين ، فالإشارة إلى وعيد سمعوه .والاستفهام بقولهم : { متى هذا الوعد } مستعمل في التهكم لأن من عادتهم أن يستهزئوا بذلك قال تعالى : { فسيقولون من يُعيدنا قل الذي فطركم أول مرة فسينغضون إليك رؤوسهم ويقولون متى هو } [ الإسراء : 51 ]وأتوا بلفظ { الوعد } استنجازاً له لأن شأن الوعد الوفاء .وضمير الخطاب في : { إن كنتم صادقين } للنبيء صلى الله عليه وسلم والمسلمين لأنهم يلهجون بإنذارهم بيوم الحشر ، وتقدم نظيره في سورة سبأ .\n","ar.waseet":"ثم حكى - سبحانه - أقوالهم التى تدل على طغيانهم وجهالاتهم فقال : ( وَيَقُولُونَ متى هذا الوعد إِن كُنتُمْ صَادِقِينَ ) .والوعد : مصدر بمعى الموعود ، والمقصود به ما أخبرهم به صلى الله عليه وسلم من أن هناك بعثا وحسابا وجزاء . . ومن أن العاقبة والنصر للمؤمنين .أى : ويقول هؤلاء الجاحدون للرسول صلى الله عليه وسلم ولأصحابه ، على سبيل التهكم والاستهزاء : متى يقع هذا الذى تخبروننا عنه من البعث والحساب والجزاء ، ومن النصر لكم لا لنا . . ؟وجواب الشرط محذوف والتقدير : إن كنتم صادقين فيما تقولونه لنا ، فأين هو؟ إننا لا نراه ولا نحسه .\n","ar.baghawi":"\"ويقولون متى هذا الوعد إن كنتم صادقين\". .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5266.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5266.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5266.mp3","format":"mp3","local_path":null}}},{"verse":26,"arabic":"قُلْ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ","transliteration":"Qul innamal 'ilmu 'indallaahi wa innamaaa ana nazeerum mubeen","translations":{"en.ahmedali":"Say: \"God alone has knowledge. My duty is only to warn you clearly.\"","en.ahmedraza":"Proclaim, “Surely Allah has its knowledge; and I am only a Herald of plain warning.”","en.arberry":"Say: 'The knowledge is with God; I am only a clear warner.'","en.asad":"Say thou, [O Prophet:] \"Knowledge thereof rests with God alone; and I am only a plain warner.\"","en.daryabadi":"Say thou: the knowledge is only with Allah, and but a warner manifest.","en.hilali":"Say (O Muhammad SAW): \"The knowledge (of its exact time) is with Allah only, and I am only a plain warner.\"","en.pickthall":"Say: The knowledge is with Allah only, and I am but a plain warner;","en.qaribullah":"Say: 'The knowledge (of that) is with Allah; I am only a clear warner'","en.sahih":"Say, \"The knowledge is only with Allah, and I am only a clear warner.\"","en.sarwar":"Say, \"God knows best. I am only one who gives warning\".","en.yusufali":"Say: \"As to the knowledge of the time, it is with Allah alone: I am (sent) only to warn plainly in public.\"","en.maududi":"Say: “Allah alone knows about that; and I am no more than a plain warner.”","en.shakir":"Say: The knowledge (thereof is only with Allah and I am only a plain warner.","en.itani":"Say, “Knowledge is with God, and I am only a clear warner.”","en.mubarakpuri":"Say: \"The knowledge is with Allah only, and I am only a plain warner.\"","en.qarai":"Say, ‘Its knowledge is only with Allah; I am only a manifest warner.’","en.wahiduddin":"Say, \"God alone has knowledge of that; and I am only a plain warner.\""},"tafsir":{"ar.muyassar":"ويقول الكافرون: متى يتحقق هذا الوعد بالحشر يا محمد؟ أخبرونا بزمانه أيها المؤمنون، إن كنتم صادقين فيما تدَّعون، قل -أيها الرسول- لهؤلاء: إن العلم بوقت قيام الساعة اختصَّ الله به، وإنما أنا نذير لكم أخوِّفكم عاقبة كفركم، وأبيِّن لكم ما أمرني الله ببيانه غاية البيان.","ar.jalalayn":"«قل إنما العلم» بمجيئه «عند الله وإنما أنا نذير مبين» بيِّن الإنذار.","ar.qurtubi":"قوله تعالى : قل إنما العلم عند الله وإنما أنا نذير مبينقوله تعالى : قل إنما العلم عند الله أي قل لهم يا محمد علم وقت قيام الساعة عند الله فلا يعلمه غيره . نظيره : قل إنما علمها عند ربي . الآية .وإنما أنا نذير مبين أي مخوف ومعلم لكم .\n","ar.miqbas":"قُلْ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ (26)وأمر الله رسوله بأن يجيب سؤالهم بجملة على خلاف مرادهم بل على ظاهر الاستفهام عن وقت الوعد على طريقة الأسلوب الحكيم ، بأن وقت هذا الوعد لا يعلمه إلاّ الله ، فقوله : { قل } هنا أمر بقول يختص بجواب كلامهم وفصل دون عطف بجريان المقول في سياق المحاورة ، ولم يعطف فعل { قل } بالفاء جرياً على سنن أمثاله الواقعة في المجاوبة والمحاورة ، كما تقدم في نظائره الكثيرة وتقدم عند قوله تعالى : { قالوا أتجعل فيها من يفسد فيها } في سورة البقرة ( 30 ) .ولام التعريف في العلم } للعهد ، أي العلم بوقت هذا الوعد . وهذه هي اللام التي تسمى عوضاً عن المضاف إليه ، وهذا قصر حقيقي .{ وإنما أنا نذير مبين } قصر إضافي ، أي ما أنا إلاّ نذير بوقوع هذا الوعد لا أتجاوز ذلك إلى كوني عالماً بوقته .والمبين : اسم فاعل من أبان المتعدي ، أي مبين لما أمرت بتبليغه .\n","ar.waseet":"وهنا يأمر الله - تعالى - رسوله صلى الله عليه وسلم للمرة الثالثة ، أن يرد عليهم الرد الذى يكبتهم فيقول : ( قُلْ إِنَّمَا العلم عِنْدَ الله وَإِنَّمَآ أَنَاْ نَذِيرٌ مُّبِينٌ ) .أى : قل لهم يا محمد علم قيام الساعة ، وعلم اليوم الذى سننتصر فيه عليكم . . عند الله - تعالى - وحده ، لأن هذا العلم ليس من وظيفتى .وإنما وظيفتى أنى نذير لكم ، أحذركم من سوء عاقبة كفركم ، فإذا استجبتم لى نجوتم ، وإن بقيتم على كفركم هلكتم .واللام فى قوله : ( العلم ) للعهد : أى : العلم بوقت هذا الوعد ، عند الله - تعالى - وحده .والمبين : اسم فاعل من أبان المتعدى ، أى : مبين لما أمرت بتبليغه لكم بيانا واضحا لا لبس فيه ولا غموض .\n","ar.baghawi":"\"قل إنما العلم عند الله وإنما أنا نذير مبين\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5267.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5267.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5267.mp3","format":"mp3","local_path":null}}},{"verse":27,"arabic":"فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا وَقِيلَ هَٰذَا الَّذِي كُنْتُمْ بِهِ تَدَّعُونَ","transliteration":"Falaammaa ra-awhu zulfatan seee'at wujoohul lazeena kafaroo wa qeela haazal lazee kuntum bihee tadda'oon","translations":{"en.ahmedali":"When they realise it has come upon them, distraught will be the faces of unbelievers. They will be told: \"This is what you asked for.\"","en.ahmedraza":"So when they will see it close, the faces of the disbelievers will become ghastly, and it will be declared, “This is what you were demanding.”","en.arberry":"Then, when they see it nigh at hand, the faces of the unbelievers will be vexed, and it will be said, 'This is what you were promised.'","en.asad":"Yet in the end, when they shall see that [fulfilment] close at hand, the faces of those who were bent on denying the truth will be stricken with grief; and they will be told, \"This it is that you were [so derisively] calling for!\"","en.daryabadi":"But when they will behold it proximating sad will be the countenances of those who disbelieve, and it will be said: this is that which ye have been calling for.","en.hilali":"But when they will see it (the torment on the Day of Resurrection) approaching, the faces of those who disbelieve will be different (black, sad, and in grieve), and it will be said (to them): \"This is (the promise) which you were calling for!\"","en.pickthall":"But when they see it nigh, the faces of those who disbelieve will be awry, and it will be said (unto them): This is that for which ye used to call.","en.qaribullah":"Then, when they see it drawing near, the faces of the unbelievers will be blackened, and it is said: 'This is what you were promised'","en.sahih":"But when they see it approaching, the faces of those who disbelieve will be distressed, and it will be said, \"This is that for which you used to call.\"","en.sarwar":"When they see the torment approaching, the faces of the disbelievers will blacken and they will be told, \"This is what you wanted to (experience)\".","en.yusufali":"At length, when they see it close at hand, grieved will be the faces of the Unbelievers, and it will be said (to them): \"This is (the promise fulfilled), which ye were calling for!\"","en.maududi":"When they will see it near at hand, the faces of all those who had denied it will be distraught, and then they will be told: “This is the doom which you used to ask for.”","en.shakir":"But when they shall see it nigh, the faces of those who disbelieve shall be sorry, and it shall be said; This is that which you used to call for.","en.itani":"But when they see it approaching, the faces of those who disbelieved will turn gloomy, and it will be said, “This is what you used to call for.”","en.mubarakpuri":"But when they will see it approaching, the faces of those who disbelieve will be sad and grievous, and it will be said: \"This is what you were calling for!\"","en.qarai":"When they see it brought near, the countenances of the faithless will be contorted, and [they will be] told, ‘This is what you were asking for!’","en.wahiduddin":"But when they see it drawing near, the faces of those who deny the truth will turn gloomy and they will be told, \"This is what you were calling for.\""},"tafsir":{"ar.muyassar":"فلما رأى الكفار عذاب الله قريبًا منهم وعاينوه، ظهرت الذلة والكآبة على وجوههم، وقيل توبيخًا لهم: هذا الذي كنتم تطلبون تعجيله في الدنيا.","ar.jalalayn":"«فلما رأوه» أي العذاب بعد الحشر «زلفة» قريبا «سيئت» اسودت «وجوه الذين كفروا وقيل» أي قال الخزنة لهم «هذا» أي العذاب «الذي كنتم به» بإنذاره «تدعون» أنكم لا تبعثون وهذه حكاية حال تأتي عبر عنها بطريق المضي لتحقق وقوعها.","ar.qurtubi":"قوله تعالى : فلما رأوه زلفة سيئت وجوه الذين كفروا وقيل هذا الذي كنتم به تدعونقوله تعالى : فلما رأوه زلفة مصدر بمعنى مزدلفا أي قريبا ; قاله مجاهد . الحسن : عيانا . وأكثر المفسرين على أن المعنى : فلما رأوه يعني العذاب ، وهو عذاب الآخرة . وقال مجاهد : يعني عذاب بدر . وقيل : أي رأوا ما وعدوا من الحشر قريبا منهم . ودل عليه تحشرون . وقال ابن عباس : لما رأوا عملهم السيئ قريبا .سيئت وجوه الذين كفروا أي فعل بها السوء . وقال الزجاج : تبين فيها السوء أي ساءهم ذلك العذاب وظهر على وجوههم سمة تدل على كفرهم ; كقوله تعالى : يوم تبيض وجوه وتسود وجوه . وقرأ نافع وابن محيصن وابن عامر والكسائي \" سئت \" بإشمام الضم . وكسر الباقون بغير إشمام طلبا للخفة . ومن ضم لاحظ الأصل .وقيل هذا الذي كنتم به تدعون قال الفراء : تدعون [ ص: 204 ] تفتعلون من الدعاء وهو قول أكثر العلماء أي تتمنون وتسألون . وقال ابن عباس : تكذبون ; وتأويله : هذا الذي كنتم من أجله تدعون الأباطيل والأحاديث ; قاله الزجاج . وقراءة العامة \" تدعون \" بالتشديد ، وتأويله ما ذكرناه . وقرأ قتادة وابن أبي إسحاق والضحاك ويعقوب \" تدعون \" مخففة . قال قتادة : هو قولهم \" ربنا عجل لنا \" قطنا . وقال الضحاك : هو قولهم : اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء الآية . وقال أبو العباس : تدعون تستعجلون ; يقال : دعوت بكذا إذا طلبته ; وادعيت افتعلت منه . النحاس : \" تدعون وتدعون \" بمعنى واحد ; كما يقال : قدر واقتدر ، وعدا واعتدى ; إلا أن في \" افتعل \" معنى شيء بعد شيء ، و \" فعل \" يقع على القليل والكثير .\n","ar.miqbas":"فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا وَقِيلَ هَذَا الَّذِي كُنْتُمْ بِهِ تَدَّعُونَ (27)( لما ) حرف توقيت ، أي سيئت وجوههم في وقت رؤيتهم الوعد .والفاء فصيحة لأنها اقتضت جملة محذوفة تقديرها : فحل بهم الوعد فلما رأوهُ الخ ، أي رأوا الموعود به .وفعل { رأوه } مستعمل في المستقبل ، وجيء به بصيغة الماضي لشبهه بالماضي في تحقق الوقوع مثل { أتى أمر الله } [ النحل : 1 ] لأنه صادر عمن لا إخلاف في أخباره فإن هذا الوعد لم يكن قد حصل حين نزول الآية بمكة سواء أريد بالوعد الوعد بالبعث كما هو مقتضى السياق أم أريد به وعد النصر ، بقرينة قوله : { ويقولون متى هذا الوعد } [ الملك : 25 ] فإنه يقتضي أنهم يقولونه في الحال وأن الوعد غير حاصل حين قولهم لأنهم يسألون عنه ب { متى } .ونظير هذا الاستعمال قوله تعالى : { فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيداً } في سورة النساء ( 41 ) وقوله تعالى : { ويوم نبعث في كل أمة شهيداً عليهم من أنفسهم وجئنا بك شهيداً على هؤلاء } في سورة النحل ( 89 ) إذ جمع في الآيتين بين فعل نبعث } مضارعاً وفعل { جئنا } ماضياً .وأصل المعنى : فإذا يرونه تساء وجوه الذين كفروا الخ ، فعدل عن ذلك إلى صوغ الوعيد في صورة الإخبار عن أمر وقع فجيء بالأفعال الماضية .وضمير { رأوه } عائد إلى { الوعد } [ الملك : 25 ] بمعنى : رأوا الموعود به .والزُلفة بضم الزاي : اسم مصدر زَلف إذا قرب وهو من باب تعب . وهذا إخبار بالمصدر للمبالغة ، أي رأوه شديد القرب منهم ، أي أخذ ينالهم .و { سيئت } بني للنائب ، أي ساء وجوهَهم ذلك الوعد بمعنى الموعود . وأسند حصول السوء إلى الوجوه لتضمينه معنى كَلَحَتْ ، أي لأنه سوء شديد تظهر آثار الانفعال منه على الوجوه ، كما أسند الخوف إلى الأعين في قول الأعشى :وأقدِم إذا ما أعيُن الناس تَفْرَقُ ... { وقيل } أي لهم .و { تدَّعون } بتشديد الدال مضارع ادَّعى . وقد حذف مفعوله لظهوره من قوله : { ويقولون متى هذا الوعد إن كنتم صادقين } [ الملك : 25 ] ، أي تدَّعون أنه لا يكون .و { به } متعلق ب { تدعون } لأنه ضمّن معنى «تكذّبون» فإنه إذا ضمّن عامل معنى عامل آخر يحذف معمول العامل المذكور ويذكر معمول ضمنه ليدل المذكور على المحذوف . وذلك ضرب من الإيجاز .وتقديم المجرور على العامل للاهتمام بإخطاره وللرعاية على الفاصلة . والقائل لهم { هذا الذي كنتم به تدَّعون } ملائكة المحشر أو خَزنَة جهنم ، فعدل عن تعيين القائل ، إذ المقصود المقول دون القائل فحذْف القائل من الإِيجاز .والقصر المستفاد من تعريف جزأي الإسناد تعريضٌ بهم بأنهم من شدة جحودهم بمنزلة من إذا رأوا الوعد حسبوه شيئاً آخر على نحو قوله تعالى : { فلما رأوه عارضاً مستقبل أوديتهم قالوا هذا عارض ممطرنا } [ الأحقاف : 24 ] .وقرأ الجمهور { سِيئت } بكسرة السين خالصة ، وقرأه ابن عامر والكسائي بإشمام الكسرة ضمة ، وهما لغتان في فاء كل ثلاثي معتل العين إذا بُني للمجهول .وقرأ الجمهور { تَدَّعون } بفتح الدال المشددة وقرأه يعقوب بسكون الدال من الدعاء ، أي الذي كنتم تدعون الله أن يصيبكم به تهكماً وعناداً كما قالوا { فأمطر علينا حجارةً من السماء أو ائتنا بعذاب أليم } [ الأنفال : 32 ] .\n","ar.waseet":"ثم حكى - سبحانه - حالهم عندما يرون العذاب الذى استعجلوه فقال : ( فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الذين كَفَرُواْ وَقِيلَ هذا الذي كُنتُم بِهِ تَدَّعُونَ ) .والفاء فى قوله : ( فَلَمَّا رَأَوْهُ زُلْفَةً . . . ) هى الفصيحة . و ( لما ) ظرف بمعنى حين .و ( رأوه ) مستعمل فى المستقبل وجئ به بصيغة الماضى لتحقق الوقوع ، كما فى قوله - تعالى - : ( أتى أَمْرُ الله فَلاَ تَسْتَعْجِلُوهُ . . . ) و ( زُلْفَةً ) اسم مصدر لأزلف إزلافا ، بمعنى القرب . ومنه قوله - تعالى - : ( وَأُزْلِفَتِ الجنة . . . ) أى : قربت للمتقين ، وهو حال من مفعول ( رَأَوْهُ ) .والمعنى : لقد حل بالكافرين العذاب الذى كانوا يستعجلونه ويقولون : متى هذا الوعد ، فحين رأوه نازلا بهم ، وقريبا منهم ( سِيئَتْ وُجُوهُ الذين كَفَرُواْ ) أى : ساءت رؤيته وجوههم ، وحلت عليها غبرة ترهقها قترة .( وَقِيلَ ) لهم على سبيل التوبيخ والتأنيب ( هذا الذي كُنتُم بِهِ تَدَّعُونَ ) أى : هذا هو العذاب الذى كنتم تتعجلون وقوعه فى الدنيا ، وتستهزئون بمن يحذركم منه .فقوله ( تَدَّعُونَ ) من الدعاء بمعنى الطلب ، أو من الدعوى .( سِيئَتْ ) فعل مبنى للمجهول . وأسند - سبحانه - حصول السوء إلى الوجوه ، لتضمينه معنى كلحت وقبحت واسودت ، لأن الخوف من العذاب قد ظهرت آثاره على وجوههم .وقال - سبحانه - ( سِيئَتْ وُجُوهُ الذين كَفَرُواْ ) بالإظهار ، ولم يقل وجوههم ، لذمهم بصفة الكفر ، التى كانت السبب فى هلاكهم .ومفعول ( تَدَّعُونَ ) محذوف والتقدير : وقيل لهم هذا الذى كنتم تدعون عدم وقوعه قد وقع ، وها أنتم تشاهدونه أمام أعينكم .والجار والمجرور فى قوله ( بِهِ ) متعلق بتدعون لأنه مضمن معنى تكذبون .والقائل لهم هذا القول : هم خزنة النار ، على سبيل التبكيت لهم .\n","ar.baghawi":"(  فلما رأوه ) يعني : العذاب في الآخرة - على قول أكثر المفسرين - وقال مجاهد : يعني العذاب ببدر ( زلفة ) أي قريبا وهو [ اسم يوصف به المصدر يستوي فيه ] المذكر والمؤنث والواحد والاثنان [ والجميع ] ( سيئت وجوه الذين كفروا ) اسودت وعليها كآبة ، والمعنى قبحت وجوههم بالسواد ، يقال : ساء الشيء يسوء فهو سيئ إذا قبح ، وسيء يساء إذا قبح ( وقيل ) لها أي قال الخزنة ( هذا ) أي هذا العذاب ( الذي كنتم به تدعون ) تفتعلون من الدعاء تدعون وتتمنون أنه يعجل لكم ، وقرأ يعقوب تدعون بالتخفيف ، وهي قراءة قتادة ومعناهما واحد مثل تذكرون وتذكرون .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5268.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5268.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5268.mp3","format":"mp3","local_path":null}}},{"verse":28,"arabic":"قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَنْ مَعِيَ أَوْ رَحِمَنَا فَمَنْ يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ","transliteration":"Qul ara'aytum in ahlaka niyal laahu wa mam ma'iya aw rahimanaa famai-yujeerul kaafireena min 'azaabin aleem","translations":{"en.ahmedali":"Say: \"Just think: If God destroys me and those with me, or is benevolent to us, who will then protect the unbelievers from a painful doom?\"","en.ahmedraza":"Say (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion –Allah may either destroy me and those with me, or have mercy on us – so who is such that will protect the disbelievers from the painful punishment?”","en.arberry":"Say: 'What think you? If God destroys me and those with me, or has mercy on us, then who will protect the unbelievers from a painful chastisement?'","en.asad":"SAY [O Prophet]: \"What do you think? Whether God destroys me and those who follow me, or graces us with His mercy - is there anyone that could protect [you] deniers of the truth from grievous suffering [in the life to come]?\"","en.daryabadi":"Say thou: bethink ye if Allah destroy me and those with me; or have mercy on us, who will protect the infidels from a torment afflictive?","en.hilali":"Say (O Muhammad SAW): \"Tell me! If Allah destroys me, and those with me, or He bestows His Mercy on us, - who can save the disbelievers from a painful torment?\"","en.pickthall":"Say (O Muhammad): Have ye thought: Whether Allah causeth me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom?","en.qaribullah":"Say: 'What do you think, if Allah destroys me and those with me, or has mercy upon us, who then will protect the unbelievers from the painful punishment'","en.sahih":"Say, [O Muhammad], \"Have you considered: whether Allah should cause my death and those with me or have mercy upon us, who can protect the disbelievers from a painful punishment?\"","en.sarwar":"(Muhammad), say, \"Have you not considered that regardless whether God forgives me and my followers or grants us mercy, but who will protect the disbelievers from a painful torment?","en.yusufali":"Say: \"See ye?- If Allah were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\"","en.maududi":"Say to them: “Did you ever consider: whether Allah destroys me and those that are with me, or shows mercy to us, who can protect the unbelievers from a grievous chastisement?”","en.shakir":"Say: Have you considered if Allah should destroy me and those with me-- rather He will have mercy on us; yet who will protect the unbelievers from a painful punishment?","en.itani":"Say, “Have you considered? Should God make me perish, and those with me; or else He bestows His mercy on us; who will protect the disbelievers from an agonizing torment?”","en.mubarakpuri":"Say: \"Tell me! If Allah destroys me, and those with me, or He bestows His mercy on us - who can save the disbelievers from a painful torment\"","en.qarai":"Say, ‘Tell me, whether Allah destroys me and those who are with me, or He has mercy on us, who will shelter the faithless from a painful punishment?’","en.wahiduddin":"Say, \"Have you thought: if God destroys me and those who are with me, or treats us mercifully, then who will protect those who deny the truth from a painful chastisement?\""},"tafsir":{"ar.muyassar":"قل -أيها الرسول- لهؤلاء الكافرين: أخبروني إن أماتني الله ومَن معي من المؤمنين كما تتمنون، أو رحمنا فأخَّر آجالنا، وعافانا مِن عذابه، فمَن هذا الذي يحميكم، ويمنعكم من عذاب أليم موجع؟","ar.jalalayn":"«قل أرأيتم إن أهلكني الله ومن معي» من المؤمنين بعذابه كما تقصدون «أو رحمنا» فلم يعذبنا «فمن يجير الكافرين من عذاب أليم» أي لا مجير لهم منه.","ar.qurtubi":"قوله تعالى : قل أرأيتم إن أهلكني الله ومن معي أو رحمنا فمن يجير الكافرين من عذاب أليم قوله تعالى : قل أرأيتم إن أهلكني الله أي قل لهم يا محمد - يريد مشركي مكة ، وكانوا يتمنون موت محمد صلى الله عليه وسلم ; كما قال تعالى : أم يقولون شاعر نتربص به ريب المنون - أرأيتم إن متنا أو رحمنا فأخرت آجالنا فمن يجيركم من عذاب الله ; فلا حاجة بكم إلى التربص بنا ولا إلى استعجال قيام الساعة . وأسكن الياء في \" أهلكني \" ابن محيصن والمسيبي وشيبة والأعمش وحمزة . وفتحها الباقون . وكلهم فتح الياء في \" ومن معي \" إلا أهل الكوفة فإنهم سكنوها . وفتحها حفص كالجماعة .\n","ar.miqbas":"قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَنْ مَعِيَ أَوْ رَحِمَنَا فَمَنْ يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ (28)هذا تكرير ثان لفعل { قل هو الذي أنشأكم } [ الملك : 23 ] .كان من بَذاءة المشركين أن يجهروا بتمني هلاك رسول الله صلى الله عليه وسلم وهلاك من معه من المسلمين ، وقد حكى القرآن عنهم { أم يقولون شاعر نتربص به ريب المنون } [ الطور : 30 ] وحكى عن بعضهم { ويَتربص بكم الدوائر } [ التوبة : 98 ] ، وكانوا يتآمرون على قتله ، قال تعالى : { وإذ يَمكر بك الذين كفروا ليُثبتوك أو يقتلوك } [ الأنفال : 30 ] ، فأمره الله بأن يعرفهم حقيقةً تدحض أمانيَّهم ، وهي أن موت أحد أو حياته لا يغني عن غيره ما جرَه إليه عمله ، وقد جرَّت إليهم أعمالهم غضب الله ووعيده فهو نائلهم حَيي الرسول صلى الله عليه وسلم أو بادره المنون ، قال تعالى : { فإمَّا نذهبَنَّ بك فإنّا منهم منتقمون أو نُرينك الذي وعدناهم فإنا عليهم مقتدرون } [ الزخرف : 41 ، 42 ] وقال : { وما جعلنا لبشر من قبلك الخلد أفإن مِتَّ فهُم الخالدون } [ الأنبياء : 34 ] وقال : { إنك مَيت وإنهم ميتون } [ الزمر : 30 ] أي المشركين ، وقد تكرر هذا المعنى وما يقاربه في القرآن ، وينسب إلى الشافعي :تمنَّى رجال أن أموت فإنْ أمت ... فتلكَ سبيل لستُ فيها بأوْحَدِفقد يكون نزول هذه الآيات السابقة صادف مقالة من مقالاتهم هذه فنزلت الآية في أثنائها وقد يكون نزولها لمناسبة حكاية قولهم : { متى هذا الوعد } [ الملك : 25 ] بأن قارنه كلام بذيء مثل أن يقولوا : أبَعْدَ هلاكك يأتي الوَعْد .والإهلاك : الإِماتة ، ومقابلةُ { أهلكني } ب { رحِمنا } يدل على أن المراد : أو رحمنا بالحياة ، فيفيد أن الحياة رحمة ، وأن تأخير الأجل من النعم ، وإنما لم يؤخر الله أجل نبيئه صلى الله عليه وسلم مع أنه أشرف الرسل لحِكَم أرادها كما دلّ عليه قوله : «حياتي خيرٌ لكم وموْتي خيرٌ لكم» ، ولعلّ حكمة ذلك أن الله أكمل الدين الذي أراد إبلاغه فكان إكماله يوم الحج الأكبر من سنة ثلاث وعشرين من البعثة ، وكان استمرار نزول الوحي على النبي صلى الله عليه وسلم خصِّيصية خصّه الله بها من بين الأنبياء ، فلما أتم الله دينه ربا برسوله صلى الله عليه وسلم أن يبقى غير متصل بنزول الوحي فنقله الله إلى الاتصال بالرفيق الأعلى مباشرة بلا واسطة ، وقد أشارت إلى هذا سورة { إذا جاء نصر الله من قوله : { ورأيت الناس يدخلون في دين الله أفواجاً فسبح بحمد ربك واستغفره } [ النصر : 13 ] . ولله درَ عبد بني الحسحاس في عبرته بقوله :رأيت لمنايا لم يدعْنَ محمداً ... ولا باقياً إلاَّ لَهْ الموتُ مُرْصَداًوقد عوضه الله تعالى بحياة أعلى وأجل ، إذ قال { ورفعنا لك ذكرك } [ الشرح : 4 ] ، وبالحياة الأبدية العاجلة وهي أنه يَرُدُّ عليه روحَه الزكية كلَّما سلّم عليه أحد فيردّ عليه السلام كما ثبت بالحديث الصحيح .وإنما سمَّى الحياة رحمة له ولمن معه ، لأن في حياته نعمة له وللناس ما دام الله مقدراً حياته ، وحياة المؤمن رحمة لأنه تكثر له فيها بركة الإِيمان والأعمال الصالحة .والاستفهام في { أرأيتم } إنكاري أنكر اندفاعهم إلى أمنيات ورغائب لا يجتنون منها نفعاً ولكنها مما تمليه عليهم النفوس الخبيثة من الحقد والحسد .والرؤية علمية ، وفعلها معلق عن العمل فلذلك لم يرد بَعْدَه مفعولاه ، وهو معلق بالاستفهام الذي في جملة جواب الشرط ، فتقدير الكلام : أرأيتم أنفسكم ناجين من عذاب أليم إن هلكتُ وهلك من معي ، فهلاكنا لا يدفع عنكم العذاب المُعدّ للكافرين .وأُقحم الشرط بين فعل الرؤية وما سدّ مسد مفعوليه .والفاء في قوله : { فمن يأتيكم } [ الملك : 30 ] رابطة لجواب الشرط لأنه لما وقع بعد ما أصلُه المبتدأ والخبرُ وهو المفعولان المقدّران رُجّح جانب الشرط .والمعية في قوله : { ومن معي } معية مجازية ، وهي الموافقة والمشاركة في الاعتقاد والدين ، كما في قوله تعالى : { محمد رسول الله والذين معه أشداء على الكفار } [ الفتح : 29 ] الآية ، أي الذين آمنوا معه ، وقوله : { والذين ءامنوا معه نورهم يسعى بين أيديهم } [ التحريم : 8 ] كما أطلقت على الموافقة في الرأي والفهم في قول أبي هريرة : «أنا مع ابن أخي» ، يعني موافق لأبي سلمة بن عبد الرحمان ، وذلك حين اختلف أبو سلمة وابن عباس في المتوفّى عنها الحامل إذا وضعتْ حملها قبل مضي عدة الوفاة .والاستفهام بقوله : { فمن يجير الكافرين } الخ إنكاري ، أي لا يجيرهم منه مجير ، أي أظننتم أن تجدوا مجيراً لكم إذا هَلَكنا فذلك متعذر فماذا ينفعكم هلاكنا .والعذاب المذكور هنا ما عبّر عنه بالوعد في الآية قبلها .وتنكير { عذاب } للتهويل .والمراد ب { الكافرين } جميع الكافرين فيشمل المخاطبين .والكلام بمنزلة التذييل ، وفيه حذف ، تقديره : من يجيركم من عذاب فإنكم كافرون ولا مجير للكافرين .وذُكر وصف { الكافرين } لما فيه من الإيماء إلى علة الحكم لأنه وصف إذا علق به حكم أفاد تعليل ما منه اشتقاق الوصف .وقرأ الجمهور بفتحة على ياء { أهلكنيَ } ، وقرأها حمزة بإسكان الياء .وقرأ الجمهور ياء { معيَ } بفتحة . وقرأها أبو بكر عن عاصم وحمزة والكسائي بسكون الياء .\n","ar.waseet":"ثم أمر - سبحانه - رسوله صلى الله عليه وسلم للمرة الرابعة ، أن يرد على ما كانوا يتمنونه بالنسبة له ولأصحابه فقال : ( قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ الله وَمَن مَّعِيَ أَوْ رَحِمَنَا فَمَن يُجِيرُ الكافرين مِنْ عَذَابٍ أَلِيمٍ ) .ولقد كان المشركون يتمنون هلاك النبى صلى الله عليه وسلم وكانوا يرددون ذلك فى مجالسهم ، وقد حكى القرآن عنهم ذلك فى آيات منها قوله - تعالى - :( أَمْ يَقُولُونَ شَاعِرٌ نَّتَرَبَّصُ بِهِ رَيْبَ المنون ) أى : قل لهم - أيها الرسول الكريم - ( أَرَأَيْتُمْ ) أى : أخبرونى ( إِنْ أَهْلَكَنِيَ الله ) . - تعالى - وأهلك - ( وَمَن مَّعِيَ ) من أصحابى وأتباعى ( أَوْ رَحِمَنَا ) بفضله وإحسانه بأن رزقنا الحياة الطويلة ، ورزقنا النصر عليكم .فأخبرونى فى تلك الحالة ( فَمَن يُجِيرُ الكافرين مِنْ عَذَابٍ أَلِيمٍ ) أى : من يستطيع أحد أن يمنع ذلك عنكم .قال صاحب الكشاف : كان كفار مكة يدعون على رسول الله صلى الله عليه وسلم وعلى المؤمنين بالهلاك ، فأمر بأن يقول لهم : نحن مؤمنون متربصون لإحدى الحسنين : إما أن نهلك كما تتمنون ، فننقلب إلى الجنة ، أو نرحم بالنصرة عليكم ، أما أنتم فماذا تصنعون؟ من يجيركم - وأنتم كافرون - من عذاب أليم لا مفر لكم منه .يعنى : إنكم تطلبون لنا الهلاك الذى هو استعجال للفوز والسعادة ، وأنتم فى أمر هو الهلاك الذى لا هلاك بعده . .والمراد بالهلاك : الموت ، وبالرحمة : الحياة والنصر بدليل المقابلة ، وقد منح الله - تعالى - نبيه العمر المبارك النافع ، فلم يفارق صلى الله عليه وسلم الدنيا إلا بعد أن بلغ الرسالة ، وأدى الأمانة ودخل الناس فى دين الله أفواجا ، وكانت كلمته هى العليا .والاستفهام فى قوله ( أَرَأَيْتُمْ ) للإنكار والتعجيب من سوء تفكيرهم .والرؤية علمية ، والجملة الشرطية بعدها سدت مسد المفعولين .وقال - سبحانه - ( فَمَن يُجِيرُ الكافرين ) للإشارة إلى أن كفرهم هو السبب فى بوارهم وفى نزول العذاب الأليم بهم .\n","ar.baghawi":"( قل ) يا محمد لمشركي مكة الذين يتمنون [ هلاكك ] ( أرأيتم إن أهلكني الله ومن معي ) من المؤمنين ( أو رحمنا ) فأبقانا وأخر آجالنا ( فمن يجير الكافرين من عذاب أليم ) فإنه واقع بهم لا محالة . وقيل : معناه أرأيتم إن أهلكني الله فعذبني ومن معي أو رحمنا فغفر لنا فنحن - مع إيماننا - خائفون أن يهلكنا بذنوبنا لأن حكمه نافذ فينا فمن يجيركم ويمنعكم من عذابه وأنتم كافرون ؟ وهذا معنى قول ابن عباس .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5269.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5269.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5269.mp3","format":"mp3","local_path":null}}},{"verse":29,"arabic":"قُلْ هُوَ الرَّحْمَٰنُ آمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا ۖ فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلَالٍ مُبِينٍ","transliteration":"Qul huwar rahmaanu aamannaa bihee wa 'alaihi tawakkalnaa fasata'lamoona man huwa fee dalaalim mubeen","translations":{"en.ahmedali":"Say: \"He is the benevolent; in Him do we believe, and in Him do we place our trust. You will now realise who is in manifest error.\"","en.ahmedraza":"Proclaim, “He only is the Most Gracious – we have accepted faith in Him and have relied only upon Him; so you will now realise who is in open error.”","en.arberry":"Say: 'He is the All-merciful. We believe in Him, and in Him we put all our trust. Assuredly, you will soon, know who is in manifest error.","en.asad":"Say: \"He is the Most Gracious: we have attained to faith in Him, and in Him have we placed our trust; and in time you will come to know which of us was lost in manifest error.\"","en.daryabadi":"Say thou: He is the Compassionate; in Him we have believed, and in Him we have put our trust. -And anon ye will know who it is that is in error manifest.","en.hilali":"Say: \"He is the Most Beneficent (Allah), in Him we believe, and in Him we put our trust. So you will come to know who is it that is in manifest error.\"","en.pickthall":"Say: He is the Beneficent. In Him we believe and in Him we put our trust. And ye will soon know who it is that is in error manifest.","en.qaribullah":"Say: 'He is the Merciful. In Him we believe and in Him we put all our trust. Indeed, you shall soon know who is in clear error'","en.sahih":"Say, \"He is the Most Merciful; we have believed in Him, and upon Him we have relied. And you will [come to] know who it is that is in clear error.\"","en.sarwar":"Say, \"He is the Beneficent One in whom we have faith and trust. You will soon know who is in manifest error\".","en.yusufali":"Say: \"He is (Allah) Most Gracious: We have believed in Him, and on Him have we put our trust: So, soon will ye know which (of us) it is that is in manifest error.\"","en.maududi":"Say to them: “He is Merciful, and it is in Him that we believe, and it is in Him that we put all our trust. Soon will you know who is in manifest error.”","en.shakir":"Say: He is the Beneficent Allah, we believe in Him and on Him do we rely, so you shall come to know who it is that is in clear error.","en.itani":"Say, “He is the Compassionate. We have faith in Him, and in Him we trust. Soon you will know who is in evident error.”","en.mubarakpuri":"Say: \"He is the Most Gracious, in Him we believe, and upon Him we rely. So, you will come to know who it is that is in manifest error.\"","en.qarai":"Say, ‘He is the All-beneficent; we have faith in Him, and in Him do we trust. Soon you will know who is in manifest error.’","en.wahiduddin":"Say, \"He is the Most Gracious: we believe in Him and we put our trust in Him. You will soon come to know who is in evident error.\""},"tafsir":{"ar.muyassar":"قل: الله هو الرحمن صدَّقنا به وعملنا بشرعه، وأطعناه، وعليه وحده اعتمدنا في كل أمورنا، فستعلمون- أيها الكافرون- إذا نزل العذاب: أيُّ الفريقين منا ومنكم في بُعْدٍ واضح عن صراط الله المستقيم؟","ar.jalalayn":"«قل هو الرحمن آمنا به وعليه توكلنا فستعلمون» بالتاء والياء عند معاينة العذاب «من هو في ضلال مبين» بيِّن أنحن أم أنتم أم هم.","ar.qurtubi":"قوله تعالى : قل هو الرحمن آمنا به وعليه توكلنا فستعلمون من هو في ضلال مبين قوله تعالى : قل هو الرحمن آمنا به وعليه توكلنا فستعلمون قرأ الكسائي بالياء على الخبر ; ورواه عن علي . الباقون بالتاء على الخطاب . وهو تهديد لهم . ويقال : لم أخر مفعول آمنا وقدم مفعول توكلنا فيقال : لوقوع آمنا تعريضا بالكافرين حين ورد عقيب [ ص: 205 ] ذكرهم . كأنه قيل : آمنا ولم نكفر كما كفرتم . ثم قال \" وعليه توكلنا \" خصوصا لم نتكل على ما أنتم متكلون عليه من رجالكم وأموالكم ; قاله الزمخشري .\n","ar.miqbas":"قُلْ هُوَ الرَّحْمَنُ آَمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلَالٍ مُبِينٍ (29)هذا تكرير ثالث لفعل { قل } من قوله : { قل هو الذي أنشأكم } [ الملك : 23 ] الآية .وجاء هذا الأمر بقول يقوله لهم بمناسبة قوله : { أو رحمنا } [ الملك : 28 ] فإنه بعد أن سوَّى بين فرض إهلاك المسلمين وإحيائهم في أن أيّ الحالين فُرض لا يجيرهم معه أحد من العذاب ، أعقبه بأن المسلمين آمنوا بالرحمان ، فهم مظنة أن تتعلق بهم هذه الصفة فيرحمهم الله في الدنيا والآخرة ، فيعلم المشركون علم اليقين أيّ الفريقين في ضلال حين يرون أثر الرحمة على المسلمين وانتفاءه عن المشركين في الدنيا وخاصة في الآخرة .وضميرُ { هو } عائد إلى الله تعالى الواقع في الجملة قبله ، أي الله هو الذي وَصْفُه { الرحمان } فهو يرحمنا ، وأنكم أنكرتم هذا الاسم فأنتم أحرياء بأن تُحرَموا آثار رحمته . ونحن توكلنا عليه دون غيره وأنتم غرّكم عزّكم وجعلتم الأصنام معتمدكم ووكلاءكم .وبهذه التوطئة يقع الإيماء إلى الجانب المهتدي والجانب الضالّ من قوله : { فستعلمون من هو في ضلال مبين } لأنه يظهر بداءً تأمل أن الذين في ضلال مبين هم الذين جحدوا وصف { الرحمان } وتوكلوا على الأوثان .و { مَن } موصولة ، وما صْدَقُ { مَن } فريق مُبهم متردد بين فريقين تضمنهما قوله : { إن أهلكني الله ومَن معي } [ الملك : 28 ] وقوله : { فمن يجير الكافرين } [ الملك : 28 ] ، فأحد الفريقين فريق النبي صلى الله عليه وسلم ومن معه ، والآخر فريق الكافرين ، أي فستعلمون اتضاح الفريق الذي هو في ضلال مبين .وتقديم معمول { توكلنا } عليه لإفادة الاختصاص ، أي توكلنا عليه دون غيره تعريضاً بمخالفة حال المشركين إذ توكلوا على أصنامهم وأشركوها في التوكل مع الله ، أو نَسُوا التوكل على الله باشتغال فكرتهم بالتوجه إلى الْاصنام .وإنما لم يقدم معمول { آمنَّا } عليه فلم يقل : به آمنا لمُجرد الاهتمام إلى الإِخبار عن إيمانهم بالله لوقوعه عقب وصف الآخرين بالكفر في قوله : { فمن يجير الكافرين من عذاب أليم } [ الملك : 28 ] فإن هذا جواب آخر عن تمنّيهم له الهلاك سُلك به طريق التبكيت ، أي هو الرحمان يجيرنا من سوء ترومونه لنا لأننا آمنا به ولم نكْفر به كما كفرتم ، فلم يكن المقصود في إيراده نفي الإِشراك وإثبات التوحيد ، إذ الكلام في الإِهلاك والإنجاء المعبّر عنه ب { رَحِمنَا } [ الملك : 28 ] فجيء بجملة { ءامنا } على أصل مجرد معناها دون قصد الاختصاص ، بخلاف قوله : { وعليه توكلنا } لأن التوكل يقتضي منجياً وناصراً ، والمشركون متوكلون على أصنامهم وقوتهم وأموالهم ، فقيل : نحن لا نتكل على ما أنتم متكلون عليه ، بل على الرحمان وحده توكلنا .وفعل { فستعلمون } معلق عن العمل لمجيء الاستفهام بعده .وقرأ الجمهور { فستعلمون } بتاء الخطاب على أنه مما أمر بقوله الرسول صلى الله عليه وسلم وقرأه الكسائي بياء الغائب على أن يكون إخباراً من الله لرسوله بأنه سيعاقبهم عقاب الضالّين .\n","ar.waseet":"ثم أمره - سبحانه - للمرة الخامسة ، أن يبين لهم أنه هو وأصحابه معتمدون على الله - تعالى - وحده ، ومخلصون له العبادة والطاعة ، فقال : ( قُلْ هُوَ الرحمن آمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا . . )أى : وقل يا محمد لهؤلاء الجاحدين : إذا كنتم قد أشركتم معه الله - تعالى - آلهة أخرى فى العبادة ، فنحن على النقيض منكم ، لأننا أخلصنا عبادتنا للرحمن الذى أوجدنا برحمته ، وآمنا به إيمانا حقا ، وعليه وحده توكلنا وفوضنا أمورنا .وأخر - سبحانه - مفعول ( آمَنَّا ) وقدم مفعول ( تَوَكَّلْنَا ) للتعريض بالكافرين ، الذين أصروا على ضلالهم ، فكأنه يقول : نحن آمنا ولم نكفر كما كفرتم ، وتوكلنا عليه وحده ، ولم نتوكل على ما أنتم متوكلون عليه من أصنامكم وأموالكم وأولادكم . .وقوله ( فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلاَلٍ مُّبِينٍ ) مسوق مساق التهديد والوعيد أى : فستعلمون فى عاجل أمرنا وآجله ، أنحن الذين على الحق أم أنتم؟ ونحن الذين على الباطل أم أنتم؟فالمقصود بالآية الكريمة التهديد والإنذار ، مع إخراج الكلام مخرج الإِنصاف ، الذى يحملهم على التدبر والتفكر لو كانوا يعقلون .\n","ar.baghawi":"( قل هو الرحمن ) الذي نعبده ( آمنا به وعليه توكلنا فستعلمون ) قرأ الكسائي بالياء ، وقرأ الباقون بالتاء . ( من هو في ضلال مبين ) أي ستعلمون عند معاينة العذاب من الضال منا نحن أم أنتم ؟\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5270.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5270.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5270.mp3","format":"mp3","local_path":null}}},{"verse":30,"arabic":"قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَنْ يَأْتِيكُمْ بِمَاءٍ مَعِينٍ","transliteration":"Qul ara'aytum in asbaha maaa'ukum ghawran famai yaateekum bimaaa'im ma'een","translations":{"en.ahmedali":"Say: \"Just think: If your water were to dry up in the morning who will bring you water from a fresh, flowing stream?\"","en.ahmedraza":"Say, “What is your opinion – if in the morning all your water were to sink into the earth, then who is such who can bring you water flowing before you?”","en.arberry":"Say: 'What think you? If in the morning your water should have vanished into the earth, then who would bring you running water?'","en.asad":"Say [unto those who deny the truth]: \"What do you think? If of a sudden all your water were to vanish underground, who [but God] could provide you with water from [new] unsullied springs?\"","en.daryabadi":"Say thou: bethink ye, were your water to be sunk away, who then could bring you water welling-up?","en.hilali":"Say (O Muhammad SAW): \"Tell me! If (all) your water were to be sunk away, who then can supply you with flowing (spring) water?\"","en.pickthall":"Say: Have ye thought: If (all) your water were to disappear into the earth, who then could bring you gushing water?","en.qaribullah":"Say: 'What do you think. If your water should sink into the earth in the morning, who then would bring you running water'","en.sahih":"Say, \"Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?\"","en.sarwar":"Say, \"Have you not thought that if your water was to dry up, who would bring you water from the spring?\"","en.yusufali":"Say: \"See ye?- If your stream be some morning lost (in the underground earth), who then can supply you with clear-flowing water?\"","en.maududi":"Say to them: “Did you even consider: if all the water that you have (in the wells) were to sink down into the depths of the earth, who will produce for you clear, flowing water?”","en.shakir":"Say: Have you considered if your water should go down, who is it then that will bring you flowing water?","en.itani":"Say, “Have you considered? If your water drains away, who will bring you pure running water?”","en.mubarakpuri":"Say: \"Tell me! If (all) your water were to sink away, who then can supply you with flowing water\"","en.qarai":"Say, ‘Tell me, should your water sink down [into the ground], who will bring you running water?’","en.wahiduddin":"Say, \"Have you considered if your water were to sink  into the ground, who could then bring you flowing water?\""},"tafsir":{"ar.muyassar":"قل -أيها الرسول- لهؤلاء المشركين: أخبروني إن صار ماؤكم الذي تشربون منه ذاهبًا في الأرض لا تصلون إليه بوسيلة، فمَن غير الله يجيئكم بماء جارٍ على وجه الأرض ظاهر للعيون؟","ar.jalalayn":"(قل أرأيتم إن أصبح ماؤكم غورا) غائرا في الأرض (فمن يأتيكم بماء معين) جار تناله الأيدي والدلاء كمائكم، أي لا يأتي به إلا الله تعالى فكيف تنكرون أن يبعثكم؟ ويستحب أن يقول القارئ عقب \"\" معين \"\": الله رب العالمين، كما ورد في الحديث، وتليت هذه الآية عند بعض المتجبرين فقال: تأتي به الفؤوس والمعاول فذهب ماء عينه وعمي نعوذ بالله من الجراءة على الله وعلى آياته.","ar.qurtubi":"قوله تعالى : قل أرأيتم إن أصبح ماؤكم غورا فمن يأتيكم بماء معينقوله تعالى : قل أرأيتم يا معشر قريشإن أصبح ماؤكم غورا أي غائرا ذاهبا في الأرض لا تناله الدلاء . وكان ماؤهم من بئرين : بئر زمزم وبئر ميمون .فمن يأتيكم بماء معين أي جار ; قاله قتادة والضحاك . فلا بد لهم من أن يقولوا لا يأتينا به إلا الله ; فقل لهم لم تشركون به من لا يقدر على أن يأتيكم . يقال : غار الماء يغور غورا ; أي نضب . والغور : الغائر ; وصف بالمصدر للمبالغة ; كما تقول : رجل عدل ورضا . وقد مضى في سورة \" الكهف \" ومضى القول في المعنى في سورة \" المؤمنون \" والحمد لله . وعن ابن عباس : بماء معين أي ظاهر تراه العيون ; فهو مفعول . وقيل : هو من معن الماء أي كثر ; فهو على هذا فعيل . وعن ابن عباس أيضا أن المعنى فمن يأتيكم بماء عذب . والله أعلم .ختمت السورة والحمد لله رب العالمين\n","ar.miqbas":"قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَنْ يَأْتِيكُمْ بِمَاءٍ مَعِينٍ (30)إيماءٌ إلى أنهم يترقبهم عذاب الجوع بالقحط والجفاف فإن مكة قليلة المياه ولم تكن بها عيون ولا آبار قبل زمزم ، كما دل عليه خبر تعجب القافلة مِن ( جُرْهم ) التي مرّت بموضع مكة حين أسكنها إبراهيم عليه السلام هاجَر بابنه إسماعيل ففجَّر الله لها زمزم ولمحتْ القافلة الطير تحوم حول مكانها فقالوا : ما عهدنا بهذه الأرض ماء ، ثم حفَر ميمون بن خالد الحضرمي بأعلاها بئراً تسمى بئر ميمون في عهد الجاهلية قُبيل البعثة ، وكانت بها بئر أخرى تسمى الجَفْر ( بالجيم ) لبني تيم بن مُرة ، وبئر تسمى الجَم ذكرها ابن عطية وأهملها «القاموس» و«تاجه» ، ولعل هاتين البئرين الأخيرتين لم تكونا في عهد النبي صلى الله عليه وسلمفماء هذه الآبار هو الماء الذي أُنذروا بأنه يصبح غوراً ، وهذا الإِنذار نظير الواقع في سورة القلم ( 17 33 ) { إنا بلوناهم كما بلونا أصحاب الجنة } إلى قوله : لو كانوا يعلمون . !والغور : مصدر غارتْ البئر ، إذا نَزح ماؤها فلم تنله الدلاء .والمراد : مَاء البئر كما في قوله : { أو يصبح ماؤها غوراً } في ذكر جنة سورة الكهف ( 41 ) .وأصل الغور : ذهاب الماء في الأرض ، مصدر غار الماء إذا ذهب في الأرض ، والإِخبار به عن الماء من باب الوصف بالمصدر للمبالغة مثل : عَدل ورِضَى . والمعين : الظاهر على وجه الأرض ، والبئر المعينة : القريبة الماء على وجه التشبه .والاستفهام في قوله : فمن يأتيكم بماء } استفهام إنكاري ، أي لا يأتيكم أحد بماء مَعِين : أي غير الله واكتفي عن ذكره لظهوره من سياق الكلام ومن قوله قبله { أمَّن هذا الذي هو جند لكم ينصركم من دون الرحمان } [ الملك : 20 ] الآيتين .وقد أصيبوا بقحط شديد بعد خروج النبي صلى الله عليه وسلم إلى المدينة وهو المشار إليه في سورة الدخان . ومن المعلوم أن انحباس المطر يتبعه غور مياه الآبار لأن استمدادها من الماء النازل على الأرض ، قال تعالى : { ألم تَر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض } [ الزمر : 21 ] وقال : { وإنَّ من الحجارة لما يتفجر منه الأنهار وإنّ منها لما يشَّقّق فيخرج منه الماء } [ البقرة : 74 ] .ومن النوادر المتعلقة بهذه الآية ما أشار إليه في «الكشاف» مع ما نقل عنه في «بيانه» ، قال : وعن بعض الشُطَّار ( هو محمد بن زكرياء الطبيب كما بينه المصنف فيما نقل عنه ) أنها ( أي هذه الآية ) تُليت عنده فقال : تجيء به ( أي الماء ) الفُؤوس والمَعاول ، فذهب ماء عينيه . نعوذ بالله من الجرأة على الله وعلى آياته . والله أعلم .\n","ar.waseet":"ثم أمر - سبحانه - صلى الله عليه وسلم للمرة السادسة ، أن يذكرهم بنعمة الماء الذى يشربونه فقال : ( قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَآؤُكُمْ غَوْراً فَمَن يَأْتِيكُمْ بِمَآءٍ مَّعِينٍ ) .وقوله ( غَوْراً ) مصدر غارَت البئر ، إذا نضب ماؤها وجف . يقال : غار الماء يغورُ غورا ، إذا ذهب وزال . .والمعين : هو الماء الظاهر الذى تراه العيون ، ويسهل الحصول عليه ، وهو فعيل من معن إذا قرب وظهر .أى : وقل لهم - أيها الرسول الكريم - على سبيل التوبيخ وإلزام الحجة : أخبرونى إن أصبح ماؤكم غائرا فى الأرض ، بحيث لا يبقى له وجود أصلا .فمن يستطيع أن يأتيكم بماء ظاهر على وجه الأرض ، تراه عيونكم ، وتستعملونه فى شئونكم ومنافعكم .إنه لا أحد يستطيع ذلك إلا الله - تعالى - وحده ، فعليكم أن تشكروه على نعمه ، لكى يزيدكم منها .\n","ar.baghawi":"( قل أرأيتم إن أصبح ماؤكم غورا ) غائرا ذاهبا في الأرض لا تناله الأيدي والدلاء . قال الكلبي ومقاتل : يعني ماء زمزم ( فمن يأتيكم بماء معين ) ظاهر تراه العيون وتناله [ الأيدي ] والدلاء . وقال عطاء عن ابن عباس : معين أي جار .أخبرنا أبو سعيد الشريحي ، أخبرنا أبو إسحاق الثعلبي ، أخبرني أبو الحسن الفارسي ، حدثنا أبو عبد الله محمد بن يزيد ، حدثنا أبو يحيى البزاز ، حدثنا [ محمد بن يحيى ] حدثنا أبو داود ، حدثنا عمران ، عن قتادة ، عن عباس الجشمي ، عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : \" إن سورة من كتاب الله ما هي إلا ثلاثون آية شفعت لرجل فأخرجته من النار يوم القيامة وأدخلته الجنة ، وهي سورة تبارك \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5271.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5271.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5271.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":352,"letters":2554,"size":"245KB","priority":1,"commonlyRead":true}}