{"chapter":71,"name":{"arabic":"سورة 71","transliteration":"Chapter 71","translation":"Chapter 71","revelation":"unknown"},"revelation":"unknown","verses":28,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِنَّا أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ","transliteration":"Innaaa arsalnaa Noohan ilaa qawmihee an anzir qawmaka min qabli any yaatiyahum 'azaabun aleem","translations":{"en.ahmedali":"SENT NOAH to his people to warn them before the painful punishment came upon them.","en.ahmedraza":"Indeed We sent Nooh towards his people saying that, “Warn your people before the painful punishment comes upon them.”","en.arberry":"We sent Noah to his people, saying, 'Warn thy people, ere there come on them a painful chastisement.'","en.asad":"BEHOLD. We sent Noah unto his people. [saying:] \"Warn thy people ere grievous suffering befall them!","en.daryabadi":"Verily We! We sent Nuh Unto his people saying: warn thy people ere there come Unto them torment afflictive.","en.hilali":"Verily, We sent Nuh (Noah) to his people (Saying): \"Warn your people before there comes to them a painful torment.\"","en.pickthall":"Lo! We sent Noah unto his people (saying): Warn thy people ere the painful doom come unto them.","en.qaribullah":"We sent Noah to his nation, saying: 'Give warning to your nation before a painful punishment overtakes them'","en.sahih":"Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\"","en.sarwar":"We sent Noah to his people telling him, \"Warn your people before a painful torment approaches them\".","en.yusufali":"We sent Noah to his People (with the Command): \"Do thou warn thy People before there comes to them a grievous Penalty.\"","en.maududi":"We sent Noah to his people (and directed him): “Warn your people before a grievous chastisement comes upon them.”","en.shakir":"Surely We sent Nuh to his people, saying: Warn your people before there come upon them a painful chastisement.","en.itani":"We sent Noah to his people: “Warn your people before there comes upon them a painful punishment.”","en.mubarakpuri":"Verily, We sent Nuh to his people (saying): \"Warn your people before there comes to them a painful torment.\"","en.qarai":"Indeed We sent Noah to his people, [saying,] ‘Warn your people before a painful punishment overtakes them.’","en.wahiduddin":"We sent Noah forth to his people, saying, \"Warn your people before there comes upon them a grievous punishment.\""},"tafsir":{"ar.muyassar":"إنا بعثنا نوحا إلى قومه، وقلنا له: حذِّر قومك من قبل أن يأتيهم عذاب موجع. قال نوح: يا قومي إني نذير لكم بيِّن الإنذار من عذاب الله إن عصيتموه، وإني رسول الله إليكم فاعبدوه وحده، وخافوا عقابه، وأطيعوني فيما آمركم به، وأنهاكم عنه، فإن أطعتموني واستجبتم لي يصفح الله عن ذنوبكم ويغفر لكم، ويُمدد في أعماركم إلى وقت مقدر في علم الله تعالى، إن الموت إذا جاء لا يؤخر أبدًا، لو كنتم تعلمون ذلك لسارعتم إلى الإيمان والطاعة.","ar.jalalayn":"«إنا أرسلنا نوحا إلى قومه أَن أَنذر» أي بإنذار «قومك من قبل أن يأتيهم» إن لم يؤمنوا «عذاب أَليم» مؤلم في الدنيا والآخرة.","ar.qurtubi":"سورة نوحمكية ، وهي ثمان وعشرون آية .بسم الله الرحمن الرحيمإنا أرسلنا نوحا إلى قومه أن أنذر قومك من قبل أن يأتيهم عذاب أليمقد مضى القول في \" الأعراف \" أن نوحا عليه السلام أول رسول أرسل . ورواه قتادة عن ابن عباس عن النبي صلى الله عليه وسلم قال : \" أول رسول أرسل نوح وأرسل إلى جميع أهل الأرض \" . فلذلك لما كفروا أغرق الله أهل الأرض جميعا . وهو نوح بن لامك بن متوشلخ بن أخنوخ وهو إدريس بن يرد بن مهلايل بن أنوش بن قينان بن شيث بن آدم عليه السلام . قال وهب : كلهم مؤمنون . أرسل إلى قومه وهو ابن خمسين سنة . وقال ابن عباس : ابن أربعين سنة . وقال عبد الله بن شداد : بعث وهو ابن ثلاثمائة وخمسين سنة . وقد مضى في سورة \" العنكبوت \" القول فيه . والحمد لله .أن أنذر قومك أي بأن أنذر قومك ; فموضع أن نصب بإسقاط الخافض . وقيل : موضعها جر لقوة خدمتها مع \" أن \" . ويجوز \" أن \" بمعنى المفسرة فلا يكون لها موضع من الإعراب ; لأن في الإرسال معنى الأمر ، فلا حاجة إلى إضمار الباء . وقراءة عبد الله \" أنذر قومك \" بغير \" أن \" بمعنى قلنا له أنذر قومك . وقد تقدم معنى الإنذار في أول \" البقرة \" .من قبل أن يأتيهم عذاب أليم قال ابن عباس : يعني عذاب النار في الآخرة . [ ص: 274 ] وقال الكلبي : هو ما نزل عليهم من الطوفان . وقيل : أي أنذرهم العذاب الأليم على الجملة إن لم يؤمنوا . فكان يدعو قومه وينذرهم فلا يرى منهم مجيبا ; وكانوا يضربونه حتى يغشى عليه فيقول ( رب اغفر لقومي فإنهم لا يعلمون ) . وقد مضى هذا مستوفى في سورة \" العنكبوت \" والحمد لله .\n","ar.miqbas":"إِنَّا أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ (1)افتتاح الكلام بالتوكيد للاهتمام بالخبر إذ ليس المقام لرد إنكار منكر ، ولا دفع شك عن متردد في هذا الكلام . وكثيراً ما يَفتتح بلغاء العرب أول الكلام بحرف التوكيد لهذا الغرض وربما جعلوا ( إن ) دَاخلةً على ضمير الشأن في نحو قوله تعالى : { إنه من سليمان وإِنه باسم الله الرحمان الرحيم * أن لا تعلوا علي } الآية [ النمل : 30 ، 31 ] .وذكْر نوح عليه السلام مضى في سورة آل عمران . وتقدم أن هذا الاسم غير عربي ، وأنه غير مشتق من مادة النّوح .و { أن أنذر قومك } إلى آخره هو مضمون ما أرسل به نوح إلى قومه ، ف { أنْ } تفسيرية لأنها وقعت بعد { أرسلنا } . وفيه معنى القول دون حروفه . ومعنى { من قِبْل أن يأتيهم عذاب أليم } أنه يخوفهم غضب الله تعالى عليهم إذ عبدوا الأصنام ولم يتقوا الله ولم يطيعوا ما جاءهم به رسوله ، فأمره الله أن ينذرهم عذاباً يأتيهم من الله ليكون إنذاره مقدّماً على حلول العذاب . وهذا يقتضي أنه أُمر بأن يعلمهم بهذا العذاب ، وأن الله وقَّته بمدة بقائهم على الشرك بعد إبلاغ نوح إليهم ما أُرسل به في مدة يقع الإِبلاغ في مثلها ، فحذف متعلّق فعل { أنذر } لدلالة ما يأتي بعده من قوله : { أن اعبدوا الله واتقوه وأطيعون } [ نوح : 3 ] .وحرف { مِنْ } زائد للتوكيد ، أي قبلَ أن يأتيهم عذاب فهي قبليَّة مؤكدة وتأكيدها باعتبار تحقيق ما أضيف إليه { قبل } .و«قوم نوح» هم الناس الذين كانوا عامرين الأرضَ يومئذٍ ، إذ لا يوجد غيرهم على الأرض كما هو ظاهر حديث الشفاعة وذلك صريح ما في التوراة .والقوم : الجماعة من الناس الذين يجمعهم موطن واحد أو نسب واحد برجالهم ونسائهم وأطفالهم .وإضافة ( قوم ) إلى ضمير { نوح } لأنه أرسل إليهم فلهم مزيد اختصاص به ، ولأنه واحد منهم وهم بيَن أبناءٍ لَه وأنسباءٍ فإضافتهم إلى ضميره تعريف لهم إذ لم يكن لهم اسم خاص من أسماء الأمم الواقعة من بعد .وعُدل عن أن يقال له : أنذر الناس إلى قوله : { أنذر قومك } إلهاباً لنفس نوح ليكون شديد الحرص على ما فيه نجاتهم من العذاب ، فإن فيهم أبناءه وقرابته وأحبته ، وهم عدد تكوّن بالتوالد في بني آدم في مدة ستمائة سنة من حلول جنس الإنسان على الأرض . ولعل عددهم يوم أرسل إليهم نوح لا يتجاوز بضعة آلاف .\n","ar.waseet":"قصة نوح - عليه السلام - مع قومه ، قد وردت في سور متعددة منها : سورة الأعراف ، ويونس ، وهود ، والشعراء ، والعنكبوت .وينتهى نسب نوح - عليه السلام - إلى شيث بن آدم ، وقد ذكر نوح فى القرآن فى ثلاثة وأربعين موضعا .وكان قوم نوح يعبدون الأصنام ، فأرسل الله - تعالى - إليهم نوحا ليدلهم على طريق الرشاد .وقد افتتحت السورة هنا بالأسلوب المؤكد بإنَّ ، للاهتمام بالخبر ، وللاتعاظ بما اشتملت عليه القصة من هدايات وإرشادات .وأن فى قوله ( أَنْ أَنذِرْ قَوْمَكَ ) تفسيرية ، لأنها وقعت بعد أرسلنا ، والإِرسال فيه معنى القول دون حروفه ، فالجملة لا محل لها من الإعراب .ويصح أن تكون مصدرية ، أى : بأن أنذر قومك . . والإِنذار ، هو الإخبار الذى معه تخويف .وقوم الرجل : هم أهله وخاصته الذين يجتمعون معه فى جد واحد . وقد يقيم الرجل بين الأجانب . فيسميهم قومه على سبيل المجاز للمجاورة .أى : إنا قد اقتضت حكمتنا أن نرسل نوحا - عليه السلام - إلى قومه ، وقلنا له : يا نوح عليك أن تنذرهم وتخوفهم من عذابنا ، وأن تدعوهم إلى إخلاص العبادة لنا ، من قبل أن ينزل بهم عذاب مؤلم ، لا طاقة لهم بدفعه ، لأن هذا العذاب من الله - تعالى - الذى لا راد لقضائه ، ولا معقب لحكمه .وقال - سبحانه - ( أَنْ أَنذِرْ قَوْمَكَ ) ولم يقل : أن أنذر الناس ، لإِثارة حماسته فى دعوته ، لأن قوم الرجل يحرص الإِنسان على منفعتهم . . أكثر من حرصه على منفعهة غيرهم .والآية الكريمة صريحة فى أن ما أصاب قوم نوح من عذاب أليم ، كان بسبب إصرارهم على كفرهم ، وعدم استماعهم إلى إنذاره لهم .\n","ar.baghawi":"مكية( إنا أرسلنا نوحا إلى قومه أن أنذر قومك ) أي : بأن أنذر قومك ( من قبل أن يأتيهم عذاب أليم ) المعنى : إنا أرسلناه لينذرهم بالعذاب إن لم يؤمنوا .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5420.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5420.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5420.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ","transliteration":"Qaala yaa qawmi innee lakum nazeerum mubeen","translations":{"en.ahmedali":"He said: \"O my people, I warn you clearly","en.ahmedraza":"He said, “O my people! I am indeed a Herald of clear warnings to you.”","en.arberry":"He said, 'O my people, I am unto you a clear warner,","en.asad":"[And Noah] said: \"O my people! I am but a plain warner to you, [sent to tell you]","en.daryabadi":"He said: O my people! verily I am Unto you a warner manifest.","en.hilali":"He said: \"O my people! Verily, I am a plain warner to you,","en.pickthall":"He said: O my people! Lo! I am a plain warner unto you","en.qaribullah":"He said: 'My nation, I am a clear warner for you.","en.sahih":"He said, \"O my people, indeed I am to you a clear warner,","en.sarwar":"Noah said, \"My people, I am warning you plainly.","en.yusufali":"He said: \"O my People! I am to you a Warner, clear and open:","en.maududi":"Noah said: “My people, I have certainly been sent as a clear warner to you,","en.shakir":"He said: O my people! Surely I am a plain warner to you:","en.itani":"He said, “O my people, I am to you a clear warner.","en.mubarakpuri":"He said: \"O my people! Verily, I am a plain warner to you,\"","en.qarai":"He said, ‘O my people! Indeed, I am a manifest warner to you.","en.wahiduddin":"[Noah] said, \"My people! I am but a plain warner to you,"},"tafsir":{"ar.muyassar":"إنا بعثنا نوحا إلى قومه، وقلنا له: حذِّر قومك من قبل أن يأتيهم عذاب موجع. قال نوح: يا قومي إني نذير لكم بيِّن الإنذار من عذاب الله إن عصيتموه، وإني رسول الله إليكم فاعبدوه وحده، وخافوا عقابه، وأطيعوني فيما آمركم به، وأنهاكم عنه، فإن أطعتموني واستجبتم لي يصفح الله عن ذنوبكم ويغفر لكم، ويُمدد في أعماركم إلى وقت مقدر في علم الله تعالى، إن الموت إذا جاء لا يؤخر أبدًا، لو كنتم تعلمون ذلك لسارعتم إلى الإيمان والطاعة.","ar.jalalayn":"«قال يا قوم إني لكم نذير مبين» بيِّن الإنذار.","ar.qurtubi":"قوله تعالى : قال يا قوم إني لكم نذير أي مخوف .\" مبين \" أي مظهر لكم بلسانكم الذي تعرفونه .\n","ar.miqbas":"قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ (2) { قَالَ ياقوم إِنِّى لَكُمْ نَذِيرٌ مُّبِينٌ * أَنِ اعبدوا الله واتقوه وَأَطِيعُونِ * يَغْفِرْ لَكُمْ مِّن ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إلى أَجَلٍ مُّسَمًّى } .لم تعطف جملة { قال يا قوم } بالفاء التفريعية على جملة { أرسلنا نوحاً إلى قومه } [ نوح : 1 ] لأنها في معنى البيان لجملة { أنذر قومك } [ نوح : 1 ] لدلالتها على أنه أنذر قومه بما أمره الله أن يقوله لهم ، وإنما أُدمج فيه فعل قول نوح للدلالة على أنه أُمر أن يقول فقال ، تنبيهاً على مبادرة نوح لإِنذار قومه في حين يلوغ الوحي إليه من الله بأن ينذر قومه .ولك أن تجعلها استئنافاً بيانياً لجواب سؤال السامع أن يسأل ماذا فعل نوح حين أرسل الله إليه { أن أنذر قومك ، وهما متقاربان .وافتتاح دعوته قومَه بالنداء لطلب إقبال أذهانهم ونداؤهم بعنوان : أنهم قومه ، تمهيد لقبول نصحه إذ لا يريد الرجل لقومه إلاّ ما يريد لنفسه . وتصدير دعوته بحرف التوكيد لأن المخاطبين يترددون في الخبر .والنذير : المنذر غير جار على القياس ، وهو مثل بشير ، ومثل حكيم بمعنى محكم ، وأليم بمعنى مؤلم ، وسميع بمعنى مسمع ، في قول عَمرو بن معديكرب :أمِنْ ريْحانةَ الداعي السميع ... وقد تقدم في أول سورة البقرة ( 10 ) عند قوله : { ولهم عذاب أليم } وحذف متعلق { نذير }\n","ar.waseet":"ثم حكى - سبحانه - بعد ذلك ما قاله نوح لقومه فقال : ( قَالَ ياقوم إِنِّي لَكُمْ نَذِيرٌ مُّبِينٌ . أَنِ اعبدوا الله واتقوه وَأَطِيعُونِ ) .أى : قال نوح لقومه -على سبيل التلطف فى النصح ، والتقرب إلى قلوبهم - يا قوم ويا أهلى وعشيرتى : إنى لكم منذر واضح الإِنذار ، ولا أسألكم على هذا الإِنذار الخالص أجرا ، وإنما ألتمس أجرى من الله .وإنى آمركم بثلاثة أشياء : أن تخلصوا لله - تعالى - العبادة ، وأن تتقوه فى كل أقوالكم وأفعالكم ، وأن تطيعونى فى كل ما آمركم به وأنهاكم عنه .وافتتح كلامه معهم بالنداء ( قَالَ ياقوم ) ، أملا فى لفت أنظارهم إليه ، واستجابتهم له ، فإن النداء من شأنه التنبيه للمنادىَ .ووصف إنذاره لهم بأنه ( مُّبِينٌ ) ، ليشعرهم بأنه لا لبس فى دعوته لهم إلى الحق ، ولا خفاء فى كونهم يعرفونه ، ويعرفون حرصه على منفعتهم . .وقال : ( إِنِّي لَكُمْ ) للإِشارة إلى أن فائدة استجابتهم له ، تعود عليهم لا عليه ، فهو مرسل من أجل سعادتهم وخيرهم .\n","ar.baghawi":"\"قال يا قوم إني لكم نذير مبين\"، أنذركم وأبين لكم رسالة الله بلغة تعرفونها.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5421.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5421.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5421.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ","transliteration":"Ani'udul laaha watta qoohu wa atee'oon","translations":{"en.ahmedali":"That you should worship God and fear Him, and follow me","en.ahmedraza":"“That you must worship Allah and fear Him, and obey me.”","en.arberry":"saying, \"Serve God, and fear Him, and obey you me,","en.asad":"that you should worship God [alone] and be conscious of Him. \"Now do pay heed unto me,","en.daryabadi":"Worship Allah, and fear Him, and obey me.","en.hilali":"\"That you should worship Allah (Alone), be dutiful to Him, and obey me,","en.pickthall":"(Bidding you): Serve Allah and keep your duty unto Him and obey me,","en.qaribullah":"Worship Allah, fear Him, and obey me.","en.sahih":"[Saying], 'Worship Allah, fear Him and obey me.","en.sarwar":"Worship God, have fear of Him and obey me.","en.yusufali":"\"That ye should worship Allah, fear Him and obey me:","en.maududi":"that you serve Allah and fear Him, and follow me;","en.shakir":"That you should serve Allah and be careful of (your duty to) Him and obey me:","en.itani":"Worship God and reverence Him, and obey me.","en.mubarakpuri":"\"That you should worship Allah, and have Taqwa of Him, and obey me,\"","en.qarai":"Worship Allah and be wary of Him, and obey me,","en.wahiduddin":"that you should worship God [alone] and be conscious of Him. Pay heed to me."},"tafsir":{"ar.muyassar":"إنا بعثنا نوحا إلى قومه، وقلنا له: حذِّر قومك من قبل أن يأتيهم عذاب موجع. قال نوح: يا قومي إني نذير لكم بيِّن الإنذار من عذاب الله إن عصيتموه، وإني رسول الله إليكم فاعبدوه وحده، وخافوا عقابه، وأطيعوني فيما آمركم به، وأنهاكم عنه، فإن أطعتموني واستجبتم لي يصفح الله عن ذنوبكم ويغفر لكم، ويُمدد في أعماركم إلى وقت مقدر في علم الله تعالى، إن الموت إذا جاء لا يؤخر أبدًا، لو كنتم تعلمون ذلك لسارعتم إلى الإيمان والطاعة.","ar.jalalayn":"«أن» أي بأن أقول لكم «اعبدوا الله واتقوه وأطيعون».","ar.qurtubi":"أن اعبدوا الله واتقوه و \" أن \" المفسرة على ما تقدم في \" أن أنذر \" . اعبدوا أي وحدوا . واتقوا : خافوا .وأطيعون أي فيما آمركم به ، فإني رسول الله إليكم .\n","ar.miqbas":"أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ (3) لدلالة قوله : { أن اعبدوا الله واتقوه وأطيعون } عليه . والتقدير : إنّي لكم نذير بعذاب أليم إن لم تعبدوا الله ولم تتقُوه ولم تطيعوني .والمبين : يجوز أن يكون من أبان المتعدّي الذي مجرده بَانَ ، أي مُوَضِّح أو مِن أبان القاصر ، الذي هو مرادف بَان المجردِ ، أي نذير وَاضح لكم أني نذير ، لأني لا أجتني من دعوتكم فائدة من متاع الدنيا وإنما فائدة ذلك لكم ، وهذا مثل قوله في سورة الشعراء ( 109 ، 110 ) { وما أسألكم عليه من أجر إن أجري إلاّ على ربّ العالمين فاتقوا الله وأطيعون . } وتقديم { لكم } على عامله وهو { نذير } للاهتمام بتقديم ما دلت عليه اللام من كون النذارة لفائدتهم لا لفائدته .فجمع في صدر دعوته خمسة مؤكدات ، وهي : النداءُ وجعلُ المنادَى لفظ { يا قوم } المضاف إلى ضميره ، وافتتاحُ كلامه بحرف التأكيد ، واجتلابُ لام التعليل ، وتقديمُ مجرورها .و { أن } في { أن اعبدوا } تفسيرية لأن وصف { نذير } فيه معنى القول دون حروفه ، وأمرهم بعبادة الله لأنهم أعرضوا عنها ونسوها بالتمحض لأصنامهم ، وكان قوم نوح مشركين كما دل عليه قوله تعالى في سورة يونس ( 71 ) { فأجمِعوا أمركم وشرُكاءكم } وبذلك كان تمثيل حال المشركين من العرب بحال قوم نوح تمثيلاً تاماً .واتقاء الله اتقاء غضبه ، فهذا من تعليق الحكم باسم الذات . والمراد : حال من أحوال الذات من باب { حرمت عليكم الميتة } [ المائدة : 3 ] أي أكلها ، أي بأن يعلموا أنه لا يرضى لعباده الكفر به . وطاعتهم لنوح هي امتثالهم لما دعاهم إليه من التوحيد وقد قال المفسرون : لم يكن في شريعة نوح إلاّ الدعوةُ إلى التوحيد فليس في شريعته أعمال تُطلب الطاعة فيها ، لكن لم تخل شريعة إلهية من تحريم الفواحش مثل قتل الأنفس وسلب الأموال\n","ar.waseet":"وأمرهم بطاعته ، بعد أمرهم بعبادة الله وتقواه ، لأن طاعتهم له هى طاعة الله - تعالى - كما قال - تعالى - : ( مَّنْ يُطِعِ الرسول فَقَدْ أَطَاعَ الله ).\n","ar.baghawi":"\"أن اعبدوا الله واتقوه وأطيعون\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5422.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5422.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5422.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ ۖ لَوْ كُنْتُمْ تَعْلَمُونَ","transliteration":"Yaghfir lakum min zunoobikum wa yu'akhkhirkum ilaaa ajalim musammaa; innaa ajalal laahi izaa jaaa'a laa yu'akhkhar; law kuntum ta'lamoon","translations":{"en.ahmedali":"That He may forgive some of your sins and prolong your term till an appointed time. Surely when God's appointed time is come it will not be put off, if only you knew!","en.ahmedraza":"“He will forgive you some of your sins, and give you respite up to an appointed term; indeed the promise of Allah cannot be averted when it arrives; if only you knew.”","en.arberry":"and He will forgive you your sins, and defer you to a stated term; God's term, when it comes, cannot be deferred, did you but know.\"'","en.asad":"so that He may forgive you some of your sins, and grant you respite until a term known [to Him alone]: but, behold, when the term appointed by God does come, it can never be put back - if you but knew it!\"","en.daryabadi":"He will forgive you your sins, and will defer you to an appointed term. Verily the term of Allah when it cometh shall not be deferred, if ye but knew.","en.hilali":"\"He (Allah) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but knew.\"","en.pickthall":"That He may forgive you somewhat of your sins and respite you to an appointed term. Lo! the term of Allah, when it cometh, cannot be delayed, if ye but knew.","en.qaribullah":"He will forgive you your sins and respite you till an appointed term. When the term of Allah arrives it cannot be deferred; if you but knew'","en.sahih":"Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"","en.sarwar":"He will forgive your sins and give you a respite for an appointed time. When the time which God has appointed arrives, none will be able to postpone it. Would that you knew this!\"","en.yusufali":"\"So He may forgive you your sins and give you respite for a stated Term: for when the Term given by Allah is accomplished, it cannot be put forward: if ye only knew.\"","en.maududi":"He will forgive your sins and will grant you respite until an appointed term. Indeed when Allah's appointed term comes, it cannot be deferred; if you only knew!”","en.shakir":"He will forgive you some of your faults and grant you a delay to an appointed term; surely the term of Allah when it comes is not postponed; did you but know!","en.itani":"And He will forgive you of your sins, and reprieve you until a stated term. God’s term cannot be deferred once it has arrived, if you only knew.”","en.mubarakpuri":"\"He will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but know.\"","en.qarai":"that He may forgive you some of your sins and respite you until a specified time. Indeed when Allah’s [appointed] time comes, it cannot be deferred, if you know.’","en.wahiduddin":"He will forgive your sins and will grant you respite till an appointed time. When the time appointed by God arrives, it cannot be postponed, if you only knew.\""},"tafsir":{"ar.muyassar":"إنا بعثنا نوحا إلى قومه، وقلنا له: حذِّر قومك من قبل أن يأتيهم عذاب موجع. قال نوح: يا قومي إني نذير لكم بيِّن الإنذار من عذاب الله إن عصيتموه، وإني رسول الله إليكم فاعبدوه وحده، وخافوا عقابه، وأطيعوني فيما آمركم به، وأنهاكم عنه، فإن أطعتموني واستجبتم لي يصفح الله عن ذنوبكم ويغفر لكم، ويُمدد في أعماركم إلى وقت مقدر في علم الله تعالى، إن الموت إذا جاء لا يؤخر أبدًا، لو كنتم تعلمون ذلك لسارعتم إلى الإيمان والطاعة.","ar.jalalayn":"«يغفر لكم من ذنوبكم» من زائدة فإن الإسلام يغفر به ما قبله، أو تبعيضية لإخراج حقوق العباد «ويؤخركم» بلا عذاب «إلى أجل مسمى» أجل الموت «إن أجل الله» بعذابكم إن لم تؤمنوا «إذا جاء لا يؤخر لو كنتم تعلمون» ذلك لآمنتم.","ar.qurtubi":"يغفر لكم من ذنوبكم جزم يغفر بجواب الأمر . و \" من \" صلة زائدة . ومعنى الكلام يغفر لكم ذنوبكم ، قاله السدي . وقيل : لا يصح كونها زائدة ; لأن \" من \" لا تزاد في الواجب ، وإنما هي هنا للتبعيض ، وهو بعض الذنوب ، وهو ما لا يتعلق بحقوق المخلوقين . وقيل : هي لبيان الجنس . وفيه بعد ، إذ لم يتقدم جنس يليق به . وقال زيد بن أسلم : المعنى يخرجكم من ذنوبكم . ابن شجرة : المعنى يغفر لكم من ذنوبكم ما استغفرتموه منهاويؤخركم إلى أجل مسمى قال ابن عباس : أي ينسئ في أعماركم . ومعناه أن الله تعالى كان قضى قبل خلقهم أنهم إن آمنوا بارك في أعمارهم ، وإن لم يؤمنوا عوجلوا بالعذاب . وقال مقاتل : يؤخركم إلى منتهى آجالكم في عافية ; فلا يعاقبكم بالقحط وغيره . فالمعنى على هذا يؤخركم من العقوبات والشدائد إلى آجالكم . وقال الزجاج أي يؤخركم عن العذاب فتموتوا غير موتة المستأصلين بالعذاب . وعلى هذا قيل : أجل مسمى عندكم تعرفونه ، لا يميتكم غرقا ولا حرقا ولا قتلا ; ذكره الفراء . وعلى القول الأول أجل مسمى عند الله .إن أجل الله إذا جاء لا يؤخر أي إذا جاء الموت لا يؤخر بعذاب كان أو بغير عذاب . وأضاف الأجل إليه سبحانه لأنه الذي أثبته . وقد يضاف إلى القوم ، كقوله تعالى : فإذا جاء أجلهم [ ص: 275 ] لأنه مضروب لهم .\" لو \" بمعنى إن . أي إن كنتم تعلمون . وقال الحسن : معناه لو كنتم تعلمون لعلمتم أن أجل الله إذا جاءكم لم يؤخر .\n","ar.miqbas":"يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَى أَجَلٍ مُسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ لَوْ كُنْتُمْ تَعْلَمُونَ (4)، فقوله : { يغفر لكم من ذنوبكم } ينصرف بادىء ذي بدء إلى ذنوب الإِشراك اعتقاداً وسجوداً .وجَزْمُ { يغفر لكم من ذنوبكم } في جواب الأوامر الثلاثة { اعبدوا الله واتقوه وأطيعون } ، أي إن تفعلوا ذلك يغفر الله لكم من ذنوبكم . وهذا وعد بخير الآخرة .وحرف { مِن } زائد للتوكيد ، وهذا من زيادة { مِن } في الإيجاب على رأي كثير من أيمة النحو مثل الأخفش وأبي علي الفارسي وابن جنيّ من البصريين وهو قول الكسائي وجميععِ نحاة الكوفة . فيفيد أن الإيمان يَجُبُّ ما قبله في شريعة نوح مثل شريعة الإِسلام .ويجوز أن تكون { مِن } للتبعيض ، عند من أثبت ذلك وهو اختيار التفتزاني ، أي يغفر لكم بعض ذنوبكم ، أي ذنوب الإِشراك وما معه ، فيكون الإيمان في شرع نوح لا يقتضي مغفرة جميع الذنوب السابقة ، وليس يلزم تماثل الشرائع في جميع الأحكام الفرعية ، ومغفرةُ الذنوب من تفاريع الدين وليست من أصوله . وقال ابن عطية : معنى التبعيض : مغفرة الذنوب السابقة دون ما يذنبون من بعد . وهذا يتم ويحسن إذا قدرنا أن شريعة نوح تشتمل على أوامر ومنهيات عملية فيكون ذكر { مِن } التبعيضية اقتصاداً في الكلام بالقدر المحقق .وأما قوله : { ويؤخركم إلى أجل مسمى } فهو وعد بخير دنيوي يستوي الناس في رغبته ، وهو طول البقاء فإنه من النعم العظيمة لأن في جبلة الإِنسان حُب البقاء في الحياة على ما في الحياة من عوارضَ ومكدرات . وهذا ناموس جعله الله تعالى في جبلة الإِنسان لتجري أعمال الناس على ما يعين على حفظ النوع . قال المعري :وكلّ يريدُ العيشَ والعيشُ حَتفُه ويستعْذِبُ اللذاتتِ وهي سِمَام ... والتأخيرُ : ضد التعجيل ، وقد أطلق التأخير على التمديد والتوسيع في أجل الشيء .وقد أشعر وعدُه إياهم بالتأخير أنه تأخير مجموعهم ، أي مجموع قومه لأنه جُعل جزاءً لكل من عَبدَ الله منهم واتقاه وأطاع الرسول ، فدل على أنه أنذرهم في خلال ذلك باستئصال القوم كلهم ، وأنهم كانوا على علم بذلك كما أشار إليه قوله : { أن أنذر قومك من قبل أن يأتيهم عذاب أليم } [ نوح : 1 ] كما تقدم آنفاً ، وكما يفسره قوله تعالى في سورة هود ( 38 ) { ويصنَعُ الفلك وكلَّما مرّ عليه ملأ من قومه سَخِروا منه } أي سخروا من الأمر الذي يصنع الفلك للوقاية منه وهو أمر الطوفان ، فتعين أن التأخير المراد هنا هو عدم استئصالهم . والمعنى : ويؤخر القوم كلهم إلى أجل مسمى وهو آجال إشخاصهم وهي متفاوتة .والأجل المسمى : هو الأجل المعين بتقدير الله عند خلقةِ كل أحد منهم ، فالتنوين في { أجل } للنوعية ، أي الجنس ، وهو صادق على آجال متعددة بعدد أصحابها كما قال تعالى :{ ومنكم من يتوفى ومنكم من يُرَدّ إلى أرذل العمر } [ الحج : 5 ] .ومعنى { مسمى } أنه محدد معيّن وهو ما في قوله تعالى : { وأجل مسمى عنده } في سورة الأنعام ( 2 ) .فالأجل المسمى : هو عمر كل واحد ، المعيّنُ له في سَاعةِ خلْقه المشار إليه في الحديث أن المَلَك يؤمر بكتب أجل المخلوق عندما يَنفُخ فيه الروحَ ، واستعيرت التسمية للتعيين لشَبه عدم الاختلاط بين أصحاب الآجال .والمعنى : ويؤخركم فلا يعجل بإهلاككم جميعاً فيؤخر كل أحد إلى أجله المعيّن له على تفاوت آجالهم .فمعنى هذه الآية نظير معنى آية سورة هود ( 3 ) { وأن استغفروا ربكم ثم توبوا إليه يمتّعْكم متاعاً حسناً إلى أجللٍ مسمّى } وهي على لسان محمد صلى الله عليه وسلم .{ إِنَّ أَجَلَ الله إِذَا جَآءَ لاَ يُؤَخَّرُ لَوْ كُنتُمْ } .يحتمل أن تكون هذه الجملة تعليلاً لقوله : { ويؤخرْكم إلى أجل مسمى ، } أي تعليلاً للربط الذي بين الأمر وجزائه من قوله : { أن اعبدوا الله } إلى قوله : { ويؤخِّركم } الخ لأن الربط بين الأمْر وجوابِه يعطي بمفهومه معنى : إِنْ لا تعبدوا الله ولا تتقوه ولا تطيعوني لا يغفر لكم ولا يؤخركم إلى أجل مسمى ، فعُلل هذا الربط والتلازم بين هذا الشرط المقدر وبين جزائه بجملة { إنّ أجل الله إذا جاء لا يؤخر } ، أي أن الوقت الذي عيّنه الله لحلول العذاب بكم إن لم تعبدوه ولم تطيعون إذا جاء إِبَّانه باستمراركم على الشرك لا ينفعكم الإِيمان ساعتئذٍ ، كما قال تعالى : { فلولا كانت قرية آمنت فنفعها إيمانها إلاّ قوم يونس لما ءامنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين } [ يونس : 98 ] ، فيكون هذا حثاً على التعجيل بعبادة الله وتقواه .فالأجَل الذي في قوله : { إن أجل الله إذا جاء لا يؤخر } غير الأجل الذي في قوله : { ويؤخركم إلى أجللٍ مسمى } ويُناسِب ذلك قولُه عقبه { لو كنتم تعلمون } المقتضي أنهم لا يعلمون هذه الحقيقة المتعلقة بآجال الأمم المعيَّنة لاستئصالهم ، وأما عدم تأخير آجال الأعمار عند حلولها فمعلوم للناس مشهور في كلام الأولين . وفي إضافة { أجل } إلى اسم الجلالة في قوله : { إن أجل الله إذا جاء لا يؤخر } إيماء إلى أنه ليس الأجل المعتاد بل هو أجل عيّنه الله للقوم إنذاراً لهم ليؤمنوا بالله . ويحتمل أن تكون الجملة استئنافاً بيانياً ناشئاً عن تحديد غاية تأخيرهم إلى أجل مسمى ، أي دون تأخيرهم تأخيراً مستمراً فيسأل السامع في نفسه عن علة تنهية تأخيرهم بأجل آخر فيكون أجل الله غير الأجل الذي في قوله : { إلى أجل مسمى } .ويحتمل أن تكون الجملة تعليلاً لكلا الأجلين : الأجل المفاد من قوله : { من قبل أن يَأتيهُم عذابٌ أليم } [ نوح : 1 ] فإن لفظ { قبل } يؤذن بأن العذاب موقت بوقت غير بعيد فله أجل مُبْهم غير بعيد ، والأجَل المذكورِ بقوله : { ويؤخركم إلى أجل مسمى } فيكون أجل الله صادقاً على الأجل المسمى وهو أجل كل نفس من القوم .وإضافته إلى الله إضافة كشف ، أي الأجل الذي عينه الله وقدره لكل أحد .وبهذا تعلم أنه لا تعارض بين قوله : { ويؤخركم إلى أجل مسمى } وبين قوله : { إن أجل الله إذا جاء لا يؤخر } إما لاختلاف المراد بلفظيّ ( الأجل ) في قوله : { إلى أجل مسمى } وقوله : { إن أجل الله إذا جاء لا يؤخر ، } وإما لاختلاف معنيي المجيء ومعنيي التأخير في قوله : { إذا جاءَ لا يؤخر } فانفكت جهة التعارض .أما مسألة تأخير الآجال والزيادة في الأعمار والنقص منها وتوحيد الأجل عندنا واضطراب أقوال المعتزلة في هل للإِنسان أجل واحد أو أجلان فتلك قضية أخرى ترتبط بأصلين : أصل العلم الإلهي بما سيكون ، وأصل تقدير الله للأسباب وترتُّب مسبباتها عليها .فأما ما في علم الله فلا يتغير قال تعالى : { وما يعمَّر من معمَّر ولا يُنقص من عمره إلاّ في كتاب } [ فاطر : 11 ] أي في علم الله ، والناس لا يطلعون على ما في علم الله .وأما وجودُ الأسباب كلها كأسباب الحياة ، وترتبُ مسبباتها عليها فيتغير بإيجاد الله مغيِّراتتٍ لم تكن موجودة إكراماً لبعض عباده أو إهانة لبعض آخر . وفي الحديث صدقة المرء المُسلم تزيد في العُمر . وهو حديث حسن مقبول . وعن علي عن النبي صلى الله عليه وسلم من سره أن يُمد في عمره فليتق الله وليصِل رحمه . وسنده جيد . فآجال الأعمار المحددة بالزمان أو بمقدار قوة الأعضاء وتناسب حركاتها قابلة للزيادة والنقص . وآجال العقوبات الإلهية المحددة بحصول الأعمال المعاقب عليها بوقت قصير أو فيه مُهلة غير قابلة للتأخير وهي ما صْدَقُ قوله : { إن أجل الله إذا جاء لا يؤخر } وقد قال الله تعالى : { يمحو الله ما يشاء ويثبت وعنده أم الكتاب } [ الرعد : 39 ] على أظهر التأويلات فيه وما في علم الله من ذلك لا يخالف ما يحصل في الخارج .فالذي رغَّب نوحٌ قومَه فيه هو سبب تأخير آجالهم عند الله فلو فعلوه تأخرتْ آجالهم وبتأخيرها يتبين أن قد تقرر في علم الله أنهم يعملون ما يدعوهم إليه نوح وأن آجالهم تطول ، وإذ لم يفعلوه فقد كُشف للناس أن الله علم إنهم لا يفعلون ما دعاهم إليه نوح وأن الله قاطع آجالهم ، وقد أشار إلى هذا المعنى قول النبي صلى الله عليه وسلم « اعملُوا فكل مُيسَّر إلى ما خُلق له » وقد استعصى فهم هذا على كثير من الناس فخلطوا بين ما هو مقرر في علم الله وما أظهره قدر الله في الخارج الوجودي .وفي إقحام فعل { كنتم } قبل { تعلمون } إيذان بأن علمهم بذلك المنتفيَ لوقوعه شرطاً لحرف { لو } محقق انتفاؤه كما بيناه في قوله تعالى : { أكان للناس عجباً أن أوحينا إلى رجل منهم } في سورة يونس ( 2 ) .وجواب لو } محذوف دل عليه قوله : { لا يؤخَّر } . والتقدير : لأيقنتم أنه لا يؤخر .\n","ar.waseet":"ثم بين لهم ما يترتب على إخلاص عبادتهم لله ، وخشيتهم منه - سبحانه - وطاعتهم لنبيهم فقال : ( يَغْفِرْ لَكُمْ مِّن ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إلى أَجَلٍ مُّسَمًّى ) .وقوله : ( يَغْفِرْ ) مجزوم فى جواب الأوامر الثلاثة ، و ( من ) للتبعيض أى : يغفر لكم بعض ذنوبكم ، وهى تلك التى اقترفوها قبل إيمانهم وطاعتهم لنبيهم ، أو الذنوب التى تتعلق بحقوق الله - تعالى - دون حقوق العباد .ويرى بعضهم أن \" من \" هنا زائدة لتوكيد هذه المغفرة . أى : يغفر لكم جميع ذنوبكم التى فرطت منكم ، متى آمنتم واتقيتم ربكم ، وأطعتم نبيكم .( وَيُؤَخِّرْكُمْ إلى أَجَلٍ مُّسَمًّى ) أى : ويؤخر آجالكم إلى وقت معين عنده - سبحانه - ويبارك لكم فيها ، بأن يجعلها عامرة بالعمل الصالح ، وبالحياة الآمنة الطيبة .فأنت ترى أن نوحا - عليه السلام - قد وعدهم بالخير الأخروى وهو مغفرة الذنوب يوم القيامة ، وبالخير الدنيوى وهو البركة فى أعمارهم ، وطول البقاء فى هناء وسلام .قال ابن كثير : ( وَيُؤَخِّرْكُمْ إلى أَجَلٍ مُّسَمًّى ) أى : ويمد فى أعماركم ، ويدرأ عنكم العذاب ، الذى إذا لم تنزجروا عما أنهاكم عنه : أوقعه - سبحانه - بكم .وقد يستدل بهذه الآية من يقول : إن الطاعة والبر وصلة الرحم . يزاد بها فى العمر حقيقة ، كما ورد به الحديث : \" صلة الرحم تزيد فى العمر \" .وقوله : ( إِنَّ أَجَلَ الله إِذَا جَآءَ لاَ يُؤَخَّرُ لَوْ كُنتُمْ تَعْلَمُونَ ) بمنزلة التعليل لما قبله . أى : يغفر لكم - سبحانه - من ذنوبكم ، ويؤخركم إلى أجل معين عنده - تعالى - إن الوقت الذى حدده الله - عز وجل - لانتهاء أعماركم ، متى حضر ، لا يؤخر عن موعده ، ( لَوْ كُنتُمْ تَعْلَمُونَ ) . أى : لو كنتم من أهل العلم لسارعتم لما آمركم به . لكنكم لستم من أهله فى شئ ، لذا لم تسارعوا ، فجواب لو مما يتعلق بأول الكلام .ويجوز أن يكون مما يتعلق بآخره . أى : لو كنتم من أهل العلم لعلمتم ذلك ، أى : عدم تأخير الأجل إذا جاء وقته المقدر له . والفعل فى الوجهين منزل منزلة اللازم .\n","ar.baghawi":"( يغفر لكم من ذنوبكم ) \" من \" صلة ، أي : يغفر لكم ذنوبكم . وقيل : يعني ما سلف من ذنوبكم إلى وقت الإيمان ، وذلك بعض ذنوبهم ( ويؤخركم إلى أجل مسمى ) أي : يعافيكم إلى منتهى آجالكم فلا يعاقبكم ( إن أجل الله إذا جاء لا يؤخر لو كنتم تعلمون ) يقول : آمنوا قبل الموت تسلموا [ من العذاب ] فإن أجل الموت إذا جاء لا يؤخر ولا يمكنكم الإيمان .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5423.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5423.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5423.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا","transliteration":"Qaala rabbi innee da'awtu qawmee lailanw wa naharaa","translations":{"en.ahmedali":"He said: \"O Lord, I called my people night and day,","en.ahmedraza":"He said, “My Lord! I invited my people night and day.”","en.arberry":"He said; 'My Lord, I have called my people by night and by day,","en.asad":"[And after a time, Noah] said: \"O my Sustainer! Verily, I have been calling unto my people night and day","en.daryabadi":"He said: my Lord! verily have called my people night and day.","en.hilali":"He said: \"O my Lord! Verily, I have called my people night and day (i.e. secretly and openly to accept the doctrine of Islamic Monotheism).","en.pickthall":"He said: My Lord! Lo! I have called unto my people night and day","en.qaribullah":"'My Lord' said he, 'night and day I have called my nation,","en.sahih":"He said, \"My Lord, indeed I invited my people [to truth] night and day.","en.sarwar":"Noah said, \"My Lord, I have been preaching to my people, night and day,","en.yusufali":"He said: \"O my Lord! I have called to my People night and day:","en.maududi":"He said: “My Lord, I called my people by night and by day,","en.shakir":"He said: O my Lord! surely I have called my people by night and by day!","en.itani":"He said, “My Lord, I have called my people night and day.","en.mubarakpuri":"He said: O my Lord! Verily, I have called to my people night and day,","en.qarai":"He said, ‘My Lord! Indeed, I have summoned my people night and day","en.wahiduddin":"He said, \"My Lord! I have called my people night and day"},"tafsir":{"ar.muyassar":"قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار، فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه، وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم؛ كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا، ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء، ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى، فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه.","ar.jalalayn":"«قال رب إني دعوت قومي ليلا ونهارا» أي دائما متصلا.","ar.qurtubi":"أي سرا وجهرا .وقيل : أي واصلت الدعاء .\n","ar.miqbas":"قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا (5) جرد فعل { قال } هنا ، من العاطف لأنه حكاية جواب نوح عن قول الله له { أنْذِر قومك } [ نوح : 1 ] عومل معاملة الجواب الذي يُتلقى به الأمر على الفور على طريقة المحاورات التي تقدمت في قوله تعالى : { قالوا أتجعل فيها من يفسد فيها } في سورة البقرة ( 30 ) ، تنبيهاً على مبادرة نوح بإبلاغ الرسالة إلى قومه وتمام حرصه في ذلك كما أفاده قوله : { ليلاً ونهاراً } وحصول يأسه منهم ، فجعل مراجعته ربه بعد مهلة مستفادة من قوله : { لَيْلاً ونهاراً } بمنزلة المراجعة في المقام الواحد بين المتحاورَيْن . ولك أن تجعل جملة { قال رب } الخ مستأنفة استئنافاً بيانياً لأن السامع يترقب معرفة ماذا أجاب قوم نوح دعوته فكان في هذه الجملة بيان ما يترقبه السامع مع زيادة مراجعة نوح ربه تعالى .وهذا الخبر مستعمل في لازم معناه وهو الشكاية والتمهيد لطلب النصر عليهم لأن المخاطب به عالم بمدلول الخبر . وذلك ما سيفضي إليه بقوله : { وقال نوح رب لا تذَرْ على الأرض من الكافرين دياراً } الآيات [ نوح : 26 ] .وفائدة حكاية ما ناجى به نوح ربه إظهارُ توكله على الله ، وانتصار الله له ، والإِتيانُ على مهمات من العبرة بقصته ، بتلوين لحكاية أقواله وأقوال قومه وقول الله له . وتلك ثمان مقالات هي :{ أن أنذر قومك } الخ [ نوح : 1 ] .{ قال يا قوم إني لكم نذير مبين } الخ [ نوح : 2 ] .3 { قال رب إني دعوت قومي } الخ [ نوح : 5 ] .{ فقلت استغفروا ربكم } الخ [ نوح : 10 ] .{ قال نوح رب إنهم عصوني } الخ [ نوح : 21 ] .{ ولا تزد الظالمين إلاّ ضلالاً } الخ [ نوح : 24 ] .{ وقال نوح رب لا تذر على الأرض } الخ [ نوح : 26 ] .{ رب اغفر لي } الخ [ نوح : 28 ] .وجعل دعوته مظروفة في زمني الليل والنهار للدلالة على عدم الهوادة في حرصه على إرشادهم ، وأنه يترصد الوقت الذي يتوسم أنهم فيه أقرب إلى فهم دعوته منهم في غيره من أوقات النشاط وهي أوقات النهار ، ومن أوقات الهدوّ وراحة البال وهي أوقات الليل .\n","ar.waseet":"ثم قصت علينا الآيات الكريمة بعد ذلك ، ما قاله نوح لربه . على سبيل الشكوى والضراعة ، وما وجهه إلى قومه من نصائح فيها ما فيها من الترغيب والترهيب ، ومن الإِرشاد الحكيم ، والتوجيه السديد . . قال - تعالى - :( قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي . . . ) .قوله - تعالى - : ( قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلاً وَنَهَاراً . فَلَمْ يَزِدْهُمْ دعآئي إِلاَّ فِرَاراً ) بيان للطرق والمسالك التى سلكها نوح مع قومه ، وهو يدعوهم إلى أخلاص العبادة لله - تعالى - بحرص شديد ومواظبة تامة . . وموقف قومه من دعوته لهم .والمقصود بهذا الخبر لازم معناه ، وهو الشكاية إلى ربه ، والتمهيد لطلب النصر منه - تعالى - عليهم ، لأنه - سبحانه - لا يخفى عليه أن نوحا - عليه السلام - لم يقصر فى تبليغ رسالته .أى : قال نوح متضرعا إلى ربه : يا رب إنك تعلم أننى لم أقصر فى دعوة قومى إلى عبادتك ، تارة بالليل وتارة بالنهار ، من غير فتور ولا توان .\n","ar.baghawi":"\"قال رب إني دعوت قومي ليلاً ونهاراً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5424.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5424.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5424.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا","transliteration":"Falam yazid hum du'aaa 'eee illaa firaaraa","translations":{"en.ahmedali":"But the more I called, they only ran the farther away.","en.ahmedraza":"“So for them, my calling them increased their fleeing away.”","en.arberry":"but my calling has only increased them in flight.","en.asad":"but my call has only caused them to flee farther and farther away [from Thee].","en.daryabadi":"And my calling hath only increased them in fleeing.","en.hilali":"\"But all my calling added nothing but to (their) flight (from the truth).","en.pickthall":"But all my calling doth but add to their repugnance;","en.qaribullah":"but my call has only increased them in running away.","en.sahih":"But my invitation increased them not except in flight.","en.sarwar":"but it has had no effect on them except to make them run away.","en.yusufali":"\"But my call only increases (their) flight (from the Right).","en.maududi":"but the more I called, the farther they fled.","en.shakir":"But my call has only made them flee the more:","en.itani":"But my call added only to their flight.","en.mubarakpuri":"But all my calling added nothing but to (their) flight.","en.qarai":"but my summons only increases their evasion.","en.wahiduddin":"but my pleas have only increased their aversion."},"tafsir":{"ar.muyassar":"قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار، فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه، وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم؛ كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا، ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء، ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى، فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه.","ar.jalalayn":"«فلم يزدهم دعائي إلا فرارا» عن الإيمان.","ar.qurtubi":"أي تباعدا من الإيمان .وقراءة العامة بفتح الياء من \" دعائي \" وأسكنها الكوفيون ويعقوب والدوري عن أبي عمرو .\n","ar.miqbas":"فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا (6)ومعنى { لم يَزدهم دعائيَ إلاّ فراراً } أن دعائي لهم بأن يعبدوا الله وبطاعتهم لي لم يزدهم ما دعوتهم إليه إلاّ بعداً منه ، فالفرار مستعار لقوة الإِعْراض ، أي فلم يزدهم دعائي إياهم قرباً مما أدعوهم إليه .واستثناء الفرار من عموم الزيادات استثناء منقطع . والتقدير : فلم يزدهم دعائي قرباً من الهدى لكن زادهم فراراً كما في قوله تعالى حكاية عن صالح عليه السلام { فما تزيدونني غير تخسير } [ هود : 63 ] .وإسناد زيادة الفرار إلى الدعاء مجاز لأن دعاءه إياهم كان سبباً في تزايد إعراضهم وقوة تمسكهم بشركهم .وهذا من الأسلوب المسمى في علم البديع تأكيد المدح بما يشبه الذم ، أو تأكيدَ الشيء بما يشبه ضده ، وهو هنا تأكيد إِعراضهم المشبه بالابتعاد بصورةٍ تشبه ضد الإِعراض .ولما كان فرارهم من التوحيد ثابتاً لهم من قبل كان قوله : { لم يزدهم دعائي إلاّ فراراً } من تأكيد الشيء بما يشبه ضده .وتصدير كلام نوح بالتأكيد لإِرادة الاهتمام بالخبر .\n","ar.waseet":"( فَلَمْ يَزِدْهُمْ دعآئي ) لهم إلى عبادتك وطاعتك ( إِلاَّ فِرَاراً ) أى : إلا تباعدا من الإِيمان وإعراضا عنه . والفرار : الزَّوَغَان والهرب . يقال : فر فلان يفر فرارا ، فهو فرور ، إذا هرب من طالبه ، وزاغ عن عينه .والتعبير بقوله : ( دَعَوْتُ قَوْمِي لَيْلاً وَنَهَاراً ) ، يشعر بحرص نوح التام على دعوتهم ، فى كل وقت يظن فيه أن دعوته لهم قد تنفع .كما أن التعبير بقوله : ( فَلَمْ يَزِدْهُمْ دعآئي إِلاَّ فِرَاراً ) يدل دلالة واضحة على إعراضهم التام عن دعوته ، أى : فلم يزدهم دعائى شيئا من الهدى ، وإنما زادهم بُعْداً عنى ، وفرارا منى .وإسناد الزيادة إلى الدعاء ، من باب الإِسناد إلى السبب ، كما فى قولهم : سرتنى رؤيتك ، وقوله ( فِرَاراً ) مفعول ثان لقوله ( فَلَمْ يَزِدْهُمْ ) والاستثناء مفرغ من عموم الأحوال والمستثنى منه مقدر ، أى : فلم يزدهم دعائى شيئا من أحوالهم التى كانوا عليها إلا الفرار .ويصح أن يكون الاستثناء منقطعا . أى : فلم يزدهم دعائى قرباً من الحق ، لكن زادهم فرارا منه .\n","ar.baghawi":"\"فلم يزدهم دعائي إلا فراراً\"، نفاراً وإدباراً عن الإيمان والحق.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5425.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5425.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5425.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا","transliteration":"Wa inee kullamaa da'awtuhum litaghfira lahum ja'alooo asaabi'ahum fee aazaanihim wastaghshaw siyaabahum wa asaarroo wastakbarus tikbaaraa","translations":{"en.ahmedali":"And every time I called them that You may forgive them, they thrust their fingers into their ears, and covered themselves with their garments, and became wayward, and behaved with downright insolence.","en.ahmedraza":"“And whenever I called them, so that You may forgive them, they always thrust their fingers into their ears, and covered themselves with their clothes, and remained stubborn and were extremely haughty.”","en.arberry":"And whenever I called them, that Thou mightest forgive them, they put their fingers in their ears, and wrapped them in their garments, and persisted, and waxed very proud.","en.asad":"And behold, whenever I called unto them with a view to Thy granting them forgiveness, they put their fingers into their ears, and wrapped themselves up in their garments [of sin]; and grew obstinate, and became [yet more] arrogant in their false pride.","en.daryabadi":"And verily so oft as I call them, that Thou mayest forgive them, they place their fingers into their ears, and wrap themselves with their garments, and persist, and are stiff-necked.","en.hilali":"\"And verily! Every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted (in their refusal), and magnified themselves in pride.","en.pickthall":"And lo! whenever I call unto them that Thou mayst pardon them they thrust their fingers in their ears and cover themselves with their garments and persist (in their refusal) and magnify themselves in pride.","en.qaribullah":"Each time I called them so that You might forgive them, they thrust their fingers in their ears and wrapped themselves in their garments, and persisted becomingvery proud.","en.sahih":"And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.","en.sarwar":"Evert time I invite them to Your (guidance) so that You can forgive them, they put their fingers into their ears, cover their heads with their clothes, persist in their disbelief and display extreme arrogance.","en.yusufali":"\"And every time I have called to them, that Thou mightest forgive them, they have (only) thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance.","en.maududi":"And every time I called them so that You might forgive them, they thrust their fingers into their ears and wrapped up their faces with their garments and obstinately clung to their attitude, and waxed very proud.","en.shakir":"And whenever I have called them that Thou mayest forgive them, they put their fingers in their ears, cover themselves with their garments, and persist and are puffed up with pride:","en.itani":"Whenever I called them to Your forgiveness, they thrust their fingers into their ears, and wrapped themselves in their garments, and insisted, and became more and more arrogant.","en.mubarakpuri":"And verily, every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted, and magnified themselves in pride.","en.qarai":"Indeed whenever I have summoned them, so that You might forgive them, they would put their fingers into their ears and draw their cloaks over their heads, and they were persistent [in their unfaith], and disdainful in [their] arrogance.","en.wahiduddin":"Every time I have called to them, so that You might forgive them, they have only thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance."},"tafsir":{"ar.muyassar":"قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار، فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه، وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم؛ كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا، ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء، ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى، فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه.","ar.jalalayn":"«وإني كلما دعوتهم لتغفر لهم جعلوا أصابعهم في آذانهم» لئلا يسمعوا كلامي «واستغشوا ثيابهم» غطوا رؤوسهم بها لئلا ينظروني «وأصروا» على كفرهم «واستكبروا» تكبروا عن الإيمان «استكبارا».","ar.qurtubi":"قوله تعالى : وإني كلما دعوتهم أي إلى سبب المغفرة ، وهي الإيمان بك والطاعة لك .جعلوا أصابعهم في آذانهم لئلا يسمعوا دعائيواستغشوا ثيابهم أي غطوا بها وجوههم لئلا يروه . وقال ابن عباس : جعلوا ثيابهم على رءوسهم لئلا يسمعوا كلامه . فاستغشاء الثياب إذا زيادة في سد الآذان حتى لا يسمعوا ، أو لتنكيرهم أنفسهم حتى يسكت أو ليعرفوه إعراضهم عنه . وقيل : هو كناية عن العداوة . يقال : لبس لي فلان ثياب العداوة .\" وأصروا \" أي على الكفر فلم يتوبوا .\" واستكبروا \" عن قبول الحق ; لأنهم قالوا : أنؤمن لك واتبعك الأرذلون .\" استكبارا \" تفخيم .\n","ar.miqbas":"وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آَذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا (7){ كلما } مركبة من كلمتين كلمةِ ( كل ) وهي اسم يدل على استغراق أفراد ما تضاف هي إليه ، وكلمة ( ما ) المصدرية وهي حرف يفيد أن الجملة بعده في تأويل مصدر . وقد يراد بذلك المصدر زمَانُ حصوله فيقولون ( مَا ) ظرفية مصدرية لأنها نائبة عن اسم الزمان .والمعنى : أنهم لم يظهروا مخِيلةً من الإِصغاء إلى دعوته ولم يتخلفوا عن الإِعراض والصدود عن دعوته طَرفة عَيْن ، فلذلك جاء بكلمة { كلما } الدالة على شمول كلّ دعوة من دعواته مقترنةً بدلائل الصد عنها ، وقد تقدم عند قوله تعالى : { كلما أضاء لهم مشوا فيه } [ البقرة : 20 ] .وحُذف متعلق { دَعَوْتُهم } لدلالة ما تقدم عليه من قوله : { أن اعبدوا الله } [ نوح : 3 ] .والتقدير : كلما دعوتهم إلى عبادتك وتقواك وطاعتي فيما أمرتهم به .واللام في قوله : { لتغفر } لام التعليل ، أي دعوتهم بدعوة التوحيد فهو سبب المغفرة ، فالدعوة إليه معللة بالغفران .ويتعلق قوله : { كلما دعوتهم } بفعل { جعلوا أصابعهم } على أنه ظرف زمان .وجملة { جعلوا أصابعهم } خبر ( إن ) والرابط ضمير { دعوتهم } .وجَعْل الأصابع في الآذَان يمنع بلوغ أصوات الكلام إلى المسامع .وأطلق اسم الأصابع على الأنامل على وجه المجاز المرسل بعلاقة البعضية فإن الذي يُجعل في الأذن الأنملة لا الأصبع كلّه فعُبر عن الأنامل بالأصابع للمبالغة في إرادة سد المسامع بحيث لو أمكن لأدخلوا الأصابع كلها ، وتقدم في قوله تعالى : { يجعلون أصابعهم في آذانهم من الصواعق } في سورة البقرة ( 19 ) .واستغشاء الثياب : جَعْلُها غِشاء ، أي غِطاء على أعينهم ، تعْضيداً لسد آذانهم بالأصابع لئلا يسمعوا كلامه ولا ينظروا إشاراته . وأكثر ما يطلق الغشاء على غطاء العينين ، قال تعالى : { وعلى أبصارهم غشاوة } [ البقرة : 7 ] . والسين والتاء في { استغشوا } للمبالغة .فيجوز أن يكون جعل الأصابع في الآذان واستغشاءُ الثياب هنا حقيقة بأن يكون ذلك من عادات قوم نوح إذا أراد أحد أن يظهر كراهية لكلام من يتكلم معه أن يجعل أصبعيه في أذنيه ويجعل من ثوبه ساتراً لعينيه .ويجوز أن يكون تمثيلاً لحالهم في الإِعراض عن قبول كلامه ورؤية مقامه بحال من يَسُكُّ سمعه بأنملتيْه ويحجب عينيه بطرف ثوبه .وجعلت الدعوة معللة بمغفرة الله لهم لأنها دعوة إلى سبب المغفرة وهو الإِيمان بالله وحده وطاعةُ أمره على لسان رسوله .وفي ذلك تعريض بتحميقهم وتعجب من خُلُقهم إذ يعرضون عن الدعوة لما فيه نفعهم فكان مقتضى الرشاد أن يسمعوها ويتدبروها .والإِصرار : تحقيق العزم على فعللٍ ، وهو مشتق من الصَّر وهو الشد على شيء والعقدُ عليه ، وتقدم عند قوله تعالى : { ولم يصرّوا على ما فعلوا } في سورة آل عمران ( 135 ) .وحذف متعلق أصَروا } لظهوره ، أي أصروا على ما هم عليه من الشرك .{ واستكبروا } مبالغة في تكبروا ، أي جعلوا أنفسهم أكبر من أن يأتمروا لواحد منهم { ما نراك إلاّ بشراً مثلنا وما نراك اتبعك إلاّ الذين هم أراذلِنُا بادىء الرأي وما نرى لكم علينا من فضل } [ هود : 27 ] .وتأكيد { استكبروا } بمفعوله المطلق للدلالة على تمكن الاستكبار . وتنوين { استكباراً } للتعظيم ، أي استكباراً شديداً لا يَفله حدُّ الدعوة .\n","ar.waseet":"ثم أضاف إلى فرارهم منه ، حالة أخرى . تدل على إعراضهم عنه ، وعلى كراهيتهم له ، فقال : ( وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جعلوا أَصَابِعَهُمْ في آذَانِهِمْ واستغشوا ثِيَابَهُمْ وَأَصَرُّواْ واستكبروا استكبارا ) .وقوله : ( كُلَّمَا ) معمول لجملة : ( جعلوا ) التى هى خبر إن ، واللام فى قوله ( لِتَغْفِرَ لَهُمْ ) للتعليل .والمراد بأصابعهم : جزء منها . واستغشاء الثياب معناه : جعلها غشاء ، أى : غطاء لرءوسهم ولأعينهم حتى لا ينظروا إليه ، ومتعلق الفعل \" دعوتهم \" محذوف لدلالة ما تقدم عليه ، وهو أمرهم بعبادة الله وتقواه .والمعنى : وإنى - يا مولاى - كلما دعوتهم إلى عبادتك وتقواك وطاعتى فيما أمرتهم به ، لكى تغفر لهم ذنوبهم . . ما كان منهم إلا أن جعلوا أصابعهم فى آذانهم حتى لا يسمعوا قولى ، وإلا أن وضعوا ثيابهم على رءوسهم . وأبصارهم حتى لا يرونى ، وإلا أن ( وَأَصَرُّواْ ) إصرارا تاما على كفرهم ( واستكبروا استكبارا ) عظيما عن قبول الحق .فأنت ترى أن هذه الآية الكريمة ، قد صورت عناد قوم نوح ، وجحودهم للحق ، تصويرا بلغ الغاية فى استحبابهم العمى على الهدى .فهى - أولا - جاءت بصيغة \" كلما \" الدالة على شمول كل دعوة وجهها إليهم نبيهم نوح - عليه السلام - أى : فى كل وقت أدعوهم إلى الهدى يكون منهم الإعراض .وهى - ثانيا - عبرت عن عدم استماعهم إليه بقوله - تعالى - : ( جعلوا أَصَابِعَهُمْ في آذَانِهِمْ ) . وعبر عن الأنامل بالأصابع على سبيل المبالغة فى إرادة سد المسامع ، فكأنهم لو أمكنهم إدخال أصابعهم جميعها فى آذانهم لفعلوا . حتى لا يسمعوا شيئا مما يقوله نبيهم لهم .فإطلاق اسم الأصابع على الأنامل من باب المجاز المرسل ، لعلاقة البعضية ، حيث أطلق - سبحانه - الكل وأراد البعض ، مبالغة فى كراهيتهم لسماع كلمة الحق .وهى - ثالثا - عبرت عن كراهيتهم لنبيهم ومرشدهم بقوله - تعالى - : ( واستغشوا ثِيَابَهُمْ ) أى : بالغوا فى التَّغطِّى بها ، حتى لكأنهم قد طلبوا منها أن تلفهم بداخلها حتى لا يتسنى لهم رؤيته إطلاقا .وهذا كناية عن العداوة الشديدة ، ومنه قول القائل : لبس لى فلان ثياب العداوة .وهى - رابعا - قد بينت بأنهم لم يكتفوا بكل ذلك ، بل أضافوا إليه الإصرار على الكفر - وهو التشدد فيه ، والامتناع من الإِقلاع عنه مأخوذ من الصَّرة بمعنى الشدة - والاستكبار العظيم عن الاستجابة للحق .فقد أفادت هذه الآية ، أنهم عصوا نوحا وخالفوه مخالفة ليس هناك ما هو أقبح منها ظاهرا ، حيث عطلوا أسماعهم وأبصارهم ، وليس هناك ما هو أقبح منها باطنا ، حيث أصروا على كفرهم ، واستكبروا على اتباع الحق .\n","ar.baghawi":"( وإني كلما دعوتهم ) إلى الإيمان بك ( لتغفر لهم جعلوا أصابعهم في آذانهم ) لئلا يسمعوا دعوتي ( واستغشوا ثيابهم ) غطوا بها وجوههم لئلا يروني ( وأصروا ) على كفرهم ( واستكبروا ) عن الإيمان بك ( استكبارا )\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5426.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5426.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5426.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا","transliteration":"Summa innee da'aw tuhum jihaara","translations":{"en.ahmedali":"Then I called them loudly and more openly,","en.ahmedraza":"“I then called them openly.”","en.arberry":"Then indeed I called them openly;","en.asad":"\"And behold I called unto them openly;","en.daryabadi":"Then verily have called Unto them publicly:","en.hilali":"\"Then verily, I called to them openly (aloud);","en.pickthall":"And lo! I have called unto them aloud,","en.qaribullah":"I called to them clearly,","en.sahih":"Then I invited them publicly.","en.sarwar":"\"I preached to them aloud, in public.","en.yusufali":"\"So I have called to them aloud;","en.maududi":"Then I summoned them openly,","en.shakir":"Then surely I called to them aloud:","en.itani":"Then I called them openly.","en.mubarakpuri":"Then verily, I called to them openly (aloud).","en.qarai":"Again I summoned them aloud,","en.wahiduddin":"Then I called them openly,"},"tafsir":{"ar.muyassar":"قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار، فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه، وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم؛ كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا، ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء، ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى، فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه.","ar.jalalayn":"«ثم إني دعوتهم جهارا» أي بأعلى صوتي.","ar.qurtubi":"قوله تعالى : ثم إني دعوتهم جهارا أي مظهرا لهم الدعوة . وهو منصوب ب \" دعوتهم \" نصب المصدر ; لأن الدعاء أحد نوعيه الجهار ، فنصب به نصب القرفصاء بقعد ; [ ص: 276 ] لكونها أحد أنواع القعود ، أو لأنه أراد ب \" دعوتهم \" جاهرتهم . ويجوز أن يكون صفة لمصدر دعا ; أي دعاء جهارا ; أي مجاهرا به . ويكون مصدرا في موضع الحال ; أي دعوتهم مجاهرا لهم بالدعوة .\n","ar.miqbas":"ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا (8) ارتقى في شكواه واعتذاره بأنَّ دعوته كانت مختلفة الحالات في القول من جهر وإسرار ، فعَطْف الكلام ب { ثم } التي تفيد في عطفها الجمل أن مضمون الجملة المعطوفة أهم من مضمون المعطوف عليها ، لأن اختلاف كيفية الدعوة ألصق بالدعوة من أوقات إلقائها لأن الحالة أشد ملابسة بصاحبها مِن ملابسة زمانه . فذَكَر أنه دعاهم جهاراً ، أي علناً .وجِهار : اسم مصدر جهر ، وهو هنا وصف لمصدر { دَعَوْتُهم } ، أي دعوةً جهاراً .وارتقى فذكر أنه جمع بين الجهر والإِسرار لأن الجمع بين الحالتين أقوى في الدعوة وأغلظ من إفراد إحداهما\n","ar.waseet":"ومع كل هذا الإعراض والعناد . . فقد حكت لنا الآيات بعد ذلك ، أن نوحا - عليه السلام - قد واصل دعوته لهم بشتى الأساليب . فقال - كما حكى القرآن عنه - : ( ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَاراً ) .وقوله : ( جِهَاراً ) صفة لمصدر محذوف . أى : دعوتهم دعاء جهارا . أى : مجاهرا لهم بدعوتى ، بحيث صارت دعوتى لهم أمامهم جميعا .\n","ar.baghawi":"\"ثم إني دعوتهم جهاراً\"، معلناً بالدعاء. قال ابن عباس: بأعلى صوتي.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5427.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5427.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5427.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا","transliteration":"Summaa inneee a'lantu lahum wa asrartu lahum israaraa","translations":{"en.ahmedali":"And declared to them in public and in private,","en.ahmedraza":"“Then I also told them publicly and also spoke to them softly in private.”","en.arberry":"then indeed I spoke publicly unto them, and I spoke unto them secretly,","en.asad":"and, behold I preached to them in public; and I spoke to them secretly, in private;","en.daryabadi":"Then verily spake Unto them openly, and secretly also I addressed them.","en.hilali":"\"Then verily, I proclaimed to them in public, and I have appealed to them in private,","en.pickthall":"And lo! I have made public proclamation unto them, and I have appealed to them in private.","en.qaribullah":"and indeed, I spoke to them both publicly and in secret:","en.sahih":"Then I announced to them and [also] confided to them secretly","en.sarwar":"Then I conveyed the message to them, again, both in public and in private,","en.yusufali":"\"Further I have spoken to them in public and secretly in private,","en.maududi":"and preached to them in public, and also addressed them in secret.","en.shakir":"Then surely I spoke to them in public and I spoke to them in secret:","en.itani":"Then I appealed to them publicly, and I spoke to them privately.","en.mubarakpuri":"Then verily, I proclaimed to them in public, and I have appealed to them in private.","en.qarai":"and again appealed to them publicly and confided with them privately,","en.wahiduddin":"and spoke to them in public and in private.\""},"tafsir":{"ar.muyassar":"قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار، فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه، وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم؛ كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا، ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء، ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى، فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه.","ar.jalalayn":"«ثم إني أَعلنت لهم» صوتي «وأسررت» الكلام «لهم إسرارا».","ar.qurtubi":"ثم إني أعلنت لهم وأسررت لهم إسرارا أي لم أبق مجهودا . وقال مجاهد : معنى أعلنت : صحت ، وأسررت لهم إسرارا . بالدعاء عن بعضهم من بعض . وقيل : أسررت لهم أتيتهم في منازلهم . وكل هذا من نوح عليه السلام مبالغة في الدعاء لهم ، وتلطف في الاستدعاء . وفتح الياء من \" إني أعلنت لهم \" الحرميون وأبو عمرو . وأسكن الباقون .\n","ar.miqbas":"ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا (9) . فقوله : { أعلنت لهم } تأكيد لقوله : { دعوتهم جهاراً } ذكر ليبنى عليه عطف { وأسررت لهم إسراراً .والمعنى : أنه توخى ما يظنه أوْغَل إلى قلوبهم من صفات الدعوة ، فجهر حين يكون الجهر أجدى مثلُ مجامع العامة ، وأسَرَّ للذين يظنهم متجنبين لَوْم قومهم عليهم في التصدّي لسماع دعوته وبذلك تكون ضمائر الغيبة في قوله دعوتهم } ، وقوله : { أعلنت لهم وأسررت لهم } موزعة على مختلففِ الناس .وانتصب { جهاراً } بالنيابة عن المفعول المطلق المبيّن لنوع الدعوة .وانتصب { إسراراً } على أنه مفعول مطلق مفيد للتوكيد ، أي إسراراً خفياً .ووجه توكيد الإسرار أن إسرار الدعوة كان في حال دعوته سادتهم وقادتهم لأنهم يمتعضون من إعلان دعوتهم بمسمع من أتباعهم .\n","ar.waseet":"( ثُمَّ إني أَعْلَنْتُ لَهُمْ ) تارة ( وَأَسْرَرْتُ لَهُمْ إِسْرَاراً ) تارة أخرى .أى : أنه - عليه السلام - توخى ما يظنه يؤدى إلى نجاح دعوته ، وراعى أحوالهم فى ذلك ، فهو تارة يدعوهم جهرا ، وتارة يدعوهم سرا ، وتارة يجمع بين الأمرين .قال صاحب الكشاف : فإن قلت : ذكر أنه دعاهم ليلا ونهارا ، ثم دعاهم جهارا ، ثم دعاهم فى السر والعلن ، فيجب أن تكون ثلاث دعوات مختلفات حتى يصح العطف؟قلت : قد فعل - عليه السلام - كما يفعل الذى يأمر بالمعروف وينهى عن المنكر ، فى الابتداء بالأهوان والترقى فى الأشد فالأشد ، فافتتح بالمناصحة فى السر ، فلما لم يقبلوا ثنى بالمجاهرة ، فلما لم تؤثر ثلث بالجمع بين الإِسرار والإِعلان .ومعنى \" ثم \" الدلالة على تباعد الأحوال ، لأن الجهار أغلظ من الإِسرار ، والجمع بين الأمرين أغلظ من إفراد أحدهما ..\n","ar.baghawi":"( ثم إني أعلنت لهم ) كررت الدعاء معلنا ( وأسررت لهم إسرارا ) قال ابن عباس : يريد الرجل بعد الرجل أكلمه سرا بيني وبينه أدعوه إلى عبادتك وتوحيدك .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5428.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5428.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5428.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا","transliteration":"Faqultus taghfiroo Rabakam innahoo kaana Ghaffaaraa","translations":{"en.ahmedali":"And I told them: 'Ask your Lord to forgive you. He is verily forgiving.","en.ahmedraza":"“I therefore told them, ‘Seek forgiveness from your Lord; He is indeed Most Forgiving.’","en.arberry":"and I said, \"Ask you forgiveness of your Lord; surely He is ever All-forgiving,","en.asad":"and I said: \"'Ask your Sustainer to forgive you your sins - for, verily, He is all-forgiving!","en.daryabadi":"And I said: ask forgiveness of your Lord; verily He is ever Most Forgiving.","en.hilali":"\"I said (to them): 'Ask forgiveness from your Lord; Verily, He is Oft-Forgiving;","en.pickthall":"And I have said: Seek pardon of your Lord. Lo! He was ever Forgiving.","en.qaribullah":"\"Ask for forgiveness of your Lord,\" I said. \"Surely, He is the Forgiver.","en.sahih":"And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.","en.sarwar":"and told them, \"Ask forgiveness from your Lord; He is All-forgiving\".","en.yusufali":"\"Saying, 'Ask forgiveness from your Lord; for He is Oft-Forgiving;","en.maududi":"I said to them: “Ask forgiveness from your Lord; surely He is Most Forgiving.","en.shakir":"Then I said, Ask forgiveness of your Lord, surely He is the most Forgiving:","en.itani":"I said, ‘Ask your Lord for forgiveness; He is Forgiving.","en.mubarakpuri":"I said (to them): Ask forgiveness from your Lord, verily, He is Oft-Forgiving;","en.qarai":"telling [them]: ‘‘Plead to your Lord for forgiveness. Indeed, He is all-forgiving.","en.wahiduddin":"Then I said, \"Ask forgiveness of your Lord. Surely He is the most forgiving."},"tafsir":{"ar.muyassar":"قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار، فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه، وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم؛ كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا، ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء، ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى، فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه.","ar.jalalayn":"«فقلت استغفروا ربكم» من الشرك «إنه كان غفارا».","ar.qurtubi":"قوله تعالى : فقلت استغفروا ربكم أي سلوه المغفرة من ذنوبكم السالفة بإخلاص الإيمان .إنه كان غفارا وهذا منه ترغيب في التوبة . وقد روى حذيفة بن اليمان عن النبي صلى الله عليه وسلم أنه قال : الاستغفار ممحاة للذنوب . وقال الفضيل : يقول العبد أستغفر الله ; وتفسيرها أقلني .\n","ar.miqbas":"فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا (10) وفصَّل دعوته بفاء التفريع فقال { فقلت استغفروا ربكم } فهذا القول هو الذي قاله لهم ليلاً ونهاراً وجهاراً وإسراراً .ومعنى { استغفروا ربكم } ، ءامنوا إيماناً يكون استغفاراً لذنبكم فإنكم إن فعلتم غفر الله لكم .وعلّل ذلك لهم بأن الله موصوف بالغفران صفة ثابتة تعهد الله بها لعباده المستغفرين ، فأفاد التعليل بحرف ( إنَّ ) وأفاد ثبوت الصفة لله بذكر فعل { كان } وأفاد كمال غفرانه بصيغة المبالغة بقوله { غفّاراً } .وهذا وعد بخير الآخرة ورتب عليه وعداً بخير الدنيا بطريق جواب الأمر ، وهو { يُرسل السماء عليكم } الآية .وكانوا أهل فلاحة فوعدهم بنزول المطر الذي به السلامة من القحط وبالزيادة في الأموال .\n","ar.waseet":"ثم حكى - سبحانه - جانبا من إرشادات نوح لقومه فقال : ( فَقُلْتُ استغفروا رَبَّكُمْ )أى : فقلت لهم - على سبيل النصح والإِرشاد إلى ما ينفعهم ويغريهم بالطاعة - ( استغفروا رَبَّكُمْ ) بأن تتوبوا إليه ، وتقلعوا عن كفركم وفسوقكم ( إِنَّهُ ) - سبحانه - ( كَانَ غَفَّاراً ) .أى : كثير الغفران لمن تاب إليه وأناب .\n","ar.baghawi":"\"فقلت استغفروا ربكم إنه كان غفاراً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5429.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5429.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5429.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا","transliteration":"Yursilis samaaa'a 'alaikum midraaraa","translations":{"en.ahmedali":"He will send you abundant rain from the sky,","en.ahmedraza":"‘He will send down abundant rain for you from the sky.’","en.arberry":"and He will loose heaven upon you in torrents","en.asad":"He will shower upon you heavenly blessings abundant,","en.daryabadi":"He will send the heaven upon you copiously;","en.hilali":"'He will send rain to you in abundance;","en.pickthall":"He will let loose the sky for you in plenteous rain,","en.qaribullah":"He will let loose the sky upon you in abundance","en.sahih":"He will send [rain from] the sky upon you in [continuing] showers","en.sarwar":"He will send you abundant","en.yusufali":"\"'He will send rain to you in abundance;","en.maududi":"He will shower upon you torrents from heaven,","en.shakir":"He will send down upon you the cloud, pouring down abundance of rain:","en.itani":"He will let loose the sky upon you in torrents.","en.mubarakpuri":"He will send rain to you Midrar,","en.qarai":"He will send for you abundant rains from the sky,","en.wahiduddin":"He will send down abundant rain from the sky for you,"},"tafsir":{"ar.muyassar":"إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا، ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. مالكم -أيها القوم- لا تخافون عظمة الله وسلطانه، وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟ ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض، وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟","ar.jalalayn":"«يرسل السماء» المطر وكانوا قد منعوه «عليكم مدرارا» كثير الدرور.","ar.qurtubi":"أي يرسل ماء السماء ; ففيه إضمار .وقيل : السماء المطر ; أي يرسل المطر .قال الشاعر : إذا سقط السماء بأرض قوم رعيناه وإن كانوا غضابا و \" مدرارا \" ذا غيث كثير .وجزم \" يرسل \" جوابا للأمر .وقال مقاتل : لما كذبوا نوحا زمانا طويلا حبس الله عنهم المطر , وأعقم أرحام نسائهم أربعين سنة ; فهلكت مواشيهم وزروعهم , فصاروا إلى نوح عليه السلام واستغاثوا به .فقال \" استغفروا ربكم إنه كان غفارا \" أي لم يزل كذلك لمن أناب إليه .ثم قال ترغيبا في الإيمان : \" يرسل السماء عليكم مدرارا .ويمددكم بأموال وبنين ويجعل لهم جنات ويجعل لكم أنهارا \" .قال قتادة : علم نبي الله صلى الله عليه وسلم أنهم أهل حرص على الدنيا فقال : ( هلموا إلى طاعة الله فإن في طاعة الله درك الدنيا والآخرة ) .\n","ar.miqbas":"يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا (11) و { السماء } : هنا المطر ، ومن أسماء المطر السماء . وفي حديث «الموطأ» و«الصحيحين» عن زيد بن خالد الجهني : أنه قال : \" صلى لنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحُدَيْبِيَة على إِثْر سَمَاءٍ كانت من الليْل \" الحديث . وقال معاوية بن مالك بن جعفر :إذا نزل السماءُ بأرض قوم ... رَعَيْنَاهُ وإن كانوا غِضاباوالمدرار : الكثيرة الدُّر والدُّرور ، وهو السيلان ، يُقال : درت السماء بالمطر ، وسماء مدرار .ومعنى ذلك : أن يَتْبع بعض الأمطار بعضاً .ومِدرار ، زنة مبالغة ، وهذا الوزن لا تلحقه علامة التأنيث إلاّ نادراً كما في قول سهل بن مالك الفزاري :أصبَحَ يَهْوَى حُرَّةً مِعْطَارَة ... فلذلك لم تلحق التاء هنا مع أن اسم السماء مؤنث .والإِرسال : مستعار للإِيصال والإِعطاء ، وتعديته ب { عليكم } لأنه إيصال من علوّ كقوله :{ وأرسل عليهم طيراً أبابيل } [ الفيل : 3 ] .\n","ar.waseet":"( يُرْسِلِ السمآء عَلَيْكُمْ مِّدْرَاراً ) والمراد بالسماء هنا : المطر لأنه ينزل منها ، وقد جاء فى الحديث الشريف أن من أسماء المطر السماء . فقد روى الشيخان عن زيد بن خالد الجهنى أنه قال \" صلى لنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية ، على إثر سماء كانت من الليل . . . \" أى : على إثر إمطار نازلة بالليل .ومنه قول بعض الشعراء :إذا نزل السماء بأرض قوم ... رعيناه وإن كانوا غضاباوالمدرار : المطر الغزير المتتابع ، يقال : درت السماء بالمطر ، إذا نزل منها بكثرة وتتابع ، والدر ، والدرور معناه : السيلان . . فقوله ( مِّدْرَاراً ) صيغة مبالغة منهما .أى : استغفروا ربكم وتوبوا إليه ، فإنكم إذا فعلتم ذلك أرسل الله - تعالى - عليكم بفضله ورحمته ، أمطارا غزيرة متتابعة ، لتنتفعوا بها فى مختلف شئون حياتكم .\n","ar.baghawi":"( يرسل السماء عليكم مدرارا ) وذلك أن قوم نوح لما كذبوه زمانا طويلا حبس الله عنهم المطر وأعقم أرحام نسائهم أربعين سنة ، فهلكت أموالهم ومواشيهم ، فقال لهم نوح : استغفروا ربكم من الشرك ، أي استدعوا المغفرة بالتوحيد ، يرسل السماء عليكم مدرارا .وروى مطرف عن الشعبي أن عمر رضي الله تعالى عنه خرج يستسقي بالناس ، فلم يزد على الاستغفار حتى رجع ، فقيل له : ما سمعناك استسقيت ؟ فقال . طلبت الغيث [ بمجاديح ] السماء التي يستنزل بها المطر ، ثم قرأ : \" استغفروا ربكم إنه كان غفارا يرسل السماء عليكم مدرارا \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5430.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5430.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5430.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا","transliteration":"Wa yumdidkum bi am waalinw wa baneena wa yaj'al lakum Jannaatinw wa yaj'al lakum anhaaraa","translations":{"en.ahmedali":"And will give you increase of wealth and sons, and give you gardens and springs of water.","en.ahmedraza":"‘And will aid you with wealth and sons, and will create gardens for you and cause rivers to flow for you.’","en.arberry":"and will succour you with wealth and sons, and will appoint for you gardens, and will appoint for you rivers.","en.asad":"and will aid you with worldly goods and children, and will bestow upon you gardens, and bestow upon you running waters.","en.daryabadi":"And He will add Unto you riches and children and will appoint Unto you gardens and will appoint Unto you rivers.","en.hilali":"'And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.\"","en.pickthall":"And will help you with wealth and sons, and will assign unto you Gardens and will assign unto you rivers.","en.qaribullah":"and give to you wealth and sons, and provide you with gardens and rivers.","en.sahih":"And give you increase in wealth and children and provide for you gardens and provide for you rivers.","en.sarwar":"rain from the sky,","en.yusufali":"\"'Give you increase in wealth and sons; and bestow on you gardens and bestow on you rivers (of flowing water).","en.maududi":"and will provide you with wealth and children, and will bestow upon you gardens and rivers.","en.shakir":"And help you with wealth and sons, and make for you gardens, and make for you rivers.","en.itani":"And provide you with wealth and children, and allot for you gardens, and allot for you rivers.","en.mubarakpuri":"And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.","en.qarai":"and aid you with wealth and sons, and provide you with gardens and provide you with streams.","en.wahiduddin":"increase your wealth and sons; and grant you gardens and waterways."},"tafsir":{"ar.muyassar":"إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا، ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. مالكم -أيها القوم- لا تخافون عظمة الله وسلطانه، وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟ ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض، وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟","ar.jalalayn":"«ويمددكم بأموال وبنين ويجعل لكم جنات» بساتين «ويجعل لكم أنهارا» جارية.","ar.qurtubi":"وقد مضى في سورة \" آل عمران \" كيفية الاستغفار , وإن ذلك يكون عن إخلاص وإقلاع من الذنوب .وهو الأصل في الإجابة .\n","ar.miqbas":"وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا (12)و ( أموال ) : جمع مال وهو يشمل كل مكسب يبذله المرء في اقتناء ما يحتاج إليه .والمراد بالجنات في قوله : { ويجعل لكم جنات } النخيل والأعناب ، لأن الجنات تحتاج إلى السقي .وإعادة فعل يَجْعل بعد واو العطف في قوله : { ويجعل لكم أنهاراً } للتوكيد اهتماماً بشأن المعطوف لأن الأنهار قوام الجنات وتسقي المزارع والأنعام .وفي هذا دلالة على أن الله يجازي عباده الصالحين بطيب العيش قال تعالى : { مَن عمِل صالحاً من ذكر أو أنثى وهو مؤمن فلنُحْيِيَنَّه حياة طيبة } [ النحل : 97 ] وقال { ولو أن أهل القرى ءامنوا واتقوا لفتحنا عليهم بركاتتٍ من السماء والأرض } [ الأعراف : 96 ] وقال : { وأنْ لو استقاموا على الطريقة لأسقيناهم ماء غدقاً } [ الجنّ : 16 ] .\n","ar.waseet":"وفضلا عن ذلك : ( وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ ) أى : بساتين عظيمة ، ( وَيَجْعَل لَّكُمْ أَنْهَاراً ) جارية تحت أشجار هذه الجنات ، لتزداد جمالا ونفعا .قال الإِمام الرازى ما ملخصه : \" إن قوم نوح لما كذبوه زمانا طويلا ، حبس الله عنهم المطر ، وأعقم أرحام نسائهم . . فرجعوا إلى نوح ، فقال لهم : استغفروا ربكم من الشرك ، حتى يفتح عليكم أبواب نعمه .واعلم أن الاشتغال بالطاعة ، سبب لانفتاح أبواب الخيرات ، ويدل عليه وجوه : أحدها : أن الكفر سبب لخراب العالم . والإِيمان سبب لعمارة العالم . وثانيها : الآيات الكثيرة التى وردت فى هذا المعنى ، ومنها قوله - تعالى - ( وَلَوْ أَنَّ أَهْلَ القرى آمَنُواْ واتقوا لَفَتَحْنَا عَلَيْهِمْ بَرَكَاتٍ مِّنَ السمآء والأرض . . . ) وثالثها : أن عمر خرج يستسقى فما زاد على الاستغفار .فقيل له : ما رأيتك استسقيت؟ فقال : لقد استسقيت لكم بمجاديح السماء ، والمجاديح : جمع مِجْدَح - بكسر فسكون وهو نجم من النجوم المعروفة عند العرب .وشكا رجل إلى الحسن البصرى الفاقة ، وشكا إليه آخر الجدب ، وشكا إليه ثالث قلة النسل . . فأمر الجميع بالاستغفار . . فقيل له : أتاك رجال يشكون إليك أنواعا من الحاجة ، فأمرتهم جميعا بالاستغفار؟ فتلا الحسن هذه الآيات الكريمة .وما قاله الإِمام الرازى - رحمه الله - يؤيده القرآن الكريم فى كثير من آياته ، ويؤيده واقع الحياة التى نحياها ونشاهد أحداثها .أما آيات القرآن الكريم فمنها قوله - تعالى - : ( وَأَلَّوِ استقاموا عَلَى الطريقة لأَسْقَيْنَاهُم مَّآءً غَدَقاً ) وقوله - سبحانه - على لسان هود - عليه السلام - : ( وياقوم استغفروا رَبَّكُمْ ثُمَّ توبوا إِلَيْهِ يُرْسِلِ السمآء عَلَيْكُمْ مِّدْرَاراً وَيَزِدْكُمْ قُوَّةً إلى قُوَّتِكُمْ . . )وقال - عز وجل - : ( مَنْ عَمِلَ صَالِحاً مِّن ذَكَرٍ أَوْ أنثى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ) وأما واقع الحياة . فإننا نشاهد بأعيننا الأمم التى تطبق شريعة الله - تعالى - وتعمل بما جاء به النبى صلى الله عليه وسلم من آداب وأحكام وهدايات .نرى هذه الأمم سعيدة فى حياتها ، آمنة فى أوطانها ، يأتيها رزقها رغدا من كل مكان ، وإذا أصابها شئ من النقص فى الأنفس أو الثمرات . . فذلك من باب الامتحان الذى يمتحن الله - تعالى - به عباده ، والذى لا يتعارض مع كون العاقبة الطيبة إنما هى لهذه الأمم الصادقة فى إيمانها .وما يجرى على الأمم والشعوب ، يجرى أيضا علىالأفراد والجماعات ، فتلك سنة الله التى لا تتغير .أما الأمم الفاسقة عن أمر ربها ، فإنها مهما أوتيت من ثراء وبسطة فى الرزق . . فإن حياتها دائما تكون متلبسة بالقلق النفسى ، والشقاء القلبى ، والاكتئاب الذى يؤدى إلى فساد الحال واضطراب البال .\n","ar.baghawi":"\"ويمددكم بأموال وبنين\"، قال عطاء: يكثر أموالكم وأولادكم، \"ويجعل لكم جنات ويجعل لكم أنهاراً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5431.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5431.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5431.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"مَا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا","transliteration":"Maa lakum laa tarjoona lillaahi waqaaraa","translations":{"en.ahmedali":"What has come upon you that you do not fear the majesty of God,","en.ahmedraza":"‘What is the matter with you, that you do not desire honour from Allah?’","en.arberry":"What ails you, that you look not for majesty in God,","en.asad":"\"'What is amiss with you that you cannot look forward to God's majesty,","en.daryabadi":"What aileth you that ye expect not in Allah majesty!","en.hilali":"What is the matter with you, [that you fear not Allah (His punishment), and] you hope not for reward (from Allah or you believe not in His Oneness).","en.pickthall":"What aileth you that ye hope not toward Allah for dignity","en.qaribullah":"What is the matter with you that you do not want the Greatness of Allah,","en.sahih":"What is [the matter] with you that you do not attribute to Allah [due] grandeur","en.sarwar":"strengthen you by (providing) you wealth and children, and make gardens and streams for you. What is the matter with you that you are not afraid of the greatness of God","en.yusufali":"\"'What is the matter with you, that ye place not your hope for kindness and long-suffering in Allah,-","en.maududi":"What is amiss with you that you do not look forward to the majesty of Allah","en.shakir":"What is the matter with you that you fear not the greatness of Allah?","en.itani":"What is the matter with you, that you do not appreciate God’s Greatness?","en.mubarakpuri":"What is the matter with you, that you do not hope for any Waqar from Allah","en.qarai":"What is the matter with you that you do not look upon Allah with veneration,","en.wahiduddin":"What is the matter with you that you deny the greatness of God,"},"tafsir":{"ar.muyassar":"إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا، ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. مالكم -أيها القوم- لا تخافون عظمة الله وسلطانه، وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟ ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض، وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟","ar.jalalayn":"«ما لكم لا ترجون لله وقارا» أي تأملون وقار الله إياكم بأن تؤمنوا.","ar.qurtubi":"قوله تعالى : ما لكم لا ترجون لله وقاراقيل : الرجاء هنا بمعنى الخوف ; أي ما لكم لا تخافون لله عظمة وقدرة على أحدكم بالعقوبة . أي أي عذر لكم في ترك الخوف من الله . وقال سعيد بن جبير وأبو العالية وعطاء بن [ ص: 278 ] أبي رباح : ما لكم لا ترجون لله ثوابا ولا تخافون له عقابا . وقال سعيد بن جبير عن ابن عباس : ما لكم لا تخشون لله عقابا وترجون منه ثوابا . وقال الوالبي والعوفي عنه : ما لكم لا تعلمون لله عظمة . وقال ابن عباس أيضا ومجاهد : ما لكم لا ترون لله عظمة . وعن مجاهد والضحاك : ما لكم لا تبالون لله عظمة . قال قطرب : هذه لغة حجازية . وهذيل وخزاعة ومضر يقولون : لم أرج : لم أبال . والوقار : العظمة . والتوقير : التعظيم . وقال قتادة : ما لكم لا ترجون لله عاقبة ; كأن المعنى ما لكم لا ترجون لله عاقبة الإيمان . وقال ابن كيسان : ما لكم لا ترجون في عبادة الله وطاعته أن يثيبكم على توقيركم خيرا . وقال ابن زيد : ما لكم لا تؤدون لله طاعة . وقال الحسن : ما لكم لا تعرفون لله حقا ولا تشكرون له نعمة . وقيل : ما لكم لا توحدون الله ; لأن من عظمه فقد وحده . وقيل : إن الوقار الثبات لله عز وجل ; ومنه قوله تعالى : وقرن في بيوتكن أي اثبتن . ومعناه ما لكم لا تثبتون وحدانية الله تعالى وأنه إلهكم لا إله لكم سواه ; قاله ابن بحر . ثم دلهم على ذلك فقال :\n","ar.miqbas":"مَا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا (13) بَدَّلَ خطابه مع قومه من طريقة النصح والأمر إلى طريقة التوبيخ بقوله : { ما لكم لا ترجون لله وقاراً .وهو استفهام صورته صورة السؤال عن أمر ثبت لهم في حال انتفاء رجائهم توقيرَ الله .والمقصود أنه لا شيء يثبت لهم صارف عن توقير الله فلا عذر لكم في عدم توقيره .وجملة لا تَرجُون } في موضع الحال من ضمير المخاطبين ، وكلمة ( مَا لَك ) ونحوها تلازمها حال بعدها نحو { فما لهم عن التذكرة معرضين } [ المدثر : 49 ] .وقد اختلف في معنى قوله : { ما لكم لا ترجون لله وقاراً } وفي تعلق معمولاته بعوامله على أقوال : بعضُها يرجع إلى إبقاء معنى الرجاء على معناه المعروف وهو ترقب الأمر ، وكذلك معنى الوقار على المتعارف وهو العظمة المقتضية للإِجلال ، وبعضها يرجع إلى تأويل معنى الرجاء ، وبعضها إلى تأويل معنى الوقار ، ويتركب من الحمل على الظاهر ومن التأويل أن يكون التأويل في كليهما ، أو أن يكون التأويل في أحدهما مع إبقاء الآخر على ظاهر معناه .فعلى حمل الرجاء على المعنى المتعارف الظاهر وحمل الوقار كذلك قال ابن عباس وسعيد بن جبير وأبو العالية وعَطاء ابن أبي رباح وابن كيسان : ما لكم لا ترجون ثواباً من الله ولا تخافون عقاباً ، أي فتعبدوه راجين أن يثيبكم على عبادتكم وتوقيرِكم إياه . وهذا التفسير ينحو إلى أن يكون في الكلام اكتفاء ، أي ولا تخافون عقاباً ، وإن نكتة الاكتفاء بالتعجب من عدم رجاء الثواب : أن ذلك هو الذي ينبغي أن يقصده أهل الرشاد والتقوى . وإلى هذا المعنى قال صاحب «الكشاف» : إذ صدر بقوله : ما لكم لا تكونون على حال تأمُلُون فيها تعظيم الله إياكم في دار الثواب .وهذا يقتضي أن يكون الكلام كنايةً تلويحية عن حثهم على الإِيمان بالله الذي يستلزم رجاء ثوابه وخوفَ عقابه لأن من رجا تعظيم الله إياه آمن به وعبده وعمل الصالحات .وعلى تأويل معنى الرجاء قال مجاهد والضحاك : معنى { لا ترجون } لا تبالون لله عظمة ، قال قطرب : هذه لغة حجازية لمضر وهُذيل وخزاعة يقولون : لم أرجُ أي لم أُبال ، وقال الوالبي والعَوفي عن ابن عباس : معنى { لا ترجون } لا تعلمون ، وقال مجاهد أيضاً : لا ترون ، وعن ابن عباس أنه سأَله عنها نافعُ بنُ الأزرق ، فأجابه أن الرجاء بمعنى الخوف ، وأنشد قول أبي ذؤيب :إذا لسَعَتْه النحلُ لم يرج لَسْعها ... وحَالفها في بيت نُوبٍ عواسلأي لم يَخَفْ لسعها واستمرّ على اشتيار العسل . قال الفراء : إنما يوضع الرجاء موضع الخوف لأن مع الرجاء طرفاً من الخوف من الناس ومن ثم استعمل الخوف بمعنى العِلم كقوله تعالى : { فإن خِفتم أن لا يُقيما حدود الله الآية } [ البقرة : 229 ] ، والمعنى : لا تخافون عظمة الله وقدرته بالعقوبة .وعلى تأويل الوقار قال قتادة : الوقار : العاقبة ، أي ما لكم لا ترجون لله عاقبة ، أي عاقبة الإِيمان ، أي أن الكلام كناية عن التوبيخ على تركهم الإِيمان بالله ، وجعل أبو مسلم الأصفهاني : الوقار بمعنى الثبات ، قال : ومنه قوله تعالى : { وقَرْن في بيوتكن } [ الأحزاب : 33 ] أي اثبُتن ، ومعناه ما لكم لا تُثبتون وحدانية الله .وتتركب من هذين التأويلين معان أخرى من كون الوقار مسنداً في التقدير إلى فاعله أو إلى مفعوله ، وهي لا تخفى .وأما قوله { لله } فالأظهر أنه متعلق ب { ترجون ، } ويجوز في بعض التأويلات الماضية أن يكون متعلقاً ب { وقاراً } : إمَّا تعلّق فاعل المصدر بمصدره فتكون اللام في قوله { لله } لشبه الملك ، أي الوقارَ الذي هو تصرف الله في خلقه إن شاء أن يوقركم ، أي يكرمكم بالنعيم ، وإِمّا تعلقَ مفعوللِ المصدر ، أي أن توقروا الله وتخشوه ولا تتهاونوا بشأنه تهاون من لا يخافه فتكون اللام لام التقوية .\n","ar.waseet":"وقوله - سبحانه - بعد ذلك حكاية عن نوح - عليه السلام - : ( مَّا لَكُمْ لاَ تَرْجُونَ لِلَّهِ وَقَاراً . وَقَدْ خَلَقَكُمْ أَطْوَاراً ) : بيان لما سلكه نوح فى دعوته لقومه ، من جمعه بين الترغيب والترهيب .فهو بعد أن أرشدهم إلى أن استغفارهم وطاعتهم لربهم ، تؤدى بهم إلى البسطة فى الرزق . . أتبع ذلك بزجرهم لسوء أدبهم مع الله - تعالى - منكرا عليهم استهتارهم واستخفافهم بما يدعوهم إليه .وقوله : ( مَّا لَكُمْ ) مبتدأ وخبر ، وهو استفهام قصد به توبيخهم والتعجيب من حالهم .ولفظ \" ترجون \" يرى بعضهم أنه بمعنى تعتقدون . والوقار معناه : التعظيم والإِجلال .والأطوار : جمع طور ، وهو المرة والتارة من الأفعال والأزمان .أى : ما الذى حدث لكم - أيها القوم - حتى صرتم لا تعتقدون لله - تعالى - عظمة أو إجلالا .\n","ar.baghawi":"\"ما لكم لا ترجون لله وقاراً\"، قال ابن عباس ومجاهد: لا ترون لله عظمة. وقال سعيد بن جبير: ما لكم لا تعظمون الله حق عظمته. وقال الكلبي: لا تخافون الله حق عظمته. و الرجاء: بمعنى الخوف، و الوقار: العظمة، اسم من التوقير وهو التعظيم. قال الحسن: لا تعرفون لله حقاً ولا تشكرون له نعمة. قال ابن كيسان: ما لكم لا ترجون في عبادة الله أن يثيبكم على توقيركم إياه خيراً.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5432.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5432.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5432.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"وَقَدْ خَلَقَكُمْ أَطْوَارًا","transliteration":"Wa qad khalaqakum at waaraa","translations":{"en.ahmedali":"Knowing that He has created you by various stages?","en.ahmedraza":"‘Whereas it is He Who created you in different stages?’","en.arberry":"seeing He created you by stages?","en.asad":"seeing that He has created [every one of] you in successive stages?","en.daryabadi":"And surely He hath created you by stages.","en.hilali":"While He has created you in (different) stages [i.e. first Nutfah, then 'Alaqah and then Mudghah, see (VV. 23:13, 14) the Quran].","en.pickthall":"When He created you by (divers) stages?","en.qaribullah":"He has created you by stages!","en.sahih":"While He has created you in stages?","en.sarwar":"who has created you in several stages?","en.yusufali":"\"'Seeing that it is He that has created you in diverse stages?","en.maududi":"when He has created you in stages?","en.shakir":"And indeed He has created you through various grades:","en.itani":"Although He created you in stages.","en.mubarakpuri":"While He has created you (in) Atwar (stages).","en.qarai":"though He has created you in [various] stages?","en.wahiduddin":"when He has created you through different stages of existence?"},"tafsir":{"ar.muyassar":"إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا، ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. مالكم -أيها القوم- لا تخافون عظمة الله وسلطانه، وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟ ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض، وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟","ar.jalalayn":"«وقد خلقكم أطوارا» جمع طور وهو الحال، فطورا نطفة وطورا علقة إلى تمام خلق الإنسان، والنظر في خلقه يوجب الإيمان بخالقه.","ar.qurtubi":"وقد خلقكم أطوارا أي جعل لكم في أنفسكم آية تدل على توحيده . قال ابن عباس : أطوارا يعني نطفة ثم علقة ثم مضغة ; أي طورا بعد طور إلى تمام الخلق ، كما ذكر في سورة \" المؤمنون \" . والطور في اللغة : المرة ; أي من فعل هذا وقدر عليه فهو أحق أن تعظموه . وقيل : أطوارا صبيانا ، ثم شبابا ، ثم شيوخا وضعفاء ، ثم أقوياء . وقيل : أطوارا أي أنواعا : صحيحا وسقيما ، وبصيرا وضريرا ، وغنيا وفقيرا . وقيل : إن \" أطوارا \" اختلافهم في الأخلاق والأفعال .\n","ar.miqbas":"وَقَدْ خَلَقَكُمْ أَطْوَارًا (14)وجملة { وقد خلقكم أطواراً } حال من ضمير { لكم } أو ضمير { تَرْجُون } ، أي في حال تحققكم أنه خلقكم أطواراً .فأما أنه خلقهم فمُوجِب للاعتراف بعظمته لأنه مكونهم وصانعهم فحق عليهم الاعتراف بجلاله .وأما كون خلقهم أطواراً فلأن الأطوار التي يعلمونها دالّة على رفقه بهم في ذلك التطور ، فهذا تعريض بكفرهم النعمة ، ولأن الأطوار دالة على حكمة الخالق وعلمه وقدرته ، فإن تطور الخلق من طور النطفة إلى طور الجنين إلى طور خروجه طفلاً إلى طور الصبا إلى طور بلوغ الأشد إلى طور الشيخوخة وطُروّ الموت على الحياة وطروّ البِلى على الأجساد بعد الموت ، كل ذلك والذاتُ واحدة ، فهو دليل على تمكن الخالق من كيفيات الخلق والتبديل في الأطوار ، وهم يدركون ذلك بأدنى التفات الذهن ، فكانوا محقوقين بأن يتوصلوا به إلى معرفة عظمة الله وتوقع عقابه لأن الدلالة على ذلك قائمة بأنفسهم وهل التصرف فيهم بالعقاب والإِثابة إلاّ دون التصرف فيهم بالكَون والفساد .والأطوار : جمع طَور بفتح فسكون ، والطور : التارة ، وهي المرة من الأفعال أو من الزمان ، فأريد من الأطوار هُنا ما يحصل في المرات والأزمان من أحوال مختلفة ، لأنه لا يقصد من تعدد المرات والأزمان إلاّ تعدد ما يحصل فيها ، فهو تعدد بالنوع لا بالتكرار كقول النابغة :فإنْ أفاقَ لقَد طالت عَمايتهوالمرءُ يُخْلَق طوراً بعدَ أطواروانتصب { أطواراً } على الحال من ضمير المخاطبين ، أي تطور خلقهم لأن { أطواراً } صار في تأويل أحوالاً في أطوار .\n","ar.waseet":"والحال أنه - سبحانه - هو الذى خلقكم وأوجدكم فى أطوار متعددة ، نطفة ، فعلقة ، فمضغة .كما قال - سبحانه - ( وَلَقَدْ خَلَقْنَا الإنسان مِن سُلاَلَةٍ مِّن طِينٍ . ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَّكِينٍ . ثُمَّ خَلَقْنَا النطفة عَلَقَةً فَخَلَقْنَا العلقة مُضْغَةً فَخَلَقْنَا المضغة عِظَاماً فَكَسَوْنَا العظام لَحْماً ثُمَّ أَنشَأْنَاهُ خَلْقاً آخَرَ فَتَبَارَكَ الله أَحْسَنُ الخالقين ) وكما قال - تعالى - ( الله الذي خَلَقَكُمْ مِّن ضَعْفٍ ثُمَّ جَعَلَ مِن بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِن بَعْدِ قُوَّةٍ ضَعْفاً وَشَيْبَةً يَخْلُقُ مَا يَشَآءُ وَهُوَ العليم القدير ) قال القرطبى ما ملخصه : قوله - تعالى - : ( مَّا لَكُمْ لاَ تَرْجُونَ لِلَّهِ وَقَاراً ) قيل : الرجاء هنا بمعنى الخوف .أى : مالكم لا تخافون لله عظمة وقدرة على أخذكم بالعقوبة .وقيل : المعنى : ما لكم لا تعلمون لله عظمة . . أولا ترون لله عظمة . . أو لا تبالون أن لله عظمة .. والوقار : العظمة ، والتوقير : التعظيم . .\n","ar.baghawi":"\"وقد خلقكم أطواراً\"، تارات، حالاً بعد حال، نطفة ثم علقة ثم مضغة إلى تمام الخلق.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5433.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5433.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5433.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا","transliteration":"Alam taraw kaifa khalaqal laahu sab'a samaawaatin tibaaqaa","translations":{"en.ahmedali":"Do you not see how God has fashioned seven skies one above the other,","en.ahmedraza":"‘Do you not see how Allah has created the seven heavens atop each other?’","en.arberry":"Have you not regarded how God created seven heavens one upon another,","en.asad":"\"'Do you not see how God has created seven heavens in full harmony with one another,","en.daryabadi":"Behold ye not in what wise Allah hath created seven heavens in storeys.","en.hilali":"See you not how Allah has created the seven heavens one above another,","en.pickthall":"See ye not how Allah hath created seven heavens in harmony,","en.qaribullah":"Have you not seen how Allah created the seven heavens one above the other,","en.sahih":"Do you not consider how Allah has created seven heavens in layers","en.sarwar":"\"Have you not seen that God has created the seven heavens one above the other","en.yusufali":"\"'See ye not how Allah has created the seven heavens one above another,","en.maududi":"Do you not see how Allah has created seven heavens, one upon the other,","en.shakir":"Do you not see how Allah has created the seven heavens, one above another,","en.itani":"Do you not realize that God created seven heavens in layers?","en.mubarakpuri":"See you not how Allah has created the seven heavens in tiers","en.qarai":"Have you not seen how Allah has created the seven heavens in layers,","en.wahiduddin":"Do you not see how God has created the seven heavens one above another,"},"tafsir":{"ar.muyassar":"إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا، ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. مالكم -أيها القوم- لا تخافون عظمة الله وسلطانه، وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟ ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض، وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟","ar.jalalayn":"«ألم تروا» تنظروا «كيف خلق الله سبع سماوات طباقا» بعضها فوق بعض.","ar.qurtubi":"قوله تعالى : ألم تروا كيف خلق الله سبع سماوات طباقا ذكر لهم دليلا آخر ، أي ألم تعلموا أن الذي قدر على هذا ، فهو الذي يجب أن يعبد . ومعنى \" طباقا \" بعضها فوق بعض ، كل سماء مطبقة على الأخرى كالقباب ; قاله ابن عباس والسدي . وقال الحسن : خلق الله سبع سموات طباقا على سبع أرضين ، بين كل أرض وأرض ، وسماء وسماء خلق وأمر . وقوله : ألم تروا على جهة الإخبار لا المعاينة ; كما تقول : ألم ترني كيف صنعت بفلان كذا . و \" طباقا \" نصب على أنه مصدر ; أي مطابقة طباقا . أو حال بمعنى ذات طباق ; فحذف ذات [ ص: 279 ] وأقام طباقا مقامه .\n","ar.miqbas":"أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَوَاتٍ طِبَاقًا (15) إن كان هذا من حكاية كلام نوح عليه السلام لقومه كما جرى عليه كلام المفسرين ، كان تخلصاً من التوبيخ والتعريض إلى الاستدلال عليهم بآثار وجود الله ووحدانيته وقدرته ، مما في أنفسهم من الدلائل ، إلى ما في العالم منها ، لِما علمتَ من إيذان قوله : { وقد خلقكم أطواراً } [ نوح : 14 ] من تذكير بالنعمة وإقامة للحجة ، فتخلص منه لذكر حجة أخرى ، فكان قد نبههم على النظر في أنفسهم أولاً لأنها أقرب ما يحسونه ويشعرون به ثم على النظر في العالم وما سُوّي فيه من العجائب الشاهدة على الخالق العليم القدير .وإن كان من خطاب الله تعالى للأمة وهو ما يسمح به سياق السورة من الاعتبار بأحوال الأمم الماضية المساوية لأحوال المشركين كان هذا الكلام اعتراضاً للمناسبة .والهمزة في { ألم تروا } للاستفهام التقريري مكنى به عن الإِنكار عن عدم العلم بدلائل ما يرونه .والرؤية بصرية . ويجوز أن تكون علمية أي ألم تعلموا فيدخل فيه المرئي من ذلك . وانتصب { كيف } على المفعول به ل { تروا } ، ف { كيف } هنا مجردة عن الاستفهام متمحضة للدلالة على الكيفية ، أي الحالة .والمعنى : ألستم ترون هيئة وحالةَ خلققِ الله السماوات .والسماوات : هنا هي مدارات بمعنى الكواكب فإن لكل كوكب مداراً قد يكون هو سماءَه .وقوله : { سبع سموات } يجوز أن يكون وصف { سبع } معلوماً للمخاطبين من قوم نوح ، أو من أمة الدعوة الإسلامية بأن يكونوا علموا ذلك من قبل؛ فيكون مما شمله فعل { ألم تروا } . ويجوز أن يكون تعليماً للمخاطبين على طريقة الإِدماج ، ولعلهم كانوا سلفاً للكلدانيين في ذلك .و { طباقاً } : بعضها أعلى من بعض ، وذلك يقتضي أنها منفصل بعضها عن بعض وأن بعضها أعلى من بعض سواء كانت متماسَّة أو كان بينها ما يسمى بالخلاء .\n","ar.waseet":"وبعد هذا الترغيب والترهيب والتوبيخ . . أخذ فى لفت أنظارهم إلى عجائب صنع الله فى خلقه ، فقال : ( أَلَمْ تَرَوْاْ كَيْفَ خَلَقَ الله سَبْعَ سَمَاوَاتٍ طِبَاقاً . وَجَعَلَ القمر فِيهِنَّ نُوراً وَجَعَلَ الشمس سِرَاجاً ) .والاستفهام فى قوله : ( أَلَمْ تَرَوْاْ . . ) للتقرير ، والرؤية : بصرية وعلمية ، لأنهم يشاهدون مخلوقات الله - تعالى - ويعلمون أنه - سبحانه - هو الخالق . و ( طِبَاقاً ) أى : متطابقة كل طبقة أعلى من التى تحتها .أى : لقد علمتم ورأيتم أن الله - تعالى - هو الذى خلق ( سَبْعَ سَمَاوَاتٍ ) متطابقة ، بعضها فوق بعض\n","ar.baghawi":"\" ألم تروا كيف خلق الله سبع سماوات طباقا \".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5434.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5434.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5434.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا","transliteration":"Wa ja'alal qamara feehinna nooranw wa ja'alash shamsa siraajaa","translations":{"en.ahmedali":"And has placed the moon therein, an illumination, and has placed the sun, a lighted lamp?","en.ahmedraza":"‘And in them, has illuminated the moon, and made the sun a lamp?’","en.arberry":"and set the moon therein for a light and the sun for a lamp?","en.asad":"and has set up within them the moon as a light [reflected] and set up the sun as a [radiant] lamp?","en.daryabadi":"And hath placed the moon therein for a light, and hath made the sun a lamp?","en.hilali":"And has made the moon a light therein, and made the sun a lamp?","en.pickthall":"And hath made the moon a light therein, and made the sun a lamp?","en.qaribullah":"setting in them the moon as a light and the sun as a lantern?","en.sahih":"And made the moon therein a [reflected] light and made the sun a burning lamp?","en.sarwar":"and placed therein the moon as a light","en.yusufali":"\"'And made the moon a light in their midst, and made the sun as a (Glorious) Lamp?","en.maududi":"and has placed the moon in them as a light, and the sun as a radiant lamp?","en.shakir":"And made the moon therein a light, and made the sun a lamp?","en.itani":"And He set the moon in their midst for light, and He made the sun a lamp.","en.mubarakpuri":"And has made the moon a light therein, and made the sun a lamp","en.qarai":"and has made therein the moon for a light and the sun for a lamp?","en.wahiduddin":"and made the moon therein a light, and made the sun a lamp,"},"tafsir":{"ar.muyassar":"إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا، ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. مالكم -أيها القوم- لا تخافون عظمة الله وسلطانه، وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟ ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض، وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟","ar.jalalayn":"«وجعل القمر فيهن» أي في مجموعهن الصادق بالسماء الدنيا «نورا وجعل الشمس سراجا» مصباحا مضيئا وهو أقوي من نور القمر.","ar.qurtubi":"وجعل القمر فيهن نورا أي في سماء الدنيا ; كما يقال : أتاني بنو تميم وأتيت بني تميم والمراد بعضهم ; قاله الأخفش . قال ابن كيسان : إذا كان في إحداهن فهو فيهن . وقال قطرب : فيهن بمعنى معهن ; وقاله الكلبي . أي خلق الشمس والقمر مع خلق السموات والأرض . وقال جلة أهل اللغة في قول امرئ القيس :وهل ينعمن من كان آخر عهده ثلاثين شهرا في ثلاثة أحوال\" في \" بمعنى مع . النحاس : وسألت أبا الحسن بن كيسان عن هذه الآية فقال : جواب النحويين أنه إذا جعله في إحداهن فقد جعله فيهن ; كما تقول : أعطني الثياب المعلمة ، وإن كنت إنما أعلمت أحدها . وجواب آخر أنه يروى أن وجه القمر إلى السماء ، وإذا كان إلى داخلها فهو متصل بالسموات ، ومعنى نورا أي لأهل الأرض ; قاله السدي . وقال عطاء : نورا لأهل السماء والأرض . وقال ابن عباس وابن عمر : وجهه يضيء لأهل الأرض وظهره يضيء لأهل السماء .وجعل الشمس سراجا يعني مصباحا لأهل الأرض ليتوصلوا إلى التصرف لمعايشهم . وفي إضاءتها لأهل السماء القولان الأولان حكاه الماوردي . وحكى القشيري عن ابن عباس أن الشمس وجهها في السموات وقفاها في الأرض . وقيل : على العكس . وقيل لعبد الله بن عمر : ما بال الشمس تقلينا أحيانا وتبرد علينا أحيانا ؟ فقال : إنها في الصيف في السماء الرابعة ، وفي الشتاء في السماء السابعة عند عرش الرحمن ; ولو كانت في السماء الدنيا لما قام لها شيء .\n","ar.miqbas":"وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا (16)وقوله : { وجعل القمر فيهن نوراً } صالح لاعتبار القمر من السماوات ، أي الكواكب على الاصطلاح القديم المبني على المشاهدة ، لأن ظرفية ( في ) تكون لوقوع المحوي في حاويه مثل الوعاء ، وتكون لوقوع الشيء بين جماعته ، كما في حديث الشفاعة « وتبقى هذه الأمة فيها منافقوها » ، وقول النميري :تَضوَّعَ مسكاً بطن نَعْمَانَ أنْ مشتْبه زينب في نِسْوَةٍ خَفِرَاتِو { القمر } كائن في السماء المماسة للأرض وهي المسماة بالسماء الدنيا ، والله أعلم بأبعادها .وقوله : { وجعل الشمس سراجاً } هو بتقدير : وجعل الشمس فيهن سراجاً ، والشمس من الكواكب .والإِخبار عن القمر بأنه نور مبالغة في وصفه بالإِنارة بمنزلة الوصف بالمصدر . والقمر ينير ضوؤُه الأرضَ إنارة مفيدة بخلاف غيره من نجوم الليل فإن إنارتها لا تجدي البشر .والسراج : المصباح الزاهر نورُه الذي يوقد بفتيلة في الزيت يُضيء التهابُها المعدَّلُ بمقدار بقاء مادة الزيت تغمرها .والإِخبار به عن الشمس من التشبيه البليغ وهو تشبيه ، والقصد منه تقريب المشبه من إدراك السامع ، فإن السراج كان أقصى ما يستضاء به في الليل وقلّ من العرب من يتخذه وإنما كانوا يرونه في أديرة الرُهبان أو قصور الملوك وأضرابهم ، قال امرؤ القيسيضي سناه أو مصابيح راهبٍ ... أمال الذُّبَال بالسليط المفتلووصفوا قصر غُمْدان بالإِضاءة على الطريق ليلاً .ولم يخبر عن الشمس بالضياء كما في آية سورة يونس ( 5 ) { هو الذي جعل الشمس ضياء } ، والمعنى واحد وهو الإضاءة ، فلعل إيثار السراج هنا لمقاربة تعبير نوح في لغته ، مع ما فيه من الرعاية على الفاصلة ، لأن الفواصل التي قبلها جاءت على حروف صحيحة ولو قيل : ضياء لصارت الفاصلة همزة والهمزة قريبة من حروف العلة فيثقل الوقف عليها .وفي جعل القمر نوراً إيماء إلى أن ضوء القمر ليس من ذاته فإن القمر مظلم وإنما يستضيء بانعكاس أشعة الشمس على ما يستقبلها من وجهه بحسب اختلاف ذلك الاستقبال من تبعُّض وتمام هو أثر ظهوره هلالاً ثم اتساع استنارته إلى أن يصير بدراً ، ثم ارتجاع ذلك ، وفي تلك الأحوال يضيء على الأرض إلى أن يكون المحاق . وبعكس ذلك جعلت الشمس سراجاً لأنها ملتهبة وأنوارها ذاتية فيها صادرة عنها إلى الأرض وإلى القمر مثل أنوار السراج تملأ البيت وتُلمع أوانيَ الفضة ونحوها مما في البيت من الأشياء المقابلة .وقد اجتمع في قوله : وجعل القمر فيهن نوراً وجعل الشمس سراجاً } استدلال وامتنان .\n","ar.waseet":"( وَجَعَلَ القمر فِيهِنَّ نُوراً ) أى : وجعل - سبحانه - بقدرته القمر فى السماء الدنيا نورا للأرض ومن فيها .وإنما قال ( فِيهِنَّ ) مع أنه فى السماء الدنيا ، لأنها محاطة بسائر السموات فما فيها يكون كأنه فى الكل . أو لأن كل واحدة منها شفافة ، فيرى الكل كأنه سماء واحدة . فساغ أن يقال فيهن .وقوله : ( وَجَعَلَ الشمس سِرَاجاً ) أى : كالسراج فى إضاءتها وتوهجها وإزالة ظلمة الليل ، إذ السراج هو المصباح الزاهر نوره ، الذى يضئ ما حوله .قال الآلوسى : قوله ( وَجَعَلَ القمر فِيهِنَّ نُوراً ) أى : منوراً لوجه الأرض فى ظلمة الليل ، وجعله فيهن مع أنه فى إحداهن - وهى السماء الدنيا - ، كما يقال : زيد فى بغداد وهو فى بقعة منها . والمراجح له الإِيجاز والملابسة بالكلية والجزئية ، وكونا طباقا شفاة .( وَجَعَلَ الشمس سِرَاجاً ) يزيل الظلمة . . وتنوينه للتعظيم ، وفى الكلام تشبيه بليغ ولكون السراج أعرف وأقرب ، جعل مشبها به ، ولاعتبار التعدى إلى الغير فى مفهومه بخلاف النور ، كان أبلغ منه .وقال بعض العلماء : وفى جعل القمر نورا ، إيماء إلى أن ضوء القمر ليس من ذاته . فإن القمر مظلم . وإنما يستضئ بانعكاس أشعة الشمس على ما يستقبلها من وجهه ، بحسب اختلاف ذلك الاستقبال من تبعض وتمام ، هو أثر ظهوره هلالا . . ثم بدرا .وبعكس ذلك جعلت الشمس سراجا ، لأنها ملتهبة ، وأنوارها ذاتية فيها ، صادرة عنها إلى الأرض وإلى القمر ، مثل أنوار السراج تملأ البيت .\n","ar.baghawi":"(وجعل القمر فيهن نورا ) قال الحسن : يعني في السماء الدنيا كما يقال : أتيت بني تميم ، وإنما أتى بعضهم ، وفلان متوار في دور بني فلان وإنما هو في دار واحدة . وقال عبد الله بن عمرو : إن الشمس والقمر وجوههما إلى السماوات ، وضوء الشمس ونور القمر فيهن وأقفيتهما إلى الأرض . ويروى هذا عن ابن عباس .( وجعل الشمس سراجا ) مصباحا مضيئا . ( والله أنبتكم من الأرض نباتا ) أراد مبدأ خلق آدم خلقه من الأرض والناس ولده ، وقوله : \" نباتا \" اسم جعل في موضع المصدر أي إنباتا قال الخليل : مجازه : أنبتكم فنبتم نباتا . ( ثم يعيدكم فيها ) بعد الموت ( ويخرجكم ) منها يوم البعث أحياء ( إخراجا ( والله جعل لكم الأرض بساطا ) فرشها وبسطها لكم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5435.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5435.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5435.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا","transliteration":"Wallaahu ambatakum minal ardi nabaataa","translations":{"en.ahmedali":"God produced you from the earth like a vegetable growth;","en.ahmedraza":"‘And it is Allah Who made you grow like vegetation from the earth.’","en.arberry":"And God caused you to grow out of the earth,","en.asad":"\"'And God has caused you to grow out of the earth in [gradual] growth; and thereafter He will return you to it [in death]:","en.daryabadi":"And Allah hath caused you to grow from the earth as a growth.","en.hilali":"And Allah has brought you forth from the (dust of) earth. [Tafsir At-Tabari, Vol. 29, Page 97].","en.pickthall":"And Allah hath caused you to grow as a growth from the earth,","en.qaribullah":"Allah has caused you to grow out of the earth,","en.sahih":"And Allah has caused you to grow from the earth a [progressive] growth.","en.sarwar":"and the sun as a torch.","en.yusufali":"\"'And Allah has produced you from the earth growing (gradually),","en.maududi":"And Allah has caused you to grow out of the earth so wondrously,","en.shakir":"And Allah has made you grow out of the earth as a growth:","en.itani":"And God germinated you from the earth like plants.","en.mubarakpuri":"And Allah has brought you forth from the (dust of) earth","en.qarai":"Allah made you grow from the earth, with a [vegetable] growth.","en.wahiduddin":"how God has produced you from the earth and caused you to grow,"},"tafsir":{"ar.muyassar":"والله أنشأ أصلكم من الأرض إنشاء، ثم يعيدكم في الأرض بعد الموت، ويخرجكم يوم البعث إخراجًا محققًا. والله جعل لكم الأرض ممهدة كالبساط؛ لتسلكوا فيها طرقًا واسعة.","ar.jalalayn":"«والله أَنبتكم» خلقكم «من الأرض» إذ خلق أباكم آدم منها «نباتا».","ar.qurtubi":"يعني آدم عليه السلام خلقه من أديم الأرض كلها ; قاله ابن جريج . وقد مضى في سورة \" الأنعام \" و \" البقرة \" بيان ذلك . وقال خالد بن معدان : خلق الإنسان من طين ; فإنما تلين القلوب في الشتاء . و \" نباتا \" مصدر على غير المصدر ; لأن مصدره أنبت إنباتا ، فجعل الاسم الذي هو النبات في موضع المصدر . وقد مضى بيانه في سورة \" آل عمران \" وغيرها . وقيل : هو مصدر محمول على المعنى ; لأن معنى : أنبتكم جعلكم تنبتون نباتا ; قاله الخليل [ ص: 280 ] والزجاج . وقيل : أي أنبت لكم من الأرض النبات . ف \" نباتا \" على هذا نصب على المصدر الصريح . والأول أظهر . وقال ابن جريج : أنبتهم في الأرض بالكبر بعد الصغر وبالطول بعد القصر .\n","ar.miqbas":"وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا (17) أنشأ الاستدلال بخلق السماوات حضورَ الأرض في الخيال فأعقَبَ نوح به دليلَهُ السابقَ ، استدلالاً بأعجب ما يرونه من أحوال ما على الأرض وهو حال الموت والإِقبار ، ومهَّد لذلك ما يتقدمه من إنشاء الناس .وأدمج في ذلك تعليمهم بأن الإِنسان مخلوق من عناصر الأرض مثل النبات وإعلامهم بأن بعد الموت حياة أخرى .وأُطلق على معنى : أنشأكم ، فعلُ { أنبتكم } للمشابهة بين إنشاء الإِنسان وإنبات النبات من حيث إن كليهما تكوين كما قال تعالى : { وأنبتها نباتاً حسناً } [ آل عمران : 37 ] ، أي أنشأها وكما يقولون : زَرعك الله للخير ، ويزيد وجه الشبه هنا قرباً من حيث إن إنشاء الإِنسان مركب من عناصر الأرض ، وقيل التقدير : أنبتَ أصلكم ، أي آدم عليه السلام ، قال تعالى : { كمثل آدم خلقه من تراب } [ آل عمران : 59 ] .و { نباتاً } : اسم من أنبت ، عومل معاملة المصدر فوقع مفعولاً مطلقاً ل { أنبتكم } للتوكيد ، ولم يجر على قياس فعله فيقال : إنباتاً ، لأن نباتاً أخف فلما تسَنى الإِتيان به لأنه مستعمل فصيح لم يُعدل عنه إلى الثقيل كمالاً في الفصاحة ، بخلاف قوله بعده { إخراجاً } فإنه لم يعدل عنه إلى : خروجاً ، لعدم ملاءمته لألفاظ الفواصل قبلَه المبنية على ألف مثل ألف التأسيس فكما تعدّ مخالفتها في القافية عيباً كذلك تُعدّ المحافظة عليها في الأسجاع والفواصل كمالاً .\n","ar.waseet":"ثم انتقل نوح - عليه السلام - من تنبيههم إلى ما فى خلق السموات والشمس والقمر من دلالة على وحدانية الله وقدرته . . إلى لفت أنظارهم إلى التأمل فى خلق أنفسهم ، وفى مبدئهم وإعادتهم إلى الحياة مرة أخرى بعد موتهم ، فقال - كما حكى القرآن عنه - : ( والله أَنبَتَكُمْ مِّنَ الأرض نَبَاتاً . ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجاً )والمراد بأنبتكم : أنشأكم وأوجدكم ، فاستعير الإِنبات للإِنشاء للمشابهة بين إنبات النبات ، وإنشاء الإنسان ، من حيث إن كليهما تكوين وإيجاد للشئ بقدرته - تعالى - .والمراد بأنبتكم : أنبت أصلكم وهو أبوكم آدم ، فأنتم فروع عنه . و ( نَبَاتاً ) مصدر لأنبت على حذف الزوائد ، فهو مفعول مطلق لأنبتكم ، جئ به للتوكيد ، ومصدره القياسى \" إنباتا \" واختير \" نباتا \" لأنه أخف .قال الجمل : قوله : نباتا ، يجوز أن يكون مصدرا لأنبت على حذف الزوائد . ويسمى اسم مصدر ، ويجوز أن يكون مصدرا لنبتم مقدرا . أى : فنبتّم نباتا - فيكون منصوبا بالمطاوع المقدر .أى : والله - تعالى - هو الذى أوجد وأنشأ أباكم آدم من الأرض إنشاء وجعلكم فروعا عنه .\n","ar.baghawi":"\"والله أنبتكم من الأرض نباتاً\"، أراد مبدأ خلق آدم، خلقه من الأرض، والناس ولده، وقوله: \"نباتاً\" اسم جعل في موضع المصدر أي إنباتاً، قال الخليل: مجازه: أنبتكم فنبتم نباتاً.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5436.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5436.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5436.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا","transliteration":"Summa yu'eedukum feehaa wa ukhrijukum ikhraajaa","translations":{"en.ahmedali":"He will then return you back to it, and bring you out again.","en.ahmedraza":"‘And He will then take you back to it, and again remove you from it.”","en.arberry":"then He shall return you into it, and bring you forth.","en.asad":"and [then] He will bring you forth [from It] in resurrection.","en.daryabadi":"And thereafter He will cause you to return thereinto, and He will bring you forth a forthbringing.","en.hilali":"Afterwards He will return you into it (the earth), and bring you forth (again on the Day of Resurrection)?","en.pickthall":"And afterward He maketh you return thereto, and He will bring you forth again, a (new) forthbringing.","en.qaribullah":"and to it He will return you. Then, He will bring you forth.","en.sahih":"Then He will return you into it and extract you [another] extraction.","en.sarwar":"God made you grow from the earth. He will make you return to it and then take you out of it again.","en.yusufali":"\"'And in the End He will return you into the (earth), and raise you forth (again at the Resurrection)?","en.maududi":"and He will later cause you to return to it and will then again bring you out of it.","en.shakir":"Then He returns you to it, then will He bring you forth a (new) bringing forth:","en.itani":"Then He will return you into it, and will bring you out again.","en.mubarakpuri":"Afterwards He will return you into it (the earth), and bring you forth.","en.qarai":"Then He makes you return to it, and He will bring you forth [without fail].","en.wahiduddin":"how He will then return you to it and bring you forth again,"},"tafsir":{"ar.muyassar":"والله أنشأ أصلكم من الأرض إنشاء، ثم يعيدكم في الأرض بعد الموت، ويخرجكم يوم البعث إخراجًا محققًا. والله جعل لكم الأرض ممهدة كالبساط؛ لتسلكوا فيها طرقًا واسعة.","ar.jalalayn":"«ثم يعيدكم فيها» مقبورين «ويخرجكم» للبعث «إخراجا».","ar.qurtubi":"ثم يعيدكم فيها أي عند موتكم بالدفن .ويخرجكم إخراجا بالنشور للبعث يوم القيامة .\n","ar.miqbas":"ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا (18)وقد أدمج الإِنذار بالبعث في خلال الاستدلال ، ولكونه أهم رتبة من الاستدلال عليهم بأصل الإِنشاء عطفت الجملة ب { ثم } الدالة على التراخي الرتبي في قوله : { ثم يعيدكم فيها ويخرجكم إخراجاً } لأن المقصود من الجملة هو فعل { يخرجكم } ، وأما قوله : { ثم يعيدكم } فهو تمهيد له .وأكد { يخرجكم } بالمفعول المطلق لردّ إنكارهم البعث .\n","ar.waseet":"ثم يعيدكم إلى هذه الأرض بعد موتكم لتكون قبورا لكم ، ثم يخرجكم منها يوم البعث للحساب والجزاء .وعبر - سبحانه - عن الإِنشاء بالإِنبات ، لأن هذا التعبير يشعر بأن الإِنسان مخلوق محدث ، وأنه مثل النبات يحصد مثل يعود إلى الحياة مرة أخرى .وإلى هذا المعنى أشار صاحب الكشاف بقوله : \" استعير الإِنبات للإِنشاء كما يقال : زرعك الله للخير . وكانت هذه الاستعارة أدل دليل على الحدوث لأنهم إذا كانوا نباتا كانوا محدثين لا محالة حدوث النبات \" .\n","ar.baghawi":"\"ثم يعيدكم فيها\"، بعد الموت، \"ويخرجكم\"، منها يوم البعث أحياء، \"إخراجاً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5437.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5437.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5437.mp3","format":"mp3","local_path":null}}},{"verse":19,"arabic":"وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا","transliteration":"Wallaahu ja'ala lakumul arda bisaataa","translations":{"en.ahmedali":"God has made the earth for you a spreading,","en.ahmedraza":"‘And it is Allah Who made the earth a bed for you.’","en.arberry":"And God has laid the earth for you as a carpet,","en.asad":"\"'And God has made the earth a wide expanse for you,","en.daryabadi":"And Allah hath made the earth Unto you an expanse.","en.hilali":"And Allah has made for you the earth wide spread (an expanse).","en.pickthall":"And Allah hath made the earth a wide expanse for you","en.qaribullah":"Allah has made the earth spread out for you","en.sahih":"And Allah has made for you the earth an expanse","en.sarwar":"God has spread out the earth","en.yusufali":"\"'And Allah has made the earth for you as a carpet (spread out),","en.maududi":"Allah has made the earth a wide expanse for you","en.shakir":"And Allah has made for you the earth a wide expanse,","en.itani":"And God made the earth a spread for you.","en.mubarakpuri":"And Allah has made for you the earth a wide expanse.","en.qarai":"Allah has made the earth a vast expanse for you","en.wahiduddin":"how God has spread the earth out for you"},"tafsir":{"ar.muyassar":"والله أنشأ أصلكم من الأرض إنشاء، ثم يعيدكم في الأرض بعد الموت، ويخرجكم يوم البعث إخراجًا محققًا. والله جعل لكم الأرض ممهدة كالبساط؛ لتسلكوا فيها طرقًا واسعة.","ar.jalalayn":"«والله جعل لكم الأرض بساطا» مبسوطة.","ar.qurtubi":"أي مبسوطة .\n","ar.miqbas":"وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا (19) هذا استدلال وامتنان ، ولذلك عُلق بفعل { جعل } مجرورٌ بلام التعليل وهو { لكم } أي لأجلكم .والبساط : ما يفرش للنوم عليه والجلوس من ثوب أو زربية فالإِخبار عن الأرض ببساط تشبيه بليغ ، أي كالبساط ، ووجه الشبه تناسب سطح الأرض في تعادل أجزائه بحيث لا يوجع أرجل الماشين ولا يُقِضُّ جنوب المضطجعين ، وليس المراد أن الله جعل حجم الأرض كالبساط لأن حجم الأرض كُرَوي\n","ar.waseet":"ثم ختم نوح - عليه السلام - إرشاداته لقومه ، بلفت أنظارهم إلى نعمة الأرض التى يعيشون عليها ، فقال : ( والله أَنبَتَكُمْ مِّنَ الأرض نَبَاتاً . ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجاً . والله جَعَلَ لَكُمُ الأرض بِسَاطاً . لِّتَسْلُكُواْ مِنْهَا سُبُلاً فِجَاجاً )أى : والله - تعالى - وحده هو الذى جعل لكم - بفضله ومنته - الأرض مبسوطة ، حيث تتقلبون عليها كما يتقلب النائم على البساط .وجعلها لكم كذلك ( فِجَاجاً ) أى : متسعة جمع فج وهو الطريق الواسع .وقوله : ( بِسَاطاً ) تشبيه بليغ . أى : جعلها لكم كالبساط ، وهذا لا يتنافى مع كون الأرض كروية ، لأن الكرة إذا عظمت جدا ، كانت القطعة منها كالسطح والبساط فى إمكان الانتفاع بها ، والتقلب على أرجائها .وهكذا نرى أن نوحا - عليه السلام - قد سلك مع قومه مسالك متعددة لإِقناعهم بصحة ما يدعوهم إليه ، ولحملهم على طاعته ، والإِيمان بصدق رسالته .لقد دعاهم بالليل والنهار ، وفى السر وفى العلانية ، وبين لهم أن طاعتهم لله - تعالى - تؤدى إلى إمدادهم بالأموال والأولاد ، والجنات والأنهاهر ووبخهم على عدم خشيتهم من الله - تعالى - وذكرهم بأطوار خلقهم ، ولفت أنظارهم إلى بديع صنعه - سبحانه - فى خلق السموات والشمس والقمر ، ونبههم إلى نشأتهم من الأرض ، وعودتهم إليها ، وإخراجهم منها للحساب والجزاء ، وأرشدهم إلى نعم الله - تعالى - فى جعل الأرض مبسوطة لهم .\n","ar.baghawi":"\"والله جعل لكم الأرض بساطاً\"، فرشها وبسطها لكم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5438.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5438.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5438.mp3","format":"mp3","local_path":null}}},{"verse":20,"arabic":"لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا","transliteration":"Litaslukoo minhaa subulan fijaajaa","translations":{"en.ahmedali":"So that you may walk upon its spacious paths.'","en.ahmedraza":"‘So that you may tread the wide roads in it.’”","en.arberry":"that thereof you may thread ways, ravines.\"","en.asad":"so that you might walk thereon on spacious paths.’\"","en.daryabadi":"That of it ye may traverse the ways open.","en.hilali":"That you may go about therein in broad roads.","en.pickthall":"That ye may thread the valley-ways thereof.","en.qaribullah":"so that you walk in its spacious paths.'","en.sahih":"That you may follow therein roads of passage.' \"","en.sarwar":"for you, so that you may walk along its wide roads\".","en.yusufali":"\"'That ye may go about therein, in spacious roads.'\"","en.maududi":"so that you may tread its spacious paths.”","en.shakir":"That you may go along therein in wide paths.","en.itani":"That you may travel its diverse roads.’”","en.mubarakpuri":"That you may go about therein in broad roads.","en.qarai":"so that you may travel over its spacious ways.’’ ’","en.wahiduddin":"so that you may walk along its spacious paths?\""},"tafsir":{"ar.muyassar":"والله أنشأ أصلكم من الأرض إنشاء، ثم يعيدكم في الأرض بعد الموت، ويخرجكم يوم البعث إخراجًا محققًا. والله جعل لكم الأرض ممهدة كالبساط؛ لتسلكوا فيها طرقًا واسعة.","ar.jalalayn":"«لتسلكوا منها سبلا» طرقا «فجاجا» واسعة.","ar.qurtubi":"لتسلكوا منها سبلا فجاجا السبل : الطرق . والفجاج جمع فج ، وهو الطريق الواسعة ; قاله الفراء . وقيل : الفج المسلك بين الجبلين . وقد مضى في سورة \" الأنبياء \" و \" الحج \" .\n","ar.miqbas":"لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا (20)، وقد نبه على ذلك بالعلةِ الباعثة في قوله : { لكم } ، والعلةِ الغائبة في قوله : { لتسلكوا منها سبلاً } وحصل من مجموع العلتين الإِشارة إلى جميع النعم التي تحصل للناس من تسوية سطح الأرض مثل الحرث والزرع ، وإلى نعمة خاصة وهي السير في الأرض ، وخصت بالذكر لأنها أهم لاشتراك كل الناس في الاستفادة منها .والسبُل : جمع سبيل وهو الطريق ، أي لتتخذوا لأنفسكم سُبلاً من الأرض تهتدونَ بها في أسفاركم .والفِجاج : جمع فجٌ ، والفَجّ : الطريق الواسع ، وأكثر ما يطلق على الطريق بين جبلين لأنه يكون أوسعَ من الطريق المعتاد .\n","ar.waseet":"ثم ختم نوح - عليه السلام - إرشاداته لقومه ، بلفت أنظارهم إلى نعمة الأرض التى يعيشون عليها ، فقال : ( والله أَنبَتَكُمْ مِّنَ الأرض نَبَاتاً . ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجاً . والله جَعَلَ لَكُمُ الأرض بِسَاطاً . لِّتَسْلُكُواْ مِنْهَا سُبُلاً فِجَاجاً )أى : والله - تعالى - وحده هو الذى جعل لكم - بفضله ومنته - الأرض مبسوطة ، حيث تتقلبون عليها كما يتقلب النائم على البساط .وجعلها لكم كذلك ( فِجَاجاً ) أى : متسعة جمع فج وهو الطريق الواسع .وقوله : ( بِسَاطاً ) تشبيه بليغ . أى : جعلها لكم كالبساط ، وهذا لا يتنافى مع كون الأرض كروية ، لأن الكرة إذا عظمت جدا ، كانت القطعة منها كالسطح والبساط فى إمكان الانتفاع بها ، والتقلب على أرجائها .وهكذا نرى أن نوحا - عليه السلام - قد سلك مع قومه مسالك متعددة لإِقناعهم بصحة ما يدعوهم إليه ، ولحملهم على طاعته ، والإِيمان بصدق رسالته .لقد دعاهم بالليل والنهار ، وفى السر وفى العلانية ، وبين لهم أن طاعتهم لله - تعالى - تؤدى إلى إمدادهم بالأموال والأولاد ، والجنات والأنهاهر ووبخهم على عدم خشيتهم من الله - تعالى - وذكرهم بأطوار خلقهم ، ولفت أنظارهم إلى بديع صنعه - سبحانه - فى خلق السموات والشمس والقمر ، ونبههم إلى نشأتهم من الأرض ، وعودتهم إليها ، وإخراجهم منها للحساب والجزاء ، وأرشدهم إلى نعم الله - تعالى - فى جعل الأرض مبسوطة لهم .\n","ar.baghawi":"\"لتسلكوا منها سبلاً فجاجاً\"، طرقاً واسعة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5439.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5439.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5439.mp3","format":"mp3","local_path":null}}},{"verse":21,"arabic":"قَالَ نُوحٌ رَبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا","transliteration":"Qaala Noohur Robbi innahum 'asawnee wattaba'oo mal lam yazid hu maaluhoo wa waladuhooo illaa khasaara","translations":{"en.ahmedali":"But they did not listen to me,\" Noah said, \"and followed him whose wealth and children only added to his ruin.","en.ahmedraza":"Prayed Nooh, “O my Lord! They have disobeyed me, and they follow the one whose wealth and children increase nothing for him except ruin.”","en.arberry":"Noah said, 'My Lord, they have rebelled against me, and followed him whose wealth and children increase him only in loss,","en.asad":"[And] Noah continued: \"O my Sustainer! Behold, they have opposed me [throughout], for they follow people whose wealth and children lead them increasingly into ruin,","en.daryabadi":"Nuh said. my Lord! verily they have disobeyed me and followed them whose riches and children have only increased them in loss.","en.hilali":"Nuh (Noah) said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but only loss.","en.pickthall":"Noah said: My Lord! Lo! they have disobeyed me and followed one whose wealth and children increase him in naught save ruin;","en.qaribullah":"Noah said: 'My Lord, they have rebelled against me and followed he whose wealth and offspring increase him only in loss,","en.sahih":"Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.","en.sarwar":"Noah said, \"Lord, they have disobeyed me and followed those whose wealth and children will only bring about destruction for them.","en.yusufali":"Noah said: \"O my Lord! They have disobeyed me, but they follow (men) whose wealth and children give them no increase but only Loss.","en.maududi":"Noah said: “My Lord, they did not pay heed to what I said, and followed those (nobles) whose possession of wealth and children has led them to an even greater loss.","en.shakir":"Nuh said: My Lord! surely they have disobeyed me and followed him whose wealth and children have added to him nothing but loss.","en.itani":"Noah said, “My Lord, they have defied me, and followed him whose wealth and children increase him only in perdition.”","en.mubarakpuri":"Nuh said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but loss.\"","en.qarai":"Noah said, ‘My Lord! They have disobeyed me, following someone whose wealth and children only add to his loss,","en.wahiduddin":"Noah supplicated, \"Lord, they have disobeyed me, and followed those whose wealth and children have only added to their ruin;"},"tafsir":{"ar.muyassar":"قال نوح: ربِّ إن قومي بالغوا في عصياني وتكذيبي، واتبع الضعفاء منهم الرؤساء الضالين الذين لم تزدهم أموالهم وأولادهم إلا ضلالا في الدنيا وعقابًا في الآخرة، ومكر رؤساء الضلال بتابعيهم من الضعفاء مكرًا عظيمًا، وقالوا لهم: لا تتركوا عبادة آلهتكم إلى عبادة الله وحده، التي يدعو إليها نوح، ولا تتركوا وَدًّا ولا سُواعًا ولا يغوث ويعوق ونَسْرا - وهذه أسماء أصنامهم التي كانوا يعبدونها من دون الله، وكانت أسماء رجال صالحين، لما ماتوا أوحى الشيطان إلى قومهم أن يقيموا لهم التماثيل والصور؛ لينشطوا- بزعمهم- على الطاعة إذا رأوها، فلما ذهب هؤلاء القوم وطال الأمد، وخَلَفهم غيرهم، وسوس لهم الشيطان بأن أسلافهم كانوا يعبدون التماثيل والصور، ويتوسلون بها، وهذه هي الحكمة من تحريم التماثيل، وتحريم بناء القباب على القبور؛ لأنها تصير مع تطاول الزمن معبودة للجهال. وقد أضلَّ هؤلاء المتبوعون كثيرًا من الناس بما زيَّنوا لهم من طرق الغَواية والضلال. ثم قال نوح -عليه السلام-: ولا تزد- يا ربنا- هؤلاء الظالمين لأنفسهم بالكفر والعناد إلا بُعْدا عن الحق. فبسبب ذنوبهم وإصرارهم على الكفر والطغيان أُغرقوا بالطوفان، وأُدخلوا عقب الإغراق نارًا عظيمة اللهب والإحراق، فلم يجدوا من دون الله مَن ينصرهم، أو يدفع عنهم عذاب الله.","ar.jalalayn":"«قال نوح رب إنهم عصوني واتبعوا» أي السفلة والفقراء «من لم يزده ماله وَوُلْدُهُ» وهم الرؤساء المنعم عليهم بذلك، وولد بضم الواو وسكون اللام وبفتحهما، والأول قيل جمع ولد بفتحهما كخشب وخشب وقيل بمعناه كبخل وبخل «إلا خسارا» طغيانا وكفرا.","ar.qurtubi":"قوله تعالى : قال نوح رب إنهم عصوني واتبعوا من لم يزده ماله وولده إلا خساراشكاهم إلى الله تعالى ، وأنهم عصوه ولم يتبعوه فيما أمرهم به من الإيمان . وقال أهل التفسير : لبث فيهم ألف سنة إلا خمسين عاما داعيا لهم وهم على كفرهم وعصيانهم . قال ابن عباس : رجا نوح عليه السلام الأبناء بعد الآباء ; فيأتي بهم الولد بعد الولد حتى بلغوا سبع قرون ، ثم دعا عليهم بعد الإياس منهم ، وعاش بعد الطوفان ستين عاما حتى كثر الناس وفشوا . قال الحسن : كان قوم نوح يزرعون في الشهر مرتين ; حكاه الماوردي . واتبعوا من لم يزده ماله وولده إلا خسارا يعني كبراءهم وأغنياءهم الذين لم يزدهم كفرهم وأموالهم وأولادهم إلا ضلالا في الدنيا وهلاكا في الآخرة . وقرأ أهل المدينة والشام وعاصم : \" وولده \" بفتح الواو واللام . الباقون \" ولده \" بضم الواو وسكون اللام وهي لغة في الولد . ويجوز أن يكون جمعا للولد ، كالفلك فإنه واحد وجمع . وقد تقدم .\n","ar.miqbas":"قَالَ نُوحٌ رَبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا (21) هذه الجملة بدل من جملة { قال رب إني دَعوت قومي } [ نوح : 5 ] بدلَ اشتمال لأن حكاية عصيان قومه إياه مما اشتملت عليه حكاية أنه دعاهم فيحتمل أن تكون المقالتان في وقت واحد جاء فيه نوح إلى مناجاة ربه بالجواب عن أمره له بقوله : { أنْذر قومك من قبل أن يأتيهم عذاب أليم } [ نوح : 1 ] فتكون إعادة فعل { قال } من قبيل ذكر عامل المبدل منه في البدل كقوله تعالى : { تكون لنا عيداً لأولنا وآخرنا } [ المائدة : 114 ] ، للربط بين كلاميه لطول الفصل بينهما .ويحتمل أن تكون المقالتان في وقتين جمعها القرآن حكاية لجوابيه لربه ، فتكون إعادة فعل { قال } لما ذكرنا مع الإِشارة إلى تباعد ما بين القولين .ويجوز أن تكون الجملة مستأنفة استئنافاً بيانياً لأن ما سبقها من قوله : { قال رب إني دعوت قومي إلى هنا مما يثير عجباً من حال قومه المحكي بحيث يتساءل السامع عن آخر أمرهم ، فابتدىء ذكر ذلك بهذه الجملة وما بعدها إلى قوله : أنصاراً } [ نوح : 25 ] . وتأخير هذا بعد عن قوله { قال رب إني دعوت قومي ليلاً ونهاراً } [ نوح : 5 ] ارتقاء في التذمر منهم لأن هذا حكاية حصول عصيانهم بعد تقديم الموعظة إليهم بقوله : { يرسل السماء عليكم مدراراً إلى قوله : سُبُلاً فجاجاً } [ نوح : 1120 ]وإظهار اسم { نوح } مع القول الثاني دون إضمارٍ لبعد معاد الضمير لو تحمَّله الفعل ، وهذا الخبر مستعمل في لازم معناه ، كما تقدم في قوله : { قال رب الخ . وتأكيد الخبر ب ( إن ) للاهتمام بما استعمل فيه من التحسر والاستنصار .ثم ذكر أنهم أخذوا بقول الذين يصدونهم عن قبول دعوة نوح ، أي اتبعوا سادتهم وقادتهم . وعدل عن التعبير عنهم بالكبراء ونحوه إلى الموصول لما تؤذن به الصلة من بطرهم نعمة الله عليهم بالأموال والأولاد ، فقلبوا النعمة عندهم موجب خسار وضلال .وأدمج في الصلة أنهم أهل أموال وأولاد إيماء إلى أن ذلك سبب نفاذ قولهم في قومهم وائتمار القوم بأمرهم : فأموالهم إذ أنفقوها لتأليف أتباعهم قال تعالى : { إن الذين كفروا ينفقون أموالهم ليصدّوا عن سبيل الله } [ الأنفال : 36 ] ، وأولادُهم أرهبوا بهم من يقاومهم .والمعنى : واتبعوا أهل الأموال والأولاد التي لم تزدهم تلك الأموال والأولاد إلاّ خساراً لأنهم استعملوها في تأييد الكفر والفساد فزادتهم خساراً إذ لو لم تكن لهم أموال ولا أولاد لكانوا أقل ارتكاباً للفساد قال تعالى : { وذرني والمكذبين أولي النعمة ومهلهم قليلاً } [ المزمل : 11 ] .والخسار : مستعار لحصول الشر من وسائلَ شأنُها أن تكون سبب خير كخسارة التاجر من حيث أراد الربح ، فإذا كان هؤلاء خاسرين فالذين يتبعونهم يكونون مثلهم في الخسارة وهم يحسبون أنهم أرشدوهم إلى النجاح .ومَا صْدَق { مَنْ } فريقٌ من القوم أهل مال وأولاد ازدادوا بذلك بطَراً دون الشكر وهم سادتهم\n","ar.waseet":"وهكذا حاول نوح - عليه السلام - أن يصل إلى آذان قومه وإلى عقولهم وقلوبهم ، بشتى الأساليب الحكيمة ، والتوجيهات القويمة ، فى صبر طويل وإرشاد دائم .ولكن قومه كانوا قد بلغوا الغاية فى الغباء والجهالة والعناد والطغيان ، لذى نرى السورة الكريمة تحكى عن نوح - عليه السلام - ضراعته إلى ربه ، والتماسه منه - تعالى استئصال شأفتهم ، وقطع دابرهم ، لنستمع فى تدبر إلى قوله - تعالى - .( قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِي واتبعوا . . . ) .قوله - سبحانه - : ( قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِي واتبعوا . . ) كلام مستأنف . لأن ما سبقه يستدعى سؤالا تقديره : ماذا كانت عاقبة قوم نوح بعد أن نصحهم ووعظهم بتلك الأساليب المتعددة؟ فكان الجواب : ( قَالَ نُوحٌ ) - عليه السلام - بعد أن طال نصحه لقومه ، وبعد أن مكث فيهم ألف سنة إلا خمسين عاما ، وبعد أن يئس من إيمانهم وبعد أخبره - سبحانه - أنه لن يؤمن من قومك إلا من قد آمن .( قَالَ ) متضرعا إلى ربه ( رَّبِّ إِنَّهُمْ عَصَوْنِي ) أى : إن قومى قد عصونى وخالفوا أمرى ، وكرهوا صحبتى ، وأصروا واستكبروا استكبارا عظيما فى دعوتى .( واتبعوا مَن لَّمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلاَّ خَسَاراً ) أى : إنهم أصروا على معصيتى ، ولم يكتفوا بذلك بل بجانب إعراضهم عنى ، اتبعوا غيرى . . اتبعوا رؤساءهم أهل الأموال والأولاد الذين لم تزدهم النعم التى أنعمت بها عليهم إلا خسرانا وجحودا ، وضلالا فى الدنيا ، وعقوبة فى الآخرة .فالمراد بالذين لم يزدهم مالهم وولدهم إلا خسارا : أولئك الكبراء والزعماء الذين رزقهم الله المال والولد ، ولكنهم استعملوا نعمه فى معصيته لا فى طاعته .\n","ar.baghawi":"\"قال نوح رب إنهم عصوني\"، لم يجيبوا دعوتي، \"واتبعوا من لم يزده ماله وولده إلا خساراً\"، يعني: اتبع السفلة والفقراء القادة والرؤساء الذين لم يزدهم كثرة المال والولد إلا ضلالاً في الدنيا وعقوبة في الآخرة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5440.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5440.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5440.mp3","format":"mp3","local_path":null}}},{"verse":22,"arabic":"وَمَكَرُوا مَكْرًا كُبَّارًا","transliteration":"Wa makaroo makran kubbaaraa","translations":{"en.ahmedali":"And they contrived a plot of great magnitude,","en.ahmedraza":"“And they carried out a very sinister scheme.”","en.arberry":"and have devised a mighty device","en.asad":"and who have devised a most awesome blasphemy [against Thee],","en.daryabadi":"And who have plotted a tremendous plot","en.hilali":"\"And they have plotted a mighty plot.","en.pickthall":"And they have plotted a mighty plot,","en.qaribullah":"they have devised a mighty plot,","en.sahih":"And they conspired an immense conspiracy.","en.sarwar":"They have arrogantly plotted evil plans against me,","en.yusufali":"\"And they have devised a tremendous Plot.","en.maududi":"They contrived a plot of great magnitude.","en.shakir":"And they have planned a very great plan.","en.itani":"And they schemed outrageous schemes.","en.mubarakpuri":"\"And they have plotted a mighty plot.\"","en.qarai":"and they have devised an outrageous plot.","en.wahiduddin":"and they have hatched a mighty plot,"},"tafsir":{"ar.muyassar":"قال نوح: ربِّ إن قومي بالغوا في عصياني وتكذيبي، واتبع الضعفاء منهم الرؤساء الضالين الذين لم تزدهم أموالهم وأولادهم إلا ضلالا في الدنيا وعقابًا في الآخرة، ومكر رؤساء الضلال بتابعيهم من الضعفاء مكرًا عظيمًا، وقالوا لهم: لا تتركوا عبادة آلهتكم إلى عبادة الله وحده، التي يدعو إليها نوح، ولا تتركوا وَدًّا ولا سُواعًا ولا يغوث ويعوق ونَسْرا - وهذه أسماء أصنامهم التي كانوا يعبدونها من دون الله، وكانت أسماء رجال صالحين، لما ماتوا أوحى الشيطان إلى قومهم أن يقيموا لهم التماثيل والصور؛ لينشطوا- بزعمهم- على الطاعة إذا رأوها، فلما ذهب هؤلاء القوم وطال الأمد، وخَلَفهم غيرهم، وسوس لهم الشيطان بأن أسلافهم كانوا يعبدون التماثيل والصور، ويتوسلون بها، وهذه هي الحكمة من تحريم التماثيل، وتحريم بناء القباب على القبور؛ لأنها تصير مع تطاول الزمن معبودة للجهال. وقد أضلَّ هؤلاء المتبوعون كثيرًا من الناس بما زيَّنوا لهم من طرق الغَواية والضلال. ثم قال نوح -عليه السلام-: ولا تزد- يا ربنا- هؤلاء الظالمين لأنفسهم بالكفر والعناد إلا بُعْدا عن الحق. فبسبب ذنوبهم وإصرارهم على الكفر والطغيان أُغرقوا بالطوفان، وأُدخلوا عقب الإغراق نارًا عظيمة اللهب والإحراق، فلم يجدوا من دون الله مَن ينصرهم، أو يدفع عنهم عذاب الله.","ar.jalalayn":"«ومكروا» أي الرؤساء «مكرا كبَّارا» عظيما جدا بأن كذبوا نوحا وآذوه ومن اتبعه.","ar.qurtubi":"قوله تعالى : ومكروا مكرا كبارا أي كبيرا عظيما . يقال : كبير وكبار وكبار ، مثل عجيب وعجاب وعجاب بمعنى ، ومثله [ ص: 281 ] طويل وطوال وطوال . يقال : رجل حسن وحسان ، وجميل وجمال ، وقراء للقارئ ، ووضاء للوضيء . وأنشد ابن السكيت :بيضاء تصطاد القلوب وتستبي بالحسن قلب المسلم القراءوقال آخر :والمرء يلحقه بفتيان الندى     خلق الكريم وليس بالوضاءوقال المبرد : كبارا ( بالتشديد ) للمبالغة . وقرأ ابن محيصن وحميد ومجاهد \" كبارا \" بالتخفيف . واختلف في مكرهم ما هو ؟ فقيل : تحريشهم سفلتهم على قتل نوح . وقيل : هو تعزيرهم الناس بما أوتوا من الدنيا والولد ; حتى قالت الضعفة : لولا أنهم على الحق لما أوتوا هذه النعم . وقال الكلبي : هو ما جعلوه لله من الصاحبة والولد . وقيل : مكرهم كفرهم . وقال مقاتل : هو قول كبرائهم لأتباعهم : لا تذرن آلهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا .\n","ar.miqbas":"وَمَكَرُوا مَكْرًا كُبَّارًا (22) ، ولذلك أعيد عليه ضمير الجمع في قوله : { ومكَروا ، } وقوله : { وقالوا ، } وقوله :{ وقد أضلُّوا كثيراً } [ نوح : 24 ] .وقرأ نافع وابن عامر وعاصم وأبو جعفر { وَولَده } بفتح الواو وفتح اللام ، وقرأه ابن كثير وأبو عمرو وحمزة والكسائي ويعقوب وخلف { وَوُلْدُه } بضم الواو وسكون اللام ، فأما الولد بفتح الواو وفتح اللام فاسم يطلق على الواحد من الأولاد وعلى الجمع فيكون اسم جنس ، وأما وُلْد بضم فسكون فقيل : هو لغة في وَلَد فيستوي فيه الواحد والجمع مثل الفُلْك . وقيل : هو جمع ولَد مثل أُسُد جمع أَسَد .والمكر : إخفاء العمل ، أو الرأي الذي يراد به ضر الغير ، أي مكروا بنوح والذين آمنوا معه بإضمار الكيد لهم حتى يقعوا في الضر . قيل : كانوا يدبِّرون الحيلة على قتل نوح وتحْريش الناس على أذاه وأذى أتْبَاعه .و { كُبَّارا } : مبالغة ، أي كبيراً جداً وهو وارد بهذه الصِّيغة في ألفاظ قليلة مثل طُوَّال أي طويل جداً ، وعُجَّاب ، أي عجيب ، وحُسَّان ، وجُمَّال ، أي جَميل ، وقُرَّاء لكثير القراءة ، ووُضَّاء ، أي وضِيء ، قال عيسى بن عمر : هي لغة يمانية .\n","ar.waseet":"وقوله : ( وَمَكَرُواْ مَكْراً كُبَّاراً ) صفة أخرى من صفاتهم الذميمة ، وهو معطوف على صلة \" من \" والجمع باعتبار معناها ، كما أن الإِفراد فى الضمائر السابقة باعتبار اللفظ .والمكر : هو التدبير فى خفاء لإِنزال السوء بالممكور به .أى : أن هؤلاء الزعماء الذين استعملوا نعمك فى الشر ، لم يكتفوا بتحريض أتباعهم على معصيتى ، بل مكروا بى وبالمؤمنين مكرا قد بلغ النهاية فى الضخامة والعظم .فقوله : ( كُبَّاراً ) مبالغة فى الكبر والعظم . أى : مكرا كبيرا جدا لا تحيط بحجمه العبارة .وكان من مظاهر مكرهم : تحريضهم لسفلتهم على إنزال الأذى بنوح - عليه السلام - وبأتباعه - وإيهامهم لهؤلاء السفلة أنهم على الحق ، وأن نوحا ومن معه على الباطل .\n","ar.baghawi":"( ومكروا مكرا كبارا ) أي كبيرا عظيما يقال : كبير وكبار بالتخفيف كبار بالتشديد ، كلها بمعنى واحد ، كما يقال : أمر عجيب وعجاب وعجاب بالتشديد وهو أشد في المبالغة .واختلفوا في معنى مكرهم . قال ابن عباس : قالوا قولا عظيما . وقال الضحاك : افتروا على الله وكذبوا رسله وقيل : منع الرؤساء أتباعهم عن الإيمان بنوح [ وحرضوهم ] على قتله .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5441.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5441.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5441.mp3","format":"mp3","local_path":null}}},{"verse":23,"arabic":"وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا","transliteration":"Wa qaaloo laa tazarunna aalihatakum wa laa tazarunna Waddanw wa laa Suwaa'anw wa laa Yaghoosa wa Ya'ooqa wa Nasraa","translations":{"en.ahmedali":"And said: 'Do not abandon your gods, and do not abandon Wadda or Suwa', or Yaghuth, Ya'uq or Nasr.'","en.ahmedraza":"“And they said, ‘Do not ever abandon your Gods – and never abandon Wadd, or Suwa – or Yaghuth or Yauq or Nasr.’”","en.arberry":"and have said, \"Do not leave your gods, and do not leave Wadd, nor Suwa', Yaghuth, Ya'uq, neither Nasr.\"","en.asad":"inasmuch as they said [to their followers], 'Do not ever abandon your gods: abandon neither Wadd nor Suwa', and neither Yaghuth nor Ya’uq nor Nasr!'","en.daryabadi":"And who have said: ye shall not leave your gods; nor Shall ye leave Wadd nor Suwa', nor Yaghuth, nor Ya'uq nor Nasr.","en.hilali":"\"And they have said: 'You shall not leave your gods, nor shall you leave Wadd, nor Suwa', nor Yaghuth, nor Ya'uq, nor Nasr (names of the idols);","en.pickthall":"And they have said: Forsake not your gods. Forsake not Wadd, nor Suwa', nor Yaghuth and Ya'uq and Nasr.","en.qaribullah":"and said: 'Do not renounce your gods, do not leave waddan or suwa'an or yaghutha, or ya'uqa, or nasra'","en.sahih":"And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.","en.sarwar":"and have said to each other, 'Do not give-up your idols. Do not renounce Wadd, Suwa`, Yaghuth, Ya`uq and Nasr (names of certain idols).","en.yusufali":"\"And they have said (to each other), 'Abandon not your gods: Abandon neither Wadd nor Suwa', neither Yaguth nor Ya'uq, nor Nasr';-","en.maududi":"They said: “Do not abandon your deities; do not abandon Wadd, nor Suwa, nor Yaghuth, nor Yauq, nor Nasr.","en.shakir":"And they say: By no means leave your gods, nor leave Wadd, nor Suwa; nor Yaghus, and Yauq and Nasr.","en.itani":"And they said, “Do not give up your gods; do not give up Wadd, nor Souwa, nor Yaghoos, and Yaooq, and Nassr.","en.mubarakpuri":"\"And they have said: `You shall not leave your gods, nor shall you leave Wadd, nor Suwa`, nor Yaghuth, and Ya`uq and Nasr.' \"","en.qarai":"They say, ‘‘Do not abandon your gods. Do not abandon Wadd, nor Suwa, nor Yaghuth, Ya‘uq and Nasr,’’","en.wahiduddin":"and they said [to their followers], \"Do not ever abandon your deities: abandon neither Wadd, nor Suwa', and neither Yaghuth, nor Yauq nor Nasr!\""},"tafsir":{"ar.muyassar":"قال نوح: ربِّ إن قومي بالغوا في عصياني وتكذيبي، واتبع الضعفاء منهم الرؤساء الضالين الذين لم تزدهم أموالهم وأولادهم إلا ضلالا في الدنيا وعقابًا في الآخرة، ومكر رؤساء الضلال بتابعيهم من الضعفاء مكرًا عظيمًا، وقالوا لهم: لا تتركوا عبادة آلهتكم إلى عبادة الله وحده، التي يدعو إليها نوح، ولا تتركوا وَدًّا ولا سُواعًا ولا يغوث ويعوق ونَسْرا - وهذه أسماء أصنامهم التي كانوا يعبدونها من دون الله، وكانت أسماء رجال صالحين، لما ماتوا أوحى الشيطان إلى قومهم أن يقيموا لهم التماثيل والصور؛ لينشطوا- بزعمهم- على الطاعة إذا رأوها، فلما ذهب هؤلاء القوم وطال الأمد، وخَلَفهم غيرهم، وسوس لهم الشيطان بأن أسلافهم كانوا يعبدون التماثيل والصور، ويتوسلون بها، وهذه هي الحكمة من تحريم التماثيل، وتحريم بناء القباب على القبور؛ لأنها تصير مع تطاول الزمن معبودة للجهال. وقد أضلَّ هؤلاء المتبوعون كثيرًا من الناس بما زيَّنوا لهم من طرق الغَواية والضلال. ثم قال نوح -عليه السلام-: ولا تزد- يا ربنا- هؤلاء الظالمين لأنفسهم بالكفر والعناد إلا بُعْدا عن الحق. فبسبب ذنوبهم وإصرارهم على الكفر والطغيان أُغرقوا بالطوفان، وأُدخلوا عقب الإغراق نارًا عظيمة اللهب والإحراق، فلم يجدوا من دون الله مَن ينصرهم، أو يدفع عنهم عذاب الله.","ar.jalalayn":"«وقالوا» للسفلة «لا تَذَرُنَّ آلهتكم ولا تذرن ودا» بفتح الواو وضمها «ولا سواعا ولا يغوث ويعوق ونسرا» هي أسماء أصنامهم.","ar.qurtubi":"قوله تعالى : وقالوا لا تذرن آلهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسراقال ابن عباس وغيره : هي أصنام وصور ، كان قوم نوح يعبدونها ثم عبدتها العرب . وهذا قول الجمهور . وقيل : إنها للعرب لم يعبدها غيرهم . وكانت أكبر أصنامهم وأعظمها عندهم ; فلذلك خصوها بالذكر بعد قوله تعالى : لا تذرن آلهتكم . ويكون معنى الكلام كما قال قوم نوح لأتباعهم : لا تذرن آلهتكم قالت العرب لأولادهم وقومهم : لا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا ; ثم عاد بالذكر بعد ذلك إلى قوم نوح عليه السلام . وعلى القول الأول ، الكلام كله منسوق في قوم نوح . وقال عروة بن الزبير وغيره : اشتكى آدم عليه السلام وعنده بنوه : ود ، وسواع ، ويغوث ، ويعوق ، ونسر . وكان ود أكبرهم وأبرهم به . قال محمد بن كعب : كان لآدم عليه السلام خمس بنين : ود وسواع ويغوث ويعوق ونسر ; وكانوا عبادا فمات واحد منهم فحزنوا عليه ; فقال الشيطان : أنا أصور لكم مثله إذا نظرتم إليه ذكرتموه . قالوا : افعل فصوره في المسجد من صفر ورصاص . ثم مات آخر ، فصوره حتى ماتوا كلهم فصورهم . وتنقصت الأشياء كما تتنقص اليوم إلى أن تركوا عبادة الله تعالى بعد حين . فقال لهم الشيطان : ما لكم لا تعبدون شيئا ؟ قالوا : وما نعبد ؟ قال : آلهتكم وآلهة آبائكم ، ألا ترون في [ ص: 282 ] مصلاكم . فعبدوها من دون الله ; حتى بعث الله نوحا فقالوا : لا تذرن آلهتكم ولا تذرن ودا ولا سواعا الآية . وقال محمد بن كعب أيضا ومحمد بن قيس : بل كانوا قوما صالحين بين آدم ونوح ، وكان لهم تبع يقتدون بهم ، فلما ماتوا زين لهم إبليس أن يصوروا صورهم ليتذكروا بها اجتهادهم ، وليتسلوا بالنظر إليها ; فصورهم . فلما ماتوا هم وجاء آخرون قالوا : ليت شعرنا هذه الصور ما كان آباؤنا يصنعون بها ؟ فجاءهم الشيطان فقال : كان آباؤكم يعبدونها فترحمهم وتسقيهم المطر . فعبدوها فابتدئ عبادة الأوثان من ذلك الوقت .قلت : وبهذا المعنى فسر ما جاء في صحيح مسلم من حديث عائشة أن أم حبيبة وأم سلمة ذكرتا كنيسة رأينها بالحبشة تسمى مارية ، فيها تصاوير ، لرسول الله صلى الله عليه وسلم ; فقال رسول الله صلى الله عليه وسلم : \" إن أولئك إذا كان فيهم الرجل الصالح فمات بنوا على قبره مسجدا وصوروا فيه تلك الصور ، أولئك شرار الخلق عند الله يوم القيامة \" . وذكر الثعلبي عن ابن عباس قال : هذه الأصنام أسماء رجال صالحين من قوم نوح ; فلما هلكوا أوحى الشيطان إلى قومهم أن انصبوا في مجالسهم التي كانوا يجلسون فيها أنصابا وسموها بأسمائهم تذكروهم بها ; ففعلوا ، فلم تعبد حتى إذا هلك أولئك ونسخ العلم عبدت من دون الله . وذكر أيضا عن ابن عباس أن نوحا عليه السلام ، كان يحرس جسد آدم عليه السلام على جبل بالهند ، فيمنع الكافرين أن يطوفوا بقبره ; فقال لهم الشيطان : إن هؤلاء يفخرون عليكم ويزعمون أنهم بنو آدم دونكم ، وإنما هو جسد ، وأنا أصور لكم مثله تطوفون به ; فصور لهم هذه الأصنام الخمسة وحملهم على عبادتها . فلما كان أيام الطوفان دفنها الطين والتراب والماء ; فلم تزل مدفونة حتى أخرجها الشيطان لمشركي العرب . قال الماوردي : فأما ود فهو أول صنم معبود ، سمي ودا لودهم له ; وكان بعد قوم نوح لكلب بدومة الجندل ; في قول ابن عباس وعطاء ومقاتل . وفيه يقول شاعرهم :حياك ود فإنا لا يحل لنا لهو النساء وإن الدين قد عزما[ ص: 283 ] وأما سواع فكان لهذيل بساحل البحر ; في قولهم .وأما يغوث فكان لغطيف من مراد بالجوف من سبأ ; في قول قتادة . وقال المهدوي : لمراد ثم لغطفان . الثعلبي : وأخذت أعلى وأنعم - وهما من طيئ - وأهل جرش من مذحج يغوث فذهبوا به إلى مراد فعبدوه زمانا . ثم إن بني ناجية أرادوا نزعه من أعلى وأنعم ، ففروا به إلى الحصين أخي بني الحارث بن كعب من خزاعة . وقال أبو عثمان النهدي : رأيت يغوث وكان من رصاص ، وكانوا يحملونه على جمل أحرد ، ويسيرون معه ولا يهيجونه حتى يكون هو الذي يبرك ، فإذا برك نزلوا وقالوا : قد رضي لكم المنزل ; فيضربون عليه بناء ينزلون حوله .وأما يعوق فكان لهمدان ببلخع ; في قول عكرمة وقتادة وعطاء ، ذكره الماوردي . وقال الثعلبي : وأما يعوق فكان لكهلان من سبأ ، ثم توارثه بنوه ; الأكبر فالأكبر حتى صار إلى همدان . وفيه يقول مالك بن نمط الهمداني :يريش الله في الدنيا ويبري     ولا يبري يعوق ولا يريشوأما نسر فكان لذي الكلاع من حمير ; في قول قتادة ، ونحوه عن مقاتل . وقال الواقدي : كان ود على صورة رجل ، وسواع على صورة امرأة ، ويغوث على صورة أسد ، ويعوق على صورة فرس ، ونسر على صورة نسر من الطير ; فالله أعلم . وقرأ نافع \" ولا تذرن ودا \" بضم الواو . وفتحها الباقون . قال الليث : ود ( بفتح الواو ) صنم كان لقوم نوح . وود ( بالضم ) صنم لقريش ; وبه سمي عمرو بن ود . وفي الصحاح : والود ( بالفتح ) الوتد في لغة أهل نجد ; كأنهم سكنوا التاء وأدغموها في الدال . والود في قول امرئ القيس :تظهر الود إذا ما أشجذت     وتواريه إذا ما تعتكرقال ابن دريد : هو اسم جبل : وود صنم كان لقوم نوح عليه السلام ثم صار لكلب وكان بدومة الجندل ; ومنه سموه عبد ود . وقال : لا تذرن آلهتكم ثم قال : ولا تذرن ودا ولا سواعا الآية . خصها بالذكر ; لقوله تعالى : وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح .\n","ar.miqbas":"وَقَالُوا لَا تَذَرُنَّ آَلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا (23){ وقالوا لا تَذَرُنَّ آلهتكم ولا تذرنّ وُداً ولا سواعاً } الخ ، أي قال بعضهم لبعض : ودّ ، وسُوّاع ، ويَغُوث ، ويَعُوق ، ونَسْر ، هذه أصنام قوم نوح ، وبهذا تَعْلَم أن أسماءها غيرُ جارية على اشتقاق الكلمات العربية ، وفي واو ( وُدّ ) لغتان للعرب منهم من يضم الواو ، وبه قرأ نافع وأبو جعفر . ومنهم من يفتح الواو وكذلك قرأ الباقون .روى البخاري عن ابن عباس : «ودُّ وسُواع ويغوث ويَعُوق ونَسْرٌ : أسماء رجال صالحين من قوم نوح فلما هلكوا أوحى الشيطان إلى قومهم انصِبوا إلى مجالسهم التي كانوا يجلسون أنصاباً وسَمُّوها بأسمائهم ففعلوا ، فلم تعبد حتى إذا هلك أولئك وتنسخ العلم عُبدت» ، وعن محمد بن كعب : هي أسماء أبناء خمسة لآدم عليه السلام وكانوا عُبّاداً . وعن الماوردي أن { ودّاً } أول صنم معبود .والآية تقتضي أن هذه الأنصاب عُبدت قبل الطوفان وقد قال بعض المفسرين : إن هذه الأصنام أقيمت لبعض الصلحاء من أولاد آدم . وقال بعضهم : كانوا أصناماً بين زمن آدم وزمن نوح .ولا يلتئم هذا مع حدوث الطوفان إذ لا بد أن يكون جرفها وخلص البشرُ من الإِشراك بعد الطوفان ، ومع وجود هذه الأسماء في قبائل العرب إلى زمن البعثة المحمدية ، فقد كان في دومة الجندل بلاد كلب صنم اسمه ( وُدّ ) . قيل كان على صورة رجل وكان من صُفر ورصاص وكان على صورة امرأة ، وكان لهذيل صنم اسمه ( سواع ) وكان لمُراد وغُطيففٍ ( بغين معجمة وطاء مهملة ) بطننٍ من مراد بالجوف عندَ سبأ صنم اسمه { يغوث } ، وكان أيضاً لغطفان وأخذته ( أنعمُ وأعلَى ) وهما من طيء وأهلُ جرش من مذحج فذهبوا به إلى مُراد فعبدوه ، ثم إن بني ناجية راموا نزعه من أعلى وأنعُم ففروا به إلى الحُصين أخي بني الحارث من خزاعة .قال أبو عثمان النهدي : رأيت يَغوث من رَصاص وكانوا يحملونه على جَمَل أحْرَد ( بالحاء المهملة ، أي يخبط بيديه إذا مشى ) ويسيرون معه ولا يهيجونه حتى يكون هو الذي يبرك فإذا برك نزلوا وقالوا : قد رضي لكم المنزل فيضربون عليه بناءً ينزلون حوله .وكان يغوث على صورة أسد .وكان لهْمدان صنم اسمه { يعوق } وهو على صورة فَرَس ، وكان لكهلان من سبأ ثم توارثه بنوه حتى صار إلى همدان .وكان لِحمير ولذي الكلاع منهم صنم اسمه ( نَسْر ) على صورة النسر من الطير . وهذا مروي في «صحيح البخاري» عن ابن عباس . وقال : صارت الأوثان التي كانت في قوم نوح إلى العرب اه . فيجوز أن تكون انتقلت بأعيانها ويجوز أن يكون العرب سموا عليها ووضعوا لها صوراً .ولقد اضطَرَّ هذا بعضَ المفسرين إلى تأويل نظم الآية بأن معاد ضمير { قالوا } إلى مشركي العرب ، وأن ذكر ذلك في أثناء قصة نوح بقصد التنظير ، أي قال العرب بعضهم لبعض : لا تذرنَّ ءالهتكم وُدّاً وسُواعاً ويغوث ويعوق ونسراً كما قال قوم نوح لأتباعهم { لا تَذرُنَّ ءالهتكم ، } ثم عاد بالذكر بعد ذلك إلى قوم نوح ، وهو تكلف بيّن وتفكيك لأجزاء نظم الكلام . فالأحسن ما رآه بعض المفسرين وما نريده بياناً : أن أصنام قوم نوح قد دثرت وغَمرها الطوفان وأن أسماءها بقيت محفوظة عند الذين نجَوا مع نوح من المؤمنين فكانوا يذكرونها ويعظون ناشئتهم بما حلّ بأسلافهم من جراء عبادة تلك الأصنام ، فبقيت تلك الأسماء يتحدث بها العرب الأقدمون في أثارات علمهم وأخبارهم ، فجاء عمرو بن لُحَيّ الخزاعي الذي أعاد للعرب عبادةَ الأصنام فسمى لهم الأصنام بتلك الأسماء وغيرها فلا حاجة بالمفسر إلى التطوح إلى صفات الأصنام التي كانت لها هذه الأسماء عند العرب ولا إلى ذكر تعيين القبائل التي عبدت مسميات هذه الأسماء .ثم يحتمل أن يكون لقوم نوح أصنام كثيرة جمعها قول كبرائهم : { لا تذرُنّ آلهتكم } ، ثم خصوا بالذكر أعظمها وهي هذه الخمسة ، فيكون ذكرها من عطف الخاص على العام للاهتمام به كقوله تعالى : { مَن كان عدواً لله وملائكته ورسله وجبريلَ وميكائيل } [ البقرة : 98 ] . ويحتمل أن لا يكون لهم غير تلك الأصنام الخمسة فيكون ذكرها مفصلة بعد الإِجمال للاهتمام بها ويكون العطف من قبيل عطف المرادف .ولقصد التوكيد أعيد فعل النهي { ولا تذرُن } ولم يسلك طريق الإِبدال ، والتوكيدُ اللفظي قد يقرن بالعاطف كقوله تعالى : { وما أدراك ما يوم الدين ثم ما أدراك ما يوم الدين } [ الانفطار : 17 ، 18 ] .ونقل عن الآلوسي في طرة تفسيره لهذه الآية هذه الفقرة : «قد أخرج الإِفرنج في حدود الألف والمائتين والستين أصناماً وتَمَاثيل من أرض الموصل كانت منذ نحو من ثلاثة آلاف سنة» . وتكرير { لا } النافية في قوله : { ولا سواعاً ولا يغوث } لتأكيد النفي الذي في قوله : { لا تذرُن آلهتكم } وعدم إعادة { لا } مع قوله { ويعوق ونسراً } لأن الاستعمال جارٍ على أن لا يزاد في التأكيد على ثلاث مرات .وقرأ نافع وأبو جعفر { وُدّاً } بضم الواو . وقرأها غيرهما بفتح الواو ، وهو اسم عجمي يَتصرف فيه لسان العرب كيفَ شاؤا .\n","ar.waseet":"وكان من مظاهر مكرهم - أيضا - ما حكاه القرآن بعد ذلك عنهم فى قوله : ( وَقَالُواْ لاَ تَذَرُنَّ آلِهَتَكُمْ وَلاَ تَذَرُنَّ وَدّاً وَلاَ سُوَاعاً وَلاَ يَغُوثَ وَيَعُوقَ وَنَسْراً ) .أى : ومن مظاهر مكر هؤلاء الرؤساء أنهم قالوا لأتباعهم . احذروا أن تتركوا عبادة آلهتكم ، التى وجدتم على عبادتها آباءكم ، واحذروا أيضا أن تتركوا عبادة هذه الأصنام الخمسة بصفة خاصة ، وهى : ود وسواع ويغوث ويعوق ونسرا .قال الإِمام ابن كثير عند تفسيره لهذه الآية ما ملخصه : وهذه أسماء أصنامهم التى كانوا يعبدونها من دون الله . فقد روى البخارى عن ابن عباس : صارت الأوثان التى كانت فى قوم نوح فى العرب بعد ، أما \" ود \" فكانت لقبيلة بنى كلب بدومة الجندل . وأما \" سواع \" فكانت لهذيل ، وأما \" يغوث \" فكانت لبنى غطيف ، وأما \" يعوق \" فكانت لهمدان ، وأما \" نسر \" فكانت لحمير .وهى أسماء رجال صالحين من قوم نوح - عليه السلام - فلما هلكوا أوحى الشيطان إلى قومهم ، أن انصبوا إلى مجالسهم التى كانوا يجلسون عليها أنصابا ، وسموها بأسمائهم ففعلوا .وقال ابن جرير : كانوا قوما صالحين بين آدم ونوح ، وكان لهم أتباع يقتدون بهم ، فلما ماتوا قال أصحابهم الذين كانوا يقتدرون بهم : لو صورناهم كان أشوق لنا إلى العبادة إذا ذكرناهم ، فصوروهم ، فلما ماتوا وجاء آخرون دب إليهم إبليس فقال : إنما كانوا يعبدونهم ، وبهم يسقون المطر . فعبدوهم .\n","ar.baghawi":"( وقالوا ) لهم ( لا تذرن آلهتكم ) أي لا تتركوا عبادتها ( ولا تذرن ودا ) قرأ أهل المدينة بضم الواو والباقون بفتحها ( ولا سواعا ولا يغوث ويعوق ونسرا ) هذه أسماء آلهتهم .قال محمد بن كعب : هذه أسماء قوم صالحين كانوا بين آدم ونوح فلما ماتوا كان لهم أتباع يقتدون بهم ويأخذون بعدهم بأخذهم في العبادة فجاءهم إبليس وقال لهم : لو صورتم صورهم كان أنشط لكم وأشوق إلى العبادة ، ففعلوا ثم نشأ قوم بعدهم فقال لهم إبليس : إن الذين من قبلكم كانوا يعبدونهم فعبدوهم ، فابتداء عبادة الأوثان كان من ذلك .وسميت تلك الصور بهذه الأسماء لأنهم صوروها على صور أولئك القوم من المسلمين .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا إبراهيم بن موسى ، حدثنا هشام عن ابن جريج وقال عطاء عن ابن عباس : صارت الأوثان التي كانت تعبد في قوم نوح [ تعبد ] في العرب [ بعده ] أما ود فكانت لكلب بدومة الجندل ، وأما سواع فكانت لهذيل ، وأما يغوث فكانت لمراد ثم لبني غطيف بالجرف عند سبإ وأما يعوق فكانت لهمدان ، وأما نسر فكانت لحمير لآل ذي الكلاع ذكره في تفسيره .وروى سفيان عن موسى عن محمد بن قيس قوله تعالى : \" ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا \" قال : كانت أسماء رجال صالحين من قوم نوح ، فلما هلكوا أوحى الشيطان إلى قومهم : أن انصبوا فى مجالسهم التي كانوا يجلسون فيها أنصابا وسموها بأسمائهم ، ففعلوا فلم تعبد حتى إذا هلك أولئك ونسخ العلم عبدت .وروي عن ابن عباس : أن تلك الأوثان دفنها الطوفان وطمها التراب ، فلم تزل مدفونة حتى أخرجها الشيطان لمشركي العرب ، وكانت للعرب أصنام أخر فاللات كانت لثقيف ، والعزى لسليم وغطفان وجشم ومناة لقديد ، وإساف ونائلة وهبل لأهل مكة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5442.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5442.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5442.mp3","format":"mp3","local_path":null}}},{"verse":24,"arabic":"وَقَدْ أَضَلُّوا كَثِيرًا ۖ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا","transliteration":"Wa qad adalloo kasee ranw wa laa tazidiz zaalimeena illaa dalaalaa","translations":{"en.ahmedali":"And they misled many. So do not give the evil-doers increase but in error.","en.ahmedraza":"“And they have misled a large number; and (I pray that) You increase nothing for the unjust except error.”","en.arberry":"And they have led many astray. Increase Thou not the evildoers save in error!'","en.asad":"\"And so they have led many a one astray: hence, ordain Thou that these evildoers stray but farther and farther away [from all that they may desire]!\"","en.daryabadi":"And surely they have misled many. And increase Thou these wrong-doers in naught save error.","en.hilali":"\"And indeed they have led many astray. And (O Allah): 'Grant no increase to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) save error.\"","en.pickthall":"And they have led many astray, and Thou increasest the wrong-doers in naught save error.","en.qaribullah":"And they have led many astray. (Noah supplicated saying): 'Allah, do not increase the harmdoers except in error'","en.sahih":"And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\"","en.sarwar":"They have misled many and the unjust will achieve nothing but more error\".","en.yusufali":"\"They have already misled many; and grant Thou no increase to the wrong-doers but in straying (from their mark).\"","en.maududi":"They have misled many. So do not enable these evildoers to increase in anything except straying (from the Right Way).”","en.shakir":"And indeed they have led astray many, and do not increase the unjust in aught but error.","en.itani":"They have misled many, so do not increase the wrongdoers except in confusion.”","en.mubarakpuri":"\"And indeed they have led many astray. And (O Allah): `Grant no increase to the wrongdoers save error.\"'","en.qarai":"and already they have led many astray. Do not increase the wrongdoers in anything but error.’","en.wahiduddin":"They have led many astray; so lead the wrongdoers to further error.\""},"tafsir":{"ar.muyassar":"قال نوح: ربِّ إن قومي بالغوا في عصياني وتكذيبي، واتبع الضعفاء منهم الرؤساء الضالين الذين لم تزدهم أموالهم وأولادهم إلا ضلالا في الدنيا وعقابًا في الآخرة، ومكر رؤساء الضلال بتابعيهم من الضعفاء مكرًا عظيمًا، وقالوا لهم: لا تتركوا عبادة آلهتكم إلى عبادة الله وحده، التي يدعو إليها نوح، ولا تتركوا وَدًّا ولا سُواعًا ولا يغوث ويعوق ونَسْرا - وهذه أسماء أصنامهم التي كانوا يعبدونها من دون الله، وكانت أسماء رجال صالحين، لما ماتوا أوحى الشيطان إلى قومهم أن يقيموا لهم التماثيل والصور؛ لينشطوا- بزعمهم- على الطاعة إذا رأوها، فلما ذهب هؤلاء القوم وطال الأمد، وخَلَفهم غيرهم، وسوس لهم الشيطان بأن أسلافهم كانوا يعبدون التماثيل والصور، ويتوسلون بها، وهذه هي الحكمة من تحريم التماثيل، وتحريم بناء القباب على القبور؛ لأنها تصير مع تطاول الزمن معبودة للجهال. وقد أضلَّ هؤلاء المتبوعون كثيرًا من الناس بما زيَّنوا لهم من طرق الغَواية والضلال. ثم قال نوح -عليه السلام-: ولا تزد- يا ربنا- هؤلاء الظالمين لأنفسهم بالكفر والعناد إلا بُعْدا عن الحق. فبسبب ذنوبهم وإصرارهم على الكفر والطغيان أُغرقوا بالطوفان، وأُدخلوا عقب الإغراق نارًا عظيمة اللهب والإحراق، فلم يجدوا من دون الله مَن ينصرهم، أو يدفع عنهم عذاب الله.","ar.jalalayn":"«وقد أضلوا» بها «كثيرا» من الناس بأن أمروهم بعبادتهم «ولا تزد الظالمين إلا ضلالا» عطفا على قد أضلوا دعا عليهم لما أوحي إليه أنه لن يؤمن من قومك إلا من قد آمن.","ar.qurtubi":"[ ص: 284 ] وقد أضلوا كثيرا هذا من قول نوح ; أي أضل كبراؤهم كثيرا من أتباعهم ; فهو عطف على قوله : ومكروا مكرا كبارا . وقيل : إن الأصنام أضلوا كثيرا أي ضل بسببها كثير ; نظيره قول إبراهيم : رب إنهن أضللن كثيرا من الناس فأجرى عليهم وصف ما يعقل ; لاعتقاد الكفار فيهم ذلك .ولا تزد الظالمين إلا ضلالا أي عذابا ; قاله ابن بحر . واستشهد بقوله تعالى : إن المجرمين في ضلال وسعر . وقيل : إلا خسرانا . وقيل : إلا فتنة بالمال والولد . وهو محتمل .\n","ar.miqbas":"وَقَدْ أَضَلُّوا كَثِيرًا وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا (24)عطف على { وقالوا لا تذرن ءالهتكم } [ نوح : 23 ] ، أي أضلوا بقولهم هذا وبغيره من تقاليد الشرك كثيراً من الأمة بحيث ما آمن مع نوح إلاّ قليل .{ كَثِيراً وَلاَ تَزِدِ الظالمين إِلاَّ } .يجوز أن تكون هذه الجملة تتمة كلام نوح متصلةً بحكاية كلامه السابق ، فتكون الواو عاطفة جزء جملة مقولةٍ لفعل { قال } [ نوح : 21 ] على جزئها الذي قبلها عطف المفاعيل بعضِها على بعض كما تقول قال امرؤ القيس قفا نبْك . ختم نوح شكواه إلى الله بالدعاء على الضالّين المتحدث عنهم بأن يزيدهم الله ضلالاً .ولا يريبك عطف الإِنشاء على الخبر لأن منع عطف الإِنشاء على الخبر على الإِطلاق غير وجيه والقرآن طافح به .ويجوز أن تكون جملة { ولا تزد الظالمين إلاّ ضلالاً } غير متصلة بحكاية كلامه في قوله : { قال نوح رب إنهم عصوني } [ نوح : 21 ] بل هو حكاية كلام آخرَ له صدر في موقف آخر ، فتكون الواو عاطفة جملة مقولة قول على جملة مقولة قول آخر ، أي نائبةٍ عن فعل قال كما تقول : قال امرؤ القيس :قِفَا نَبْكِ ... و :أَلاَ عمْ صباحاً أيها الطلل البالي ... وقد نحا هذا المعنى من يأبون عطف الإِنشاء على الخبر .والمراد ب { الظالمين } : قومه الذين عصوه فكان مقتضى الظاهر التعبير عنهم بالضمير عائداً على { قومي } من قوله : { دعوتُ قومي ليلاً ونهاراً } [ نوح : 5 ] فعدل عن الإِضمار إلى الإِظهار على خلاف مقتضى الظاهر لما يؤذن به وصف { الظالمين } من استحقاقهم الحرمان من عناية الله بهم لظلمهم ، أي إشراكهم بالله ، فالظلم هنا الشرك { إن الشرك لظلم عظيم } [ لقمان : 13 ] .والضلال ، مستعار لعدم الاهتداء إلى طرائق المكر الذي خشي نوح غائلته في قوله : { ومكروا مكراً كُباراً } [ نوح : 22 ] ، أي حُلْ بيننا وبين مكرهم ولا تزدهم إمهالاً في طغيانهم علينا إلاّ أن تضللهم عن وسائله ، فيكون الاستثناء من تأكيد الشيء بما يشبه ضده ، أو أراد إبهام طرق النفع عليهم حتى تنكسر شوكتهم وتلين شكيمتهم نظير قول موسى عليه السلام { ربَّنا اطمِسْ على أموالهم واشْدُد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم } [ يونس : 88 ] .وليس المراد بالضلال الضلال عن طريق الحق والتوحيد لظهور أنه ينافي دعوة نوح قومه إلى الاستغفار والإِيمان بالبعث فكيف يسأل الله أن يزيدهم منه .ويجوز أن يكون الضلال أطلق على العذاب المسبب عن الضلال ، أي في عذاب يوم القيامة وهو عذاب الإِهانة والآلام .ويجوز أن تكون جملةً معترضة وهي من كلام الله تعالى لنوح فتكون الواو اعتراضية ويقدر قول محذوف : وقلنا لا تزد الظالمين . والمعنى : ولا تزد في دعائهم فإن ذلك لا يزيدهم إلاّ ضلالاً ، فالزيادة منه تزيدهم كفراً وعناداً . وبهذا يبقى الضلال مستعملاً في معناه المشهور في اصطلاح القرآن ، فصيغة النهي مستعملة في التأييس من نفع دعوته إياهم . وأعلَمَ الله نوحاً أنه مهلكهم بقوله : { أُغْرقوا فأُدْخلوا ناراً } الآية [ نوح : 25 ] وهذا في معنى قوله : { وأوحي إلى نوح أنه لن يؤمن من قومك إلاّ من قد ءامن فلا تبتئس بما كانوا يفعلون واصنع الفلك بأعيننا ووحينا ولا تخاطبني في الذين ظلموا إنهم مغرقون } [ هود : 36 ، 37 ] .ألا ترى أن ختام كلتا الآيتين متحد المعنى من قوله هنا { أغرقوا وقوله في الآية الأخرى إنهم مغرقون .\n","ar.waseet":"وقوله - تعالى - : ( وَقَدْ أَضَلُّواْ كَثِيراً وَلاَ تَزِدِ الظالمين إِلاَّ ضَلاَلاً ) معمول لقول مقدر ، وهذا القول المقدر معطوف على أقوال نوح السابقة .أى : قال نوح مناجيا ربه بعد أن يئس من إيمان قومه : يا رب ، إن قومى قد عصونى ، وإنهم قد اتبعوا رؤساءهم المغرورين ، وإن هؤلاء الرؤساء قد مكروا بى وبأتباعى مكراً عظيما ، ومن مظاهر مكرهم أنهم حرضوا السفهاء على العكوف على عبادة أصنامهم . . وأنهم قد أضلوا خلقا كثيرا بأن حببوهم فى الكفر وكرهوا إليهم الإِيمان .وقال نوح - أيضا - وأسألك يا رب أن لا تزيد الكافرين إلا ضلالا على ضلالهم ، فأنت الذى أخبرتنى بأنه \" لَن يُؤْمِنَ مِن قَوْمِكَ إِلاَّ مَن قَدْ آمَنَ \" وإذاً فدعاء نوح - عليه السلام - عليهم بالازدياد من الضلال الذى هو ضد الهدى ، وإنما كان بعد أن يئس من إيمانهم ، وبعد أن أخبره ربه أنهم لن يؤمنوا .قال صاحب الكشاف : قوله : ( وَقَدْ أَضَلُّواْ كَثِيراً ) الضمير للرؤساء ، ومعناه : وقد أضلوا كثيرا قبل هؤلاء الذين أمروهم بأن يتمسكوا بعبادة الأصنام . . ويجوز أن يكون الضمير للأصنام ، كقوله - تعالى - ( إِنَّهُنَّ أَضْلَلْنَ كَثِيراً ) الضمير للرؤساء ، ومعناه : وقد أضلوا كثيرا قبل هؤلاء الذين أمروهم بأن يتمسكوا بعبادة الأصنام . . ويجوز أن يكون الضمير للأصنام ، كقوله - تعالى - ( وَلاَ تَزِدِ الظالمين إِلاَّ ضَلاَلاً ) ؟ قلت : على قوله ( رَّبِّ إِنَّهُمْ عَصَوْنِي ) على حكاية كلام نوح . . ومعناه : قال رب إنهم عصون ، وقال : ولا تزد الظالمين إلا ضلالا .فإن قلت : كيف جاز أن يريد لهم الضلال ، ويدعو الله بزيادته؟ قلت : لتصميمهم على الكفر ، ووقوع اليأس من إيمانهم . . ويجوز أن يريد بالضلال : الضياع والهلاك . .\n","ar.baghawi":"( وقد أضلوا كثيرا ) أي : ضل بسبب الأصنام كثير من الناس كقوله - عز وجل - : \" رب إنهن أضللن كثيرا من الناس \" ( إبراهيم - 36 ) وقال مقاتل : أضل كبراؤهم كثيرا من الناس ( ولا تزد الظالمين إلا ضلالا ) هذا دعاء عليهم بعدما أعلم الله نوحا أنهم لا يؤمنون ، وهو قوله : \" أنه لن يؤمن من قومك إلا من قد آمن \" ( هود - 36 ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5443.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5443.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5443.mp3","format":"mp3","local_path":null}}},{"verse":25,"arabic":"مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا","transliteration":"Mimmaa khateee' aatihim ughriqoo fa udkhiloo Naaran falam yajidoo lahum min doonil laahi ansaaraa","translations":{"en.ahmedali":"They were drowned because of their habitual sinfulness, and sent to Hell, and did not find any helper other than God.","en.ahmedraza":"Because of their sins they were drowned and then put into the fire; so they did not find any supporter for themselves against Allah. (Punishment in the grave is proven by this verse.)","en.arberry":"And because of their transgressions they were drowned, and admitted into a Fire, for they found not, apart from God, any to help them.","en.asad":"And so, because of their sins, they were drowned [in the great flood], and were doomed to suffer the fire [of the hereafter]; and they found none who could succour them against God.","en.daryabadi":"And because of their misdeeds they were drowned, and then they were made to enter a Fire. Then they found not for themselves, beside Allah, any helpers.","en.hilali":"Because of their sins they were drowned, then were made to enter the Fire, and they found none to help them instead of Allah.","en.pickthall":"Because of their sins they were drowned, then made to enter a Fire. And they found they had no helpers in place of Allah.","en.qaribullah":"So because of their sins they were drowned and admitted into the Fire. They found none to help them other than Allah.","en.sahih":"Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.","en.sarwar":"Because of their sins, they were drowned and made to enter hell. They could find no one to help them besides God.","en.yusufali":"Because of their sins they were drowned (in the flood), and were made to enter the Fire (of Punishment): and they found- in lieu of Allah- none to help them.","en.maududi":"And so they were drowned on account of their sins, and then cast into the Fire, and did not find any other than Allah, to come forth to their help.","en.shakir":"Because of their wrongs they were drowned, then made to enter fire, so they did not find any helpers besides Allah.","en.itani":"Because of their wrongs, they were drowned, and were hurled into a Fire. They did not find apart from God any helpers.","en.mubarakpuri":"Because of their sins they were drowned, then were made to enter the Fire. And they found none to help them instead of Allah.","en.qarai":"They were drowned because of their iniquities, then made to enter a Fire, and they did not find any helpers for themselves besides Allah.","en.wahiduddin":"They were drowned and sent to Hell for their misdeeds; they found no one to help them against God."},"tafsir":{"ar.muyassar":"قال نوح: ربِّ إن قومي بالغوا في عصياني وتكذيبي، واتبع الضعفاء منهم الرؤساء الضالين الذين لم تزدهم أموالهم وأولادهم إلا ضلالا في الدنيا وعقابًا في الآخرة، ومكر رؤساء الضلال بتابعيهم من الضعفاء مكرًا عظيمًا، وقالوا لهم: لا تتركوا عبادة آلهتكم إلى عبادة الله وحده، التي يدعو إليها نوح، ولا تتركوا وَدًّا ولا سُواعًا ولا يغوث ويعوق ونَسْرا - وهذه أسماء أصنامهم التي كانوا يعبدونها من دون الله، وكانت أسماء رجال صالحين، لما ماتوا أوحى الشيطان إلى قومهم أن يقيموا لهم التماثيل والصور؛ لينشطوا- بزعمهم- على الطاعة إذا رأوها، فلما ذهب هؤلاء القوم وطال الأمد، وخَلَفهم غيرهم، وسوس لهم الشيطان بأن أسلافهم كانوا يعبدون التماثيل والصور، ويتوسلون بها، وهذه هي الحكمة من تحريم التماثيل، وتحريم بناء القباب على القبور؛ لأنها تصير مع تطاول الزمن معبودة للجهال. وقد أضلَّ هؤلاء المتبوعون كثيرًا من الناس بما زيَّنوا لهم من طرق الغَواية والضلال. ثم قال نوح -عليه السلام-: ولا تزد- يا ربنا- هؤلاء الظالمين لأنفسهم بالكفر والعناد إلا بُعْدا عن الحق. فبسبب ذنوبهم وإصرارهم على الكفر والطغيان أُغرقوا بالطوفان، وأُدخلوا عقب الإغراق نارًا عظيمة اللهب والإحراق، فلم يجدوا من دون الله مَن ينصرهم، أو يدفع عنهم عذاب الله.","ar.jalalayn":"«مما» ما صلة «خطاياهم» وفي قراءة خطيئآتهم بالهمز «أُغرقوا» بالطوفان «فأُدْخِلوا نارا» عوقبوا بها عقب الإغراق تحت الماء «فلم يجدوا لهم من دون» أي غير «الله أنصارا» يمنعون عنهم العذاب.","ar.qurtubi":"قوله تعالى : مما خطيئاتهم أغرقوا فأدخلوا نارا فلم يجدوا لهم من دون الله أنصاراقوله تعالى : مما خطيئاتهم أغرقوا \" ما \" صلة مؤكدة ; والمعنى من خطاياهم وقال الفراء : المعنى من أجل خطاياهم ; فأدت ما هذا المعنى . قال : و \" ما \" تدل على المجازاة . وقراءة أبي عمرو \" خطاياهم \" على جمع التكسير ; الواحدة خطية . وكان الأصل في الجمع خطائي على فعائل ; فلما اجتمعت الهمزتان قلبت الثانية ياء ، لأن قبلها كسرة ثم استثقلت والجمع ثقيل ، وهو معتل مع ذلك ; فقلبت الياء ألفا ثم قلبت الهمزة الأولى ياء لخفائها بين الألفين . الباقون \" خطيئاتهم \" على جمع السلامة . قال أبو عمرو : قوم كفروا ألف سنة فلم يكن لهم إلا خطيات ; يريد أن الخطايا أكثر من الخطيات . وقال قوم : خطايا وخطيات واحد ; جمعان مستعملان في الكثرة والقلة ; واستدلوا بقوله تعالى : ما نفدت كلمات الله وقال الشاعر :لنا الجفنات الغر يلمعن بالضحى وأسيافنا يقطرن من نجدة دماوقرئ \" خطيئاتهم \" و \" خطياتهم \" بقلب الهمزة ياء وإدغامها . وعن الجحدري وعمرو بن عبيد والأعمش وأبي حيوة وأشهب العقيلي \" خطيئتهم \" على التوحيد ، والمراد الشرك .فأدخلوا نارا أي بعد إغراقهم . قال القشيري : وهذا يدل على عذاب القبر . ومنكروه يقولون : صاروا مستحقين دخول النار ، أو عرض عليهم أماكنهم من النار ; كما قال [ ص: 285 ] تعالى : النار يعرضون عليها غدوا وعشيا . وقيل : أشاروا إلى ما في الخبر من قوله : ( البحر نار من نار ) . وروى أبو روق عن الضحاك في قوله تعالى : أغرقوا فأدخلوا نارا قال : يعني عذبوا بالنار في الدنيا مع الغرق في الدنيا في حالة واحدة ; كانوا يغرقون في جانب ويحترقون في الماء من جانب . ذكره الثعلبي قال : أنشدنا أبو القاسم الحبيبي قال : أنشدنا أبو سعيد أحمد بن محمد بن رميح قال : أنشدني أبو بكر بن الأنباري :الخلق مجتمع طورا ومفترق     والحادثات فنون ذات أطوارلا تعجبن لأضداد إن اجتمعت     فالله يجمع بين الماء والنارفلم يجدوا لهم من دون الله أنصارا أي من يدفع عنهم العذاب .\n","ar.miqbas":"مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا (25)جملة معترضة بين مقالات نوح عليه السلام وليست من حكاية قول نوح فهي إخبار من الله تعالى لرسوله محمد صلى الله عليه وسلم بأنه قدر النصر لنوح والعقابَ لمن عَصوْه من قومه قبل أن يسأله نوح استئصالهم فإغراق قوم نوح معلوم للنبيء صلى الله عليه وسلم وإنما قصد إعلامه بسببه .والغرض من الاعتراض بها التعجيل بتسلية رسول الله صلى الله عليه وسلم على ما يلاقيه من قومه مما يماثل ما لاقاه نوح من قومه على نحو قوله تعالى : { ولا تحسبن الله غافلاً عما يعمل الظالمون } [ إبراهيم : 42 ] .ويجوز أن تكون متصلة بجملة { ولا تزد الظالمين إلاّ ضلالاً } [ نوح : 24 ] على الوجه الثاني المتقدم فيها من أن تكون من كلام الله تعالى الموجه إلى نوح بتقدير : وقلنا لا تزد الظالمين إلاّ ضلالاً ، وتكون صيغة المضي في قوله : { أغرقوا } مستعملة في تحقق الوَعد لنوح بإغراقهم ، وكذلك قوله : { فأُدخلوا ناراً .وقُدم مما خطيئاتهم } على عامله لإِفادة القصر ، أي أغرقوا فأدخلوا ناراً من أجل مجموع خطيئاتهم لا لمجرد استجابة دعوة نوح التي ستذكر عقب هذا ليعلم أن الله لا يُقر عباده على الشرك بعد أن يرسل إليهم رسولاً وإنما تأخر عذابهم إلى ما بعدَ دعوة نوح لإِظهار كرامته عند ربه بين قومه ومسرة له وللمؤمنين معه وتعجيلاً لما يجوز تأخيره .و ( مِن ) تعليلية ، و ( ما ) مؤكدة لمعنى التعليل .وجمع الخطيئات مراد بها الإشراك ، وتكذيب الرسول ، وأذاه ، وأذى المؤمنين معه ، والسخرية منه حين توعدهم بالطوفان ، وما ينطوي عليه ذلك كله من الجرائم والفواحش .وقرأ الجمهور { خطيئاتهم } بصيغة جمع خطيئة بالهمز . وقرأه أبو عمرو وحده { خطاياهم } جمع خَطيَّة بالياء المشددة مدغمة فيها الياء المنقلبة عن همزةٍ للتخفيف .وفي قوله : { أغرقوا فأدخلوا ناراً } محسن الطباق لأن بين النار والغرق المشعر بالماء تضاداً .وتفريع { فلم يجدوا لهم من دون الله أنصاراً } تعريض بالمشركين من العرب الذين كانوا يزعمون أن الأصنام تشفع لهم وتدفع عنهم الكوارث يعني في الدنيا لأنهم لا يؤمنون بالبعث ، أي كما لم تَنصر الأصنام عبدتها من قوم نوح كذلك لا تنصركم أصنامكم .وضمير { يجدوا } عائد إلى { الظالمين } من قوله : { ولا تزد الظالمين إلاّ ضلالاً } [ نوح : 24 ] وكذلك ضمير { لهم } .والمعنى : فلم يجدوا لأنفسهم أنصاراً دون عذاب الله .\n","ar.waseet":"وقوله - سبحانه - : ( مِّمَّا خطيائاتهم أُغْرِقُواْ فَأُدْخِلُواْ نَاراً فَلَمْ يَجِدُواْ لَهُمْ مِّن دُونِ الله أَنصَاراً ) كلام معترض بين ضراعات نوح إلى ربه ، والمقصود به التعجيل ببيان سوء عاقبتهم ، والتسلية للرسول صلى الله عليه وسلم عما أصابه من قومه .و \" من \" فى قوله ( مِّمَّا خطيائاتهم ) للتعليل ، و \" ما \" مزيدة لتأكيد هذا التعليل .والخطيئات جمع خطيئة ، والمراد بها هنا : الإِشراك به - تعالى - وتكذيب نوح - عليه السلام - والسخرية منه ومن المؤمنين .أى : بسبب خطيئاتهم الشنيعة ، وليس بسبب آخر ( أُغْرِقُواْ فَأُدْخِلُواْ نَاراً ) يصلون سعيرها فى قبورهم إلى يوم الدين ، ولعذاب الآخرة أشد وأبقى .وهم عندما نزل بهم الطوفان الذى أهلكهم ، وعندما ينزل بهم عذاب الله فى الآخرة . لن يجدوا أحدا ينصرهم ويدفع عنهم عذابه - تعالى - لامن الأصنام التى تواصوا فيما بينهم بالعكوف على عبادتها ، ولا من غير هذه الأصنام .فالآية الكريمة تعريض بمشركى قريش ، الذين يزعمون أن أصنامهم ستشفع لهم يوم القيامة ، والذين حكى القرآن عنهم قولهم : ( مَا نَعْبُدُهُمْ إِلاَّ لِيُقَرِّبُونَآ إِلَى الله زلفى ) والتعبير بالفاء فى قوله : ( أُغْرِقُواْ فَأُدْخِلُواْ نَاراً فَلَمْ يَجِدُواْ لَهُمْ مِّن دُونِ الله أَنصَاراً ) للإشعار بأن دخولهم النار كان فى أعقاب غرقهم بدون مهلة ، وبأن صراخهم وعويلهم كان بعد نزول العذاب بهم مباشرة ، إلا أنهم لم يجدوا أحدا ، يدفع عنهم شيئا من هذا العذاب الأليم .\n","ar.baghawi":"( مما خطيئاتهم ) أي : من خطيئاتهم و \" ما \" صلة ، وقرأ أبو عمرو : \" خطاياهم \" وكلاهما جمع خطيئة ( أغرقوا ) بالطوفان ( فأدخلوا نارا ) قال الضحاك : هي في حالة واحدة في الدنيا يغرقون من جانب ويحترقون من جانب ، وقال مقاتل : فأدخلوا نارا في الآخرة ( فلم يجدوا لهم من دون الله أنصارا ) لم يجدوا أحدا يمنعهم من عذاب الله .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5444.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5444.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5444.mp3","format":"mp3","local_path":null}}},{"verse":26,"arabic":"وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا","transliteration":"Wa qaala Noohur Rabbi laa tazar 'alal ardi minal kaafireena daiyaaraa","translations":{"en.ahmedali":"Noah said: \"O Lord, do not leave a single habitation of unbelievers on the earth.","en.ahmedraza":"And prayed Nooh, “O my Lord! Do not leave any of the disbelievers dwelling in the land.”","en.arberry":"And Noah said, 'My Lord, leave not upon the earth of the unbelievers even one.","en.asad":"And Noah prayed: \"O my Sustainer! Leave not on earth any of those who deny the truth:","en.daryabadi":"And Nuh said: my Lord! leave not upon the earth of the infidels one inhabitant.","en.hilali":"And Nuh (Noah) said: \"My Lord! Leave not one of the disbelievers on the earth!","en.pickthall":"And Noah said: My Lord! Leave not one of the disbelievers in the land.","en.qaribullah":"And Noah (supplicated) saying: 'My Lord, do not leave a single unbeliever upon the earth.","en.sahih":"And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant.","en.sarwar":"Noah said, \"Lord, do not leave a single disbeliever on earth;","en.yusufali":"And Noah, said: \"O my Lord! Leave not of the Unbelievers, a single one on earth!","en.maududi":"Noah said: “My Lord, do not leave out of these unbelievers even a single dweller on earth,","en.shakir":"And Nuh said: My Lord! leave not upon the land any dweller from among the unbelievers:","en.itani":"Noah said, “My Lord, do not leave of the unbelievers a single dweller on earth.","en.mubarakpuri":"And Nuh said: \"My Lord! Leave not one of the disbelievers on the earth Dayyar!\"","en.qarai":"And Noah said, ‘My Lord! ‘Do not leave on the earth any inhabitant from among the faithless.","en.wahiduddin":"Noah prayed, \"O my Lord! Do not leave on earth a single one of those who deny the truth --"},"tafsir":{"ar.muyassar":"وقال نوح -عليه السلام- بعد يأسه من قومه: ربِّ لا تترك من الكافرين بك أحدًا حيًّا على الأرض يدور ويتحرك. إنك إن تتركهم دون إهلاك يُضلوا عبادك الذين قد آمنوا بك عن طريق الحق، ولا يأت من أصلابهم وأرحامهم إلا مائل عن الحق شديد الكفر بك والعصيان لك. ربِّ اغفر لي ولوالديَّ ولمن دخل بيتي مؤمنًا، وللمؤمنين والمؤمنات بك، ولا تزد الكافرين إلا هلاكًا وخسرانًا في الدنيا والآخرة.","ar.jalalayn":"«وقال نوح رب لا تذر على الأرض من الكافرين ديَّارا» أي نازل دار، والمعنى أحدا.","ar.qurtubi":"قوله تعالى : وقال نوح رب لا تذر على الأرض من الكافرين ديارافيه  مسائل :الأولى : دعا عليهم حين يئس من اتباعهم إياه . وقال قتادة : دعا عليهم بعد أن أوحى الله إليه : أنه لن يؤمن من قومك إلا من قد آمن فأجاب الله دعوته وأغرق أمته ; وهذا كقول النبي صلى الله عليه وسلم : \" اللهم منزل الكتاب ، سريع الحساب ، وهازم الأحزاب ، اهزمهم وزلزلهم \" . وقيل : سبب دعائه أن رجلا من قومه حمل ولدا صغيرا على كتفه فمر بنوح فقال : ( احذر هذا فإنه يضلك ) . فقال : يا أبت أنزلني ; فأنزله فرماه فشجه ; فحينئذ غضب ودعا عليهم . وقال محمد بن كعب ومقاتل والربيع وعطية وابن زيد : إنما قال هذا حينما أخرج الله كل مؤمن من [ ص: 286 ] أصلابهم وأرحام نسائهم . وأعقم أرحام النساء وأصلاب الرجال قبل العذاب بسبعين سنة . وقيل : بأربعين . قال قتادة : ولم يكن فيهم صبي وقت العذاب . وقال الحسن وأبو العالية : لو أهلك الله أطفالهم معهم كان عذابا من الله لهم وعدلا فيهم ; ولكن الله أهلك أطفالهم وذريتهم بغير عذاب ، ثم أهلكهم بالعذاب ; بدليل قوله تعالى : وقوم نوح لما كذبوا الرسل أغرقناهم .الثانية : قال ابن العربي : \" دعا نوح على الكافرين أجمعين ، ودعا النبي صلى الله عليه وسلم على من تحزب على المؤمنين وألب عليهم . وكان هذا أصلا في الدعاء على الكافرين في الجملة ، فأما كافر معين لم تعلم خاتمته فلا يدعى عليه ; لأن مآله عندنا مجهول ، وربما كان عند الله معلوم الخاتمة بالسعادة . وإنما خص النبي صلى الله عليه وسلم بالدعاء عتبة وشيبة وأصحابهما ; لعلمه بمآلهم وما كشف له من الغطاء عن حالهم . والله أعلم \" .قلت : قد مضت هذه المسألة مجودة في سورة \" البقرة \" والحمد لله .الثالثة : قال ابن العربي : \" إن قيل لم جعل نوح دعوته على قومه سببا لتوقفه عن طلب الشفاعة للخلق من الله في الآخرة ؟ قلنا : قال الناس في ذلك وجهان : أحدهما أن تلك الدعوة نشأت عن غضب وقسوة ; والشفاعة تكون عن رضا ورقة ، فخاف أن يعاتب ويقال : دعوت على الكفار بالأمس وتشفع لهم اليوم . الثاني أنه دعا غضبا بغير نص ولا إذن صريح في ذلك ; فخاف الدرك فيه يوم القيامة ; كما قال موسى عليه السلام : ( إني قتلت نفسا لم أومر بقتلها ) . قال : وبهذا أقول والله أعلم \" .قلت : وإن كان لم يؤمر بالدعاء نصا فقد قيل له : أنه لن يؤمن من قومك إلا من قد آمن . فأعلم عواقبهم فدعا عليهم بالهلاك ; كما دعا نبينا صلى الله عليه وسلم على شيبة وعتبة ونظرائهم فقال : \" اللهم عليك بهم \" لما أعلم عواقبهم ; وعلى هذا يكون فيه معنى الأمر بالدعاء . والله أعلم .الرابعة : قوله تعالى : ديارا إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا [ ص: 287 ] أي من يسكن الديار ; قاله السدي . وأصله ديوار على فيعال من دار يدور ; فقلبت الواو ياء وأدغمت إحداهما في الأخرى . مثل القيام ; أصله قيوام . ولو كان فعالا لكان دوارا . وقال القتبي : أصله من الدار ; أي نازل بالدار . يقال : ما بالدار ديار ; أي أحد . وقيل : الديار صاحب الدار .\n","ar.miqbas":"وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا (26) عطف على { قال نوح رب إنهم عصوني } [ نوح : 21 ] أعقبه بالدعاء عليهم بالإِهلاك والاستئصال بأن لا يبقى منهم أحداً ، أي لا تبق منهم أحداً على الأرض .وأعيد فعل { قال } لوقوع الفصل بين أقوال نوح بجملة { مما خطيئاتهم } [ نوح : 25 ] الخ ، أو بها وبجملة { ولا تزد الظالمين إلاّ ضلالاً } [ نوح : 24 ] .وقرنت بواو العطف لتكون مستقلة فلا تتبع جملة { إنهم عصوني للإِشارة إلى أن دَعوة نوح حصلت بعد شكايته بقوله : إنهم عصوني .وديَّاراً } : اسم مخصوص بالوقوع في النفي يعمّ كل إنسان ، وهو اسم بوزن فَيْعَال مشتق من اسم الدار فعينه واو لأن عين دَار مقدرة واواً ، فأصل ديّار : دَيوار فلما اجتمعت الواو والياء واتصلتا وسبقت إحداهما بالسكون قلبت الواو ياء ثم أدغمت في الياء الزائدة كما فُعل بسيّد وميّت ، ومعنى ديّار : من يحلّ بدار القوم كناية عن إنسان .ونظير ( ديّار ) في العموم والوقوع في النفي أسماء كثيرة في كلام العرب أبلغها ابن السكيت في «إصلاح المنطق» إلى خمسةٍ وعشرين ، وزاد كُراع النمل سبعة فبلغت اثنين وثلاثين اسماً ، وزاد ابن مالك في «التسهيل» ستة فصارت ثمانية وثلاثين .ومن أشهرها : آحَد ، ودَيَّار ، وعَريب ، وكلها بمعنى الإِنسان ، ولفظ ( بُدَّ ) بضم الموحدة وتشديد الدال المهملة وهو المفارقة .\n","ar.waseet":"ثم واصلت السورة الكريمة حكاية ما ناجى نوح به ربه ، فقالت : ( وَقَالَ نُوحٌ رَّبِّ لاَ تَذَرْ عَلَى الأرض مِنَ الكافرين دَيَّاراً ) .أى : وقال نوح متابعا حديثه مع ربه ، ومناجاته له : يا رب ، لا تترك على الأرض من هؤلاء الكافرين ( دَيَّاراً ) مأخوذ من الدار ، أو الدوران ، وهو التحرك ، والمقصود : لا تذر منهم أحد أصلا ، بل اقطع دابرهم جميعا .قالوا : والديار من الأسماء التى لا تستعمل إلا فى النفى العام . يقال : ما بالدارديار .أى : ليس بها أحد ألبتة ، وهو اسم بزنة فَيْعَال .\n","ar.baghawi":"\"وقال نوح رب لا تذر على الأرض من الكافرين دياراً\"، أحداً يدور في الأرض فيذهب ويجيء أصله من الدوران، وقال ابن قتيبة: إن أصله من الدار، أي: نازل دار.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5445.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5445.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5445.mp3","format":"mp3","local_path":null}}},{"verse":27,"arabic":"إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا","transliteration":"Innaka in tazarhum yudil loo 'ibaadaka wa laa yalidooo illaa faajiran kaffaaraa","translations":{"en.ahmedali":"If you leave them, they will lead Your creatures astray, and beget but iniquitous and ungrateful offspring.","en.ahmedraza":"“Indeed, if You spare them, they will mislead your bondmen – and their descendants, if any, will be none except the wicked, very ungrateful.”","en.arberry":"Surely, if Thou leavest them, they will lead Thy servants astray, and will beget none but unbelieving libertines.","en.asad":"for, behold, If Thou dost leave them, they will [always try to] lead astray those who worship Thee, and will give birth to nothing but wickedness and stubborn ingratitude.","en.daryabadi":"Verily if Thou shouldst leave them, they Will mislead Thine bondmen and will beget not save sinning infidels,","en.hilali":"\"If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers.\"","en.pickthall":"If Thou shouldst leave them, they will mislead Thy slaves and will beget none save lewd ingrates.","en.qaribullah":"Surely, if You leave them they will mislead Your worshipers and father none but the immoral, and unbelievers.","en.sahih":"Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.","en.sarwar":"if You do, they will mislead Your servants and will only give birth to ungrateful sinners.","en.yusufali":"\"For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones.","en.maududi":"for certainly if You should leave them (alive), they will mislead Your servants, and will beget none but sinners and utter unbelievers.","en.shakir":"For surely if Thou leave them they will lead astray Thy servants, and will not beget any but immoral, ungrateful (children)","en.itani":"If You leave them, they will mislead your servants, and will breed only wicked unbelievers.","en.mubarakpuri":"\"If You leave them, they will mislead Your servants, and they will beget none but wicked disbelievers.\"","en.qarai":"If You leave them, they will lead astray Your servants, and will beget none except vicious ingrates.","en.wahiduddin":"if You leave any, they will misguide Your servants, and they will beget none but sinners and deniers of truth --"},"tafsir":{"ar.muyassar":"وقال نوح -عليه السلام- بعد يأسه من قومه: ربِّ لا تترك من الكافرين بك أحدًا حيًّا على الأرض يدور ويتحرك. إنك إن تتركهم دون إهلاك يُضلوا عبادك الذين قد آمنوا بك عن طريق الحق، ولا يأت من أصلابهم وأرحامهم إلا مائل عن الحق شديد الكفر بك والعصيان لك. ربِّ اغفر لي ولوالديَّ ولمن دخل بيتي مؤمنًا، وللمؤمنين والمؤمنات بك، ولا تزد الكافرين إلا هلاكًا وخسرانًا في الدنيا والآخرة.","ar.jalalayn":"«إنك إن تذرهم يُضلوا عبادك ولا يلدوا إلا فاجرا كفارا» من يفجر ويكفر، قال ذلك لما تقدم من الإيحاء إليه.","ar.qurtubi":"لا يوجد تفسير لهذه الأية\n","ar.miqbas":"إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا (27)وجملة { إنك إن تذرهم يُضِلُّوا عبادك } تعليل لسؤاله أن لا يترك الله على الأرض أحداً من الكافرين يريد أنه خشي أن يضلوا بعض المؤمنين وأن يلدوا أبناء ينشأون على كفرهم .والأرض يجوز أن يراد بها جميع الكُرة الدنيوية ، وأن يراد أرض معهودة للمتكلم والمخاطَببِ كما في قوله تعالى : { قال اجعلني على خزائن الأرض يعني أرض مصر } في سورة يوسف ( 55 ) .ويحتمل أن يكون البشر يومئذٍ منحصرين في قوم نوح ، ويجوز خلافه ، وعلى هذه الاحتمالات ينشأ احتمال أن يكون الطوفان قد غمر جميع الكرة الأرضية ، واحتمالُ أن يكون طوفاناً قاصراً على ناحية كبيرة من عموم الأرض ، والله أعلم . وقد تقدم ذلك عند تفسير قوله تعالى : { فأنجيناه والذين معه في الفلك } في سورة الأعراف ( 64 ) .وخبر إنك } مجموع الشرط مع جوابه الواقع بعد ( إنّ ) لأنه إذا اجتمع مبتدأ وشرط رجح الشرط على المبتدأ فأعطي الشرطُ الجوابَ ولم يعط المبتدأ خبراً لدلالة جملة الشرط وجوابه عليه .وعَلِم نوح أنهم لا يلدون إلاّ فاجراً كفّاراً بأن أولادهم ينشأون فيهم فيلقنونهم دينهم ويصدون نوحاً عن أن يرشدهم فحصل له علم بهذه القضية بدليل التجربة .والمعنى : ولا يلدوا إلاّ من يصير فاجراً كفَّاراً عند بلوغه سن العقل .والفاجر : المتصف بالفجور ، وهو العمل الشديد الفساد .والكَفَّار : مبالغة في الموصوف بالكفر ، أي إلاّ من يجمع بين سوء الفعل وسوء الاعتقاد ، قال تعالى : { أولئك هم الكفرة الفجرة } [ عبس : 42 ] .وفي كلام نوح دلالة على أن المصلحين يهتمون بإصلاح جيلهم الحاضر ولا يهملون تأسيس أسس إصلاح الأجيال الآتية إذ الأجيال كلها سواء في نظرهم الإِصلاحي . وقد انتزع عمر بن الخطاب من قوله تعالى : { والذين جاءوا من بعدهم } [ الحشر : 10 ] دليلاً على إبقاء أرض سواد العراق غير مقسومة بين الجيش الذي فَتَح العراق وجعلها خراجاً لأهلها قصداً لدوام الرزق منها لمن سيجيء من المسلمين .\n","ar.waseet":"وقوله ( إِنَّكَ إِن تَذَرْهُمْ يُضِلُّواْ عِبَادَكَ ) تعليل لدعائه عليهم جميعا بالهلاك . أى : يا رب لا تترك منهم أحدا سالما ، بل أهلكهم جميعا لأنك إن تترك منهم أحدا على أرضك بدون إهلاك ، فإن هؤلاء المتروكين من دأبهم - كما رأيت منهم زمانا طويلا - إضلال عبادك عن طريق الحق .وقوله : ( وَلاَ يلدوا إِلاَّ فَاجِراً كَفَّاراً ) زيادة فى ذمهم وفى التشنيع عليهم .والفاجر : هو المتصف بالفجور ، والملازم له ملازمة شديدة ، والفجور : هو الفعل البالغ للنهاية فى الفساد والقبح .والكفار : هو المبالغ فى الكفر ، والجحود لنعم الله - تعالى - .أى : إنك يا إلهى إن تتركهم بدون إهلاك ، يضلوا عبادك عن كل خير ، وهم فوق ذلك ، لن يلدوا إلا من هو مثلهم فى الفجور والكفران لأنهم قد نشَّأوا أولادهم على كراهية الحق ، وعلى محبة الباطل .قال الجمل : فإن قيل : كيف علم نوح أن أولادهم يكفرون؟ أجيب : بأنه لبث فيهم ألف سنة إلأ خمسين عاماً ، فعرف طباعهم وأحوالهم ، وكان الرجل منهم ينطلق إليه بابنه ويقول له : احذر هذا - أى نوحا - فإنه كذاب ، وإن أبى حذرنى منه ، فيموت الكبير ، وينشأ الصغير على ذلك .وعلى أية حال فالذى نعتقده أن نوحا - عليه السلام - ما دعا عليهم بهذا الدعاء ، وما قال فى شأنهم هذا القول - وهو واحد من أولى العزم من الرسل - إلا بعد أن يئس من إيمانهم ، وإلا بعد أن أخبره ربه : أنه لن يؤمن من قومك إلا من قد آمن ، وإلا بعد أن رأى منهم - بعد ألف سنة إلا خمسين عاما عاشها معها -أنهم قوم قد استحبوا العمى على الهدى ، وأن الأبناء منهم يسيرون على طريقة الآباء فى الكفر والفجور ..\n","ar.baghawi":"( إنك إن تذرهم يضلوا عبادك ) قال ابن عباس ، والكلبي ومقاتل : كان الرجل ينطلق بابنه إلى نوح فيقول : احذر هذا فإنه كذاب ، وإن أبي حذرنيه فيموت الكبير وينشأ الصغير عليه ( ولا يلدوا إلا فاجرا كفارا ) قال محمد بن كعب ، ومقاتل ، والربيع ، وغيرهم : إنما قال نوح هذا حين أخرج الله كل مؤمن من أصلابهم وأرحام نسائهم وأعقم أرحام نسائهم وأيبس أصلاب رجالهم قبل العذاب بأربعين سنة . [ وقيل سبعين سنة ] وأخبر الله نوحا أنهم لا يؤمنون ولا يلدون مؤمنا فحينئذ دعا عليهم نوح فأجاب الله دعاءه ، وأهلكهم كلهم ولم يكن فيهم صبي وقت العذاب لأن الله تعالى قال : \" وقوم نوح لما كذبوا الرسل أغرقناهم \" ( الفرقان - 37 ) ولم يوجد التكذيب من الأطفال .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5446.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5446.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5446.mp3","format":"mp3","local_path":null}}},{"verse":28,"arabic":"رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا","transliteration":"Rabbigh fir lee wa liwaa lidaiya wa liman dakhala baitiya mu'minanw wa lil mu'mineena wal mu'minaati wa laa tazidiz zaalimeena illaa tabaaraa","translations":{"en.ahmedali":"O Lord, forgive me, my parents, and any one who enters my house as a believer, and all believing men and women, and do not give the evil-doers increase save in ruin.","en.ahmedraza":"“O my Lord! Forgive me, and my parents, and the believers who are in my house, and all other Muslim men and Muslim women; and do not increase anything for the unjust except ruin.”","en.arberry":"My Lord, forgive me and my parents and whosoever enters my house as a believer, and the believers, men and women alike; and do Thou not increase the evildoers save in ruin!'","en.asad":"\"O my Sustainer! Grant Thy forgiveness unto me and unto my parents, and unto everyone who enters my house as a believer, and unto all believing men and believing women [of later times]; and grant Thou that the doers of evil shall increasingly meet with destruction!\"'","en.daryabadi":"My Lord! forgive me and my parents and him who entereth my house as a believer, and believing men and believing women, and increase not the wrong-doers in aught save ruin!","en.hilali":"\"My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) grant You no increase but destruction!\"","en.pickthall":"My Lord! Forgive me and my parents and him who entereth my house believing, and believing men and believing women, and increase not the wrong-doers in aught save ruin.","en.qaribullah":"Forgive me, My Lord, and my parents, and whosoever seeks refuge in my house as a believer, and the believers men and women alike, and do not increase the harmdoers except in ruin'","en.sahih":"My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\"","en.sarwar":"Lord, forgive me, my parents, the believers who have entered my home and all believing men and women. Give nothing to the unjust but destruction.","en.yusufali":"\"O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition!\"","en.maududi":"My Lord, forgive me and my parents, and whoever enters my house as a believer, and forgive all believers, both men and women, and do not increase the wrong-doers in anything except perdition.”","en.shakir":"My Lord! forgive me and my parents and him who enters my house believing, and the believing men and the believing women; and do not increase the unjust in aught but destruction!","en.itani":"My Lord! Forgive me and my parents, and anyone who enters my home in faith, and all the believing men and believing women; and do not increase the wrongdoers except in perdition.”","en.mubarakpuri":"\"My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the wrongdoers grant You no increase but destruction!\") Allah says,","en.qarai":"My Lord! Forgive me and my parents, and whoever enters my house in faith, and the faithful men and women, and do not increase the wrongdoers in anything but ruin.’","en.wahiduddin":"Lord! Forgive me and my parents and every true believer who enters my house, forgive all the believing men and believing women; and bestow no increase upon the wrongdoers except in ruin?"},"tafsir":{"ar.muyassar":"وقال نوح -عليه السلام- بعد يأسه من قومه: ربِّ لا تترك من الكافرين بك أحدًا حيًّا على الأرض يدور ويتحرك. إنك إن تتركهم دون إهلاك يُضلوا عبادك الذين قد آمنوا بك عن طريق الحق، ولا يأت من أصلابهم وأرحامهم إلا مائل عن الحق شديد الكفر بك والعصيان لك. ربِّ اغفر لي ولوالديَّ ولمن دخل بيتي مؤمنًا، وللمؤمنين والمؤمنات بك، ولا تزد الكافرين إلا هلاكًا وخسرانًا في الدنيا والآخرة.","ar.jalalayn":"«رب اغفر لي ولوالديَّ» وكانا مؤمنين «ولمن دخل بيتي» منزلي أو مسجدي «مؤمنا وللمؤمنين والمؤمنات» إلى يوم القيامة «ولا تزد الظالمين إلا تبارا» هلاكا فأهلكوا.","ar.qurtubi":"قوله تعالى : رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات ولا تزد الظالمين إلا تباراقوله تعالى : رب اغفر لي ولوالدي دعا لنفسه ولوالديه وكانا مؤمنين . وهما : لمك بن متوشلخ وشمخى بنت أنوش ; ذكره القشيري والثعلبي . وحكى الماوردي في اسم أمه منجل . وقال سعيد بن جبير : أراد بوالديه أباه وجده . وقرأ سعيد بن جبير \" لوالدي \" بكسر الدال على الواحد . قال الكلبي : كان بينه وبين آدم عشرة آباء كلهم مؤمنون . وقال ابن عباس : لم يكفر لنوح والد فيما بينه وبين آدم عليهما السلام .ولمن دخل بيتي مؤمنا أي مسجدي ومصلاي مصليا مصدقا بالله . وكان إنما يدخل بيوت الأنبياء من آمن منهم فجعل المسجد سببا للدعاء بالغفرة . وقد قال النبي صلى الله عليه وسلم : \" الملائكة تصلي على أحدكم ما دام في مجلسه الذي صلى فيه ما لم يحدث فيه تقول : اللهم اغفر له ، اللهم ارحمه . \" الحديث . وقد تقدم . وهذا قول ابن عباس . بيتي مسجدي ; حكاه الثعلبي وقاله الضحاك . وعن ابن عباس أيضا : أي ولمن دخل ديني ; فالبيت بمعنى الدين ; حكاه القشيري وقاله جويبر . وعن ابن عباس أيضا : يعني صديقي الداخل إلى منزلي ; حكاه الماوردي . وقيل : أراد داري . وقيل سفينتي .وللمؤمنين والمؤمنات عامة إلى يوم القيامة ; قاله الضحاك . وقال الكلبي : من أمة محمد صلى الله عليه وسلم . وقيل : من قومه ; والأول أظهر .ولا تزد الظالمين أي الكافرين .إلا تبارا إلا هلاكا ; فهي عامة في كل كافر ومشرك . وقيل : أراد مشركي قومه . والتبار : الهلاك . وقيل : الخسران ; حكاهما السدي . ومنه قوله تعالى : إن هؤلاء متبر ما هم فيه . وقيل : التبار الدمار ; والمعنى واحد . والله أعلم بذلك . وهو الموفق للصواب .\n","ar.miqbas":"رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا (28)جعل الدعاء لنفسه ووالديه خاتمة مناجاته فابتدأ بنفسه ثم بأقرب الناس به وهما والده ، ثم عمّم أهله وذويه المؤمنين فدخل أولاده وبنوهم والمؤمنات من أزواجهم وعبر عنهم بمن دخل بيته كناية عن سكناهم معه ، فالمراد بقوله { دخل بيتي } دخول مخصوص وهو الدخول المتكرر الملازم . ومنه سميت بطانة المرء دَخيلته ودُخْلَته ، ثم عمم المؤمنين والمؤمنات ، ثم عاد بالدعاء على الكفرة بأن يحرمهم الله النجاح وهو على حد قوله المتقدم { ولا تزد الظالمين إلاّ ضلالاً } [ نوح : 24 ] .والتبَار : الهلاك والخسار ، فهو تخصيص للظالمين من قومه بسؤال استئصالهم بعد أن شملهم وغيرهم بعموم قوله : { لا تَذر على الأرض من الكافرين ديّاراً } [ نوح : 26 ] حرصاً على سلامة المجتمع الإِنساني من شوائب المفاسد وتطهيره من العناصر الخبيثة .ووالداه : أبوه وأمه ، وقد ورد اسم أبيه في التوراة ( لَمَك ) وأما أمه فقد ذكر الثعلبي أنّ اسمها شَمْخَى بنتُ آنُوش .وقرأ الجمهور { بيتي } بسكون ياء المتكلم . وقرأه حفص عن عاصم بتحريكها .واستثناء { إلاّ تباراً } منقطع لأن التبار ليس من الزيادة المدعو بنفيها فإنه أراد لا تزدهم من الأموال والأولاد لأن في زيادة ذلك لهم قوةً لهم على أذى المؤمنين . وهذا كقول موسى عليه السلام : { ربنا إنك ءاتيت فرعون وملأَه زينة وأموالاً في الحياة الدنيا ربنا ليضلوا عن سبيلك } [ يونس : 88 ] الآية . وهذا من تأكيد الشيء بما يشبه ضده كقوله : { فلم يزدهم دعائي إلاّ فراراً } [ نوح : 6 ] .\n","ar.waseet":"وإلى جانب دعاء نوح - عليه السلام - على الكافرين بالهلاك الساحق . . نراه يختتتم دعاءه بالمغفرة والرحمة للمؤمنين ، فيقول : ( رَّبِّ اغفر لِي وَلِوَالِدَيَّ ) .أى : يا رب أسألك أن تغفر لى ذنوبى ، وأن تغفر لوالدى - أيضا - ذنوبهما ، ويفهم من هذا الدعاء أنهما كانا مؤمنين ، وإلا لما دعا لهما بهذا الدعاء .( وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِناً ) واغفر يا إلهى لكل من دخل بيتى وهو متصف بصفة الإِيمان ، فيخرج بذلك من دخله وهو كافر كامرأته وابنه الذى غرق مع المغرقين .( وَلِلْمُؤْمِنِينَ والمؤمنات ) أى : واغفر يا رب ذنوب المؤمنين والمؤمنات بك إلى يوم القيامة .( وَلاَ تَزِدِ الظالمين إِلاَّ تَبَاراً ) أى : ولا تزد الظالمين إلا هلاكا وخسارا ودمارا . يقال تبره يتبره ، إذا أهلكه . ويتعدى بالتضعيف فيقال : تبره الله تتبيرا ، ومنه قوله - تعالى - : ( إِنَّ هؤلاء مُتَبَّرٌ مَّا هُمْ فِيهِ ) وهكذا اختتمت السورة الكريمة بهذا الدعاء الذى فيه طلب المغفرة للمؤمنين ، والهلاك للكافرين .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"( رب اغفر لي ولوالدي ) واسم أبيه : لمك بن متوشلخ ، واسم أمه : سمحاء بنت أنوش ، وكانا مؤمنين [ وقيل اسمها هيجل بنت لاموش بن متوشلخ فكانت بنت عمه ] ( ولمن دخل بيتي ) داري ( مؤمنا ) وقال الضحاك والكلبي : مسجدي . وقيل : سفينتي ( وللمؤمنين والمؤمنات ) هذا عام في كل من آمن بالله وصدق الرسل ( ولا تزد الظالمين إلا تبارا ) هلاكا ودمارا فاستجاب الله دعاءه فأهلكهم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5447.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5447.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5447.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":234,"letters":1806,"size":"186KB","priority":3,"commonlyRead":false}}