{"chapter":73,"name":{"arabic":"سورة 73","transliteration":"Chapter 73","translation":"Chapter 73","revelation":"unknown"},"revelation":"unknown","verses":20,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا الْمُزَّمِّلُ","transliteration":"Yaw ayyuhal muzzammil","translations":{"en.ahmedali":"O YOU ENWRAPPED in the cloak (of Prophethood),","en.ahmedraza":"O the One Wrapped in piety! (Prophet Mohammed – peace and blessings be upon him)","en.arberry":"O thou enwrapped in thy robes,","en.asad":"O THOU enwrapped one!","en.daryabadi":"O thou enwrapped!","en.hilali":"O you wrapped in garments (i.e. Prophet Muhammad SAW)!","en.pickthall":"O thou wrapped up in thy raiment!","en.qaribullah":"O you (Prophet Muhammad) wrapped,","en.sahih":"O you who wraps himself [in clothing],","en.sarwar":"You, who have wrapped yourself up with a mantle,","en.yusufali":"O thou folded in garments!","en.maududi":"O you the (sleeping) enwrapped one!","en.shakir":"O you who have wrapped up in your garments!","en.itani":"O you Enwrapped one.","en.mubarakpuri":"O you wrapped up!","en.qarai":"O you wrapped up in your mantle!","en.wahiduddin":"O you who are wrapped up in your mantle,"},"tafsir":{"ar.muyassar":"يا أيها المتغطي بثيابه، قم للصلاة في الليل إلا يسيرًا منه. قم نصف الليل أو انقص من النصف قليلا حتى تَصِلَ إلى الثلث، أو زد على النصف حتى تصل إلى الثلثين، واقرأ القرآن بتُؤَدَة وتمهُّلٍ مبيِّنًا الحروف والوقوف.","ar.jalalayn":"«يا أيها المزمل» النبي وأصله المتزمل أُدغمت التاء في الزاي، أي المتلفف بثيابه حين مجيء الوحي له خوفا من لهيبته.","ar.qurtubi":"سورة المزملوهي سبع وعشرون آية . مكية كلها في قول الحسن وعكرمة وعطاء وجابر .وقال ابن عباس وقتادة : إلا آيتين منها : واصبر على ما يقولون والتي تليها ; ذكره الماوردي . وقال الثعلبي : قوله تعالى : إن ربك يعلم أنك تقوم أدنى إلى آخر السورة ; فإنه نزل بالمدينة .بسم الله الرحمن الرحيميا أيها المزملفيه مسائل :الأولى : قوله تعالى : يا أيها المزمل قال الأخفش سعيد : المزمل أصله المتزمل ; فأدغمت التاء في الزاي وكذلك المدثر . وقرأ أبي بن كعب على الأصل ( المتزمل ) و ( المتدثر ) . وسعيد : المزمل . وفي أصل المزمل قولان : أحدهما : أنه المحتمل ; يقال : زمل الشيء إذا حمله ، ومنه الزاملة ; لأنها تحمل القماش . الثاني : أن المزمل هو المتلفف ; يقال : تزمل وتدثر بثوبه إذا تغطى . وزمل غيره إذا غطاه ، وكل شيء لفف فقد زمل ودثر ; قال امرؤ القيس :[ كأن أبانا في أفانين ودقه ] كبير أناس في بجاد مزملالثانية : قوله تعالى : يا أيها المزمل هذا خطاب للنبي - صلى الله عليه وسلم - ، وفيه ثلاثة أقوال :الأول : [ ص: 31 ] قول عكرمة : يا أيها المزمل بالنبوة والملتزم للرسالة . وعنه أيضا : يا أيها الذي زمل هذا الأمر أي حمله ثم فتر ، وكان يقرأ : يا أيها المزمل بتخفيف الزاي وفتح الميم وتشديدها على حذف المفعول ، وكذلك المدثر والمعنى المزمل نفسه والمدثر نفسه ، أو الذي زمله غيره .الثاني : يا أيها المزمل بالقرآن ، قاله ابن عباس .الثالث المزمل بثيابه ، قال قتادة وغيره . قال النخعي : كان متزملا بقطيفة . عائشة : بمرط طوله أربعة عشر ذراعا ، نصفه علي وأنا نائمة ، ونصفه على النبي - صلى الله عليه وسلم - وهو يصلي ، والله ما كان خزا ولا قزا ولا مرعزاء ولا إبريسما ولا صوفا ، كان سداه شعرا ، ولحمته وبرا ، ذكره الثعلبي .قلت : وهذا القول من عائشة يدل على أن السورة مدنية ; فإن النبي - صلى الله عليه وسلم - لم يبن بها إلا في المدينة . وما ذكر من أنها مكية لا يصح . والله أعلم .وقال الضحاك : تزمل بثيابه لمنامه . وقيل : بلغه من المشركين سوء قول فيه ، فاشتد عليه فتزمل في ثيابه وتدثر ، فنزلت : يا أيها المزمل و يا أيها المدثر .وقيل : كان هذا في ابتداء ما أوحي إليه ، فإنه لما سمع قول الملك ونظر إليه أخذته الرعدة فأتى أهله فقال : \" زملوني دثروني \" روي معناه عن ابن عباس . وقالت الحكماء : إنما خاطبه بالمزمل والمدثر في أول الأمر ; لأنه لم يكن بعد ادثر شيئا من تبليغ الرسالة .قال ابن العربي : واختلف في تأويل : يا أيها المزمل فمنهم من حمله على حقيقته ، قيل له : يا من تلفف في ثيابه أو في قطيفته قم ; قاله إبراهيم وقتادة . ومنهم من حمله على المجاز ، كأنه قيل له : يا من تزمل بالنبوة ; قاله عكرمة . وإنما يسوغ هذا التفسير لو كانت الميم مفتوحة مشددة بصيغة المفعول الذي لم يسم فاعله ، وأما وهو بلفظ الفاعل فهو باطل .قلت : وقد بينا أنها على حذف المفعول : وقد قرئ بها ، فهي صحيحة المعنى . قال : وأما من قال إنه زمل القرآن فهو صحيح في المجاز ، لكنه قد قدمنا أنه لا يحتاج إليه .الثالثة : قال السهيلي : ليس المزمل باسم من أسماء النبي - صلى الله عليه وسلم - ، ولم يعرف به كما ذهب إليه بعض الناس وعدوه في أسمائه - عليه السلام - ، وإنما المزمل اسم مشتق من حالته التي كان عليها حين الخطاب ، وكذلك المدثر .وفي خطابه بهذا الاسم فائدتان :إحداهما الملاطفة ; [ ص: 32 ] فإن العرب إذا قصدت ملاطفة المخاطب وترك المعاتبة سموه باسم مشتق من حالته التي هو عليها ; كقول النبي - صلى الله عليه وسلم - لعلي حين غاضب فاطمة - رضي الله عنهما - ، فأتاه وهو نائم وقد لصق بجنبه التراب فقال له : \" قم يا أبا تراب \" إشعارا له أنه غير عاتب عليه ، وملاطفة له . وكذلك قوله - عليه السلام - لحذيفة : \" قم يا نومان \" وكان نائما ملاطفة له ، وإشعارا لترك العتب والتأنيب . فقول الله تعالى لمحمد - صلى الله عليه وسلم - : يا أيها المزمل قم فيه تأنيس وملاطفة ; ليستشعر أنه غير عاتب عليه .والفائدة الثانية : التنبيه لكل متزمل راقد ليله ليتنبه إلى قيام الليل وذكر الله تعالى فيه ; لأن الاسم المشتق من الفعل يشترك فيه مع المخاطب كل من عمل ذلك العمل واتصف بتلك الصفة .\n","ar.miqbas":"يَا أَيُّهَا الْمُزَّمِّلُ (1) افتتاح الكلام بالنداء إذا كان المخاطب واحداً ولم يكن بعيداً يدل على الاعتناء بما سيلقى إلى المخاطب من كلام .والأصل في النداء أن يكون باسم المنادَى العلم إذا كان معروفاً عند المتكلم فلا يعدل من الاسم العلم إلى غيره من وصف أو إضافة إلاّ لغرض يقصده البلغاء من تعظيم وتكريم نحو { يا أيها النبي } [ الأنفال : 65 ] ، أو تلطف وتقرب نحو : يا بُنيِّ ويا أبتتِ ، أو قصد تهكم نحو : { وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون } [ الحجر : 6 ] فإذا نودي المنادى بوصف هيئته من لِبسة أو جِلسة أو ضِجعة كان المقصود في الغالب التلطف به والتحبب إليه ولهيئته ، ومنه قول النبي صلى الله عليه وسلم لعلي بن أبي طالب وقد وجده مضطجعاً في المسجد وقد علق تراب المسجد بجنبه «قُم أَبا تراب» وقوله لحذيفة بن اليمان يوم الخندق «قم يا نَوْمانُ» ، وقولِه لعَبْد الرحمان بن صخر الدوسي وقد رءاه حاملاً هِرّة صَغيرةً في كمه «يا أبا هُريرة» .فنداء النبي ب { يا أيها المزمل } نداء تلطف وارتفاق ومثله قوله تعالى : { يا أيها المدثر } [ المدثر : 1 ] .و { المزمل } : اسم فاعل من تزمل ، إذا تلفف بثوبه كالمقرور ، أو مريد النوم وهو مثل التدثر في مآل المعنى وإن كان بينهما اختلاف في أصل الاشتقاق فالتزمل مشتق من معنى التلفف ، والتدثُر مشتق من معنى اتخاذ الدثار للتدفؤ . وأصل التزمل مشتق من الزَّمْل بفتح فسكون وهو الإِخفاء ولا يعرف ل ( تزمَّل ) فعل مجرد في معناه فهو من التفعل الذي تنوسي منه معنى التكلف للفعل ، وأريد في إطلاقه معنى شدة التلبس ، وكثر مثل هذا في الاشتمال على اللباس ، فمنه التزمل ومنه التعَمّم والتأزّر والتقمّص ، وربما صَاغوا له صيغة الافتعال مثل : ارتَدى وائتزر .وأصل { المزمل } : المتزمل ، أدغمت التاء في الزاي بعد قلبها زاياً لتقاربهما .وهذا التزمل الذي أشارت إليه الآية قال الزهري وجمهور المفسرين : إنه التزمل الذي جرى في قول النبي صلى الله عليه وسلم «زَمِّلُوني زَمِّلُوني» حين نزل من غار حراء بعد أن نزل عليه { اقرأ باسم ربك } [ العلق : 1 ] الآيات كما في حديث عروة عن عائشة في كتاب بدء الوحي من «صحيح البخاري» وإن لم يذكر في ذلك الحديث نزول هذه السورة حينئذٍ ، وعليه فهو حقيقة .وقيل : هو ما في حديث جابر بن عبد الله قال : «لما اجتمعت قريش في دار الندوة فقالوا : سَمُّوا هذا الرجل اسماً تصدر الناس عنه ( أي صِفوه وصفاً تتفق عليه الناس ) فقالوا : كاهن ، وقالوا : مجنون ، وقالوا : ساحر ، فصدر المشركون على وصفه ب ( ساحر ) فبلغ ذلك النبي صلى الله عليه وسلم فحزن وتزمل في ثيابه وتدثر ، فأتاه جبريل فقال : { يا أيها المزمل } { يا أيها المدثر } [ المدثر : 1 ] .وسيأتي في سورة المدثر أن سبب نزولها رؤيتُه المَلكَ جالساً على كرسي بين السماء والأرض فرجع إلى خديجة يرجف فؤاده فقال : «دثروني» ، فيتعين أن سبب ندائه ب { يا أيها المزمل } كان عند قوله : «زَمِّلِوني» ، فذلك عندما اغتمّ من وصف المشركين إياه بالجنون وأن ذلك غير سبب ندائه ب { يا أيها المدثر في سورة المدثر .\n","ar.waseet":"وقد ذكرالمفسرون عند تفسيرهم لهذه السورة الكريمة روايات منها ما رواه البزار والطبرانى فى الأوسط ، وأبو نعيم فى الدلائل عن جابر - رضى الله عنه - قال : اجتمعت قريش فى دار الندوة فقالوا : سموا هذا الرجل اسما تصدوا الناس عنه فقالوا : كاهن . قالوا : ليس بكاهن . قالوا : مجنون . قالوا : ليس بمجنون . قالوا : ساحر . قالوا : ليس بساحر . . فتفرق المشركون على ذلك . فبلغ ذلك النبى صلى الله عليه وسلم فتزمل فى ثيابه وتدثر فيها ، فأتاه جبريل فقرأ عليه : ( ياأيها المزمل ) ( ياأيها المدثر . . . ) وقيل : إنه صلى الله عليه وسلم كان نائما بالليل متزملا فى قطيفة . . فجاءه جبريل بقوله - تعالى - ( ياأيها المزمل . قُمِ الليل إِلاَّ قَلِيلاً . . ) .وقيل : إن سبب نزول هذه الآيات ما رواه الشيخان وغيرهما من حديث جابر بن عبد الله أن رسول الله صلى الله عليه وسلم قال : \" جاورت بحراء ، فلما قضيت جوارى ، هبطت ، فنوديت فنظرت عن يمينى فلم أر شيئا ، ونظرت عن شمالى فلم أر شيئا . . فرفعت رأسى فإذا الذى جاءنى بحراء ، جالس على كرسى بين السماء والأرض . . فرجعت فقلت : دثرونى دثرونى \" ، وفى رواية : \" فجئت أهلى فقلت : زملونى زملونى ، فأنزل الله - تعالى - : ( ياأيها المدثر . . . ) \" .وجمهور العلماء يقولون : وعلى أثرها نزلت : ( ياأيها المزمل . . . ) .و ( المزمل ) : اسم فاعل من تزمل فلان بثيابه ، إذا تلفف فيها ، وأصله المتزمل ، فأدغمت التاء فى الزاى والميم .وافتتح الكلام بالنداء للتنبيه على أهمية ما يلقى على المخاطب من أوامر أو نواه .وفى ندائه صلى الله عليه وسلم بلفظ \" المزمل \" تلطف معه ، وإيناس لنفسه ، وتحبب إليه ، حتى يزداد نشاطا ، وهو يبلغ رسالة ربه .والمعنى : يأيها المزمل بثيابه ، المتلفف فيه ، رهبة مما رآه من عبدنا جبريل . او هما وغما مما سمعه من المشركين ، من وصفهم له بصفات هو برئ منها .\n","ar.baghawi":"مكية( يا أيها المزمل ) أي الملتفف بثوبه . وأصله : المتزمل أدغمت التاء في الزاي ومثله المدثر ، أي : المتدثر أدغمت التاء في الدال ، يقال : تزمل وتدثر بثوبه إذا تغطى به .وقال السدي : أراد يا أيها النائم قم فصل .قال [ العلماء ] كان هذا الخطاب للنبي - صلى الله عليه وسلم - في أول الوحي قبل تبليغ الرسالة ، ثم خوطب بعد بالنبي والرسول .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5476.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5476.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5476.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"قُمِ اللَّيْلَ إِلَّا قَلِيلًا","transliteration":"Qumil laila illaa qaleelaa","translations":{"en.ahmedali":"Keep watch all the night except some,","en.ahmedraza":"Stand up for worship during the night, except for some part of it.","en.arberry":"keep vigil the night, except a little","en.asad":"Keep awake [in prayer] at night, all but a small part","en.daryabadi":"Stay up the night long save a little -","en.hilali":"Stand (to pray) all night, except a little.","en.pickthall":"Keep vigil the night long, save a little -","en.qaribullah":"rise (to pray) the night except a little;","en.sahih":"Arise [to pray] the night, except for a little -","en.sarwar":"worship (God) for a few hours at night.","en.yusufali":"Stand (to prayer) by night, but not all night,-","en.maududi":"Stand up in Prayer by night, all but a small part of it;","en.shakir":"Rise to pray in the night except a little,","en.itani":"Stay up during the night, except a little.","en.mubarakpuri":"Stand (to pray) all night, except a little.","en.qarai":"Stand vigil through the night, except for a little [of it],","en.wahiduddin":"stand up to pray for much of the night."},"tafsir":{"ar.muyassar":"يا أيها المتغطي بثيابه، قم للصلاة في الليل إلا يسيرًا منه. قم نصف الليل أو انقص من النصف قليلا حتى تَصِلَ إلى الثلث، أو زد على النصف حتى تصل إلى الثلثين، واقرأ القرآن بتُؤَدَة وتمهُّلٍ مبيِّنًا الحروف والوقوف.","ar.jalalayn":"«قم الليل» صل «إلا قليلا».","ar.qurtubi":"قوله تعالى : قم الليل قراءة العامة بكسر الميم لالتقاء الساكنين . وقرأ أبو السمال بضم الميم إتباعا لضمة القاف . وحكى الفتح لخفته . قال عثمان بن جني : الغرض بهذه الحركة التبليغ بها هربا من التقاء الساكنين ، فبأي حركة تحركت فقد وقع الغرض . وهو من الأفعال القاصرة غير المتعدية إلى مفعول ، فأما ظرف الزمان والمكان فسائغ فيه ، إلا أن ظرف المكان لا يتعدى إليه إلا بواسطة ; لا تقول : قمت الدار حتى تقول قمت وسط الدار وخارج الدار . وقد قيل : إن ( قم ) هنا معناه صل ; عبر به عنه واستعير له حتى صار عرفا بكثرة الاستعمال .( الليل ) حد الليل : من غروب الشمس إلى طلوع الفجر . وقد تقدم بيانه في سورة ( البقرة ) واختلف : هل كان قيامه فرضا وحتما ، أو كان ندبا وحضا ؟ والدلائل تقوي أن قيامه كان حتما وفرضا ; وذلك أن الندب والحض لا يقع على بعض الليل دون بعض ; لأن قيامه ليس مخصوصا به وقت دون وقت . وأيضا فقد جاء التوقيت بذلك عن عائشة وغيرها على ما يأتي . واختلف أيضا : هل كان فرضا على النبي - صلى الله عليه وسلم - وحده ، أو عليه وعلى من كان قبله من الأنبياء ، أو عليه وعلى أمته ؟ ثلاثة أقوال :الأول : قول سعيد بن جبير لتوجه الخطاب إليه خاصة .الثاني : قول ابن عباس ، قال : كان قيام الليل فريضة على النبي - صلى الله عليه وسلم - وعلى الأنبياء قبله .الثالث : قول عائشة وابن عباس أيضا وهو الصحيح ; كما في صحيح مسلم عن زرارة بن أوفى أن سعد بن هشام بن عامر أراد أن يغزو في سبيل الله . . . الحديث ، وفيه : فقلت [ ص: 33 ] لعائشة : أنبئيني عن قيام رسول الله - صلى الله عليه وسلم - ؟ فقالت : ألست تقرأ : يا أيها المزمل قلت : بلى ! قالت فإن الله - عز وجل - افترض قيام الليل في أول هذه السورة ، فقام - صلى الله عليه وسلم - وأصحابه حولا ، وأمسك الله - عز وجل - خاتمتها اثني عشر شهرا في السماء ، حتى أنزل الله - عز وجل - في آخر هذه السورة التخفيف ، فصار قيام الليل تطوعا بعد فريضة . وذكر الحديث .وذكر وكيع ويعلى قالا : حدثنا مسعر عن سماك الحنفي قال : سمعت ابن عباس يقول لما أنزل أول يا أيها المزمل كانوا يقومون نحوا من قيامهم في شهر رمضان حتى نزل آخرها ، وكان بين أولها وآخرها نحو من سنة .وقال سعيد بن جبير : مكث النبي - صلى الله عليه وسلم - وأصحابه عشر سنين يقومون الليل ، فنزل بعد عشر سنين : إن ربك يعلم أنك تقوم أدنى من ثلثي الليل فخفف الله عنهم .قوله تعالى : إلا قليلا استثناء من الليل ، أي صل الليل كله إلا يسيرا منه ; لأن قيام جميعه على الدوام غير ممكن ، فاستثنى منه القليل لراحة الجسد . والقليل من الشيء ما دون النصف ; فحكي عن وهب بن منبه أنه قال : القليل ما دون المعشار والسدس . وقال الكلبي ومقاتل : الثلث .\n","ar.miqbas":"قُمِ اللَّيْلَ إِلَّا قَلِيلًا (2) وقيل : هو تزمُّل للاستعداد للصلاة فنودي يا أيها المزمل قم اللّيل إلاّ قليلاً } وهذا مروي عن قتادة . وقريب منه عن الضحاك وهي أقوال متقاربة .ومحملها على أن التزمُّل حقيقة ، وقال عكرمة : معناه زُمِّلْتَ هذا الأمر فقم به ، يريد أمر النبوءة فيكون قوله : { الليل إلاّ قليلاً } مع قوله : { إن لك في النهار سبحاً طويلاً } [ المزمل : 7 ] تحريضاً على استفراغ جهده في القيام بأمر التبليغ في جميع الأزمان من ليل ونهار إلاّ قليلاً من الليل وهو ما يضطر إليه من الهجوع فيه . ومحمل التزمل عنده على المجاز .فإذا كانت سورة المزمل قد أنزلت قبل سورة المدثر كان ذلك دالاً على أن الله تعالى بعد أن ابتدأ رسوله بالوحي بصدر سورة { اقرأ باسم ربك } [ العلق : 1 ] ثم أنزل عليه سورة القلم لدحض مقالة المشركين فيه التي دبرها الوليد بن المغيرة أن يقولوا : إنه مجنون .أنزل عليه التلطف به على تزمله بثيابه لما اعتراه من الحزن من قول المشركين فأمره الله بأن يدفع ذلك عنه بقيام الليل ، ثم فتر الوحي فلما رأى المَلَكَ الذي أرسل إليه بحِراء تدثر من شدة وقع تلك الرؤية فأنزل عليه { يا أيها المدثر .فنداء النبي بوصف المزمل } باعتبار حالته وقت ندائه وَليس المزمل معدوداً من أسماء النبي صلى الله عليه وسلم قال السهيلي : ولم يعرف به وذهب بعض الناس إلى عدّه من أسمائه .وفعل { قم } مُنزل منزلة اللازم فلا يحتاج إلى تقدير متعلق لأن القيام مراد به الصلاة ، فهذا قيام مغاير للقيام المأمور به في سورة المدثر بقوله { قم فأنذر } [ المدثر : 2 ] فإن ذلك بمعنى الشروع كما يأتي هنالك .و { الليل } : زمن الظلمة من بعد العشاء إلى الفجر . وانتصب { الليل } على الظرفية فاقتضى الأمر بالصلاة في جميع وقت الليل ، ويعلم استثناء أوقات قضاء الضرورات من إغفاء بالنوم ونحوه من ضرورات الإِنسان .وقيام الليل لقب في اصطلاح القرآن والسنة للصلاة فيه ما عدا صلاتي المغرب والعشاء ورواتبهما .وأمْر الرسول بقيام الليل أمْر إيجاب وهو خاص به لأن الخطاب موجه إليه وحده مثل السور التي سبقت نزولَ هذه السورة ، وأما قيام الليل للمسلمين فهم اقتدوا فيه بالرسول صلى الله عليه وسلم كما سيأتي في قوله تعالى : { إن ربك يعلم أنك تقوم إلى قوله : وطائفة من الذين معك } [ المزمل : 20 ] الآيات قال الجمهور وذلك قبل أن تفرض الصلوات الخمس في أوقات النهار والليل ولعل حكمة هذا القيام الذي فرض على الرسول صلى الله عليه وسلم في صدر رسالته هو أن تزداد به سريرته زكاء يقوي استعداده لتلقي الوحي حتى لا يحرجه الوحي كما ضغطه عند نزوله كما ورد في حديث البخاري :\" فغطني حتى بلغ مني الجَهد \" ثم قال : { اقرأ باسم ربّك } [ العلق : 1 ] الحديث ، ويدل لهذه الحكمة قوله تعالى عقبه : { إنا سنلقي عليك قولاً ثقيلاً } [ المزمل : 5 ] .وقد كان النبي صلى الله عليه وسلم يتحنث في غار حراء قبيل بعثته بإلهام من الله تعالى ، فالذي ألهمه ذلك قبل أن يوحي إليه يجدر بأن يأمره به بعد أن أوحى إليه فلا يبقى فترة من الزمن غير متعبد لعبادة ، ولهذا نرجح أن قيام الليل فرض عليه قبل فرض الصلوات الخمس عليه وعلى الأمة .وقد استمر وجوب قيام الليل على رسول الله صلى الله عليه وسلم بعد فرض الصلوات الخمس تعظيماً لشأنه بكثرة الإِقبال على مناجاة ربه في وقت فراغه من تبليغ الوحي وتدبير شؤون المسلمين وهو وقت الليل كما يدل عليه قوله تعالى : { ومن الليل فتهجّد به نافلة لك عسى أن يبعثك ربك مقاماً محموداً ، أي زيادة قرب لك } وقد تقدم في سورة [ الإسراء : 79 ] . فكان هذا حكماً خاصاً بالنبي صلى الله عليه وسلم وقد ذكره الفقهاء في باب خصائص النبي صلى الله عليه وسلم ولم يكن واجباً على غيره ولم تفرض على المسلمين صلاة قبل الصلوات الخمس . وإنما كان المسلمون يقتدون بفعل النبي صلى الله عليه وسلم وهو يقرّهم على ذلك فكانوا يرونه لِزاماً عليهم ، وقد أثنى الله عليهم بذلك في آيات كثيرة كقوله تعالى : { تتجافى جنوبُهم عن المضاجع } [ السجدة : 16 ] ، وسيأتي ذلك عند قوله تعالى : { إن ربك يعلم أنك تقوم أدنى من ثلثي الليل } [ المزمل : 20 ] الآية ، قالت عائشة : «إن الله افترض قيام الليل في أول هذه السورة فقام النبي وأصحابه» ، على أنه لا خلاف في رفع فرض القيام عن المسلمين . وتقرر أنه مندوب فيه . واختلف في استمرار وجوبه على النبي صلى الله عليه وسلم ولا طائل وراء الاستدلال على ذلك أو عدمه .\n","ar.waseet":"( قُمِ الليل إِلاَّ قَلِيلاً ) أى : قم الليل متعبدا لربك ، ( إِلاَّ قَلِيلاً ) منه ، على قدر ما تأخذ من راحة لبدنك ، فقوله : ( إِلاَّ قَلِيلاً ) بدل كل من كل ، على سبيل التفصيل بعد الإِجمال . .أى : قم نصف الليل للعبادة لربك ، واجعل النصف الثانى من الليل لراحتك ونومك . .ووصف - سبحانه - هذا النصف الكائن للراحة بالقلة فقال ( إِلاَّ قَلِيلاً ) للإِشعار بأن النصف الآخر ، العامر بالعبادة والصلاة . . هو النصف الأكثر ثوابا وقربا من الله - تعالى - بالنسبة للنصف الثانى المتخذ للراحة والنوم .\n","ar.baghawi":"\"قم الليل\"، أي للصلاة، \"إلا قليلاً\"، وكان قيام الليل فريضة في الابتداء.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5477.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5477.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5477.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلًا","transliteration":"Nisfahooo awinqus minhu qaleelaa","translations":{"en.ahmedali":"A half of it or a little less","en.ahmedraza":"For half the night, or reduce some from it.","en.arberry":"(a half of it, or diminish a little,","en.asad":"of one-half thereof - or make it a little less than that,","en.daryabadi":"A half thereof, or abate a little thereof,","en.hilali":"Half of it, or a little less than that,","en.pickthall":"A half thereof, or abate a little thereof","en.qaribullah":"half the night, or a little less","en.sahih":"Half of it - or subtract from it a little","en.sarwar":"(Worship Him) for more or less than half of the night","en.yusufali":"Half of it,- or a little less,","en.maududi":"half of it, or reduce it a little;","en.shakir":"Half of it, or lessen it a little,","en.itani":"For half of it, or reduce it a little.","en.mubarakpuri":"Half of it or less than that, a little.","en.qarai":"a half, or reduce a little from that","en.wahiduddin":"It may be half the night or a little less than that"},"tafsir":{"ar.muyassar":"يا أيها المتغطي بثيابه، قم للصلاة في الليل إلا يسيرًا منه. قم نصف الليل أو انقص من النصف قليلا حتى تَصِلَ إلى الثلث، أو زد على النصف حتى تصل إلى الثلثين، واقرأ القرآن بتُؤَدَة وتمهُّلٍ مبيِّنًا الحروف والوقوف.","ar.jalalayn":"«نصفه» بدل من قليلا وقلَّته بالنظر إلى الكل «أو انقص منه» من النصف «قليلا» إلى الثلث.","ar.qurtubi":"ثم قال تعالى : نصفه أو انقص منه قليلا فكان ذلك تخفيفا إذ لم يكن زمان القيام محدودا ، فقام الناس حتى ورمت أقدامهم ، ثم نسخ ذلك بقوله تعالى : علم أن لن تحصوه .وقال الأخفش : ( نصفه ) أي أو نصفه ; يقال : أعطه درهما درهمين ثلاثة : يريد : أو درهمين أو ثلاثة .وقال الزجاج : نصفه بدل من الليل و ( إلا قليلا ) استثناء من النصف . والضمير في ( منه ) و ( عليه ) للنصف . المعنى : قم نصف الليل أو انقص من النصف قليلا إلى الثلث أو زد عليه قليلا إلى الثلثين ; فكأنه قال : قم ثلثي الليل أو نصفه أو ثلثه .وقيل : إن نصفه بدل من قوله : قليلا وكان مخيرا بين ثلاث : بين قيام النصف بتمامه ، وبين الناقص منه ، وبين قيام الزائد عليه ; كأن تقدير الكلام : قم الليل إلا نصفه ، أو أقل من نصفه ، أو أكثر من نصفه .وفي صحيح مسلم عن أبي هريرة عن رسول الله - صلى الله عليه وسلم - قال : ينزل الله - عز وجل - إلى سماء الدنيا كل ليلة حين يمضي ثلث الليل الأول ، فيقول أنا الملك أنا الملك من ذا الذي يدعوني فأستجيب له من ذا الذي يسألني فأعطيه من ذا الذي يستغفرني فأغفر له ، فلا يزال كذلك حتى يضيء الفجر . ونحوه عن أبي هريرة وأبي سعيد جميعا وهو يدل على [ ص: 34 ] ترغيب قيام ثلثي الليل .وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا مضى شطر الليل - أو ثلثاه - ينزل الله . . . \" الحديث . رواه من طريقين عن أبي هريرة هكذا على الشك .وقد جاء في كتاب النسائي عن أبي هريرة وأبي سعيد - رضي الله عنهما - قالا : قال رسول الله - صلى الله عليه وسلم - : إن الله - عز وجل - يمهل حتى يمضي شطر الليل الأول ، ثم يأمر مناديا يقول : هل من داع يستجاب له ؟ هل من مستغفر يغفر له ؟ هل من سائل يعطى ؟ صححه أبو محمد عبد الحق ; فبين هذا الحديث مع صحته معنى النزول ، وأن ذلك يكون عند نصف الليل . وخرج ابن ماجه من حديث ابن شهاب ، عن أبي سلمة وأبي عبد الله الأغر ، عن أبي هريرة : أن رسول الله - صلى الله عليه وسلم - قال : ينزل ربنا تبارك وتعالى حين يبقى ثلث الليل الآخر كل ليلة فيقول من يسألني فأعطيه ؟ من يدعوني فأستجيب له ؟ من يستغفرني فأغفر له ؟ حتى يطلع الفجر . فكانوا يستحبون صلاة آخر الليل على أوله .قال علماؤنا : وبهذا الترتيب انتظم الحديث والقرآن ، فإنهما يبصران من مشكاة واحدة . وفي الموطأ وغيره من حديث ابن عباس : بت عند خالتي ميمونة حتى إذا انتصف الليل أو قبله بقليل أو بعده بقليل ، استيقظ رسول الله - صلى الله عليه وسلم - ، فقام إلى شن معلق فتوضأ وضوءا خفيفا . وذكر الحديث .اختلف العلماء في الناسخ للأمر بقيام الليل ; فعن ابن عباس وعائشة أن الناسخ للأمر بقيام الليل قوله تعالى : إن ربك يعلم أنك تقوم أدنى من ثلثي الليل إلى آخر السورة . وقيل قوله تعالى : علم أن لن تحصوه .وعن ابن عباس أيضا : هو منسوخ بقوله تعالى : علم أن سيكون منكم مرضى .وعن عائشة أيضا والشافعي ومقاتل وابن كيسان : هو منسوخ بالصلوات الخمس .وقيل الناسخ لذلك قوله تعالى : فاقرؤوا ما تيسر منه . قال أبو عبد الرحمن السلمي : لما نزلت : يا أيها المزمل قاموا حتى ورمت أقدامهم وسوقهم ، ثم نزل قوله تعالى : فاقرؤوا ما تيسر منه . قال بعض العلماء : وهو فرض نسخ به فرض ، كان على النبي - صلى الله عليه وسلم - خاصة لفضله ; كما قال تعالى : ومن الليل فتهجد به نافلة لك .قلت : القول الأول يعم جميع هذه الأقوال ، وقد قال تعالى : وأقيموا الصلاة فدخل فيها قول من قال إن الناسخ الصلوات الخمس .وقد ذهب الحسن وابن سيرين إلى أن صلاة الليل فريضة على كل مسلم ولو على قدر حلب شاة . وعن الحسن أيضا أنه قال في هذه الآية : الحمد لله تطوع بعد الفريضة . وهو الصحيح إن شاء الله تعالى ; لما جاء في قيامه من الترغيب والفضل في القرآن والسنة .وعن عائشة - رضي الله عنها - قالت : كنت أجعل للنبي - صلى الله عليه وسلم - حصيرا يصلي عليه من الليل ، فتسامع الناس به ، فلما رأى جماعتهم كره ذلك ، وخشي أن يكتب عليهم قيام الليل ، فدخل البيت كالمغضب ، فجعلوا يتنحنحون ويتفلون فخرج إليهم فقال : \" أيها الناس اكلفوا من الأعمال ما تطيقون ، فإن الله لا يمل من الثواب ، حتى تملوا من العمل ، وإن خير العمل أدومه وإن قل \" . فنزلت : يا أيها المزمل فكتب عليهم ، فأنزل بمنزلة الفريضة ، حتى إن كان أحدهم ليربط الحبل فيتعلق به ، فمكثوا ثمانية أشهر ، فرحمهم الله وأنزل : إن ربك يعلم أنك تقوم أدنى من ثلثي الليل فردهم الله إلى الفريضة ، ووضع عنهم قيام الليل إلا ما تطوعوا به .[ ص: 36 ] قلت : حديث عائشة هذا ذكره الثعلبي ، ومعناه ثابت في الصحيح إلى قوله : ( وإن قل ) وباقيه يدل على أن قوله تعالى : يا أيها المزمل نزل بالمدينة وأنهم مكثوا ثمانية أشهر يقومون . وقد تقدم عنها في صحيح مسلم : حولا . وحكى الماوردي عنها قولا ثالثا وهو ستة عشر شهرا ، لم يذكر غيره عنها .وذكر عن ابن عباس أنه كان بين أول المزمل وآخرها سنة ; قال : فأما رسول الله - صلى الله عليه وسلم - فقد كان فرضا عليه .وفي نسخة عنه قولان : أحدهما أنه كان فرضه عليه إلى أن قبضه الله تعالى . الثاني أنه نسخ عنه كما نسخ عن أمته . وفي مدة فرضه إلى أن نسخ قولان : أحدهما : المدة المفروضة على أمته في القولين الماضيين ، يريد قول ابن عباس حولا ، وقول عائشة ستة عشر شهرا . الثاني : أنها عشر سنين إلى أن خفف عنه بالنسخ زيادة في التكليف ، ليميزه بفعل الرسالة ; قاله ابن جبير .قلت : هذا خلاف ما ذكره الثعلبي عن سعيد بن جبير حسب ما تقدم فتأمله . وسيأتي لهذه المسألة زيادة بيان في آخر السورة إن شاء الله تعالى .\n","ar.miqbas":"نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلًا (3) وقوله : { إلاّ قليلاً } استثناء من { الليل } أي إلاّ قليلاً منه ، فلم يتعلق إيجاب القيام عليه بأوقات الليل كلها .و { نصفه } بدل من { قليلاً } بدلاً مطابقاً وهو تبيين لإِجمال { قليلاً } فجعل القليل هنا النصفَ أو أقلَّ منه بقليل .وفائدة هذا الإِجمال الإِيماء إلى أن الأوْلى أن يكون القيام أكثر من مدة نصف الليل وأن جعله نصف الليل رحمة ورخصة للنبيء صلى الله عليه وسلم ويدل لذلك تعقيبُه بقوله : { أو انقص منه قليلاً } أي انقص من النصف قليلاً ، فيكون زمن قيام الليل أقلّ من نصفه ، وهو حينئذٍ قليل فهو رخصة في الرخصة .\n","ar.waseet":"وقوله - سبحانه - : ( أَوِ انقص مِنْهُ قَلِيلاً . أَوْ زِدْ عَلَيْهِ . . ) تخيير له صلى الله عليه وسلم فيما يفعله ، وإظهار لما اشتملت عليه شريعة الإِسلام من يسر وسماحة . .فكأنه - تعالى - يقول له على سبيل التلطف والإرشاد إلى ما يشرح صدره - يأيها المتلفف بثيابه ، قم الليل للعبادة والصلاة ، إلا وقتا قليلا منه يكون لراحتك ونومك ، وهذا الوقت القليل المتخذ للنوم والراحة قد يكون نصف الليل ، أو قد يكون أقل من النصف بأن يكون فى حدود ثلث الليل\n","ar.baghawi":"وبين قدره فقال: \"نصفه أو انقص منه قليلاً\"، إلى الثلث.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5478.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5478.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5478.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا","transliteration":"Aw zid 'alaihi wa rattilil Qur'aana tarteela","translations":{"en.ahmedali":"Or a little more, and recite the Qur'an slowly and distinctly.","en.ahmedraza":"Or increase a little upon it, and recite the Qur’an slowly in stages.","en.arberry":"or add a little), and chant the Koran very distinctly;","en.asad":"or add to it [at will]; and [during that time] recite the Qur’an calmly and distinctly, with thy mind attuned to its meaning.","en.daryabadi":"Or increase thereto. And intone the Qur'an with a measured intontion. s","en.hilali":"Or a little more; and recite the Quran (aloud) in a slow, (pleasant tone and) style.","en.pickthall":"Or add (a little) thereto - and chant the Qur'an in measure,","en.qaribullah":"or a little more; and with recitation, recite the Koran.","en.sahih":"Or add to it, and recite the Qur'an with measured recitation.","en.sarwar":"and recite the Quran in a distinct tone;","en.yusufali":"Or a little more; and recite the Qur'an in slow, measured rhythmic tones.","en.maududi":"or add to it a little; and recite the Qur'an slowly and distinctly.","en.shakir":"Or add to it, and recite the Quran as it ought to be recited.","en.itani":"Or add to it; and chant the Quran rhythmically.","en.mubarakpuri":"Or a little more. And Rattil the Qur'an Tartil.","en.qarai":"or add to it, and recite the Quran in a measured tone.","en.wahiduddin":"or a little more, but recite the Quran slowly and distinctly."},"tafsir":{"ar.muyassar":"يا أيها المتغطي بثيابه، قم للصلاة في الليل إلا يسيرًا منه. قم نصف الليل أو انقص من النصف قليلا حتى تَصِلَ إلى الثلث، أو زد على النصف حتى تصل إلى الثلثين، واقرأ القرآن بتُؤَدَة وتمهُّلٍ مبيِّنًا الحروف والوقوف.","ar.jalalayn":"«أو زد عليه» إلى الثلثين وأو للتخيير «ورتل القرآن» تثبت في تلاوته «ترتيلا».","ar.qurtubi":"قوله تعالى : ورتل القرآن ترتيلا أي لا تعجل بقراءة القرآن بل اقرأه في مهل وبيان مع تدبر المعاني . وقال الضحاك : اقرأه حرفا حرفا .وقال مجاهد : أحب الناس في القراءة إلى الله أعقلهم عنه . والترتيل التنضيد والتنسيق وحسن النظام ; ومنه ثغر رتل ورتل ، بكسر العين وفتحها : إذا كان حسن التنضيد . وتقدم بيانه في مقدمة الكتاب .وروى الحسن أن النبي - صلى الله عليه وسلم - مر برجل يقرأ آية ويبكي ، فقال : \" ألم تسمعوا إلى قول الله - عز وجل - : ورتل القرآن ترتيلا هذا الترتيل \" . وسمع علقمة رجلا يقرأ قراءة حسنة فقال : لقد رتل القرآن ، فداه أبي وأمي ، وقال أبو بكر بن طاهر : تدبر في لطائف خطابه ، وطالب نفسك بالقيام بأحكامه ، وقلبك بفهم معانيه ، وسرك بالإقبال عليه .وروى عبد الله بن عمرو قال : قال النبي - صلى الله عليه وسلم - : يؤتى بقارئ القرآن يوم القيامة ، فيوقف في أول درج الجنة ويقال له اقرأ وارتق ورتل كما كنت ترتل في الدنيا ، فإن منزلك عند آخر آية تقرؤها خرجه أبو داود وقد تقدم في أول الكتاب . وروى أنس أن النبي - صلى الله عليه وسلم - كان يمد صوته بالقراءة مدا .\n","ar.miqbas":"أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآَنَ تَرْتِيلًا (4)وقال { أو زد عليه } وهو عود إلى الترغيب في أن تكون مدة القيام أكثر من نصف الليل ولذلك لم يقيد { أو زد عليه } بمثل ما قيد به { أو انقص منه } لتكون الزيادة على النصف متسعة ، وقد ورد في الحديث أن النبي صلى الله عليه وسلم أخذ بالعزيمة فقام حتى تورمت قدماه وقيل له في ذلك : «إن الله غفر لك ما تقدم من ذنبك وما تأخر» فقال : «أفَلا أكونُ عبداً شكوراً» .والتخيير المستفاد من حرف { أو } منظور فيه إلى تفاوت الليالي بالطول والقصر لأن لذلك ارتباطاً بسعة النهار للعمل ولأخذ الحظ الفائت من النوم .وبعد فذلك توسيع على النبي صلى الله عليه وسلم لرفع حرج تحديده لزمن القيام فسلك به مسلك التقريب .وجعل ابن عطية { الليل } اسم جنس يصدق على جميع الليالي ، وأن المعنى : إلاّ قليلاً من الليالي ، وهي الليالي التي يكون فيها عذر يمنعه من قيامها ، أي هو استثناء من الليالي باعتبار جزئياتها لا باعتبار الأجزاء ، ثم قال : { نصفه } إلى آخره .وتخصيص الليل بالصلاة فيه لأنه وقتُ النوم عادة فأُمر الرسول صلى الله عليه وسلم بالقيام فيه زيادة في إشغال أوقاته بالإِقبال على مناجاة الله : ولأن الليل وقت سكون الأصوات واشتغال الناس فتكون نفس القائم فيه أقوى استعداداً لتلقي الفيض الرباني .يجوز أن يكون متعلقاً بقيام الليل ، أي رتل قراءتك في القيام .ويجوز أن يكون أمراً مستقلاً بكيفية قراءة القرآن جرى ذكره بمناسبة الأمر بقيام الليل ، وهذا أولى لأن القراءة في الصلاة تدخل في ذلك . وقد كان نزول هذه السورة في أول العهد بنزول القرآن فكان جملة القرآن حين نزول هذه السورة سورتين أو ثلاثَ سور بناء على أصح الأقوال في أن هذا المقدار من السورة مكي ، وفي أن هذه السورة من أوائل السور ، وهذا مما أشعر به قوله : { إنا سنلقي عليك قولاً ثقيلاً } [ المزمل : 5 ] أي سنوحي إليك قرآناً .فأمر النبي صلى الله عليه وسلم أن يقرأ القرآن بمهل وتبيين .والترتيل : جعل الشيء مرتَّلاً ، أي مفرقاً ، وأصله من قولهم : ثَغْر مرتَّل ، وهو المفلج الأسنان ، أي المفرق بين أسنانه تفرقاً قليلاً بحيث لا تكون النواجذ متلاصقة . وأريد بترتيل القرآن ترتيل قراءته ، أي التمهل في النطق بحروف القرآن حتى تخرج من الفم واضحةً مع إشباع الحركات التي تستحق الإِشباع . ووصَفَتْ عائشة الترتيل فقالت : «لو أراد السامع أن يعُد حروفه لعدها لا كسَرْدِكم هذا» .وفائدة هذا أن يرسخ حفظه ويتلقاه السامعون فيعلَقُ بحوافظهم ، ويتدبر قارئه وسامعه معانيَه كي لا يسبق لفظُ اللسان عملَ الفهم . قال قائل لعبد الله بن مسعود : قرأت المفصل في ليلة فقال عبد الله : «هَذًّا كهَذًّ الشعر» لأنهم كانوا إذا أنشدوا القصيدة أسرعوا ليظهر مِيزان بَحرها ، وتتعاقب قوافيها على الأسماع . والهذُّ إسراع القطع .وأكد هذا الأمر بالمفعول المطلق لإِفادة تحقيق صفة الترتيل . وقرأ الجمهور { أو انقص } بضم الواو للتخلص من التقاء الساكنين عند سقوط همزة الوصل ، حركوا الواو بضمّة لمناسبة ضمة قاف { انقص } بعدها . وقرأه حمزة وعاصم بكسر الواو على الأصل في التخلص من التقاء الساكنين .ووقع في قوله تعالى : { أو زِدْ عليه ورتل القرآن } إذا ( شبعت ) فتحة نون القرآن محسِّن الاتِّزان بأن يكون مصراعاً من بحر الكامل أحَذَّ دخَله الإِضمار مرتين .\n","ar.waseet":"ولك - أيها الرسول الكريم - أن تزيد على ذلك ، بأن تجعل ثلثى الليل للعبادة ، وثلثه للنوم والراحة ..فأنت ترى أن الله - تعالى - قد رخص لنبيه صلى الله عليه وسلم فى أن يجعل نصف الليل أو ثلثه ، أو ثلثيه للعبادة والطاعة ، وأن يجعل المقدار الباقى من الليل للنوم والراحة . .وخص - سبحانه - الليل بالقيام ، لأنه وقت سكون الأصوات . . فتكون العبادة فيه أكثر خشوعا ، وأدى لصفاء النفس ، وطهارة القلب ، وحسن الصلة بالله - عز وجل - .هذا ، وقد استمر وجوب الليل على الرسول صلى الله عليه وسلم حتى بعد فرض الصلوات الخمس عليه وعلى أمته . تعظيما لشأنه ، ومداومة له على مناجاة ربه ، خصوصا فى الثلث الأخير من الليل ، يدل على ذلك قوله - تعالى - : ( وَمِنَ الليل فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ عسى أَن يَبْعَثَكَ رَبُّكَ مَقَاماً مَّحْمُوداً ) وقد كان المسلمون يقتدون بالرسول صلى الله عليه وسلم فى قيام الليل وقد أثنى - سبحانه - عليهم بسبب ذلك فى آيات كثيرة منها قوله - تعالى - : ( تتجافى جُنُوبُهُمْ عَنِ المضاجع يَدْعُونَ رَبَّهُمْ خَوْفاً وَطَمَعاً وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ . فَلاَ تَعْلَمُ نَفْسٌ مَّآ أُخْفِيَ لَهُم مِّن قُرَّةِ أَعْيُنٍ جَزَآءً بِمَا كَانُواْ يَعْمَلُونَ ) وقد ذكر الإِمام أحمد حديثا طويلا عن سعيد بن هشام ، وفيه أنه سأل السيدة عائشة عن قيامه صلى الله عليه وسلم بالليل ، فقالت له : ألست تقرأ هذه السورة ، يأيها المزمل . . ؟إن الله افترض قيام الليل فى أول هذه السورة ، فقام رسول الله صلى الله عليه وسلم وأصحابه حولا حتى انتفخت أقدامهم . وأمسك الله ختامها فى السماء اثنى عشر شهرا ، ثم أنزل التخفيف فى آخر هذه السورة ، فصار قيام الليل تطوعا من بعد فريضة . .قال القرطبى ما ملخصه : واختلف : هل كان قيام الليل فرضا وحتما ، أو كان ندبا وحضا؟ والدلائل تقوى أن قيامه كان حتما وفرضا ، وذلك أن الندب والحض ، لا يقع على بعض الليل دون بعض ، لأن قيامه ليس مخصوصا به وقت دون وقت .واختلف - أيضا - هل كان فرضا على النبى صلى الله عليه وسلم وحده؟ أو عليه وعلى من كان قبله من الأنبياء؟ أو عليه وعلى أمته؟ ثلاثة أقوال . . أصحها ثالثها للحديث المتقدم الذى رواه سعيد بن هشام عن عائشة - رضى الله عنها - .وقال بعض العلماء بعد أن ساق العلماء فى هذه المسألة بشئ من التفصيل : والذى يستخلص من ذلك أن أرجح الأقوال ، هو القول القائل بأن التهجد كانفريضة على النبى صلى الله عليه وسلم وعلى أمته ، إذ هو الذى يمكن أن تأتلف عليه النصوص القرآنية ، ويشهد له ما تقدم من الآثار عن ابن عباس وعائشة وغيرهما .ويرى بعض العلماء أن وجوب التهجد باق على الناس جميعا ، وأنه لم ينسخ ، وإنما الذى نسخ هو وجوب قيام جزء مقدر من الليل ، لا ينقص كثيرا عن النصف .ويرد على هذا القول بما ثبت فى الصحيحين ، من \" أن الرسول صلى الله عليه وسلم قال للرجل الذى سأله عما يجب عليه من صلاة؟ قال : خمس صلوات فى اليوم والليلة . قال : هل على غيرها؟ قال : لا إلا أن تطوع \" .ويرى فريق آخر : أن قيام الليل نسخ عن الرسول وعن أمته بآخر سورة المزمل . واستبدل به قراءة القرآن ، على ما يعطيه قوله - تعالى - ( عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ فاقرءوا مَا تَيَسَّرَ مِنَ القرآن ) ويدل عليه - أيضا - ظاهر ما روى عن عائشة ، من قولها : فصار قيام الليل تطوعا من بعد الفريضة ، دون أن تقيد ذلك بقيد .ويرى فريق ثالث : أن وجوب التهجد استمر على النبى وعلى الأمة ، حتى نسخ بالصلوات الخمس ليلة المعراج .ويرى فريق رابع : أن قيام الليل نسخ عن الأمة وحدها ، وبقى وجوبه على النبى صلى الله عليه وسلم على ما يعطيه ظاهر آية الإِسراء .ولعل أرجح هذه الأقوال هو القول الرابع . . فإن آية سورة الإِسراء وهى قوله - تعالى - : ( وَمِنَ الليل فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ . . . ) تدل على أن وجوب التهجد قد بقى عليه صلى الله عليه وسلم .وقوله - تعالى - : ( وَرَتِّلِ القرآن تَرْتِيلاً ) إرشاد له صلى الله عليه وسلم ولأمته إلى أفضل طريقة لقراءة القرآن الكريم ، حتى يستمروا عليها ، وهم فى أول عهدهم بنزول القرآن الكريم .والترتيل : جعل الشئ مرتلا ، أى : منسقا منظما ، ومنه قولهم : ثغر مرتل ، أى : منظم الأسنان ، لم يشذ بعضها عن بعض .أى : قم - أيها الرسول الكريم - الليل إلا قليلا منه . . متعبدا لربك مرتلا للقرآن ترتيلا جميلا حسنا ، تستبين معه الكلمات والحروف ، حتى يفهمها السامع ، وحتى يكون ذلك أعون على حسن تدبره ، وأثبت لمعانيه فى القلب . .قال الإِمام ابن كثير : وكذلك كان يقرأ صلى الله عليه وسلم فقد قالت عائشة : كان رسول الله صلى الله عليه وسلم يقرأ السورة فيرتلها . . وسئل أنس عن قراءته صلى الله عليه وسلم فقال : كانت مدا . . وقال صلى الله عليه وسلم : \" زينوا القرآن بأصواتكم \" .وقال عبد الله بن مسعود : لا تنثروه نثر الرمَل ، ولا تهذوه هذَّ الشِّعر وقفوا عند عجائبه وحركوا به القلوب - أى لا تسرعوا فى قراءته كما تسرعوا فى قراءة الشعر .والهذ : سرعة القطع - هذا ، وليس معنى قوله - سبحانه - : ( وَرَتِّلِ القرآن تَرْتِيلاً ) ، أن يقرأ بطريقة فيها تلحين أو تطريب يغير من ألفاظ القرآن ، ويخل بالقراءة الصحيحة من حيث الأداء ، ومخارج الحروف ، والغن والمد ، والإِدغام والإِظهار . . وغير ذلك مما يقتضيه القراءة السليمة للقرآن الكريم .وإنما معنى قوله - تعالى - : ( وَرَتِّلِ القرآن تَرْتِيلاً ) أن يقرأه بصوت جميل وبخشوع وتدبر ، وبالتزام تام للقراءة الصحيحة ، من حيث مخارج الحروف ومن حيث الوقف والمد والإِظهار والإِخفاء ، وغير ذلك . .وقد بسط القول فى هذه المسألة بعض العلماء فارجع إليه إن شئت .\n","ar.baghawi":"( أو زد عليه ) على النصف إلى الثلثين ، خيره بين هذه المنازل ، وكان النبي - صلى الله عليه وسلم - وأصحابه يقومون على هذه المقادير ، وكان الرجل لا يدري متى ثلث الليل ومتى نصف الليل ومتى الثلثان ، فكان [ الرجل ] يقوم حتى يصبح مخافة أن لا يحفظ القدر الواجب ، واشتد ذلك عليهم حتى انتفخت أقدامهم فرحمهم الله وخفف عنهم ونسخها بقوله : فاقرءوا ما تيسر من القرآن علم أن سيكون منكم مرضى \" الآية . فكان بين أول السورة وآخرها سنة .أخبرنا الإمام أبو علي الحسين بن محمد القاضي ، أخبرنا أبو نعيم عبد الملك بن الحسن الإسفراييني ، أخبرنا أبو عوانة يعقوب بن إسحاق الحافظ ، حدثنا الحسن بن علي بن عفان ، حدثنا يحيى بن بشير ، حدثنا سعيد - يعني ابن أبي عروبة - حدثنا قتادة عن زرارة بن أبي أوفى عن سعيد بن هشام قال : انطلقت إلى عائشة رضي الله عنها فقلت : يا أم المؤمنين أنبئيني عن خلق رسول الله - صلى الله عليه وسلم - فقالت : [ ألست ] تقرأ القرآن ؟ قلت : بلى ، قالت : فإن خلق نبي الله - صلى الله عليه وسلم - كان القرآن ، قلت : فقيام رسول الله - صلى الله عليه وسلم - يا أم المؤمنين ؟ قالت : ألست تقرأ : \" يا أيها المزمل \" قلت : بلى ، قالت : فإن الله افترض القيام في أول هذه السورة ، فقام رسول الله - صلى الله عليه وسلم - وأصحابه حولا حتى انتفخت أقدامهم وأمسك الله خاتمتها اثني عشر شهرا في السماء ، ثم أنزل الله التخفيف في آخر هذه السورة ، فصار قيام الليل تطوعا بعد الفريضة .قال مقاتل وابن كيسان : كان هذا بمكة قبل أن تفرض الصلوات الخمس ، ثم نسخ ذلك بالصلوات الخمس .( ورتل القرآن ترتيلا ) قال ابن عباس : بينه بيانا . وقال الحسن : اقرأه قراءة بينة . وقال مجاهد : ترسل فيه ترسلا . وقال قتادة : تثبت فيه تثبتا . وعن ابن عباس أيضا : اقرأه على هينتك ثلاث آيات أو أربعا أو خمسا .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا عمرو بن عاصم ، حدثنا همام عن قتادة قال : سئل أنس كيف كانت قراءة النبي - صلى الله عليه وسلم - فقال : كانت مدا مدا ، ثم قرأ : بسم الله الرحمن الرحيم ، يمد بسم الله ويمد الرحمن ويمد الرحيمأخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا آدم ، حدثنا شعبة ، حدثنا عمرو بن مرة قال : سمعت أبا وائل قال : جاء رجل إلى ابن مسعود ، قال : قرأت المفصل الليلة في ركعة ، فقال : هذا كهذ الشعر ؟ لقد عرفت النظائر التي كان النبي - صلى الله عليه وسلم - يقرن بينهن ، فذكر عشرين سورة من المفصل سورتين [ من آل حاميم ] في [ كل ] ركعة .أخبرنا أبو جعفر أحمد بن أبي أحمد بن مثويه ، أخبرنا الشريف أبو القاسم علي بن محمد بن علي بن الحسيني الحراني فيما كتبه إلي [ أخبرنا أبو بكر محمد بن الحسين الآجري ] أخبرنا أبو بكر عبد الله بن محمد بن حميد الواسطي ، حدثنا زيد بن أخزم ، حدثنا محمد بن الفضل ، حدثنا سعيد بن زيد ، عن أبي حمزة ، عن إبراهيم ، عن علقمة ، عن عبد الله - يعني ابن مسعود - قال : لا تنثروه نثر الدقل ولا تهذوه هذ الشعر ، قفوا عند عجائبه وحركوا به القلوب ، ولا يكن هم أحدكم آخر السورة .أخبرنا أبو جعفر أحمد بن أبي أحمد بن مثويه ، أخبرنا الشريف أبو القاسم علي بن محمد بن علي بن الحسين الحراني فيما كتب إلي ، حدثنا أبو بكر محمد بن الحسين الآجري ، حدثنا أبو محمد يحيى بن محمد بن صاعد ، حدثنا الحسين بن الحسن المروزي ، حدثنا ابن المبارك ، ح ، أخبرنا أبو بكر محمد بن عبد الله بن أبي توبة ، أخبرنا أبو طاهر محمد بن أحمد بن الحارث ، أخبرنا أبو الحسن محمد بن يعقوب الكسائي ، أخبرنا عبد الله بن محمد ، أخبرنا إبراهيم بن عبد الله الخلال ، حدثنا عبد الله بن المبارك ، عن موسى بن عبيدة ، عن عبد الله بن عبيدة وهو أخوه عن سهل بن سعد الساعدي قال : بينا نحن نقرأ إذ خرج علينا رسول الله - صلى الله عليه وسلم - فقال : \" الحمد لله كتاب الله واحد وفيكم الأخيار وفيكم الأحمر والأسود اقرءوا [ القرآن ] قبل أن يأتي أقوام يقرءونه ، يقيمون حروفه كما يقام السهم لا يجاوز تراقيهم ، يتعجلون أخره ولا يتأجلونه \" .أخبرنا أبو عثمان الضبي ، أخبرنا أبو محمد الجراحي ، حدثنا أبو العباس المحبوبي ، حدثنا أبو عيسى الترمذي ، حدثنا أبو بكر محمد بن نافع البصري ، حدثنا عبد الصمد بن عبد الوارث ، عن إسماعيل بن مسلم العبدي ، عن أبي المتوكل الناجي ، عن عائشة رضي الله عنها قالت : قام النبي - صلى الله عليه وسلم - بآية من القرآن ليلة .ورواه أبو ذر ، قال : قام النبي - صلى الله عليه وسلم - ليلة حتى أصبح بآية [ من القرآن ] والآية : \" إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم \" ( المائدة - 118 ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5479.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5479.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5479.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا","transliteration":"Innaa sanulqee 'alika qawalan saqeelaa","translations":{"en.ahmedali":"We shall soon entrust to you a message heavy (with solemnity).","en.ahmedraza":"Indeed We shall soon ordain a heavy responsibility upon you.","en.arberry":"Behold, We shall cast upon thee a weighty word;","en.asad":"Behold, We shall bestow upon thee a weighty message –","en.daryabadi":"Verily We! anon We shall cast upon thee a weighty word.","en.hilali":"Verily, We shall send down to you a weighty Word (i.e. obligations, legal laws, etc.).","en.pickthall":"For we shall charge thee with a word of weight.","en.qaribullah":"We are about to cast upon you a weighty Word.","en.sahih":"Indeed, We will cast upon you a heavy word.","en.sarwar":"We are about to reveal to you a mighty word.","en.yusufali":"Soon shall We send down to thee a weighty Message.","en.maududi":"Behold, We shall cast upon you a Weighty Word.","en.shakir":"Surely We will make to light upon you a weighty Word.","en.itani":"We are about to give you a heavy message.","en.mubarakpuri":"Verily, We shall send down to you a Word Thaqil.","en.qarai":"Indeed soon We shall cast on you a weighty discourse.","en.wahiduddin":"For We are about to send down to you a message of considerable gravity."},"tafsir":{"ar.muyassar":"إنا سننزل عليك -أيها النبي- قرآنًا عظيمًا مشتملا على الأوامر والنواهي والأحكام الشرعية.","ar.jalalayn":"«إنا سنلقي عليك قولا» قرآنا «ثقيلا» مهيبا أو شديدا لما فيه من التكاليف.","ar.qurtubi":"قوله تعالى : إنا سنلقي عليك قولا ثقيلاقوله تعالى : إنا سنلقي عليك قولا ثقيلا هو متصل بما فرض من قيام الليل ، أي سنلقي عليك بافتراض صلاة الليل قولا ثقيلا يثقل حمله ; لأن الليل للمنام ، فمن أمر بقيام أكثره لم يتهيأ له ذلك إلا بحمل شديد على النفس ومجاهدة للشيطان ، فهو أمر يثقل على العبد .وقيل : إنا سنوحي إليك القرآن ، وهو قول ثقيل يثقل العمل بشرائعه .قال قتادة : ثقيل والله فرائضه وحدوده . مجاهد : حلاله وحرامه . الحسن : العمل به .أبو العالية : ثقيلا بالوعد والوعيد والحلال والحرام . محمد بن كعب : ثقيلا على المنافقين . وقيل : على الكفار ; لما فيه من الاحتجاج عليهم ، والبيان لضلالتهم وسب آلهتهم ، والكشف عما حرفه أهل الكتاب .السدي : ثقيل بمعنى كريم ; مأخوذ من قولهم : فلان ثقيل علي ، أي يكرم علي .الفراء : ( ثقيلا ) رزينا ليس بالخفيف السفساف لأنه كلام ربنا . وقال الحسين بن الفضل : ثقيلا لا يحمله إلا قلب مؤيد بالتوفيق ، ونفس مزينة بالتوحيد .وقال ابن زيد : هو والله ثقيل مبارك ، كما ثقل في الدنيا يثقل في الميزان يوم القيامة .وقيل : ( ثقيلا ) أي ثابتا كثبوت الثقيل في محله ، ويكون معناه أنه ثابت الإعجاز ، لا يزول إعجازه أبدا . وقيل : هو القرآن نفسه ; كما جاء في الخبر : أن النبي - صلى الله عليه وسلم - كان إذا أوحي إليه وهو على ناقته وضعت جرانها - يعني صدرها - على الأرض ، فما تستطيع أن تتحرك حتى يسرى عنه .وفي الموطأ وغيره أنه - عليه السلام - سئل : كيف يأتيك الوحي ؟ فقال : \" أحيانا يأتيني مثل صلصلة الجرس ، وهو أشده علي ، فيفصم عني وقد وعيت ما قال ، وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول \" . قالت عائشة - رضي الله عنها - : ولقد رأيته ينزل عليه الوحي في اليوم الشديد البرد ، فيفصم عنه وإن جبينه ليتفصد عرقا .قال ابن العربي : وهذا أولى ; لأنه الحقيقة ، وقد جاء : وما جعل عليكم في الدين من حرج . وقال - عليه السلام - : بعثت بالحنيفية السمحة . وقيل : القول في هذه السورة : هو قول لا إله إلا الله ; إذ في الخبر : خفيفة على اللسان ثقيلة في الميزان ; ذكره القشيري .\n","ar.miqbas":"إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا (5)تعليل للأَمر بقيام الليل وقع اعتراضاً بين جملة { قم الليل } [ المزمل : 2 ] وجملة { إن ناشئة الليل هي أشد وطْأً } [ المزمل : 6 ] ، وهو جملة مستأنفة استئنافاً بيانياً لحكمة الأمر بقيام الليل بأنها تهيئةُ نفس النبي صلى الله عليه وسلم ليحمل شدة الوحي ، وفي هذا إيماء إلى أن الله يَسَّر عليه ذلك كما قال تعالى : { إن علينا جمعه وقرآنه } [ القيامة : 17 ] ، فتلك مناسبة وقوع هذه الجملة عقب جملة { قم الليل إلاّ قليلاً } [ المزمل : 2 ] فهذا إشعار بأن نزول هذه الآية كان في أول عهد النبي صلى الله عليه وسلم بنزول القرآن فلما قال له : { ورتل القرءان ترتيلا } [ المزمل : 4 ] أعقب ببيان علة الأمر بترتيل القرآن .والقول الثقيل هو القرآن وإلقاؤه عليه : إبلاغه له بطريق الوحي بواسطة الملَك .وحقيقة الإِلقاء : رمي الشيء من اليد إلى الأرض وطرحه ، ويقال : شيء لَقى ، أي مطروح ، استعير الإِلقاء للإِبلاغ دفعة على غير ترقب .والثقل الموصوف به القول ثقل مجازي لا محالة ، مستعار لصعوبة حفظه لاشتماله على معان ليست من معتاد ما يجول في مدارك قومه فيكون حفظ ذلك القول عسيراً على الرسول الأمّي تنوء الطاقة عن تلقّيه .وأشعر قوله : { إنا سنلقي عليك قولاً ثقيلاً } أن ثقله متعلق ابتداء بالرسول صلى الله عليه وسلم لقوله قبله : { إنا سنلقي عليك } وهو ثقل مجازي في جميع اعتباراته وهو ثقيل صعب تلقيه ممن أنزل عليه . قال ابن عباس : كان رسول الله صلى الله عليه وسلم \" إذا نزل عليه الوحي ثقل عليه وتربَّد له جِلده \" ( أي تغير بمثل القشعريرة ) وقالت عائشة : «رأتُهُ ينزل عليه الوحي في اليوم الشديد البرد فيفصم عنه وإن جبينه ليرفَضُّ عرقاً» .ويستعار ثقل القول لاشتماله على معان وافرة يحتاج العلم بها لدقة النظر وذلك بكمال هديه ووفرة معانيه . قال الفراء : «ثقيلاً ليس بالكلام السفساف» . وحسبك أنه حوى من المعارف والعلوم ما لا يفي العقل بالإِحاطة به فكم غاصت فيه أفهام العلماء من فقهاء ومتكلمين وبلغاء ولغويين وحكماء فشابه الشيء الثقيل في أنه لا يقوى الواحد على الاستقلال بمعانيه .وتأكيد هذا الخبر بحرف التأكيد للاهتمام به وإشعار الرسول صلى الله عليه وسلم بتأكيد قربه واستمراره ، ليكون وروده أسهل عليه من ورود الأمر المفاجىء .\n","ar.waseet":"وقوله - تعالى - ( إِنَّا سَنُلْقِي عَلَيْكَ قَوْلاً ثَقِيلاً ) تعليل للأمر بقيام الليل ، وهو كلام معترض بين قوله - سبحانه - ( قُمِ الليل . . ) وبين قوله - تعالى - بعد ذلك : ( إِنَّ نَاشِئَةَ الليل . . . ) .والمراد بالقول الثقيل : القرآن الكريم الذى أنزله - سبحانه - على قلب نبيه صلى الله عليه وسلم .ويشهد لثقل القرآن على النبى صلى الله عليه وسلم أحاديث كثيرة ، منها : ما رواه الإِمام البخارى من أن السيدة عائشة قالت : ولقد رأيته صلى الله عليه وسلم ينزل عليه الوحى ، فى اليوم الشديد البرد فيفصم عنه وإن جبينه ليتفصد عرقا .ومنها قوله صلى الله عليه وسلم \" ما من مرة يوحَى إلى ، إلا ظننت أن نفسى تفيض \" - أى : تخرج . .ونمها قول زيد بن ثابت : أنزل على رسول الله صلى الله عليه وسلم شئ من القرآن - وفخذه على فخذى فكادت تُرَض فخذى - أى : تتكسر . .ومنها ما رواه هشام بن عروة عن أبيه ، أن النبى صلى الله عليه وسلم كان إذا أوحى عليه وهو على ناقته ، وضعت جرانها - أى باطن عنقها - فما تستطيع أن تتحرك ، حتى يُسَرَّى عنه .أى : قم - أيها الرسول الكريم - الليل إلا قليلا منه متعبدا لربك ، متقربا إليه بألوان الطاعات ، فإنا سنلقى عليك قولا ثقيلا ، وهذا القول هو القرآن الكريم ، الثقيل فى وزنه وفى ميزان الحق ، وفى أثره فى القلوب ، وفيما اشتمل عليه من تكاليف ، وصدق الله إذا يقول : ( لَوْ أَنزَلْنَا هذا القرآن على جَبَلٍ لَّرَأَيْتَهُ خَاشِعاً مُّتَصَدِّعاً مِّنْ خَشْيَةِ الله . . . ) قال الجمل : قوله : ( إِنَّا سَنُلْقِي عَلَيْكَ قَوْلاً ثَقِيلاً ) أى : كلاما عظيما جليلا ذا خطر وعظمة ، لأنه كلام رب العالمين ، وكل شئ له خطر ومقدار فهو ثقيل .أو هو ثقيل لما فيه من التكاليف ، والوعد والوعيد ، والحلال والحرام ، والحدود والأحكام .قال قتادة : ثقيل والله فى فرائضه وحدوده . . وقال محمد بن كعب : ثقيل على المنافقين ، لأنه يهتك أسرارهم . . وقال السدى : ثقيلا بمعنى كريم ، مأخوذ من قولهم : فلان ثقل علىَّ ، أى كرم على . . وقال ابن المبارك : هو والله ثقيل مبارك ، كما ثقل فى الدنيا ، ثقل فى الميزان يوم القيامة .وقيل : ثقيلا بمعنى أن العقل الواحد لا يفى بإدراك فوائده ومعانيه ، فالمتكلمون غاصوا فى بحار معقولانه ، والفقهاء بحثوا فى أحكامه . . والأولى أن جميع هذه المعانى فيه .وقيل : المراد بالقول الوحى ، كما فى الخبر ، أن النبى صلى الله عليه وسلم كان إذا أوحى إليه ، وهو على ناقته وضعت جرانها - أى : وضعت صدرها على الأرض - فما تستطيع أن تتحرك حتى يسرى عنه . .ويبدو لنا أن وصف القرآن بالثقل وصف حقيقى ، لما ثبت من ثقله على النبى صلى الله عليه وسلم وقت نزوله عليه . . وهذا لا يمنع أن ثقله يشمل ما اندرج فيه من علوم نافعة ، ومن هدايات سامية ، ومن أحكام حكيمة ، ومن آداب قويمة ، ومن تكاليف جليلة الشأن .وعبر - سبحانه - عن إيحائه بالقرآن إلى الرسول صلى الله عليه وسلم بالإِلقاء للإِشعار بأنه يلقى إليه على غير ترقب منه صلى الله عليه وسلم ، بل ينزل إليه فى الوقت الذى يريده سبحانه - وللإِشارة من أول الأمر إلى ما يوحى إليه شئ عظيم وشديد الوقع على النفس .\n","ar.baghawi":"( إنا سنلقي عليك قولا ثقيلا ) قال ابن عباس رضي الله عنهما : شديدا . قال الحسن : إن الرجل ليهذ السورة ولكن العمل بها ثقيل .وقال قتادة : ثقيل والله فرائضه وحدوده . وقال مقاتل : ثقيل لما فيه من الأمر والنهي والحدود .وقال أبو العالية : ثقيل بالوعد والوعيد والحلال والحرام . وقال محمد بن كعب : ثقيل على المنافقين .وقال الحسين بن الفضل : قولا خفيفا على اللسان ثقيلا في الميزان .قال الفراء : ثقيل ليس بخفيف السفساف لأنه كلام ربنا .وقال ابن زيد : هو والله ثقيل مبارك ، كما ثقل في الدنيا ثقل في الموازين يوم القيامة .أخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب ، عن مالك ، عن هشام بن عروة عن [ أبيه ] عن عائشة زوج النبي - صلى الله عليه وسلم - [ أن الحارث بن هشام سأل رسول الله - صلى الله عليه وسلم - ] فقال : يا رسول الله كيف يأتيك الوحي ؟ فقال رسول الله - صلى الله عليه وسلم - : \" أحيانا يأتيني [ في ] مثل صلصلة الجرس ، وهو أشده علي فيفصم عني وقد وعيت ما قال وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول \" . قالت عائشة : ولقد رأيته ينزل عليه الوحي في اليوم الشاتي الشديد البرد فيفصم عنه وإن جبينه ليتفصد عرقا .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5480.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5480.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5480.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا","transliteration":"Inn naashi'atal laili hiya ashadddu wat anw wa aqwamu qeelaa","translations":{"en.ahmedali":"Surely in the watches of the night the soul is most receptive and words more telling.","en.ahmedraza":"Indeed getting up in the night is tougher, and the words flow with strength.","en.arberry":"surely the first part of the night is heavier in tread, more upright in speech,","en.asad":"[and,] verily, the hours of night the mind most strongly and speak with the clearest voice,","en.daryabadi":"Verily the rising by night! it is most curbing and most conducive to right speech.","en.hilali":"Verily, the rising by night (for Tahajjud prayer) is very hard and most potent and good for governing (the soul), and most suitable for (understanding) the Word (of Allah).","en.pickthall":"Lo! the vigil of the night is (a time) when impression is more keen and speech more certain.","en.qaribullah":"Indeed, the first part of night is heavier in tread, and more upright in speech.","en.sahih":"Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.","en.sarwar":"Prayer at night leaves the strongest impression on one's soul and the words spoken are more consistent.","en.yusufali":"Truly the rising by night is most potent for governing (the soul), and most suitable for (framing) the Word (of Prayer and Praise).","en.maududi":"Surely getting up at night is the best means of subduing the self and is more suitable for uprightness in speech.","en.shakir":"Surely the rising by night is the firmest way to tread and the best corrective of speech.","en.itani":"The vigil of night is more effective, and better suited for recitation.","en.mubarakpuri":"Verily, rising (Nashi'ah) at night is better for understanding and more suitable for speech (recitation).","en.qarai":"Indeed the watch of the night is firmer in tread and more upright in respect to speech,","en.wahiduddin":"Surely, getting up at night [for worship] is the most potent means of subduing the self and most suitable for the word [of prayer]."},"tafsir":{"ar.muyassar":"إن العبادة التي تنشأ في جوف الليل هي أشد تأثيرًا في القلب، وأبين قولا لفراغ القلب مِن مشاغل الدنيا.","ar.jalalayn":"«إن ناشئة الليل» القيام بعد النوم «هي اشد وطئا» موافقة السمع للقلب على تفهم القرآن «وأقوم قليلا» أبين قولا.","ar.qurtubi":"قوله تعالى : إن ناشئة الليل قال العلماء : ناشئة الليل أي أوقاته وساعاته ، لأن أوقاته تنشأ أولا فأولا ; يقال : نشأ الشيء ينشأ : إذا ابتدأ وأقبل شيئا بعد شيء ، فهو ناشئ وأنشأه الله فنشأ ، ومنه نشأت السحابة إذا بدأت وأنشأها الله ; فناشئة : فاعلة من نشأت تنشأ فهي ناشئة ، ومنه قوله تعالى : أومن ينشأ في الحلية وهو في الخصام غير مبين والمراد إن ساعات الليل الناشئة ، فاكتفى بالوصف عن الاسم ، فالتأنيث للفظ ساعة ، لأن كل ساعة تحدث . وقيل : الناشئة مصدر بمعنى قيام الليل كالخاطئة والكاذبة ; أي إن نشأة الليل هي أشد وطئا . وقيل : إن ناشئة الليل قيام الليل . قال ابن مسعود : الحبشة يقولون : نشأ أي قام ، فلعله أراد أن الكلمة عربية ، ولكنها شائعة في كلام الحبشة ، غالبة عليهم ، وإلا فليس في القرآن ما ليس في لغة العرب . وقد تقدم بيان هذا في مقدمة الكتاب مستوفى .بين تعالى في هذه الآية فضل صلاة الليل على صلاة النهار ، وأن الاستكثار من صلاة الليل بالقراءة فيها ما أمكن أعظم للأجر ، وأجلب للثواب .واختلف العلماء في المراد بناشئة الليل ; فقال ابن عمر وأنس بن مالك : هو ما بين المغرب والعشاء ، تمسكا بأن لفظ نشأ يعطي الابتداء ، فكان بالأولية أحق ; ومنه قول الشاعر :ولولا أن يقال صبا نصيب لقلت بنفسي النشأ الصغاروكان علي بن الحسين يصلي بين المغرب والعشاء ويقول : هذا ناشئة الليل . وقال عطاء وعكرمة : إنه بدء الليل . وقال ابن عباس ومجاهد وغيرهما : هي الليل كله ; لأنه ينشأ بعد النهار ، وهو الذي اختاره مالك بن أنس . قال ابن العربي : وهو الذي يعطيه اللفظ وتقتضيه اللغة .وقالت عائشة وابن عباس أيضا ومجاهد : إنما الناشئة القيام بالليل بعد النوم . ومن قام أول الليل قبل النوم فما قام ناشئة . فقال يمان وابن كيسان : هو القيام من آخر الليل . وقال ابن عباس : كانت صلاتهم أول الليل . وذلك أن الإنسان إذا نام لا يدري متى يستيقظ .وفي الصحاح : وناشئة الليل أول ساعاته . وقال القتبي : إنه ساعات الليل ; لأنها تنشأ ساعة بعد [ ص: 39 ] ساعة . وعن الحسن ومجاهد : هي ما بعد العشاء الآخرة إلى الصبح . وعن الحسن أيضا : ما كان بعد العشاء فهو ناشئة . ويقال : ما ينشأ في الليل من الطاعات ; حكاه الجوهري .قوله تعالى : هي أشد وطئا قرأ أبو العالية وأبو عمرو وابن أبي إسحاق ومجاهد وحميد وابن محيصن وابن عامر والمغيرة وأبو حيوة ( وطاء ) بكسر الواو وفتح الطاء والمد ، واختاره أبو عبيد . الباقون ( وطأ ) بفتح الواو وسكون الطاء مقصورة ، واختاره أبو حاتم ; من قولك : اشتدت على القوم وطأة سلطانهم . أي ثقل عليهم ما حملهم من المؤن ، ومنه قول النبي - صلى الله عليه وسلم - : \" اللهم اشدد وطأتك على مضر \" فالمعنى أنها أثقل على المصلي من ساعات النهار . وذلك أن الليل وقت منام وتودع وإجمام ، فمن شغله بالعبادة فقد تحمل المشقة العظيمة . ومن مد فهو مصدر واطأت وطاء ومواطأة أي وافقته .ابن زيد واطأته على الأمر مواطأة : إذا وافقته من الوفاق ، وفلان يواطئ اسمه اسمي ، وتواطئوا عليه أي توافقوا ; فالمعنى أشد موافقة بين القلب والبصر والسمع واللسان ; لانقطاع الأصوات والحركات ; قاله مجاهد وابن أبي مليكة وغيرهما . وقال ابن عباس بمعناه ، أي يواطئ السمع القلب ; قال الله تعالى : ليواطئوا عدة ما حرم الله أي ليوافقوا . وقيل : المعنى أشد مهادا للتصرف في التفكر والتدبر . والوطاء خلاف الغطاء . وقيل : أشد وطأ بسكون الطاء وفتح الواو أي أشد ثباتا من النهار ; فإن الليل يخلو فيه الإنسان بما يعمله ، فيكون ذلك أثبت للعمل وأتقى لما يلهي ويشغل القلب . والوطء الثبات ، تقول : وطئت الأرض بقدمي . وقال الأخفش : أشد قياما . الفراء : أثبت قراءة وقياما . وعنه : أشد وطأ أي أثبت للعمل وأدوم لمن أراد الاستكثار من العبادة ، والليل وقت فراغ عن اشتغال المعاش ، فعبادته تدوم ولا تنقطع .وقال الكلبي : أشد وطأ أي أشد نشاطا للمصلي ; لأنه في زمان راحته . وقال عبادة : أشد وطأ أي نشاطا للمصلي وأخف وأثبت للقراءة .قوله تعالى : وأقوم قيلا أي القراءة بالليل أقوم منها بالنهار ; أي أشد استقامة واستمرارا على الصواب ; لأن الأصوات هادئة ، والدنيا ساكنة ، فلا يضطرب على المصلي ما يقرؤه .قال قتادة ومجاهد : أي أصوب للقراءة وأثبت للقول ; لأنه زمان التفهم . وقال أبو علي : أقوم قيلا أي أشد استقامة لفراغ البال بالليل . وقيل : أي أعجل إجابة [ ص: 40 ] للدعاء . حكاه ابن شجرة . وقال عكرمة : عبادة الليل أتم نشاطا ، وأتم إخلاصا ، وأكثر بركة . وعن زيد بن أسلم : أجدر أن يتفقه في القرآن .وعن الأعمش قال : قرأ أنس بن مالك ( إن ناشئة الليل هي أشد وطأ وأصوب قيلا ) فقيل له : وأقوم قيلا فقال : أقوم وأصوب وأهيأ سواء . قال أبو بكر الأنباري : وقد ترامى ببعض هؤلاء الزائغين إلى أن قال : من قرأ بحرف يوافق معنى حرف من القرآن فهو مصيب ، إذا لم يخالف معنى ولم يأت بغير ما أراد الله وقصد له ، واحتجوا بقول أنس هذا . وهو قول لا يعرج عليه ولا يلتفت إلى قائله ; لأنه لو قرأ بألفاظ تخالف ألفاظ القرآن إذا قاربت معانيها واشتملت على عامتها ، لجاز أن يقرأ في موضع الحمد لله رب العالمين : الشكر للباري ملك المخلوقين ، ويتسع الأمر في هذا حتى يبطل لفظ جميع القرآن ، ويكون التالي له مفتريا على الله - عز وجل - ، كاذبا على رسوله - صلى الله عليه وسلم - ولا حجة لهم في قول ابن مسعود : نزل القرآن على سبعة أحرف ، إنما هو كقول أحدكم : هلم وتعال وأقبل ; لأن هذا الحديث يوجب أن القراءات المأثورة المنقولة بالأسانيد الصحاح عن النبي - صلى الله عليه وسلم - إذا اختلفت ألفاظها ، واتفقت معانيها ، كان ذلك فيها بمنزلة الخلاف في هلم ، وتعال ، وأقبل ، فأما ما لم يقرأ به النبي - صلى الله عليه وسلم - وأصحابه وتابعوهم - رضي الله عنهم - ، فإنه من أورد حرفا منه في القرآن بهت ومال وخرج من مذهب الصواب . قال أبو بكر : والحديث الذي جعلوه قاعدتهم في هذه الضلالة حديث لا يصح عن أحد من أهل العلم ; لأنه مبني على روايةالأعمش عن أنس ، فهو مقطوع ليس بمتصل فيؤخذ به من قبل أن الأعمش رأى أنسا ولم يسمع منه .\n","ar.miqbas":"إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا (6)تعليل لتخصيص زمن الليل بالقيام فيه فهي مرتبطة بجملة { قم الليل } [ المزمل : 2 ] ، أي قم الليل لأن ناشئته أشد وطْأً وأقوم قيلا .والمعنى : أن في قيام الليل تزكية وتصفية لسرّك وارتقاء بك إلى المراقي الملكية .و { ناشئة } وصف من النشء وهو الحدوث . وقد جرى هذا الوصف هنا على غير موصوف ، وأضيف إلى الليل إضافة على معنى ( في ) مثل «مَكَر الليل» ، وجعل من أقوم القيل ، فعُلم أن فيه قولاً وقد سبقه الأمر بقيام الليل وترتيل القرآن ، فتعين أن موصوفه المحذوف هو صلاة ، أي الصلاة الناشئة في الليل ، فإن الصلاة تشتمل على أفعال وأقوال وهي قيام .ووصف الصلاة بالناشئة لأنها أنشأها المصلي فنشأت بعدَ هدأة الليل فأشبهت السحابة التي تتنشأ من الأفق بعد صحو ، وإذا كانت الصلاة بعد نوم فمعنى النشْء فيها أقوى ، ولذلك فسرتها عائشة بالقيام بعد النوم ، وفسر ابن عباس { ناشئة الليل } بصلاة الليل كلها . واختاره مالك . وعن علي بن الحسين : أنها ما بين المغرب والعشاء . وعن ابن مسعود وابن عباس وسعيد بن جبير : أن أصل هذا معرب عن الحبشة ، وقد عدها السبكي في «منظومته» في معربات القرآن .وإيثار لفظ { ناشئة } في هذه الآية دون غيره من نحو : قيامَ أو تَهَجُدَ ، لأجل ما يحتمله من هذه المعاني ليأخذ الناس فيه بالاجتهاد .وقرأ جمهور العشرة { وَطأً } بفتح الواو وسكون الطاء بعدها همزة ، والوطء : أصله وضع الرجل على الأرض ، وهو هنا مستعار لمعنى يناسب أن يكون شأناً للظلام بالليل ، فيجوز أن يكون الوطء استعير لفعل من أفعال المصلي على نحو إسناد المصدر إلى فاعله ، أي وَاطِئاً أنتَ ، فهو مستعار لتمكن المصلي من الصلاة في الليل بتفرغه لها وهدوء باله من الأشغال النهارية تمكّن الواطىء على الأرض فهو أمكن للفعل . والمعنى : أشد وقعاً ، وبهذا فسره جابر بن زيد والضحاك وقاله الفراء .ويجوز أن يكون الوطء مستعاراً لحالة صلاة الليل وأثرها في المصلي ، أي أشد أثر خير في نفسه وأرسخ خيراً وثواباً ، وبهذا فسره قتادة .وقرأه ابن عامر وأبو عمرو وحده { وِطاءً } بكسر الواو وفتح الطاء ومدها مصدر وَاطَأ من مادة الفعال . والوِطاء : الوفاق والملاءمة ، قال تعالى : { ليواطئوا عدة ما حرم الله } [ التوبة : 37 ] . والمعنى : أن صلاة الليل أوفق بالمصلي بين اللسان والقلب ، أي بين النطق بالألفاظ وتفهم معانيها للهدوء الذي يحصل في الليل وانقطاع الشواغل وبحاصل هذا فسر مجاهد .وضمير { هي } ضمير فصل ، وانظر ما سيأتي عند قوله تعالى : { وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيراً } [ المزمل : 20 ] في وقوع ضمير الفصل بين معرفة واسم تفضيل . وضمير الفصل هنا لتقوية الحكم لا للحصر .والأقوم : الأفضل في التقوي الذي هو عدم الاعوجاح والالتواء واستعير { أقوم } للأفضل الأنفع .و { قيلاً } : القَول ، وأريد به قراءة القرآن لتقدم قوله : { إنا سنلقي عليك قولاً ثقيلاً } [ المزمل : 5 ] . فالمعنى : أن صلاة الليل أعون على تذكر القرآن والسلامة من نسيان بعض الآيات ، وأعون على المزيد من التدبر . قال ابن عباس : { وأقوم قيلاً } : أدنى من أن يفقهوا القرآن . وقال قتادة : أحفظ للقراءة ، وقال ابن زيد : أقوم قراءة لفراغه من الدنيا .وانتصب { وطْأً } و { قيلاً } نسبة تمييزي ل { أشد } ول { أقوم } .\n","ar.waseet":"ثم بين - سبحانه - بعد ذلك الحكمة من أمره له صلى الله عليه وسلم بقيام الليل إلا قليلا منه للعبادة والطاعة فقال : ( إِنَّ نَاشِئَةَ الليل هِيَ أَشَدُّ وَطْأً وَأَقْوَمُ قِيلاً ) .وقوله : ( نَاشِئَةَ ) : وصف من النشء وهو الحدوث ، وهو صفة لموصوف محذوف . وقوله : ( وَطْأً ) بمعنى مواطأة وموافقة ، وأصل الوطء : وضع الرجل على الأرض بنظام وترتيب ، ثم استعير للموافقة ، ومنه قوله - تعالى - ( لِّيُوَاطِئُواْ عِدَّةَ مَا حَرَّمَ الله ) ومنه قولهم : وطأت فلانا على كذا ، إذا وافقته عليه . وهو منصوب على التمييز . وقوله : ( قِيلاً ) بمعنى قولا .وقوله : ( وَأَقْوَمُ ) بمعنى أفضل وأنفع .والمعنى : يأيها المزمل قم الليل إلا قليلا منه للعبادة والطاعة . فإن العبادة الناشئة بالليل . هى أشد مواطأة وموافقة لإِصلاح القلب ، وتهذيب النفس ، وأقوم قولا ، وأنفع وقعا ، وأفضل قراءة من عبادة النهار ، لأن العبادة الناشئة بالليل يصحبها ما يصحبها من الخشوع والإِخلاص ، لهدوء الأصوات بالليل ، وتفرغ العابد تفرغا تاما لعبادة ربه .قال الشوكانى ما ملخصه : قوله : ( إِنَّ نَاشِئَةَ الليل . . . ) أى : ساعاته وأوقاته ، لأنها تنشأ أولا فأولا ، ويقال : نشأ الشئ ينشأ ، إذا ابتدأ وأقبل شيئا بعد شئ ، فهو ناشئ . . قال الزجاج : ناشئة الليل ، كل ما نشأ منه ، أى : حدث منه . . والمراد ساعات الليل الناشئة ، فاكتفى بالوصف عن الاسم الموصوف .وقيل : إن ناشئة الليل ، هى النفس التى تنشأ من مضجعها للعبادة ، أى : تنهض ، من نشأ من مكانه ، إذا نهض منه .( هِيَ أَشَدُّ وَطْأً ) قرأ الجمهور ( وَطْأً ) بفتح الواو وسكون الاء مقصورة ، وقرأ بعضهم ( وَطْأً ) بكسر الواو وفتح الطاء ممدودة .والمعنى على القراءة الأولى : أن الصلاة الناشئة فى الليل ، أثقل على المصلى من صلاة النهار ، لأن الليل للنوم .. ومنه قوله صلى الله عليه وسلم \" اللهم أشدد وطأتك على مضر \" .والمعنى على القراءة الثانية : أنها أشد مواطأة وموافقة بين السمع والبصر والقلب واللسان ، لانقطاع الأصوات والحركات ، ومنه قوله - تعالى - : ( لِّيُوَاطِئُواْ عِدَّةَ مَا حَرَّمَ الله ) أى : ليوافقوا .( وَأَقْوَمُ قِيلاً ) أى : وأشد مقالا . وأثبت قراءة ، لحضور القلب فيها ، وهدوءالأصوات ، وأشد استقامة واستمرارا على الصواب . .\n","ar.baghawi":"قوله - عز وجل - : ( إن ناشئة الليل ) أي : ساعاته كلها وكل ساعة منه ناشئة ، سميت بذلك لأنها تنشأ أي : تبدو ، ومنه : نشأت السحابة إذا بدت ، فكل ما حدث بالليل وبدا فقد نشأ فهو ناشئ ، والجمع ناشئة .وقال ابن أبي مليكة : سألت ابن عباس وابن الزبير عنها فقالا الليل كله ناشئة وقال سعيد بن جبير وابن زيد : أي : ساعة قام من الليل فقد نشأ وهو بلسان الحبش [ القيام يقال ] نشأ فلان أي : قام .وقالت عائشة : الناشئة القيام بعد النوم .وقال ابن كيسان : هي القيام من آخر الليل .وقال عكرمة : هي القيام من أول الليل .روي عن علي بن الحسين أنه كان يصلي بين المغرب والعشاء ، ويقول : هذه ناشئة الليل . وقال الحسن : كل صلاة بعد العشاء الآخرة فهي ناشئة من الليل .وقال الأزهري : \" ناشئة الليل \" قيام الليل ، مصدر جاء على فاعلة كالعافية بمعنى العفو .( هي أشد وطئا ) قرأ ابن عامر [ وأبو عمرو ] وطاء بكسر الواو ممدودا بمعنى المواطأة والموافقة ، يقال : واطأت فلانا مواطأة ووطئا ، إذا وافقته ، وذلك أن مواطأة القلب والسمع والبصر واللسان بالليل تكون أكثر مما يكون بالنهار .وقرأ الآخرون : [ وطئا ] بفتح الواو وسكون الطاء ، أي : أشد على المصلي وأثقل من صلاة النهار لأن الليل للنوم والراحة ، ومنه قوله - صلى الله عليه وسلم - : \" اللهم اشدد وطأتك على مضر \" .وقال ابن عباس : كانت صلاتهم أول الليل هي أشد وطئا يقول هي أجدر أن تحصوا ما فرض الله عليكم من القيام ، وذلك أن الإنسان إذا نام لم يدر متى يستيقظ .وقال قتادة : أثبت في الخير وأحفظ للقراءة .وقال الفراء : أثبت قياما أي : أوطأ للقيام وأسهل للمصلي من ساعات النهار لأن النهار خلق لتصرف العباد ، والليل للخلوة فالعبادة فيه أسهل . وقيل : أشد نشاطا .وقال ابن زيد : أفرغ له قلبا من النهار لأنه لا تعرض له حوائج .وقال الحسن : أشد وطئا للخير وأمنع من الشيطان .( وأقوم قيلا ) وأصوب قراءة وأصح قولا لهدأة الناس وسكون الأصوات .وقال الكلبي : أبين قولا بالقرآن .وفي الجملة : عبادة الليل أشد نشاطا وأتم إخلاصا وأكثر بركة وأبلغ في الثواب [ من عبادة النهار ] .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5481.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5481.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5481.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا","transliteration":"Inna laka fin nahaari sabhan taweelaa","translations":{"en.ahmedali":"Indeed during the day you have a long schedule of occupations.","en.ahmedraza":"Indeed you have a lot of matters during the day.","en.arberry":"surely in the day thou hast long business.","en.asad":"whereas by day a long chain of doings is thy portion.","en.daryabadi":"Verily there is for thee by day occupation prolonged.","en.hilali":"Verily, there is for you by day prolonged occupation with ordinary duties,","en.pickthall":"Lo! thou hast by day a chain of business.","en.qaribullah":"You have by day prolonged occupations.","en.sahih":"Indeed, for you by day is prolonged occupation.","en.sarwar":"During the day, you are preoccupied with many activities.","en.yusufali":"True, there is for thee by day prolonged occupation with ordinary duties:","en.maududi":"You are indeed much occupied during the day with the affairs of the world.","en.shakir":"Surely you have in the day time a long occupation.","en.itani":"In the daytime, you have lengthy work to do.","en.mubarakpuri":"Verily, for you in the day is lengthy Sabh.","en.qarai":"for indeed during the day you have drawn-out engagements.","en.wahiduddin":"You have by day prolonged occupations [with Dawah work]."},"tafsir":{"ar.muyassar":"إن لك في النهار تصرفًا وتقلبًا في مصالحك، واشتغالا واسعًا بأمور الرسالة، ففرِّغْ نفسك ليلا لعبادة ربك.","ar.jalalayn":"«إن لك في النهار سبحا طويلا» تصرفا في إشغالك لا تفرغ فيه لتلاوة القرآن.","ar.qurtubi":"قوله تعالى : إن لك في النهار سبحا طويلا قراءة العامة بالحاء غير معجمة ; أي تصرفا في حوائجك ، وإقبالا وإدبارا وذهابا ومجيئا .والسبح : الجري والدوران ، ومنه السابح في الماء ; لتقلبه بيديه ورجليه . وفرس سابح : شديد الجري ; قال امرؤ القيس :مسح إذا ما السابحات على الونى     أثرن الغبار بالكديد المركلوقيل : السبح الفراغ ; أي إن لك فراغا للحاجات بالنهار .وقيل : إن لك في النهار سبحا أي نوما ، والتسبح التمدد ; ذكره الخليل .وعن ابن عباس وعطاء : سبحا طويلا يعني فراغا طويلا لنومك وراحتك ، فاجعل ناشئة الليل لعبادتك ، وقال الزجاج : إن فاتك في الليل شيء فلك في النهار فراغ الاستدراك .وقرأ يحيى بن يعمر وأبو وائل ( سبخا ) بالخاء المعجمة . قال المهدوي : ومعناه النوم ، روي ذلك عن القارئين بهذه القراءة . وقيل : معناه الخفة والسعة والاستراحة ; ومنه قول [ ص: 41 ] النبي - صلى الله عليه وسلم - لعائشة وقد دعت على سارق ردائها : \" لا تسبخي عنه بدعائك عليه \" . أي لا تخففي عنه إثمه ; قال الشاعر :فسبخ عليك الهم واعلم بأنه     إذا قدر الرحمن شيئا فكائنالأصمعي : يقال سبخ الله عنك الحمى أي خففها . وسبخ الحر : فتر وخف . والتسبيخ النوم الشديد . والتسبيخ أيضا توسيع القطن والكتان والصوف وتنفيشها ; يقال للمرأة : سبخي قطنك . والسبيخ من القطن ما يسبخ بعد الندف ، أي يلف لتغزله المرأة ، والقطعة منه سبيخة ، وكذلك من الصوف والوبر . ويقال لقطع القطن سبائخ ; قال الأخطل يصف القناص والكلاب :فأرسلوهن يذرين التراب كما     يذري سبائخ قطن ندف أوتاروقال ثعلب : السبخ بالخاء التردد والاضطراب ، والسبخ أيضا السكون ; ومنه قول النبي - صلى الله عليه وسلم - : الحمى من فيح جهنم ، فسبخوها بالماء أي سكنوها . وقال أبو عمرو : السبخ : النوم والفراغ .قلت : فعلى هذا يكون من الأضداد وتكون بمعنى السبح ، بالحاء غير المعجمة .\n","ar.miqbas":"إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا (7)فصل هذه الجملة دون عطف على ما قبلها يقتضي أن مضمونها ليس من جنس حكم ما قبلها ، فليس المقصود تعيين صلاة النهار إذ لم تكن الصلوات الخمس قد فرضت يومئذٍ على المشهور ، ولم يفرض حينئذٍ إلاّ قيام الليل .فالذي يبدو أن موقع هذه الجملة موقع العلة لشيء مما في جملة { إن ناشئة الليل هي أشد وطأً وأقوم قيلاً } [ المزمل : 6 ] وذلك دائر : بين أن يكون تعليلاً لاختيار الليل لفرض القيام عليه فِيه ، فيفيد تأكيداً للمحافظة على قيام الليل لأن النهار لا يغني غَناءه فيتحصل من المعنى : قم الليل لأن قيامه أشد وقعاً وأرسخ قولاً ، لأن النهار زمن فيه شغل عظيم لا يترك لك خلوة بنفسك . وشغل النبي صلى الله عليه وسلم في النهار بالدعوة إلى الله وإبلاغ القرآن وتعليم الدين ومحاجة المشركين وافتقادَ المؤمنين المستضعفين ، فعبر عن جميع ذلك بالسبح الطويل ، وبيْن أن يكون تلطفاً واعتذاراً عن تكليفه بقيام الليل ، وفيه إرشاد إلى أن النهار ظرف واسع لإِيقاع ما عسى أن يكلفه فيامُ الليل من فتور بالنهار لينام بعض النهار وليقوم بمهامه فيه .ويجوز أن يكون تعليلاً لما تضمنه { أو انقص منه قليلاً } [ المزمل : 3 ] ، أي إن نقصتَ من نصف الليل شيئاً لا يَفُتْكَ ثواب عمله ، فإن لك في النهار متسعاً للقيام والتلاوة مثل قوله تعالى : { وهو الذي جعل الليلَ والنهارَ خلفة لمن أراد أن يذَّكَّر أو أراد شُكوراً } [ الفرقان : 62 ] .وقد ثبت أن النبي صلى الله عليه وسلم كان يصلي في النهار من أول البعثة قبل فرض الصلوات الخمس كما دل عليه قوله تعالى : { أرأيت الذي ينهى عبداً إذا صلّى } [ العلق : 9 ، 10 ] . وقد تقدم في سورة الجن أن استماعهم القرآن كان في صلاة النبي صلى الله عليه وسلم بأصحابه في نخلة في طريقهم إلى عكاظ . ويظهر أن يكون كل هذا مقصوداً لأنه مما تسمح به دلالة كلمة { سبحاً طويلاً } وهي من بليغ الإِيجاز .والسبح : أصله العوم ، أي السلوك بالجسم في ماء كثير ، وهو مستعار هنا للتصرف السهل المتسع الذي يشبه حركة السابح في الماء فإنه لا يعترضه ما يعوق جولانه على وجه الماء ولا إعياءُ السير في الأرض .وقريب من هذه الاستعارة استعارة السبح لجري الفرس دون كلفة في وصف امرىء القيس الخيل بالسابحات في قوله في مَدح فرسه :مُسحَ إذا ما السابحات على الوَنى ... أثْرْنَ الغُبار في الكَديد المركَّلفعبر عن الجاريات بالسابحات .وفسر ابن عباس السبح بالفراغ ، أي لينام في النهار ، وقال ابن وهب عن ابن زيد قال : فراغاً طويلاً لحوائجك فافرغ لدينك بالليل .والطويل : وصف من الطول ، وهو ازدياد امتداد القامة أو الطريق أو الثوب على مقاديرِ أكثرِ أمثاله . فالطول من صفات الذوات ، وشاع وصف الزمان به يقال : ليل طويل وفي الحديث « الشتاء ربيع المؤمن قصر نهاره فصامه وطال ليله فقامه »وأما وصف السَّبح ب ( طويل ) في هذه الآية فهو مجاز عقلي لأن الطويل هو مكان السبح وهو الماء المسبوح فيه . وبعدَ هذا ففي قوله { طويلاً } ترشيح لاستعارة السَّبح للعمل في النهار .\n","ar.waseet":"وقوله - سبحانه - ( إِنَّ لَكَ فِي النهار سَبْحَاً طَوِيلاً ) تقرير للأمر بقيام الليل إلا قليلا منه للعبادة والطاعة والتقرب إليه - سبحانه - .والسبح : مصدر سبح ، وأصله الذهاب فى الماء والتقلب فيه ثم استعير للتقلب والتصرف المتسع ، الذى يشبه حركة السابع فى الماء .أى : إنا أمرناك بقيام الليل للعبادة والطاعة ، لأن لك فى النهار - أيها الرسول الكريم - تقلبا وتصرفا فى مهماتك ، واشتغالا بأعباء الرسالة يجعلك لا تستطيع التفرغ لعبادتنا ، أما فى الليل فتستطيع ذلك لأنه وقت السكون والراحة والنوم .فالمقصود من الآية الكريمة التخفيف والتيسير عليه صلى الله عليه وسلم وبيان الحكمة من أمره بقيام الليل - إلا قليلا منه - للعبادة ، حيث لم يجمع - سبحانه - عليه الأمر بالتهجد فى الليل والنهار ، وإنما يسر عليه الأمر ، فجعله بالليل فحسب ، أما النهار فهو لمطالب الحياة : ولتبليغ رسالته - سبحانه - إلى الناس .\n","ar.baghawi":"( إن لك في النهار سبحا طويلا ) أي : تصرفا وتقلبا وإقبالا وإدبارا في حوائجك وأشغالك ، وأصل \" السبح \" سرعة الذهاب ، ومنه السباحة في الماء وقيل : \" سبحا طويلا \" أي : فراغا وسعة لنومك وتصرفك في حوائجك فصل من الليل .وقرأ يحيى بن يعمر \" سبخا \" بالخاء المعجمة أي : استراحة وتخفيفا للبدن ، ومنه قول النبي - صلى الله عليه وسلم - لعائشة ، وقد دعت على سارق : \" لا تسبخي عنه بدعائك عليه \" [ أي : لا تخففي ] .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5482.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5482.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5482.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا","transliteration":"Wazkuris ma rabbika wa tabattal ilaihi tabteelaa","translations":{"en.ahmedali":"But recite the name of your Lord withdrawing yourself from everything, devoting yourself exclusively to Him.","en.ahmedraza":"And remember the name of your Lord and, leaving others, devote yourself solely to Him.","en.arberry":"And remember the Name of thy Lord, and devote thyself unto Him very devoutly.","en.asad":"But [whether by night or by day,] remember thy Sustainer's name, and devote thyself unto Him with utter devotion.","en.daryabadi":"And remember thou the name of thy Lord, and devote thyself to Him with an exclusive devotion.","en.hilali":"And remember the Name of your Lord and devote yourself to Him with a complete devotion.","en.pickthall":"So remember the name of thy Lord and devote thyself with a complete devotion -","en.qaribullah":"Remember the Name of your Lord and dedicate yourself devoutly to Him.","en.sahih":"And remember the name of your Lord and devote yourself to Him with [complete] devotion.","en.sarwar":"Glorify the Name of your Lord, the Lord of the eastern and western regions, with due sincerity.","en.yusufali":"But keep in remembrance the name of thy Lord and devote thyself to Him whole-heartedly.","en.maududi":"So remember the name of your Lord and devote yourself to Him with exclusive devotion.","en.shakir":"And remember the name of your Lord and devote yourself to Him with (exclusive) devotion.","en.itani":"So remember the Name of your Lord, and devote yourself to Him wholeheartedly.","en.mubarakpuri":"And remember the Name of your Lord and (Tabattil) devote yourself to Him with complete devotion.","en.qarai":"So celebrate the Name of your Lord and dedicate yourself to Him with total dedication.","en.wahiduddin":"Remember the name of your Lord, and devote yourself to Him wholeheartedly."},"tafsir":{"ar.muyassar":"واذكر -أيها النبي- اسم ربك، فادعه به، وانقطع إليه انقطاعًا تامًا في عبادتك، وتوكل عليه. هو مالك المشرق والمغرب لا معبود بحق إلا هو، فاعتمد عليه، وفوِّض أمورك إليه.","ar.jalalayn":"«واذكر اسم ربك» أي قل بسم الله الرحمن الرحيم في ابتداء قراءتك «وتبتل» انقطع «إليه تبتيلا» مصدر بتلَ جيء به رعاية للفواصل وهو ملزوم التبتل.","ar.qurtubi":"قوله تعالى : واذكر اسم ربك وتبتل إليه تبتيلافيه ثلاث مسائل :الأولى : قوله تعالى : واذكر اسم ربك أي ادعه بأسمائه الحسنى ، ليحصل لك مع الصلاة محمود العاقبة . وقيل : أي اقصد بعملك وجه ربك ، وقال سهل : اقرأ باسم الله الرحمن الرحيم في ابتداء صلاتك توصلك بركة قراءتها إلى ربك ، وتقطعك عما سواه . وقيل : اذكر اسم ربك في وعده ووعيده ، لتوفر على طاعته وتعدل عن معصيته . وقال الكلبي : صل لربك أي بالنهار .[ ص: 42 ] قلت : وهذا حسن فإنه لما ذكر الليل ذكر النهار ; إذ هو قسيمه ; وقد قال الله تعالى : وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر على ما تقدم .الثانية : قوله تعالى : وتبتل إليه تبتيلا التبتل : الانقطاع إلى عبادة الله - عز وجل - ; أي انقطع بعبادتك إليه ، ولا تشرك به غيره . يقال : بتلت الشيء أي قطعته ، ومنه قولهم : طلقها بتة بتلة ، وهذه صدقة بتة بتلة ; أي بائنة منقطعة عن صاحبها ، أي قطع ملكه عنها بالكلية ; ومنه مريم البتول لانقطاعها إلى الله تعالى ، ويقال للراهب متبتل ; لانقطاعه عن الناس ، وانفراده بالعبادة ، قال :تضيء الظلام بالعشاء كأنها منارة ممسى راهب متبتلوفي الحديث النهي عن التبتل ، وهو الانقطاع عن الناس والجماعات . وقيل : إن أصله عند العرب التفرد ; قاله ابن عرفة . والأول أقوى لما ذكرنا . ويقال : كيف قال : تبتيلا ، ولم يقل تبتلا ؟ قيل له : لأن معنى تبتل بتل نفسه ، فجيء به على معناه مراعاة لحق الفواصل .الثالثة : قد مضى في ( المائدة ) في تفسير قوله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم كراهة لمن تبتل وانقطع وسلك سبيل الرهبانية بما فيه كفاية . قال ابن العربي : وأما اليوم وقد مرجت عهود الناس ، وخفت أماناتهم ، واستولى الحرام على الحطام ، فالعزلة خير من الخلطة ، والعزبة أفضل من التأهل ، ولكن معنى الآية : انقطع عن الأوثان والأصنام وعن عبادة غير الله ، وكذلك قال مجاهد : معناه : أخلص له العبادة ، ولم يرد التبتل ، فصار التبتل مأمورا به في القرآن ، منهيا عنه في السنة ، ومتعلق الأمر غير متعلق النهي ; فلا يتناقضان ، وإنما بعث ليبين للناس ما نزل إليهم ; فالتبتل المأمور به : الانقطاع إلى الله بإخلاص العبادة ; كما قال تعالى : وما أمروا إلا ليعبدوا الله مخلصين له الدين والتبتل المنهي عنه : هو سلوك مسلك النصارى في ترك النكاح والترهب في الصوامع ، لكن عند فساد الزمان يكون خير مال المسلم غنما يتبع بها شعف الجبال ومواقع القطر ، يفر بدينه من الفتن .\n","ar.miqbas":"وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا (8) عطف على { قم الليل } [ المزمل : 2 ] وقصد بإطلاق الأمر عن تعيين زمان إلى إفادة تعميمه ، أي اذكر اسم ربك في الليل وفي النهار كقوله : { واذكر اسم ربك بكرة وأصيلاً } [ الإنسان : 25 ] .وإقحام كلمة { اسم } لأن المأمور به ذكر اللسان وهو جامع للتذكر بالعقل لأن الألفاظ تجري على حسب ما في النفس ، ألا ترى إلى قوله تعالى : { واذكر ربك في نفسك تضرعاً وخيفة ودون الجهر من القول } [ الأعراف : 205 ] .والتبتل : شدة البتل ، وهو مصدر تبتّل القاصر الذي هو مطاوع بَتَّله ف { تبتل } وهو هنا للمطاوعة المجازية يقصد من صيغتها المبالغة في حصول الفعل حتّى كأنه فعله غيره به فَطاوعه ، والتبتل : الانقطاع وهو هنا انقطاع مجازي ، أي تفرغ البال والفكر إلى ما يرضي الله ، فكأنه انقطع عن الناس وانحاز إلى جانب الله فعدي ب «إلى» الدالة على الانتهاء ، قال امرؤ القيس :منارة مُمْسى راهب متَبَتِّل ... والتبتيل : مصدر بتَّل المشدد الذي هو فعل متعد مثل التّقطيع .وجيء بهذا المصدر عوضاً عن التبتل للإِشارة إلى أن حُصول التبتل ، أي الانقطاع يقتضي التبتيل أي القطْع . ولما كان التبتيل قائماً بالمتبتل تعين أن تبتيله قطعه نفسه عن غير من تبتل هو إليه فالمقطوع عنه هنا هو من عدا الله تعالى فالجمع بين { تبتل } و { تبتيلاً } مشير إلى إراضة النفس على ذلك التبتل . وفيه مع ذلك وفاء بِرعي الفواصل التي قبله .والمراد بالانقطاع المأمور به انقطاع خاص وهو الانقطاع عن الأعمال التي تمنعه من قيام الليل ومهام النهار في نشر الدعوة ومحاجّة المشركين ولذلك قيل { وتبتل إليه } أي إلى الله فكل عمل يقوم به النبي صلى الله عليه وسلم من أعمال الحياة فهو لدين الله فإن طعامه وشرابه ونومه وشؤونه للاستعانة على نشر دين الله . وكذلك منعشات الروح البريئة من الإِثم مثل الطِّيب ، وتزوج النساء ، والأنس إلى أهله وأبنائه وذويه ، وقد قال : «حُبّب إليّ من دنياكم النساء والطيب» .وليس هو التبتل المفضي إلى الرهبانية وهو الإِعراض عن النساء وعن تدبير أمور الحياة لأن ذلك لا يلاقي صفة الرسالة .وفي حديث سعْد في «الصحيح» «ردّ رسول الله على عثمان بن مظعون التبتل ولو أذِن له لاختصينا» يعني ردّ عليه استشارته في الإِعراض عن النساء .\n","ar.waseet":"ثم أمره - سبحانه - بعد ذلك بالمداومة على ذكره ليلا ونهارا فقال : ( واذكر اسم رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلاً . رَّبُّ المشرق والمغرب لاَ إله إِلاَّ هُوَ فاتخذه وَكِيلاً ) .وقوله - سبحانه - ( وَتَبَتَّلْ ) من التبتل ، وهو الاشتغال الدائم بعبادة الله - تعالى - ، والانقطاع لطاعته . ومنه قولهم بتل فلان الحبل ، إذا قطعه ، وارمأة بتول .أى : منقطعة عن الزواج ، ومتفرغة لعبادة الله - تعالى -والمراد به هنا : التفرغ لما يرضى الله - تعالى - ، والاشتغال بذلك عن كل شئ سواه .أى : ودوام - أيها الرسول الكريم - على ذكر الله - تعالى - عن طريق تسبيحه ، وتحميده وتكبيره ، وتفرغ لعبادته وطاعته تفرغا تاما ، دون أن يشغلك عن ذلك شاغل .\n","ar.baghawi":"( واذكر اسم ربك ) بالتوحيد والتعظيم ( وتبتل إليه تبتيلا ) قال ابن عباس وغيره : أخلص إليه إخلاصا . وقال الحسن : اجتهد . وقال ابن زيد : تفرغ لعبادته . قال سفيان : توكل عليه توكلا . وقيل : انقطع إليه في العبادة انقطاعا وهو الأصل في الباب ، يقال : تبتلت الشيء أي : قطعته وصدقة بتة : أي : مقطوعة عن صاحبها لا سبيل له عليها والتبتيل : [ التقطيع ] تفعيل منه يقال : بتلته فتبتل ، والمعنى : بتل نفسك إليه ، ولذلك قال : تبتيلا . قال زيد بن أسلم : التبتل رفض الدنيا وما فيها والتماس ما عند الله تعالى .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5483.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5483.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5483.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَٰهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا","transliteration":"Rabbul mashriqi wal maghriibi laaa ilaaha illaa Huwa fattakhizhu wakeelaa","translations":{"en.ahmedali":"He is the Lord of the East and the West. There is no god but He. So take Him alone as your protector.","en.ahmedraza":"Lord of the East and Lord of the West – there is no God except Him, therefore make Him your sole Trustee of affairs.","en.arberry":"Lord of the East and the West; there is no god but He; so take Him for a Guardian.","en.asad":"The Sustainer of the east and the west [is He]: there is no deity save Him: hence, ascribe to Him alone the power to determine thy fate,","en.daryabadi":"Lord of the east and the west! No God is there but He! Wherefore take Him for thy trustee.","en.hilali":"(He Alone is) the Lord of the east and the west, La ilaha illa Huwa (none has the right to be worshipped but He). So take Him Alone as Wakil (Disposer of your affairs).","en.pickthall":"Lord of the East and the West; there is no Allah save Him; so choose thou Him alone for thy defender -","en.qaribullah":"He is the Lord of the East and the West; there is no god except Him. Take Him for your Guardian.","en.sahih":"[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.","en.sarwar":"He is the only Lord, so choose Him as your guardian.","en.yusufali":"(He is) Lord of the East and the West: there is no god but He: take Him therefore for (thy) Disposer of Affairs.","en.maududi":"He is the Lord of the East and the West; there is no god but He. So take Him alone for your Guardian,","en.shakir":"The Lord of the East and the West-- there is no god but He-- therefore take Him for a protector.","en.itani":"Lord of the East and the West. There is no god but He, so take Him as a Trustee.","en.mubarakpuri":"Lord of the east and the west; La ilaha illa Huwa, so take Him as a trustee.","en.qarai":"Lord of the east and the west, there is no god except Him; so take Him for your trustee,","en.wahiduddin":"He is the Lord of the east and the west, there is no deity but Him, so take Him as your Guardian."},"tafsir":{"ar.muyassar":"واذكر -أيها النبي- اسم ربك، فادعه به، وانقطع إليه انقطاعًا تامًا في عبادتك، وتوكل عليه. هو مالك المشرق والمغرب لا معبود بحق إلا هو، فاعتمد عليه، وفوِّض أمورك إليه.","ar.jalalayn":"هو «ربُّ المشرق والمغرب لا إله إلا هو فاتخذه وكيلا» موكلا له أمورك.","ar.qurtubi":"قوله تعالى : رب المشرق والمغرب قرأ أهل الحرمين وابن محيصن ومجاهد وأبو [ ص: 43 ] عمرو وابن أبي إسحاق وحفص رب بالرفع على الابتداء والخبر لا إله إلا هو . وقيل : على إضمار ( هو ) . الباقون ( رب ) بالخفض على نعت الرب تعالى في قوله تعالى : واذكر اسم ربك رب المشرق ومن علم أنه رب المشارق والمغارب انقطع بعمله وأمله إليه .فاتخذه وكيلا أي قائما بأمورك . وقيل : كفيلا بما وعدك .\n","ar.miqbas":"رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا (9)ومن أكبر التبتل إلى الله الانقطاع عن الإِشراك ، وهو معنى الحنيفيّة ، ولذلك عقب قوله : { وتبتل إليه تبتيلاً } بقوله : { ربّ المشرق والمغرب لا إله إلاّ هو } .وخلاصة المعنى : أن النبي صلى الله عليه وسلم مأمور أن لا تخلو أوقاته عن إقبال على عبادة الله ومراقبته والانقطاع للدعوة لدين الحق ، وإذ قد كان النبي صلى الله عليه وسلم من قبلُ غير غافل عن هذا الانقطاع بإرشاد من الله كما ألهمه التحنّث في غار حراء ثم بما أفاضه عليه من الوحي والرسالة .فالأمر في قوله : { واذكر اسم ربّك وتبتّل إليه } مراد به الدوام على ذلك فإنه قد كان يذكر الله فيما قبل فإن في سورة القلم ( 51 ) ( وقد نزلت قبل المزمل ) { وإن يكاد الذين كفروا ليزلقونك بأبصارهم لما سمعوا الذكر } على أن القرآن الذي أنزل أولاً أكثره إرشاد للنبي صلى الله عليه وسلم إلى طرائق دعوة الرسالة فلذلك كان غالب ما في هذه السورِ الأوللِ منه مقتصراً على سَن التكاليف الخاصة بالرسول صلى الله عليه وسلمووصف الله بأنه { ربّ المشرق والمغرب } لمناسبة الأمر بذكره في الليل وذكرِه في النهار وهما وقتا ابتداء غياب الشمس وطلوعها ، وذلك يشعر بامتداد كل زمان منهما إلى أن يأتي ضده؛ فيصح أن يكون المشرق والمغرب جهتي الشروق والغروب ، فيكون لاستيعاب جهات الأرض ، أي رب جميع العالم وذلك يشعر بوقتي الشروق والغروب .ويصح أن يراد بهما وقتا الشروق والغروب ، أي مبدأ ذينك الوقتين ومُنتهاهما ، كما يقال : سبحوا لله كلَّ مشرق شمس ، وكما يقال : صلاة المغرب .وقرأ نافع وابن كثير وأبو عمرو وحفص عن عاصم وأبو جعفر برفع { ربُّ } على أنه خبر لمبتدأ محذوف حذفاً جرى على الاستعمال في مثله مما يسبق في الكلام حديث عنه . ثم أريد الإِخبار عنه بخبر جامع لصفاته ، وهو من قبيل النعت المقطوع المرفوع بتقدير مبتدأ . وقرأه ابن عامر وحمزة والكسائي وأبو بكر عن عاصم ويعقوب وخلف بخفض { ربِّ } على البدل من { ربِّك } .وعُقِّب وصفُ الله ب { رب المشرق والمغرب ، } بالإِخبار عنه أو بوصفه بأنه لا إله إلاّ هو لأن تفرده بالإلهية بمنزلة النتيجة لربوبية المشرق والمغرب فلما كانت ربُوبيته للعالم لا ينازع فيها المشركون أعقبت بما يقتضي إبطال دعوى المشركين تعدد الآلهة بقوله : { لا إله إلاّ هو } تعريضاً بهم في أثناء الكلام وإن كان الكلام مسوقاً إلى النبي صلى الله عليه وسلم ولذلك فرع عليه قوله : { فاتخذه وكيلاً ، } وإذ كان الأمر باتخاذ وكيلاً مسبباً عن كونه لا إله إلاّ هو كان ذلك في قوة النهي عن اتخاذ وكيل غيره ، إذ ليس غيره بأهل لاتخاذه وكيلاً .والوكيل : الذي يُوكَل إليه الأمور ، أي يُفوض إلى تصرفه ، ومن أهم التفويض أمر الانتصار لمن توكل عليه ، فإن النبي صلى الله عليه وسلم لما بلغه قول المشركين فيه اغتم لذلك ، وقد روي أن ذلك سبب تزمله من مَوْجدة الحزن فأمره الله بأن لا يعتمد إلاّ عليه ، وهذا تكفل بالنصر ولذلك عقب بقوله : { واصبر على ما يقولون } [ المزمل : 10 ] .\n","ar.waseet":"فربك - عز وجل - هو ( رَّبُّ المشرق والمغرب ) . أى : هو - سبحانه - رب جهتى الشروق والغروب للشمس .( لاَ إله إِلاَّ هُوَ ) مستحق للعبادة والطاعة ، وما دام الأمر كذلك ( فاتخذه وَكِيلاً ) .أى : فاتخذه وكيلك الذى تفوض إليه أمرك ، وتلجأ إليه فى كل أحوالك . . إذ الوكيل هو الذى توكل إليه الأمور ، ويترك له التصرف فيها .وليس المراد بقوله - تعالى - : ( واذكر اسم رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلاً ) الانقطاع التام عن الأعمال ، لأن هذا يتنافى مع قوله - تعالى - قبل ذلك : ( إِنَّ لَكَ فِي النهار سَبْحَاً طَوِيلاً ) وإنما المراد التنبيه إلى أنه صلى الله عليه وسلم ينبغى له أن لا يشغله السبح الطويل بالنهار ، عن طاعته - عز وجل - وعن المداومة على مراقبته وذكره .ومما لا شك فيه أن ما كان يقوم به النبى صلى الله عليه وسلم من الاشتغال بأمر الدعوة إلى وحدانية الله - تعالى - ، ومن تعليم الناس العلم النافع ، والعمل الصالح . . كل ذلك يندرج تحت المواظبة على ذكر الله - تعالى - ، وعلى التفرغ لعبادته .وقال - سبحانه - ( وَتَبَتَّلْ إِلَيْهِ تَبْتِيلاً ) ولم يقل تبتلا حتى يكون الفعل موافقا لمصدره ، للإِشارة إلى أن التبتل والانقطاع إلى الله يحتاجان إلى عمل اختيارى منه صلى الله عليه وسلم ، بأن يجرد نفسه عن كل ما سوى الله - تعالى - ، وبذلك يحصل التبتل الذى هو أثر للتبتيل ، بمعنى ترويض النفس وتعويدها على العبادة والطاعة .ووصف - سبحانه - ذاته بأنه ( رَّبُّ المشرق والمغرب ) ، لمناسبة الأمر بذكره فى الليل والنهار ، وهما وقت ابتداء طلوع الشمس وغروبها ، فكأنه - سبحانه - يقول : داوم على طاعتى لأنى أنا رب جميع جهات الأرض ، التى فيها تشرق الشمس وتغرب .والمراد بالمشرق والمغرب هنا جنسهما ، فهما صادقان على كل مشرق من مشارق الشمس ، التى هى ثلاثمائة وستون مشرقا - كما يقول العلماء - وعلى كل مغرب من مغاربها التى هى كذلك .والمراد بالمشرقين والمغربين كما جاء فى سورة الرحمن : مشرق ومغرب الشتاء والصيف .والمراد بالمشارق والمغارب كما جاء فى سورة المعارج : مشرق ومغرب كل يوم للشمس والكواكب .\n","ar.baghawi":"\"رب المشرق والمغرب\"، قرأ أهل الحجاز، وأبو عمرو، وحفص: \"رب\" برفع الباء الابتداء، وقرأ الآخرون بالجر على نعت الرب في قوله: \"واذكر اسم ربك\". \"لا إله إلا هو فاتخذه وكيلاً\"، قيماً بأمورك ففوضها إليه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5484.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5484.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5484.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا","transliteration":"Wasbir 'alaa maa yaqoo loona wahjurhum hajran jameelaa","translations":{"en.ahmedali":"Bear with patience what they say, and gracefully come away from them.","en.ahmedraza":"And patiently endure upon what the disbelievers say, and leave them for good.","en.arberry":"And bear thou patiently what they say, and forsake them graciously.","en.asad":"and endure with patience whatever people may say [against thee], and avoid them with a comely avoidance.","en.daryabadi":"And bear thou with patience whatsoever they say, and depart from them with a becoming departure.","en.hilali":"And be patient (O Muhammad SAW) with what they say, and keep away from them in a good way.","en.pickthall":"And bear with patience what they utter, and part from them with a fair leave-taking.","en.qaribullah":"Bear patiently with what they say and with a fine abandonment forsake them.","en.sahih":"And be patient over what they say and avoid them with gracious avoidance.","en.sarwar":"Bear patiently whatever they say, do not yield to them and keep on preaching decently to them.","en.yusufali":"And have patience with what they say, and leave them with noble (dignity).","en.maududi":"And bear patiently the vain things they utter, and gracefully forsake them.","en.shakir":"And bear patiently what they say and avoid them with a becoming avoidance.","en.itani":"And endure patiently what they say, and withdraw from them politely.","en.mubarakpuri":"And be patient with what they say, and keep away from them in a good way.","en.qarai":"and be patient over what they say, and distance yourself from them in a graceful manner.","en.wahiduddin":"Bear patiently with what they say, and ignore them politely."},"tafsir":{"ar.muyassar":"واصبر على ما يقوله المشركون فيك وفي دينك، وخالفهم في أفعالهم الباطلة، مع الإعراض عنهم، وترك الانتقام منهم.","ar.jalalayn":"«واصبر على ما يقولون» أي كفار مكة من أذاهم «واهجرهم هجرا جميلا» لا جزع فيه وهذا قبل الأمر بقتالهم.","ar.qurtubi":"قوله تعالى : واصبر على ما يقولون أي من الأذى والسب والاستهزاء ، ولا تجزع من قولهم ، ولا تمتنع من دعائهم .واهجرهم هجرا جميلا أي لا تتعرض لهم ، ولا تشتغل بمكافأتهم ، فإن في ذلك ترك الدعاء إلى الله . وكان هذا قبل الأمر بالقتال ، ثم أمر بعد بقتالهم وقتلهم ، فنسخت آية القتال ما كان قبلها من الترك ; قاله قتادة وغيره . وقال أبو الدرداء : إنا لنكشر في وجوه أقوام ونضحك إليهم وإن قلوبنا لتقليهم أو لتلعنهم .\n","ar.miqbas":"وَاصْبِرْ عَلَى مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا (10)عطف على قوله : { فاتخذه وكيلاً } [ المزمل : 9 ] ، والمناسبة أن الصبر على الأذى يستعان عليه بالتوكل على الله .وضمير { يقولون } عائد إلى المشركين ، ولم يتقدم له معاد فهو من الضمائر التي استُغني عن ذكر معادها بأنه معلوم للسامعين كما تقدم غير مرة ، ومن ذلك عند قوله تعالى : { وأن لو استقاموا على الطريقة } [ الجن : 16 ] الآيات من سورة { قل أوحى إليّ } [ الجن : 1 ] ، ولأنه سيأتي عقبه قوله { وذَرْني والمكذبين } [ المزمل : 11 ] فيبين المراد من الضمير .وقد مضى في السور التي نزلت قبل سورة المزمل مقالات أذى من المشركين لرسول الله صلى الله عليه وسلم ففي سورة العلق ( 9 ، 10 ) { أرأيت الذي ينهَى عبداً إذا صلى } قيل هو أبو جهل تهدّد رسول الله لئن صلى في المسجد الحرام ليَفْعَلَنّ ويفعلَنّ . وفيها : { إِن الإِنسان ليطغى أن رءاه استغنى } [ العلق : 6 ، 7 ] . قيل هو الأخنس بن شريق «تنكَّر لرسول الله صلى الله عليه وسلم بعد أن كان حليفه» ، وفي سورة القلم ( 2 15 ) { ما أنت بنِعْمة ربّك بمجنون } إلى قوله : { فستبصر ويُبصرون بأيكم المفتون } ، وقوله : { ولا تطِع كلّ حلاّف مهين } إلى قوله : { قال أساطير الأولين } [ القلم : 15 ] ردّاً لمقالاتهم . وفي سورة المدثر ( 11 25 ) إن كانت نزلت قبل سورة المزمل { ذرني ومن خلقت وحيداً } إلى قوله : { إِنْ هذا إلاَّ قول البشر } ، قيل : قائل ذلك الوليد بن المغيرة . فلذلك أمر الله رسوله بالصبر على ما يقولون .والهجر الجميل : هو الحسَن في نوعه ، فإن الأحوال والمعاني منها حسن ومنها قبيح في نوعه وقد يقال : كَريم ، وذميم ، وخالص ، وكدر ، ويَعْرِض الوصف للنوع بما من شأنه أن يقترن به من عوارض تناسب حقيقة النوع فإذا جُردت الحقيقة عن الأعراض التي قد تعتلق بها كان نوعها خالصاً ، وإذا ألصق بالحقيقة ما ليس من خصائصها كان النوع مكدّراً قبيحاً ، وقد أشار إلى هذا قوله تعالى : { لا تبطلوا صدقاتكم بالمنّ والأذى } [ البقرة : 264 ] ، وتقدم عند قوله تعالى : { إنيَ أُلقِيَ إليَّ كتاب كريم } في سورة النمل ( 29 ) ، ومن هذا المعنى قوله : { فصبر جميل } في سورة يوسف ( 18 ) ، وقوله فاصبر صبراً جميلاً في سورة المعارج ( 5 ) .فالهجر الجميل هو الذي يَقتصر صاحبه على حقيقة الهجر ، وهو ترك المخالطة فلا يقرنها بجفاء آخر أو أذى ، ولما كان الهجر ينشأ عن بعض المهجور ، أو كراهية أعماله كان معرَّضاً لأن يعتلق به أذى من سبّ أو ضرب أو نحو ذلك . فأمر الله رسوله بهجر المشركين هجراً جميلاً ، أي أن يهجرهم ولا يزيدَ على هجرهم سَبّاً أو انتقاماً .وهذا الهجر : هو إمساك النبي عن مكافاتهم بمثل ما يقولونه مما أشار إليه قوله تعالى : واصبر على ما يقولون .وليس منسحباً على الدعوة للدين فإنها مستمرة ولكنها تبليغ عن الله تعالى فلا ينسب إلى النبي .وقد انتزع فخر الدين من هذه الآية منزعاً خُلُقياً بأن الله جمع ما يحتاج إليه الإِنسان في مخالطَة الناس في هاتين الكلمتين لأن المرء إما أن يكون مخالطاً فلا بد له من الصبر على أذاهم وإيحاشهم لأنه إن أطمع نفسه بالراحة معهم لم يجدها مستمرة فيقع في الغموم إن لم يَرضْ نفسه بالصبر على أذاهم ، وإن ترك المخالطة فذلك هو الهجر الجميل .\n","ar.waseet":"ثم أمر الله - تعالى - رسوله صلى الله عليه وسلم بعد ذلك بالصبر الجميل ، على أذى قومه فقال : ( واصبر على مَا يَقُولُونَ واهجرهم هَجْراً جَمِيلاً . . . ) .أى : اجعل يا محمد اعتمادك وتوكلك على وحدى ، واصبر على ما يقوله أعداؤك فى حقك من أكاذيب وخرافات . . واهجرهم هجرا جميلا ، أى : واعتزلهم وابتعد عنهم ، وقاطعهم مقاطعة حسنة ، بحيث لا تقابل السيئة يمثلها ، ولا تزد على هجرهم : بأن تسبهم ، أو ترميهم بالقبيح من القول . .قال الإِمام الرازى ما ملخصه : والمعنى أنك لما اتخذتنى وكيلا فاصبر على ما يقولون ، وفوض أمرهم إلى ، فإنى لما كنت وكيلا لك أقوم بإصلاح أمرك ، أحسن من قيامك بإصلاح نفسك .واعلم أن مهمات العباد محصورة فى أمرين : فى كيفية معاملتهم مع الله ، وقد ذكر - سبحانه - ذلك فى الآيات السابقة ، وفى كيفية معاملتهم مع الخلق ، وقد جمع - سبحانه - كل ما يحتاج إليه فى هذا الباب فى هاتين الكلمتين ، وذلك لأن الإِنسان إما أن يكون مخالطا للناس ، أو مجانبا لهم .فإن كان مخالطا لهم فعليه أن يصبر على إيذائهم . . وإما أن يكون مجانبا لهم ، فعليه أن يهجرهم هجرا جميلا . . بأن يجانبهم بقلبه وهواه ، ويخالفهم فى أفعالهم ، مع المداراة والإِغضاء ..\n","ar.baghawi":"\"واصبر على ما يقولون واهجرهم هجراً جميلاً\"، نسختها آية القتال.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5485.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5485.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5485.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا","transliteration":"Wa zarnee walmukaz zibeena ulin na'mati wa mahhilhum qaleelaa","translations":{"en.ahmedali":"Leave those to Me who deny, the lovers of ease and comfort; and bear with them for a while.","en.ahmedraza":"And leave them to Me – these wealthy deniers – and give them some respite.","en.arberry":"Leave Me to those who cry lies, those prosperous ones, and respite them a little,","en.asad":"And leave Me alone [to deal] with those who give the lie to the truth - those who enjoy the blessings of life [without any thought of God] - and bear thou with them for a little while:","en.daryabadi":"And let Me alone with the beliers, owners of ease: and respite thou them a little.","en.hilali":"And leave Me Alone to deal with the beliers (those who deny My Verses, etc.), and those who are in possession of good things of life. And give them respite for a little while.","en.pickthall":"Leave Me to deal with the deniers, lords of ease and comfort (in this life); and do thou respite them awhile.","en.qaribullah":"Leave to Me those who belie, those who lead a life of pleasure, and bear with them yet a little while.","en.sahih":"And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.","en.sarwar":"Leave the prosperous disbelievers to Me and give them respite for a little while;","en.yusufali":"And leave Me (alone to deal with) those in possession of the good things of life, who (yet) deny the Truth; and bear with them for a little while.","en.maududi":"Leave it to Me to deal with the affluent ones who give the lie (to the Truth), and bear with them for a while.","en.shakir":"And leave Me and the rejecters, the possessors of ease and plenty, and respite them a little.","en.itani":"And leave Me to those who deny the truth, those of luxury, and give them a brief respite.","en.mubarakpuri":"And leave Me alone to deal with the deniers, those who are in possession of good things of life. And give them respite for a little.","en.qarai":"Leave Me [to deal] with the deniers, the opulent, and give them a little respite.","en.wahiduddin":"Leave it to Me to deal with the deniers, who live a life of comfort, and bear with them a little longer."},"tafsir":{"ar.muyassar":"دعني -أيها الرسول- وهؤلاء المكذبين بآياتي أصحاب النعيم والترف في الدنيا، ومهِّلهم زمنًا قليلا بتأخير العذاب عنهم حتى يبلغ الكتاب أجله بعذابهم.","ar.jalalayn":"«وذرني» اتركني «والمكذبين» عطف على المفعول معه والمعنى أنا كافيكهم وهم صناديد قريش «أُولي النعمة» التنعم «ومهلهم قليلا» من الزمن فقتلوا بعد يسير منه ببدر.","ar.qurtubi":"قوله تعالى : وذرني والمكذبين أي ارض بي لعقابهم . نزلت في صناديد قريش ورؤساء مكة من المستهزئين . وقال مقاتل : نزلت في المطعمين يوم بدر وهم عشرة . وقد تقدم ذكرهم في ( الأنفال ) . وقال يحيى بن سلام : إنهم بنو المغيرة . وقال سعيد بن جبير أخبرت أنهم اثنا عشر رجلا .أولي النعمة أي أولي الغنى والترفه واللذة في الدنيا ومهلهم قليلا يعني إلى مدة آجالهم . قالت عائشة - رضي الله عنها - : لما نزلت هذه الآية لم يكن إلا يسيرا حتى وقعت وقعة بدر . وقيل : ومهلهم قليلا يعني إلى مدة الدنيا .\n","ar.miqbas":"وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا (11)القول فيه كالقول في { فذرني ومن يكذّب بهذا الحديث } في سورة القلم ( 44 ) ، أي دعني وإياهم ، أي لا تهتم بتكذيبهم ولا تشتغل بتكرير الرد عليهم ولا تغضب ولا تسبهم فأنا أكفيكهم .وانتصب المكذبين } على المفعول معه ، والواو واو المعية .والمكذبون هم من عناهم بضمير { يقولون } و { اهجرهم } [ المزمل : 10 ] ، وهم المكذبون للنبي صلى الله عليه وسلم من أهل مكة ، فهو إظهار في مقام الإِضمار لإِفادة أن التكذيب هو سبب هذا التهديد .ووصَفَهم ب { أولي النَّعمة } توبيخاً لهم بأنهم كذبوا لغرورهم وبطرهم بسعة حالهم ، وتهديداً لهم بأن الذي قال { ذرني والمكذبين } سيزيل عنهم ذلك التنعم .وفي هذا الوصف تعريض بالتهكم ، لأنهم كانوا يعدُّون سعة العيش ووفرة المال كمالاً ، وكانوا يعيّرون الذين آمنوا بالخصاصة قال تعالى : { إن الذين أجرموا كانوا من الذين ءامنوا يضحكون وإذا مروا بهم يتغامزُون الآيات } [ المطففين : 29 ، 30 ] ، وقال تعالى : { والذين كفروا يتمتعون ويأكلون كما تأكل الأنعام } [ محمد : 12 ] .و { النَّعمة } : هنا بفتح النون باتفاق القراء . وهي اسم للترفه ، وجمعها أنعُم بفتح الهمزة وضم العين .وأما النِّعمة بكسر النون فاسم للحالة الملائمة لرغبة الإِنسان من عافية ، وأمن ورزق ، ونحو ذلك من الرغائب . وجمعها : نِعَم بكسر النون وفتح العين ، وتجمع جمع سلامة على نِعمات بكسر النون وبفتح العين لجمهور العرب . وتكسر العين في لغة أهل الحجاز كَسْرَة إِتباع .والنُّعمة بضم النون اسم للمسرّة فيجوز أن تجمع على نُعْم على أنه اسم جمع ، ويجوز أن تجمع على نُعَم بضم ففتح مثل : غرفة وغرف ، وهو مطرد في الوزن .وجعلهم ذوي النَّعمة المفتوحة النون للإِشارة إلى أن قُصارى حظهم في هذه الحياة هي النَعمة ، أي الانطلاق في العيش بلا ضيق ، والاستظلال بالبيوت والجنات ، والإِقبال على لذيذ الطعوم ولذائذ الانبساط إلى النساء والخمر والميسر ، وهم معرضون عن كمالات النفس ولذة الاهتداء والمعرفة قال تعالى : { أم تحسب أن أكثرهم يسمعون أو يعقلون إن هم إلاّ كالأنعام بل هم أضل سبيلاً } [ الفرقان : 44 ] وتعريف { النَّعمة } للعهد .والتمهيل : الإِمهال الشديد ، والإِمهال : التأجيل وتأخير العقوبة ، وهو مترتب في المعنى على قوله : { وذرني والمكذبين } ، أي وانتظر أن ننتصِرْ لك كقوله تعالى : { ولا تستعجل لهم } [ الأحقاف : 35 ] .و { قليلاً } وصف لمصدر محذوف ، أي تمهيلاً قليلاً . وانتصب على المفعول المطلق .\n","ar.waseet":"وقوله - سبحانه - : ( وَذَرْنِي والمكذبين أُوْلِي النعمة وَمَهِّلْهُمْ قَلِيلاً ) أى : ودعنى وشأنى مع هؤلاء المكذبين بالحق ، ولا تهتم أنت بأمرهم ، فأنا خالقهم ، وأنا القادر على كل شئ يتعلق بهم .وقوله : ( أُوْلِي النعمة ) وصف لهم جئ به على سبيل التوبيخ لهم ، والتهكم بهم ، حيث جحدوا نعم الله ، وتوهموا أن هذه النعم من مال أو ولد ستنفعهم يوم القيامة .والنَّعمة - بفتح النون مع التشديد - : تطلق على التنعم والترفه وغضارة والعيش فى الدنيا .وأما النِّعمة - بكسر النون - فاسم للحالات الملائمة لرغبة الإِنسان من غنى أو عافية أو نحوهما .وأما النُّعمة - بالضم - فهى اسم المسرة . يقال : فلان فى نُعْمة - بضم النون - أى : فى فرح وسرور .وقوله : ( وَمَهِّلْهُمْ قَلِيلاً ) أى : واتركهم ودعهم فى باطلهم وقتا قليلا ، فسترى بعد ذلك سوء عاقبة تكذيبهم للحق .\n","ar.baghawi":"\"وذرني والمكذبين أولي النعمة ومهلهم قليلاً\"، نزلت في صناديد قريش المستهزئين. وقال مقاتل بن حيان: نزلت في المطعمين ببدر ولم يكن إلا يسر حتى قتلوا ببدر.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5486.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5486.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5486.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"إِنَّ لَدَيْنَا أَنْكَالًا وَجَحِيمًا","transliteration":"Inna ladainaaa ankaalanw wa jaheemaa","translations":{"en.ahmedali":"Verily We shall have fetters with Us, and a roaring furnace,","en.ahmedraza":"Indeed We have heavy fetters and a blazing fire.","en.arberry":"for with Us there are fetters, and a furnace,","en.asad":"for, behold, heavy fetters [await them] with Us, and a blazing fire,","en.daryabadi":"Verily with us are heavy fetters and Scorch.","en.hilali":"Verily, with Us are fetters (to bind them), and a raging Fire.","en.pickthall":"Lo! with Us are heavy fetters and a raging fire,","en.qaribullah":"We have fetters (for them) and a blazing fire,","en.sahih":"Indeed, with Us [for them] are shackles and burning fire","en.sarwar":"We have prepared for them fetters, flaming fire,","en.yusufali":"With Us are Fetters (to bind them), and a Fire (to burn them),","en.maududi":"We have heavy fetters and a blazing Fire in store for them;","en.shakir":"Surely with Us are heavy fetters and a flaming fire,","en.itani":"With Us are shackles, and a Fierce Fire.","en.mubarakpuri":"Verily, with Us are Ankal, and Jahim.","en.qarai":"Indeed with Us are heavy fetters and a fierce fire,","en.wahiduddin":"We have in store for them heavy fetters and a blazing Fire,"},"tafsir":{"ar.muyassar":"إن لهم عندنا في الآخرة قيودًا ثقيلة ونارًا مستعرة يُحرقون بها، وطعامًا كريهًا ينشَب في الحلوق لا يستساغ، وعذابًا موجعًا.","ar.jalalayn":"«إن لدينا أنكالا» قيودا ثقالا جمع نكل بكسر النون «وجحيما» نارا محرقة.","ar.qurtubi":"قوله تعالى : إن لدينا أنكالا وجحيما الأنكال : القيود . عن الحسن ومجاهد وغيرهما . واحدها نكل ، وهو ما منع الإنسان من الحركة . وقيل : سمي نكلا لأنه ينكل به .قال الشعبي : أترون أن الله تعالى جعل الأنكال في أرجل أهل النار خشية أن يهربوا ؟ لا والله ! ولكنهم إذا أرادوا أن يرتفعوا استفلت بهم . وقال الكلبي : الأنكال : الأغلال ، والأول أعرف في اللغة ; ومنه قول الخنساء :دعاك فقطعت أنكاله وقد كن قبلك لا تقطعوقيل : إنه أنواع العذاب الشديد ; قاله مقاتل . وقد جاء أن النبي - صلى الله عليه وسلم - قال : \" إن الله يحب [ ص: 44 ] النكل على النكل \" بالتحريك ، قاله الجوهري . قيل : وما النكل ؟ قال : \" الرجل القوي المجرب ، على الفرس القوي المجرب \" ذكره الماوردي قال : ومن ذلك سمي القيد نكلا لقوته ، وكذلك ، الغل ، وكل عذاب قوي فاشتد ، والجحيم النار المؤججة .\n","ar.miqbas":"إِنَّ لَدَيْنَا أَنْكَالًا وَجَحِيمًا (12) وهذا تعليل لجملة { وذرني والمكذبين } [ المزمل : 11 ] ، أي لأن لدينا ما هو أشد عليهم من ردِّك عليهم ، وهذا التعليل أفاد تهديدهم بأن هذه النقم أعدت لهم لأنها لما كانت من خزائن نقمة الله تعالى كانت بحيث يضعها الله في المواضع المستأهلة لها ، وهم الذين بدّلوا نعمة الله كفراً ، فأعد الله لهم ما يكون عليهم في الحياة الأبدية ضداً لأصول النَّعمة التي خُوِّلوها ، فبطِروا بها وقابلوا المنعِم بالكفران .فالأنكال مقابل كفرانهم بنعمة الصحة والمقدرة لأن الأنكال القيود . والجحيم : وهو نار جهنم مقابل ما كانوا عليه من لذة الاستظلال والتبرد . والطعام : ذو الغُصة مقابل ما كانوا منهمكين فيه من أطعمتهم الهنيئة من الثمرات والمطبوخات والصيد . والأنكال : جمع نِكْل بفتح النون وبكسرها وبسكون الكاف . وهو القيد الثقيل .\n","ar.waseet":"وقوله - سبحانه - : ( إِنَّ لَدَيْنَآ أَنكَالاً وَجَحِيماً . . ) تعليل لما قبله . والأنكال : جمع نكل - بكسر النون وسكون الكاف - وهو القيد الثقيل ، يوضع فى الرجل لمنع الحركة . وسميت القيود بذلك لأنها تجعل صاحبها موضع عبرة وعظة ، أو لأنها تجعل صاحبها ممنوعا من الحركة ، والتقلب فى مناكب الأرض .أى : إن لدنيا ما هو أشد من ردك عليهم . . وهو تلك القيود التى نقيد حركتهم بها ، وإن لدينا \" جحيما \" أى : نارا شديدة الاشتعال تلقى بهم فيها .\n","ar.baghawi":"\"إن لدينا\"، عندنا في الآخرة، \"أنكالاً\"، قيوداً عظاماً لا تنفك أبداً واحدها نكل. قال الكلبي: أغلالاً من حديد، \"وجحيماً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5487.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5487.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5487.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا","transliteration":"Wa ta'aaman zaa ghussa tinw wa'azaaban aleemaa","translations":{"en.ahmedali":"And food that will stick in the throat, and painful torment","en.ahmedraza":"And food that chokes, and a painful punishment.","en.arberry":"and food that chokes, and a painful chastisement,","en.asad":"and food that chokes, and grievous suffering","en.daryabadi":"And a food that choketh and a torment afflictive.","en.hilali":"And a food that chokes, and a painful torment.","en.pickthall":"And food which choketh (the partaker), and a painful doom","en.qaribullah":"choking food and a painful punishment.","en.sahih":"And food that chokes and a painful punishment -","en.sarwar":"food which chokes (them), and a painful torment.","en.yusufali":"And a Food that chokes, and a Penalty Grievous.","en.maududi":"and a food that chokes, and a grievous chastisement.","en.shakir":"And food that chokes and a painful punishment,","en.itani":"And food that chokes, and a painful punishment.","en.mubarakpuri":"And a food that chokes, and a painful torment.","en.qarai":"and a food that chokes [those who eat it], and a painful punishment [prepared for]","en.wahiduddin":"food that chokes and painful punishment"},"tafsir":{"ar.muyassar":"إن لهم عندنا في الآخرة قيودًا ثقيلة ونارًا مستعرة يُحرقون بها، وطعامًا كريهًا ينشَب في الحلوق لا يستساغ، وعذابًا موجعًا.","ar.jalalayn":"«وطعاما ذا غصة» يغص به في الحلق وهو الزقوم أو الضريع أو الغسلين أو شوك من نار لا يخرج ولا ينزل «وعذابا أليما» مؤلما زيادة على ما ذكر لمن كذب النبي صلى الله عليه وسلم.","ar.qurtubi":"وطعاما ذا غصة أي غير سائغ ; يأخذ بالحلق ، لا هو نازل ولا هو خارج ، وهو الغسلين والزقوم والضريع ; قاله ابن عباس . وعنه أيضا أنه شوك يدخل الحلق ، فلا ينزل ولا يخرج .وقال الزجاج : أي طعامهم الضريع ; كما قال : ليس لهم طعام إلا من ضريع وهو شوك كالعوسج . وقال مجاهد : هو الزقوم ، كما قال : إن شجرة الزقوم طعام الأثيم . والمعنى واحد . وقال حمران بن أعين : قرأ النبي - صلى الله عليه وسلم - إن لدينا أنكالا وجحيما وطعاما ذا غصة فصعق . وقال خليد بن حسان : أمسى الحسن عندنا صائما ، فأتيته بطعام فعرضت له هذه الآية إن لدينا أنكالا وجحيما وطعاما فقال : ارفع طعامك . فلما كانت الثانية أتيته بطعام فعرضت له هذه الآية ، فقال : ارفعوه . ومثله في الثالثة ; فانطلق ابنه إلى ثابت البناني ويزيد الضبي ويحيى البكاء فحدثهم ، فجاءوه فلم يزالوا به حتى شرب شربة من سويق . والغصة : الشجا ، وهو ما ينشب في الحلق من عظم أو غيره . وجمعها غصص . والغصص بالفتح مصدر قولك : غصصت يا رجل تغص ، فأنت غاص بالطعام وغصان ، وأغصصته أنا ، والمنزل غاص بالقوم أي ممتلئ بهم .\n","ar.miqbas":"وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا (13) والغُصَّة بضم الغين : اسم لأثر الغصّ في الحلق وهو تردد الطعام والشراب في الحلق بحيث لا يسيغه الحلق من مرض أو حزن وعَبرة .وإضافة الطعام إلى الغُصة إضافة مجازية وهي من الإِضافة لأدنى ملابسة ، فإن الغصة عارض في الحلق سببه الطعام أو الشرب الذي لا يستساغ لبَشاعةٍ أو يبوسة .والعذاب الأليم : مقابل ما في النعمة من ملاذ البشر ، فإن الألم ضد اللذة . وقد عرّف الحكماء اللذة بأنها الخلاص من الألم .وقد جمع الأخير جمع ما يضاد معنى النَّعمة ( بالفتح ) .وتنكير هذه الأجناس الأربعة لقصد تعظيمها وتهويلها ، و ( لدى ) يجوز أن يكون على حقيقته ويقدر مضاف بينه وبين نون العظمة . والتقدير : لدى خزائننا ، أي خزائن العذاب ، ويجوز أن يكون مجازاً في القدرة على إيجاد ذلك متى أراد الله .\n","ar.waseet":"وإن لدينا كذلك \" طعاما ذا غصة \" أى : طعاما يلتصق فى الحلوق ، فلا هو خارج منها ، ولا هو نازل عنها ، بل هو ناشب فيها لبشاعته ومرارته .وهذا الطعام ذو الغُصَّة ، يشمل ما يتناولونه من الزقوم ومن الغسلين ومن الضريع ، كما جاء فى فى آيات أخرى . والغصة : ما يَنْشَب فى الحلق من عَظْم أو غيره ، وجمعه غُصَص .وإن لدينا فوق كل ذلك ( وَعَذَاباً أَلِيماً ) أى : عذابا شديد الإِيلام لمن ينزل به .فأنت ترى أن هذه الآية الكريمة قد توعدت هؤلاء المكذبين بألوان من العقوبات الشديدة ، توعدتهم بالقيود التى تشل حركتهم ، وبالنار المشتعلة التى تحرق أجسادهم ، وبالطعام البشع الذى ينشب فى حلوقهم ، وبالعذاب الأليم الذى يشقيهم ويذلهم .\n","ar.baghawi":"\"وطعاماً ذا غصة\"، غير سائغة تأخذ بالحلق لا ينزل ولا يخرج وهو الزقوم والضريع. \"وعذاباً أليماً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5488.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5488.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5488.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَهِيلًا","transliteration":"Yawma tarjuful ardu waljibaalu wa kaanatil jibaalu kaseebam maheelaa","translations":{"en.ahmedali":"On the day the earth and mountains will rock violently, and the mountains turn to a heap of poured-out sand.","en.ahmedraza":"On a day when the earth and the mountains will tremble, and the mountains turn into dunes of flowing sand.","en.arberry":"upon the day when the earth and the mountains shall quake and the mountains become a slipping heap of sand.","en.asad":"on the Day when the earth and the mountains will be convulsed and the mountains will [crumble and] become like a sand-dune on the move!","en.daryabadi":"On a Day whereon the earth and the mountains shall quake, and the mountains shall become a sand-heap poured forth.","en.hilali":"On the Day when the earth and the mountains will be in violent shake, and the mountains will be a heap of sand poured out and flowing down.","en.pickthall":"On the day when the earth and the hills rock, and the hills become a heap of running sand.","en.qaribullah":"On the Day when the earth with all its mountains quake and the mountains become heaps of shifting sand.","en.sahih":"On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.","en.sarwar":"On that day, the earth and the mountains will be violently shaken, and the mountains will be turned into heaps of moving sand.","en.yusufali":"One Day the earth and the mountains will be in violent commotion. And the mountains will be as a heap of sand poured out and flowing down.","en.maududi":"(They will come across all this) on the Day when the earth and the mountains shall tremble violently and the mountains shall crumble into heaps of scattered sand.","en.shakir":"On the day when the earth and the mountains shall quake and the mountains shall become (as) heaps of sand let loose.","en.itani":"On the Day when the earth and the mountains tremble, and the mountains become heaps of sand.","en.mubarakpuri":"On the Day when the earth and the mountains will (Tarjufu) shake, and the mountains will be a heap of sand poured out.","en.qarai":"the day when the earth and the mountains will quake, and the mountains will be like dunes of shifting sand.","en.wahiduddin":"on the Day the earth and mountains shall shake and the mountains crumble into shifting sand dunes."},"tafsir":{"ar.muyassar":"يوم تضطرب الأرض والجبال وتتزلزل حتى تصير الجبال تَلا من الرمل سائلا متناثرًا، بعد أن كانت صُلبة جامدة.","ar.jalalayn":"«يوم ترجف» تزلزل «الأرض والجبال وكانت الجبال كثيبا» رملا مجتمعا «مهيلا» سائلا بعد اجتماعه وهو من هال يهيل وأصله مهيول استثقلت الضمة على الياء فنقلت إلى هاء وحذفت الواو ثاني الساكنين لزيادتها وقلبت الضمة كسرة لمجانسة الياء.","ar.qurtubi":"قوله تعالى : يوم ترجف الأرض والجبال أي تتحرك وتضطرب بمن عليها . وانتصب ( يوم ) على الظرف أي ينكل بهم ويعذبون يوم ترجف الأرض . وقيل : بنزع الخافض ; يعني هذه العقوبة في يوم ترجف الأرض والجبال . وقيل : العامل ( ذرني ) أي وذرني والمكذبين يوم ترجف الأرض والجبال .وكانت الجبال كثيبا مهيلا أي وتكون . والكثيب الرمل المجتمع - قال حسان :عرفت ديار زينب بالكثيب كخط     الوحي في الورق القشيبوالمهيل : الذي يمر تحت الأرجل . قال الضحاك والكلبي : المهيل : هو الذي إذا وطئته بالقدم زل من تحتها ، وإذا أخذت أسفله انهال .وقال ابن عباس : مهيلا أي رملا سائلا متناثرا وأصله مهيول وهو مفعول من قولك : هلت عليه التراب أهيله هيلا : إذا صببته . يقال : مهيل ومهيول ، ومكيل ومكيول ، ومدين ومديون ، ومعين ومعيون ; قال الشاعر :[ ص: 45 ] قد كان قومك يحسبونك سيدا     وإخال أنك سيد معيونوفي حديث النبي - صلى الله عليه وسلم - أنهم شكوا إليه الجدوبة ; فقال : \" أتكيلون أم تهيلون \" قالوا : نهيل . قال : \" كيلوا طعامكم يبارك لكم فيه \" .وأهلت الدقيق لغة في هلت فهو مهال ومهيل . وإنما حذفت الواو ، لأن الياء تثقل فيها الضمة ، فحذفت فسكنت هي والواو فحذفت الواو لالتقاء الساكنين .\n","ar.miqbas":"يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَهِيلًا (14)ويتعلق { يوم ترجف } بالاستقرار الذي يتضمنه خبر { إن } في قوله { إن لدينا أنكالاً .والرجف : الزلزلة والاضطراب ، والمراد : الرجف المتكرر المستمر ، وهو الذي يكون به انفراط أجزاء الأرض وانحلالها .والكثيب : الرمل المجتمع كالربوة ، أي تصير حجارةُ الجبال دُقاقاً .ومهيل : اسم فعول من هال الشيءَ هيلاً ، إذا نثره وصبّه ، وأصله مهيول ، استثقلت الضمة على الياء فنقلت إلى الساكن قبلها فالتقى ساكنان فحذفت الواو ، لأنها زائدة ويدُلُّ عليها الضمة .وجيء بفعل كانت } في قوله : { وكانت الجبال كثيباً } ، للإِشارة إلى تحقيق وقوعه حتى كأنه وقع في الماضي . ووجه مخالفته لأسلوب { ترجف } أن صيرورة الجبال كثباً أمر عجيب غير معتاد ، فلعله يستبعده السامعون وأما رجف الأرض فهو معروف ، إلاّ أن هذا الرجف الموعود به أعظم ما عرف جنسه .\n","ar.waseet":"والظرف فى قوله - تعالى - : ( يَوْمَ تَرْجُفُ الأرض والجبال . . . ) منصوب بالاستقرار العامل فى \" الدنيا \" الذى هو الخبر فى الحقيقة .أى : استقر لهم ذلك العذاب الأليم الدنيا ، يوم القيامة ، يوم تضطرب وتتزلزل الأرض والجبال .( وَكَانَتِ الجبال ) فى هذا اليوم ( كَثِيباً مَّهِيلاً ) أو : رملا مجتمعا ، بعد أن كانت قبل ذلك الوقت أحجارا صلبة كبيرة .فقوله : ( كَثِيباً ) من كثَب الشئَ يَكْثَبه ، إذا جمعه من قرب ثم صبه ، وجمعه كُثُب وكُثبْان ، وهى تلال الرمال المجتمعة كالربوة .وقوله ( مَّهِيلاً ) اسم مفعول من هال الشئ هيلا ، إذا نثره ، وفرقه بعد اجتماعه والشئ المهيل : هو الذى يحرَّك أسفله فينهار أعلاه ويتساقط بسرعة .\n","ar.baghawi":"\"يوم ترجف الأرض والجبال\"، أي: تتزلزل وتتحرك، \"وكانت الجبال كثيباً مهيلاً\". رملاً سائلاً. قال الكلبي: هو الرمل الذي إذا أخذت منه شيئاً تبعك ما بعده، يقال أهلت الرمل أهيله هيلاً إذا حركت أسفله حتى انهال من أعلاه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5489.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5489.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5489.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَىٰ فِرْعَوْنَ رَسُولًا","transliteration":"Innaa arsalnaaa ilaikum rasoolan shahidan 'alikum kamaaa arsalnaaa ilaa Fir'awna Rasoolna","translations":{"en.ahmedali":"We have sent an Apostle to you as a witness against you, as We had sent an apostle to the Pharaoh.","en.ahmedraza":"We have indeed sent a Noble Messenger towards you, a present witness over you – the way We had sent a Noble Messenger towards Firaun.","en.arberry":"Surely We have sent unto you a Messenger as a witness over you, even as We sent to Pharaoh a Messenger,","en.asad":"BEHOLD, [O men,] We have sent unto you an apostle who shall bear witness to the truth before you, even as We sent an apostle unto Pharaoh:","en.daryabadi":"Verily We! We have sent Unto you an apostle, a witness over you, even as We sent Unto Fir'awn an apostle.","en.hilali":"Verily, We have sent to you (O men) a Messenger (Muhammad SAW) to be a witness over you, as We did send a Messenger [Musa (Moses)] to Fir'aun (Pharaoh).","en.pickthall":"Lo! We have sent unto you a messenger as witness against you, even as We sent unto Pharaoh a messenger.","en.qaribullah":"Indeed, We have sent to you a Messenger as a witness over you, just as We sent a Messenger to Pharaoh.","en.sahih":"Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.","en.sarwar":"We have sent you a Messenger, who will witness your deeds, just as We sent a Messenger to the Pharaoh.","en.yusufali":"We have sent to you, (O men!) a messenger, to be a witness concerning you, even as We sent a messenger to Pharaoh.","en.maududi":"Surely We have sent to you a Messenger as a witness over you, just as We had sent a Messenger to Pharaoh.","en.shakir":"Surely We have sent to you an Apostle, a witness against you, as We sent an apostle to Firon.","en.itani":"We have sent to you a messenger, a witness over you, as We sent to Pharaoh a messenger.","en.mubarakpuri":"Verily, We have sent to you a Messenger to be a witness over you, as We did send a Messenger to Fir`awn.","en.qarai":"Indeed We have sent to you an apostle, to be a witness to you, just as We sent an apostle to Pharaoh.","en.wahiduddin":"We have sent a messenger who is a witness over you, just as We sent a messenger to Pharoah before you."},"tafsir":{"ar.muyassar":"إنا أرسلنا إليكم- يا أهل \"مكة\"- محمدًا رسولا شاهدًا عليكم بما صدر منكم من الكفر والعصيان، كما أرسلنا موسى رسولا إلى الطاغية فرعون، فكذَّب فرعون بموسى، ولم يؤمن برسالته، وعصى أمره، فأهلكناه إهلاكًا شديدًا. وفي هذا تحذير من معصية الرسول محمد، صلى الله عليه وسلم؛ خشية أن يصيب العاصي مثل ما أصاب فرعون وقومه.","ar.jalalayn":"«إنا أرسلنا إليكم» يا أهل مكة «رسولا» هو محمد صلى الله عليه وسلم «شاهدا عليكم» يوم القيامة بما يصدر منكم من العصيان «كما أرسلنا إلى فرعون رسولا» هو موسى عليه الصلاة والسلام.","ar.qurtubi":"قوله تعالى : إنا أرسلنا إليكم رسولا شاهدا عليكم يريد النبي - صلى الله عليه وسلم - أرسله إلى قريش كما أرسلنا إلى فرعون رسولا وهو موسى\n","ar.miqbas":"إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَى فِرْعَوْنَ رَسُولًا (15) نقل الكلام إلى مخاطبة المشركين بعد أن كان الخطاب موجهاً إلى النبي صلى الله عليه وسلموالمناسبة لذلك التخلصُ إلى وعيدهم بعد أن أمره بالصبر على ما يقولون وهجرهم هجراً جميلاً إذ قال له { وذرني والمكذبين } إلى قوله : { وعذاباً أليماً } [ المزمل : 1113 ] .فالكلام استئناف ابتدائي ، ولا يُعد هذا الخطاب من الالتفات لأن الكلام نقل إلى غرض غير الغرض الذي كان قبله .فالخطاب فيه جار على مقتضى الظاهر على كلا المذهبين : مذهب الجمهور ومذهب السكاكي .والمقصود من هذا الخبر التعريض بالتهديد أن يصيبهم مثل ما أصاب أمثالهم ممن كذبوا الرسل فهو مثَل مضروب للمشركين .وهذا أول مثَل ضربه الله للمشركين للتهديد بمصير أمثالهم على قول الجمهور في نزول هذه السورة .واختير لهم ضرب المثل بفرعون مع موسى عليه السلام ، لأن الجامع بين حال أهل مكة وحال أهل مصر في سبب الإِعراض عن دعوة الرسول هو مجموع ما هم عليه من عبادة غير الله ، وما يملأ نفوسهم من التكبر والتعاظم على الرسول المبعوث إليهم بزعمهم أن مثلهم لا يطيع مِثله كما حكى الله تعالى عنهم بقوله : { فقالوا أنؤمن لبشرين مثِلنا وقومُهما لنا عابدون } [ المؤمنون : 47 ] وقد قال أهل مكة { لولا نُزِّل هذا القرءان على رجل من القريتين عظيم } [ الزخرف : 31 ] وقد حكى الله عنهم أنهم قالوا { لولا أنزل علينا الملائكة أو نرى ربّنا لقد استكبروا في أنفسهم وعتَوْا عُتُوّاً كبيراً } [ الفرقان : 21 ] . وقد تكرر في القرآن ضرب المثل بفرعون لأبي جهل وهو زعيم المناوين للنبيء صلى الله عليه وسلم والمؤلبين عليه وأشد صناديد قريش كفراً .وأُكد الخبر ب ( إنَّ ) لأن المخاطبين منكرون أن الله أرسل إليهم رسولاً .ونكر { رسولاً } لأنهم يعلمون المعنيَّ به في هذا الكلام ، ولأن مناط التهديد والتنظير ليس شخص الرسول صلى الله عليه وسلم بل هو صفة الإِرسال .وأدمج في التنظير والتهديدِ وصفُ الرسول صلى الله عليه وسلم بكونه شاهداً عليهم .والمراد بالشهادة هنا : الشهادة بتبليغ ما أراده الله من الناس وبذلك يكون وصف { شاهداً } موافقاً لاستعمال الوصف باسم الفاعل في زمن الحال ، أي هو شاهد عليكم الآن بمعاودة الدعوة والإِبلاغ .وأما شهادة الرسول صلى الله عليه وسلم يوم القيامة فهي شهادة بصدق المسلمين في شهادتهم على الأمم بأن رسلهم أبلغوا إليهم رسالات ربّهم ، وذلك قوله تعالى : { وكذلك جعلناكم أمة وسطاً لتكونوا شهداء على الناس ويكون الرسول عليكم شهيداً } كما ورد تفصيل تفسيرها في الحديث الصحيح ، وقد تقدم في سورة البقرة ( 143 ) .{ وتنكير رسولاً } المرسَل إلى فرعون لأن الاعتبار بالإِرسال لا بشخص المرسل إذ التشبيه تعلق بالإِرسال في قوله : { كما أرسلنا إلى فرعون } إذ تقديره كإرسالنا إلى فرعون رسولاً .\n","ar.waseet":"ثم يذكر - سبحانه - بعد ذلك هؤلاء المكذبين بما حل بالمكذبين من قبلهم ، فيقول : ( كَمَآ أَرْسَلْنَآ إلى فِرْعَوْنَ رَسُولاً ) للتشبيه ، أى : أرسلنا إليكم - يا أهل مكة - رسولا شاهدا عليكم هو محمد صلى الله عليه وسلم كما أرسلنا من قبلكم إلى فرعون رسولا شاهدا عليه ، هو موسى - عليه السلام - .وأكد الخبر فى قوله - تعالى - : ( إِنَّآ أَرْسَلْنَآ . . . ) لأن المشركين كانوا ينكرون نبوة النبى صلى الله عليه وسلم .ونكر رسولا ، لأنهم كانوا يعرفونه حق المعرفة ، وللتعظيم من شأنه صلى الله عليه وسلم أى : أرسلنا إليكم رسولا عظيم الشأن ، سامى المنزلة جامعا لكل الصفات الكريمة .\n","ar.baghawi":"\"إنا أرسلنا إليكم رسولاً شاهداً عليكم كما أرسلنا إلى فرعون رسولاً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5490.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5490.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5490.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"فَعَصَىٰ فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذًا وَبِيلًا","transliteration":"Fa'asaa Fir'awnur Rasoola fa akhaznaahu akhzanw wabeelaa","translations":{"en.ahmedali":"But the Pharaoh disobeyed the apostle; so We seized him with a grievous punishment.","en.ahmedraza":"In response Firaun disobeyed the Noble Messenger, so We seized him with a severe seizure.","en.arberry":"but Pharaoh rebelled against the Messenger, so We seized him remorselessly.","en.asad":"and Pharaoh rebelled against the apostle, whereupon We took him to task with a crushing grip.","en.daryabadi":"Then Fir'awn disobeyed the apostle, wherefore We laid hold of him with a painful hold.","en.hilali":"But Fir'aun (Pharaoh) disobeyed the Messenger [Musa (Moses)], so We seized him with a severe punishment.","en.pickthall":"But Pharaoh rebelled against the messenger, whereupon We seized him with no gentle grip.","en.qaribullah":"Pharaoh disobeyed Our Messenger, so We seized him remorselessly.","en.sahih":"But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.","en.sarwar":"However, the Pharaoh disobeyed the Messenger and We seized him with a severe retribution.","en.yusufali":"But Pharaoh disobeyed the messenger; so We seized him with a heavy Punishment.","en.maududi":"But Pharaoh disobeyed Our Messenger, so We seized him with a terrible seizing.","en.shakir":"But Firon disobeyed the apostle, so We laid on him a violent hold.","en.itani":"But Pharaoh defied the Messenger, so We seized him with a terrible seizing.","en.mubarakpuri":"But Fir`awn disobeyed the Messenger; so We seized him with a severe punishment.","en.qarai":"But Pharaoh disobeyed the apostle; so We seized him with a terrible seizing.","en.wahiduddin":"But Pharoah rebelled against the messenger, so We seized him with a strong, crushing grip."},"tafsir":{"ar.muyassar":"إنا أرسلنا إليكم- يا أهل \"مكة\"- محمدًا رسولا شاهدًا عليكم بما صدر منكم من الكفر والعصيان، كما أرسلنا موسى رسولا إلى الطاغية فرعون، فكذَّب فرعون بموسى، ولم يؤمن برسالته، وعصى أمره، فأهلكناه إهلاكًا شديدًا. وفي هذا تحذير من معصية الرسول محمد، صلى الله عليه وسلم؛ خشية أن يصيب العاصي مثل ما أصاب فرعون وقومه.","ar.jalalayn":"«فعصى فرعون الرسول فأخذناه أخذا وبيلا» شديدا.","ar.qurtubi":"فعصى فرعون الرسول أي كذب به ولم يؤمن . قال مقاتل : ذكر موسى وفرعون ; لأن أهل مكة ازدروا محمدا - صلى الله عليه وسلم - واستخفوا به ; لأنه ولد فيهم ، كما أن فرعون ازدرى موسى ; لأنه رباه ونشأ فيما بينهم ، كما قال تعالى : ألم نربك فينا وليدا .قال المهدوي : ودخلت الألف واللام في الرسول لتقدم ذكره ; ولذلك اختير في أول الكتب سلام عليكم ، وفي آخرها السلام عليكم .وبيلا أي ثقيلا شديدا . وضرب وبيل وعذاب وبيل : أي شديد ; قاله ابن عباس ومجاهد . ومنه مطر وابل أي شديد ; قاله الأخفش . وقال الزجاج : أي ثقيلا غليظا . ومنه قيل للمطر وابل . وقيل : مهلكا ، والمعنى عاقبناه عقوبة غليظة ، قال :[ ص: 46 ] أكلت بنيك أكل الضب حتى وجدت مرارة الكلأ الوبيلواستوبل فلان كذا : أي لم يحمد عاقبته . وماء وبيل : أي وخيم غير مريء ، وكلأ مستوبل وطعام وبيل ومستوبل : إذا لم يمرئ ولم يستمرأ ، قال زهير :فقضوا منايا بينهم ثم أصدروا     إلى كلأ مستوبل متوخموقالت الخنساء :لقد أكلت بجيلة يوم لاقت     فوارس مالك أكلا وبيلاوالوبيل أيضا : العصا الضخمة ; قال :لو أصبح في يمنى يدي زمامها     وفي كفي الأخرى وبيل تحاذرهوكذلك الموبل بكسر الباء ، والموبلة أيضا : الحزمة من الحطب ، وكذلك الوبيل ، قال طرفة :عقيلة شيخ كالوبيل يلندد\n","ar.miqbas":"فَعَصَى فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذًا وَبِيلًا (16)وتفريع { فعصى فرعون الرسول } إيماء إلى أن ذلك هو الغرض من هذا الخبر وهو التهديد بأن يحلّ بالمخاطبين لمَّا عصوا الرسول صلى الله عليه وسلم مِثلُ ما حلّ بفرعون .وفي إظهار اسم فرعون في قوله : { فعصى فرعون } دون أن يؤتَى بضميره للنداء عليه بفظاعة عصيانه الرسول .ولما جرى ذكر الرسول المرسل إلى فرعون أوّل مرة جيء به في ذكره ثاني مرة معرفاً بلام العهد وهو العهد الذكري ، أي الرسول المذكور آنفاً فإن النكرة إذا أعيدت معرفة باللام كان مدلولها عينَ الأولى .والأخذ مستعمل في الإِهلاك مجازاً لأنه لما أزالهم من الحياة أشبه فعله أخذ الآخذ شيئاً من موضعه وجعله عنده .والوبيل : فعيل صفة مشبهة من وبُل المكان ، إذا وَخِم هواؤه أو مَرعَى كَلَئِه ، وقال زهير :إلى كَلإٍ مُسْتَوبِللٍ مُتَوَخِّم ... وهو هنا مستعار لسَيّىءِ العاقبة شديدَ السوء ، وأريد به الغرق الذي أصاب فرعون وقومه .\n","ar.waseet":"والفاء فى قوله : ( فعصى فِرْعَوْنُ الرسول ) للتفريع . أى : أرسلنا إليكم رسولا كما أرسلنا إلأى فرعون رسولا قبل ذلك ، فكانت النتيجة أن عصى فرعون أمر الرسول الذى أرسلناه إليه ، واستهزأ به ، وتطاول عليه فكانت عاقبة هذا التطاول ، أن أخذناه ( أَخْذاً وَبِيلاً ) .أى أهلكنا فرعون إهلاكا شديدا ، وعاقبناه عقابا ثقيلا ، فوبيل بزنة فعيل - صفة مشبهة ، مأخوذة من وَبُل المكان ، إذا وَخُم هواؤه وكان ثقيلا رديئا . ويقال : مرعى وبيل ، إذا كان وخما رديئا .وخص - سبحانه - موسى وفرعون بالذكر ، لأن أخبارهما كانت مشهورة عند أهل مكة .و ( أل ) فى قوله ( فعصى فِرْعَوْنُ الرسول ) للعهد . أى : فعصى فرعون الرسول المعهود عندكم ، وهو موسى - عليه السلام - .قال صاحب الكشاف : فإن قلت : لم نكر الرسول ثم عرف؟ قلت : لأنه أراد : أرسلنا إلى فرعون بعض الرسل ، فلما أعاده وهو معهود بالذكر أدخل لام التعريف . إشارة إلى المذكور بعينه . .وأظهر - سبحانه - اسم فرعون مع تقدم ذكره فقال : ( فعصى فِرْعَوْنُ الرسول ) ، دون أن يؤتى بضميره ، للإِشعار بفظعة هذا العصيان ، وبلوغه النهاية فى الطغيان .والمقصود من هاتين الآيتين ، تهديد المشركين ، بأنهم إذا ما استمروا فى تكذيبهم لرسولهم ، محمد صلى الله عليه وسلم فقد يصيبهم من العذاب ما أصاب فرعون عندما عصى موسى - عليه السلام - .\n","ar.baghawi":"\"فعصى فرعون الرسول فأخذناه أخذاً وبيلاً\"، شديداً ثقيلاً، يعني عاقبناه عقوبة غليظة يخوف كفار مكة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5491.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5491.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5491.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"فَكَيْفَ تَتَّقُونَ إِنْ كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا","transliteration":"Fakaifa tattaqoona in kafartum yawmany yaj'alul wildaana sheeba","translations":{"en.ahmedali":"How then, if you disbelieve, will you preserve yourselves on the day which will even turn the children hoary?","en.ahmedraza":"So how will you save yourselves, if you disbelieve, on a day that will turn children old?","en.arberry":"If therefore you disbelieve, how will you guard yourselves against a day that shall make the children grey-headed?","en.asad":"How, then, if you refuse to acknowledge the truth, will you protect yourselves on that Day which shall turn the hair of children grey,","en.daryabadi":"How then, if ye disbelieve, shall ye escape, on a Day which shall make children grey-headed.","en.hilali":"Then how can you avoid the punishment, if you disbelieve, on a Day that will make the children grey-headed (i.e. the Day of Resurrection)?","en.pickthall":"Then how, if ye disbelieve, will ye protect yourselves upon the day which will turn children grey,","en.qaribullah":"If you disbelieve, how will you guard yourself against the Day that will make children gray haired,","en.sahih":"Then how can you fear, if you disbelieve, a Day that will make the children white- haired?","en.sarwar":"If you, disbelieve, how will you be able to protect yourselves from the hardships of the day which would even turn children grey-headed?","en.yusufali":"Then how shall ye, if ye deny (Allah), guard yourselves against a Day that will make children hoary-headed?-","en.maududi":"If you persist in disbelieving, how will you guard yourself against the (woe of the) Day that will turn children grey-haired,","en.shakir":"How, then, will you guard yourselves, if you disbelieve, on the day which shall make children grey-headed?","en.itani":"So how will you, if you persist in unbelief, save yourself from a Day which will turn the children gray-haired?","en.mubarakpuri":"Then how can you protect yourselves from the punishment, if you disbelieve, on a Day that will make the children gray-headed","en.qarai":"So, if you disbelieve, how will you avoid the day, which will make children white-headed,","en.wahiduddin":"If you persist in denying the truth how will you escape the Day that will turn the children's hair grey."},"tafsir":{"ar.muyassar":"فكيف تَقُون أنفسكم- إن كفرتم- عذاب يوم القيامة الذي يشيب فيه الولدان الصغار؛ مِن شدة هوله وكربه؟","ar.jalalayn":"«فكيف تتقون إن كفرتم» في الدنيا «يوما» مفعول تتقون، أي عذابه بأيِّ حصن تتحصنون من عذاب يوم «يَجعل الولدان شيباً» جمع أشيب لشدة هوله وهو يوم القيامة والأصل في شين شيبا الضم وكسرت لمجانسة الياء ويقال في اليوم الشديد يوم يشيب نواصي الأطفال وهو مجاز ويجوز أن يكون المراد في الآية الحقيقة.","ar.qurtubi":"قوله تعالى : فكيف تتقون إن كفرتم يوما يجعل الولدان شيبا هو توبيخ وتقريع ، أي كيف تتقون العذاب إن كفرتم . وفيه تقديم وتأخير ، أي كيف تتقون يوما يجعل الولدان شيبا إن كفرتم . وكذا قراءة عبد الله وعطية .قال الحسن : أي بأي صلاة تتقون العذاب ؟ بأي صوم تتقون العذاب ؟ وفيه إضمار ، أي كيف تتقون عذاب يوم . وقال قتادة : والله ما يتقي من كفر بالله ذلك اليوم بشيء . و \" يوما \" مفعول ب \" تتقون \" على هذه القراءة وليس بظرف ، وإن قدر الكفر بمعنى الجحود كان اليوم مفعول كفرتم .وقال بعض المفسرين : وقف التمام على قوله : كفرتم والابتداء يوما يذهب إلى أن اليوم مفعول ( يجعل ) والفعل لله - عز وجل - ، وكأنه قال : يجعل الله الولدان شيبا في يوم . قال ابن الأنباري ; وهذا لا يصلح ; لأن اليوم هو الذي يفعل هذا من شدة هوله . المهدوي : والضمير في ( يجعل ) يجوز أن يكون لله - عز وجل - ، ويجوز أن يكون لليوم ، وإذا كان لليوم صلح أن يكون صفة له ، ولا يصلح ذلك إذا كان الضمير لله - عز وجل - إلا مع تقدير حذف ; كأنه قال : يوما يجعل الله الولدان فيه شيبا . ابن الأنباري : ومنهم من نصب اليوم ب ( كفرتم ) وهذا قبيح ; لأن اليوم إذا علق ب ( كفرتم ) احتاج إلى صفة ; أي كفرتم بيوم . فإن احتج محتج بأن الصفة قد تحذف وينصب ما بعدها ، احتججنا عليه بقراءة عبد الله فكيف تتقون يوما .قلت : هذه القراءة ليست متواترة ، وإنما جاءت على وجه التفسير . وإذا كان الكفر [ ص: 47 ] بمعنى الجحود ف ( يوما ) مفعول صريح من غير صفة ولا حذفها ; أي فكيف تتقون الله وتخشونه إن جحدتم يوم القيامة والجزاء . وقرأ أبو السمال قعنب ( فكيف تتقون ) بكسر النون على الإضافة .و ( الولدان ) الصبيان . وقال السدي : هم أولاد الزنا . وقيل : أولاد المشركين . والعموم أصح ; أي يشيب فيه الضمير من غير كبر . وذلك حين يقال : ( يا آدم قم فابعث بعث النار ) . على ما تقدم في أول سورة ( الحج ) .قال القشيري : ثم إن أهل الجنة يغير الله أحوالهم وأوصافهم على ما يريد .وقيل : هذا ضرب مثل لشدة ذلك اليوم وهو مجاز ; لأن يوم القيامة لا يكون فيه ولدان ولكن معناه أن هيبة ذلك اليوم بحال لو كان فيه هناك صبي لشاب رأسه من الهيبة . ويقال : هذا وقت الفزع ، وقيل أن ينفخ في الصور نفخة الصعق ، فالله أعلم . الزمخشري : وقد مر بي في بعض الكتب أن رجلا أمسى فاحم الشعر كحنك الغراب ، فأصبح وهو أبيض الرأس واللحية كالثغامة ، فقال : أريت القيامة والجنة والنار في المنام ، ورأيت الناس يقادون في السلاسل إلى النار ، فمن هول ذلك أصبحت كما ترون . ويجوز أن يوصف اليوم بالطول ، وأن الأطفال يبلغون فيه أوان الشيخوخة والشيب .\n","ar.miqbas":"فَكَيْفَ تَتَّقُونَ إِنْ كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا (17) الاستفهام ب ( كيف ) مستعمل في التعجيز والتوبيخ وهو متفرع بالفاء على ما تضمنه الخطاب السابق من التهديد على تكذيب الرسول صلى الله عليه وسلم وما أدمج فيه من التسجيل بأن الرسول صلى الله عليه وسلم شاهد عليهم فليس بعد الشهادة إلاّ المؤاخذة بما شهد به ، وقد انتقل بهم من التهديد بالأخذ في الدّنيا المستفاد من تمثيل حالهم بحال فرعون مع موسى إلى الوعيد بعقاب أشد وهو عذاب يوم القيامة وقد نشأ هذا الاستفهام عن اعتبارهم أهل اتِّعاظ وخوف من الوعيد بما حلّ بأمثالهم مما شأنُه أن يثير فيهم تفكيراً من النجاة من الوقوع فيما هُدِّدوا به ، وأنهم إن كانوا أهل جلادة على تحمل عذاب الدّنيا فماذا يصنعون في اتقاء عذاب الآخرة ، فدلّت فاء التفريع واسم الاستفهام على هذا المعنى .فالمعنى : هبكم أقدمتم على تحمل عذاب الدنيا فكيف تتقون عذاب الآخرة ، ففعل الشرط من قوله : { إِنْ كفرتم } مستعمل في معنى الدوام على الكفر لأن ما يقتضيه الشرط من الاستقبال قرينة على إرادة معنى الدّوام من فعل { كفرتم } وإلاّ فإن كفرهم حاصل من قبل نزول هذه الآية .و { يوماً } منصوب على المفعول به ل { تتقون } . واتقاء اليوم باتقاء ما يقع فيه من عذاب أي على الكفر .ووصف اليوم بأنه { يجعل الولدان شيباً } وصف له باعتبار ما يقع فيه من الأهوال والأحزان ، لأنه شاع أن الهم مما يسرع به الشيب فلما أريد وصف همّ ذلك اليوم بالشدة البالغة أقواها أسند إليه يشيب الولدان الذين شعرهم في أول سواده . وهذه مبالغة عجيبة وهي من مبتكرات القرآن فيما أحسب ، لأني لم أر هذا المعنى في كلام العرب وأما البيت الذي يذكر في شواهد النحو وهو :إذن والله نَرميهم بحرب ... تُشيب الطفل من قبل المشيبفلا ثبوت لنسبته إلى من كانوا قبل نزول القرآن ولا يعرف قائله ، ونسبه بعض المؤلفين إلى حسان بن ثابت . وقال العيني : لم أجده في ديوانه . وقد أخذ المعنى الصمّة ابن عبد الله القشيري في قوله :دَعانيَ من نجدٍ فإن سنينه ... لَعِبْنَ بنا شِيباً وشيبننا مرداوهو من شعراء الدولة الأموية وإسناد { يجعل الولدان شيباً } إلى اليوم مجاز عقلي بمرتبتين لأن ذلك اليوم زمَن الأهوال التي تشيب لمثلها الأطفال ، والأهوال سبب للشيب عرفاً .والشيب كناية عن هذا الهول فاجتمع في الآية مجازان عقليان وكناية ومبالغة في قوله : { يجعل الولدان شيباً .\n","ar.waseet":"ثم ذكرهم - سبحانه - بأهوال يوم القيامة ، لعلهم يتعظون أو يرتدعون فقال : ( فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْماً يَجْعَلُ الولدان شِيباً . السَّمَآءُ مُنفَطِرٌ بِهِ كَانَ وَعْدُهُ مَفْعُولاً ) .والاستفهام فى قوله : ( فَكَيْفَ ) مستعمل فى التوبيخ والتعجيز ، و ( تَتَّقُونَ ) بمعنى تصونون أنفسكم من العذاب ، ومعنى ( إِن كَفَرْتُمْ ) إن بقيتم على كفركم وأصررتم عليه . وقوله ( يَوْماً ) : منصوب على أنه مفعول به لقوله : ( تَتَّقُونَ ) .\n","ar.baghawi":"( فكيف تتقون إن كفرتم ) أي : كيف لكم بالتقوى يوم القيامة إذ كفرتم في الدنيا يعني لا سبيل لكم إلى التقوى إذا وافيتم يوم القيامة ؟ وقيل : معناه كيف تتقون العذاب يوم القيامة وبأي شيء تتحصنون منه إذا كفرتم ؟ ( يوما يجعل الولدان شيبا ) شمطا من هوله وشدته ، ذلك حين يقال لآدم قم فابعث بعث النار من ذريتك .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5492.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5492.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5492.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"السَّمَاءُ مُنْفَطِرٌ بِهِ ۚ كَانَ وَعْدُهُ مَفْعُولًا","transliteration":"Assamaaa'u munfatirum bih; kaana wa'duhoo maf'oola","translations":{"en.ahmedali":"The heavens itself will be rent asunder (on that day). His promise is bound to be fulfilled.","en.ahmedraza":"The heaven will split asunder with its grief; the promise of Allah will surely occur.","en.arberry":"Whereby heaven shall be split, and its promise shall be performed.","en.asad":"[the Day] on which the skies shall be rent asunder, [and] His promise [of resurrection] fulfilled?","en.daryabadi":"And the heaven shall be split there in. His promise needs must be fulfilled.","en.hilali":"Whereon the heaven will be cleft asunder? His Promise is certainly to be accomplished.","en.pickthall":"The very heaven being then rent asunder. His promise is to be fulfilled.","en.qaribullah":"on which the heaven will split apart, and His promise is done.","en.sahih":"The heaven will break apart therefrom; ever is His promise fulfilled.","en.sarwar":"On that day, the heavens will be rent asunder. This is the decree of God which has already been ordained.","en.yusufali":"Whereon the sky will be cleft asunder? His Promise needs must be accomplished.","en.maududi":"the Day whose severity shall cause the heaven to split asunder? Allah's promise is ever bound to be fulfilled.","en.shakir":"The heaven shall rend asunder thereby; His promise is ever brought to fulfillment.","en.itani":"The heaven will shatter thereby. His promise is always fulfilled.","en.mubarakpuri":"Whereon the heaven will be cleft asunder His promise is certainly to be accomplished.","en.qarai":"and wherein the sky will be rent apart? His promise is bound to be fulfilled.","en.wahiduddin":"The Day when the heavens will be rent asunder and God's promise shall be fulfilled."},"tafsir":{"ar.muyassar":"السماء متصدعة في ذلك اليوم؛ لشدة هوله، كان وعد الله تعالى بمجيء ذلك اليوم واقعًا لا محالة.","ar.jalalayn":"«السماء منفطر» ذات انفطار، أي انشقاق «به» بذلك اليوم لشدته «كان وعده» تعالى بمجيء ذلك «مفعولا» أي هو كائن لا محالة.","ar.qurtubi":"قوله تعالى : السماء منفطر به أي متشققة لشدته . ومعنى ( به ) أي فيه ; أي في ذلك اليوم لهوله . هذا أحسن ما قيل فيه . ويقال : مثقلة به إثقالا يؤدي إلى انفطارها لعظمته عليها وخشيتها من وقوعه ، كقوله تعالى : ثقلت في السماوات والأرض . وقيل : به أي له ، أي لذلك اليوم ; يقال : فعلت كذا بحرمتك ولحرمتك ، والباء واللام وفي متقاربة في مثل هذا الموضع ; قال الله تعالى : ونضع الموازين القسط ليوم القيامة أي في يوم القيامة . وقيل : به أي بالأمر أي السماء منفطر بما يجعل الولدان شيبا . وقيل : منفطر بالله ، أي بأمره ، وقال أبو عمرو بن العلاء : لم يقل منفطرة ; لأن مجازها السقف ; تقول : هذا سماء البيت ; قال الشاعر :[ ص: 48 ] فلو رفع السماء إليه قوما     لحقنا بالسماء وبالسحابوفي التنزيل : وجعلنا السماء سقفا محفوظا . وقال الفراء : السماء يذكر ويؤنث . وقال أبو علي : هو من باب الجراد المنتشر ، والشجر الأخضر ، و ( أعجاز نخل منقعر ) . وقال أبو علي أيضا : أي السماء ذات انفطار ; كقولهم : امرأة مرضع ، أي ذات إرضاع ، فجرى على طريق النسب . كان وعده أي بالقيامة والحساب والجزاء مفعولا كائنا لا شك فيه ولا خلف . وقال مقاتل : كان وعده بأن يظهر دينه على الدين كله .\n","ar.miqbas":"السَّمَاءُ مُنْفَطِرٌ بِهِ كَانَ وَعْدُهُ مَفْعُولًا (18)وجملة السماء منفطر به } صفة ثانية .والبَاء بمعنى ( في ) وهو ارتقاء في وصف اليوم بحدوث الأهوال فيه فإن انفطار السماء أشد هولاً ورعباً مما كني عنه بجملة { يجعل الولدان شيباً . } أي السماء عَلى عظمها وسمكها تنفطر لذلك اليوم فما ظنكم بأنفسكم وأمثالكم من الخلائق فيه .والانفطار : التشقق الذي يحدث في السماء لنزول الملائكة وصعودهم كما تقدم في قوله تعالى : { تعرج الملائكة والروح إليه } في سورة المعارج ( 4 ) .وذكر انفطار السماء في ذلك اليوم زيادة في تهويل أحواله لأن ذلك يزيد المهددين رعباً وإن لم يكن انفطار السماء من آثار أعمالهم ولا لَه أثر في زيادة نكالهم .ويجوز أن تجعل جملة السماء منفطر به } مستأنفة معترضة بين جملة { فكيف تتقون } الخ ، وجملة { كان وعده مفعولاً } والباء للسببية ويكون الضمير المجرور بالباء عائداً إلى الكفر المأخوذ من فعل { كفرتم .ويجوز أن يكون الإِخبار بانفطار السماء على طريقة التشبيه البليغ ، أي كالمنفطر به فيكون المعنى كقوله تعالى : { وقالوا اتخذ الرحمان ولداً لقد جئتم شيئاً إدَّاً يكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هداً } [ مريم : 88 90 ] .ووصف السماء بمنفطر بصيغة التذكير مع أن السماء في اللغة من الأسماء المعتبرة مؤنثة في الشائع . قال الفراء : السماء تذكَّر على التأويل بالسقف لأن أصل تسميتها سماءً على التشبيه بالسقف ، أي والسقف مُذكر والسماء مؤنث . وتبعه الجوهري وابن برّي . وأنشد الجوهري على ذلك قول الشاعر :فلو رَفع السماءُ إليه قوماً ... لحقنا بالسماء مع السحابوأنشد ابن برّي أيضاً في تذكير السماء بمعنى السقف قول الآخر :وقالت سماءُ البيت فوقَك مُخْلَقٌ ... ولمَّا تَيَسَّر اجْتِلاَءُ الركَائبولا ندري مقدار صحة هاذين الشاهدين من العربية على أنه قد يكونان من ضرورة الشعر . وقيل : إذا كان الاسم غير حقيقي التأنيث جاز إجراء وصفه على التذكير فلا تلحقه هاء التأنيث قياساً على الفعل المسند للمؤنث غير حقيقي التأنيث في جواز اقترانه بتاء التأنيث وتجريده منها ، إجراء للوصف مجرى الفعل وهو وجيه .ولعل العدول في الآية عن الاستعمال الشائع في الكلام الفصيح في إجراء السماء على التأنيث ، إلى التذكير إيثاراً لتخفيف الوصف لأنه لما جيء به بصيغة منفعل بحرفي زيادة وهما الميم والنون كانت الكلمة معرضة للثقل إذا ألحق بها حرف زائد آخر ثالث ، وهو هاء التأنيث فيحصل فيها ثقل يجنَّبه الكلام البالغ غاية الفصاحة ألا ترى أنها لم تجر على التذكير في قوله : { إذا السماء انفطرت } [ الانفطار : 1 ] إذ ليس في الفعل إلاّ حرف مزيد واحد وهو النون إذ لا اعتداد بهمزة الوصل لأنها ساقطة في حالة الوصل ، فجاءت بعدها تاء التأنيث .وجملة { كان وعده مفعولاً } صفة أخرى ل { يوماً ، } وهذا الوصف إدماج للتصريح بتحقيق وقوع ذلك اليوم بعد الإِنذار به الذي هو مقتض لوقوعه بطريق الكناية استقصاء في إبلاغ ذلك إلى علمهم وفي قطع معذرتهم .وضمير { وعده } عائد إلى { يوماً } الموصوف ، وإضافة ( وعد ) إليه من إضافة المصدر إلى مفعوله على التوسع ، أي الوعد به ، أي بوقوعه .\n","ar.waseet":"وقوله : ( السَّمَآءُ مُنفَطِرٌ بِهِ ) صفة ثانية لهذا اليوم .والمراد بالولدان : الأطفار الصغار ، وبه بمعنى فيه . .والمقصود بهاتين الآيتين - أيضا - تأكيد التهديد للمشركين ، حتى يقلعوا عن شركهم وكفرهم . . أى : إذا كان الأمر كما ذكرنا لكم من سوء عاقبة المكذبين ، فكيف تصونون أنفسكم - إذا ما بقيتم على كفركم - من عذاب يوم هائل شديد ، هذا اليوم من صفاته أنه يحول الشعر الشديد السواد للولدان ، إلى شعر شديد البياض ..وهذا اليوم من صفاته - أيضا - أنه لشدة هوله ، أن السماء - مع عظمها وصلابتها - تصير شيئا منفطرا - أى : متشققا ( به ) أى : فيه ، والضمير يعود إلى اليوم . .وصدر - سبحانه - الحديث عن يوم القيامة ، بلفظ الاستفهام \" كيف \" للإِشعار بشدة هوله . وأنه يعجز الواصفون عن وصفه .ووصف - سبحانه - هذا اليوم بأنه يشيب فيه الولدان ، ثم وصفه بأن السماء مع عظمها تتشقق فيه ، للارتقاء فى الوصف من العظيم إلى الأعظم ، إذ أن تحول شعر الأطفال من السوادإلى البياض - مع شدته وعظمه - أشد منه وأعظم ، انشقاق السماء فى هذا اليوم .قال صاحب الكشاف : وقوله ( يَجْعَلُ الولدان شِيباً ) مثل فى الشدة ، يقال فى اليوم الشديد ، يوم يشيب نواصى الأطفال والأصل فيه أن الهموم والأحزان ، إذا تفاقمت على الإِنسان ، أسرع فيه الشيب ، كما قال أبو الطيب :والهَمُّ يَخْتَرِم الجسيمَ نحافةً ... ويُشِيبُ ناصيةَ الصبى ويُهْرِمويجوز أن يوصف اليوم بالطول ، وأن الأطفال يبلغون فيه أوان الشيخوخة والشيب . وقوله : ( السَّمَآءُ مُنفَطِرٌ بِهِ ) وصف لليوم بالشدة - أيضا - وأن السماء على عظمها وإحكامها تنفطر فيه فما ظنك بغيرها من الخلائق . .ووصف - سبحانه - السماء بقوله : ( مُنفَطِرٌ ) بصيغة التذكير ، حيث لم يقل منفطرة ، لأن هذه الصيغة ، صيغة نسب . أى : ذات انفطار ، كما فى قولهم : امرأة مرضع وحائض ، أى : ذات إرضاع وذات حيض . أو على تأويل أن السماء بمعنى السقف ، كما فى قوله - تعالى - : ( وَجَعَلْنَا السمآء سَقْفاً مَّحْفُوظاً ) أو على أن السماء اسم جنس واحده سماوة ، فيجوم وصفه بالتذكير والتأنيث .وقوله : ( كَانَ وَعْدُهُ مَفْعُولاً ) الضمير فيه يعود إلى الخالق - عز وجل - والوعد مصدر مضاف لفاعله . أى : كان وعد ربك نافذا ومفعولا ، لأنه - سبحانه - لا يخلف موعوده .ويجوز أن تكون هذه الجملة صفة ثالثة لليوم ، والضمير فى وعده يعود إليه ، ويكون من إضافة المصدر لمفعوله . أى : كان الوعد بوقوع يوم القيامة نافذا ومفعولا .\n","ar.baghawi":"ثم وصف هو ذل اليوم فقال: \"السماء منفطر به\"، متشقق لنزول الملائكة به أي: بذلك المكان. وقيل: الهاء ترجع إلى الرب أي: بأمره وهيبته، \"كان وعده مفعولاً\"، كائناً.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5493.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5493.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5493.mp3","format":"mp3","local_path":null}}},{"verse":19,"arabic":"إِنَّ هَٰذِهِ تَذْكِرَةٌ ۖ فَمَنْ شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا","transliteration":"Inna haazihee tazkiratun fa man shaaa'at takhaza ilaa Rabbihee sabeelaa","translations":{"en.ahmedali":"Verily this is a reminder. So let him who desires take the way to his Lord.","en.ahmedraza":"This is indeed an advice; so whoever wishes may take the path towards his Lord.","en.arberry":"Surely this is a Reminder; so let him who will take unto his Lord a way.","en.asad":"This, verily, is a reminder: let him who wills, then set out on a way to his Sustainer!","en.daryabadi":"Verily this is an admonition; let him therefore, who will, choose a way Unto his Lord.","en.hilali":"Verily, this is an admonition, therefore whosoever will, let him take a Path to His Lord!","en.pickthall":"Lo! This is a Reminder. Let him who will, then, choose a way unto his Lord.","en.qaribullah":"This is indeed a Reminder. Let whosoever will take the Path to his Lord.","en.sahih":"Indeed, this is a reminder, so whoever wills may take to his Lord a way.","en.sarwar":"This is a reminder. Let anyone who wants, seek guidance from his Lord.","en.yusufali":"Verily this is an Admonition: therefore, whoso will, let him take a (straight) path to his Lord!","en.maududi":"Indeed this is nothing but a Good Counsel; so let him who will take a way leading to his Lord.","en.shakir":"Surely this is a reminder, then let him, who will take the way to his Lord.","en.itani":"This is a reminder. So whoever wills, let him take a path to his Lord.","en.mubarakpuri":"Verily, this is an admonition, therefore whosoever wills, let him take a path to His Lord!","en.qarai":"This is indeed a reminder. So let anyone who wishes take the way toward his Lord.","en.wahiduddin":"This, surely, is an admonition. So let him who will, take the right path to his Lord."},"tafsir":{"ar.muyassar":"إن هذه الآيات المخوفة التي فيها القوارع والزواجر عظة وعبرة للناس، فمن أراد الاتعاظ والانتفاع بها اتخذ الطاعة والتقوى طريقًا توصله إلى رضوان ربه الذي خلقه وربَّاه.","ar.jalalayn":"«إن هذه» الآيات المخوِّفة «تذكرة» عظة للخلق «فمن شاء اتخذ إلى ربه سبيلا» طريقا بالإيمان والطاعة.","ar.qurtubi":"قوله تعالى : إن هذه تذكرة يريد : هذه السورة أو الآيات عظة . وقيل : آيات القرآن ، إذ هو كالسورة الواحدة .فمن شاء اتخذ إلى ربه أي من أراد أن يؤمن ويتخذ بذلك إلى ربه سبيلا أي طريقا إلى رضاه ورحمته فليرغب ، فقد أمكن له ; لأنه أظهر له الحجج والدلائل . ثم قيل : نسخت بآية السيف ، وكذلك قوله تعالى : فمن شاء ذكره قال الثعلبي : والأشبه أنه غير منسوخ .\n","ar.miqbas":"إِنَّ هَذِهِ تَذْكِرَةٌ فَمَنْ شَاءَ اتَّخَذَ إِلَى رَبِّهِ سَبِيلًا (19)تذييل أي تذكرة لمن يتذكر فإن كان من منكري البعث آمن به وإن كان مؤمناً استفاق من بعض الغفلة التي تعرض للمؤمن فاستدرك ما فاته ، وبهذا العموم الشامل لأحوال المتحدث عنهم وأحوال غيرهم كانت الجملة تذييلاً .والإِشارة ب { هذه } إلى الآيات المتقدمة من قوله : { إنا أرسلنا إليكم رسولاً شاهداً عليكم } [ المزمل : 15 ] .وتأكيد الكلام بحرف التأكيد لأن المواجَهين به ابتداءً هم منكرون كون القرآن تذكرة وهدًى فإنهم كذبوا بأنه من عند الله ووسموه بالسحر وبالأساطير ، وذلك من أقوالهم التي أرشد رسول الله صلى الله عليه وسلم إلى الصبر عليها قال تعالى : { واصبر على ما يقولون } [ المزمل : 10 ] .والتذكِرة : اسم لمصدر الذُكر بضم الذال ، الذي هو خطور الشيء في البال ، فالتذكرة : الموعظة لأنه تذكر الغافل عن سوء العواقب ، وهذا تنويه بآيات القرآن وتجديد للتحريض على التدبر فيه والتفكر على طريقة التعريض .وفرع على هذا التحريض التعريضيَّ تحريضٌ صريح بقوله : { فمن شاء اتخذ إلى ربّه سبيلاً } أي من كان يريد أن يتخذ إلى ربّه سبيلاً فقد تهيأ له اتخاذ السبيل إلى الله بهذه التذكرة فلم تَبق للمتغافل معذرة .والإِتيان بموصول { من شاء } من قبيل التحريض لأنه يقتضي أن هذا السبيل موصل إلى الخير فلا حائل يحول بين طالب الخير وبين سلوك هذا السبيل إلاّ مشيئته ، لأن قوله : { إن هذه تذكرة } قرينة على ذلك . ومن هذا القبيل قوله تعالى : { وقل الحقُ من ربّكم فمن شاء فليؤمن ومن شاء فليكفر } [ الكهف : 29 ] . فليس ذلك إباحةً للإِيمان والكفر ولكنه تحريض على الإِيمان ، وما بعده تحذير من الكفر ، أي تبعة التفريط في ذلك على المفرط . ولذلك قال ابن عطية : ليس معناه إباحة الأمر وضده بل يتضمن معنى الوعد والوعيد .وفي تفسير ابن عرفة الذي كان بعض شيوخنا يحملها على أنه مخير في تعيين السبيل فمتعلق التخيير عنده أن يبين سبيلاً ما من السُبل قال : وهو حسن ، فيبقى ظاهر الآية على حاله من التّخيير اه .وقد علمت ممّا قرّرناه أنه لا حاجة إليه وأن ليس في الآية شيء بمعنى التخيير . وفي قوله : { إلى ربّه } تمثيل لحال طالب الفوز والهُدى بحال السائر إلى ناصر أو كريم قد أريَ السبيلَ الذي يبلِّغه إلى مقصده فلم يبق له ما يعوقه عن سلوكه .\n","ar.waseet":"ثم ختم - سبحانه - هذه التهديدات بقوله : ( إِنَّ هذه تَذْكِرَةٌ فَمَن شَآءَ اتخذ إلى رَبِّهِ سَبِيلاً ) .واسم الإِشارة \" هذه \" يعود إلى الآيات المتقدمة ، المشتملة على الكثير من القوارع والزواجر .والتذكرة : اسم مصدر بمعنى التذكير والاتعاظ والاعتبار . ومفعول \" شاء \" محذوف .والمعنى : إن هذه الآيات التى سقناها لكم تذكرة وموعظة ، فمن شاء النجاة من أهوال يوم القيامة ، فعليه أن يؤمن بالله - تعالى - إيمانا حقا ، وأن يتخذ بسبب إيامنه وعمله الصالح ، طريقا وسبيلا إلى ربه ورحمته ومغفرته .والتعبير بقوله : ( فَمَن شَآءَ اتخذ .. . ) ليس من قبيل التخبير ، وإنما المقصود به الحض والحث على سلوك الطريق الموصل إلى الله - تعالى - بدليل قوله - تعالى - قبل ذلك : ( إِنَّ هذه تَذْكِرَةٌ ) أى : هذه الآيات تذكرة وموعظة ، فمن ترك العمل بها ساءت عاقبته ، ولم يكن من الذين سلكوا طريق النجاة .وشبيه بهذه الآية قوله - تعالى - : ( وَقُلِ الحق مِن رَّبِّكُمْ فَمَن شَآءَ فَلْيُؤْمِن وَمَن شَآءَ فَلْيَكْفُرْ ) هذا ، والمتأمل فى هذه الآيات الكريمة ، - من أول السورة إلى هنا - يراها قد نادت الرسول صلى الله عليه وسلم نداء فيه ما فيه من الملاطفة والمؤانسة ، وأمرته بأن يقوم الليل إلا قليلا متعبدا لربه ، كما أمرته بالصبر على أذى المشركين ، حتى يحكم الله - تعالى - بينه وبينهم .كما يراها قد هددت المكذبين بأشد أنواع التهديد ، وذكرتهم بأهوال يوم القيامة ، وبما حل بالمكذبين من قبلهم ، وحرضتهم على سلوك الطريق المستقيم .\n","ar.baghawi":"\"إن هذه\"، أي: آيات القرآن \"تذكرة\"، تذكير وموعظة، \"فمن شاء اتخذ إلى ربه سبيلاً\"، بالإيمان والطاعة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5494.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5494.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5494.mp3","format":"mp3","local_path":null}}},{"verse":20,"arabic":"۞ إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِنَ الَّذِينَ مَعَكَ ۚ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ ۚ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ ۚ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضَىٰ ۙ وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ ۙ وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا ۚ وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ وَاسْتَغْفِرُوا اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","transliteration":"Inna Rabbaka ya'lamu annaka taqoomu adnaa min sulusa yil laili wa nisfahoo wa sulusahoo wa taaa'ifatum minal lazeena ma'ak; wal laahu yuqaddirul laila wanna haar; 'alima al lan tuhsoohu fataaba 'alaikum faqra'oo maa tayassara minal quraan; 'alima an sa yakoonu minkum mardaa wa aakharoona yadriboona fil ardi yabtaghoona min fadlil laahi wa aakharoona yuqaatiloona fee sabeelil laahi faqra'oo ma tayassara minhu wa aqeemus salaata wa aatuz zakaata wa aqridul laaha qardan hasanaa; wa maa tuqadimoo li anfusikum min khairin tajidoohu 'indal laahi huwa khayranw wa a'zama ajraa; wastaghfirul laahaa innal laaha ghafoorur raheem.","translations":{"en.ahmedali":"Your Lord surely knows that you are occupied with your devotions for nearly two-thirds of the night, or half the night, or one-third of it, as do many others with you. Yet God prescribes the measure of night and day. He knows you cannot calculate it, and so turns to you in benevolence. So recite as much of the Qur'an as you can easily. He knows some among you will be sick, and some will be travelling over the earth in search of the bounty of God, and some fighting in the way of God. So read as much from it as you can easily, and be firm in devotion, pay the zakat, and lend a goodly loan to God. And what you send for yourself of the good, you will find it with God better and greater in reward. So ask for God's forgiveness. Indeed God is forgiving and kind.","en.ahmedraza":"Indeed your Lord knows that you stand up in prayer, sometimes almost two-thirds of the night, and sometimes half the night or sometimes a third of it – and also a group of those along with you; Allah keeps measure of the night and day; He knows that you, O Muslims, will not be able to measure the night, so He has inclined towards you with mercy – therefore recite from the Qur’an as much as is easy for you; He knows that soon some of you will fall ill, and some will travel in the land seeking the munificence of Allah, and some will be fighting in Allah’s cause; therefore recite from the Qur’an as much as is easy for you, and establish prayer and pay the obligatory charity, and lend an excellent loan to Allah; and whatever good you send ahead for yourselves, you will find it with Allah, better and having a great reward; and seek forgiveness from Allah; indeed Allah is Oft Forgiving, Most Merciful.","en.arberry":"Thy Lord knows that thou keepest vigil nearly two-thirds of the night, or a half of it, or a third of it, and a party of those with thee; and God determines the night and the day. He knows that you will not number it, and He has turned towards you. Therefore recite of the Koran so much as is feasible. He knows that some of you are sick, and others journeying in the land, seeking the bounty of God, and others fighting in the way of God. So recite of it so much as is feasible. And perform the prayer, and pay the alms, and lend to God a good loan. Whatever good you shall forward to your souls' account, you shall find it with God as better, and mightier a wage. And ask God's forgiveness; God is All-forgiving, All-compassionate.","en.asad":"BEHOLD, [O Prophet,] thy Sustainer knows that thou keepest awake [in prayer] nearly two-thirds of the night, or one-half of it, or a third of it, together with some of those who follow thee. And God who determines the measure of night and day, is aware that you would never grudge it: and therefore He turns towards you in His grace. Recite, then, as much of the Qur’an as you may do with ease. He knows that in time there will be among you sick people, and others who will go about the land in search of God's bounty, and others who will fight in God’s cause. Recite, then, [only] as much of it as you may do with ease, and be constant in prayer, and spend in charity, and [thus] lend unto God a goodly loan: for whatever good deed you may offer up in your own behalf, you shall truly find it with God - yea, better, and richer in reward. And [always] seek God's forgiveness: behold, God is much-forgiving, a dispenser of grace!","en.daryabadi":"Verily thy Lord knoweth that thou stayest up near two- thirds of the night, Or half thereof, or a third thereof, and also a party of those who are with thee. And Allah measureth the night and the day. He knoweth that ye can compute it not, He hath relented toward you. Wherefore recite now of the Qur'an, so much as is easy. He knoweth that there will be among you some diseased, and others shall be travelling in the land seeking grace of Allah, and others shall be fighting in the way of Allah. Wherefore recite thereof so much as is easy; and establish the prayer and give the poor-rate and lend Unto Allah a goodly loan. Whatsoever good ye shall send on for your souls, ye shall find it with Allah, better and greater in reward. And ask forgiveness of Allah; verily Allah is Forgiving, Merciful.","en.hilali":"Verily, your Lord knows that you do stand (to pray at night) a little less than two-thirds of the night, or half the night, or a third of the night, and so do a party of those with you, And Allah measures the night and the day. He knows that you are unable to pray the whole night, so He has turned to you (in mercy). So, recite you of the Quran as much as may be easy for you. He knows that there will be some among you sick, others travelling through the land, seeking of Allah's Bounty; yet others fighting in Allah's Cause. So recite as much of the Quran as may be easy (for you), and perform As-Salat (Iqamat-as-Salat) and give Zakat, and lend to Allah a goodly loan, and whatever good you send before you for yourselves, (i.e. Nawafil non-obligatory acts of worship: prayers, charity, fasting, Hajj and 'Umrah, etc.), you will certainly find it with Allah, better and greater in reward. And seek Forgiveness of Allah. Verily, Allah is Oft-Forgiving, Most-Merciful.","en.pickthall":"Lo! thy Lord knoweth how thou keepest vigil sometimes nearly two-thirds of the night, or (sometimes) half or a third thereof, as do a party of those with thee. Allah measureth the night and the day. He knoweth that ye count it not, and turneth unto you in mercy. Recite, then, of the Qur'an that which is easy for you. He knoweth that there are sick folk among you, while others travel in the land in search of Allah's bounty, and others (still) are fighting for the cause of Allah. So recite of it that which is easy (for you), and establish worship and pay the poor-due, and (so) lend unto Allah a goodly loan. Whatsoever good ye send before you for your souls, ye will find it with Allah, better and greater in the recompense. And seek forgiveness of Allah. Lo! Allah is Forgiving, Merciful.","en.qaribullah":"Your Lord knows that you keep vigil nearly two thirds of the night and sometimes half or onethird of it, and a party of those with you. Allah measures thenight and the day. He knows that you cannot count it, and turns to you. Therefore, recite from the Koran as much as is easy (for you); He knows that among youthere are the sick and others traveling the road seeking the bounty of Allah; and others fighting in the Way of Allah. So then, recite from it as much as is easy. Establish your prayers, pay the obligatory charity, and lend Allah a generous loan. Whatever good you shall forward to your souls' account, you surely will find it better with Allah, and a mightier wage. And supplicate for the forgiveness of Allah. Allah is the Forgiving, the Merciful.","en.sahih":"Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.","en.sarwar":"Your Lord knows that you and a group of those who are with you get up for prayer sometimes for less than two-thirds of the night, sometimes half and sometimes one-third of it. God determines the duration of the night and day. He knew that it would be hard for you to keep an exact account of the timing of the night prayers, so He turned to you with forgiveness. Thus, recite from the Quran as much as possible. He knew that some of you would be sick, others would travel in the land to seek God's favors, and still others would fight for the cause of God. Thus, recite from the Quran as much as possible, be steadfast in prayer, pay the zakat, and give virtuous loans to God. Whatever good deeds you save for the next life, you will certainly find them with God. This is the best investment, and for this you will find the greatest reward. Ask forgiveness from God. God is All-forgiving and All-merciful.","en.yusufali":"Thy Lord doth know that thou standest forth (to prayer) nigh two-thirds of the night, or half the night, or a third of the night, and so doth a party of those with thee. But Allah doth appoint night and day in due measure He knoweth that ye are unable to keep count thereof. So He hath turned to you (in mercy): read ye, therefore, of the Qur'an as much as may be easy for you. He knoweth that there may be (some) among you in ill-health; others travelling through the land, seeking of Allah's bounty; yet others fighting in Allah's Cause, read ye, therefore, as much of the Qur'an as may be easy (for you); and establish regular Prayer and give regular Charity; and loan to Allah a Beautiful Loan. And whatever good ye send forth for your souls ye shall find it in Allah's Presence,- yea, better and greater, in Reward and seek ye the Grace of Allah: for Allah is Oft-Forgiving, Most Merciful.","en.maududi":"(O Prophet), your Lord knows that you sometimes stand up in Prayer nearly two-thirds of the night, and sometimes half or one-third of it, and so does a party of those with you; Allah measures the night and the day. He knows that you cannot keep an accurate count of it, so He has shown mercy to you. So now recite as much of the Qur'an as you can. He knows that there are among you those who are sick and others who are journeying in the land in quest of Allah's bounty, and still others who are fighting in the cause of Allah. So recite as much of the Qur'an as you easily can, and establish Prayer, and pay Zakah, and give Allah a goodly loan. Whatever good you send forth for yourselves, you shall find it with Allah. That is better and its reward is greater. And ask for Allah's forgiveness; surely He is Most Forgiving, Most Compassionate.","en.shakir":"Surely your Lord knows that you pass in prayer nearly two-thirds of the night, and (sometimes) half of it, and (sometimes) a third of it, and (also) a party of those with you; and Allah measures the night and the day. He knows that you are not able to do it, so He has turned to you (mercifully), therefore read what is easy of the Quran. He knows that there must be among you sick, and others who travel in the land seeking of the bounty of Allah, and others who fight in Allah's way, therefore read as much of it as is easy (to you), and keep up prayer and pay the poor-rate and offer to Allah a goodly gift, and whatever of good you send on beforehand for yourselves, you will find it with Allah; that is best and greatest in reward; and ask forgiveness of Allah; surely Allah is Forgiving, Merciful.","en.itani":"Your Lord knows that you stay up nearly two-thirds of the night, or half of it, or one-third of it, along with a group of those with you. God designed the night and the day. He knows that you are unable to sustain it, so He has pardoned you. So read of the Quran what is possible for you. He knows that some of you may be ill; and others travelling through the land, seeking God’s bounty; and others fighting in God’s cause. So read of it what is possible for you, and observe the prayers, and give regular charity, and lend God a generous loan. Whatever good you advance for yourselves, you will find it with God, better and generously rewarded. And seek God’s forgiveness, for God is Forgiving and Merciful.","en.mubarakpuri":"Verily, your Lord knows that you do stand a little less than two-thirds of the night, or half the night, or a third of the night, and also a party of those with you. And Allah measures the night and the day. He knows that you are unable to pray the whole night, so He has turned to you. So, recite you of the Qur'an as much as may be easy for you. He knows that there will be some among you sick, others traveling through the land, seeking of Allah's bounty, yet others fighting in Allah's cause. So recite as much of the Qur'an as may be easy,","en.qarai":"Indeed your Lord knows that you stand vigil for nearly two thirds of the night—or [at times] a half or a third of it—along with a group of those who are with you. Allah measures the night and the day. He knows that you cannot calculate it [exactly], and so He was lenient toward you. So recite as much of the Quran as is feasible. He knows that some of you will be sick, while others will travel in the land seeking Allah’s bounty, and yet others will fight in the way of Allah. So recite as much of it as is feasible, and maintain the prayer and pay the zakat and lend Allah a good loan. Whatever good you send ahead for your souls you will find it with Allah [in a form] that is better and greater with respect to reward. And plead to Allah for forgiveness; indeed Allah is all-forgiving, all-merciful.","en.wahiduddin":"Your Lord knows that you stand up praying for nearly two-thirds of the night, or one-half of it and sometimes one third of it, as do others among your followers. God determines the measure of night and day. He knows that you will not be able to do it, so He has turned to you in mercy. Recite, then, as much of the Quran as is easy for you. He knows that there will be some among you who may be sick and others who will be travelling throughout the land seeking God's bounty, and yet others who may be fighting for the cause of God. So, recite, then as much of it as you are able, and be constant in prayer, and spend in charity, and give to God a goodly loan. For whatever good deed you send on before you for your souls, you will find it with God. It will be improved and richly rewarded by Him. Seek God's forgiveness, He is most forgiving, most merciful."},"tafsir":{"ar.muyassar":"إن ربك -أيها النبي- يعلم أنك تقوم للتهجد من الليل أقل من ثلثيه حينًا، وتقوم نصفه حينًا، وتقوم ثلثه حينًا آخر، ويقوم معك طائفة من أصحابك. والله وحده هو الذي يقدِّر الليل والنهار، ويعلم مقاديرهما، وما يمضي ويبقى منهما، علم الله أنه لا يمكنكم قيام الليل كله، فخفَّف عليكم، فاقرؤوا في الصلاة بالليل ما تيسر لكم قراءته من القرآن، علم الله أنه سيوجد فيكم مَن يُعجزه المرض عن قيام الليل، ويوجد قوم آخرون يتنقَّلون في الأرض للتجارة والعمل يطلبون من رزق الله الحلال، وقوم آخرون يجاهدون في سبيل الله؛ لإعلاء كلمته ونشر دينه، فاقرؤوا في صلاتكم ما تيسَّر لكم من القرآن، وواظبوا على فرائض الصلاة، وأعطوا الزكاة الواجبة عليكم، وتصدَّقوا في وجوه البر والإحسان مِن أموالكم؛ ابتغاء وجه الله، وما تفعلوا مِن وجوه البر والخير وعمل الطاعات، تلقَوا أجره وثوابه عند الله يوم القيامة خيرًا مما قدَّمتم في الدنيا، وأعظم منه ثوابًا، واطلبوا مغفرة الله في جميع أحوالكم، إن الله غفور لكم رحيم بكم.","ar.jalalayn":"«إن ربك يعلم أنك تقوم أَدنى» أقل «من ثلثي الليل ونصفِه وثلثِه» بالجر عطف على ثلثي وبالنصب على أدنى وقيامه كذلك نحو ما أمر به أول السورة «وطائفة من الذين معك» عطف على ضمير تقوم وجاز من غير تأكيد للفصل وقيام طائفة من أصحابه كذلك للتأسي به ومنهم من كان لا يدري كم صلّى من الليل وكم بقي منه فكان يقوم الليل كله احتياطا فقاموا حتى انتفخت أقدامهم سنة أو أكثر فخفف عنهم قال تعالى: «والله يقدر» يحصي «الليل والنهار علم أن» مخففة من الثقيلة واسمها محذوف، أي أنه «لن تحصوه» أي الليل لتقوموا فيما يجب القيام فيه إلا بقيام جميعه وذلك يشق عليكم «فتاب عليكم» رجع بكم إلى التخفيف «فاقرؤوا ما تيسر من القرآن» في الصلاة بأن تصلوا ما تيسر «علم أن» مخففة من الثقيلة، أي أنه «سيكون منكم مرضى وآخرون يضربون في الأرض» يسافرون «يبتغون من فضل الله» يطلبون من رزقه بالتجارة وغيرها «وآخرون يقاتلون في سبيل الله» وكل من الفرق الثلاثة يشق عليهم ما ذكر في قيام الليل فخفف عنهم بقيام ما تيسر منه ثم نسخ ذلك بالصلوات الخمس «فاقرؤوا ما تيسر منه» كما تقدم «وأقيموا الصلاة» المفروضة «وآتوا الزكاة وأقرضوا الله» بأن تنفقوا ما سوى المفروض من المال في سبيل الخير «قرضا حسنا» عن طيب قلب «وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا» مما خلفتم وهو فصل وما بعده وإن لم يكن معرفة يشبهها لامتناعه من التعريف «وأعظم أجرا واستغفروا الله إن الله غفور رحيم» للمؤمنين.","ar.qurtubi":"قوله تعالى : إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك والله يقدر الليل والنهار علم أن لن تحصوه فتاب عليكم فاقرؤوا ما تيسر من القرآن علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله فاقرؤوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضا حسنا وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وأعظم أجرا واستغفروا الله إن الله غفور رحيمفيه ثلاثة عشر مسألة :الأولى : قوله تعالى : إن ربك يعلم أنك تقوم هذه الآية تفسير لقوله تعالى : قم الليل إلا قليلا نصفه أو انقص منه قليلا أو زد عليه كما تقدم ، وهي الناسخة لفرضية قيام الليل كما تقدم .( تقوم ) معناه تصلي و ( أدنى ) أي أقل . وقرأ ابن السميقع وأبو حيوة وهشام عن أهل الشام ( ثلثي ) بإسكان اللام .ونصفه وثلثه بالخفض قراءة العامة عطفا على ( ثلثي ) ; المعنى : تقوم أدنى من ثلثي الليل ومن نصفه وثلثه . واختاره أبو عبيد وأبو حاتم ; [ ص: 49 ] كقوله تعالى : علم أن لن تحصوه فكيف يقومون نصفه أو ثلثه وهم لا يحصونه . وقرأ ابن كثير والكوفيون ونصفه وثلثه بالنصب عطفا على ( أدنى ) التقدير : تقوم أدنى من ثلثي الليل وتقوم نصفه وثلثه . قال الفراء : وهو أشبه بالصواب ; لأنه قال أقل من الثلثين ، ثم ذكر نفس القلة لا أقل من القلة .القشيري : وعلى هذه القراءة يحتمل أنهم كانوا يصيبون الثلث والنصف ; لخفة القيام عليهم بذلك القدر ، وكانوا يزيدون ، وفي الزيادة إصابة المقصود ، فأما الثلثان فكان يثقل عليهم قيامه فلا يصيبونه ، وينقصون منه . ويحتمل أنهم أمروا بقيام نصف الليل ، ورخص لهم في الزيادة والنقصان ، فكانوا ينتهون في الزيادة إلى قريب من الثلثين ، وفي النصف إلى الثلث . ويحتمل أنهم قدر لهم النصف وأنقص إلى الثلث ، والزيادة إلى الثلثين ، وكان فيهم من يفي بذلك ، وفيهم من يترك ذلك إلى أن نسخ عنهم . وقال قوم : إنما افترض الله عليهم الربع ، وكانوا ينقصون من الربع . وهذا القول تحكم .الثانية : قوله تعالى : والله يقدر الليل والنهار أي يعلم مقادير الليل والنهار على حقائقها ، وأنتم تعلمون بالتحري والاجتهاد الذي يقع فيه الخطأ . علم أن لن تحصوه أي لن تطيقوا معرفة حقائق ذلك والقيام به . وقيل : أي لن تطيقوا قيام الليل . والأول أصح ; فإن قيام الليل ما فرض كله قط .قال مقاتل وغيره : لما نزلت : قم الليل إلا قليلا نصفه أو انقص منه قليلا أو زد عليه شق ذلك عليهم ، وكان الرجل لا يدري متى نصف الليل من ثلثه ، فيقوم حتى يصبح مخافة أن يخطئ ، فانتفخت أقدامهم ، وانتقعت ألوانهم ، فرحمهم الله وخفف عنهم ; فقال تعالى : علم أن لن تحصوه و \" أن \" مخففة من الثقيلة ; أي علم أنكم لن تحصوه ; لأنكم إن زدتم ثقل عليكم ، واحتجتم إلى تكليف ما ليس فرضا ، وإن نقصتم شق ذلك عليكم .الثالثة : قوله تعالى : فتاب عليكم أي فعاد عليكم بالعفو ، وهذا يدل على أنه كان فيهم من ترك بعض ما أمر به . وقيل : أي فتاب عليكم من فرض القيام إذ عجزتم . وأصل التوبة الرجوع كما تقدم ; فالمعنى رجع لكم من تثقيل إلى تخفيف ، ومن عسر إلى يسر . وإنما أمروا بحفظ الأوقات على طريق التحري ، فخفف عنهم ذلك التحري . وقيل : معنى والله يقدر الليل والنهار يخلقهما مقدرين ; كقوله تعالى : وخلق كل شيء فقدره تقديرا . ابن العربي : تقدير الخلقة لا يتعلق به حكم ، وإنما يربط الله به ما يشاء من وظائف التكليف .الرابعة : قوله تعالى : فاقرؤوا ما تيسر من القرآن فيه قولان :أحدهما : أن المراد نفس [ ص: 50 ] القراءة ; أي فاقرؤوا فيما تصلونه بالليل ما خف عليكم . قال السدي : مائة آية . الحسن : من قرأ مائة آية في ليلة لم يحاجه القرآن . وقال كعب : من قرأ في ليلة مائة آية كتب من القانتين . وقال سعيد : خمسون آية .قلت : قول كعب أصح ; لقوله - عليه السلام - : \" من قام بعشر آيات لم يكتب من الغافلين ، ومن قام بمائة آية كتب من القانتين ، ومن قام بألف آية كتب من المقنطرين \" خرجه أبو داود الطيالسي في مسنده من حديث عبد الله بن عمرو . وقد ذكرناه في مقدمة الكتاب والحمد لله .القول الثاني : فاقرؤوا ما تيسر منه أي فصلوا ما تيسر عليكم ، والصلاة تسمى قرآنا ; كقوله تعالى : وقرآن الفجر أي صلاة الفجر . ابن العربي : وهو الأصح ; لأنه عن الصلاة أخبر ، وإليها يرجع القول .قلت : الأول أصح حملا للخطاب على ظاهر اللفظ ، والقول الثاني مجاز ; فإنه من تسمية الشيء ببعض ما هو من أعماله .الخامسة : قال بعض العلماء : قوله تعالى : فاقرؤوا ما تيسر منه نسخ قيام الليل ونصفه ، والنقصان من النصف والزيادة عليه . ثم احتمل قول الله - عز وجل - : فاقرؤوا ما تيسر منه معنيين : أحدهما أن يكون فرضا ثانيا ; لأنه أزيل به فرض غيره . والآخر أن يكون فرضا منسوخا أزيل بغيره كما أزيل به غيره ; وذلك لقوله تعالى : ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا فاحتمل قوله تعالى : ومن الليل فتهجد به نافلة لك أي يتهجد بغير الذي فرض عليه مما تيسر منه . قال الشافعي : فكان الواجب طلب الاستدلال بالسنة على أحد المعنيين ، فوجدنا سنة رسول الله - صلى الله عليه وسلم - تدل على أن لا واجب من الصلاة إلا الخمس .السادسة : قال القشيري أبو نصر : والمشهور أن نسخ قيام الليل كان في حق الأمة ، وبقيت الفريضة في حق النبي - صلى الله عليه وسلم - . وقيل : نسخ التقدير بمقدار ، وبقي أصل الوجوب ; كقوله تعالى : فما استيسر من الهدي فالهدي لا بد منه ، كذلك لم يكن بد من صلاة الليل ، ولكن فوض قدره إلى اختيار المصلي ، وعلى هذا فقد قال قوم : فرض قيام الليل بالقليل باق ; [ ص: 51 ] وهو مذهب الحسن .وقال قوم : نسخ بالكلية ، فلا تجب صلاة الليل أصلا ; وهو مذهب الشافعي . ولعل الفريضة التي بقيت في حق النبي - صلى الله عليه وسلم - هي هذا ، وهو قيامه ، ومقداره مفوض إلى خيرته . وإذا ثبت أن القيام ليس فرضا فقوله تعالى : فاقرؤوا ما تيسر منه معناه اقرؤوا إن تيسر عليكم ذلك ، وصلوا إن شئتم . وصار قوم إلى أن النسخ بالكلية تقرر في حق النبي - صلى الله عليه وسلم - أيضا ، فما كانت صلاة الليل واجبة عليه . وقوله : نافلة لك محمول على حقيقة النفل . ومن قال : نسخ المقدار وبقي أصل وجوب قيام الليل ثم نسخ ، فهذا النسخ الثاني وقع ببيان مواقيت الصلاة ; كقوله تعالى : أقم الصلاة لدلوك الشمس ، وقوله : فسبحان الله حين تمسون وحين تصبحون ، ما في الخبر من أن الزيادة على الصلوات الخمس تطوع . وقيل : وقع النسخ بقوله تعالى : ومن الليل فتهجد به نافلة لك والخطاب للنبي - صلى الله عليه وسلم - وللأمة ، كما أن فرضية الصلاة وإن خوطب بها النبي - صلى الله عليه وسلم - في قوله تعالى : يا أيها المزمل قم الليل كانت عامة له ولغيره .وقد قيل : إن فريضة الله امتدت إلى ما بعد الهجرة ، ونسخت بالمدينة ; لقوله تعالى : علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله ، وإنما فرض القتال بالمدينة ; فعلى هذا بيان المواقيت جرى بمكة ، فقيام الليل نسخ بقوله تعالى : ومن الليل فتهجد به نافلة لك .وقال ابن عباس : لما قدم رسول الله - صلى الله عليه وسلم - نسخ قول الله تعالى : إن ربك يعلم أنك تقوم وجوب صلاة الليل .السابعة : قوله تعالى : علم أن سيكون منكم مرضى الآية ; بين سبحانه علة تخفيف قيام الليل ، فإن الخلق منهم المريض ، ويشق عليهم قيام الليل ، ويشق عليهم أن تفوتهم الصلاة ، والمسافر في التجارات قد لا يطيق قيام الليل ، والمجاهد كذلك ، فخفف الله عن الكل لأجل هؤلاء . و ( أن ) في أن سيكون مخففة من الثقيلة ; أي علم أنه سيكون .الثامنة : سوى الله تعالى في هذه الآية بين درجة المجاهدين والمكتسبين المال الحلال للنفقة على نفسه وعياله ، والإحسان والإفضال ، فكان هذا دليلا على أن كسب المال بمنزلة الجهاد ; لأنه جمعه مع الجهاد في سبيل الله . وروى إبراهيم عن علقمة قال : قال رسول الله - صلى الله عليه وسلم - : \" ما من جالب يجلب طعاما من بلد إلى بلد فيبيعه بسعر يومه إلا كانت منزلته عند الله منزلة الشهداء \" ثم قرأ رسول الله - صلى الله عليه وسلم - : وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله وقال ابن مسعود : أيما رجل جلب شيئا إلى مدينة [ ص: 52 ] من مدائن المسلمين صابرا محتسبا ، فباعه بسعر يومه كان له عند الله منزلة الشهداء . وقرأ وآخرون يضربون في الأرض الآية .وقال ابن عمر : ما خلق الله موتة أموتها بعد الموت في سبيل الله أحب إلي من الموت بين شعبتي رحلي ، أبتغي من فضل الله ضاربا في الأرض . وقال طاوس : الساعي على الأرملة والمسكين كالمجاهد في سبيل الله . وعن بعض السلف أنه كان بواسط ، فجهز سفينة حنطة إلى البصرة ، وكتب إلى وكيله : بع الطعام يوم تدخل البصرة ، ولا تؤخره إلى غد ، فوافق سعة في السعر ; فقال التجار للوكيل : إن أخرته جمعة ربحت فيه أضعافه ، فأخره جمعة فربح فيه أمثاله ، فكتب إلى صاحبه بذلك ، فكتب إليه صاحب الطعام : يا هذا ! إنا كنا قنعنا بربح يسير مع سلامة ديننا ، وقد جنيت علينا جناية ، فإذا أتاك كتابي هذا فخذ المال وتصدق به على فقراء البصرة ، وليتني أنجو من الاحتكار كفافا لا علي ولا لي . ويروى أن غلاما من أهل مكة كان ملازما للمسجد ، فافتقده ابن عمر ، فمشى إلى بيته ، فقالت أمه : هو على طعام له يبيعه ; فلقيه فقال له : يا بني ! ما لك وللطعام ؟ فهلا إبلا ، فهلا بقرا ، فهلا غنما ! إن صاحب الطعام يحب المحل ، وصاحب الماشية يحب الغيث .التاسعة : قوله تعالى : فاقرؤوا ما تيسر منه أي صلوا ما أمكن ; فأوجب الله من صلاة الليل ما تيسر ، ثم نسخ ذلك بإيجاب الصلوات الخمس على ما تقدم .قال ابن العربي وقد قال قوم : إن فرض قيام الليل سن في ركعتين من هذه الآية ; قاله البخاري وغيره ، وعقد بابا ذكر فيه حديث يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عقد ، يضرب على كل عقدة مكانها : عليك ليل طويل فارقد . فإن استيقظ فذكر الله انحلت عقدة ، فإن توضأ انحلت عقدة ، فإن صلى انحلت عقده كلها ، فأصبح نشيطا طيب النفس ، وإلا أصبح خبيث النفس كسلان وذكر حديث سمرة بن جندب عن النبي - صلى الله عليه وسلم - الرؤيا قال : أما الذي يثلغ رأسه بالحجر فإنه يأخذ القرآن فيرفضه ، وينام عن الصلاة المكتوبة . وحديث عبد الله بن [ ص: 53 ] مسعود قال : ذكر عند النبي - صلى الله عليه وسلم - رجل ينام الليل كله فقال : \" ذلك رجل بال الشيطان في أذنيه \" فقال ابن العربي : فهذه أحاديث مقتضية حمل مطلق الصلاة على المكتوبة ; فيحمل المطلق على المقيد لاحتماله له ، وتسقط الدعوى ممن عينه لقيام الليل .وفي الصحيح واللفظ للبخاري : قال عبد الله بن عمرو : وقال لي رسول الله - صلى الله عليه وسلم - : \" يا عبد الله لا تكن مثل فلان ، كان يقوم الليل فترك قيام الليل \" ولو كان فرضا ما أقره النبي - صلى الله عليه وسلم - عليه ، ولا أخبر بمثل هذا الخبر عنه ، بل كان يذمه غاية الذم ، وفي الصحيح عن عبد الله بن عمر قال : كان الرجل في حياة النبي - صلى الله عليه وسلم - إذا رأى رؤيا قصها على النبي - صلى الله عليه وسلم - ، وكنت غلاما شابا عزبا ، وكنت أنام في المسجد على عهد رسول الله - صلى الله عليه وسلم - ، فرأيت في النوم كأن ملكين أخذاني فذهبا بي إلى النار ، فإذا هي مطوية كطي البئر ، وإذا لها قرنان ، وإذا فيها ناس قد عرفتهم ، فجعلت أقول : أعوذ بالله من النار . قال : ولقينا ملك آخر ، فقال لي : لم ترع . فقصصتها على حفصة ، فقصتها حفصة على رسول الله - صلى الله عليه وسلم - ، فقال : \" نعم الرجل عبد الله لو كان يصلي من الليل \" فكان بعد لا ينام من الليل إلا قليلا ; فلو كان ترك القيام معصية لما قال له الملك : لم ترع . والله أعلم .[ ص: 54 ] العاشرة : إذا ثبت أن قيام الليل ليس بفرض ، وأن قوله : فاقرؤوا ما تيسر من القرآن ، فاقرؤوا ما تيسر منه محمول على ظاهره من القراءة في الصلاة فاختلف العلماء في قدر ما يلزمه أن يقرأ به في الصلاة ; فقال مالك والشافعي : فاتحة الكتاب لا يجزئ العدول عنها ، ولا الاقتصار على بعضها ، وقدره أبو حنيفة بآية واحدة ، من أي القرآن كانت . وعنه ثلاث آيات ; لأنها أقل سورة . ذكر القول الأول الماوردي والثاني ابن العربي . ولصحيح ما ذهب إليه مالك والشافعي ، على ما بيناه في سورة ( الفاتحة ) أول الكتاب والحمد لله .وقيل : إن المراد به قراءة القرآن في غير الصلاة ; قال الماوردي : فعلى هذا يكون مطلق هذا الأمر محمولا على الوجوب ، أو على الاستحباب دون الوجوب . وهذا قول الأكثرين ; لأنه لو وجب عليه أن يقرأ لوجب عليه أن يحفظه . الثاني أنه محمول على الوجوب ; ليقف بقراءته على إعجازه ، وما فيه من دلائل التوحيد وبعث الرسل ، ولا يلزمه إذا قرأه وعرف إعجازه ودلائل التوحيد منه أن يحفظه ; لأن حفظ القرآن من القرب المستحبة دون الواجبة .وفي قدر ما تضمنه هذا الأمر من القراءة خمسة أقوال : أحدها : جميع القرآن ; لأن الله تعالى يسره على عباده ; قاله الضحاك . الثاني : ثلث القرآن ; حكاه جويبر . الثالث : مائتا آية ; قاله السدي . الرابع : مائة آية ; قاله ابن عباس . الخامس : ثلاث آيات كأقصر سورة ; قاله أبو خالد الكناني .الحادية عشرة : قوله تعالى : وأقيموا الصلاة يعني المفروضة وهي الخمس لوقتها . وآتوا الزكاة الواجبة في أموالكم ; قاله عكرمة وقتادة . وقال الحارث العكلي : صدقة الفطر لأن زكاة الأموال وجبت بعد ذلك . وقيل : صدقة التطوع . وقيل : كل أفعال الخير . وقال ابن عباس : طاعة الله والإخلاص له .الثانية عشرة : قوله تعالى : وأقرضوا الله قرضا حسنا القرض الحسن ما قصد به وجه الله تعالى خالصا من المال الطيب . وقد مضى في سورة ( الحديد ) بيانه . وقال زيد بن أسلم : القرض الحسن النفقة على الأهل . وقال عمر بن الخطاب : هو النفقة في سبيل الله .الثالثة عشرة : قوله تعالى : وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وروي عن عمر بن الخطاب أنه اتخذ حيسا - يعني تمرا بلبن - فجاءه مسكين فأخذه ودفعه إليه . فقال بعضهم : ما يدري هذا المسكين ما هذا ؟ فقال عمر : لكن رب المسكين يدري ما هو وكأنه تأول : وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا أي مما تركتم وخلفتم ، ومن الشح والتقصير . وأعظم أجرا قال أبو هريرة : الجنة ; ويحتمل أن يكون أعظم أجرا ; لإعطائه بالحسنة عشرا . ونصب خيرا وأعظم على [ ص: 55 ] المفعول الثاني ل ( تجدوه ) و ( هو ) : فصل عند البصريين ، وعماد في قول الكوفيين ، لا محل له من الإعراب . و ( أجرا ) تمييز .واستغفروا الله أي سلوه المغفرة لذنوبكم إن الله غفور لما كان قبل التوبة ( رحيم ) لكم بعدها ; قاله سعيد بن جبير . ختمت السورة .\n","ar.miqbas":"إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَى مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِنَ الَّذِينَ مَعَكَ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآَنِ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضَى وَآَخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ وَآَخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ وَأَقِيمُوا الصَّلَاةَ وَآَتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (20)من هنا يبتدىء ما نزل من هذه السورة بالمدينة كما تقدم ذكره في أول السورة .وصريح هذه الآية ينادي على أن النبي صلى الله عليه وسلم كان يقوم من الليل قبل نزول الآية وأن طائفة من أصحابه كانوا يقومون عملاً بالأمر الذي في أول السورة من قوله : { قم الليل إلاّ قليلاً } الآية [ المزمل : 2 ] ، فتعين أن هذه الآية نزلت للتخفيف عنهم جميعاً لقوله فيها : { فتاب عليكم } فهي ناسخة للأمر الذي في أول السورة .واختلف السلف في وقت نزولها ومكانه وفي نسْبة مقتضاها من مقتضى الآية التي قبلها . والمشهور الموثوق به أن صدر السورة نزل بمكة .ولا يغتر بما رواه الطبري عن أبي سلمة بن عبد الرحمان عن عائشة مما يوهم أن صدر السورة نزل بالمدينة . ومثلُه ما روي عن النخعي في التزمل بمرط لعائشة .ولا ينبغي أن يطال القول في أنَّ القيام الذي شُرع في صدر السورة كان قياماً واجباً على النبي صلى الله عليه وسلم خاصة ، وأن قيام من قام من المسلمين معه بمكة إنما كان تأسياً به وأقرهم النبي صلى الله عليه وسلم عليه ولكن رأت عائشة أن فرض الصلوات الخمس نسَخ وجوب قيام الليل ، وهي تريد أن قيام الليل كان فرضاً على المسلمين ، وهو تأويل ، كما لا ينبغي أن يختلف في أن أول ما أوجب الله على الأمة هو الصلوات الخمس التي فرضت ليلة المعراج وأنها لم يكن قبلها وجوب صلاة على الأمة ولو كان لجَرى ذكر تعويضه بالصلوات الخمس في حديث المعراج ، وأن جوب الخمس على النبي صلى الله عليه وسلم مثل وجوبها على المسلمين . وهذا قول ابن عباس لأنه قال : إن قيام الليل لم ينسخه إلاّ آية : { إن ربك يعلم أنك تقوم أدنى من ثلثي الليل } الآية ، ولا أن يختلف في أن فرض الصلوات الخمس لم ينسخ فرض القيام على النبي صلى الله عليه وسلم سوى أنه نسخ استيعاب نصف الليل أو دونه بقليل فنسخه { فاقرءوا ما تيسر من القرآن } .وقد بين ذلك حديث ابن عباس ليلةَ بات في بيت خالته ميمونة أم المؤمنين قال فيه : «نام رسول الله صلى الله عليه وسلم وأهله حتى إذا كان نصف الليل أو قبله بقليل أو بعدَه بقليل استيقظ رسول الله» ثم وصف وُضوءه وأنه صلى ثلاث عشرة ركعة ثم نام حتى جاءه المنادي لصلاة الصبح . وابن عباس يومئذٍ غلام فيكون ذلك في حدود سنة سبع أو ثمان من الهجرة .ولم ينقل أن المسلمين كانوا يقومون معه إلاّ حين احتجز موضعاً من المسجد لقيامه في ليالي رمضان فتسامع أصحابه به فجعلوا يَنْسِلون إلى المسجد ليصلّوا بصلاة نبيئهم صلى الله عليه وسلم حتى احتبس عنهم في إحدى الليالي وقال لهم :\" لقد خشيت أن تفرض عليكم \" وذلك بالمدينة وعائشة عنده كما تقدم في أول السورة .وهو صريح في أن القيام الذي قاموه مع الرسول صلى الله عليه وسلم لم يكن فرضاً عليهم وأنهم لم يدوموا عليه وفي أنه ليس شيء من قيام الليل بواجب على عموم المسلمين وإلاّ لما كان لخشية أن يفرض عليهم موقع لأنه لو قُدر أن بعض قيام الليل كان مفروضاً لكان قيامهم مع النبي صلى الله عليه وسلم أداء لذلك المفروض ، وقد عضد ذلك حديث ابن عمر «أن رسول الله صلى الله عليه وسلم قال لحفصة وقد قصَّت عليه رؤيا رآها عبد الله بن عمر أن عبد الله رجل صالح لو كان يقوم في الليل» .وافتتاح الكلام ب { إن ربك يعلم أنك تقوم } يشعر بالثناء عليه لوفائه بحق القيام الذي أُمر به وأنه كان يبسط إليه ويهتم به ثم يقتصر على القدرِ المعين فيه النصففِ أو أنقصَ منه قليلاً أو زائدٍ عليه بل أخذ بالأقصى وذلك ما يقرب من ثُلثي الليل كما هو شأن أولي العزم كما قال النبي صلى الله عليه وسلم في قوله تعالى : { فلما قضى موسى الأجل } [ القصص : 29 ] أنه قضى أقصَى الأجلين وهو العشر السنون .وقد جاء في الحديث : \" أن النبي صلى الله عليه وسلم كان يقوم من الليل حتى تورمت قدماه \"وتأكيد الخبر ب { إِنَّ } للاهتمام به ، وهو كناية عن أنه أرضى ربّه بذلك وتوطئة للتخفيف الذي سيذكر في قوله : { فتاب عليكم } ليعلم أنه تخفيف رحمة وكرامة ولإفراغ بعض الوقت من النهار للعمل والجهاد .ولم تزل تكثر بعد الهجرة أشغال النبي صلى الله عليه وسلم بتدبير مصالح المسلمين وحماية المدينة وتجهيز الجيوش ونحو ذلك ، فلم تبق في نهاره من السعة ما كان له فيه أيامَ مقامه بمكة ، فظهرت حكمة الله في التخفيف عن رسوله صلى الله عليه وسلم من قيام الليل الواجِب منه والرغيبةِ .وفي حديث علي بن أبي طالب \" أنه سئل عن النبي صلى الله عليه وسلم إذا أوى إلى منزله فقال : كان إذا أوَى إلى منزله جزَّأ دخوله ثلاثة أجزاء : جُزءاً لله ، وجزءاً لأهله ، وجزءاً لنفسه ، ثم جزَّأ جزأه بينه وبين الناس فيرد ذلك بالخاصة على العامة ولا يدخر عنهم شيئاً فمنهم ذو الحاجة ومنهم ذو الحاجتين ومنهم ذو الحوائج فيتشاغل بهم ويشغلهم فيما يصلحهم والأمةَ من مسألته عنهم وإخبارهم بالذي ينبغي لهم \"وإيثار المضارع في قوله : { يعلم } للدلالة على استمرار ذلك العلم وتجدده وذلك إيذان بأنه بمحل الرضى منه .وفي ضده قوله : { قد يعلم الله المعوقين منكم } [ الأحزاب : 18 ] لأنه في معرض التوبيخ ، أي لم يزل عالماً بذلك حيناً فحيناً لا يخفى عليه منه حصة .و { أدْنى } أصله أقرب ، من الدنُوّ ، استعير للأَقَلّ لأن المسافة التي بين الشيء والأدنى منه قليلة ، وكذلك يستعار الأبعد للأكثر .وهو منصوب على الظرفيّة لفعل { تقوم } ، أي تقوم في زمان يقدر أقل من ثلثي الليل وذلك ما يزيد على نصف الليل وهو ما اقتضاه قوله تعالى : { أو زد عليه } [ المزمل : 4 ] .وقرأ الجمهور : { ثُلثي } بضم اللام على الأصل . وقرأه هشام عن ابن عامر بسكون اللام على التخفيف لأنه عرض له بعض الثقل بسبب التثنية .وقرأ نافع وابن عامر وأبو عمرو وأبو جعفر ويعقوب { ونصفَه وثلثَه } بخفضهما عطفاً على { ثلثي الليل } ، أي أدنى من نصفه وأدنى من ثلثه .وقرأ ابن كثير وعاصم وحمزة والكسائي وخلف بنصب { ونصفه وثلثه } على أنهما منصوبان على المفعول ل { تقومُ } ، أي تقوم ثلثي الليل ، وتقوم نصف الليل ، وتقوم ثلثَ الليل ، بحيث لا ينقص عن النصف وعن الثلث . وهذه أحوال مختلفة في قيام النبي صلى الله عليه وسلم بالليل تابعة لاختلاف أحوال الليالي والأيام في طول بعضها وقصر بعض وكلها داخلة تحت التخيير الذي خيره الله في قوله { قم الليل إلاّ قليلاً } [ المزمل : 2 ] إلى قوله : { أو زد عليه } [ المزمل : 4 ] .وبه تظهر مناسبة تعقيب هذه الجملة بالجملة المعترضة ، وهي جملة { والله يقدر الليل والنهار } أي قد علمها الله كلها وأنبأه بها . فلا يختلف المقصود باختلاف القراءات . فمن العجاب قول الفرّاء أن النصب أشبه بالصواب .و { طائفة } عطف على اسم { إنَّ } بالرفع وهو وجه جائز إذا كان بعدَ ذكرِ خبرِ { إنّ } لأنه يقدر رفعه حينئذٍ على الاستئناف كما في قوله تعالى : { أن الله بريء من المشركين ورسوله } [ التوبة : 3 ] . وهو من اللطائف إذا كان اتصاف الاسم والمعطوف بالخبر مختلفاً فإن بين قيام النبي صلى الله عليه وسلم وقيام الطائفة التي معه تفاوتاً في الحكم والمقدار ، وكذلك براءة الله من المشركين وبراءة رسوله . فإن الرسول صلى الله عليه وسلم يدعوهم ويقرأ عليهم القرآن ويعاملهم ، وأما الله فغاضب عليهم ولاَعنُهم . وهذا وجه العدول عن أن يقول : إنَّ الله يعلم أنكم تقومون . إلى قوله : { أنك تقوم } ثم قوله : { وطائفة } الخ .ووُصف { طائفة } بأنهم ( من الذين معه ) ، فإن كان المراد بالمعية المعية الحقيقية ، أي المصاحبة في عمل مما سيق له الكلام . أي المصاحبين لك في قيام الليل ، لم يكن في تفسيره تعيين لناس بأعيانهم ، ففي حديث عائشة في «صحيح البخاري» «أن رسول الله صلى الله عليه وسلم صلَّى ذات ليلة في المسجد فصلى بصلاته ناس ثم صلى من القابلة فكثر الناس ثم اجتمعوا من الليلة الثالثة أو الرابعة فلم يخرج إليهم رسول الله صلى الله عليه وسلم فلما أصبح قال : قد رأيتُ الذي صنعتم ولم يمنعني من الخروج إليكم إلاّ أني خشِيت أن تُفرض عليكم ، وذلك في رمضان» .وإن كانت المعية معية مجازية وهي الانتساب والصحبة والموافقة فقد عَدَدْنا منهم : عبدَ الله بن مسعود ، وعبد الله بن عَمْرو ، وسلمان الفارسي وأبا الدرداء ، وزينبَ بنتَ جحش ، وعبدَ الله بن عُمَرَ ، والحَولاء بنتَ تُوَيْت الأسدية ، فهؤلاء ورد ذكرهم مفرقاً في أحاديث التهجد من «صحيح البخاري» .واعلم أن صدر هذه الآية إيماء إلى الثناء على النبي صلى الله عليه وسلم في وفائه بقيام الليل حق الوفاء وعلى الطائفة الذين تابعوه في ذلك .فالخبر بأن الله يعلم أنك تقوم مراد به الكناية عن الرضى عنهم فيما فعلوا .والمقصود : التمهيد لقوله : { علم أن لن تحصوه } إلى آخر الآية .ولأجل هذا الاعتبار أعيد فعل { عَلِم } في جملة { علم أن سيكون منكم مرضى } الخ ولم يقل : وأن سيكون منكم مرضى بالعطف .وجملة { والله يقدر الليل والنهار } معترضة بين جملتي { إن ربّك يعلم أنك تقوم } وجملة { علم أن لن تحصوه } وقد علمت مناسبة اعتراضها آنفاً .وجملة { علم أن لن تحصوه } يجوز أن تكون خبراً ثانياً عن { إنَّ } بعد الخبر في قوله : { يعلم أنك تقوم أدنى من ثلثي الليل } الخ .ويجوز أن تكون استئنافاً بيانياً لما ينشأ عن جملة { إن ربّك يعلم أنك تقوم } من ترقب السامع لمعرفة ما مُهّد له بتلك الجملة ، فبعد أن شكرهم على عملهم خفف عنهم منه .والضمير المنصوب في { تحصوه } عائد إلى القيام المستفاد من { أنك تقوم .والإِحصاء حقيقته : معرفة عدد شيء معدود مشتق من اسم الحصى جمع حصاة لأنهم كانوا إذا عدّوا شيئاً كثيراً جعلوا لكل واحد حصاة وهو هنا مستعار للإِطاقة . شُبهت الأفعال الكثيرة من ركوع وسجود وقراءة في قيام الليل ، بالأشياء المعدودة ، وبهذا فسر الحسن وسفيان ، ومنه قوله في الحديث استقيموا ولن تُحصوا أي ولن تطيقوا تمام الاستقامة ، أي فخذوا منها بقدر الطاقة .وأنْ } مخففة من الثقيلة ، واسمها ضمير شأن محذوف وخبره الجملة ، وقد وقع الفصل بين { أنْ } وخبرها بحرف النفي لكون الخبر فعلاً غير دعاء ولا جامد حسب المتبع في الاستعمال الفصيح .و { أنْ } وجملتها سادة مسد مفعولي { علم } إذ تقديره علم عَدَم إحصائِكُمُوه واقعاً .وفرع على ذلك { فتاب عليكم } وفعل { تاب } مستعار لعدم المؤاخذة قبل حصول التقصير لأن التقصير متوقع فشابه الحاصل فعبر عن عدم التكليف بما يتوقع التقصير فيه ، بفعل { تاب } المفيد رفع المؤاخذة بالذنب بعد حصوله .والوجه أن يكون الخطاب في قوله : { تحصوه } وما بعده موجهاً إلى المسلمين الذين كانوا يقومون الليل : إِما على طريقة الالتفات من الغيبة إلى الخطاب بعد قوله : { وطائفة من الذين معك ، } وإِما على طريقة العام المراد به الخصوص بقرينة أن النبي صلى الله عليه وسلم لا يُظن تعذر الإِحصاء عليه ، وبقرينة قوله : { أن سيكونُ منكم مرضى } الخ .ومعنى { فاقرأوا ما تيسر من القرآن } فصلُّوا ما تيسر لكم ، ولما كانت الصلاة لا تخلو عن قراءة القرآن أُتبع ذلك بقوله هنا : { فاقرأوا ما تيسر من القرآن } ، أي صلوا كقوله تعالى :{ وقرآنَ الفجر } [ الإسراء : 78 ] أي صلاة الفجر وفي الكناية عن الصلاة بالقرآن جمع بين الترغيب في القيام والترغيب في تلاوة القرآن فيه بطريقة الإِيجاز .والمراد القرآن الذي كان نزل قبل هذه الآية المدنيّة وهو شيء كثير من القرآن المكيُّ كله وشيء من المدني ، وليس مثل قوله في صدر السورة { ورتل القرءان ترتيلاً } [ المزمل : 4 ] كما علمت هنالك .وقوله : { ما تيسر من القرءان } أي ما تيسر لكم من صلاة الليل فلا دلالة في هذه الآية على مقدار ما يجزىء من القراءة في الصلاة إذ ليس سياقها في هذا المهيع ، ولئن سلمنا ، فإن ما تيسر مجمل وقد بينه قول النبي صلى الله عليه وسلم \" لا صَلاة لمن لم يقرأ بفاتحة الكتاب \" ، وأما السورة مع الفاتحة فإنه لم يرو عنه أنه قرأ في الصلاة أقلَّ من سورة ، وهو الواجب عند جمهور الفقهاء ، فيكره أن يَقرأ المصلي بعضَ سورة في الفريضة . ويجوز في القيام بالقرآن في الليل وفي قيام رمضان ، وعند الضرورة ، ففي «الصحيح» «أن النبي صلى الله عليه وسلم كان يقرأ فأخذته بُحَّة فركع» ، أي في أثناء السّورة .وقال أبو حنيفة وأحمد في رواية عنه : تجزىء قراءة آية من القرآن ولو كانت قصيرة ومثَّله الحنفية بقوله تعالى : { مُدْهامَّتَان } [ الرحمن : 64 ] ولا تتعين فاتحة الكتاب وخالفه صاحباه في الأمرين .وتعيين من تجب عليه القراءة من منفرد وإمام ومأموم مُبين في كتب الفقه .وفعلُ ( تاب ) إذا أريد به قبول توبة التائب عدي بحرف ( على ) لتضمينه معنى مَنَّ وإذا كان بمعنى الرجوع عن الذنب والندم منه عدي بما يناسب .وقد نسخت هذه الآية تحديدَ مدة قيام الليل بنصفه أو أزيد أو أقل من ثلثه ، وأصحاب التحديد بالمقدار المتيسر من غير ضبط ، أما حكم ذلك القيام فهو على ما تقدم شرحه .هذه الجملة بدل اشتمال من جملة { عَلِمَ أنْ لَنْ تُحصوه ، } وهذا تخفيف آخر لأجل أحوال أخرى اقتضت التخفيف .وهذه حكمة أخرى لنسخ تحديد الوقت في قيام الليل وهي مراعاة أحوال طرأت على المسلمين من ضروب ما تدعو إليه حالة الجماعة الإِسلامية . وذكر من ذلك ثلاثة أضرب هي أصول الأعذار :الضرب الأول : أعذار اختلال الصحة وقد شملها قوله : { أن سيكون منكم مرضى .الضرب الثاني } : الأشغال التي تدعو إليها ضرورة العيش من تجارة وصناعة وحراثة وغير ذلك ، وقد أشار إليها قوله : { وآخرون يضربون في الأرض يبتغون من فضل الله } وفضل الله هو الرزق .الضرب الثالث : أعمال لمصالح الأمة وأشار إليها قوله : { وآخرون يقاتلون في سبيل الله } ودخل في ذلك حراسة الثغور والرِباط بها ، وتدبير الجيوش ، وما يرجع إلى نشر دعوة الإِسلام من إيفاد الوفود وبعث السفراء .وهذا كله من شؤون الأمة على الإِجمال فيدخل في بعضها النبي صلى الله عليه وسلم كما في القتال في سبيل الله ، والمرض ففي الحديث : اشتكى رسول الله صلى الله عليه وسلم فلم يقم ليلة أو ليلتين .وإذا كانت هذه الآية مما نزل بمكة ففيها بشارة بأن أمر المسلمين صائر إلى استقلال وقترة على أعدائهم فيقاتلون في سبيل الله وإن كانت مدنية فهو عذر لهم بما ابتدأوا فيه من السرايا والغزوات .وقد كان بعض الصحابة يتأول من هذه الآية فضيلة التجارة والسفر للتجر حيث سوى الله بين المجاهدين والمكتسبين المال الحلال ، يعني أن الله ما ذكر هذين السببين لنسخ تحديد القيام إلاّ تنويهاً بهما لأن في غيرهما من الأعذار ما هو أشبه بالمرض ، ودقائق القرآن ولطائفه لا تنحصر .روي عن ابن مسعود أنه قال «أيما رجل جلب شيئاً إلى مدينة من مدائن المسلمين محتسباً فباعه بسعر يومه كان له عند الله منزلة الشهداء ، وقرأ { وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله } .وعن ابن عمر : «ما خلق الله موتة بعد الموت في سبيل الله أحب إليَّ من أن أموت بين شُعْبَتَي رَحْلي أبتغي من فضل الله ضارباً في الأرض» .فإذا كانت هذه الآية مما نزل بمكة ففيها بشارة بأن أمر المسلمين صائر إلى قترة على عدوهم وإن كانت مدنية فهي عذر لهم بما عرض لهم .ومعنى { يضربون في الأرض } يسيرون في الأرض .وحقيقة الضرب : قرع جسم بجسم آخر ، وسُمّي السير في الأرض ضرباً في الأرض لتضمين فعل { يضربون } معنى يسيرون فإن السير ضرب للأرض بالرجلين لكنه تنوسي منه معنى الضرب وأريد المشي فلذلك عدي بحرف { في } لأن الأرض ظرف للسير كما قال تعالى : { فسيروا في الأرض } [ آل عمران : 137 ] وقد تقدم عند قوله تعالى : { وإذا ضربتم في الأرض فليس عليكم جناح أن تقصروا من الصلاة } في سورة النساء ( 101 ) .والابتغاء من فضل الله طلب الرزق قال تعالى : { ليس عليكم جناح أن تبتغوا فضلاً من ربّكم } [ البقرة : 198 ] أي التجارة في مدة الحج ، فقوله تعالى : { يضربون في الأرض يبتغون من فضل الله } مراد بالضرب في الأرض فيه السفر للتجارة لأن السير في الأسفار يكون في الليل كثيراً ويكون في النهار فيحتاج المسافر للنوم في النهار .وفُرع عليه مثل ما فرع على الذي قبله فقال : { فاقرأوا ما تيسر منه } أي من القرآن .وقد نيط مقدار القيام بالتيسير على جميع المسلمين وإن اختلفت الأعذار .وهذه الآية اقتضت رفع وجوب قيام الليل عن المسلمين إن كان قد وجب عليهم من قبل على أحد الاحتمالين ، أو بيانَ لم يوجب عليهم وكانوا قد التزموه فبين لهم أن ما التزموه من التأسّي بالنبي صلى الله عليه وسلم في ذلك غير لازم لهم .وعلل عدم وجوبه عليهم بأن الأمة يكثر فيها أصحاب الأعذار التي يشق معها قيام الليل فلم يجعله الله واجباً عليهم أو رفَع وجوبه . ولولا اعتبار المظنة العامة لأبقِيَ حكمُ القيام ورُخص لأصحاب العذر في مدة العذر فقط فتبين أن هذا تعليل الحكم الشرعي بالمظنة والحكم هنا عدمي ، أي عدم الإِيجاب فهو نظير قصر الصلاة في السفر على قول عائشة أم المؤمنين : «إن الصلاة فرضت ركعتين ثم زيد في ثلاث من الصلوات في الحضر وأبقيت صلاة السفر» ، وعلة بقاء الركعتين هو مظنة المشقة في السفر .وأوجب الترخص في قيام الليل أنه لم يكن ركناً من أركان الإِسلام فلم تكن المصلحة الدينية قوية فيه .وأما حكم القيام فهو ما دلّ عليه قوله : { قم الليل إلاّ قليلاً } [ المزمل : 2 ] وما دلت عليه أدلة التحريض عليه من السنة . وقد مضى ذلك كله . فهذه الآية صالحة لأن تكون أصلاً للتعليل بالمظنة وصالحة لأن تكون أصلاً تقاس عليه الرخص العامة التي تراعى فيها مشقة غالب الْأمة مثل رخصة بيع السلم دون الأحوال الفردية والجزئية .وقوله : { وأقيموا الصلاة } تذكير بأن الصلوات الواجبة هي التي تحرصون على إقامتها وعدم التفريط فيها كما قال تعالى : { إن الصلاة كانت على المؤمنين كتاباً موقوتاً } [ النساء : 103 ] .وفي هذا التعقيب بعطف الأمر بإقامة الصلاة إيماء إلى أن في الصلوات الخمس ما يرفع التبعة عن المؤمنين وأن قيام الليل نافلة لهم وفيه خير كثير وقد تضافرت الآثار على هذا ما هو في كتب السنة .وعطف { وءاتوا الزكاة } تتميم لأن الغالب أنه لم يَخلُ ذكر الصلاة من قرن الزكاة معها حتى استنبط أبو بكر رضي الله عنه من ذلك أن مانع الزكاة يقاتل عليها ، فقال لعمر رضي الله عنه «لأقاتلن من فرّق بين الصلاة والزكاة» .وإقراض الله هو الصدقات غير الواجبة ، شبه إعطاء الصدقة للفقير بقرض يُقرضه الله لأن الله وعد على الصدقة بالثواب الجزيل فشابه حالُ معطي الصدقة مستجيباً رغبة الله فيه بحال من أقرض مستقرضاً في أنه حقيق بأن يُرجع إليه ما أقرضه ، وذلك في الثواب الذي يُعطاه يوم الجزاء .ووصف القرض بالحسن يفيد الصدقة المراد بها وجه الله تعالى والسالمة من المنّ والأذى ، والحُسن متفاوت .والحَسن في كل نوع هو ما فيه الصفات المحمودة في ذلك النوع في بابه ، ويعرف المحمود من الصدقة من طريق الشرع بما وصفه القرآن في حسن الصدقات وما ورد في كلام النبي صلى الله عليه وسلم من ذلك .وقد تقدم في سورة البقرة ( 245 ) قوله : { من ذا الذي يُقرض الله قرضاً حسناً فيضاعفه له ضعافاً كثيرة } وفي سورة التغابن ( 17 ) { إن تقرضوا الله قرضاً حسناً يضاعفْه لكم }وَمَا تُقَدِّمُواْ لاَِنفُسِكُمْ مِّنْ خَيْرٍ تَجِدُوهُ عِندَ الله هُوَ خَيْراً وَأَعْظَمَ أَجْراً } .تذييل لما سبق من الأمر في قوله : { فاقرأوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضاً حسناً } ، فإن قوله : { من خير } يعم جميع فعل الخير .وفي الكلام إيجازُ حَذْف . تقدير المحذوف : وافعلوا الخير وما تقدموا لأنفسكم منه تجدوه عند الله ، فاستغني عن المحذوف بذكر الجزاء على الخير .و { ما } شرطية . ومعنى تقديم الخير : فعله في الحياة ، شُبِّه فعل الخير في مدة الحياة لرجاء الانتفاع بثوابه في الحياة الآخرة بتقديم العازم على السفر ثَقَلَه وأدوَاتِه وبعضَ أهله إلى المحل الذي يروم الانتهاء إليه ليجد ما ينتفع به وقت وصوله .و { من خير } بيان لإِبهام { ما } الشرطية .والخير : هو ما وصفه الدين بالحُسْن ووعد على فعله بالثواب .ومعنى { تجدوه } تجدوا جزاءه وثوابه ، وهو الذي قصده فاعله ، فكأنه وجد نفس الذي قدَّمه ، وهذا استعمال كثير في القرآن والسنة أن يعبر عن عوض الشيء وجزائِه باسم المعوض عنه والمجازَى به ، ومنه قول النبي صلى الله عليه وسلم في الذي يَكنز المال ولا يؤدي حقه «مُثِّل له يوم القيامة شُجاعاً أقْرَعَ يأخذ بلِهْزِمَتَيْه يقول : أنا مالك أنا كنزك» .وضمير الغائب في { تجدوه } هو المفعول الأول ل ( تجدوا ) ومفعوله الثاني { خيراً } .والضمير المنفصل الذي بينهما ضمير فعل ، وجاز وقوعه بين معرفة ونكرة خلافاً للمعروف في حقيقة ضمير الفصل من وجوب وقوعه بين معرفتين لأنَّ أفْعَلَ مِن كَذا ، أشبه المعرفة في أنه لا يجوز دخول حرف التعريف عليه .و { خيراً } : اسم تفضيل ، أي خيراً مما تقدمونه إذ ليس المراد أنكم تجدونه من جنس الخير ، بل المراد مضاعفة الجزاء ، لما دل عليه قوله تعالى : { إن تقرضوا الله قرضاً حسناً يُضاعفه لكم } [ التغابن : 17 ] وغير ذلك من كثير من الآيات .وأفاد ضمير الفصل هنا مجرد التأكيد لتحقيقه .وعُطف { وأعظمَ أجراً } على { خيراً } أو هو منسحب عليه تأكيد ضمير الفصل .وانتصب { أجراً } على أنه تمييز نسبة ل { أعظمَ } لأنه في معنى الفعل . فالتقدير : وأعظم أجره ، كما تقول : وجدته مُنبسطاً كفاً ، والمعنى : أن أجره خيرٌ وأعظمُ ممّا قدمتوه .يجوز أن تكون الواو للعطف فيكون معطوفاً على جملة { وما تقدموا لأنفسكم } الخ ، فيكون لها حكم التذييل إرشاداً لتدارك ما عسى أن يعرض من التفريط في بعض ما أمره الله بتقديمه من خير فإن ذلك يشمل الفرائض التي يقتضي التفريط في بعضها توبةً منه .ويجوز أن تكون الواو للاستئناف وتكون الجملة استئنافاً بيانياً ناشئاً عن الترخيص في ترك بعض القيام إرشاداً من الله لما يسُدّ مسدّ قيام الليل الذي يعرض تركه بأن يستغفر المسلم ربّه إذا انتبه من أجزاء الليل ، وهو مشمول لقوله تعالى : { وبالأسحار هم يستغفرون } [ الذاريات : 18 ] ، وقال النبي صلى الله عليه وسلم «ينزل ربّنا كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الآخر فيقول : من يدعوني فأستجيبَ له ، من يسألني فأعْطيَه ، من يستغفرني فأغفرَ له» . وقال : «من تَعَارَّ من الليل فقال : لا إله إلاّ الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ، الحمد لله وسبحان الله ولا إله إلاّ الله والله أكبر ولا حول ولا قوة إلاّ بالله ثم قال اللهم اغفر لي أوْ دعا استجيب له» .وجملة { إن الله غفور رحيم } تعليل للأمر بالاستغفار ، أي لأن الله كثير المغفرة شديد الرحمة . والمقصود من هذا التعليل الترغيبُ والتحريض على الاستغفار بأنه مرجوّ الإِجابة . وفي الإِتيان بالوصفين الدّالين على المبالغة في الصفة إيماء إلى الوعد بالإِجابة .\n","ar.waseet":"وبعد هذه الإِنذارات المتعددة للمكذبين ، عادت السورة الكريمة إلى الحديث عن قيام الليل لعبادة الله - تعالى - وطاعته . . فقال - سبحانه - :( إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أدنى مِن . . . ) .المراد بالقيام فى قوله - تعالى - : ( إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أدنى مِن ثُلُثَيِ الليل وَنِصْفَهُ وَثُلُثَهُ . . . ) التهجد بالليل عن طريق الصلاة تقربا إلى الله - تعالى - .وقوله : ( أدنى ) بمعنى أقرب ، من الدنو بمعنى القرب ، تقول : رأيت فلانا أدنى إلى فعل الخير من فلان . أى : أقرب ، واستعير هنا للأقل ، لأن المسافة التى بين الشئ والشئ إذا قربت كانت قليلة ، وهو منصوب على الظرفية بالفعل \" تقوم \" .وقوله : ( وَنِصْفَهُ وَثُلُثَهُ ) قرأه بعض القراء السبعة بالجر عطفا على ( ثُلُثَيِ الليل ) وقرأه الجمهور بالنصب عطفا على أدنى .والمعنى على قراءة الجمهور : إن ربك - أيها الرسول الكريم - يعلم أنك تقوم من الليل ، مدة قد تصل تارة إلى ثلثى الليل ، وقد تصل تارة أخرى إلى نصفه أو إلى ثلثه . . على حسب ما يتيسر لك ، وعلى حسب أحوال الليل فى الطول والقصر .والمعنى على قراءة غير الجمهور : إن ربك يعلم أنك تقوم تارة أقل من ثلثى الليل وتارة أقل من نصفه ، وتارة أقل من ثلثه . . وذلك لأنك لم تستطع ضبط المقدار الذى تقومه من الليل ضبطا دقيقا ، ولأن النوم تارة يزيد وقته وتارة ينقص ، والله - تعالى - قد رفع عنك المؤاخذة بسبب عدم تعمدك القيام أقل من ثلث الليل . .فالآية الكريمة المقصود منها بيان رحمة الله - تعالى - بنبيه صلى الله عليه وسلم حيث قبل منه قيامه بالليل متهجدا ، حتى ولو كان هذا القيام أقل من ثلث الليل . .وافتتاح الآية الكريمة بقوله - سبحانه - ( إِنَّ رَبَّكَ يَعْلَمُ . . . ) يشعر بالثناء علريه صلى الله عليه وسلم . وبالتلطف معه فى الخطاب ، حيث إنه صلى الله عليه وسلم كان مواظبا على قيام الليل . على قدر استطاعته ، بدون تقصير أو فتور .وفى الحديث الشريف : أنه صلى الله عليه وسلم قام الليل حتى تورمت قدماه .والتعبير بقوله - تعالى - : ( أدنى مِن ثُلُثَيِ الليل وَنِصْفَهُ وَثُلُثَهُ ) يدل على أن قيامه صلى الله عليه وسلم ، وعلى حسب طول الليل وقصره .وقوله - سبحانه - : ( وَطَآئِفَةٌ مِّنَ الذين مَعَكَ ) معطوف على الضمير المستتر فى قوله : ( تقوم )أى : أنت أيها الرسول الكريم - تقوم أدنى من ثلثى الليل ونصفه وثلثه ، وتقوم طائفة من أصحابك للصلاة معك ، أما بقية أصحابك فقد يقومون للتهجد فى منازلهم .روى البخارى فى صحيحه عن عائشة ، \" أن رسول الله صلى الله عليه وسلم صلى ذات ليلة فى المسجد ، فصلى بصلاته ناس ، ثم صلى من القابلة فكثر الناس ، ثم اجتمعوا فى الليلة الثالثة أو الرابعة ، فلم يخرج إليهم رسول الله صلى الله عليه وسلم فلما أصبح قال : \" قد رأيت الذى صنعتم ، ولم يمنعنى من الخروج إليكم ، إلا أنى خشيت أن تفرض عليكم \" \" .قال بعض العلماء : قوله : ( وَطَآئِفَةٌ مِّنَ الذين مَعَكَ ) معطوف على الضمير المستكن فى ( تقوم )وهو - وإن كان ضمير رفع متصل - ، قد سوغ العطف عليه الفصل بينه وبين المعطوف .والمعنى : أن الله يعلم أنه كان يقوم كذلك جماعة من الذين آمنوا بك ، واتبعوا هداك . .وقد يقال : إن هذا يدل على أن قيام الليل لم يكن فرضا على جميع الأمة ، وهو خلاف ما تقرر تفسيره فى أول السورة ، ويخالف - أيضا - ما دلت عليه الآثار المتقدمة هناك . .والجواب : أنه ليس فى الآية ما يفيد أن الصحابة - رضوان الله عليهم - كانوا جميعا يصلون مع النبى صلى الله عليه وسلم صلاة التهجد فى جماعة واحدة ، فلعل بعضهم كان يقيمها فى بيته ، فلا ينافى ذلك فريضة القيام على الجميع . .وقوله - سبحانه - : ( والله يُقَدِّرُ الليل والنهار ) بيان لشمول علمه - تعالى - ولنفاذ إرادته . أى : والله - تعالى - وحده ، هو الذى يعلم مقادير ساعات الليل والنهار ، وهو الذى يحدد زمانهما - طولا وقصرا - على حسب ما تقتضيه مشيئته وحكمته .والآية الكريمة تفيد الحصر والاختصاص ، عن طريق سياق الكلام ، ودلالة المقام .وقوله - تعالى - : ( عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ ) مؤكد لما قبله ، وإحصاء الأشياء ، عدها والإِحاطة بها .والضمير المنصوب فى قوله : ( تُحْصُوهُ ) يعود على المصدر المفهوم من قوله : ( يقدر ) فى الجملة السابقة .والتوبة فى قوله - سبحانه - : ( فَتَابَ عَلَيْكُمْ ) يصح أن تكون بمعنى المغفرة ، وعدم المؤاخذة ، أو بمعنى قبولها منهم ، والتيسير عليهم فى الأحكام ، وتخفيفها عنهم .أى : والله - تعالى - هو الذى يقدر أجزاء الليل والنهار ، وهو الذى يعلم - دون غيره - أنكم لن تستطيعوا تقدير ساعاته تقديرا دقيقا . . ولذلك خفف الله عنكم فى أمر القيام ، ورفع عنكم المقدار المحدد ، وغفر لكم ما فرط منكم من تقصير غير مقصود ، ورخص لكم أن تقوموا المقدار الذى تستطيعون قيامه من الليل ، مصلين ومتهجدين . .فالجملة الكريمة تقرر جانبا من فضل الله - تعالى - على عباده ، ومن رحمته بهم .والفاء فى قوله - تعالى - : ( فاقرءوا مَا تَيَسَّرَ مِنَ القرآن ) للإِفصاح ، والمراد بالقراءة الصلاة ، وعبر عنها بالقراءة ، لأنها من أركانها . . أى : إذا كان الأمر كما وضحت لكم ، فصلوا ما تيسر لكم من الليل .قال الآلوسى : قوله : ( فاقرءوا مَا تَيَسَّرَ مِنَ القرآن ) أى : فصلوا ما تيسر لكم من صلاة الليل ، وعبر عن الصلاة بالقراءة كما عبر عنها بسائر أركانها ، وقيل : الكلام على حقيقته ، من طلب قراءة القرآن بعينها وفيه بعد عن مقتضى السياق .ومن ذهب إلى الأول قال : إن الله - تعالى - افترض قيام مقدار معين من الليل ، لقوله :( قُمِ الليل إِلاَّ قَلِيلاً . نِّصْفَهُ . . . ) الخ . ثم نسخ بقيام مقدار ما منه ، فى قوله : ( فَتَابَ عَلَيْكُمْ فاقرءوا مَا تَيَسَّرَ مِنَ القرآن . . . ) فالأمر فى الموضعين للوجوب ، إلا أن الواجب أولا كان معينا من معينات ، وثانيا كان بعضا مطلقا ، ثم نسخ وجوب القيام على الأمة مطلقا بالصلوات الخمس .ومن قال بالثانى : ذهب إلى أن الله - تعالى - رخص لهم فى ترك جميع القيام بالصلاة ، وأمر بقراءة شئ من القرآن ليلا ، فكأنه قيل : فتاب عليكم ورخص لكم من الترك ، فاقرءوا ما تيسر من القرآن ، إن شق عليكم القيام . .وقال الإِمام ابن كثير : وقوله : ( فاقرءوا مَا تَيَسَّرَ مِنَ القرآن ) أى : من غير تحديد بوقت ، أى : لكن قوموا من الليل ما تيسر ، وعبر عن الصلاة بالقراءة ، كما قال فى آية أخرى : ( وَلاَ تَجْهَرْ بِصَلاَتِكَ ) أى : بقراءتك ( وَلاَ تُخَافِتْ بِهَا ) وقد استدل الأحناف بهذه الآية على أنه لا يتعين قراءة الفاتحة فى الصلاة ، بل لو قرأ بها أو بغيرها من القرآن ، ولو بآية . أجزأه واعتضدوا بحديث المسئ صلاته الذى فى الصحيحين ، وفيه : \" ثم اقرأ ما تيسر معك من القرآن \" .وقد أجابهم الجمهور بحديث عبادة بن الصامت ، وهو فى الصحيحين - أيضا - أن رسول الله صلى الله عليه وسلم قال : \" كل صلاة لا يقرأ فيها بأم القرآن فهى خداج . . غير تمام \" وفى صحيح ابن خزيمة عن أبى هريرة مرفوعا : \" لا تجزئ صلاة من لم يقرأ بفاتحة الكتاب \" .وقوله - سبحانه - بعد ذلك : ( عَلِمَ أَن سَيَكُونُ مِنكُمْ مرضى وَآخَرُونَ يَضْرِبُونَ فِي الأرض يَبْتَغُونَ مِن فَضْلِ الله وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ الله فاقرءوا مَا تَيَسَّرَ مِنْهُ . . ) بدل اشتمال من جملة : ( عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ . . ) ، أو هو كلام مستأنف لبيان الحكمة التى من أجلها خفف الله على المسلمين قيام الليل .أى : صلوا من الليل على قدر استطاعتكم من غير تحديد بوقت ، فالله - تعالى - يعلم أنكم لا تستطيعون ضبط ساعات الليل ولا أجزائه ، فخفف عليكم لذلك ، ولعلمه - أيضا - أن منكم المرضى الذين يعجزون عن قيام ثلثى الليل أو نصفه أو أقل من ذلك بقليل .ومنكم - أيضا - الذين ( يَضْرِبُونَ فِي الأرض ) أى : يسافرون فيها للتجارة وللحصول على مطالب الحياة ، وهم فى كل ذلك يبتغون ويطلبون الرزق من فضله - تعالى - . ومنكم - أيضا - الذين يقاتلون من أجل إعلاء كلمة الله ، ويجاهدون من أجل نشر دينه وما دام الأمر كذلك ، فقد أبحت لكم - بفضلى وإحسانى - أن تصلوا من الليل ما تيسر لكم .وقد جمع - سبحانه - بين السعى فى الأرض لطلب الرزق ، وبين الجهاد فى سبيله ، للإِشعار بأن الأول لا يقل فى فضله عن الثانى ، متى توفرت فيه النية الطيبة ، وعدم الانشغال به عن ذكر الله - تعالى - .قال الإِمام القرطبى : سوى الله - تعالى - فى هذه الآية بين درجة المجاهدين والمكتسبين المال والحلال ، للنفقة على النفس والعيال . . فكان هذا دليلا على أن كسب المال بمنزلة الجهاد فى سبيل الله .وفى الحديث الشريف : \" ما من جالب يجلب طعاما من بلد إلى بلد ، فيبيعه بسعر يومه ، إلا كانت منزلته عند الله كمنزلة الشهداء ، ثم قرأ صلى الله عليه وسلم هذه الآية . . \" .وأعيدت جملة ( فاقرءوا مَا تَيَسَّرَ مِنْهُ ) لتأكيد التيسير والتخفيف وتقريره ، وليعطف عليه ما بعده من بقية الأوامر ، وهى قوله - تعالى - : ( وَأَقِيمُواْ الصلاة ) أى : وأدوها كاملة الأركان والخشوع والسنن . . فى وقتها بدون تأخير .( وَآتُواْ الزكاة ) أى : قدموها لمستحقيها من الفقراء والمساكين وغيرهما .قال ابن كثير : أى : أقيموا الصلاة الواجبة عليكم ، وآتوا الزكاة المفروضة ، وهذا يدل لمن قال : إن فرض الزكاة نزل بمكة ، لكن مقادير النصاب لم تبين إلا بالمدينة . .وقوله : ( وَأَقْرِضُواُ الله قَرْضاً حَسَناً ) . والقرض : ما قدمته لغيرك من مال ، على أن يرده إليك بعد ذلك . والمراد من إقراض الله - تعالى - : إعطاء الفقراء والمساكين ما يحتاجونه على سبيل المعاونة والمساعدة .وشبه - سبحانه - إعطاء الصدقة للمحتاج ، بقرض يقدم له - تعالى - ، للإِشعار بأن ما سيعطى لهذا المحتاج ، سعود إضعافه على المعطى . لأن الله - تعالى - قد وعد أن يكافئ على الصدقة بعشر أمثالها ، وهو - سبحانه - بعد ذلك يضاعف لمن يشاء الثواب والعطاء .ووصف القرض بالحسن ، لحض النفوس على الإخلاص وعلى البعد عن الرياء والأذى . .ثم ختم - سبحانه - السورة الكريمة بقوله : ( وَمَا تُقَدِّمُواْ لأَنفُسِكُمْ مِّنْ خَيْرٍ ) أى : أقيموا الصلاة وآتوا الزكاة ، وأقرضوا الله قرضا حسنا ، وافعلوا ما تستطيعونه - بعد ذلك - من وجوه الخير ، وما تقدموا لأنفسكم من هذا الخير الذى يحبه - سبحانه - ( تَجِدُوهُ عِندَ الله ) أى : تجدوا ثوابه وجزاءه عند الله - تعالى - ، ففى الكلام إيجاز بالحذف ، وقد استغنى عن المحذوف بذكر الجزاء عليه . والهاء فى قوله ( تَجِدُوهُ ) هو المفعول الأول .والضمير المنفصل فى قوله : ( هُوَ خَيْراً وَأَعْظَمَ أَجْراً ) هو ضمير الفصل . . . ( خَيْراً ) هو المفعول الثانى . أى : كل فعل موصوف بأنه خير ، تقدمونه عن إخلاص لغيركم ، لن يضيع عند الله - تعالى - ثوابه ، بل ستجدون جزاءه وثوابه مضاعفا عند الله - تعالى - .( واستغفروا الله إِنَّ الله غَفُورٌ رَّحِيمٌ ) أى : وواظبوا على الاستغفار وعلى التوبة النصوح ، وعلى التضرع إلى الله - تعالى - أن يغفر لكم ما فرط منكم ، فإنه - سبحانه - واسع المغفرة والرحمة ، لمن تاب إليه وأناب . .\n","ar.baghawi":"( إن ربك يعلم أنك تقوم أدنى ) أقل من ( ثلثي الليل ونصفه وثلثه ) قرأ أهل مكة والكوفة : \" نصفه وثلثه \" بنصب الفاء والثاء وإشباع الهاءين ضما أي : وتقوم نصفه وثلثه وقرأ الآخرون بجر الفاء والثاء وإشباع الهاءين كسرا عطفا على ثلثي ( وطائفة من الذين معك ) يعني المؤمنين وكانوا يقومون معه ( والله يقدر الليل والنهار ) قال عطاء : يريد لا يفوته علم ما تفعلون ، أي أنه يعلم مقادير الليل والنهار فيعلم القدر الذي تقومون من الليل ( علم أن لن تحصوه ) قال الحسن : قاموا حتى انتفخت أقدامهم ، فنزل : \" علم أن لن تحصوه \" لن تطيقوا معرفة ذلك . وقال مقاتل : كان الرجل يصلي الليل كله ، مخافة أن لا يصيب ما أمر به من القيام ، فقال : علم أن لن تحصوه لن تطيقوا معرفة ذلك . ( فتاب عليكم ) فعاد عليكم بالعفو والتخفيف ( فاقرءوا ما تيسر من القرآن ) يعني في الصلاة ، قال الحسن : يعني في صلاة المغرب والعشاء .قال قيس بن أبي حازم : صليت خلف ابن عباس بالبصرة فقرأ في أول ركعة بالحمد وأول آية من البقرة [ ثم قام في الثانية فقرأ بالحمد والآية الثانية من البقرة ] ثم ركع فلما انصرف أقبل علينا فقال : إن الله - عز وجل - يقول : فاقرءوا ما تيسر [ منه ]أخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور السمعاني ، حدثنا أبو جعفر الرياني ، حدثنا حميد بن زنجويه ، حدثنا عثمان بن أبي صالح ، حدثنا ابن لهيعة ، حدثني حميد بن مخراق ، عن أنس بن مالك أنه سمع رسول الله - صلى الله عليه وسلم - يقول : \" من قرأ خمسين آية في يوم أو في ليلة لم يكتب من الغافلين ، ومن قرأ مائة آية كتب من القانتين ، ومن قرأ مائتي آية لم يحاجه القرآن يوم القيامة ، ومن قرأ خمسمائة آية كتب له قنطار من الأجر \" .أخبرنا إسماعيل بن عبد القاهر ، أخبرنا عبد الغافر بن محمد ، أخبرنا محمد بن عيسى ، حدثنا إبراهيم بن محمد بن سفيان ، حدثنا مسلم بن الحجاج ، حدثني القاسم بن زكريا حدثنا عبيد الله بن موسى عن شيبان ، عن يحيى [ بن كثير ] عن محمد [ عبد الله ] بن عبد الرحمن مولى بني زهرة عن أبي سلمة عن عبد الله بن عمرو قال : قال رسول الله - صلى الله عليه وسلم - : \" اقرأ القرآن في كل شهر \" قال قلت : إني أجد قوة ، قال : \" فاقرأه في [ كل ] عشرين ليلة \" قال قلت : إني أجد قوة ، قال : \" فاقرأه في كل سبع ولا تزد على ذلك \" .قوله - عز وجل - : ( علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله ) يعني المسافرين للتجارة يطلبون من رزق الله ( وآخرون يقاتلون في سبيل الله ) لا يطيقون قيام الليل .روى إبراهيم عن ابن مسعود قال : أيما رجل جلب شيئا إلى مدينة من مدائن المسلمين صابرا محتسبا فباعه بسعر يومه كان عند الله بمنزلة الشهداء ثم قرأ عبد الله : \" وآخرون يضربون في الأرض يبتغون من فضل الله \" [ يعني المسافرين للتجارة يطلبون رزق الله ] \" وآخرون يقاتلون في سبيل الله \" .( فاقرءوا ما تيسر منه ) أي [ ما تيسر عليكم ] من القرآن . [ قال أهل التفسير ] كان هذا في صدر الإسلام ثم نسخ بالصلوات الخمس ، وذلك قوله : ( وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضا حسنا ) قال ابن عباس : يريد ما سوى الزكاة من صلة الرحم ، وقرى الضيف . ( وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا ) تجدوا ثوابه في الآخرة أفضل مما أعطيتم ( وأعظم أجرا ) من الذي أخرتم ولم تقدموه ، ونصب \" خيرا وأعظم \" على المفعول الثاني ، فإن الوجود إذا كان بمعنى الرؤية يتعدى إلى مفعولين ، وهو فصل في قول البصريين وعماد في قول الكوفيين لا محل لها في الإعراب .أخبرنا أبو القاسم يحيى بن علي الكشميهني ، أخبرنا أبو نصر أحمد بن علي البخاري بالكوفة ، أخبرنا أبو القاسم نصر بن أحمد الفقيه بالموصل ، حدثنا أبو يعلى الموصلي ، حدثنا أبو خيثمة ، حدثنا جرير ، عن الأعمش ، عن إبراهيم التيمي ، عن الحارث بن سويد قال : قال عبد الله : قال رسول الله - صلى الله عليه وسلم - \" أيكم ماله أحب إليه من مال وارثه \" ؟ قالوا : يا رسول الله ما منا من أحد إلا ماله أحب إليه من مال وارثه . قال : \" اعلموا ما تقولون \" قالوا : ما نعلم إلا ذلك يا رسول الله ، قال [ : \" ما منكم رجل إلا مال وارثه أحب إليه من ماله \" قالوا : كيف يا رسول الله ؟ قال ] \" إنما مال أحدكم ما قدم ومال وارثه ما أخر \" .( واستغفروا الله ) لذنوبكم ( إن الله غفور رحيم ) .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5495.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5495.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5495.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":218,"letters":1616,"size":"208KB","priority":3,"commonlyRead":false}}