{"chapter":76,"name":{"arabic":"سورة 76","transliteration":"Chapter 76","translation":"Chapter 76","revelation":"unknown"},"revelation":"unknown","verses":31,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ هَلْ أَتَىٰ عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا","transliteration":"Hal ataa 'alal insaani heenum minad dahri lam yakun shai'am mazkooraa","translations":{"en.ahmedali":"WAS THERE NOT a time in the life of man when he was not even a mentionable thing?","en.ahmedraza":"Indeed there has been a time for man, when even his name did not exist anywhere.","en.arberry":"Has there come on man a while of time when he was a thing unremembered?","en.asad":"HAS THERE [not] been an endless span of time before man [appeared - a time] when he was not yet a thing to be thought of?","en.daryabadi":"Surely there hath come upon man a space of time when he was not a thing worth mentioning.","en.hilali":"Has there not been over man a period of time, when he was nothing to be mentioned?","en.pickthall":"Hath there come upon man (ever) any period of time in which he was a thing unremembered?","en.qaribullah":"Indeed, there came upon the human a period of time when he was an unremembered thing.","en.sahih":"Has there [not] come upon man a period of time when he was not a thing [even] mentioned?","en.sarwar":"There was certainly a time when there was no mention of the human being.","en.yusufali":"Has there not been over Man a long period of Time, when he was nothing - (not even) mentioned?","en.maududi":"Was there a period of time when man was not even worthy of a mention?","en.shakir":"There surely came over man a period of time when he was a thing not worth mentioning.","en.itani":"Has there come upon man a period of time when he was nothing to be mentioned?","en.mubarakpuri":"Has there not been over man a period of time, when he was not a thing worth mentioning","en.qarai":"Has there been a period of time for man when he was not anything worthy of mention?","en.wahiduddin":"Was there not a period of time when man was nothing worth mentioning?"},"tafsir":{"ar.muyassar":"قد مضى على الإنسان وقت طويل من الزمان قبل أن تُنفَخ فيه الروح، لم يكن شيئا يُذكر، ولا يُعرف له أثر.","ar.jalalayn":"«هل» قد «أتى على الإنسان» آدم «حين من الدهر» أربعون سنة «لم يكن» فيه «شيئا مذكورا» كان فيه مصورا من طين لا يذكر أو المراد بالإنسان الجنس وبالحين مدة الحمل.","ar.qurtubi":"سورة الإنسانوهي إحدى وثلاثون آيةمكية في قول ابن عباس ومقاتل والكلبي . وقال الجمهور : مدنية . وقيل : فيها مكي ، من قوله تعالى : إنا نحن نزلنا عليك القرآن تنزيلا إلى آخر السورة ، وما تقدمه مدني . وذكر ابن وهب قال : وحدثنا ابن زيد قال : إن رسول الله - صلى الله عليه وسلم - ليقرأ : هل أتى على الإنسان حين من الدهر وقد أنزلت عليه وعنده رجل أسود كان يسأل النبي - صلى الله عليه وسلم - ، فقال له عمر بن الخطاب : لا تثقل على النبي - صلى الله عليه وسلم - ، قال : \" دعه يا بن الخطاب \" قال : فنزلت عليه هذه السورة وهو عنده ، فلما قرأها عليه وبلغ صفة الجنان زفر زفرة فخرجت نفسه . فقال رسول الله - صلى الله عليه وسلم - : أخرج نفس صاحبكم - أو أخيكم - الشوق إلى الجنة وروي عن ابن عمر بخلاف هذا اللفظ ، وسيأتي . وقال القشيري : إن هذه السورة نزلت في علي بن أبي طالب - رضي الله عنه - . والمقصود من السورة عام . وهكذا القول في كل ما يقال إنه نزل بسبب كذا وكذا .بسم الله الرحمن الرحيمهل أتى على الإنسان حين من الدهر لم يكن شيئا مذكوراقوله تعالى : هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا هل : بمعنى قد ; قاله الكسائي والفراء وأبو عبيدة . وقد حكي عن سيبويه هل بمعنى قد . قال [ ص: 107 ] الفراء : هل تكون جحدا ، وتكون خبرا ، فهذا من الخبر ; لأنك تقول : هل أعطيتك ؟ تقرره بأنك أعطيته . والجحد أن تقول : هل يقدر أحد على مثل هذا ؟ وقيل : هي بمنزلة الاستفهام ، والمعنى : أتى . والإنسان هنا آدم - عليه السلام - ، قاله قتادة والثوري وعكرمة والسدي . وروي عن ابن عباس : حين من الدهر قال ابن عباس في رواية أبي صالح : أربعون سنة مرت به ، قبل أن ينفخ فيه الروح ، وهو ملقى بين مكة والطائف وعين ابن عباس أيضا في رواية الضحاك أنه خلق من طين ، فأقام أربعين سنة ، ثم من حمإ مسنون أربعين سنة ، ثم من صلصال أربعين سنة ، فتم خلقه بعد مائة وعشرين سنة . وزاد ابن مسعود فقال : أقام وهو من تراب أربعين سنة ، فتم خلقه بعد مائة وستين سنة ، ثم نفخ فيه الروح .وقيل : الحين المذكور هاهنا : لا يعرف مقداره عن ابن عباس أيضا ، حكاه الماوردي . لم يكن شيئا مذكورا قال الضحاك عن ابن عباس : لا في السماء ولا في الأرض . وقيل : أي كان جسدا مصورا ترابا وطينا ، لا يذكر ولا يعرف ، ولا يدرى ما اسمه ولا ما يراد به ، ثم نفخ فيه الروح ، فصار مذكورا ; قاله الفراء وقطرب وثعلب .وقال يحيى بن سلام : لم يكن شيئا مذكورا في الخلق وإن كان عند الله شيئا مذكورا . وقيل : ليس هذا الذكر بمعنى الإخبار ، فإن إخبار الرب عن الكائنات قديم ، بل هذا الذكر بمعنى الخطر والشرف والقدر ; تقول : فلان مذكور أي له شرف وقدر . وقد قال تعالى : وإنه لذكر لك ولقومك . أي قد أتى على الإنسان حين لم يكن له قدر عند الخليقة . ثم لما عرف الله الملائكة أنه جعل آدم خليفة ، وحمله الأمانة التي عجز عنها السماوات والأرض والجبال ، ظهر فضله على الكل ، فصار مذكورا . قالالقشيري : وعلى الجملة ما كان مذكورا للخلق ، وإن كان مذكورا لله . وحكى محمد بن الجهم عن الفراء : لم يكن شيئا قال : كان شيئا ولم يكن مذكورا . وقال قوم : النفي يرجع إلى الشيء ; أي قد مضى مدد من الدهر وآدم لم يكن شيئا يذكر في الخليقة ; لأنه آخر ما خلقه من أصناف الخليقة ، والمعدوم ليس بشيء حتى يأتي عليه حين . والمعنى : قد مضت عليه أزمنة وما كان آدم شيئا ولا مخلوقا ولا مذكورا لأحد من الخليقة . وهذا معنى قول قتادة ومقاتل : قال قتادة : إنما خلق الإنسان حديثا ما نعلم من خليقة الله - جل ثناؤه - خليقة كانت بعد الإنسان . وقال مقاتل : في الكلام تقديم وتأخير ، وتقديره : هل أتى حين من الدهر لم يكن الإنسان شيئا مذكورا ; لأنه خلقه بعد خلق الحيوان كله ، ولم يخلق بعده حيوانا .وقد قيل : ( الإنسان ) في قوله تعالى هل أتى على الإنسان حين عني به الجنس من ذرية آدم ، وأن الحين تسعة أشهر ، مدة حمل الإنسان في بطن أمه لم يكن شيئا مذكورا : إذ كان علقة ومضغة ; لأنه في هذه الحالة جماد لا خطر له .وقال أبو بكر - رضي الله عنه - لما قرأ هذه الآية : ليتها تمت فلا نبتلى . أي ليت المدة التي أتت على آدم لم [ ص: 108 ] تكن شيئا مذكورا تمت على ذلك ، فلا يلد ولا يبتلى أولاده . وسمع عمر بن الخطاب - رضي الله عنه - رجلا يقرأ هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا فقال ليتها تمت .\n","ar.miqbas":"هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا (1)استفهام تقريري والاستفهام من أقسام الخطاب وهو هنا موجَّه إلى غير معين ومُسْتعمل في تحقيق الأمر المقرر به على طريق الكناية لأن الاستفهام طلب الفهم ، والتقرير يقتضي حصول العلم بما قرر به وذلك إيماء إلى استحقاق الله أن يعترف الإِنسان له بالوحدانية في الربوبية إبطالاً لإِشْراك المشركين .وتقديم هذا الاستفهام لما فيه من تشويق إلى معرفة ما يأتي بعده من الكلام .فجملة { هل أتى على الإِنسان } تمهيد وتوطئة للجملة التي بعدها وهي { إنا خلقنا الإِنسان من نطفة أمشاج } [ الإنسان : 2 ] الخ .و { هل } حرف يفيد الاستفهام ومعنى التحقيق ، وقال جمعٌ أصل { هل } إنها في الاستفهام مثل ( قَدْ ) في الخبر ، وبملازمة { هل } الاستفهامَ كثير في الكلام حذف حرف الاستفهام معها فكانت فيه بمعنى ( قد ) ، وخصت بالاستفهام فلا تقع في الخبر ، ويَتطرق إلى الاستفهام بها ما يَتطرق إلى الاستفهام من الاستعمالات . وقد تقدم بيان ذلك عند قوله تعالى : { هل ينظرون إلاّ أن يَأتيهم الله في ظلل من الغمام } في سورة [ البقرة : 210 ] .وقد علمت أن حمل الاستفهام على معنى التقرير يحصِّل هذا المعنى .والمعنى : هل يقر كل إنسان موجودٍ أنه كان معدوماً زماناً طويلاً ، فلم يكن شيئاً يذكر ، أي لم يكن يسمى ولا يتحدث عنه بذاته ( وإن كان قد يذكر بوجه العُموم في نحو قول الناس : المعدوم مُتوقف وجوده على فاعل . وقول الواقف : حبست على ذريتي ، ونحوه فإن ذلك ليس ذِكراً لمعين ولكنه حكم على الأمر المقدَّر وجودُه ) . وهم لا يسَعهم إلاّ الإقرار بذلك ، فلذلك اكتفي بتوجيه هذا التقرير إلى كل سامع .وتعريف الإِنسان } للاستغراق مثل قوله : { إِن الإِنسان لفي خسر إلاّ الذين ءامنوا } الآية [ العصر : 2 ، 3 ] ، أي هل أتى على كل إنسان حينُ كان فيه معدوماً .و { الدهر } : الزمان الطويل أو الزمان المقارن لوجود العالم الدنيوي .والحين : مقدار مُجمل من الزمان يطلق على ساعة وعلى أكثر ، وقد قيل إن أقصى ما يطلق عليه الحين أربعون سنة ولا أحسبه .وجملة { لم يكن شيئاً مذكوراً } يجوز أن تكون نعتاً ل { حين } بتقدير ضمير رابط بمحذوف لدلالة لفظ { حين } على أن العائد مجرور بحرف الظرفية حذف مع جاره كقوله تعالى : { واتقوا يوماً لا تجزي نفس عن نفس شيئاً } [ البقرة : 48 ] إذ التقدير : لا تجزي فيه نفس عن نفس شيئاً ، فالتقدير هنا : لم يكن فيه الإِنسان شيئاً مذكوراً ، أي كان معدوماً في زمن سبق .ويجوز أن تكون الجملة حالاً من { الإنسان } ، وحذف العائد كحذفه في تقدير النعت .والشيء : اسم للموجود .والمذكورُ : المعيّن الذي هو بحيث يُذكر ، أي يعبّرُ عنه بخصوصه ويخبر عنه بالأخبار والأحوال . ويعلَّق لفظه الدال عليه بالأفعال .فأمّا المعدوم فلا يذكر لأنه لا تعيّن له فلا يذكر إلاّ بعنوانه العام كما تقدّم آنفاً ، وليس هذا هو المراد بالذّكر هنا .ولهذا نجعل { مذكوراً } وصفاً ل { شيئاً } ، أريد به تقييد { شيئاً } ، أي شيئاً خاصاً وهو الموجود المعبر عنه باسمه المعيِّن له .\n","ar.waseet":"الاستفهام فى قوله - تعالى - : ( هَلْ أتى عَلَى الإنسان . . ) للتقرير . والمراد بالإِنسان : جنسه ، فيشمل جميع بنى آدم ، والحين : المقدار المجمل من الزمان ، لأحد لأكثره ولا لأقله . والدهر : الزمان الطويل غير المحد بوقت معين .والمعنى : لقد أتى على الإِنسان ( حِينٌ مِّنَ الدهر ) أى : وقت غير محدد من الزمان الطويل الممتد فى هذه الحياة الدنيا .( لَمْ يَكُن شَيْئاً مَّذْكُوراً ) أى : لم يكن هذا الإِنسان فى ذلك الحين من الدهر ، شيئا مذكورا من بين أفراد جنسه ، وإنما كان شيئا غير موجود إلا فى علم الله - تعالى - .ثم أوجده - سبحانه - بعد ذلك من نطفة فعلقة فمضغة . . ثم أنشأه - سبحانه - بعد ذلك خلقا آخر ، فتبارك الله أحسن الخالقين .فالمقصود بهذه الآية الكريمة بيان مظهر من مظاهر قدرته - عز وجل - حيث أوجد الإِنسان من العدم ، ومن كان قادرا على ذلك ، كان - من باب أول - قادرا على إعادته إلى الحياة بعد موته ، والحساب والجزاء .قال الإِمام الفخر الرازى ما ملخصه : اتفقوا على أن \" هل \" هاهنا ، وفى قوله - تعالى - : ( هَلْ أَتَاكَ حَدِيثُ الغاشية ) بمعنى قد ، كما تقول : هل رأيت صنيع فلان ، وقد علمت أنه قد رآه . وتقول : هل وعظتك وهل أعطيتك ، ومقصودك أن تقرره بأنك قد أعطيته ووعظته .والدليل على أن \" هل \" هنا ليست للاستفهام الحقيقى . . أنه محال على الله - تعالى - فلابد من حمله على الخبر .وجاءت الآية الكريمة بأسلوب الاستفهام ، لما فيه من التشويق إلى معرفة ما سيأتى بعده من كلام .وجملة ( لَمْ يَكُن شَيْئاً مَّذْكُوراً ) فى وضع نصب على الحال من الإِنسان ، والعائد محذوف . أى : حالة كون هذا الإِنسان ، لم يكن فى ذلك الحين من الدهر ، شيئا مذكورا من بين أفراد جنسه . وإنما كان نسيا منسيا ، لا يعلم بوجوده أحد سوى خالقه - عز وجل - .\n","ar.baghawi":"قال عطاء : هي مكية وقال مجاهد وقتادة : مدنية . وقال الحسن وعكرمة : هي مدنية إلا آية وهي قوله : \" فاصبر لحكم ربك ولا تطع منهم آثما أو كفورا \"بسم الله الرحمن الرحيم( هل أتى على الإنسان ) يعني آدم - عليه السلام - ( حين من الدهر ) أربعون سنة ملقى من طين بين مكة والطائف قبل أن ينفخ فيه الروح ( لم يكن شيئا مذكورا ) لا يذكر ولا يعرف ولا يدرى ما اسمه ولا ما يراد به . يريد : كان شيئا ولم يكن مذكورا ، وذلك من حين خلقه من طين إلى أن [ ينفخ ] فيه الروح .روي أن عمر سمع رجلا يقرأ هذه الآية : \" لم يكن شيئا مذكورا \" فقال عمر : ليتها تمت ، يريد : ليته بقي على ما كان . قال ابن عباس : ثم خلقه بعد عشرين ومائة سنة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5592.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5592.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5592.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"إِنَّا خَلَقْنَا الْإِنْسَانَ مِنْ نُطْفَةٍ أَمْشَاجٍ نَبْتَلِيهِ فَجَعَلْنَاهُ سَمِيعًا بَصِيرًا","transliteration":"Innaa khalaqnal insaana min nutfatin amshaajin nabta leehi faja'alnaahu samee'am baseeraa","translations":{"en.ahmedali":"Verily We created man from a sperm yoked (to the ovum) to bring out his real substance, then gave him hearing and sight.","en.ahmedraza":"Indeed We have created man from mixed semen; in order to test him – We therefore made him hearing, knowing.","en.arberry":"We created man of a sperm-drop, a mingling, and We made him hearing, seeing.","en.asad":"Verily, it is We who have created man out of a drop of sperm intermingled, so that We might try him [in his later life]: and therefore We made him a being endowed with hearing and sight.","en.daryabadi":"Verily We! We created man from a sperm of mixtures, that We might prove him, wherefore We made him hearing, seeing.","en.hilali":"Verily, We have created man from Nutfah drops of mixed semen (discharge of man and woman), in order to try him, so We made him hearer, seer.","en.pickthall":"Lo! We create man from a drop of thickened fluid to test him; so We make him hearing, knowing.","en.qaribullah":"We have created the human from a (sperm) drop, a mixture, testing him; We made him to hear and see.","en.sahih":"Indeed, We created man from a sperm-drop mixture that We may try him; and We made him hearing and seeing.","en.sarwar":"We created the human being from the union of sperm and egg to test him. We gave him hearing and vision.","en.yusufali":"Verily We created Man from a drop of mingled sperm, in order to try him: So We gave him (the gifts), of Hearing and Sight.","en.maududi":"Verily We created man out of a drop of intermingled sperm so that We might try him, and We therefore endowed him with hearing and sight.","en.shakir":"Surely We have created man from a small life-germ uniting (itself): We mean to try him, so We have made him hearing, seeing.","en.itani":"We created man from a liquid mixture, to test him; and We made him hearing and seeing.","en.mubarakpuri":"Verily, We have created man from Nutfah Amshaj, in order to try him, so, We made him hearer and seer.","en.qarai":"Indeed We created man from the drop of a mixed fluid so that We may put him to test, so We endowed with hearing and sight.","en.wahiduddin":"We created man from a drop of mingled fluid so that We might try him; We gave him hearing and sight;"},"tafsir":{"ar.muyassar":"إنا خلقنا الإنسان من نطفة مختلطة من ماء الرجل وماء المرأة، نختبره بالتكاليف الشرعية فيما بعد، فجعلناه من أجل ذلك ذا سمع وذا بصر؛ ليسمع الآيات، ويرى الدلائل، إنا بينَّا له وعرَّفناه طريق الهدى والضلال والخير والشر؛ ليكون إما مؤمنًا شاكرًا، وإما كفورًا جاحدًا.","ar.jalalayn":"«إنَّا خلقنا الإنسان» الجنس «من نطفة أمشاج» أخلاط، أي من ماء الرجل وماء المرأة المختلطين الممتزجين «نبتليه» نختبره بالتكليف والجملة مستأنفة أو حال مقدرة، أي مريدين ابتلاءه حين تأهله «فجعلناه» بسبب ذلك «سميعا بصيرا».","ar.qurtubi":"قوله تعالى : إنا خلقنا الإنسان أي ابن آدم من غير خلاف من نطفة أي من ماء يقطر وهو المني ، وكل ماء قليل في وعاء فهو نطفة ; كقول عبد الله بن رواحة يعاتب نفسه :مالي أراك تكرهين الجنه هل أنت إلا نطفة في شنهوجمعها : نطف ونطاف . أمشاج أخلاط . واحدها : مشج ومشيج ، مثل خدن وخدين ; قال : رؤبة :يطرحن كل معجل نشاج     لم يكس جلدا في دم أمشاجويقال : مشجت هذا بهذا أي خلطته ، فهو ممشوج ومشيج ; مثل : مخلوط وخليط . وقال المبرد : واحد الأمشاج : مشيج ; يقال : مشج يمشج : إذا خلط ، وهو هنا اختلاط النطفة بالدم ; قال الشماخ :طوت أحشاء مرتجة لوقت     على مشج سلالته مهينوقال الفراء : أمشاج : أخلاط ماء الرجل وماء المرأة ، والدم والعلقة . ويقال للشيء من هذا إذا خلط : مشيج كقولك خليط ، وممشوج كقولك مخلوط . وروي عن ابن عباس - رضي الله عنه - قال : الأمشاج : الحمرة في البياض ، والبياض في الحمرة . وهذا قول يختاره كثير من أهل اللغة ; قال الهذلي :كأن الريش والفوقين منه     خلاف النصل سيط به مشيجوعن ابن عباس أيضا قال : يختلط ماء الرجل وهو أبيض غليظ بماء المرأة وهو أصفر رقيق فيخلق منهما الولد ، فما كان من عصب وعظم وقوة فهو من ماء الرجل ، وما كان من لحم ودم وشعر فهو من ماء المرأة . وقد روي هذا مرفوعا ; ذكره البزار . وروي عن ابن مسعود : أمشاجها عروق المضغة . وعنه : ماء الرجل وماء المرأة وهما لونان . وقال مجاهد : نطفة الرجل بيضاء وحمراء ، ونطفة المرأة خضراء وصفراء . وقال ابن عباس : خلق من ألوان ; خلق من تراب ، ثم من ماء الفرج والرحم ، وهي نطفة ثم علقة ثم مضغة ثم عظم ثم لحم . ونحوه قال [ ص: 109 ] قتادة : هي أطوار الخلق : طور علقة وطور مضغة وطور عظام ثم يكسو العظام لحما ; كما قال في سورة ( المؤمنون ) ولقد خلقنا الإنسان من سلالة من طين الآية .وقال ابن السكيت : الأمشاج الأخلاط ; لأنها ممتزجة من أنواع فخلق الإنسان منها ذا طبائع مختلفة . وقال أهل المعاني : الأمشاج ما جمع وهو في معنى الواحد ; لأنه نعت للنطفة ; كما يقال : برمة أعشار وثوب أخلاق . وروي عن أبي أيوب الأنصاري قال : جاء حبر من اليهود إلى النبي - صلى الله عليه وسلم - فقال : أخبرني عن ماء الرجل وماء المرأة ؟ فقال : ماء الرجل أبيض غليظ وماء المرأة أصفر رقيق فإذا علا ماء المرأة آنثت وإذا علا ماء الرجل أذكرت ، فقال الحبر : أشهد أن لا إله إلا الله وأنك رسول الله . وقد مضى هذا القول مستوفى في سورة ( البقرة ) .نبتليه أي نختبره . وقيل : نقدر فيه الابتلاء وهو الاختبار . وفيما يختبر به وجهان : أحدهما : نختبره بالخير والشر ; قاله الكلبي . الثاني : نختبر شكره في السراء وصبره في الضراء ; قاله الحسن . وقيل : نبتليه نكلفه . وفيه أيضا وجهان : أحدهما : بالعمل بعد الخلق ; قاله مقاتل . الثاني : بالدين ليكون مأمورا بالطاعة ومنهيا عن المعاصي . وروي عن ابن عباس : نبتليه : نصرفه خلقا بعد خلق ; لنبتليه بالخير والشر . وحكى محمد بن الجهم عن الفراء قال : المعنى والله أعلم فجعلناه سميعا بصيرا لنبتليه ، وهي مقدمة معناها التأخير .قلت : لأن الابتلاء لا يقع إلا بعد تمام الخلقة وقيل : جعلناه سميعا بصيرا : يعني جعلنا له سمعا يسمع به الهدى ، وبصرا يبصر به الهدى .\n","ar.miqbas":"إِنَّا خَلَقْنَا الْإِنْسَانَ مِنْ نُطْفَةٍ أَمْشَاجٍ نَبْتَلِيهِ فَجَعَلْنَاهُ سَمِيعًا بَصِيرًا (2)استئناف بياني مترتب على التقرير الذي دل عليه { هل أتى على الإِنسان حين من الدهر لم يكن شيئاً مذكوراً } [ الإنسان : 1 ] لما فيه من التشويق .والتقرير يقتضي الإِقرار بذلك لا محالة لأنه معلوم بالضرورة ، فالسامع يتشوف لما يرد بعد هذا التقرير فقيل له : إن الله خلقه بعد أن كان معدوماً فأوجَد نطفة كانت معدومة ثم استخرج منها إنساناً ، فثبت تعلُّق الخلق بالإِنسان بعد عدمه .وتأكيد الكلام بحرف ( إنَّ ) لتنزيل المشركين منزلة من ينكر أنّ الله خلق الإِنسان لعدم جريهم على موجَب العلم حيث عبدوا أصناماً لم يخلقوهم .والمراد ب { الإنسان } مثل ما أريد به في قوله : { هل أتى على الإنسان } [ الإنسان : 1 ] أي كل نوع الإِنسان .وأُدمج في ذلك كيفية خلق الإِنسان من نطفة التناسِل لما في تلك الكيفية من دقائق العلم الإلهي والقدرة والحكمة .وقد تقدم معنى النطفة في سورة القيامة .و { أمشاج } : مشتق من المشج وهو الخلط ، أي نطفة مخلوطة قال تعالى : { سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون } [ يس : 36 ] وذلك يفسر معنى الخلط الذي أشير إليه هنا .وصيغة { أمشاج } ظاهرها صيغة جمع وعلى ذلك حملها الفراء وابن السكيت والمبرد ، فهي إما جمع مِشْج بكسر فسكون بوزن عِدْل ، أي ممشوج ، أي مخلوط مثل ذِبح ، وهذا ما اقتصر عليه في «اللسان» و«القاموس» ، أو جمع مَشَج بفتحتين مثل سَبب وأسباب ، أو جمع مَشِج بفتح فكسر مثل كَتِف وأكتاف .والوجه ما ذهب إليه صاحب «الكشاف» : أن { أمشاج } مفرد كقولهم : بُرمة أعشار وبُرد أكياش ( بهمزة وكاف وتحتية وألف وشين معجمة الذي أعيد غزله مرتين ) . قال : «ولا يصح أن يكون أمشاج جمع مَشَج بل هما ( أي مَشج وأمشاج ) مِثلان في الإِفراد اه . وقال بعض الكاتبين : إنه خالف كلام سيبويه . وأشار البيضاوي إلى ذلك ، وأحسب أنه لم يَر كلام سيبويه صريحاً في منع أن يكون { أمشاج } مفرداً لأن أثبت الإِفراد في كلمة أنعام والزمخشري معروف بشدة متابعة سيبويه .فإذا كان { أمشاج } في هذه الآية مفرداً كان على صورة الجمع كما في «الكشاف» . فوصف { نطفة } به غير محتاج إلى تأويل ، وإذا كان جمعاً كما جرى عليه كلام الفراء وابن السكيت والمبرد ، كان وصف النطفة به باعتبار ما تشتمل عليه النطفة من أجزاء مختلفة الخواص ، ( فلذلك يصير كل جزء من النطفة عضواً ) فوصفُ النطفة يجمع الاسم للمبالغة ، أي شديدة الاختلاط .وهذه الأمشاج منها ما هو أجزاء كيمائية نباتية أو ترابية ومنها ما هو عناصر قوى الحياة .وجملة { نبتليه } في موضع الحال من الإِنسان وهي حال مقدرة ، أي مريدين ابتلاءه في المستقبل ، أي بعد بلوغه طور العقل والتكليف ، وهذه الحال كقولهم : مررتُ برجل معه صِقر صائداً به غداً .وقد وقعت هذه الحال معترضة بين جملة { خلقنا } وبين { فجعلناه سَميعاً بصيراً } لأن الابتلاء ، أي التكليف الذي يظهر به امتثاله أو عصيانه إنما يكون بعد هدايته إلى سبيل الخير ، فكان مقتضى الظاهر أن يقع { نبتليه } بعد جملة { إنا هديناه السبيل } [ الإنسان : 3 ] ، ولكنه قدم للاهتمام بهذا الابتلاء الذي هو سبب السعادة والشقاوة .وجيء بجملة { إنا هديناه السبيل بياناً لجملة نبتليه } تفنناً في نظم الكلام .وحقيقة الابتلاء : الاختبار لتُعرف حال الشيء وهو هنا كناية عن التكليف بأمر عظيم لأن الأمر العظيم يظهر تفاوت المكلفين به في الوفاء بإقامته .وفُرع على خلقه { من نطفة } أنه جعله { سميعاً بصيراً } ، وذلك إشارة إلى ما خلقه الله له من الحواس التي كانت أصل تفكيره وتدبيره ، ولذلك جاء وصفه بالسميع البصير بصيغة المبالغة ولم يقل فجعلناه : سامعاً مبصراً ، لأن سمع الإِنسان وبصره أكثر تحصيلاً وتمييزاً في المسموعات والمبصرات من سمع وبصر الحيوان ، فبالسمع يتلقَّى الشرائع ودعوة الرسل وبالبصر ينظر في أدلة وُجود الله وبديع صنعه .وهذا تخلص إلى ما ميز الله به الإِنسانَ من جعله تجاه التكليف واتباع الشرائع وتلك خصيصية الإِنسان التي بها ارتكزتْ مدنيته وانتظمت جامعاته ، ولذلك أعقبت هذه الجملة بقوله : { إنا هديناه السبيل الآيات .\n","ar.waseet":"ثم فصل - سبحانه - بعد هذا التشويق ، أطوار خلق الإِنسان فقال : ( إِنَّا خَلَقْنَا الإنسان مِن نُّطْفَةٍ أَمْشَاجٍ نَّبْتَلِيهِ ) والمراد بالإِنسان هنا - أيضا - جنسه وجميع أفراده .و \" أمشاج \" بمعنى أخلاط من عناصر شتى ، مشتق من المشج بمعنى الخلط ، يقال : مشجي فلان بين كذا وكذا - من باب ضرب - إذا خلط ومزج بينهما ، وهو جمع مشَج - كسب ، أو مَشِج - ككتف ، أو مشيج - كنصير .قال الجمل : \" أمشاج \" نعت لنطفة . ووقع الجمع صفة لمفرد ، لأنه فى معنى الجمع ، أو جعل كل جزء من النطفة نطفة ، فاعتبر ذلك فوصف بالجمع . .ويرى صاحب الكشاف أن لفظ \" أمشاج \" مفرد جاء على صيغة أفعال ، كلفظ أعشار فى قولهم : برمة أعشار ، أى : برمة متكسرة قطعا قطعا ، وعليه يكون المفرد قد نعت بلفظ مفرد مثله .فقال قال - رحمه الله - : ( مِن نُّطْفَةٍ أَمْشَاجٍ ) كبرمة أعشار . . وهى ألفاظ مفردة غير جموع .والذلك وقعت صفات للأفراد ، والمعنى : من نطفة قد امتزج فيها الماءان . .وجملة \" نبتليه \" حال من الإِنسان ، أنو من فاعل \" خلقنا \" .أى : إنا خلقنا الإِنسان بقدرتنا وحدها . \" من نطفة \" أى : من مَنِىٍّ ، وهو ماء الرجل وماء المرأة ، \" أمشاج \" أى : ممتزج أحدهما بالآخر امتزاجا تاما .أو خلقنا من نطفة مختلطة بعناصر متعددة ، تتكون منها حياة الإِنسان بقدرتنا وحمكتنا .وهلقناه كلذلك حالة كوننا مريدين ابتلاءه واختباره بالتكاليف ، فى مستقبل حياته حين يكون أهلا لهذه التكاليف .( فَجَعَلْنَاهُ ) بسبب إرادتنا ابتلاءه واختباره بالتكاليف مزودات بوسائل الإِدراك ، التى بواسطتها بسمع الحق ويبصره ويستجيب له ويدرك الحقائق والآيات الدالة على وحدانيتنا وقدرتنا وصدق رسلنا . . إدراكا سليما ، متى اتبع فطرته ، وخالف وساوس الشيطان وخطواته .وخص - سبحانه - السمع والبصر بالذكر ، لأنهما أنفع الحواس للإِنسان ، إن عن طريق السمع يتلقى دعوة الحق وما اشتملت عليه من هدايات ، وعن طريق البصر ينظر فى الأدلة المتنوعة الكثيرة التى تدل على وحدانية الله - تعالى - وعلى صدق أنبيائه فيما جاءوا به من عند ربهم .\n","ar.baghawi":"( إنا خلقنا الإنسان ) يعني ولد آدم ( من نطفة ) يعني : مني الرجل ومني المرأة . ( أمشاج ) أخلاط ، واحدها : مشج ومشيج ، مثل خدن وخدين .قال ابن عباس ، والحسن ، ومجاهد والربيع : يعني ماء الرجل [ وماء المرأة ] يختلطان في الرحم فيكون منهما الولد . فماء الرجل أبيض غليظ ، وماء المرأة أصفر رقيق ، فأيهما علا صاحبه كان الشبه له ، وما كان من عصب وعظم فهو من نطفة الرجل ، وما كان من لحم ودم وشعر فمن ماء المرأة .وقال الضحاك : أراد بالأمشاج اختلاف ألوان النطفة ، فنطفة الرجل بيضاء وحمراء وصفراء ، ونطفة المرأة خضراء وحمراء [ وصفراء ] ، وهي رواية الوالبي عن ابن عباس . وكذلك قال الكلبي : قال : الأمشاج البياض في الحمرة والصفرة . وقال يمان : كل لونين اختلطا فهو أمشاج . وقال ابن مسعود : هي العروق التي تكون في النطفة .وقال الحسن : نطفة مشجت بدم ، وهو دم الحيضة ، فإذا حبلت ارتفع الحيض .وقال قتادة : هي أطوار الخلق نطفة ، ثم علقة ، ثم مضغة ، ثم [ عظما ] ثم يكسوه لحما ثم ينشئه خلقا آخر .( نبتليه ) نختبره بالأمر والنهي ( فجعلناه سميعا بصيرا ) قال بعض أهل العربية : فيه تقديم وتأخير ، مجازه فجعلناه سميعا بصيرا لنبتليه ؛ لأن الابتلاء لا يقع إلا بعد تمام الخلقة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5593.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5593.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5593.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا","transliteration":"Innaa hadainaahus sabeela immaa shaakiranw wa immaa kafoora","translations":{"en.ahmedali":"We surely showed him the way that he may either be grateful or deny.","en.ahmedraza":"We have indeed shown him the way – whether he is grateful or ingrate.","en.arberry":"Surely We guided him upon the way whether he be thankful or unthankful.","en.asad":"Verily, We have shown him the way: [and it rests with him to prove himself] either grateful or ungrateful.","en.daryabadi":"Verily We! We shewed him the way; then he becometh either thankful or ingrate.","en.hilali":"Verily, We showed him the way, whether he be grateful or ungrateful.","en.pickthall":"Lo! We have shown him the way, whether he be grateful or disbelieving.","en.qaribullah":"Indeed, We have guided him to the path, he is either grateful or ungrateful.","en.sahih":"Indeed, We guided him to the way, be he grateful or be he ungrateful.","en.sarwar":"We showed him the right path whether he would be grateful or ungrateful.","en.yusufali":"We showed him the Way: whether he be grateful or ungrateful (rests on his will).","en.maududi":"Surely We showed him the Right Path, regardless of whether he chooses to be thankful or unthankful (to his Lord).","en.shakir":"Surely We have shown him the way: he may be thankful or unthankful.","en.itani":"We guided him to the way, be he appreciative or unappreciative.","en.mubarakpuri":"Verily, We guided him to the way, whether he be grateful or ungrateful.","en.qarai":"Indeed We have guided him to the way, be he grateful or ungrateful.","en.wahiduddin":"We showed him the way, whether he be grateful or ungrateful."},"tafsir":{"ar.muyassar":"إنا خلقنا الإنسان من نطفة مختلطة من ماء الرجل وماء المرأة، نختبره بالتكاليف الشرعية فيما بعد، فجعلناه من أجل ذلك ذا سمع وذا بصر؛ ليسمع الآيات، ويرى الدلائل، إنا بينَّا له وعرَّفناه طريق الهدى والضلال والخير والشر؛ ليكون إما مؤمنًا شاكرًا، وإما كفورًا جاحدًا.","ar.jalalayn":"«إنا هديناه السبيل» بينا له طريق الهدى ببعث الرسل «إما شاكرا» أي مؤمنا «وإما كفورا» حالان من المفعول، أي بينا له في حال شكره أو كفره المقدرة، و إما لتفصيل الأحوال.","ar.qurtubi":"قوله تعالى : إنا هديناه السبيل أي بينا له وعرفناه طريق الهدى والضلال ، والخير والشر ببعث الرسل ، فآمن أو كفر ; كقوله تعالى : وهديناه النجدين . وقال مجاهد : أي بينا له السبيل إلى الشقاء والسعادة . وقال الضحاك وأبو صالح والسدي : السبيل هنا خروجه من الرحم . وقيل : منافعه ومضاره التي يهتدي إليها بطبعه وكمال عقله .إما شاكرا وإما كفورا أي أيهما فعل فقد بينا له . قال الكوفيون : إن هاهنا تكون جزاء و ( ما ) زائدة أي بينا له الطريق إن شكر أو كفر . واختاره الفراء ولم يجزه البصريون ; إذ لا تدخل إن للجزاء على الأسماء إلا أن يضمر بعدها فعل . وقيل : أي هديناه الرشد ، أي بينا له سبيل التوحيد بنصب الأدلة عليه ; ثم إن خلقنا له الهداية اهتدى وآمن ، وإن خذلناه كفر . وهو كما تقول : قد نصحت لك ، إن شئت فاقبل ، وإن شئت فاترك ; أي فإن شئت ، فتحذف الفاء . وكذا إما شاكرا والله أعلم .[ ص: 110 ] ويقال : هديته السبيل وللسبيل وإلى السبيل . وقد تقدم في ( الفاتحة ) وغيرها . وجمع بين الشاكر والكفور ، ولم يجمع بين الشكور والكفور مع اجتماعهما في معنى المبالغة ; نفيا للمبالغة في الشكر وإثباتا لها في الكفر ; لأن شكر الله تعالى لا يؤدى ، فانتفت عنه المبالغة ، ولم تنتف عن الكفر المبالغة ، فقل شكره ، لكثرة النعم عليه وكثرة كفره وإن قل مع الإحسان إليه . حكاه الماوردي .\n","ar.miqbas":"إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا (3)استئناف بياني لبيان ما نشأ عن جملة { نبتليه } [ الإنسان : 2 ] ولتفصيل جملة { فجعلناه سميعاً بصيراً } [ الإنسان : 2 ] ، وتخلُّصّ إلى الوعيد على الكفر والوَعد على الشكر .وهداية السبيل : تمثيل لحال المرشدِ . و { السبيل } : الطريق الجادة إلى ما فيه النفع بواسطة الرُسل إلى العقائد الصحيحة والأعمال الصالحة التي هي سبب فوزه بالنعيم الأبدي ، بحال من يدل السائر على الطريق المؤدية إلى مقصده من سَيْره .وهذا التمثيل ينحل إلى تشبيهاتتِ أجزاءِ الحالة المركَّبَة المشبَّهة بأجزاء الحالة المشبَّه بها ، فالله تعالى كالهادي ، والإِنسان يشبه السائر المتحير في الطريق ، وأعمال الدين تشبه الطريق ، وفوز المتتبع لهدي الله يشبه البلوغ إلى المكان المطلوب .وفي هذا نداء على أن الله أرشد الإِنسان إلى الحق وأن بعض الناس أدخلوا على أنفسهم ضلالَ الاعتقاد ومفاسدَ الأعمال ، فمن بَرَّأَ نفسه من ذلك فهو الشاكر وغيره الكفور ، وذلك تقسيم بحسب حال الناس في أول البعثة ، ثم ظهر من خلطوا عملاً صالحاً وآخر سيئاً .وتأكيد الخبر ب ( إنَّ ) للرد على المشركين الذين يزعمون أن ما يدعوهم إليه القرآن باطل .و { إِما شاكراً وإما كفوراً } حالان من ضمير الغيبة في { هديناه } ، وهو ضمير { الإِنسان } [ الإنسان : 2 ] .و { إما } حرف تفصيل ، وهو حرفٌ بسيط عند الجمهور . وقال سيبويه : هو مركب من حرف ( إِنْ ) الشرطية و ( مَا ) النافية . وقد تجردت ( إنْ ) بالتركيب على الشرطية كما تجردت ( مَا ) عن النفي ، فصار مجموع { إِما } حرف تفصيل ، ولا عمل لها في الاسم بعدها ولا تمنع العامل الذي قبلها عن العمل في معموله الذي بعدها فهي في ذلك مثل ( اَلْ ) حرففِ التعريف . وقدر بعض النحاة { إما } الثانية حرفَ عطف وهو تحكم إذ جعلوا الثانية عاطفة وهي أخت الأولى ، وإنما العاطف الواو و { إِما } مقحمة بين الاسم ومعموله كما في قول تأبط شراً :هُمَا خُطَّتَا إِمَّا إِسارٍ ومِنَّةٍ ... وإِمَّا دَممٍ والموتُ بالحُر أجْدَرُفإن الاسمين بعد ( إما ) في الموضعين من البيت مجرورَان بالإِضافة ولذلك حذفت النون من قوله : هما خطتَا ، وذلك أفصح كما جاء في هذه الآية .قال ابن جنيّ : «أما من جرَّ ( إِسار ) فإنه حذف النون للإِضافة ولم يَعتد ( إِمَّا ) فاصلاً بين المضاف والمضاف إليه ، وعلى هذا تقول : هما إِما غلاما زيدٍ وإما عمرو ، وأجودُ من هذا أن تقول : هما خطتَا إِسارٍ ومنةٍ وإِما خطتا دم ثم قال : وأما الرفع فطريق المذهب ، وظاهر أمره أنه على لغة من حذف النون لغير الإِضافة فقد حُكي ذلك» الخ .ومقتضى كلامه أن البيت روي بالوجهين : الجرِ والرفع وقريب منه كلام المرزوقي وزاد فقال «وحَذف النون إذا رفعتَ ( إسارُ ) استطالة للاسم كأنه استطال خطتا ببدَلِه وهو قوله : إِما إسار» الخ .والمعنى : إنا هديناه السبيل في حال أنه متردد أمره بين أحد هذين الوصفين وصففِ شاكر ووصففِ كفور ، فأحدُ الوصفين على الترديد مقارنٌ لحال إرشاده إلى السبيل ، وهي مقارنةٌ عرفية ، أي عَقب التبليغ والتأمل ، فإن أخذ بالهدى كان شاكراً وإن أعرض كان كفوراً كمن لم يأخذ بإرشاد من يهديه الطريق فيأخذ في طريق يلقى به السباع أو اللصوصَ ، وبذلك تم التمثيل الذي في قوله : { إِنا هديناه السبيل } .\n","ar.waseet":"وقوله - سبحانه - ( إِنَّا هَدَيْنَاهُ السبيل ) تعليل لقوله : ( نَّبْتَلِيهِ ) ، وتفصيل لقوله - تعالى - ( فَجَعَلْنَاهُ سَمِيعاً بَصِيراً ) ، والمراد بالهداية هنا : الدلالة إلى طريق الحق ، والإِرشاد إلى الصراط المستقيم .أى : إنا بفضلنا وإحساننا - قد أرشدنا الإِنسان إلى ما يوصله إلى طريق الحق والصواب ، وأرشدناه إلى ما يسعده ، عن طريق إرسال الرسل وتزويده بالعقل المستعد للتفكر والتدبر فى آياتنا الدالة على وحدانيتنا وقدرتنا .وقوله : ( إِمَّا شَاكِراً وَإِمَّا كَفُوراً ) حالان من ضمير الغيبة فى \" هديناه \" وهو ضمير الإِنسان .و \" إما \" للتفصيل باعتبار تعدد الأحوال مع اتحاد الذات : أو للتقسيم للمهدى بحسب اختلاف الذوات والصفات .أى : إنا هديناه ودللناه على ما يوصله إلى الصراط المستقيم ، فى حالتى شكره وكفره ، لأنه إن أخذ بهدايتنا كان شاكرا ، وإن أعرض عنها كان جاحدا وكافرا لنعمنا ، فالهداية موجودة فى كل الأحوال ، إلا أن المنتفعين بها هم الشاكرون وحدهم .ومثل ذلك كمثل رجلين ، يرشدهما مرشد إلى طريق النجاة ، فأحدهما يسير فى هذا الطريق فينجو من العثرات والمتاعب والمخاطر . . والآخر يعرض عن ذلك فيهلك .ولما كان الشكر قل من يتصف به ، كما قال - سبحانه - : ( وَقَلِيلٌ مِّنْ عِبَادِيَ الشكور ) جاء التعبير بقوله - سبحانه - ( شَاكِراً ) بصيغة اسم الفاعل . ولما كان الجحود والكفر يعم أكثر الناس ، جاء التعبير بقوله - تعالى - ( كَفُوراً ) بصيغة المبالغة .والمقصود من الآية الكريمة : قفل الباب أمام الذين يفسقون عن أمر ربهم ، ويرتكبون ما يرتكبون من السيئات . . ثم بعد ذلك يعلقون أفعالهم هذه على قضاء الله وقدره ، ويقولون - كما حكى القرآن عن المشركين - : ( لَوْ شَآءَ الله مَآ أَشْرَكْنَا وَلاَ آبَاؤُنَا وَلاَ حَرَّمْنَا مِن شَيْءٍ ).\n","ar.baghawi":"\"إنا هديناه السبيل\"، أي بينا له سبيل الحق والباطل والهدى والضلالة، وعرفناه طريق الخير والشر. \"إما شاكراً وإما كفوراً\"، إما مؤمناً سعيداً وإما كافراً شقياً. وقيل: معنى الكلام الجزاء، يعني: بينا له الطريق إن شكر أو كفر.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5594.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5594.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5594.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"إِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَ وَأَغْلَالًا وَسَعِيرًا","transliteration":"Innaaa a'tadnaa lilkaa fireena salaasila wa aghlaalanw wa sa'eeraa","translations":{"en.ahmedali":"We have prepared for unbelievers chains and collars and a blazing fire.","en.ahmedraza":"We have indeed kept prepared chains, and shackles and a blazing fire for the disbelievers.","en.arberry":"Surely We have prepared for the unbelievers chains, fetters, and a Blaze.","en.asad":"[Now,] behold, for those who deny the truth We have readied chains and shackles, and a blazing flame","en.daryabadi":"Verily We! We have gotten ready for the infidels chains and collars and a Blaze.","en.hilali":"Verily, We have prepared for the disbelievers iron chains, iron collars, and a blazing Fire.","en.pickthall":"Lo! We have prepared for disbelievers manacles and carcans and a raging fire.","en.qaribullah":"Indeed, for the unbelievers We have prepared chains, fetters and a Blazing (Fire).","en.sahih":"Indeed, We have prepared for the disbelievers chains and shackles and a blaze.","en.sarwar":"We have prepared chains, shackles, and flaming fire (for the disbelievers).","en.yusufali":"For the Rejecters we have prepared chains, yokes, and a blazing Fire.","en.maududi":"For the unbelievers, We have kept ready chains and fetters and a Blazing Fire.","en.shakir":"Surely We have prepared for the unbelievers chains and shackles and a burning fire.","en.itani":"We have prepared for the faithless chains, and yokes, and a Searing Fire.","en.mubarakpuri":"Verily, We have prepared for the disbelievers iron chains, iron collars, and Sa`ir.","en.qarai":"Indeed for the faithless We have prepared chains, iron collars, and a blaze.","en.wahiduddin":"[Now,] behold, for those who deny the truth, We have prepared chains, iron collars and a blazing fire, but"},"tafsir":{"ar.muyassar":"إنا أعتدنا للكافرين قيودًا من حديد تُشَدُّ بها أرجلهم، وأغلالا تُغلُّ بها أيديهم إلى أعناقهم، ونارًا يُحرقون بها.","ar.jalalayn":"«إنا أعتدنا» هيأنا «للكافرين سلاسل» يسحبون بها في النار «وأغلالا» في أعناقهم تشد فيها السلاسل «وسعيرا» نارا مسعرة، أي مهيجة يعذبون بها.","ar.qurtubi":"قوله تعالى : إنا أعتدنا للكافرين سلاسلا وأغلالا وسعيراقوله تعالى : إنا أعتدنا للكافرين سلاسلا وأغلالا وسعيرا بين حال الفريقين ، وأنه تعبد العقلاء وكلفهم ومكنهم مما أمرهم ، فمن كفر فله العقاب ، ومن وحد وشكر فله الثواب . والسلاسل : القيود في جهنم طول كل سلسلة سبعون ذراعا كما مضى في ( الحاقة ) . وقرأ نافع والكسائي وأبو بكر عن عاصم وهشام عن ابن عامر سلاسلا منونا . الباقون بغير تنوين . ووقف قنبل وابن كثير وحمزة بغير ألف . الباقون بالألف . فأما قوارير الأول فنونه نافع وابن كثير والكسائي وأبو بكر عن عاصم ، ولم ينون الباقون . ووقف فيه يعقوب وحمزة بغير ألف . والباقون بالألف . وأما قوارير الثانية فنونه أيضا نافع والكسائي وأبو بكر ، ولم ينون الباقون . فمن نون قرأها بالألف ، ومن لم ينون أسقط منها الألف ، واختار أبو عبيد التنوين في الثلاثة ، والوقف بالألف اتباعا لخط المصحف ; قال : رأيت في مصحف عثمان \" سلاسلا \" بالألف و ( وقواريرا ) الأول بالألف ، وكان الثاني مكتوبا بالألف فحكت فرأيت أثرها هناك بينا . فمن صرف فله أربع حجج : أحدها : أن الجموع أشبهت الآحاد فجمعت جمع الآحاد ، فجعلت في حكم الآحاد فصرفت . الثانية : أن الأخفش حكى عن العرب صرف جميع ما لا ينصرف إلا أفعل منك ، وكذا قال الكسائي والفراء : هو على لغة من يجر الأسماء كلها إلا قولهم هو أظرف منك فإنهم لا يجرونه ; وأنشد ابن الأنباري في ذلك قول عمرو بن كلثوم :كأن سيوفنا فينا وفيهم مخاريق بأيدي لاعبيناوقال لبيد :وجزور أيسار دعوت لحتفها     بمغالق متشابه أجسامهاوقال لبيد أيضا :فضلا وذو كرم يعين على الندى     سمح كسوب رغائب غنامها[ ص: 111 ] فصرف مخاريق ومغالق ورغائب ، وسبيلها ألا تصرف . والحجة الثالثة : أن يقول نونت قوارير الأول لأنه رأس آية ، ورؤوس الآي جاءت بالنون ، كقوله جل وعز : مذكورا ، سميعا بصيرا فنونا الأول ليوقف بين رؤوس الآي ، ونونا الثاني على الجوار للأول . والحجة الرابعة : اتباع المصاحف ، وذلك أنهما جميعا في مصاحف مكة والمدينة والكوفة بالألف . وقد احتج من لم يصرفهن بأن قال : إن كل جمع بعد الألف منه ثلاثة أحرف أو حرفان أو حرف مشدد لم يصرف في معرفة ولا نكرة ; فالذي بعد الألف منه ثلاثة أحرف قولك : قناديل ودنانير ومناديل ، والذي بعد الألف منه حرفان قول الله - عز وجل - : لهدمت صوامع لأن بعد الألف منه حرفين ، وكذلك قوله : ومساجد يذكر فيها اسم الله كثيرا . والذي بعد الألف منه حرف مشدد شواب ودواب . وقال خلف : سمعت يحيى بن آدم يحدث عن ابن إدريس قال : في المصاحف الأول الحرف الأول بالألف والثاني بغير ألف ; فهذا حجة لمذهب حمزة . وقال خلف : رأيت في مصحف ينسب إلى قراءة ابن مسعود الأول بالألف والثاني بغير ألف . وأما أفعل منك فلا يقول أحد من العرب في شعره ولا في غيره هو أفعل منك منونا ; لأن ( من ) تقوم مقام الإضافة فلا يجمع بين تنوين وإضافة في حرف ; لأنهما دليلان من دلائل الأسماء ولا يجمع بين دليلين ; قاله الفراء وغيره .وأغلالا جمع غل تغل بها أيديهم إلى أعناقهم . وعن جبير بن نفير عن أبي الدرداء كان يقول : ارفعوا هذه الأيدي إلى الله - جل ثناؤه - قبل أن تغل بالأغلال . قال الحسن : إن الأغلال لم تجعل في أعناق أهل النار ; لأنهم أعجزوا الرب سبحانه ولكن إذلالا . ( وسعيرا ) تقدم القول فيه .\n","ar.miqbas":"إِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَ وَأَغْلَالًا وَسَعِيرًا (4)أريد التخلص إلى جزاء الفريقين الشاكر والكفور .والجملة مُستأنفة استئنافاً بيانياً لأن قوله : { إمّا شاكراً وإمّا كفوراً } [ الإنسان : 3 ] يثير تطلع السامعين إلى معرفة آثار هذين الحالين المترددِ حالُه بينَهما ، فابتدىء بجزاء الكافر لأن ذكره أقرب .وأكد الخبر عن الوعيد بحرف التأكيد لإِدخال الروْع عليهم لأن المتوعِّد إذا أكَّد كلامه بمؤكِّد فقد آذن بأنه لا هوادة له في وعيده .وأصل { أعتَدْنا } أعدَدنا ، بدالين ، أي هيأنا للكافرين ، يقال : اعتدّ كما يقال : أعَدَّ ، قال تعالى : { وَأعَتدتْ لهن متّكَأً } [ يوسف : 31 ] .وقد تردد أيمة اللغة في أن أصل الفعل بدالين أو بتاء ودال فلم يجزموا بأيهما الأصل لكثرة ورود فعل : أعدّ ، وفعل اعْتَدَّ في الكلام والأظهر أنهما فعلان نشآ من لغتين غير أن الاستعمال خصّ الفعل ذا التاء بعُدة الحرب فقالوا : عَتَاد الحرب ولم يقولوا عدَاد .وأما العُدة بضم العين فتقع على كل ما يعد ويهيأ ، يقال : أعد لكل حال عُدة . ويطلق العَتاد على ما يُعدّ من الأمور .والأكثر أنه إذا أريد الإِدغام جيء بالفعل الذي عينه دال وإذا وجد مقتضى فك الإِدغام لموجب مثل ضمير المتكلم جيء بالفعل الذي عينه تاء .والسلاسل : القيود المصنوعة من حَلق الحديد يقيد بها الجناة والأسرى .والأغلال : جمع غُلّ بضم الغين ، وهو حلقة كبيرة من حديد توضع في رقبة المقيَّد ، وتناط بها السلسلة قال تعالى : { إذ الأغلال في أعناقهم والسلاسل } [ غافر : 71 ] فالأغلال والسلاسل توضع لهم عند سَوْقهم إلى جهنم .والسعير : النار المسعرة ، أي التي سعَّرها الموقِدون بزيادة الوَقود ليشتد التهابها فهو في الأصل وصف بمعنى اسم المفعول جعل علماً على جهنم . وقد تقدم عند قوله : { كلَّما خبَتْ زدناهم سعيراً } في سورة الإسراء ( 97 ) .وكتب سلاسلا } في المصحف الإِماممِ في جميع النسخ التي أرسلت إلى الأمصار بألف بعد اللام الثانية ولكن القراء اختلفوا في قراءته ، فنافع والكسائي وهشام عن ابن عامر وأبو بكر عن عاصم وأبو جعفر قرأوا { سَلاسلاً } منوناً في الوصل ووقفوا عليه كما يوقف على المنون المنصوب ، وإذ كان حقه أن يمنع من الصرف لأنه على صيغة منتهى الجمع تعين أن قراءته بالتنوين لمراعاة مزاوجته مع الاسمين اللذيْن بعده وهما { أغلالاً } و { سعيراً } ، والمزاوجة طريقة في فصيح الكلام ، ومنها قول النبي صلى الله عليه وسلم لنساءٍ \" ارجِعْنَ مَأزورات غير مأجورات \" فجعل «مأزورات» مهموزاً وحقه أن يكون بالواو لكنه هُمز لمزاوجة مأجورات ، وكذلك قوله في حديث سؤال الملكين الكافر «فيقال له : لاَ درَيْت ولا تلَيْت» ، وكان الأصل أن يقال : ولا تَلوت . ومنه قول ابن مُقْبِل أو القَلاَّحُ :هتَّاكُ أخْبيَةٍ وَلاَّجُ أبْوِبَةٍ ... يُخَالطُ البِرُّ منه الجِدَّ واللِّينافقوله ( أبوبة ) جمع باب وحقه أن يَقول أبواب .وهذه القراءة متينة يعضدها رسم المصحف وهي جارية على طريقة عربية فصيحة .وقرأه الباقون بدون تنوين في الوصل .واختلفوا في قراءته إذا وقفوا عليه فأكثرهم قرأه في الوقف بدون ألف فيقول { سلاسلْ } في الوقف . وقرأه أبو عمرو ورويس عن يعقوب بالألف على اعتباره منوناً في الوصل .قرأه البَزي عن ابن كثير وابنُ ذكوان عن ابن عامر وحفصٌ عن عاصم في الوقف بجواز الوجهين بالألف وبتركها .فأما الذين لم ينونوا { سلاسلا } في الوصل ووقفوا عليه بألف بعد لامه الثانية . وهما أبو عمرو ورويس عن يعقوب فمخالفة روايتهم لرسم المصحف محمولة على أن الرسم جرى على اعتبار حالة الوقف وذلك كثير فكتابة الألف بعد اللام لقصد التنبيه على إشباع الفتحة عند الوقف لمزاوجة الفواصل في الوقف لأن الفواصل كثيراً ما تعطى أحكام القوافي والأسجاع .وبعدُ فالقراءات روايات مسموعة ورسم المصحف سُنة مَخصوصة به وذكر الطيبي : أن بعض العلماء اعتذر عن اختلاف القراء في قوله : { سَلاسلا } بأنه من الاختلاف في كيفية الأداء كالمَدّ والإِمالة وتخفيف الهمزة وأن الاختلاف في ذلك لا ينافي التواتر .\n","ar.waseet":"ثم بين - سبحانه - بعد هذه الهداية ، ما أعده لفريق الكافرين ، وما أعده لفريق الشاكرين ، فقال - تعالى - :( إِنَّآ أَعْتَدْنَا لِلْكَافِرِينَ . . . ) .قوله - سبحانه - : ( إِنَّآ أَعْتَدْنَا لِلْكَافِرِينَ . . ) كلام مستأنف لبيان جزاء الكافرين بعد أن تطلعت إليه النفس ، بعد سماعها لقوله - تعالى - : ( إِمَّا شَاكِراً وَإِمَّا كَفُوراً ) وابتداء - سبحانه - بذكر جزاء الكافر ، لأن ذكره هو الأقرب ولأن الغرض بيان جزائه على سبيل الإِجمال ، ثم تفصيل القول بعد ذلك فى بيان جزاء المؤمنين .والسلاسل : جمع سلسلة ، وهى القيود المصنوعة من الحديد والتى يقيد بها المجرمون . وقد قرأ بعض القراء السبعة هذا اللفظ بالتنوين ، وقرأه آخرون بدون تنوين .والأغلال : جمع غل - بضم الغين - وهو القيد الذى يقيد به المذنب ويكون فى عنقه ، قال - تعالى - : ( إِذِ الأغلال في أَعْنَاقِهِمْ والسلاسل يُسْحَبُونَ . فِي الحميم ثُمَّ فِي النار يُسْجَرُونَ ) والمعنى : إنا أعتدنا وهيأنا للكافرين سلاسل يقادون بها ، وأغلالا تجمع بها أيديهم إلى أعناقهم على سبيل الإِذلال لهم ، وهيأنا لهم - فوق ذلك - ناراً شديدة الاشتعال تحرق بها أجسادهم .\n","ar.baghawi":"ثم بين ما للفريقين فقال: \"إنا أعتدنا للكافرين سلاسل\"، يعني: في جهنم. قرأ أهل المدينة والكسائي، وأبو بكر عن عاصم: سلاسلاً وقواريراً فقوارير بالألف في الوقف، وبالتنوين في الوصل فيهن جميعاً، وقرأ حمزة ويعقوب بلا ألف في الوقف، ولا تنوين في الوصل فيهن، وقرأ ابن كثير قوارير الأولى بالألف في الوقف وبالتنوين في الوصل، و سلاسل و قوارير الثانية بلا ألف ولا تنوين وقرأ أبو عمرو وابن عامر وحفص سلاسلاً و قواريراً الأولى بالألف في الوقف على الخط وبغير تنوين في الوصل، و قوارير الثانية بغير ألف ولا تنوين. قوله \"وأغلالاً\" يعني: في أيديهم، تغل إلى أعناقهم، \"وسعيراً\"، وقوداً شديداً.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5595.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5595.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5595.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"إِنَّ الْأَبْرَارَ يَشْرَبُونَ مِنْ كَأْسٍ كَانَ مِزَاجُهَا كَافُورًا","transliteration":"innal abraara yashra boona min kaasin kaana mizaa juhaa kaafooraa","translations":{"en.ahmedali":"Surely the devotees will drink cups flavoured with palm blossoms","en.ahmedraza":"Indeed the virtuous will drink from a cup, containing a mixture of Kafoor.","en.arberry":"Surely the pious shall drink of a cup whose mixture is camphor,","en.asad":"[whereas,] behold, the truly virtuous shall drink from a cup flavoured with the calyx of sweet-smelling flowers:","en.daryabadi":"Verily the pious shall drink of a cup whereof the admixture is like Unto camphor.","en.hilali":"Verily, the Abrar (pious, who fear Allah and avoid evil), shall drink a cup (of wine) mixed with water from a spring in Paradise called Kafur.","en.pickthall":"Lo! the righteous shall drink of a cup whereof the mixture is of Kafur,","en.qaribullah":"But the righteous shall drink of a goblet mixed with camphor;","en.sahih":"Indeed, the righteous will drink from a cup [of wine] whose mixture is of Kafur,","en.sarwar":"The virtuous ones will drink from a cup containing camphor","en.yusufali":"As to the Righteous, they shall drink of a Cup (of Wine) mixed with Kafur,-","en.maududi":"The virtuous shall drink from a cup tempered with camphor water.","en.shakir":"Surely the righteous shall drink of a cup the admixture of which is camphor","en.itani":"But the righteous will drink from a cup whose mixture is aroma.","en.mubarakpuri":"Verily, the Abrar (righteous believers) shall drink of a cup mixed with Kafur.","en.qarai":"Indeed the pious will drink from a cup seasoned with Kafur,","en.wahiduddin":"the righteous shall drink from a cup mixed with the coolness of kafur,"},"tafsir":{"ar.muyassar":"إن أهل الطاعة والإخلاص الذين يؤدون حق الله، يشربون يوم القيامة مِن كأس فيها خمر ممزوجة بأحسن أنواع الطيب، وهو ماء الكافور.","ar.jalalayn":"«إن الأبرار» جمع بر أو بار وهم المطيعون «يشربون من كأس» هو إناء شرب الخمر وهي فيه والمراد من خمر تسمية للحال باسم المحل ومن للتبعيض «كان مزاجها» ما يمزج به «كافورا».","ar.qurtubi":"قوله تعالى : إن الأبرار يشربون من كأس الأبرار : أهل الصدق واحدهم بر ، وهو من امتثل أمر الله تعالى . وقيل : البر الموحد والأبرار جمع بار مثل شاهد وأشهاد ، وقيل : هو جمع بر مثل نهر وأنهار ; وفي الصحاح : وجمع البر الأبرار ، وجمع البار البررة ، وفلان يبر خالقه ويتبرره أي يطيعه ، والأم برة بولدها . وروى ابن عمر عن رسول الله - صلى الله عليه وسلم - قال : \" إنما سماهم الله - جل ثناؤه - الأبرار لأنهم بروا الآباء والأبناء ، كما أن لوالدك عليك حقا كذلك لولدك [ ص: 112 ] عليك حقا \" . وقال الحسن : البر الذي لا يؤذي الذر . وقال قتادة : الأبرار الذين يؤدون حق الله ويوفون بالنذر . وفي الحديث : \" الأبرار الذين لا يؤذون أحدا \" . يشربون من كأس أي من إناء فيه الشراب . قال ابن عباس : يريد الخمر . والكأس في اللغة الإناء فيه الشراب : وإذا لم يكن فيه شراب لم يسم كأسا . قال عمرو بن كلثوم :صددت الكأس عنا أم عمرو وكان الكأس مجراها اليميناوقال الأصمعي : يقال صبنت عنا الهدية أوما كان من معروف تصبن صبنا : بمعنى كففت ; قاله الجوهري .كان مزاجها أي شوبها وخلطها ، قال حسان :كأن سبيئة من بيت رأس     يكون مزاجها عسل وماءومنه مزاج البدن وهو ما يمازجه من الصفراء والسوداء والحرارة والبرودة . كافورا قال ابن عباس : هو اسم عين ماء في الجنة ، يقال له عين الكافور . أي يمازجه ماء هذه العين التي تسمى كافورا . وقال سعيد عن قتادة : تمزج لهم بالكافور وتختم بالمسك . وقاله مجاهد . وقال عكرمة : مزاجها طعمها . وقيل : إنما الكافور في ريحها لا في طعمها . وقيل : أراد كالكافور في بياضه وطيب رائحته وبرده ; لأن الكافور لا يشرب ; كقوله تعالى : حتى إذا جعله نارا أي كنار . وقال ابن كيسان : طيب بالمسك والكافور والزنجبيل . وقال مقاتل : ليس بكافور الدنيا . ولكن سمى الله ما عنده بما عندكم حتى تهتدي لها القلوب . وقوله : كان مزاجها ( كان ) زائدة أي من كأس مزاجها كافور .\n","ar.miqbas":"إِنَّ الْأَبْرَارَ يَشْرَبُونَ مِنْ كَأْسٍ كَانَ مِزَاجُهَا كَافُورًا (5) هذا استئناف بياني ناشىء عن الاستئناف الذي قبله من قوله : { إنا أعتدنا للكافرين سلاسلا } [ الإنسان : 4 ] الخ . فإن من عرف ما أعد للكَفُور من الجزاء يتطلع إلى معرفة ما أعد للشاكر من الثواب .وأخر تفصيله عن تفصيل جزاء الكفور مع أن { شاكراً } [ الإنسان : 3 ] مذكور قبل { كفوراً } [ الإنسان : 3 ] ، على طريقة اللف والنشر المعكوس ليتسع المجال لإِطناب الكلام على صفة جزاء الشاكرين وما فيه من الخير والكرامة ، تقريباً للموصوف من المشاهدة المحسوسة .وتأكيد الخبر عن جزاء الشاكرين لدفع إنكار المشركين أن يكون المؤمنون خيراً منهم في عالم الخلود ، ولإِفادة الاهتمام بهذه البشارة بالنسبة إلى المؤمنين .و { الأبرار } : هم الشاكرون ، عُبر عنهم بالأبرار زيادة في الثناء عليهم .و { الأَبرار } : جمع بَر بفتح الباء ، وجمعُ بَار أيضاً مثل شاهد وأشهاد ، والبار أو البَرّ المكثر من البِرّ بكسر الباء وهو فعل الخير ، ولذلك كان البَرّ من أوصاف الله تعالى قال تعالى : { إنا كنا من قبل ندعوه أنه هو البَر الرحيم } [ الطور : 28 ] .ووصف بَرَ أقوى من بارّ في الاتصاف بالبرِ ، ولذلك يقال : الله بَر ، ولم يُقل : الله بَار .ويجمع برّ على بَرَرة . ووقع في «مفردات الراغب» : أن بررة أبلغ من أبرار .وابتدىء في وصف نعيمهم بنعيم لذة الشرب من خمر الجنة لما للذة الخمر من الاشتهار بين الناس ، وكانوا يتنافسون في تحصيلها .والكأس : بالهمزة الإِناء المجعول للخمر فلا يسمى كأساً إلاّ إذا كان فيه خمر ، وقد تسمى الخمر كأساً على وجه المجاز المرسل بهذا الاعتبار كما سيجيء قريباً قوله تعالى : { ويسقون فيها كأساً كان مزاجُها زنجبيلاً } [ الإنسان : 17 ] فيجوز أن يراد هنا آنية الخمر فتكون { مِن } للابتداء وإفراد { كأس } للنوعية ، ويجوز أن تراد الخمر فتكون { مِن } للتبعيض .وعلى التقديرين فكأس مراد به الجنس وتنوينه لتعظيمه في نوعه .والمزاج : بكسر الميم ما يمزج به غيرُه ، أي يخلط وكانوا يمزجون الخمر بالماء إذا كانت الخمر معتقة شديدة ليخففوا من حدتها وقد ورد ذكر مزج الخمر في أشعار العرب كثيراً .وضمير { مزاجها } عائد إلى { كأس } .فإذا أريد بالكأس إناء الخمر فالإِضافة لأدنى ملابسة ، أي مزاج ما فيها ، وإذا أريدت الخمر فالإضافة من إضافة المصدر إلى مفعوله .والكافور : «زيت يستخرج من شجرة تشبه الدِفْلَى تنبت في بلاد الصين وجَاوة يتكون فيها إذا طالت مدتُها نحواً من مائتي سنة فيُغلَّى حَطَبها ويستخرج منه زيت يسمى الكَافور . وهو ثخِن قد يتصلب فيصير كالزُبْد وإذا يقع حطب شجرة الكافور في الماء صار نبيذاً يتخمر فيصير مسكراً .والكافور أبيض اللون ذكي الرائحة منعش .فقيل إن المزاج هنا مراد به الماء والإِخبار عنه بأنه كافور من قبيل التشبيه البليغ ، أي في اللون أو ذكاء الرائحة ، ولعل الذي دعا بعض المفسرين إلى هذا أن المتعارف بين الناس في طيب الخمر أن يوضع المسك في جوانب الباطية قال النابغة :وتسقى إذا ما شئت غير مُصرَّد ... بزوراء في حافاتها المسك كارعويختم على آنية الخمر بخاتم من مسك كما في قوله تعالى في صفة أهل الجنة : { يُسْقَوْن من رحيق مختوم ختامه مسك } [ المطففين : 25 ، 26 ] . وكانوا يجعلون الفلفل في الخمر لحسن رائحته ولذعة حرارته لذعة لذيذة في اللسان ، كما قال امرؤ القيس :صُبِّحْنَ سلافاً من رحيق مُفلفل ... ويحتمل أن يكونوا يمزجون الخمر بماء فيه الكافور أو بزيته فيكون المزاج في الآية على حقيقته مما تمزج به الخمر ولعل ذلك كان من شأن أهل الترف لأن الكافور ثمين وهو معدود في العطور .\n","ar.waseet":"ثم بين - سبحانه - ما أعده للمؤمنين الصادقين من خير عميم فقال : ( إِنَّ الأبرار يَشْرَبُونَ مِن كَأْسٍ كَانَ مِزَاجُهَا كَافُوراً ) .والأبرار : جمع بَرٍّ أو بَارٍّ . وهو الإِنسان المطيع لله - تعالى - طاعة تامة ، والمسارع فى فعل الخير ، والشاكر لله - تعالى - على نعمه .والكأس : هو الإِناء الذى توضع فيه الخمر ، ولا يسمى بهذا الاسم إلا إذا كانت الخمر بداخله ، ويصح أن يطلق الكأس على الخمر ذاتها على سبيل المجاز ، من باب تسمية الحال باسم الحال ، وهو المراد هنا . لقوله - تعالى - ( كَانَ مِزَاجُهَا كَافُوراً ) و \" من \" للتبعيض .والضمير فى قوله ( مِزَاجُهَا ) يعود إلى الكأس التى أريد بها الخمر ، والمراد \" بمزاجها \" خليطها من المزج بمعنى الخلط يقال : مزجت الشئ بالشئ ، إذا خلطته به .والكافور : اسم لسائل طيب الرائحة ، أبيض اللون ، تميل إليه النفوس .أى : إن المؤمنين الصادقين ، الذين أخلصوا لله - تعالى - الطاعة والعبادة والشكر . . يكافئهم - سبحانه - على ذلك ، بأن يجعلهم يوم القيامة فى جنات عالية ، ويتمتعون بالشراب من خمر ، هذه الخمر كانت مخلوطة بالكافور الذى تنتعش له النفوس ، وتحبه الأرواح والقلوب ، لطيب رائحته ، وجمال شكله .\n","ar.baghawi":"\"إن الأبرار\"، يعني المؤمنين الصادقين في إيمانهم المطيعين لربهم، واحدهم بار، مثل: شاهد وأشهاد، وناصر وأنصار، و بر أيضاً مثل: نهر وأنهار، \"يشربون\"، في الآخرة، \"من كأس\"، فيها شراب \"كان مزاجها كافوراً\"، قال قتادة: يمزج لهم بالكافور ويختم بالمسك. قال عكرمة: \"مزاجها\": طعمها، وقال أهل المعاني: أراد كالكافور في بياضه وطيب ريحه وبرده، لأن الكافور لا يشرب، وهو كقوله: \"حتى إذا جعله ناراً\" (الكهف- 96) أي كنار. وهذا معنى قول قتادة ومجاهد: يمازجه ريح الكافور. وقال ابن كيسان: طيبت بالكافور والمسك والزنجبيل. وقال عطاء والكلبي: الكافور اسم لـ\"عين ماء في الجنة\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5596.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5596.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5596.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا","transliteration":"'Aynany yashrabu bihaa 'ibaadul laahi yafajjiroonahaa tafjeeraa","translations":{"en.ahmedali":"From a spring of which the votaries of God will drink and make it flow in abundance.","en.ahmedraza":"The Kafoor is a spring, from which the chosen bondmen of Allah will drink, causing it to flow wherever they wish inside their palaces.","en.arberry":"a fountain whereat drink the servants of God, making it to gush forth plenteously.","en.asad":"a source [of bliss] whereof God's servants shall drink, seeing it flow in a flow abundant.","en.daryabadi":"From a fountain whence the bondmen of Allah will drink, causing it to gush abundantly.","en.hilali":"A spring wherefrom the slaves of Allah will drink, causing it to gush forth abundantly.","en.pickthall":"A spring wherefrom the slaves of Allah drink, making it gush forth abundantly,","en.qaribullah":"a fountain at which the worshipers of Allah drink and make it gush forth abundantly;","en.sahih":"A spring of which the [righteous] servants of Allah will drink; they will make it gush forth in force [and abundance].","en.sarwar":"which flows from a spring from which the servants of God will drink.","en.yusufali":"A Fountain where the Devotees of Allah do drink, making it flow in unstinted abundance.","en.maududi":"This will be a gushing spring wherefrom Allah's servants shall drink wine, a spring from which they will take out channels wherever they wish.","en.shakir":"A fountain from which the servants of Allah shall drink; they make it to flow a (goodly) flowing forth.","en.itani":"A spring from which the servants of God will drink, making it gush abundantly.","en.mubarakpuri":"A spring wherefrom the servants of Allah will drink, causing it to gush forth abundantly.","en.qarai":"a spring where Allah’s servants will drink, making it gush forth as they please.","en.wahiduddin":"a spring from which God's servants will drink, making it gush forth in branches."},"tafsir":{"ar.muyassar":"هذا الشراب الذي مزج من الكافور هو عين يشرب منها عباد الله، يتصرفون فيها، ويُجْرونها حيث شاؤوا إجراءً سهلا. هؤلاء كانوا في الدنيا يوفون بما أوجبوا على أنفسهم من طاعة الله، ويخافون عقاب الله في يوم القيامة الذي يكون ضرره خطيرًا، وشره فاشيًا منتشرًا على الناس، إلا مَن رحم الله، ويُطْعِمون الطعام مع حبهم له وحاجتهم إليه، فقيرًا عاجزًا عن الكسب لا يملك من حطام الدنيا شيئًا، وطفلا مات أبوه ولا مال له، وأسيرًا أُسر في الحرب من المشركين وغيرهم، ويقولون في أنفسهم: إنما نحسن إليكم ابتغاء مرضاة الله، وطلب ثوابه، لا نبتغي عوضًا ولا نقصد حمدًا ولا ثناءً منكم. إنا نخاف من ربنا يومًا شديدًا تَعْبِس فيه الوجوه، وتتقطَّبُ الجباه مِن فظاعة أمره وشدة هوله.","ar.jalalayn":"«عينا» بدل من كافورا فيها رائحته «يشرب بها» منها «عباد الله» أولياؤه «يفجّرونها تفجيرا» يقودونها حيث شاءوا من منازلهم.","ar.qurtubi":"عينا يشرب بها عباد الله قال الفراء : إن الكافور اسم لعين ماء في الجنة ; ف \" عينا \" بدل من كافور على هذا . وقيل : بدل من كأس على الموضع . وقيل : هي حال من المضمر في مزاجها . وقيل : نصب على المدح ; كما يذكر الرجل فتقول : العاقل اللبيب ; أي ذكرتم العاقل اللبيب فهو نصب بإضمار أعني . وقيل يشربون عينا . وقال الزجاج المعنى من عين . ويقال : كافور وقافور . والكافور أيضا : وعاء طلع النخل وكذلك الكفرى ; قاله الأصمعي .وأما قول الراعي :تكسو المفارق واللبات ذا أرج     من قصب معتلف الكافور دراجفإن الظبي الذي يكون منه المسك إنما يرعى سنبل الطيب فجعله كافورا . يشرب بها قال الفراء : يشرب بها ويشربها سواء في المعنى ، وكأن يشرب بها يروى بها وينقع ; وأنشد [ الشاعر أبو ذؤيب ] :شربن بماء البحر ثم ترفعت     متى لجج خضر لهن نئيج[ ص: 113 ] قال : ومثله فلان يتكلم بكلام حسن ، ويتكلم كلاما حسنا . وقيل : المعنى يشربها والباء زائدة وقيل : الباء بدل ( من ) تقديره يشرب منها ; قاله القتبي .يفجرونها تفجيرا فيقال : إن الرجل منهم ليمشي في بيوتاته ويصعد إلى قصوره ، وبيده قضيب يشير به إلى الماء فيجري معه حيثما دار في منازله على مستوى الأرض في غير أخدود ، ويتبعه حيثما صعد إلى أعلى قصوره ; وذلك قوله تعالى : عينا يشرب بها عباد الله يفجرونها تفجيرا أي يشققونها شقا كما يفجر الرجل النهر هاهنا وهاهنا إلى حيث يريد . وعن ابن أبي نجيح عن مجاهد ( يفجرونها تفجيرا ) يقودونها حيث شاءوا وتتبعهم حيثما مالوا مالت معهم . وروى أبو مقاتل عن أبي صالح عن سعد عن أبي سهل عن الحسن قال : قال رسول الله - صلى الله عليه وسلم - : \" أربع عيون في الجنة عينان تجريان من تحت العرش إحداهما التي ذكر الله يفجرونها تفجيرا والأخرى الزنجبيل ، والأخريان نضاختان من فوق العرش إحداهما التي ذكر الله [ عينا فيها تسمى ] ( سلسبيلا ) والأخرى التسنيم \" ذكره الترمذي الحكيم في ( نوادر الأصول ) . وقال : فالتسنيم للمقربين خاصة شربا لهم ، والكافور للأبرار شربا لهم ; يمزج للأبرار من التسنيم شرابهم ، وأما الزنجبيل والسلسبيل فللأبرار منها مزاج هكذا ذكره في التنزيل وسكت عن ذكر ذلك لمن هي شرب ، فما كان للأبرار مزاجا فهو للمقربين صرف ، وما كان للأبرار صرفا فهو لسائر أهل الجنة مزاج . والأبرار هم الصادقون ، والمقربون : هم الصديقون .\n","ar.miqbas":"عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا (6)ومن المفسرين من قال : إن كافور اسم عين في الجنة لأجل قوله عقبه { عيناً يشرب بها عباد الله } وستعلم حق المراد منه .وإقحام فعل { كان } في جملة الصفة بقوله : { كان مزاجها كافوراً } لإِفادة أن ذلك مزاجها لا يفارقها إذ كان معتاد الناس في الدنيا ندرة ذلك المزاج لغلاء ثمنه وقلة وجدانه .وانتصب { عيناً } على البدل من { كافوراً } أي ذلك الكافور تجري به عين في الجنة من ماء محلول فيه أو من زيته مثل قوله : { وأنهار من لبن لم يتغير طعمه وأنهار من خمر لذة للشاربين وأنهار من عسل مصفى } [ محمد : 15 ] . وعدي فعل { يشرب } بالباء وهي باء الإِلصاق لأن الكافور يمزج به شرابهم . فالتقدير : عيْناً يشرب عباد الله خمرهم بها ، أي مصحوباً بمائها ، وذهب الأصمعي إلى أن الباء في قوله تعالى : { يشرب بها عباد الله } بمعنى ( من ) التبعيضية ووافقه الفارسي وابن قتيبة وابن مالك ، وعَدّ في كتبه ذلك من معاني الباء ونُسب إلى الكوفيين .و { عبادُ الله } مراد بهم : الأبرار . وهو إظهار في مقام الإِضمار للتنويه بهم بإضافة عبوديتهم إلى الله تعالى إضافةَ تشريف .والتفجير : فتح الأرض عن الماء أي استنباط الماء الغزير وأطلق هنا على الاستقاء منها بلا حدّ ولا نضوب فكان كل واحد يفجر لنفسه ينبوعاً وهذا من الاستعارة .وأكد فعل { يفجرونها تفجيراً } ترشيحاً للاستعارة .\n","ar.waseet":"وذكر - سبحانه - ( عَيْناً يَشْرَبُ بِهَا عِبَادُ الله . . . ) بدل من قوله : ( كَانَ مِزَاجُهَا كَافُوراً ) لأن ماءها فى بياض الكافور وفى رائحته وبرودته .أى : أن الأبرار يشربون من كأس ، ماؤها ينبع من عين فى الجنة ، هذا الماء له بياض الكافور ورائحته وبرودته .وعدى فعل \" يشرب \" بالباء ، التى هى باء الإِلصاق ، لأن الكافور يمزج به شرابهم . أى؛ عينا يشرب عباد الله ماءهم وخمرهم بها . أى : مصحوبا بمائها وخمرها .ومنهم من جعل الباء هنا بمعنى من التبعيضية . أى : عينا يشرب من بعض مائها وخمرها عباد الله ، وهم الأبرار .وعبر عنهم بذلك لتشريفهم وتكريمهم ، حيث أضافهم - سبحانه - إلى ذاته .قال صاحب الكشاف : فإن قلت : لم وصل فعل الشرب بحرف الابتداء أولا ، وبحرف الإِلصاق آخرا؟ قلت : لأن الكأس مبدأ شربهم وأول غايته ، وأما العين فبها يمزجون شرابهم ، فكأن المعنى : يشرب عباد الله بها الخمر ، كما تقول : شربت الماء بالعسل . .وقوله - سبحانه - : ( يُفَجِّرُونَهَا تَفْجِيراً ) صفة أخرى للعين ، أى : يسيرونها ويجرونها إلى حيث يريدون ، وينتفعون بها كما يشاؤون ، ويتبعهم ماؤها إلى كل مكان يتوجهون إليه .فالتعبير بقوله : ( يُفَجِّرُونَهَا تَفْجِيراً ) إشارة إلى كثرتها وسعتها وسهولة حصولهم عليها يقال : فجَّر فلان الماء ، إذا أخرجه من الأرض بغزارة ومنه قوله - تعالى - ( وَقَالُواْ لَن نُّؤْمِنَ لَكَ حتى تَفْجُرَ لَنَا مِنَ الأرض يَنْبُوعاً ).\n","ar.baghawi":"\"عيناً\"، نصب تبعاً للكافور. وقيل: هو نصب على المدح. وقيل أعني عيناً. وقال الزجاج: الأجود أن يكون المعنى من عين، \"يشرب بها\"، قيل: يشربها والباء صلة وقيل بها أي منها، \"عباد الله\"، قال ابن عباس أولياء الله، \"يفجرونها تفجيراً\"، أي يقودونها حيث شاؤوا من منازلهم وقصورهم، كمن يكون له نهر يفجره ها هنا وها هنا إلى حيث يريد.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5597.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5597.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5597.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"يُوفُونَ بِالنَّذْرِ وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُ مُسْتَطِيرًا","transliteration":"Yoofoona binnazri wa yakhaafoona yawman kaana sharruhoo mustateeraa","translations":{"en.ahmedali":"Those who fulfil their vows and fear the Day whose evil shall be diffused far and wide,","en.ahmedraza":"They fulfil their pledges, and fear a day the evil of which is widespread.","en.arberry":"They fulfil their vows, and fear a day whose evil is upon the wing;","en.asad":"[The truly virtuous are] they [who] fulfil their vows, and stand in awe of a Day the woe of which is bound to spread far and wide,","en.daryabadi":"They fulfill their vow and dread a Day the evil whereof shall be widespreading.","en.hilali":"They (are those who) fulfill (their) vows, and they fear a Day whose evil will be wide-spreading.","en.pickthall":"(Because) they perform the vow and fear a day whereof the evil is wide-spreading,","en.qaribullah":"they who keep their vows and fear a Day whose evil is spread;","en.sahih":"They [are those who] fulfill [their] vows and fear a Day whose evil will be widespread.","en.sarwar":"The servants of God fulfill their vows and are afraid of the day in which there will be widespread terror.","en.yusufali":"They perform (their) vows, and they fear a Day whose evil flies far and wide.","en.maududi":"These will be the ones who fulfil their vows and dread the Day whose woe shall be spread far and wide;","en.shakir":"They fulfill vows and fear a day the evil of which shall be spreading far and wide.","en.itani":"They fulfill their vows, and dread a Day whose ill is widespread.","en.mubarakpuri":"They fulfill (their) vows, and they fear a Day whose evil will be wide-spreading.","en.qarai":"They fulfill their vows and fear a day whose ill will be widespread.","en.wahiduddin":"They keep their vows and fear a day the woe of which will spread far and wide;"},"tafsir":{"ar.muyassar":"هذا الشراب الذي مزج من الكافور هو عين يشرب منها عباد الله، يتصرفون فيها، ويُجْرونها حيث شاؤوا إجراءً سهلا. هؤلاء كانوا في الدنيا يوفون بما أوجبوا على أنفسهم من طاعة الله، ويخافون عقاب الله في يوم القيامة الذي يكون ضرره خطيرًا، وشره فاشيًا منتشرًا على الناس، إلا مَن رحم الله، ويُطْعِمون الطعام مع حبهم له وحاجتهم إليه، فقيرًا عاجزًا عن الكسب لا يملك من حطام الدنيا شيئًا، وطفلا مات أبوه ولا مال له، وأسيرًا أُسر في الحرب من المشركين وغيرهم، ويقولون في أنفسهم: إنما نحسن إليكم ابتغاء مرضاة الله، وطلب ثوابه، لا نبتغي عوضًا ولا نقصد حمدًا ولا ثناءً منكم. إنا نخاف من ربنا يومًا شديدًا تَعْبِس فيه الوجوه، وتتقطَّبُ الجباه مِن فظاعة أمره وشدة هوله.","ar.jalalayn":"«يوفون بالنذر» في طاعة الله «ويخافون يوما كان شره مستطيرا» منتشرا.","ar.qurtubi":"قوله تعالى : يوفون بالنذر أي لا يخلفون إذا نذروا . وقال معمر عن قتادة : بما فرض الله عليهم من الصلاة والزكاة والصوم والحج والعمرة وغيره من الواجبات . وقال مجاهد وعكرمة : يوفون إذا نذروا في حق الله جل ثناؤه . وقال الفراء والجرجاني : وفي الكلام إضمار ; أي كانوا يوفون بالنذر في الدنيا . والعرب قد تزيد مرة ( كان ) وتحذف أخرى . والنذر : حقيقته ما أوجبه المكلف على نفسه من شيء يفعله . وإن شئت قلت في حده : النذر : هو إيجاب المكلف على نفسه من الطاعات ما لو لم يوجبه لم يلزمه . وقال الكلبي : يوفون بالنذر أي يتممون العهود والمعنى واحد ; وقد قال الله تعالى : ثم ليقضوا تفثهم وليوفوا نذورهم أي [ ص: 114 ] أعمال نسكهم التي ألزموها أنفسهم بإحرامهم بالحج . وهذا يقوي قول قتادة . وأن النذر يندرج فيه ما التزمه المرء بإيمانه من امتثال أمر الله ; قاله القشيري . وروى أشهب عن مالك أنه قال : يوفون بالنذر هو نذر العتق والصيام والصلاة . وروى عنه أبو بكر بن عبد العزيز قال مالك . يوفون بالنذر قال : النذر : هو اليمين .قوله تعالى : ويخافون أي يحذرون يوما أي يوم القيامة . كان شره مستطيرا أي عاليا داهيا فاشيا وهو في اللغة ممتدا ; والعرب تقول : استطار الصدع في القارورة والزجاجة واستطال : إذا امتد ; قال الأعشى :وبانت وقد أسأرت في الفؤا د صدعا على نأيها مستطيراويقال : استطار الحريق : إذا انتشر . واستطار الفجر إذا انتشر الضوء .وقال حسان :وهان على سراة بني لؤي     حريق بالبويرة مستطيروكان قتادة يقول : استطار والله شر ذلك اليوم حتى ملأ السماوات والأرض . وقال مقاتل : كان شره فاشيا في السماوات فانشقت ، وتناثرت الكواكب ، وفزعت الملائكة ، وفي الأرض نسفت الجبال وغارت المياه .\n","ar.miqbas":"يُوفُونَ بِالنَّذْرِ وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُ مُسْتَطِيرًا (7)اعتراض بين جملة { يَشْربون من كأس } [ الإنسان : 5 ] الخ وبين جملة { ويطاف عليهم بآنية من فضة } [ الإنسان : 15 ] الخ . وهذا الاعتراض استئناف بياني هو جواب عن سؤال من شأن الكلام السابق أن يثيره في نفسه السامع المغتبِط بأن ينال مثل ما نالوا من النعيم والكرامة في الآخرة . فيهتم بأن يفعل مثل ما فعلوا ، فذكر بعض أعمالهم الصالحة التي هي من آثار الإِيمان مع التعريض لهم بالاستزادة منها في الدنيا .والكلام إخبار عنهم صادر في وقت نزول هذه الآيات ، بعضُه وصف لحالهم في الآخرة وبعضه وصف لبعض حالهم في الدنيا الموجب لنوال ما نالوه في الآخرة ، فلا حاجة إلى قول الفراء : إن في الكلام إضماراً وتقديره : كانوا يُوفُون بالنذر .وليست الجملة حالاً من { الأبرار } [ الإنسان : 5 ] وضميرهم لأن الحال قيد لعاملها فلو جعلت حالاً لكانت قيداً ل { يشربون } [ الإنسان : 5 ] ، وليس وفاؤهم بالنذر بحاصل في وقت شربهم من خمر الجنة بل هو بما أسلفوه في الحياة الدنيا .والوفاء : أداء ما وجب على المؤدي وافياً دون نقص ولا تقصير فيه .والنذر : ما يعتزمه المرء ويعقد عليه نِيته ، قال عنترة :والنَّاذِرَيْننِ إذا لم ألْقهما دَمي ... والمراد به هنا ما عقدوا عليه عزمهم من الإِيمان والامتثال وهو ما استحقوا به صفة { الأبرار } [ الإنسان : 5 ] .ويجوز أن يراد { بالنذر } ما ينذرونه من فعل الخير المتقرَّب به إلى الله ، أي ينشئون النذور بها ليوجبوها على أنفسهم .وجيء بصيغة المضارع للدلالة على تجدد وفائهم بما عقدوا عليه ضمائرهم من الإِيمان والعمل الصالح ، وذلك مشعر بأنهم يكثرون نذر الطاعات وفعل القربات ولولا ذلك لما كان الوفاء بالنذر موجباً الثناء عليهم .والتعريف في ( النذر ) تعريف الجنس فهو يعم كل نذر .وعطف على { يوفون بالنذر } قوله : { ويخافون يوماً كان شرّه مستطيراً } لأنهم لما وصفوا بالعمل بما ينذرونه أتبع ذلك بذكر حسن نيتهم وتحقق إخلاصهم في أعمالهم لأن الأعمال بالنيات فجمع لهم بهذا صحة الاعتقاد وحسن الأعمال .وخوفهم اليوم مجاز عقلي جرى في تعلق اليوم بالخوف لأنهم إنما يخافون ما يجري في ذلك اليوم من الحساب والجزاء على الأعمال السيئة بالعقاب فعلق فعل الخوْف بزمان الأشياء المخوفة .وانتصب { يوماً } على المفعول به ل { يخافون } ولا يصح نصبه على الظرفية لأن المراد بالخوف خوفهم في الدنيا من ذنوب تجر إليهم العقاب في ذلك اليوم ، وليس المراد أنهم يخافون في ذلك اليوم فإنهم في ذلك اليوم آمنون .ووُصِف اليومُ بأن له شرّاً مستطيراً وصفاً مشعراً بعلة خوفهم إياه . فالمعنى : أنهم يخافون شر ذلك اليوم فيتجنبون ما يُفضي بهم إلى شره من الأعمال المتوعد عليها بالعقاب .والشر : العذاب والجزاء بالسوء .والمستطير : هو اسم فاعل من استطار القاصر ، والسين والتاء في استطار للمبالغة وأصله طار مثل استكبر . والطيران مجازي مستعار لانتشار الشيء وامتداده تشبيهاً له بانتشار الطير في الجو ، ومنه قولهم : الفجر المستطير ، وهو الفجر الصادق الذي ينتشر ضوؤه في الأفق ويقال : استطار الحريق إذا انتشر وتلاحق .وذكر فعل { كان } للدلالة على تمكن الخبر من المخبر عنه وإلاّ فإن شر ذلك اليوم ليس واقعاً في الماضي وإنما يقع بعد مستقبل بعيد ، ويجوز أن يجعل ذلك من التعبير عن المستقبل بلفظ الماضي تنبيهاً على تحقق وقوعه .وصيغة { يخافون } دالة على تجدد خوفهم شّر ذلك اليوم على نحو قوله : { يوفون بالنذر } .\n","ar.waseet":"ثم بين - سبحانه - بعد ذلك فى آيات متعددة ، الأسباب التى من أجلها وصلوا إلى النعيم الدائم . فقال - تعالى - : ( يُوفُونَ بالنذر وَيَخَافُونَ يَوْماً كَانَ شَرُّهُ مُسْتَطِيراً ) .والنذر : ما يوجبه الإِنسان على نفسه من طاعة الله - تعالى - ، والوفاء به : أداؤه أداء كاملا . أى : أن من الأسباب التى جعلت الأبرار يحصلون على تلك النعم ، أنهم من أخلاقهم الوفاء بالنذل ، ومن صفاتهم - أيضا - أنهم يخافون يوما عظيما هو يوم القيامة ، الذى كان عذابه فاشياً منتشراً غاية الانتشار .فقوله : ( مُسْتَطِيراً ) اسم فاعل من استطار الشئ إذا انتشر وامتد أمره ، والسين والتاء فيه للمبالغة ، وأصله طار . ومنه قولهم : استطار الغبار ، إذا انتشر فى الهواء وتفرق وجئ بصيغة المضارع فى قوله : ( يُوفُونَ ) للدلالة على تجدد وفائهم فى كل وقت وحين .والتعريف فى \" النذر \" للجنس ، لأنه يعم كل نذر .وجاء لفظ اليوم منكراً ، ووصف بأن له شراً مستطيرا . . لتهويل أمره ، وتعظيم شأنه ، حتى يستعد الناس لاستقباله بالإِيمان والعمل الصالح .\n","ar.baghawi":"\"يوفون بالنذر\"، هذا من صفاتهم في الدنيا أي كانوا في الدنيا كذلك. قال قتادة: أراد يوفون بما فرض الله عليهم من الصلاة والزكاة والصوم والحج والعمرة، وغيرها من الواجبات، ومعنى النذر: الإيجاب.وقال مجاهد وعكرمة: إذا نذروا في طاعة الله وفوا به.أخبرنا أبو الحسن السرخسي، أخبرنا زاهر بن أحمد، أخبرنا أبو إسحاق الهاشمي، أخبرنا أبو مصعب، عن مالك، عن طلحة بن عبد الملك الأيلي، عن القاسم بن محمد، عن عائشة زوج النبي صلى الله عليه وسلم \"أن رسول الله صلى الله عليه وسلم قال: من نذر أن يطيع الله فليطعه، ومن نذر أن يعصي الله فلا يعصه\". \"ويخافون يوماً كان شره مستطيراً\"، فاشياً ممتداً، استطار الصبح، إذا امتد وانتشر. قال مقاتل: كان شره فاشياً في السموات فانشقت، وتناثرت الكواكب، وكورت الشمس والقمر، وفزعت الملائكة، وفي الأرض: فنسفت الجبال، وغارت المياه، وتكسر كل شيء على الأرض من جبل وبناء.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5598.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5598.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5598.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"وَيُطْعِمُونَ الطَّعَامَ عَلَىٰ حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا","transliteration":"Wa yut''imoonat ta'aama 'alaa hubbihee miskeenanw wa yatemanw wa aseeraa","translations":{"en.ahmedali":"And feed the needy for the love of Him, and the orphans and the captives,","en.ahmedraza":"And out of His love, they give food to the needy, the orphan and the prisoner.","en.arberry":"they give food, for the love of Him, to the needy, the orphan, the captive:","en.asad":"and who give food - however great be their own want of it - unto the needy, and the orphan, and the captive,","en.daryabadi":"And they feed with food, for love of Him, the needy, and the orphan and the captive.","en.hilali":"And they give food, inspite of their love for it (or for the love of Him), to Miskin (poor), the orphan, and the captive,","en.pickthall":"And feed with food the needy wretch, the orphan and the prisoner, for love of Him,","en.qaribullah":"who give food, for the love of Him to the needy, the orphan, and the captive,","en.sahih":"And they give food in spite of love for it to the needy, the orphan, and the captive,","en.sarwar":"They feed the destitute, orphans, and captives for the love of God, saying,","en.yusufali":"And they feed, for the love of Allah, the indigent, the orphan, and the captive,-","en.maududi":"those who, for the love of Him, feed the needy, and the orphan, and the captive,","en.shakir":"And they give food out of love for Him to the poor and the orphan and the captive:","en.itani":"And they feed, for the love of Him, the poor, and the orphan, and the captive.","en.mubarakpuri":"And they give food, inspite of their love for it, to the poor, the orphan and the captive,","en.qarai":"For the love of Him, they feed the needy, the orphan and the prisoner,","en.wahiduddin":"they give food, despite their love for it, to the poor and orphans and captives,"},"tafsir":{"ar.muyassar":"هذا الشراب الذي مزج من الكافور هو عين يشرب منها عباد الله، يتصرفون فيها، ويُجْرونها حيث شاؤوا إجراءً سهلا. هؤلاء كانوا في الدنيا يوفون بما أوجبوا على أنفسهم من طاعة الله، ويخافون عقاب الله في يوم القيامة الذي يكون ضرره خطيرًا، وشره فاشيًا منتشرًا على الناس، إلا مَن رحم الله، ويُطْعِمون الطعام مع حبهم له وحاجتهم إليه، فقيرًا عاجزًا عن الكسب لا يملك من حطام الدنيا شيئًا، وطفلا مات أبوه ولا مال له، وأسيرًا أُسر في الحرب من المشركين وغيرهم، ويقولون في أنفسهم: إنما نحسن إليكم ابتغاء مرضاة الله، وطلب ثوابه، لا نبتغي عوضًا ولا نقصد حمدًا ولا ثناءً منكم. إنا نخاف من ربنا يومًا شديدًا تَعْبِس فيه الوجوه، وتتقطَّبُ الجباه مِن فظاعة أمره وشدة هوله.","ar.jalalayn":"«ويطعمون الطعام على حبه» أي الطعام وشهوتهم له «مسكينا» فقيرا «ويتيما» لا أب له «وأسيرا» يعني المحبوس بحق.","ar.qurtubi":"قوله تعالى : ويطعمون الطعام على حبه قال ابن عباس ومجاهد : على قلته وحبهم إياه وشهوتهم له . وقال الداراني : على حب الله . وقال الفضيل بن عياض : على حب إطعام الطعام . وكان الربيع بن خثيم إذا جاءه السائل قال : أطعموه سكرا فإن الربيع يحب السكر .مسكينا أي ذا مسكنة . وروى أبو صالح عن ابن عباس قال : هو الطواف يسألك مالك ويتيما أي من يتامى المسلمين . وروى منصور عن الحسن : أن يتيما كان يحضر طعام ابن عمر ، فدعا ذات يوم بطعامه ، وطلب اليتيم فلم يجده ، وجاءه بعدما فرغ ابن عمر من طعامه فلم يجد الطعام ، فدعا له بسويق وعسل ; فقال : دونك هذا ، فوالله ما غبنت ; قال الحسن وابن عمر : والله ما غبن . وأسيرا أي الذي يؤسر فيحبس . فروى أبو صالح عن ابن عباس قال : الأسير من أهل الشرك يكون في أيديهم . وقال قتادة . وروى ابن أبي نجيح عن مجاهد قال : الأسير هو المحبوس . وكذا قال سعيد بن جبير وعطاء : هو المسلم يحبس بحق . وعن سعيد بن جبير مثل قول قتادة وابن عباس . قال قتادة : لقد أمر الله بالأسرى أن يحسن إليهم ، وإن أسراهم يومئذ لأهل الشرك ، وأخوك المسلم أحق أن تطعمه . وقال عكرمة : الأسير العبد . وقال أبو حمزة الثمالي : الأسير المرأة ، يدل عليه قوله - عليه السلام - : استوصوا بالنساء خيرا [ ص: 115 ] فإنهن عوان عندكم أي أسيرات . وقال أبو سعيد الخدري : قرأ رسول الله - صلى الله عليه وسلم - ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا فقال : \" المسكين الفقير ، واليتيم الذي لا أب له ، والأسير المملوك والمسجون \" ذكره الثعلبي . وقيل : نسخ إطعام المسكين آية الصدقات ; وإطعام الأسير آية السيف ; قاله سعيد بن جبير . وقال غيره : بل هو ثابت الحكم ، وإطعام اليتيم والمسكين على التطوع ، وإطعام الأسير لحفظ نفسه إلا أن يتخير فيه الإمام . الماوردي : ويحتمل أن يريد بالأسير الناقص العقل ; لأنه في أسر خبله وجنونه ، وأسر المشرك انتقام يقف على رأي الإمام ; وهذا بر وإحسان . وعن عطاء قال : الأسير من أهل القبلة وغيرهم .قلت : وكأن هذا القول عام يجمع جميع الأقوال ، ويكون إطعام الأسير المشرك قربة إلى الله تعالى ، غير أنه من صدقة التطوع ، فأما المفروضة فلا . والله أعلم . ومضى القول في المسكين واليتيم والأسير ، واشتقاق ذلك من اللغة في ( البقرة ) مستوفى والحمد لله .\n","ar.miqbas":"وَيُطْعِمُونَ الطَّعَامَ عَلَى حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا (8) خصص الإِطَعام بالذكر لما في إطعام المحتاج من إيثاره على النفس كما أفاد قوله { على حبه } .والتصريح بلفظ الطعام مع أنه معلوم من فعل { يطعمون } توطئةٌ ليبنى عليه الحال وهو { على حبه } فإنه لو قيل : ويطعمون مسكيناً ويتيماً وأسيراً لفات ما في قوله { على حبه } من معنى إيثار المحاويج على النفس ، على أن ذكر الطعام بعد { يطعمون } يفيد تأكيداً مع استحضار هيئة الإِطعام حتى كأنَّ السامع يشاهد الهيئة .و { على حبه } في موضع الحال من ضمير { يطعمون } .و { على } بمعنى ( مع ) ، وضمير { حبه } راجع للطعام ، أي يطعمون الطعام مصحوباً بحبه ، أي مصاحباً لحبهم إياه وحب الطعام هو اشتهاؤه .فالمعنى : أنهم يطعمون طعاماً هم محتاجون إليه .ومجيء { على } بمعنى ( مع ) ناشىء عن تمَجز في الاستعلاء ، وصورته أن مجرور حرف { على } في مثله أفضل من معمول متعلقها فنزل منزلة المعتلي عليه .والمسكين : المحتاج . واليتيم : فاقد الأب وهو مظنة الحاجة لأن أحوال العرب كانت قائمة على اكتساب الأب للعائلة بكدحه فإذا فُقد الأب تعرضت العائلة للخصاصة .وأما الأسير فإذ قد كانت السورة كلها مكية قبل عِزّة المسلمين ، فالمراد بالأسير العبد من المسلمين إذ كان المشركون قد أجاعوا عبيدهم الذين أسلموا مثل بلال وعمار وأمه وربما سيَّبوا بعضهم إذا أضجرهُم تعذيبهم وتركوهم بلا نفقة .والعبودية تنشأ من الأسر فالعبد أسير ولذلك يقال له العاني أيضاً قال النبي صلى الله عليه وسلم \" فُكّوا العاني \" وقال عن النساء «إنهن عَواننٍ عندكم» على طريقة التشبيه وقال سحيم عبد بني الحسحاس :رأتْ قَتَباً رَثّاً وسَحْق عِمامةٍ ... وأسْودَ هِمّاً يُنكِرُ الناسُ عَانِيايريد عبداً . وذكر القرطبي عن الثعلبي : قال أبو سعيد الخدري «قرأ رسول الله : { ويطعمون الطعام على حُبّهِ مسكيناً ويتيماً وأسيراً } فقال : المسكينُ الفقير ، واليتيم : الذي لا أب له ، والأسير : المملوك والمسجون» . ولم أقف على سند هذا الحديث .وبهذا تعلم أن لا شاهد في هذه الآية لجعل السورة نزلت بالمدينة وفي الأسارى الذين كانوا في أسر المسلمين في غزوة بدر .\n","ar.waseet":"ثم وصفهم - سبحانه - بصفات أخرى فقال : ( وَيُطْعِمُونَ الطعام على حُبِّهِ مِسْكِيناً وَيَتِيماً وَأَسِيراً ) .أى : أن هؤلاء الأبرار من صفاتهم - أيضاً أنهم يطعمون الطعام مع حب هذا الطعام لديهم ، ومع حاجتهم إليه واشتهائهم له .ومع كل ذلك فهم يقدمونه للمسكين ، وهو المحتاج إلى غيره لفقره وسكونه عن الحركة . . ولليتيم : وهو من فقد أباه وهو صغير ، وللأسير : وهو من أصبح أمره بيد غيره ، وخص الإِطعام بالذكر : لما فى تقديمه من كرم وسخاء وإيثار ، لا سيما مع الحاجة إليه ، كما يشعر به قوله - تعالى - ( على حُبِّهِ ) أى : على حبهم لذلك الطعام ، وقيل الضمير فى قوله ( على حُبِّهِ ) يعود إلى الله - عز وجل - أى : يطعمون الطعام على حبهم له - تعالى .والأولى أولى .ويؤيده قوله - تعالى - ( لَن تَنَالُواْ البر حتى تُنْفِقُواْ مِمَّا تُحِبُّونَ ) و \" على \" هنا بمعنى مع ، والجملة فى محل نصب على الحال . أى : حالة كونهم كائنين على حب هذا الطعام .وخص هؤلاء الثلاثة بالذكر ، لأنهم أولى الناس بالرعاية والمساعدة .وقد ذكروا فى سبيل نزول هذه الآية ، والآيتين اللتين يعدها ، روايات منها ، أنها نزلت فى الإِمام على وزوجه فاطمة - رضى الله عنهما - .قال القرطبى - بعد أن ذكر هذه الروايات - : والصحيح أنها نزلت فى جميع الأبرار ، وفى كل من فعل فعلا حسنا ، فهى عامة . .\n","ar.baghawi":"\"ويطعمون الطعام على حبه\"، أي على حب الطعام وقلته وشهوتهم له وحاجتهم إليه. وقيل: على حب الله عز وجل، \"مسكيناً\"، فقيراً لا مال له، \"ويتيماً\"، صغيراً لا أب له \"وأسيراً\"، قال مجاهد وسعيد بن جبير وعطاء: هو المسجون من أهل القبلة. وقال قتادة: أمر الله بالأسراء أن يحسن إليهم، وإن أسراهم يومئذ لأهل الشرك. وقيل: الأسير المملوك. وقيل: المرأة، لقول النبي صلى الله عليه وسلم: \"اتقوا الله في النساء فإنهن عندكم عوان\" أي أسراء. واختلفوا في سبب نزول هذه الآية، قال مقاتل: نزلت في رجل من الأنصار أطعم في يوم واحد مسكيناً ويتيماً وأسيراً. وروى مجاهد وعطاء عن ابن عباس: أنها نزلت في علي بن أبي طالب رضي الله عنه، وذلك أنه عمل ليهودي بشيء من شعير، فقبض الشعير فطحن ثلثه فجعلوا منه شيئاً ليأكلوه، فلما تم إنضاجه أتى مسكين فسأل فأخرجوا إليه الطعام، ثم عمل الثلث الثاني فلما تم إنضاجه أتى يتيم فسأل فأطعموه، ثم عمل الثلث الباقي فلما تم إنضاجه أتى أسير من المشركين، فسأل فأطعموه، وطووا يومهم ذلك: وهذا قول الحسن وقتادة، أن الأسير كان من أهل الشرك، وفيه دليل على أن إطعام الأسارى، وإن كانوا من أهل الشرك، حسن يرجى ثوابه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5599.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5599.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5599.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنْكُمْ جَزَاءً وَلَا شُكُورًا","transliteration":"Innaamaa nut'imukum li wajhil laahi laa nureedu minkum jazaaa'anw wa laa shukooraa","translations":{"en.ahmedali":"(Saying): \"We feed you for the sake of God, desiring neither recompense nor thanks.","en.ahmedraza":"They say to them, “We give you food, only for the sake of Allah – we do not seek any reward or thanks from you.”","en.arberry":"'We feed you only for the Face of God; we desire no recompense from you, no thankfulness;","en.asad":"[saying, in their hearts,] \"We feed you for the sake of God alone: we desire no recompense from you, nor thanks:","en.daryabadi":"Saying: we feed you only for the sake of Allah; we desire not from you any recompense or thanks.","en.hilali":"(Saying): \"We feed you seeking Allah's Countenance only. We wish for no reward, nor thanks from you.","en.pickthall":"(Saying): We feed you, for the sake of Allah only. We wish for no reward nor thanks from you;","en.qaribullah":"(saying): 'We feed you only desirous of the Face of Allah; we seek of you neither recompense nor thanks,","en.sahih":"[Saying], \"We feed you only for the countenance of Allah. We wish not from you reward or gratitude.","en.sarwar":"\"We only feed you for the sake of God and we do not want any reward or thanks from you.","en.yusufali":"(Saying),\"We feed you for the sake of Allah alone: no reward do we desire from you, nor thanks.","en.maududi":"(saying): “We feed you only for Allah's sake; we do not seek of you any recompense or thanks,","en.shakir":"We only feed you for Allah's sake; we desire from you neither reward nor thanks:","en.itani":"“We only feed you for the sake of God. We want from you neither compensation, nor gratitude.","en.mubarakpuri":"(Saying): \"We feed you seeking Allah's Face only. We wish for no reward, nor thanks from you.\"","en.qarai":"[saying,] ‘We feed you only for the sake of Allah. We desire no reward from you, nor thanks.","en.wahiduddin":"saying, \"We feed you for the sake of God alone, we seek neither recompense nor thanks from you."},"tafsir":{"ar.muyassar":"هذا الشراب الذي مزج من الكافور هو عين يشرب منها عباد الله، يتصرفون فيها، ويُجْرونها حيث شاؤوا إجراءً سهلا. هؤلاء كانوا في الدنيا يوفون بما أوجبوا على أنفسهم من طاعة الله، ويخافون عقاب الله في يوم القيامة الذي يكون ضرره خطيرًا، وشره فاشيًا منتشرًا على الناس، إلا مَن رحم الله، ويُطْعِمون الطعام مع حبهم له وحاجتهم إليه، فقيرًا عاجزًا عن الكسب لا يملك من حطام الدنيا شيئًا، وطفلا مات أبوه ولا مال له، وأسيرًا أُسر في الحرب من المشركين وغيرهم، ويقولون في أنفسهم: إنما نحسن إليكم ابتغاء مرضاة الله، وطلب ثوابه، لا نبتغي عوضًا ولا نقصد حمدًا ولا ثناءً منكم. إنا نخاف من ربنا يومًا شديدًا تَعْبِس فيه الوجوه، وتتقطَّبُ الجباه مِن فظاعة أمره وشدة هوله.","ar.jalalayn":"«إنما نطعمكم لوجه الله» لطلب ثوابه «لا نريد منكم جزاء ولا شكورا» شكرا فيه علة الإطعام وهل تكلموا بذلك أو علمه الله منهم فأثنى عليهم به، قولان.","ar.qurtubi":"قوله تعالى : إنما نطعمكم لوجه الله أي يقولون بألسنتهم للمسكين واليتيم والأسير إنما نطعمكم في الله - جل ثناؤه - فزعا من عذابه وطمعا في ثوابه .لا نريد منكم جزاء أي مكافأة . ولا شكورا أي ولا أن تثنوا علينا بذلك ; قال ابن عباس : كذلك كانت نياتهم في الدنيا حين أطعموا . وعن سالم عن مجاهد قال : أما إنهم ما تكلموا به ولكن علمه الله - جل ثناؤه - منهم فأثنى به عليهم ; ليرغب في ذلك راغب . وقاله سعيد بن جبير حكاه عنه القشيري . وقيل : إن هذه الآية نزلت في مطعم بن ورقاء الأنصاري نذر نذرا فوفى به . وقيل : نزلت فيمن تكفل بأسرى بدر وهم سبعة من المهاجرين : أبو بكر وعمر وعلي والزبير وعبد الرحمن بن عوف وسعد وأبو عبيدة - رضي الله عنهم - ; ذكره الماوردي .وقال مقاتل : نزلت في رجل من الأنصار أطعم في يوم واحد مسكينا ويتيما وأسيرا . وقال أبو حمزة الثمالي : بلغني أن رجلا قال يا رسول الله أطعمني فإني والله مجهود ; فقال : \" والذي نفسي بيده ما عندي ما أطعمك ولكن اطلب \" فأتى رجلا من الأنصار وهو يتعشى مع امرأته فسأله ; وأخبره بقول النبي - صلى الله عليه وسلم - ; فقالت المرأة : أطعمه واسقه . ثم أتى النبي - صلى الله عليه وسلم - يتيم فقال : يا رسول الله ! أطعمني فإني مجهود . فقال : \" ما عندي ما أطعمك ولكن اطلب \" فاستطعم ذلك الأنصاري فقالت المرأة : [ ص: 116 ] أطعمه واسقه ، فأطعمه . ثم أتى النبي - صلى الله عليه وسلم - أسير فقال : يا رسول الله ! أطعمني فإني مجهود . فقال : \" والله ما معي ما أطعمك ولكن اطلب \" فجاء الأنصاري فطلب ، فقالت المرأة : أطعمه واسقه . فنزلت : ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا ذكره الثعلبي . وقال أهل التفسير : نزلت في علي وفاطمة - رضي الله عنهما - وجارية لهما اسمها فضة .قلت : والصحيح أنها نزلت في جميع الأبرار ، ومن فعل فعلا حسنا ; فهي عامة . وقد ذكر النقاش والثعلبي والقشيري وغير واحد من المفسرين في قصة علي وفاطمة وجاريتهما حديثا لا يصح ولا يثبت ، رواه ليث عن مجاهد عن ابن عباس في قوله - عز وجل - : يوفون بالنذر ويخافون يوما كان شره مستطيرا ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا قال : مرض الحسن والحسين فعادهما رسول الله - صلى الله عليه وسلم - ، وعادهما عامة العرب ; فقالوا : يا أبا الحسن - ورواه جابر الجعفي عن قنبر مولى علي قال : مرض الحسن والحسين حتى عادهما أصحاب رسول الله - صلى الله عليه وسلم - ، فقال أبو بكر - رضي الله عنه - : يا أبا الحسن - رجع الحديث إلى حديث ليث بن أبي سليم - لو نذرت عن ولديك شيئا ، وكل نذر ليس له وفاء فليس بشيء . فقال - رضي الله عنه - : إن برأ ولداي صمت لله ثلاثة أيام شكرا . وقالت جارية لهم نوبية : إن برأ سيداي صمت لله ثلاثة أيام شكرا . وقالت فاطمة مثل ذلك . وفي حديث الجعفي فقال الحسن والحسين : علينا مثل ذلك فألبس الغلامان العافية ، وليس عند آل محمد قليل ولا كثير ، فانطلق علي إلى شمعون بن حاريا الخيبري ، وكان يهوديا ، فاستقرض منه ثلاثة أصوع من شعير ، فجاء به ، فوضعه ناحية البيت ، فقامت فاطمة إلى صاع فطحنته واختبزته ، وصلى علي مع النبي - صلى الله عليه وسلم - ، ثم أتى المنزل فوضع الطعام بين يديه .وفي حديث الجعفي : فقامت الجارية إلى صاع من شعير فخبزت منه خمسة أقراص ، لكل واحد منهم قرص ، فلما مضى صيامهم الأول وضع بين أيديهم الخبز والملح الجريش ; إذ أتاهم مسكين ، فوقف بالباب وقال : السلام عليكم أهل بيت محمد - في حديث الجعفي - أنا مسكين من مساكين أمة محمد - صلى الله عليه وسلم - ، وأنا والله جائع ; أطعموني أطعمكم الله من موائد الجنة . فسمعه علي - رضي الله عنه - ، فأنشأ يقول :فاطم ذات الفضل واليقين     يا بنت خير الناس أجمعينأما ترين البائس المسكين     قد قام بالباب له حنينيشكو إلى الله ويستكين     يشكو إلينا جائع حزينكل امرئ بكسبه رهين     وفاعل الخيرات يستبينموعدنا جنة عليين     حرمها الله على الضنينوللبخيل موقف مهين     تهوي به النار إلى سجين [ ص: 117 ]شرابه الحميم والغسلين     من يفعل الخير يقم سمينويدخل الجنة أي حينفأنشأت فاطمة - رضي الله عنها - تقول :أمرك عندي يا ابن عم طاعه     ما بي من لؤم ولا وضاعهغديت في الخبز له صناعه     أطعمه ولا أبالي الساعهأرجو إذا أشبعت ذا المجاعه     أن ألحق الأخيار والجماعهوأدخل الجنة لي شفاعهفأطعموه الطعام ، ومكثوا يومهم وليلتهم لم يذوقوا شيئا إلا الماء القراح ، فلما أن كان في اليوم الثاني قامت إلى صاع فطحنته واختبزته ، وصلى علي مع النبي - صلى الله عليه وسلم - ، ثم أتى المنزل فوضع الطعام بين أيديهم ; فوقف بالباب يتيم فقال : السلام عليكم أهل بيت محمد ، يتيم من أولاد المهاجرين استشهد والدي يوم العقبة . أطعموني أطعمكم الله من موائد الجنة . فسمعه علي فأنشأ يقول :فاطم بنت السيد الكريم     بنت نبي ليس بالزنيملقد أتى الله بذي اليتيم     من يرحم اليوم يكن رحيمويدخل الجنة أي سليم     قد حرم الخلد على اللئيمألا يجوز الصراط المستقيم     يزل في النار إلى الجحيمشرابه الصديد والحميمفأنشأت فاطمة - رضي الله عنها - تقول :أطعمه اليوم ولا أبالي     وأوثر الله على عياليأمسوا جياعا وهم أشبالي     أصغرهم يقتل في القتالبكربلا يقتل باغتيال     يا ويل للقاتل مع وبالتهوي به النار إلى سفال     وفي يديه الغل والأغلالكبولة زادت على الأكبالفأطعموه الطعام ومكثوا يومين وليلتين لم يذوقوا شيئا إلا الماء القراح ; فلما كانت في اليوم الثالث قامت إلى الصاع الباقي فطحنته واختبزته ، وصلى علي مع النبي - صلى الله عليه وسلم - ، ثم أتى المنزل ، فوضع الطعام بين أيديهم ; إذ أتاهم أسير فوقف بالباب فقال : السلام عليكم أهل بيت [ ص: 118 ] محمد ، تأسروننا وتشدوننا ولا تطعموننا ! أطعموني فإني أسير محمد . فسمعه علي فأنشأ يقول :فاطم يا بنت النبي أحمد     بنت نبي سيد مسودوسماه الله فهو محمد     قد زانه الله بحسن أغيدهذا أسير للنبي المهتد     مثقل في غله مقيديشكو إلينا الجوع قد تمدد     من يطعم اليوم يجده في غدعند العلي الواحد الموحد     ما يزرع الزارع سوف يحصدأعطيه لا لا تجعليه أقعدفأنشأت فاطمة - رضي الله تعالى عنها - تقول :لم يبق مما جاء غير صاع     قد ذهبت كفي مع الذراعابناي والله هما جياع     يا رب لا تتركهما ضياعأبوهما للخير ذو اصطناع     يصطنع المعروف بابتداععبل الذراعين شديد الباع     وما على رأسي من قناعإلا قناعا نسجه أنساعفأعطوه الطعام ومكثوا ثلاثة أيام ولياليها لم يذوقوا شيئا إلا الماء القراح ، فلما أن كان في اليوم الرابع ، وقد قضى الله النذر أخذ بيده اليمنى الحسن ، وبيده اليسرى الحسين ، وأقبل نحو رسول الله - صلى الله عليه وسلم - وهم يرتعشون كالفراخ من شدة الجوع ; فلما أبصرهم رسول الله - صلى الله عليه وسلم - قال : \" يا أبا الحسن ما أشد ما يسوءني ما أرى بكم انطلق بنا إلى ابنتي فاطمة \" فانطلقوا إليها وهي في محرابها ، وقد لصق بطنها بظهرها ، وغارت عيناها من شدة الجوع ، فلما رآها رسول الله - صلى الله عليه وسلم - وعرف المجاعة في وجهها بكى وقال : \" واغوثاه يا الله ، أهل بيت محمد يموتون جوعا \" فهبط جبريل - عليه السلام - وقال : السلام عليك ، ربك يقرئك السلام يا محمد ، خذه هنيئا في أهل بيتك . قال : \" وما آخذ يا جبريل \" فأقرأه هل أتى على الإنسان حين من الدهر إلى قوله : ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا إنما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكورا قال الترمذي الحكيم أبو عبد الله في نوادر الأصول : فهذا حديث مزوق مزيف ، قد تطرف فيه صاحبه حتى تشبه على المستمعين ، فالجاهل بهذا الحديث يعض شفتيه تلهفا ألا يكون بهذه الصفة ، ولا يعلم أن صاحب هذا الفعل مذموم ; وقد قال الله تعالى في تنزيله : ويسألونك ماذا ينفقون قل العفو وهو الفضل الذي يفضل عن نفسك وعيالك ، [ ص: 119 ] وجرت الأخبار عن رسول الله - صلى الله عليه وسلم - متواترة بأن خير الصدقة ما كان عن ظهر غنى . وابدأ بنفسك ثم بمن تعول وافترض الله على الأزواج نفقة أهاليهم وأولادهم . وقال رسول الله - صلى الله عليه وسلم - : كفى بالمرء إثما أن يضيع من يقوت أفيحسب عاقل أن عليا جهل هذا الأمر حتى أجهد صبيانا صغارا من أبناء خمس أو ست على جوع ثلاثة أيام ولياليهن ؟ حتى تضوروا من الجوع ، وغارت العيون منهم ; لخلاء أجوافهم ، حتى أبكى رسول الله - صلى الله عليه وسلم - ما بهم من الجهد . هب أنه آثر على نفسه هذا السائل ، فهل كان يجوز له أن يحمل أهله على ذلك ؟ ! وهب أن أهله سمحت بذلك لعلي فهل جاز له أن يحمل أطفاله على جوع ثلاثة أيام بلياليهن ؟ ! ما يروج مثل هذا إلا على حمقى جهال ; أبى الله لقلوب متنبهة أن تظن بعلي مثل هذا . وليت شعري من حفظ هذه الأبيات كل ليلة عن علي وفاطمة ، وإجابة كل واحد منهما صاحبه ، حتى أداه إلى هؤلاء الرواة ؟ فهذا وأشباهه من أحاديث أهل السجون - فيما أرى - بلغني أن قوما يخلدون في السجون فيبقون بلا حيلة ، فيكتبون أحاديث في السمر وأشباهه ، ومثل هذه الأحاديث مفتعلة ، فإذا صارت إلى الجهابذة رموا بها وزيفوها ، وما من شيء إلا له آفة ومكيدة ، وآفة الدين وكيده أكثر .\n","ar.miqbas":"إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنْكُمْ جَزَاءً وَلَا شُكُورًا (9) وجُملة { إنما نطعمكم لوجه الله } إلى آخرها مقول قول محذوف تقديره : يقولون لهم ، أي للذين يُطعمونهم فهو في موضع الحال من ضمير { يُطعمون } ، وجملة : { لا نريد منكم جزاء ولا شكوراً } مبيِّنة لمضمون جملة { إنما نطعمكم لوجه الله } .\n","ar.waseet":"وقوله - سبحانه - ( إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ الله ) بيان لشدة إخلاصهم ، ولطهارة نفوسهم ، وهو مقول لقول محذوف أى : يقدمون الطعام لهؤلاء المحتاجين مع حبهم لهذا الطعام ، ومع حاجتهم إليه . . ثم يقولون لهم بلسان الحال أو المقال : إنما نطعمكم ابتغاء وجه الله - تعالى - وطلبا لمئويته ورحمته .( لاَ نُرِيدُ مِنكُمْ جَزَآءً وَلاَ شُكُوراً ) أى : لا نريد منكم جزاء على ما قدمناه لكم ، ولا نريد منكم شكرا على ما فعلناه ، فإننا لا نلتمس ذلك إلا من الله - تعالى - خالقنا وخالقكم .\n","ar.baghawi":"\"إنما نطعمكم لوجه الله لا نريد منكم جزاءً ولا شكوراً\"، والشكور مصدر كالعقود والدخول والخروج. قال مجاهد وسعيد بن جبير: إنهم لم يتكلموا به ولكن علم الله ذلك من قلوبهم، فأثنى عليهم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5600.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5600.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5600.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"إِنَّا نَخَافُ مِنْ رَبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا","transliteration":"Innaa nakhaafu mir Rabbinna Yawman 'aboosan qamtareeraa","translations":{"en.ahmedali":"We fear the dismal day calamitous from our Lord.\"","en.ahmedraza":"“Indeed we fear from our Lord a day which is extremely bitter, most severe.”","en.arberry":"for we fear from our Lord a frowning day, inauspicious.","en.asad":"behold, we stand in awe of our Sustainer's judgment on a distressful, fateful Day!\"","en.daryabadi":"Verily we dread from our Lord a Day grim and distressful.","en.hilali":"\"Verily, We fear from our Lord a Day, hard and distressful, that will make the faces look horrible (from extreme dislikeness to it).\"","en.pickthall":"Lo! we fear from our Lord a day of frowning and of fate.","en.qaribullah":"for we fear from our Lord a stern, frownful Day'","en.sahih":"Indeed, We fear from our Lord a Day austere and distressful.\"","en.sarwar":"We are afraid of our Lord and the bitterly distressful day\".","en.yusufali":"\"We only fear a Day of distressful Wrath from the side of our Lord.\"","en.maududi":"we fear from our Lord a Day that shall be long and distressful.”","en.shakir":"Surely we fear from our Lord a stern, distressful day.","en.itani":"We dread from our Lord a frowning grim Day.”","en.mubarakpuri":"\"Verily, We fear from our Lord a Day that is `Abus and Qamtarir.\"","en.qarai":"Indeed we fear a frowning and fateful day from our Lord.’","en.wahiduddin":"Truly, we fear from our Lord a woefully grim Day.\""},"tafsir":{"ar.muyassar":"هذا الشراب الذي مزج من الكافور هو عين يشرب منها عباد الله، يتصرفون فيها، ويُجْرونها حيث شاؤوا إجراءً سهلا. هؤلاء كانوا في الدنيا يوفون بما أوجبوا على أنفسهم من طاعة الله، ويخافون عقاب الله في يوم القيامة الذي يكون ضرره خطيرًا، وشره فاشيًا منتشرًا على الناس، إلا مَن رحم الله، ويُطْعِمون الطعام مع حبهم له وحاجتهم إليه، فقيرًا عاجزًا عن الكسب لا يملك من حطام الدنيا شيئًا، وطفلا مات أبوه ولا مال له، وأسيرًا أُسر في الحرب من المشركين وغيرهم، ويقولون في أنفسهم: إنما نحسن إليكم ابتغاء مرضاة الله، وطلب ثوابه، لا نبتغي عوضًا ولا نقصد حمدًا ولا ثناءً منكم. إنا نخاف من ربنا يومًا شديدًا تَعْبِس فيه الوجوه، وتتقطَّبُ الجباه مِن فظاعة أمره وشدة هوله.","ar.jalalayn":"«إنا نخاف من ربنا يوما عبوْسا» تكلح الوجوه فيه أي كريه المنظر لشدته «قمطريرا» شديدا في ذلك.","ar.qurtubi":"قوله تعالى : إنا نخاف من ربنا يوما عبوسا قمطريرا عبوسا من صفة اليوم ، أي يوما تعبس فيه الوجوه من هوله وشدته ، فالمعنى نخاف يوما ذا عبوس . وقال ابن عباس يعبس الكافر يومئذ حتى يسيل منه عرق كالقطران . وعن ابن عباس : العبوس : الضيق ، والقمطرير : الطويل ; قال الشاعر :شديدا عبوسا قمطريرا[ ص: 120 ] وقيل : القمطرير الشديد ; تقول العرب : يوم قمطرير وقماطر وعصيب بمعنى ; وأنشد الفراء :بني عمنا هل تذكرون بلاءنا     عليكم إذا ما كان يوم قماطربضم القاف . واقمطر إذا اشتد . وقال الأخفش : القمطرير : أشد ما يكون من الأيام وأطوله في البلاء ; قال الشاعر :ففروا إذا ما الحرب ثار غبارها     ولج بها اليوم العبوس القماطروقال الكسائي : يقال اقمطر اليوم وازمهر اقمطرارا وازمهرارا ، وهو القمطرير والزمهرير ، ويوم مقمطر إذا كان صعبا شديدا ; قال الهذلي :بنو الحرب أرضعنا لهم مقمطرة     ومن يلق منا ذلك اليوم يهربوقال مجاهد : إن العبوس بالشفتين ، والقمطرير بالجبهة والحاجبين ; فجعلها من صفات الوجه المتغير من شدائد ذلك اليوم ; وأنشد ابن الأعرابي :يغدو على الصيد يعود منكسر     ويقمطر ساعة ويكفهروقال أبو عبيدة : يقال رجل قمطرير أي متقبض ما بين العينين . وقال الزجاج : يقال اقمطرت الناقة : إذا رفعت ذنبها وجمعت قطريها ، وزمت بأنفها ; فاشتقه من القطر ، وجعل الميم مزيدة . قال أسد بن ناعصة :واصطليت الحروب في كل يوم     باسل الشر قمطرير الصباح\n","ar.miqbas":"إِنَّا نَخَافُ مِنْ رَبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا (10)وجملة { إنا نخاف من ربنا } إلى آخرها واقعة موقع التعليل لمضمون جملة { لا نريد منكم جزاء ولا شكوراً } .والمعنى : إنهم يقولون ذلك لهم تأنيساً لهم ودفعاً لانكسار النفس الحاصل عند الإِطعام ، أي ما نطعمكم إلاّ استجابة لما أمر الله ، فالمطعم لهم هو الله .فالقول قول باللسان ، وهم ما يقولونه إلاّ وهو مضمر في نفوسهم . وعن مجاهد أنه قال : ما تكلموا به ولكن عَلِمه الله فأثَنى به عليهم .فالقصر المستفاد من { إنما } قصر قلب مبني على تنزيل المطعَمين منزلة من يظن أن من أطعمهم يمنّ عليهم ويريد منهم الجزاء والشكر بناء على المتعارف عندهم في الجاهلية . والمراد بالجزاء : ما هو عوض عن العطية من خدمة وإعانة ، وبالشكور : ذكرهم بالمزية .والشُكور : مصدر بوزن الفُعول كالقُعود والجلوس ، وإنما اعتبر بوزن الفُعول الذي هو مصدر فعَل اللازم لأن فعل الشكر لا يتعدى للمشكور بنفسه غالباً بل باللام يقال : شكرت لك قال تعالى : { واشكروا لي } [ البقرة : 152 ] .وأما قوله : { إنّا نخاف من ربنا يوماً عبوساً قمطريراً } فهو مقول لقول يقولونه في نفوسهم أو ينطق به بعضهم مع بعض وهو حال من ضمير { يخافون } [ الإنسان : 7 ] أي يخافون ذلك اليوم في نفوسهم قائلين : { إنا نخاف من ربنا يوماً عبوساً قمطريرا } ، فحكي وقولهم : { إنما نطعمكم لوجه الله } وقولهم : { إنا نخاف } الخ . على طريقة اللف والنشر المعكوس والداعي إلى عكس النشر مراعاة حسن تنسيق النظم ليكون الانتقال من ذكر الإِطعام إلى ما يقولونه للمطعمين ، والانتقال من ذكر خوف يوم الحساب إلى بشارتهم بوقاية الله إياهم من شر ذلك اليوم وما يلقونه فيه من النضرة والسرور والنعيم .فيجوز أن يكون { من ربنا } ظرفاً مستقراً وحرف { مِن } ابتدائية وهو حال من { يوماً } قُدم عليه ، أي نخاف يوماً عبوساً قمطريراً حال كونه من أيّام ربنا ، أي من أيام تصاريفه .ويجوز أن تكون { مِن } تجريدية كقولك : لي من فلان صديق حميم . ويكون { يوماً } منصوباً على الظرفية وتنوينه للتعظيم ، أي نخافه في يوم شديد .و { عَبوساً } : منصوباً على المفعول لفعل { نخاف } ، أي نخاف غضبان شديدَ الغضب هُو ربنا ، فيكون في التجريد تقوية للخوف إذ هو كخوف من شيْئيننِ ( وتلك نكتة التجريد ) ، أو يكون { عبوساً } حالاً { من ربنا } .ويجوز أن تجعل { مِن } لتعدية فعل { نخاف } كما عدي في قوله تعالى : { فمن خاف مِن موصصٍ جَنفَاً } [ البقرة : 182 ] . وينتصب { يوماً } على المفعول به لفعل { نخاف } فصار لفعل { نخاف } معمولاننِ . و { عبوساً } صفة ل { يوماً } ، والمعنى : نخاف عذاب يوم هذه صفته ، ففيه تأكيد الخوف بتكرير متعلِّقه ومرجع التكرير إلى كونه خوف الله لأن اليوم يوم عدل الله وحكمه .والعبوس : صفة مشبهة لمن هو شديد العبس ، أي كُلُوحُ الوجه وعدم انطلاقه ، ووصف اليوم بالعبوس على معنى الاستعارة . شُبه اليوم الذي تحدث فيه حوادث تَسُوءهم برجل يخالطهم يكون شرس الأخلاق عبوساً في معاملته .والقمطرير : الشديد الصعب من كل شيء . وعن ابن عباس : القمطرير المقبض بين عينيه مشتق من قمطر القاصر إذا اجتمع ، أو قمطر المتعدي إذا شد القربة بوكاء ونحوه ، ومنه سمي السفط الذي توضع فيه الكتب قمطرا وهو كالمحفظة . وميم قمطرير أصلية فوزنه فعلليل مثل خَنْدَرِيس وزَنْجبيل ، يقال : قمطر للشر ، إذا تهيأ له وجمع نفسه .والجمهور جعلوا { قمطريراً } وصف { يوماً } ومنهم من جعلوه وصف { عبوساً } أي شديد العبوس .وهذه الآية تعمّ جميع الأبرار وعلى ذلك التحم نسجها ، وقد تلقفها القصاصون والدعاة فوضعوا لها قصصاً مختلفة وجاؤوا بأخبار موضوعة وأبيات مصنوعة فمنهم من زعم أن هذه الآية نزلت في علي بن أبي طالب وفاطمة رضي الله عنهما في قصة طويلة ذكرها الثعلبي والنقاش وساقها القرطبي بطولها ثم زيفها . وذكر عن الحكيم الترمذي أنه قال في «نوادر الأصول» : هذا حديث مروّق مزيف وأنه يشبه أن يكون من أحاديث أهل السجون .وقيل نزلت في مُطعم بن ورقاء الأنصاري ، وقيل في رجل غيره من الأنصار ، وقد استوفى ذلك كله القرطبي في تفسيره فلا طائل تحت اجتلابه ، وأصحاب رسول الله صلى الله عليه وسلم وآله أهل لأن ينزل القرآن فيهم إلاّ أن هذه الأخبار ضعيفة أو موضوعة .\n","ar.waseet":"ثم أضافوا إلى ذلك قولهم : ( إِنَّا نَخَافُ مِن رَّبِّنَا يَوْماً عَبُوساً قَمْطَرِيراً ) .والعبوس : صفة مشبهة لمن هو شديد العبس ، أى كلوح الوجه وانقباضه .والقمطرير : الشديد الصعب من كل شئ يقال : اقْمَطَرَّ يومُنا . إذا اشتدت مصائبه .ووصف اليوم بهذين الوصفين على سبيل المجاز فى الإِسناد ، والمقصود وصف أهله بذلك ، فهو من باب : فلان نهاره صائم .أى : ويقولون لهم - أيضا - عند تقديم الطعام لهم : إنا نخاف من ربنا يوما ، تعبس فيه الوجوه ، من شدة هوله ، وعظم أمره ، وطول بلائه .أى : أنهم لم يقدموا الطعام - مع حبهم له - رياء ومفاخرة ، وإنما قدموه ابتغاء وجه الله ، وخوفا من عذابه .\n","ar.baghawi":"( إنا نخاف من ربنا يوما عبوسا ) تعبس فيه الوجوه من هوله وشدته ، نسب العبوس إلى اليوم ، كما يقال : يوم صائم وليل قائم . وقيل : وصف اليوم بالعبوس لما فيه من الشدة ( قمطريرا ) قال قتادة ، ومجاهد ، ومقاتل : \" القمطرير \" : الذي يقبض الوجوه والجباه بالتعبيس . قال الكلبي : العبوس الذي لا انبساط فيه ، و \" القمطرير \" الشديد . قال الأخفش : \" القمطرير \" أشد ما يكون من الأيام وأطوله في البلاء . يقال : يوم قمطرير وقماطر إذا كان شديدا كريها ، واقمطر اليوم فهو مقمطر .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5601.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5601.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5601.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"فَوَقَاهُمُ اللَّهُ شَرَّ ذَٰلِكَ الْيَوْمِ وَلَقَّاهُمْ نَضْرَةً وَسُرُورًا","transliteration":"Fa waqaahumul laahu sharra zaalikal yawmi wa laqqaahum nadratanw wa surooraa","translations":{"en.ahmedali":"So God will protect them from the evil of that day, and grant them happiness and joy,","en.ahmedraza":"So Allah saved them from the evil of that day, and gave them freshness and joy.","en.arberry":"So God has guarded them from the evil of that day, and has procured them radiancy and gladness,","en.asad":"And so, God will preserve them from the woes of that Day, and will bestow on them brightness and joy,","en.daryabadi":"Wherefore Allah shall preserve them from the evil of that Day, and shall cause them to meet brightness and joy.","en.hilali":"So Allah saved them from the evil of that Day, and gave them Nadratan (a light of beauty) and joy.","en.pickthall":"Therefor Allah hath warded off from them the evil of that day, and hath made them find brightness and joy;","en.qaribullah":"So Allah will save them from the evil of that Day and has secured for them radiance and joyfulness,","en.sahih":"So Allah will protect them from the evil of that Day and give them radiance and happiness","en.sarwar":"God will certainly rescue them from the terror of that day and will meet them with joy and pleasure.","en.yusufali":"But Allah will deliver them from the evil of that Day, and will shed over them a Light of Beauty and (blissful) Joy.","en.maududi":"So Allah shall guard them against the woe of that Day, and will procure them freshness and joy,","en.shakir":"Therefore Allah win guard them from the evil of that day and cause them to meet with ease and happiness;","en.itani":"So God will protect them from the ills of that Day, and will grant them radiance and joy.","en.mubarakpuri":"So, Allah saved them from the evil of that Day, and gave them Nadrah (a light of beauty) and joy.","en.qarai":"So Allah saved them from that day’s ills and graced them with freshness [on this faces] and joy [in their hearts].","en.wahiduddin":"Therefore, God will ward off from them the woes of that Day, and make them find brightness and joy,"},"tafsir":{"ar.muyassar":"فوقاهم الله من شدائد ذلك اليوم، وأعطاهم حسنًا ونورًا في وجوههم، وبهجة وفرحًا في قلوبهم، وأثابهم بصبرهم في الدنيا على الطاعة جنة عظيمة يأكلون منها ما شاؤوا، ويَلْبَسون فيها الحرير الناعم، متكئين فيها على الأسرَّة المزينة بفاخر الثياب والستور، لا يرون فيها حر شمس ولا شدة برد، وقريبة منهم أشجار الجنة مظللة عليهم، وسُهِّل لهم أَخْذُ ثمارها تسهيلا.","ar.jalalayn":"«فوقاهم الله شر ذلك اليوم ولقاهم» أعطاهم «نضرة» حسنا وإضاءة في وجوههم «وسرورا».","ar.qurtubi":"قوله تعالى : فوقاهم الله أي دفع عنهم شر ذلك اليوم أي بأسه وشدته وعذابه ولقاهم أي أتاهم وأعطاهم حين لقوه أي رأوه نضرة أي حسنا وسرورا أي حبورا . قال الحسن ومجاهد : نضرة في وجوههم وسرورا في قلوبهم . وفي النضرة ثلاثة أوجه : أحدها أنها البياض والنقاء ; قاله الضحاك . الثاني الحسن والبهاء ; قاله ابن جبير . الثالث أنها أثر النعمة ; قاله ابن زيد .\n","ar.miqbas":"فَوَقَاهُمُ اللَّهُ شَرَّ ذَلِكَ الْيَوْمِ وَلَقَّاهُمْ نَضْرَةً وَسُرُورًا (11) تفريع على قوله : { يُوفُون بالنذر إلى قمطريراً } [ الإنسان : 7 10 ] .وفي هذا التفريع تلوين للحديث عن جزاء الأبرار وأهل الشُكور ، وهذا برزخ للتخلص إلى عَود الكلام على حسن جزائهم أن الله وقاهم شرّ ذلك اليوم وهو الشر المستطير المذكور آنفاً ، وقاهم إياه جزاءً على خوفهم إياه وأنه لقاهم نضرة وسروراً جزاء على ما فعلوا من خير .وأُدمج في ذلك قوله : { بما صبروا } الجامع لأحوال التقوى والعمل الصالح كله لأن جميعه لا يخلو عن تحمل النفس لترك محبوب أو فعل ما فيه كلفة ، ومن ذلك إطعام الطعام على حبه .و { لقَّاهم } معناه : جعلهم يَلْقَون نضرة وسروراً ، أي جعل لهم نضرة وهي حسن البشَرة ، وذلك يحصل من فرح النفس ورفاهية العيش قال تعالى : { وجوه يومئذٍ ناضرة } [ القيامة : 22 ] فمُثل إلقاء النضرة على وجوههم بزجّ أحد إلى لقاء أحد على طريقة التمثيل .وضمير الغائبةِ و { نضرة } مفعولا ( لَقى ) من باب كَسَا .وبين ( وَقَاهم ) و { لَقَّاهم } الجناس المحرَّف .\n","ar.waseet":"والفاء فى قوله : ( فَوَقَاهُمُ الله شَرَّ ذَلِكَ اليوم وَلَقَّاهُمْ نَضْرَةً وَسُرُوراً ) أى : وجعلهم يلقون فيها حسنا وبهجة فى الوجوه ، وسرورا وانشراحا فى الصدور ، بدل العبوس والكلوح الذى حل بوجوه الكفار .\n","ar.baghawi":"\"فوقاهم الله شر ذلك اليوم\"، الذي يخافون، \"ولقاهم نضرةً\"، حسناً في وجوههم، \"وسروراً\"، في قلوبهم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5602.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5602.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5602.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"وَجَزَاهُمْ بِمَا صَبَرُوا جَنَّةً وَحَرِيرًا","transliteration":"Wa jazaahum bimaa sabaroo janatanw wa hareeraa","translations":{"en.ahmedali":"And reward them for their perseverence Paradise and silken robes,","en.ahmedraza":"And gave them Paradise and silk clothes, as a reward for their patience.","en.arberry":"and recompensed them for their patience with a Garden, and silk;","en.asad":"and will reward them for all their patience in adversity with a garden [of bliss] and with [garments of] silk.","en.daryabadi":"And shall recompense them for that which they patiently bare with a Garden and silken garment.","en.hilali":"And their recompense shall be Paradise, and silken garments, because they were patient.","en.pickthall":"And hath awarded them for all that they endured, a Garden and silk attire;","en.qaribullah":"and recompense them for their patience with a Garden, and robes of silk.","en.sahih":"And will reward them for what they patiently endured [with] a garden [in Paradise] and silk [garments].","en.sarwar":"For their patience, He will reward them with Paradise and silk.","en.yusufali":"And because they were patient and constant, He will reward them with a Garden and (garments of) silk.","en.maududi":"and will reward them for their steadfastness with Paradise and robes of silk.","en.shakir":"And reward them, because they were patient, with garden and silk,","en.itani":"And will reward them for their patience with a Garden and silk.","en.mubarakpuri":"And their recompense shall be Paradise, and silken garments, because they were patient.","en.qarai":"He rewarded them for their patience with a garden and [garments of] silk,","en.wahiduddin":"and their reward for being patient will be a Garden and silk [clothing]."},"tafsir":{"ar.muyassar":"فوقاهم الله من شدائد ذلك اليوم، وأعطاهم حسنًا ونورًا في وجوههم، وبهجة وفرحًا في قلوبهم، وأثابهم بصبرهم في الدنيا على الطاعة جنة عظيمة يأكلون منها ما شاؤوا، ويَلْبَسون فيها الحرير الناعم، متكئين فيها على الأسرَّة المزينة بفاخر الثياب والستور، لا يرون فيها حر شمس ولا شدة برد، وقريبة منهم أشجار الجنة مظللة عليهم، وسُهِّل لهم أَخْذُ ثمارها تسهيلا.","ar.jalalayn":"«وجزاهم بما صبروا» بصبرهم عن المعصية «جنة» أدخلوها «وحريرا» البسوه.","ar.qurtubi":"قوله تعالى : وجزاهم بما صبروا على الفقر . وقال القرظي : على الصوم . وقال [ ص: 121 ] عطاء : على الجوع ثلاثة أيام وهي أيام النذر . وقيل : بصبرهم على طاعة الله ، وصبرهم على معصية الله ومحارمه . و ( ما ) : مصدرية ، وهذا على أن الآية نزلت في جميع الأبرار ومن فعل فعلا حسنا . وروى ابن عمر أن رسول الله - صلى الله عليه وسلم - سئل عن الصبر فقال : \" الصبر أربعة : أولها الصبر عند الصدمة الأولى ، والصبر على أداء الفرائض ، والصبر على اجتناب محارم الله ، والصبر على المصائب \" .جنة وحريرا أي أدخلهم الجنة وألبسهم الحرير . أي يسمى بحرير الدنيا وكذلك الذي في الآخرة [ وفيه ] ما شاء الله - عز وجل - من الفضل . وقد تقدم : أن من لبس الحرير في الدنيا لم يلبسه في الآخرة ، وإنما ألبسه من ألبسه في الجنة عوضا عن حبسهم أنفسهم في الدنيا عن الملابس التي حرم الله فيها .\n","ar.miqbas":"وَجَزَاهُمْ بِمَا صَبَرُوا جَنَّةً وَحَرِيرًا (12) وجملة { وجزاهم بما صبروا جنةً وحريراً } ، عطف على جملة { فوقاهم } وجملة { ولقاهم } لتماثل الجمل الثلاث في الفعلية والمُضيّ وهما محسنان من محسنات الوصل .والحرير : اسم لخيوط من مفرزات دودة مخصوصة ، وتقدم الكلام عليه في سورة فاطر .وكان الجزاء برفاهية العيش إذ جعلهم في أحسن المساكن وهو الجنة ، وكساهم أحسن الملابس وهو الحرير الذي لا يلبسه إلاّ أهل فرط اليسار ، فجمع لهم حسن الظرف الخارج وحسن الظرف المباشر وهو اللباس .والمراد بالحرير هنا : ما ينسج منه .\n","ar.waseet":"( وَجَزَاهُمْ بِمَا صَبَرُواْ ) أى : بسبب صبرهم ( جَنَّةً ) عظيمة . . و ( وَحَرِيراً ) جميلا يلبسونه .\n","ar.baghawi":"\"وجزاهم بما صبروا\"، على طاعة الله واجتناب معصيته، وقال الضحاك: على الفقر. وقال عطاء: على الجوع. \"جنةً وحريراً\"، قال الحسن: أدخلهم الله الجنة وألبسهم الحرير.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5603.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5603.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5603.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ ۖ لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا","transliteration":"muttaki'eena feeha 'alal araaa 'iki laa yarawna feehaa shamsanw wa laa zamhareeraa","translations":{"en.ahmedali":"Where they will recline on couches feeling neither heat of the sun nor intense cold.","en.ahmedraza":"Reclining in it, upon thrones; they will not see the hot sunshine in it, nor the bitter cold.","en.arberry":"therein they shall recline upon couches, therein they shall see neither sun nor bitter cold;","en.asad":"In that [garden] they will on couches recline, and will know therein neither [burning] sun nor cold severe,","en.daryabadi":"Reclining therein upon couches, they shall behold therein neither sun nor hurting cold.","en.hilali":"Reclining therein on raised thrones, they will see there neither the excessive heat of the sun, nor the excessive bitter cold, (as in Paradise there is no sun and no moon).","en.pickthall":"Reclining therein upon couches, they will find there neither (heat of) a sun nor bitter cold.","en.qaribullah":"Reclining there upon couches, they shall see neither the sun nor the moon.","en.sahih":"[They will be] reclining therein on adorned couches. They will not see therein any [burning] sun or [freezing] cold.","en.sarwar":"They will recline therein on couches and they will find neither excessive heat nor cold.","en.yusufali":"Reclining in the (Garden) on raised thrones, they will see there neither the sun's (excessive heat) nor (the moon's) excessive cold.","en.maududi":"There they will recline on elevated couches and will be subjected neither to the burning heat of the sun nor to bitter cold.","en.shakir":"Reclining therein on raised couches, they shall find therein neither (the severe heat of) the sun nor intense cold.","en.itani":"Reclining therein on the thrones; experiencing therein neither sun, nor frost.","en.mubarakpuri":"Reclining therein on raised couches, they will see there neither the excessive heat, nor the excessive cold.","en.qarai":"reclining therein on couches, without facing any [scorching] sun, or [biting] cold.","en.wahiduddin":"Reclining upon couches, they will find therein neither the heat of the sun nor bitter, biting cold,"},"tafsir":{"ar.muyassar":"فوقاهم الله من شدائد ذلك اليوم، وأعطاهم حسنًا ونورًا في وجوههم، وبهجة وفرحًا في قلوبهم، وأثابهم بصبرهم في الدنيا على الطاعة جنة عظيمة يأكلون منها ما شاؤوا، ويَلْبَسون فيها الحرير الناعم، متكئين فيها على الأسرَّة المزينة بفاخر الثياب والستور، لا يرون فيها حر شمس ولا شدة برد، وقريبة منهم أشجار الجنة مظللة عليهم، وسُهِّل لهم أَخْذُ ثمارها تسهيلا.","ar.jalalayn":"«متكئين» حال من مرفوع أدخلوها المقدر «فيها على الأرائك» السرر في الحجال «لا يروْن» لا يجدون حال ثانية «فيها شمسا ولا زمهريرا» لا حرا ولا بردا وقيل الزمهرير القمر فهي مضيئة من غير شمس ولا قمر.","ar.qurtubi":"قوله تعالى : متكئين فيها أي في الجنة ; ونصب متكئين على الحال من الهاء والميم في جزاهم والعامل فيها جزى ولا يعمل فيها صبروا ; لأن الصبر إنما كان في الدنيا والاتكاء في الآخرة . وقال الفراء . وإن شئت جعلت متكئين تابعا ، كأنه قال جزاهم جنة متكئين فيها .على الأرائك السرر في الحجال وقد تقدم . وجاءت عن العرب أسماء تحتوي على صفات : أحدها الأريكة لا تكون إلا في حجلة على سرير ، ومنها السجل ، وهو الدلو الممتلئ ماء ، فإذا صفرت لم تسم سجلا ، وكذلك الذنوب لا تسمى ذنوبا حتى تملأ ، والكأس لا تسمى كأسا حتى تترع من الخمر . وكذلك الطبق الذي تهدى عليه الهدية مهدى ، فإذا كان فارغا قيل طبق أو خوان ; قال ذو الرمة :خدود جفت في السير حتى كأنما يباشرن بالمعزاء مس الأرائكأي الفرش على السرر .لا يرون فيها شمسا أي لا يرون في الجنة شدة حر كحر الشمس ولا زمهريرا أي ولا بردا مفرطا ; قال الأعشى :منعمة طفلة كالمها     ة لم تر شمسا ولا زمهريراوعن أبي صالح عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" اشتكت النار إلى ربها - عز وجل - قالت : يا رب أكل بعضي بعضا ، فجعل لها نفسين نفسا في الشتاء ونفسا في الصيف ، فشدة ما تجدون من البرد من زمهريرها ، وشدة ما تجدون من الحر في الصيف من [ ص: 122 ] سمومها ) . وعن النبي - صلى الله عليه وسلم - أنه قال : \" إن هواء الجنة سجسج : لا حر ولا برد \" والسجسج : الظل الممتد كما بين طلوع الفجر وطلوع الشمس . وقال مرة الهمداني : الزمهرير البرد القاطع . وقال مقاتل بن حيان : هو شيء مثل رؤوس الإبر ينزل من السماء في غاية البرد . وقال ابن مسعود : هو لون من العذاب ، وهو البرد الشديد ، حتى إن أهل النار إذا ألقوا فيه سألوا الله أن يعذبهم بالنار ألف سنة أهون عليهم من عذاب الزمهرير يوما واحدا . قال أبو النجم :أو كنت ريحا كنت زمهريراوقال ثعلب : الزمهرير : القمر بلغة طيئ ; قال شاعرهم :وليلة ظلامها قد اعتكر     قطعتها والزمهرير ما زهرويروى : ما ظهر ; أي لم يطلع القمر . فالمعنى لا يرون فيها شمسا كشمس الدنيا ولا قمرا كقمر الدنيا ، أي إنهم في ضياء مستديم ، لا ليل فيه ولا نهار ; لأن ضوء النهار بالشمس ، وضوء الليل بالقمر . وقد مضى هذا المعنى مجودا في سورة ( مريم ) عند قوله تعالى : ولهم رزقهم فيها بكرة وعشيا . وقال ابن عباس : بينما أهل الجنة في الجنة إذ رأوا نورا ظنوه شمسا قد أشرقت بذلك النور الجنة ، فيقولون : قال ربنا : لا يرون فيها شمسا ولا زمهريرا فما هذا النور ؟ فيقول لهم رضوان : ليست هذه شمسا ولا قمرا ، ولكن هذه فاطمة وعلي ضحكا ، فأشرقت الجنان من نور ضحكهما ، وفيهما أنزل الله تعالى : هل أتى على الإنسان وأنشد :أنا مولى لفتى     أنزل فيه هل أتىذاك علي المرتضى     وابن عم المصطفى\n","ar.miqbas":"مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا (13) و { متكئين } : حال من ضمير الجمع في { جزاهم } ، أي هم في الجنة متكئون على الأرائك .والاتكاء : جَلسة بين الجلوس والاضطجاع يستند فيها الجالس على مرفقه وجنبه ويمد رجليه وهي جلسة ارتياح ، وكانت من شعار الملوك وأهل البذخ ، ولهذا قال النبي صلى الله عليه وسلم \" أمَّا أنا فلا آكل متكئاً \" وتقدم ذلك في سورة يوسف ( 31 ) عند قوله تعالى : { وأعْتَدَتْ لَهُن مُتَّكَئاً }والأرائك } : جمع أريكة بوزن سفينة . والأريكة : سرير عليه وسادة معها ستر وهو حَجَلتُه ، والحجلة بفتحتين وبتقديم الحاء المهملة على الجيم : كِلَّة تنصب فوق السرير لتقي الحر والشمس ، ولا يسمى السرير أريكة إلاّ إذا كان معه حَجَلة .وقيل : كل ما يتوسد ويفترش مما له حشو يسمى أريكة وإن لم تكن له حَجَلة ، وفي «الإِتقان» عن ابن الجوزي : أن الأريكة السرير بالحبشية فزاده السيوطي على أبيات ابن السبكي وابن حجر في «جمع المعرب في القرآن» .وجملة : { لا يرون فيها شمساً ولا زمهريراً } حال ثانية من ضمير الغائب في { جزاهم } أو صفة { جنة } .والمراد بالشمس : حرّ أشعتها ، فنفي رؤية الشمس في قوله : { لا يرون فيها شمساً } فيكون نفي رؤية الشمس كناية عن نفي وجود الشمس الذي يلزمه انتفاء حرّ شعاعها فهو من الكناية التلويحية كقوله :ولا تَرى الضب بها ينجَحِرْ ... أي لا ضب بها فتراه ولا يكون انجحاره .والزمهرير : اسم للبرْد القوي في لغة الحجاز ، والزمهرير : اسم البرد .والمعنى : أن هواء الجنة معتدل لا ألم فيه بحال . وفي كلام الرابعة من نساء حديث أم زرع «زوجي كلَيْللِ تِهامهْ ، لا حرَّ ولا قُرّ ولا مخافةَ ولا سآمهْ» .وقال ثعلب : الزمهرير اسم القمر في لغة طيء ، وأنشد :وليلة ظلامها قد اعتكر ... قطعتها والزمهريرُ ما زَهَروالمعنى على هذا : أنهم لا يرون في الجنة ضوء الشمس ولا ضوء القمر ، أي ضوء النهار وضوء الليل لأن ضياء الجنة من نور واحد خاص بها . وهذا معنى آخر غير نفي الحر والبرد .ومن الناس من يقول : المراد بالشمس حقيقتها وبالزمهرير البرد وإن في الكلام احتباكاً ، والتقديرُ : لا يرون فيها شمساً ولا قَمراً ولا حَرّاً ولا زمهريراً وجعلوه مثالاً للاحتباك في المحسنات البديعية ، ولعل مراده : أن المعنى أن نورها معتدل وهواءَها معتدل .\n","ar.waseet":"( مُّتَّكِئِينَ فِيهَا ) أى : فى الجنة ( على الأرائك ) أى : على السرر ، أو على ما يتكأ عليه من سرير أو فراش ونحوه .( لاَ يَرَوْنَ فِيهَا شَمْساً وَلاَ زَمْهَرِيراً ) أى : لا يرون فيها شمساً شديدة الحرارة بحيث تؤذيهم أو تضرهم ، ولا يرون فيها كذلك ( زَمْهَرِيراً ) أى : بردا مفرطا ، يقال : زمهر اليوم ، إذا اشتد برده .والمقصود من الآية الكريمة أنهم لا يرون فى الجنة إلا جوا معتدلا ، لا هو بالحار ولا هو بالبارد .\n","ar.baghawi":"\"متكئين\"، نصب على الحال، \"فيها\" في الجنة، \"على الأرائك\"، السرر في الحجال، ولا تكون أريكة إلا إذا اجتمعا، \"لا يرون فيها شمساً ولا زمهريراً\"، أي صيفاً ولا شتاء. قال مقاتل: يعني شمساً يؤذيهم حرها ولا زمهريراً يؤذيهم برده، لأنهما يؤذيان في الدنيا. والزمهرير: البرد الشديد.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5604.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5604.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5604.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"وَدَانِيَةً عَلَيْهِمْ ظِلَالُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًا","transliteration":"Wa daaniyatan 'alaihim zilaaluhaa wa zullilat qutoofu haa tazleela","translations":{"en.ahmedali":"The shadows will bend over them, and low will hang the clusters of grapes.","en.ahmedraza":"And its shade will cover them, and its fruit clusters brought down low for them.","en.arberry":"near them shall be its shades, and its clusters hung meekly down,","en.asad":"since its [blissful] shades will come down low over them, and low will hang down its clusters of fruit, most easy to reach.","en.daryabadi":"And close upon them will be the shades thereof, and low will hang the clusters thereof greatly.","en.hilali":"And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach.","en.pickthall":"The shade thereof is close upon them and the clustered fruits thereof bow down.","en.qaribullah":"Near them shall be its shades with its clusters hung gently down,","en.sahih":"And near above them are its shades, and its [fruit] to be picked will be lowered in compliance.","en.sarwar":"The shades of the garden will be closely spread over them and it will be easy for them to reach the fruits.","en.yusufali":"And the shades of the (Garden) will come low over them, and the bunches (of fruit), there, will hang low in humility.","en.maududi":"The shades of Paradise will bend over them, and its fruits will be brought within their easy reach;","en.shakir":"And close down upon them (shall be) its shadows, and its fruits shall be made near (to them), being easy to reach.","en.itani":"Its shade hovering over them, and its fruit brought low within reach.","en.mubarakpuri":"And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach.","en.qarai":"Its shades will be close over them and its clusters [of fruits] will be hanging low.","en.wahiduddin":"the shading branches of trees will come down low over them, and their clusters of fruit, will hang down where they are the easiest to reach."},"tafsir":{"ar.muyassar":"فوقاهم الله من شدائد ذلك اليوم، وأعطاهم حسنًا ونورًا في وجوههم، وبهجة وفرحًا في قلوبهم، وأثابهم بصبرهم في الدنيا على الطاعة جنة عظيمة يأكلون منها ما شاؤوا، ويَلْبَسون فيها الحرير الناعم، متكئين فيها على الأسرَّة المزينة بفاخر الثياب والستور، لا يرون فيها حر شمس ولا شدة برد، وقريبة منهم أشجار الجنة مظللة عليهم، وسُهِّل لهم أَخْذُ ثمارها تسهيلا.","ar.jalalayn":"«ودانية» قريبة عطف على محل لا يرون، أي غير رائين «عليهم» منهم «ظلالها» شجرها «وذللت قطوفها تذليلا» أُدنيت ثمارها فينالها القائم والقاعد والمضطجع.","ar.qurtubi":"قوله تعالى : ودانية عليهم ظلالها أي ظل الأشجار في الجنة قريبة من الأبرار ، فهي مظلة عليهم زيادة في نعيمهم وإن كان لا شمس ولا قمر ثم ; كما أن أمشاطهم الذهب والفضة ، وإن كان لا وسخ ولا شعث ثم . ويقال : إن ارتفاع الأشجار في الجنة مقدار مائة عام ، فإذا اشتهى ولي الله ثمرتها دانت حتى يتناولها . وانتصبت دانية على الحال عطفا على [ ص: 123 ] ( متكئين ) كما تقول : في الدار عبد الله متكئا ومرسلة عليه الحجال . وقيل : انتصبت نعتا للجنة ; أي وجزاهم جنة دانية ، فهي ، صفة لموصوف محذوف . وقيل : على موضع لا يرون فيها شمسا ولا زمهريرا ويرون دانية ، وقيل : على المدح أي دنت دانية . قاله الفراء . ظلالها الظلال مرفوعة بدانية ، ولو قرئ برفع دانية على أن تكون الظلال مبتدأ ودانية الخبر لجاز ، وتكون الجملة في موضع الحال من الهاء والميم في وجزاهم وقد قرئ بذلك . وفي قراءة عبد الله ( ودانيا عليهم ) لتقدم الفعل . وفي حرف أبي ( ودان ) رفع على الاستئناف .وذللت أي سخرت لهم قطوفها أي ثمارها تذليلا أي تسخيرا ، فيتناولها القائم والقاعد والمضطجع ، لا يرد أيديهم عنها بعد ولا شوك ; قاله قتادة . وقال مجاهد : إن قام أحد ارتفعت له ، وإن جلس تدلت عليه ، وإن اضطجع دنت منه فأكل منها . وعنه أيضا : أرض الجنة من ورق ، وترابها الزعفران ، وطيبها مسك أذفر ، وأصول شجرها ذهب وورق ، وأفنانها اللؤلؤ والزبرجد والياقوت ، والثمر تحت ذلك كله ; فمن أكل منها قائما لم تؤذه ، ومن أكل منها قاعدا لم تؤذه ، ومن أكل منها مضطجعا لم تؤذه . وقال ابن عباس : إذا هم أن يتناول من ثمارها تدلت إليه حتى يتناول منها ما يريد ، وتذليل القطوف تسهيل التناول . والقطوف : الثمار ، الواحد قطف بكسر القاف ، سمي به لأنه يقطف ، كما سمي الجنى لأنه يجنى .تذليلا تأكيد لما وصف به من الذل ; كقوله : ونزلناه تنزيلا وكلم الله موسى تكليما . الماوردي : ويحتمل أن يكون تذليل قطوفها أن تبرز لهم من أكمامها ، وتخلص لهم من نواها .قلت : وفي هذا بعد ; فقد روى ابن المبارك ، قال : أخبرنا سفيان عن حماد عن سعيد بن جبير عن ابن عباس قال : نخل الجنة : جذوعها زمرد أخضر ، وكربها ذهب أحمر ، وسعفها كسوة لأهل الجنة ، منها مقطعاتهم وحللهم ، وثمرها أمثال القلال والدلاء ، أشد بياضا من اللبن ، وأحلى من العسل ، وألين من الزبد ليس فيه عجم . قال أبو جعفر النحاس : ويقال المذلل الذي قد ذلله الماء أي أرواه . ويقال المذلل الذي يفيئه أدنى ريح لنعمته ، ويقال المذلل المسوى ; لأن أهل الحجاز يقولون : ذلل نخلك أي سوه ، ويقال المذلل القريب المتناول ، من قولهم : حائط ذليل أي قصير . قال أبو جعفر : وهذه الأقوال التي حكيناها ذكرها أهل العلم باللغة وقالوها في قول امرئ القيس :[ وكشح لطيف كالحديل مخصر ]     وساق كأنبوب السقي المذلل\n","ar.miqbas":"وَدَانِيَةً عَلَيْهِمْ ظِلَالُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًا (14){ ودانية عليهم ظلالها } انتصب { دانية } عطفاً على { متكئين } لأن هذا حال سببي من أحوال المتكئين ، أي ظلال شجر الجنة قريبَة منهم . و { ظلالها } فاعل { دانية } وضمير { ظلالها } عائد إلى { جنة } .ودنو الظلال : قربها منهم وإذ لم يعهد وصف الظل بالقرب يظهر أن دنوّ الظلال كناية عن تدلّي الأدواح التي من شأنها أن تظلل الجنات في معتاد الدنيا ولكن الجنة لا شمس فيها فيستظلَّ من حرّها ، فتعين أن تركيب { دانيةً عليهم ظلالُها } مثَل يطلق على تدلِّي أفنان الجنة لأن الظل المظلل للشخص لا يتفاوت بدنوّ ولا بعد ، وقد يكون { ظلالها } مجازاً مرسلاً عن الأفنان بعلاقة اللزوم .والمعنى : أن أدواح الجنة قريبة من مجالسهم وذلك مما يزيدها بهجة وحسناً وهو في معنى قوله تعالى : { قُطُوفها دانية } [ الحاقة : 23 ] .ولذلك عطف عليه جملة { وذُلّلت قطوفها تذليلاً } . أي سخرت لهم قطوف تلك الأدواح وسهلت لهم بحيث لا التواء فيها ولا صلابة تتعب قاطفها ولا يتمطَّون إليها بل يجتنونها بأسهللِ تناول .فاستعير التذليل للتيسير كما يقال : فرس ذَلول : أي مِطواع لراكبه ، وبقرة ذَلول ، أي ممرنة على العمل ، وتقدم في سورة البقرة .والقُطوف : جمع قِطف بكسر القاف وسكون الطاء ، وهو العنقود من التمر أو العنب ، سمّي قِطفاً بصيغة من صيغ المفعول مثل ذِبح ، لأنه يقصد قَطفه فإطلاق القطف عليه مجاز باعتبار المآل شاع في الكلام . وضمير { قطوفها } عائد إلى { جنة } أو إلى { ظلالها } باعتبار الظلال كناية عن الأشجار .و { تذليلاً } مصدر مؤكّد لذلك ، أي تذليلاً شديداً منتهياً .\n","ar.waseet":"وقوله - سبحانه - ( وَدَانِيَةً عَلَيْهِمْ ظِلاَلُهَا . . . ) معطوف على قوله قبل ذلك : ( متكئين )و \" ضلالها \" فاعال \" دانية \" والضمير فى \" ضلالها \" يعود إلى الجنة .أى : أن الأبرار فى الجنة جلسة الناعم البال ، المنشرح الصدر . وظلال الأشجار الجنة قريبة منهم ، ومحيطة بهم ، زيادة فى إكرامهم .( وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلاً ) أى : أنهم - فضلا عن ذلك - قد سخرت لهم ثمار الجنة تسخيرا ، وسهل الله - تعالى - لهم تناولها تسهيلا عظيما ، بحيث إن القاعد منهم والقائم والمضجع ، يستطيع أن يتناول هذه الثمار هذه الثمار اللذيذة بدون جهد أو تعب .فقوله - تعالى - : ( وَذُلِّلَتْ ) من التذليل بمعنى الانقياد والتسخير ، يقال : ذُلّل الكرم - بضم الذال - إذا تدلت عناقيده وصارت فى متناول اليد . والقطوف : جمع قطف - بكسر القاف - وهو العنقود حين يُقْطَف أو الثمار المقطوفة .\n","ar.baghawi":"\"ودانيةً عليهم ظلالها\"، أي قريبة منهم ظلال أشجارها، ونصب \"دانيةً\" بالعطف على قوله: \"متكئين\"، وقيل: على موضع قوله: \"لا يرون فيها شمساً ولا زمهريراً\" ويرون \"دانيةً\"، وقيل: على المدح، \"وذللت\"، سخرت وقربت، \"قطوفها\"، ثمارها، \"تذليلاً\"، يأكلون من ثمارها قياماً وقعوداً ومضجعين ويتناولونها كيف شاؤوا على أي حال كانوا.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5605.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5605.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5605.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"وَيُطَافُ عَلَيْهِمْ بِآنِيَةٍ مِنْ فِضَّةٍ وَأَكْوَابٍ كَانَتْ قَوَارِيرَا","transliteration":"Wa yutaafu 'alaihim bi aaniyatim min fiddatinw wa akwaabin kaanat qawaareeraa","translations":{"en.ahmedali":"Passed round will be silver flagons and goblets made of glass,","en.ahmedraza":"Rounds of silver cups and silver beakers, looking like glass, will be presented upon them.","en.arberry":"and there shall be passed around them vessels of silver, and goblets of crystal,","en.asad":"And they will be waited upon with vessels of silver and goblets that will [seem to] be crystal –","en.daryabadi":"And brought round amongst them will be vessels of silver and also goblets of glass.","en.hilali":"And amongst them will be passed round vessels of silver and cups of crystal,","en.pickthall":"Goblets of silver are brought round for them, and beakers (as) of glass","en.qaribullah":"and passed around them shall be silver vessels, and crystal goblets,","en.sahih":"And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],","en.sarwar":"They will be served with silver dishes and crystal clear goblets.","en.yusufali":"And amongst them will be passed round vessels of silver and goblets of crystal,-","en.maududi":"and there shall be passed around them vessels of silver and goblets of crystal,","en.shakir":"And there shall be made to go round about them vessels of silver and goblets which are of glass,","en.itani":"Passing around them are vessels of silver, and cups of crystal.","en.mubarakpuri":"And among them will be passed round vessels of silver and cups of crystal --","en.qarai":"They will be served around with vessels of silver and goblets of crystal","en.wahiduddin":"Vessels of silver and goblets of pure crystal will be passed round among them"},"tafsir":{"ar.muyassar":"ويدور عليهم الخدم بأواني الطعام الفضيَّة، وأكواب الشراب من الزجاج، زجاج من فضة، قدَّرها السقاة على مقدار ما يشتهي الشاربون لا تزيد ولا تنقص، ويُسْقَى هؤلاء الأبرار في الجنة كأسًا مملوءة خمرًا مزجت بالزنجبيل، يشربون مِن عينٍ في الجنة تسمى سلسبيلا؛ لسلامة شرابها وسهولة مساغه وطيبه.","ar.jalalayn":"«ويطاف عليهم» فيها «بآنية من فضة وأكواب» أقداح بلا عرى «كانت قوارير».","ar.qurtubi":"قوله تعالى : ويطاف عليهم بآنية من فضة وأكواب أي يدور على هؤلاء الأبرار الخدم إذا أرادوا الشراب بآنية من فضة قال ابن عباس : ليس في الدنيا شيء مما في الجنة إلا الأسماء ; أي ما في الجنة أشرف وأعلى وأنقى . ثم لم تنف الأواني الذهبية بل المعنى يسقون في أواني الفضة ، وقد يسقون في أواني الذهب . وقد قال تعالى : يطاف عليهم بصحاف من ذهب وأكواب . وقيل : نبه بذكر الفضة على الذهب ; كقوله : سرابيل تقيكم الحر أي والبرد ; فنبه بذكر أحدهما على الثاني . والأكواب : الكيزان العظام التي لا آذان لها ولا عرى ، الواحد منها كوب ; وقال عدي :متكئا تقرع أبوابه يسعى عليه العبد بالكوبوقد مضى في ( الزخرف ) .\n","ar.miqbas":"وَيُطَافُ عَلَيْهِمْ بِآَنِيَةٍ مِنْ فِضَّةٍ وَأَكْوَابٍ كَانَتْ قَوَارِيرَ (15) عطف على جملة { يَشربون من كأس } [ الإنسان : 5 ] الخ كما اقتضاه التناسب بين جملة { يشربون } وجملة { يطاف عليهم } في الفعلية والمضارعية ، وذلك من أحسن أحوال الوصل ، عاد الكلام إلى صفة مجالس شرابهم .وهذه الجملة بيان لما أجمل في جملة { إن الأبرار يشربون من كأس } [ الإنسان : 5 ] ، وإنما عطفت عليها لما فيها من مغايرة مع الجملة المعطوف عليها من صفة آنية الشراب ، فلهذه المناسبة أعقب ذكر مجالس أهل الجنة ومُتكآتِهم ، بذكر ما يستتبعه مما تعارفه أهل الدنيا من أحوال أهل البذخ والترف واللذات بشرب الخمر إذ يُدير عليهم آنية الخمر سقاةٌ . وإذ قد كان ذلك معروفاً لم تكن حاجة إلى ذكر فاعل الطواف فبُني للنائب .وهذا وعد لهم بإعطاء متمناهم في الدنيا مع مَزيد عليه من نعيم الجنة «ما لا عيْن رأت ولا خَطَر على قلب بَشَر» .والطواف : مشي مكرر حولَ شيءٍ أو بين أشياء ، فلما كان أهل المتكأ جماعة كان دوران السقاء بهم طوافاً . وقد سمَّوا سقي الخمر : إدَارةَ الخمرِ ، أو إدارة الكأس . والسَّاقي : مدير الكأس ، أو مدير الجام أو نحو ذلك .والآنية : جمع إِناء ممدوداً بوزن أفْعِلة مثل كساء وأكسية ووِعاء وأوعية اجتمع في أول الجمع همزتان مزيدة وأصلية فخففت ثانيتهمَا ألفاً .والإِناء : اسم لكل وعاء يرتفق له ، وقال الراغب : ما يوضع فيه الشيء اه فيظهر أنه يطلق على كل وعاء يقصد للاستعمال والمداولة للأطعمة والأشربة ونحوهما سواء كان من خشب أو معدن أو فَخار أو أديم أو زجاج ، يوضع فيه ما يُشرب أو ما يؤكل ، أو يُطبخ فيه ، والظاهر أنه لا يطلق على ما يجعل للخزن فليست القِربة بإناء ولا الباطيةُ بإناء ، والكأسُ إناء والكوزُ إناء والإِبريق إناء والصحفة إناء .والمراد هنا : آنية مجالس شرابهم كما يدل عليه ذكر الأكواب وذلك في عموم الآنية وما يوضع معه من نُقْل أو شِواء أو نحو ذلك كما قال تعالى في آية الزخرف ( 71 ) { يطاف عليهم بصِحاف من ذهب وأكواب }وتشمل الآنية الكؤوسَ . وذكر الآنِية بعد كأس } [ الإنسان : 5 ] من قوله : { إن الأبرار يشربون من كأس } [ الإنسان : 5 ] من ذكر العام بعد الخاص إلاّ إذا أريد بالكأس الخمر .والأكواب : جمع كوب بضم الكاف بعده واو ساكنة . والكوب : كوز لا عروة له ولا خرطوم له ، وتقدم في سورة الزخرف .وعطف { أكواب } على ( آنية ) من عطف الخاص على العام لأن الأكواب تحمل فيها الخمر لإِعادة ملءِ الكؤوس . ووصفت هنا بأنها من فضة ، أي تأتيهم آنيتهم من فضة في بعض الأوقات ومن ذهب في أوقات أخرى كما دلّ عليه قوله في سورة الزخرف ( 71 ) { يطاف عليهم بصحاف من ذَهب وأكواب } لأن للذهب حسناً وللفضة حسناً فجعلت آنيتهم من المعدنين النفيسين لئلا يفوتهم ما في كل من الحسن والجمال ، أو يطاف عليهم بآنية من فضة وآنية من ذهب متنوعة متزاوجة لأن ذلك أبهج منظراً مثل ما قال مرة{ وحلّوا أساور من فضة } [ الإنسان : 21 ] ، ومرة { يُحَلّون فيها من أساور من ذهب } [ الكهف : 31 ] ، وذلك لإِدخال المسرَّة على أنفسهم بحسن المناظر فإنهم كانوا يتمنونها في الدنيا لِعزة وجودها أو وجود الكثير منها ، وأوثر ذكر آنية الفضة هنا لمناسبة تشبيهها بالقوارير في البياض .\n","ar.waseet":"وبعد أن وصف - سبحانه - جانبا من طعامهم ولباسهم ومسكنهم أخذت السورة الكريمة فى وصف شرابهم . فقال - تعالى - : ( وَيُطَافُ عَلَيْهِمْ بِآنِيَةٍ مِّن فِضَّةٍ وَأَكْوابٍ كَانَتْ قَوَارِيرَاْ . قَوَارِيرَاْ مِن فِضَّةٍ قَدَّرُوهَا تَقْدِيراً )وقوله : ( وَيُطَافُ ) من الطواف ، وهو السعى المكرر حول الشئ ، ومنه الطواف بالكعبة . والآونية : جمع إناء ، وهو اسم لكل وعاء يوضع فيه الطعام والشراب والمراد بها هنا : الأوانى : التى يستعملونها فى مجالس شرابهم .والأكواب : جمع كوب ، وهو القدح الذى لا عروة له ، وعطفه على الآنية من باب عطف الخاص على العام .والقوارير : جمع قارورة وهى فى الأصل إناء رقيق من الزجاج النقى الشفاف ، توضع فيه الأشربة وما يشبهها ، فتستقر فيه .\n","ar.baghawi":"\"ويطاف عليهم بآنية من فضة وأكواب كانت قواريراً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5606.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5606.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5606.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"قَوَارِيرَ مِنْ فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا","transliteration":"Qawaareera min fiddatin qaddaroohaa taqdeeraa","translations":{"en.ahmedali":"And crystal clear bottles of silver, of which they will determine the measure themselves.","en.ahmedraza":"Glass made from silver, which the servers have filled up to the measure.","en.arberry":"crystal of silver that they have measured -- very exactly.","en.asad":"crystal-like, [but] of silver - the measure whereof they alone will determine.","en.daryabadi":"Godblets of silver, they shall have filled them to exact measure.","en.hilali":"Crystal-clear, made of silver. They will determine the measure thereof according to their wishes.","en.pickthall":"(Bright as) glass but (made) of silver, which they (themselves) have measured to the measure (of their deeds).","en.qaribullah":"goblets of silver that they have precisely measured.","en.sahih":"Clear glasses [made] from silver of which they have determined the measure.","en.sarwar":"Also there will be crystal clear goblets of silver containing the exact measure of drink which they desire.","en.yusufali":"Crystal-clear, made of silver: they will determine the measure thereof (according to their wishes).","en.maududi":"goblets bright as crystal but made of silver, filled to exact measure.","en.shakir":"(Transparent as) glass, made of silver; they have measured them according to a measure.","en.itani":"Crystal of silver—they measured them exactly.","en.mubarakpuri":"(Qawarir) Crystal-clear, made of silver. They will determine the measure thereof.","en.qarai":"—crystal of silver— [from] which they will dispense in a precise measure.","en.wahiduddin":"and gleaming silver goblets which have been filled to the exact measure,"},"tafsir":{"ar.muyassar":"ويدور عليهم الخدم بأواني الطعام الفضيَّة، وأكواب الشراب من الزجاج، زجاج من فضة، قدَّرها السقاة على مقدار ما يشتهي الشاربون لا تزيد ولا تنقص، ويُسْقَى هؤلاء الأبرار في الجنة كأسًا مملوءة خمرًا مزجت بالزنجبيل، يشربون مِن عينٍ في الجنة تسمى سلسبيلا؛ لسلامة شرابها وسهولة مساغه وطيبه.","ar.jalalayn":"«قوارير من فضة» أي أنها من فضة يرى باطنها من ظاهرها كالزجاج «قدروها» أي الطائفون «تقديرا» على قدر ريِّ الشاربين من غير زيادة ولا نقص وذلك ألذ الشراب.","ar.qurtubi":"كانت قوارير قوارير من فضة أي في صفاء القوارير وبياض الفضة ; فصفاؤها صفاء الزجاج وهي من فضة . وقيل : أرض الجنة من فضة ، والأواني تتخذ من تربة الأرض التي هي منها . ذكره ابن عباس وقال : ليس في الجنة شيء إلا قد أعطيتم في الدنيا شبهه ، إلا القوارير من فضة . وقال : لو أخذت فضة من فضة الدنيا فضربتها حتى تجعلها مثل جناح الذباب لم تر من ورائها الماء ، ولكن قوارير الجنة مثل الفضة في صفاء القوارير .قدروها تقديرا قراءة العامة بفتح القاف والدال ; أي قدرها لهم السقاة الذين يطوفون بها عليهم . قال ابن عباس ومجاهد وغيرهما : أتوا بها على قدر ريهم ، بغير زيادة ولا نقصان . الكلبي : وذلك ألذ وأشهى ; والمعنى : قدرتها الملائكة التي تطوف عليهم . وعن ابن عباس أيضا : قدروها على ملء الكف لا تزيد ولا تنقص ، حتى لا تؤذيهم بثقل أو بإفراط صغر . وقيل : إن الشاربين قدروا لها مقادير في أنفسهم على ما اشتهوا وقدروا . وقرأ عبيد بن عمير والشعبي وابن سيرين قدروها بضم القاف وكسر الدال ; أي جعلت لهم على قدر إرادتهم . وذكر هذه القراءة المهدوي عن علي وابن عباس - رضي الله عنهما - ; وقال : ومن قرأ قدروها فهو راجع إلى معنى القراءة الأخرى ، وكأن الأصل قدروا عليها فحذف الجر ; والمعنى قدرت عليهم ; وأنشد سيبويه :آليت حب العراق الدهر آكله     والحب يأكله في القرية السوسوذهب إلى أن المعنى على حب العراق . وقيل : هذا التقدير هو أن الأقداح تطير فتغترف بمقدار شهوة الشارب ; وذلك قوله تعالى : قدروها تقديرا أي لا يفضل عن الري لا ينقص منه ، فقد ألهمت الأقداح معرفة مقدار ري المشتهي حتى تغترف بذلك المقدار . ذكر هذا القول الترمذي الحكيم في ( نوادر الأصول ) .\n","ar.miqbas":"قَوَارِيرَ مِنْ فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا (16)والقوارير : جمع قارورة ، وأصل القارورة إناء شبه كوز ، قيل : لا تسمى قارورة إلاّ إذا كانت من زجاج ، وقيل مطلقاً وهو الذي ابتدأ به صاحب «القاموس» .وسميت قارورة اشتقاقاً من القَرار وهو المكث في المكان وهذا وزن غريب .والغالب أن اسم القارورة للإِناء من الزجاج ، وقد يطلق على ما كان من زجاج وإن لم يكن إناء كما في قوله تعالى : { قَال إنه صرح ممرّد من قوارير } [ النمل : 44 ] وقد فسر قوله : { قواريراً } في هذه الآية بأنها شبيهة بالقوارير في صفاء اللون والرقة حتى كأنها تشفّ عما فيها .والتنافس في رقة آنية الخمر معروف عند شاربيها قال الأعشى :تريك القذى من دونها وهي دونه ... إذا ذاقها من ذاقها يتمطقوفعل { كانت } هنا تشبيه بليغ ، والمعنى : إنها مثل القوارير في شفيفها ، وقرينة ذلك قوله : { من فضة } ، أي هي من جنس الفضة في لون القوارير لأن قوله { من فضة } حقيقة فإنه قال قبله { بآنية من فضة } .ولفظ { قواريرا } الثاني ، يجوز أن يكون تأكيداً لفظياً لنظيره لزيادة تحقيق أن لها رقة الزجاح فيكون الوقف على { قواريرا } الأول .ويجوز أن يكون تكريراً لإِفادة التصنيف فإن حسن التنسيق في آنية الشراب من مكملات رونق مجلسه ، فيكون التكرير مثل ما في قوله تعالى : { والمَلكُ صَفّاً صفّاً } [ الفجر : 22 ] وقول الناس : قرأت الكتاب باباً باباً فيكون الوقف على { قواريراً } الثاني .وكتب في المصحف { قواريرا قواريرا } بألف في آخر كلتا الكلمتين التي هي علامة تنوين .وقرأ نافع والكسائي وأبو بكر عن عاصم وأبو جعفر { قواريرا } الأول والثاني منونين وتنوين الأول لمراعاة الكلمات الواقعة في الفواصل السابقة واللاحقةِ من قوله { كافوراً } [ الإنسان : 5 ] إلى قوله { تقديرا } وتنوين الثاني للمزاوجة مع نظيره وهؤلاء وقفوا عليهما بالألف مثل أخواتهما وقد تقدم نظيره في قوله تعالى : { سلاسلا وأغلالاً } [ الإنسان : 4 ] .وقرأ ابن كثير وخلف ورويس عن يعقوب { قوايراً } الأول بالتنوين ووقفوا عليه بالألف وهو جار على التوجيه الذي وجهنا به قراءة نافع والكسائي . وقرآ { قواريرا } الثاني بغير تنوين على الأصل ولم تراع المزاوجة ووقفا عليه بالسكون .وقرأ ابن عامر وأبو عمرو وحمزة وحفص عن عاصم بترك التنوين فيهما لمنع الصرف وعدم مراعاة الفواصل ولا المزاوجة .والقراءات روايةٌ متواترة لا يناكدها رسم المصحف فلعلّ الذين كتبوا المصاحف لم تبلغهم إلاّ قراءة أهل المدينة .وحدّث خلف عن يحيى بن آدم عن ابن إدريس قال : في المصاحف الأول ثبتَ { قواريرا } الأول بالألف والثاني بغير ألف ، يعني المصاحف التي في الكوفة فإن عبد الله ابن إدريس كوفي .وقال أبو عبيد : لرأيتُ في مصحف عثمان { قواريرا } الأول بالألف وكان الثاني مكتوباً بالألف فحُكَّت فرأيتُ أثرها هناك بيناً اه . وهذا كلام لا يفيد إذ لو صحّ لما كان يُعرف من الذي كتَبه بالألف ، ولا مَن الذي مَحا الألف ولا متى كان ذلك فيما بين زمن كتابة المصاحف وزمن أبي عبيد ، ولا يُدرى ماذا عنى بمصحف عثمان أهو مصحفه الذي اختص به أم هو مصحف من المصاحف التي نسخت في خلافته ووزعها على الأمصار؟ .وقرأ يعقوب بغير تنوين فيهما في الوصل .وأما في الوقف فحمزة وقف عليهما بدون ألف . وهشام عن ابن عامر وقفا عليهما بالألف على أنه صلة للفتحة ، أي إشباع للفتحة ووقف أبو عمرو وحفص وابن ذكوان عن ابن عامر ورويس عن يعقوب على الأول بالألف وعلى الثاني بدون ألف ووجهه ما وجهت به قراءة ابن كثير وخلف .وقوله : { قدّروها تقديراً } يجوز أن يكون ضمير الجمع عائداً إلى { الأبرار } [ الإنسان : 5 ] أو { عباد الله } [ الإنسان : 6 ] الذي عادت إليه الضمائر المتقدمة من قوله { يفجرونها } [ الإنسان : 6 ] و { يوفون } [ الإنسان : 7 ] إلى آخر الضمائر فيكون معنى التقدير رغبتَهم أن تجيء على وفق ما يشتهون .ويجوز أن يكون الضمير عائداً إلى نائب الفاعل المحذوف المفهوم من بناء { يطاف } للنائب ، أي الطائفون عليهم بها قدَّروا الآنية والأكوابَ ، أي قدروا ما فيها من الشراب على حسب ما يطلبه كل شارب منهم ومآله إلى معنى الاحتمال الأول . وكان مما يعد في العادة من حِذق الساقي أن يعطِيَ كلَّ أحد من الشَّرْب ما يناسب رغبته .و { تقديراً } مفعول مطلق مؤكد لعامله للدلالة على وفاء التقدير وعدم تجاوزه المطلوب ولا تقصيره عنه .\n","ar.waseet":"أى : ويطاف على هؤلاء الأبرار بآنية كائنة من فضة ، وبأكواب وأقداح من فضة - أيضاً - وجعلت هذه الأكواب فى مثل القوارير فى صفائها ونقائها ، وفى مثل الفضة فى جمالها وحسنها ، بحيث يرى ما بداخلها من خارجها .وقوله - سبحانه - ( قَدَّرُوهَا تَقْدِيراً ) أى : إن الطائفين بهذه الأكواب عليهم ، قد وضعوا فيها من الشراب على مقدار ما يشبع هؤلاء الأبرار ويرويهم بدون زيادة أو نقصان والطائفون عليهم بذلك هم الخدم الذين جعلهم الله - تعالى - لخدمة هؤلاء الأبرار . وبنى الفعل للمجهول للعلم بهم .وقال - سبحانه - هنا ( بِآنِيَةٍ مِّن فِضَّةٍ ) وفى سورة الزخرف ( يُطَافُ عَلَيْهِمْ بِصِحَافٍ مِّن ذَهَبٍ وَأَكْوَابٍ . . . ) زيادة فى تكريمهم وفى سمو منزلتهم ، إذ تارة يطاف عليهم بأكواب من فضة ، وتارة يطاف عليهم بصحاف من ذهب ، ومن المعروف أنه كلما تعددت المناظر الحسنة ، والمشارب اللذيذة ، كان ذلك أبهج للنفس .والمراد بالكينونة فى قوله - تعالى - ( كَانَتْ قَوَارِيرَاْ . . . ) أنها تكونت ووجدت على هذه الصفة .قال الآلوسى : قوله - تعالى - ( كَانَتْ قَوَارِيرَاْ ) أى : كانت تلك الأكواب قوارير ، جمع قارورة ، وهى إناء رقيق من الزجاج توضع فيه الأشربة ، ونصبه على الحال ، فإن \" كان \" تامة ، وهو كما تقول : خلقت قوارير . وقوله - تعالى - : ( قَوَارِيرَاْ مِن فِضَّةٍ ) بدل .والكلام على التشبيه البليغ .والمراد تكونت جامعة بين صفاء الزجاجة وشفيفها ، ولون الفضة وبياضها .وقرأ نافع والكسائى وأبو بكر بتنوين ( قَوَارِيرَاْ ) فى الموضعين وصلا ، وإبداله ألفا وقفا . وابن كثير يمنع صرف الثانى ويصرف الأول . . والقراءة بمنع صرفهما للباقين .وقال الشوكانى : وجملة \" قدرها تقديرا \" صفة لقوارير . . أى : قدرها السقاة من الخدم ، الذين يطوفون عليهم على قدر ما يحتاج إليه الشاربون من أهل الجنة ، من دون زيادة ولا نقصان . . ، وقيل : قدرها الملائكة . وقيل : قدرها الشاربون لها من أهل الجنة على مقدار حاجتهم ، فجاءت كما يريدون فى الشكل لا تزيد ولا تنقص . .\n","ar.baghawi":"\"قوارير من فضة\"، قال المفسرون: أراد بياض الفضة في صفاء القوارير، فهي من فضة في صفاء الزجاج، يرى ما في داخلها من خارجها. قال الكلبي: إن الله جعل قوارير كل قوم من تراب أرضهم، وإن أرض الجنة من فضة، فجعل منها قوارير يشربون فيها، \"قدروها تقديراً\"، قدروا الكأس على قدر ريهم لا يزيد ولا ينقص، أي قدرها لهم السقاة والخدم الذين يطوفون عليهم يقدرونها ثم يسقون.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5607.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5607.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5607.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنْجَبِيلًا","transliteration":"Wa yusawna feehaa kaasan kaana mizaajuhaa zanjabeelaa","translations":{"en.ahmedali":"There will they drink a cup flavoured with ginger","en.ahmedraza":"And in Paradise they will be given to drink cups, filled with a mixture of ginger.","en.arberry":"And therein they shall be given to drink a cup whose mixture is ginger,","en.asad":"And in that [paradise] they will be given to drink of a cup flavoured with ginger,","en.daryabadi":"And therein they shall be given to drink of a cup whereof the admixture will be ginger.","en.hilali":"And they will be given to drink there a cup (of wine) mixed with Zanjabil (ginger, etc.),","en.pickthall":"There are they watered with a cup whereof the mixture is of Zanjabil,","en.qaribullah":"And they shall be given to drink from a cup whose mixture is ginger,","en.sahih":"And they will be given to drink a cup [of wine] whose mixture is of ginger","en.sarwar":"They will drink cups containing (soft flowing) sparkling water","en.yusufali":"And they will be given to drink there of a Cup (of Wine) mixed with Zanjabil,-","en.maududi":"Therein they shall be served a cup flavoured with ginger,","en.shakir":"And they shall be made to drink therein a cup the admixture of which shall be ginger,","en.itani":"They will be served therein with a cup whose flavor is Zanjabeel.","en.mubarakpuri":"And they will be given to drink there of a cup (of wine) mixed with Zanjabil (ginger),","en.qarai":"They will be served therein with a cup of a drink seasoned with Zanjabeel,","en.wahiduddin":"and they will be given a cup to drink flavoured with ginger,"},"tafsir":{"ar.muyassar":"ويدور عليهم الخدم بأواني الطعام الفضيَّة، وأكواب الشراب من الزجاج، زجاج من فضة، قدَّرها السقاة على مقدار ما يشتهي الشاربون لا تزيد ولا تنقص، ويُسْقَى هؤلاء الأبرار في الجنة كأسًا مملوءة خمرًا مزجت بالزنجبيل، يشربون مِن عينٍ في الجنة تسمى سلسبيلا؛ لسلامة شرابها وسهولة مساغه وطيبه.","ar.jalalayn":"«ويسقون فيها كأسا» خمرا «كان مزاجها» ما تمزج به «زنجبيلا».","ar.qurtubi":"قوله تعالى : ويسقون فيها كأسا وهي الخمر في الإناء . كان مزاجها زنجبيلا ( كان ) صلة ; أي مزاجها زنجبيل ، أو كان في حكم الله زنجبيلا . وكانت العرب تستلذ من الشراب ما يمزج بالزنجبيل لطيب رائحته ; لأنه يحذو اللسان ، ويهضم المأكول ، فرغبوا في نعيم الآخرة بما اعتقدوه نهاية النعمة والطيب . وقال المسيب بن علس يصف ثغر المرأة :وكأن طعم الزنجبيل به     إذ ذقته وسلافة الخمرويروى . الكرم . وقال آخر :كأن جنيا من الزنجبي     ل بات بفيها وأريا مشوراونحوه قول الأعشى :كأن القرنفل والزنجبي     ل باتا بفيها وأريا مشوراوقال مجاهد : الزنجبيل اسم للعين التي منها مزاج شراب الأبرار . وكذا قال قتادة : والزنجبيل اسم العين التي يشرب بها المقربون صرفا وتمزج لسائر أهل الجنة . وقيل : هي عين في الجنة يوجد فيها طعم الزنجبيل . وقيل : إن فيه معنى الشراب الممزوج بالزنجبيل . والمعنى كأن فيها زنجبيلا .\n","ar.miqbas":"وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنْجَبِيلًا (17) أتبع وصف الآنية ومحاسنها بوصف الشراب الذي يحويه وطِيبه ، فالكأس كأس الخمر وهي من جملة عموم الآنية المذكورة فيما تقدم ولا تسمى آنية الخمر كأساً إلاّ إذا كان فيها خمر فكون الخمر فيها هو مصحح تسميتها كأساً ، ولذلك حسن تعدية فعل السقْي إلى الكأس لأن مفهوم الكأس يتقوم بما في الإِناء من الخمر ، ومثل هذا قول الأعشى :وكأسسٍ شربتُ على لذة ... وأُخرى تداويتُ منها بهايريد : وخمر شربتُ .والقول في إطلاق الكأس على الإِناء أو على ما فيه كالقول في نظيره المتقدم في قوله : { إن الأبرار يشربون من كأس كان مزاجها كافوراً } [ الإنسان : 5 ] .ومعنى الآية أن هذه سقْية أخرى ، أي مرة يشربون من كأس مزاجها الكافور ومرة يسقون كأساً مزاجها الزنجبيل .وضمير { فيها } للجنة من قوله : { جنة وحريراً } [ الإنسان : 12 ] .وزنجبيل : كلمة معربة وأصلها بالكاف الأعجمية عوض الجيم . قال الجواليقي والثعالبي : هي فارسية ، وهو اسم لجذور مثل جذور السُّعْد بضم السين وسكون العين تكون في الأرض كالجَزَر الدقيق واللفت الدقيق لونها إلى البياض لها نبات له زهر ، وهي ذات رائحة عِطرية طيبة وطعمها شبيه بطعم الفُلفل ، وهو ينبت ببلاد الصين والسند وعُمان والشحر ، وهو أصناف أحسنها ما ينبت ببلاد الصين ، ويدخل في الأدوية والطبخ كالأفاويه ورائحته بهارية وطعمه حريف . وهو منبه ويستعمل منقوعاً في الماء ومربى بالسّكر .وقد عرفه العرب وذكره شعراء العرب في طيب الرائحة .أي يمزجون الخمر بالماء المنقوع فيه الزنجبيل لطيب رائحته وحسن طعمه .وانتصب { عيناً } على البدل من { زنجبيلاً } كما تقدم في قوله : { كان مزاجها كافوراً عيناً يشرب بها عباد الله } [ الإنسان : 5 ، 6 ] .ومعنى كون الزنجبيل عيناً : أن منقوعه أو الشراب المستخرج منه كثير كالعين على نحو قوله تعالى : { وأنهار من لبن لم يتغير طعمه } [ محمد : 15 ] ، أي هو كثير جداً وكان يعرف في الدنيا بالعزة .\n","ar.waseet":"ثم بين - سبحانه - محاسن شراب أهل الجنة فقال : ( وَيُسْقَوْنَ فِيهَا كَأْساً كَانَ مِزَاجُهَا زَنجَبِيلاً . عَيْناً فِيهَا تسمى سَلْسَبِيلاً ) .والمراد بالكأس هنا : كأس الخمر . والضمير فى قوله ( فيها ) يعود إلى الجنة . والزنجبيل : نبات ذو رائحة عطرية طيبة ، والعرب كانوا يستلذون الشراب الممزوج به .\n","ar.baghawi":"\"ويسقون فيها كأساً كان مزاجها زنجبيلاً\"، يشوق ويطرب، والزنجبيل: مما كانت العرب تستطيبه جداً، فوعدهم الله تعالى أنهم يسقون في الجنة الكأس الممزوجة بزنجبيل الجنة. قال مقاتل: لا يشبه زنجبيل الدنيا. قال ابن عباس: كل ما ذكر الله في القرآن مما في الجنة وسماه ليس له في الدنيا مثل. وقيل: هو عين في الجنة يوجد منها طعم الزنجبيل. قال قتادة: يشربها المقربون صرفاً، ويمزج لسائر أهل الجنة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5608.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5608.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5608.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"عَيْنًا فِيهَا تُسَمَّىٰ سَلْسَبِيلًا","transliteration":"'Aynan feeha tusammaa salsabeelaa","translations":{"en.ahmedali":"From a spring by the name of Ever-flowing-Salsabil.","en.ahmedraza":"Which is a spring in Paradise called Salsabeel.","en.arberry":"therein a fountain whose name is called Salsabil.","en.asad":"[derived from] a source [to be found] therein, whose name is \"Seek Thy Way\".","en.daryabadi":"From a fountain therein, named Salsabil.","en.hilali":"A spring there, called Salsabil.","en.pickthall":"(The water of) a spring therein, named Salsabil.","en.qaribullah":"from a fountain called Salsabila.","en.sahih":"[From] a fountain within Paradise named Salsabeel.","en.sarwar":"from a spring named salsabil.","en.yusufali":"A fountain there, called Salsabil.","en.maududi":"drawn from a spring (in Paradise) called Salsabil.","en.shakir":"(Of) a fountain therein which is named Salsabil.","en.itani":"A spring therein named Salsabeel.","en.mubarakpuri":"A spring there, called Salsabil.","en.qarai":"from a spring in it named Salsabeel.","en.wahiduddin":"from a flowing spring called Salsabil."},"tafsir":{"ar.muyassar":"ويدور عليهم الخدم بأواني الطعام الفضيَّة، وأكواب الشراب من الزجاج، زجاج من فضة، قدَّرها السقاة على مقدار ما يشتهي الشاربون لا تزيد ولا تنقص، ويُسْقَى هؤلاء الأبرار في الجنة كأسًا مملوءة خمرًا مزجت بالزنجبيل، يشربون مِن عينٍ في الجنة تسمى سلسبيلا؛ لسلامة شرابها وسهولة مساغه وطيبه.","ar.jalalayn":"«عينا» بدل زنجبيلا «فيها تسمى سلسبيل» يعني أن ماءها كالزنجبيل الذي تستلذ به العرب سهل المساغ في الحلق.","ar.qurtubi":"عينا بدل من كأس . ويجوز أن ينتصب بإضمار فعل أي يسقون عينا . ويجوز نصبه بإسقاط الخافض أي من عين على ما تقدم في قوله تعالى : عينا يشرب بها عباد الله . فيها أي في الجنة تسمى سلسبيلا السلسبيل الشراب اللذيذ ، وهو فعلليل من السلالة ; تقول العرب : هذا شراب سلس وسلسال وسلسل وسلسبيل بمعنى ; أي طيب الطعم لذيذه . وفي الصحاح : وتسلسل الماء في الحلق جرى ، وسلسلته أنا صببته فيه ، وماء سلسل وسلسال : سهل الدخول في الحلق لعذوبته وصفائه ، والسلاسل بالضم مثله . وقال الزجاج : السلسبيل في اللغة : اسم لما كان في غاية السلاسة ; فكأن العين سميت بصفتها . وعن مجاهد قال : سلسبيلا : حديدة الجرية تسيل في حلوقهم انسلالا . ونحوه عن ابن عباس : إنها الحديدة الجري . ذكره الماوردي ; ومنه قول حسان بن ثابت - رضي الله عنه - :يسقون من ورد البريص عليهم     بردى يصفق بالرحيق السلسلوقال أبو العالية ومقاتل : إنما سميت سلسبيلا ; لأنها تسيل عليهم في الطرق وفي منازلهم ، تنبع من أصل العرش من جنة عدن إلى أهل الجنة . وقال قتادة : سلسة منقاد ماؤها حيث شاءوا . ونحوه عن عكرمة . وقال القفال : أي تلك عين شريفة فسل سبيلا إليها . وروي هذا عن علي - رضي الله عنه - . وقوله : تسمى أي إنها مذكورة عند الملائكة وعند الأبرار وأهل الجنة بهذا الاسم . وصرف سلسبيل ; لأنه رأس آية ; كقوله تعالى : ( الظنونا ) و ( السبيلا ) .\n","ar.miqbas":"عَيْنًا فِيهَا تُسَمَّى سَلْسَبِيلًا (18)و ( سلسبيل ) : وصف قيل مشتق من السلاسة وهي السهولة واللين فيقال : ماء سلسل ، أي عذب بارد . قيل : زيدت فيه الباء والياء ( أي زيدتا في أصل الوضع على غير قياس ) .قال التبريزي في «شرح الحماسة» في قول البعيث بن حُرَيْث :خَيالٌ لأمِّ السَّلْسبيل ودُونَها ... مسيرة شهر للبريد المذبذبقال أبو العلاء : السلسبيل الماء السهل المَساغ . وعندي أن هذا الوصف ركب من مادتي السلاسة والسَّبَالة ، يقال : سبلت السماء ، إذا أمطرت ، فسبيل فعيل بمعنى مفعول ، رُكب من كلمتي السلاسة والسبيل لإِرادة سهولة شربه ووفرة جريه . وهذا من الاشتقاق الأكبر وليس باشتقاق تصريفي .فهذا وصف من لغة العرب عند محققي أهل اللغة . وقال ابن الأعرابي : لم أسمع هذه اللفظة إلاّ في القرآن ، فهو عنده من مبتكرات القرآن الجارية على أساليب الكلام العربي ، وفي «حاشية الهمذاني على الكشاف» نسبة بيت البعث المذكور آنفاً مع بيتين بعده إلى أمية بن أبي الصلت وهو عزو غريب لم يقله غيره .ومعنى { تسمى } على هذا الوجه ، أنها توصف بهذا الوصف حتى صار كالعلم لها كما قال تعالى : { لَيُسَمُّونَ الملائكة تسميةَ الأنثى } [ النجم : 27 ] أي يصفونهم بأنهم إناث ، ومنه قوله تعالى : { هل تعلم له سَمِيّاً } [ مريم : 65 ] أي لا مثيل له . فليس المراد أنه علَم .ومن المفسرين من جعل التسمية على ظاهرها وجعل { سلسبيلاً } علماً على هذه العين ، وهو أنسب بقوله تعالى : { تسمَّى . } وعلى قول ابن الأعرابي والجمهور : لا إشكال في تنوين { سلسبيلاً } . وأما الجواليقي : إنه أعجمي سمّي به ، يكون تنوينه للمزاوجة مثل تنوين { سلاسلا } [ الإنسان : 4 ] .وهذا الوصف ينحلّ في السمع إلى كلمتين : سَل ، سَبيلا ، أي اطلُب طريقاً . وقد فسره بذلك بعض المفسرين وذكر أنه جُعل عَلَماً لهذه العين من قبيل العلَم المنقول عن جملة مثل : تَأبط شراً ، وذَرَّى حَبّاً . وفي «الكشاف» أن هذا تكلف وابتداع .\n","ar.waseet":"والسلسبيل وصف قيل مشتق من السلاسة بمعنى السهولة واللين ، يقال : ماء سلْسَل ، أى : عذب سائغ للشاربين ، ومعنى ( تسمى ) على هذا الرأى . أى : توصف بالسلاسة والعذوبة .وقيل : السلسبيل : اسم لهذه العين ، لقوله - تعالى - ( تسمى ) .أى : أن هؤلاء الأبرار - بجانب كل ما تقدم من نعم - يسقون فى الجنة من كأس مليئة بالخمر ، وهذه الخمر التى يشربونا ممزجة بالزنجبيل ، فتزداد لذة على لذتها .ويسقون - أيضا - من عين فيها - أى : فى الجنة - تسمى سلسبيلا ، وذلك لسلاسة مائها ولذته وعذوبته ، وسهولة نزوله إلى الحلق .قال صاحب الكشاف : ( سَلْسَبِيلاً ) سميت بذلك - لسلاسة انحدارها فى الحلق ، وسهولة مساغها يعنى : أنها فى طعم الزنجبيل ، وليس فيها لذعة ، ولكن فيها نقيض اللذع وهو السلاسة ، فقال : شراب سلسل وسلسال وسلسبيل ، وقد زيدت الباء فى التركيب حتى صارت الكلمة خماسية . ودلت على غاية السلاسة . .\n","ar.baghawi":"\"عيناً فيها تسمى سلسبيلاً\"، قال قتادة: سلسلة منقادة لهم يصرفونها حيث شاؤوا، وقال مجاهد: حديدة شديدة الجرية.وقال أبو العالية ومقاتل بن حيان: سميت سلسبيلاً لأنها تسيل عليهم في الطرق وفي منازلهم تنبع من أصل العرش من جنة عدن إلى أهل الجنان وشراب الجنة على برد الكافور وطعم الزنجبيل وريح المسك. قال الزجاج: سميت سلسبيلاً لأنها في غاية السلاسة تتسلسل في الحلق، ومعنى قوله: \"تسمى\" أي توصف لأن أكثر العلماء على أن سلسبيلاً صفة لا اسم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5609.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5609.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5609.mp3","format":"mp3","local_path":null}}},{"verse":19,"arabic":"۞ وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَنْثُورًا","transliteration":"Wa yatoofu 'alaihim wildaanum mukhalladoona izaa ra aytahum hasibtahum lu'lu 'am mansoora","translations":{"en.ahmedali":"And boys of everlasting youth will go about attending them. Looking at them you would think that they were pearls dispersed.","en.ahmedraza":"Immortal youths shall surround them, waiting upon them; when you see them, you would think they are scattered pearls.","en.arberry":"Immortal youths shall go about them; when thou seest them, thou supposest them scattered pearls,","en.asad":"And immortal youths will wait upon them: when thou seest them, thou wouldst deem them to be scattered pearls;","en.daryabadi":"And there shall go round Unto them youths ever-young. When thou seest them thou wouldst deem them pearls unstrung.","en.hilali":"And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls.","en.pickthall":"There wait on them immortal youths, whom, when thou seest, thou wouldst take for scattered pearls.","en.qaribullah":"Immortal youths will go about them, when you see them, you would suppose them to be scattered pearls.","en.sahih":"There will circulate among them young boys made eternal. When you see them, you would think them [as beautiful as] scattered pearls.","en.sarwar":"They will be served by immortal youths who look like scattered pearls.","en.yusufali":"And round about them will (serve) youths of perpetual (freshness): If thou seest them, thou wouldst think them scattered Pearls.","en.maududi":"There boys of everlasting youth shall go about attending them: when you see them, you would think that they are scattered pearls.","en.shakir":"And round about them shall go youths never altering in age; when you see them you will think them to be scattered pearls.","en.itani":"Passing among them are eternalized youths. If you see them, you would think them sprinkled pearls.","en.mubarakpuri":"And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls.","en.qarai":"They will be waited upon by immortal youths, whom, were you to see them, you will suppose them to be scattered pearls.","en.wahiduddin":"They will be attended by youths who will not age -- when you see them you will think them to be like sprinkled pearls --"},"tafsir":{"ar.muyassar":"ويدور على هؤلاء الأبرار لخدمتهم غلمان دائمون على حالهم، إذا أبصرتهم ظننتهم- لحسنهم وصفاء ألوانهم وإشراق وجوههم- اللؤلؤ المفرَّق المضيء.","ar.jalalayn":"«ويطوف عليهم ولدان مخلدون» بصفة الولدان لا يشيبون «إذا رأيتهم حسبتهم» لحسنهم وانتشارهم في الخدمة «لؤلؤا منثورا» من سلكه أو من صدفه وهو أحسن منه في غير ذلك.","ar.qurtubi":"قوله تعالى : ويطوف عليهم ولدان مخلدون بين من الذي يطوف عليهم بالآنية ; أي ويخدمهم ولدان مخلدون ، فإنهم أخف في الخدمة . ثم قال : مخلدون أي باقون على ما هم عليه من الشباب والغضاضة والحسن ، لا يهرمون ولا يتغيرون ، ويكونون على سن واحدة على مر الأزمنة . وقيل : مخلدون لا يموتون . وقيل : مسورون مقرطون ; أي محلون والتخليد التحلية . وقد تقدم هذا .إذا رأيتهم حسبتهم لؤلؤا منثورا أي ظننتهم من حسنهم وكثرتهم وصفاء ألوانهم لؤلؤا مفرقا في عرصة المجلس ، واللؤلؤ إذا نثر على بساط كان أحسن منه منظوما . وعن المأمون أنه ليلة زفت إليه بوران بنت الحسن بن سهل ، وهو على بساط منسوج من ذهب ، وقد نثرت عليه نساء دار الخليفة اللؤلؤ ، فنظر إليه منثورا على ذلك البساط فاستحسن المنظر وقال : لله در أبي نواس كأنه أبصر هذا حيث يقول :كأن صغرى وكبرى من فقاقعها حصباء در على أرض من الذهبوقيل : إنما شبههم بالمنثور ; لأنهم سراع في الخدمة ، بخلاف الحور العين إذ شبههن باللؤلؤ المكنون المخزون ; لأنهن لا يمتهن بالخدمة .\n","ar.miqbas":"وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَنْثُورًا (19)هذا طواف آخر غير طواف السُقاة المذكورِ آنفاً بقوله : { ويطاف عليهم بآنية من فضة } [ الإنسان : 15 ] الخ فهذا طواف لأداء الخِدمة فيشمل طواف السقاة وغيرهم .و { وِلْدَان } : جمع وليد وأصل وليد فعيل بمعنى مفعول ويطلق الوليد على الصبي مجازاً مشهوراً بعلاقة ما كان ، لقصد تقريب عهده بالولادة ، وأحسن من يتخذ للخدمة الوِلدان لأنهم أخف حركةً وأسرع مشياً ولأن المخدوم لا يتحرج إذا أمرهم أو نهاهم .ووصفوا بأنهم { مخلَّدون } للاحتراس مما قد يوهمه اشتقاق { وِلدان } من أنهم يشبون ويكتهلون ، أي لا تتغير صفاتهم فهم وِلدان دَوْماً وإلاّ فإن خلود الذوات في الجنة معلوم فما كان ذكره إلاّ لأنه تخليد خاص .وقال أبو عبيدة { مخلَّدون } : محلَّون بالخِلدَة بوزن قِرَدَة . واحدها خُلْد كقُفل وهو اسم للقُرط في لغة حِمير .وشُبهوا باللؤلؤ المنثور تشبيهاً مقيّداً فيه المشبه بحال خاص لأنهم شبهوا به في حسن المنظر مع التفرق .وتركيب { إذا رأيتهم حسبتهم } مفيد للتشبيه المرادِ به التشابُهُ والخطاب في { رأيتَ } [ الإنسان : 20 ] خطاب لغَير معين ، أي إذا رآه الرائِي .والقول في معنى الطواف تقدم عند قوله تعالى : { ويُطاف عليهم بآنية من فضة } الآية [ الإنسان : 15 ] .\n","ar.waseet":"ثم أخبر - سبحانه - عن نوع آخر من الخدم ، يطوفون على هؤلاء الأبرار لخدمتهم ، فقال : ( وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُّخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤاً مَّنثُوراً ) .أى : ويطوف على هؤلاء الأبرار ( وِلْدَانٌ مُّخَلَّدُونَ ) أى : دائمون على ما هم عليه من النضارة والشباب . . إذا رأيتهم - أيها المخاطب ( حَسِبْتَهُمْ ) وظننتهم ( لُؤْلُؤاً مَّنثُوراً ) أى : حسبتهم من حسنهم ، وصفاء ألوانهم ، ونضارة وجوههم . . لؤلؤا ودرا مفرقا فى جنبات المجالس وأوسطها .فقوله - تعالى - ( مُّخَلَّدُونَ ) احتراس المقصود منه دفع توهم أنهم سيصيرون فى يوم من الأيام كهولا ، قالوا : وشبهوا باللؤلؤ المنثور ، لأن اللؤلؤ إذا نثر على البساط ، كان أكثر جمالا منه فيما لو كان منظوما .\n","ar.baghawi":"\"ويطوف عليهم ولدان مخلدون إذا رأيتهم حسبتهم لؤلؤاً منثوراً\"، قال عطاء: يريد في بياض اللؤلؤ وحسنه، واللؤلؤ إذا نثر من الخيط على البساط، كان أحسن منه منظوماً.وقال أهل المعاني: إنما شبهوا بالمنثور لانتثارهم في الخدمة، فلو كانوا صفاً لشبهوا المنظوم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5610.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5610.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5610.mp3","format":"mp3","local_path":null}}},{"verse":20,"arabic":"وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًا وَمُلْكًا كَبِيرًا","transliteration":"Wa izaa ra ayta summa ra ayta na'eemanw wa mulkan kabeera","translations":{"en.ahmedali":"When you look around, you will see delights and great dominion.","en.ahmedraza":"And when you look towards it, you will see serenity and a great kingdom.","en.arberry":"when thou seest them then thou seest bliss and a great kingdom.","en.asad":"and when thou seest [anything that is] there thou wilt see [only] bliss and a realm transcendent","en.daryabadi":"And when thou lookest them thou shalt behold delight and a dominion magnificent.","en.hilali":"And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion.","en.pickthall":"When thou seest, thou wilt see there bliss and high estate.","en.qaribullah":"When you see them, you see bliss, and a great Kingdom.","en.sahih":"And when you look there [in Paradise], you will see pleasure and great dominion.","en.sarwar":"If you were to see it, you would find it to be a great kingdom with great bounty.","en.yusufali":"And when thou lookest, it is there thou wilt see a Bliss and a Realm Magnificent.","en.maududi":"Whitherto you look around, you will see an abundance of bliss and the glories of a great kingdom.","en.shakir":"And when you see there, you shall see blessings and a great kingdom.","en.itani":"Wherever you look, you see bliss, and a vast kingdom.","en.mubarakpuri":"And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion.","en.qarai":"As you look on, you will see there bliss and a great kingdom.","en.wahiduddin":"wherever you look, you will see bliss and a great kingdom:"},"tafsir":{"ar.muyassar":"وإذا أبصرت أيَّ مكان في الجنة رأيت فيه نعيمًا لا يُدْركه الوصف، ومُلْكا عظيمًا واسعًا لا غاية له.","ar.jalalayn":"«وإذا رأيت ثم» أي وجدت الرؤية منك في الجنة «رأيت» جواب إذا «نعيما» لا يوصف «وملكا كبيرا» واسعا لا غاية له.","ar.qurtubi":"قوله تعالى : وإذا رأيت ثم رأيت نعيما وملكا كبيرا ثم : ظرف مكان أي هناك في الجنة ، والعامل في ( ثم ) معنى رأيت أي وإذا رأيت ببصرك ثم . وقال الفراء : في الكلام ما مضمرة ; أي وإذا رأيت ما ثم ; كقوله تعالى : لقد تقطع بينكم أي ما بينكم . وقال الزجاج : ما موصولة ب \" ثم \" على ما ذكره الفراء ، ولا يجوز إسقاط الموصول وترك الصلة ، ولكن رأيت يتعدى في المعنى إلى ثم والمعنى : إذا رأيت ببصرك ثم ويعني ب ثم الجنة ، وقد ذكر الفراء هذا أيضا . والنعيم : سائر ما يتنعم به . والملك الكبير : استئذان الملائكة عليهم ; قال السدي وغيره ، قال الكلبي : هو أن يأتي الرسول من عند الله بكرامة من الكسوة والطعام والشراب والتحف إلى ولي الله وهو في منزله ، فيستأذن عليه ; فذلك الملك العظيم . وقاله مقاتل بن سليمان . وقيل : الملك الكبير : هو أن يكون لأحدهم [ ص: 127 ] سبعون حاجبا ، حاجبا دون حاجب ، فبينما ولي الله فيما هو فيه من اللذة والسرور إذ يستأذن عليه ملك من عند الله ، قد أرسله الله بكتاب وهدية وتحفة من رب العالمين لم يرها ذلك الولي في الجنة قط ، فيقول للحاجب الخارج : استأذن على ولي الله فإن معي كتابا وهدية من رب العالمين . فيقول هذا الحاجب للحاجب الذي يليه : هذا رسول من رب العالمين ، معه كتاب وهدية يستأذن على ولي الله ; فيستأذن كذلك حتى يبلغ إلى الحاجب الذي يلي ولي الله فيقول له : يا ولي الله ! هذا رسول من رب العالمين يستأذن عليك ، معه كتاب وتحفة من رب العالمين أفيؤذن له ؟ فيقول : نعم ! فأذنوا له . فيقول ذلك الحاجب الذي يليه : نعم فأذنوا له . فيقول الذي يليه للآخر كذلك حتى يبلغ الحاجب الآخر . فيقول له : نعم أيها الملك ; قد أذن لك ، فيدخل فيسلم عليه ويقول : السلام يقرئك السلام ، وهذه تحفة ، وهذا كتاب من رب العالمين إليك . فإذا هو مكتوب عليه : من الحي الذي لا يموت إلى الحي الذي يموت . فيفتحه فإذا فيه : سلام على عبدي ووليي ورحمتي وبركاتي ، يا وليي أما آن لك أن تشتاق إلى رؤية ربك ؟ فيستخفه الشوق فيركب البراق فيطير به البراق شوقا إلى زيارة علام الغيوب ، فيعطيه ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر . وقال سفيان الثوري : بلغنا أن الملك الكبير تسليم الملائكة عليهم ; دليله قوله تعالى : والملائكة يدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار وقيل : الملك الكبير كون التيجان على رؤوسهم كما تكون على رأس ملك من الملوك . وقال الترمذي الحكيم : يعني ملك التكوين ، فإذا أرادوا شيئا قالوا له كن . وقال أبو بكر الوراق : ملك لا يتعقبه هلك . وفي الخبر عن النبي - صلى الله عليه وسلم - : \" إن الملك الكبير هو - أن - أدناهم منزلة ينظر في ملكه مسيرة ألفي عام ، يرى أقصاه كما يرى أدناه \" قال : \" وإن أفضلهم منزلة من ينظر في وجه ربه تعالى كل يوم مرتين \" سبحان المنعم .\n","ar.miqbas":"وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًا وَمُلْكًا كَبِيرًا (20)الخطاب لغير معين . و { ثَمّ } إشارة إلى المكان ولا يكون إلاّ ظرفاً والمشار إليه هنا ما جرى ذكره أعني الجنة المذكورة في قوله : { وجزاهم بما صبروا جَنة } [ الإنسان : 12 ] .وفعل { رأيتَ } الأول منزل منزلة اللازم يدل على حصول الرؤية فقط لا تعلُّقِها بمرئي ، أي إذا وجهت نظرك ، و { رأيتَ } الثاني جواب { إذا } ، أي إذا فتحت عينك ترى نعيماً .والتقييد ب { إذا } أفاد معنى الشرطية فدل على أن رؤية النعيم لا تتخلف عن بصر المبصر هنالك فأفاد معنى : لا ترى إلاّ نعيماً ، أي بخلاف ما يرى في جهات الدنيا .وفي قوله : { ومُلْكاً كبيراً } تشبيه بليغ ، أي مثل أحوال المُلك الكبير المتنعِّم ربه .وفائدة هذا التشبيه تقريب المشبه لِمدارك العقول .والكبير مستعار للعظيم وهو زائد على النعيم بما فيه من رفعة وتذليل للمصاعب .\n","ar.waseet":"( وَإِذَا رَأَيْتَ ثَمَّ ) وثم هنا ظرف مكان مختص بالبعيد ، وهو منصوب على الظرفية ، ومفعول الرؤية غير مذكور ، لأن القصد : وإذا صدرت منك - أيها المخاطب رؤية إلى هناك ، أى : إلى الجنة ونعيمها .. ( رَأَيْتَ نَعِيماً ) لا يقادر قدره ( وَمُلْكاً كَبِيراً ) أى : واسعا لا غاية له .فقوله - سبحانه - ( رَأَيْتَ ) الثانية ، جواب إذا . والمشار إليه \" بِثَمَّ \" التى هى بمعنى هناك معلوم من المقام ، لأن المقصود به الجنة التى سبق الحديث عنها فى مثل قوله : ( وَجَزَاهُمْ بِمَا صَبَرُواْ جَنَّةً وَحَرِيراً ) أى : وإذا سرحت ببصرك إلى هناك رأيت نعيما وملكا كبيرا .\n","ar.baghawi":"\"وإذا رأيت ثم\"، أي إذا رأيت ببصرك ونظرت به ثم يعني في الجنة، \"رأيت نعيماً\"، لا يوصف، \"وملكاً كبيراً\"، وهو أن أدناهم منزلة ينظر إلى ملكه في مسيرة ألف عام يرى أقصاه كما يرى أدناه.وقال مقاتل والكلبي: هو أن رسول الله رب العزة من الملائكة لا يدخل عليه إلا بإذنه.وقيل: ملكاً لا زوال له.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5611.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5611.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5611.mp3","format":"mp3","local_path":null}}},{"verse":21,"arabic":"عَالِيَهُمْ ثِيَابُ سُنْدُسٍ خُضْرٌ وَإِسْتَبْرَقٌ ۖ وَحُلُّوا أَسَاوِرَ مِنْ فِضَّةٍ وَسَقَاهُمْ رَبُّهُمْ شَرَابًا طَهُورًا","transliteration":"'Aaliyahum siyaabu sundusin khudrunw wa istabraq, wa hullooo asaawira min fiddatinw wa saqaahum Rabbuhum sharaaban tahooraa","translations":{"en.ahmedali":"On their bodies will be garments of the finest green silk and brocade, and they will be adorned with bracelets of silver; and their Lord will give them a purest draught to drink.","en.ahmedraza":"In it they adorn clothes of fine green silk and gold embroidery; and they are given silver bracelets to wear; and their Lord gave them pure wine to drink.","en.arberry":"Upon them shall be green garments of silk and brocade; they are adorned with bracelets of silver, and their Lord shall give them to drink a pure draught.","en.asad":"Upon those [blest] will be garments of green silk and brocade; and they will be adorned with bracelets of silver. And their Sustainer will them to drink of a drink most pure.","en.daryabadi":"Upon them shall be garments of fine green silk and of brocades. And adorned they shall be with bracelets of silver: and their Lord shall give them drink a beverage pure.","en.hilali":"Their garments will be of fine green silk, and gold embroidery. They will be adorned with bracelets of silver, and their Lord will give them a pure drink.","en.pickthall":"Their raiment will be fine green silk and gold embroidery. Bracelets of silver will they wear. Their Lord will slake their thirst with a pure drink.","en.qaribullah":"Upon them there will be garments of green silk, rich brocade, and they will be adorned with bracelets of silver. Their Lord will give them a pure beverage to drink.","en.sahih":"Upon the inhabitants will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink.","en.sarwar":"They will have fine green silk and brocade, and they will be decked with bracelets of silver. Their Lord will provide them with a drink of pure wine.","en.yusufali":"Upon them will be green Garments of fine silk and heavy brocade, and they will be adorned with Bracelets of silver; and their Lord will give to them to drink of a Wine Pure and Holy.","en.maududi":"They [i.e., the virtuous] shall be attired in garments of fine green silk and rich brocade and will be adorned with bracelets of silver. Their Lord will give them a pure wine to drink.","en.shakir":"Upon them shall be garments of fine green silk and thick silk interwoven with gold, and they shall be adorned with bracelets of silver, and their Lord shall make them drink a pure drink.","en.itani":"Upon them are garments of green silk, and satin. And they will be adorned with bracelets of silver. And their Lord will offer them a pure drink.","en.mubarakpuri":"Their garments will be of fine green silk, and Istabraq. They will be adorned with bracelets of silver, and their Lord will give them a purifying drink.","en.qarai":"Upon them will be cloaks of green silk and brocade and they will be adorned with bracelets of silver. Their Lord will give them to drink a pure drink.","en.wahiduddin":"they will wear green garments of fine silk and rich brocade. They will be adorned with silver bracelets. And their Lord will give them a pure drink."},"tafsir":{"ar.muyassar":"يعلوهم ويجمل أبدانهم ثياب بطائنها من الحرير الرقيق الأخضر، وظاهرها من الحرير الغليظ، ويُحَلَّون من الحليِّ بأساور من الفضة، وسقاهم ربهم فوق ذلك النعيم شرابًا لا رجس فيه ولا دنس.","ar.jalalayn":"«عاليهم» فوقهم فنصبه على الظرفية وهو خبر لمبتدأ بعده وفي قراءة بسكون الياء مبتدأ وما بعده خبر والضمير المتصل به للمعطوف عليهم «ثياب سندس» حرير «خضر» بالرفع «وإستبرق» بالجر ما غلظ من الديباج فهو البطائن والسندس الظهائر وفي قراءة عكس ما ذكر فيهما وفي أخرى، برفعهما وفي أخرى بجرهما «وحلُّوا أساور من فضة» وفي موضع من ذهب للايذان بأنهم يحلون من النوعين معا ومفرقا «وسقاهم ربهم شرابا طهورا» مبالغة في طهارته ونظافته بخلاف خمر الدنيا.","ar.qurtubi":"قوله تعالى : عاليهم ثياب سندس خضر وإستبرق قرأ نافع وحمزة وابن محيصن عاليهم ساكنة الياء ، واختاره أبو عبيد اعتبارا بقراءة ابن مسعود وابن وثاب وغيرهما عاليتهم وبتفسير ابن عباس : أما رأيت الرجل عليه ثياب يعلوها أفضل منها . الفراء : وهو مرفوع بالابتداء وخبره ثياب سندس واسم الفاعل يراد به الجمع . ويجوز في قول الأخفش أن يكون إفراده على أنه اسم فاعل متقدم و ( ثياب ) مرتفعة به وسدت مسد الخبر ، والإضافة فيه في تقدير الانفصال لأنه لم يخص ، وابتدئ به لأنه اختص بالإضافة . وقرأ الباقون عاليهم بالنصب . وقال الفراء : هو كقولك فوقهم ، والعرب تقول : قومك داخل الدار فينصبون داخل على الظرف ، لأنه محل . وأنكر الزجاج هذا وقال : هو مما لا نعرفه في [ ص: 128 ] الظروف ، ولو كان ظرفا لم يجز إسكان الياء . ولكنه بالنصب على الحال من شيئين : أحدهما الهاء والميم في قوله : يطوف عليهم أي على الأبرار ولدان عاليا الأبرار ثياب سندس ; أي يطوف عليهم في هذه الحال ، والثاني : أن يكون حالا من الولدان ; أي إذا رأيتهم حسبتهم لؤلؤا منثورا في حال علو الثياب أبدانهم . وقال أبو علي : العامل في الحال إما لقاهم نضرة وسرورا وإما جزاهم بما صبروا قال : ويجوز أن يكون ظرفا فصرف .المهدوي : ويجوز أن يكون اسم فاعل ظرفا ; كقولك هو ناحية من الدار ، وعلى أن عاليا لما كان بمعنى فوق أجري مجراه فجعل ظرفا . وقرأ ابن محيصن وابن كثير وأبو بكر عن عاصم ( خضر ) بالجر على نعت السندس ( وإستبرق ) بالرفع نسقا على الثياب ، ومعناه عاليهم [ ثياب ] سندس وإستبرق . وقرأ ابن عامر وأبو عمرو ويعقوب خضر رفعا نعتا للثياب ( وإستبرق ) بالخفض نعتا للسندس ، واختاره أبو عبيد وأبو حاتم لجودة معناه ; لأن الخضر أحسن ما كانت نعتا للثياب فهي مرفوعة ، وأحسن ما عطف الإستبرق على السندس عطف جنس على جنس ، والمعنى : عاليهم ثياب خضر من سندس وإستبرق ، أي من هذين النوعين .وقرأ نافع وحفص كلاهما بالرفع ويكون خضر نعتا للثياب ; لأنهما جميعا بلفظ الجمع ( وإستبرق ) عطفا على الثياب . وقرأ الأعمش وابن وثاب وحمزة والكسائي كلاهما بالخفض ويكون قوله : ( خضر ) نعتا للسندس ، والسندس اسم جنس ، وأجاز الأخفش وصف اسم الجنس بالجمع على استقباح له ; وتقول : أهلك الناس الدينار الصفر والدرهم البيض ; ولكنه مستبعد في الكلام . والمعنى على هذه القراءة : عاليهم ثياب سندس خضر وثياب إستبرق . وكلهم صرف الإستبرق ، إلا ابن محيصن ، فإنه فتحه ولم يصرفه فقرأ ( وإستبرق ) نصبا في موضع الجر ، على منع الصرف ، لأنه أعجمي ، وهو غلط ; لأنه نكرة يدخله حرف التعريف ; تقول الإستبرق إلا أن يزعم [ ابن محيصن ] أنه قد يجعل علما لهذا الضرب من الثياب . وقرئ ( واستبرق ) بوصل الهمزة والفتح على أنه سمي باستفعل من البريق ، وليس بصحيح أيضا ، لأنه معرب مشهور تعريبه ، وأن أصله استبرك والسندس : ما رق من الديباج . والإستبرق : ما غلظ منه . وقد تقدم .قوله تعالى : وحلوا عطف على ويطوف . أساور من فضة وفي سورة فاطر يحلون فيها من أساور من ذهب وفي سورة الحج يحلون فيها من أساور من ذهب ولؤلؤا ، فقيل : حلي الرجل الفضة وحلي المرأة الذهب . وقيل : تارة يلبسون الذهب وتارة يلبسون الفضة . وقيل : يجمع في يد أحدهم سواران من ذهب وسواران من فضة وسواران من لؤلؤ ، ليجتمع لهم محاسن الجنة ; قاله سعيد بن المسيب . وقيل : أي لكل قوم ما تميل إليه [ ص: 129 ] نفوسهم .وسقاهم ربهم شرابا طهورا قال علي - رضي الله عنه - في قوله تعالى : وسقاهم ربهم شرابا طهورا قال : إذا توجه أهل الجنة إلى الجنة مروا بشجرة يخرج من تحت ساقها عينان ، فيشربون من إحداهما ، فتجري عليهم بنضرة النعيم ، فلا تتغير أبشارهم ، ولا تتشعث أشعارهم أبدا ، ثم يشربون من الأخرى ، فيخرج ما في بطونهم من الأذى ، ثم تستقبلهم خزنة الجنة فيقولون لهم : سلام عليكم طبتم فادخلوها خالدين . وقال النخعي وأبو قلابة : هو إذا شربوه بعد أكلهم طهرهم ، وصار ما أكلوه وما شربوه رشح مسك ، وضمرت بطونهم . وقال مقاتل : هو من عين ماء على باب الجنة ، تنبع من ساق شجرة ، من شرب منها نزع الله ما كان في قلبه من غل وغش وحسد ، وما كان في جوفه من أذى وقذر . وهذا معنى ما روي عن علي ، إلا أنه في قول مقاتل عين واحدة وعليه فيكون فعولا للمبالغة ، ولا يكون فيه حجة للحنفي أنه بمعنى الطاهر . وقد مضى بيانه في سورة ( الفرقان ) والحمد لله . وقال طيب الجمال : صليت خلف سهل بن عبد الله العتمة فقرأ وسقاهم ربهم شرابا طهورا وجعل يحرك شفتيه وفمه ، كأنه يمص شيئا ، فلما فرغ قيل له : أتشرب أم تقرأ ؟ فقال : والله لو لم أجد لذته عند قراءته كلذته عند شربه ما قرأته .\n","ar.miqbas":"عَالِيَهُمْ ثِيَابُ سُنْدُسٍ خُضْرٌ وَإِسْتَبْرَقٌ وَحُلُّوا أَسَاوِرَ مِنْ فِضَّةٍ وَسَقَاهُمْ رَبُّهُمْ شَرَابًا طَهُورًا (21)هذه الأشياء من شعار الملوك في عرف الناس زَمانَئِذ ، فهذا مرتبط بقوله { ومُلكاً كبيراً } [ الإنسان : 20 ] .وقرأ نافع وحمزة وأبو جعفر { عَاليهم } بسكون الياء على أن الكلام جملة مستأنفة استئنافاً بيانياً لجملة { رأيْتَ نعيماً ومُلْكاً كبيراً } [ الإنسان : 20 ] ، ف { عاليهم } مبتدأ و { ثياب سندس } فاعلُه سادٌّ مسدّ الخبر وقد عمل في فاعله وإن لم يكن معتمداً على نفي أو استفهام أو وصف ، وهي لغة خَبير بنو لهب وتكون الجملة في موضع البيان لجملة : { رأيت نعيماً } [ الإنسان : 20 ] .وقرأ بقية العشرة { عَاليَهم } بفتح التحتية على أنه حال مفرد ل { الأبرار } [ الإنسان : 5 ] ، أي تلك حالة أهل الملك الكبير .وإضافة { ثياب } إلى { سندس } بيانية مثل : خَاتَم ذَهَببِ ، وثَوْببِ خَزَ ، أي منه .والسندس : الديباج الرقيق .والإستبرق : الديباج الغليظ وتقدما عند قوله تعالى : { ويلبسون ثياباً خضراً من سندس وإستبرق } في سورة الكهف ( 31 ) وهما معرَّبان .فأما السندس فمعرب عن اللغة الهندية وأصله ( سندون ) بنون في آخره ، قيل : إن سبب هذه التسمية أنه جلب إلى الإِسكندر ، وقيل له : إن اسمه ( سندون ) فصيره للغة اليونان سندوس ( لأنهم يكثرون تنهية الأسماء بحرف السين ) وصيّره العرب سُندساً . وفي اللسان } : أن السندس يتخذ من المِرْعِزَّى ( كذا ضبطه مصححه ) والمعروف المِرْعِز كما في «التذكرة» و«شفاء الغليل» . وفي «التذكرة» المِرْعز : ما نَعُم وطال من الصوف اه . فلعله صوف حيوان خاص فيه طول أو هو من نوع الشعَر ، والظاهر أنه لا يكون إلاّ أخضر اللون لقول يزيد بن حذاق العبدي يصف مرعى فَرسه :وداوَيْتُها حتى شَتَتْ حَبَشِيَّةً ... كأنَّ عليها سُندساً وسُدُوساًأي في أرض شديدة الخضرة كلون الحَبشي . وفي «اللسان» : السدوس الطيلسان الأخضر . ولقول أبي تمَّام يرثي محمد بن حميد النبهاني الطوسي :تَرَدَّى ثيَابَ الموتتِ حُمْراً فما أتَى ... لها الليلُ إلاَّ وهْيَ من سُندس خُضْرُوأما الإِستبرق فنسج من نسج الفرس واسمه فارسي ، وأصله في الفارسية : استقره .والمعنى : أن فوقهم ثياباً من الصنفين يلبسون هذا وذاك جمعاً بين محاسن كليهما ، وهي أفخر لباس الملوك وأهل الثروَة .ولون الأخضر أمتع للعين وكان من شعار الملوك ، قال النابغة يمدح ملوك غسان :يَصونُون أجْساداً قديما نعيمها ... بخَالصةِ الأردَان خُضْر المَنَاكِبوالظاهر أن السندس كان لا يصبغ إلاّ أخضر اللون .وقرأ نافع وحفص { خضرٌ } بالرفع على الصفة ل { ثياب } . و { إستبرقٌ بالرفع أيضاً على أنه معطوف على ثياب } بقيد كونها من سندس فمعنى عاليهم إستبرق : أن الإِستبرق لباسُهم .وقرأ ابن كثير وأبو بكر عن عاصم { خُضْرٍ } بالجر نعتاً ل { سندس ، } و { إستبرق } بالرفع عطفاً على { ثياب .وقرأ ابن عامر وأبو عمرو وأبو جعفر ويعقوب خُضْرٌ } بالرفع و { إستبرقٍ } بالجر عطفاً على { سندس } بتقدير : وثياب إستبرق .وقرأ حمزة والكسائي { خُضرٍ } بالجر نعتاً ل { سندسٍ } باعتبار أنه بيان للثياب فهو في معنى الجمع . وقرأ و { إستبرقٍ } بالجر عطفاً على { سندس .والأساور : جمع سِوار وهو حَلي شكله اسطواني فارغ الوسط يلبسه النساء في معاصمهن ولا يلبسه الرجال إلاّ الملوك ، وقد ورد في الحديث ذكر سواري كسْرى .والمعنى : أن حال رجال أهل الجنة حال الملوك ومعلوم أن النساء يتحلّيْنَ بأصناف الحلي .ووصفت الأساور هنا بأنها من فضة . } وفي سورة الكهف ( 31 ) بأنها { من ذهب } في قوله : يُحلَّون فيها من أساور من ذهب ، أي مرة يحلَّون هذه ومرة الأخرى ، أو يحلونهما جميعاً بأن تجعل متزاوجة لأن ذلك أبْهج منظراً كما ذكرناه في تفسير قوله : { كانت قواريرا قواريرا من فضة } [ الإنسان : 15 ، 16 ] .هذا احتراس مما يوهمه شُربهم من الكأس الممزوجة بالكافور والزنجبيل من أن يكون فيها ما في أمثالها المعروفة في الدنيا ومن الغَوْل وسوءِ القول والهذيان ، فعبر عن ذلك بكون شرابهم طَهوراً بصيغة المبالغة في الطهارة وهي النزاهة من الخبائث ، أي منزهاً عما في غيره من الخباثة والفساد .وأسند سقيه إلى ربهم إظهاراً لكرامتهم ، أي أمر هو بسقيهم كما يقال : أطعَمهم ربُّ الدار وسقاهم .\n","ar.waseet":"ثم فصل - سبحانه - جانبا من مظاهر هذا النعيم العظيم فقال ( عَالِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌ وَإِسْتَبْرَقٌ وحلوا أَسَاوِرَ مِن فِضَّةٍ وَسَقَاهُمْ رَبُّهُمْ شَرَاباً طَهُوراً )وقوله ( عَالِيَهُم ) بفتح الياء وضم الهاء - بمعنى فوقهم ، فهو ظرف خبر مقدم ، وثياب مبتدأ مؤخر ، كأنه قيل : فوقهم ثياب ويصح أن يكون حالا للأبرار . أى : تلك حال أهل النعيم والملك الكبير وهم الأبرار .وقرأ نافع وحمزة ( عاليهم ) - بسكون الياء وكسر الهاء - على أن الكلام جملة مستأنفة استنئافا بيانياً ، لقوله - تعالى - ( رَأَيْتَ نَعِيماً وَمُلْكاً كَبِيراً ) ، ويكون لفظ ( عَالِيَهُمْ ) اسم فاعل مبتدأ .وقوله : ( ثِيَابُ سُندُسٍ ) فاعله ساد مسد الخبر ، ويصح أن يكون خبرا مقدما ، وما بعده مبتدأ مؤخر .وإضافة الثياب إلى السندس بيانية ، مثل : خاتم ذهب والسندس : الديباج الرقيق . والاستبرق : الديباج الغليظ .والمعنى : أن هؤلاء الأبرار ، أصحاب النعيم المقيم ، والملك الكبير ، فوق أجسادهم ثياب من أفخر الثياب ، لأنهم يجمعون فى لباسهم بين الديباج الرقيق ، والديباج الغليظ ، على سبيل التنعيم والجمع بين محاسن الثياب .وكانت تلك الملابس من اللون الأخضر ، لأنها أبهج للنفس ، وشعار لباس الملوك .وكلمة : \" خضر \" قرأها بعضهم بالرفع على أنها صفة لثياب ، وقرأها البعض الآخر بالجر ، على أنها صفة لسندس . وكذلك كلمة \" وإستبرق \" قرئت بالرفع عطفا على ثياب ، وقرئت بالجر عطفا على سندس .وقوله : ( وحلوا أَسَاوِرَ مِن فِضَّةٍ ) بيان لما يتزينون به فى أيديهم ، أى أن هؤلاء الأبرار يلبسون فى أيديهم أساور من فضة ، كما هو الشأن بالنسبة للملوك فى الدنيا ، ومنه ما ورد فى الحديث من ذكر سوارى كسرى .وقوله - تعالى - : ( وَسَقَاهُمْ رَبُّهُمْ شَرَاباً طَهُوراً ) أى : وفضلا عن كل تلك الملابس الفاخرة سقاهم ربهم - بفضله وإحسانه - شرابا بالغاً نهاية الطهر ، فهو ليس كخمر الدنيا ، فيه الكثير من المساوئ التى تؤدى إلى ذهاب العقول . . وإنما خمر الآخرة : شراب لذيذ طاهر من كل خبث وقذر وسوء .وجاء لفظ \" طهورا \" بصيغة المبالغة ، للإِشعار بأن هذا الشراب قد بلغ النهاية فى الطهارة .\n","ar.baghawi":"\"عاليهم ثياب سندس\"، قرأ أهل المدينة وحمزة: \"عاليهم\" ساكنة الياء مكسورة الهاء، فيكون في موضع رفع بالابتداء، وخبره: ثياب سندس، وقرأ الآخرون بنصب الياء وضم الهاء على الصفة، أي فوقهم، وهو نصب على الظرف \"ثياب سندس خضر وإستبرق\"، قرأ نافع وحفص \"خضر وإستبرق\" مرفوعاً عطفاً على الثياب، وقرأهما حمزة والكسائي مجرورين، وقرأ ابن كثير وأبو بكر خضر بالجر وإستبرق، بالرفع، وقرأ أبو جعفر وأهل البصرة والشام على ضده فالرفع على نعت الثياب والجر على نعت السندس وإستبرق بالرفع على أنه معطوف على وثياب إستبرق فحذف المضاف وأقام المضاف إليه مقامه كقوله \" واسأل القرية \" أي أهل القرية، ومثله قوله: خز أي ثوب خز، وأما جر إستبرق فعلى أنه معطوف على سندس وهو جر بإضافة الثياب إليه، وهما جنسان أضيفت الثياب إليهما كما تقول: ثوب خز وكتان فتضيفه إلى الجنسين. \"وحلوا أساور من فضة وسقاهم ربهم شراباً طهوراً\"، قيل: طاهراً من الأقذار والأقذاء لم تدنسه الأيدي والأرجل كخمر الدنيا.وقال أبو قلابة وإبراهيم: إنه لا يصير بولاً نجساً ولكنه يصير رشحاً في أبدانهم، ريحه كريح المسك، وذلك أنهم يؤتون بالطعام، فإذا كان آخر ذلك أتوا بالشراب الطهور، فيشربون فيطهر بطونهم ويصير ما أكلوا رشحاً يخرج من جلودهم ريحاً أطيب من المسك الإذفر، وتضمر بطونهم وتعود شهوتهم. وقال مقاتل: هو عين ماء على باب الجنة من شرب منها نزع الله ما كان في قلبه من غل وغش وحسد.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5612.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5612.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5612.mp3","format":"mp3","local_path":null}}},{"verse":22,"arabic":"إِنَّ هَٰذَا كَانَ لَكُمْ جَزَاءً وَكَانَ سَعْيُكُمْ مَشْكُورًا","transliteration":"Innaa haazaa kaana lakum jazz 'anw wa kaana sa'yukum mashkooraa","translations":{"en.ahmedali":"\"This in truth is your recompense, and acceptance of your endeavours.\"","en.ahmedraza":"It will be said to them, “This is your reward – indeed your efforts have been appreciated.”","en.arberry":"Behold, this is a recompense for you, and your striving is thanked.'","en.asad":"[And they will be told:] \"Verily, all this is your reward since Your endeavour [in life] has met [God's] goodly acceptance!\"","en.daryabadi":"Verily this is for you by way of recompense, and your endeavour hath been accepted.","en.hilali":"(And it will be said to them): \"Verily, this is a reward for you, and your endeavour has been accepted.\"","en.pickthall":"(And it will be said unto them): Lo! this is a reward for you. Your endeavour (upon earth) hath found acceptance.","en.qaribullah":"'See, this is your recompense, your striving is thanked'","en.sahih":"[And it will be said], \"Indeed, this is for you a reward, and your effort has been appreciated.\"","en.sarwar":"This will be their reward and their efforts will be appreciated.","en.yusufali":"\"Verily this is a Reward for you, and your Endeavour is accepted and recognised.\"","en.maududi":"Behold, this is your recompense and your endeavour has been appreciated.","en.shakir":"Surely this is a reward for you, and your striving shall be recompensed.","en.itani":"“This is a reward for you. Your efforts are well appreciated.”","en.mubarakpuri":"(And it will be said to them): \"Verily, this is a reward for you, and your endeavor has been accepted.\"","en.qarai":"[They will be told]: ‘This is your reward, and your efforts have been well-appreciated.’","en.wahiduddin":"This is your reward. Your endeavour is fully acknowledged."},"tafsir":{"ar.muyassar":"ويقال لهم: إن هذا أُعِدَّ لكم مقابل أعمالكم الصالحة، وكان عملكم في الدنيا عند الله مرضيًا مقبولا.","ar.jalalayn":"«إن هذا» النعيم «كان لكم جزاءً وكان سعيكم مشكورا».","ar.qurtubi":"قوله تعالى : إن هذا كان لكم جزاء أي يقال لهم : إنما هذا جزاء لكم أي ثواب . وكان سعيكم أي عملكم مشكورا أي من قبل الله ، وشكره للعبد قبول طاعته ، وثناؤه عليه ، وإثابته إياه . وروى سعيد عن قتادة قال : غفر لهم الذنب وشكر لهم الحسنى . وقال مجاهد : مشكورا أي مقبولا والمعنى متقارب ; فإنه سبحانه إذا قبل العمل شكره ، فإذا شكره أثاب عليه بالجزيل ; إذ هو سبحانه ذو الفضل العظيم . روي عن ابن عمر : أن رجلا حبشيا قال : يا رسول الله ! فضلتم علينا بالصور والألوان والنبوة ، أفرأيت إن آمنت بما آمنت به ، وعملت بما عملت ، أكائن أنا معك في الجنة ؟ قال : \" نعم والذي نفسي بيده إنه ليرى بياض الأسود في الجنة وضياؤه من مسيرة ألف عام \" ثم قال النبي - صلى الله عليه وسلم - : \" من قال لا إله إلا الله كان له بها عند الله عهد ، ومن قال سبحان الله والحمد لله كان له بها عند الله مائة ألف حسنة وأربعة وعشرون ألف حسنة \" ، فقال الرجل : كيف نهلك بعدها يا رسول الله ؟ فقال : \" إن الرجل ليأتي يوم القيامة بالعمل لو وضعه على جبل لأثقله . فتجيء النعمة من نعم الله فتكاد أن تستنفد ذلك كله إلا أن يلطف الله برحمته \" .قال : ثم نزلت هل أتى على الإنسان حين من الدهر إلى قوله : وملكا كبيرا قال الحبشي : يا رسول الله ! وإن عيني لترى ما ترى عيناك في الجنة ؟ فقال النبي - صلى الله عليه وسلم - : \" نعم \" فبكى الحبشي حتى فاضت نفسه . وقال ابن عمر : فلقد رأيت رسول الله - صلى الله عليه وسلم - يدليه في حفرته ويقول : إن هذا كان لكم جزاء وكان سعيكم مشكورا قلنا : [ ص: 130 ] يا رسول الله وما هو ؟ قال : \" والذي نفسي بيده لقد أوقفه الله ثم قال أي عبدي لأبيضن وجهك ولأبوئنك من الجنة حيث شئت ، فنعم أجر العاملين \" .\n","ar.miqbas":"إِنَّ هَذَا كَانَ لَكُمْ جَزَاءً وَكَانَ سَعْيُكُمْ مَشْكُورًا (22)هذا الكلام مقول قول محذوف قرينته الخطاب إذ ليس يصلح لهذا الخطاب مما تقدم من الكلام إلاّ أن يكون المخاطَبون هم الأبرارَ الموصوفَ نعيمهم .والقول المحذوف يقدر فعلاً في موضع الحال من ضمير الغائب في { سقاهم } [ الإنسان : 21 ] ، نحو : يُقال لهم ، أو يَقول لهم ربهم ، أو يقدر اسماً هو حال من ذلك الضمير نحو : مَقولاً لهم هذا اللفظ ، أو قائلاً لهم هذا اللفظ .والإِشارة إلى ما يكون حاضراً لديهم من ألوان النعيم الموصوف فيما مضى من الآيات .والمقصود من ذلك الثناء عليهم بما أسلفوا من تقوى الله وتكرمتهم بذلك وتنشيط أنفسهم بأن ما أنعم به عليهم هو حق لهم جزاء على عملهم .وإقحام فعل { كان } للدلالة على تحقيق كونه جزاء لا منًّا عليهم بما لم يستحقوا ، فإن من تمام الإِكرام عند الكرام أن يُتبعوا كرامتهم بقول ينشط له المكرَم ويزيل عنه ما يعرض من خجل ونحوه ، أي هو جزاء حقاً لا مبالغة في ذلك .وعطف على ذلك قوله : { وكان سعيكم مشكوراً } علاوة على إيناسهم بأن ما أغدق عليهم كان جزاء لهم على ما فعلوا بأن سعيهم الذي كان النعيمُ جزاء عليه ، هو سعي مشكور ، أي مشكور ساعِيه ، فأسند المشكور إلى السعي على طريقة المجاز العقلي مثل قولهم : سَيْل مُفْعَم .ولك أن تجعل { مشكوراً } مفعولاً حقيقة عقلية لكن على طريقة الحذف والإِيصال ، أي مشكوراً عليه .وإقحام فعل { كان } كإقحام نظيره آنفاً .\n","ar.waseet":"ثم ختم - سبحانه - هذا العطاء الواسع العظيم ، ببيان ما ستقوله الملائكة لهؤلاء الأبرار على سبيل التكريم والتشريف ، فقال : ( إِنَّ هذا كَانَ لَكُمْ جَزَآءً وَكَانَ سَعْيُكُم مَّشْكُوراً ) .وهذه الآية الكريمة مقول لقول محذوف ، والقائل هو الله - تعالى - أو ملائكته بأمره - سبحانه - وإذنه ، أى : سقاهم ربهم شرابا طهورا فى الآخرة ، ويقال لهم عند تمتعهم بكل هذا النعيم ، ( إِنَّ هذا ) النعيم الذى تعيشون فيه ( كَانَ لَكُمْ جَزَآءً ) على إيمانكم وعملكم الصالح فى الدنيا .( وَكَانَ سَعْيُكُم مَّشْكُوراً ) أى : مرضيا ومقبولا عند خالقكم ، فازدادو - أيها الأبرار - سرورا على سروركم ، وبهجة على بهجتكم .وبعد هذا التفصيل لما أعده الله - تعالى - لعباده الأخيار من أصناف النعيم ، المتعلق بمأكلهم ، ومشربهم . . أخذت السورة الكريمة . فى أواخرها - فى تثبيت النبى صلى الله عليه وسلم وأصحابه . وفى دعوته صلى الله عليه وسلم إلى المداومة على التحلى بفضيلة الصبر ، وإلى الإِكثار من ذكره - تعالى - وأنذرت الكافرين والفاسقين إذا ما استمروا فى ضلالهم . فقال - تعالى - :( فَقَدَرْنَا فَنِعْمَ . . . ) .\n","ar.baghawi":"\"إن هذا كان لكم جزاءً وكان سعيكم مشكوراً\"، أي ما وصف من نعيم الجنة كان لكم جزاء بأعمالكم، وكان سعيكم عملكم في الدنيا بطاعة الله مشكوراً، قال عطاء: شكرتم عليه فأثيبكم أفضل الثواب.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5613.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5613.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5613.mp3","format":"mp3","local_path":null}}},{"verse":23,"arabic":"إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ الْقُرْآنَ تَنْزِيلًا","transliteration":"Innaa nahnu nazzalnaa 'alaikal quraana tanzeelaa","translations":{"en.ahmedali":"We have revealed the Qur'an to you gradually;","en.ahmedraza":"Indeed We have sent down the Qur’an upon you, in stages.","en.arberry":"Surely We have sent down the Koran on thee, a sending down;","en.asad":"VERILY, [O believer,] it is We who have bestowed from on high this Qur’an upon thee, step by step - truly a bestowal from on high!","en.daryabadi":"Verily We! it is We Who have revealed Unto thee the Qur'an, a gradual revelation.","en.hilali":"Verily! It is We Who have sent down the Quran to you (O Muhammad SAW) by stages.","en.pickthall":"Lo! We, even We, have revealed unto thee the Qur'an, a revelation;","en.qaribullah":"We have indeed, sent down to you the Koran, a (clear) sending,","en.sahih":"Indeed, it is We who have sent down to you, [O Muhammad], the Qur'an progressively.","en.sarwar":"(Muhammad), We have revealed the Quran to you in gradual steps.","en.yusufali":"It is We Who have sent down the Qur'an to thee by stages.","en.maududi":"(O Prophet), indeed We have revealed the Qur'an to you in portions.","en.shakir":"Surely We Ourselves have revealed the Quran to you revealing (it) in portions.","en.itani":"It is We who sent down the Quran upon you—a gradual revelation.","en.mubarakpuri":"Verily, it is We Who have sent down the Qur'an to you by stages.","en.qarai":"Indeed We have sent down to you the Quran in a gradual descent.","en.wahiduddin":"Truly, it is We who have revealed to you the Quran, a gradual revelation."},"tafsir":{"ar.muyassar":"إنا نحن نَزَّلْنا عليك -أيها الرسول- القرآن تنزيلا من عندنا؛ لتذكر الناس بما فيه من الوعد والوعيد والثواب والعقاب.","ar.jalalayn":"«إنا نحن» تأكيد لاسم إن أو فصل «نزلنا عليك القرآن تنزيلا» خبر إن أي فصلناه ولم ننزله جملة واحدة.","ar.qurtubi":"قوله تعالى : إنا نحن نزلنا عليك القرآن تنزيلا ما افتريته ولا جئت به من عندك ، ولا من تلقاء نفسك ، كما يدعيه المشركون . ووجه اتصال هذه الآية بما قبل أنه سبحانه لما ذكر أصناف الوعد والوعيد ، بين أن هذا الكتاب يتضمن ما بالناس حاجة إليه ، فليس بسحر ولا كهانة ولا شعر ، وأنه حق . وقال ابن عباس : أنزل القرآن متفرقا : آية بعد آية ، ولم ينزل جملة واحدة ; فلذلك قال نزلنا وقد مضى القول في هذا مبينا والحمد لله .\n","ar.miqbas":"إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ الْقُرْآَنَ تَنْزِيلًا (23) من هنا يبتدىء ما لا خلاف في أنه مكي من هذه السورة .وعلى كلا القولين فهذا استئناف ابتدائي ، ويجيء على قول الجمهور أن السورة كلها مكية وهو الأرجح ، أنه استئناف للانتقال من الاستدلال على ثبوت البعث بالحجّة والترهيب والوعيد للكافرين به والترغيب والوعد للمؤمنين به بمرهبّات ومرغّبات هي من الأحوال التي تكون بعد البعث ، فلمّا استوفى ذلك ثُنِي عِنانُ الكلام إلى تثبيت الرسول صلى الله عليه وسلم والربطِ على قلبه لِدفاع أن تلحقه آثارُ الغمّ على تصلب قومه في كفرهم وتكذيبهم بما أُنزل عليه مما شأنه أن يوهن العزيمة البشرية ، فذكَّره الله بأنه نزل عليه الكتاب لئلا يعبأ بتكذيبهم .وفي إيراد هذا بعد طُول الكلام في أحوال الآخرة ، قضاء لحق الاعتناء بأحوال الناس في الدنيا فابتدىء بحال أشرف الناس وهو الرسول صلى الله عليه وسلم ثم بحال الذين دعاهم الرسول صلى الله عليه وسلم بين من { يحبون العاجلة } [ الإنسان : 27 ] ومن { اتخذ إلى ربه سبيلاً } [ الإنسان : 29 ] فأدخلهم في رحمته .وتأكيد الخبر ب ( إنَّ ) للاهتمام به .وتأكيد الضمير المتصل بضمير منفصل في قوله : { إنا نحن } لتقرير مدلول الضمير تأكيداً لفظياً للتنبيه على عظمة ذلك الضمير ليفضي به إلى زيادة الاهتمام بالخبر إذ يتقرر أنه فِعْلُ من ذلك الضميرَاننِ له لأنه لا يفعل إلا فعلاً منوطاً بحكمة وأقصى الصواب .وهذا من الكناية الرمزية ، وبعدُ فالخبر بمجموعه مستعمل في لازم معناه وهو التثبيت والتأييد فمجموعُه كناية ومزية .وإيثار فعل { نزّلنا } الدال على تنزيله منجماً آياتتٍ وسُوراً تنزيلاً مفرقاً إدماجٌ للإِيماء إلى أن ذلك كان من حكمة الله تعالى التي أومأ إليها تأكيد الخبر ب ( إن ) وتأكيدُ الضمير المتصل بالضمير المنفصل ، فاجتمع فيه تأكيد على تأكيد وذلك يفيد مُفاد القصر إذ ليس الحصر والتخصيصُ إلاّ تأكيداً على تأكيد كما قال السكاكي ، فالمعنى : ما نزَّل عليك القرآن إلاّ أنا .وفيه تعريض بالمشركين الذين قالوا : { لولا نزل عليه القرآن جملةً واحدة } [ الفرقان : 32 ] فجعلوا تنزيله مفرقاً شبهة في أنه ليس من عند الله .والمعنى : ما أنزله منجّماً إلاّ أنا واقتضت حكمتي أن أنزله عليك منجّماً .وفرع على هذا التمهيد أمره بالصبر على أعباء الرسالة وما يلقاه فيها من أذى المشركين ، وشدُّ عزيمته أن لا تخور .وسمى ذلك حكماً لأن الرسالة عن الله لا خيرة للمرسَل في قبولها والاضطلاععِ بأمورها ، ولأن ما يحفّ بها من مصاعب إصلاح الأمة وحملِها على ما فيه خيرها في العاجل والآجل ، وتلقي أصناف الأذى في خلال ذلك حتى يتمّ ما أمر الله به ، كالحكم على الرسول بقبوللِ ما يبلغ منتهى الطاقة إلى أجللٍ معين عند الله .وعدي فعل ( اصبر ) باللام لتضمن الصبر معنى الخضوع والطاعة للأمر الشاق ، وقد يعدّى بحرف ( على ) كما قال تعالى :\n","ar.waseet":"جاء قوله - تعالى - : ( إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ القرآن تَنزِيلاً ) مؤكدا بجملة من المؤكدات . منها : إن ، ونحن ، وتنزيلا . . للرد على أولئك الجاحدين الذين أنكروا أن يكون القرآن من عند الله - تعالى - وقالوا فى شأنه : ( لَوْ نَشَآءُ لَقُلْنَا مِثْلَ هذا إِنْ هاذآ إِلاَّ أَسَاطِيرُ الأولين ) أى : إنا نحن - وحدنا - أيها الرسول الكريم - ، والذين نزلنا عليك القرآن تنزيلا محكما ، وفصلناه تفصيلا متقنا ، بأن أنزلناه على قلبك مفرقا على حسب مشيئتنا وحكمتنا .\n","ar.baghawi":"قوله عز وجل: \"إنا نحن نزلنا عليك القرآن تنزيلاً\"، قال ابن عباس: متفرقاً آية بعد آية، ولم ينزل جملة واحدة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5614.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5614.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5614.mp3","format":"mp3","local_path":null}}},{"verse":24,"arabic":"فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تُطِعْ مِنْهُمْ آثِمًا أَوْ كَفُورًا","transliteration":"Fasbir lihukmi Rabbika wa laa tuti' minhum aasiman aw kafooraa","translations":{"en.ahmedali":"So wait for your Lord's command, and do not follow any sinner or disbeliever among them.","en.ahmedraza":"Therefore stay patient upon your Lord’s command, and do not listen to any of the sinners or ingrates among them.","en.arberry":"so be thou patient under the judgment of thy Lord, and obey not one of them, sinner or unbeliever.","en.asad":"Await, then, in all patience thy Sustainer's judgment, and pay no heed to any of them, who is a wilful sinner or an ingrate;","en.daryabadi":"Wherefore persevere thou with the commandment of thy Lord, and obey not thou of them, any sinner or ingrate.","en.hilali":"Therefore be patient (O Muhammad SAW) and submit to the Command of your Lord (Allah, by doing your duty to Him and by conveying His Message to mankind), and obey neither a sinner nor a disbeliever among them.","en.pickthall":"So submit patiently to thy Lord's command, and obey not of them any guilty one or disbeliever.","en.qaribullah":"therefore be patient under the Judgement of your Lord, and do not obey either the sinner or the unbeliever.","en.sahih":"So be patient for the decision of your Lord and do not obey from among them a sinner or ungrateful [disbeliever].","en.sarwar":"So wait patiently for the command of your Lord and do not yield to any sinful or disbelieving person among them (people).","en.yusufali":"Therefore be patient with constancy to the Command of thy Lord, and hearken not to the sinner or the ingrate among them.","en.maududi":"So persevere with the command of your Lord and do not pay any heed to the wicked and the unbelieving,","en.shakir":"Therefore wait patiently for the command of your Lord, and obey not from among them a sinner or an ungrateful one.","en.itani":"So be patient for the decision of your Lord, and do not obey the sinner or the blasphemer among them.","en.mubarakpuri":"Therefore be patient with constancy to the command of your Lord, and obey neither a sinner nor a disbeliever among them.","en.qarai":"So submit patiently to the judgement of your Lord and do not obey any sinner or ingrate from among them,","en.wahiduddin":"So wait patiently for the command of your Lord, and do not yield to anyone among them who is sinful or ungrateful;"},"tafsir":{"ar.muyassar":"فاصبر لحكم ربك القدري واقبله، ولحكمه الديني فامض عليه، ولا تطع من المشركين من كان منغمسًا في الشهوات أو مبالغًا في الكفر والضلال، وداوم على ذكر اسم ربك ودعائه في أول النهار وآخره.","ar.jalalayn":"«فاصبر لحكم ربك» عليك بتبليغ رسالته «ولا تطع منهم» أي الكفار «آثما أو كفورا» أي عتبة بن ربيعة والوليد بن المغيرة قالا للنبي صلى الله عليه وسلم ارجع عن هذا الأمر. ويجوز أن يراد كل آثم وكافر أي لا تطع أحدهما أَيا كان فيما دعاك إليه من إثم أو كفر.","ar.qurtubi":"قوله تعالى : فاصبر لحكم ربك أي لقضاء ربك . وروى الضحاك عن ابن عباس قال : اصبر على أذى المشركين ; هكذا قضيت . ثم نسخ بآية القتال . وقيل : أي اصبر لما حكم به عليك من الطاعات ، أو انتظر حكم الله إذ وعدك أنه ينصرك عليهم ، ولا تستعجل فإنه كائن لا محالة .ولا تطع منهم آثما أي ذا إثم أو كفورا أي لا تطع الكفار . فروى معمر عن قتادة قال : قال أبو جهل : إن رأيت محمدا يصلي لأطأن على عنقه . فأنزل الله - عز وجل - : ولا تطع منهم آثما أو كفورا . ويقال : نزلت في عتبة بن ربيعة والوليد بن المغيرة ، وكانا أتيا رسول الله - صلى الله عليه وسلم - يعرضان عليه الأموال والتزويج ، على أن يترك ذكر النبوة ، ففيهما نزلت : ولا تطع منهم آثما أو كفورا . قال مقاتل : الذي عرض التزويج عتبة بن ربيعة ; قال : إن بناتي من أجمل نساء قريش ، فأنا أزوجك ابنتي من غير مهر وارجع عن هذا الأمر . وقال الوليد : إن كنت صنعت ما صنعت لأجل المال ، فأنا أعطيك من المال حتى ترضى وارجع عن هذا الأمر ; فنزلت . ثم قيل : أو في قوله تعالى : آثما أو كفورا أوكد من الواو ; لأن الواو إذا قلت : لا تطع زيدا وعمرا فأطاع أحدهما كان غير عاص ; لأنه أمره ألا يطيع الاثنين ، فإذا قال : لا تطع منهم آثما أو كفورا ف \" أو \" قد دلت على أن كل واحد منهما أهل أن يعصى ; كما أنك إذا قلت : لا تخالف الحسن أو ابن سيرين ، أو اتبع الحسن أو ابن سيرين فقد قلت : هذان أهل أن يتبعا وكل واحد منهما أهل لأن يتبع ; قاله الزجاج . وقال الفراء : أو [ ص: 131 ] هنا بمنزلة لا كأنه قال : ولا كفورا ; قال الشاعر :لا وجد ثكلى كما وجدت ولا وجد عجول أضلها ربع     أو وجد شيخ أضل ناقتهيوم توافى الحجيج فاندفعواأراد ولا وجد شيخ . وقيل : الآثم المنافق ، والكفور الكافر الذي يظهر الكفر ; أي لا تطع منهم آثما ولا كفورا . وهو قريب من قول الفراء .\n","ar.miqbas":"فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تُطِعْ مِنْهُمْ آَثِمًا أَوْ كَفُورًا (24){ واصبر على ما يقولون } [ المزمل : 10 ] . ومناسبة مقام الكلام ترجح إحدى التعديتين كما تقدم بيان ذلك عند قوله تعالى : { ولربك فاصبر } في سورة المدثر ( 7 ) .ولما كان من ضروب إِعراضهم عن قبول دعوته ضربٌ فيه رغبات منهم مثل أن يَترك قرعهم بقوارع التنزيل من تأفين رأيهم وتحقير دينهم وأصنامهم ، وربما عرضوا عليه الصِهْر معهم ، أو بذْلَ المال منهم ، أُعقب أمره بالصبر على ما هو من ضروب الإِعراض في صلابة وشدة ، بأن نهاه عن أن يطيعهم في الضرب الآخر من ضروب الإِعراض الواقع في قالَب اللين والرغبة .وفي هذا النهي تأكيد للأمر بالصبر لأن النهي عنه يشمل كل ما يرفع موجبات الصبر المراد هنا .والمقصود من هذا النهي تأييسهم من استجابته لهم حين يقرأ عليهم هذه الآية لأنهم يحسبون أن ما عرضوه عليه سيكون صارفاً له عما هو قائم به من الدعوة إِذْ هم بُعَداء عن إدراك ماهية الرسالة ونزاهة الرسول .والطاعة : امتثال الطلب بفعل المطلوب وبالكف عن المنهي عنه فقد كان المشركون يعمدون إلى الطلب من النبي أن يفعل ما يرغبون ، مثل طرد ضعفاء المؤمنين من المجلس ، والإِتيان بقرآن غير هذا أو تبديله بما يشايع أحوالهم ، وأن يكف عما لا يريدون وقوعه من تحقير آلهتهم ، والجهرِ بصلاته ، فحذره الله من الاستماع لقولهم وإياسهم من حصول مرغوبهم .ومقتضى الظاهر أن يقول : ولا تطعهم ، أو ولا تطع منهم أحداً ، فعدل عنه إلى آثماً أو كفوراً } للإِشارة بالوصفين إلى أن طاعتهم تفضي إلى ارتكاب إثم أو كفر ، لأنهم في ذلك يأمرونه وينهونه غالباً فهم لا يأمرون إلاّ بما يلائم صفاتهم .فالمراد بالآثم والكفور : الصنفان من الموصوفين وتعليق الطاعة المنهي عنها بهذين النوعين مُشعر بأن الوصفين علة في النهى .والآثِم والكفُور مُتَلازِمَاننِ فكان ذكر أحد الوصفين مغنياً عن الآخر ولكن جُمع بينهما لتشويه حال المتصف بهما قال تعالى : { والله لا يحب كل كفّار أثيم } [ البقرة : 276 ] .وفي ذكر هذين الوصفين إشارة أيضًا إلى زعيمين من زعماء الكفر والعناد وهما عُتبة ابن ربيعة ، والوليد بن المغيرة ، لأن عتبة اشتهر بارتكاب المآثم والفسوق ، والوليد اشتهر بشدة الشكيمة في الكفر والعتوّ . وقد كانا كافرَيْن فأشير إلى كل واحد منهما بما هو علَم فيه بين بقية المشركين من كثرة المآثم لأولهما . والمبالغةُ في الكفر لثانيهما ، فلذلك صيغت له صيغة المبالغة ( كَفور ) .قيل عرض عتبة على النبي صلى الله عليه وسلم أن يرجع عن دعوة الناس إلى الإسلام ويزوجه ابنته وكانت من أجمل نساء قريش . وعرض الوليد عليه أن يعطيه من المال ما يرضيه ويرجع عن الدعوة ، وكان الوليد من أكثر قريش مالاً وهو الذي قال الله في شأنه :{ وجعَلْتُ له مالاً ممدوداً } [ المدثر : 12 ] . فيكون في إيثار هذين الوصفين بالذكر إدماج لذمهما وتلميح لقصتهما .وأيَّامَّا كان فحرف { أو } لم يعْدُ أصل معناه من عطف تشريك أحد شيئين أو أشياء في خبر أو طَلب ، وهذا التشريك يفيد تخييراً ، أو إباحةً ، أو تقسيماً ، أو شكاً ، أو تشكيكاً بحسب المواقع وبحسب عوامل الإِعراب ، لتدخل { أو } التي تُضمر بعدها ( أنْ ) فتنصبُ المضارع . وكون المشرَّك بها واحداً من متعدد مُلازم لمواقعها كلها .فمعنى الآية نهي عن طاعة أحد هذين الموصوفين ويعلم أن طاعة كليهما منهي عنها بدلالة الفحوى لأنه إذا أطاعهما معاً فقد تحقق منه طاعة أحدهما وزيادة .وموقع { منهم } موقعُ الحال من { آثماً } فإنه صفة { آثماً } فلما قدمت الصفة على الموصوف صارت حالاً .و ( مِنْ ) للتبعيض . والضمير المجرور بها عائد للمشركين ، ولم يتقدم لهم ذكر لأنهم معلومون من سياق الدعوة أو لأنهم المفهوم من قوله : { إنا نحن نزلنا عليك القرآن تنزيلاً } أي لا كما يزعم المشركون أنك جئت به من تلقاء نفسك ، ومن قوله : { فاصبر لحكم ربك ، } أي على أذى المشركين .ويؤول المعنى : ولا تطع أحداً من المشركين .\n","ar.waseet":"والفاء فى قوله : ( فاصبر لِحُكْمِ رَبِّكَ ) للإِفصاح . وعدى فعل الصبر باللام ، لتضمنه معنى الخضوع والاستسلام لقضائه - سبحانه - .أى : ما دام الأمر كما ذكرنا لك - أيها الرسول الكريم - فاصبر لحكم ربك ، واخضع لقضائه ومشيئته ، فهو - سبحانه - الكفيل بنصرك عليهم .وقوله : ( وَلاَ تُطِعْ مِنْهُمْ آثِماً أَوْ كَفُوراً ) أى : ولا تطع - أيها الرسول الكريم - من هؤلاء المشركين ، من كان داعياً إلى الإثم والفجور ، أو من كان داعيا إلى الكفر والجحود .ولم يقل - سبحانه - ولا تطع منهم آثمار وكفورا بالواو ، لأن الواو تجعل الكلام محتملا للنهى عن المجموع ، وأن طاعة أحدهما دون الآخر تكفى فى الامتثال .ولذا قال الزجاج : إن \" أو \" هنا أَوْكد من الواو ، لأنك إذا قلت : لا تطع زيدا وعمرا ، فأطاع أحدهما كان غير عاص ، فإن أبدلتها بأو ، فقد دللت على أن كل واحد منهما ، أهل لأن يعصى ، ويعلم منه النهى عن إطاعتهما معاً .والآثم : هو الفاجر بأقواله وأفعاله . والكفور : هو الجاحد بقلبه ولسانه .ورحم الله صاحب الكشاف ، فقد قال عند تفسيره لهاتين الآيتين ما ملخصه : تكرير الضمير بعد إيقاعه اسما لإِنّ : تأكيد على تأكيد ، لمعنى اختصاص الله - تعالى - بالتنزيل ، ليتقرر فى نفس رسول الله صلى الله عليه وسلم أنه إذا كان هو المنزل للقرآن ، لم يكن تنزيله على أى وجه نزل ، إلا حكمة وصوابا ، كأنه قيل : ما نزل عليك القرآن تنزيلا مفرقا منجما ، إلا أنا لا غيرى ، وقد عرفتنى حكيما فاعلا لكل ما أفعله .فإن قلت : كلهم كانوا كفرة ، فما معنى القسمة فى قوله : ( آثِماً أَوْ كَفُوراً ) ؟ قلت : معناه لا تطع منهم راكبا لماهو إثم ، داعيا لك إليه ، أو فاعلا لما هو كفر ، داعيا لك إليه . لأنهم إما أن يدعوه إلى مساعدتهم على فعل إثم أو كفر ، أو غير إثم ولا كفر ، داعيا لك إليه . لأنهم إما أن يدعوه إلى مساعدتهم علىفعل إثم أو كفر ، أو غير إثم ولا كف : فنهى عن أن يساعدهم على الاثنين دون الثالث . فإن قلت : معنى أو : ولا تطع أحدهما ، فهلا جئ بالواو وليكون نهيا عن طاعتهما جميعا؟قلت : لو قيل : ولا تطعهما ، جاز أن يطيع أحدهما ، وإذا قيل : لا تطع أحدهما ، علم أن الناهى عن طاعة أحدهما : عن طاعتهما جميعا أنهى ، كما إذا نهى عن أن يقول لأبويه أف ، علم أنه منهى عن ضربهما بالطريق الأولى ..والمقصود من هاتين الآيتين تثبيت فؤاد النبى صلى الله عليه وسلم وتيئيس المشركين من استجابته صلى الله عليه وسلم لأى مطلب من مطالبهم الفاسدة .\n","ar.baghawi":"\"فاصبر لحكم ربك ولا تطع منهم\"، يعني من مشركي مكة، \"آثماً أو كفوراً\"، يعني وكفوراً، والألف صلة. قال قتادة: أراد بالآثم الكفور أبا جهل وذلك أنه لما فرضت الصلاة على النبي صلى الله عليه وسلم نهاه أبو جهل عنها، وقال: لئن رأيت محمداً يصلي لأطأن عنقه.وقال مقاتل: أراد بـ الآثم: عتبة بن ربيعة، وبـ الكفور الوليد بن المغيرة، قالا للنبي صلى الله عليه وسلم: إن كنت صنعت ما صنعت لأجل النساء والمال فارجع عن هذا الأمر،قال عتبة: فأنا أزوجك ابنتي وأسوقها إليك بغير مهر، وقال الوليد: أنا أعطيك من المال حتى ترضى، فارجع عن هذا الأمر، فأنزل الله هذه الآية.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5615.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5615.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5615.mp3","format":"mp3","local_path":null}}},{"verse":25,"arabic":"وَاذْكُرِ اسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا","transliteration":"Wazkuris ma Rabbika bukratanw wa aseelaa","translations":{"en.ahmedali":"Meditate upon the name of your Lord morning and evening;","en.ahmedraza":"And remember the name of your Lord morning and evening.","en.arberry":"And remember the Name of thy Lord at dawn and in the evening","en.asad":"and bear in mind thy Sustainer's name at morn and evening","en.daryabadi":"And remember thou the name of thy Lord in the morning and in the evening.","en.hilali":"And remember the Name of your Lord every morning and afternoon [i.e. offering of the Morning (Fajr), Zuhr, and 'Asr prayers].","en.pickthall":"Remember the name of thy Lord at morn and evening.","en.qaribullah":"And, remember the Name of your Lord at the dawn and in the evening;","en.sahih":"And mention the name of your Lord [in prayer] morning and evening","en.sarwar":"Mention the Name of your Lord, mornings and evenings.","en.yusufali":"And celebrate the name of thy Lord morning and evening,","en.maududi":"and remember the name of your Lord, morning and evening;","en.shakir":"And glorify the name of your Lord morning and evening.","en.itani":"And mention the Name of your Lord, morning and evening.","en.mubarakpuri":"And remember the Name of your Lord every morning and afternoon.","en.qarai":"and celebrate the Name of your Lord morning and evening,","en.wahiduddin":"and glorify your Lord morning and evening;"},"tafsir":{"ar.muyassar":"فاصبر لحكم ربك القدري واقبله، ولحكمه الديني فامض عليه، ولا تطع من المشركين من كان منغمسًا في الشهوات أو مبالغًا في الكفر والضلال، وداوم على ذكر اسم ربك ودعائه في أول النهار وآخره.","ar.jalalayn":"«واذكر اسم ربك» في الصلاة «بكرة وأصيلا» يعني الفجر والظهر والعصر.","ar.qurtubi":"قوله تعالى : واذكر اسم ربك بكرة وأصيلا أي صل لربك أول النهار وآخره ، ففي أوله صلاة الصبح وفي آخره صلاة الظهر والعصر .ومن الليل فاسجد له يعني صلاة المغرب والعشاء الآخرة . وسبحه ليلا طويلا يعني التطوع في الليل ; قاله ابن حبيب . وقال ابن عباس وسفيان : كل تسبيح في القرآن فهو صلاة . وقيل : هو الذكر المطلق سواء كان في الصلاة أو في غيرها وقال ابن زيد وغيره : إن قوله : وسبحه ليلا طويلا منسوخ بالصلوات الخمس وقيل : هو ندب . وقيل : هو مخصوص بالنبي - صلى الله عليه وسلم - . وقد تقدم القول في مثله في سورة ( المزمل ) وقول ابن حبيب حسن . وجمع الأصيل : الأصائل والأصل ; كقولك سفائن وسفن ; قال :ولا بأحسن منها إذ دنا الأصلوقال في الأصائل ، وهو جمع الجمع :لعمري لأنت البيت أكرم أهله     وأقعد في أفيائه بالأصائلوقد مضى في آخر ( الأعراف ) مستوفى .\n","ar.miqbas":"وَاذْكُرِ اسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا (25) أي أقْبِلْ على شأنك من الدعوة إلى الله وذِكر الله بأنواع الذكر . وهذا إرشاد إلى ما فيه عون له على الصبر على ما يقولون .والمراد بالبُكرة والأصيل استغراق أوقات النهار ، أي لا يصدك إعراضهم عن معاودة الدعوة وتكريرها طرفي النهار . ويدخل في ذكر الله الصلوات مثل قوله { وأقم الصلاة طرفي النهار وزُلَفاً من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين واصبر فإن الله لا يضيع أجر المحسنين } [ هود : 114 ، 115 ] . وكذلك النوافل التي هي من خصائص النبي صلى الله عليه وسلم بين مفروض منها وغير مفروض . فالأمر في قوله : { واذكر } مستعمل في مطلق الطلب من وجوب ونفل .وذِكر اسم الرب يشمل تبليغ الدعوة ويشمل عبادة الله في الصلوات المفروضة والنوافل ويشمل الموعظة بتخويف عقابه ورجاء ثوابه .وقوله : { بكرة وأصيلا } يشمل أوقاتَ النهار كلها المحدودَ منها كأوقات الصلوات وغيرَ المحدود كأوقات النوافل ، والدعاء والاستغفارِ .و { بكرة هي أول النهار ، وأصيلاً عشياً .\n","ar.waseet":"ثم أرشده - سبحانه - إلى ما يعينه على الصبر والثبات . فقال : ( واذكر اسم رَبِّكَ بُكْرَةً وَأَصِيلاً . وَمِنَ الليل فاسجد لَهُ وَسَبِّحْهُ لَيْلاً طَوِيلاً ) .والبكرة : أول النهار . والأصيل : آخره . والمراد : المداومة على ذكر الله - تعالى - فى كل وقت . أى : داوم - أيها الرسول الكريم - على ذكر الله - تعالى - فى أول النهار وفى آخره ، وعلى صلاة الفجر ، والظهر والعصر .\n","ar.baghawi":"قوله عز وجل: \"واذكر اسم ربك بكرةً وأصيلاً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5616.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5616.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5616.mp3","format":"mp3","local_path":null}}},{"verse":26,"arabic":"وَمِنَ اللَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَوِيلًا","transliteration":"Wa minal laili fasjud lahoo wa sabbihhu lailan taweelaa","translations":{"en.ahmedali":"And bow in homage part of the night, and glorify Him far into the night.","en.ahmedraza":"And prostrate for Him in a part of the night, and proclaim His purity into the long night.","en.arberry":"and part of the night; bow down before Him and magnify Him through the long night.","en.asad":"and during some of the night, and prostrate thyself before Him, and extol His limitless glory throughout the long night.","en.daryabadi":"And during the night - worship Him; and hallow Him the livelong night.","en.hilali":"And during night, prostrate yourself to Him (i.e. the offering of Maghrib and 'Isha' prayers), and glorify Him a long night through (i.e. Tahajjud prayer).","en.pickthall":"And worship Him (a portion) of the night. And glorify Him through the livelong night.","en.qaribullah":"and in the night prostrate to Him; and exalt Him for a long night.","en.sahih":"And during the night prostrate to Him and exalt Him a long [part of the] night.","en.sarwar":"Prostrate before Him and glorify Him extensively during the night.","en.yusufali":"And part of the night, prostrate thyself to Him; and glorify Him a long night through.","en.maududi":"and prostrate yourself before Him at night, and extol His Glory during the long watches of the night.","en.shakir":"And during part of the night adore Him, and give glory to Him (a) long (part of the) night.","en.itani":"And for part of the night, prostrate yourself to Him, and glorify Him long into the night.","en.mubarakpuri":"And during the night, prostrate yourself to Him, and glorify Him a long night through.","en.qarai":"and worship Him for a watch of the night and glorify Him the night long.","en.wahiduddin":"and during the night prostrate ourself before Him, and extol His glory for a long part of the night."},"tafsir":{"ar.muyassar":"ومن الليل فاخضع لربك، وصَلِّ له، وتهجَّد له زمنًا طويلا فيه.","ar.jalalayn":"«ومن الليل فاسجد له» يعني المغرب والعشاء «وسبحه ليلا طويلا» صل التطوع فيه كما تقدم من ثلثيه أو نصفه أو ثلثه.","ar.qurtubi":"ومن الليل فاسجد له يعني صلاة المغرب والعشاء الآخرة . وسبحه ليلا طويلا يعني التطوع في الليل ; قاله ابن حبيب . وقال ابن عباس وسفيان : كل تسبيح في القرآن فهو صلاة . وقيل : هو الذكر المطلق سواء كان في الصلاة أو في غيرها وقال ابن زيد وغيره : إن قوله : وسبحه ليلا طويلا منسوخ بالصلوات الخمس وقيل : هو ندب . وقيل : هو مخصوص بالنبي - صلى الله عليه وسلم - . وقد تقدم القول في مثله في سورة ( المزمل ) وقول ابن حبيب حسن . وجمع الأصيل : الأصائل والأصل ; كقولك سفائن وسفن ; قال :ولا بأحسن منها إذ دنا الأصلوقال في الأصائل ، وهو جمع الجمع :لعمري لأنت البيت أكرم أهله     وأقعد في أفيائه بالأصائلوقد مضى في آخر ( الأعراف ) مستوفى .ودخلت ( من ) على الظرف للتبعيض ، كما دخلت على المفعول في قوله تعالى : يغفر لكم من ذنوبكم .\n","ar.miqbas":"وَمِنَ اللَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَوِيلًا (26)وقوله : ومن الليل فاسجد له } إشارة إلى أن الليل وقت تفرغ من بث الدعوة كما تقدم في قوله : { قم الليل إلاّ قليلاً } إلي قوله : { علم أن لن تحصوه فتاب عليكم } الآية [ المزمل : 2 20 ] وهذا خاص بصلاة الليل فرضاً ونفلاً .وقوله : { وسبّحْه } جملة معطوفة على جملة { من الليل فاسجد له } فتعين أن التسبيح التنفل .والتسبيح : التنزيه بالقول وبالاعتقاد ، ويشمل الصلوات والأقوال الطيبة والتدبر في دلائل صفات الله وكمالاته ، وغلب إطلاق مادة التسبيح على الصلاة النافلة ، وقال تعالى : { وسبح بحمد ربك حين تقوم } [ الطور : 48 ] ، أي من الليل . وعن عبد الملك بن حبيب : و { سبحه } هنا صلاة التطوع في الليل ، وقوله { طويلاً } صفة { ليلاً } وحيث وصف الليل بالطول بعد الأمر بالتسبيح فيه ، عُلم أن { ليلاً } أريد به أزمان الليل لأنه مجموعُ الوقت المقابل للنهار ، لأنه لو أريد ذلك المقدارُ كلُّه لم يكن في وصفه بالطول جدوى ، فتعين أن وصف الطول تقييد للأمر بالتسبيح ، أي سبحه أكثرَ الليل ، فهو في معنى قوله تعالى : { قم الليل إلاّ قليلاً إلى أو زد عليه } [ الإنسان : 2 ، 4 ] أو يتنازعه كل من ( اسجد ) و { سبحه } .وانتصب { ليلاً } على الظرفية ل { سبحه } .وعن ابن عباس وابن زيد : أن هاتين الآيتين إشارة إلى الصلوات الخمس وأوقاتها بناء على أن الأصيل يطلق على وقت الظهر فيكون قوله : { وسبّحْه } إشارة إلى قيام الليل .وهذه الآية جاءت على وفق قوله تعالى : { ولقد نعلم أنك يضيق صدرك بما يقولون فسبّح بحمد ربك وكن من الساجدين } [ الحجر : 97 ، 98 ] وقوله تعالى : { واذكر اسم ربك وتبتَّل إليه تبتيلاً رب المشرق والمغرب لا إله إلاّ هو فاتخذه وكيلاً واصبر على ما يقولون } [ المزمّل : 8 10 ] .\n","ar.waseet":"( وَمِنَ الليل فاسجد لَهُ ) - تعالى - وأكثر من ذكره ، وواظب على صلاة المغرب والعشاء .( وَسَبِّحْهُ لَيْلاً طَوِيلاً ) أى : ونزهه - تعالى - وتهجد له وقتا طويلا من الليل .فهاتان الآيتان ترشدان الرسول صلى الله عليه وسلم إلى ما يعينه على الازدياد من فضيلة الصبر الجميل ، والثبات على الحق .ومن الآيات الكثيرة التى تشبه هاتين الآيتين فى معناهما : قوله - تعالى - ( وَأَقِمِ الصلاة طَرَفَيِ النهار وَزُلَفاً مِّنَ الليل إِنَّ الحسنات يُذْهِبْنَ السيئات ذلك ذكرى لِلذَّاكِرِينَ . واصبر فَإِنَّ الله لاَ يُضِيعُ أَجْرَ المحسنين ) وقوله - تعالى - : ( وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ . فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِّنَ الساجدين ).\n","ar.baghawi":"\"ومن الليل فاسجد له\"، يعني صلاة المغرب والعشاء \"وسبحه ليلاً طويلاً\"، يعني التطوع بعد المكتوبة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5617.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5617.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5617.mp3","format":"mp3","local_path":null}}},{"verse":27,"arabic":"إِنَّ هَٰؤُلَاءِ يُحِبُّونَ الْعَاجِلَةَ وَيَذَرُونَ وَرَاءَهُمْ يَوْمًا ثَقِيلًا","transliteration":"Inna haaa'ulaa'i yuhibboona 'aajilata wa yazaroona waraaa'ahum yawman saqeelaa","translations":{"en.ahmedali":"Surely men love what hastes away and forget the grievous day (ahead).","en.ahmedraza":"Indeed these people love what they have, the fleeting one, and have forsaken the immensely important day behind them.","en.arberry":"Surely these men love the hasty world, and leave be behind them a heavy day.","en.asad":"Behold, they [who are unmindful of God] love this fleeting life, and leave behind them [all thought of] a grief-laden Day.","en.daryabadi":"Verily those love the Herein, and leave in front of them a heavy day.","en.hilali":"Verily! These (disbelievers) love the present life of this world, and put behind them a heavy Day (that will be hard).","en.pickthall":"Lo! these love fleeting life, and put behind them (the remembrance of) a grievous day.","en.qaribullah":"Indeed, these love the hasty life, and are heedless and leave behind them a heavy Day.","en.sahih":"Indeed, these [disbelievers] love the immediate and leave behind them a grave Day.","en.sarwar":"These people (disbelievers) love the worldly life and neglect the terrifying day which will come.","en.yusufali":"As to these, they love the fleeting life, and put away behind them a Day (that will be) hard.","en.maududi":"Verily they love (the good of this world) that is hastily obtainable and are oblivious of the burdensome Day ahead of them.","en.shakir":"Surely these love the transitory and neglect a grievous day before them.","en.itani":"As for these: they love the fleeting life, and leave behind a Heavy Day.","en.mubarakpuri":"Verily, these love the present life of this world, and put behind them a heavy Day.","en.qarai":"Indeed they love this transitory life, and disregard a heavy day that is ahead of them.","en.wahiduddin":"Those people [who are unmindful of God] aspire for immediate gains, and put behind them a Heavy Day."},"tafsir":{"ar.muyassar":"إن هؤلاء المشركين يحبون الدنيا، وينشغلون بها، ويتركون خلف ظهورهم العمل للآخرة، ولما فيه نجاتهم في يوم عظيم الشدائد.","ar.jalalayn":"«إن هؤلاء يحبون العاجلة» الدنيا «ويذرون وراءهم يوما ثقيلا» شديدا أي يوم القيامة لا يعملون له.","ar.qurtubi":"قوله تعالى : إن هؤلاء يحبون العاجلة توبيخ وتقريع ; والمراد أهل مكة . والعجلة الدنيا ويذرون أي ويدعون وراءهم أي بين أيديهم يوما ثقيلا أي عسيرا شديدا كما قال : ثقلت في السماوات والأرض . أي يتركون الإيمان بيوم القيامة . وقيل : وراءهم أي خلفهم ، أي ويذرون الآخرة خلف ظهورهم ، فلا يعملون لها . وقيل : نزلت في اليهود فيما كتموه من صفة الرسول - صلى الله عليه وسلم - وصحة نبوته . وحبهم العاجلة : أخذهم الرشا على [ ص: 132 ] ما كتموه . وقيل : أراد المنافقين ; لاستبطانهم الكفر وطلب الدنيا . والآية تعم . واليوم الثقيل : يوم القيامة . وإنما سمي ثقيلا لشدائده وأهواله . وقيل : للقضاء فيه بين عباده .\n","ar.miqbas":"إِنَّ هَؤُلَاءِ يُحِبُّونَ الْعَاجِلَةَ وَيَذَرُونَ وَرَاءَهُمْ يَوْمًا ثَقِيلًا (27)تعليل للنهي عن إطاعتهم في قوله : { ولا تطع منهم آثماً أو كفوراً } [ الإنسان : 24 ] ، أي لأن خلقهم الانصباب على الدنيا مع الإِعراض عن الآخرة إذ هم لا يؤمنون بالبعث فلو أعطاهم لتخلق بخلقهم قال تعالى : { ودّوا لو تكفرون كما كفروا فتكونون سواء فلا تتخذوا منهم أولياء } الآية [ النساء : 89 ] . فموقع { إنّ } موقع التعليل وهي بمنزلة فاء السببية كما نبه عليه الشيخ عبد القاهر .و { هؤلاء } إشارة إلى حاضرين في ذهن المخاطب لكثرة الحديث عنهم ، وقد استقريْتُ من القرآن أنه إذا أطلق { هؤلاء } دون سبْققِ ما يكون مشاراً إليه فالمقصود به المشركون ، وقد ذكرتُ ذلك في تفسير قوله تعالى : { فإن يكفر بها هؤلاء فقد وكَّلنا بها قوماً ليسوا بها بكافرين } في سورة الأنعام ( 89 ) وقوله تعالى : { فلا تكُ في مرية مما يعبد هؤلاء } في سورة هود ( 109 ) .وقد تنزه رسول الله عن محبة الدنيا فقال : ما لي وللدنيا فليس له محبة لأمورها عدا النساء والطيب كما قال : حُبِّب إليّ مِن دنياكم النساء والطيب .فأما النساء فالميل إليهن مركوز في طبع الذكور ، وما بالطبع لا يتخلف ، وفي الأنس بهن انتعاش للروح فتناوله محمود إذا وقع على الوجه المبَرَّأ من الإِيقاع في فساد ومَا هو الأمثل تناول الطعام وشرب الماء قال تعالى : { ولقد أرسلنا رُسُلاً مِن قبلك وجعلْنا لهم أزواجاً وذُرِّية } [ الرعد : 38 ] .وأما الطيب فلأنه مناسب للتزكية النفسية .وصيغة المضارع في { يحبّون } تدل على تكرر ذلك ، أي أن ذلك دأبهم وديدنهم لا يشاركون مع حب العاجلة حب الآخرة .و { العاجلة } : صفة لموصوف محذوف معلوم من المقام تقديره : الحياة العاجلة ، أو الدار العاجلة . والمراد بها مدة الحياة الدنيا .وكثر في القرآن إطلاق العاجلة على الدنيا كقوله : { كلا بل تُحِبُّون العاجلة وتَذرُون الآخرة } [ القيامة : 20 ، 21 ] فشاع بين المسلمين تسمية الدنيا بالعاجلة .ومتعلق { يحبّون } مضافٌ محذوف ، تقديره : نعيمَ أو منافعَ لأن الحب لا يتعلق بذات الدنيا .وفي إيثار ذكر الدنيا بوصف العاجلة توطئة للمقصود من الذم لأن وصف العاجلة يؤذن بأنهم آثروها لأنها عاجلة . وفي ذلك تعريض بتحميقهم إذ رضُوا بالدون لأنه عاجل وليس ذلك من شيم أهل التبصر ، فقوله : { ويذرون ورآءهم يوماً ثقيلاً } واقع موقع التكميل لمناط ذمهم وتحميقهم لأنهم لوْ أحبُّوا الدنيا مع الاستعداد للآخرة لما كانوا مذمومين قال تعالى حكاية لقول الناصحين لقارون : { وابتغ فيما ءاتاك الله الدار الآخرة ولا تنسَ نصيبك من الدنيا } [ القصص : 77 ] . وهذا نظير قوله تعالى : { يعلمون ظاهراً من الحياة الدنيا وهم عن الآخرة هم غافلون } [ الروم : 7 ] إذ كان مناط الذم فيه هو أن قصروا أنفسهم على علم أمور الدنيا مع الإِعراض عن العلم بالآخرة .ومُثلوا بحال من يترك شيئاً وراءه فهو لا يسعى إليه وإنما يسعى إلى ما بين يديه .وإنما أعرضوا عنه لأنهم لا يؤمنون بحلوله فكيف يسعون إليه .وصيغة المضارع في { يذرون } تقتضي أنهم مستمرون على ذلك وأن ذلك متجدد فيهم ومتكرر لا يتخلفون عن ذلك الترك لأنهم لا يؤمنون بحلول ذلك اليوم ، فالمسلمون لا يذرون وراءهم هذا اليوم لأنهم لا يَخلُون من عمل له على تفاوت بينهم في التقوى .واليومُ الثقيل : هو يوم القيامة ، وُصف بالثقيل على وجه الاستعارة لشدة ما يحصل فيه من المتاعب والكروب فهو كالشيء الثقيل الذي لا يستطاع حمله .والثقل : يستعار للشدة والعسر قال تعالى : { ثقُلت في السماوات والأرض } [ الأعراف : 187 ] وقال : { إنا سنلقي عليك قولاً ثقيلاً } [ المزمل : 5 ] .\n","ar.waseet":"ثم بين - سبحانه - جانبا من الأسباب التى تجعله صلى الله عليه وسلم لا يطيع أحدا منهم فقال : ( إِنَّ هؤلاء يُحِبُّونَ العاجلة وَيَذَرُونَ وَرَآءَهُمْ يَوْماً ثَقِيلاً ) .أى : نحن قد نهيناك - يا محمد - عن طاعة أحد من هؤلاء المشركين ، لأنهم جميعا ديدنهم ودأبهم أنهم يحبون ( العاجلة ) أى : الدنيا ولذائذها وشهواتها ، العاجلة الزائلة .( وَيَذَرُونَ وَرَآءَهُمْ ) أى : ويتركون وينبذون وراء ظهورهم ( يَوْماً ثَقِيلاً ) وهو يوم القيامة ، الشديد الأهوال ، الذى يجعل الولدان شيبا .ومع شدة هوله فهم لا يستعدون له ولا يحسبون له حسابا . .فالآية الكريمة توبيخ وتجهيل لهم ، حيث آثروا الفانى على الباقى ، والعاجل على الآجل .ووصف يوم القيامة بالثقل ، لشدة ما يقع فيه من أهوال وكروب ، فهو كالشئ الثقيل الذى لا يستطاع حمله .\n","ar.baghawi":"\"إن هؤلاء\"، يعني كفار مكة \"يحبون العاجلة\"، أي الدار العاجلة وهي الدنيا. \"ويذرون وراءهم\"، يعني أمامهم، \"يوماً ثقيلاً\"، شديداً وهو يوم القيامة. أي يتركونه فلا يؤمنون به ولا يعملون له.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5618.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5618.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5618.mp3","format":"mp3","local_path":null}}},{"verse":28,"arabic":"نَحْنُ خَلَقْنَاهُمْ وَشَدَدْنَا أَسْرَهُمْ ۖ وَإِذَا شِئْنَا بَدَّلْنَا أَمْثَالَهُمْ تَبْدِيلًا","transliteration":"Nahnu khalaqnaahum wa shadadnaaa asrahum wa izaa shi'naa baddalnaaa amsaala hum tabdeelaa","translations":{"en.ahmedali":"We created them and fixed their bones and joints; and We could replace them when We like with others like them.","en.ahmedraza":"It is We Who created them, and strengthened their skeleton; and We can replace them with others like them, whenever We will.","en.arberry":"We created them, and We strengthened their joints; and, when We will, We shall exchange their likes.","en.asad":"[They will not admit to themselves that] it We who have created them and strengthened their make - and [that] if it be Our will We can replace them entirely with others of their kind.","en.daryabadi":"It it We Who creared them and made them firm of make. And whenever We list, We can replace them with others like Unto them.","en.hilali":"It is We Who created them, and We have made them of strong built. And when We will, We can replace them with others like them with a complete replacement.","en.pickthall":"We, even We, created them, and strengthened their frame. And when We will, We can replace them, bringing others like them in their stead.","en.qaribullah":"We created them, and We strengthened their joints, but, when We will, We shall indeed exchange their likes.","en.sahih":"We have created them and strengthened their forms, and when We will, We can change their likenesses with [complete] alteration.","en.sarwar":"We have created them and have given them strength. Had We wanted, We could have replaced them with another people like them.","en.yusufali":"It is We Who created them, and We have made their joints strong; but, when We will, We can substitute the like of them by a complete change.","en.maududi":"We created them and strengthened their joints; and whenever We wish, We can change their faces entirely.","en.shakir":"We created them and made firm their make, and when We please We will bring in their place the likes of them by a change.","en.itani":"We created them, and strengthened their frame; and whenever We will, We can replace them with others like them.","en.mubarakpuri":"It is We Who created them, and We have made them of strong build. And when We will, We can replace them with others like them with a complete replacement.","en.qarai":"We created them and strengthened their joints, and We will replace them with others like them whenever We like.","en.wahiduddin":"It was We who created them and made their constitution strong, but if We wish we can replace them with others like them."},"tafsir":{"ar.muyassar":"نحن خلقناهم، وأحكمنا خلقهم، وإذا شئنا أهلكناهم، وجئنا بقوم مطيعين ممتثلين لأوامر ربهم.","ar.jalalayn":"«نحن خلقناهم وشددنا» قوينا «أسرهم» أعضاءهم ومفاصلهم «وإذا شئنا بدلنا» جعلنا «أمثالهم» في الخلقة بدلا منهم بأن نهلكهم «تبديلا» تأكيد ووقعت إذا موقع إن نحو إن يشأ يذهبكم لأنه تعالى لم يشأ ذلك وإذا لمّا يقع.","ar.qurtubi":"قوله تعالى : نحن خلقناهم أي من طين . وشددنا أسرهم أي خلقهم ; قاله ابن عباس ومجاهد وقتادة ومقاتل وغيرهم . والأسر الخلق ; قال أبو عبيد : يقال فرس شديد الأسر أي الخلق . ويقال أسره الله - جل ثناؤه - إذا شدد خلقه ; قال لبيد :ساهم الوجه شديد أسره مشرف الحارك محبوك الكتدوقال الأخطل :من كل مجتنب شديد أسره     سلس القياد تخاله مختالاوقال أبو هريرة والحسن والربيع : شددنا مفاصلهم وأوصالهم بعضها إلى بعض بالعروق والعصب . وقال مجاهد في تفسير الأسر : هو الشرج ، أي إذا خرج الغائط والبول تقبض الموضع . وقال ابن زيد القوة . وقال ابن أحمر يصف فرسا :يمشي بأوظفة شداد أسرها     صم السنابك لا تقي بالجدجدواشتقاقه من الإسار وهو القد الذي يشد به الأقتاب ; يقال : أسرت القتب أسرا أي شددته وربطته ; ويقال : ما أحسن أسر قتبه أي شده وربطه ; ومنه قولهم : خذه بأسره إذا أرادوا أن يقولوا هو لك كله ; كأنهم أرادوا تعكيمه وشده لم يفتح ولم ينقص منه شيء . ومنه الأسير ، لأنه كان يكتف بالإسار . والكلام خرج مخرج الامتنان عليهم بالنعم حين قابلوها بالمعصية . أي سويت خلقك وأحكمته بالقوى ثم أنت تكفر بي .وإذا شئنا بدلنا أمثالهم تبديلا قال ابن عباس : يقول لو نشاء لأهلكناهم وجئنا بأطوع لله منهم . وعنه أيضا : لغيرنا محاسنهم إلى أسمج الصور وأقبحها . كذلك روى الضحاك عنه . والأول رواه عنه أبو صالح .\n","ar.miqbas":"نَحْنُ خَلَقْنَاهُمْ وَشَدَدْنَا أَسْرَهُمْ وَإِذَا شِئْنَا بَدَّلْنَا أَمْثَالَهُمْ تَبْدِيلًا (28)لما كان الإِخبار عنهم بأنهم { يذرون ورآءهم يوماً ثقيلاً } [ الإنسان : 27 ] يتضمن أنهم ينكرون وقوع ذلك اليوم كما قدمناه وكان الباعث لهم على إنكاره شبهةُ استحالة إعادة الأجسادِ بعد بِلاها وفنائها ، وكان الكلام السابق مسوقاً مساق الذم لهم والإِنكار عليهم جيء هنا بما هو دليل للإِنكار عليهم وإبطال لشبهتهم ببيان إمكان إعادة خلقهم يُعيده الذي خلقهم أول مرّة كما قال تعالى : { فسيقولون من يُعيدنا قُللِ الذي فطركم أول مرة } [ الإسراء : 51 ] وغيرِ ذلك من الآيات الحائمة حول هذا المعنى .وافتتاح الجملة بالمبتدإ المخبر عنه بالخبر الفِعلي دون أن تفتتح ب { خلقناهم } أو نحن خالقون ، لإِفادة تقوّي الخبر وتحقيقه بالنظر إلى المعنِيِّينَ بهذا الكلام وإن لم يكن خطاباً لهم ولكنهم هم المقصود منه .وتقويةُ الحكم بناءٌ على تنزيل أولئك المخلوقين منزلة من يشك في أن الله خلقهم حيث لم يجْرُؤوا على موجِب العلم فأنكروا أن الله يعيد الخلق بعد البِلَى ، فكأنهم يسندون الخلق الأول لغيره . وتقوِّي الحكم يترتب عليه أنه إذا شاء بدَّل أمثالهم بإعادة أجسادهم فلذلك لم يُحتج إلى تأكيد جملة : { وإذا شئنا بدّلنا أمثالهم } ، استغناء بتولد معناها عن معنى التي قبلها وإن كان هو أولى بالتقوية على مقتضى الظاهر . وهذا التقوّي هنا مشعر بأن كلاماً يعقبه هو مصب التقوِّي ، ونظيره في التقوِّي والتفريع قوله تعالى : { نحن خلقناكم فلولا تصدقون أفرأيتم ما تُمْنُون إلى قوله : وما نحن بمسبوقين على أن نبدِّل أمثالكم فإن المفرع هو أفرأيتم ما تمنون وما اتصل به . وجملة { فلولا تُصَدِّقون } معترضة وقد مضى في سورة الواقعة ( 57 - 61 ) .فأمثالهم } : هي الأجساد الثانية إذ هي أمثال لأجسادهم الموجودةِ حين التنزيل .والشدّ : الإِحكام وإتقان ارتباط أجزاء الجسد بعضها ببعض بواسطة العظام والأعصاب والعروق إذ بذلك يستقلّ الجسم .والأسر : الربط ، وأطلق هنا على الإِحكام والإِتقان على وجه الاستعارة .والمعنى : أحْكمنا ربط أجزاء أجسامهم فكانت مشدوداً بعضها إلى بعض .وقوله : { وإذا شئنا بَدَّلْنا أمثالهم } إخبار بأن الله قادر على أن يُبدلهم بناس آخرين .فحذف مفعول { شئنا } لدلالة وجواب { إذَا } عليه كما هو الشأن في فعل المشيئة غالباً .واجتلاب { إذا } في هذا التعليق لأن شأن { إذا } أن تفيد اليقين بوقوع ما قُيد بها بخلاف حرف ( إنْ ) فهو إيماء إلى أن حصول هذه المشيئة مستقرب الوقوع .فيجوز أن يَكون هذا بمنزلة النتيجة لقوله : { نحن خلقناهم } الخ ، ويُحمل الشرط على التحقق قال تعالى : { وإن الدين لَوَاقع } [ الذاريات : 6 ] .ويجوز أن يكون قوله : { وإذا شئنا بدلنا أمثالهم } تهديداً لهم على إعراضهم وجحودهم للبعث ، أي لو شئنا لأهلكناهم وخلقنا خلقاً آخر مثلهم كقوله تعالى : { إنْ يشأ يُذْهِبْكُم ويَأتتِ بخَلْق جديد } [ إبراهيم : 19 ] .ويكون { إذا } مراداً به تحقق التلازم بين شرط { إذا } وجوابها ، أي الجملةِ المضاففِ إليها ، والجملةِ المتعلَّق بها .وفعل التبديل يقتضي مبدَّلاً ومبدَّلاً به وأيُّهما اعتبرتَه في موضع الآخر صح لأن كل مُبَدَّل بشيء هو أيضاً مُبدَّلٌ به ذلك الشيءُ ، ولا سيما إذا لم يكن في المقام غرض ببيان المرغوب في اقتِنَائه والمسموح ببذله من الشيئين المستبدَلين ، فحُذف من الكلام هنا متعلِّق { بدَّلنا } وهو المجرور بالباء لأنه أولى بالحذف ، وأُبقي المفعول .وقد تقدم نظيره في سورة الواقعة ( 61 ) في قوله : { على أنْ نُبَدل أمثالكم } ، ومنه قوله تعالى : { إِنا لقادرون على أن نبدّلَ خيراً منهم } في سورة المعارج ( 40 ، 41 ) فالتقدير : بَدَّلْنا منهم .والأمثال : جمع مِثْل وهو المماثل في ذاتتٍ أو صفة ، فيجوز أن يراد أمثالهم في أشكال أجسادهم وهو التبديل الذي سيكون في المعاد .ويجوز أن يراد أمثالهم في أنهم أُمم ، وعلى الوجه الأول فهو يدل على أن البعث يحصل بخلق أجسام على مِثال الأجساد التي كانت في الحياة الدنيا للأرواح التي كانت فيها .وانتصب تبديلاً } على المفعول المطلق المؤكِّد لعامله للدلالة على أنه تبديل حقيقي ، وللتوصل بالتنوين إلى تعظيمه وعجوبته .\n","ar.waseet":"ثم بين - سبحانه - مظاهر فضله عليهم ، ومع ذلك أشركوا معه فى العبادة غيره فقال : ( نَّحْنُ خَلَقْنَاهُمْ وَشَدَدْنَآ أَسْرَهُمْ وَإِذَا شِئْنَا بَدَّلْنَآ أَمْثَالَهُمْ تَبْدِيلاً ) .أى : نحن وحدنا الذين خلقناهم وأوجدناهم من العدم .ونحن وحدنا الذين ( وَشَدَدْنَآ أَسْرَهُمْ ) أى : قوينا وأحكمنا وأتقنا خلقهم ، بأن منحناهم السمع والأبصار والأفئدة والعقول . . وربطنا بين مفاصلهم وأجزاء أجسادهم ربطا عجيبا معجزا .يقال : أسَر الله - تعالى - فلانا ، أى : خلقه - وبابه ضرب - وفرس شديد الأسْر ، أى : شديد الخَلْق ، والأسر : القوة ، مشتق من الإِسار - بكسر الهمزة - وهو الحبل الذى تشد به الأحمال ، يقال : أسَر فلان الحمل أسْراً ، إذا أحكم ربطه ، ومنه الأسير لأنه يُرْبَط بالإِسار ، أى : القيد .والمقصود بالأسر هنا : الإِحكام والإِتقان ، والامتنان عليهم بأن الله - تعالى - خلقهم فى أحسن وأتقن خلق .وقوله - سبحانه - ( وَإِذَا شِئْنَا بَدَّلْنَآ أَمْثَالَهُمْ تَبْدِيلاً ) تأكيد لشمول قدرته - تعالى - أى : ونحن وحدنا الذين خلقناهم ، ونحن وحدنا الذين ربطنا مفاصلهم وأعضاءهم ربطا متقنا بديعا .ومع ذلك ، فإننا إذا شئنا إهلاكهم أهلكناهم ، وجئنا بأمثالهم وأشباههم فى شدة الخلق ، وبدلناهم تبديلا معجزا ، لا يقدر عليه أحد سوانا .وقوله : ( تَبْدِيلاً ) منصوب على أنه مفعول مطلق مؤكد لعامله وهو بدلناهم .ومن الآيات الشبيهة لهذه الآية فى معناها قوله - تعالى - : ( إِن يَشَأْ يُذْهِبْكُمْ أَيُّهَا الناس وَيَأْتِ بِآخَرِينَ وَكَانَ الله على ذلك قَدِيراً ) وقوله - سبحانه - : ( إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ . وَمَا ذَلِكَ عَلَى الله بِعَزِيزٍ ) .\n","ar.baghawi":"\"نحن خلقناهم وشددنا\"، قوينا وأحكمنا \"أسرهم\"، قال مجاهد وقتادة ومقاتل: \"أسرهم\" أي: خلقهم، يقال: رجل حسن الأسر، أي: الخلق. وقال الحسن: يعني أوصالهم بعضها إلى بعض بالعروق والعصب.وروي عن مجاهد في تفسير الأسر قال: الشرج، يعني: موضع مصرفي البول والغائط، إذا خرج الأذى تقبضا. \"وإذا شئنا بدلنا أمثالهم تبديلاً\"، أي: إذا شئنا أهلكناهم وأتينا بأشباههم فجعلناهم بدلاً منهم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5619.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5619.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5619.mp3","format":"mp3","local_path":null}}},{"verse":29,"arabic":"إِنَّ هَٰذِهِ تَذْكِرَةٌ ۖ فَمَنْ شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا","transliteration":"Inna haazihee tazkiratun fa man shaaa'at takhaza ilaa rabbihee sabeela","translations":{"en.ahmedali":"This surely is a reminder: Therefore whosoever desires may take the way to his Lord.","en.ahmedraza":"This is indeed an advice; so whoever wishes may take the path towards his Lord.","en.arberry":"Surely this is a Reminder; so he who will, takes unto his Lord a way.","en.asad":"VERILY, all this is an admonition: whoever, then, so wills, may unto his Sustainer find a way.","en.daryabadi":"Verily this is an admonition; then whosoever Will, may choose a way Unto his Lord.","en.hilali":"Verily! This (Verses of the Quran) is an admonition, so whosoever wills, let him take a Path to his Lord (Allah).","en.pickthall":"Lo! this is an Admonishment, that whosoever will may choose a way unto his Lord.","en.qaribullah":"This is indeed a Reminder, so that he who will, takes a path to his Lord.","en.sahih":"Indeed, this is a reminder, so he who wills may take to his Lord a way.","en.sarwar":"This chapter is a reminder. Let those who want, seek guidance from their Lord.","en.yusufali":"This is an admonition: Whosoever will, let him take a (straight) Path to his Lord.","en.maududi":"Verily this is an Exhortation; so let him who so will take a way to his Lord.","en.shakir":"Surely this is a reminder, so whoever pleases takes to his Lord a way.","en.itani":"This is a reminder; so whoever wills, let him take a path to his Lord.","en.mubarakpuri":"Verily, this is an admonition, so whosoever wills, let him take a path to his Lord.","en.qarai":"This is indeed a reminder. So let anyone who wishes take the way toward his Lord.","en.wahiduddin":"This is a reminder. Let whoever wishes, take the right path to his Lord."},"tafsir":{"ar.muyassar":"إن هذه السورة عظة للعالمين، فمن أراد الخير لنفسه في الدنيا والآخرة اتخذ بالإيمان والتقوى طريقًا يوصله إلى مغفرة الله ورضوانه. وما تريدون أمرًا من الأمور إلا بتقدير الله ومشيئته. إن الله كان عليمًا بأحوال خلقه، حكيمًا في تدبيره وصنعه. يُدْخل مَن يشاء مِن عباده في رحمته ورضوانه، وهم المؤمنون، وأعدَّ للظالمين المتجاوزين حدود الله عذابًا موجعًا.","ar.jalalayn":"«إن هذه» السورة «تذكرة» عظة للخلق «فمن شاء اتخذ إلى ربه سبيلا» طريقا بالطاعة.","ar.qurtubi":"قوله تعالى : إن هذه أي السورة تذكرة أي موعظة فمن شاء اتخذ إلى ربه سبيلا أي طريقا موصلا إلى طاعته وطلب مرضاته . وقيل : سبيلا أي وسيلة . وقيل وجهة [ ص: 133 ] وطريقا إلى الجنة . والمعنى واحد .\n","ar.miqbas":"إِنَّ هَذِهِ تَذْكِرَةٌ فَمَنْ شَاءَ اتَّخَذَ إِلَى رَبِّهِ سَبِيلًا (29)استئناف ابتدائي للانتقال من بسط التذكير والاستدلال إلى فذلكة الغرض وحوصلته ، إشعاراً بانتهاء المقصود وتنبيهاً إلى فائدته ، ووجه الانتفاع به ، والحث على التدبر فيه ، واستثمار ثمرته ، وباعتبار ما تفرع عن هذه الجملة من قوله : { فمن شاء اتخذ } الخ يقوَى موقع الفذلكة للجملة وتأكيد الكلام بحرف { إن } لأن حال المخاطبين عدم اهتمامهم بها فهم ينكرون أنها تذكرة .والإِشارة إلى الآيات المتقدمة أو إلى السورة ولذلك أُتي باسم الإِشارة المؤنث .والتذكرة : مصدر ذَكَّره ( مثل التزكية ) ، أي أكلمه كلاماً يذكره به ما عسى أن يكون نسيه أطلقت هنا على الموعظة بالإِقلاع عن عمل سيِّىء والإِقبال على عمل صالح وعلى وضوح الخير والشر لمن تذكر ، أي تبصر بتشبيه حالة المعرض عن الخير المشغول عنه بحالة الناسي له لأن شأنه ألا يُفرِّط فيه إلاّ من كان ناسياً لما فيه من نفع له .وفرع عليه الحث على سلوك سبيل مرضاة الله بقوله : { فمن شاء اتخذ إلى ربه سبيلاً } ، أي ليس بعد هذه التذكرة إلاّ العمل بها إذا شاء المتذكر أن يعمل بها .ففي قوله : { مَن شاء } حثّ على المبادرة بذلك لأن مشيئة المرء في مكنته فلا يمنعه منها إلاّ سوء تدبيره .وهذا حثّ وتحريض فيه تعريض بالمشركين بأنهم أبَوا أن يتذكروا عناداً وحسداً .واتخاذ السبيل : سلوكه ، عُبّر عن السلوك بالاتخاذ على وجه الاستعارة بتشبيه ففي قوله : { اتَّخَذ إلى ربه سبيلاً } استعارتان لأن السبيل مستعار لسبب الفوز بالنعيم والزُّلفى .ويتعلق قوله : { إلى ربه } ب { سبيلاً } ، أي سبيلاً مُبلغة إلى الله ، ولا يختلف العقلاء في شرف ما يوصل إلى الرب ، أي إلى إكرامه لأن ذلك قَرارة الخيرات ولذلك عبر برب مضافاً إلى ضمير { من شاء } إذ سعادة العبد في الحظوة عند ربه .وهذه السبيل هي التوبة فالتائب مِثل الذي كان ضالاً ، أو آبقاً فاهتدى إلى الطريق التي يرجع منها إلى مقصده ، أو سلك الطريق إلى مولاه .وقد تقدم نظير هذه الآية في سورة المزمل .\n","ar.waseet":"ثم ختم - سبحانه - السورة الكريمة بالحض على طاعته ، وبالتحذير من معصيته فقال : ( إِنَّ هذه تَذْكِرَةٌ فَمَن شَآءَ اتخذ إلى رَبِّهِ سَبِيلاً ) .أى : إن هذه الآيات التى أنزلناها عليك يا محمد - تذكرة وموعظة للناس ، فمن شاء أن يتخذ إلى الله - تعالى - وسيلة وطريقة يتقرب بها إليه - تعالى - اتخذها ، لأنها خير هداية إلى رضاه - سبحانه - .والتعبير بقوله : ( فَمَن شَآءَ اتخذ إلى رَبِّهِ سَبِيلاً ) تحريض شديد على المسارعة إلى الطاعة ، لأن الله - تعالى - قد مكن الناس من ذلك ، حيث وهبهم الاختيار والعقول المفكرة ، وأرسل إليهم الرسل ليخرجوهم من الظلمات إلى النور .\n","ar.baghawi":"\"إن هذه\"، يعني هذه السورة، \"تذكرة\"، تذكير وعظة، \"فمن شاء اتخذ إلى ربه سبيلاً\"، وسيلة بالطاعة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5620.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5620.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5620.mp3","format":"mp3","local_path":null}}},{"verse":30,"arabic":"وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","transliteration":"Wa maa tashaaa'oona illaa anyyashaaa'al laah; innal laahaa kaana'Aleeman Hakeema","translations":{"en.ahmedali":"But you will not desire except as God wills. Verily He is all-knowing and all-wise.","en.ahmedraza":"And what will you wish, except if Allah wills; indeed Allah is All Knowing, Wise.","en.arberry":"But you will not unless God wills; surely God is ever All-knowing, All-wise.","en.asad":"But you cannot will it unless God wills [to show you that way]: for, behold, God is indeed all-seeing, wise.","en.daryabadi":"And ye will not, unless Allah willeth. Verily Allah is ever Knowing, Wise.'","en.hilali":"But you cannot will, unless Allah wills. Verily, Allah is Ever All-Knowing, All-Wise.","en.pickthall":"Yet ye will not, unless Allah willeth. Lo! Allah is Knower, Wise.","en.qaribullah":"Yet you will not unless Allah wills; surely, Allah is the Knower, the Wise.","en.sahih":"And you do not will except that Allah wills. Indeed, Allah is ever Knowing and Wise.","en.sarwar":"(The virtuous mentioned in this chapter) want only what God wants. God is All-knowing and All-wise.","en.yusufali":"But ye will not, except as Allah wills; for Allah is full of Knowledge and Wisdom.","en.maududi":"But your willing shall be of no avail until Allah Himself so wills. Surely Allah is All-Knowing, Most Wise.","en.shakir":"And you do not please except that Allah please, surely Allah is Knowing, Wise;","en.itani":"Yet you cannot will, unless God wills. God is Knowing and Wise.","en.mubarakpuri":"But you cannot will, unless Allah wills. Verily, Allah is Ever All-Knowing, All-Wise.","en.qarai":"But you will not wish unless it is willed by Allah. Indeed Allah is all-knowing, all-wise.","en.wahiduddin":"But you cannot will it unless God wills [to show you that way] -- God is indeed all-knowing and wise --"},"tafsir":{"ar.muyassar":"إن هذه السورة عظة للعالمين، فمن أراد الخير لنفسه في الدنيا والآخرة اتخذ بالإيمان والتقوى طريقًا يوصله إلى مغفرة الله ورضوانه. وما تريدون أمرًا من الأمور إلا بتقدير الله ومشيئته. إن الله كان عليمًا بأحوال خلقه، حكيمًا في تدبيره وصنعه. يُدْخل مَن يشاء مِن عباده في رحمته ورضوانه، وهم المؤمنون، وأعدَّ للظالمين المتجاوزين حدود الله عذابًا موجعًا.","ar.jalalayn":"«وما تشاءون» بالتاء والياء اتخاذ السبيل بالطاعة «إلا أن يشاء الله» ذلك «إن الله كان عليما» بخلقه «حكيما» في فعله.","ar.qurtubi":"وما تشاؤون أي الطاعة والاستقامة واتخاذ السبيل إلى الله إلا أن يشاء الله فأخبر أن الأمر إليه سبحانه ليس إليهم ، وأنه لا تنفذ مشيئة أحد ولا تتقدم ، إلا أن تتقدم مشيئته . وقرأ ابن كثير وأبو عمرو ( وما يشاؤون ) بالياء على معنى الخبر عنهم . والباقون بالتاء على معنى المخاطبة لله سبحانه . وقيل : إن الآية الأولى منسوخة بالثانية . والأشبه أنه ليس بنسخ ، بل هو تبيين أن ذلك لا يكون إلا بمشيئته . قال الفراء : وما تشاءون إلا أن يشاء الله جواب لقوله : فمن شاء اتخذ إلى ربه سبيلا ثم أخبرهم أن الأمر ليس إليهم فقال : وما تشاؤون ذلك السبيل إلا أن يشاء الله لكم .إن الله كان عليما بأعمالكم حكيما في أمره ونهيه لكم . وقد مضى في غير موضع .\n","ar.miqbas":"وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا (30)لما ناط اختيارهم سبيلَ مرضاة الله بمشيئتهم أعقبه بالتنبيه إلى الإِقبال على طلب مرضاة الله للتوسل برضاه إلى تيسير سلوك سبل الخير لهم لأنهم إذا كانوا منه بمحل الرضى والعناية لطف بهم ويسَّر لهم ما يعسُر على النفوس من المصابرة على ترك الشهوات المُهلكة ، قال تعالى : { فسَنُيَسِّره لليسرى } [ الليل : 7 ] فإذا لم يسعوا إلى مرضاة ربهم وَكَلَهم إلى أحوالهم التي تعوّدوها فاقتحمت بهم مهامه العماية إذ هم محفوفون بأسباب الضلال بما استقرت عليه جِبلاّتهم من إيثار الشهوات والاندفاع مع عصائب الضلالات ، وهو الذي أفاده قوله تعالى : { فسنيسّره للعُسْرى } [ الليل : 10 ] ، أي نتركه وشأنَه فتتيسر عليه العسرى ، أي تلحق به بلا تكلف ومجاهدة .فجملة { وما تشاءون إلاّ أن يشاء الله } يجوز أن تكون عطفاً على جملة { فمن شاء اتخذ إلى ربه سبيلاً } [ الإنسان : 29 ] أو حالاً من { مَن يشاء } [ الإنسان : 31 ] وهي على كلا الوجهين تتميم واحتراس .وحذف مفعول { تشاءون } لإِفادة العموم ، والتقدير : وما تشاءون شيئاً أو مشيئاً وعموم الأشخاص يستلزم عموم الأحوال والأزمنة ، أي ما تشاءون شيئاً في وقت من الأوقات أو في حال من الأحوال .وقد عُلل ارتباط حصول مشيئتهم بمشيئة الله ، بأن الله عليم حكيم ، أي عليم بوسائل إيجاد مشيئتهم الخير ، حكيم بدقائق ذلك مما لا تبلغ إلى معرفة دقائقه بالكُنْهِ عقول الناس ، لأن هنالك تصرفات عُلوية لا يبلغ الناس مبلغ الاطلاع على تفصيلها ولكن حَسبهم الاهتداء بآثارها وتزكية أنفسهم للصد عن الإِعراض عن التدبر فيها .و { مَا } نافية ، والاستثناء من عموم الأشياء المشيئة وأحوالها وأزمانها ، ولما كان ما بعد أدَاة الاستثناء حرف مصدر تعين أن المستثنى يقدر مصدراً ، أي إلاَّ شَيْءَ الله ( بمعنى مشيئته ) ، وهو صالح لاعتبار المعنى المصدري ولاعتبار الحالة ، ولاعتبار الزمان ، لأن المصدر صالح لإِرادة الثلاثة باختلاف التأويل فإن قدر مضاف كان المعنى : إلاّ حالَ مشيئة الله ، أو إلاّ زمن مشيئته ، وإن لم يقدر مضاف كان المعنى : لا مشيئة لكم في الحقيقة إلاّ تبعاً لمشيئة الله .وإيثار اجتلاب { أن } المصدرية من إعجاز القرآن .ويجوز أن يكون فعلا { تشاءون } و { يشاء الله } منزلين منزلة اللازم فلا يقدر لهما مفعولان على طريقة قول البحْتري :أنْ يَرَى مُبْصِر وَيَسْمَع وَاعٍ ... ويكون الاستثناء من أحوال ، أي وما تحصل مشيئتكم في حال من الأحوال إلاّ في حال حصول مشيئة الله . وفي هذا كله إشارة إلى دقة كنه مشيئة العبد تجاه مشيئة الله وهو المعنى الذي جمعَ الأشعريُّ التعبيرَ عنه بالكسب ، فقيل فيه «أدق من كسب الأشعري» . ففي الآية تنبيه الناس إلى هذا المعنى الخفي ليرقبوه في أنفسهم فيجدوا آثاره الدالة عليه قائمة متوافرة ، ولهذا أطنب وصف هذه المشيئة بالتذييل بقوله : { إن الله كان عليماً حكيماً } فهو تذييل أو تعليل لجملة{ يدخل من يشاء في رحمته } [ الإنسان : 31 ] ، أي لأنه واجب له العلم والحكمة فهو أعلم فمن شاء أن يدخله في رحمته ومن شاء أبعده عنها .وهذا إطناب لم يقع مثله في قوله تعالى في سورة عبس ( 11 ، 12 ) : { كلاّ إن هذه تذكرة فمن شاء ذكره } لأن حصول التذكر من التذكرة أقرب وأمكن ، من العمل بها المعبِر عنه بالسبيل الموصلة إلى الله تعالى فلذلك صُرفت العناية والاهتمامُ إلى ما يُلَوِّح بوسيلة اتخاذ تلك السبيل .وفعل كان } يدل على أن وصفه تعالى بالعلم والحكمة وصف ذاتي لأنهما واجبان له .وقد حصل من صدر هذه الآية ونهايتها ثبوت مشيئتين : إحداهما مشيئة العباد ، والأخرى مشيئة الله ، وقد جمعتهما هذه الآية فكانت أصلاً للجمع بين متعارض الآيات القرآنية المقتضي بعضُها بانفرادِه نَوْطَ التكاليف بمشيئة العباد وثوابَهم وعقابهم على الأفعال التي شاءوها لأنفسهم ، والمقتضي بعضُها الآخر مشيئةً لله في أفعال عباده .فأما مشيئة العباد فهي إذا حصلت تحصل مباشرةً بانفعال النفوس لفاعليَّة الترغيب والترهيب ، وأما مشيئة الله انفعالَ النفوس فالمراد بها آثار المشيئة الإلهية التي إن حصلتْ فحصلت مشيئة العبد عَلِمْنا أن الله شاء لعبده ذلك وتلك الآثار هي مجموع أمور تتظاهر وتتجمع فتحصل منها مشيئة العبد .وتلك الآثار هي ما في نظام العالم والبشرِ من آثار قدرة الله تعالى وخلقه من تأثير الزمان والمكان وتكوين الخلقة وتركيب الجسم والعقل ، ومدى قابلية التفهم والفهم وتسلط المجتمع والبيئة والدعاية والتلقين على جميع ذلك ، مِما في ذلك كله من إصابة أو خطأ ، فإذا استتبت أسباب قبول الهدى من مجموع تلك الآثار وتَلاءَم بعضُها مع بعض أو رجَح خَيْرها على شرها عَرَفْنا مشيئة الله لأن تلك آثار مشيئته من مجموع نظام العالم ولأنه تعالى عالم بأنها تستتب لفلان ، فعلمُه بتوفرها مع كونها آثار نظامه في الخلق وهو معنى مشيئته ، وإذا تعاكست وتنافر بعضُها مع بعض ولم يرجح خيرها على شرها بل رجح شرها على خيرها بالنسبة للفرد من الناس تعطل وصول الخير إلى نفسه فلم يشأه ، عرفنا أن الله لم يشأ له قبول الخير وعرفنا أن الله عالم بما حفّ بذلك الفرد ، فذلك معنى أن الله لم يشأ له الخير ، أو بعبارة أخرى أنه شاء له أن يَشاء الشر ، ولا مخلص للعبد من هذه الرِبقة إلاّ إذا توجهت إليه عنايةُ من الله ولطف فكَوَّن كائنات إذا دخلت تلك الكائناتُ فيما هو حاف بالعبد من الأسباب والأحوال غَيَّرَتْ أحوالَها وقلَبت آثارهما رأساً على عَقب ، فصار العبد إلى صلاح بعد أن كان مغموراً بالفساد فتتهيأ للعبد حالة جديدة مخالفة لما كان حافاً به ، مثل ما حصل لعمر بن الخطاب من قبول عظيم الهُدى وتوغله فيه في حين كان متلبساً بسابغ الضلالة والعناد .فمثل هذا يكون تكرمة من الله للعبد وعناية به ، وإنما تحصل هذه العناية بإرادة من الله خاصة : إما لأن حكمته اقتضت ذلك للخروج بالناس من شر إلى خير كما قال رسول الله صلى الله عليه وسلم \" اللهمّ أعز الإِسلام بأحدِ العُمرين \" وإما بإجابة دعوة داع استجيب له فقد أسلم عُمر بن الخطاب عقب دعوة النبي صلى الله عليه وسلم المذكورة ودخل في الإِسلام عقب قول النبي صلى الله عليه وسلم له : \" أما آن لك يا ابن الخطاب أن تُسلم \" ألا ترى أن الهداية العظمى التي أوتيها محمّد صلى الله عليه وسلم كانت أثراً من دعوة إبراهيم عليه السلام بقوله : { ربنا وابْعَثْ فيهم رسولاً منهم } [ البقرة : 129 ] الآية قال النبي صلى الله عليه وسلم \" أنا دَعْوَةُ إِبراهيم \"فهذا ما أمكن من بيان هاتين المشيئتين بحسب المستطاع ولعل في ذلك ما يفسر قول الشيخ أبي الحسن الأشعري في معنى الكسب والاستطاعة «إنها سلامة الأسباب والآلات» .وبهذا بطل مذهب الجبرية لأن الآية أثبتت مشيئة للناس وجعلت مشيئة الله شرطاً فيها لأن الاستثناء في قوة الشرط ، فللإنسان مشيئته لا محالة .وأما مذهب المعتزلة فغير بعيد من قول الأشعري إلاّ في العبارة بالخَلْق أو بالكسب ، وعبارة الأشعري أرشَق وأعلق بالأدب مع الله الخالِق ، وإلاّ في تحقيق معنى مشيئة الله ، والفرق بينها وبين الأمر أو عدم الفرق وتفصيله في علم الكلام .وقرأ نافع وعاصم وحمزة والكسائي ويعقوب { وما تشاءون } بتاء الخطاب على الالتفات من الغيبة إلى الخطاب ، وقرأه ابن كثير وابن عامر وأبو عمرو وخلف بياء الغائب عائداً إلى { فمَن شاء } [ الإنسان : 29 ] .\n","ar.waseet":"ثم بين - سبحانه - أن مشيئته فوق كل مشيئة فقال : ( وَمَا تَشَآءُونَ إِلاَّ أَن يَشَآءَ الله ) .أى : وما تشاءون شيئا من الأشياء ، إلا بعد خضوع هذا الشئ لمشيئة الله - تعالى - وإرادته ، إذ هو الخالق - سبحانه - لكل شئ ، وهو صاحب الخلق والأمر تبارك الله رب العالمين .( إِنَّ الله كَانَ عَلِيماً حَكِيماً ) أى : إنه - تعالى - كان وما صاحب العلم المطلق الذى لا يحده شئ ، وصاحب الحكمة البليغة التى لا نهاية لها .\n","ar.baghawi":"\"وما تشاؤون\"، قرأ ابن كثير، وابن عامر، وأبو عمرو: يشاؤون بالياء، وقرأ الآخرون بالتاء، \"إلا أن يشاء الله\" أي لستم تشاؤون إلا بمشيئة الله عز وجل، لأن الأمر إليه \"إن الله كان عليماً حكيماً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5621.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5621.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5621.mp3","format":"mp3","local_path":null}}},{"verse":31,"arabic":"يُدْخِلُ مَنْ يَشَاءُ فِي رَحْمَتِهِ ۚ وَالظَّالِمِينَ أَعَدَّ لَهُمْ عَذَابًا أَلِيمًا","transliteration":"Yudkhilu mai yashaaa'u fee rahmatih; wazzaalimeena a'adda lahum 'azaaban aleemaa","translations":{"en.ahmedali":"He admits whosoever He will to His benevolence. But for the evil-doers He has prepared a painful punishment.","en.ahmedraza":"He admits into His mercy, whomever He wills; and for the unjust He has kept prepared a painful punishment.","en.arberry":"For He admits into His mercy whomsoever He will; as for the evildoers, He has prepared for them a painful chastisement.","en.asad":"He admits unto His grace everyone who wills [to be admitted]; but as for the evildoers - for them has He readied grievous suffering [in the life to come].","en.daryabadi":"He maketh whomsoever He listeth to enter His mercy. And the wrong-doers! for them He hath gotten ready a torment afflective.","en.hilali":"He will admit to His Mercy whom He will and as for the Zalimun, (polytheists, wrong-doers, etc.) He has prepared a painful torment.","en.pickthall":"He maketh whom He will to enter His mercy, and for evil-doers hath prepared a painful doom.","en.qaribullah":"He is Merciful to whom He will; but, for the harmdoers He has prepared for them a painful punishment.","en.sahih":"He admits whom He wills into His mercy; but the wrongdoers - He has prepared for them a painful punishment.","en.sarwar":"He admits to His mercy whomever He wants. For the unjust He has prepared a painful punishment.","en.yusufali":"He will admit to His Mercy whom He will; But the wrong-doers,- for them has He prepared a grievous Penalty.","en.maududi":"He admits to His Mercy whomsoever He pleases. As for the wrong-doers, He has prepared for them a grievous chastisement.","en.shakir":"He makes whom He pleases to enter into His mercy; and (as for) the unjust, He has prepared for them a painful chastisement.","en.itani":"He admits into His mercy whomever He wills. But as for the wrongdoers, He has prepared for them a painful punishment.","en.mubarakpuri":"He will admit to His mercy whom He wills and as for the wrongdoers -- He has prepared a painful torment.","en.qarai":"He admits whomever He wishes into His mercy, and He has prepared a painful punishment for the wrongdoers.","en.wahiduddin":"He admits whoever He will into His grace and has prepared a painful punishment for the evil doers."},"tafsir":{"ar.muyassar":"إن هذه السورة عظة للعالمين، فمن أراد الخير لنفسه في الدنيا والآخرة اتخذ بالإيمان والتقوى طريقًا يوصله إلى مغفرة الله ورضوانه. وما تريدون أمرًا من الأمور إلا بتقدير الله ومشيئته. إن الله كان عليمًا بأحوال خلقه، حكيمًا في تدبيره وصنعه. يُدْخل مَن يشاء مِن عباده في رحمته ورضوانه، وهم المؤمنون، وأعدَّ للظالمين المتجاوزين حدود الله عذابًا موجعًا.","ar.jalalayn":"«يُدخل من يشاء في رحمته» جنته وهم المؤمنون «والظالمين» ناصبه فعل مقدر، أي أعد يفسره «أَعد لهم عذابا أليما» مؤلماً وهم الكافرون.","ar.qurtubi":"يدخل من يشاء في رحمته أي يدخله الجنة راحما له والظالمين أي ويعذب الظالمين فنصبه بإضمار يعذب . قال الزجاج : نصب الظالمين لأن قبله منصوبا ; أي يدخل من يشاء في رحمته ويعذب الظالمين أي المشركين ويكون أعد لهم تفسيرا لهذا المضمر ; كما قال الشاعر :أصبحت لا أحمل السلاح ولا أملك رأس البعير إن نفرا     والذئب أخشاه إن مررت بهوحدي وأخشى الرياح والمطراأي أخشى الذئب أخشاه . قال الزجاج : والاختيار النصب وإن جاز الرفع ; تقول : أعطيت زيدا وعمرا أعددت له برا ، فيختار النصب ; أي وبررت عمرا أو أبر عمرا . وقوله في ( حم عسق ) : ( يدخل من يشاء في رحمته والظالمون ) ارتفع لأنه لم يذكر بعده فعل يقع عليه فينصب في المعنى ; فلم يجز العطف على المنصوب قبله فارتفع بالابتداء . وهاهنا قوله : أعد لهم عذابا يدل على ويعذب ، فجاز النصب . وقرأ أبان بن عثمان والظالمون رفعا بالابتداء والخبر أعد لهم . عذابا أليما أي مؤلما موجعا . وقد تقدم هذا في سورة ( البقرة ) وغيرها والحمد لله . ختمت السورة .\n","ar.miqbas":"يُدْخِلُ مَنْ يَشَاءُ فِي رَحْمَتِهِ وَالظَّالِمِينَ أَعَدَّ لَهُمْ عَذَابًا أَلِيمًا (31)يجوز أن تكون الجملة مستأنفة استئنافاً بيانياً ناشئاً عن جملة { وما تشاءون إلاّ أن يشاء الله } [ الإنسان : 30 ] إذْ يتساءل السامع على أثر مشيئة الله في حال من اتخذ إلى ربه سبيلاً ومن لم يتخذ إليه سبيلاً ، فيجاب بأنه يُدخل في رحمته من شاء أن يتخذ إليه سبيلاً وأنه أعد لمن لم يتخذ إليه سبيلاً عذاباً أليماً وأولئك هم الظالمون .ويجوز أن تكون الجملة خبر { إنَّ } في قوله : { إن الله } [ الإنسان : 30 ] وتكون جملة { كان عليماً حكيماً } [ الإنسان : 30 ] معترضة بين اسم { إن } وخبرها أو حالاً ، وهي على التقديرين منبئة بأن إجراء وصفي العليم الحكيم على اسم الجلالة مراد به التنبيه على أن فعله كله من جزاء برحمةٍ أو بعذاب جارٍ على حسب علمه وحكمته .وانتصب { الظالمين } على أنه مفعول لفعل محذوف يدل عليه المذكور على طريقة الاشتغال والتقدير : أوْعد الظالمين ، أو كَافأ ، أو نحوَ ذلك مما يقدره السامع مناسباً للفعل المذكور بعده .\n","ar.waseet":"( يُدْخِلُ ) - سبحانه - ( مَن يَشَآءُ ) إدخاله ( فِي رَحْمَتِهِ ) لا راد لقضائه ولا معقب لحكمه .( والظالمين أَعَدَّ لَهُمْ ) - سبحانه - ( عَذَاباً أَلِيماً ) بسبب إصرارهم على ظلمهم ، وإيثارهم الباطل على الحق ، والغى على الرشد .نسأل الله - تعالى - أن يجعلنا ممن هم أهل لرحمته ورضوانه ، وأن يبعدنا عمن هم أهل لعذابه ونقمته .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"\"يدخل من يشاء في رحمته والظالمين\"، أي المشركين. \"أعد لهم عذاباً أليماً\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5622.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5622.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5622.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":254,"letters":2022,"size":"244KB","priority":3,"commonlyRead":false}}