{"chapter":80,"name":{"arabic":"سورة 80","transliteration":"Chapter 80","translation":"Chapter 80","revelation":"unknown"},"revelation":"unknown","verses":42,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ عَبَسَ وَتَوَلَّىٰ","transliteration":"'Abasa wa tawallaa.","translations":{"en.ahmedali":"HE FROWNED AND turned away,","en.ahmedraza":"He frowned and turned away.","en.arberry":"He frowned and turned away","en.asad":"HE FROWNED and turned away","en.daryabadi":"He frowned and turned away.","en.hilali":"(The Prophet (Peace be upon him)) frowned and turned away,","en.pickthall":"He frowned and turned away","en.qaribullah":"He frowned and turned away","en.sahih":"The Prophet frowned and turned away","en.sarwar":"He frowned and then turned away","en.yusufali":"(The Prophet) frowned and turned away,","en.maududi":"He frowned and turned away","en.shakir":"He frowned and turned (his) back,","en.itani":"He frowned and turned away.","en.mubarakpuri":"He frowned and turned away.","en.qarai":"He frowned and turned away","en.wahiduddin":"He frowned and turned away"},"tafsir":{"ar.muyassar":"ظهر التغير والعبوس في وجه الرسول صلى الله عليه وسلم، وأعرض لأجل أن الأعمى عبد الله بن أم مكتوم جاءه مسترشدا، وكان الرسول صلى الله عليه وسلم منشغلا بدعوة كبار قريش إلى الإسلام.","ar.jalalayn":"«عبس» النبي: كلح وجهه «وتولى» أعرضَ لأجل:","ar.qurtubi":"سورة عبسمكية في قول الجميع ، وهي إحدى وأربعون آيةبسم الله الرحمن الرحيمعبس وتولىفيه  مسائل :الأولى : قوله تعالى : عبس أي كلح بوجهه ; يقال : عبس وبسر . وقد تقدم . وتولى أي أعرض بوجهه أن جاءه أن في موضع نصب لأنه مفعول له ، المعنى لأن جاءه الأعمى ، أي الذي لا يبصر بعينيه . فروى أهل التفسير أجمع أن قوما من أشراف قريش كانوا عند النبي - صلى الله عليه وسلم - وقد طمع في إسلامهم ، فأقبل عبد الله بن أم مكتوم ، فكره رسول الله - صلى الله عليه وسلم - أن يقطع عبد الله عليه كلامه ، فأعرض عنه ، ففيه نزلت هذه الآية .قال مالك : إن هشام بن عروة حدثه عن عروة ، أنه قال : نزلت عبس وتولى في ابن أم مكتوم ; جاء إلى النبي - صلى الله عليه وسلم - فجعل يقول : يا محمد استدنني ، وعند النبي - صلى الله عليه وسلم - رجل من عظماء المشركين ، فجعل النبي - صلى الله عليه وسلم - يعرض عنه ويقبل على الآخر ، ويقول : \" يا فلان ، هل ترى بما أقول بأسا \" ؟ فيقول : لا والدمى ما أرى بما تقول بأسا ; فأنزل الله : عبس وتولى . وفي الترمذي مسندا [ ص: 183 ] قال : حدثنا سعيد بن يحيى بن سعيد الأموي ، حدثني أبي ، قال هذا ما عرضنا على هشام بن عروة عن أبيه عن عائشة ، قالت : نزلت عبس وتولى في ابن أم مكتوم الأعمى ، أتى رسول الله - صلى الله عليه وسلم - فجعل ، يقول : يا رسول الله أرشدني ، وعند رسول الله - صلى الله عليه وسلم - رجل من عظماء المشركين ، فجعل رسول الله - صلى الله عليه وسلم - يعرض عنه ، ويقبل على الآخر ، ويقول : \" أترى بما أقول بأسا \" فيقول : لا ; ففي هذا نزلت ; قال : هذا حديث غريب .الثانية : الآية عتاب من الله لنبيه - صلى الله عليه وسلم - في إعراضه وتوليه عن عبد الله بن أم مكتوم . ويقال : عمرو بن أم مكتوم ، واسم أم مكتوم عاتكة بنت عامر بن مخزوم ، وعمرو هذا : هو ابن قيس بن زائدة بن الأصم ، وهو ابن خال خديجة - رضي الله عنها - . وكان قد تشاغل عنه برجل من عظماء المشركين ، يقال كان الوليد بن المغيرة .ابن العربي : قاله المالكية من علمائنا ، وهو يكنى أبا عبد شمس . وقال قتادة : هو أمية بن خلص وعنه : أبي بن خلف . وقال مجاهد : كانوا ثلاثة : عتبة وشيبة ابنا ربيعة وأبي بن خلف . وقال عطاء عتبة بن ربيعة . سفيان الثوري : كان النبي - صلى الله عليه وسلم - مع عمه العباس . الزمخشري : كان عنده صناديد قريش : عتبة وشيبة ابنا ربيعة ، وأبو جهل بن هشام ، والعباس بن عبد المطلب ، وأمية بن خلف ، والوليد بن المغيرة يدعوهم إلى الإسلام ، رجاء أن يسلم بإسلامهم غيرهم .قال ابن العربي : أما قول علمائنا إنه الوليد بن المغيرة فقد قال آخرون إنه أمية بن خلف والعباس وهذا كله باطل وجهل من المفسرين الذين لم يتحققوا الدين ، ذلك أن أمية بن خلف والوليد كانا بمكة وابن أم مكتوم كان بالمدينة ، ما حضر معهما ولا حضرا معه ، وكان موتهما كافرين ، أحدهما قبل الهجرة ، والآخر ببدر ، ولم يقصد قط أمية المدينة ، ولا حضر عنده مفردا ، ولا مع أحد .الثالثة : أقبل ابن أم مكتوم والنبي - صلى الله عليه وسلم - مشتغل بمن حضره من وجوه قريش يدعوهم إلى الله تعالى ، وقد قوي طمعه في إسلامهم وكان في إسلامهم إسلام من وراءهم من قومهم ، فجاء ابن أم مكتوم وهو أعمى فقال : يا رسول الله علمني مما علمك الله ، وجعل يناديه ويكثر النداء ، ولا يدري أنه مشتغل بغيره ، حتى ظهرت الكراهة في وجه رسول الله - صلى الله عليه وسلم - لقطعه كلامه ، وقال في نفسه : يقول هؤلاء : إنما أتباعه العميان والسفلة والعبيد ; فعبس وأعرض عنه ، فنزلت الآية . قال الثوري : فكان النبي - صلى الله عليه وسلم - بعد ذلك إذا رأى ابن أم مكتوم يبسط له رداءه ويقول : \" مرحبا بمن عاتبني فيه ربي \" . ويقول : \" هل من حاجة \" ؟ واستخلفه على المدينة مرتين في غزوتين غزاهما . قال أنس : فرأيته يوم القادسية راكبا وعليه درع ومعه راية سوداء .الرابعة : قال علماؤنا : ما فعله ابن أم مكتوم كان من سوء الأدب لو كان عالما بأن [ ص: 184 ] النبي - صلى الله عليه وسلم - مشغول بغيره ، وأنه يرجو إسلامهم ، ولكن الله تبارك وتعالى عاتبه حتى لا تنكسر قلوب أهل الصفة ; أو ليعلم أن المؤمن الفقير خير من الغني ، وكان النظر إلى المؤمن أولى وإن كان فقيرا أصلح وأولى من الأمر الآخر ، وهو الإقبال على الأغنياء طمعا في إيمانهم ، وإن كان ذلك أيضا نوعا من المصلحة ، وعلى هذا يخرج قوله تعالى : ما كان لنبي أن يكون له أسرى الآية على ما تقدم . وقيل : إنما قصد النبي - صلى الله عليه وسلم - تأليف الرجل ، ثقة بما كان في قلب ابن أم مكتوم من الإيمان ; كما قال : \" إني لأصل الرجل وغيره أحب إلي منه ، مخافة أن يكبه الله في النار على وجهه \" .الخامسة : قال ابن زيد : إنما عبس النبي - صلى الله عليه وسلم - لابن أم مكتوم وأعرض عنه ; لأنه أشار إلى الذي كان يقوده أن يكفه ، فدفعه ابن أم مكتوم ، وأبى إلا أن يكلم النبي - صلى الله عليه وسلم - حتى يعلمه ، فكان في هذا نوع جفاء منه . ومع هذا أنزل الله في حقه على نبيه - صلى الله عليه وسلم - : عبس وتولى بلفظ الإخبار عن الغائب ، تعظيما له ولم يقل : عبست وتوليت .\n","ar.miqbas":"عَبَسَ وَتَوَلَّى (1) افتتاح هذه السورة بفعلين متحملين لضمير لا معاد له في الكلام تشويق لما سيورد بعدهما ، والفعلان يشعران بأن المحكي حادث عظيم ، فأما الضمائر فيبين إبهامها قولُه : { فأنت له تصدى } [ عبس : 6 ] وأما الحادث فيتبين من ذكر الأعمى ومَن استغنى .وهذا الحادث سبب نزول هذه الآيات من أولها إلى قوله : { بررة } [ عبس : 16 ] . وهو ما رواه مالك في «الموطأ» مرسلاً عن هشام بن عروة عن أبيه أنه قال : أنزلت { عبس وتولى } في ابن أم مكتوم جاء إلى رسول الله صلى الله عليه وسلم فجعل يقول : يا محمد استدنني ، وعند النبي صلى الله عليه وسلم رجل من عظماء المشركين فجعل النبي صلى الله عليه وسلم يعرض عنه ( أي عن ابن أم مكتوم ) ويُقبل على الآخر ، ويقول : يا أبا فلان هل ترى بما أقول بأساً فيقول : «لا والدِّماء ما أرى بما تقول يأساً» ، فأنزلت : { عبس وتولى } .ورواه الترمذي مسنداً عن عروة عن عائشة بقريب من هذا ، وقال الترمذي : هذا حديث حسن غريب .وروى الطبري عن ابن عباس : «أن ابن أم مكتوم جاء يستقرىءُ النبي صلى الله عليه وسلم آيةً من القرآن ومثله عن قتادة .وقال الواحدي وغيره : «كان النبي صلى الله عليه وسلم حينئذ يناجي عتبَة بن ربيعة وأبا جهل ، والعباسَ بن عبد المطلب ، وأبيَّ بن خلف ، وشيبة بن ربيعة ، والوليد بن المغيرة ، والنبي صلى الله عليه وسلم يقبل على الوليد بن المغيرة يَعرض عليهم الإِسلام . 6\n","ar.waseet":"قد ذكر المفسرون فى سبب نزول هذه الآيات روايات ملخصها : \" أن النبى صلى الله عليه وسلم كان جالسا فى أحد الأيام ، مع جماعة من زعماء قريش يدعوهم إلى الإِسلام ، ويشرح لهم تعاليمه ، فأقبل عبد الله بن أم مكتوم - وكان كفيف البصر - فقال : أقرئنى وعلمن مما علمك الله ، يا رسول الله ، وكرر ذلك ، وهو لا يعلم أن الرسول صلى الله عليه وسلم مشغول بدعوة هؤلاء الزعماء إلى الإِسلام ، رجاء أن يسلم بسبب إسلامهم خلق كثير . .فلما أكثر عبد الله من طلبه ، أعرض عنه الرسول صلى الله عليه وسلم فنزلت هذه الآيات التى عاتب الله - تعالى - فيها نبيه صلى الله عليه وسلم على هذا الإِعراض . . فكان رسول الله صلى الله عليه وسلم بعد ذلك يكرمه ، إذا رآه ، ويقول له : \" مرحبا بمن عاتبنى فيه ربى \" ويبسط له رداءه . . \"قال الآلوسى : وعبد الله بن أم مكتوم ، هو ابن خال السيدة خديجة ، واسمه عمرو بن قيس . وأم مكتوم كنية أمه ، واسها عاتكة بنت عبد الله المخزومية ، واستخلفه صلى الله عليه وسلم على المدينة أكثر من مرة . . وهو من المهاجرين الأولين . قيل : مات بالقادسية شهيدا نوح فتح المدائن أيام عمر بن الخطاب - رضى الله عنه . .ولفظ \" عبس \" - من باب ضرب - مأخوذ من العبوس ، وهو تقطيب الوجه ، وتغير هيئته مما يدل على الغضب .وقوله ( وتولى ) مأخوذ من التولى وأصله تحول الإِنسان عن مكانه الذى هو فيه إلى مكان آخر ، والمراد به هنا الإِعراض عن السائل وعدم الإِقبال عليه .وحذف متعلق التولى ، لمعرفة ذلك من سياق الآيات ، إذ من المعروف أن إعراضه صلى الله عليه وسلم كان عن عبد الله ابن أم مكتوم الذى قاطعه خلال حديثه مع بعض زعماء قريش .\n","ar.baghawi":"مكية\"عبس\"، كلح، \"وتولى\"، أعرض بوجهه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5759.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5759.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5759.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"أَنْ جَاءَهُ الْأَعْمَىٰ","transliteration":"An jaa-ahul 'a-maa","translations":{"en.ahmedali":"Because a blind man came to him.","en.ahmedraza":"Because the blind man had come in his august presence.","en.arberry":"that the blind man came to him.","en.asad":"because the blind man approached him!","en.daryabadi":"Because there came Unto him a blind man.","en.hilali":"Because there came to him the blind man (i.e. 'Abdullah bin Umm-Maktum, who came to the Prophet (Peace be upon him) while he was preaching to one or some of the Quraish chiefs).","en.pickthall":"Because the blind man came unto him.","en.qaribullah":"when the blind came to him.","en.sahih":"Because there came to him the blind man, [interrupting].","en.sarwar":"from a blind man who had come up to him.","en.yusufali":"Because there came to him the blind man (interrupting).","en.maududi":"that the blind man came to him.","en.shakir":"Because there came to him the blind man.","en.itani":"When the blind man approached him.","en.mubarakpuri":"Because there came to him the blind man.","en.qarai":"when the blind man approached him.","en.wahiduddin":"when the blind man approached him,"},"tafsir":{"ar.muyassar":"ظهر التغير والعبوس في وجه الرسول صلى الله عليه وسلم، وأعرض لأجل أن الأعمى عبد الله بن أم مكتوم جاءه مسترشدا، وكان الرسول صلى الله عليه وسلم منشغلا بدعوة كبار قريش إلى الإسلام.","ar.jalalayn":"(أن جاءه الأعمى) عبد الله بن أم مكتوم فقطعه عما هو مشغول به ممن يرجو إسلامه من أشراف قريش الذين هو حريص على إسلامهم، ولم يدر الأعمى أنه مشغول بذلك فناداه: علمني مما علمك الله، فانصرف النبي صلى الله عليه وسلم إلى بيته فعوتب في ذلك بما نزل في هذه السورة، فكان بعد ذلك يقول له إذا جاء: \"\" مرحبا بمن عاتبني فيه ربي \"\" ويبسط له رداءه.","ar.qurtubi":"ثم أقبل عليه بمواجهة الخطاب تأنيسا له فقال : وما يدريك أي يعلمك لعله يعني ابن أم مكتوم يزكى بما استدعى منك تعليمه إياه من القرآن والدين ، بأن يزداد طهارة في دينه ، وزوال ظلمة الجهل عنه . وقيل : الضمير في لعله للكافر يعني إنك إذا طمعت في أن يتزكى بالإسلام أو يذكر ، فتقربه الذكرى إلى قبول الحق وما يدريك أن ما طمعت فيه كائن .وقرأ الحسن ( آأن جاءه الأعمى ) بالمد على الاستفهام ف \" أن \" متعلقة بفعل محذوف دل عليه عبس وتولى ، التقدير : آأن جاءه أعرض عنه وتولى ؟ فيوقف على هذه القراءة على وتولى ، ولا يوقف عليه على قراءة الخبر ، وهي قراءة العامة .\n","ar.miqbas":"أَنْ جَاءَهُ الْأَعْمَى (2) ولا خلاف في أن المراد ب { الأعمى } هو ابن أم مكتوم . قيل : اسمه عبد الله وقيل : اسمه عَمْرو ، وهو الذي اعتمده في «الإِصابة» ، وهو ابن قيس بن زائدة من بني عامر بن لؤي من قريش .وأمه عاتكة ، وكنيت أمَّ مكتوم لأن ابنها عبد الله ولد أعمى والأعمى يكنى عنه بمكتوم . ونسب إلى أمه لأنها أشرف بيتاً من بيت أبيه لأن بني مخزوم من أهل بيوتات قريش فوق بني عامر بن لؤي . وهذا كما نسب عَمْرو بن المنذر ملكُ الحِيرة إلى أمه هند بنت الحارث بن عمرو بن حُجر آكِل المُرار زيادة في تشريفه بوراثة الملك من قبل أبيه وأمه .ووقع في «الكشاف» : أن أم مكتوم هي أم أبيه . وقال الطيبي : إنه وهَم ، وأسلم قديماً وهاجر إلى المدينة قبل مقدم النبي صلى الله عليه وسلم إليها ، وتوفي بالقادسية في خلافة عمر بعد سنة أربع عشرة أو خمس عشرة .وفيه نزلت هذه السورة وآيةُ { غيرَ أُولي الضرر } من سورة النساء ( 95 ) .وكان النبي يحبّه ويُكرمه وقد استخلفه على المدينة في خروجه إلى الغزوات ثلاث عشرة مرة ، وكان مؤذِّنَ النبي هو وبلال بن رباح .والعُبوسُ بضم العين : تقطيب الوجه وإظهار الغضب .ويقال : رجل عَبوس بفتح العين ، أي متقطب ، قال تعالى : { إنا نخاف من ربنا يوماً عبوساً قمطريراً } [ الإنسان : 10 ] . وعبس من باب ضرَب .والتولي : أصله تحوّل الذات عن مكانها ، ويستعار لعدم اشتغال المرء بكلام يلقَى إليه أو جليس يحلّ عنده ، وهو هنا مستعار لعدم الاشتغال بسؤال سائل ولعدم الإِقبال على الزائر .وحذف متعلق { تولّى } لظهور أنه تولَ عن الذي مجيئه كان سبب التولي .وعبر عن ابن أم مكتوم ب { الأعمى } ترقيقاً للنبيء صلى الله عليه وسلم ليكون العتاب ملحوظاً فيه أنه لما كان صاحب ضَرارة فهو أجدر بالعناية به ، لأن مثله يكون سريعاً إلى انكسار خاطره .و { أن جاءه الأعمى } مجرور بلام الجر محذوففٍ مع { أن } وهو حذف مطرد وهو متعلق بفعلي { عبس وتولى } على طريقة التنازع .والعلم بالحادثة يدل على أن المراد مجيء خاص وأعمى معهود .وصيغة الخبر مستعملة في العتاب على الغفلة عن المقصود الذي تضمنه الخبر وهو اقتصار النبي صلى الله عليه وسلم على الاعتناء بالحرص على تبليغ الدعوة إلى من يرجو منه قبولَها مع الذهول عن التأمل فيما يقارن ذلك من تعليم من يرغب في علم الدين ممن آمن ، ولما كان صدور ذلك من الله لنبيه صلى الله عليه وسلم لم يشأ الله أن يفاتحه بما يتبادر منه أنه المقصود بالكلام ، فوجهه إليه على أسلوب الغيبة ليكون أول ما يقرع سمعه باعثاً على أن يترقب المعنيَّ من ضمير الغائب فلا يفاجئه العتاب ، وهذا تلطف من الله برسوله صلى الله عليه وسلم ليقع العتاب في نفسه مدرجاً وذلك أهون وقعاً ، ونظير هذا قوله : { عفا اللَّه عنك لم أذنت لهم } [ التوبة : 43 ] .قال عياض : قال عون بن عبد الله والسمرقندي : أخبره الله بالعفو قبل أن يخبره بالذنب حتى سكن قلبه ا ه . فكذلك توجيه العتاب إليه مسنداً إلى ضمير الغائب ثم جيء بضمائر الغيبة فذكر الأعمى تظهر المراد من القصة واتضح المراد من ضمير الغيبة .ثم جيء بضمائر الخطاب على طريقة الالتفات .ويظهر أن النبي صلى الله عليه وسلم رجا من ذلك المجلس أن يُسلموا فيسلم بإسلامهم جمهور قريش أو جميعهم فكان دخول ابن أم مكتوم قطعاً لسلك الحديث وجعل يقول للنبيء صلى الله عليه وسلم يا رسول الله استدنني ، علمني ، أرشدني ، ويناديه ويكثر النداء والإِلحاح فظهرت الكراهية في وجه الرسول صلى الله عليه وسلم لعله لقطعه عليه كلامه وخشيته أن يفترق النفر المجتمعون ، وفي رواية الطبري أنه استقرأ النبي صلى الله عليه وسلم آية من القرآن .\n","ar.waseet":"وأل فى قوله - تعالى - : ( الأعمى ) للعهد . والمقصود بهذا الوصف : التعريف وليس التنقيص من قدر عبد الله بن أم مكتوم - رضى الله عنه - وكذلك فى هذا الوصف إيماء إلى أن له عذرا فى مقاطعة الرسول صلى الله عليه وسلم عند حديثه مع زعماء قريش ، فهو لم يكن يراه وهو يحادثهم ويدعوهم إلى الإِسلام .وجاء الحديث عن هذه القصة بصيغة الحكاية ، وبضمير الغيبة ، للإِشعار بأن هذه القصة ، من الأمور التى لا يحب الله - تعالى - أن يواجه بها نبيه صلى الله عليه وسلم على سبيل التكريم له ، والعطف عليه ، والرحمة به .\n","ar.baghawi":"( أن جاءه الأعمى ) [ أي : لأن جاءه الأعمى ] وهو ابن أم مكتوم ، واسمه عبد الله بن شريح بن مالك بن ربيعة الفهري من بني عامر بن لؤي ، وذلك أنه أتى رسول الله - صلى الله عليه وسلم - ، وهو يناجي عتبة بن ربيعة ، وأبا جهل بن هشام ، والعباس بن عبد المطلب ، وأبي بن خلف ، وأخاه أمية ، يدعوهم إلى الله ، يرجو إسلامهم ، فقال ابن أم مكتوم : [ يا رسول الله ] أقرئني وعلمني مما علمك الله ، فجعل يناديه ويكرر النداء ، ولا يدري أنه مقبل على غيره حتى ظهرت الكراهية في وجه رسول الله - صلى الله عليه وسلم - لقطعه كلامه ، وقال في نفسه : يقول هؤلاء الصناديد : إنما أتباعه العميان والعبيد والسفلة ، فعبس وجهه وأعرض عنه ، وأقبل على القوم الذين يكلمهم ، فأنزل الله هذه الآيات ، فكان رسول الله - صلى الله عليه وسلم - بعد ذلك يكرمه ، وإذا رآه قال : مرحبا بمن عاتبني فيه ربي ، ويقول له : هل لك من حاجة ؟ واستخلفه على المدينة مرتين في غزوتين غزاهما ، قال أنس بن مالك : فرأيته يوم القادسية عليه درع ومعه راية سوداء .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5760.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5760.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5760.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"وَمَا يُدْرِيكَ لَعَلَّهُ يَزَّكَّىٰ","transliteration":"Wa maa yudreeka la'allahu yaz zakkaa.","translations":{"en.ahmedali":"What made you think that he will not grow in virtue,","en.ahmedraza":"And what do you know, he may be of the pure!","en.arberry":"And what should teach thee? Perchance he would cleanse him,","en.asad":"Yet for all thou didst know, [O Muhammad,] he might perhaps have grown in purity,","en.daryabadi":"How canst thou know, whether haply he might be cleansed,","en.hilali":"But what could tell you that per chance he might become pure (from sins)?","en.pickthall":"What could inform thee but that he might grow (in grace)","en.qaribullah":"And what could let you know? Perhaps he (comes to hear you) to be purified.","en.sahih":"But what would make you perceive, [O Muhammad], that perhaps he might be purified","en.sarwar":"You never know. Perhaps he wanted to purify himself,","en.yusufali":"But what could tell thee but that perchance he might grow (in spiritual understanding)?-","en.maududi":"How could you know? Perhaps he would cleanse himself,","en.shakir":"And what would make you know that he would purify himself,","en.itani":"But how do you know? Perhaps he was seeking to purify himself.","en.mubarakpuri":"And how can you know that he might become pure","en.qarai":"And how do you know, maybe he would purify himself,","en.wahiduddin":"for how can you know that he might seek to purify himself,"},"tafsir":{"ar.muyassar":"وأيُّ شيء يجعلك عالمًا بحقيقة أمره؟ لعله بسؤاله تزكو نفسه وتطهر، أو يحصل له المزيد من الاعتبار والازدجار.","ar.jalalayn":"«وما يُدريك» يعلمك «لعله يزكى» فيه إدغام التاء في الأصل في الزاي، أي يتطهر من الذنوب بما يسمع منك.","ar.qurtubi":"نظير هذه الآية في العتاب قوله تعالى في سورة الأنعام : ولا تطرد الذين يدعون ربهم بالغداة والعشي وكذلك قوله في سورة الكهف : ولا تعد عيناك عنهم تريد زينة الحياة الدنيا وما كان مثله ، والله أعلم .\n","ar.miqbas":"وَمَا يُدْرِيكَ لَعَلَّهُ يَزَّكَّى (3) وجملة { وما يدريك } الخ في موضع الحال .( وما يدريك ) مركبة من ( ما ) الاستفهامية وفعل الدّراية المقترن بهمزة التعدية ، أي ما يجعلك دارياً أي عالماً . ومثله : { ما أدراك } كقوله : { وما أدراك ما الحاقة } [ الحاقة : 3 ] . ومنه { وما يشعركم أنها إذا جاءت لا يؤمنون }في سورة الأنعام ( 109 ) .والاستفهام في هذه التراكيب مراد منه التنبيه على مغفول عنه ثم تقع بعده جملة نحو { ما أدراك ما القارعة } [ القارعة : 3 ] ونحو قوله هنا : { وما يدريك لعله يزكى } .والمعنى أيُّ شيء يجعلك دارياً . وإنما يستعمل مثله لقصد الإجمال ثم التفصيل .قال الراغب : ما ذكر ما أدراك في القرآن إلا وذكر بيانه بعده ا ه . قلت : فقد يُبينه تفصيلٌ مثل قوله هنا : { وما يدريك لعله يزكى } وقوله : { وما أدراك ما ليلة القدر ليلة القدر خير من ألف شهر } [ القدر : 2 3 ] وقد يقع بعده ما فيه تهويل نحو : { وما أدراك ماهيه } [ القارعة : 10 ] أي ما يعلمك حقيقتها وقوله : { وما أدراك ما الحاقة } [ الحاقة : 3 ] أي أيُّ شيء أعلمك جواب : { ما الحاقة } .وفعل : { يدريك } معلق عن العمل في مفعوليه لورود حرف ( لعلّ ) بعده فإن ( لعل ) من موجبات تعليق أفعال القلوب على ما أثبته أبو علي الفارسي في «التذكرة» إلحاقاً للترجي بالاستفهام في أنه طلب . فلما علق فعل { يدريك } عن العمل صار غير متعدَ إلى ثلاثة مفاعيل وبقي متعدياً إلى مفعول واحد بهمزة التعدية التي فيه فصار ما بعده جملة مستأنفة .\n","ar.waseet":"وجملة ( وَمَا يُدْرِيكَ لَعَلَّهُ يزكى ) فى موضع الحال ، وفيها التفات من الغيبة إلى الخطاب ، و \" ما \" استفهامية مبتدأ ، وجملة \" يدريك \" خبره .والكاف مفعول أول ، وجملة الترجى سادة مسد المفعول الثانى . والضمير فى ( لعله ) يعود إلى عبد الله ابن أم مكتوم المعبر عنه بالأعمى .والمعنى : عبس صلى الله عليه وسلم وضاق صدره ، وأعرض بوجهه ، لأن جاءه الرجل الأعمى ، وجعل يخاطبه وهو مشغول بالحديث مع غيره .( وَمَا يُدْرِيكَ ) أى : وأى شئ يجعلك - أيها الرسول الكريم - داريا بحال هذا الأعمى الذى عبست فى وجهه ( لَعَلَّهُ يزكى ) أى : لعله بسبب ما يتعلمه منك يتطهر ويتزكى ، ويزداد نقاء وخشوعا لله رب العالمين .\n","ar.baghawi":"\"وما يدريك لعله يزكى\"، يتطهر من الذنوب بالعمل الصالح وما يتعلمه منك، وقال ابن زيد: يسلم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5761.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5761.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5761.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"أَوْ يَذَّكَّرُ فَتَنْفَعَهُ الذِّكْرَىٰ","transliteration":"Au yaz zak karu fatanfa 'ahuz zikraa.","translations":{"en.ahmedali":"Or be admonished, and the admonition profit him?","en.ahmedraza":"Or that he may accept advice, so the advice may benefit him.","en.arberry":"or yet remember, and the Reminder profit him.","en.asad":"or have been reminded [of the truth], and helped by this reminder.","en.daryabadi":"Or be admonished, so that the admonition might have profited him?","en.hilali":"Or that he might receive admonition, and that the admonition might profit him?","en.pickthall":"Or take heed and so the reminder might avail him?","en.qaribullah":"(He might) remember, and the Reminder might profit him.","en.sahih":"Or be reminded and the remembrance would benefit him?","en.sarwar":"or receive some (Quranic) advice which would benefit him.","en.yusufali":"Or that he might receive admonition, and the teaching might profit him?","en.maududi":"or he might be mindful and good counsel might avail him.","en.shakir":"Or become reminded so that the reminder should profit him?","en.itani":"Or be reminded, and the message would benefit him.","en.mubarakpuri":"Or he might receive admonition, and the admonition might profit him","en.qarai":"or take admonition, and the admonition would benefit him!","en.wahiduddin":"or take heed and derive benefit from [Our] warning?"},"tafsir":{"ar.muyassar":"وأيُّ شيء يجعلك عالمًا بحقيقة أمره؟ لعله بسؤاله تزكو نفسه وتطهر، أو يحصل له المزيد من الاعتبار والازدجار.","ar.jalalayn":"«أو يذكَّر» فيه إدغام التاء في الأصل في الذال أي يتعظ «فتنفعُه الذكرى» العظة المسموعة منك وفي قراءة بنصب تنفعه جواب الترجي.","ar.qurtubi":"أو يذكر يتعظ بما تقول فتنفعه الذكرى أي العظة . وقراءة العامة ( فتنفعه ) بضم العين ، عطفا على يزكى . وقرأ عاصم وابن أبي إسحاق وعيسى فتنفعه نصبا . وهي قراءة السلمي وزر بن حبيش ، على جواب لعل ; لأنه غير موجب ; كقوله تعالى : لعلي أبلغ الأسباب ثم قال : فأطلع .\n","ar.miqbas":"أَوْ يَذَّكَّرُ فَتَنْفَعَهُ الذِّكْرَى (4)والتذكر : حصول أثر التذكير ، فهو خطور أمر معلوم في الذهن بعد نسيانه إذ هو مشتق من الذُّكر بضم الذال .والمعنى : انظر فقد يكون تزكِّيهِ مرجواً ، أي إذا أقبلت عليه بالإِرشاد زاد الإِيمان رسوخاً في نفسه وفَعل خيرات كثيرة مما ترشده إليه فزاد تزكية ، فالمراد ب «يتزكى» تزكية زائدة على تزكية الإِيمان بالتملّي بفضائل شرائعه ومكارم أخلاقه مما يفيضه هديك عليه ، كما قال النبي صلى الله عليه وسلم \" لو أنكم تكونون إذا خرجتم من عندي كما تكونون عندي لصافحتكم الملائكة \" إذ الهدى الذي يزداد به المؤمن رفعة وكمالاً في درجات الإِيمان هو كاهتداء الكافر إلى الإيمان لا سيما إذ الغاية من الاهتداءين واحدة .و { يزكّى } أصله : يتزكى ، قلبت التاء زاياً لتقارب مخرجيهما قصداً ليتأتى الإِدغام وكذلك فُعِل في { يذّكر } من الإِدغام .والتزكّي : مطاوع زكَّاه ، أي يحصل أثر التزكية في نفسه . وتقدم في سورة النازعات .وجملة { أو يذَّكَّر } عطف على { يزَّكَّى } ، أي ما يدريك أن يحصل أحد الأمرين وكلاهما مهم ، أي تحصل الذكرى في نفسه بالإِرشاد لما لم يكن يعلمه أو تذكر لِما كان في غفلة عنه .والذكرى : اسم مصدر التذكير .وفي قوله تعالى : { فتنفعه الذكرى } اكتفاء عن أن يقول : فينفعه التزكي وتنفعه الذكرى لظهور أن كليهما نفع له .والذكرى : هو القرآن لأنّه يذكّر الناس بما يغفلون عنه قال تعالى : { وما هو إلا ذكر للعالمين } [ القلم : 52 ] فقد كان فيما سأل عنه ابن أم مكتوم آيات من القرآن .وقرأ الجمهور : { فتنفعُه } بالرفع عطفاً على «يذّكّر» . وقرأه عاصم بالنصب في جواب : { لعله يزكى } .\n","ar.waseet":"( أو ) لعله ( يذكر ) أى : يتذكر ما كان فى غفلة عنه ( فَتَنفَعَهُ الذكرى ) أى : فتنفعه الموعظة التى سمعها منك .قال الآلوسى ما ملخصه : وفى التعبير عنه صلى الله عليه وسلم بضمير الغيبة إجلال له . . كما أن فى التعبير عنه صلى الله عليه وسلم بضمير الخطاب فى قوله - تعالى - : ( وَمَا يُدْرِيكَ . . . ) إكرام له - أيضا - لما فيه من الإِيناس بعد الإِيحاش والإِقبال بعد الإِعراض . .\n","ar.baghawi":"\"أو يذكر\"، يتعظ، \"فتنفعه الذكرى\"، الموعظة قرأ عاصم: \"فتنفعه\" بنصب العين على جواب لعل بالفاء، وقراءة العامة بالرفع نسقاً على قوله: \"يذكر\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5762.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5762.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5762.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"أَمَّا مَنِ اسْتَغْنَىٰ","transliteration":"Amma manis taghnaa","translations":{"en.ahmedali":"As for him who is not in want of any thing,","en.ahmedraza":"For him who does not care,","en.arberry":"But the self-sufficient,","en.asad":"Now as for him who believes himself to be self-sufficient","en.daryabadi":"As for him who regardeth himself self-sufficient-","en.hilali":"As for him who thinks himself self-sufficient,","en.pickthall":"As for him who thinketh himself independent,","en.qaribullah":"As for he who is sufficed","en.sahih":"As for he who thinks himself without need,","en.sarwar":"Yet you pay attention","en.yusufali":"As to one who regards Himself as self-sufficient,","en.maududi":"Now he who waxes indifferent,","en.shakir":"As for him who considers himself free from need (of you),","en.itani":"But as for him who was indifferent.","en.mubarakpuri":"As for him who thinks himself self-sufficient,","en.qarai":"But as for someone who is wealthy,","en.wahiduddin":"As for him who was indifferent,"},"tafsir":{"ar.muyassar":"أما مَن استغنى عن هديك، فأنت تتعرض له وتصغي لكلامه، وأي شيء عليك ألا يتطهر من كفره؟","ar.jalalayn":"«أما من استغنى» بالمال.","ar.qurtubi":"أي كان ذا ثروة وغنى\n","ar.miqbas":"أَمَّا مَنِ اسْتَغْنَى (5) تقدم الكلام على { أمَّا } في سورة النازعات أنها بمعنى : مهما يكن شيء ، فقوله : { أما من استغنى } تفسيره مهما يكن الذي استغنى فأنت له تصدّى ، أي مهما يكن شيء فالذي استغنى تتصدى له ، والمقصود : أنت تحرص على التصدي له ، فجعل مضمون الجواب وهو التصدّي له معلقاً على وجود من استغنى وملازماً له ملازمة التعليققِ الشرطي على طريقة المبالغة .والاستغناء : عدّ الشخص نفسه غنياً في أمر يدل عليه السياق قول ، أو فعل أو علم ، فالسين والتاء للحسبان ، أي حسب نفسه غنياً ، وأكثر ما يستعمل الاستغناء في التكبر والاعتزاز بالقوة .فالمراد ب { من استغنى } هنا : مَن عدّ نفسه غنياً عَن هديك بأن أعرض عن قبوله لأنه أجاب قول النبي صلى الله عليه وسلم له : « هل ترى بما أقول بَأساً ، بقوله : لا والدماء . . . » كناية عن أنه لا بأس به يريد ولكني غيرُ محتاج إليه .وليس المراد ب { من استغنى } من استغنى بالمال إذ ليس المقام في إيثار صاحب مال على فقير .وهذا الذي تصدَّى النبي صلى الله عليه وسلم لدعوته وعرض القرآن عليه هو على أشهر الأقوال المروية عن سلف المفسرين الوليد بن المغيرة المخزومي كما تقدم .\n","ar.waseet":"ثم فصل - سبحانه - ما كان منه صلى الله عليه وسلم بالنسبة لهذه القصة فقال : ( أَمَّا مَنِ استغنى فَأَنتَ لَهُ تصدى وَمَا عَلَيْكَ أَلاَّ يزكى . وَأَمَّا مَن جَآءَكَ يسعى . وَهُوَ يخشى . فَأَنتَ عَنْهُ تلهى ) أى : أما من استغنى عن الإِيمان ، وعن إرشادك - أيها الرسول الكريم - واعتبر نفسه فى غنى عن هديك . .\n","ar.baghawi":"\"أما من استغنى\"، قال ابن عباس: عن الله وعن الإيمان بما له من المال.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5763.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5763.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5763.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"فَأَنْتَ لَهُ تَصَدَّىٰ","transliteration":"Fa-anta lahu tasaddaa","translations":{"en.ahmedali":"You pay full attention,","en.ahmedraza":"So you are after him!","en.arberry":"to him thou attendest","en.asad":"to him didst thou give thy whole attention,","en.daryabadi":"Unto him thou attendest.","en.hilali":"To him you attend;","en.pickthall":"Unto him thou payest regard.","en.qaribullah":"you attended to him,","en.sahih":"To him you give attention.","en.sarwar":"to a rich man,","en.yusufali":"To him dost thou attend;","en.maududi":"you attend to him,","en.shakir":"To him do you address yourself.","en.itani":"You gave him your attention.","en.mubarakpuri":"To him you attend;","en.qarai":"you attend to him,","en.wahiduddin":"you eagerly attended to him --"},"tafsir":{"ar.muyassar":"أما مَن استغنى عن هديك، فأنت تتعرض له وتصغي لكلامه، وأي شيء عليك ألا يتطهر من كفره؟","ar.jalalayn":"«فأنت له تصدى» وفي قراءة بتشديد الصاد بإدغام التاء الثانية في الأصل فيها: تقبل وتتعرض.","ar.qurtubi":"فأنت له تصدى أي تعرض له ، وتصغي لكلامه . والتصدي : الإصغاء ; قال الراعي :تصدى لوضاح كأن جبينه سراج الدجى يحني إليه الأساوروأصله تتصدد من الصد ، وهو ما استقبلك ، وصار قبالتك ; يقال : داري صدد داره أي قبالتها ، نصب على الظرف . وقيل : من الصدى وهو العطش . أي تتعرض له كما يتعرض العطشان للماء ، والمصاداة : المعارضة . وقراءة العامة تصدى بالتخفيف ، على طرح التاء الثانية تخفيفا . وقرأ نافع وابن محيصن بالتشديد على الإدغام .\n","ar.miqbas":"فَأَنْتَ لَهُ تَصَدَّى (6)والإِتيان بضمير المخاطب مُظهراً قبلَ المسند الفعلي دون اسْتِتاره في الفعل يجوز أن يكون للتقوي كأنه قيل : تتصدى له تصدياً ، فمناط العتاب هو التصدي القوي .ويجوز أن يكون مفيداً للاختصاص ، أي فأنت لا غيرُك تَتَصدّى له ، أي ذلك التصدّي لا يليق بك . وهذا قريب من قولهم : مثلُك لا يبخل ، أي لو تصدّى له غيرك لكان هَوناً ، فأما أنت فلا يتَصدى مثلك لمثله فمناط العتاب هو أنه وقع من النبي صلى الله عليه وسلم في جليل قدره .وقرأ نافع وابن كثير وأبو جعفر بفتح التاء وتشديد الصاد على إدغام إحدى التاءين في الصاد . والباقون بالفتح وتخفيف الصاد على حذف إحدى التاءين .والتصدّي : التعرض ، أطلق هنا على الإِقبال الشديد مجازاً .\n","ar.waseet":"( فَأَنتَ لَهُ تصدى ) أى : فأنت تتعرض له بالقبول ، وبالإِصغاء لكلامه ، رجاء أن يسلم ، فيسلم بعده غيره .يقال : تصدَّى فلان لكذا ، إذا تعرَّض له ، وأصله تصدَّدَ من الصَّدَد ، وهو ما استقبلك وصار قبالتك . .\n","ar.baghawi":"\"فأنت له تصدى\"، تتعرض له وتقبل عليه وتصغي إليه كلامه، وقرأ أهل الحجاز: \"تصدى\" بتشديد الصاد على الإدغام، أي: تتصدى، وقرأ الآخرون بتخفيف الصاد على الحذف.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5764.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5764.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5764.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"وَمَا عَلَيْكَ أَلَّا يَزَّكَّىٰ","transliteration":"Wa ma 'alaika allaa yaz zakka.","translations":{"en.ahmedali":"Though it is not your concern if he should not grow (in fulness).","en.ahmedraza":"And you have nothing to lose if he does not become pure.","en.arberry":"though it is not thy concern, if he does not cleanse himself.","en.asad":"although thou art not accountable for his failure to attain to purity;","en.daryabadi":"Whereas it is not on thee that he is not cleansed.","en.hilali":"What does it matter to you if he will not become pure (from disbelief, you are only a Messenger, your duty is to convey the Message of Allah).","en.pickthall":"Yet it is not thy concern if he grow not (in grace).","en.qaribullah":"although it is not for you to be concerned if he remained unpurified.","en.sahih":"And not upon you [is any blame] if he will not be purified.","en.sarwar":"though you will not be questioned even if he never purifies himself.","en.yusufali":"Though it is no blame to thee if he grow not (in spiritual understanding).","en.maududi":"though you are not to blame if he would not cleanse himself.","en.shakir":"And no blame is on you if he would not purify himself","en.itani":"Though you are not liable if he does not purify himself.","en.mubarakpuri":"What does it matter to you if he will not become pure","en.qarai":"though you are not liable if he does not purify himself.","en.wahiduddin":"though you are not to be blamed if he would not purify himself --"},"tafsir":{"ar.muyassar":"أما مَن استغنى عن هديك، فأنت تتعرض له وتصغي لكلامه، وأي شيء عليك ألا يتطهر من كفره؟","ar.jalalayn":"«وما عليك ألا يزكى» يؤمن.","ar.qurtubi":"أي لا يهتدي هذا الكافر ولا يؤمن , إنما أنت رسول , ما عليك إلا البلاغ .\n","ar.miqbas":"وَمَا عَلَيْكَ أَلَّا يَزَّكَّى (7)جملة معترضة بين جملة { أما من استغنى } [ عبس : 5 ] وجملة : { وأما من جاءك يسعى } [ عبس : 8 ] ، والواو اعتراضية .و { ما } نافية و { عليك } خبر مقدم . والمبتدأ { ألا يزكى } ، والمعنى : عدم تزكّيه ليس محمولاً عليك ، أي لست مؤاخذاً بعدم اهتدائه حتى تزيد من الحرص على ترغيبه في الإِيمان ما لم يكلفك الله به . وهذا رفق من الله برسوله صلى الله عليه وسلم\n","ar.waseet":"( وَمَا عَلَيْكَ أَلاَّ يزكى ) أى : وأى شئ عليك فى أن يبقى على كفره ، بدون تطهر؟ إنه لا حرج عليك فى ذلك ، فأنت عليك البلاغ ونحن علينا الحساب و ( إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ ولكن الله يَهْدِي مَن يَشَآءُ . . . ) و \" ما \" نافية \" وعليك \" خبر مقدم ، وقوله ( أَلاَّ يزكى ) مبتدأ مؤخر .\n","ar.baghawi":"\" وما عليك أن لا يزكى \"، لا يؤمن ولا يهتدي، إن عليك إلا البلاغ.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5765.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5765.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5765.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"وَأَمَّا مَنْ جَاءَكَ يَسْعَىٰ","transliteration":"Wa amma man jaa-aka yas'a","translations":{"en.ahmedali":"As for him who comes to you striving (after goodness),","en.ahmedraza":"And for him who came to you striving,","en.arberry":"And he who comes to thee eagerly","en.asad":"but as for him who came unto thee full of eagerness","en.daryabadi":"And as for him who cometh Unto thee running,","en.hilali":"But as to him who came to you running.","en.pickthall":"But as for him who cometh unto thee with earnest purpose","en.qaribullah":"And to him who came to you eagerly","en.sahih":"But as for he who came to you striving [for knowledge]","en.sarwar":"As for the one who comes to you earnestly (striving for guidance).","en.yusufali":"But as to him who came to thee striving earnestly,","en.maududi":"But he who comes to you running,","en.shakir":"And as to him who comes to you striving hard,","en.itani":"But as for him who came to you seeking.","en.mubarakpuri":"But as for him who came to you running,","en.qarai":"But as for someone who comes hurrying to you,","en.wahiduddin":"but as for one who comes to you, eagerly"},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«وأما من جاءك يسعى» حال من فاعل جاء.","ar.qurtubi":"يطلب العلم لله\n","ar.miqbas":"وَأَمَّا مَنْ جَاءَكَ يَسْعَى (8) عطف على جملة { أما من استغنى } [ عبس : 5 ] اقتضى ذكره قصد المقابلة مع المعطوف عليها مقابلة الضدين إتماماً للتقسيم . والمراد : بمن جاء يسعى : هو ابن أم مكتوم ، فحصل بمضمون هذه الجملة تأكيد لمضمون { عبس وتولى أن جاءه الأعمى } [ عبس : 1 2 ] .والسعي : شدة المشي ، كُنِي به عن الحرص على اللقاء فهو مقابل لحال من استغنى لأن استغناءه استغناء المُمْتَعِض من التصدّي له .\n","ar.waseet":"( وَأَمَّا مَن جَآءَكَ يسعى ) أى : من جاءك مسرعا فى طلب الخير والهداية والعلم ، وهو هذا الأعمى ، الذى لم يمنعه فقدانه لبصره من الحرص على التفقه فى الدين .\n","ar.baghawi":"\"وأما من جاءك يسعى\"، يمشي يعني: ابن أم مكتوم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5766.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5766.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5766.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"وَهُوَ يَخْشَىٰ","transliteration":"Wahuwa yakhshaa,","translations":{"en.ahmedali":"And is also fearful (of God),","en.ahmedraza":"And whereas he fears,","en.arberry":"and fearfully,","en.asad":"and in awe [of God]","en.daryabadi":"And he feareth'-","en.hilali":"And is afraid (of Allah and His Punishment),","en.pickthall":"And hath fear,","en.qaribullah":"and fearfully,","en.sahih":"While he fears [Allah],","en.sarwar":"and who has fear of God,","en.yusufali":"And with fear (in his heart),","en.maududi":"and fears (Allah),","en.shakir":"And he fears,","en.itani":"In awe.","en.mubarakpuri":"And is afraid.","en.qarai":"while he fears [Allah],","en.wahiduddin":"and in awe of God"},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«وهو يخشى» الله حال من فاعل يسعى وهو الأعمى.","ar.qurtubi":"أي يخاف الله .\n","ar.miqbas":"وَهُوَ يَخْشَى (9) وجملة { وهو يخشى } في موضع الحال ، وحذف مفعول { يخشى } لظهوره لأن الخشية في لسان الشرع تنصرف إلى خشية الله تعالى .والمعنى : أنه جاء طلباً للتزكية لأن يخشى الله من التقصير في الاسترشاد . واختير الفعل المضارع لإفادته التجدد .\n","ar.waseet":"( وَهُوَ يخشى ) أى : وهو يخشى الله ، ويخاف عقابه ، ويرجو ثوابه .\n","ar.baghawi":"\"وهو يخشى\"، الله عز وجل.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5767.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5767.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5767.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"فَأَنْتَ عَنْهُ تَلَهَّىٰ","transliteration":"Fa-anta 'anhu talah haa.","translations":{"en.ahmedali":"You neglect.","en.ahmedraza":"So you leave him, and are engrossed elsewhere!","en.arberry":"to him thou payest no heed.","en.asad":"him didst thou disregard!","en.daryabadi":"Him thou neglectest!","en.hilali":"Of him you are neglectful and divert your attention to another,","en.pickthall":"From him thou art distracted.","en.qaribullah":"of him you were unmindful.","en.sahih":"From him you are distracted.","en.sarwar":"you ignore him.","en.yusufali":"Of him wast thou unmindful.","en.maududi":"you pay no heed to him.","en.shakir":"From him will you divert yourself.","en.itani":"To him you were inattentive.","en.mubarakpuri":"Of him you are neglectful and divert your attention to another.","en.qarai":"you are neglectful of him.","en.wahiduddin":"you pay him no heed."},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«فأنت عنه تَلَهَّى» فيه حذف التاء الأخرى في الأصل أي تتشاغل.","ar.qurtubi":"أي تعرض عنه بوجهك وتشغل بغيره .وأصله تتلهى ; يقال : لهيت عن الشيء ألهى : أي تشاغلت عنه .والتلهي : التغافل .ولهيت عنه وتليت : بمعنى .\n","ar.miqbas":"فَأَنْتَ عَنْهُ تَلَهَّى (10)والقول في { فأنت عنه تلهى } كالقول في : { فأنت له تصدى } [ عبس : 6 ] .والعبرة من هذه الآيات أن الله تعالى زاد نبيئه صلى الله عليه وسلم علماً عظيماً من الحكمة النبوية ، ورفعَ درجة علمه إلى أسمى ما تبلغ إليه عقول الحكماء رعاةِ الأمم ، فنبهه إلى أن في معظم الأحوال أو جميعها نواحيَ صلاح ونفع قد تخفى لقلة اطرادها ، ولا ينبغي ترك استقرائها عند الاشتغال بغيرها ولو ظنه الأهم ، وأنّ ليس الإِصلاح بسلوك طريقة واحدة للتدبير بأخذ قواعد كلية منضبطة تشبهُ قواعد العلوم يطبقها في الحوادث ويغضي عما يعارضها بأن يسرع إلى ترجيح القَويّ على الضعيف مِما فيه صفة الصلاح ، بل شأن مقوّم الأخلاق أن يكون بمثابة الطبيب بالنسبة إلى الطبائع والأمزجة فلا يجعل لجميع الأمزجة علاجاً واحداً بل الأمر يختلف باختلاف الناس . وهذا غور عميق يخاض إليه من ساحل القاعدة الأصولية في باب الاجتهاد القائلة : إن المجتهد إذا لاح له دليل : «يبحث عن المعارض» والقاعدة القائلة : «إن لله تعالى حكماً قبل الاجتهاد نصب عليه أمارة وكلف المجتهد بإصابته فإن أصابه فله أجران وإن أخطأه فله أجر واحد» .فإذا كان ذلك مقام المجتهدين من أهل العلم لأنه مستطاعهم فإن غوْره هو اللائق بمرتبة أفضل الرسل صلى الله عليه وسلم فيما لم يرد له فيه وحي ، فبحثُه عن الحكم أوسع مدىً من مدى أبحاث عموم المجتهدين ، وتنقيبه على المعارض أعمق غَوراً من تناوشهم ، لئلا يفوت سيدَ المجتهدين ما فيه من صلاح ولو ضعيفاً ، ما لم يكن إعماله يُبطل ما في غيره من صلاح أقوى لأن اجتهاد الرسول صلى الله عليه وسلم في مواضع اجتهاده قائم مقام الوحي فيما لم يُوحَ إليه فيه .فالتزكية الحق هي المِحْور الذي يدور عليه حال ابن أم مكتوم وحال المشرك من حيث إنها مرغوبة للأول ومزهود فيها من الثاني ، وهي مرمى اجتهاد رسول الله صلى الله عليه وسلم لتحصيلها للثاني والأمن على قرارها للأول بإقباله على الذي يتجافى عن دعوته ، وإعراضه عن الذي يعلم من حاله أنه متزكَ بالإِيمان .وفي حاليهما حالان آخران سرُّهما من أسرار الحكمة التي لقنها الله نبيئه صلى الله عليه وسلم وهو يخفى في معتاد نظر النظار فأنبأه الله به ليزيل عنه ستار ظاهر حاليهما ، فإن ظاهر حاليهما قاض بصرف الاهتمام إلى أحدهما وهو المشرك لدعوته إلى الإِيمان حين لاح من لِين نفْسه لسماع القرآن ما أطْمَعَ النبي صلى الله عليه وسلم بأنه قد اقتربَ من الإِيمان فمحَّض توجيه كلامه إليه لأن هدي الناس إلى الإِيمان أعظم غرض بُعث النبي صلى الله عليه وسلم لأجله ، فالاشتغال به يَبْدُو أهمّ وأرجحَ من الاشتغال بمن هو مؤمن خالص ، وذلك ما فعله النبي صلى الله عليه وسلمغير أن وراء ذلك الظاهر حالاً آخر كامناً عَلِمه الله تعالى العالم بالخفيات ولم يوححِ لرسوله صلى الله عليه وسلم التنقيب عليه وهو حال مؤمن هو مظنة الازدياد من الخير ، وحال كافر مصمم على الكفر تؤذن سوابقه بعناده وأنه لا يفيد فيه البرهان شيئاً . وإن عميق التوسم في كلا الحالين قد يكشف للنبيء صلى الله عليه وسلم بإعانة الله رجحانَ حال المؤمن المزداد من الرشد والهدي على حال الكافر الذي لا يغُر ما أظهره من اللين مصانعةً أو حياءً من المكابرة ، فإن كان في إيمان الكافر نفع عظيم عام للأمة بزيادة عددها ونفع خاص لذاته . وفي ازدياد المؤمن من وسائل الخير وتزكية النفس نفع خاص له والرسول راع لآحاد الأمة ولمجموعها ، فهو مخاطب بالحفاظ على مصالح المجموع ومصالح الآحاد بحيث لا يدحض مصالح الآحاد لأجل مصالح المجموع إلا إذا تعذر الجمع بين الصالح العام والصالح الخاص ، بيد أن الكافر صاحبَ هذه القضية تنبىء دخيلتُه بضعف الرجاء في إيمانه لو أطيل التوسم في حاله ، وبذلك تَعطل الانتفاعُ بها عموماً وخصوصاً وتمخض أن لتزكية المؤمن صاحب القضية نفعاً لخاصة نفسه ولا يخلو من عَود تزكية بفائدة على الأمة بازدياد الكاملين من أفرادها .وقد حصل من هذا إشعار من الله لرسوله صلى الله عليه وسلم بأن الاهتداء صنوف عديدة وله مراتب سامية ، وليس الاهتداء مقتصراً على حصول الإِيمان مراتبَ وميادينَ لسبق همم النفوس لا يُغفل عن تعهدها بالتثبيت والرعي والإِثمار ، وذلك التعهد إعانة على تحصيل زيادة الإِيمان .وتلك سرائر لا يعلم حقها وفروقها إلا الله تعالى . فعلى الرسول صلى الله عليه وسلم وهو خليفة الله في خلقه أن يتوخاها بقدر المستطاع ، فما أوحى الله إليه في شأنه اتبع ما يوحى إليه وما لم ينزل عليه وحي في شأنه فعليه أن يصرف اجتهاده كما أشار إليه قوله تعالى : { ولو نشاء لأريناكهم فلعرفتهم بسيماهم ولتعرفنهم في لحن القول } [ محمد : 30 ] .فكان ذلك موقع هذه الوصية المفرغة في قالب المعاتبة للتنبيه إلى الاكتراث بتتبع تلك المراتب وغرس الإِرشاد فيها على ما يرجى من طيب تُربتِهَا ليخرج منها نبات نافع للخاص وللعامة .والحاصل أن الله تعالى أعلم رسوله صلى الله عليه وسلم أن ذلك المشرك الذي محضه نصحَه لا يُرجى منه صلاح ، وأن ذلك المؤمن الذي استبقى العناية به إلى وقت آخر يزداد صلاحاً تفيد المبادرةُ به ، لأنه في حالة تلهفه على التلقّي من رسول الله صلى الله عليه وسلم أشد استعداداً منه في حين آخر .فهذه الحادثة منوال ينسج عليه الاجتهاد النبوي إذا لم يرد له الوحي ليعلم أن من وراء الظواهر خبايا ، وأن القرائن قد تَستُر الحقائق .وفي ما قررنا ما يعرف به أن مرجع هذه الآية وقضيتها إلى تصرف النبي صلى الله عليه وسلم بالاجتهاد فيما لم يُوحَ إليه فيه ، وأنه ما حاد عن رعاية أصول الاجتهاد قيد أنملة . وهي دليل لما تقرر في أصول الفقه من جواز الاجتهاد للنبيء صلى الله عليه وسلم ووقوعه ، وأنه جرى على قاعدة إعمال أرجح المصلحتين بحسب الظاهر ، لأن السرائر موكولة إلى الله تعالى ، وأن اجتهاده صلى الله عليه وسلم لا يخطىء بحسب ما نصبه الله من الأدلة ، ولكنه قد يخالف ما في علم الله ، وأن الله لا يقر رسوله صلى الله عليه وسلم على ما فيه مخالفة لما أراده الله في نفس الأمر .ونظير هذه القضية قضية أسرى بدر التي حدثت بعد سنين من نزول هذه الآية والموقف فيهما متماثل .وفي قوله تعالى : { وما يدريك لعله يزكى } [ عبس : 3 ] إيماء إلى عذر النبي صلى الله عليه وسلم في تأخيره إرشاد ابن أم مكتوم لما علمت من أنه يستعمل في التنبيه على أمر مغفول عنه ، والمعنى : لعله يزّكى تزكية عظيمة كانت نفسه متهيئة لها ساعتئذ إذ جاء مسترشداً حريصاً ، وهذه حالة خفية .وكذلك عذره في الحرص على إرشاد المشرك بقوله : { وما عليك ألا يزكى } [ عبس : 7 ] إذ كان النبي صلى الله عليه وسلم يخشى تبعة من فوات إيمان المشرك بسبب قطع المحاورة معه والإِقبال على استجابة المؤمن المسترشد .فإن قال قائل : فلماذا لم يُعلِم الله رسوله صلى الله عليه وسلم من وقت حضور ابن أم مكتوم بما تضمنه هذا التعليم الذي ذكرتم .قلنا : لأن العلم الذي يحصل عن تبيُّن غفلة ، أو إشعارٍ بخفاء يكون أرسخ في النفس من العلم المسوق عن غير تعطش ولأن وقوع ذلك بعد حصول سببه أشهر بين المسلمين وليحصل للنبيء صلى الله عليه وسلم مزية كِلا المقامين : مقام الاجتهاد ، ومقام الإِفادة .وحكمة ذلك كله أن يُعلم الله رسوله صلى الله عليه وسلم بهذا المهيع من عليِّ الاجتهاد لتكون نفسه غير غافلة عن مثله وليتأسى به علماء أمته وحكامها وولاة أمورها .ونظير هذا ما ضَربه الله لموسى عليه السلام من المثَل في ملاقاة الخضر ، وما جرى من المحاورة بينهما ، وقول الخضر لموسى : { وكيف تصبر على ما لم تحط به خبراً } [ الكهف : 68 ] ثم قوله له : { ذلك تأويل ما لم تسطع عليه صبراً } [ الكهف : 82 ] . وقد سبق مثله في الشرائع السابقة كقوله في قصة نوح : { يا نوح إنه ليس من أهلك إنه عمل غير صالح } [ هود : 46 ] وقوله لإبراهيم : { لا ينال عهدي الظالمين } [ البقرة : 124 ] .هذا ما لاح لي في تفسير هذه الآيات تأصيلاً وتفصيلاً ، وهو بناء على أساس ما سبق إليه المفسرون من جعلهم مناط العتاب مجموع ما في القصة من الإِعراض عن إرشاد ابن أم مكتوم ، ومن العُبوس له ، والتولّي عنه ، ومن التصدّي القوي لدعوة المشرك والإِقبال عليه .والأظهر عندي أن مناط العتاب الذي تؤتيه لهجة الآية والذي رُوي عن النبي صلى الله عليه وسلم ثبوتُه من كثرة ما يقول لابن أم مكتوم : « مرحباً بمن عاتبني ربي لأجله » إنما هو عتاب على العُبوس والتولّي ، لا على ما حفّ بذلك من المبادرة بدعوة ، وتأخير إرشاد ، لأن ما سلكه النبي صلى الله عليه وسلم في هذه الحادثة من سبيل الإِرشاد لا يستدعي عتاباً إذ ما سلك إلا سبيل الاجتهاد القويم لأن المقام الذي أقيمت فيه هذه الحادثة تقاضاهُ إرشادَاننِ لا محيص من تقديم أحدهما على الآخر ، هما : إرشاد كافر إلى الإِسلام عساه أن يسلم ، وإرشاد مؤمن إلى شُعَب الإِسلام عساه أن يزداد تزكية .وليس في حال المؤمن ما يفيت إيماناً وليس في تأخير إرشاده على نية التفرغ إليه بعد حين ما يُنَاكِد زيادة صلاحه فإن زيادة صلاحه مستمرة على ممر الأيام .ومن القواعد المستقرَاةِ من تصاريف الشريعة والشاهدة بها العقول السليمة تقديم درء المفاسد على جلب المصالح ، ونفيُ الضر الأكبر قبل نفي الضر الأصغر ، فلم يسلك النبي صلى الله عليه وسلم إلا مسلك الاجتهاد المأمور به فيما لم يوح إليه فيه . وهو داخل تحت قوله تعالى لعموم الأمة : { فاتقوا اللَّه ما استطعتم } [ التغابن : 16 ] وهو القائل : « إنما أنا بشر وإنكم تختصمون إليَّ ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو ما أسمع . فمن قضيت له بحق أخيه فلا يأخذه فإنما اقتطع له قطعة من نار » وهو القائل : « أمرت أن أحكم بالظاهر واللَّه يتولى السرائر » وهو حديث صحيح المعنى وإن كان في إسناده تردد . فلا قِبل له بعلم المغيبات إلا أن يطلعه الله على شيء منها ، فلا يعلم أن هذا المشرك مضمر الكفر والعناد وأن الله يعلم أنه لا يؤمن ولا أن لذلك المؤمن في ذلك صفاءَ نفس وإشراقَ قلب لا يتهيآن له في كل وقت .وبذلك يستبين أن ما أوحى الله به إلى نبيئه صلى الله عليه وسلم في هذه السورة هو وحي له بأمر كان مغيباً عنه حين أقبل على دعوة المشرك وأرجأ إرشاد المؤمن .وليس في ظاهر حالهما ما يؤذن بباطنه وما أظهرَ اللَّهُ فيها غيْبَ علمه إلا لإِظهار مزية مؤمن راسخ الإِيمان وتسجيل كفر مشرك لا يُرجى منه الإِيمان ، مع ما في ذلك من تذكير النبي صلى الله عليه وسلم بما عَلِمه الله من حسن أدبه مع المؤمنين ورفع شأنهم أمام المشركين .  فمناط المعاتبة هو العبوس للمؤمن بحضرة المشرك الذي يَستصغر أمثال ابن أم مكتوم ، فما وقع في خلال هذا العتاب من ذكر حال المؤمن والكافر إنما هو إدماج لأن في الحادثة فرصَةً من التنويه بسمو منزلة المؤمن لانطواء قلبه على أشعة تؤهله لأن يستنير بها ويفيضها على غيره جمعاً بين المعاتبة والتعليم ، على سنن هدي القرآن في المناسبات .\n","ar.waseet":"( فَأَنتَ عَنْهُ تلهى ) أى : فأنت عنه تتشاغل ، وتفرغ جهدك مع هؤلاء الزعماء ، طمعا فى إيمانهم .ويلاحظ أن هذه الآيات الكريمة ، أكثر حدة فى العتاب من سابقتها ، حيث ساق - سبحانه - هذه الآيات فى صورة أشبه ما تكون بالتعجيب ممن يفعل ذلك . .\n","ar.baghawi":"\"فأنت عنه تلهى\"، تتشاغل وتعرض عنه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5768.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5768.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5768.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"كَلَّا إِنَّهَا تَذْكِرَةٌ","transliteration":"Kalla innaha tazkirah","translations":{"en.ahmedali":"Assuredly this is a reminder","en.ahmedraza":"Not this way – this is the advice.","en.arberry":"No indeed; it is a Reminder","en.asad":"NAY, VERILY, these [messages] are but a reminder:","en.daryabadi":"By no means! Verily it is an admonition.","en.hilali":"Nay, (do not do like this), indeed it (these Verses of this Quran) are an admonition,","en.pickthall":"Nay, but verily it is an Admonishment,","en.qaribullah":"No indeed, this is a Reminder;","en.sahih":"No! Indeed, these verses are a reminder;","en.sarwar":"These verses are a reminder","en.yusufali":"By no means (should it be so)! For it is indeed a Message of instruction:","en.maududi":"No indeed; this is only a Reminder.","en.shakir":"Nay! surely it is an admonishment.","en.itani":"Do not. This is a Lesson.","en.mubarakpuri":"Nay; indeed it is an admonition.","en.qarai":"No indeed! These [verses of the Quran ] are a reminder","en.wahiduddin":"Indeed, this [Quran] is an admonition."},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«كلا» لا تفعل مثل ذلك «إنها» أي السورة أو الآيات «تذكرة» عظة للخلق.","ar.qurtubi":"قوله تعالى : كلا إنها تذكرة كلا كلمة ردع وزجر ; أي ما الأمر كما تفعل مع الفريقين ; أي لا تفعل بعدها مثلها : من إقبالك على الغني ، وإعراضك عن المؤمن الفقير . والذي جرى من النبي - صلى الله عليه وسلم - كان ترك الأولى كما تقدم ، ولو حمل على صغيرة لم يبعد ; قاله القشيري . والوقف على كلا على هذا الوجه : جائز . ويجوز أن تقف على تلهى ثم تبتدئ كلا على معنى حقا . إنها أي السورة أو آيات القرآن تذكرة أي موعظة وتبصرة للخلق فمن شاء ذكره أي اتعظ بالقرآن .قال الجرجاني : إنها أي القرآن ، والقرآن مذكر إلا أنه لما جعل القرآن تذكرة ، أخرجه على لفظ التذكرة ، ولو ذكره لجاز ; كما قال تعالى في موضع آخر : كلا إنه تذكرة . ويدل على أنه أراد القرآن قوله : فمن شاء ذكره أي كان حافظا له غير ناس ; وذكر الضمير ; لأن التذكرة في معنى الذكر والوعظ .\n","ar.miqbas":"كَلَّا إِنَّهَا تَذْكِرَةٌ (11) { تلهى } .إبطال وقد تقدم ذكر ( كلاّ ) في سورة مريم ( 79 82 ) ، وتقدم قريباً في سورة النبأ ( 4 ، 5 ) ، وهو هنا إبطال لما جرى في الكلام السابق ولو بالمفهوم كما في قوله : { وما يدريك لعله يزكى } [ عبس : 3 ] . ولو بالتعريض أيضاً كما في قوله : { عبس وتولى } [ عبس : 1 ] .وعلى التفسير الثاني المتقدم ينصرف الإِبطال إلى { عبس وتولى } خاصة .ويجوز أن يكون تأكيداً لقوله : { وما عليك ألاَّ يزكى } [ عبس : 7 ] على التفسيرين ، أي لا تظن أنك مسؤول عن مكابرته وعناده فقد بلَّغت ما أمرتَ بتبليغه .{ كَلاَّ إِنَّهَا تَذْكِرَةٌ * فَمَن شَآءَ ذَكَرَهُ * فَى صُحُفٍ مُّكَرَّمَةٍ * مَّرْفُوعَةٍ مُّطَهَّرَةٍ * بِأَيْدِى سَفَرَةٍ * كِرَامٍ } .استئناف بعد حرف الإِبطال ، وهو استئناف بياني لأن ما تقدم من العتاب ثم ما عقبه من الإِبطال يثير في خاطر الرسول صلى الله عليه وسلم الحيرة في كيف يكون العمل في دعوة صناديد قريش إذا لم يتفرغ لهم لئلا ينفروا عن التدبر في القرآن ، أو يثير في نفسه مخافة أن يكون قصَّر في شيء من واجب التبليغ .وضمير { إنها } عائد إلى الدعوة التي تضمنها قوله : { فأنت له تصدى } [ عبس : 6 ] .ويجوز أن يَكون المعنى : أن هذه الموعظة تذكرة لك وتنبيه لما غفلت عنه وليست ملاماً وإنما يعاتب الحبيبُ حبيبَه .ويجوز عندي أن يكون { كلا إنها تذكرة } استئنافاً ابتدائياً موجهاً إلى من كان النبي صلى الله عليه وسلم يدعوه قُبيل نزول السورة فإنه كان يَعرض القرآن على الوليد بن المغيرة ومَن معه ، وكانوا لا يستجيبون إلى ما دعاهم ولا يصدقون بالبعث ، فتكون ( كلاّ ) إبطالاً لما نَعتوا به القرآن من أنه أساطير الأولين أو نحوِ ذلك .فيكون ضمير { إنها تذكرة } عائداً إلى الآيات التي قرأها النبي صلى الله عليه وسلم عليهم في ذلك المجلس ثم أعيد عليها الضمير بالتذكير للتنبيه على أن المراد آيات القرآن .ويؤيد هذا الوجهَ قولُه تعالى عَقبه : { قتل الإنسان ما أكفره } [ عبس : 17 ] الآيات حيث ساق لهم أدلة إثبات البعث .فكان تأنيث الضمير نكتةً خصوصية لتحميل الكلام هذه المعاني .\n","ar.waseet":"ثم ساق - سبحانه - ما هو أشد فى العتاب وفى التحذير فقال : ( كَلاَّ إِنَّهَا تَذْكِرَةٌ ) .أى : كلا - أيها الرسول الكريم - ليس الأمر كما فعلت ، من إقبالك على زعماء قريش طمعا فى إسلامهم ، ومن تشاغلك وإعراضك عمن جاء يسعى وهو يخشى ..الضمير فى قوله ( إنها ) يعود إلى آيات القرآن الكريم ، أى : إن آيات القرآن الكريم لمشتملة على التذكير بالحق ، وعلى الموعظة الحكيمة التى ينبغى على كل عاقل أن يعمل بموجبها ، وأن يسير بمقتضاها .\n","ar.baghawi":"\"كلا\"، زجر، أي لا تفعل بعدها مثلها، \"إنها\" يعني هذه الموعظة. وقال مقاتل: آيات القرآن، \"تذكرة\"، موعظة وتذكير للخلق.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5769.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5769.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5769.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"فَمَنْ شَاءَ ذَكَرَهُ","transliteration":"Faman shaa a zakarah","translations":{"en.ahmedali":"For any one who desires to bear it in mind,","en.ahmedraza":"So whoever wishes may remember it.","en.arberry":"(and whoso wills, shall remember it)","en.asad":"and so, whoever is willing may remember Him","en.daryabadi":"So whosoever willeth-let him be admonished therewlth.","en.hilali":"So whoever wills, let him pay attention to it.","en.pickthall":"So let whosoever will pay heed to it,","en.qaribullah":"and whosoever wills, shall remember it.","en.sahih":"So whoever wills may remember it.","en.sarwar":"so let those who want to follow its guidance do so.","en.yusufali":"Therefore let whoso will, keep it in remembrance.","en.maududi":"So whoso wills may give heed to it.","en.shakir":"So let him who pleases mind it.","en.itani":"Whoever wills, shall remember it.","en.mubarakpuri":"So, whoever wills, let him pay attention to Him (it).","en.qarai":"—so let anyone who wishes remember—","en.wahiduddin":"Let him who will, pay heed to it."},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«فمن شاء ذكره» حفظ ذلك فاتعظ به.","ar.qurtubi":"وروى الضحاك عن ابن عباس في قوله تعالى : فمن شاء ذكره قال من شاء الله تبارك وتعالى ألهمه .\n","ar.miqbas":"فَمَنْ شَاءَ ذَكَرَهُ (12) والضمير الظاهر في قوله : { ذكره } يجوز أن يعود إلى { تذكرة } لأن مَا صَدْقَها القرآن الذي كان النبي صلى الله عليه وسلم يعرضه على صناديد قريش قُبيل نزول هذه السورة ، أي فمن شاء ذكرَ القرآن وعمل به .ويجوز أن يكون الضمير عائداً إلى الله تعالى فإن إعادة ضمير الغيبة على الله تعالى دون ذِكر معاده في الكلام كثير في القرآن لأن شؤونه تعالى وأحكامه نزل القرآن لأجلها فهو ملحوظ لكل سامع للقرآن ، أي فمن شاء ذكر الله وتوخّى مرضاته .والذِكر على كلا الوجهين : الذكر بالقلب ، وهو توخّي الوقوف عند الأمر والنهي .وتعدية فعل ( ذكر ) إلى ذلك الضمير على الوجهين على حذف مضاف يناسب المقام .والذي اقتضى الإِتيانَ بالضمير وكونه ضمير مذكر مراعاةُ الفواصل وهي : { تذكرهْ ، مطهرهْ ، سفرهْ ، بررهْ } .وجملة : { فمن شاء ذكره } معترضة بين قوله : { تذكرة } وقوله : { في صحف } .والفاء لتفريع مضمون الجملة على جملة { إنها تذكرة } فإن الجملة المعترضة تقترن بالفاء إذا كان معنى الفاء قائماً ، فالفاء من جملة الاعتراض ، أي هي تذكرة لك بالأصالة وينتفع بها من شاء أن يتذكر على حسب استعداده ، أي يتذكر بها كل مسلم كقوله تعالى : { وإنه لذكر لك ولقومك } [ الزخرف : 44 ] .وفي قوله : { فمن شاء ذكره } تعريض بأن موعظة القرآن نافعة لكل أحد تجرد عن العناد والمكابرة ، فمن لم يتعظ بها فلأنه لم يشأ أن يتعظ . وهذا كقوله تعالى : { إنما أنت منذر من يخشاها } [ النازعات : 45 ] وقوله : { لمن شاء منكم أن يستقيم } [ التكوير : 28 ] وقوله : { وإنه لتذكرة للمتقين } [ الحاقة : 48 ] ونحوه كثير ، وقد تقدم قريب منه في قوله تعالى : { فمن شاء اتخذ إلى ربه سبيلاً } في سورة الإنسان ( 29 ) .والتذكرة : اسم لما يُتذكر به الشيءُ إذا نُسي . قال الراغب : وهي أعم من الدلالة والأمارة قال تعالى : { فما لهم عن التذكرة معرضين } وتقدم نظيره في سورة المدثر ( 49 ) .وكل من تذكرة } و { ذكره } هو من الذكر القلبي الذي مصدره بضم الدال في الغالب ، أي فمن شاء عمل به ولا ينسه .\n","ar.waseet":"( فَمَن شَآءَ ذَكَرَهُ ) أى : فمن شاء أن يتعظ ويعتبر وينتفع بهذا التذكير فاز وربح ، ومن شاء غير ذلك خسر وضاع ، فالجملة الكريمة لتهديد الذين يعرضون عن الموعظة ، وليست للتخبير كما يتبادر من فعل المشيئة .وهى معترضة للترغيب فى حفظ هذه الآيات ، وفى العمل بما اشتملت عليه من هدايات .وجاء الضمير مذكرا فى قوله : ( فَمَن شَآءَ ذَكَرَهُ ) لأن التذكرة هنا بمعنى التذكير والاتعاظ .أى : فمن شاء التذكير والاعتبار ، تذكر واعتبر وحفظ ذلك دون أن ينساه . .\n","ar.baghawi":"\"فمن شاء\"، من عباد الله، \"ذكره\"، أي اتعظ به. وقال مقاتل: فمن شاء الله ذكره وفهمه، واتعظ بمشيئته وتفهيمه، والهاء في \"ذكره\" راجعة إلى القرآن والتنزيل والوعظ.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5770.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5770.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5770.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"فِي صُحُفٍ مُكَرَّمَةٍ","transliteration":"Fi suhufim mukar rama,","translations":{"en.ahmedali":"(Contained) in honoured pages,","en.ahmedraza":"On honourable pages.","en.arberry":"upon pages high-honoured,","en.asad":"in [the light of His] revelations blest with dignity,","en.daryabadi":"Inscribed in Writs honoured,\"","en.hilali":"(It is) in Records held (greatly) in honour (Al-Lauh Al-Mahfuz).","en.pickthall":"On honoured leaves","en.qaribullah":"upon highly honored pages,","en.sahih":"[It is recorded] in honored sheets,","en.sarwar":"(This Quran) is also recorded in honorable books,","en.yusufali":"(It is) in Books held (greatly) in honour,","en.maududi":"It is contained in scrolls highly honoured,","en.shakir":"In honored books,","en.itani":"On honorable pages.","en.mubarakpuri":"In Records held in honor,","en.qarai":"in honoured scriptures,","en.wahiduddin":"It is set down on honoured pages,"},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«في صحف» خبر ثان لأنها وما قبله اعتراض «مكرمة» عند الله.","ar.qurtubi":"ثم أخبر عن جلالته فقال : في صحف جمع صحيفة مكرمة أي عند الله ; قاله السدي . الطبري : مكرمة في الدين لما فيها من العلم والحكم . وقيل : مكرمة لأنها نزل بها كرام الحفظة ، أو لأنها نازلة [ ص: 186 ] من اللوح المحفوظ . وقيل : مكرمة لأنها نزلت من كريم ; لأن كرامة الكتاب من كرامة صاحبه . وقيل : المراد كتب الأنبياء ; دليله : إن هذا لفي الصحف الأولى صحف إبراهيم وموسى .\n","ar.miqbas":"فِي صُحُفٍ مُكَرَّمَةٍ (13) والصحف : جمع صحيفة ، وهي قطعة من أديم أو وَرَق أو خرقةٌ يكتب فيها الكتاب ، وقياس جمعها صحائف ، وأما جمعها على صحف فمخالف للقياس ، وهو الأفصح ولم يرد في القرآن إلا صُحف ، وسيأتي في سورة الأعلى ، وتطلق الصحيفة على ما يكتب فيه .\n","ar.waseet":"وقوله : ( فَي صُحُفٍ مُّكَرَّمَةٍ ) خبر ثان لقوله ( إِنَّهَا تَذْكِرَةٌ ) وما بينهما اعتراض . .أى : إن آيات القرآن تذكرة ، مثبتة أو كائنة فى صحف عظيمة ( مكرمة ) عند الله - تعالى - لأنها تحمل آياته .\n","ar.baghawi":"ثم أخبر عن جلالته عنده فقال: \"في صحف مكرمة\"، يعني اللوح المحفوظ. وقيل: كتب الأنبياء عليهم السلام، دليله قوله تعالى: \" إن هذا لفي الصحف الأولى * صحف إبراهيم وموسى \" (الأعلى- 18، 19).\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5771.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5771.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5771.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"مَرْفُوعَةٍ مُطَهَّرَةٍ","transliteration":"Marfoo'atim mutah hara,","translations":{"en.ahmedali":"Exalted and holy,","en.ahmedraza":"Exalted, pure.","en.arberry":"uplifted, purified,","en.asad":"lofty and pure,","en.daryabadi":"Exalted, Purified,","en.hilali":"Exalted (in dignity), purified,","en.pickthall":"Exalted, purified,","en.qaribullah":"exalted, purified,","en.sahih":"Exalted and purified,","en.sarwar":"exalted, purified,","en.yusufali":"Exalted (in dignity), kept pure and holy,","en.maududi":"most exalted and purified,","en.shakir":"Exalted, purified,","en.itani":"Exalted and purified.","en.mubarakpuri":"Exalted, purified.","en.qarai":"exalted and purified,","en.wahiduddin":"exalted and purified,"},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«مرفوعة» في السماء «مطهرة» منزهة عن مس الشياطين.","ar.qurtubi":"مرفوعة رفيعة القدر عند الله . وقيل : مرفوعة عنده تبارك وتعالى . وقيل : مرفوعة في السماء السابعة ، قالهيحيى بن سلام . الطبري : مرفوعة الذكر والقدر . وقيل : مرفوعة عن الشبه والتناقض . مطهرة قال الحسن : من كل دنس . وقيل : مصانة عن أن ينالها الكفار . وهو معنى قول السدي . وعن الحسن أيضا : مطهرة من أن تنزل على المشركين . وقيل : أي القرآن أثبت للملائكة في صحف يقرؤونها فهي مكرمة مرفوعة مطهرة .\n","ar.miqbas":"مَرْفُوعَةٍ مُطَهَّرَةٍ (14) و { مطهرة } اسم مفعول مِن طَهَّره إذا نظَّفه . والمراد هنا : الطهارة المجازية وهي الشرف ، فيجوز أن يحمل الصحف على حقيقته فتكون أوصافها ب { مُكرمة ، مرفوعة ، مطهرة } محمولة على المعاني المجازية وهي معاني الاعتناء بها كما قال تعالى : { قالت يا أيها الملأ إني ألقي إلي كتاب كريم } [ النمل : 29 ] . وتشريفها كما قال تعالى : { إن كتاب الأبرار لفي عليين } [ المطففين : 18 ] وقُدسِيةِ معانيها كما قال تعالى : { ويعلمهم الكتاب والحكمة ويزكيهم } [ البقرة : 129 ] ، وكان المرادُ بالصحف الأشياء التي كتب فيها القرآن من رقوق وقراطيسَ ، وأكتاف ، ولِخاف ، وجريد .فقد روي أن كتَّاب الوحي كانوا يكتبون فيها كما جاء في خبر جمع أبي بكر للمصحف حين أمر بكتابته في رقوق أو قراطيس ، ويكون إطلاق الصحف عليها تغليباً ويكون حرف ( في ) للظرفية الحقيقية\n","ar.waseet":"هذه الصحف - أيضا - ( مرفوعة ) أى : ذات منزلة رفيعة ( مطهرة ) أى : منزهة عن أن يمسهها ما يدنسها .\n","ar.baghawi":"\"مرفوعة\"، رفيعة القدر عند الله عز وجل، وقيل: مرفوعة يعني في السماء السابعة. \"مطهرة\"، لا يمسها إلا المطهرون، وهم الملائكة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5772.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5772.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5772.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"بِأَيْدِي سَفَرَةٍ","transliteration":"Bi'aidee safara","translations":{"en.ahmedali":"In the hands of scribes","en.ahmedraza":"Written by the hands of emissaries.","en.arberry":"by the hands of scribes","en.asad":"[borne] by the hands of messengers","en.daryabadi":"By the hands of scribes.","en.hilali":"In the hands of scribes (angels).","en.pickthall":"(Set down) by scribes","en.qaribullah":"by the hands of scribes","en.sahih":"[Carried] by the hands of messenger-angels,","en.sarwar":"by the hands of the noble, virtuous,","en.yusufali":"(Written) by the hands of scribes-","en.maududi":"borne by the hands of scribes,","en.shakir":"In the hands of scribes","en.itani":"By the hands of scribes.","en.mubarakpuri":"In the hands of ambassadors (Safarah),","en.qarai":"in the hands of envoys,","en.wahiduddin":"by the hands of"},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«بأيدي سفرة» كتبة ينسخونها من اللوح المحفوظ.","ar.qurtubi":"بأيدي سفرة أي الملائكة الذين جعلهم الله سفراء بينه وبين رسله ، فهم بررة لم يتدنسوا بمعصية . وروى أبو صالح عن ابن عباس قال : هي مطهرة تجعل التطهير لمن حملها بأيدي سفرة قال : كتبة . وقاله مجاهد أيضا . وهم الملائكة الكرام الكاتبون لأعمال العباد في الأسفار ، التي هي الكتب ، واحدهم : سافر ; كقولك : كاتب وكتبة . ويقال : سفرت أي كتبت ، والكتاب : هو السفر ، وجمعه أسفار . قال الزجاج : وإنما قيل للكتاب سفر ، بكسر السين ، وللكاتب سافر ; لأن معناه أنه يبين الشيء ويوضحه . يقال : أسفر الصبح : إذا أضاء ، وسفرت المرأة : إذا كشفت النقاب عن وجهها . قال : ومنه سفرت بين القوم أسفر سفارة : أصلحت بينهم . وقاله الفراء ، وأنشد :فما أدع السفارة بين قومي ولا أمشي بغش إن مشيتوالسفير : الرسول والمصلح بين القوم والجمع : سفراء ، مثل فقيه وفقهاء . ويقال للوراقين سفراء ، بلغة العبرانية . وقال قتادة : السفرة هنا : هم القراء ، لأنهم يقرؤون الأسفار . وعنه أيضا كقول ابن عباس . وقال وهب بن منبه : بأيدي سفرة كرام بررة هم أصحاب النبي - صلى الله عليه وسلم - . قال ابن العربي : لقد كان أصحاب رسول الله - صلى الله عليه وسلم - سفرة ، كراما بررة ، ولكن ليسوا بمرادين بهذه الآية ، ولا قاربوا المرادين بها ، بل هي لفظة مخصوصة بالملائكة عند الإطلاق ، ولا يشاركهم فيها سواهم ، ولا يدخل معهم في متناولها غيرهم . وروي في الصحيح عن عائشة - رضي الله عنها - : أن رسول الله - صلى الله عليه وسلم - قال : مثل الذي يقرأ القرآن وهو حافظ له ، مع السفرة الكرام البررة ; ومثل الذي يقرؤه وهو يتعاهده ، وهو عليه شديد ، فله أجران متفق عليه ، [ ص: 187 ] واللفظ للبخاري .\n","ar.miqbas":"بِأَيْدِي سَفَرَةٍ (15) ويكون المراد بالسفرة جمع سافر ، أي كاتب ، وروي عن ابن عباس . قال الزجاج : وإنما قيل للكتاب سفر ( بكسر السين ) وللكاتب سَافر؛ لأن معناه أنه يبين الشيء ويوضحه يقال : أسفر الصبح ، إذا أضاء وقاله الفراء .ويجوز أن يراد بالصحف كتب الرسل الذين قبل محمد صلى الله عليه وسلم مثل التوراة والإِنجيل والزبور وصحف إبراهيم عليه السلام .فتكون هذه الأوصاف تأييداً للقرآن بأن الكتب الإلهية السابقة جاءت بما جاء به . ومعنى كون هذه التذكرة في كتب الرسل السابقين : أن أمثال معانيها وأصولها في كتبهم ، كما قال تعالى : { إن هذا لفي الصحف الأولى صحف إبراهيم وموسى } [ الأعلى : 18 19 ] وكما قال : { وإنه لفي زبر الأولين } [ الشعراء : 196 ] وكما قال : { شرع لكم من الدين ما وصى به نوحاً والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى } [ الشورى : 13 ] .ويجوز أن يراد بالصحف صحفٌ مجازية ، أي ذوات موجودةٌ قدسيةٌ يتلقى جبريل عليه السلام منها القرآن الذي يؤمر بتبليغه للنبيء صلى الله عليه وسلم ويكون إطلاق الصحف عليها لشبهها بالصحف التي يكتب الناس فيها . ومعنى { مكرمة } عناية الله بها ، ومعنى { مرفوعة } أنها من العالم العلوي ، ومعنى { مطهرة } مقدسة مباركة ، أي هذه التذكرة مما تضمنه علم الله وما كتبه للملائكة في صحف قدسية .وعلى الوجهين المذكورين في المراد بالصحف ( فَسَفَرة ) يجوز أن يكون جمع سَافر ، مثل كاتب وكتبة ، ويجوز أن يكون اسم جمع سَفير ، وهو المرسَل في أمر مهم ، فهو فَعيل بمعنى فاعل ، وقياس جمعه سفراء وتكون ( في ) للظرفية المجازية ، أي المماثلة في المعاني .وتأتي وجوهٌ مناسبة في معنى { سفرة } ، فالمناسب للوجه الأول : أن يكون السفرة كتاب القرآن من أصحاب رسول الله صلى الله عليه وسلم أو أن يكون المراد قراءُ القرآن ، وبه فسر قتادة وقال : هم بالنبطية القُراء ، وقال غيرهم : الوراقون باللغة العبرانية .وقد عدت هذه الكلمة في عداد ما ورد في القرآن من المعرّب كما في «الإِتقان» عن ابن أبي حاتم ، وقد أغفلها السيوطي فيما استدركه على ابن السبكي وابن حجر في نظميهما في المعرَّب في القرآن أو قَصد عدم ذكرها لوقوع الاختلاف في تعريبها .والمناسب للوجه الثاني : أن يكون محمله الرسل .والمناسب للوجه الثالث : أن يكون محمله الملائكة لأنهم سفراءُ بين الله ورسله .والمراد بأيْديهم : حِفْظهم إياه إلى تبليغه ، فمثّل حال الملائكة بحال السفراء الذين يحملون بأيديهم الألوك والعُهود .وإما أن يراد : الرسلُ الذين كانت بأيديهم كتُبهم مثل موسى وعيسى عليهما السلام .وإما أن يراد كتَّاب الوحي مثل عبد الله بن سعد بن أبي سرح ، وعبد الله بن عمرو بن العاص ، وعمر وعثمان وعلي وعامر بن فهيرة .وكان بعض المسلمين يكتب ما يتلقاه من القرآن ليدرسه مثل ما ورد في حديث إسلام عمر بن الخطاب من عُثُوره على سورة طه مكتوبة عند أخته أم جميل فاطمة زوج سعيد بن زيد .وفي وصفهم بالسفرة ثناء عليهم لأنهم يبلغون القرآن للناس وهم حفاظه ووعاته قال تعالى : { بل هو آيات بينات في صدور الذين أوتوا العلم } [ العنكبوت : 49 ] فهذا معنى السفرة . وفيه بشارة بأنهم سينشرون الإِسلام في الأمم وقد ظهر مما ذكرنا ما لكلمة { سفرة } من الوقع العظيم المعجز في هذا المقام .\n","ar.waseet":"وهى كائنة ( بِأَيْدِي سَفَرَةٍ ) وهم الملائكة الذين جعلهم الله - تعالى - سفراء بينه وبين رسله : جمع سافر بمعنى سفير . أى : رسول وواسطة ، أو هم الملائكة الذين ينسخون ويكتبون هذه الآيات بأمره - تعالى - جمع سافر بمعنى كاتب ، يقال : سفَر فلان يَسْفِره ، إذا كتبه .\n","ar.baghawi":"\"بأيدي سفرة\"، قال ابن عباس ومجاهد: كتبة، وهم الملائكة الكرام الكاتبون، واحدهم سافر، يقال: سفرت أي كتبت. ومنه قيل للكاتب: سافر، وللكتاب: سفر، وجمعه: أسفار. وقال الآخرون: هم الرسل من الملائكة واحدهم سفير، وهو الرسول، وسفير القوم الذي يسعى بينهم للصلح، وسفرت بين القوم إذا أصلحت بينهم.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5773.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5773.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5773.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"كِرَامٍ بَرَرَةٍ","transliteration":"Kiraamim bararah.","translations":{"en.ahmedali":"Noble and pious.","en.ahmedraza":"Who are noble, virtuous.","en.arberry":"noble, pious.","en.asad":"noble and most virtuous.","en.daryabadi":"Honourable and virtuous.","en.hilali":"Honourable and obedient.","en.pickthall":"Noble and righteous.","en.qaribullah":"noble and pious.","en.sahih":"Noble and dutiful.","en.sarwar":"and angelic scribes.","en.yusufali":"Honourable and Pious and Just.","en.maududi":"noble and purified.","en.shakir":"Noble, virtuous.","en.itani":"Noble and devoted.","en.mubarakpuri":"Honorable and obedient.","en.qarai":"noble and pious.","en.wahiduddin":"noble and virtuous scribes."},"tafsir":{"ar.muyassar":"وأمَّا من كان حريصا على لقائك، وهو يخشى الله من التقصير في الاسترشاد، فأنت عنه تتشاغل. ليس الأمر كما فعلت أيها الرسول، إن هذه السورة موعظة لك ولكل من شاء الاتعاظ. فمن شاء ذكر الله وَأْتَمَّ بوحيه. هذا الوحي، وهو القرآن في صحف معظمة، موقرة، عالية القدر مطهرة من الدنس والزيادة والنقص، بأيدي ملائكة كتبة، سفراء بين الله وخلقه، كرام الخلق، أخلاقهم وأفعالهم بارة طاهرة.","ar.jalalayn":"«كرام بررة» مطيعين لله تعالى وهم الملائكة.","ar.qurtubi":"كرام أي كرام على ربهم ; قاله الكلبي . الحسن : كرام عن المعاصي ، فهم يرفعون أنفسهم عنها . وروى الضحاك عن ابن عباس في كرام قال : يتكرمون أن يكونوا مع ابن آدم إذا خلا بزوجته ، أو تبرز لغائطه . وقيل : أي يؤثرون منافع غيرهم على منافع أنفسهم . بررة جمع بار مثل كافر وكفرة ، وساحر وسحرة ، وفاجر وفجرة ; يقال : بر وبار إذا كان أهلا للصدق ، ومنه بر فلان في يمينه : أي صدق ، وفلان يبر خالقه ويتبرره : أي يطيعه ; فمعنى بررة مطيعون لله ، صادقون لله في أعمالهم . وقد مضى في سورة ( الواقعة ) قوله تعالى :إنه لقرآن كريم في كتاب مكنون لا يمسه إلا المطهرون أنهم الكرام البررة في هذه السورة .\n","ar.miqbas":"كِرَامٍ بَرَرَةٍ (16)ووصف { كرام } مما وصف به الملائكة في آيات أخرى كقوله تعالى { كراماً كاتبين } [ الانفطار : 11 ] .ووصف البرَرة ورد صفةً للملائكة في الحديث الصحيح قوله : \" الذي يقرأ القرآن وهو ماهِر به مع السَفرة الكرام البرَرَة \" .والبررة : جمع بَرّ ، وهو الموصوف بكثرة البرور . وأصل بَرّ مصدر بَرَّ يبَرّ من باب فَرح ، ومصدره كالفَرح ، فهذا من باب الوصف بالمصدر مثل عَدل وقد اختص البررة بجمع بَرّ ولا يكون جمع بارّ .والغالب في اصطلاح القرآن أن البررة الملائكةُ والأبرارَ الآدميون . قال الراغب : «لأن بررة أبلغ من أبرار إذ هو جمع بَرّ ، وأبرار جمع بَار ، وبَرّ أبلغ من بار كما أن عَدلا أبلغ من عادل» .وهذا تنويه بشأن القرآن لأن التنويه بالآيات الواردة في أول هذه السورة من حيث إنها بعض القرآن فأثني على القرآن بفضيلة أثَره في التذكير والإِرشاد ، وبرفعة مكانته ، وقدس مصدره ، وكرم قراره ، وطهارته ، وفضائل حَمَلَتِه ومبلغيه ، فإن تلك المدائح عائدة إلى القرآن بطريق الكناية .\n","ar.waseet":"( كِرَامٍ بَرَرَةٍ ) أى : هذه الآيات بأيدى سفرة من صفاتهم أنهم مكرمون ومعظمون عنده - تعالى - ، وأنهم أتقياء مطيعون الله - تعالى - كل الطاعة ، جمع بَرّ ، وهو من كان كثير الطاعة والخشوع لله - عز وجل - . .هذا والمتأمل فى هذه الآيات الكريمة يراها قد اشتملت على كثير من الآداب والأحكام ، ومن ذلك : أن شريعة الله - تعالى - تجعل التفاضل بين الناس ، أساسه الإِيمان والتقوى ، فمع أن عبد الله ابن أم مكتوم ، كان قد قاطع الرسول صلى الله عليه وسلم لم يتشاغل عنه إلا لحرصه على جذب هؤلاء الزعماء إلى الإِسلام .مع كل ذلك ، وجدنا الآيات الكريمة ، تعاتب النبى صلى الله عليه وسلم عتابا تارة فيه رقة . وتارة فيه شدة . وذلك لأن الميزان الذى أنزله الله - تعالى - للناس مع الرسل ، لكى يبنوا عليه حياتهم ، هو : ( إِنَّ أَكْرَمَكُمْ عَندَ الله أَتْقَاكُمْ ) ولقد استجاب الرسول الكريم لهذا التوجيه الحكيم ، فبنى حياته كلها بعد ذلك على هذا الميزان العادل ، ومن مظاهر ذلك : إكرامه لابن أم مكتوم ، وقوله له كلما رآه : \" أهلا بمن عاتبنى فيه ربى \" .وفعل صلى الله عليه وسلم ما يشبه ذفلك ، مع جميع المؤمنين الصادقين الذين كانوا من فقراء المسلمين ، ولم يكونوا أصحاب جاه أن نفوذ أو عشيرة قوية .لقد جعل زيد بن حارثة - وهو الغريب عن مكة والمدينة ، أميرا على الجيش الإِسلامى فى غزوة مؤتة ، وكان فى هذا الجيش عدد كبير من كبار الصحابة .وقال صلى الله عليه وسلم فى شأن سلمان الفارسى : \" سلمان منا أهل البيت \" .وقال صلى الله عليه وسلم فى شأن عمار بن ياسر ، عندما استأذن عليه فى الدخول : \" ائذنوا له . مرحبا بالطيب المطيب \" .وكان من مظاهر تكريمه لعبد الله بن مسعود ، أن جعله كأنه واحد من أهله بيته .فعن أبى موسى الأشعرى قال : قدمت أنا وأخى من اليمن ، فمكثنا حينا وما نرى ابن مسعود وأمه إلا من أهل بيت رسول الله صلى الله عليه وسلم من كثرة دخولهم على رسول الله ، ولزومهم له . .وقال صلى الله عليه وسلم لأبى بكر الصديق عندما حدث كلام بينه وبين سلمان وصهيب وبلال فى شأن أبى سفيان : يا أبا بكر لعلك أغضبتهم ، لئن كنت أغضبتهم فقد أغضبت ربك .فقد أخرج الإِمام مسلم فى صحيحه . . \" أن أبا سفيان أتى على سلمان وصهيب وبلال فى نفر ، فقالوا : ما أخذت سيوف الله من عدو الله مأخذها ، فقال أبو بكر : أتقولون هذا لشيخ قريش وسيدهم؟فأتى النبى صلى الله عليه وسلم فأخبر فقال : \" يا أبا بكر لعلك أغضبتهم . لئن كنت أغضبتهم فقد أغضب ربك \" فأتاهم فقال : يا إخوتاه أأغضبتكم؟ قالوا : لا . ويغفر الله لك يا أخى . . \"ولقد سار خلفاؤه صلى الله عليه وسلم على هذه السنة ، فكانوا يكرمون الفقراء ، فأبوا بكر - رضى الله عنه - أذن لصهيب وبلال فى الدخول عليه ، قبل أن يأذن لأبى سفيان وسهيل بن عمرو . .وعمر - رضى الله عنه - يقول فى شأن أبى بكر : \" هو سيدنا وأعتق سيدنا \" يعنى : بلال ابن رباح . .قال صاحب الكشاف عند تفسيره ، لهذه الآيات : ولقد تأدب الناس بأدب الله فى هذا تأدبا حسنا ، فقد روى عن سفيان الثورى - رحمه الله - ، أن الفقراء كانوا فى مجلسه أمراء . .\n","ar.baghawi":"ثم أثنى عليهم فقال: \"كرام بررة\"، أي: كرام على الله، بررة مطيعين، جمع بار.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5774.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5774.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5774.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"قُتِلَ الْإِنْسَانُ مَا أَكْفَرَهُ","transliteration":"Qutilal-insanu maa akfarah.","translations":{"en.ahmedali":"Accursed is man. How ungrateful is he!","en.ahmedraza":"May man be slain – how ungrateful he is!","en.arberry":"Perish Man! How unthankful he is!","en.asad":"[But only too often] man destroys himself: how stubbornly does he deny the truth!","en.daryabadi":"Perish man! how ungrateful he is!","en.hilali":"Be cursed (the disbelieving) man! How ungrateful he is!","en.pickthall":"Man is (self-)destroyed: how ungrateful!","en.qaribullah":"Perish the human! How unthankful he is!","en.sahih":"Cursed is man; how disbelieving is he.","en.sarwar":"May (the disbelieving) human being be condemned! What makes him disbelieve?","en.yusufali":"Woe to man! What hath made him reject Allah;","en.maududi":"Accursed be man! How stubbornly he denies the Truth.","en.shakir":"Cursed be man! how ungrateful is he!","en.itani":"Perish man! How thankless he is!","en.mubarakpuri":"Qutila mankind! How ungrateful he is!","en.qarai":"Perish man! How ungrateful is he!","en.wahiduddin":"Woe to man! How ungrateful he is!"},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«قتل الإنسان» لعن الكافر «ما أكفره» استفهام توبيخ، أي ما حمله على الكفر.","ar.qurtubi":"قوله تعالى : قتل الإنسان ما أكفره ؟ قتل أي لعن . وقيل : عذب . والإنسان الكافر روى الأعمش عن مجاهد قال : ما كان في القرآن قتل الإنسان فإنما عني به الكافر . وروى الضحاك عن ابن عباس قال : نزلت في عتبة بن أبي لهب ، وكان قد آمن ، فلما نزلت والنجم ارتد ، وقال : آمنت بالقرآن كله إلا النجم ، فأنزل الله - جل ثناؤه فيه - قتل الإنسان أي لعن عتبة حيث كفر بالقرآن ، ودعا عليه رسول الله - صلى الله عليه وسلم - فقال : اللهم سلط عليه كلبك أسد الغاضرة فخرج من فوره بتجارة إلى الشام ، فلما انتهى إلى الغاضرة تذكر دعاء النبي - صلى الله عليه وسلم - ، فجعل لمن معه ألف دينار إن هو أصبح حيا ، فجعلوه في وسط الرفقة ، وجعلوا المتاع حوله ، فبينما هم على ذلك أقبل الأسد ، فلما دنا من الرحال وثب ، فإذا هو فوقه فمزقه ، وقد كان أبوه ندبه وبكى وقال : ما قال محمد شيئا قط إلا كان . وروى أبو صالح عن ابن عباس ما أكفره : [ ص: 188 ] أي شيء أكفره ؟ وقيل : ما تعجب ; وعادة العرب إذا تعجبوا من شيء قالوا : قاتله الله ما أحسنه ! وأخزاه الله ما أظلمه ; والمعنى : اعجبوا من كفر الإنسان لجميع ما ذكرنا بعد هذا . وقيل : ما أكفره بالله ونعمه مع معرفته بكثرة إحسانه إليه على التعجب أيضا ; قال ابن جريج : أي ما أشد كفره ! وقيل : ما استفهام أي أي شيء دعاه إلى الكفر ; فهو استفهام توبيخ . و ( ما ) تحتمل التعجب ، وتحتمل معنى أي ، فتكون استفهاما .\n","ar.miqbas":"قُتِلَ الْإِنْسَانُ مَا أَكْفَرَهُ (17) استئناف ابتدائي نشأ عن ذكر من استغنى فإنه أريد به معين واحد أو أكثرُ ، وذلك يبيِّنه مَا وقع من الكلام الذي دار بين النبي صلى الله عليه وسلم وبين صناديد المشركين في المجلس الذي دخل فيه ابن أم مكتوم .والمناسبة وصفُ القرآن بأنه تذكرة لمن شاء أن يتذكر ، وإذ قد كان أكبر دواعيهم على التكذيب بالقرآن أنه أخبر عن البعث وطالَبهم بالإِيمان به كان الاستدلال على وقوع البعث أهم ما يعتنى به في هذا التذكير وذلك من أفنان قوله : { فمن شاء ذكره } [ عبس : 12 ] .والذي عُرِّف بقوله : { من استغنى } [ عبس : 5 ] يشمله العموم الذي أفاده تعريف { الإِنسان } من قوله تعالى : { قتل الإنسان ما أكفره } .وفعل قُتل فُلانٌ أصله دعاء عليه بالقتل . والمفسرون الأولون جعلوا : { قتل الإنسان } أنه لُعِن ، رواه الضحاك عن ابن عباس وقاله مجاهد وقتادة وأبو مالك . قال في «الكشاف» : «دعاء عليه وهذا من أشنع دعواتهم» ، أي فمورده غير مورد قوله تعالى : { قاتلهم اللَّه } [ التوبة : 30 ] وقولِهم : قاتَل الله فلاناً يريدون التعجب من حاله ، وهذا أمر مرجعه للاستعمال ولا داعي إلى حمله على التعجيب لأن قوله : { ما أكفره } يغني عن ذلك .والدعاء بالسوء من الله تعالى مستعمل في التحقير والتهديد لظهور أن حقيقة الدعاء لا تناسب الإلهية لأن الله هو الذي يتوجه إليه الناس بالدعاء .وبناء { قتل } للمجهول متفرع على استعماله في الدعاء ، إذ لا غرض في قاتِل يَقتله ، وكثر في القرآن مبنياً للمجهول نحو { فقتل كيف قدر } [ المدثر : 19 ] .وتعريف { الإنسان } يجوز أن يكون التعريفَ المسمى تعريفَ الجنس فيفيد استغراق جميع أفراد الجنس ، وهو استغراق حقيقي ، وقد يراد به استغراق معظم الأفراد بحسب القرائن فتولَّدَ بصيغة الاستغراق ادعاء لعدم الاعتداد بالقليل من الأفراد ، ويسمى الاستغراق العرفي في اصطلاح علماء المعاني ، ويسمى العامَّ المرادَ به الخصوص في اصطلاح علماء الأصول والقرينة هنا ما بُين به كفر الإِنسان من قوله : { من أي شيء خلقه } إلى قوله : { ثم إذا شاء أنشره } فيكون المراد من قوله : { الإنسان } المشركين المنكرين البعث ، وعلى ذلك جملة المفسرين ، فإن معظم العرب يومئذ كافرون بالبعث .قال مجاهد : ما كان في القرآن { قتل الإنسان } فإنما عُني به الكافر .والأحكام التي يحكم بها على الأجناس يراد أنها غالبة على الجنس ، فالاستغراق الذي يقتضيه تعريف لفظ الجنس المحكوم عليه استغراق عرفي معناه ثبوت الحكم للجنس على الجملة ، فلا يقتضي اتصاف جميع الأفراد به ، بل قد يخلو عنه بعض الأفراد وقد يخلو عنه المتصف به في بعض الأحيان ، فقوله : { ما أكفره } تعجيب من كفر جنس الإنسان أو شدة كفره وإن كان القليل منه غير كافر .فآل معنى الإنسان إلى الكفار من هذا الجنس وهم الغالب على نوع الإِنسان .فغالب الناس كفروا بالله من أَقدم عصور التاريخ وتفَشَّى الكفر بين أفراد الإِنسان وانتصروا له وناضلوا عنه . ولا أعجبَ من كفر من أَلَّهوا أعْجز الموجودات من حجارة وخشب ، أو نَفَوا أن يكون لهم رب خلقهم .ويجوز أن يكون تعريف { الإنسان } تعريف العهد لشخص معين من الإنسان يُعيِّنه خبر سبب النزول ، فقيل : أريد به أميةُ بن خلف ، وكان ممن حواه المجلس الذي غشيه ابن أم مكتوم ، وعندي أن الأولى أن يكون أراد به الوليد بن المغيرة .وعن ابن عباس أن المراد عتبة بن أبي لهب ، وذكر في ذلك قصة لا علاقة لها بخبر المجلس الذي غشيه ابن أم مكتوم ، فتكون الجملة مستأنفة استئنافاً ابتدائياً ، والمناسبة ظاهرة .وجملة { ما أكفره } تعليل لإنشاء الدعاء عليه دعاء التحقير والتهديد . وهذا تعجيب من شدة كفر هذا الإنسان .ومعنى شدة الكفر أن كفره شديد كَمّاً وكيْفاً ، ومتىً ، لأنه كفر بوحدانية الله ، وبقدرته على إعادة خلق الأجسام بعد الفناء ، وبإرساله الرسول ، وبالوحي إليه صلى الله عليه وسلم وأنه كفر قوي لأنه اعتقاد قوي لا يقبل التزحزح ، وأنه مستمر لا يقلع عنه مع تكرر التذكير والإِنذار والتهديد .وهذه الجملة بلغت نهاية الإِيجاز وأرفع الجزالة بأسلوب غليظ دال على السخط بالغ حدّ المذمة ، جامع للملامة ، ولم يسمع مثلها قبلها ، فهي من جوامع الكلم القرآنية .وحذف المتعلِّق بلفظ { أكفره } لظهوره من لفظ «أكفَرَ» وتقديرُه : ما أكفره بالله .وفي قوله : { قتل الإنسان ما أكفره } محسّن الاتِّزَان فإنه من بحر الرمل من عروضه الأولى المحذوفة .\n","ar.waseet":"ثم انتقلت السورة الكريمة بعد ذلك ، إلى الحديث عن جانب من نعم الله - تعالى - على خلقه ، وموقفهم من هذه النعم ، فقال - تعالى - :( قُتِلَ الإنسان مَآ . . . ) .قال الإِمام الرازى : اعلم أنه - تعالى - لما بدأ بذكر القصة المشتملة على ترفع صناديد قريش على فقراء المسملين ، عجب عباده المؤمنين من ذلك ، فكأنه قيل : وأى سبب فى هذا العجب والترفع؟ مع أن أوله نطفة قذرة ، وآخره جيفة مذرة ، وفيما بين الوقتين حمال عذرة ، فلا عجب أن ذكر الله - تعالى - ما يصلح أن يكون علاجا لعجبهم وما يصلح أن يكون علاجا لكفرهم ، فإن خلقه الإِنسان يستدل بها على وجود الصانع ، وعلى القول بالبعث والحشر والنشر . .والمراد بالإِنسان هنا : الإِنسان الكافر الجاحد لنعم ربه . ومعنى \" قتل \" لعن وطرد من رحمة الله - تعالى - ، ويصح أن يكون المراد به الجنس ، ويدخل فيه الكافر دخولا أوليا أى : لعن وطرد من رحمة الله - تعالى - ذلك الإِنسان الذى ما أشده كفره وجحوده لنعم الله - تعالى - .والدعاء عليه باللعن من الله - تعالى - ، المقصود به : التهديد والتحقير من شأن هذا الإِنسان الجاحد ، إذ من المعلوم أن الله - سبحانه - هو الذى يتوجه إليه الناس بالدعاء ، وليس هو - سبحانه - الذى يدعو على غيره ، إذ الدعاء فى العادة إنما يكون من العاجز ، وجل شأن الله - تعالى - عن العجز .وجملة \" ما أكفره \" تعليل لاستحقاق هذا الإِنسان الجاحد التحقير والتهديد .وهذه الآية الكريمة المتأمل فيها يراها - مع بلوغها نهاية الإِيجاز - قد بلغت - أيضا - نهاية الإِعجاز فى أسلوبها ، حيث جمعت أشد ألوان الذم والتحقير بأبلغ أسلوب وأوجزه .ولذ قال صاحب الكشاف : ( قُتِلَ الإنسان ) دعاء عليه ، وهى من أشنع دعواتهم ، لأن القتل قصارى شدائد الدنيا وفظائعها ( مَآ أَكْفَرَهُ ) تعجيب من إفراطه فى كفران نعمة الله ، ولا ترى أسلوبا أغلظ منه ولا أخشن متنا ، ولا أدل على سخط ، ولا أبعد فى المذمة ، مع تقارب طرفيه ، ولا أجمع لِلائمةٍ ، على قصر متنه . .\n","ar.baghawi":"قوله - عز وجل - : ( قتل الإنسان ) أي لعن الكافر . قال مقاتل : نزلت في عتبة بن أبي لهب ( ما أكفره ) ما أشد كفره بالله مع كثرة إحسانه إليه وأياديه عنده ، على طريق التعجب ، قال الزجاج : معناه : اعجبوا أنتم من كفره . وقال الكلبي ومقاتل : هو \" ما \" الاستفهام ، يعني : أي شيء حمله على الكفر ؟\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5775.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5775.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5775.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"مِنْ أَيِّ شَيْءٍ خَلَقَهُ","transliteration":"Min aiyyi shai-in Khalaq","translations":{"en.ahmedali":"Of what substance God created him?","en.ahmedraza":"From what did He create him?","en.arberry":"Of what did He create him?","en.asad":"[Does man ever consider] out of what substance [God] creates him?","en.daryabadi":"Of what thing hath He created him?","en.hilali":"From what thing did He create him?","en.pickthall":"From what thing doth He create him?","en.qaribullah":"From what did He create him?","en.sahih":"From what substance did He create him?","en.sarwar":"From what has God created him?","en.yusufali":"From what stuff hath He created him?","en.maududi":"Out of what did Allah create him?","en.shakir":"Of what thing did He create him?","en.itani":"From what did He create him?","en.mubarakpuri":"From what thing did He create him","en.qarai":"From what did He create him?","en.wahiduddin":"Of what [stuff] has He created him?"},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«من أي شيءٍ خلقه» استفهام تقرير، ثم بينه فقال:","ar.qurtubi":"أي من أي شيء خلق الله هذا الكافر فيتكبر ؟ أي اعجبوا لخلقه .\n","ar.miqbas":"مِنْ أَيِّ شَيْءٍ خَلَقَهُ (18) وجملة { من أي شيء خلقه } بيان لجملة { قتل الإنسان ما أكفره } ، لأن مفاد هذه الجملة الاستدلال على إبطال إحالتهم البعث وذلك الإِنكار من أكبر أصول كفرهم .وجيء في هذا الاستدلال بصورة سؤال وجواب للتشويق إلى مضمونه ، ولذلك قرن الاستفهام بالجواب عنه على الطريقة المتقدمة في قوله تعالى : { عم يتساءلون عن النبأ العظيم } [ النبأ : 1 2 ] .والاستفهام صوري ، وجعل المستفهم عنه تعيين الأمر الذي به خلق الإنسان لأن المقام هنا ليس لإِثبات أن الله خلق الإِنسان ، بل المقام لإِثبات إمكان إعادة الخلق بتنظيره بالخلق الأول على طريقة قوله تعالى : { أفعيينا بالخلق الأول } [ ق : 15 ] أي كما كان خلق الإنسان أول مرة من نطفة يكون خلقه ثاني مرة من كائن مَّا ، ونظيره قوله تعالى : { فلينظر الإِنسان مم خلق خلق من ماء دافق يخرج من بين الصلب والترائب إنه على رجعه لقادر } في سورة الطارق ( 5 8 ) .والضمير المستتر في قوله : خلقه } عائد إلى لله تعالى المعلوم من فعل الخلق لأن المشركين لم يكونوا ينكرون أن الله خالق الإنسان .\n","ar.waseet":"ثم فصل - سبحانه - جانبا من نعمه ، التى تستحق من هذا الإِنسان الشكر لا الكفر فقال : ( مِنْ أَيِّ شَيءٍ خَلَقَهُ ) أى : من أى شئ خلق الله - تعالى - هذ الإِنسان الكافر الجحود ، حتى يتكبر ويتعظم عن طاعته ، وعن الإِقرار بتوحيده ، وعن الاعتراف بأن هناك بعثا وحسابا وجزاء . . ؟\n","ar.baghawi":"ثم بين من أمره ما كان ينبغي معه أن يعلم أن الله خالقه فقال: \"من أي شيء خلقه\"، لفظه استفهام ومعناه التقرير.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5776.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5776.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5776.mp3","format":"mp3","local_path":null}}},{"verse":19,"arabic":"مِنْ نُطْفَةٍ خَلَقَهُ فَقَدَّرَهُ","transliteration":"Min nutfah; khalaqahu faqad-darah.","translations":{"en.ahmedali":"From a single sperm He created, then proportioned him,","en.ahmedraza":"From a drop of liquid; He created him and then set several measures for him.","en.arberry":"Of a sperm-drop He created him, and determined him,","en.asad":"Out of a drop of sperm He creates him, and thereupon determines his nature,","en.daryabadi":"Of a drop of seed. He created him and formed him according to a measure.","en.hilali":"From Nutfah (male and female semen drops) He created him, and then set him in due proportion;","en.pickthall":"From a drop of seed. He createth him and proportioneth him,","en.qaribullah":"From a (sperm) drop He created him and then determined him,","en.sahih":"From a sperm-drop He created him and destined for him;","en.sarwar":"He created him from a living germ. He determined his fate","en.yusufali":"From a sperm-drop: He hath created him, and then mouldeth him in due proportions;","en.maududi":"Out of a sperm-drop did He create him and then determined a measure for him,","en.shakir":"Of a small seed; He created him, then He made him according to a measure,","en.itani":"From a sperm drop He created him, and enabled him.","en.mubarakpuri":"From a Nutfah He created him and then set him in due proportion.","en.qarai":"He created him from a drop of [seminal] fluid; then proportioned him.","en.wahiduddin":"Out of a drop of sperm! He creates and proportions him,"},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«من نطفة خلقه فقدره» علقة ثم مضغة إلى آخر خلقه.","ar.qurtubi":"من نطفة أي من ماء يسير مهين جماد خلقه فلم يغلط في نفسه ؟ ! قال الحسن : كيف يتكبر من خرج من سبيل البول مرتين . فقدره في بطن أمه . كذا روى الضحاك عن ابن عباس : أي قدر يديه ورجليه وعينيه وسائر آرابه ، وحسنا ودميما ، وقصيرا وطويلا ، وشقيا وسعيدا . وقيل : فقدره أي فسواه كما قال : أكفرت بالذي خلقك من تراب ثم من نطفة ثم سواك رجلا . وقال : الذي خلقك فسواك . وقيل : فقدره أطوارا أي من حال إلى حال ; نطفة ثم علقة ، إلى أن تم خلقه .\n","ar.miqbas":"مِنْ نُطْفَةٍ خَلَقَهُ فَقَدَّرَهُ (19) وقدم الجار والمجرور في قوله : { من نطفة خلقه } محاكاة لتقديم المبيَّن في السؤال الذي اقتضى تقديمَه كونُه استفهاماً يستحق صدر الكلام ، مع الاهتمام بتقديم ما منه الخلق ، لما في تقديمه من التنبيه للاستدلال على عظيم حكمة الله تعالى إذ كوّن أبدع مخلوققٍ معروف من أهون شيء وهو النطفة .وإنما لم يستغن عن إعادة فعل خلقه في جملة الجواب مع العلم به بتقدم ذكر حاصله في السؤال لزيادة التنبيه على دقة ذلك الخلق البديع .فذكر فعل { خلقه } الثاني من أسلوب المساواة ليس بإيجاز ، وليس بإطناب .والنطفة : الماء القليل ، وهي فُعلة بمعنى مفعولة كقولهم : قُبضةُ حَب ، وغُرفة ماء . وغلب إطلاق النطفة على الماء الذي منه التناسل ، فذُكرت النطفة لتعيُّن ذكرها لأنها مادة خلق الحيوان للدلالة على أن صنع الله بديع فإمكان البعث حاصل ، وليس في ذكر النطفة هنا إيماء إلى تحقير أصل نشأة الإنسان لأن قصد ذلك محل نظر ، على أن المقام هنا للدلالة على خلققٍ عظيم وليس مقام زجر المتكبر .وفُرع على فعل { خلقه } فعلُ { فقدره } بفاء التفريع لأن التقدير هنا إيجاد الشيء على مقدار مضبوط منظم كقوله تعالى : { وخلق كل شيء فقدره تقديراً } [ الفرقان : 2 ] أي جعل التقدير من آثار الخلق لأنه خلقه متهيئاً للنماء وما يلابسه من العقل والتصرف وتمكينه من النظر بعقله ، والأعمال التي يريد إتيانها وذلك حاصل مع خلقه مدرَّجاً مفرعاً .وهذا التفريع وما عطف عليه إدماج للامتنان في خلال الاستدلال .\n","ar.waseet":"ثم وضح - سبحانه - كيفية خلق الإِنسان فقال : ( مِن نُّطْفَةٍ خَلَقَهُ فَقَدَّرَهُ ) أى : خلق الله - تعالى - الإِنسان من نطفة ، أى : من ماء قليل يخرج من الرجل إلى رحم المرأة - ( فقدره ) أى : فأوجد الله - تعالى - الإِنسان بعد ذلك إيجادا متقنا محكما ، حيث صير بقدرته النطفة علقة فمضغة . . ثم أنشأه خلقا آخر ثُمَّ خَلَقْنَا( فَتَبَارَكَ الله أَحْسَنُ الخالقين ) .\n","ar.baghawi":"ثم فسره فقال: \"من نطفة خلقه فقدره\"، أطواراً: نطفة ثم علقة إلى آخر خلقه، قال الكلبي: قدر خلقه، رأسه وعينيه ويديه ورجليه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5777.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5777.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5777.mp3","format":"mp3","local_path":null}}},{"verse":20,"arabic":"ثُمَّ السَّبِيلَ يَسَّرَهُ","transliteration":"Thummas sabeela yas-sarah","translations":{"en.ahmedali":"Then made his passage easy (at birth);","en.ahmedraza":"Then eased the way for him.","en.arberry":"then the way eased for him,","en.asad":"and then makes it easy for him to go through life;","en.daryabadi":"Then the way He made easy.","en.hilali":"Then He makes the Path easy for him;","en.pickthall":"Then maketh the way easy for him,","en.qaribullah":"then eased his path for him,","en.sahih":"Then He eased the way for him;","en.sarwar":"and made the path of guidance easy for him to follow.","en.yusufali":"Then doth He make His path smooth for him;","en.maududi":"and then made the course of life easy for him,","en.shakir":"Then (as for) the way-- He has made it easy (for him)","en.itani":"Then He eased the way for him.","en.mubarakpuri":"Then He made the path easy for him.","en.qarai":"Then He made the way easy for him;","en.wahiduddin":"He makes his path easy for him."},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«ثم السبيل» أي طريق خروجه من بطن أمه «يَسَّره».","ar.qurtubi":"ثم السبيل يسره قال ابن عباس في رواية عطاء وقتادة والسدي ومقاتل : يسره للخروج من بطن أمه . مجاهد : يسره لطريق الخير والشر ; أي بين له ذلك . دليله : إنا هديناه السبيل و هديناه النجدين . وقاله الحسن وعطاء وابن عباس أيضا في رواية أبي صالح عنه . وعن مجاهد أيضا قال : سبيل الشقاء والسعادة . ابن زيد : سبيل الإسلام . وقال أبو بكر بن طاهر يسر على كل أحد ما خلقه له وقدره عليه ; دليله قوله - عليه السلام - : اعملوا فكل ميسر لما خلق له .\n","ar.miqbas":"ثُمَّ السَّبِيلَ يَسَّرَهُ (20) وحرف { ثم } من قوله : { ثم السبيل يسره } للتراخي الرتبي لأن تيسير سبيل العمل الإنساني أعجب في الدلالة على بديع صنع الله لأنه أثَرُ العقل وهو أعظم ما في خلق الإنسان وهو أقوى في المنة .و { السبيل } : الطريق ، وهو هنا مستعار لما يفعله الإنسان من أعماله وتصرفاته تشبيهاً للأعمال بطريق يمشي فيه الماشي تشبيهَ المحسوس بالمعقول .ويجوز أن يكون مستعاراً لمسقط المولود من بطن أمه فقد أطلق على ذلك المَمر اسم السبيل في قولهم : «السبيلان» فيكون هذا من استعمال اللفظ في مجازيه .\n","ar.waseet":"( ثُمَّ السبيل يَسَّرَهُ ) أى : ثم بعد أن خلقه فى أحسن تقويم ، ومنحه العقل الذى يتمكن معه من التفكير السليم . يسر - سبحانه - له طريق النظر القويم ، الذى يميز به بين الحق والباطل ، والخير والشر ، والهدى والضلال .قال ابن كثير : قوله ( ثُمَّ السبيل يَسَّرَهُ ) قال العوفى عن ابن عباس : ثم يسر عليه خروجه من بطن أمه . وهكذا قال عكرمة . . واختاره ابن جرير .وقال مجاهد : هذه الآية كقوله : ( إِنَّا هَدَيْنَاهُ السبيل إِمَّا شَاكِراً وَإِمَّا كَفُوراً ) أى بيناه له ووضحناه وسهلنا عليه علما . . وهذا هو الأرجح .وجاء العطف \" بثم \" هنا ، للإِشعار بالتراخى الرتبى ، لأن تيسير معرفة طريق الخبر والشر ، أعجب وأجل على قدرة الله - تعالى - وبديع صنعه من أى شئ آخر .ولفظ \" السبيل \" منصوب على الاشتغال بفعل مقدر ، أى : ثم يسر السبيل يسره ، فالضمير فى يسره يعود إلى السبيل . أى : سهل - سبحانه - الطريق للإِنسان .\n","ar.baghawi":"\"ثم السبيل يسره\"، أي طريق خروجه من بطن أمه. قال السدي ومقاتل، والحسن ومجاهد: يعني طريق الحق والباطل، سهل له العلم به، كما قال: \"إنا هديناه السبيل\" (الإنسان- 3) \"وهديناه النجدين\" (البلد-10)، وقيل: يسر على كل أحد ما خلقه له وقدره عليه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5778.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5778.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5778.mp3","format":"mp3","local_path":null}}},{"verse":21,"arabic":"ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ","transliteration":"Thumma amatahu fa-aqbarah","translations":{"en.ahmedali":"He will then send him to death and have him laid in the grave.","en.ahmedraza":"Then gave him death, so had him put in the grave.","en.arberry":"then makes him to die, and buries him,","en.asad":"and in the end He causes him to die and brings him to the grave;","en.daryabadi":"Then He caused him to die and made him to be buried.","en.hilali":"Then He causes him to die, and puts him in his grave;","en.pickthall":"Then causeth him to die, and burieth him;","en.qaribullah":"then causes him to die and buries him,","en.sahih":"Then He causes his death and provides a grave for him.","en.sarwar":"Then He caused him to die and be buried","en.yusufali":"Then He causeth him to die, and putteth him in his grave;","en.maududi":"then He caused him to die and brought him to the grave,","en.shakir":"Then He causes him to die, then assigns to him a grave,","en.itani":"Then He puts him to death, and buries him.","en.mubarakpuri":"Then He causes him to die and puts him in his grave.","en.qarai":"then He made him die and buried him;","en.wahiduddin":"Then He causes him to die and be buried."},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«ثم أماته فأقبره» جعله في قبر يستره.","ar.qurtubi":"ثم أماته فأقبره أي جعل له قبرا يوارى فيه إكراما ، ولم يجعله مما يلقى على وجه الأرض تأكله الطير والعوافي ; قاله الفراء . وقال أبو عبيدة : أقبره : جعل له قبرا ، وأمر أن يقبر . قال أبو عبيدة : ولما قتل عمر بن هبيرة صالح بن عبد الرحمن ، قالت بنو تميم ودخلوا عليه : أقبرنا صالحا ; فقال : دونكموه . وقال : أقبره ولم يقل قبره ; لأن القابر هو الدافن بيده ، قال الأعشى :[ ص: 189 ]لو أسندت ميتا إلى نحرها عاش ولم ينقل إلى قابريقال : قبرت الميت : إذا دفنته ، وأقبره الله : أي صيره بحيث يقبر ، وجعل له قبرا ; تقول العرب : بترت ذنب البعير ، وأبتره الله ، وعضبت قرن الثور ، وأعضبه الله ، وطردت فلانا ، والله أطرده ، أي صيره طريدا .\n","ar.miqbas":"ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ (21) وفيه مناسبة لقوله بعده : { ثم أماته فأقبره } ، ف { أماته } مقابل { خلقه } و { أقبره } مقابل { ثم السبيل يسره } لأن الإِقبار إدخال في الأرض وهو ضد خروج المولود إلى الأرض .والتيسير : التسهيل ، و { السبيل } منصوب بفعل مضمر على طريق الاشتغال ، والضمير عائد إلى { السبيل } . والتقدير : يسّر السبيل له ، كقوله : { ولقد يسرنا القرآن للذكر } [ القمر : 17 ] أي لذِكر الناس .وتقديم { السبيل } على فعله للاهتمام بالعبرة بتيسير السبيل بمعنييه المجازيين ، وفيه رعاية للفواصل .وكذلك عطف { ثم أماته } على { يسره } بحرف التراخي هو لتراخي الرتبة فإن انقراض تلك القُوى العقلية والحسيّة بالموت ، بعد أن كانت راسخة زمناً ما ، انقراض عجيب دون تدريج ولا انتظارِ زماننٍ يساوي مدة بقائها ، وهذا إدماج للدلالة على عظيم القدرة .ومن المعلوم بالضرورة أن الكثير الذي لا يُحصى من أفراد النوع الإنساني قد صار أمره إلى الموت وأن من هو حيّ آيل إلى الموت لا محالة ، فالمعنى : ثم أماته ويُميته .فصيغة المضي في قوله : { أماته } مستعملة في حقيقته وهو موت من مات ، ومجازِه وهو موت من سيموتون ، لأن موتهم في المستقبل محقق . وذكر جملة : { ثم أماته } توطئة وتمهيد لجملة { فأقبره } .وإسناد الإماتة إلى الله تعالى حقيقة عقلية بحسب عرف الاستعمال . وهذا إدماج للامتنان في خلال الاستدلال كما أدمج : { فقدره ثم السبيل يسره } فيما سبق .و { أقبره } جعله ذا قبر ، وهو أخص من معنى قَبَره ، أي أن الله سَبّب له أن يقبر . قال الفراء : «أي جعله مقبوراً ، ولم يجعله ممن يُلقى للطير والسباع ولا ممن يلقى في النواويس» ( جمع ناووس صندوق من حجر أو خشب يوضع فيه الميت ويجعل في بيت أو نحوه ) .والإِقبار : تهيئة القبر ، ويقال : أقبره أيضاً ، إذا أمر بأن يُقبر ، ويقال : قبر المَيت ، إذا دفنه ، فالمعنى : أن الله جعل الناس ذوي قبور .وإسناد الإِقبار إلى الله تعالى مجاز عقلي لأن الله ألهم الناس الدَّفن كما في قصة دفن أحد ابني آدم أخاه بإلهام تقليده لفعل غراب حفر لغراب آخر ميتتٍ حفرةً فواراه فيها ، وهي في سورة العقود ، فأسند الإِقبار إلى الله لأنه ألهم الناس إياه . وأكد ذلك بما أمر في شرائعه من وجوب دفن المَيت .والقول في أن صيغة المضي مستعملة في حقيقتها ومجازها نظير القول في صيغة { أماته } .وهذه كلها دلائل على عظيم قدرة الله تعالى وهم عَدوها قاصرة على الخلق الثاني ، وهي تتضمن منناً على الناس في خلقهم وتسويتهم وإكمال قواهم أحياء ، وإكرامهم أمواتاً بالدفن لئلا يكون الإنسان كالشيء اللّقي يجتنب بنو جنسه القرب منه ويهينه التقام السباع وتمزيق مخالب الطير والكلاب ، فمحل المنة في قوله : { ثم أماته } هو فيما فرع عليه بالفاء بقوله : { فأقبره } وليست الإِماتة وحدها منة .وفي الآية دليل على أن وجوب دفن أموات الناس بالإِقبار دون الحرق بالنار كما يفعل مجوس الهند ، ودون الإِلقاء لسباع الطير في ساحات في الجبال محوطة بجدران دون سقف كما كان يفعله مجوس الفرس وكما كان يفعله أهل الجاهلية بموتى الحروب والغارات في الفيافي إذ لا يوارونهم بالتراب وكانوا يفتخرون بذلك ويتمنونه قال الشنفَرَى: ... لا تقبروني إن قبري محرَّمعليكم ولكن أبشري أمَّ عامر ... يريد أن تأكله الضبع ، وأبطل الإسلام ذلك فإن النبي صلى الله عليه وسلم دفَن شهداء المسلمين يوم أحد في قبور مشتركة ، ووارَى قتلى المشركين ببدر في قليب ، قال عمرو بن معديكرب قبل الإِسلام: ... آليتُ لا أدفِن قتلاكُمُ\n","ar.waseet":"( ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ ) أى : ثم أمات - سبحانه - هذا الإِنسان ، بأن سلبه الحياة ( فأقبره ) أى : فجعله ذا قبر يوارى فيه جسده تكريما له ، ولم يتركه مطروحا على وجه الأرض ، بحيث يستقذره الناس ، ويكون عرضة لاعتداء الطيور والحيوانات عليه .يقال : قبر فلان الميت يقبره - بكسر الباء وضمها - ، إذا دفنه بيده فهو قابر . ويقال : أقبره ، إذا أمر بدفنه ، أو مكن غيره من دفنه .وفى الآية الكريمة إشارة إلى أن مواراة الأجساد فى القبور من سنن الإِسلام ، أما تركها بدون دفن ، أو حرقها . . فيتنافى مع تركيم هذه الأجساد .\n","ar.baghawi":"( ثم أماته فأقبره ) جعل له قبرا يوارى فيه . قال الفراء : جعله مقبورا ولم يجعله ممن يلقى كالسباع والطيور . يقال : قبرت الميت إذا دفنته ، وأقبره الله : أي صيره بحيث يقبر ، وجعله ذا قبر ، كما يقال : طردت فلانا والله أطرده أي صيره طريدا .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5779.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5779.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5779.mp3","format":"mp3","local_path":null}}},{"verse":22,"arabic":"ثُمَّ إِذَا شَاءَ أَنْشَرَهُ","transliteration":"Thumma iza shaa-a ansharah","translations":{"en.ahmedali":"Then He will raise him up again when He please.","en.ahmedraza":"Then, when He willed, He brought him out. (As during the night of Holy Prophet’s ascension, when all the Prophets gathered behind him in the Al Aqsa mosque in Jerusalem. Or when Allah will raise everyone on the Day of Resurrection.)","en.arberry":"then, when He wills, He raises him.","en.asad":"and then, if it be His will, He shall raise him again to life,","en.daryabadi":"Then when He listeth, He shall raise him to life.","en.hilali":"Then, when it is His Will, He will resurrect him (again).","en.pickthall":"Then, when He will, He bringeth him again to life.","en.qaribullah":"then, He will raise him when He wills.","en.sahih":"Then when He wills, He will resurrect him.","en.sarwar":"and He will resurrect him whenever He wants.","en.yusufali":"Then, when it is His Will, He will raise him up (again).","en.maududi":"and then, whenever He wishes, He will raise him back to life.","en.shakir":"Then when He pleases, He will raise him to life again.","en.itani":"Then, when He wills, He will resurrect him.","en.mubarakpuri":"Then when it is His will, He will resurrect him.","en.qarai":"and then, when He wished, resurrected him.","en.wahiduddin":"Then when He pleases, He will bring him back to life."},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«ثم إذا شاء أنشره» للبعث.","ar.qurtubi":"ثم إذا شاء أنشره أي أحياه بعد موته . وقراءة العامة أنشره بالألف . وروى أبو حيوة عن نافع وشعيب بن أبي حمزة ( شاء نشره ) بغير ألف ، لغتان فصيحتان بمعنى ; يقال : أنشر الله الميت ونشره ; قال الأعشى :حتى يقول الناس مما رأوا     يا عجبا للميت الناشر\n","ar.miqbas":"ثُمَّ إِذَا شَاءَ أَنْشَرَهُ (22)فدَخِّنُوا المَرْءَ وسِرْبَالَه ... وجملة : { ثم إذا شاء أنشره } رجوع إلى إثبات البعث وهي كالنتيجة عقب الاستدلال . ووقع قوله : { إذا شاء } معترضاً بين جملة { أماته } وجملة : { أنشره } لرد توهم المشركين أن عدم التعجيل بالبعث دليل على انتفاء وقوعه في المستقبل و ( إذا ) ظرف للمستقبل ففعل المضي بعدها مؤول بالمستقبل .والمعنى : ثم حين يشاء ينشره ، أي ينشره حين تتعلق مشيئته بإنشاره .و { أنشره } بعثه من الأرض وأصل النشر إخراج الشيء المخبأ يقال : نشر الثوب ، إذ أزال طيّه ، ونشر الصحيفة ، إذا فَتحها ليقرأها . ومنه الحديث : « فنشروا التوراة » .وأما الإِنشار بالهمز فهو خاص بإخراج الميت من الأرض حيّاً وهو البعث ، فيجوز أن يقال : نُشِر الميت ، والعَرب لم يكونوا يعتقدون إحياء الأموات إلا أن يكونوا قد قالوه في تخيلاتهم التوهمية . فيكون منه قول الأعشى: ... حتى يقول الناس ممّا رأوايا عَجَباً للْمَيِّتتِ النَّاشِر ... ولذلك قال الله تعالى : { ولئن قلت إنكم مبعوثون من بعد الموت ليقولن الذين كفروا إن هذا إلا سحر مبين } [ هود : 7 ] .وفي قوله : { إذا شاء } ردّ لشبهتهم إذ كانوا يطلبون تعجيل البعث تحدياً وتهكماً ليجعلوا عدم الاستجابة بتعجيله دليلاً على أنه لا يكون ، فأعلمهم الله أنه يقع عندما يشاء الله وقوعه لا في الوقت الذي يسألونه لأنه موكول إلى حكمة الله ، واستفادة إبطال قولهم من طريق الكناية .\n","ar.waseet":"( ثُمَّ إِذَا شَآءَ أَنشَرَهُ ) أى : ثم بعد أن خلق الله خلق الله هذا الخلق البديع ، وهداه النجدين ، وأمر بستر جسده فى القبر بعد موته . . بعد كل ذلك إذا شاء أحياه بعد الموت ، للحساب والجزاء . يقال : أنشر الله - تعالى - الموتى ونشرهم ، إذا بعثهم من قبورهم .وقال - سبحانه - ( إِذَا شَآءَ ) للإِشعار بأن هذا البعث إنما هو بإرادته ومشيئته ، وفى الوقت الذى يختاره ويريده ، مهما تعجله المتعجلون .\n","ar.baghawi":"\"ثم إذا شاء أنشره\"، أحياه بعد موته.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5780.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5780.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5780.mp3","format":"mp3","local_path":null}}},{"verse":23,"arabic":"كَلَّا لَمَّا يَقْضِ مَا أَمَرَهُ","transliteration":"Kalla lamma yaqdi maa amarah.","translations":{"en.ahmedali":"But no. He has not fulfilled what was enjoined on him.","en.ahmedraza":"Not one – he has not yet completed what he was commanded.","en.arberry":"No indeed! Man has not accomplished His bidding.","en.asad":"Nay, but [man] has never yet fulfilled what He has enjoined upon him!","en.daryabadi":"By no means He performed not that which He had commanded him.","en.hilali":"Nay, but (man) has not done what He commanded him.","en.pickthall":"Nay, but (man) hath not done what He commanded him.","en.qaribullah":"Indeed, he has not fulfilled that which He has ordered him.","en.sahih":"No! Man has not yet accomplished what He commanded him.","en.sarwar":"Certainly, he has not duly fulfilled His commands.","en.yusufali":"By no means hath he fulfilled what Allah hath commanded him.","en.maududi":"Nay, but man did not fulfil what Allah had enjoined upon him.","en.shakir":"Nay; but he has not done what He bade him.","en.itani":"But no, he did not fulfill what He has commanded him.","en.mubarakpuri":"Nay, but has not done what He commanded him.","en.qarai":"No indeed! He has not yet carried out what He has commanded him.","en.wahiduddin":"Yet man declines to do His bidding."},"tafsir":{"ar.muyassar":"لُعِنَ الإنسان الكافر وعُذِّب، ما أشدَّ كفره بربه!! ألم ير مِن أيِّ شيء خلقه الله أول مرة؟ خلقه الله من ماء قليل- وهو المَنِيُّ- فقدَّره أطوارا، ثم بين له طريق الخير والشر، ثم أماته فجعل له مكانًا يُقبر فيه، ثم إذا شاء سبحانه أحياه، وبعثه بعد موته للحساب والجزاء. ليس الأمر كما يقول الكافر ويفعل، فلم يُؤَدِّ ما أمره الله به من الإيمان والعمل بطاعته.","ar.jalalayn":"«كلا» حقا «لمَّا يقض» لم يفعل «ما أمره» به ربه.","ar.qurtubi":"قوله تعالى : كلا لما يقض ما أمره قال مجاهد وقتادة : لما يقض : لا يقضي أحد ما أمر به . وكان ابن عباس يقول : لما يقض ما أمره لم يف بالميثاق الذي أخذ عليه في صلب آدم . ثم قيل : ( كلا ) ردع وزجر ، أي ليس الأمر : كما يقول الكافر ; فإن الكافر إذا أخبر بالنشور قال : ولئن رجعت إلى ربي إن لي عنده للحسنى ربما يقول قد قضيت ما أمرت به . فقال : كلا لم يقض شيئا بل هو كافر بي وبرسولي . وقال الحسن : أي حقا لم يقض : أي لم يعمل بما أمر به . و ( ما ) في قوله : ( لما ) عماد للكلام ; كقوله تعالى : فبما رحمة من الله وقوله : عما قليل ليصبحن نادمين . وقال الإمام ابن فورك : أي : كلا لما يقض الله لهذا الكافر ما أمره به من الإيمان ، بل أمره بما لم يقض له . ابن الأنباري : الوقف على كلا قبيح ، والوقف على ( أمره ) و ( نشره ) جيد ; ف \" كلا \" على هذا بمعنى حقا .\n","ar.miqbas":"كَلَّا لَمَّا يَقْضِ مَا أَمَرَهُ (23)تفسير هذه الآية معضل وكلمات المفسرين والمتأوِلين فيها بعضها جَافَّ المَنال ، وبعضها جاففٍ عن الاستعمال . ذلك أن المعروف في { كلاَّ } أنه حرف ردع وزجر عن كلام سابق أو لاحق ، وليس فيما تضمنه ما سبقها ولا فيما بعدها ما ظاهره أن يُزجر عنه ولا أن يُبطل ، فتعين المصير إلى تأويل مورد { كَلاَّ } .فأما الذين التزموا أن يكون حرف { كَلاَّ } للردع والزجر وهم الخليل وسيبويه وجمهور نحاة البصرة ويجيزون الوقف عليها كما يجيزون الابتداء بها ، فقد تأولوا هذه الآية وما أشبهها بتوجيه الإِنكار إلى ما يُومىء إليه الكلام السابق أو اللاحق دون صريحه ولا مضمونه .فمنهم من يجعل الردع متوجهاً إلى ما قبل { كَلاَّ } ممّا يومىء إليه قوله تعالى : { ثم إذا شاء أنشره } [ عبس : 22 ] ، أي إذا شاء الله ، إذ يومىء إلى أن الكافر ينكر أن ينشره الله ويعتلَّ بأنه لم ينشر أحداً منذ القدم إلى الآن . وهذا الوجه هو الجاري على قول البصريين كما تقدم .وموقع { كَلاَّ } على هذا التأويل موقع الجواب بالإِبطال ، وموقع جملة : { لما يقض ما أمره } موقع العلة للإِبطال ، أي لو قَضَى ما أمره الله به لعِلم بطلان زعمه أنه لا ينشر .وتأوله في «الكشاف» بأنه : «ردْع للإِنسان عما هو عليه» أي مِمَّا ذكر قبله من شدة كفره واسترساله عليه دون إقلاع ، يريد أنه زجر عن مضمون : { ما أكفره } [ عبس : 17 ] .ومنهم من يجعل الردع متوجهاً إلى ما بعد { كلاّ } مما يومىء إليه قوله تعالى : { لما يقض ما أمره } أي ليس الأمر كما يقول هذا الإِنسان الكافر من أنه قد أدى حق الله الذي نبهه إليه بدعوة الرسل وبإيداع قوة التفكير فيه ، ويُتسروح هذا من كلام روي عن مجاهد ، وهو أقرب لأن ما بعد { كَلاَّ } لما كان نفياً ناسب أن يُجعل { كلاّ } تمهيداً للنفي .وموقع { كلاّ } على هذا الوجه أنها جزء من استئناف .وموقع جملة : { لما يقض ما أمره } استئناف بياني نشأ عن مضمون جملة : { من أي شيء خلقه إلى قوله : أنشره } [ عبس : 18 22 ] ، أي إنما لم يَهتد الكافرُ إلى دلالة الخلق الأول على إمكاننِ الخلق الثاني ، لأنه لم يقض حق النظر الذي أمره الله .وأما الذين لم يلتزموا معنى الزجر في { كلاّ } وهم الكسائي القائل : تكون { كلاّ } بمعنى حقاً ، ووافقه ثعلب وأبو حاتم السجستاني القائل : تكون { كلا } بمعنى ( ألاّ ) الاستفتاحية .والنضر بن شميل والفرّاء القائلان : تكون { كلاّ } حَرفَ جواب بمعنى نعم . فهؤلاء تأويل الكلام على رأيهم ظاهر .وعن الفراء { كلاّ } تكون صلة ( أي حرفاً زائداً للتأكيد ) كقولك : كلاَّ ورب الكعبة ا ه . وهذا وجه إليه ولا يتأتى في هذه الآية .فالوجه في موقع { كلاّ } هنا أنه يجوز أن تكون زجراً عما يفهم من قوله :{ ثم إذا شاء أنشره } [ عبس : 22 ] المكنى به عن فساد استدلالهم بتأخيره على أنه لا يقع فيكون الكلام على هذا تأكيداً للإِبطال الذي في قوله : { كلا إنها تذكرة } [ عبس : 11 ] باعتبار معناه الكنائي إن كان صريح معناه غيرَ باطل فقوله : { إذا شاء } مؤذن بأنه الآن لم يشأ وذلك مؤذن بإبطال أن يقع البعث عندما يسألون وقوعه ، أي أنا لا نشاء إنشارهم الآن وإنما ننشرهم عندما نشاء ممّا قدرنا أجله عند خلق العالم الأرضي .وتكون جملة : { لما يقض ما أمره } تعليلاً للردع ، أي الإنسان لم يستتم ما أجل الله لبقاء نوعه في هذا العالم من يوم تكوينه فلذلك لا ينشر الآن ، ويكون المراد بالأمر في قوله : { ما أمره } أمر التكوين ، أي لم يستتم ما صدر به أمر تكوينه حين قيل لآدم : { ولكم في الأرض مستقر ومتاع إلى حين } [ البقرة : 36 ] .ويجوز أن يكون زجراً عما أفاده قوله : { لما يقض ما أمره } وقدمت { كلاّ } في صدر الكلام الواردة لإبطاله للاهتمام بمبادرة الزجر .وتقدم الكلام في { كلاّ } في سورة مريم وأحَلْتُ هنالك على ما هنا .و { لَمَّا } حرف نفي يدل على نفي الفعل في الماضي مثل ( لَمْ ) ويزيد بالدلالة على استمرار النفي إلى وقت التكلم كقوله تعالى : { ولما يدخل الإيمان في قلوبكم } [ الحجرات : 14 ] .والمقصود أنه مستمر على عدم قضاء ما أمره الله مِما دعاه إليه .والقضاء : فعل ما يجب على الإنسان كاملاً لأن أصل القضاء مشتق من الإتمام فتضمن فعلاً تاماً ، أي لم يزل الإنسان الكافر معرضاً عن الإيمان الذي أمره الله به ، وعن النظر في خلقه من نطفة ثم تطوره أطواراً إلى الموت قال تعالى : { فلينظر الإنسان مما خلق } [ الطارق : 5 ] ، وما أمره من التدَبر في القرآن ودلائله ومن إعمال عقله في الاستدلال على وحدانية الله تعالى ونفي الشريك عنه . ومن الدلائل نظره في كيفية خلقه فإنها دلائل قائمة بذاته فاستحق الردع والزجر .والضمير المستتر في { أمره } عائد إلى ما عادت إليه الضمائر المستترة في ( خلقه ، وقدره ، ويسره ، وأماته ، وأقبره ، وأنشره ) .\n","ar.waseet":"ثم زجر - سبحانه - هذا الإِنسان زجرا شديدا لتقصيره فى أداء حق خالقه ، فقال - تعالى - : ( كَلاَّ لَمَّا يَقْضِ مَآ أَمَرَهُ ) أى : كلا ن هذا الإِنسان الجاحد المغرور . . لم يقض ولم يؤد ما أمره الله - تعالى - به من تكاليف ومن شكر لخالقه ، ومن تأمل فى آياته ، ومن طاعة لرسله . . بل استمر فى طغيانه وعناده .فالمقصود بهذه الآية الكريمة : ردع هذا الإِنسان الجاحد وزجره ، وبيان أن هذا الردع سببه إهماله لحقوق خالقه ، وعدم اهتماه بأدائها .\n","ar.baghawi":"\"كلا\"، رداً عليه، أي: ليس كما يقول ويظن هذا الكافر، وقال الحسن: حقاً. \"لما يقض ما أمره\"، أي لم يفعل ما أمره الله به ولم يؤد ما فرض عليه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5781.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5781.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5781.mp3","format":"mp3","local_path":null}}},{"verse":24,"arabic":"فَلْيَنْظُرِ الْإِنْسَانُ إِلَىٰ طَعَامِهِ","transliteration":"Falyanzuril insanu ilaa ta-amih","translations":{"en.ahmedali":"Let man therefore consider (the sources of) his food.","en.ahmedraza":"So man must look at his food.","en.arberry":"Let Man consider his nourishment.","en.asad":"Let man, then, consider [the sources of] his food:","en.daryabadi":"Let man look at his food:","en.hilali":"Then let man look at his food,","en.pickthall":"Let man consider his food:","en.qaribullah":"Let the human reflect on the food he eats,","en.sahih":"Then let mankind look at his food -","en.sarwar":"Let the human being think about (how We produce) his food.","en.yusufali":"Then let man look at his food, (and how We provide it):","en.maududi":"So let man just consider his food:","en.shakir":"Then let man look to his food,","en.itani":"Let man consider his food.","en.mubarakpuri":"Then let man look at his food:","en.qarai":"Let man consider his food:","en.wahiduddin":"Let man reflect on the food he eats."},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«فلينظر الإنسان» نظر اعتبار «إلى طعامه» كيف قدر ودبر له.","ar.qurtubi":"قوله تعالى : فلينظر الإنسان إلى طعامه لما ذكر - جل ثناؤه - ابتداء خلق الإنسان ، ذكر ما يسر من رزقه ; أي فلينظر كيف خلق الله طعامه . وهذا النظر نظر القلب بالفكر ; أي ليتدبر كيف خلق الله طعامه الذي هو قوام حياته ، وكيف هيأ له أسباب المعاش ، ليستعد بها للمعاد . وروي عن الحسن ومجاهد قالا : فلينظر الإنسان إلى طعامه أي إلى مدخله ومخرجه . وروى ابن أبي خيثمة عن الضحاك بن سفيان الكلابي قال : قال لي النبي - صلى الله عليه وسلم - : \" يا ضحاك ما طعامك \" قلت : يا رسول الله ! اللحم واللبن ; قال : \" ثم يصير إلى ماذا \" قلت إلى ما قد علمته ; [ ص: 190 ] قال : \" فإن الله ضرب ما يخرج من ابن آدم مثلا للدنيا \" . وقال أبي بن كعب : قال النبي - صلى الله عليه وسلم - : \" إن مطعم ابن آدم جعل مثلا للدنيا وإن قزحه وملحه فانظر إلى ما يصير \" . وقال أبو الوليد : سألت ابن عمر عن الرجل يدخل الخلاء فينظر ما يخرج منه ; قال : يأتيه الملك فيقول انظر ما بخلت به إلى ما صار ؟\n","ar.miqbas":"فَلْيَنْظُرِ الْإِنْسَانُ إِلَى طَعَامِهِ (24). إما مفرع على قوله : { لما يقض ما أمره } [ عبس : 23 ] فيكون مما أمره الله به من النظر ، وإما على قوله : { ما أكفره } [ عبس : 17 ] فيكون هذا النظر مما يبطل ويزيل شدة كفر الإنسان . والفاء مع كونها للتفريع تفيد معنى الفصيحة ، إذ التقدير : إن أراد أن يقضي ما أمره فلينظر إلى طعامه أو إن أراد نقض كفره فلينظر إلى طعامه . وهذا نظير الفاء في قوله تعالى : { إن كل نفس لما عليها حافظ فلينظر الإنسان مم خلق } [ الطارق : 4 ، 5 ] ، أي إن أراد الإنسان الخلاص من تبعات ما يكتبه عليه الحافظ فلينظر مِمَّ خُلق ليهتدي بالنظر فيؤمن فينجو .وهذا استدلال آخر على تقريب كيفية البعث انتقل إليه في معرض الإرشاد إلى تدارك الإِنسان ما أهملَه وكان الانتقال من الاستدلال بما في خَلْق الإنسان من بديع الصنع من دلائل قائمة بنفسه في آية : { من أي شيء خلقه } [ عبس : 18 ] إلى الاستدلال بأحوال موجودة في بعض الكائنات شديدة الملازمة لحياة الإنسان ترسيخاً للاستدلال ، وتفنناً فيه ، وتعريضاً بالمنة على الإِنسان في هذه الدلائل ، من نعمة النبات الذي به بقاء حياة الإنسان وحياة ما ينفعه من الأنعام .وتعدية فعل النظر هنا بحرف { إلى } تدل على أنه من نظر العين إشارة إلى أن العبرة تحصل بمجرد النظر في أطواره . والمقصود التدبر فيما يشاهده الإنسان من أحوال طعامه بالاستدلال بها على إيجاد الموجودات من الأرض . وجُعل المنظور إليه ذاتَ الطعام مع أن المراد النظر إلى أسباب تكونه وأحوال تطوره إلى حالة انتفاع الإنسان به وانتفاع أنعام الناس به .وذلك من أسلوب إناطة الأحكام بأسماء الذوات ، والمراد أحوالها مثل قوله تعالى : { حرمت عليكم الميتة } [ المائدة : 3 ] أي أكلها ، فأمر الله الإنسان بالتفكير في أطوار تكوّن الحبوب والثمار التي بها طعامه ، وقد وُصف له تطور ذلك ليَتَأمل ما أودع إليه في ذلك من بديع التكوين سواء رأى ذلك ببصره أم لم يَره ، ولا يخلو أحد عن علممٍ إجمالي بذلك ، فيزيده هذا الوصف علماً تفصيلياً ، وفي جميع تلك الأطوار تمثيل لإحياء الأجساد المستقرة في الأرض ، فقد يكون هذا التمثيل في مجرد الهيئة الحاصلة بإحياء الأجساد ، وقد يكون تمثيلاً في جميع تلك الأطوار بأن تُخرج الأجساد من الأرض كخروج النبات بأن يكون بَذرها في الأرض ويُرسل الله لها قُوى لا نعلمها تُشابه قوة الماء الذي به تحيا بذور النبات ، قال تعالى : { والله أنبتكم من الأرض نباتاً ثم يعيدكم فيها ويخرجكم إخراجاً } [ نوح : 17 ، 18 ] .وفي «تفسير ابن كثير» عند قوله تعالى : { وإذا النفوس زوجت } [ التكوير : 7 ] عن ابن ( أبي ) حاتم بسنده إلى ابن عباس : «يسيل واد من أصل العرش فيما بين الصيحتين فينبت منه كلُّ خلق بَلِي إنساننٍ أو دابة ولو مرّ عليهم مارٌّ قد عرفهم قبل ذلك لعرفهم قد نبتوا على وجه الأرض ، ثم ترسل الأرواح فتزوج الأجساد» ا ه .وأمور الآخرة لا تتصورها الأفهام بالكُنْه وإنما يجزم العقل بأنها من الممكنات وهي مطيعة لتعلق القدرة التنجيزي .والإِنسان المذكور هنا هو الإِنسان المذكور في قوله : { قتل الإنسان ما أكفره } [ عبس : 17 ] وإنما جيء باسمه الظاهر دون الضمير كما في قوله : { من أي شيء خلقه } [ عبس : 18 ] ، لأن ذلك قريب من معاده وما هنا ابتداءُ كلام فعبر فيه بالاسم الظاهر للإِيضاح .وأدمج في ذلك منة عليه بالإمداد بالغذاء الذي به إخلاف ما يضمحل من قوته بسبب جهود العقل والتفكير الطبيعية التي لا يشعر بحصولها في داخل المزاج ، وَبِسبب كد الأعمال البدنية والإِفرازات ، وتلك أسباب لتبخر القوى البدنية فيحتاج المزاج إلى تعويضها وإخلافها وذلك بالطعام والشراب .وإنما تعلق النظر بالطعام مع أن الاستدلال هو بأحوال تكوين الطعام ، إجراءً للكلام على الإِيجاز ويبينه ما في الجمل بعده من قوله : { إنا صببنا الماء صباً } إلى آخرها .فالتقدير : فلينظر الإِنسان إلى خَلق طعامه وتهيئة الماء لإنمائه وشق الأرض وإنباته وإلى انتفاعه به وانتفاع مواشيه في بقاء حياتهم .\n","ar.waseet":"ثم ساقت الآيات بعد ذلك ألوانا من نعمه - تعالى - على خلقه فقال : ( فَلْيَنظُرِ الإنسان إلى طَعَامِهِ ) والفاء هنا للتفريع على ما تقدم ، مع إفادتها معنى الفصيحة .أى : إذا أراد أن يقى ويؤدى ما أمره الله - تعالى - من تكاليف ، فلينظر هذا الإِنسان إلى طعامه ، وكيف أوجده - سبحانه - له ورزقه إياه ، ومكنه منه . فإن فى هذا النظر والتدبر والتفكر ، ما يعينه على طاعة خالقه ، وإخلاص العبادة له .\n","ar.baghawi":"ولما ذكر خلق ابن آدم ذكر رزقه ليعتبر فقال: \"فلينظر الإنسان إلى طعامه\"، كيف قدره ربه ودبره له وجعله سبباً لحياته. وقال مجاهد: إلى مدخله ومخرجه.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5782.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5782.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5782.mp3","format":"mp3","local_path":null}}},{"verse":25,"arabic":"أَنَّا صَبَبْنَا الْمَاءَ صَبًّا","transliteration":"Anna sabab nalmaa-a sabba.","translations":{"en.ahmedali":"We poured down rain abundantly,","en.ahmedraza":"That We watered it in abundance.","en.arberry":"We poured out the rains abundantly,","en.asad":"[how it is] that We pour down water, pouring it down abundantly;","en.daryabadi":"It is We Who pour forth water, pouring,","en.hilali":"That We pour forth water in abundance,","en.pickthall":"How We pour water in showers","en.qaribullah":"how We pour down rain in abundance,","en.sahih":"How We poured down water in torrents,","en.sarwar":"We send down abundant water,","en.yusufali":"For that We pour forth water in abundance,","en.maududi":"We poured water, pouring it in great abundance,","en.shakir":"That We pour down the water, pouring (it) down in abundance,","en.itani":"We pour down water in abundance.","en.mubarakpuri":"We pour forth water in abundance.","en.qarai":"We pour down plenteous water [from the sky],","en.wahiduddin":"We let the rain pour down in torrents"},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«أنا صببنا الماء» من السحاب «صبا».","ar.qurtubi":"قوله تعالى : أنا صببنا الماء صبا قراءة العامة ( إنا ) بالكسر ، على الاستئناف ، وقرأ الكوفيون ورويس عن يعقوب أنا بفتح الهمزة ، ف \" أنا \" في موضع خفض على الترجمة عن الطعام ، فهو بدل منه ; كأنه قال : فلينظر الإنسان إلى طعامه إلى أنا صببنا فلا يحسن الوقف على طعامه من هذه القراءة . وكذلك إن رفعت أنا بإضمار هو أنا صببنا ; لأنها في حال رفعها مترجمة عن الطعام . وقيل : المعنى : لأنا صببنا الماء ، فأخرجنا به الطعام ، أي كذلك كان . وقرأ الحسين بن علي ( أنى ) فقال ، بمعنى كيف ؟ فمن أخذ بهذه القراءة قال : الوقف على طعامه تام . ويقال : معنى ( أنى ) أين ، إلا أن فيها كناية عن الوجوه ; وتأويلها : من أي وجه صببنا الماء ; قال الكميت :أنى ومن أين آبك الطرب من حيث لا صبوة ولا ريبصببنا الماء صبا : يعني الغيث والأمطار .\n","ar.miqbas":"أَنَّا صَبَبْنَا الْمَاءَ صَبًّا (25) وقرأ الجمهور : { إنا صببنا } بكسر همزة ( إنَّا ) على أن الجملة بيان لجملة : { فلينظر الإنسان إلى طعامه } لتفصيل ما أجمل هنالك على وجه الإيجاز . وقرأه عاصم وحمزة والكسائي وخلف ورويس عن يعقوب بفتح الهمزة على أنه اسم بدلُ اشتمال من { طعامه } أو البدلُ الذي يسميه بعض النحويين بدل مفصَّل من مجمل .والصَّب : إلقاء صبرة متجمعة من أجزاء مائعة أو كالمائعة في الدقة في وعاء غير الذي كانت فيه ، يقال : صَب الماء في الجَرة ، وصب القَمح في الهَرِي ، وصَبَّ الدراهم في الكِيس . وأصله : صبّ الماء ، مثل نزول المطر وإفراغ الدلو .\n","ar.waseet":"ثم بين - سبحانه - مظاهر تهيئة هذا الطعام للإِنسان . . فقال : ( أَنَّا صَبَبْنَا المآء صَبّا ) .قال الجمل : قرأ الكوفيون ( أنا ) بالفتح . على البدل من طعامه ، فيكون فى محل جر بدل اشتمال ، بمعنى أن صب الماء سبب فى إخراج الطعام فهو مشتمل عليه .وقرأ غيرهم بكسر الهمزة على الاستئناف المبين لكيفية إحداث الطعام . .والصب : إنزال الماء بقوة وكثرة . أى : إنا أنزلنا المطر من السماء إنزالا مصحوبا بالقوة والكثرة ، لحاجتكم الشديدة إليه فى حياتكم .\n","ar.baghawi":"ثم بين فقال: \"أنا\" قرأ أهل الكوفة: \"أنا\" بالفتح على تكرير الخافض، مجازه: فلينظر إلى أنا وقرأ الآخرون بالكسر على الاستئناف. \"صببنا الماء صباً\"، يعني المطر.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5783.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5783.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5783.mp3","format":"mp3","local_path":null}}},{"verse":26,"arabic":"ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا","transliteration":"Thumma sha qaqnal-arda shaqqa.","translations":{"en.ahmedali":"Then We cracked the earth open under pressure (of germination)","en.ahmedraza":"Then We split the earth properly.","en.arberry":"then We split the earth in fissures","en.asad":"and then We cleave the earth [with new growth], cleaving it asunder,","en.daryabadi":"Thereafter We cleave the earth in clefts,","en.hilali":"And We split the earth in clefts,","en.pickthall":"Then split the earth in clefts","en.qaribullah":"and split the earth, splitting,","en.sahih":"Then We broke open the earth, splitting [it with sprouts],","en.sarwar":"and let the earth to break open","en.yusufali":"And We split the earth in fragments,","en.maududi":"and cleaved the earth, cleaving it asunder;","en.shakir":"Then We cleave the earth, cleaving (it) asunder,","en.itani":"Then crack the soil open.","en.mubarakpuri":"And We split the earth in clefts.","en.qarai":"then We split the earth making fissures in it","en.wahiduddin":"and then We cleaved the earth asunder."},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«ثم شققنا الأرض» بالنبات «شقا».","ar.qurtubi":"أي بالنبات\n","ar.miqbas":"ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا (26) والشق : الإِبعاد بين ما كان متصلاً . والمراد هنا شقّ سطح الأرض بخرق الماء فيه أو بآلة كالمحراث والمسحاة ، أو بقوة حرّ الشمس في زمن الصيف لتتهيأ لقبول الأمطار في فصل الخريف والشتاء .وإسناد الصّب والشق والإِنبات إلى ضمير الجلالة لأن الله مقدِّر نظام الأسباب المؤثرة في ذلك ، ومُحْكِمُ نواميسها ومُلهمُ الناس استعمالها .فالإسناد مجاز عقلي في الأفعال الثلاثة . وقد شاع في { صببنا } و { أنبتنا } حتى ساوَى الحقيقة العقلية .وانتصب { صبّاً } و { شقاً } على المفعول المطلق ل { صببنا } و { شققنا } مؤكّداً لعامله ليتأتى تنوينه لما في التنكير من الدلالة على التعظيم وتعظيم كل شيء بما يناسبه وهو تعظيم تعجيب .\n","ar.waseet":"( ثُمَّ شَقَقْنَا الأرض شَقّاً ) أى : ثم شققنا الأرض بالنبات شقا بديعا حكيما ، بحيث تخرج النباتات من باطنها خروجها يبهج النفوس ، وتقر به العيون .\n","ar.baghawi":"\"ثم شققنا الأرض شقاً\"، بالنبات.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5784.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5784.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5784.mp3","format":"mp3","local_path":null}}},{"verse":27,"arabic":"فَأَنْبَتْنَا فِيهَا حَبًّا","transliteration":"Fa ambatna feeha habba","translations":{"en.ahmedali":"And We made corn grow,","en.ahmedraza":"Thereby produced grain in it.","en.arberry":"and therein made the grains to grow","en.asad":"and thereupon We cause grain to grow out of it,","en.daryabadi":"Then We cause therein the grain to grow,","en.hilali":"And We cause therein the grain to grow,","en.pickthall":"And cause the grain to grow therein","en.qaribullah":"how We made the grain to grow,","en.sahih":"And caused to grow within it grain","en.sarwar":"to yield therein corn,","en.yusufali":"And produce therein corn,","en.maududi":"then caused the grain to grow out of it,","en.shakir":"Then We cause to grow therein the grain,","en.itani":"And grow in it grains.","en.mubarakpuri":"And We cause therein Habb to grow,","en.qarai":"and make the grain grow in it,","en.wahiduddin":"We make the grain grow out of it,"},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«فأنبتنا فيها حبا» كالحنطة والشعير.","ar.qurtubi":"أي قمحا وشعيرا وسلتا وسائر ما يحصد ويدخر\n","ar.miqbas":"فَأَنْبَتْنَا فِيهَا حَبًّا (27) والفاء في قوله : { فأنبتنا } للتفريع والتعقيب وهو في كل شيء بحسبه .والحَب أريد منه المقتات منه للإِنسان ، وقد تقدم في قوله تعالى : { كمثل حبة أنبتت سبع سنابل } في سورة البقرة ( 261 ) .\n","ar.waseet":"( فَأَنبَتْنَا فِيهَا حَبّاً ) أى : فأنبتنا فى الأرض حبا كثيرا ، تقتاتون منه ، وتدخرونه لحين حاجتكم إليه ، والحب : يشمل الحنطة والشعير والذرة .\n","ar.baghawi":"\"فأنبتنا فيها حباً\"، يعني الحبوب التي يتغذى بها.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5785.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5785.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5785.mp3","format":"mp3","local_path":null}}},{"verse":28,"arabic":"وَعِنَبًا وَقَضْبًا","transliteration":"Wa 'inabaw-wa qadba","translations":{"en.ahmedali":"And grapes and herbage,","en.ahmedraza":"And grapes and fodder,","en.arberry":"and vines, and reeds,","en.asad":"and vines and edible plants,","en.daryabadi":"And grapes and vegetables","en.hilali":"And grapes and clover plants (i.e. green fodder for the cattle),","en.pickthall":"And grapes and green fodder","en.qaribullah":"grapes, and fresh fodder,","en.sahih":"And grapes and herbage","en.sarwar":"grapes, vegetables,","en.yusufali":"And Grapes and nutritious plants,","en.maududi":"together with grapes and vegetables,","en.shakir":"And grapes and clover,","en.itani":"And grapes and herbs.","en.mubarakpuri":"And grapes and Qadb,","en.qarai":"as well as vines and vegetables,","en.wahiduddin":"and grape vines and vegetables,"},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«وعنبا وقضبا» هو القت الرطب.","ar.qurtubi":"وعنبا وقضبا وهو القت والعلف ، عن الحسن : سمي بذلك ; لأنه يقضب أي يقطع بعد ظهوره مرة بعد مرة . قال القتبي وثعلب : وأهل مكة يسمون القت القضب . وقال ابن عباس : هو الرطب لأنه يقضب من النخل : ولأنه ذكر العنب قبله . وعنه أيضا : أنه الفصفصة وهو القت الرطب . وقال الخليل : القضب الفصفصة الرطبة . وقيل : بالسين ، فإذا يبست فهو قت . قال : والقضب : اسم يقع على ما يقضب من أغصان الشجرة ، ليتخذ منها سهام أو قسي . ويقال : قضبا ، يعني جميع ما يقضب ، مثل القت والكراث وسائر البقول التي تقطع فينبت أصلها . وفي الصحاح : والقضبة والقضب الرطبة ، وهي الإسفست بالفارسية ، والموضع الذي ينبت فيه مقضبة .\n","ar.miqbas":"وَعِنَبًا وَقَضْبًا (28) والعِنب : ثمر الكَرم ، ويتخذ منه الخمر والخل ، ويؤكل رَطباً ، ويتخذ منه الزبيب .والقضبُ : الفِصْفصة الرطبة ، سميت قضباً لأنها تعلف للدواب رطبة فتقضب ، أي تقطع مرة بعد أخرى ولا تزال تُخلف ما دام الماء ينزل عليها ، وتسمى القَت .\n","ar.waseet":"( وَعِنَباً وَقَضْباً . وَزَيْتُوناً وَنَخْلاً . وَحَدَآئِقَ غُلْباً . وَفَاكِهَةً وَأَبّاً ) أى : وأنبتنا فى الأرض - أيضا - بقدرتنا ورحمتنا ( عنبا ) وهو ثمر الكرم المعروف بلذة طعمه .( وقضبا ) وهو كل ما يؤكل من النبات رطبا ، كالقثاء والخيار ونحوهما ، وقيل : هو العلف والرطب الذى تأكله والدواب ، وسمى قضبا ، لأنه يقضب - أى يقطع - بعد ظهوره مرة بعد أخرى .\n","ar.baghawi":"\"وعنباً وقضباً\"، وهو القت الرطب، سمي بذلك لأنه يقضب في كل الأيام يقطع. وقال الحسن: القضب: العلف للدواب.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5786.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5786.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5786.mp3","format":"mp3","local_path":null}}},{"verse":29,"arabic":"وَزَيْتُونًا وَنَخْلًا","transliteration":"Wa zaitoonaw wanakh la'","translations":{"en.ahmedali":"Olives and dates,","en.ahmedraza":"And olives and date palms,","en.arberry":"and olives, and palms,","en.asad":"and olive trees and date-palms,","en.daryabadi":"And olives and palms","en.hilali":"And olives and date-palms,","en.pickthall":"And olive-trees and palm-trees","en.qaribullah":"and the olive, and the palm,","en.sahih":"And olive and palm trees","en.sarwar":"olives, dates,","en.yusufali":"And Olives and Dates,","en.maududi":"and olives and palms,","en.shakir":"And the olive and the palm,","en.itani":"And olives and dates.","en.mubarakpuri":"And olives and date palms,","en.qarai":"olives and date palms,","en.wahiduddin":"and olive trees and date palms"},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«وزيتونا ونخلا».","ar.qurtubi":"\" وزيتونا \" وهي شجرة الزيتون \" ونخلا \" يعني النخيل\n","ar.miqbas":"وَزَيْتُونًا وَنَخْلًا (29) والزيتون : الثمر الذي يعصر منه الزيت المعروف .والنخل : الشجر الذي ثمرته التمر وأطوارهُ .\n","ar.waseet":"وأنبتنا فيها كذلك ( وَزَيْتُوناً وَنَخْلاً ) وهما شجرتان معروفتان بمنافعهما الجمة ، وبثمارهما المفيدة .\n","ar.baghawi":"\"وزيتوناً\"، وهو ما يعصر منه الزيت، \"ونخلاً\"، جمع نخلة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5787.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5787.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5787.mp3","format":"mp3","local_path":null}}},{"verse":30,"arabic":"وَحَدَائِقَ غُلْبًا","transliteration":"Wa hadaa-iqa ghulba","translations":{"en.ahmedali":"Orchards thick with trees,","en.ahmedraza":"And dense gardens,","en.arberry":"and dense-tree'd gardens,","en.asad":"and gardens dense with foliage,","en.daryabadi":"And enclosed gardens luxuriant.","en.hilali":"And gardens, dense with many trees,","en.pickthall":"And garden-closes of thick foliage","en.qaribullah":"the densely tree'd gardens,","en.sahih":"And gardens of dense shrubbery","en.sarwar":"thickly planted gardens,","en.yusufali":"And enclosed Gardens, dense with lofty trees,","en.maududi":"and dense orchards,","en.shakir":"And thick gardens,","en.itani":"And luscious gardens.","en.mubarakpuri":"And Ghulb Hada'iq,","en.qarai":"and densely-planted gardens,","en.wahiduddin":"and burgeoning enclosed gardens"},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«وحدائق غلبا» بساتين كثيرة الأشجار.","ar.qurtubi":"وحدائق أي بساتين واحدها حديقة . قال [ ص: 191 ] الكلبي : وكل شيء أحيط عليه من نخيل أو شجر فهو حديقة ، وما لم يحط عليه فليس بحديقة . غلبا عظاما شجرها ; يقال : شجرة غلباء ، ويقال للأسد : الأغلب ; لأنه مصمت العنق ، لا يلتفت إلا جميعا ; قال العجاج :ما زلت يوم البين ألوي صلبي     والرأس حتى صرت مثل الأغلبورجل أغلب بين الغلب إذا كان غليظ الرقبة . والأصل في الوصف بالغلب : الرقاب فاستعير ; قال عمرو بن معدي كرب :يمشي بها غلب الرقاب كأنهم     بزل كسين من الكحيل جلالاوحديقة غلباء : ملتفة ، وحدائق غلب . واغلولب العشب : بلغ والتف البعض بالبعض . قال ابن عباس : الغلب : جمع أغلب وغلباء وهي الغلاظ . وعنه أيضا الطوال . قتادة وابن زيد : الغلب : النخل الكرام . وعن ابن زيد أيضا وعكرمة : عظام الأوساط والجذوع . مجاهد : ملتفة .\n","ar.miqbas":"وَحَدَائِقَ غُلْبًا (30) والحدائق : جمع حديقة وهي الجنة من نخل وكَرم وشجرِ فواكهَ ، وعطفُها على النخل من عطف الأعم على الأخص ، ولأن في ذكر الحدائق إدماجاً للامتنان بها لأنها مواضع تنزههم واخترافهم .وإنما ذكر النخل دون ثمرته ، وهو التمر ، خلافاً لما قُرن به من الثمار والفواكهِ والكلأ ، لأن منافع شجر النخيل كثيرة لا تقتصر على ثمره ، فهم يقتاتون ثمرته من تمر ورُطب وبُسر ، ويأكلون جُمَّاره ، ويَشربون ماء عود النخلة إذا شُق عنه ، ويتخذون من نَوى التمر علفاً لإبلهم ، وكل ذلك من الطعام ، فضلاً عن اتخاذهم البيوت والأواني من خشبه ، والحُصُر من سَعَفه ، والحبالَ من لِيفه . فذِكْرُ اسم الشجرة الجامعة لهذه المنافع أجمع في الاستدلال بمختلف الأحوال وإدماج الامتنان بوفرة النعم ، وقد تقدم قريباً في سورة النبأ .والغُلْب : جمع غلباء ، وهي مؤنث الأغلب ، وهو غَليظُ الرقبة ، يقال : غلب كفرح ، يوصف به الإنسان والبعير ، وهو هنا مستعار لغلظ أصول الشجر فوصف الحدائق به؛ إما على تشبيه الحديقة في تكاثف أوراق شجرها والتفافها بشخص غليظ الأوداج والأعصاب فتكون استعارة ، وإما على تقدير محذوف ، أي غُلْببٍ شَجَرُها ، فيكون نعتاً سببيّاً وتكون الاستعارة في تشبيه كل شجرة بامرأة غليظة الرقبة ، وذلك من محاسن الحدائق لأنها تكون قد استكملت قوة الأشجار كما في قوله : { وجنات ألفافاً } [ النبأ : 16 ] .وخصت الحدائق بالذكر لأنها مواضع التنزه والاختراف ، ولأنها تجمع أصنافاً من الأشجار .\n","ar.waseet":"( وَحَدَآئِقَ غُلْباً ) والحدائق جمع حديقة وهى البستان الملئ بالزورع والثمار .و ( غلبا ) جمع غلباء . أى : وأنبتنا فى الأرض حدائق عظيمة ، ذات أشجار ضخمة ، قد التف بعضها على بعض لكثرتها وقوتها . فقوله ( غلبا ) بمعنى عظاما ، وأصلها من ( الغَلَب ) - بفتحتين - ، بمعنى الغلظ ، يقال شجرة غلباء ، وهضبة غلباء . أى : عظيمة مرتفعة . ويقال : حديقة غلباء ، إذا كانت عظيمة الشجر . ويقال : رجل أغلب ، إذاكان غليظ الرقبة .وأنبتنا فيها - أيضا - بقدرتنا وفضلنا.\n","ar.baghawi":"\"وحدائق غلباً\"، غلاظ الأشجار، واحدها أغلب، ومنه قيل لغليظ الرقبة: أغلب. وقال مجاهد ومقاتل: الغلب: الملتفة الشجر بعضه في بعض، قال ابن عباس: طوالاً.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5788.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5788.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5788.mp3","format":"mp3","local_path":null}}},{"verse":31,"arabic":"وَفَاكِهَةً وَأَبًّا","transliteration":"Wa faki hataw-wa abba.","translations":{"en.ahmedali":"And fruits and fodder:","en.ahmedraza":"And fruits and grass,","en.arberry":"and fruits, and pastures,","en.asad":"and fruits and herbage,","en.daryabadi":"And fruits and herbage:","en.hilali":"And fruits and Abba (herbage, etc.),","en.pickthall":"And fruits and grasses:","en.qaribullah":"and fruit and pastures,","en.sahih":"And fruit and grass -","en.sarwar":"fruits, and grass.","en.yusufali":"And fruits and fodder,-","en.maududi":"and fruits and pastures –","en.shakir":"And fruits and herbage","en.itani":"And fruits and vegetables.","en.mubarakpuri":"And fruits (Fakihah) and herbage (Abb).","en.qarai":"fruits and pastures,","en.wahiduddin":"and fruits and fodder"},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«وفاكهة وأبّا» ما ترعاه البهائم وقيل التبن.","ar.qurtubi":"( وفاكهة ) أي ما تأكله الناس من ثمار الأشجار كالتين والخوخ وغيرهما ( وأبا ) هو ما تأكله البهائم من العشب ، قال ابن عباس والحسن : الأب : كل ما أنبتت الأرض ، مما لا يأكله الناس ، ما يأكله الآدميون هو الحصيد ; ومنه قول الشاعر في مدح النبي - صلى الله عليه وسلم - :له دعوة ميمونة ريحها الصبا     بها ينبت الله الحصيدة والأباوقيل : إنما سمي أبا ; لأنه يؤب أي يؤم وينتجع . والأب والأم : أخوان ; قال :جذمنا قيس ونجد دارنا     ولنا الأب به والمكرعوقال الضحاك : والأب : كل شيء ينبت على وجه الأرض . وكذا قال أبو رزين : هو النبات . يدل عليه قول ابن عباس قال : الأب : ما تنبت الأرض مما يأكل الناس والأنعام . وعن ابن عباس أيضا وابن أبي طلحة : الأب : الثمار الرطبة . وقال الضحاك : هو التين خاصة . وهو محكي عن ابن عباس أيضا ; قال الشاعر :فما لهم مرتع للسوا     م والأب عندهم يقدرالكلبي : هو كل نبات سوى الفاكهة . وقيل : الفاكهة : رطب الثمار ، والأب يابسها . وقال إبراهيم التيمي : سئل أبو بكر الصديق - رضي الله عنه - عن تفسير الفاكهة والأب فقال : أي سماء تظلني وأي أرض تقلني إذا قلت : في كتاب الله ما لا أعلم . وقال أنس : سمعت عمر بن الخطاب - رضي الله عنه - قرأ هذه الآية ثم قال : كل هذا قد عرفناه ، فما الأب ؟ ثم رفع عصا كانت بيده وقال : هذا لعمر الله التكلف ، وما عليك يا بن أم عمر ألا تدري ما الأب ؟ ثم [ ص: 192 ] قال : اتبعوا ما بين لكم من هذا الكتاب ، وما لا فدعوه . وروي عن النبي - صلى الله عليه وسلم - أنه قال : \" خلقتم من سبع ، ورزقتم من سبع ، فاسجدوا لله على سبع \" . وإنما أراد بقوله : \" خلقتم من سبع \" يعني ( من نطفة ، ثم من علقة ، ثم من مضغة ) الآية ، والرزق من سبع ، وهو قوله تعالى : فأنبتنا فيها حبا وعنبا إلى قوله : وفاكهة ثم قال : وأبا وهو يدل على أنه ليس برزق لابن آدم ، وأنه مما تختص به البهائم . والله أعلم .\n","ar.miqbas":"وَفَاكِهَةً وَأَبًّا (31) والفاكهة : الثمار التي تؤكل للتفكه لا للإقتيات ، مثل الرُّطَب والعِنب الرَّطْب والرمان واللوز .والأبُّ : بفتح الهمزة وتشديد الباء : الكلأ الذي ترعاه الأنعام ، روي أن أبا بكر الصديق سُئل عن الأبّ : ما هو؟ فقال : «أيُّ سماءٍ تُظلني ، وأيُّ أرض تُقِلَّني إذا قلت في كتاب الله ما لا علم لي به» وروي أن عمر بن الخطاب قرأ يوماً على المنبر : { فأنبتنا فيها حباً } إلى { وأبّاً } فقال : كلّ هذا قد عرفناه فما الأبّ؟ ثم رفع عصا كانت في يده ، وقال : هذا لعمر الله هو التكلف فما عليك يا ابن أمّ عمر أن لا تدري ما الأبّ ابتغوا ما بُيّن لكم من هذا الكتاب فاعملوا به ، وما لم تعرفوه فَكِلوه إلى ربه» . وفي «صحيح البخاري» عن عُمر بعض هذا مختصراً .والذي يظهر لي في انتفاء علم الصديق والفاروق بمدلول الأبّ وهما من خُلّص العرببِ لأحد سببين :إما لأن هذا اللفظ كان قد تنوسي من استعمالهم فأحياه القرآن لرعاية الفاصلة فإن الكلمة قد تشتهر في بعض القبائل أو في بعض الأزمان وتُنسى في بعضها مثل اسم السِّكين عندَ الأوس والخزرج ، فقد قال أنس بن مالك : «ما كُنَّا نَقول إلا المُدْية حتى سمعت قول رسول الله صلى الله عليه وسلم يذكر أن سليمان عليه السلام قال :\" ائيتوني بالسكين أقْسِمْ الطفْلَ بينهما نصفين \" .وإما لأن كلمة الأبّ تطلق على أشياء كثيرة منها النبت الذي ترعاه الأنعام ، ومنها التبن ، ومنها يابس الفاكهة ، فكان إمساك أبي بكر وعمر عن بيان معناه لعدم الجزم بما أراد الله منه على التعيين\n","ar.waseet":"( وَفَاكِهَةً وَأَبّاً ) . . والفاكهة : اسم للثمار التى يتناولها الإِنسان على سبيل التفكه والتلذذ ، مثل الرطب والعنب والتفاح .والأب : اسم للكلأ الذى ترعاه الأنعام ، مأخوذ من أبَّ فلان الشئ ، إذا قصده واتجه نحوه ، لحاجته إليه . . والكلأ والعشب يتجه إلأيه الإِنسان بدوابه للرعى . .قال صاحب الكشاف : والأب : المرعى ، لأنه يؤب ، أى : يؤم وينتجع . . . وعن أبى بكر الصديق - رضى الله عنه - أنه سئل عن الأب فقال : أى سماء تظلنى ، وأى أرض تقلنى ، إذا قلت فى كتاب الله مالا علم لى به . .وعن عمر - رضى الله عنه - أنه قرأ هذه الآية فقال : كل هذا قد عرفنا ، فما الأب؟ ثم رفع عصا كانت فى يده وقال : هذا لعمر الله التكلف ، وما عليك يا بن أم عمر أن لا تدرى ما الأب؟ ثم قال : اتبعوا ما تبين لكم من هذا الكتاب ، وما لا فدعوه .فإن قلت : فهذا يشبه النهى عن تتبع معانى القرآن والبحث عن مشكلاته؟ قلت : لم يذهب إلى ذلك ، ولكن القوم كانت أكبر همتهم عاكفة عن العمل ، وكان التشاغل بشئ من العلم لا يعمل به تكلفا عندهم ، فأراد أن الآية مسوقة فى الامتنان على الإِنسان بمطعمه ، واستدعاء شكره ، وقد علم من فحوى الآية ، أن الأبَّ بعض ما أنبته الله للإِنسان متاعا له أو لأنعامه فعليك؟ بما هو أهم ، من النهوض بالشكر لله - تعالى - على ما تبين لك أو لم يشكل ، مما عدد من نعمه ، ولا تتشاغل عنه بطلب معنى الأب ، ومعرفة النبات الخاص الذى هو اسم له ، واكتف بالمعرفة الجملية ، إلى أن يتبين لك فى غير هذا الوقت . .وقال بعض العلماء : والذى يتبين لى فى انتفاء علم الصديق والفاروق بمدلول لفظ الأب ، وهما من خلص العرب لأحد سببين :إما لأن اللفظ كان قد تنوسى من استعمالهم ، فأحياه القرآن لرعاية الفاصلة ، فإن الكلمة قد تشتهر فى بعض القبائل أو فى بعض الأزمان وتنسى فى بعضها ، مثل اسم السكين عند الأوس والخزرج . فقد قال أنس بن مالك : ما كنا نقول إلا المدية ، حتى سمعت قول الرسول صلى الله عليه وسلم يذكر أن سليمان قال : \" ائتونى بالسكين أقسم الطفل بينهما نصفين \" .وإما لأن كلمة الأب تطلق على أشياء كثيرة ، منها النبت الذى ترعاه الأنعام ، ومنها التبن . ومنها يابس الفاكهة ، فكان إمساك أبى بكر وعمر عن بيان معناه ، لعدم الجزم بما أراد الله منه على التعيين ، وهل الأب مما يرجع إلى قوله ( مَّتَاعاً لَّكُمْ وَلأَنْعَامِكُمْ )\n","ar.baghawi":"( وفاكهة ) يريد ألوان الفواكه ( وأبا ) يعني الكلأ والمرعى الذي لم يزرعه الناس ، مما يأكله الأنعام والدواب .قال عكرمة : \" الفاكهة \" ما يأكله الناس ، و \" الأب \" ما يأكله الدواب . ومثله عن قتادة قال : الفاكهة لكم والأب لأنعامكم .وقال سعيد بن جبير عن ابن عباس قال : ما أنبتت [ الأرض ] مما يأكل الناس والأنعام .وروي عن إبراهيم التيمي أن أبا بكر سئل عن قوله : \" وفاكهة وأبا \" فقال : أي سماء تظلني وأي أرض تقلني إذا قلت في كتاب الله ما لا أعلم .وروى ابن شهاب عن أنس أنه سمع عمر بن الخطاب قرأ هذه الآية ثم قال : كل هذا قد عرفنا فما الأب ؟ ثم رفض عصا كانت بيده وقال : هذا [ والله ] لعمر الله التكلف ، وما عليك يا ابن [ أم ] عمر أن لا تدري ما الأب ، ثم قال : اتبعوا ما تبين لكم من هذا الكتاب ، وما لا [ تبين ] فدعوه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5789.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5789.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5789.mp3","format":"mp3","local_path":null}}},{"verse":32,"arabic":"مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ","transliteration":"Mata'al-lakum wa li-an'amikum.","translations":{"en.ahmedali":"A provision for you and your cattle.","en.ahmedraza":"In order to benefit you and your cattle.","en.arberry":"an enjoyment for you and your flocks.","en.asad":"for you and for your animals to enjoy.","en.daryabadi":"A provision for you and for your cattle.","en.hilali":"(To be) a provision and benefit for you and your cattle.","en.pickthall":"Provision for you and your cattle.","en.qaribullah":"for you and for your herds to delight in.","en.sahih":"[As] enjoyment for you and your grazing livestock.","en.sarwar":"(These are made so as to be) means of enjoyment for you and your cattle.","en.yusufali":"For use and convenience to you and your cattle.","en.maududi":"all this as a provision for you and your cattle.","en.shakir":"A provision for you and for your cattle.","en.itani":"Enjoyment for you, and for your livestock.","en.mubarakpuri":"A provision and benefit for you and your cattle.","en.qarai":"as a sustenance for you and your livestock.","en.wahiduddin":"as provision for you and for your cattle to enjoy."},"tafsir":{"ar.muyassar":"فليتدبر الإنسان: كيف خلق الله طعامه الذي هو قوام حياته؟ أنَّا صببنا الماء على الأرض صَبًّا، ثم شققناها بما أخرجنا منها من نبات شتى، فأنبتنا فيها حبًا، وعنبًا وعلفًا للدواب، وزيتونًا ونخلا وحدائق عظيمة الأشجار، وثمارًا وكلأ تَنْعَمون بها أنتم وأنعامكم.","ar.jalalayn":"«متاعا» متعة أو تمتيعا كما تقدم في السورة قبلها «لكم ولأنعامكم» تقدم فيها أيضا.","ar.qurtubi":"متاعا لكم نصب على المصدر المؤكد ، لأن إنبات هذه الأشياء إمتاع لجميع الحيوانات . وهذا ضرب مثل ضربه الله تعالى لبعث الموتى من قبورهم ، كنبات الزرع بعد دثوره ، كما تقدم بيانه في غير موضع . ويتضمن امتنانا عليهم بما أنعم به ، وقد مضى في غير موضع أيضا .\n","ar.miqbas":"مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ (32)، وهل الأبّ مما يرجع إلى قوله : { متاعاً لكم } أو إلى قوله : { ولأنعامكم } في جمْع ما قُسِّم قبله .وذكر في «الكشاف» وجهاً آخر خاصاً بكلام عُمر فقال : « إن القوم كانتْ أكبر همتهم عاكفة على العمل ، وكان التشاغل بشيء من العلم لا يُعمل به تكلفاً عندهم ، فأراد عمر أن الآية مسوقة في الامتنان على الإِنسان . وقد علم من فحوى الآية أنّ الأبَّ بعض ما أنبته الله للإِنسان متاعاً له ولأنعامه فعليك بما هو أهم من النهوض بالشكر لله على ما تبين لك مما عُدد من نعمه ولا تتشاغل عنه بطلب معنى الأبّ ومعرفة النبات الخاص الذي هو اسم له واكتف بالمعرفة الجملية إلى أن يتبين لك في غير هذا الوقت ، ثم وصى الناس بأن يَجروا على هذا السَنن فيما أشبه ذلك من مشكلات القرآن ا ه» . ولم يأت كلام «الكشاف» بأزيد من تقرير الإِشكال .وقوله : { متاعاً لكم } حال من المذكورات يعود إلى جميعها على قاعدة ورود الحال بعد مفردات متعاطفة ، وهذا نوع من التنازع .وقوله : { ولأنعامكم } عطَف قوله : { لكم } .والمتاع : ما يُنتفع به زمناً ثم ينقطع ، وفيه لف ونشر مُشَوَّش ، والسامع يرجع كل شيء من المذكورات إلى ما يصلح له لظهوره . وهذه الحال واقعة موقع الإِدماج أدمجت الموعظة والمنة في خلال الاستدلال .\n","ar.waseet":"( مَّتَاعاً لَّكُمْ وَلأَنْعَامِكُمْ )أى : أنبت لكم تلك الزورع والثمار . . لتكون موضع انتفاع لكم ولأنعامكم إلى حين من الزمان .إذ المتاع : هو ما ينتفع به الإِنسان إلى حين ثم ينتهى ويزول ، ولفظ \" متاعا \" منصوب بفعل محذوف ، أى : فعل ذلك متاعا لكم ، أو متعكم بذلك تمتيعا لكم ولأنعامكم .أو قوله ( مَّتَاعاً لَّكُمْ ) حال من الألفاظ السابقة : العنب والقضب والزيتون والنخل .أى : حالة كون هذه المذكورات موضع انتفاع لكم ولأنعامكم .\n","ar.baghawi":"\"متاعاً لكم\"، منفعة لكم يعني الفاكهة، \"ولأنعامكم\"، يعني العشب.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5790.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5790.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5790.mp3","format":"mp3","local_path":null}}},{"verse":33,"arabic":"فَإِذَا جَاءَتِ الصَّاخَّةُ","transliteration":"Faiza jaa-atis saakhah.","translations":{"en.ahmedali":"But when the great calamity comes","en.ahmedraza":"So when the deafening Shout arrives,","en.arberry":"And when the Blast shall sound,","en.asad":"AND SO, when the piercing call [of resurrection] is heard","en.daryabadi":"Then when cometh the Deafening Cry-","en.hilali":"Then, when there comes As-Sakhkhah (the Day of Resurrection's second blowing of Trumpet),","en.pickthall":"But when the Shout cometh","en.qaribullah":"But, when the Blast comes,","en.sahih":"But when there comes the Deafening Blast","en.sarwar":"When the trumpet sounds,","en.yusufali":"At length, when there comes the Deafening Noise,-","en.maududi":"But when the deafening cry shall be sounded","en.shakir":"But when the deafening cry comes,","en.itani":"But when the Deafening Noise comes to pass.","en.mubarakpuri":"Then when there comes As-Sakhkhah","en.qarai":"So when the deafening Cry comes—","en.wahiduddin":"But when the deafening blast is sounded,"},"tafsir":{"ar.muyassar":"فإذا جاءت صيحة يوم القيامة التي تصمُّ مِن هولها الأسماع، يوم يفرُّ المرء لهول ذلك اليوم من أخيه، وأمه وأبيه، وزوجه وبنيه. لكل واحد منهم يومئذٍ أمر يشغله ويمنعه من الانشغال بغيره.","ar.jalalayn":"«فإذا جاءت الصاخة» النفخة الثانية.","ar.qurtubi":"قوله تعالى : فإذا جاءت الصاخة لما ذكر أمر المعاش ذكر أمر المعاد ، ليتزودوا له بالأعمال الصالحة ، وبالإنفاق مما امتن به عليهم . والصاخة : الصيحة التي تكون عنها القيامة ، وهي النفخة الثانية ، تصخ الأسماع : أي تصمها فلا تسمع إلا ما يدعى به للأحياء . وذكر ناس من المفسرين قالوا : تصيخ لها الأسماع ، من قولك : أصاخ إلى كذا : أي استمع إليه ، ومنه الحديث : \" ما من دابة إلا وهي مصيخة يوم الجمعة شفقا من الساعة إلا الجن والإنس \" . وقال الشاعر :يصيخ للنبأة أسماعه إصاخة المنشد للمنشد[ ص: 193 ] قال بعض العلماء : وهذا يؤخذ على جهة التسليم للقدماء ، فأما اللغة فمقتضاها القول الأول ، قال الخليل : الصاخة : صيحة تصخ الآذان صخا أي تصمها بشدة وقعتها . وأصل الكلمة في اللغة : الصك الشديد . وقيل : هي مأخوذة من صخه بالحجر : إذا صكه قال الراجز :يا جارتي هل لك أن تجالدي     جلادة كالصك بالجلامدومن هذا الباب قول العرب : صختهم الصاخة وباتتهم البائتة ، وهي الداهية . الطبري : وأحسبه من صخ فلان فلانا : إذا أصماه . قال ابن العربي : الصاخة التي تورث الصمم ، وإنها لمسمعة ، وهذا من بديع الفصاحة ، حتى لقد قال بعض حديثي الأسنان حديثي الأزمان :أصم بك الناعي وإن كان أسمعاوقال آخر :أصمني سرهم أيام فرقتهم     فهل سمعتم بسر يورث الصممالعمر الله إن صيحة القيامة لمسمعة تصم عن الدنيا ، وتسمع أمور الآخرة .\n","ar.miqbas":"فَإِذَا جَاءَتِ الصَّاخَّةُ (33) الفاء للتفريع على اللوْم والتوبيخ في قوله : { قتل الإنسان ما أكفره } [ عبس : 17 ] وما تبعه من الاستدلال على المشركين من قوله : { من أي شيء خلقه } إلى قوله { أنا صببنا الماء صباً } [ عبس : 18 25 ] ، ففُرع على ذلك إنذار بيوم الجزاء ، مع مناسبة وقوع هذا الإِنذار عقب التعريض والتصريح بالامتنان في قوله : { إلى طعامه } [ عبس : 24 ] وقوله : { متاعاً لكم ولأنعامكم } [ عبس : 32 ] على نحو ما تقدم في قوله : { فإذا جاءت الطامة الكبرى } من سورة النازعات ( 34 ) .والصَّاخّة } : صيحة شديدة من صيحات الإِنسان تَصُخ الأسماع ، أي تُصِمها . يقال : صَخَّ يصخ قاصراً ومتعدياً ، ومضارعه يصُخ بضم عينه في الحالين . وقد اختلف أهل اللغة في اشتقاقها اختلافاً لا جدوَى له ، وما ذكرناه هو خلاصة قول الخليل والراغب وهو أحسن وأجرى على قياس اسم الفاعل من الثلاثي ، فالصاخّة صارت في القرآن عَلماً بالغَلبة على حادثةِ يوم القيامة وانتهاءِ هذا العالم ، وتحصل صيحات منها أصوات تزلزل الأرض واصطدام بعض الكواكب بالأرض مثلاً ، ونفخة الصُّور التي تبعث عندها الناس . و ( إذا ) ظرف وهو متعلق ب { جاءت الصاخّة } وجوابه قوله : { وجوه يومئذ مسفرة } الآيات .والمجيء مستعمل في الحصول مجازاً ، شُبه حصول يوم الجزاء بشخص جاء من مكان آخر .\n","ar.waseet":"ثم ختم - سبحانه - السورة الكريمة بالحديث عن أحوال الناس فى يوم القيامة فقال - تعالى - :( فَإِذَا جَآءَتِ . . . ) .الفاء فى قوله - سبحانه - ( فَإِذَا جَآءَتِ الصآخة ) للدلالة على ترتيب ما بعدها على ما قبلها من فنون النعم . وجواب ( إذا ) محذوف يدل عليه قوله - تعالى - بعد ذلك : ( لِكُلِّ امرىء مِّنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ ) ، ويصح أن يكون جوابه قوله : ( وُجُوهٌ يَوْمَئِذٍ مُّسْفِرَةٌ ) .والصاخة : الصحية الشديدة التى تصُخُّ الآذان ، أى تزلزلها لشدة صوتها ، وأصل الصخ : الصك الشديد ، والمراد بها هنا : النفخة الثانية التى بعدها يبعث الناس من قبورهم . .أى : فإذا جاءت الصحية العظيمة التى بعدها يخرج الناس من قبورهم للحساب والجزاء ، كان ما كان من سعادة أقوام ، ومن شقاء آخرين .\n","ar.baghawi":"ثم ذكر القيامة فقال: \"فإذا جاءت الصاخة\"، يعني صيحة القيامة سميت بذلك لأنها تصخ الأسماع، أي تبالغ في الأسماع حتى تكاد تصمها.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5791.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5791.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5791.mp3","format":"mp3","local_path":null}}},{"verse":34,"arabic":"يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ","transliteration":"Yauma yafir-rul mar-u min akheeh","translations":{"en.ahmedali":"Man will fly from his brother,","en.ahmedraza":"On that day man will run away from his brother.","en.arberry":"upon the day when a man shall flee from his brother,","en.asad":"on a Day when everyone will [want to] flee from his brother,","en.daryabadi":"On the Day whereon a man shall flee from his brother,","en.hilali":"That Day shall a man flee from his brother,","en.pickthall":"On the day when a man fleeth from his brother","en.qaribullah":"on that Day each person will flee from his brother,","en.sahih":"On the Day a man will flee from his brother","en.sarwar":"it will be such a day when a person will run away from his brother,","en.yusufali":"That Day shall a man flee from his own brother,","en.maududi":"on the Day when each man shall flee from his brother,","en.shakir":"The day on which a man shall fly from his brother,","en.itani":"The Day when a person will flee from his brother.","en.mubarakpuri":"That Day shall a man flee from his brother.","en.qarai":"the day when a man will evade his brother,","en.wahiduddin":"on that Day a man shall flee from his own brother,"},"tafsir":{"ar.muyassar":"فإذا جاءت صيحة يوم القيامة التي تصمُّ مِن هولها الأسماع، يوم يفرُّ المرء لهول ذلك اليوم من أخيه، وأمه وأبيه، وزوجه وبنيه. لكل واحد منهم يومئذٍ أمر يشغله ويمنعه من الانشغال بغيره.","ar.jalalayn":"«يوم يفر المرء من أخيه».","ar.qurtubi":"قوله تعالى : يوم يفر المرء من أخيه أي يهرب ، أي تجيء الصاخة في هذا اليوم الذي يهرب فيه من أخيه ; أي من موالاة أخيه ومكالمته ; لأنه لا يتفرغ لذلك ، لاشتغاله بنفسه ; كما قال بعده : لكل امرئ منهم يومئذ شأن يغنيه أي يشغله عن غيره . وقيل : إنما يفر حذرا من مطالبتهم إياه ، لما بينهم من التبعات . وقيل : لئلا يروا ما هو فيه من الشدة . وقيل : لعلمه أنهم لا ينفعونه ولا يغنون عنه شيئا ; كما قال : يوم لا يغني مولى عن مولى شيئا . وقال عبد الله بن طاهر الأبهري : يفر منهم لما تبين له من عجزهم وقلة حيلتهم ، إلى من يملك كشف تلك الكروب والهموم عنه ، ولو ظهر له ذلك في الدنيا لما اعتمد شيئا سوى ربه تعالى . وصاحبته أي زوجته وبنيه أي أولاده .وذكر الضحاك عن ابن عباس قال : يفر قابيل من أخيه هابيل ، ويفر النبي - صلى الله عليه وسلم - من أمه ، وإبراهيم - عليه السلام - من أبيه ، ونوح - عليه السلام - من ابنه ، ولوط من امرأته ، وآدم من سوأة بنيه . وقال الحسن : أول من يفر يوم القيامة من أبيه : إبراهيم ، وأول من يفر من ابنه نوح ; وأول من يفر من امرأته لوط . قال : فيرون أن هذه الآية نزلت فيهم وهذا فرار التبرؤ .\n","ar.miqbas":"يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ (34) و { يوم يفر المرء من أخيه } بدل من { إذا جاءت الصاخة } بدلاً مطابقاً .والفرار : الهروب للتخلص من مُخيف .وحرف ( من ) هنا يجوز أن يكون بمعنى التعليل الذي يُعدّى به فعل الفرار إلى سبب الفرار حين يقال : فَرّ من الأسد ، وفرّ من العدو ، وفرّ من الموت ، ويجوز أن يكون بمعنى المجاوزة مثل ( عن ) .وكون أقرب الناس للإِنسان يفرّ منهم يقتضي هولَ ذلك اليوم بحيث إذا رأى ما يحل من العذاب بأقرب الناس إليه توهم أن الفرار منه يُنْجِيه من الوقوع في مثله ، إذ قد علم أنه كان مماثلاً لهم فيما ارتكبوه من الأعمال فذكرت هنا أصناف من القرابة ، فإن القرابة آصرة تكون لها في النفس معزة وحرص على سلامة صاحبها وكرامته . والألفَ يحدث في النفس حرصاً على الملازمة والمقارنة . وكلا هذين الوجدانين يصد صاحبه عن المفارقة فما ظنك بهول يغْشَى على هذين الوجدانين فلا يَترك لهما مجالاً في النفس .ورتبت أصناف القرابة في الآية حسب الصعود من الصنف إلى من هو أقوى منه تدرجاً في تهويل ذلك اليوم .فابتدىء بالأخ لشدة اتصاله بأخيه من زمن الصبا فينشأ بذلك إلف بينهما يستمر طول الحياة ، ثم ارتُقي من الأخ إلى الأبوين وهما أشد قرباً لابْنيهما ، وقدمت الأم في الذكر لأن إلْفَ ابنها بها أقوى منه بأبيه وللرعي على الفاصلة ، وانتقل إلى الزوجة والبنين وهما مُجتمع عائلة الإِنسان وأشد الناس قرباً به وملازمة .وأطنب بتعداد هؤلاء الأقرباء دون أن يقال : يوم يفر المرء من أقرب قرابته مثلاً لإحضار صورة الهول في نفس السامع .\n","ar.waseet":"وقوله - سبحانه - : ( يَوْمَ يَفِرُّ المرء مِنْ أَخِيهِ . وَأُمِّهِ وَأَبِيهِ ) بدل مما قبله وهو قوله ( فَإِذَا جَآءَتِ الصآخة ) والفرار : الهروب من أجل التخلص من شئ مخيف .والمعنى : يوم يقوم الناس من قبورهم للحساب والجزاء يكونون فى كرب عظيم ، يجعل الواحد منهم ، يهرب من أخيه الذى هو من ألصق الناس به .\n","ar.baghawi":"\"يوم يفر المرء من أخيه\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5792.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5792.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5792.mp3","format":"mp3","local_path":null}}},{"verse":35,"arabic":"وَأُمِّهِ وَأَبِيهِ","transliteration":"Wa ummihee wa abeeh","translations":{"en.ahmedali":"Mother and father,","en.ahmedraza":"And from his mother and father,","en.arberry":"his mother, his father,","en.asad":"and from his mother and father,","en.daryabadi":"And his mother and his father,","en.hilali":"And from his mother and his father,","en.pickthall":"And his mother and his father","en.qaribullah":"his mother and his father,","en.sahih":"And his mother and his father","en.sarwar":"mother, father,","en.yusufali":"And from his mother and his father,","en.maududi":"and his mother and his father;","en.shakir":"And his mother and his father,","en.itani":"And his mother and his father.","en.mubarakpuri":"And from his mother and his father.","en.qarai":"his mother and his father,","en.wahiduddin":"his mother, his father,"},"tafsir":{"ar.muyassar":"فإذا جاءت صيحة يوم القيامة التي تصمُّ مِن هولها الأسماع، يوم يفرُّ المرء لهول ذلك اليوم من أخيه، وأمه وأبيه، وزوجه وبنيه. لكل واحد منهم يومئذٍ أمر يشغله ويمنعه من الانشغال بغيره.","ar.jalalayn":"«وأمه وأبيه».","ar.qurtubi":"وأمه وأبيهقيل : إنما يفر حذرا من مطالبتهم إياه , لما بينهم من التبعات . وقيل : لئلا يروا ما هو فيه من الشدة . وقيل : لعلمه أنهم لا ينفعونه ولا يغنون عنه شيئا ; كما قال : \" يوم لا يغني مولى عن مولى شيئا \" [ الدخان : 41 ] . وقال عبد الله بن طاهر الأبهري : يفر منهم لما تبين له من عجزهم وقلة حيلتهم , إلى من يملك كشف تلك الكروب والهموم عنه , ولو ظهر له ذلك في الدنيا لما اعتمد شيئا سوى ربه تعالى . وذكر الضحاك عن ابن عباس قال : يفر قابيل من أخيه هابيل , ويفر النبي صلى الله عليه وسلم من أمه , وإبراهيم عليه السلام من أبيه , ونوح عليه السلام من ابنه , ولوط من امرأته , وآدم من سوأة بنيه . وقال الحسن : أول من يفر يوم القيامة من أبيه : إبراهيم , وأول من يفر من ابنه نوح ; وأول من يفر من امرأته لوط . قال : فيرون أن هذه الآية نزلت فيهم وهذا فرار التبرؤ .\n","ar.miqbas":"وَأُمِّهِ وَأَبِيهِ (35) وكون أقرب الناس للإِنسان يفرّ منهم يقتضي هولَ ذلك اليوم بحيث إذا رأى ما يحل من العذاب بأقرب الناس إليه توهم أن الفرار منه يُنْجِيه من الوقوع في مثله ، إذ قد علم أنه كان مماثلاً لهم فيما ارتكبوه من الأعمال فذكرت هنا أصناف من القرابة ، فإن القرابة آصرة تكون لها في النفس معزة وحرص على سلامة صاحبها وكرامته . والألفَ يحدث في النفس حرصاً على الملازمة والمقارنة . وكلا هذين الوجدانين يصد صاحبه عن المفارقة فما ظنك بهول يغْشَى على هذين الوجدانين فلا يَترك لهما مجالاً في النفس .ورتبت أصناف القرابة في الآية حسب الصعود من الصنف إلى من هو أقوى منه تدرجاً في تهويل ذلك اليوم .فابتدىء بالأخ لشدة اتصاله بأخيه من زمن الصبا فينشأ بذلك إلف بينهما يستمر طول الحياة ، ثم ارتُقي من الأخ إلى الأبوين وهما أشد قرباً لابْنيهما ، وقدمت الأم في الذكر لأن إلْفَ ابنها بها أقوى منه بأبيه وللرعي على الفاصلة ، وانتقل إلى الزوجة والبنين وهما مُجتمع عائلة الإِنسان وأشد الناس قرباً به وملازمة .وأطنب بتعداد هؤلاء الأقرباء دون أن يقال : يوم يفر المرء من أقرب قرابته مثلاً لإحضار صورة الهول في نفس السامع .\n","ar.waseet":"ويهرب كذلك من أمه وأبيه .\n","ar.baghawi":"\"وأمه وأبيه\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5793.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5793.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5793.mp3","format":"mp3","local_path":null}}},{"verse":36,"arabic":"وَصَاحِبَتِهِ وَبَنِيهِ","transliteration":"Wa sahi batihee wa baneeh.","translations":{"en.ahmedali":"As well as his wife and children.","en.ahmedraza":"And from his wife and sons.","en.arberry":"his consort, his sons,","en.asad":"and from his spouse and his children:","en.daryabadi":"And his wife and his sons;","en.hilali":"And from his wife and his children.","en.pickthall":"And his wife and his children,","en.qaribullah":"his wife and his children.","en.sahih":"And his wife and his children,","en.sarwar":"wife and sons,","en.yusufali":"And from his wife and his children.","en.maududi":"and his consort and his children;","en.shakir":"And his spouse and his son--","en.itani":"And his consort and his children.","en.mubarakpuri":"And from his wife and his children.","en.qarai":"his spouse and his sons—","en.wahiduddin":"his wife and his sons:"},"tafsir":{"ar.muyassar":"فإذا جاءت صيحة يوم القيامة التي تصمُّ مِن هولها الأسماع، يوم يفرُّ المرء لهول ذلك اليوم من أخيه، وأمه وأبيه، وزوجه وبنيه. لكل واحد منهم يومئذٍ أمر يشغله ويمنعه من الانشغال بغيره.","ar.jalalayn":"«وصاحبته» زوجته «وبنيه» يوم بدل من إذا، وجوابها دل عليه.","ar.qurtubi":"وصاحبته وبنيه\" وصاحبته \" أي زوجته . \" وبنيه \" أي أولاده . وذكر الضحاك عن ابن عباس قال : يفر قابيل من أخيه هابيل , ويفر النبي صلى الله عليه وسلم من أمه , وإبراهيم عليه السلام من أبيه , ونوح عليه السلام من ابنه , ولوط من امرأته , وآدم من سوأة بنيه . وقال الحسن : أول من يفر يوم القيامة من أبيه : إبراهيم , وأول من يفر من ابنه نوح ; وأول من يفر من امرأته لوط . قال : فيرون أن هذه الآية نزلت فيهم وهذا فرار التبرؤ .\n","ar.miqbas":"وَصَاحِبَتِهِ وَبَنِيهِ (36) وكل من هؤلاء القرابة إذا قدرتَه هو الفارّ كان مَن ذُكر معه مفروراً منه إلا قولَه : { وصاحبته } لظهور أن معناه : والمرأةِ من صاحبها ، ففيه اكتفاء ، وإنما ذُكرتْ بوصف الصاحبة الدال على القرب والملازمة دون وصف الزوج لأن المرأة قد تكون غير حسنة العشرة لزوجها فلا يكون فراره منها كناية عن شدة الهول فذكر بوصف الصاحبة .والأقرب أن هذا فرار المؤمن من قرابته المشركين خشية أن يؤاخذ بتبعتهم إذْ بَقُوا على الكفر .وتعليق جار الأقرباء بفعل : { يفر المرء } يقتضي أنهم قد وقعوا في عذاب يخشون تعديه إلى من يتصل بهم .وقد اجتمع في قوله : { يوم يفر المرء من أخيه } إلى آخره أبلغ ما يفيد هول ذلك اليوم بحيث لا يترك هوله للمرء بقية من رشده فإن نفس الفرار للخائف مسبة فيما تعارفوه لدلالته على جبن صاحبه وهم يتعيرون بالجبن وكونَه يترك أعز الأعزة عليه مسبة عظمى .وجملة : { لكل امرىء منهم يومئذٍ شأن يغنيه } مستأنفة استئنافاً ابتدائياً لزيادة تهويل اليوم ، وتنوينُ { شأن } للتعظيم .وحيث كان فرار المرء من الأقرباء الخمسة يقتضي فرار كل قريب من أولئك من مثله كان الاستئناف جامعاً للجميع تصريحاً بذلك المقتضَى ، فقال : { لكل امرىء منهم يومئذٍ شأن يغنيه } أي عن الاشتغال بغيره من المذكورات بَلْهَ الاشتغال عمن هو دون أولئك في القرابة والصحبة .والشأن : الحال المهم .\n","ar.waseet":"ومن صاحبته - وهى زوجه - وبنيه الذين هم فرع عنه .والمراد بفراره منهم : عدم اشتغاله بشئ يتعلق بهم ، وعدم التفكير فيهم وفى الالتقاء بهم ، لاشتغاله بحال نفسه اشتغالا ينسيه كل شئ سوى التفكير فى مصيره . . وذلك لشدة الهول ، وعظم الخطب .وخص - سبحانه - هؤلاء النفر بالذكر ، لأنهم أخص القرابات ، وأولاهم بالحنو والرأفة ، فالفرار منهم لا يكون إلا فى أشد حالات الخوف والفزع .قال صاحب الكشاف : \" يفر \" منهم لاشتغاله بما هو مدفوع إليه ، ولعلمه بأنهم لا يغنون عنه شيئا : وبدأ بالأخ ثم بالأبوين لأنهما أقرب منه ثم بالصاحبة والبنين ، لأنهم أقرب وأحب كأنه قال : يفر من أخيه ، بل من أبويه ، بل من صاحبته وبنيه . .\n","ar.baghawi":"\"وصاحبته وبنيه\"لا يلتفت إلى واحد منهم لشغله بنفسه .حكي عن قتادة قال في هذه الآية يوم يفر المرء من أخيه وأمه وأبيه وصاحبته وبنيه قال : يفر هابيل من قابيل ، ويفر النبي - صلى الله عليه وسلم - من أمه ، وإبراهيم - عليه السلام - من أبيه ، ولوط - عليه السلام - من صاحبته ، ونوح - عليه السلام - من ابنه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5794.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5794.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5794.mp3","format":"mp3","local_path":null}}},{"verse":37,"arabic":"لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ","transliteration":"Likul limri-im-minuhm yaumaa-izin shaa nuy-yughneeh","translations":{"en.ahmedali":"Each man will have enough cares that day.","en.ahmedraza":"On that day, each one has just one issue, which is enough for him.","en.arberry":"every man that day shall have business to suffice him.","en.asad":"on that Day, to every one of them will his own state be of sufficient concern.","en.daryabadi":"For every one of them on that Day shall be business enough to occupy","en.hilali":"Everyman, that Day, will have enough to make him careless of others.","en.pickthall":"Every man that day will have concern enough to make him heedless (of others).","en.qaribullah":"Everyone on that Day will have affairs to keep him occupied.","en.sahih":"For every man, that Day, will be a matter adequate for him.","en.sarwar":"for on that day everyone will be completely engrossed in his own concerns.","en.yusufali":"Each one of them, that Day, will have enough concern (of his own) to make him indifferent to the others.","en.maududi":"on that Day each will be occupied with his own business, making him oblivious of all save himself.","en.shakir":"Every man of them shall on that day have an affair which will occupy him.","en.itani":"Every one of them, on that Day, will have enough to preoccupy him.","en.mubarakpuri":"Every man that Day will have enough to make him careless of others.","en.qarai":"each of them will have a task to keep him preoccupied on that day.","en.wahiduddin":"on that Day every man among them will have enough concern of his own --"},"tafsir":{"ar.muyassar":"فإذا جاءت صيحة يوم القيامة التي تصمُّ مِن هولها الأسماع، يوم يفرُّ المرء لهول ذلك اليوم من أخيه، وأمه وأبيه، وزوجه وبنيه. لكل واحد منهم يومئذٍ أمر يشغله ويمنعه من الانشغال بغيره.","ar.jalalayn":"«لكل امرىءٍ منهم يومئذ شأن يغنيه» حال يشغله عن شأن غيره، أي اشتغل كل واحد بنفسه.","ar.qurtubi":"لكل امرئ منهم يومئذ شأن يغنيه في صحيح مسلم عن عائشة - رضي الله عنها - قالت : سمعت رسول - صلى الله عليه وسلم - يقول : يحشر الناس يوم القيامة حفاة عراة غرلا ، قلت ، يا رسول الله ! الرجال [ ص: 194 ] والنساء جميعا ينظر بعضهم إلى بعض ؟ قال : يا عائشة ، الأمر أشد من أن ينظر بعضهم إلى بعض . خرجه الترمذي عن ابن عباس : أن النبي - صلى الله عليه وسلم - قال : \" يحشرون حفاة عراة غرلا \" فقالت امرأة : أينظر بعضنا ، أو يرى بعضنا عورة بعض ؟ قال : \" يا فلانة \" ( لكل امرئ منهم يومئذ شأن يغنيه ) . قال : حديث حسن صحيح . وقراءة العامة بالغين المعجمة ; أي حال يشغله عن الأقرباء . وقرأ ابن محيصن وحميد ( يعنيه ) بفتح الياء ، وعين غير معجمة ; أي يعنيه أمره . وقال القتبي : يعنيه : يصرفه ويصده عن قرابته ، ومنه يقال : اعن عني وجهك : أي اصرفه واعن عن السفيه ; قال خفاف :سيعنيك حرب بني مالك     عن الفحش والجهل في المحفل\n","ar.miqbas":"لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ (37) وتقديم الخبر في قوله : { لكل امرىء } على المبتدأ ليتأتى تنكير { شأن } الدال على التعظيم لأن العرب لا يبتدئون بالنكرة في جملتها إلا بمسوغ من مسوغاتتٍ عَدَّها النحاة بضعةَ عشر مسوغاً ، ومنها تقديم الخبر على المبتدإ .والإِغناء : جعل الغير غنياً ، أي غير محتاج لشيء في غرضهِ . وأصل الإِغناء والغنى : حصول النافع المحتاج إليه ، قال تعالى : { وما أغنى عنكم من اللَّه من شيء } [ يوسف : 67 ] وقال : { ما أغنى عني ماليه } [ الحاقة : 28 ] . وقد استعمل هنا في معنى الإِشغال والإِشغال أعم .فاستعمل الإغناء الذي هو نفع في معنى الإِشغال الأعم على وجه المجاز المرسل أو الاستعارة إيماء إلى أن المؤمنين يشغلهم عن قرابتهم المشركين فرط النعيم ورفع الدرجات كما دل عليه قوله عقبه : { وجوه يومئذٍ مسفرة } إلى آخر السورة .\n","ar.waseet":"وجملة : ( لِكُلِّ امرىء مِّنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ ) مستأنفة ، واردة لبيان سبب الفرار وللمبالغة فى تهويل شأن هذا اليوم .أى : لكل واحد منهم فى هذا اليوم العظيم ، شأن وأمر يغنيه ويكفيه عن الاشتغال بأى أمر آخر سواه ، يقال : فلان أغنى فلاناً عن كذا ، إذا جعله فى غنية عنه .وقد ساق ابن كثير - رحمه الله - عند تفسيره لهذه الآية عدد من الأحاديث ، منها ما رواه النسائى عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" تحشرون فاة عراة غُرْلا \" - بضم فسكون - جمع أغرل ، وهو الأقلف غير المختون - قال ابن عباس : فقالت زوجته : يا رسول الله ، أو يرى بعضنا عورة بعض؟ قال : \" لكل امرئ منهم يومئذ شأن يغنيه \" . أو قال : \" ما أشغله عن النظر \" .\n","ar.baghawi":"( لكل امرئ منهم يومئذ شأن يغنيه ) يشغله عن شأن غيره .أخبرنا أحمد بن إبراهيم الشريحي ، أخبرنا أحمد بن محمد بن إبراهيم الثعلبي ، أخبرني الحسين بن محمد بن عبد الله ، حدثنا عبد الله بن عبد الرحمن ، حدثنا محمد بن عبد العزيز ، حدثنا ابن أبي أويس ، حدثنا أبي ، عن محمد بن أبي عياش ، عن عطاء بن يسار ، عن سودة زوج النبي - صلى الله عليه وسلم - قالت : قال رسول الله - صلى الله عليه وسلم - : \" يبعث الناس حفاة عراة غرلا قد ألجمهم العرق وبلغ شحوم الآذان ، فقلت : يا رسول الله ، واسوأتاه ينظر بعضنا إلى بعض ؟ فقال : قد شغل الناس ، لكل امرئ منهم يومئذ شأن يغنيه \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5795.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5795.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5795.mp3","format":"mp3","local_path":null}}},{"verse":38,"arabic":"وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ","transliteration":"Wujoo huny-yauma-izim-musfira;","translations":{"en.ahmedali":"Many faces will that day be bright,","en.ahmedraza":"Many a face will be glittering on that day.","en.arberry":"Some faces on that day shall shine","en.asad":"Some faces will on that Day be bright with happiness,","en.daryabadi":"Faces on that Day shall be beaming,","en.hilali":"Some faces that Day, will be bright (true believers of Islamic Monotheism).","en.pickthall":"On that day faces will be bright as dawn,","en.qaribullah":"Some faces will shine,","en.sahih":"[Some] faces, that Day, will be bright -","en.sarwar":"Some faces on that day will be radiant,","en.yusufali":"Some faces that Day will be beaming,","en.maududi":"Some faces on that Day shall be beaming with happiness,","en.shakir":"(Many) faces on that day shall be bright,","en.itani":"Faces on that Day will be radiant.","en.mubarakpuri":"Some faces that Day will be bright,","en.qarai":"Some faces will be bright on that day,","en.wahiduddin":"on that Day some faces will be beaming,"},"tafsir":{"ar.muyassar":"وجوه أهل النعيم في ذلك اليوم مستنيرة، مسرورة فرحة، ووجوه أهل الجحيم مظلمة مسودَّة، تغشاها ذلَّة. أولئك الموصوفون بهذا الوصف هم الذين كفروا بنعم الله وكذَّبوا بآياته، وتجرؤوا على محارمه بالفجور والطغيان.","ar.jalalayn":"وجوه يومئذ مسفرة» مضيئة.","ar.qurtubi":"أي مشرقة مضيئة , قد علمت مالها من الفوز والنعيم , وهي وجوه المؤمنين .\n","ar.miqbas":"وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ (38) وجملة : { وجوه يومئذٍ مسفرة } جواب ( إذا ) ، أي إذا جاءت الصاخة كان الناس صنفين صنف وجوههم مسفرة وصنف وجوههم مغبرة .وقدم هنا ذكر وجوه أهل النعيم على وجوه أهل الجحيم خلافَ قوله في سورة النازعات ( 37 ) { فأما من طغى } ثم قوله : { وأما من خاف مقام ربه } [ النازعات : 40 ] إلى آخره لأن هذه السورة أقيمت على عماد التنويه بشأن رجل من أفاضل المؤمنين والتحقير لشأن عظيم من صناديد المشركين فكان حظ الفريقين مقصوداً مسوقاً إليه الكلام وكان حظ المؤمنين هو الملتفت إليه ابتداء ، وذلك من قوله :{ وما يدريك لعله يزكى } [ عبس : 3 ] إلى آخره ، ثم قوله : { أما من استغنى فأنت له تصدى } [ عبس : 5 ، 6 ] .وأما سورة النازعات فقد بُنِيت على تهديد المنكرين للبعث ابتداء من قوله : { يوم ترجف الراجفة تتبعها الرادفة قلوب يومئذ واجفة } [ النازعات : 6 8 ] فكان السياق للتهديد والوعيد وتهويل ما يلقونه يوم الحشر ، وأما ذكر حظ المؤمنين يومئذ فقد دعا إلى ذكره الاستطراد على عادة القرآن من تعقيب الترهيب بالترغيب .وتنكير { وجوه } الأول والثاني للتنويع ، وذلك مسوغ وقوعهما مبتدأ .وإعادة { يومئذ } لتأكيد الربط بين الشرط وجوابه ولطول الفصل بينهما والتقدير : وجوه مسفرة يوم يفرّ المرء من أخيه إلى آخره .وقد أغنت إعادة { يومئذ } عن ربط الجواب بالفاء .والمسفرة ذات الإسفار ، والإِسفار النور والضياء ، يقال : أسفر الصبح ، إذا ظهر ضوء الشمس في أفق الفجر ، أي وجوه متهللة فرحاً وعليها أثر النعيم .\n","ar.waseet":"ثم بين - سبحانه أقسام الناس فى هذا اليوم فقال : ( وُجُوهٌ يَوْمَئِذٍ مُّسْفِرَةٌ .\n","ar.baghawi":"\"وجوه يومئذ مسفرة\"، مشرقة مضيئة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5796.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5796.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5796.mp3","format":"mp3","local_path":null}}},{"verse":39,"arabic":"ضَاحِكَةٌ مُسْتَبْشِرَةٌ","transliteration":"Dahi katum mustab shirah","translations":{"en.ahmedali":"Laughing and full of joy,","en.ahmedraza":"Laughing, rejoicing.","en.arberry":"laughing, joyous;","en.asad":"laughing, rejoicing at glad tidings.","en.daryabadi":"Laughing, rejoicing.","en.hilali":"Laughing, rejoicing at good news (of Paradise).","en.pickthall":"Laughing, rejoicing at good news;","en.qaribullah":"laughing and joyful,","en.sahih":"Laughing, rejoicing at good news.","en.sarwar":"laughing and joyous","en.yusufali":"Laughing, rejoicing.","en.maududi":"and be cheerful and joyous.","en.shakir":"Laughing, joyous.","en.itani":"Laughing and rejoicing.","en.mubarakpuri":"Laughing, rejoicing at good news.","en.qarai":"laughing and joyous,","en.wahiduddin":"laughing, and rejoicing,"},"tafsir":{"ar.muyassar":"وجوه أهل النعيم في ذلك اليوم مستنيرة، مسرورة فرحة، ووجوه أهل الجحيم مظلمة مسودَّة، تغشاها ذلَّة. أولئك الموصوفون بهذا الوصف هم الذين كفروا بنعم الله وكذَّبوا بآياته، وتجرؤوا على محارمه بالفجور والطغيان.","ar.jalalayn":"«ضاحكة مستبشرة» فرحة وهم المؤمنون.","ar.qurtubi":"ضاحكة أي مسرورة فرحة . مستبشرة : أي بما آتاها الله من الكرامة . وقال عطاء الخراساني : مسفرة من طول ما اغبرت في سبيل الله جل ثناؤه . ذكره أبو نعيم . الضحاك : من آثار الوضوء . ابن عباس : من قيام الليل ; لما روي في الحديث : من كثرت صلاته بالليل حسن وجهه بالنهار يقال : أسفر الصبح إذا أضاء .\n","ar.miqbas":"ضَاحِكَةٌ مُسْتَبْشِرَةٌ (39) و { ضاحكة } أي كناية عن السرور .و { مستبشرة } معناه فَرِحة ، والسين والتاء فيه للمبالغة مثل : استجاب ، ويقال : بَشَر ، أي فرِح وسُرَّ ، قال تعالى : { قال يا بشراي هذا غلام } [ يوسف : 19 ] أي يا فرحتي .وإسناد الضحك والاستبشار إلى الوجوه مجاز عقلي لأن الوجوه محلّ ظهور الضحك والاستبشار ، فهو من إسناد الفعل إلى مكانه ، ولك أن تجعل الوجوه كناية عن الذوات كقوله تعالى : { ويبقى وجه ربك } [ الرحمن : 27 ] .\n","ar.waseet":"ضَاحِكَةٌ مُّسْتَبْشِرَةٌ ) أى : وجوه كثيرة فى هذا اليوم تكون مضيئة مشرقة ، يعلوها السرور ، والاستبشار والانشراح ، لما تراه من حسن استقبال الملائكة لهم .وقوله : ( وُجُوهٌ ) مبتدأ وإن كان نكرة ، إلا أنه صح الابتداء به لكونه فى حيز التنويع و ( مُّسْفِرَةٌ ) خبره ، وقوله ( يَوْمَئِذٍ ) متعلق به ، والإِسفار : النور والضياء .والمراد أن هذه الوجوه متهللة فرحا ، وعليها أثر النعيم .\n","ar.baghawi":"\"ضاحكة\"، بالسرور \"مستبشرة\"، فرحة بما نالت من كرامة الله عز وجل.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5797.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5797.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5797.mp3","format":"mp3","local_path":null}}},{"verse":40,"arabic":"وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ","transliteration":"Wa wujoohuy yauma-izin 'alaiha ghabar a","translations":{"en.ahmedali":"And many will be dust-begrimed,","en.ahmedraza":"And many a face will be covered with dust on that day.","en.arberry":"some faces on that day shall be dusty","en.asad":"And some faces will on that Day with dust be covered,","en.daryabadi":"And faces on that Day! upon them shall be gloom.","en.hilali":"And other faces, that Day, will be dust-stained;","en.pickthall":"And other faces, on that day, with dust upon them,","en.qaribullah":"whereas some faces will be covered with dust","en.sahih":"And [other] faces, that Day, will have upon them dust.","en.sarwar":"but others will be gloomy","en.yusufali":"And other faces that Day will be dust-stained,","en.maududi":"Some faces on that Day shall be dust-ridden,","en.shakir":"And (many) faces on that day, on them shall be dust,","en.itani":"And Faces on that Day will be covered with misery.","en.mubarakpuri":"And other faces that Day will be dust-stained.","en.qarai":"and some faces on that day will be covered with dust,","en.wahiduddin":"but some faces will be covered with dust"},"tafsir":{"ar.muyassar":"وجوه أهل النعيم في ذلك اليوم مستنيرة، مسرورة فرحة، ووجوه أهل الجحيم مظلمة مسودَّة، تغشاها ذلَّة. أولئك الموصوفون بهذا الوصف هم الذين كفروا بنعم الله وكذَّبوا بآياته، وتجرؤوا على محارمه بالفجور والطغيان.","ar.jalalayn":"«ووجوه يومئذ عليها غَبَرة» غبار.","ar.qurtubi":"أي غبار ودخان\n","ar.miqbas":"وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ (40) وهذه وجوه أهل الجنة المطمئنين بالاً المكرمين عَرْضاً وحُضوراً .والغَبَرة بفتحتين الغُبار كلَّه ، والمراد هنا أنها معفّرة بالغُبار إهانة ومن أثر الكَبوات .\n","ar.waseet":"أما القسم المقابل لهذا القسم ، فقد عبر عنه - سبحانه - بقوله : ( وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ ) أى : عليها غبار ، من شدة الهم والكرب والعم الذى يعلوها .\n","ar.baghawi":"\"ووجوه يومئذ عليها غبرة\"، سواد وكآبة الهم والحزن.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5798.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5798.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5798.mp3","format":"mp3","local_path":null}}},{"verse":41,"arabic":"تَرْهَقُهَا قَتَرَةٌ","transliteration":"Tarhaquha qatarah.","translations":{"en.ahmedali":"Covered with the blackness (of shame):","en.ahmedraza":"Blackness overcoming them.","en.arberry":"o'erspread with darkness --","en.asad":"with darkness overspread:","en.daryabadi":"Dust shall cover them","en.hilali":"Darkness will cover them,","en.pickthall":"Veiled in darkness,","en.qaribullah":"and veiled with darkness.","en.sahih":"Blackness will cover them.","en.sarwar":"and covered by darkness.","en.yusufali":"Blackness will cover them:","en.maududi":"enveloped by darkness.","en.shakir":"Darkness shall cover them.","en.itani":"Overwhelmed by remorse.","en.mubarakpuri":"Darkness will cover them.","en.qarai":"overcast with gloom.","en.wahiduddin":"and overcast with gloom:"},"tafsir":{"ar.muyassar":"وجوه أهل النعيم في ذلك اليوم مستنيرة، مسرورة فرحة، ووجوه أهل الجحيم مظلمة مسودَّة، تغشاها ذلَّة. أولئك الموصوفون بهذا الوصف هم الذين كفروا بنعم الله وكذَّبوا بآياته، وتجرؤوا على محارمه بالفجور والطغيان.","ar.jalalayn":"«ترهقها» تغشاها «قترة» ظلمة وسواد.","ar.qurtubi":"ووجوه يومئذ عليها غبرة أي غبار ودخان ، ترهقها أي تغشاها قترة أي كسوف وسواد . كذا قال ابن عباس . وعنه أيضا : ذلة وشدة . والقتر في كلام العرب : الغبار ، جمع القترة ، عن أبي عبيد ; وأنشد الفرزدق :متوج برداء الملك يتبعه     موج ترى فوقه الرايات والقتراوفي الخبر : إن البهائم إذا صارت ترابا يوم القيامة حول ذلك التراب في وجوه الكفار . وقال زيد بن أسلم ، القترة : ما ارتفعت إلى السماء ، والغبرة : ما انحطت إلى الأرض ، والغبار والغبرة : واحد .\n","ar.miqbas":"تَرْهَقُهَا قَتَرَةٌ (41) و { ترهقها } تغلب عليها وتعلوها .والقترة : بفتحتين شِبه دخان يغشى الوجه من الكرب والغم ، كذا قال الراغب ، وهو غير الغَبَرة كما تقتضيه الآية لئلا يكون من الإِعادة ، وهي خلاف الأصل ولا داعي إليها . وسوَّى بينهما الجوهري وتبعه ابن منظور وصاحب «القاموس» .وهذه وجوه أهل الكفر ، يعلم ذلك من سياق هذا التنويع ، وقد صرح بذلك بقوله : { أولئك هم الكفرة الفجرة } زيادة في تشهير حالهم الفظيع للسامعين .وجيء باسم الإشارة لزيادة الإِيضاح تشهيراً بالحالة التي سببت لهم ذلك .وضمير الفصل هنا لإفادة التقوي .\n","ar.waseet":"( تَرْهَقُهَا قَتَرَةٌ ) أى : تغشاها وتعلوها ظلمة وسواد ، وذلة وهوان ، من شدة ما أصابها من خزى وخسران . يقال : فلان رهقِه الكرب ، إذا اعتراه وغشيه .\n","ar.baghawi":"\"ترهقها قترة\"، تعلوها وتغشاها ظلمة وكسوف. قال ابن عباس: تغشاها ذلة. قال ابن زيد: الفرق بين الغبرة والقترة: أن القترة ما ارتفع من الغبار فلحق بالسماء، والغبرة ما كان أسفل في الأرض.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5799.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5799.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5799.mp3","format":"mp3","local_path":null}}},{"verse":42,"arabic":"أُولَٰئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ","transliteration":"Ulaa-ika humul-kafa ratul-fajarah.","translations":{"en.ahmedali":"They will be the unbelievers, transgressors.","en.ahmedraza":"It is they, the disbelievers, the sinners.","en.arberry":"those -- they are the unbelievers, the libertines.","en.asad":"these, these will be the ones who denied the truth and were immersed in iniquity!","en.daryabadi":"Those! they are the infidels, the ungodly.","en.hilali":"Such will be the Kafarah (disbelievers in Allah, in His Oneness, and in His Messenger Muhammad (Peace be upon him), etc.), the Fajarah (wicked evil doers).","en.pickthall":"Those are the disbelievers, the wicked.","en.qaribullah":"Those, they are the unbelievers, the immoral.","en.sahih":"Those are the disbelievers, the wicked ones.","en.sarwar":"These will be the faces of the sinful disbelievers.","en.yusufali":"Such will be the Rejecters of Allah, the doers of iniquity.","en.maududi":"These will be the unbelievers, the wicked.","en.shakir":"These are they who are unbelievers, the wicked.","en.itani":"These are the faithless, the vicious.","en.mubarakpuri":"Such will be the disbelieving, the wicked evil doers.","en.qarai":"It is they who are the faithless, the vicious.","en.wahiduddin":"those will be ones who denied the truth and were immersed in iniquity."},"tafsir":{"ar.muyassar":"وجوه أهل النعيم في ذلك اليوم مستنيرة، مسرورة فرحة، ووجوه أهل الجحيم مظلمة مسودَّة، تغشاها ذلَّة. أولئك الموصوفون بهذا الوصف هم الذين كفروا بنعم الله وكذَّبوا بآياته، وتجرؤوا على محارمه بالفجور والطغيان.","ar.jalalayn":"«أولئك» أهل هذه الحال «هم الكفرة الفجرة» أي الجامعون بين الكفر والفجور.","ar.qurtubi":"أولئك هم الكفرة جمع كافر الفجرة جمع فاجر ، وهو الكاذب المفتري على الله تعالى . وقيل : الفاسق ; [ يقال ] : فجر فجورا : أي فسق ، وفجر : أي كذب . وأصله : الميل ، والفاجر : المائل . وقد مضى بيانه والكلام فيه . والحمد لله وحده .\n","ar.miqbas":"أُولَئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ (42)وأتبع وصف { الكفرة } بوصف { الفجرة } مع أن وصف الكُفر أعظم من وصف الفجور لما في معنى الفجور من خساسة العمل فذُكر وصفاهم الدالان على مجموع فساد الاعتقاد وفساد العمل .وذكر وصف { الفجرة } بدون عاطف يفيد أنهم جمعوا بين الكفر والفجور .\n","ar.waseet":"( أولئك ) يعنى أصحاب تلك الوجوه التى يعلوها الغبار والسواد ( هُمُ الكفرة الفجرة ) أى : الجامعون بين الكفر الذى هو فساد الاعتقاد ، وبين الفجور الذى هو فساد القول والفعل .نسأل الله - تعالى - أن يجعلنا جميعا من أصحاب الوجه المسفرة ، الضاحكة المستبشرة .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم . .\n","ar.baghawi":"\"أولئك\"، الذين يصنع بهم هذا، \"هم الكفرة الفجرة\"، جمع الكافر والفاجر.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/5800.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/5800.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/5800.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":137,"letters":1100,"size":"183KB","priority":3,"commonlyRead":false}}