{"chapter":90,"name":{"arabic":"سورة 90","transliteration":"Chapter 90","translation":"Chapter 90","revelation":"unknown"},"revelation":"unknown","verses":20,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ لَا أُقْسِمُ بِهَٰذَا الْبَلَدِ","transliteration":"Laaa uqsimu bihaazal balad","translations":{"en.ahmedali":"I CALL THIS earth to witness --","en.ahmedraza":"I swear by this city (Mecca) –","en.arberry":"No! I swear by this land,","en.asad":"NAY! I call to witness this land –","en.daryabadi":"I swear by yonder city","en.hilali":"I swear by this city (Makkah);","en.pickthall":"Nay, I swear by this city -","en.qaribullah":"No, I swear by this country (Mecca),","en.sahih":"I swear by this city, Makkah -","en.sarwar":"I do not (need to) swear by this town (Mecca)","en.yusufali":"I do call to witness this City;-","en.maududi":"Nay! I swear by this city","en.shakir":"Nay! I swear by this city.","en.itani":"I swear by this land.","en.mubarakpuri":"Nay! I swear by this city;","en.qarai":"I swear by this town,","en.wahiduddin":"I swear by this city --"},"tafsir":{"ar.muyassar":"أقسم الله بهذا البلد الحرام، وهو \"مكة\"، وأنت -أيها النبي- مقيم في هذا \"البلد الحرام\"، وأقسم بوالد البشرية- وهو آدم عليه السلام- وما تناسل منه من ولد، لقد خلقنا الإنسان في شدة وعناء من مكابدة الدنيا.","ar.jalalayn":"«لا» زائدة «أقسم بهذا البلد» مكة.","ar.qurtubi":"سورة البلدمكية باتفاق . وهي عشرون آيةبسم الله الرحمن الرحيملا أقسم بهذا البلديجوز أن تكون لا زائدة ، كما تقدم في لا أقسم بيوم القيامة قاله الأخفش . أي أقسم ; لأنه قال : بهذا البلد وقد أقسم به في قوله : وهذا البلد الأمين فكيف يجحد القسم به وقد أقسم به . قال الشاعر :تذكرت ليلى فاعترتني صبابة وكاد صميم القلب لا يتقطعأي يتقطع ، ودخل حرف ( لا ) صلة ومنه قوله تعالى : ما منعك ألا تسجد إذ أمرتك بدليل قوله تعالى في ( ص ) : ما منعك أن تسجد . وقرأ الحسن والأعمش وابن كثير ( لأقسم ) من غير ألف بعد اللام إثباتا . وأجاز الأخفش أيضا أن تكون بمعنى ( ألا ) . وقيل : ليست بنفي القسم ، وإنما هو كقول العرب : لا والله لا فعلت كذا ، ولا والله ما كان كذا ، ولا والله لأفعلن كذا . وقيل : هي نفي صحيح والمعنى : لا أقسم بهذا البلد إذا لم تكن فيه ، بعد خروجك منه . حكاه مكي . ورواه ابن أبي نجيح عن مجاهد قال : لا رد عليهم . وهذا اختيار ابن العربي ; لأنه قال : وأما من قال إنها رد ، فهو قول ليس له رد ; لأنه [ ص: 54 ] يصح به المعنى ، ويتمكن اللفظ والمراد . فهو رد لكلام من أنكر البعث ثم ابتدأ القسم . وقال القشيري : قوله لا رد لما توهم الإنسان المذكور في هذه السورة ، المغرور بالدنيا . أي ليس الأمر كما يحسبه ، من أنه لن يقدر عليه أحد ، ثم ابتدأ القسم . و ( البلد ) : هي مكة ، أجمعوا عليه . أي أقسم بالبلد الحرام الذي أنت فيه ، لكرامتك علي وحبي لك . وقال الواسطي أي نحلف لك بهذا البلد الذي شرفته بمكانك فيه حيا ، وبركتك ميتا ، يعني المدينة . والأول أصح ; لأن السورة نزلت بمكة باتفاق .\n","ar.miqbas":"لَا أُقْسِمُ بِهَذَا الْبَلَدِ (1) ابتدئت بالقسم تشويقاً لما يرد بعده وأطيلت جملة القسم زيادة في التشويق .و { لا أقسم } معناه : أقسم . وقد تقدم ذلك غير مرة منها ما في سورة الحاقة .وتقدم القول في : هل حرف النفي مزيد أو هو مستعمل في معناه كناية عن تعظيم أمر المقسم به .والإِشارة ب«هذا» مع بيانه بالبلد ، إشارة إلى حاضر في أذهان السامعين كأنهم يرونه لأن رؤيته متكررة لهم وهو بلد مكة ، ومثله ما في قوله : { إنما أُمرت أن أعبد ربَّ هذه البلدة } [ النمل : 91 ] . وفائدة الإِتيان باسم الإِشارة تمييز المقسم به أكْمَلَ تمييز لقصد التنويه به .والبلد : جانب من متسع من أرض عامرةً كانتْ كما هو الشائع أم غامرة كقول رؤبة بن العجاج: ... بلْ بَلَدٍ ملءُ الفجاج قَتمُهوأطلق هنا على جانب من الأرض مجعولة فيه بيوت من بناء وهو بلدة مكة والقسم بالبلدة مع أنها لا تدل على صفة من صفات الذات الإلهية ولا من صفات أفعاله كنايةٌ عن تعظيم الله تعالى إياه وتفضيله . \"\n","ar.waseet":"افتتحت السورة الكريمة بالقسم ، تشويقا لما يرد بعده ، وتأكيدا للمقسم عليه .و \" لا \" فى مثل هذا التركيب ، يرى المحققون أنها مزيدة للتأكيد ، والمعنى : أقسم بهذا البلد . أى : مكة المكرمة ، وقد جاء القسم بها فى قوله - تعالى - : ( والتين والزيتون . وَطُورِ سِينِينَ . وهذا البلد الأمين ) قال الشيخ محمد عبده - رحمه الله - : قوله : ( لاَ أُقْسِمُ . . ) عبارة من عبارات العرب فى القسم ، يراد بها تأكيد الخبر ، كأنه فى ثبوته وظهوره لا يحتاج إلى قسم . ويقال إنه يؤتى بها فى القسم إذا أريد تعظيم المقسم به . كأن القائل يقول : إنى لا أعظمه بالقسم ، لأنه عظيم فى نفسه ، والمعنى فى كل حال على القسم . .وقال بعض العلماء : \" لا \" هذه للنفى ، وهذه عبارة تعود العرب أن يقولوها عندما يكون المقسم عليه ظاهر أمره ، كأنه - تعالى - يقول : أنا لا أقسم بهذه الأشياء ، على إثبات هذا المطلوب الذى أذكره بعد ، لأن إثباته أظهر وأجلى وأقوى من أن يحاول محاول إثباته بالقسم .ويقال : معناه : أنا لا أقسم بهذه الأشياء على إثبات المطلوب ، لأنه أعظم وأجل وأكبر من أن يقسم عليه ، بهذه الأمور الهينة الشأن ، والغرض على هذا الوجه ، تعظيم المقسم عليه ، وتفخيم شأنه . .والإِشارة بلفظ \" هذا \" مع بيانه بالبلد ، إشارة إلى حاضر فى أذهان السامعين ، لأن مكة بعضهم كان يعيش فيها . وبعضهم كان يعرفها معرفة لاخفاء معها ، وشبيه بذلك قوله - تعالى - : ( إِنَّمَآ أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَذِهِ البلدة الذي حَرَّمَهَا وَلَهُ كُلُّ شَيءٍ ) وفائدة الإِتييان باسم الإِشارة هنا : تميييز المقسم به أكمل تمييز لقصد التنيويه به .\n","ar.baghawi":"مكية\"لا أقسم\"، يعني أقسم، \"بهذا البلد\"، يعني مكة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6024.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6024.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6024.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"وَأَنْتَ حِلٌّ بِهَٰذَا الْبَلَدِ","transliteration":"Wa anta hillum bihaazal balad","translations":{"en.ahmedali":"And you are free to live upon it, --","en.ahmedraza":"For you (O dear Prophet Mohammed – peace and blessings be upon him) are in this city.","en.arberry":"and thou art a lodger in this land;","en.asad":"this land in which thou art free to dwell -","en.daryabadi":"And thou shalt be allowed in yonder city -","en.hilali":"And you are free (from sin, to punish the enemies of Islam on the Day of the conquest) in this city (Makkah).","en.pickthall":"And thou art an indweller of this city -","en.qaribullah":"and you are a lodger in this country.","en.sahih":"And you, [O Muhammad], are free of restriction in this city -","en.sarwar":"in which you are now living","en.yusufali":"And thou art a freeman of this City;-","en.maududi":"– this city wherein you have been rendered violable–","en.shakir":"And you shall be made free from obligation in this city--","en.itani":"And you are a resident of this land.","en.mubarakpuri":"And you are free in this city.","en.qarai":"as you reside in this town;","en.wahiduddin":"and you are dwelling in this city --"},"tafsir":{"ar.muyassar":"أقسم الله بهذا البلد الحرام، وهو \"مكة\"، وأنت -أيها النبي- مقيم في هذا \"البلد الحرام\"، وأقسم بوالد البشرية- وهو آدم عليه السلام- وما تناسل منه من ولد، لقد خلقنا الإنسان في شدة وعناء من مكابدة الدنيا.","ar.jalalayn":"«وأنت» يا محمد «حِلٌ» حلال «بهذا البلد» بأن يحل لك فتقاتل فيه، وقد أنجز الله له هذا الوعد يوم الفتح، فالجملة اعتراض بين المقسم به وما عطف عليه.","ar.qurtubi":"قوله تعالى : وأنت حل بهذا البلديعني في المستقبل مثل قوله تعالى : إنك ميت وإنهم ميتون . ومثله واسع في كلام العرب . تقول لمن تعده الإكرام والحباء : أنت مكرم محبو . وهو في كلام الله واسع ; لأن الأحوال المستقبلة عنده كالحاضرة المشاهدة وكفاك دليلا قاطعا على أنه للاستقبال ، وأن تفسيره بالحال محال : أن السورة باتفاق مكية قبل الفتح . فروى منصور عن مجاهد : وأنت حل قال : ما صنعت فيه من شيء فأنت في حل . وكذا قال ابن عباس : أحل له يوم دخل مكة أن يقتل من شاء ، فقتل ابن خطل ومقيس بن صبابة وغيرهما . ولم يحل لأحد من الناس أن يقتل بها أحدا بعد رسول الله - صلى الله عليه وسلم - وروى السدي قال : أنت في حل ممن قاتلك أن تقتله . وروى أبو صالح عن ابن عباس قال : أحلت له ساعة من نهار ، ثم أطبقت وحرمت إلى يوم القيامة ، وذلك يوم فتح مكة . وثبت عن النبي - صلى الله عليه وسلم - أنه قال : \" إن الله حرم مكة يوم خلق السماوات والأرض ، فهي حرام إلى أن تقوم الساعة ، فلم تحل لأحد قبلي ، ولا تحل لأحد بعدي ، ولم تحل لي إلا ساعة من نهار \" الحديث . وقد تقدم في سورة ( المائدة ) .ابن زيد : لم يكن بها أحد حلالا غير النبي - صلى الله عليه وسلم - : وقيل : وأنت مقيم فيه وهو محلك . وقيل : وأنت فيه محسن ، وأنا عنك فيه راض . وذكر أهل اللغة أنه يقال : رجل حل وحلال ومحل ، ورجل حرام ومحل ، ورجل حرام ومحرم . وقال قتادة : أنت حل به : لست بآثم . وقيل : هو ثناء على النبي - صلى الله عليه وسلم - أي إنك غير مرتكب في هذا البلد ما يحرم عليك ارتكابه ، معرفة منك بحق هذا البيت لا كالمشركين الذين يرتكبون الكفر بالله فيه . أي أقسم بهذا البيت المعظم الذي قد عرفت حرمته ، فأنت مقيم فيه معظم له ، غير مرتكب فيه ما يحرم عليك .وقال شرحبيل بن سعد : [ ص: 55 ] وأنت حل بهذا البلد أي حلال أي هم يحرمون مكة أن يقتلوا بها صيدا أو يعضدوا بها شجرة ، ثم هم مع هذا يستحلون إخراجك وقتلك .\n","ar.miqbas":"وَأَنْتَ حِلٌّ بِهَذَا الْبَلَدِ (2) وجملة : { وأنت حل بهذا البلد } معترضة بين المتعاطفات المقسم بها والواو اعتراضية . والمقصود من الاعتراض يختلف باختلاف محمل معنى { وأنت حل } فيجوز أن يكون { حل } اسم مصدرِ أحَلّ ، أي أباح ، فالمعنى وقد جعلَك أهلُ مكة حلالاً بهذا البلد الذي يحرم أذى صيده وعَضْدُ شجره ، وهم مع ذلك يُحلون قتلك وإخراجَك ، قال هذا شُرَحْبيل بن سعد فيكون المقصود من هذا الاعتراض التعجيب من مضمون الجملة وعليه فالإِخبار عن ذات الرسول صلى الله عليه وسلم بوصف { حِلّ } يقدر فيه مضاف يعيِّنه ما يصلح للمقام ، أي وأنت حلال منك ما حُرِّم من حقِّ ساكن هذا البلد من الحُرمة والأمن . والمعنى التعريض بالمشركين في عدوانهم وظلمهم الرسول صلى الله عليه وسلم في بلد لا يظلمون فيه أحداً . والمناسبة ابتداء القسم بمكة الذي هو إشعار بحرمتها المقتضية حرمة من يحل بها ، أي فهم يحرِّمون أن يتعرضوا بأذى للدواب ، ويعتدون على رسول جاءهم برسالة من الله .ويجوز أن يكون { حِل } اسماً مشتقاً من الحِلّ وهو ضد المنع ، أي الذي لا تَبعة عليه فيما يفعله . قال مجاهد والسدي ، أي ما صنعت فيه من شيء فأنت في حلّ أو أنت في حِل مِمن قَاتلك أن تقاتله . وقريب منه عن ابن عباس ، أي مهما تمكنتَ من ذلك . فيصدق بالحال والاستقبال . وقال في «الكشاف» : «يعني وأنت حل به في المستقبل ونظيره في الاستقبال قوله عز وجل : { إنك ميت وإنهم ميتون } [ الزمر : 30 ] ، تقول لمن تَعِدُه بالإِكرام والحباء أنت مكرم محبُوّاً اه .فهذا الاعتراض تسلية للرسول صلى الله عليه وسلم قُدمت له قبل ذكر إعراض المشركين عن الإِسلام ، ووعد بأنه سيمكنه منهم .وعلى كلا الوجهين في محمل صفة { حِل } هو خصوصية للنبيء صلى الله عليه وسلم وقد خصصه النبي صلى الله عليه وسلم بيوم الفتح فقال : \" وإنما أحلت لي ساعة من نهار \" الحديث ، وفي «الموطإ» : «قال مالك : ولم يكن رسول الله صلى الله عليه وسلم يومئذ ( أي يوم الفتح ) مُحْرِماً» .ويُثار من هذه الآية على اختلاف المحامل النظرُ في جواز دخول مكة بغير إحرام لغير مريد الحج أو العمرة . قال الباجي في «المنتقى» وابنُ العربي في «الأحكام» : الداخل مكة غيرَ مريد النسك ، لحاجة تتكرر كالحَطّابينَ وأصحاب الفواكهِ والمعاش هؤلاء يجوز دخولهم غيرَ محرمين لأنهم لو كلفوا الإِحرام لَحِقتهم مشقة . وإن كان دخولها لحاجة لا تتكرر فالمشهور عن مالك : أنه لا بد من الإِحرام ، وروي عنه تركُه والصحيح وجوبه ، فإن تركه قال الباجي : فالظاهر من المذهب أنه لا شيء عليه وقد أساء ولم يُفصِّل أهل المذهب بين من كان من أهل داخل الميقاتتِ أو مِن خارجه .والخلاف في ذلك أيضاً بين فقهاء الأمصار فذهب أبو حنيفة أن من كان من أهل داخل المواقيت يجوز له دخول مكة بغير إحرام إن لم يُرِد نسكاً من حج أو عمرة ، وأما من كان مِن أهل خارج المواقيت فالواجب عليه الإِحرام لدخول مكة دون تفصيل بين الاحتياج إلى تكرر الدخول أو عدم الاحتياج . وذهب الشافعي إلى سقوط الإِحرام عن غير قاصد النسك ، ومذهب أحمد موافق مذهب مالك .وحكى ابن عطية عن بعض المتأولين : أن معنى { وأنت حل بهذا البلد } أنه حَال ، أي ساكن بهذا البلد اه . وجعله ابن العربي قولاً ولم يَعزُه إلى قائل ، وحكاه القرطبي والبيضاوي كذلك وهو يقتضي أن تكون جملة { وأنت حلّ } في موضع الحال من ضمير { أقسم } فيكون القسم بالبلد مقيداً باعتبار كونه بلَد محمد صلى الله عليه وسلم وهو تأويل جميل لو ساعد عليه ثبوت استعمال { حِلّ } بمعنى : حَالّ ، أي مقيم في مكاننٍ فإن هذا لم يرد في كتب اللغة : «الصَحاحِ» و«اللسانِ» و«القاموسِ» و«مفرداتتِ الراغب» . ولم يعرج عليه صاحب «الكشاف» ، ولا أحسب إعراضه عنه إلا لعدم ثقته بصحة استعماله ، وقال الخفاجِي : والحِلّ : صفة أو مصدر بمعنى الحَال هنا على هذا الوجه ولا عبرة بمن أنكره لِعدم ثبوته في كتب اللغة» اه وكيف يقال : لا عبرة بعدم ثبوته في كتب اللغة ، وهل المَرجع في إثبات اللغة إلاّ كتب أيمتها .وتكرير لفظ { بهذا البلد } إظهار في مقام الإِضمار لقصد تجديد التعجيب . ولقصد تأكيد فتح ذلك البلد العزيز عليه والشديد على المشركين أن يَخْرُج عن حوزتهم .\n","ar.waseet":"وجملة : ( وَأَنتَ حِلٌّ بهذا البلد ) معترضة بين القسم وجوابه .وقوله - تعالى - ( حل ) اسم مصدر أحل بمعنى أباح ، فيكون المعنى : وأنت - أيها الرسول الكريم - قد استحل كفار مكة إيذاءك ومحاربتك . . مع أنهم يحرمون ذلك النسبة لغيرك ، فى هذا البلد الأمين .ويصح أن يكون لفظ \" حل \" هنا بمعنى اللحال الذى هو ضد الحرام يقال : هو حل وحلال ، وحِرْمٌ وحرام . . فيكون المعنى : وأنت أيها الرسول الكريم - قد أحل الله - تعالى - لك أن تفعل بهؤلاء المشركين ما شئت من القتل أو العفو .وتكون الجملة الكريمة ، بشارة للنبى صلى الله عليه وسلم بأن الله - تعالى - سينصره على مشركى قريش ، ويمكنه من رقابهم . . وقد أنجز له - سبحانه - ذلك يوم الفتح الأكبر .قال صاحب الكشاف : أقسم الله - تعالى - بالبلد الحرام وما بعده ، على أن الإِنسان خلق مغمورا فى مكابدة المشاق والشدائد ، واعترض بين القسم والمقسم عليه بقوله : ( وَأَنتَ حِلٌّ بهذا البلد ) يعنى : زمن المكابدة أن مثلك - يا محمد - على عظم حرمتك ، يُسْتَحلُّ بهذا البلد الحرام ، كما يستحل الصيد فى غير الحرم .وفيه تثبيت لرسول الله صلى الله عليه وسلم وبعث على احتمال ما كان يكابد من أهل مكة ، وتعجيب من حالهم فى عداوته .أو سلى صلى الله عليه وسلم بالقسم ببلده ، على أن الإِنسان لا يخلو من مقاساة الشدائد ، واعترض بأن وعده فتح مكة تتميما للتسلية والتنفيس عليه فقال : ( وَأَنتَ حِلٌّ بهذا البلد ) .يعنى : وأنت حل به فى المستقبل ، تصنع فيه ما تريد من القتل والأسر .فإن قلت : أين نظير قوله : ( وَأَنتَ حِلٌّ ) فى معنى الاستقبال؟ قلت : قوله - تعالى - ( إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَّيِّتُونَ ) وكفاك دليلا قاطعا على أنه للاستقبال ، وأن تفسيره بالحال محال ، أن السورة بالاتفاق مكية ، وأين الهجرة من وقت نزولها؟ فما بال الفتح؟ويرى بعضهم أن معنى قوله - تعالى - : ( وَأَنتَ حِلٌّ بهذا البلد ) : وأنت مقيم بهذا البلد ، ونازل فيه ، وحالّ به ، وكفى فخراً لمكة أن تنزل فيها - أيها الرسول الكريم - فإن الأمكنة الشريفة تزداد شرفا بنزول رسل الله - تعالى - فيها ، فكيف وأنت خاتمهم وإمامهم؟قال بعض العلماء : وحكى ابن عطية عن بعض المتأولين : أن معنى ( وَأَنتَ حِلٌّ بهذا البلد ) وأنت ساكن بهذا البلد ، حال فيه . . وهو يقتضى أن تكون هذه الآية موضع الحال من ضمير \" أقسم \" فيكون القسم بالبلد مقيدا باعتبار بلد محمد صلى الله عليه وسلم وهو تأويل جميل ، لو ساعد عليه ثبوت استعمال \" حل \" بمعنى حالٍّ ، أى : مقيم فى مكان ، فإن هذا لم يرد فى كتب اللغة . . ولذا لم يذكر هذا المعنى صاحب الكشاف . .ويبدو لنا أن هذه الأقوال لا تعارض بينها ، بل يؤيد بعضها بعضا ، لأن الرسول صلى الله عليه وسلم قد آذاه أهل مكة ، بينما حرموا إيذاء غيره ، وأن الله - تعالى - قد مكن رسوله صلى الله عليه وسلم منهم . كما حدث فى غزوة الفتح ، وأنه صلى الله عليه وسلم قد أقام معهم فى مكة أكثر من خمسين سنة ، وكان يلقب عندهم بالصادق الأمين . .\n","ar.baghawi":"( وأنت حل ) أي حلال ، ( بهذا البلد ) تصنع فيه ما تريد من القتل والأسر ليس عليك ما على الناس فيه من الإثم . أحل الله تعالى لنبيه - صلى الله عليه وسلم - مكة يوم الفتح ، حتى قاتل وقتل وأمر بقتل ابن خطل ، وهو متعلق بأستار الكعبة ، ومقيس بن صبابة وغيرهما ، فأحل دماء قوم وحرم دماء قوم فقال : من دخل دار أبي سفيان فهو آمن ، ثم قال : إن الله حرم مكة يوم خلق السموات والأرض ، ولم تحل لأحد قبلي ولا تحل لأحد بعدي ، وإنما أحلت لي ساعة من نهار ، فهي حرام بحرمة الله إلى يوم القيامة .والمعنى : أن الله تعالى لما أقسم بمكة دل ذلك على عظيم قدرها مع حرمتها ، فوعد نبيه - صلى الله عليه وسلم - أنه يحلها له حتى يقاتل فيها ، وأن يفتحها على يده ، فهذا وعد من الله - عز وجل - بأن يحلها له .قال شرحبيل بن سعد : ومعنى قوله : \" وأنت حل بهذا البلد \" قال : يحرمون أن يقتلوا بها صيدا ويستحلون إخراجك وقتلك ؟\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6025.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6025.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6025.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"وَوَالِدٍ وَمَا وَلَدَ","transliteration":"Wa waalidinw wa maa walad","translations":{"en.ahmedali":"And the parent and the offspring,","en.ahmedraza":"And by oath of your forefather Ibrahim, and by you – his illustrious son!","en.arberry":"by the begetter, and that he begot,","en.asad":"and [I call to witness] parent and offspring:","en.daryabadi":"And by the begetter and that which he begat,","en.hilali":"And by the begetter (i.e. Adam) and that which he begot (i.e. his progeny);","en.pickthall":"And the begetter and that which he begat,","en.qaribullah":"And by the giver of birth, and whom he fathered,","en.sahih":"And [by] the father and that which was born [of him],","en.sarwar":"or by the great father and his wonderful son (Abraham and Ishmael)","en.yusufali":"And (the mystic ties of) parent and child;-","en.maududi":"and I swear by the parent and his offspring:","en.shakir":"And the begetter and whom he begot.","en.itani":"And by a father and what he fathered.","en.mubarakpuri":"And by the begetter and that which he begot.","en.qarai":"[and] by the father and him whom he begot:","en.wahiduddin":"and by parent and offspring,"},"tafsir":{"ar.muyassar":"أقسم الله بهذا البلد الحرام، وهو \"مكة\"، وأنت -أيها النبي- مقيم في هذا \"البلد الحرام\"، وأقسم بوالد البشرية- وهو آدم عليه السلام- وما تناسل منه من ولد، لقد خلقنا الإنسان في شدة وعناء من مكابدة الدنيا.","ar.jalalayn":"«ووالد» أي آدم «وما ولد» أي ذريته وما بمعنى من.","ar.qurtubi":"قوله تعالى : ووالد وما ولدقال مجاهد وقتادة والضحاك والحسن وأبو صالح : ووالد آدم : - عليه السلام - . وما ولد أي وما نسل من ولده . أقسم بهم ; لأنهم أعجب ما خلق الله تعالى على وجه الأرض لما فيهم من البيان والنطق والتدبير ، وفيهم الأنبياء والدعاة إلى الله تعالى . وقيل : هو إقسام بآدم والصالحين من ذريته ، وأما غير الصالحين فكأنهم بهائم . وقيل : الوالد إبراهيم . وما ولد : ذريته قال أبو عمران الجوني . ثم يحتمل أنه يريد جميع ذريته . ويحتمل أنه يريد المسلمين من ذريته . قال الفراء : وصلحت ما للناس كقوله : ما طاب لكم وكقوله : وما خلق الذكر والأنثى وهو الخالق للذكر والأنثى ، وقيل : ما مع ما بعدها في موضع المصدر أي ووالد وولادته كقوله تعالى : والسماء وما بناها . وقال عكرمة وسعيد بن جبير : ووالد : يعني الذي يولد له ، وما ولد : يعني العاقر الذي لا يولد له وقاله ابن عباس . وما على هذا نفي . وهو بعيد ولا يصح إلا بإضمار الموصول أي ووالد والذي ما ولد ، وذلك لا يجوز عند البصريين . وقيل : هو عموم في كل والد وكل مولود قاله عطية العوفي . وروي معناه عن ابن عباس أيضا . وهو اختيار الطبري . قال الماوردي : ويحتمل أن الوالد النبي - صلى الله عليه وسلم - لتقدم ذكره ، وما ولد أمته : لقوله - عليه السلام - : \"إنما أنا لكم بمنزلة الوالد أعلمكم \" . فأقسم به وبأمته بعد أن أقسم ببلده مبالغة في تشريفه - عليه السلام - .\n","ar.miqbas":"وَوَالِدٍ وَمَا وَلَدَ (3) و { والد } وقع منكراً فهو تنكيرَ تعظيم إذ لا يحتمل غير ذلك في سياق القسم . فتعين أن يكون المرادَ والداً عظيماً ، والراجح عمل والد على المعنى الحقيقي بقرينة قوله { وما ولد } .والذي يناسب القسم بهذا البلد أن يكون المراد ب { والد } إبراهيمَ عليه السلام فإنه الذي اتخذ ذلك البلد لإقامة ولده إسماعيل وزوجه هاجَر قال تعالى : { وإذ قال إبراهيم رب اجعل هذا البلد آمناً واجنبني وبني أن نعبد الأصنام } [ إبراهيم : 35 ] ثم قال : { ربنا أني أسكنت من ذريتي بواد غير ذي زرع عند بيتك المحرم } [ إبراهيم : 37 ] . وإبراهيم والد سُكان ذلك البلد الأصليين قال تعالى : { ملة أبيكم إبراهيم } [ الحج : 78 ] ، ولأنه والد محمد صلى الله عليه وسلمو { ما وَلد } موصول وصلة والضمير المستتر في { ولد } عائد إلى { والد } . والمقصود : وما ولده إبراهيم من الأبناء والذرية . وذلك مخصوص بالذين اقتفوا هديه فيشمل محمداً صلى الله عليه وسلموفي هذا تعريض بالتنبيه للمشركين من ذرية إبراهيم بأنهم حادُوا عن طريقة أبيهم من التوحيد والصلاح والدعوة إلى الحق وعِمارَةِ المسجد الحرام قال تعالى : { إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي والذين آمنوا } [ آل عمران : 68 ] .وجيء باسم الموصول { مَا } في قوله : { وما ولد } دون ( مَن ) مع أن ( مَن ) أكثرُ استعمالاً في إرادة العاقل وهو مراد هنا ، فعُدل عن ( مَن ) لأن { ما } أشدُّ إبهاماً ، فأريد تفخيم أصحاب هذه الصلة فجيء لهم بالموصول الشديد الإِبهام لإرادة التفخيم ، ونظيره قوله تعالى : { واللَّه أعلم بما وضعت } [ آل عمران : 36 ] يعني مولوداً عجيبَ الشأن . ويوضِّح هذا أن { ما } تستعمل نَكرة تامة باتفاق ، و ( مَن ) لا تستعمل نكرة تامة إلا عند الفارسي .ولان قوة الإِبهام في { ما } أنسب بإرادة الجماعة دون واحِدٍ معين ، ألا ترى إلى قول الحَكَم الأصم الفَزاري: ... اللُّؤْم أكرم من وَبْرٍ ووالدهِواللؤْمُ أكرمُ من وَبْر ومَا ولَدَا ... يريد ومِن أولاده لا ولداً معيّناً .وجملة : { لقد خلقنا الإنسان في كبد } جواب القسم وهو الغرض من السورة .والإِنسان يجوز أن يراد به الجنس وهو الأظهر وقولُ جمهور المفسرين ، فالتعريف فيه تعريف الجنس ، ويكون المراد به خصوص أهل الشرك لأن قوله : { أيحسب أن لن يقدر عليه أحد } [ البلد : 5 ] إلى آخر الآيات لا يليق إلا بأحوال غير المؤمنين ، فالعموم عموم عرفي ، أي الإنسان في عُرف الناس يومئذ ، ولم يكن المسلمون إلا نفراً قليلاً ولذلك كثر في القرآن إطلاق الإِنسان مراداً به الكافرون من الناس .ويجوز أن يراد به إنسان معيّن ، فالتعريف تعريف العهد ، فعن الكلبي أنه أبو الأشدّ ويقال : أبو الأشَدّيْن واسمه أُسَيْد بن كَلْدَةَ الجُمَحِي كان معروفاً بالقوّة والشدة يجعل الأديم العُكَاظي تحت قدميه فيقول : من أزالني فله كذا . فيجذبه عشرةُ رجال حتى يمزَّق الأديم ولا تزول قدماه ، وكان شديد الكفر والعداوة للنبيء صلى الله عليه وسلم فنزل فيه : { أيحسب أن لن يقدر عليه أحد } [ البلد : 5 ] وقيل : هو الوليد بن المغيرة ، وقيل : هو أبو جهل . وعن مقاتل : نزلت في الحارث بن عامر بن نوفل ، زعم أنه أنفق مالاً على إفساد أمر النبي صلى الله عليه وسلم وقيل : هو عمرو بن عبد ودّ الذي اقتحم الخندق في يوم الأحزاب ليدخل المدينة فقتله علي بن أبي طالب خلْف الخندق .وليس لهذه الأقوال شاهد من النقل الصحيح ولا يلائمها القَسَم ولا السياق .\n","ar.waseet":"وقوله - سبحانه - : ( وَوَالِدٍ وَمَا وَلَدَ ) معطوف على المقسم به الأول وهو قوله - تعالى - : ( بهذا البلد ) . وداخل فى حيز القسم . والمراد بالوالد آدم - عليه السلام - ، والمراد بما ولد : ذريته من بعده .أى : أقسم بهذا البلد الذى له ماله من الشرف ، والمكانة السامية بين البلاد . . وأقسم بأبيكم آدم ، وبذريته من بعده . . أو أقسم بكل والد وبكل مولود .وجئ باسم الموصول \" ما \" فى قوله ( وَمَا وَلَدَ ) دون \" من \" مع أنها أكثر استعمالا فى العاقل الذى هو مراد هنا ، لأن \" ما \" أشد إبهاما ، وشدة الإِبهام المقصود بها هنا التفخيم والتعظيم .. وشبيه بذلك قوله - تعالى - : ( فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ إِنِّي وَضَعْتُهَآ أنثى والله أَعْلَمُ بِمَا وَضَعَتْ . . . ) كما أن تنكير لفظ \" والد \" هنا للتعظيم أيضا .وقيل المراد بالوالد هنا : إبراهيم - عليه السلام - وبما ولد : الصالحون من ذريته .وقيل المراد بالوالد : من يولد له ، وبقوله ( وَمَا وَلَدَ ) الذى لم يولد له وعليه تكون ما نافية .وقد رجح الإِمام ابن جرير المعنى الأول فقال : والصواب من القول من ذلك ، ما قاله الذين قالوا : إن الله - تعالى - أقسم بكل والد وولده ، لأن الله - تعالى - عم كل والد وما ولد ، وغير جائز أن يخص ذلك إلا بحجة يجب التسليم لها من خبر أو عقل . ولا خبر بخصوص ذلك ولا برهان يجب التسليم له بخصوصه ، فهو على عمومه . .\n","ar.baghawi":"\"ووالد وما ولد\"، يعني آدم عليه السلام وذريته.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6026.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6026.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6026.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي كَبَدٍ","transliteration":"Laqad khalaqnal insaana fee kabad","translations":{"en.ahmedali":"That We created man in toil and trouble.","en.ahmedraza":"We have indeed created man surrounded by hardships.","en.arberry":"indeed, We created man in trouble.","en.asad":"Verily, We have created man into [a life of] pain, toil and trial.","en.daryabadi":"Assuredly We have created man in trouble.","en.hilali":"Verily, We have created man in toil.","en.pickthall":"We verily have created man in an atmosphere:","en.qaribullah":"We created the human in fatigue.","en.sahih":"We have certainly created man into hardship.","en.sarwar":"that We have created the human being to face a great deal of hardship.","en.yusufali":"Verily We have created man into toil and struggle.","en.maududi":"Verily We have created man into toil and hardship.","en.shakir":"Certainly We have created man to be in distress.","en.itani":"We created man in distress.","en.mubarakpuri":"Verily, We have created man in Kabad.","en.qarai":"certainly We created man in travail.","en.wahiduddin":"that We have created man into a life of toil and trial."},"tafsir":{"ar.muyassar":"أقسم الله بهذا البلد الحرام، وهو \"مكة\"، وأنت -أيها النبي- مقيم في هذا \"البلد الحرام\"، وأقسم بوالد البشرية- وهو آدم عليه السلام- وما تناسل منه من ولد، لقد خلقنا الإنسان في شدة وعناء من مكابدة الدنيا.","ar.jalalayn":"«لقد خلقنا الإنسان» أي الجنس «في كبد» نصب وشدة يكابد مصائب الدنيا وشدائد الآخرة.","ar.qurtubi":"قوله تعالى : لقد خلقنا الإنسان في كبدإلى هنا انتهى القسم وهذا جوابه . ولله أن يقسم بما يشاء من مخلوقاته لتعظيمها ، كما تقدم . والإنسان هنا ابن آدم . في كبد أي في شدة وعناء من مكابدة الدنيا . وأصل الكبد [ ص: 56 ] الشدة . ومنه تكبد اللبن : غلظ وخثر واشتد . ومنه الكبد ; لأنه دم تغلظ واشتد . ويقال : كابدت هذا الأمر : قاسيت شدته : قال لبيد :يا عين هلا بكيت أربد إذ قمنا وقام الخصوم في كبدقال ابن عباس والحسن : في كبد أي في شدة ونصب . وعن ابن عباس أيضا : في شدة من حمله وولادته ورضاعه ونبت أسنانه ، وغير ذلك من أحواله . وروى عكرمة عنه قال : منتصبا في بطن أمه . والكبد : الاستواء والاستقامة . فهذا امتنان عليه في الخلقة . ولم يخلق الله - جل ثناؤه - دابة في بطن أمها إلا منكبة على وجهها إلا ابن آدم ، فإنه منتصب انتصابا وهو قول النخعي ومجاهد وغيرهما . ابن كيسان : منتصبا رأسه في بطن أمه فإذا أذن الله أن يخرج من بطن أمه قلب رأسه إلى رجلي أمه .وقال الحسن : يكابد مصائب الدنيا وشدائد الآخرة . وعنه أيضا : يكابد الشكر على السراء ويكابد الصبر على الضراء ; لأنه لا يخلو من أحدهما . ورواه ابن عمر . وقال يمان : لم يخلق الله خلقا يكابد ما يكابد ابن آدم وهو مع ذلك أضعف الخلق . قال علماؤنا : أول ما يكابد قطع سرته ، ثم إذا قمط قماطا ، وشد رباطا ، يكابد الضيق والتعب ، ثم يكابد الارتضاع ، ولو فاته لضاع ، ثم يكابد نبت أسنانه ، وتحرك لسانه ، ثم يكابد الفطام ، الذي هو أشد من اللطام ، ثم يكابد الختان ، والأوجاع والأحزان ، ثم يكابد المعلم وصولته ، والمؤدب وسياسته ، والأستاذ وهيبته ، ثم يكابد شغل التزويج والتعجيل فيه ، ثم يكابد شغل الأولاد ، والخدم والأجناد ، ثم يكابد شغل الدور ، وبناء القصور ، ثم الكبر والهرم ، وضعف الركبة والقدم ، في مصائب يكثر تعدادها ، ونوائب يطول إيرادها ، من صداع الرأس ، ووجع الأضراس ، ورمد العين ، وغم الدين ، ووجع السن ، وألم الأذن . ويكابد محنا في المال والنفس ، مثل الضرب والحبس ، ولا يمضي عليه يوم إلا يقاسي فيه شدة ، ولا يكابد إلا مشقة ، ثم الموت بعد ذلك كله ، ثم مساءلة الملك ، وضغطة القبر وظلمته ثم البعث والعرض على الله ، إلى أن يستقر به القرار ، إما في الجنة وإما في النار قال الله تعالى : لقد خلقنا الإنسان في كبد ، فلو كان الأمر إليه لما اختار هذه الشدائد . ودل هذا على أن له خالقا دبره ، وقضى عليه بهذه الأحوال فليمتثل أمره . وقال ابن زيد : الإنسان هنا آدم . وقوله : في كبد أي في وسط السماء . وقال الكلبي : إن هذا نزل في رجل من بني جمح كان يقال له أبو الأشدين ، وكان يأخذ الأديم العكاظي فيجعله تحت قدميه ، فيقول : من أزالني عنه فله كذا . فيجذبه عشرة حتى يتمزق ولا تزول قدماه وكان من أعداء النبي - صلى الله عليه وسلم - وفيه نزل أيحسب أن لن يقدر عليه أحد يعني : لقوته . وروي عن ابن عباس . في كبد أي شديدا ، يعني شديد الخلق وكان من أشد رجال قريش . وكذلك ركانة بن هشام بن عبد المطلب ، وكان مثلا في البأس [ ص: 57 ] والشدة . وقيل : في كبد أي جريء القلب ، غليظ الكبد ، مع ضعف خلقته ، ومهانة مادته . ابن عطاء : في ظلمة وجهل . الترمذي : مضيعا ما يعنيه ، مشتغلا بما لا يعنيه .\n","ar.miqbas":"لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي كَبَدٍ (4)والخلق : إيجاد ما لم يكن موجوداً ، ويطلق على إيجاد حالة لها أثر قويّ في الذات كقوله تعالى : { يخلقكم في بطون أمهاتكم خلقاً من بعد خلق } [ الزمر : 6 ] وقوله : { وإذ تخلق من الطين كهيئة الطير } [ المائدة : 110 ] . فهو جعل يغير ذات الشيء .والكَبَد بفتحتين : التعب والشدة ، وقد تعددت أقوال المفسرين في تقرير المراد بالكَبَد ، ولم يعرج واحد منهم على ربط المناسبة بين ما يفسِّر به الكَبَد وبين السياق المسوق له الكلام وافتتاحِه بالقسم المشعر بالتأكيد وتوقع الإنكار ، حتى كأنَّهم بصدد تفسير كلمة مفردة ليست واقعة في كلام يجب التِئامُه ، ويَحِق وِءَامُه .وقد غضُّوا النظر عن موقع فِعل { خلقنا } على تفسيرهم الكبد إذ يكون فعل { خلقنا } كمعذرة للإِنسان الكافر في ملازمة الكَبد له إذ هو مخلوق فيه . وذلك يحط من شدة التوبيخ والذم ، فالذي يلتئم مع السياق ويناسب القسم أن الكبد التعب الذي يلازم أصحاب الشرك من اعتقادهم تعدد الآلهة . واضطرابُ رأيهم في الجمع بين ادعاء الشركاء لله تعالى وبين توجّههم إلى الله بطلب الرزق وبطلب النجاة إذا أصابهم ضر . ومن إحالتهم البعث بعد الموت مع اعترافهم بالخلق الأول فقوله : { لقد خلقنا الإنسان في كبد } دليل مقصوداً وحده بل هو توطئة لقوله : { أيحسب أن لن يقدر عليه أحد } [ البلد : 5 ] . والمقصود إثبات إعادة خلق الإِنسان بعد الموت للبعثثِ والجزاء الذي أنكروه وابتدأهم القرآن بإثباته في سُور كثيرة من السور الأولى .فوزان هذا التمهيد وزان التمهيد بقوله : { لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين } [ التين : 4 ، 5 ] بعد القسم بقوله : { التين والزيتون } [ التين : 1 ] الخ .فمعنى : { أيحسب أن لن يقدر عليه } [ البلد : 5 ] : أيحسب أن لن نقدر عليه بعد اضمحلال جسده فنعيده خلقاً آخر ، فهو في طريقة القسم والمُقسم عليه بقوله تعالى : { لا أقسم بيوم القيامة } إلى قوله : { أيحسب الإنسان أَلَّن نجمع عظامه بلى قادرين على أن نسوي بنانه } [ القيامة : 1 4 ] . أي كما خلقناه أول مرة في نَصَب من أطوار الحياة كذلك نخلقه خلقاً ثانياً في كَبدٍ من العذاب في الآخرة لكفره .وبذلك يظهر موقع إدماج قوله { في كبد } لأن المقصود التنظير بين الخلْقين الأول والثاني في أنهما من مقدور الله تعالى .والظرفية من قوله : { في كبد } مستعملة مجازاً في الملازمة فكأنه مظروف في الكَبَد ، ونظيره قوله : { بل الذين لا يؤمنون بالآخرة في العذاب والضلال البعيد أفلم يروا إلى ما بين أيديهم وما خلفهم } [ سبأ : 8 ، 9 ] الآية . فالمراد : عذاب الدنيا ، وهو مشقة اضطراب البال في التكذيب واختلاققِ المعاذير والحيرة من الأمر على أحد التفسيرين لتلك الآية .فالمعنى : أن الكَبَد ملازم للمشرك من حين اتصافه بالإِشراك وهو حين تقوُّم العقل وكماللِ الإدراك .ومن الجائز أن يجعل قوله : { لقد خلقنا الإنسان في كبد } من قبيل القلب المقبول لتضمنه اعتباراً لطيفاً وهو شدة تلبّس الكَبد بالإِنسان المشرك حتى كأنه خُلِق في الكَبَد .والمعنى : لقد خلقنا الكَبَد في الإنسان الكافر .وللمفسرين تأويلات أخرى في معنى الآية لا يساعد عليها السياق .\n","ar.waseet":"وقوله - تعالى - ( لَقَدْ خَلَقْنَا الإنسان فِي كَبَدٍْ ) جواب القسم . والمراد بالإِنسان : جنسه ، والكبد : الشدة والتعب والمشقة ، من المكابدة للشئ ، بمعنى تحمل المشاق والمتاعب فى فعله ، وأصله من كَبِد الرجل - بزنة طرب - فهو أَكْبَد ، إذا أصيبت كبده بالمرض ، ثم اتسع فيه فاستعمل فى كل تعب ومشقة تنال الإِنسان .والمعنى : لقد خلقنا الإِنسان لهذه الشدائد والآلام ، التى هى من طبيعة هذه الحياة الدنيا ، والتى لا يزال يكابدها وينوء بها ، ويتفاعل معها . . حتى تنتهى حياته ، ولا فرق فى ذلك بين غنى أو فقير ، وحاكم أو محكوم وصالح أو طالح . . فالكل يجاهد ويكابد ويتعب ، من أجل بلوغ الغاية التى يبتغيها .قال الآلوسى ما ملخصه : قوله : ( لَقَدْ خَلَقْنَا الإنسان فِي كَبَد ) أى : فى تعب ومشقة ، فإنه لا يزال يقاسى فنون الشدائد من وقت نفخ الروح إلى حين نزعها .وعن ابن عمر - رضى الله عنهما - يكابد الشكر على السراء ويكابد الصبر على الضراء . وقيل : لقد خلقناه منتصب القامة واقفا ، ولم نجعله منكبا على وجهه .وقيل : جعلناه منتصبا رأسه فى بطن أمه ، فإذا أذن له فى الخروج قلب رأسه إلى قدمى أمه . . وهذه الأقوال ضعيفة لا يعول عليها ، والصحيح الأول . .والحق أن تفسير الكبد بالمشقة والتعب ، هو الذى تطمئن إليه النفس؛ لأنه لا يوجد فى هذه الحياة إِنسان إلا وهو مهموم ومشغول بمطالب حياته ، وفى كبد وتعب للحصول على آماله ورغباته وغاياته ، ورحم الله القائل :تعب كلها الحياة فما أعجب ... إلا من راغب فى ازديادوقال - سبحانه - ( فِي كَبَد ) للإِشعار بأنه لشدة مقاساته ومكابدته للمشاق والمتاعب ، وعدم انفكاكه عنها . . كالظِرف بداخل المظروف فهو فى محن ومتاعب ، حتى يصير إلى عالم آخر تغاير أحوالهُ أحوالَ هذا العالم .\n","ar.baghawi":"( لقد خلقنا الإنسان في كبد ) روى الوالبي عن ابن عباس : في نصب . قال الحسن : يكابد مصائب الدنيا وشدائد الآخرة . وقال قتادة : في مشقة فلا تلقاه إلا يكابد أمر الدنيا والآخرة .وقال سعيد بن جبير : [ في شدة . وقال عطاء عن ابن عباس ] : في شدة خلق حمله وولادته ورضاعه ، وفطامه وفصاله ومعاشه وحياته وموته .وقال عمرو بن دينار : عند نبات أسنانه . قال يمان : لم يخلق الله خلقا يكابد ما يكابد ابن آدم ، وهو مع ذلك أضعف الخلق . وأصل الكبد : الشدة .وقال مجاهد ، وعكرمة ، وعطية ، والضحاك : يعني منتصبا معتدل القامة ، وكل شيء خلق فإنه يمشي مكبا ، وهي رواية مقسم عن ابن عباس ، [ وأصل ] الكبد : الاستواء والاستقامة .وقال ابن كيسان : منتصبا رأسه في بطن أمه فإذا أذن الله له في خروجه انقلب رأسه إلى رجلي أمه .وقال مقاتل : \" في كبد \" أي في قوة .نزلت في أبي الأشدين واسمه أسيد بن كلدة الجمحي وكان شديدا قويا يضع الأديم العكاظي تحت قدميه فيقول : من أزالني عنه فله كذا وكذا ، فلا يطاق أن ينزع من تحت قدميه إلا قطعا ويبقى موضع قدميه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6027.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6027.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6027.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"أَيَحْسَبُ أَنْ لَنْ يَقْدِرَ عَلَيْهِ أَحَدٌ","transliteration":"Ayahsabu al-lai yaqdira 'alaihi ahad","translations":{"en.ahmedali":"Does he think that no one has power over him?","en.ahmedraza":"Does man think that no one will ever have power over him?","en.arberry":"What, does he think none has power over him,","en.asad":"Does he, then, think that no one has power over him?","en.daryabadi":"Deemest he that none will overpower him?","en.hilali":"Thinks he that none can overcome him?","en.pickthall":"Thinketh he that none hath power over him?","en.qaribullah":"Does he think that none has power over him!","en.sahih":"Does he think that never will anyone overcome him?","en.sarwar":"Does He think that no one will ever have control over him?","en.yusufali":"Thinketh he, that none hath power over him?","en.maududi":"Does he think that no one can overpower him?","en.shakir":"Does he think that no one has power over him?","en.itani":"Does he think that no one has power over him?","en.mubarakpuri":"Does he think that none can overcome him","en.qarai":"Does he suppose that no one will ever have power over him?","en.wahiduddin":"Does he think then that no one has power over him?"},"tafsir":{"ar.muyassar":"أيظنُّ بما جمعه من مال أن الله لن يقدر عليه؟","ar.jalalayn":"«أيحسب» أيظن الإنسان قوي قريش وهو أبو الأشد بن كلدة بقوته «أن» مخففة من الثقيلة واسمها محذوف، أي أنه «لن يقدر عليه أحد» والله قادر عليه.","ar.qurtubi":"أي أيظن ابن آدم أن لن يعاقبه الله عز وجل\n","ar.miqbas":"أَيَحْسَبُ أَنْ لَنْ يَقْدِرَ عَلَيْهِ أَحَدٌ (5)هذه الجملة بدل اشتمال من جملة : { لقد خلقنا الإنسان في كبد } [ البلد : 4 ] .والاستفهام مستعمل في التوبيخ والتخْطئة .وضمير { أيَحْسِبُ } راجع إلى الإِنسان لا محالة ، ومن آثار الحيرة في معنى { لقد خلقنا الإنسان في كبد } [ البلد : 4 ] أن بعض المفسرين جعل ضمير { أَيَحْسِبُ } راجعاً إلى بعض مما يعمه لفظ الإِنسان مثل أبي الأشد الجمحي ، وهو ضغث على إبّالة .\n","ar.waseet":"والاستفهام فى قوله - تعالى - بعد ذلك : ( أَيَحْسَبُ أَن لَّن يَقْدِرَ عَلَيْهِ أَحَدٌ .يَقُولُ أَهْلَكْتُ مَالاً لُّبَداً . أَيَحْسَبُ أَن لَّمْ يَرَهُ أَحَدٌ ) للإِنكار والتوبيخ .أى : أيظن هذا الإِنسان الذى هو فى تعب ومشقة طول حياته ، أنه قد بلغ من القوة والمنعة . . بحيث لا يقدر عليه أحد .إن كان يتوهم ذلك ، فهو فى ضلال مبين ، لأن الله - تعالى - الذى خلقه ، قادر على إهلاكه فى لمح البصر ، وقادر على أن يسلط عليه من يذله ، ويقضى عليه .ويدخل فى هذا التوبيخ دخولا أوليا ، أولئك المشركون الذين اغتروا بقوتهم ، فآذوا النبى صلى الله عليه وسلم وأصحابه إيذاء شديداً .\n","ar.baghawi":"\"أيحسب\"، يعني أبا الأشدين من قوته، \"أن لن يقدر عليه أحد\"، أي: يظن من شدته أن لن يقدر عليه الله تعالى. وقيل: هو الوليد بن المغيرة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6028.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6028.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6028.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"يَقُولُ أَهْلَكْتُ مَالًا لُبَدًا","transliteration":"Yaqoolu ahlaktu maalal lubadaa","translations":{"en.ahmedali":"He says: \"I have wasted a great deal of wealth.\"","en.ahmedraza":"He says, “I destroyed vast wealth.”","en.arberry":"saying, 'I have consumed wealth abundant'?","en.asad":"He boasts, \"I have spent wealth abundant!\"","en.daryabadi":"He saith: 'I have wasted riches plenteous.","en.hilali":"He says (boastfully): \"I have wasted wealth in abundance!\"","en.pickthall":"And he saith: I have destroyed vast wealth:","en.qaribullah":"He will say: 'I have destroyed a vast wealth'","en.sahih":"He says, \"I have spent wealth in abundance.\"","en.sarwar":"(He boasts and shows off) saying, \"I have spent a great deal of money (for the cause of God)\".","en.yusufali":"He may say (boastfully); Wealth have I squandered in abundance!","en.maududi":"He says: “I have squandered enormous wealth.”","en.shakir":"He shall say: I have wasted much wealth.","en.itani":"He says, “I have used up so much money.”","en.mubarakpuri":"He says: \"I have wasted wealth in abundance!\"","en.qarai":"He says, ‘I have squandered immense wealth.’","en.wahiduddin":"He says, \"I have spent enormous wealth.\""},"tafsir":{"ar.muyassar":"يقول متباهيًا: أنفقت مالا كثيرًا. أيظنُّ في فعله هذا أن الله عز وجل لا يراه، ولا يحاسبه على الصغير والكبير؟","ar.jalalayn":"«يقول أهلكت» على عداوة محمد «مالا لبدا» كثيرا بعضه على بعض.","ar.qurtubi":"يقول أهلكت أي أنفقت . مالا لبدا أي كثيرا مجتمعا .\n","ar.miqbas":"يَقُولُ أَهْلَكْتُ مَالًا لُبَدًا (6) أعقبت مساوي نفسه بمذام أقواله ، وهو التفخر الكاذب والتمدح بإتلاف المال في غير صلاح . وقد كان أهل الجاهلية يتبجحون بإتلاف المال ويعدونه منقبة لإيذانه بقلة اكتراث صاحبه به ، قال عنترة :وإذَا سَكِرْتُ فإنَّنِي مُسْتَهْلِكٌ ... مالي وعِرضي وافرٌ لم يُكْلَمِوَإذَا صَحَوْتُ فَما أقَصِّر عن نَدى ... وَكَما عَلِمْتَ شمائلي وتكَرُّمِيوجملة : { يقول أهلكت مالاً } في موضع الحال من { الإنسان } [ البلد : 4 ] . وذلك من الكبد .\n","ar.waseet":"ثم حكى - سبحانه - جانبا من أقوال هذا النوع الجاحد المغرور من بنى آدم فقال : ( يَقُولُ أَهْلَكْتُ مَالاً لُّبَداً ) أى : يقول هذا الإِنسان المغرور بقوته ، والمفتون بماله ، المتفاخر بما هو معه من حطام الدنيا . يقول - على سبيل التباهى والتعالى على غيره - لقد أنفقت مالا كثيرا ، فى عداوة النبى صلى الله عليه وسلم ، وفى إيذاء أتباعه ، وفى غير ذلك من الوجوه التى كان أهل الجاهلية يظنونها خيرا ، وما هى إلا شر محض . وعبر - سبحانه - عن إنفاق هذا الشقى لما له بقوله : ( يَقُولُ أَهْلَكْتُ . . . ) للإِشعار ، بأن ما أنفقه من مال هو شئ هالك ، لأنه لم ينفق فى الخير ، وإنما أنفق فى الشر .والمال اللُّبَد : هو المال الكثير الذى تلبد والتصق بعضه ببعض لكثرته وهو جمع لُبْدة - بضم اللام وسكون الباء - كغرفة وغرف ، وهى ما تلبد من صوف أو شعر ، أى : تجمع والتصق بعضه بعض .\n","ar.baghawi":"( يقول أهلكت ) يعني أنفقت ، ( مالا لبدا ) أي كثيرا بعضه على بعض ، من التلبيد ، في عداوة محمد - صلى الله عليه وسلم - ، قرأ أبو جعفر لبدا بتشديد الباء على جمع لابد ، مثل راكع وركع ، وقرأ الآخرون بالتخفيف على جمع \" لبدة \" ، وقيل على الواحد مثل قثم وحطم .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6029.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6029.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6029.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"أَيَحْسَبُ أَنْ لَمْ يَرَهُ أَحَدٌ","transliteration":"Ayahsabu al lam yarahooo ahad","translations":{"en.ahmedali":"Does he think that no one sees him?","en.ahmedraza":"Does man think that no one saw him?","en.arberry":"What, does he think none has seen him?","en.asad":"Does he, then, think that no one sees him?","en.daryabadi":"Deemest he that none beholdeth him?","en.hilali":"Thinks he that none sees him?","en.pickthall":"Thinketh he that none beholdeth him?","en.qaribullah":"Does he think that none has observed him?","en.sahih":"Does he think that no one has seen him?","en.sarwar":"Does he think that no one has seen him?","en.yusufali":"Thinketh he that none beholdeth him?","en.maududi":"Does he believe that none has seen him?","en.shakir":"Does he think that no one sees him?","en.itani":"Does he think that no one sees him?","en.mubarakpuri":"Does he think that none sees him","en.qarai":"Does he suppose that no one sees him?","en.wahiduddin":"Does he then think that no one sees him?"},"tafsir":{"ar.muyassar":"يقول متباهيًا: أنفقت مالا كثيرًا. أيظنُّ في فعله هذا أن الله عز وجل لا يراه، ولا يحاسبه على الصغير والكبير؟","ar.jalalayn":"«أيحسب أن» أي أنه «لم يره أحد» فيما أنفقه فيعلم قدره، والله عالم بقدره وأنه ليس مما يتكثر به ومجازيه على فعله السيء.","ar.qurtubi":"أيحسب أي أيظن . أن لم يره أي أن لم يعاينه أحد بل علم الله - عز وجل - ذلك منه ، فكان كاذبا في قوله : أهلكت ولم يكن أنفقه . وروى أبو هريرة قال : يوقف العبد ، فيقال ماذا عملت في المال الذي رزقتك ؟ فيقول : أنفقته وزكيته . فيقال : كأنك إنما فعلت ذلك ليقال سخي ، فقد قيل ذلك . ثم يؤمر به إلى النار . وعن سعيد عن قتادة : إنك مسئول عن مالك من أين جمعت ؟ وكيف أنفقت ؟ وعن ابن عباس قال : كان أبو الأشدين يقول : أنفقت في عداوة محمد مالا كثيرا وهو في ذلك كاذب . وقال مقاتل : نزلت في الحارث بن عامر بن نوفل ، أذنب فاستفتى النبي - صلى الله عليه وسلم - فأمره أن يكفر . فقال : لقد ذهب مالي في الكفارات والنفقات ، منذ دخلت في دين محمد . وهذا القول منه يحتمل أن يكون استطالة بما أنفق ، فيكون طغيانا منه ، أو أسفا عليه ، فيكون ندما منه .وقرأ أبو جعفر مالا لبدا بتشديد الباء مفتوحة ، على جمع لابد مثل راكع وركع ، وساجد وسجد ، وشاهد وشهد ، ونحوه . وقرأ مجاهد وحميد بضم الباء واللام مخففا ، جمع لبود . الباقون بضم اللام وكسرها وفتح الباء مخففا ، جمع لبدة ولبدة ، وهو ما تلبد يريد الكثرة . وقد مضى في سورة ( الجن ) القول فيه .وروي عن النبي - صلى الله عليه وسلم - أنه كان يقرأ أيحسب بضم السين في الموضعين . وقال الحسن : يقول أتلفت مالا كثيرا ، فمن يحاسبني به ، دعني أحسبه . ألم يعلم أن الله قادر على محاسبته ، وأن الله - عز وجل - يرى صنيعه .\n","ar.miqbas":"أَيَحْسَبُ أَنْ لَمْ يَرَهُ أَحَدٌ (7)وجملة : { أيحسب أن لم يره أحد } بدل اشتمال من جملة { يقول أهلكت مالاً } لأن قوله { أهلكت مالاً لبداً } يصدر منه وهو يحسب أنه راجَ كذبُه ، على جميع الناس وهو لا يخلو من ناس يطلعون على كذبه قال زهير :ومهْما تكنْ عند امرىء مِن خليقةوإنْ خالها تَخفى على الناسسِ تُعْلَمِوالاستفهام إنكار وتوبيخ وهو كناية عن علم الله تعالى بدخيلته وأن افتخاره بالكرم باطل .و { لبداً } بضم اللام وفتح الموحدة في قراءة الجمهور وهو جمع لُبدة بضم اللام وهي ما تلبد من صوف أو شعر ، أي تجمع والتصق بعضه ببعض وقرأه أبو جعفر { لبَّداً } بضم اللام وتشديد الباء على أنه جمع لاَبِدٍ بمعنى مجتمع بعضُه إلى بعض مثل : صُيَّم وقُوَّم ، أو على أنه اسم على زنة فُعَّل مثل زُمَّل للجَبان وجُبَّإ للضعيف .\n","ar.waseet":"وقوله - سبحانه - : ( أَيَحْسَبُ أَن لَّمْ يَرَهُ أَحَدٌ ) توبيخ لهذا الغرور إثر توبيخ ، وتجهيل فى أعقاب تجهيل . أى : أيظن هذا الجاهل المغرور ، حين أنفق المال الكثير فى المعاصى والسيئات ، أن الله - تعالى - غير مطلع عليه؟ إن كان يظن ذلك فهو فى نهاية الجهالة وانطماس البصيرة ، لأن الله - تعالى - مطلع عليه ، ولا تخفى عليه خافية فى الأرض ولا فى السماء ، وسيحاسبه على ذلك حسابا عسيرا .وفى الحديث الشريف : لن تزل قدما عبد يوم القيامة حتى يسأل عن أربع : عن شبابه فيم أبلاه ، وعن عمره فيم أفناه ، وعن ماله من أين اكتسبه ، وفيم أنفقه .\n","ar.baghawi":"( أيحسب أن لم يره أحد ) قال سعيد بن جبير [ وقتادة : أيظن ] أن الله لم يره ، ولا يسأله عن ماله من أين اكتسبه ، وأين أنفقه ؟وقال الكلبي : إنه كان كاذبا في قوله أنفقت كذا وكذا ، ولم يكن أنفق جميع ما قال ، يقول أيظن أن الله - عز وجل - لم ير ذلك منه فيعلم مقدار نفقته\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6030.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6030.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6030.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"أَلَمْ نَجْعَلْ لَهُ عَيْنَيْنِ","transliteration":"Alam naj'al lahoo 'aynayn","translations":{"en.ahmedali":"Did We not give him two eyes,","en.ahmedraza":"Did We not make two eyes for him?","en.arberry":"Have We not appointed to him two eyes,","en.asad":"Have We not given him two eyes,","en.daryabadi":"Have We not, made for him two eyes","en.hilali":"Have We not made for him a pair of eyes?","en.pickthall":"Did We not assign unto him two eyes","en.qaribullah":"Have We not given him two eyes,","en.sahih":"Have We not made for him two eyes?","en.sarwar":"Have We not given him two eyes,","en.yusufali":"Have We not made for him a pair of eyes?-","en.maududi":"Did We not grant him two eyes,","en.shakir":"Have We not given him two eyes,","en.itani":"Did We not give him two eyes?","en.mubarakpuri":"Have We not made for him two eyes","en.qarai":"Have We not made for him two eyes,","en.wahiduddin":"Have We not given him two eyes,"},"tafsir":{"ar.muyassar":"ألم نجعل له عينين يبصر بهما، ولسانًا وشفتين ينطق بها، وبينَّا له سبيلَي الخير والشر؟","ar.jalalayn":"«ألم نجعل» استفهام تقرير أي جعلنا «له عينين».","ar.qurtubi":"ثم عدد عليه نعمه فقال : \" ألم نجعل له عينين \" يبصر بهما .\n","ar.miqbas":"أَلَمْ نَجْعَلْ لَهُ عَيْنَيْنِ (8) تعليل للإِنكار والتوبيخ في قوله : { أيحسب أن لن يقدر عليه أحد } [ البلد : 5 ] أو قوله : { أيحسب أن لم يره أحد } [ البلد : 7 ] أي هو غافل عن قدرة الله تعالى وعن علمه المحيط بجميع الكائنات الدال عليهما أنه خَلَق مشاعر الإِدراك التي منها العينان ، وخَلَق آلات الإِبانة وهي اللسان والشفتان ، فكيف يكون مفيض العلم على الناس غير قادر وغير عالم بأحوالهم قال تعالى : { ألا يعلم من خلق وهو اللطيف الخبير } [ الملك : 14 ] .والاستفهام يجوز أن يكون تقريرياً وأن يكون إنكارياً .والاقتصار على العينين لأنهما أنفع المشاعر ولأن المعلَّل إنكار ظنه إن لم يره أحد . وذِكْر الشفتين مع اللسان لأن الإِبانة تحصل بهما معاً فلا ينطق اللسان بدون الشّفتين ولا تنطق الشفتان بدون اللسان .ومن دقائق القرآن أنه لم يقتصر على اللسان ولا على الشفتين خلاف عادة كلام العرب أن يقتصروا عليه يقولون : ينطق بلساننٍ فصيح ، ويقولون : لم ينطق ببنت شفة ، أو لم ينبس ببنت شفة ، لأن المقام مقام استدلال فجيء فيه بما له مزيد تصوير لخلق آلة النطق .وأعقب ما به اكتساب العلم وما به الإِبانة عن المعلومات ، بما يرشد الفكرَ إلى النظر والبحث وذلك قوله : { وهديناه النجدين } .فاستكمل الكلامُ أصول التعلُّم والتعليم فإن الإِنسان خُلق محباً للمعرفة محباً للتعريف فبمشاعر الإِدراك يكتسب المشاهدات وهي أصول المعلومات اليقينية ، وبالنطق يفيد ما يَعْلَمه لغيره ، وبالهدي إلى الخير والشر يميز بين معلوماته ويمحصها .\n","ar.waseet":"ثم ساق - سبحانه - بعد ذلك جانبا من مظاهر نعمه ، على هذا الإِنسان الجاهل والمغرور . فقال - تعالى - : ( أَلَمْ نَجْعَل لَّهُ عَيْنَيْنِ . وَلِسَاناً وَشَفَتَيْنِ . وَهَدَيْنَاهُ النجدين ) .والاستفهام هنا للتقرير ، لأن الله - تعالى - قد جعل له كل ذلك ، ولكنه لم يشكر الله - تعالى - على هذه النعم ، بل قابلها بالجحود والبطر . .أى : لقد جعلنا لهذا الإِنسان عينين ، يبصر بهما .\n","ar.baghawi":"ثم ذكره نعمه ليعتبر، فقال: \"ألم نجعل له عينين\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6031.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6031.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6031.mp3","format":"mp3","local_path":null}}},{"verse":9,"arabic":"وَلِسَانًا وَشَفَتَيْنِ","transliteration":"Wa lisaananw wa shafatayn","translations":{"en.ahmedali":"One tongue, and two lips,","en.ahmedraza":"And a tongue and two lips?","en.arberry":"and a tongue, and two lips,","en.asad":"and a tongue, and a pair of lips,","en.daryabadi":"And a tongue and two lips,","en.hilali":"And a tongue and a pair of lips?","en.pickthall":"And a tongue and two lips,","en.qaribullah":"a tongue, and two lips,","en.sahih":"And a tongue and two lips?","en.sarwar":"a tongue, and two lips?","en.yusufali":"And a tongue, and a pair of lips?-","en.maududi":"and a tongue and two lips?","en.shakir":"And a tongue and two lips,","en.itani":"And a tongue, and two lips?","en.mubarakpuri":"And a tongue and two lips","en.qarai":"a tongue, and two lips,","en.wahiduddin":"and a tongue, and a pair of lips,"},"tafsir":{"ar.muyassar":"ألم نجعل له عينين يبصر بهما، ولسانًا وشفتين ينطق بها، وبينَّا له سبيلَي الخير والشر؟","ar.jalalayn":"«ولسانا وشفتين».","ar.qurtubi":"ولسانا ينطق به . وشفتين يستر بهما ثغره . والمعنى : نحن فعلنا ذلك ، ونحن نقدر على أن نبعثه ونحصي عليه ما عمله . وقال أبو حازم : قال النبي - صلى الله عليه وسلم - : \" إن الله تعالى قال : يا ابن آدم ، إن نازعك لسانك فيما حرمت عليك ، فقد أعنتك عليه بطبقين ، فأطبق وإن نازعك بصرك فيما حرمت عليك ، فقد أعنتك عليه بطبقين ، فأطبق وإن نازعك فرجك إلى ما حرمت عليك ، فقد أعنتك عليه بطبقين ، فأطبق \" .[ ص: 58 ] والشفة : أصلها شفهة ، حذفت منها الهاء ، وتصغيرها : شفيهة ، والجمع : شفاه . ويقال : شفهات وشفوات ، والهاء أقيس ، والواو أعم ، تشبيها بالسنوات . وقال الأزهري : يقال هذه شفة في الوصل وشفه ، بالتاء والهاء . وقال قتادة : نعم الله ظاهرة ، يقررك بها حتى تشكر .\n","ar.miqbas":"وَلِسَانًا وَشَفَتَيْنِ (9) والشفتان هما الجِلدتان اللتان تستران الفم وأسنانه وبهما يُمتص الماء ، ومن انفتاحهما وانغلاقهما تتكيف أصوات الحروف التي بها النطق وهو المقصود هنا .وأصل شفة شَفَو نقص منه الواو وعوض عنه هاء فيجمع على شفوات ، وقيل : أصله شفه بهاء هي لام الكلمة فعُوضَ عنها هاء التأنيث فيجمع على شفهات وشِفاه . والذي يظهر أن الأصل شفه بهاء أصلية ثم عوملت الهاء معاملة هاء التأنيث تخفيفاً في حالة الوصل فقالوا : شفة ، وتنوسي بكثرة الاستعمال فعومل معاملة هاء التأنيث في التثنية كما في الآية وهو الذي تقضيه تثنيته على شفتين دون أن يقولوا : شفوين ، فإنهم اتفقوا على أن التثنية تردّ الاسم إلى أصله .\n","ar.waseet":"وجعلنا له لسانا ينطق به ، وشفتين - وهما الجلدتان اللتان تستران الفم والأسنان - تساعدانه على النطق الواضح السليم .واقتصر - سبحانه - على العينين ، لأنهما أنفع المشاعر ، ولأن المقصود إنكار ظنه أنه لم يره أحد ، ولأن الإِبصار حاصل بذاتهما .وذكر - سبحانه - اللسام وذكر معه الشفتين ، للدلالة على أن النطق السليم ، لا يتأتى إلا بوجودهما معا ، فاللسان لا ينطق نطقا صحيحا بدون الشفتين ، وهما لا ينطقان بدونه .\n","ar.baghawi":"(ولسانا وشفتين ) قال قتادة : نعم الله متظاهرة يقررك بها كيما تشكر ، وجاء في الحديث : أن الله - عز وجل - يقول : ابن آدم إن نازعك لسانك فيما حرمت عليك فقد أعنتك عليه بطبقتين فأطبق ، وإن نازعك بصرك إلى بعض ما حرمت عليك ، فقد أعنتك عليه بطبقتين ، فأطبق ، وإن نازعك فرجك إلى ما حرمت عليك فقد أعنتك عليه بطبقتين فأطبق .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6032.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6032.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6032.mp3","format":"mp3","local_path":null}}},{"verse":10,"arabic":"وَهَدَيْنَاهُ النَّجْدَيْنِ","transliteration":"Wa hadaynaahun najdayn","translations":{"en.ahmedali":"And showed him two highways (of good and evil)?","en.ahmedraza":"And did We not guide him to the two elevated things?","en.arberry":"and guided him on the two highways?","en.asad":"and shown him the two highways [of good and evil]?","en.daryabadi":"And shown Unto him the two highways?","en.hilali":"And shown him the two ways (good and evil)?","en.pickthall":"And guide him to the parting of the mountain ways?","en.qaribullah":"and guided him on the two paths (of good and evil)?","en.sahih":"And have shown him the two ways?","en.sarwar":"Have We not shown him the ways of good and evil?","en.yusufali":"And shown him the two highways?","en.maududi":"And did We not show him the two highroads (of good and evil)?","en.shakir":"And pointed out to him the two conspicuous ways?","en.itani":"And We showed him the two ways?","en.mubarakpuri":"And shown him the two ways","en.qarai":"and shown him the two paths [of good and evil]?","en.wahiduddin":"and shown him the two paths?"},"tafsir":{"ar.muyassar":"ألم نجعل له عينين يبصر بهما، ولسانًا وشفتين ينطق بها، وبينَّا له سبيلَي الخير والشر؟","ar.jalalayn":"«وهديناه النجدين» بينا له طريق الخير والشر.","ar.qurtubi":"قوله تعالى : وهديناه النجدينيعني الطريقين : طريق الخير وطريق الشر . أي بيناهما له بما أرسلناه من الرسل . والنجد . الطريق في ارتفاع . وهذا قول ابن عباس وابن مسعود وغيرهما . وروى قتادة قال : ذكر لنا أن النبي - صلى الله عليه وسلم - كان يقول : \" يا أيها الناس ، إنما هما النجدان : نجد الخير ، ونجد الشر ، فلم تجعل نجد الشر أحب إليك من نجد الخير \" . وروي عن عكرمة قال : النجدان : الثديان . وهو قول سعيد بن المسيب والضحاك ، وروي عن ابن عباس وعلي - رضي الله عنهما - ; لأنهما كالطريقين لحياة الولد ورزقه . فالنجد : العلو ، وجمعه نجود ومنه سميت نجد ، لارتفاعها عن انخفاض تهامة . فالنجدان : الطريقان العاليان . قال امرؤ القيس :فريقان منهم جازع بطن نخلة وآخر منهم قاطع نجد كبكب\n","ar.miqbas":"وَهَدَيْنَاهُ النَّجْدَيْنِ (10)والهداية : الدلالة على الطريق المبلِّغة إلى المكان المقصود السير إليه .والنجد : الأرض المرتفعة ارتفاعاً دون الجبل . فالمراد هنا طريقان نجدان مرتفعان ، والطريق قد يكون مُنجداً مصعداً ، وقد يكون غوراً منخفضاً .وقد استعيرت الهداية هنا للإِلهام الذي جعله الله في الإنسان يدرك به الضارّ والنافع وهو أصل التمدن الإنساني وأصل العلوم والهداية بدين الإسلام إلى ما فيه الفوز .واستعير النجدان للخير والشر ، وجعلا نجدين لصعوبة اتباع أحدهما وهو الخير فغلِّب على الطريقين ، أو لأن كل واحد صعب باعتبار ، فطريق الخير صعوبته في سلوكه ، وطريق الشر صعوبته في عواقبه ، ولذلك عبر عنه بعدَ هذا ب{ العَقَبة } [ البلد : 11 ] .ويتضمن ذلك تشبيه إعمال الفكر لنوال المطلوب بالسير في الطريق الموصل إلى المكان المرغوب كما قال تعالى : { إنا هديناه السبيل إما شاكراً وإما كفوراً } [ الإنسان : 3 ] وتشبيه الإِقبال على تلقّي دعوة الإِسلام إذ شقّت على نفوسهم كذلك .وأدمج في هذا الاستدلال امتنانٌ على الإِنسان بما وُهبه من وسائل العيش المستقيم .ويجوز أن تكون الهداية هداية العقل للتفكير في دلائل وجود الله ووحدانيته بحيث لو تأمل لعَرف وحدانية الله تعالى فيكون هذا دليلاً على سبب مؤاخذة أهل الشرك والتعطيل بكفرهم في أزمان الخلو عن إرسال الرسل على أحد القولين في ذلك بين الأشاعرة من جهة ، وبين الماتريدية والمعتزلة من جهة أخرى .\n","ar.waseet":"وقوله - تعالى - : ( وَهَدَيْنَاهُ النجدين ) بيان لنعمة أخرى هى أجل النعم وأعظمها .والنجد : الأرض المرتفعة ، وجمعه نجود ، ومنه سميت بلاد نجد بهذا الاسم ، لأنها مرتفعة عن غيرها . . والمراد بالنجدين هنا : طريق الخير . وطريق الشر ، أى : وهدينا هذا الإِنسان وأرشدناه إلى طريق الخير والشر ، عن طريق رسلنا الكرام ، وعن طريق ما منحناه من عقل ، يميز به بين الحق والباطل ، ثم وهبناه الاختيار لأحدهما ، كما قال - تعالى - : ( إِنَّا هَدَيْنَاهُ السبيل إِمَّا شَاكِراً وَإِمَّا كَفُوراً ) قال بعض العلماء : وكأنهما إنما سميا نجدين - أى : سبيل الخير والشر : لأنهما لما وضحت الدلائل ، وقربت الحجج ، وظهرت البراهين ، جعلا كالطريق المرتفعة العالية ، فى أنها واضحة لذوى الأبصار .أو إنما سميا بذلك ، للإِشارة إلى أن كل منهما وعورة يشق معها السلوك ، ولا يصبر عليها إلا من جاهد نفسه وراضها ، وليس سلوك طريق الشر بأهون من سلوك الخير ، بل الغالب أن يكون طريق الشر ، أشق وأصعب ، وأحوج إلى الجهد . .\n","ar.baghawi":"( وهديناه النجدين ) قال أكثر المفسرين : طريق الخير والشر ، والحق والباطل ، والهدى والضلالة ، كقوله : \" إنا هديناه السبيل إما شاكرا وإما كفورا \" وقال محمد بن كعب عن ابن عباس : \" وهديناه النجدين \" قال : الثديين ، وهو قول سعيد بن المسيب والضحاك ، والنجد : طريق في ارتفاع .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6033.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6033.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6033.mp3","format":"mp3","local_path":null}}},{"verse":11,"arabic":"فَلَا اقْتَحَمَ الْعَقَبَةَ","transliteration":"Falaq tahamal-'aqabah","translations":{"en.ahmedali":"But he could not scale the steep ascent.","en.ahmedraza":"So he did not quickly enter the steep valley.","en.arberry":"Yet he has not assaulted the steep;","en.asad":"But he would not try to ascend the steep uphill road...","en.daryabadi":"Yet he attempteth not the steep,","en.hilali":"But he has made no effort to pass on the path that is steep.","en.pickthall":"But he hath not attempted the Ascent -","en.qaribullah":"Yet he has not scaled the height.","en.sahih":"But he has not broken through the difficult pass.","en.sarwar":"Yet, he has not entered into Aqaba","en.yusufali":"But he hath made no haste on the path that is steep.","en.maududi":"But he did not venture to scale the difficult steep.","en.shakir":"But he would not attempt the uphill road,","en.itani":"But he did not brave the ascent.","en.mubarakpuri":"But he has not attempted to pass on the path that is steep.","en.qarai":"Yet he has not embarked upon the uphill task.","en.wahiduddin":"But he has not attempted the ascent."},"tafsir":{"ar.muyassar":"فهلا تجاوز مشقة الآخرة بإنفاق ماله، فيأمن.","ar.jalalayn":"«فلا» فهلا «اقتحم العقبة» جاوزها.","ar.qurtubi":"قوله تعالى : فلا اقتحم العقبةأي فهلا أنفق ماله الذي يزعم أنه أنفقه في عداوة محمد ، هلا أنفقه لاقتحام العقبة فيأمن والاقتحام : الرمي بالنفس في شيء من غير روية يقال منه : قحم في الأمر قحوما : أي رمى بنفسه فيه من غير روية . وقحم الفرس فارسه . تقحيما على وجهه : إذا رماه . وتقحيم النفس في الشيء : إدخالها فيه من غير روية . والقحمة ( بالضم ) المهلكة ، والسنة الشديدة . يقال : أصابت الأعراب القحمة : إذا أصابهم قحط ، فدخلوا الريف . والقحم : صعاب الطريق . وقال الفراء والزجاج : وذكر ( لا ) مرة واحدة ، والعرب لا تكاد تفرد ( لا ) مع الفعل الماضي في مثل هذا الموضع ، حتى يعيدوها في كلام آخر كقوله تعالى : فلا صدق ولا صلى ولا خوف عليهم ولا هم يحزنون . وإنما أفردوها لدلالة آخر الكلام على معناه فيجوز أن يكون قوله : ثم كان من الذين آمنوا قائما مقام التكرير كأنه قال : فلا اقتحم العقبة ولا آمن . وقيل : هو جار مجرى الدعاء كقوله : لا نجا ولا سلم .[ ص: 59 ] وما أدراك ما العقبة قال سفيان ابن عيينة : كل شيء قال فيه وما أدراك ؟ فإنه أخبر به ، وكل شيء قال فيه وما يدريك ؟ فإنه لم يخبر به . وقال : معنى فلا اقتحم العقبة أي فلم يقتحم العقبة ، كقول زهير :وكان طوى كشحا على مستكنة فلا هو أبداها ولم يتقدمأي فلم يبدها ولم يتقدم . وكذا قال المبرد وأبو علي : ( لا ) : بمعنى لم . وذكره البخاري عن مجاهد . أي فلم يقتحم العقبة في الدنيا ، فلا يحتاج إلى التكرير . ثم فسر العقبة وركوبها فقال فك رقبة وكذا وكذا فبين وجوها من القرب المالية . وقال ابن زيد وجماعة من المفسرين : معنى الكلام الاستفهام الذي معناه الإنكار تقديره : أفلا اقتحم العقبة أو هلا اقتحم العقبة . يقول : هلا أنفق ماله في فك الرقاب ، وإطعام السغبان ، ليجاوز به العقبة ، فيكون خيرا له من إنفاقه في عداوة محمد - صلى الله عليه وسلم - ثم قيل : اقتحام العقبة هاهنا ضرب مثل ، أي هل تحمل عظام الأمور في إنفاق ماله في طاعة ربه ، والإيمان به . وهذا إنما يليق بقول من حمل فلا اقتحم العقبة على الدعاء أي فلا نجا ولا سلم من لم ينفق ماله في كذا وكذا . وقيل : شبه عظم الذنوب وثقلها وشدتها بعقبة ، فإذا أعتق رقبة وعمل صالحا ، كان مثله كمثل من اقتحم العقبة ، وهي الذنوب التي تضره وتؤذيه وتثقله .قال ابن عمر : هذه العقبة جبل في جهنم . وعن أبي رجاء قال : بلغنا أن العقبة مصعدها سبعة آلاف سنة ، ومهبطها سبعة آلاف سنة . وقال الحسن وقتادة : هي عقبة شديدة في النار دون الجسر ، فاقتحموها بطاعة الله . وقال مجاهد والضحاك والكلبي : هي الصراط يضرب على جهنم كحد السيف ، مسيرة ثلاثة آلاف سنة ، سهلا وصعودا وهبوطا . واقتحامه على المؤمن كما بين صلاة العصر إلى العشاء . وقيل : اقتحامه عليه قدر ما يصلي صلاة المكتوبة . وروي عن أبي الدرداء أنه قال : إن وراءنا عقبة ، أنجى الناس منها أخفهم حملا . وقيل : النار نفسها هي العقبة . فروى أبو رجاء عن الحسن قال : بلغنا أنه ما من مسلم يعتق رقبة إلا كانت فداءه من النار .وعن عبد الله بن عمر قال : من أعتق رقبة أعتق الله - عز وجل - بكل عضو منها عضوا منه . وفي صحيح مسلم عن أبي هريرة ، عن رسول الله - صلى الله عليه وسلم - قال : من أعتق رقبة أعتق الله بكل عضو منها عضوا من أعضائه من النار ، حتى فرجه بفرجه . وفي الترمذي عن أبي أمامة وغيره من أصحاب النبي - صلى الله عليه وسلم - قال : أيما [ ص: 60 ] امرئ مسلم أعتق امرأ مسلما ، كان فكاكه من النار ، يجزي كل عضو منه عضوا منه ، وأيما امرأة مسلمة أعتقت امرأة مسلمة ، كانت فكاكها من النار ، يجزي كل عضو منها عضوا منها . قال : هذا حديث حسن صحيح غريب . وقيل : العقبة خلاصه من هول العرض . وقال قتادة وكعب : هي نار دون الجسر . وقال الحسن : هي والله عقبة شديدة : مجاهدة الإنسان نفسه وهواه وعدوه الشيطان . وأنشد بعضهم :إني بليت بأربع يرمينني     بالنبل قد نصبوا علي شراكاإبليس والدنيا ونفسي والهوى     من أين أرجو بينهن فكاكايا رب ساعدني بعفو إنني     أصبحت لا أرجو لهن سواكا\n","ar.miqbas":"فَلَا اقْتَحَمَ الْعَقَبَةَ (11) يجوز أن يكون { فلا اقتحم العقبة } تفريع إدماج بمناسبة قوله : { وهديناه النجدين } [ البلد : 10 ] أي هديناه الطريقين فلمْ يسلك النجْد الموصِّل إلى الخير .ويجوز أن يكون تفريعاً على جملة { يقول أهلكت مالاً لبداً } [ البلد : 6 ] وما بينهما اعتراضاً ، وتكون «لا اقتحم العقبة» استفهاماً حذف منه أداته . وهو استفهام إنكار ، والمعنى : أنه يدعي إهلاك مَال كثيرٍ في الفساد من ميسر وخمر ونحو ذلك أفَلا أهلكه في القُرَب والفضائل بفكّ الرقاب وإطعام المساكين في زمن المجاعة فإن الإِنفاق في ذلك لا يخفى على الناس خلافاً لما يدعيه من إنفاققٍ .وعلى هذا الوجه لا يعرِض الإِشكال بعدم تكرُّر ( لا ) فإن شأن ( لا ) النافية إذا دخلت على فعل المضي ولم تتكرر أن تكون للدّعاء إلاّ إذا تكررت معها مثلُها معطوفةٌ عليها نحو قوله : { فلاَ صَدَّق ولا صلَّى } [ القيامة : 31 ] أو كانت ( لا ) معطوفة على نفي نحو : ما خرجتُ ولا ركبتُ . فهو في حكم تكرير ( لا ) . وقد جاءت هنا نافية في غير دعاء ، ولم تتكرر استغناء عن تكريرها بكون ما بعدها وهو { اقتَحَم العقبة } يتضمن شيئين جاء بيانهما في قوله : { فكُّ رقبة أو إطعام } فكأنه قال : فلا فَكَّ رقبةً ولا أطعم يتيماً أو مسكيناً . ويجوز أن يكون عدم تكرير ( لا ) هنا استغناء بقوله : { ثم كان من الذين آمنوا } فكأنه قيل : فلا اقتحم العقبة ولا آمن . ويظهر أن كل ما يصرف عن التباس الكلام كاففٍ عن تكرير ( لا ) كالاستثناء في قول الحريري في «المقامة الثلاثين» : «لا عقد هذا العقد المبجل في هذا اليوم الأغر المحجّل إلا الذي جال وجاب» الخ وأُطلق { العقبةُ } على العمل الموصل للخير لأن عقبة النجد أعلى موضع فيه . ولكل نجد عقبة ينتهي بها . وفي العقبات تظهر مقدرة السابرة .والاقتحام : الدخول العسير في مكان أو جماعة كثيرين يقال : اقتحم الصَفَّ ، وهو افتعال للدلالة على التكلف مثل اكتسب ، فشبه تكلف الأعمال الصالحة باقتحام العقبة في شدته على النفس ومشقته قال تعالى : { وما يلقاها إلا الذين صبروا } [ فصلت : 35 ] .والاقتحام : ترشيح لاستعارة العقبة لِطريق الخير ، وهو مع ذلك استعارة لأن تزاحم الناس إنما يكون في طلب المنافع كما قال: ... والمورد العذب كثير الزحاموأفاد نفي الاقتحام أنه عدل على الاهتداء إيثاراً للعاجل على الآجل ولو عزم وصَبر لاقْتحم العقبة . وقد تتابعت الاستعارات الثلاث : النجدين ، والعقبة ، والاقتحام ، وبُني بعضها على بعض وذلك من أحسن الاستعارة وهي مبنية على تشبيه المعقول بالمحسوس .والكلام مسوق مساق التوبيخ على عدم اهتداء هؤلاء للأعمال الصالحة مع قيام أسباب الاهتداء من الإِدراك والنطق .\n","ar.waseet":"وبعد بيان هذه النعم الجليلة التى أنعم الله بها - سبحانه - على الإِنسان ، أتبع - سبحانه - ذلك بحضه على المداومة على فعل الخير ، وعلى إصلاح نفسه ، فقال - تعالى - : ( فَلاَ اقتحم العقبة ) للتفريع على ما تقدم ، والمقصود بهذه الآية الحض على فعل الخير بدل الشر .وقوله : ( اقتحم ) من الاقتحام للشئ ، بمعنى دخوله بشدة . يقال : اقتحم الجنود أرض العدو ، إذا دخلوها بقوة وسرعة ، وبدون مبالاة بارتكاب المخاطر .والعقبة فى الأصل : الطريق الوعر فى الجبل ، والمراد بها هنا : مجاهدة النفس ، وقسرها على مخالفة هواها وشهوتها ، وحملها على القول والفعل الذى يرضى الله - تعالى - .والمعنى : لقد جعلنا للإِنسان عينين ولسانا وشفتين . وهديناه النجدين . فهلا بعد كل هذه النعم ، فعل ما يرضينا ، بأن جاهد نفسه وهواه ، وبأن قدم ماله فى فك الرقاب ، وإطعام اليتامى والمساكين .قال الجمل : وقوله : ( فَلاَ اقتحم العقبة ) أى : فهلا اقتحم العقبة ، فلا بمعنى هلا التى للتحضيض . أى : الذى أنفق ماله فى عداوة النبى صلى الله عليه وسلم هلا أنفقه فى اقتحام العقبة فيأمن . .وقد استعيرت العقبة لمجاهدة النفس ، وحملها على الإِنفاق فى سبيل الخير ، لأن هذه الأعمال شاقة على النفس ، فجعلت كالذى يتكلف سلوك طريق وعر . .ويصح أن تكون \" لا \" هنا ، على معناها الحقيقى وهو النفى ، فيكون المعنى : أن هذا الإِنسان الذى جعلنا له عينين .. لم يشكرنا على نعمنا ، فلا هو اقتحم العقبة ، ولا هو فعل شيئا ينجيه من عذابنا .وإلى هذا المعنى أشار صاحب الكشاف بقوله : قوله ( فَلاَ اقتحم العقبة ) يعنى : فلم يشكر تلك الأيادى والنعم بالأعمال الصالحة : من فك الرقاب ، وإطعام اليتامى والمساكين . . بل غمط النعم ، وكفر بالمنعم . .فإن قلت : قلما تقع \" لا \" الداخلة على الماضى ، غير مكررة ، فما لها لم تكرر فى الكلام الأفصح؟ قلت : هى متكررة فى المعنى ، لأن المعنى ( فَلاَ اقتحم العقبة ) . . فلا فكَّ رقبة ، ولا أطعم مسكينا . ألا ترى أنه فسر اقتحام العقبة بذلك . .\n","ar.baghawi":"( فلا اقتحم العقبة ) يقول : فهلا أنفق ماله فيما يجوز به من فك الرقاب وإطعام السغبان ، فيكون خيرا له من إنفاقه على عداوة محمد - صلى الله عليه وسلم - ، هذا قول ابن زيد وجماعة .وقيل : \" فلا اقتحم العقبة \" أي لم يقتحمها ولا جاوزها . والاقتحام : الدخول في الأمر الشديد ، وذكر العقبة هاهنا مثل ضربه الله لمجاهدة النفس والهوى والشيطان في أعمال البر ، فجعله كالذي يتكلف صعود العقبة ، يقول : لم يحمل على نفسه المشقة بعتق الرقبة ولا طعام ، وهذا معنى قول قتادة .وقيل : إنه شبه ثقل الذنوب على مرتكبها بعقبة ، فإذا أعتق رقبة وأطعم كان كمن اقتحم العقبة وجاوزها .وروي عن ابن عمر : أن هذه العقبة جبل في جهنم .وقال الحسن وقتادة : عقبة شديدة في النار دون الجسر ، فاقتحموها بطاعة الله تعالى .وقال مجاهد ، والضحاك ، والكلبي : هي صراط يضرب على جهنم كحد السيف ، مسيرة ثلاثة آلاف سنة سهلا وصعودا وهبوطا ، وإن بجنبتيه كلاليب وخطاطيف كأنها شوك السعدان ، فناج مسلم ، وناج مخدوش ، ومكردس في النار منكوس ، فمن الناس من يمر كالبرق الخاطف ، ومنهم من يمر كالريح العاصف ، ومنهم من يمر كالفارس ، ومنهم من يمر عليه كالرجل يعدو ، ومنهم من يمر كالرجل يسير ، ومنهم من يزحف زحفا ، ومنهم الزالون ، ومنهم من يكردس في النار .قال ابن زيد : يقول فهلا سلك الطريق التي فيها النجاة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6034.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6034.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6034.mp3","format":"mp3","local_path":null}}},{"verse":12,"arabic":"وَمَا أَدْرَاكَ مَا الْعَقَبَةُ","transliteration":"Wa maaa adraaka mal'aqabah","translations":{"en.ahmedali":"How will you comprehend what the Steep ascent is? --","en.ahmedraza":"And what have you understood, what the valley is!","en.arberry":"and what shall teach thee what is the steep?","en.asad":"And what could make thee conceive what it is, that steep uphill road?","en.daryabadi":"And what shall make thee understand that which the steep is?","en.hilali":"And what will make you know the path that is steep?","en.pickthall":"Ah, what will convey unto thee what the Ascent is! -","en.qaribullah":"What could let you know what the height is!","en.sahih":"And what can make you know what is [breaking through] the difficult pass?","en.sarwar":"Would that you knew what Aqaba is!","en.yusufali":"And what will explain to thee the path that is steep?-","en.maududi":"And what do you know what that difficult steep is?","en.shakir":"And what will make you comprehend what the uphill road is?","en.itani":"And what will explain to you what the ascent is?","en.mubarakpuri":"And what will make you know the path that is steep","en.qarai":"And what will show you what is the uphill task?","en.wahiduddin":"What will explain to you what the ascent is?"},"tafsir":{"ar.muyassar":"وأيُّ شيء أعلمك: ما مشقة الآخرة، وما يعين على تجاوزها؟","ar.jalalayn":"«وما أدراك» أعلمك «ما العقبة» التي يقتحمها تعظيما لشأنها، والجملة اعتراض وبين سبب جوازها بقوله:","ar.qurtubi":"قوله تعالى : وما أدراك ما العقبة فيه حذف ، أي وما أدراك ما اقتحام العقبة . وهذا تعظيم لالتزام أمر الدين ; والخطاب للنبي - صلى الله عليه وسلم - ليعلمه اقتحام العقبة . قال القشيري : وحمل العقبة على عقبة جهنم بعيد إذ أحد في الدنيا لم يقتحم عقبة جهنم إلا أن يحمل على أن المراد فهلا صير نفسه بحيث يمكنه اقتحام عقبة جهنم غدا . واختار البخاري قول مجاهد : إنه لم يقتحم العقبة في الدنيا . قال ابن العربي : وإنما اختار ذلك لأجل أنه قال بعد ذلك في الآية الثانية : وما أدراك ما العقبة ؟ ثم قال في الآية الثالثة : فك رقبة ، وفي الآية الرابعة أو إطعام في يوم ذي مسغبة ، ثم قال في الآية الخامسة : يتيما ذا مقربة ، ثم قال في الآية السادسة : أو مسكينا ذا متربة فهذه الأعمال إنما تكون في الدنيا . المعنى : فلم يأت في الدنيا بما يسهل عليه سلوك العقبة في الآخرة .\n","ar.miqbas":"وَمَا أَدْرَاكَ مَا الْعَقَبَةُ (12) وقوله : { وما أدراك ما العقبة } حال من العقبة في قوله : { فلا اقتحم العقبة } للتنويه بها وأنها لأهميتها يَسأل عنها المخاطب هل أعلَمَهُ مُعْلِم ما هي ، أي لم يقتحم العقبة في حال جَدارتها بأن تُقتحم .وهذا التنويه يفيد التشويق إلى معرفة المراد من العقبة .و { ما } الأولى استفهام . و { ما } الثانية مثلها . والتقدير : أيُّ شيء أعلمك ما هي العقبة ، أي أعْلَمك جواب هذا الاستفهام ، كناية عن كونه أمراً عزيزاً يحتاج إلى من يُعلمك به .والخطاب في { ما أدراك } لغير معين لأن هذا بمنزلة المثل .وفِعل { أدراك } معلق عن العمل في المفعولين لوقوع الاستفهام بعده وقد تقدم نظيره في سورة الحاقة .وقرأ نافع وابنُ عامر وعاصم وحمزة وأبو جعفر ويعقوب وخَلف ، { فك رقبة } برفع { فكُّ } وإضافتِه إلى { رقبة } ورفععِ { إطعام } عطفاً على { فكّ } .\n","ar.waseet":"والاستفهام فى قوله - سبحانه - : ( وَمَآ أَدْرَاكَ مَا العقبة ) لتفخيم شأنها ، والتهويل من أمرها ، والتشويق إلى معرفتها .والكلام على حذف مضاف ، والتقدير : وما أدراك ما اقتحام العقبة؟\n","ar.baghawi":"ثم بين ما هي فقال: \"وما أدراك ما العقبة\"، ما اقتحام العقبة. قال سفيان بن عيينة: كل شيء قال: وما أدراك فإنه أخبر به، وما قال: وما يدريك فإنه لم يخبر به.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6035.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6035.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6035.mp3","format":"mp3","local_path":null}}},{"verse":13,"arabic":"فَكُّ رَقَبَةٍ","transliteration":"Fakku raqabah","translations":{"en.ahmedali":"To free a neck (from the burden of debt or slavery),","en.ahmedraza":"The freeing of a slave!","en.arberry":"The freeing of a slave,","en.asad":"[It is] the freeing of one's neck [from the burden of sin],","en.daryabadi":"It is freeing the neck,","en.hilali":"(It is) Freeing a neck (slave, etc.)","en.pickthall":"(It is) to free a slave,","en.qaribullah":"(It is) the freeing of a slave,","en.sahih":"It is the freeing of a slave","en.sarwar":"It is the setting free of a slave","en.yusufali":"(It is:) freeing the bondman;","en.maududi":"It is freeing someone's neck from slavery;","en.shakir":"(It is) the setting free of a slave,","en.itani":"The freeing of a slave.","en.mubarakpuri":"Freeing a neck","en.qarai":"[It is] the freeing of a slave,","en.wahiduddin":"It is the freeing of a slave;"},"tafsir":{"ar.muyassar":"إنه عتق رقبة مؤمنة من أسر الرِّق.","ar.jalalayn":"«فك رقبة» من الرق بأن أعتقها.","ar.qurtubi":"قوله تعالى : فك رقبة [ ص: 61 ] فيه ثلاث مسائل :الأولى : قوله تعالى : فك رقبة فكها : خلاصها من الأسر . وقيل : من الرق . وفي الحديث : [ وفك الرقبة أن تعين في ثمنها ] . من حديث البراء ، وقد تقدم في سورة ( التوبة ) . والفك : هو حل القيد والرق قيد . وسمي المرقوق رقبة ; لأنه بالرق كالأسير المربوط في رقبته . وسمي عتقها فكا كفك الأسير من الأسر . قال حسان :كم من أسير فككناه بلا ثمن وجز ناصية كنا مواليهاوروى عقبة بن عامر الجهني أن رسول الله - صلى الله عليه وسلم - قال : من أعتق رقبة مؤمنة كانت فداءه من النار قال الماوردي : ويحتمل ثانيا أنه أراد فك رقبته وخلاص نفسه ، باجتناب المعاصي ، وفعل الطاعات ولا يمتنع الخبر من هذا التأويل ، وهو أشبه بالصواب .الثانية : قوله تعالى : رقبة قال أصبغ : الرقبة الكافرة ذات الثمن أفضل في العتق من الرقبة المؤمنة القليلة الثمن لقول النبي - صلى الله عليه وسلم - وقد سئل أي الرقاب أفضل ؟ قال : \" أغلاها ثمنا وأنفسها عند أهلها \" .ابن العربي : والمراد في هذا الحديث : من المسلمين بدليل قوله - عليه السلام - : من أعتق امرأ مسلما ومن أعتق رقبة مؤمنة . وما ذكره أصبغ وهلة وإنما نظر إلى تنقيص المال ، والنظر إلى تجريد المعتق للعبادة ، وتفريغه للتوحيد ، أولى .الثالثة : العتق والصدقة من أفضل الأعمال . وعن أبي حنيفة : أن العتق أفضل من الصدقة . وعند صاحبيه الصدقة أفضل . والآية أدل على قول أبي حنيفة لتقديم العتق على الصدقة . وعن الشعبي في رجل عنده فضل نفقة : أيضعه في ذي قرابة أو يعتق رقبة ؟ قال : الرقبة أفضل ; لأن النبي - صلى الله عليه وسلم - قال : من فك رقبة فك الله بكل عضو منها عضوا من النار .\n","ar.miqbas":"فَكُّ رَقَبَةٍ (13) وجملة : { فك رقبة } بيان للعقبة والتقدير : هي فكّ رقبة ، فحذف المسند إليه حذفاً لمتابعة الاستعمال . وتبيين العقبة بأنها : { فك رقبة أو إطعام } مبني على استعارة العقبة للأعمال الصالحة الشاقة على النفس . وقد علمت أن ذلك من تشبيه المعقول بالمحسوس ، فلا وجه لتقدير من قدَّر مضافاً فقال : أي وما أدراك ما اقتحام العقبة .وقرأه ابن كثير وأبو عَمرو والكسائي { فَكَّ } بفتح الكاف على صيغة فعل المضي ، وبنصب { رقبةً } على المفعول ل { فكَّ } أو «أطعم» بدون ألف بعد عين { إطعام } على أنه فعل مضي عطفاً على { فَكَّ } ، فتكون جملة : { فكَّ رقبةً } بياناً لجملة { فلا اقتحم العقبة } وما بينهما اعتراضاً ، أو تكون بدلاً من جملة { اقتحم العقبة } أي فلا اقتحم العقبة ولا فكَّ رقبةً أو أطعم . وما بينهما اعتراض كما تقرر آنفاً .والفك : أخذ الشيء من يد من احتاز به .والرقبة مراد بها الإنسان ، من إطلاق اسم الجزء على كله مثل إطلاق رأس وعيننٍ ووجهٍ ، وإيثار لفظ الرقبة هنا لأن المراد ذات الأسير أو العبد وأول ما يخطر بذهن الناظر لواحد من هؤلاء . هو رقبته لأنه في الغالب يوثَق من رقبته .وأطلق الفك على تخليص المأخوذ في أسْرٍ أو مِلْك ، لمشابهة تخليص الأمر العسير بالنزع من يد القابض الممتنع .وهذه الآية أصل من أصول التشريع الإِسلامي وهو تشوُّف الشارع إلى الحرية وقد بسطنا القول في ذلك في كتاب «أصول النظام الاجتماعي في الإسلام» .\n","ar.waseet":"ثم فسر - سبحانه - ذلك بقوله : ( فَكُّ رَقَبَةٍ ) . والمراد بفك الرقبة إعتاقها وتخليصها من الرق والعبودية . إذ الفك معناه : تخليص الشئ من الشئ . .وقد ساق الإِمام ابن كثير عند تفسيره لهذه الآية ، جملة من الأحاديث التى وردت فى فضل عتق الرقاب ، وتحريرها من الرق . .ومن هذه الأحاديث قوله صلى الله عليه وسلم \" من أعتق رقبة مؤمنة ، أعتق الله بكل إِرْبِ منها - أى عضو منها - إربا منه من النار . . . \" .وقوله صلى الله عليه وسلم : \" ومن أعتق رقبة مؤمنة فهى فكاكه من النار . . \" .وقراءة الجمهور ( فَكُّ رَقَبَةٍ ) برفع \" فك \" وإضافته إلى \" رقبة \" .وقرأ ابن كثير وأبو عمرو والكسائى : \" فك \" بفتح الكاف على أنه فعل ماض ، ونصب لفظ \" رقبة \" على أنه مفعول به .وقد ذهب جمع من المفسرين إلى أن المراد بفك الرقبة : أن يخلص الإِنسان نفسه من المعاصى والسيئات ، التى تكون سببا فى دخوله النار .\n","ar.baghawi":"\"فك رقبة\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6036.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6036.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6036.mp3","format":"mp3","local_path":null}}},{"verse":14,"arabic":"أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ","transliteration":"Aw it'aamun fee yawmin zee masghabah","translations":{"en.ahmedali":"Or to feed in times of famine","en.ahmedraza":"Or the feeding on a day of hunger.","en.arberry":"or giving food upon a day of hunger","en.asad":"or the feeding, upon a day of [one's own] hunger,","en.daryabadi":"Or, feeding, in a day of privation,","en.hilali":"Or giving food in a day of hunger (famine),","en.pickthall":"And to feed in the day of hunger.","en.qaribullah":"the giving of food upon the day of hunger","en.sahih":"Or feeding on a day of severe hunger","en.sarwar":"or, in a day of famine, the feeding of","en.yusufali":"Or the giving of food in a day of privation","en.maududi":"or giving food on a day of hunger","en.shakir":"Or the giving of food in a day of hunger","en.itani":"Or the feeding on a day of hunger.","en.mubarakpuri":"Or giving food in a day full of Masghabah,","en.qarai":"or feeding, during days of [general] starvation,","en.wahiduddin":"or the feeding in times of famine"},"tafsir":{"ar.muyassar":"أو إطعام في يوم ذي مجاعة شديدة، يتيمًا من ذوي القرابة يجتمع فيه فضل الصدقة وصلة الرحم، أو فقيرًا معدمًا لا شيء عنده.","ar.jalalayn":"«أو أطْعَمَ في يوم ذي مسغبة» مجاعة.","ar.qurtubi":"قوله تعالى : أو إطعام في يوم ذي مسغبة أي مجاعة . والسغب : الجوع . والساغب الجائع . وقرأ الحسن أو إطعام في يوم ذا مسغبة بالألف في ذا - وأنشد أبو عبيدة :فلو كنت جارا يا ابن قيس بن عاصم لما بت شبعانا وجارك ساغباوإطعام الطعام فضيلة ، وهو مع السغب الذي هو الجوع أفضل . وقال النخعي في قوله تعالى : أو إطعام في يوم ذي مسغبة قال : في يوم عزيز فيه الطعام . وروي عن النبي - صلى الله عليه وسلم - أنه قال : من موجبات الرحمة إطعام المسلم السغبان .\n","ar.miqbas":"أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ (14) والمسغبة : الجوع وهي مصدر على وزن المَفْعَلَة مثل المَحْمَدة والمَرْحَمَة مِن سَغِبَ كفَرِح سَغَباً إذا جاع .والمراد ب { يوم ذي مسغبة } زمانٌ لا النهار المعروف .وإضافة { ذي } إلى { مسغبة } تفيد اختصاص ذلك اليوم بالمسغبة ، أي يوم مجاعة ، وذلك زمن البَرد وزمنُ القَحط .ووجه تخصيص اليوم ذي المسغبة بالإِطعام فيه أن الناس في زمن المجاعة يشتد شحهم بالمال خشية امتدادِ زمن المجاعة والاحتياج إلى الأقوات . فالإِطعام في ذلك الزمن أفضل ، وهو العقبة ودون العقبة مصاعد متفاوتة .وانتصب { يتيماً } على المفعول به ل { إطعام } الذي هو مصدر عامل عمل فعله وإعمالُ المصدر غيرِ المضاف ولا المعرّففِ باللام أقيس وإن كان إعمال المضاف أكثرَ ، ومنع الكوفيون إعمالَ المصدر غير المضاف .ومَا ورد بعدَه مرفوع أو منصوب حملوه على إضمار فعل من لفظ المصدر ، فيقدر في مثل هذه الآية عندهم «يطعم يتيماً» .واليتيم : الشخص الذي ليس له أب ، وهو دون البلوغ . ووجه تخصيصه بالإِطعام أنه مظنة قلة الشبع لصغر سنه وضعف عمله وفقد من يعوله ولحيائه من التعرض لطلب ما يحتاجه . فلذلك رغب في إطعامه وإن لم يصل حد المسكنة والفقر\n","ar.waseet":"وقوله - سبحانه - : ( أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ ) بيان لفضيلة ثانية من الفضائل التى تؤدى إلى مجاهدة النفس ، وحملها على طاعة الله - تعالى - .والمسغية : المجاعة ، مصدر ميميى بمعنى السَّغَب ، يقال : سغب الرجل - كفرح ونصر - إذا أصابه الجوع . ووصف اليوم بذلك على سبيل المبالغة كما فى قولهم : نهارة صائم . .وقرأ ابن كثير وأبو عمرو والكسائى \" أطعم \" بصيغة الفعل الماضى .أى : اقتحام العقبة . أى : التمكن من حمل النفس على طاعة الله - تعالى - يتمثل فى فك الرقاب . وفى إطعام المحتاجين فى يوم يشتد فيه جوعهم .\n","ar.baghawi":"\" فك رقبة * أو إطعام \"قرأ ابن كثير ، وأبو عمرو ، والكسائي : \" فك \" بفتح الكاف ، \" رقبة \" نصب ، \" أو أطعم \" بفتح الهمزة والميم على الماضي . وقرأ الآخرون \" فك \" برفع الكاف ، \" رقبة \" جرا ، \" أو إطعام \" [ بكسر الهمزة ، فألف بعد العين ، ورفع الميم منونة ] على المصدر .وأراد بفك الرقبة إعتاقها وإطلاقها ، ومن أعتق رقبة كانت فداءه من النار .أخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور محمد بن محمد بن سمعان ، حدثنا أبو جعفر بن محمد بن أحمد بن عبد الجبار الرياني ، حدثنا حميد بن زنجويه ، حدثنا عبد الله بن صالح ، حدثني الليث بن سعد ، حدثني ابن الهاد ، عن عمر بن علي بن حسين ، عن سعيد بن مرجانة قال : سمعته يحدث عن أبي هريرة قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من أعتق رقبة مؤمنة أعتق الله بكل عضو منه عضوا من النار ، حتى يعتق فرجه بفرجه \" .أخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور السمعاني ، أخبرنا أبو جعفر الرياني ، حدثنا حميد بن زنجويه ، حدثنا محمد بن كثير العبدي ، حدثنا عيسى بن عبد الرحمن السلمي ، عن طلحة بن مصرف اليامي ، عن عبد الرحمن بن عوسجة عن البراء بن عازب قال : جاء أعرابي إلى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله علمني عملا يدخلني الجنة ، قال : \" لئن كنت أقصرت الخطبة لقد أعرضت المسألة ، أعتق النسمة وفك الرقبة \" ، قال : قلت : أوليسا واحدا ؟ قال : \" لا عتق النسمة : أن تنفرد بعتقها ، وفك الرقبة : أن تعين في ثمنها ، والمنحة الوكوف وأنفق على ذي الرحم الظالم ، فإن لم تطق ذلك فأطعم الجائع واسق الظمآن ، وأمر بالمعروف وانه عن المنكر ، فإن لم تطق ذلك فكف لسانك إلا من خير \" .وقال عكرمة قوله : \" فك رقبة \" ، يعني فك رقبة من الذنوب بالتوبة \" أو إطعام في يوم ذي مسغبة \" ، مجاعة ، يقال : سغب يسغب سغبا إذا جاع .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6037.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6037.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6037.mp3","format":"mp3","local_path":null}}},{"verse":15,"arabic":"يَتِيمًا ذَا مَقْرَبَةٍ","transliteration":"Yateeman zaa maqrabah","translations":{"en.ahmedali":"The orphan near in relationship,","en.ahmedraza":"Of a related orphan,","en.arberry":"to an orphan near of kin","en.asad":"of an orphan near of kin,","en.daryabadi":"An orphan, of kin,","en.hilali":"To an orphan near of kin.","en.pickthall":"An orphan near of kin,","en.qaribullah":"to an orphaned relative","en.sahih":"An orphan of near relationship","en.sarwar":"an orphaned relative","en.yusufali":"To the orphan with claims of relationship,","en.maududi":"to an orphan near of kin;","en.shakir":"To an orphan, having relationship,","en.itani":"An orphan near of kin.","en.mubarakpuri":"To an orphan near of kin.","en.qarai":"an orphan among relatives","en.wahiduddin":"of an orphaned relative"},"tafsir":{"ar.muyassar":"أو إطعام في يوم ذي مجاعة شديدة، يتيمًا من ذوي القرابة يجتمع فيه فضل الصدقة وصلة الرحم، أو فقيرًا معدمًا لا شيء عنده.","ar.jalalayn":"«يتيما ذا مقربة» قرابة.","ar.qurtubi":"يتيما ذا مقربة أي قرابة . يقال : فلان ذو قرابتي وذو مقربتي . يعلمك أن الصدقة على القرابة أفضل منها على غير القرابة ، كما أن الصدقة على اليتيم الذي لا كافل له أفضل من الصدقة على اليتيم الذي يجد من يكفله . وأهل اللغة يقولون : سمي يتيما لضعفه . يقال : يتم الرجل يتما : إذا ضعف . وذكروا أن اليتيم في الناس من قبل الأب . وفي البهائم من قبل الأمهات . وقد مضى في سورة ( البقرة ) مستوفى ، وقال بعض أهل اللغة : اليتيم الذي يموت أبواه . وقال قيس بن الملوح :إلى الله أشكو فقد ليلى كما شكا     إلى الله فقد الوالدين يتيم\n","ar.miqbas":"يَتِيمًا ذَا مَقْرَبَةٍ (15) ووصف بكونه { ذا مقربة } أي مقربة من المطعِم لأن هذا الوصف يؤكد إطعامه لأن في كونه يتيماً إغاثة له بالإِطعام ، وفي كونه ذَا مقربة صلة للرحم .والمَقْرَبة : قرابة النسب وهو مصدر بوزن مَفْعَلة مثل ما تقدم في { مسغبة } .\n","ar.waseet":"وقوله - سبحانه - : ( يَتِيماً ذَا مَقْرَبَةٍ . أَوْ مِسْكِيناً ذَا مَتْرَبَة ) بيان لفضيلة ثالثة من الفضائل التى تؤدى إلى رضا الله - تعالى - .وقوله : ( يَتِيماً ) منصوب على أنه مفعول به لقوله \" إطعام \" أو أطعم على القراءة الثانية .واليتيم : هو الشخص الذى مات أوبه وهو صغير . .والمقربة : بمعنى القرابة ، مصدر ميمى ، من قرب فلان من فلان ، إذا كان بينهما نسب قريب . .والمتربة : الحاجة والافتقار الشديد ، مصدر ميمى من ترب الرجل - كطرب - إذا افتقر ، حتى لكنه قد لصق بالتراب من شدة الفقر ، وأنه ليس له مأوى سوى التراب .وأما قولهم : أترب فلان ، فمعناه استغنى ، حتى لكأن ماله قد صار كالتراب من كثرته .أى : اقتحام العقبة من أكبر مظاهره : ك الرقاب ، وإطعام الطعام لليتامى الأقارب .\n","ar.baghawi":"\"يتيماً ذا مقربة\"، أي ذا قرابة، يريد يتيماً بينك وبينه قرابة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6038.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6038.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6038.mp3","format":"mp3","local_path":null}}},{"verse":16,"arabic":"أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ","transliteration":"Aw miskeenan zaa matrabah","translations":{"en.ahmedali":"Or the poor in distress;","en.ahmedraza":"Or of a homeless needy person!","en.arberry":"or a needy man in misery;","en.asad":"or of a needy [stranger] lying in the dust –","en.daryabadi":"Or a poor man cleaving to the dust.","en.hilali":"Or to a Miskin (poor) afflicted with misery.","en.pickthall":"Or some poor wretch in misery,","en.qaribullah":"or to a needy person in distress;","en.sahih":"Or a needy person in misery","en.sarwar":"and downtrodden destitute person, (so that he would be of)","en.yusufali":"Or to the indigent (down) in the dust.","en.maududi":"or to a destitute lying in dust;","en.shakir":"Or to the poor man lying in the dust.","en.itani":"Or a destitute in the dust.","en.mubarakpuri":"Or to a Miskin cleaving to dust.","en.qarai":"or a needy man in desolation,","en.wahiduddin":"or some needy person in distress,"},"tafsir":{"ar.muyassar":"أو إطعام في يوم ذي مجاعة شديدة، يتيمًا من ذوي القرابة يجتمع فيه فضل الصدقة وصلة الرحم، أو فقيرًا معدمًا لا شيء عنده.","ar.jalalayn":"«أو مسكينا ذا متربة» لصوق بالتراب لفقره، وفي قراءة بدل الفعلين مصدران مرفوعان مضاف الأول لرقبة وينون الثاني فيقدر قبل العقبة اقتحام، والقراءة المذكورة بيانه.","ar.qurtubi":"قوله تعالى : أو مسكينا ذا متربة أي لا شيء له ، حتى كأنه قد لصق بالتراب من الفقر ، ليس له مأوى إلا التراب . قال ابن عباس : هو المطروح على الطريق ، الذي لا بيت له . مجاهد : هو الذي لا يقيه من التراب لباس ولا غيره . وقال قتادة : إنه ذو العيال . عكرمة : المديون . أبو سنان : ذو الزمانة . ابن جبير : الذي ليس له أحد . وروى عكرمة عن ابن عباس : ذو المتربة البعيد التربة يعني الغريب البعيد عن وطنه . وقال أبو حامد الخارزنجي : المتربة هنا : من التريب وهي شدة الحال . يقال ترب : إذا افتقر . قال الهذلي :وكنا إذا ما الضيف حل بأرضنا     سفكنا دماء البدن في تربة الحالوقرأ ابن كثير وأبو عمرو والكسائي : ( فك ) بفتح الكاف ، على الفعل الماضي . ( رقبة ) نصبا لكونها مفعولا ( أو أطعم ) بفتح الهمزة ونصب الميم ، من غير ألف ، على الفعل الماضي أيضا لقوله : ثم كان من الذين آمنوا فهذا أشكل ب فك أو إطعام . وقرأ الباقون : فك رفعا ، على أنه مصدر فككت . رقبة خفض بالإضافة . أو إطعام بكسر الهمزة وألف ورفع الميم وتنوينها على المصدر أيضا . واختاره أبو عبيد وأبو حاتم ; لأنه [ ص: 63 ] تفسير لقوله تعالى : وما أدراك ما العقبة ؟ ثم أخبره فقال : فك رقبة أو إطعام . المعنى : اقتحام العقبة : فك رقبة أو إطعام . ومن قرأ بالنصب فهو محمول على المعنى أي ولا فك رقبة ، ولا أطعم في يوم ذا مسغبة فكيف يجاوز العقبة . وقرأ الحسن وأبو رجاء : ذا مسغبة بالنصب على أنه مفعول إطعام أي يطعمون ذا مسغبة ويتيما بدل منه . الباقون ذي مسغبة فهو صفة ليوم . ويجوز أن يكون قراءة النصب صفة لموضع الجار والمجرور ; لأن قوله : في يوم ظرف منصوب الموضع ، فيكون وصفا له على المعنى دون اللفظ .\n","ar.miqbas":"أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ (16) والمسكين : الفقير ، وتقدم في سورة البقرة ( 184 ) عند قوله تعالى : { وعلى الذين يطيقونه فدية طعام مساكين وذا متربة } صفة لمسكين جعلت المتربة علامة على الاحتياج بحسب العرف .والمَتربة مصدر بوزن مفْعَلة أيضاً وفعِله تَرِب يقال : ترب ، إذا نام على التراب أي لم يكن له ما يفترشه على الأرض ، وهو في الأصل كناية عن العُروِّ من الثياب التي تحول بين الجسد والأرض عند الجلوس والاضطجاع وقريب منه قولهم في الدعاء : تَرِبت يمينك : وتربَت يداك .و { أو } للتقسيم وهو معنى من معاني ( أو ) جاء من إفادة التخيير .واعلم أنه إن كان المراد بالإنسان الجنس المخصوص ، أي المشركين كان نفي فكّ الرقاب والإِطعام كنايةً عن انتفاء تحلّيهم بشرائع الإِسلام لأن فكّ الرقاب وإطعام الجياع من القُربات التي جاء بها الإِسلام من إطعام الجياع والمحاويج وفيه تعريض بتعيير المشركين بأنهم إنما يحبون التفاخر والسمعة وإرضاء أنفسهم بذلك ، أو لمؤانسة الأخلاّء وذلك غالب أحوالهم ، أي لم يطعموا يتيماً ولا مسكيناً في يوم مسغبة ، أي هو الطعام الذي يرضاه الله لأن فيه نفع المحتاجين من عباده . وليس مثل إطعامكم في المآدب والولائم والمنادمة التي لا تعود بالنفع على المطعَمين لأن تلك المطاعم كانوا يدْعُون لها أمثالهم من أهل الجِدّة دون حاجة إلى الطعام وإنما يريدون المؤانسة أو المفاخرة .وفي حديث مسلم \" شر الطعام طعامُ الوليمة يُمْنَعْها من يأتيها ويُدعى إليها من يأباها \" وروى الطبراني : \" شرّ الطعام طعام الوليمة يُدعى إليه الشَّبْعان ويُحبس عنه الجائع \" .وإن كان المراد من الإِنسان واحداً معيناً جاز أن يكون المعنى على نحو ما تقدم ، وجاز أن يكون ذَمّاً له باللّؤْم والتفاخرِ الكاذب ، وفضحاً له بأنه لم يسبق منه عمل نافع لقومه قبل الإِسلام فلم يغرم غرامة في فَكاك أسير أو مأخوذٍ بدم أو مَنّ بحُرية على عبدٍ .وأيَّاَ مَّا كان فليس في الآية دلالة على أن الله كلف المشركين بهذه القرب ولا أنه عاقبهم على تركهم هذه القربات ، حتى تفرض فيه مسألة خطاب الكفار بفروع الشريعة وهي مسألة قليلة الجدوى وفرضها هنا أقل إجداء .وجملة : { ثم كان من الذين آمنوا } عطف على جملة { فلا اقتحم العقبة } .و { ثم } للتراخي الرتبي فتدل على أن مضمون الجملة المعطوفة بها أرقى رتبة في الغرض المسوق له الكلام من مضمون الكلام المعطوفة عليه ، فيصير تقدير الكلام : فلا اقتحم العقبة بفكّ رقبة أو إطعاممٍ بعد كونه مؤمناً . وفي فعل { كان } إشعار بأن إيمانه سابق على اقتحام العقبة المطلوبة فيه بطريقة التوبيخ على انتفائها عنه .\n","ar.waseet":"وللمساكين المحتاجين إلى العون والمساعدة .وخص - سبحانه - الإطعام بكونه فى يوم ذى مجاعة ، لأن إخراج الماء فى وقت القحط ، أثقل على النفس ، وأوجب لجزيل الأجر ، كما قال - تعالى - : ( لَن تَنَالُواْ البر حتى تُنْفِقُواْ مِمَّا تُحِبُّونَ ) وقيد - سبحانه - اليتيم بكونه ذا مقربة ، لأنه فى هذه الحالة يكون له حقان : حق القرابة ، وحق اليتم ، ومن كان كذلك فهو أولى بالمساعدة من غيره .\n","ar.baghawi":"\"أو مسكيناً ذا متربة\"، قد لصق بالتراب من فقره وضره. وقال مجاهد عن ابن عباس: هو المطروح في التراب لا يقه شيء. و المتربة مصدر ترب يترب ترباً ومتربة، إذا افتقر.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6039.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6039.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6039.mp3","format":"mp3","local_path":null}}},{"verse":17,"arabic":"ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ","transliteration":"Summa kaana minal lazeena aamanoo wa tawaasaw bissabri wa tawaasaw bilmarhamah","translations":{"en.ahmedali":"And to be of those who believe, and urge upon one another to persevere, and urge upon each other to be kind.","en.ahmedraza":"And moreover to be of those who accepted faith, and who urged patience to one another and who urged graciousness to one another.","en.arberry":"then that he become of those who believe and counsel each other to be steadfast, and counsel each other to be merciful.","en.asad":"and being, withal, of those who have attained to faith, and who enjoin upon one another patience in adversity, and enjoin upon one another compassion.","en.daryabadi":"Then he became of those who believed and enjoined on each other steadfastness and enjoined on each other compassion.","en.hilali":"Then he became one of those who believed, and recommended one another to perseverance and patience, and (also) recommended one another to pity and compassion.","en.pickthall":"And to be of those who believe and exhort one another to perseverance and exhort one another to pity.","en.qaribullah":"so that he becomes one of those who believe, charge each other to be patient, and charge each other to be merciful.","en.sahih":"And then being among those who believed and advised one another to patience and advised one another to compassion.","en.sarwar":"the believers who cooperate with others in patience (steadfastness) and kindness.","en.yusufali":"Then will he be of those who believe, and enjoin patience, (constancy, and self-restraint), and enjoin deeds of kindness and compassion.","en.maududi":"and, then besides this, he be one of those who believed, and enjoined upon one another steadfastness and enjoined upon one another compassion.","en.shakir":"Then he is of those who believe and charge one another to show patience, and charge one another to show compassion.","en.itani":"Then he becomes of those who believe, and advise one another to patience, and advise one another to kindness.","en.mubarakpuri":"Then he became one of those who believed and recommended one another to patience, and recommended one another to compassion.","en.qarai":"while being one of those who have faith and enjoin one another to patience, and enjoin one another to compassion.","en.wahiduddin":"and to be one of those who believe and urge one another to steadfastness and compassion."},"tafsir":{"ar.muyassar":"ثم كان مع فِعْل ما ذُكر من أعمال الخير من الذين أخلصوا الإيمان لله، وأوصى بعضهم بعضًا بالصبر على طاعة الله وعن معاصيه، وتواصوا بالرحمة بالخلق.","ar.jalalayn":"«ثم كان» عطف على اقتحم وثم للترتيب الذكري، والمعنى كان وقت الاقتحام «من الذين آمنوا وتواصوا» أوصى بعضهم بعضا «بالصبر» على الطاعة وعن المعصية «وتواصوا بالمرحمة» الرحمة على الخلق.","ar.qurtubi":"قوله تعالى : ثم كان من الذين آمنوا يعني : أنه لا يقتحم العقبة من فك رقبة ، أو أطعم في يوم ذا مسغبة ، حتي يكون من الذين آمنوا أي صدقوا ، فإن شرط قبول الطاعات الإيمان بالله . فالإيمان بالله بعد الإنفاق لا ينفع ، بل يجب أن تكون الطاعة مصحوبة بالإيمان ، قال الله تعالى في المنافقين : وما منعهم أن تقبل منهم نفقاتهم إلا أنهم كفروا بالله وبرسوله . وقالت عائشة : يا رسول الله ، إن ابن جدعان كان في الجاهلية يصل الرحم ، ويطعم الطعام ، ويفك العاني ، ويعتق الرقاب ، ويحمل على إبله لله ، فهل ينفعه ذلك شيئا ؟ قال : \" لا ، إنه لم يقل يوما رب اغفر لي خطيئتي يوم الدين \" . وقيل : ثم كان من الذين آمنوا أي فعل هذه الأشياء وهو مؤمن ، ثم بقي على إيمانه حتى الوفاة نظيره قوله تعالى : وإني لغفار لمن تاب وآمن وعمل صالحا ثم اهتدى . وقيل : المعنى ثم كان من الذين [ ص: 64 ] يؤمنون بأن هذا نافع لهم عند الله تعالى . وقيل : أتى بهذه القرب لوجه الله ، ثم آمن بمحمد - صلى الله عليه وسلم - وقد قال حكيم بن حزام بعدما أسلم ، يا رسول الله ، إنا كنا نتحنث بأعمال في الجاهلية ، فهل لنا منها شيء ؟ فقال - عليه السلام - : \" أسلمت على ما أسلفت من الخير \" . وقيل : إن ثم بمعنى الواو أي وكان هذا المعتق الرقبة ، والمطعم في المسغبة ، من الذين آمنوا .وتواصوا أي أوصى بعضهم بعضا .بالصبر أي بالصبر على طاعة الله ، وعن معاصيه وعلى ما أصابهم من البلاء والمصائب .وتواصوا بالمرحمة بالرحمة على الخلق فإنهم إذا فعلوا ذلك رحموا اليتيم والمسكين .\n","ar.miqbas":"ثُمَّ كَانَ مِنَ الَّذِينَ آَمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ (17)فعطفُ { ثم كان من الذين آمنوا } على الجمل المسوقة للتوبيخ والذم يفيد أن هذا الصنف من الناس أو هذا الإِنسان المعين لم يكن من المؤمنين ، وأنه ملوم على ما فَرَّط فيه لانتفاء إيمانه ، وأنه لو فعل شيئاً من هذه الأعمال الحسنة ولم يكن من الذين آمنوا ما نفعه عملُه شيئاً لأنه قد انتفى عنه الحظ الأعظم من الصالحات كما دلت عليه { ثم } من التراخي الرتبي فهو مؤذن بأنه شرط في الاعتداد بالأعمال .وعن عائشة : أنها قالت : «يا رسول الله إن ابن جدعان كان في الجاهلية يصل الرحم ويطعم الطعام ويفك العاني ويعتق الرقاب ويحمل على إبله لله ( أي يريد التقرب ) فهل ينفعه ذلك شيئاً قال : \" لا إنه لم يقل يوماً رب اغفر لي خطيئتي يوم الدين \" . ويفهم من الآية بمفهوم صفة الذين آمنوا أنه لو عمل هذه القرب في الجاهلية وآمن بالله حين جاء الإسلام لكان عمله ذلك محموداً .ومن يجعل { ثُم } مفيدة للتراخي في الزمان يجعل المعنى : لا اقتحم العقبة واتبعها بالإِيمان . أي اقتحم العقبة في الجاهلية وأسلمَ لمّا جاء الاسلام .وقد جاء ذلك صريحاً في حديث حكيم بن حزام في الصحيح : «قال : قلت : يا رسول الله أرأيتَ أشياء كنتُ أتحنث بها في الجاهلية من صدقة أو عتاقة وصلة رحم فهل فيها من أجر فقال لي النبي صلى الله عليه وسلم \" أسلمت على ما سلف من خير \" والتحنّث : التعبد يعني أن دخوله في الإِسلام أفاده إعطاء ثواب على أعماله كأنه عملها في الإِسلام .وقال : { من الذين آمنوا } دون أن يقول : ثم كان مؤمناً ، لأن كونه من الذين آمنوا أدل على ثبوت الإِيمان من الوصف بمؤمن لأن صفة الجماعة أقوى من أجل كثرة الموصوفين بها فإن كثرة الخير خير ، كما تقدم في قوله تعالى : { قال أعوذ باللَّه أن أكون من الجاهلين } في سورة البقرة ( 67 ) ، ثم في هذه الآية تقوية أخرى للوصف ، وهو جعله بالموصول المشعرِ بأنهم عُرفوا بالإِيمان بَيْن الفرق .وحُذِف متعلّق آمنوا } للعلم به أي آمنوا بالله وحده وبرسوله محمد صلى الله عليه وسلم ودين الإِسلام . فجُعل الفعل كالمستغني عن المتعلق .وأيضاً ليتأتى من ذكر الذين آمنوا تخلص إلى الثناء عليهم بقوله : { وتواصوا بالصبر وتواصوا بالمرحمة } ولبشارتهم بأنهم أصحاب الميمنة .وخص بالذكر من أوصاف المؤمنين تواصيهم بالصبر وتواصيهم بالمرحمة لأن ذلك أشرف صفاتهم بعد الإِيمان ، فإن الصبر ملاك الأعمال الصالحة كلها لأنها لا تخلو من كبح الشّهوة النفسانية وذلك من الصبر .والمرحمة ملاك صلاح الجامعة الإسلامية قال تعالى : { رحماء بينهم } [ الفتح : 29 ] .والتواصي بالرحمة فضيلة عظيمة ، وهو أيضاً كناية عن اتصافهم بالمرحمة لأن من يوصي بالمرحمة هو الذي عَرَف قدرَها وفضلها ، فهو يفعلها قبل أن يُوصي بها ، كما تقدم في قوله تعالى : { ولا تحضون على طعام المسكين } [ الفجر : 18 ] .وفيه تعريض بأن أهل الشرك ليسوا من أهل الصبر ولا من أهل المرحمة ، وقد صُرح بذلك في قوله تعالى : { ومن أحسن قولاً ممن دعا إلى اللَّه وعمل صالحاً وقال إنني من المسلمين إلى قوله : { وما يلقاها إلا الذين صبروا } [ فصلت : 33 35 ] وقوله : { بل لا تكرمون اليتيم ولا تحضون على طعام المسكين } [ الفجر : 17 ، 18 ] .\n","ar.waseet":"وقوله - تعالى - : ( ثُمَّ كَانَ مِنَ الذين آمَنُواْ وَتَوَاصَوْاْ بالصبر وَتَوَاصَوْاْ بالمرحمة ) معطوف على قوله - تعالى - قبل ذلك : ( فَلاَ اقتحم العقبة . . . ) .و \" ثم \" هنا للتراخى الرتبى ، للدلالة على أن ما بعدها أصل لقبول ما قبلها .والمعنى : هلا كان هذا الإِنسان ممن فكوا الرقاب ، وأطعموا لليتامى والمساكين . . ثم كان - فضلا عن كل ذلك - من الذين آمنوا بالله - تعالى - إيمانا حقا ، وممن أوصى بعضهم بعضا بفضيلة الصبر ، وفضيلة التراحم والتعاطف .لقد كان من الواجب عليه . . لو كان عاقلا - أن يكون من المؤمنين الصادقين ، ولكنه لتعاسته وشقائه وغروره ، لم يكن كذلك ، لأنه لا هو اقتحم العقبة ، ولا هو آمن . .وخص - سبحانه - من أوصاف المؤمنين تواصيهم بالصبر ، وتواصيهم بالمرحمة ، لأن هاتين الصفتين على رأس الصفات الفاضلة بعد الإِيمان بالله - تعالى - :\n","ar.baghawi":"\"ثم كان من الذين آمنوا\"، بين أن هذه القرب إنما تنفع مع الإيمان. وقيل: ثم بمعنى الواو، \"وتواصوا\"، أوصى بعضهم بعضاً، \"بالصبر\"، على فرائض الله وأوامره، \"وتواصوا بالمرحمة\"، برحمة الناس.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6040.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6040.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6040.mp3","format":"mp3","local_path":null}}},{"verse":18,"arabic":"أُولَٰئِكَ أَصْحَابُ الْمَيْمَنَةِ","transliteration":"Ulaaa'ika As-haabul maimanah","translations":{"en.ahmedali":"They are the people of the right hand (and will succeed).","en.ahmedraza":"These are the people of the right.","en.arberry":"Those are the Companions of the Right Hand.","en.asad":"Such are they that have attained to righteousness;","en.daryabadi":"These are the fellows of the righthand.","en.hilali":"They are those on the Right Hand (the dwellers of Paradise),","en.pickthall":"Their place will be on the right hand.","en.qaribullah":"Those are the Companions of the Right.","en.sahih":"Those are the companions of the right.","en.sarwar":"These are the people of the right hand.","en.yusufali":"Such are the Companions of the Right Hand.","en.maududi":"These are the People of the Right Hand.","en.shakir":"These are the people of the right hand.","en.itani":"These are the people of happiness.","en.mubarakpuri":"They are those on the Right,","en.qarai":"They are the People of the Right Hand.","en.wahiduddin":"Those who do so are the people of the right hand,"},"tafsir":{"ar.muyassar":"الذين فعلوا هذه الأفعال، هم أصحاب اليمين، الذين يؤخذ بهم يوم القيامة ذات اليمين إلى الجنة.","ar.jalalayn":"«أولئك» الموصوفون بهذه الصفات «أصحاب الميمنة» اليمين.","ar.qurtubi":"أولئك أصحاب الميمنة أي الذين يؤتون كتبهم بأيمانهم قاله محمد بن كعب القرظي وغيره . وقال يحيى بن سلام : لأنهم ميامين على أنفسهم . ابن زيد : لأنهم أخذوا من شق آدم الأيمن . وقيل : لأن منزلتهم عن اليمين قاله ميمون بن مهران .\n","ar.miqbas":"أُولَئِكَ أَصْحَابُ الْمَيْمَنَةِ (18) لَمَّا نوه بالذين آمنوا أعقب التنويه بالثناء عليهم وبشارتهم مفتَتحاً باسم الإِشارة لتمييزهم أكمل تمييز لإِحضارهم بصفاتهم في ذهن السامع ، مع ما في اسم الإِشارة من إرادة التنويه والتعظيم .و { الميمنة } جهة اليمين ، فهي مَفْعَلة للمكان مأخوذة من فعل يَمَنَه ( فعلاً ماضياً ) إذا كان على يمينه ، أي على جهة يده اليمنى ، أو مأخوذة من يَمَنَه اللَّهُ يُمْناً ، إذا بَاركه ، وإحدى المادتين مأخوذة من الأخرى ، قيل : سميت اليد اليمنى يميناً ويُمنى لأنها أعود نفعاً على صاحبها في يسرْ أعماله ، ولذلك سمي بلاد اليمن يَمَناً لأنها عن جهة يمين الواقف مستقبلاً الكعبة من بابها لأن باب الكعبة شرقي ، فالجهة التي على يمين الداخل إلى الكعبة هي الجنوب وهي جهة بلاد اليمن . وكانت بلاد اليمن مشهورة بالخيرات فهي ميمونة . وكان جغرافيو اليونان يصفونها بالعربية السعيدة ، وتفرع على ذلك اعتبارهم ما جاء عن اليمين من الوحش والطير مبشراً بالخير في عقيدة أهل الزجر والعيافة فالأيامن الميمونة قال المرقش يفند ذلك: ... فإذا الأشائِم كالأيامِننِ والأيَامِنُ كالأشائِمْ ... ونشأ على اعتبار عكس ذلك تسمية بلاد الشام شأماً بالهمز مشتقة من الشؤم لأن بلاد الشام من جهة شِمال الداخل إلى الكعبة وقد أبطل الإِسلام ذلك بقول النبي صلى الله عليه وسلم « اللهم بارك لنا في شأمِنا وفي يَمَنِنَا » وما تسميتهم ضد اليد اليمنى يساراً إلا لإِبطال ما يُتوهم من الشؤم فيها .ولما كانت جهة اليمين جهة مكرمة تعارفوا الجلوس على اليمين في المجامع كرامةً للجالس ، وجعلوا ضدهم بعكس ذلك . وقد أبطله الاسلام فكان الناس يجلسون حين انتهى بهم المجلس .\n","ar.waseet":"واسم الإِشارة فى قوله : ( أولئك أَصْحَابُ الميمنة ) يعود على الذين آمنوا وتواصوا بالصبر ، وتواصوا بالمرحمة . أى : أولئك الموصوفون بتلك الصفات الكريمة ، هم أصحاب الجهة اليمنى التى فيها السعداء الذين يؤتون كتابهم بأيمانهم ، فالمراد بالميمنة : جهة اليمين . .\n","ar.baghawi":"\"أولئك أصحاب الميمنة\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6041.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6041.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6041.mp3","format":"mp3","local_path":null}}},{"verse":19,"arabic":"وَالَّذِينَ كَفَرُوا بِآيَاتِنَا هُمْ أَصْحَابُ الْمَشْأَمَةِ","transliteration":"Wallazeena kafaroo bi aayaatinaa hum as-haabul Mash'amah","translations":{"en.ahmedali":"But those who deny Our revelations are the people of the left hand:","en.ahmedraza":"And those who denied Our signs, are the people of the left.","en.arberry":"And those who disbelieve in Our signs, they are the Companions of the Left Hand;","en.asad":"whereas those who are bent on denying the truth of Our messages – they are such as have lost themselves in evil,","en.daryabadi":"And those who disbelieve Our signs - they are the fellows of the lefthand.","en.hilali":"But those who disbelieved in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they are those on the Left Hand (the dwellers of Hell).","en.pickthall":"But those who disbelieve Our revelations, their place will be on the left hand.","en.qaribullah":"But those who disbelieve in Our verses, they are the Companions of the Left,","en.sahih":"But they who disbelieved in Our signs - those are the companions of the left.","en.sarwar":"As for those who disbelieve in Our revelations, they are the people of the left","en.yusufali":"But those who reject Our Signs, they are the (unhappy) Companions of the Left Hand.","en.maududi":"As for those who rejected Our Signs, they are the People of the Left Hand.","en.shakir":"And (as for) those who disbelieve in our communications, they are the people of the left hand.","en.itani":"But as for those who defy Our revelations—these are the people of misery.","en.mubarakpuri":"But those who disbelieved in Our Ayat, they are those on the Left.","en.qarai":"But those who defy Our signs, they are the People of the Left Hand.","en.wahiduddin":"and [as for] those who are bent on denying the truth of Our revelations, they are the people of the left hand,"},"tafsir":{"ar.muyassar":"والذين كفروا بالقرآن هم الذين يؤخذ بهم يوم القيامة ذات الشمال إلى النار.","ar.jalalayn":"«والذين كفروا بآياتنا هم أصحاب المشأمة» الشمال.","ar.qurtubi":"والذين كفروا بآياتنا أي كفروا بالقرآن .هم أصحاب المشأمة أي يأخذون كتبهم بشمائلهم قاله محمد بن كعب . يحيى بن سلام : لأنهم مشائيم على أنفسهم . ابن زيد : لأنهم أخذوا من شق آدم الأيسر . ميمون : لأن منزلتهم عن اليسار .قلت : ويجمع هذه الأقوال أن يقال : إن أصحاب الميمنة أصحاب الجنة ، وأصحاب المشأمة أصحاب النار قال الله تعالى : وأصحاب اليمين ما أصحاب اليمين في سدر مخضود ، وقال : وأصحاب الشمال ما أصحاب الشمال في سموم وحميم . وما كان مثله .\n","ar.miqbas":"وَالَّذِينَ كَفَرُوا بِآَيَاتِنَا هُمْ أَصْحَابُ الْمَشْأَمَةِ (19) وسمّي أهل الجنة { أصحاب الميمنة } و { أصحاب اليمين } [ الواقعة : 27 ] وسمي أهل النار { أصحاب المشأمة } و { أصحاب الشمال } في سورة الواقعة ( 41 ) ، فقوله : أولئك أصحاب الميمنة } أي أصحاب الكرامة عند الله .وقوله : { هم أصحاب المشأمة } أي هم محقرون . وذلك كناية مبنية على عرف العرب يومئذ في مجالسهم . ولا ميمنة ولا مشأمة على الحقيقة لأن حقيقة الميمنة والمشأمة تقتضيان حَيِّزاً لمن تُنسَب إليه الجهةُ .وجملة : { والذين كفروا بآياتنا هم أصحاب المشأمة } تتميم لِما سيق من ذم الإِنسان المذكور آنفاً إذ لم يعقّبْ ذمُّه هنالك بوعيده عِناية بالأهم وهو ذكر حالة أضداده ووعدِهم ، فلما قُضي حق ذلك ثُني العنان إلى ذلك الإِنسان فحصل من هذا النظم البديع محسِّن ردّ العجز على الصدر ، ومحسن الطباق بين الميمنة والمشأمة .وقد عرف آنفاً أن المشأمة منزلة الإِهانة والغضب ، ولذلك أتبع بقوله : { عليهم نار مؤصدة } .وضمير الفصل في قوله : { هم أصحاب المشأمة } لتقوية الحكم وليس للقصر ، إذ قد استفيد القصر من ذكر الجملة المضادة للتي قبلها وهي { أولئك أصحاب الميمنة } .\n","ar.waseet":"ثم بين - سبحانه - بعد ذلك سوء عاقبة الكافرين فقال : ( والذين كَفَرُواْ بِآيَاتِنَا ) أى : الدلالة على وحدانيتا وقدرتنا ( هُمْ أَصْحَابُ المشأمة ) أى : هم فى جهة الشمال التى فيها الأشقياء ، أو هم أصحاب الشؤم على أنفسهم بسبب إصرارهم على كفرهم ، .\n","ar.baghawi":"\"والذين كفروا بآياتنا هم أصحاب المشأمة\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6042.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6042.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6042.mp3","format":"mp3","local_path":null}}},{"verse":20,"arabic":"عَلَيْهِمْ نَارٌ مُؤْصَدَةٌ","transliteration":"Alaihim naarum mu'sadah","translations":{"en.ahmedali":"The Fire will vault them over.","en.ahmedraza":"Upon them is a fire, in which they are imprisoned, closed and shut above them.","en.arberry":"over them is a Fire covered down.","en.asad":"[with] fire closing in upon them.","en.daryabadi":"Over them shall be Fire closing round.","en.hilali":"The Fire will be shut over them (i.e. they will be enveloped by the Fire without any opening or window or outlet.","en.pickthall":"Fire will be an awning over them.","en.qaribullah":"with the Fire closed above them.","en.sahih":"Over them will be fire closed in.","en.sarwar":"who will be engulfed in the fire.","en.yusufali":"On them will be Fire vaulted over (all round).","en.maududi":"Upon them shall be a Fire that will hem them in.","en.shakir":"On them is fire closed over.","en.itani":"Upon them is a padlocked Fire.","en.mubarakpuri":"Upon them Fire will Mu'sadah.","en.qarai":"A closed Fire will be [imposed] upon them.","en.wahiduddin":"and the Fire will close in on them."},"tafsir":{"ar.muyassar":"جزاؤهم جهنم مطبَقةٌ مغلقة عليهم.","ar.jalalayn":"«عليهم نار مؤصدة» بالهمزة والواو بدله، مطبقة.","ar.qurtubi":"ومعنى مؤصدة أي مطبقة مغلقة . قال :تحن إلى أجبال مكة ناقتي ومن دونها أبواب صنعاء مؤصدهوقيل : مبهمة ، لا يدرى ما داخلها . وأهل اللغة يقولون : أوصدت الباب وآصدته أي أغلقته . فمن قال أوصدت ، فالاسم الوصاد ، ومن قال آصدته ، فالاسم الإصاد . وقرأ أبو عمرو وحفص وحمزة ويعقوب والشيزري عن الكسائي مؤصدة بالهمز هنا ، وفي ( الهمزة ) . الباقون بلا همز . وهما لغتان . وعن أبي بكر بن عياش قال : لنا إمام يهمز مؤصدة فأشتهي أن أسد أذني إذا سمعته .\n","ar.miqbas":"عَلَيْهِمْ نَارٌ مُؤْصَدَةٌ (20)و { مؤصدة } اسم مفعول من أوصد الباب بالواو . ويقال : أأصد بالهمز وهما لغتان ، قيل : الهمز لغة قريش وقيل : معناه جعله وصيدة . والوصيدة : بيت يتخذ من الحجارة في الجبال لحفظ الإبل . فقرأ الجمهور : { مُوصَدة } بواو ساكنة بعد الميم من أوصد بالواو ، وقرأه أبو عمرو وحمزة وحفص عن عاصم ويعقوب وخلف بهمزة ساكنة بعد الميم من ءَاصد الباب ، بهمزتين بمعنى وصَده .وجملة : { عليهم نار موصدة } بدل اشتمال من جملة { هم أصحاب المشأمة } أو استئناف بياني ناشىء عن الإِخبار عنهم بأنهم أصحاب المشأمة .و { عليهم } متعلق ب { مؤصدة } ، وقدم على عامله للاهتمام بتعلق الغلق عليهم تعجيلاً للترهيب .وقد استتب بهذا التقديم رعاية الفواصل بالهاء ابتداء من قوله : { فلا اقتحم العقبة } [ البلد : 11 ] .وإسناد المُوصَديَّة إلى النار مجاز عقلي ، والموصد هو موضع النار ، أي جهنم .\n","ar.waseet":"( عَلَيْهِمْ نَارٌ مُّؤْصَدَةٌ ) أى : عليهم نار مغلقة بحيث لا يستطيعون الخروج منها ، تقول آصدت الباب وأوصدته ، إذا أحكمت غلقه ، والاسم فيهما ، الإِصاد والوصاد . .نسأل الله - تعالى - أن يجعلنا من أصحاب الميمنة .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"\" عليهم نار مؤصدة \"، مطبقة عليهم أبوابها ، لا يدخل فيها روح ولا يخرج منها غم .قرأ أبو عمرو ، وحمزة ، وحفص : بالهمزة هاهنا ، وفي الهمزة ، وقرأ الآخرون بلا همز ، وهما لغتان ، يقال : آصدت الباب وأوصدته ، إذا أغلقته وأطبقته ، وقيل : معنى الهمز المطبقة وغير الهمز المغلقة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6043.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6043.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6043.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":86,"letters":667,"size":"106KB","priority":3,"commonlyRead":false}}