{"chapter":97,"name":{"arabic":"سورة 97","transliteration":"Chapter 97","translation":"Chapter 97","revelation":"unknown"},"revelation":"unknown","verses":5,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ","transliteration":"Innaa anzalnaahu fee lailatil qadr","translations":{"en.ahmedali":"TRULY WE REVEALED it on the Night of Determination.","en.ahmedraza":"We have indeed sent down the Qur’an in the Night of Destiny.","en.arberry":"Behold, We sent it down on the Night of Power;","en.asad":"BEHOLD, from on high have We bestowed this [divine writ] on Night of Destiny.","en.daryabadi":"Verily We! We have sent it down on the night of Power.","en.hilali":"Verily! We have sent it (this Quran) down in the night of Al-Qadr (Decree)","en.pickthall":"Lo! We revealed it on the Night of Predestination.","en.qaribullah":"We sent this (the Holy Koran) down on the Night of Honor.","en.sahih":"Indeed, We sent the Qur'an down during the Night of Decree.","en.sarwar":"We revealed the Quran on the Night of Destiny.","en.yusufali":"We have indeed revealed this (Message) in the Night of Power:","en.maududi":"Behold, We revealed this (Qur'an) on the Night of Power.","en.shakir":"Surely We revealed it on the grand night.","en.itani":"We sent it down on the Night of Decree.","en.mubarakpuri":"Verily, We have sent it down in the Night of Al-Qadr.","en.qarai":"Indeed We sent it down on the Night of Ordainment.","en.wahiduddin":"We sent it [Quran] down on the Night of Destiny."},"tafsir":{"ar.muyassar":"إنا أنزلنا القرآن في ليلة الشرف والفضل، وهي إحدى ليالي شهر رمضان.","ar.jalalayn":"«إنا أنزلناه» أي القرآن جملة واحدة من اللوح المحفوظ إلى السماء الدنيا «في ليلة القدر» أي الشرف العظيم.","ar.qurtubi":"سورة القدروهي مدنية في قول أكثر المفسرينذكره الثعلبي . وحكى الماوردي عكسهقلت : وهي مدنية في قول الضحاك ، وأحد قولي ابن عباس . وذكر الواقدي أنها أول سورة نزلت بالمدينة . وهي خمس آيات .بسم الله الرحمن الرحيمإنا أنزلناه في ليلة القدرقوله تعالى : إنا أنزلناه يعني القرآن ، وإن لم يجر له ذكر في هذه السورة ; لأن المعنى معلوم ، والقرآن كله كالسورة الواحدة . وقد قال : شهر رمضان الذي أنزل فيه القرآن وقال : حم والكتاب المبين إنا أنزلناه في ليلة مباركة ، يريد : في ليلة القدر .وقال الشعبي : المعنى إنا ابتدأنا إنزاله في ليلة القدر . وقيل : بل نزل به جبريل - عليه السلام - جملة واحدة في ليلة القدر ، من اللوح المحفوظ إلى سماء الدنيا ، إلى بيت العزة ، وأملاه جبريل على السفرة ، ثم كان جبريل ينزله على النبي - صلى الله عليه وسلم - نجوما نجوما . وكان بين أوله وآخره ثلاث وعشرون سنة ; قاله ابن عباس ، وقد تقدم في سورة ( البقرة ) . وحكى الماوردي عن ابن عباس قال : نزل القرآن في شهر رمضان ، وفي ليلة القدر ، في ليلة مباركة ، جملة واحدة من عند الله ، من اللوح المحفوظ إلى السفرة الكرام الكاتبين في السماء الدنيا ; فنجمته السفرة الكرام الكاتبون على جبريل عشرين سنة ، ونجمه جبريل على النبي - صلى الله عليه وسلم - عشرين سنة .قال ابن [ ص: 116 ] العربي : ( وهذا باطل ; ليس بين جبريل وبين الله واسطة ، ولا بين جبريل ومحمد عليهما السلام واسطة ) .قوله تعالى : في ليلة القدر قال مجاهد : في ليلة الحكم .وما أدراك ما ليلة القدر قال : ليلة الحكم . والمعنى ليلة التقدير ; سميت بذلك لأن الله تعالى يقدر فيها ما يشاء من أمره ، إلى مثلها من السنة القابلة ; من أمر الموت والأجل والرزق وغيره . ويسلمه إلى مدبرات الأمور ، وهم أربعة من الملائكة : إسرافيل ، وميكائيل ، وعزرائيل ، وجبريل . عليهم السلام .وعن ابن عباس قال : يكتب من أم الكتاب ما يكون في السنة من رزق ومطر وحياة وموت ، حتى الحاج . قال عكرمة : يكتب حاج بيت الله تعالى في ليلة القدر بأسمائهم وأسماء أبائهم ، ما يغادر منهم أحد ، ولا يزاد فيهم . وقاله سعيد بن جبير . وقد مضى في أول سورة ( الدخان ) هذا المعنى .وعن ابن عباس أيضا : أن الله تعالى يقضي الأقضية في ليلة نصف شعبان ، ويسلمها إلى أربابها في ليلة القدر . وقيل : إنما سميت بذلك لعظمها وقدرها وشرفها ، من قولهم : لفلان قدر ; أي شرف ومنزلة . قاله الزهري وغيره . وقيل : سميت بذلك لأن للطاعات فيها قدرا عظيما ، وثوابا جزيلا . وقال أبو بكر الوراق : سميت بذلك لأن من لم يكن له قدر ولا خطر يصير في هذه الليلة ذا قدر إذا أحياها . وقيل : سميت بذلك لأنه أنزل فيها كتابا ذا قدر ، على رسول ذي قدر ، على أمة ذات قدر . وقيل : لأنه ينزل فيها ملائكة ذوو قدر وخطر . وقيل : لأن الله تعالى ينزل فيها الخير والبركة والمغفرة . وقال سهل : سميت بذلك لأن الله تعالى قدر فيها الرحمة على المؤمنين . وقال : الخليل : لأن الأرض تضيق فيها بالملائكة ; كقوله تعالى : ومن قدر عليه رزقه أي ضيق .\n","ar.miqbas":"إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (1)اشتملت هذه الآية على تنويه عظيم بالقرآن فافتتحت بحرف ( إنَّ ) وبالإِخبار عنها بالجملة الفعلية ، وكلاهما من طرق التأكيد والتقوّي .ويفيد هذا التقديم قصراً وهو قصر قلب للرد على المشركين الذي نفوا أن يكون القرآن منزلاً من الله تعالى .وفي ضمير العظمة وإسناد الإِنزال إليه تشريف عظيم للقرآن .وفي الإِتيان بضمير القرآن دون الاسم الظاهر إيماء إلى أنه حاضر في أذهان المسلمين لشدة إقبالهم عليه فكون الضمير دون سبق معاد إيماء إلى شهرته بينهم .فيجوز أن يراد به القرآنُ كلُّه فيكون فعل : «أنزلنا» مستعملاً في ابتداء الإِنزال لأن الذي أُنزل في تلك الليلة خمس الآيات الأول من سورة العلق ثم فتر الوحي ثم عاد إنزاله منجماً ولم يكمل إنزال القرآن إلا بعد نيف وعشرين سنة ، ولكن لما كان جميع القرآن مقرراً في علم الله تعالى مقدارُه وأنه ينزل على النبي صلى الله عليه وسلم منجَّماً حتى يتم ، كان إنزاله بإنزال الآيات الأُول منه لأن ما ألحق بالشيء يعد بمنزلة أوله فقد قال النبي صلى الله عليه وسلم \" صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه \" الحديث فاتفق العلماء على أن الصلاة فيما أُلْحق بالمسجد النبوي لها ذلك الفضل ، وأن الطواف في زيادات المسجد الحرام يصحّ كلما اتّسع المسجد .ومن تسديد ترتيب المصحف أن وضعت سورة القدر عقب سورة العلق مع أنها أقلّ عدَد آياتتٍ من سورة البينة وسُورٍ بعدها ، كأنه إماء إلى أن الضمير في { أنزلناه } يعود إلى القرآن الذي ابتدىء نزوله بسورة العلق .ويجوز أن يكون الضمير عائداً على المقدار الذي أنزل في تلك الليلة وهو الآياتُ الخمسُ من سورة العلق فإن كل جزء من القرآن يسمى قرآناً ، وعلى كلا الوجهين فالتعبير بالمضي في فعل { أنزلناه } لا مجاز فيه . وقيل : أطلق ضمير القرآن على بعضه مجازاً بعلاقة البعضية .والآية صريحة في أن الآيات الأوَل من القرآن نزلت ليلاً وهو الذي يقتضيه حديث بَدْء الوحي في «الصحيحين» لقول عائشة فيه : «فكان يتحنث في غار حراء اللياليَ ذواتتِ العَدَد» فكان تعبده ليلاً ، ويظهر أن يكون الملك قد نزل عليه أثر فراغه من تعبده ، وأما قول عائشة : «فرجع بها رسول الله يرجف فُؤاده» فمعناه أنه خرج من غار حراء إثر الفجر بعد انقضاء تلقينه الآيات الخمس إذ يكون نزولها عليه في آخر تلك الليلة وذلك أفضل أوقات الليل كما قال تعالى : { والمستغفرين بالأسحار } [ آل عمران : 17 ] .وليلة القدر : اسم جعله الله للَّيلة التي ابتدىء فيها نزول القرآن . ويظهر أن أول تسميتها بهذا الاسم كان في هذه الآية ولم تكن معروفة عند المسلمين وبذلك يكون ذكرها بهذا الاسم تشويقاً لمعرفتها ولذلك عقب بقوله :{ وما أدراك ما ليلة القدر } [ القدر : 2 ] .والقَدْر الذي عُرفت الليلة بالإضافة إليه هو بمعنى الشرففِ والفضل كما قال تعالى في سورة الدخان ( 3 ) : { إنا أنزلناه في ليلة مباركة } أي ليلة القدر والشرف عند الله تعالى مما أعطاها من البركة فتلك ليلة جعل الله لها شرفاً فجعلها مظهراً لما سبق به علمه فجعلها مبدأ الوحي إلى النبي .والتعريف في القدر } تعريف الجنس . ولم يقل : في ليلةِ قدرٍ ، بالتنكير لأنه قُصد جعل هذا المركب بمنزلة العلَم لتلك الليلة كالعلَم بالغلبة ، لأن تعريف المضاف إليه باللام مع تعريف المضاف بالإِضافة أوْغَلُ في جعل ذلك المركب لَقَباً لاجتماع تعريفين فيه .وقد ثبت أن ابتداء نزول القرآن كان في شهر رمضان قال تعالى : { شهر رمضان الذي أنزل فيه القرآن هدى للناس وبينات من الهدى والفرقان } [ البقرة : 185 ] . ولا شك أن المسلمين كانوا يعلمون ذلك إذ كان نزول هذه السورة قبل نزول سورة البقرة بسنين إن كانت السورة مكية أو بمُدة أقل من ذلك إن كانت السورة مدنية ، فليلة القدر المرادة هنا كانت في رمضان وتأيد ذلك بالأخبار الصحيحة من كونها من ليالي رمضان في كل سنة .وأكثر الروايات أن الليلة التي أنزل فيها القرآن على النبي صلى الله عليه وسلم كانت ليلةَ سَبْع عشرة من رمضان . وسيأتي في تفسير الآيات عقب هذه الكلامُ في هل ليلة ذات عدد متماثل في جميع الأعوام أو تختلف في السنين؟ وفي هل تقع في واحدة من جميع ليالي رمضان أو لا تخرج عن العشر الأواخر منه؟ وهل هي مخصوصة بليلة وترٍ كما كانت أول مرّة أوْ لا تختص بذلك؟والمقصود من تشريف الليلة التي كان ابتداء إنزال القرآن فيها تشريف آخر للقرآن بتشريف زمان ظهوره ، تنبيهاً على أنه تعالى اختار لابتداء إنزاله وقتاً شريفاً مباركاً لأن عظم قدر الفعل يقتضي أن يُختار لإِيقاعه فَضْل الأوقات والأمكنة ، فاختيار فضللِ الأوقات لابتداء إنزاله ينبىء عن علوّ قدره عند الله تعالى كقوله : { لا يمسه إلا المطهرون } [ الواقعة : 79 ] على الوجهين في المراد من المطهرين .\n","ar.waseet":"الضمير المنصوب فى قوله - تعالى - ( أَنزَلْنَاهُ ) يعود إلى القرآن الكريم ، وفى الإِتيان بهذا الضمير للقرآن ، مع أنه لم يجر له ذكر ، تنويه بشأنه ، وإيذان بشهره أمره . حتى إنه ليُسْتَغْنَى عن التصريح به ، لحضوره فى أذهان المسلمين .والمراد بإنزاله : ابتداء نزوله على النبى صلى الله عليه وسلم ، لأنه من المعروف أن القرآن الكريم ، قد نزل على النبى صلى الله عليه سولم منجما ، فى مدة ثلاث وعشرين سنة تقريبا .ويصح أن يكون المراد بأنزلناه ، أى : أنزلناه جملة من اللوح المحفوظ إلى سماء الدنيا ، ثم نزل بعد ذلك منجما على النبى صلى الله عليه وسلم .قال الإِمام ابن كثير : قال ابن عباس وغيره : أنزل الله - تعالى - القرآن جملة واحدة من اللوح المحفوظ إلى بيت العزة من السماء الدنيا ، ثم نزل مفصلا بحسب الوقائع ، فى ثلاث وعشرين سنة ، على رسول الله صلى الله عليه وسلم .والقَدْر الذى أضيفت إليه الليلة ، بمعنى الشرف والعظمة ، مأخوذ من قولهم : لفلان قدر عند فلان ، أى : له منزلة رفيعة ، وشرف عظيم ، فسميت هذه الليلة بذلك ، لعظم قدرها وشرفها ، إذ هى الليلة التى نزل فيها قرآن ذو قدر ، بواسطة ملك ذى قدر ، على رسول ذى قدر ، لأجل إكرام أمه ذات قدر ، هذه الأمة يزداد قدرها وثوابها عند الله - تعالى - إذا ما أحيوا تلك الليلة بالعبادات والطاعات .\n","ar.baghawi":"مكية\"إنا أنزلناه في ليلة القدر\"، يعني القرآن، كناية عن غير مذكور، أنزله جملة واحدة في ليلة القدر من اللوح المحفوظ إلى السماء الدنيا، فوضعه في بيت العزة، ثم كان ينزل به جبريل عليه السلام نجوماً في عشرين سنة.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6126.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6126.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6126.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ","transliteration":"Wa maa adraaka ma lailatul qadr","translations":{"en.ahmedali":"How will you know what the Night of Determination is?","en.ahmedraza":"And what have you understood, what the Night of Destiny is!","en.arberry":"And what shall teach thee what is the Night of Power?","en.asad":"And what could make thee conceive what it is, that Night of Destiny?","en.daryabadi":"And what shall make thee know that which the night of Power is?","en.hilali":"And what will make you know what the night of Al-Qadr (Decree) is?","en.pickthall":"Ah, what will convey unto thee what the Night of Power is!","en.qaribullah":"What could let you know what the Night of Honor is!","en.sahih":"And what can make you know what is the Night of Decree?","en.sarwar":"Would that you knew what the Night of Destiny is!","en.yusufali":"And what will explain to thee what the night of power is?","en.maududi":"And what do you know what the Night of Power is?","en.shakir":"And what will make you comprehend what the grand night","en.itani":"But what will convey to you what the Night of Decree is?","en.mubarakpuri":"And what will make you know what the Night of Al-Qadr is","en.qarai":"And what will show you what is the Night of Ordainment?","en.wahiduddin":"And what will make you comprehend what the Night of Destiny is?"},"tafsir":{"ar.muyassar":"وما أدراك -أيها النبي- ما ليلة القدر والشرف؟","ar.jalalayn":"«وما أدراك» أعلمك يا محمد «ما ليلة القدر» تعظيم لشانها وتعجيب منه.","ar.qurtubi":"قوله تعالى : وما أدراك ما ليلة القدرقال الفراء : كل ما في القرآن من قوله تعالى : وما أدراك فقد أدراه . وما كان من قوله : وما يدريك فلم يدره . وقاله سفيان ، وقد تقدم .\n","ar.miqbas":"وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ (2)تنويه بطريق الإِبهام المراد به أن إدراك كنهها ليس بالسهل لما ينطوي عليه من الفضائل الجمّة .وكلمة ( ما أدراك ما كذا ) كلمة تقال في تفخيم الشيء وتعظيمه ، والمعنى : أيُّ شيء يُعَرِّفك ما هي ليلة القدر ، أي يعسر على شيءٍ أن يعرِّفك مقدارَها ، وقد تقدمت غير مرة منها ، قوله : { وما أدراك ما يوم الدين } في سورة الانفطار ( 17 ) قريباً . والواو واو الحال .وأعيد اسم لَيْلَةُ القدر } الذي سَبق قريباً في قوله : { في ليلة القدر } [ القدر : 1 ] على خلاففِ مقتضى الظاهر لأن مقتضى الظاهر الإِضمارُ ، فقُصِد الاهتمامُ بتعيينها ، فحصل تعظيم ليلة القدر صريحاً ، وحصلت كناية عن تعظيم ما أنزل فيها وأن الله اختار إنزاله فيها ليتطابق الشرفان .\n","ar.waseet":"ويصح أن يكون المراد بالقدر هنا : التقدير ، لأن الله - تعالى - يقدر فيها ما يشاء تقديره بعباده ، إلا أن القول الأول أظهر ، لأن قوله - سبحانه - بعد ذلك : ( وَمَآ أَدْرَاكَ مَا لَيْلَةُ القدر ) يفيد التعظيم والتفخيم .أى : إنا ابتدأنا بقدرتنا وحكمتنا ، إنزال هذا القرآن العظيم ، على رسولنا محمد صلى الله عليه وسلم فى ليلة القدر ، التى لها ما لها عندنا من قدر وشرف وعظم . . لأن للطاعات فيها قدرا كبيرا ، ثوابا جزيلا .وليلة القدر هذه هى الليلة التى قال الله - تعالى - فى شأنها فى سورة الدخان : ( إِنَّآ أَنزَلْنَاهُ فِي لَيْلَةٍ مُّبَارَكَةٍ إِنَّا كُنَّا مُنذِرِينَ . فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ . أَمْراً مِّنْ عِنْدِنَآ إِنَّا كُنَّا مُرْسِلِينَ . رَحْمَةً مِّن رَّبِّكَ إِنَّهُ هُوَ السميع العليم ) وهذه الليلة هى من ليالى شهر رمضان ، بدليل قوله - تعالى - : ( شَهْرُ رَمَضَانَ الذي أُنْزِلَ فِيهِ القرآن هُدًى لِّلنَّاسِ وَبَيِّنَاتٍ مِّنَ الهدى والفرقان ) قال بعض العلماء : ومن تسديد ترتيب المصحف ، أن سورة القدر وضعت عقب سورة العلق ، مع أنها أقل عددَ آياتٍ من سورة البينة وسور بعدها ، وكأن ذلك إيماء إلى أن الضمير فى ( أنزلناه ) يعود إلى القرآن ، الذى ابتدئ نزوله بسورة العلق .وقال صاحب الكشاف : عظم - سبحانه - القرآن من ثلاثة أوجه : أحدها : أن أسند إنزاله إليه ، وجعله مختصا به دون غيره ، والثانى : أنه جاء بضميره دون اسمه الظاهر ، شهادة له بالنباهة والاستغناء عن التنبيه عليه ، والثالث : الرفع من مقدار الوقت الذى أنزل فيه .روى أنه جملة واحدة فى ليلة القدر من اللوح المحفوظ إلى السماء الدنيا ، وأملاه جبريل على السفرة ثم كان ينزل به على رسول الله صلى الله عليه وسلم نجوما فى ثلاث وعشرين سنة .وعن الشعبى : المعنى أنا ابتدأنا إنزاله فى ليلة القدر . .وقوله - تعالى - : ( وَمَآ أَدْرَاكَ مَا لَيْلَةُ القدر ) تنويه آخر بشرف هذه الليلة ، وتفخيم لشأنها ، حتى لكأن عظمتها أكبر من أن تحيط بها الكلمات والألفاظ .أى : وما الذى يدريك بمقدار عظمتها وعلو قدرها ، إن الذى يعلم مقدار شرفها هو الله - تعالى - علام الغيوب .\n","ar.baghawi":"ثم عجب نبيه فقال : ( وما أدراك ما ليلة القدر ) سميت ليلة القدر لأنها ليلة تقدير الأمور والأحكام ، يقدر الله فيها أمر السنة في عباده وبلاده إلى السنة المقبلة ، كقوله تعالى : \" فيها يفرق كل أمر حكيم \" ( الدخان - 4 ) وهو مصدر قولهم : قدر الله الشيء بالتخفيف ، قدرا وقدرا ، كالنهر والنهر والشعر والشعر ، وقدره - بالتشديد - تقديرا [ وقدر بالتخفيف قدرا ] بمعنى واحد .قيل للحسين بن الفضل : أليس قد قدر الله المقادير قبل أن يخلق السموات والأرض ؟ قال : [ بلى ] ، قيل : فما معنى ليلة القدر ؟ قال : سوق المقادير إلى المواقيت ، وتنفيذ القضاء المقدر . وقال الأزهري : \" ليلة القدر \" : أي ليلة العظمة والشرف من قول الناس : لفلان عند الأمير قدر ، أي جاه ومنزلة ، ويقال : قدرت ، فلانا أي عظمته . قال الله تعالى : \" وما قدروا الله حق قدره \" ( الأنعام - 91 ) ( الزمر - 67 ) أي ما عظموه حق تعظيمه .وقيل : لأن العمل الصالح يكون فيها ذا قدر عند الله لكونه مقبولا . واختلفوا في وقتها; فقال بعضهم : إنها كانت على عهد رسول الله - صلى الله عليه وسلم - ثم رفعت ، وعامة الصحابة والعلماء على أنها باقية إلى يوم القيامة . وروي عن عبد الله بن مكانس مولى معاوية قال : قلت لأبي هريرة : زعموا أن ليلة القدر قد رفعت ؟ قال : كذب من قال ذلك ، قلت : هي في كل شهر أستقبله ؟ قال : نعم .وقال بعضهم : هي ليلة من ليالي السنة حتى لو علق رجل طلاق امرأته وعتق عبده بليلة القدر ، لا يقع ما لم تمض سنة من حين حلف . يروى ذلك عن ابن مسعود ، قال : من يقم الحول يصبها ، فبلغ ذلك عبد الله بن عمر فقال : يرحم الله أبا عبد الرحمن أما إنه علم أنها في شهر رمضان ، ولكن أراد أن لا يتكل الناس .والجمهور من أهل العلم على أنها في شهر رمضان .واختلفوا في تلك الليلة ; قال أبو رزين العقيلي : هي أول ليلة من شهر رمضان . وقال الحسن : ليلة سبع عشرة ، وهي الليلة التي كانت صبيحتها وقعة بدر .والصحيح والذي عليه الأكثرون : أنها في العشر الأواخر من شهر رمضان .أخبرنا أبو عثمان سعيد بن إسماعيل الضبي ، أخبرنا أبو محمد عبد الجبار بن محمد الجراحي ، حدثنا أبو العباس محمد بن أحمد المحبوبي ، حدثنا أبو عيسى الترمذي ، حدثنا هارون بن إسحاق الهمداني ، حدثنا عبدة بن سليمان ، عن هشام بن عروة ، عن أبيه عن عائشة رضي الله عنها قالت : كان رسول الله - صلى الله عليه وسلم - يجاور في العشر الأواخر من رمضان ، ويقول : \" تحروا ليلة القدر في العشر الأواخر من رمضان \" .أخبرنا أبو عثمان الضبي ، أخبرنا أبو محمد الجراحي ، حدثنا أبو العباس المحبوبي ، حدثنا أبو عيسى ، حدثنا قتيبة ، حدثنا عبد الواحد بن زياد ، عن الحسن بن عبيد الله ، عن إبراهيم ، عن الأسود ، عن عائشة رضي الله عنها قالت : كان رسول الله - صلى الله عليه وسلم - يجتهد في العشر الأواخر [ ما ] لا يجتهد في غيرها .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا علي بن عبد الله ، حدثنا سفيان ، عن أبي يعقوب ، عن أبي الضحى ، عن مسروق ، عن عائشة رضي الله تعالى عنها قالت كان رسول الله - صلى الله عليه وسلم - إذا دخل العشر [ الأواخر ] من رمضان شد مئزره وأحيا ليله ، وأيقظ أهله .واختلفوا في أنها في أي ليلة من العشر ؟أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا قتيبة بن سعيد ، حدثنا إسماعيل بن جعفر ، حدثنا أبو سهل بن مالك ، عن أبيه عن عائشة أن النبي - صلى الله عليه وسلم - قال : \" تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان \" .أخبرنا أحمد بن إبراهيم الشريحي ، أخبرنا أبو إسحاق الثعلبي ، أخبرنا عبد الله بن حامد الوازن ، أخبرنا مكي بن عبدان ، حدثنا عبد الله بن [ هاشم ] بن حيان ، حدثنا يحيى بن سعيد القطان ، حدثنا عيينة بن عبد الرحمن ، حدثني أبي قال : ذكرت ليلة القدر عند أبي بكرة ، فقال : ما أنا بطالبها بعد شيء سمعته من رسول الله - صلى الله عليه وسلم - إلا في العشر الأواخر ، سمعت رسول الله - صلى الله عليه وسلم - يقول : \" التمسوها في العشر الأواخر من تسع بقين أو سبع بقين أو خمس بقين أو ثلاث بقين أو آخر ليلة \" ، فكان أبو بكرة إذا دخل رمضان يصلي كما يصلي في سائر السنة ، فإذا دخل العشر [ الأخير ] اجتهد .وأخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا محمد بن المثنى ، حدثني خالد بن الحارث ، حدثنا حميد ، حدثنا أنس بن مالك عن عبادة بن الصامت قال : خرج النبي - صلى الله عليه وسلم - ليخبرنا بليلة القدر فتلاحى رجلان من المسلمين ، فقال : \" خرجت ، لأخبركم بليلة القدر فتلاحى فلان وفلان فرفعت ، وعسى أن يكون خيرا لكم ، فالتمسوها في التاسعة والسابعة والخامسة \" .أخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب عن مالك ، عن نافع عن عبد الله بن عمر أن رجالا من أصحاب النبي - صلى الله عليه وسلم - [ أروا ] ليلة القدر في المنام في السبع الأواخر من رمضان فقال رسول الله - صلى الله عليه وسلم - : \" إني أرى رؤياكم قد تواطأت في السبع الأواخر فمن كان متحريها فليتحرها في السبع الأواخر \" . وروي عن أبي سعيد الخدري : أنها ليلة إحدى وعشرين .أخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب عن مالك ، عن يزيد بن عبد الله بن الهاد ، عن محمد بن إبراهيم بن الحارث التيمي ، عن أبي سلمة بن عبد الرحمن ، عن أبي سعيد الخدري أنه قال : كان النبي - صلى الله عليه وسلم - يعتكف العشر الوسطى من رمضان ، واعتكف عاما حتى إذا كان ليلة إحدى وعشرين وهي الليلة التي يخرج صبحها من اعتكافه ، قال : من [ كان سيعتكف ] معي فليعتكف العشر الأواخر ، وقد رأيت هذه الليلة ثم أنسيتها ، وقد رأيتني أسجد في صبيحتها في ماء وطين ، فالتمسوها في العشر الأواخر ، والتمسوها في كل وتر .قال أبو سعيد الخدري : فمطرت السماء تلك الليلة ، وكان المسجد على عريش فوكف المسجد .قال أبو سعيد : فأبصرت عيناي رسول الله - صلى الله عليه وسلم - انصرف وعلى جبهته وأنفه أثر ، الماء والطين من صبيحة إحدى وعشرين .وقال بعضهم : هي ليلة ثلاث وعشرين .أخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور السمعاني ، حدثنا أبو جعفر الرياني ، حدثنا حميد بن زنجويه ، حدثنا أحمد بن خالد الحمصي ، حدثنا محمد بن إسحاق عن محمد بن إبراهيم ، حدثني عبد الله بن أنيس عن أبيه أنه قال لرسول الله - صلى الله عليه وسلم - : إني أكون ببادية يقال لها الوطأة وإني بحمد الله أصلي بهم ، فمرني بليلة من هذا الشهر أنزلها إلى المسجد فأصليها فيه ، فقال : \" انزل ليلة ثلاث وعشرين فصلها فيه ، وإن أحببت أن تستتم آخر الشهر فافعل ، وإن أحببت فكف \" . قال : فكان إذا صلى العصر دخل المسجد فلم يخرج إلا من حاجة حتى يصلي الصبح ، فإذا صلى الصبح كانت دابته بباب المسجد .وأخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور السمعاني ، حدثنا أبو جعفر الرياني ، حدثنا حميد بن زنجويه ، حدثنا يعلى بن عبيد ، حدثنا الأعمش عن أبي صالح عن أبي هريرة قال : تذاكرنا ليلة القدر فقال رسول الله - صلى الله عليه وسلم - : كم مضى من الشهر ؟ فقلنا : ثنتان [ وعشرون ] وبقي سبع ، [ فقال : \" مضى اثنتان وعشرون وبقي سبع ] اطلبوها الليلة ، الشهر تسع وعشرون \" .وقال قوم : هي ليلة سبع وعشرين ، وهو قول علي وأبي وعائشة :أخبرنا عبد الواحد المليحي ، أخبرنا أبو منصور السمعاني ، حدثنا أبو جعفر الرياني ، حدثنا حميد بن زنجويه ، حدثنا يعلى بن عبيد ، حدثنا سفيان عن عاصم عن زر بن حبيش قال : قلت لأبي بن كعب : يا أبا المنذر أخبرنا عن ليلة القدر ، فإن ابن أم عبد يقول : من يقم الحول يصبها ، فقال : رحم الله أبا عبد الرحمن ، أما إنه قد علم أنها في رمضان ، ولكن كره أن يخبركم فتتكلوا هي - والذي أنزل القرآن على محمد - صلى الله عليه وسلم - ليلة ، سبع وعشرين ، فقلنا : يا أبا المنذر أنى علمت هذا ؟ قال : بالآية التي أخبرنا النبي - صلى الله عليه وسلم - فحفظنا [ ووعينا ] ، هي والله [ لا تنسى ] ، قال قلنا لزر : وما الآية ؟ قال : تطلع الشمس كأنها طاس ليس لها شعاع .ومن علاماتها : ما روي عن الحسن رفعه : أنها ليلة [ بلجة ] سمحة لا حارة ولا باردة ، تطلع الشمس صبيحتها لا شعاع لها .وفي الجملة : أبهم الله هذه الليلة على هذه الأمة ليجتهدوا في العبادة ليالي رمضان طمعا في إدراكها ، كما أخفى ساعة الإجابة في يوم الجمعة ، وأخفى الصلاة الوسطى في الصلوات الخمس ، واسمه الأعظم في الأسماء ، ورضاه في الطاعات ليرغبوا في جميعها ، وسخطه في المعاصي لينتهوا عن جميعها ، وأخفى قيام الساعة ليجتهدوا في الطاعات حذرا من قيامها .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6127.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6127.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6127.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ","transliteration":"Lailatul qadri khairum min alfee shahr","translations":{"en.ahmedali":"Better is the Night of Determination than a thousand months.","en.ahmedraza":"The Night of Destiny is better than a thousand months.","en.arberry":"The Night of Power is better than a thousand months;","en.asad":"The Night of Destiny is better than a thousand months:","en.daryabadi":"The night of Power is better than a thousand months.","en.hilali":"The night of Al-Qadr (Decree) is better than a thousand months (i.e. worshipping Allah in that night is better than worshipping Him a thousand months, (i.e. 83 years and 4 months).","en.pickthall":"The Night of Power is better than a thousand months.","en.qaribullah":"The Night of Honor is better than a thousand months,","en.sahih":"The Night of Decree is better than a thousand months.","en.sarwar":"(Worship) on the Night of Destiny is better than (worship) for a thousand months.","en.yusufali":"The Night of Power is better than a thousand months.","en.maududi":"The Night of Power is better than a thousand months.","en.shakir":"The grand night is better than a thousand months.","en.itani":"The Night of Decree is better than a thousand months.","en.mubarakpuri":"The Night of Al-Qadr is better than a thousand months.","en.qarai":"The Night of Ordainment is better than a thousand months.","en.wahiduddin":"The Night of Destiny is better than a thousand months;"},"tafsir":{"ar.muyassar":"ليلة القدر ليلة مباركة، فَضْلُها خير من فضل ألف شهر ليس فيها ليلة قدر.","ar.jalalayn":"«ليلة القدر خير من ألف شهر» ليس فيها ليلة القدر فالعمل الصالح فيها خير منه في ألف شهر ليست فيها.","ar.qurtubi":"ليلة القدر خير من ألف شهر بين فضلها وعظمها . وفضيلة الزمان إنما تكون بكثرة ما يقع فيه من الفضائل . وفي تلك الليلة يقسم الخير الكثير الذي لا يوجد مثله في ألف شهر . والله أعلم .وقال كثير من المفسرين : أي العمل فيها خير من العمل في ألف شهر ليس فيها ليلة القدر . وقال أبو العالية : ليلة القدر خير من ألف شهر لا تكون فيه ليلة القدر . وقيل : عنى بألف شهر جميع الدهر ; لأن العرب تذكر الألف في [ ص: 117 ] غاية الأشياء ; كما قال تعالى : يود أحدهم لو يعمر ألف سنة يعني جميع الدهر . وقيل : إن العابد كان فيما مضى لا يسمى عابدا حتى يعبد الله ألف شهر ، ثلاثا وثمانين سنة وأربعة أشهر ، فجعل الله تعالى لأمة محمد - صلى الله عليه وسلم - عبادة ليلة خيرا من ألف شهر كانوا يعبدونها .وقال أبو بكر الوراق : كان ملك سليمان خمسمائة شهر ، وملك ذي القرنين خمسمائة شهر فصار ملكهما ألف شهر ; فجعل الله تعالى العمل في هذه الليلة لمن أدركها خيرا من ملكهما . وقال ابن مسعود : إن النبي - صلى الله عليه وسلم - ذكر رجلا من بني إسرائيل لبس السلاح في سبيل الله ألف شهر ; فعجب المسلمون من ذلك ; فنزلت إنا أنزلناه الآية . خير من ألف شهر ، التي لبس فيها الرجل سلاحه في سبيل الله . ونحوه عن ابن عباس . وهب بن منبه : إن ذلك الرجل كان مسلما ، وإن أمه جعلته نذرا لله ، وكان من قرية قوم يعبدون الأصنام ، وكان سكن قريبا منها ; فجعل يغزوهم وحده ، ويقتل ويسبي ويجاهد ، وكان لا يلقاهم إلا بلحيي بعير ، وكان إذا قاتلهم وقاتلوه وعطش ، انفجر له من اللحيين ماء عذب ، فيشرب منه ، وكان قد أعطي قوة في البطش ، لا يوجعه حديد ولا غيره : وكان اسمه شمسون .وقال كعب الأحبار : كان رجلا ملكا في بني إسرائيل ، فعل خصلة واحدة ، فأوحى الله إلى نبي زمانهم : قل لفلان يتمنى . فقال : يا رب أتمنى أن أجاهد بمالي وولدي ونفسي ، فرزقه الله ألف ولد ، فكان يجهز الولد بماله في عسكر ، ويخرجه مجاهدا في سبيل ، الله ، فيقوم شهرا ويقتل ذلك الولد ، ثم يجهز آخر في عسكر ، فكان كل ولد يقتل في الشهر ، والملك مع ذلك قائم الليل ، صائم النهار ; فقتل الألف ولد في ألف شهر ، ثم تقدم فقاتل فقتل . فقال الناس : لا أحد يدرك منزلة هذا الملك ; فأنزل الله تعالى : ليلة القدر خير من ألف شهر من شهور ذلك الملك ، في القيام والصيام والجهاد بالمال والنفس والأولاد في سبيل الله .وقال علي وعروة : ذكر النبي - صلى الله عليه وسلم - أربعة من بني إسرائيل ، فقال \" عبدوا الله ثمانين سنة ، لم يعصوه طرفة عين \" ; فذكر أيوب وزكريا ، وحزقيل بن العجوز ويوشع بن نون ; فعجب أصحاب النبي - صلى الله عليه وسلم - من ذلك . فأتاه جبريل فقال : يا محمد عجبت أمتك من عبادة هؤلاء النفر ثمانين سنة لم يعصوا الله طرفة عين ، فقد أنزل الله عليك خيرا من ذلك ; ثم قرأ : إنا أنزلناه في ليلة القدر . فسر بذلك رسول الله - صلى الله عليه وسلم - . وقال مالك في الموطأ من رواية ابن القاسم وغيره : سمعت من أثق به يقول : إن رسول الله - صلى الله عليه وسلم - أري أعمار الأمم قبله ، فكأنه تقاصر أعمار أمته ألا يبلغوا من العمل مثل ما بلغ غيرهم في طول العمر ; فأعطاه الله تعالى ليلة القدر ، وجعلها خيرا من ألف شهر .وفي الترمذي عن الحسن بن علي - رضي الله عنهما - : أن رسول الله - صلى الله عليه وسلم - أري بني أمية على منبره ، [ ص: 118 ] فساءه ذلك ; فنزلت إنا أعطيناك الكوثر ، يعني نهرا في الجنة . ونزلت إنا أنزلناه في ليلة القدر وما أدراك ما ليلة القدر ليلة القدر خير من ألف شهر يملكها بعدك بنو أمية . قال القاسم بن الفضل الحداني : فعددناها ، فإذا هي ألف شهر ، لا تزيد يوما ، ولا تنقص يوما . قال : حديث غريب .\n","ar.miqbas":"لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ (3)بيان أولُ لشيءٍ من الإِبهام الذي في قوله : { وما أدراك ما ليلة القدر } [ القدر : 2 ] مثلُ البيان في قوله : { وما أدراك ما العقبة فك رقبة أو إطعام } [ البلد : 12 ، 14 ] الآية . فلذلك فصلت الجملة لأنها استئناف بياني ، أو لأنها كعطف البيان .وتفضيلها بالخَيْر على ألف شهر . إنما هو بتضعيف فضل ما يحصل فيها من الأعمال الصالحة واستجابة الدعاء ووفرة ثواب الصدقات والبركة للأمة فيها ، لأن تفاضل الأيام لا يكون بمقادير أزمنتها ولا بما يحدث فيها من حَر أو برد ، أو مطر ، ولا بطولها أو بقصرها ، فإن تلك الأحوال غير معتدّ بها عند الله تعالى ولكن الله يعبأ بما يحصل من الصلاح للناس أفراداً وجماعات وما يعين على الحق والخير ونشر الدين . وقد قال في فضل الناس : { إن أكرمكم عند اللَّه أتقاكم } [ الحجرات : 13 ] فكذلك فضل الأزمان إنما يقاس بما يحصل فيها لأنها ظروف للأعمال وليست لها صفات ذاتية يمكن أن تتفاضل بها كتفاضل الناس ففضلها بما أعدّه الله لها من التفضيل كتفضيل ثلث الليل الأخير للقربات وعدد الألف يظهر أنه مستعمل في وفرة التكثير كقوله : «واحد كألف» وعليه جاء قوله تعالى : { يود أحدهم لو يعمر ألف سنة } [ البقرة : 96 ] وإنما جعل تمييز عدد الكثرة هنا بالشهر للرعي على الفاصلة التي هي بحرف الراء . وفي «الموطإ» : «قال مالك إنه سمع من يثق به من أهل العلم يقول : إن رسول الله صلى الله عليه وسلم أري أعمار الناس قبله أو ما شاء الله من ذلك فكأنه تقاصر أعمارَ أمته أن لا يبلغُوا من العمَل مثلَ ما بلغ غيرهم في طول العُمر فأعطاه الله { ليلة القدر خير من ألف شهر } اه .وإظهار لفظ { لَيْلَةُ القدر } في مقام الإِضمار للاهتمام ، وقد تكرر هذا اللفظ ثلاث مرات والمرات الثلاث ينتهي عندها التكرير غالباً كقوله تعالى : { وإن منهم لفريقاً يلوون ألسنتهم بالكتاب لتحسبوه من الكتاب وما هو من الكتاب } [ آل عمران : 78 ] .وقول عديّ :لا أرى الموتَ يسبق الموتَ شيءٌ ... نَغَّص الموتُ ذا الغنى والفقيراومما ينبغي التنبه له ما وقع في «جامع الترمذي» بسنده إلى القاسم بن الفضل الحُدَّاني عن يوسف بن سَعد قال : «قام رجل إلى الحسن بن علي بعدما بايع معاوية فقال : سَّوَدتَ وجوهَ المؤمنين ، أوْ يا مُسوِّد وجوهِ المؤمنين فقال : لا تؤنبني رَحمك الله فإن النبي صلى الله عليه وسلم أري بني أمية على منبره فساءه ذلك فنزلت : { إنا أعطيناك الكوثر } [ الكوثر : 1 ] يا محمّد يعني نهراً في الجنة ، ونزلت : { إنا أنزلناه في ليلة القدر وما أدراك ما ليلة القدر ليلة القدر خير من ألف شهر } [ القدر : 1 3 ] يملكها بنو أمية يا محمدُ قال القاسم : فعددناها فإذا هي ألف شهر لا يَزيدُ يومٌ ولا ينقص» .قال أبو عيسى الترمذي ، هذا حديث غريب لا نعرفه إلا من هذا الوجه . î وقد قيل عن القاسم بن الفضل عن يوسف بن مازِن نعرفه والقاسم بن الفضل ثقة ويُوسف بن سَعْد رجل مجهول اه .قال ابن كثير في «تفسيره» ورواه ابن جرير من طريق القاسم بن الفضل عن عيسى بن مازن كذا قال ، وعيسى بن مازن غير معروف ، وهذا يقتضي اضطراباً في هذا الحديث ، أي لاضطرابهم في الذي يروي عنه القاسم بن الفضل ، وعلى كل احتمال فهو مجهول .وأقول : وأيضاً ليس في سنده ما يفيد أن يوسف بن سعد سمع ذلك من الحسن رضي الله عنه . وفي «تفسير الطبري» عن عيسى بن مازن أنه قال : قلت للحسن : يا مسود وجوه المؤمنين إلى آخر الحديث . وعيسى بن مازن غير معروف أصلاً فإذا فرضنا توثيق يوسف بن سعد فليس في روايته ما يقتضي أنه سمعه بل يجوز أن يكون أراد ذكر قصة تُروى عن الحسن .واتفق حذاق العلماء على أنه حديث منكر صرح بذلك ابن كثير وذكره عن شيخه المزي ، وأقول : هو مختل المعنى وسمات الوضع لائحة عليه وهو من وضع أهل النحَل المخالفةِ للجماعة فالاحتجاجُ به لا يليق أن يصدر مثله عن الحسن مع فرط علمه وفطنته ، وأيَّة ملازمة بين ما زعموه من رؤيا رسول الله صلى الله عليه وسلم وبين دفع الحسن التأنيب عن نفسه ، ولا شك أن هذا الخبر من وضع دُعاة العباسيين على أنه مخالف للواقع لأن المدة التي بين تسليم الحسن الخلافة إلى معاوية وبين بيعة السفاح وهو أول خلفاء العباسية ألف شهر واثنان وتسعون شهراً أو أكثر بشهر أو بشهرين فما نُسب إلى القاسم الحُدَّاني من قوله : فعددناها فوجدناها الخ كذب لا محالة . والحاصل أن هذا الخبر الذي أخرجه الترمذي منكر كما قاله المِزِّي .قال ابن عرفة وفي قوله : { ليلة القدر خير من ألف شهر } المحسن المسمّى تَشابه الأطراف وهو إعادة لفظ القافية في الجملة التي تليها كقوله تعالى : { كمشكاة فيها مصباح المصباحُ في زجاجة الزجاجةُ كأنها كوكب دري } [ النور : 35 ] اه . يريد بالقافية ما يشمل القرينة في الأسجاع والفواصلَ في الآي ، ومثاله في الشعر قول ليلى الأخيلية :إذا نزل الحجاج أرضاً مريضة ... تتبع أقصى دائها فشفاهاشفاها من الداء العضال الذي بها ... غلامٌ إذا هز القناة سقاها الخ\n","ar.waseet":"ثم - بين - سبحانه - مظاهر فضلها فقال : ( لَيْلَةُ القدر خَيْرٌ مِّنْ أَلْفِ شَهْرٍ ) أى : ليلة القدر أفضل من ألف شهر ، بسبب ما أنزل فيها من قرآن كريم يهدى للتى هى أقوم . ويخرج الناس من الظلمات إلى النور ، وبسبب أن العباد فيها أكثر ثواباً ، وأعظم فضلا من العبادة فى أشهر كثيرة ليس فيها ليلة القدر .والعمل القليل قد يفضل العمل الكثير ، باعتبار الزمان والمكان ، وإخلاص النية ، وحسن الأداء ، ولله - تعالى - أن يخص بعض الأزمنة والأمكنة والأشخاص بفضائل متميزة .والتحديد بألف شهر يمكن أن يكون مقصودا . ويمكن أن يراد منه التكثير . وأن المراد أن أقل عدد تفضله هذه الليلة هو هذا العدد . فيكون المعنى : أن هذه الليلة تفضل الدهر كله .\n","ar.baghawi":"قوله - عز وجل - : ( ليلة القدر خير من ألف شهر ) قال عطاء عن ابن عباس : ذكر لرسول الله - صلى الله عليه وسلم - رجل من بني إسرائيل حمل السلاح على عاتقه في سبيل الله ألف شهر ، فعجب رسول الله - صلى الله عليه وسلم - لذلك وتمنى ذلك لأمته ، فقال : يا رب جعلت أمتي أقصر الأمم أعمارا وأقلها أعمالا ؟ فأعطاه الله ليلة القدر ، فقال : ( ليلة القدر خير من ألف شهر ) التي حمل فيها الإسرائيلي السلاح في سبيل الله ، لك ولأمتك إلى يوم القيامة .قال المفسرون : \" ليلة القدر خير من ألف شهر \" معناه : عمل صالح في ليلة القدر خير من عمل ألف شهر ليس فيها ليلة القدر .حدثنا أبو القاسم عبد الكريم بن هوازن القشيري ، إملاء ، حدثنا أبو نعيم الإسفراييني ، أخبرنا أبو عوانة ، حدثنا أبو إسماعيل ، حدثنا الحميدي ، حدثنا سفيان ، حدثنا الزهري ، أخبرني أبو سلمة عن أبي هريرة أن النبي - صلى الله عليه وسلم - قال : \" من قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه \" .قال سعيد بن المسيب : من شهد المغرب والعشاء في جماعة فقد أخذ بحظه من ليلة القدر .أخبرنا أحمد بن إبراهيم الشريحي ، أخبرنا أبو إسحاق الثعلبي ، أخبرنا أبو بكر بن عبدوس المزكي ، حدثنا أبو العباس محمد بن يعقوب ، حدثنا الحسن بن مكرم ، حدثنا يزيد بن هارون ، أخبرنا كهمس عن عبد الله بن بريدة أن عائشة قالت للنبي - صلى الله عليه وسلم - : إن وافيت ليلة القدر فما أقول ؟ قال : \" قولي : اللهم إنك عفو تحب العفو فاعف عني \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6128.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6128.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6128.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ","transliteration":"Tanaz zalul malaa-ikatu war roohu feeha bi izni-rab bihim min kulli amr","translations":{"en.ahmedali":"On (this night) the angels and grace descend by the dispensation of their Lord, for settling all affairs.","en.ahmedraza":"In it descend the angels and Jibreel, by the command of their Lord – for all works.","en.arberry":"in it the angels and the Spirit descend, by the leave of their Lord, upon every command.","en.asad":"in hosts descend in it the angels, bearing divine inspiration by their Sustainer's leave; from all [evil] that may happen","en.daryabadi":"The angels and the spirit descend therein by the command of their Lord with His decrees for every affair.","en.hilali":"Therein descend the angels and the Ruh [Jibrael (Gabriel)] by Allah's Permission with all Decrees,","en.pickthall":"The angels and the Spirit descend therein, by the permission of their Lord, with all decrees.","en.qaribullah":"in it the angels and the Spirit (Gabriel) descend by the permission of their Lord upon every command.","en.sahih":"The angels and the Spirit descend therein by permission of their Lord for every matter.","en.sarwar":"On this Night, the angels and the spirit descend by the permission of their Lord with His decree (to determine everyone's destiny).","en.yusufali":"Therein come down the angels and the Spirit by Allah's permission, on every errand:","en.maududi":"The angels along with the Spirit descend in it by the permission of their Lord with all kinds of decrees.","en.shakir":"The angels and Jibreel descend in it by the permission of their Lord for every affair,","en.itani":"In it descend the angels and the Spirit, by the leave of their Lord, with every command.","en.mubarakpuri":"Therein descend the angels and the Ruh by their Lord's permission with every matter.","en.qarai":"In it the angels and the Spirit descend, by the leave of their Lord, with every command.","en.wahiduddin":"on that night, the angels and the Spirit come down by the permission of their Lord with His decrees for all matters;"},"tafsir":{"ar.muyassar":"يكثر نزول الملائكة وجبريل عليه السلام فيها، بإذن ربهم من كل أمر قضاه في تلك السنة.","ar.jalalayn":"«تنزَّل الملائكة» بحذف إحدى التاءين من الأصل «والروح» أي جبريل «فيها» في الليلة «بإذن ربهم» بأمره «من كل أمر» قضاه الله فيها لتلك السنة إلى قابل ومن سببيه بمعنى الباء.","ar.qurtubi":"قوله تعالى : تنزل الملائكة والروح فيها بإذن ربهم من كل أمرقوله تعالى : تنزل الملائكة أي تهبط من كل سماء ، ومن سدرة المنتهى ; ومسكن جبريل على وسطها . فينزلون إلى الأرض ويؤمنون على دعاء الناس ، إلى وقت طلوع الفجر ; فذلك قوله تعالى : تنزل الملائكة والروح فيها بإذن ربهمأي جبريل - عليه السلام - . وحكى القشيري : أن الروح صنف من الملائكة ، جعلوا حفظة على سائرهم ، وأن الملائكة لا يرونهم ، كما لا نرى نحن الملائكة .وقال مقاتل : هم أشرف الملائكة . وأقربهم من الله تعالى . وقيل : إنهم جند من جند الله - عز وجل - من غير الملائكة . رواه مجاهد عن ابن عباس مرفوعا ; ذكره الماوردي وحكى القشيري : قيل هم صنف من خلق الله يأكلون الطعام ، ولهم أيد وأرجل ; وليسوا ملائكة . وقيل : الروح خلق عظيم يقوم صفا ، والملائكة كلهم صفا . وقيل : الروح الرحمة ينزل بها جبريل - عليه السلام - مع الملائكة في هذه الليلة على أهلها ; دليله : ينزل الملائكة بالروح من أمره على من يشاء من عباده ، أي بالرحمة . فيها أي في ليلة القدر . بإذن ربهم أي بأمره .من كل أمر أمر بكل أمر قدره الله وقضاه في تلك السنة إلى قابل ; قاله ابن عباس ; كقوله تعالى : يحفظونه من أمر الله أي بأمر الله . وقراءة العامة تنزل بفتح التاء ; إلا أن البزي شدد التاء . وقرأ طلحة بن مصرف وابن السميقع ، بضم التاء على الفعل المجهول . وقرأ علي وابن عباس وعكرمة والكلبي ( من كل امرئ ) .وروي عن ابن عباس أن معناه : من كل ملك ; وتأولها الكلبي على أن جبريل ينزل فيها مع الملائكة ، فيسلمون على كل امرئ مسلم . ( فمن ) بمعنى على . وعن أنس قال : قال النبي - صلى الله عليه وسلم - : إذا كان ليلة القدر نزل جبريل في كبكبة من الملائكة ، يصلون ويسلمون على كل عبد قائم أو قاعد يذكر الله تعالى .\n","ar.miqbas":"تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ (4) إذا ضُم هذا البيان الثاني لما في قوله : { وما أدراك ما ليلة القدر } [ القدر : 2 ] من الإِبهام التفخيمي حصل منهما ما يدل دلالةً بيّنة على أن الله جعل مثل هذه الفضيلة لكل ليلة من ليالي الأعوام تقع في مثل الليلة من شهر نزول القرآن كرامةً للقرآن ، ولمن أنزل عليه ، وللدِّين الذي نزل فيه ، وللأمة التي تتبعه ، ألا ترى أن معظم السورة كان لذكر فضائل ليلة القدر فما هو إلا للتحريض على تطلب العمل الصالح فيها ، فإن كونها خيراً من ألف شهر أومأ إلى ذلك وبينته الأخبار الصحيحة . والتعبير بالفعل المضارع في قوله : { تنزل الملائكة } مؤذن بأن هذا التنزل متكرر في المستقبل بعد نزول هذه السورة .وذِكر نهايتها بطلوع الفجر لا أثرَ له في بيان فضلها فتعين أنه إدماج للتعريف بمنتهاهَا ليحرص الناسُ على كثرة العمل فيها قبل انتهائها .لا جرم أن ليلة القدر التي ابتدىء فيها نزول القرآن قد انقضت قبل أن يشعر بها أحد عدا محمد صلى الله عليه وسلم إذْ كان قد تحنث فيها ، وأنزل عليه أول القرآن آخرها ، وانقلب إلى أهله في صبيحتها ، فلولا إرادة التعريف بفضل الليالي الموافقة لها في كل السنوات لاقتُصر على بيان فضل تلك الليلة الأولى ولما كانت حاجة إلى تَنزّل الملائكة فيها ، ولا إلى تعيين منتهاها .وهذا تعليم للمسلمين أن يَعظموا أيام فضلهم الديني وأيام نَعم الله عليهم ، وهو مماثل لما شرع الله لموسى من تفضيل بعض أيام السنين التي توافق أياماً حصلت فيها نعم عظمى من الله على موسى قال تعالى : { وذكرهم بأيام اللَّه } [ إبراهيم : 5 ] فينبغي أن تعد ليلة القدر عيد نزول القرآن .وحكمة إخفاء تعيينها إرادةُ أن يكرر المسلمون حسناتهم في ليال كثيرة توخياً لمصادفة ليلة القدر كما أخفيت ساعةُ الإِجابة يوم الجمعة .هذا محصّل ما أفاده القرآن في فضل ليلة القدر من كل عام ولم يبين أنها أيَّةُ ليلة ، ولا من أي شهر ، وقد قال تعالى : { شهر رمضان الذي أنزل فيه القرآن } [ البقرة : 185 ] فتبين أن ليلة القدر الأولى هي من ليالي شهر رمضان لا محالة ، فبنا أن نتطلب تعيين ليلة القدر الأولى التي ابتدِىء إنزال القرآن فيها لنطلب تعيين ما يماثلها من ليالي رمضان في جميع السّنين ، وتعيين صفة المماثلة ، والمماثلةُ تكون في صفات مختلفة فلا جائز أن تُماثلها في اسم يومها نحو الثلاثاء أو الأربعاء ، ولا في الفصل من شتاءٍ أو صيف أو نحو ذلك مما ليس من الأحوال المعتبرة في الدين ، فعلينا أن نتطلب جهة من جهات المماثلة لها في اعتبار الدين وما يرضي الله . وقد اختُلف في تعيين المماثلة اختلافاً كثيراً وأصح ما يعتمد في ذلك : أنها من ليالي شهر رمضان من كل سنة وأنها من ليالي الوتر كما دل عليه الحديث الصحيح :« تحروا ليلة القدر في الوتر في العشر الأواخر من رمضان » .والوتر : أفضل الأعداد عند الله كما دل عليه حديث : « إن الله وِتر يحب الوتر » .وأنّها ليست ليلة معينة مطّردة في كل السنين بل هي متنقلة في الأعوام ، وأنها في رمضان وإلى هذا ذهب مالك والشافعي وأحمد وأكثر أهل العلم قال ابن رشيد : وهو أصح الأقاويل وأوْلاها بالصواب . وعلَى أنها متنقلة في الأعوام فأكثر أهل العلم على أنها لا تخرج عن شهر رمضان . والجمهور على أنها لا تخرج عن العشر الأواخر منه ، وقال جماعة : لا تخرج عن العَشْر الأوَاسط ، والعَشْر الأواخر .وتأوّلوا ما ورد من الآثار ضبطها على إرادة الغالب أو إرادة عام بعينه .ولم يرد في تعيينها شيء صريح يُروى عن النبي صلى الله عليه وسلم لأن ما ورد في ذلك من الأخبار محتمل لأن يكون أراد به تعيينها في خصوص السنة التي أخبر عنها وذلك مبسوط في كتب السنة فلا نطيل به ، وقد أتى ابن كثير منه بكثير .وحفظت عن الشيخ محي الدين بن العربي أنه ضبط تعيينها باختلاف السنين بأبيات ذكر في البيت الأخير منها قوله: ... وضابطها بالقول ليلة جمعةٍتوافيك بعد النصفْ في ليلة وتر ... حفظناها عن بعض مُعلمينا ولم أقف عليها . وجربنا علامة ضوء الشمس في صبيحتها فلم تتخلف .وأصل { تنزل } تتنزل فحذفت إحدى التاءَيْن اختصاراً . وظاهر أن تنزل الملائكة إلى الأرض .ونزول الملائكة إلى الأرض لأجل البركات التي تحفهم .و { الروح } : هو جبريل ، أي ينزل جبريل في الملائكة .ومعنى { بإذن ربهم } أن هذا التنزل كرامة أكْرم الله بها المسلمين بأن أنزل لهم في تلك الليلة جماعات من ملائكته وفيهم أشرفهم وكان نزول جبريل في تلك الليلة ليعود عليها من الفضل مثل الذي حصل في مماثلتها الأولى ليلة نزوله بالوحي في غار حِراء .وفي هذا أصل لإِقامة المواكب لإِحياء ذكرى أيام مجد الإِسلام وفضله وأن من كان له عمل في أصل تلك الذكرى ينبغي أن لا يخلو عنه موكب البهجة بتذكارها .وقوله : { بإذن ربهم } متعلق ب { تنزل } إما بمعنى السببية ، أي يتنزلون بسبب إذن ربهم لهم في النزول فالإِذن بمعنى المصدر ، وإما بمعنى المصاحبة ، أي مصاحبين لما أذِن به ربهم ، فالإِذن بمعنى المأذون به من إطلاق المصدر على المفعول نحو : { هذا خَلْق الله } [ لقمان : 11 ] .و { مِن } في قوله { من كل أمر } يجوز أن تكون بيانية تبين الإِذن من قوله : { بإذن ربهم } ، أي بإذن ربهم الذي هو في كل أمر .ويجوز أن تكون بمعنى الباء ، أي تتنزل بكل أمر مِثل ما في قوله تعالى : { يحفظونه من أمر اللَّه }[ الرعد : 11 ] أي بأمر الله ، وهذا إذا جعلت باء { بإذن ربهم } سببية ، ويجوز أن تكون للتعليل ، أي من أجل كل أمر أراد الله قضاءه بتسخيرهم .و { كل } مستعملة في معنى الكثرة للأهمية ، أي في أمور كثيرة عظيمة كقوله تعالى : { ولو جاءتهم كل آية } [ يونس : 97 ] وقوله : { يأتوك رجالاً وعلى كل ضامر } [ الحج : 27 ] وقوله : { واضربوا منهم كل بنان } [ الأنفال : 12 ] . وقول النابغة: ... بها كلَّ ذيَّال وخنساءَ تَرْعويإلى كل رَجَّاف من الرمل فارد ... وقد بينا ذلك عند قوله تعالى : { وعلى كل ضامر } في سورة الحج ( 27 ) .وتنوين أمر } للتعظيم ، أي بأنواع الثواب على الأعمال في تلك الليلة . وهذا الأمر غير الأمر الذي في قوله تعالى : { فيها يفرق كل أمر حكيم } [ الدخان : 4 ] مع أن { أمراً من عندنا } في سورة الدخان ( 5 ) متحدة مع اختلاف شؤونها ، فإن لها شؤوناً عديدة .ويجوز أن يكون هو الأمر المذكور هنا فيكون هنا مطلقاً وفي آية الدخان مقيداً .واعلم أن موقع قوله : تنزل الملائكة والروح فيها } إلى قوله : { من كل أمر } ، من جملة : { ليلة القدر خير من ألف شهر } [ القدر : 3 ] موقع الاستئناف البياني أو موقع بدل الاشتمال فلمراعاة هذا الموقع فصلت الجملة عن التي قبلها ولم تعطف عليها مع أنهما مشتركتان في كون كل واحدة منهما تفيد بياناً لجملة : { وما أدراك ما ليلة القدر } [ القدر : 2 ] ، فأوثرت مراعاةُ موقعها الاستئنافي أو البدلي على مراعاة اشتراكهما في كونها بياناً لجملة : { وما أدراك ما ليلة القدر } لأن هذا البيان لا يفوت السامع عند إيرادها في صورة البيان أو البدل بخلاف ما لو عطفت على التي قبلها بالواو لفوات الإِشارة إلى أن تنزل الملائكة فيها من أحوال خيريتها .\n","ar.waseet":"ثم ذكر - سبحانه - بعد ذلك مزية أخرى لهذه الليلة المباركة فقال : ( تَنَزَّلُ الملائكة والروح فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ ) .أى : ومن مزايا وفضائل هذه الليلة أيضا ، أن الملائكة - وعلى رأسهم الروح الأمين جبريل - ينزلون فيها أفواجا إلى الأرض ، بأمره - تعالى - وإذنه ، وهم جميعا إنما ينزلونمن أجل أمر من الأمور التى يريد إبلاغها إلى عباده ، وأصل \" تنزل \" تتنزل ، فحذفت إحدى التاءين تخفيفا ، ونزول الملائكة إلى الأرض ، من أجل نشر البركات التى تحفهم ، فنزولهم فى تلك الليلة يدل على شرفها ، وعلى رحمة الله - تعالى - بعباده .والروح : هو جبريل ، وذكره بخصوصه بعد ذكر الملائكة ، من باب ذكر الخاص بعد العام ، لمزيد الفضل ، واختصاصه بأمور لا يشاركه فيها غيره .وقوله - سبحانه - ( بِإِذْنِ رَبِّهِم ) متعلق بقوله : ( تنزل ) ، والباء للسببية ، أى : يتنزلون بسبب إذن ربهم لهم فى النزول .قال الجمل ما ملخصه . وقوله : ( مِّن كُلِّ أَمْرٍ ) يجوز فى \" من \" وجهان : أحدهما أنها بمعنى اللام ، وتتعلق بتنزل ، تنزل من أجل كل أمر قضى إلى العام القابل .والثانى : أنها بمعنى الباء ، أى : تنزل بكل أمر قضاه الله - تعالى - فيها من موت وحياة ورزق .وليس المراد أن تقدير الله لا يحدث إلا فى تلك الليلة بل المراد إظهار تلك المقادير لملائكته .\n","ar.baghawi":"وله - عز وجل - : ( تنزل الملائكة والروح ) يعني جبريل - عليه السلام - معهم ، ( فيها ) أي في ليلة القدر ، ( بإذن ربهم من كل أمر ) أي بكل أمر من الخير والبركة ، كقوله : \" يحفظونه من أمر الله \" ( الرعد - 11 ) أي بأمر الله .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6129.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6129.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6129.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ","transliteration":"Salaamun hiya hattaa mat la'il fajr","translations":{"en.ahmedali":"It is peace till the dawning of the day.","en.ahmedraza":"It is peace until the rising of dawn.","en.arberry":"Peace it is, till the rising of dawn.","en.asad":"does it make secure, until the rise of dawn.","en.daryabadi":"It is all peace, until the rising of the dawn.","en.hilali":"Peace! (All that night, there is Peace and Goodness from Allah to His believing slaves) until the appearance of dawn.","en.pickthall":"(The night is) Peace until the rising of the dawn.","en.qaribullah":"Peace it is, till the break of dawn.","en.sahih":"Peace it is until the emergence of dawn.","en.sarwar":"This Night is all peace until the break of dawn.","en.yusufali":"Peace!... This until the rise of morn!","en.maududi":"All peace is that night until the rise of dawn.","en.shakir":"Peace! it is till the break of the morning.","en.itani":"Peace it is; until the rise of dawn.","en.mubarakpuri":"There is peace until the appearance of dawn.","en.qarai":"It is peaceful until the rising of the dawn.","en.wahiduddin":"it is all peace till the break of dawn."},"tafsir":{"ar.muyassar":"هي أمن كلها، لا شرَّ فيها إلى مطلع الفجر.","ar.jalalayn":"«سلام هي» خبر مقدم ومبتدأ «حتى مطلع الفجر» بفتح اللام وكسرها إلى وقت طلوعه، جُعلت سلاما لكثرة السلام فيها من الملائكة لا تمر بمؤمن ولا مؤمنة إلا سلمت عليه.","ar.qurtubi":"قوله تعالى : سلام هي حتى مطلع الفجر [ ص: 119 ] قيل : إن تمام الكلام من كل أمر ثم قال سلام . روي ذلك عن نافع وغيره ; أي ليلة القدر سلامة وخير كلها لا شر فيها . حتى مطلع الفجر أي إلى طلوع الفجر . قال الضحاك : لا يقدر الله في تلك الليلة إلا السلامة ، وفي سائر الليالي يقضي بالبلايا والسلامة وقيل : أي هي سلام ; أي ذات سلامة من أن يؤثر فيها شيطان في مؤمن ومؤمنة . وكذا قال مجاهد : هي ليلة سالمة ، لا يستطيع الشيطان أن يعمل فيها سوءا ولا أذى . وروي مرفوعا . وقال الشعبي : هو تسليم الملائكة على أهل المساجد ، من حين تغيب الشمس إلى أن يطلع الفجر ; يمرون على كل مؤمن ، ويقولون : السلام عليك أيها المؤمن . وقيل : يعني سلام الملائكة بعضهم على بعض فيها .وقال قتادة : سلام هي : خير هي . حتى مطلع الفجر أي إلى مطلع الفجر . وقرأ الكسائي وابن محيصن ( مطلع ) بكسر اللام ، الباقون بالفتح . والفتح والكسر : لغتان في المصدر . والفتح الأصل في فعل يفعل ; نحو المقتل والمخرج . والكسر على أنه مما شذ عن قياسه ; نحو المشرق والمغرب والمنبت والمسكن والمنسك والمحشر والمسقط والمجزر . حكي في ذلك كله الفتح والكسر ، على أن يراد به المصدر لا الاسم .وهنا ثلاث مسائل :الأولى : في تعيين ليلة القدر ; وقد اختلف العلماء في ذلك . والذي عليه المعظم أنها ليلة سبع وعشرين ; لحديث زر بن حبيش قال : قلت لأبي بن كعب : إن أخاك عبد الله بن مسعود يقول : ( من يقم الحول يصب ليلة القدر . فقال : يغفر الله لأبي عبد الرحمن ! لقد علم أنها في العشر الأواخر من رمضان ، وأنها ليلة سبع وعشرين ; ولكنه أراد ألا يتكل الناس ; ثم حلف لا يستثني أنها ليلة سبع وعشرين . قال قلت : بأي شيء تقول ذلك يا أبا المنذر ؟ قال : بالآية التي أخبرنا بها رسول الله - صلى الله عليه وسلم - ، أو بالعلامة أن الشمس تطلع يومئذ لا شعاع لها ) .قال الترمذي : حديث حسن صحيح . وخرجه مسلم . وقيل : هي في شهر رمضان دون سائر العام ; قاله أبو هريرة وغيره . وقيل : هي في ليالي السنة كلها . فمن علق طلاق امرأته أو عتق عبده بليلة القدر ، لم يقع العتق والطلاق إلا بعد مضي سنة من يوم حلف ; لأنه لا يجوز إيقاع الطلاق بالشك ، ولم يثبت اختصاصها بوقت ; فلا ينبغي وقوع الطلاق إلا بمضي حول . وكذلك العتق ; وما كان مثله من يمين أو غيره .وقال ابن مسعود : من يقم الحول يصبها ; فبلغ ذلك [ ص: 120 ] ابن عمر ، فقال : يرحم الله أبا عبد الرحمن ! أما إنه علم أنها في العشر الأواخر من شهر رمضان ; ولكنه أراد ألا يتكل الناس . وإلى هذا القول ذهب أبو حنيفة أنها في جميع السنة . وقيل عنه : إنها رفعت - يعني ليلة القدر - وأنها إنما كانت مرة واحدة ; والصحيح أنها باقية . وروي عن ابن مسعود أيضا : أنها إذا كانت في يوم من هذه السنة ، كانت في العام المقبل في يوم آخر . والجمهور على أنها في كل عام من رمضان . ثم قيل : إنها الليلة الأولى من الشهر ; قاله أبو رزين العقيلي . وقال الحسن وابن إسحاق وعبد الله بن الزبير : هي ليلة سبع عشرة من رمضان ، وهي الليلة التي كانت صبيحتها وقعة بدر كأنهم نزعوا بقوله تعالى : وما أنزلنا على عبدنا يوم الفرقان يوم التقى الجمعان ، وكان ذلك ليلة سبع عشرة ، وقيل هي ليلة التاسع عشر . والصحيح المشهور : أنها في العشر الأواخر من رمضان ; وهو قول مالك والشافعي والأوزاعي وأبي ثور وأحمد . ثم قال قوم : هي ليلة الحادي والعشرين . ومال إليه الشافعي - رضي الله عنه - ; لحديث الماء والطين ورواه أبو سعيد الخدري ، خرجه مالك وغيره . وقيل ليلة الثالث والعشرين ; لما رواه ابن عمر أن رجلا قال : يا رسول الله إني رأيت ليلة القدر في سابعة تبقى . فقال النبي - صلى الله عليه وسلم - : \" أرى رؤياكم قد تواطأت على ثلاث وعشرين ، فمن أراد أن يقوم من الشهر شيئا فليقم ليلة ثلاث وعشرين \" .قال معمر : فكان أيوب يغتسل ليلة ثلاث وعشرين ويمس طيبا . وفي صحيح مسلم أن النبي - صلى الله عليه وسلم - قال : \" إني رأيت أني أسجد في صبيحتها في ماء وطين \" . قال عبد الله بن أنيس : فرأيته في صبيحة ليلة ثلاث وعشرين في الماء والطين ، كما أخبر رسول الله - صلى الله عليه وسلم - . وقيل : ليلة خمس وعشرين ; لحديث أبي سعيد الخدري : أن رسول الله - صلى الله عليه وسلم - قال : \" التمسوها في العشر الأواخر في تاسعة تبقى ، في سابعة تبقى ، في خامسة تبقى \" . رواه مسلم ، قال مالك : يريد بالتاسعة ليلة إحدى وعشرين ، والسابعة ليلة ثلاث [ ص: 121 ] وعشرين ، والخامسة ليلة خمس وعشرين . وقيل : ليلة سبع وعشرين . وقد مضى دليله ، وهو قول علي - رضي الله عنه - وعائشة ومعاوية وأبي بن كعب . وروى ابن عمر أن رسول الله - صلى الله عليه وسلم - قال : \" من كان متحريا ليلة القدر ، فليتحرها ليلة سبع وعشرين \" .وقال أبي بن كعب : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" ليلة القدر ليلة سبع وعشرين \" . وقال أبو بكر الوراق : إن الله تعالى قسم ليالي هذا الشهر - شهر رمضان - على كلمات هذه السورة ، فلما بلغ السابعة والعشرين أشار إليها فقال : هي . وأيضا فإن ليلة القدر كرر ذكرها ثلاث مرات ، وهي تسعة أحرف ، فتجيء سبعا وعشرين . وقيل : هي ليلة تسع وعشرين ; لما روي أن النبي - صلى الله عليه وسلم - قال : \" ليلة القدر التاسعة والعشرون - أو السابعة والعشرون - وأن الملائكة في تلك الليلة بعدد الحصى \" . وقد قيل : إنها في الأشفاع .قال الحسن : ارتقبت الشمس ليلة أربع وعشرين عشرين سنة ، فرأيتها تطلع بيضاء لا شعاع لها . يعني من كثرة الأنوار في تلك الليلة . وقيل إنها مستورة في جميع السنة ، ليجتهد المرء في إحياء جميع الليالي . وقيل : أخفاها في جميع شهر رمضان ، ليجتهدوا في العمل والعبادة ليالي شهر رمضان ، طمعا في إدراكها ، كما أخفى الصلاة الوسطى في الصلوات ، واسمه الأعظم في أسمائه الحسنى ، وساعة الإجابة في ساعات الجمعة وساعات الليل ، وغضبه في المعاصي ، ورضاه في الطاعات ، وقيام الساعة في الأوقات ، والعبد الصالح بين العباد ; رحمة منه وحكمة .الثانية : في علاماتها : منها أن الشمس ، تطلع في صبيحتها بيضاء لا شعاع لها . وقال الحسن قال النبي - صلى الله عليه وسلم - في ليلة القدر : \" إن من أماراتها : أنها ليلة سمحة بلجة ، لا حارة ولا باردة ، تطلع الشمس صبيحتها ليس لها شعاع \" . وقال عبيد بن عمير : كنت ليلة السابع والعشرين في البحر ، فأخذت من مائه ، فوجدته عذبا سلسا .الثالثة : في فضائلها . وحسبك بقوله تعالى : ليلة القدر خير من ألف شهر وقوله تعالى : تنزل الملائكة والروح فيها . وفي الصحيحين : من قام ليلة القدر إيمانا واحتسابا [ ص: 122 ] غفر الله له ما تقدم من ذنبه رواه أبو هريرة . وقال ابن عباس : قال النبي - صلى الله عليه وسلم - : \" إذا كان ليلة القدر ، تنزل الملائكة الذين هم سكان سدرة المنتهى ، منهم جبريل ، ومعهم ألوية ينصب منها لواء على قبري ، ولواء على بيت المقدس ، ولواء على المسجد الحرام ، ولواء على طور سيناء ، ولا تدع فيها مؤمنا ولا مؤمنة إلا تسلم عليه ، إلا مدمن الخمر ، وآكل الخنزير ، والمتضمخ بالزعفران \" .وفي الحديث : \" إن الشيطان لا يخرج في هذه الليلة حتى يضيء فجرها ، ولا يستطيع أن يصيب فيها أحدا بخبل ولا شيء من الفساد ، ولا ينفذ فيها سحر ساحر \" .وقال الشعبي : وليلها كيومها ، ويومها كليلها . وقال الفراء : لا يقدر الله في ليلة القدر إلا السعادة والنعم ، ويقدر في غيرها البلايا والنقم ; وقد تقدم عن الضحاك . ومثله لا يقال من جهة الرأي ، فهو مرفوع . والله أعلم . وقال سعيد بن المسيب في الموطأ : من شهد العشاء من ليلة القدر ، فقد أخذ بحظه منها ، ومثله لا يدرك بالرأي . وقد روى عبيد الله بن عامر بن ربيعة : أن رسول الله - صلى الله عليه وسلم - قال : \" من صلى صلاة المغرب والعشاء الآخرة من ليلة القدر في جماعة فقد أخذ بحظه من ليلة القدر \" ذكره الثعلبي في تفسيره . وقالت عائشة - رضي الله عنها - : قلت : يا رسول الله إن وافقت ليلة القدر فما أقول ؟ قال : ( قولي اللهم إنك عفو تحب العفو فاعف عني .\n","ar.miqbas":"سَلَامٌ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ (5)وجملة : { سلام هي حتى مطلع الفجر } بيان لمضمون { من كل أمر } وهو كالاحتراس لأنّ تنزّل الملائكة يكون للخير ويكون للشر لعقاب مكذبي الرسل قال تعالى : { ما تنزل الملائكة إلا بالحق وما كانوا إذاً منظرين } [ الحجر : 8 ] وقال : { يوم يرون الملائكة لا بشرى يومئذ للمجرمين } [ الفرقان : 22 ] . وجُمع بين إنزالهم للخير والشر في قوله : { إذ يُوحي ربك إلى الملائكة أني معكم فثبتوا الذين آمنوا سألقي في قلوب الذين كفروا الرعب فاضربوا فوق الأعناق } [ الأنفال : 12 ] الآية ، فأخبر هنا أن تنزل الملائكة ليلة القدر لتنفيذ أمر الخير للمسلمين الذين صاموا رمضان وقاموا ليلة القدر ، فهذه بشارة .والسلام : مصدر أو اسم مصدر معناه السلامة قال تعالى : { قلنا يا نار كوني برداً وسلاماً على إبراهيم } [ الأنبياء : 69 ] . ويطلق السلام على التحية والمِدحة ، وفسر السلام بالخَيْر ، والمعنيان حاصلان في هذه الآية ، فالسلامة تشمل كل خير لأن الخيْر سلامة من الشر ومن الأذى ، فيشمل السلامُ الغفرانَ وإجزال الثواب واستجابة الدعاء بخير الدنيا والآخرة . والسلام بمعنى التحية والقول الحسن مراد به ثناء الملائكة على أهل ليلة القدر كدأبهم مع أهل الجنة فيما حكاه قوله تعالى : { والملائكة يدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار }[ الرعد : 23 ، 24 ] .وتنكير { سلام } للتعظيم . وأخبر عن الليلة بأنها سلام للمبالغة لأنه إخبار بالمصدر .وتقديم المسند وهو { سلام } على المسند إليه لإِفادة الاختصاص ، أي ما هي إلا سلام . والقصر ادعائي لعدم الاعتداد بما يحصل فيها لغير الصائمين القائمين ، ثم يجوز أن يكون { سلام هي } مراداً به الإِخبار فقط ، ويجوز أن يراد بالمصدر الأمرُ ، والتقدير : سلِّمُوا سلاماً ، فالمصدر بدل من الفعل وعدل عن نصبه إلى الرفع ليفيد التمكن مثل قوله تعالى : { قالوا سلاماً قال سلام } [ الذاريات : 25 ] . والمعنى : اجعلوها سلاماً بينكم ، أي لا نزاع ولا خصام . ويشير إليه ما في الحديث الصحيح : « خرجتُ لأخْبِرَكم بليلة القدر فتلاحَى رجلان فرُفِعَتْ وعسى أن يكون خيراً لكم فالتمسوها في التاسعة والسابعة والخامسة » .و { حتى مطلع الفجر } غاية لما قبله من قوله : { تنزل الملائكة } إلى { سلام هي } .والمقصود من الغاية إفادة أن جميع أحيان تلك الليلة معمورة بنزول الملائكة والسلامة ، فالغاية هنا مؤكدة لمدلول { ليلة } [ القدر : 1 ] لأن الليلة قد تطلق على بعض أجزائها كما في قول النبي صلى الله عليه وسلم « من قام ليلة القدر إيماناً واحتساباً غفر له ما تقدم من ذَنْبه » أي من قام بعضها ، فقد قال سعيد بن المسيب : من شهد العشاء من ليلة القدر فقد أخذ بحَظه منها . يريد شهدها في جماعة كما يقتضيه فعل شهد ، فإن شهود الجماعة من أفضل الأعمال الصالحة .وجيء بحرف { حتى } لإِدخال الغاية لبيان أن ليلة القدر تمتد بعد مطلع الفجر بحيث أن صلاة الفجر تعتبر واقعة في تلك الليلة لئلا يتوهم أن نهايتها كنهاية الفِطر بآخر جزء من الليل ، وهذا توسعة من الله في امتداد الليلة إلى ما بعد طلوع الفجر .ويستفاد من غاية تَنَزُّللِ الملائكة فيها ، أن تلك غاية الليلة وغاية لما فيها من الأعمال الصالحة التابعة لكونها خيراً من ألف شهر ، وغاية السلام فيها .وقرأ الجمهور : { مطلع } بفتح اللام على أنه مصدر ميمي ، أي طلوع الفجر ، أي ظهوره . وقرأه الكسائي وخَلف بكسر اللام على معنى زمان طلوع الفجر .\n","ar.waseet":"وقوله - تعالى - : ( سَلاَمٌ هِيَ حتى مَطْلَعِ الفجر ) بيان لمزية ثالثة من مزايا هذه الليلة ، وقوله ( سَلاَمٌ ) مصدر بمعنى السلامة ، وهو خبر مقدم ، و ( هى ) مبتدأ مؤخر ، وإنما قدم الخبر تعجيلا للمسّرة ، وقد أخبر عن هذه الليلة بالمصدر على سبيل المبالغة ، أو على سبيل تأويل المصدر باسم الفاعل ، أو على تقدير مضاف . . والمراد بمطلع الفجر : طلوعه وبزوغه .أى : هذه الليلة يظلها ويشملها السلام المستمر ، والأمان الدائم ، لكل مؤمن يحييها فى طاعة الله - تعالى - إلى أن يطلع الفجر ، أو هى ذات سلامة حتى مطلع الفجر ، أو هى سالمة من كل أذى وسوء لكل مؤمن ومؤمنة حتى طلوع الفجر .هذا وقد أفاض العلماء فى الحديث عن فضائل ليلة القدر ، وعن وقتها . وعن خصائصها . . وقد لخص الإِمام القرطبى ذلك تلخيصا حسناً فقال : وهنا ثلاث مسائل :الأولى : فى تعيين ليلة القدر . . والذى عليه المعظم أنها ليلة سبع وعشرين . . والجمهور على أنها فى كل عام من رمضان . . وقيل : أخفاها - سبحانه - فى جميع شهر رمضان ، ليجتهدوا فى العمل والعبادة طمعا فى إدراكها .الثانية : فى علاماتها : ومنها أن تطلع الشمس فى صبيحتها بيضاء لاشعاع لها .الثالثة : فى فضائلها . . وحسبك قوله - تعالى - ( لَيْلَةُ القدر خَيْرٌ مِّنْ أَلْفِ شَهْرٍ ) وقوله : ( تَنَزَّلُ الملائكة والروح فِيهَا ) وفى الصحيحين \" من قام ليلة القدر إيماناً واحتسابا غفر الله له ما تقدم من ذنبه . . \" .نسأل الله - تعالى - أن يجعلنا من المنتفعين بهذه الليلة المباركة .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"( سلام ) قال عطاء : يريد : سلام على أولياء الله وأهل طاعته . وقال الشعبي : هو تسليم الملائكة ليلة القدر على أهل المساجد من حيث تغيب الشمس إلى أن يطلع الفجر .وقال الكلبي : الملائكة ينزلون فيه كلما لقوا مؤمنا أو مؤمنة سلموا عليه من ربه حتى يطلع الفجر .وقيل : تم الكلام عند قوله : \" بإذن ربهم من كل أمر \" ثم ابتدأ فقال : \" سلام هي \" ، أي : ليلة القدر سلام وخير كلها ، ليس فيها شر .قال الضحاك : لا يقدر الله في تلك الليلة ولا يقضي إلا السلامة .وقال مجاهد : يعني أن ليلة القدر [ سالمة ] لا يستطيع الشيطان أن يعمل فيها سوءا ولا أن يحدث فيها أذى .( حتى مطلع الفجر ) أي : إلى مطلع الفجر ، قرأ الكسائي \" مطلع \" بكسر اللام ، والآخرون بفتحها ، وهو الاختيار ، بمعنى الطلوع ، على المصدر ، يقال : طلع الفجر طلوعا ومطلعا ، والكسر موضع الطلوع .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6130.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6130.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6130.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":34,"letters":253,"size":"57KB","priority":2,"commonlyRead":false}}