{"chapter":98,"name":{"arabic":"سورة 98","transliteration":"Chapter 98","translation":"Chapter 98","revelation":"unknown"},"revelation":"unknown","verses":8,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنْفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ","transliteration":"Lam ya kunil lazeena kafaru min ahlil kitaabi wal mushri keena mun fak keena hattaa ta-tiya humul bayyinah","translations":{"en.ahmedali":"THOSE AMONG THE people of the Book who disbelieve, and the idolaters, would not have been freed (from false beliefs) until the clear proof came to them --","en.ahmedraza":"The disbelieving People of the Book(s) and the polytheists would not have left their religion until the clear proof came to them.","en.arberry":"The unbelievers of the People of the Book and the idolaters would never leave off; till the Clear Sign came to them,","en.asad":"IT IS NOT [conceivable] that such as are bent on denying the truth - [be they] from among the followers of earlier revelation or from among those who ascribe divinity to aught beside God should ever be abandoned [by Him] ere there comes unto them the [full] evidence of the truth:","en.daryabadi":"Those who disbelieved from among the People of the Book and the associaters could not break off, until there had come Unto them the evidence.","en.hilali":"Those who disbelieve from among the people of the Scripture (Jews and Christians) and among Al-Mushrikun, were not going to leave (their disbelief) until there came to them clear evidence.","en.pickthall":"Those who disbelieve among the People of the Scripture and the idolaters could not have left off (erring) till the clear proof came unto them,","en.qaribullah":"The unbelievers among the People of the Book and the idolaters would never desist until the Clear Proof came to them.","en.sahih":"Those who disbelieved among the People of the Scripture and the polytheists were not to be parted [from misbelief] until there came to them clear evidence -","en.sarwar":"The disbelievers among the People of the Book and the pagans disbelieved (in Islam) only after receiving divine testimony:","en.yusufali":"Those who reject (Truth), among the People of the Book and among the Polytheists, were not going to depart (from their ways) until there should come to them Clear Evidence,-","en.maududi":"Those who disbelieved – be they from the People of the Book or from those who associated others with Allah in His Divinity – will not desist from unbelief until the Clear Proof should come to them;","en.shakir":"Those who disbelieved from among the followers of the Book and the polytheists could not have separated (from the faithful) until there had come to them the clear evidence:","en.itani":"Those who disbelieved among the People of the Scripture, and the Polytheists, were not apart, until the Clear Evidence came to them.","en.mubarakpuri":"Those who disbelieve from among the People of the Scripture and the idolators, were not going to leave until there came to them the Bayyinah.","en.qarai":"The faithless from among the People of the Book and the polytheists were not set apart [from the community of the faithful] until the proof had come to them:","en.wahiduddin":"The deniers of truth from among the People of the Book and the polytheists would not desist from disbelief until they received clear evidence --"},"tafsir":{"ar.muyassar":"لم يكن الذين كفروا من اليهود والنصارى والمشركين تاركين كفرهم حتى تأتيهم العلامة التي وُعِدوا بها في الكتب السابقة.","ar.jalalayn":"«لم يكن الذين كفروا من» للبيان «أهل الكتاب والمشركين» أي عبدة الأصنام عطف على أهل «منفكين» خبر يكن، أي زائلين عما هم عليه «حتى تأتيهم» أي أتتهم «البينة» أي الحجة الواضحة وهي محمد صلى الله عليه وسلم.","ar.qurtubi":"تفسير سورة ( لم يكن )وهي مكية في قول يحيى بن سلام .ومدنية في قول ابن عباس والجمهور . وهي تسع آياتوقد جاء في فضلها حديث لا يصح ، رويناه عن محمد بن محمد بن عبد الله الحضرمي قال : قال لي أبو عبد الرحمن بن نمير : اذهب إلى أبي الهيثم الخشاب ، فاكتب عنه فإنه قد كتب ، فذهب إليه ، فقال : حدثنا مالك بن أنس ، عن يحيى بن سعيد ، عن سعيد بن المسيب ، عن أبي الدرداء ، قال : قال رسول الله - صلى الله عليه وسلم - : \" لو يعلم الناس ما في ( لم يكن ) الذين كفروا من أهل الكتاب ، لعطلوا الأهل والمال ، فتعلموها \" فقال رجل من خزاعة : وما فيها من الأجر يا رسول الله ؟ قال : \" لا يقرؤها منافق أبدا ، ولا عبد في قلبه شك في الله . والله إن الملائكة المقربين يقرءونها منذ خلق الله السماوات والأرض ما يفترون من قراءتها . وما من عبد يقرؤها إلا بعث الله إليه ملائكة يحفظونه في دينه ودنياه ، ويدعون له بالمغفرة والرحمة \" .قال الحضرمي : فجئت إلى أبي عبد الرحمن بن نمير ، فألقيت هذا الحديث عليه ، فقال : هذا قد كفانا مئونته ، فلا تعد إليه . قال ابن العربي : \" روى إسحاق بن بشر الكاهلي عن مالك بن أنس ، عن يحيى بن سعيد ، عن ابن المسيب : عن أبي الدرداء ، عن النبي - صلى الله عليه وسلم - : \" لو يعلم الناس ما في ( لم يكن ) الذين كفروا لعطلوا الأهل والمال ولتعلموها \" . حديث باطل ; وإنما الحديث الصحيح ما روي عن أنس : أن النبي - صلى الله عليه وسلم - قال لأبي بن كعب : \" إن الله أمرني أن أقرأ عليك لم يكن الذين كفروا قال : وسماني لك ! قال \" نعم \" فبكى .[ ص: 124 ] قلت : خرجه البخاري ومسلم . وفيه من الفقه قراءة العالم على المتعلم . قال بعضهم : إنما قرأ النبي - صلى الله عليه وسلم - على أبي ، ليعلم الناس التواضع ; لئلا يأنف أحد من التعلم والقراءة على من دونه في المنزلة . وقيل : لأن أبيا كان أسرع أخذا لألفاظ رسول الله - صلى الله عليه وسلم - ; فأراد بقراءته عليه ، أن يأخذ ألفاظه ويقرأ كما سمع منه ، ويعلم غيره . وفيه فضيلة عظيمة لأبي ; إذ أمر الله رسوله أن يقرأ عليه . قال أبو بكر الأنباري : وحدثنا أحمد بن الهيثم بن خالد ، قال حدثنا علي بن الجعد ، قال حدثنا عكرمة عن عاصم عن زر بن حبيش قال : في قراءة أبي بن كعب : ابن آدم لو أعطي واديا من مال لالتمس ثانيا ولو أعطي واديين من مال لالتمس ثالثا ، ولا يملأ جوف ابن آدم إلا التراب ، ويتوب الله على من تاب . قال عكرمة . قرأ علي عاصم لم يكن ثلاثين آية ، هذا فيها . قال أبو بكر : هذا باطل عند أهل العلم ; لأن قراءتي ابن كثير وأبي عمرو متصلتان بأبي بن كعب ، لا يقرأ فيهما هذا المذكور في لم يكن مما هو معروف في حديث رسول الله - صلى الله عليه وسلم - ، على أنه من كلام الرسول - عليه السلام - ، لا يحكيه عن رب العالمين في القرآن . وما رواه اثنان معهما الإجماع أثبت مما يحكيه واحد مخالف مذهب الجماعة .بسم الله الرحمن الرحيملم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينةقوله تعالى : لم يكن الذين كفروا كذا قراءة العامة ، وخط المصحف . وقرأ ابن مسعود لم يكن المشركون وأهل الكتاب منفكين وهذه قراءة على التفسير . قال ابن العربي : \" وهي جائزة في معرض البيان لا في معرض التلاوة ; فقد قرأ النبي - صلى الله عليه وسلم - في رواية الصحيح ( فطلقوهن لقبل عدتهن ) وهو تفسير ; فإن التلاوة : هو ما كان في خط المصحف \" .قوله تعالى : من أهل الكتاب يعني اليهود والنصارى والمشركين في موضع جر عطفا على أهل الكتاب . قال ابن عباس أهل الكتاب : اليهود الذين كانوا بيثرب ، وهم قريظة والنضير وبنو قينقاع . والمشركون : الذين كانوا بمكة وحولها ، والمدينة والذين حولها ; وهم مشركو قريش .منفكين أي منتهين عن كفرهم ، مائلين عنه .حتى تأتيهم أي أتتهم البينة ; أي محمد - صلى الله عليه وسلم - . وقيل : الانتهاء بلوغ الغاية أي لم يكونوا ليبلغوا نهاية أعمارهم فيموتوا ، حتى تأتيهم البينة . فالانفكاك على هذا بمعنى الانتهاء . وقيل : منفكين [ ص: 125 ] زائلين ; أي لم تكن مدتهم لتزول حتى يأتيهم رسول . والعرب تقول : ما انفككت أفعل كذا : أي ما زلت . وما انفك فلان قائما ، أي ما زال قائما . وأصل الفك : الفتح ; ومنه فك الكتاب ، وفك الخلخال ، وفك السالم . قال طرفة :فآليت لا ينفك كشحي بطانة لعضب رقيق الشفرتين مهندوقال ذو الرمة :حراجيج ما تنفك إلا مناخة     على الخسف أو نرمي بها بلدا قفرايريد : ما تنفك مناخة ; فزاد إلا . وقيل : منفكين : بارحين ; أي لم يكونوا ليبرحوا ويفارقوا الدنيا ، حتى تأتيهم البينة . وقال ابن كيسان : أي لم يكن أهل الكتاب تاركين صفة محمد - صلى الله عليه وسلم - في كتابهم ، حتى بعث ; فلما بعث حسدوه وجحدوه . وهو كقوله : فلما جاءهم ما عرفوا كفروا به . ولهذا قال : وما تفرق الذين أوتوا الكتاب . . . الآية . وعلى هذا فقوله والمشركين أي ما كانوا يسيئون القول في محمد - صلى الله عليه وسلم - ، حتى بعث ; فإنهم كانوا يسمونه الأمين ، حتى أتتهم البينة على لسانه ، وبعث إليهم ، فحينئذ عادوه . وقال بعض اللغويين : منفكين هالكين ; من قولهم : انفك صلا المرأة عند الولادة ; وهو أن ينفصل ، فلا يلتئم فتهلك المعنى : لم يكونوا معذبين ولا هالكين إلا بعد قيام الحجة عليهم ، بإرسال الرسل وإنزال الكتب . وقال قوم في المشركين : إنهم من أهل الكتاب ; فمن اليهود من قال : عزير ابن الله . ومن النصارى من قال : عيسى هو الله . ومنهم من قال : هو ابنه . ومنهم من قال : ثالث ثلاثة . وقيل : أهل الكتاب كانوا مؤمنين ، ثم كفروا بعد أنبيائهم . والمشركون ولدوا على الفطرة ، فكفروا حين بلغوا . فلهذا قال : والمشركين .وقيل : المشركون وصف أهل الكتاب أيضا لأنهم لم ينتفعوا بكتابهم ، وتركوا التوحيد . فالنصارى مثلثة ، وعامة اليهود مشبهة ; والكل شرك . وهو كقولك : جاءني العقلاء والظرفاء ; وأنت تريد أقواما بأعيانهم ، تصفهم بالأمرين . فالمعنى : من أهل الكتاب المشركين . وقيل : إن الكفر هنا هو الكفر بالنبي - صلى الله عليه وسلم - ; أي لم يكن الذين كفروا بمحمد من اليهود والنصارى ، الذين هم أهل الكتاب ، ولم يكن المشركون ، الذين هم عبدة الأوثان من العرب وغيرهم - وهم الذين ليس لهم كتاب - منفكين . قال القشيري : وفيه بعد ; لأن الظاهر من قوله حتى تأتيهم البينة رسول من الله أن هذا الرسول هو محمد - صلى الله عليه وسلم - . فيبعد أن يقال : لم يكن الذين كفروا بمحمد - صلى الله عليه وسلم - منفكين حتى يأتيهم محمد ; إلا أن يقال : أراد : لم يكن الذين كفروا الآن بمحمد - وإن كانوا من قبل معظمين له - بمنتهين عن هذا الكفر ، إلى أن يبعث الله محمدا إليهم ويبين لهم الآيات ; [ ص: 126 ] فحينئذ يؤمن قوم . وقرأ الأعمش وإبراهيم والمشركون رفعا ، عطفا على الذين . والقراءة الأولى أبين ; لأن الرفع يصير فيه الصنفان كأنهم من غير أهل الكتاب . وفي حرف أبي : فما كان الذين كفروا من أهل الكتاب والمشركون منفكين . وفي مصحف ابن مسعود : لم يكن المشركون وأهل الكتاب منفكين . وقد تقدم . حتى تأتيهم البينة قيل حتى أتتهم . والبينة : محمد - صلى الله عليه وسلم - .\n","ar.miqbas":"لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنْفَكِّينَ حَتَّى تَأْتِيَهُمُ الْبَيِّنَةُ (1) استصعب في كلام المفسرين تحصيل المعنى المستفاد من هذه الآيات الأربع من أول هذه السورة تحصيلاً ينتزع من لفظها ونظمها ، فذكر الفخر عن الواحدي في «التفسير البسيط» له أنه قال : هذه الآية من أصعب ما في القرآن نظماً وتفسيراً وقد تخبط فيها الكبار من العلماء . قال الفخر : «ثم إنه لم يلخص كيفية الإِشكال فيها .وأنا أقول : وجه الإِشكال أن تقدير الآية : لم يكن الذين كفروا منفكين حتى تأتيهم البينة التي هي الرسول صلى الله عليه وسلم ثم إنه تعالى لم يذكر أنهم منفكون عماذا لكنه معلوم إذ المراد هو الكفر والشرك اللذيْن كانوا عليهما فصار التقدير : لم يكن الذين كفروا منفكين عن كفرهم حتى تأتيهم البينة التي هي الرسول صلى الله عليه وسلم ثم إن كلمة { حتى } لانتهاء الغاية فهذه الآية تقتضي أنهم صاروا منفكين عن كفرهم عند إتيان الرسول صلى الله عليه وسلم ثم قال بعد ذلك : { وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة } [ البينة : 4 ] وهذا يقتضي أن كفرهم قد ازداد عند مجيء الرسول صلى الله عليه وسلم فحينئذ حصل بين الآية الأولى والآية الثانية مناقضة في الظاهر» اه كلام الفخر .يريد أن الظاهر أن قوله : { رسول من الله } بدل من { البينة } وأن متعلِّق { منفكين } حُذف لدلالة الكلام عليه لأنهم لما أجريت عليهم صلة الذين كفروا دل ذلك على أن المراد لم يكونوا منفكين على كفرهم ، وأن حرف الغاية يقتضي أن إتيان البينة المفسِّرة ب { رسول من اللَّه } هي نهاية انعدام انفكاكهم عن كفرهم ، أي فعند إتيان البينة يكونون منفكين عن كفرهم فكيف مع أن الله يقول : { وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة } [ البينة : 4 ] فإن تفرقهم راجع إلى تفرقهم عن الإِسلام وهو ازدياد في الكفر إذ به تكثر شبه الضلال التي تبعث على التفرق في دينهم مع اتفاقهم في أصل الكفر ، وهذا الأخير بناء على اعتبار قوله تعالى : { وما تفرق الذين أوتوا الكتاب } [ البينة : 4 ] الخ كلاماً متصلاً بإعراضهم عن الإِسلام وذلك الذي درج عليه المفسرون ولنا في ذلك كلام سيأتي .ومما لم يذكره الفخر من وجه الإِشكال : أن المشاهدة دلت على أن الذين كفروا لم ينفكوا عن الكفر في زمن مَّا ، وأن نصب المضارع بعد { حتى } ينادي على أنه منصوب ب ( أنْ ) مضمرة بعد { حتى } فيقتضي أنّ إتيان البينة مستقبل وذلك لا يستقيم فإن البينة فسرت ب { رسول من اللَّه } وإتيانْ الرسول وقع قبل نزول هذه الآيات بسنين وهم مستمرون على ما هم عليه : هؤلاء على كفرهم ، وهؤلاء على شركهم .وإذ قد تقرر وجه الإِشكال وكان مظنوناً أنه ملحوظ للمفسرين إجمالاً أو تفصيلاً فقد تعين أن هذا الكلام ليس وارداً على ما يتبادر من ظاهره في مفرداته أو تركيبه ، فوجب صرفه عن ظاهره ، إما بصرف تركيب الخَبر عن ظاهر الإِخبار وهو إفادة المخاطَب النسبة الخبرية التي تضمنها التركيب ، بأن يُصرف الخبر إلى أنه مستعمل في معنى مجازي للتركيب .وإمّا بصرف بعض مفرداته التي اشتمل عليها التركيب عن ظاهر معناها إلى معنى مجازٍ أو كناية .فمن المفسرين من سلك طريقة صرف الخبر عن ظاهره . ومنهم من أبقوا الخبر على ظاهر استعماله وسلكوا طريقة صرف بعض كلماته عن ظاهر معانيها وهؤلاء منهم من تأول لفظ { منفكين } ومنهم من تأول معنى { حتى } ومنهم من تأول { رسول } ، وبعضهم جوز في { البينة } وجهين .وقد تعددت أقوال المفسرين فبلغت بضعَة عشر قولاً ذكر الآلوسي أكثرها وذكر القرطبي مُعظمها غيرَ معزُو ، وتداخل بعض ما ذكره الآلوسي وزاد أحدهما ما لم يذكره الآخر .ومراجع تأويل الآية تَؤُول إلى خمسة :الأول : تأويل الجملة بأسرها بأن يُؤوَّل الخبر إلى معنى التوبيخ والتعجيب ، وإلى هذا ذهب الفراء ونفطويه والزمخشري .الثاني : تأويل معنى { منفكين } بمعنى الخروج عن إمهال الله إياهم ومصيرهم إلى مؤاخذتهم ، وهو لابن عطية .الثالث : تأويل متعلِّق { منفكين } بأنه عن الكفر وهو لعبد الجَبَّار ، أو عن الاتفاق على الكفر وهو للفخر وأبي حيّان . أو منفكين عن الشهادة للرسول صلى الله عليه وسلم بالصدق قبل بعثته وهو لابن كيسان عبد الرحمن الملقب بالأصم ، أو منفكين عن الحياة ، أي هالكين ، وعُزي إلى بعض اللغويين .الرابع : تأويل { حتى } أنها بمعنى ( إنْ ) الاتصالية . والتقدير : وإن جاءتهم البينة .\n","ar.waseet":"\" مِنْ \" فى قوله - تعالى - ( مِنْ أَهْلِ الكتاب ) للبيان ، وقوله - سبحانه - ( مُنفَكِّينَ ) : للعلماء فى معنى هذا اللفظ أقوال متعددة ، منها : أنه اسم فاعل من انفك بمعنى انفصل ، يقال : فككت الشئ فانفك إذا افترق ما كان ملتحما منه .والبينة : الحجة الظاهرة التى يتميز بها الحق من الباطل ، وأصلها من البيان بمعنى الظهور والوضوح ، لأن بها تتضح الأمور ، أو من البينونة بمعنى الانفصال ، لأن بها ينفصل الحق عن الباطل بعد التباسهما .\n","ar.baghawi":"مكية( لم يكن الذين كفروا من أهل الكتاب ) وهم اليهود والنصارى ، ( والمشركين ) وهم عبدة الأوثان ، ( منفكين ) [ منتهين عن كفرهم وشركهم ، وقال أهل اللغة ] : زائلين منفصلين ، يقال : فككت الشيء فانفك ، أي : انفصل ، ( حتى تأتيهم البينة ) لفظه مستقبل ومعناه الماضي ، أي : حتى أتتهم البينة ، الحجة الواضحة ، يعني : محمدا - صلى الله عليه وسلم - ، أتاهم بالقرآن فبين لهم [ ضلالاتهم ] وجهالتهم ودعاهم إلى الإيمان . فهذه الآية فيمن آمن من الفريقين ، أخبر أنهم لم ينتهوا عن الكفر حتى أتاهم الرسول فدعاهم إلى الإيمان فآمنوا فأنقذهم الله من الجهل والضلالة\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6131.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6131.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6131.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"رَسُولٌ مِنَ اللَّهِ يَتْلُو صُحُفًا مُطَهَّرَةً","transliteration":"Rasoolum minal laahi yatlu suhufam mutahharah","translations":{"en.ahmedali":"An Apostle from God, reading out hallowed pages","en.ahmedraza":"(The clear proof is) the Noble Messenger from Allah, who reads the pure pages.","en.arberry":"a Messenger from God, reciting pages purified,","en.asad":"an apostle from God, conveying [unto them] revelations blest with purity,","en.daryabadi":"An apostle from Allah rehearsing Writs cleansed.","en.hilali":"A Messenger (Muhammad (Peace be upon him)) from Allah, reciting (the Quran) purified pages [purified from Al-Batil (falsehood, etc.)].","en.pickthall":"A messenger from Allah, reading purified pages","en.qaribullah":"A Messenger from Allah reciting Purified Pages","en.sahih":"A Messenger from Allah, reciting purified scriptures","en.sarwar":"a Messenger (Muhammad) from God, reciting to them parts of the purified,","en.yusufali":"An messenger from Allah, rehearsing scriptures kept pure and holy:","en.maududi":"a Messenger from Allah, reciting from Purified Scrolls;","en.shakir":"An apostle from Allah, reciting pure pages,","en.itani":"A messenger from God reciting purified scripts.","en.mubarakpuri":"A Messenger from Allah reciting purified pages.","en.qarai":"an apostle from Allah reciting impeccable scriptures,","en.wahiduddin":"a messenger from God, reciting to them pure scriptures,"},"tafsir":{"ar.muyassar":"وهي رسول الله محمد صلى الله عليه وسلم، يتلو قرآنًا في صحف مطهرة.","ar.jalalayn":"«رسول من الله» بدل من البينة وهو النبي صلى الله عليه وسلم «يتلو صحفاً مطهرة» من الباطل.","ar.qurtubi":"رسول من الله أي بعث من الله جل ثناؤه . قال الزجاج : رسول رفع على البدل من البينة . وقال الفراء : أي هي رسول من الله ، أو هو رسول من الله ; لأن البينة قد تذكر فيقال : بينتي فلان . وفي حرف أبي وابن مسعود رسولا بالنصب على القطع .يتلو أي يقرأ . يقال : تلا يتلو تلاوة .صحفا جمع صحيفة ، وهي ظرف المكتوب .مطهرة قال ابن عباس : من الزور ، والشك ، والنفاق ، والضلالة . وقال قتادة : من الباطل . وقيل : من الكذب ، والشبهات . والكفر ; والمعنى واحد . أي يقرأ ما تتضمن الصحف من المكتوب ; ويدل عليه أنه كان يتلو عن ظهر قلبه ، لا عن كتاب ; لأنه كان أميا ، لا يكتب ولا يقرأ . ومطهرة : من نعت الصحف ; وهو كقوله تعالى : في صحف مكرمة مرفوعة مطهرة ، فالمطهرة نعت للصحف في الظاهر ، وهي نعت لما في الصحف من القرآن . وقيل : مطهرة أي ينبغي ألا يمسها إلا المطهرون ; كما قال في سورة ( الواقعة ) حسب ما تقدم بيانه . وقيل : الصحف المطهرة : هي التي عند الله في أم الكتاب ، الذي منه نسخ ما أنزل على الأنبياء من الكتب ; كما قال تعالى : بل هو قرآن مجيد في لوح محفوظ . قال الحسن : يعني الصحف المطهرة في السماء .\n","ar.miqbas":"رَسُولٌ مِنَ اللَّهِ يَتْلُو صُحُفًا مُطَهَّرَةً (2) الخامس : تأويل { رسول } بأنه رسول من الملائكة يتلو عليهم صحفاً من عند الله فهو في معنى قوله تعالى : { يسألك أهل الكتاب أن تنزل عليهم كتاباً من السماء } [ النساء : 153 ] وعزاه الفخر إلى أبي مسلم وهو يقتضي صرف الخبر إلى التهكم .هذا والمراد ب { الذين كفروا من أهل الكتاب } أنهم كفروا برسالة محمد صلى الله عليه وسلم مثل ما في قوله تعالى : { ألم تر إلى الذين نافقوا يقولون لإخوانهم الذين كفروا من أهل الكتاب } [ الحشر : 11 ] .وأنت لا يعوزك إرجاع أقوال المفسرين إلى هذه المعاقد فلا نحتاج إلى التطويل بذكرها فدونك فراجعها إن شئت ، فبنا أن نهتم بتفسير الآية على الوجه البين .إن هذه الآيات وردت مورد إقامة الحجة على الذين لم يؤمنوا من أهل الكتاب وعلى المشركين بأنهم متنصلون من الحق متعللون للإِصرار على الكفر عناداً ، فلنسلك بالخَبر مسلك مورد الحجة لا مسلك إفادة النسبَةِ الخبرية فتعين علينا أن نصرف التركيب عن استعمال ظاهره إلى استعمال مجازي على طريقة المجاز المرسل المركب من قَبيل استعمال الخبر في الإِنشاء والاستفهاممِ في التوبيخ ونحو ذلك الذي قال فيه التفتزاني في «المطول» : إن بيان أنه من أيّ أنواع المجاز هُو مما لم يَحُم أحد حوله .والذي تَصدَّى السيد الشريف لبيانه بما لا يُبقي فيه شبهة .فهذا الكلام مسوق مساق نقل الأقوال المستغربة المضطربة الدالة على عدم ثبات آراء أصحابها ، فهو من الحكاية لِما كانوا يَعِدُون به فهو حكاية بالمعنى كأنه قيل : كنتم تقولون لا نترك ما نحن عليه حتى تأتينا البينة ، وهذا تعريض بالتوبيخ بأسلوب الإِخبار المستعمل في إنشاء التعجيب أو الشكايةِ من صَلَففِ المُخبر عنه ، وهو استعمال عزيز بديع وقريب منه قوله تعالى : { يحذر المنافقون أن تنزل عليهم سورة تنبئهم بما في قلوبهم قل استهزئوا إن اللَّه مخرج ما تحذرون } [ التوبة : 64 ] إذ عَبَّر بصيغة يَحْذَر وهم إنما تظاهروا بالحذر ولم يكونوا حاذرين حقاً ولذلك قال الله تعالى : { قل استهزئوا } .فالخبر موجَّه لكل سامع ، ومضمومه قول : «كان صدر من أهل الكتاب واشتهر عنهم وعرفوا به وتقرَّر تعلُّل المشركين به لأهل الكتاب حتى يدعونهم إلى اتباع اليهودية أو النصرانية فيقولوا : لم يأتنا رسول كما أتاكم قال تعالى : { أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم } [ الأنعام : 156 ، 157 ] .وتقرر تعلل أهل الكتاب به حين يدعوهم النبي صلى الله عليه وسلم للإِسلام ، قال تعالى : { الذين قالوا إن اللَّه عهد إلينا ألاَّ نؤمن لرسول حتى يأتينا بقربان تأكله النار } [ آل عمران : 183 ] الآية .وشيوعه عن الفريقين قرينة على أن المراد من سياقه دمغهم بالحجة وبذلك كان التعبير بالمضارع المستقبل في قوله : { حتى تأتيهم البينة } مصادفاً المحزّ فإنهم كانوا يقولون ذلك قبل مجيء الرسول صلى الله عليه وسلموقريب منه قوله تعالى في أهل الكتاب : { ولما جاءهم كتاب من عند اللَّه مصدق لما معهم وكانوا من قبل يستفتحون على الذين كفروا فلما جاءهم ما عرفوا كفروا به } [ البقرة : 89 ] .وحاصل المعنى : أنكم كنتم تقولون لا نترك ما نحن عليه من الدين حتى تأتينا البينة ، أي العلامة التي وُعدنا بها .وقد جعل ذلك تمهيداً وتوطئة لقوله بعده : { رسول من الله يتلوا صحفاً مطهرة } الخ .وإذ اتضح موقع هذه الآية وانقشع إشكالها فلننتقل إلى تفسير ألفاظ الآية .فالانفكاك : الإِقلاع ، وهو مطاوع فكَّه إذا فصَله وفرقه ويستعار لمعنى أقلع عنه ومتعلق { منفكين } محذوف دل عليه وصف المتحدث عنهم بصلة { الذين كفروا } والتقدير : منفكين عن كفرهم وتاركين له ، سواء كان كفرهم إشراكاً بالله مثل كفر المشركين أو كان كفراً بالرسول صلى الله عليه وسلم فهذا القول صادر من اليهود الذين في المدينة والقرى التي حولها ويتلقفه المشركون بمكة الذين لم ينقطعوا عن الاتصال بأهل الكتاب منذ ظهرت دَعوة الإِسلام يستفتونهم في ابتكار مخلص يتسللون به عن ملام من يلومهم على الإِعراض عن الإِسلام .وكذلك المشركون الذين حول المدينة من الأعراب مثل جُهَينة وغَطَفان ، ومن أفراد المتنصرين بمكة أو بالمدينة .وقد حكى الله عن اليهود أنهم قالوا : { إن الله عهد إلينا ألا نؤمنَ لرسول حتى يأتينا بقربان تأكله النار } [ آل عمران : 183 ] ، وقال عنهم : { ولما جاءهم كتاب من عند الله مصدق لما معهم وكانوا من قبل يستفتحون على الذين كفروا فلما جاءهم ما عرفوا كفروا به } [ البقرة : 89 ] ، وحكى عن النصارى بقوله تعالى حكاية عن عيسى : { ومبشراً برسول يأتي من بعدي اسمه أحمد فلما جاءهم بالبينات قالوا هذا سحر مبين } [ الصف : 6 ] . وقال عن الفريقين : { ودَّ كثير من أهل الكتاب لو يردُّونكم من بعد إيمانكم كفاراً حسداً من عند أنفسهم من بعد ما تبين لهم الحق } [ البقرة : 109 ] ، وحكى عن المشركين بقوله : { فلما جاءهم الحق من عندنا قالوا لولا أوتي مثل ما أوتي موسى } [ القصص : 48 ] وقولهم : { فليأتنا بآية كما أرسل الأولون } [ الأنبياء : 5 ] .ولم يختلف أهل الكتابين في أنهم أخذ عليهم العهد بانتظار نبيء ينصر الدين الحق وجعلت علاماته دلائلَ تظهر من دعوته كقول التوراة في سفر التثنية : «أقيم لهم نبيئاً من وسط إخوتهم مِثلَك وأجعل كلامي في فمه» . ثم قولها فيه : «وأما النبي الذي يطغى فيتكلم كلاماً لم أوصه أن يتكلم به فيموت ذلك النبي وإن قلتَ في قلبك كيف نعرف الكلام الذي لم يتكلم به الرب فما تكلم به النبي باسم الرب ولم يحدث ولم يصر فهو الكلام الذي لم يتكلم به الرب ( الإصحاح الثامن عشر ) . وقول الإنجيل : «وأنَا أطلب من الأب فيعطيكم معزِّياً آخر ليمكث معكم إلى الأبد ( أي شريعته لأن ذات النبي لا تمكث إلى الأبد ) روح الحق الذي لا يستطيع العالم أن يقبله لأنه لا يراه ولا يعرفه ( يوحنا الإِصحاح الرابع عشر الفقرة 6 ) «وأما المعزي الروح القُدس الذي سيرسله الأب باسمي فهو يعلمكم كل شيء ويذكّركم بكل ما قلتُه لكم ( يوحنا الإِصحاح الرابع عشر فقرة 26 ) .وقوله : ويقوم أنبياء كَذَبةٌ كثيرون ، ( أي بعد عيسى ) ويُضلون كثيرين ولكن الذي يَصْبر إلى المنتهى ( أي يبقى إلى انقراض الدنيا وهو مؤول ببقاء دينه إذ لا يبقى أحد حياً إلى انقراض الدنيا ) فهذا يخلِّص ويكرر ببشارة الملكوت هذه في كل المسكونة شهادةً لجميع الأمم ثم يأتي المنتهى» ، أي نهاية الدنيا ( متّى الإصحاح الرابع والعشرون ) ، أي فهو خاتم الرسل كما هو بين .وكان أحبارُهم قد أساءوا التأويل للبشارات الواردة في كتبهم بالرسول المقفِّي وأدْخَلوا علامات يعرفون بها الرسول صلى الله عليه وسلم الموعود به هي من المخترعات الموهومة فبقي مَنْ خَلْفَهم ينتظرون تلك المخترعات فإذا لم يجدوها كذَّبوا المبعوث إليهم .و { البينة } : الحجة الواضحة والعلامة على الصدق وهو اسم منقول من الوصف جرى على التأنيث لأنه مؤول بالشهادة أو الآية .ولعل إيثار التعبير بها هنا لأنها أحسن ما تترجَم به العبارةُ الواقعة في كتب أهل الكتاب مما يحوم حول معنى الشهادة الواضحة لكل متبصر كما وقع في إنجيل متّى لفظ «شهادة لجميع الأمم» ، ( ولعل التزام هذه الكلمة هنا مرتين كان لهذه الخصوصية ) وقد ذُكرت مع ذكر الصحف الأولى في قوله :{ وقالوا لولا يأتينا بآية من ربه أو لمْ تأتهم بينةُ ما في الصُّحف الأولى } [ طه : 133 ] .والظاهر أن التعريف في { البينة } تعريف العهد الذهني ، وهو أن يراد معهود بنوعه لا بشخصه كقولهم : ادخُل السوق ، لا يريدون سوقاً معينة بل ما يوجد فيه ماهية سوق ، ومنه قول زهير: ... وما الحَرْب إلاّ ما عَلِمْتُم وذُقْتُمولذلك قال علماء البلاغة : إن المعرَّف بهذه اللام هو في المعنى نكرة فكأنه قيل حتى تأتيهم بينةٌ .ويجوز أن يكون التعريف لمعهود عند المخبَر عنهم ، أي البينة التي هي وصايا أنبيائهم فهي معهودة عند كل فريق منهم وإن اختلفوا في تخيلها وابتعدوا في توهمها بما تمليه عليه تخيلاتهم واختلاقهم .وأوثرت كلمة { البينة } لأنها تعبر عن المعنى الوارد في كلامهم ولذلك نرى مادَّتها متكررة في آيات كثيرة من القرآن في هذا الغرض كما في قوله : { أوَلَمْ تأتهم بينة ما في الصحف الأولى } [ طه : 133 ] وقوله : { فلما جاءهم بالبينات قالوا هذا سحر مبين } [ الصف : 6 ] وقوله : { مِن بَعد ما تبيَّن لهم الحق } [ البقرة : 109 ] وقال عن القرآن : { هدى للناس وبينات من الهدى والفرقان } [ البقرة : 185 ] .و { مِن } في قوله : { من أهل الكتاب } بيانية بيان للذين كفروا .وإنما قدم أهل الكتاب على المشركين هنا مع أن كفر المشركين أشد من كفر أهل الكتاب لأن لأهل الكتاب السبق في هذا المقام فهم الذين بثّوا بين المشركين شبهة انطباق البينة الموصوفة بينهم فأيدوا المشركين في إنكار نبوة محمد صلى الله عليه وسلم بما هو أتقن من تُرَّهات المشركين إذ كان المشركون أميين لا يعلمون شيئاً من أحوال الرسل والشرائع ، فلما صدمتهم الدعوة المحمدية فزعوا إلى اليهود ليتلقوا منهم ما يردُّون به تلك الدعوة وخاصة بعد ما هاجر النبي صلى الله عليه وسلم إلى المدينة .فالمقصود بالإِبطال ابتداءً هو دعوى أهل الكتاب ، وأما المشركون فتبع لهم .واعلم أنه يجوز أن يكون الكلام انتهى عند قوله : { حتى تأتيهم البينة } ، فيكون الوقف هناك ويكون قوله : { رسول من اللَّه } إلى آخرها جملة مستأنفة استئنافاً بيانياً وهو قول الفراء ، أي هي رسول من الله ، يعني لأن ما في البينة من الإِبهام يثير سؤال سائل عن صفة هذه البينة ، وهي جملة معترضة بين جملة { لم يكن الذين كفروا . . . منفكين } إلى آخرها وبين جملة : { وما تفرق الذين أوتوا الكتاب } [ البينة : 4 ] .ويجوز أن يكون { رسول } بدلاً من { البينة } فيقتضي أن يكون من تمام لفظ «بينة» فيكون من حكاية ما زعموه . أريد إبطال معاذيرهم وإقامة الحجة عليهم بأن البينة التي ينتظرونها قد حلّت ولكنهم لا يتدبرون أو لا ينصفون أو لا يفقهون ، قال تعالى :{ فلما جاءهم ما عرفوا كفروا به } [ البقرة : 89 ] .وتنكير { رسول } للنوعية المرادِ منها تيسير ما يستصعب كتنكير قوله تعالى : { أياماً معدودات } [ البقرة : 184 ] وقول : { المص كتاب أنزل إليك } [ الأعراف : 1 ، 2 ] .وفي هذا التبيين إبطال لمعاذيرهم كأنه قيل : فقد جاءتكم البينة ، على حد قوله تعالى : { أن تقولوا ما جاءنا من بشير ولا نذير فقد جاءكم بشير ونذير } [ المائدة : 19 ] ، وهو يفيد أن البينة هي الرسول وذلك مثل قوله تعالى : { قد أنزل اللَّه إليكم ذكراً رسولاً يتلو عليكم آيات اللَّه } [ الطلاق : 10 ، 11 ] .فأسلوب هذا الردّ مثل أسلوب قوله تعالى : { وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعاً أو تكون لك جنة من نخيل وعنب فتفجر الأنهار خلالها تفجيراً أو تسقط السماء كما زعمت علينا كسفاً أو تأتي باللَّه والملائكة قبيلاً أو يكون لك بيت من زخرف أو ترقى في السماء ولن نؤمن لرقيك حتى تنزل علينا كتاباً نقرؤه قل سبحان ربي هل كنت إلا بشراً رسولاً وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث اللَّه بشراً رسولاً } [ الإسراء : 90 94 ] .وفي هذا تذكير بغلطهم فإن كتبهم ما وعدت إلا بمجيء رسول معه شريعة وكتاب مصدق لما بين يديه وذلك مما يندرج في قولة التوراة : «وأجْعَلُ كلامي في فمه» .وقول الإنجيل : «ويُذَكِّرُكم بكل ما قلتُه لكم» كما تقدم آنفاً ، وهو ما أشار إليه قوله تعالى : { وأنزلنا إليك الكتاب بالحق مصدقاً لما بين يديه من الكتاب } [ المائدة : 48 ] لأن التوراة والإنجيل لم يصفا النبي الموعود به إلا بأنه مثل موسى أو مثل عيسى ، أي في أنه رسول يوحي الله إليه بشريعة ، وأنه يبلغ عن الله وينطلق بوحيه ، وأن علامته هو الصدق كما تقدم آنفاً . قال حجة الإِسلام في كتاب «المنقذ من الضلال» : «إن مجموع الأخلاق الفاضلة كان بالغاً في نبينا إلى حد الإِعجاز وأن معجزاته كانت غاية في الظهور والكثرة» .و { من اللَّه } متعلق ب { رسول } ولم يُسلَك طريق الإِضافة ليتأتى تنوين { رسول } فيشعر بتعظيم هذا الرسول .وجملة { يتلوا صحفاً } الخ صفة ثانية أو حال ، وهي إدماج بالثناء على القرآن إذ الظاهر أن الرسول الموعود به في كتبهم لم يوصف بأنه يتلو صحفاً مطهرة .والتلاوة : إعادة الكلام دون زيادة عليه ولا نقص منه سواء كان كلاماً مكتوباً أو محفوظاً عن ظهر قلب ، ففعل { يتلو } مؤذن بأنه يقرأ عليهم كلاماً لا تُبَدَّل ألفاظه وهو الوحي المنزل عليه .والصحف : الأوراق والقراطيس التي تُجعل لأن يكتب فيها ، وتكون من رَق أو جلد ، أو من خِرَق . وتسمية ما يتلوه الرسول { صحفاً } مجاز بعلاقة الأيلولة لأنه مأمور بكتابته فهو عند تلاوته سيكون صُحفاً ، فهذا المجاز كقوله : { إني أراني أعصر خمراً }[ يوسف : 36 ] . وهذا إشارة إلى أن الله أمر رسوله صلى الله عليه وسلم بكتابة القرآن في الصحف وما يشبه الصحف من أكتاففِ الشاء والخِرَق والحجارة ، وأن الوحي المنزل على الرسول سمي كتاباً في قوله تعالى : { أو لم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم } [ العنكبوت : 51 ] لأجل هذا المعنى .وتعدية فعل { يتلو } إلى { صحفاً } مجاز مرسل مشهور ساوى الحقيقة قال تعالى : { وما كنت تتلو من قبله من كتاب } [ العنكبوت : 48 ] ، وهو باعتبار كون المتلو مكتوباً ، وإنما كان رسول الله صلى الله عليه وسلم يتلو عليهم القرآن عن ظهر قلب ولا يقرأه من صحف فمعنى { يتلو صحفاً } يتلو ما هو مكتوب في صحف والقرينة ظاهرة وهي اشتهار كونه صلى الله عليه وسلم أمِّيّاً .ووصف الصحف ب { مطهرة } وهو وصف مشتق من الطهارة المجازية ، أي كون معانيه لا لبس فيها ولا تشتمل على ما فيه تضليل ، وهذا تعريض ببعض ما في أيدي أهل الكتاب من التحريف والأوهام .ووصف الصحف التي يتلوها رسول الله صلى الله عليه وسلم لأن فيها كتباً ، والكتب : جمع كتاب ، وهو فِعال اسم بمعنى المكتوب ، فمعنى كون الكتب كائنة في الصحف أن الصحف التي يكتب فيها القرآن تشتمل على القرآن وهو يشتمل على ما تضمنته كتب الرسل السابقين مما هو خالص من التحريف والباطل ، وهذا كما قال تعالى : { مصدق لما بين يديه } [ البقرة : 97 ] وقال : { إن هذا لفي الصحف الأولى صحف إبراهيم وموسى } [ الأعلى : 18 ، 19 ] ، فالقرآن زُبدة ما في الكتب الأولى ومجمع ثمرتها ، فأطلق على ثمرة الكتب اسم كتب على وجه مجاز الجزئية .\n","ar.waseet":"والمراد بها هنا : رسول الله صلى الله عليه وسلم ، لقوله - تعالى - بعد ذلك : ( رَسُولٌ مِّنَ الله يَتْلُواْ صُحُفاً مُّطَهَّرَةً ) ، ولأنه صلى الله عليه وسلم كان فى ذاته برهانا على صحة ما ادعاه من النبوة ، لتحليه بكمال العقل وبمكارم الأخلاق ، ولإِتيانه بالمعجزات التى تؤيد أنه صادق فيما يبلغه عن ربه .والمعنى : لم يكن الذين كفورا من أهل الكتاب ، وهم اليهود والنصارى ، ولم يكن - أيضاً - الذين كذبوا الحق من المشركين ، ولم يكن الجميع بمفارقين وبمنفصلين عن كفرهم وشركهم ، ( حتى تَأْتِيَهُمُ البينة ) التى هى الرسول صلى الله عليه وسلم فلما أتتهم هذه البينة ، منهم من آمن ومنهم من استمر على كفره وشركه وضلاله .وإلى هذا المعنى أشار صاحب الكشاف بقوله : \" كان الكفار من الفريقين ، أهل الكتاب ، وعبدة الأصنام ، يقولون قبل مبعث النبى صلى الله عليه وسلم : لا ننفك عما نحن عليه من ديننا ، ولا نتركه حتى يبعث النبى المكتوب فى التوراة والإنجيل ، وهو محمد صلى الله عليه وسلم ، فحكى الله - تعالى - ما كانوا يقولونه ، ثم قال : ( وَمَا تَفَرَّقَ الذين أُوتُواْ الكتاب ) ، يعنى أنهم كانوا يَعِدُون باجتماع الكلمة ، والاتفاق على الحق ، إذا جاءهم الرسول ، ثم ما فرقهم عن الحق ، ولا أقرهم على الكفر ، إلا مجئ الرسول صلى الله عليه وسلم ، ونظيره فى الكلام أن يقول الفقير الفاسق لمن يعظه : لست بمنفك عما أنا فيه حتى يرزقنى الله - تعالى - الغنى ، فيرزقه الله الغنى فيزداد فسقا ، فيقول له واعظة : لم تكن منفكا عن الفسق حتى توسر ، وما غمست رأسك فى الفسق إلا بعد اليسار ، يذكره ما كان يقوله توبيخا وإلزاما .وانفكاك الشئ من الشئ ، أن يزايله بعد التحامه به . كالعظم إذا انفك من مفصله .والمعنى : أنهم متشبثون بدينهم لا يتركونه إلا عند مجئ البينة .ومنهم من يرى : أن ( مُنفَكِّينَ ) بمعنى متروكين لا بمعنى تاركين ، أى : لم يكونوا جميعا متروكين على ما هم عليه من الكفر والشرك ، حتى تأتيهم البينة ، على معنى قوله - تعالى - : ( أَيَحْسَبُ الإنسان أَن يُتْرَكَ سُدًى ) أو المعنى : لم يكن هؤلاء القوم منفكين من أمر الله - تعالى - وقدرته ونظره لهم ، حتى يبعث الله - تعالى - إليهم رسولا منذرا ، تقوم عليهم به الحجة ، ويتم على من آمن النعمة ، فكأنه - تعالى - قال : ما كانوا ليتركوا سدى ..وهناك أقوال أخرى فى معنى الآية رأينا أن نضرب عنها صفحا لضعفها .وقد قدم الله - تعالى - ذكر أهل الكتاب فى البيان ، لأن كفرهم أشنع وأقبح . إذ كانوا يقرأون الكتب ، ويعرفون أوصاف النبى صلى الله عليه وسلم فكانت قدرتهم على معرفة صدقه أكبر وأتم . وفى التعبير عنهم بأهل الكتاب دون اليهود والنصارى ، تسجيل للغفلة وسوء النية عليهم . حيث علموا الكتاب . وعرفوا عن طريقه أن هناك رسولا كريما قد أرسله الله - تعالى - لهدايتهم ، ومع ذلك كفروا به ، كما قال - تعالى - : ( فَلَمَّا جَآءَهُمْ مَّا عَرَفُواْ كَفَرُواْ بِهِ فَلَعْنَةُ الله عَلَى الكافرين ) وقوله - سبحانه - : ( رَسُولٌ مِّنَ الله يَتْلُواْ صُحُفاً مُّطَهَّرَةً ) بدل من \" البيِّنَةِ \" على سبيل المبالغة ، حيث جعل - سبحانه - الرسول نفس البيئة .أى : لم يفارقوا دينهم حتى جاءهم رسول كريم ، كائن من عند الله - تعالى - لكى يقرأ على مسامعهم صحفا من القرآن الكريم ، مطهرة ، أى : منزهة عن الشرك والكفر والباطل .\n","ar.baghawi":"ثم فسر البينة فقال : ( رسول من الله يتلو ) يقرأ ( صحفا ) كتبا ، يريد ما يتضمنه الصحف من المكتوب فيها ، وهو القرآن ; لأنه كان يتلو عن ظهر قلبه لا عن [ الكتاب ] ، قوله : ( مطهرة ) من الباطل والكذب والزور .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6132.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6132.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6132.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"فِيهَا كُتُبٌ قَيِّمَةٌ","transliteration":"Feeha kutubun qaiyimah","translations":{"en.ahmedali":"Containing firm decrees.","en.ahmedraza":"In which are written proper affairs.","en.arberry":"therein true Books.","en.asad":"wherein there are ordinances of ever-true soundness and clarity.","en.daryabadi":"Wherein are discourses eternal.","en.hilali":"Containing correct and straight laws from Allah.","en.pickthall":"Containing correct scriptures.","en.qaribullah":"in which there are valuable Books.","en.sahih":"Within which are correct writings.","en.sarwar":"holy Book which contain eternal laws of guidance.","en.yusufali":"Wherein are laws (or decrees) right and straight.","en.maududi":"in writings wherein are scriptures, absolutely true and unerring.","en.shakir":"Wherein are all the right ordinances.","en.itani":"In them are valuable writings.","en.mubarakpuri":"Wherein are upright Books.","en.qarai":"wherein are upright writings.","en.wahiduddin":"containing upright precepts."},"tafsir":{"ar.muyassar":"في تلك الصحف أخبار صادقة وأوامر عادلة، تهدي إلى الحق وإلى صراط مستقيم.","ar.jalalayn":"«فيها كتب» أحكام مكتوبة «قيمة» مستقيمة، أي يتلو مضمون ذلك وهو القرآن، فمنهم من آمن به ومنهم من كفر.","ar.qurtubi":"فيها كتب قيمة أي مستقيمة مستوية محكمة ; من قول العرب : قام يقوم إذا استوى وصح . وقال بعض أهل العلم : الصحف هي الكتب ; فكيف قال في صحف فيها كتب ؟ فالجواب : أن الكتب هنا بمعنى الأحكام ; قال الله - عز وجل - : كتب الله لأغلبن بمعنى حكم . وقال - صلى الله عليه وسلم - : والله لأقضين بينكما بكتاب الله ثم قضى بالرجم ، وليس ذكر الرجم مسطورا في الكتاب ; فالمعنى : لأقضين بينكما بحكم الله تعالى . وقال الشاعر :وما الولاء بالبلاء فملتم     وما ذاك قال الله إذ هو يكتبوقيل : الكتب القيمة : هي القرآن ; فجعله كتبا لأنه يشتمل على أنواع من البيان .\n","ar.miqbas":"فِيهَا كُتُبٌ قَيِّمَةٌ (3)والمراد بالكتب أجزاء القرآن أو سوره فهي بمثابة الكتب .والقيِّمة : المستقيمة ، أي شديدة القيام الذي هو هنا مجاز في الكمال والصواب وهذا من تشبيه المعقول بالمحسوس تشبيهاً بالقائم لاستعداده للعمل النافع ، وضده العِوَج قال تعالى : { الحمد للَّه الذي أنزل على عبده الكتاب ولم يجعل له عِوجاً قيماً } [ الكهف : 1 ، 2 ] ، أي لم يجعل فيه نقص الباطل والخطأ ، فالقيّمة مبالغة في القائم مثل السيد للسائد والميت للمائت .وتأنيث الوصف لاعتبار كونه وصفاً لجمع .\n","ar.waseet":"وهذه الصحف من صفاتها - أيضا - أنها ( فِيهَا كُتُبٌ قَيِّمَةٌ ) أى : فيها سور آيات قرآنية مستقيمة لا عوج فيها ، بل هى ناطقة بالحق والخير والصدق والهداية ، وبأخبار الأنبياء السابقين وبأحوالهم مع أقوامهم .فقوله : ( قَيِّمَةٌ ) بمعنى مستقيمة لا عوج فيها ولا اضطراب ، من قولهم : قام فلان يقوم ، إذا استوى على قدميه فى استقامة .\n","ar.baghawi":"\"فيها\"، أي في الصحف، \"كتب\"، يعني الآيات والأحكام المكتوبة فيها، \"قيمة\"، عادلة مستقيمة غير ذات عوج.\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6133.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6133.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6133.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ","transliteration":"Wa maa tafarraqal lazeena ootul kitaaba il-la mim b'adi ma jaa-at humul baiyyinah","translations":{"en.ahmedali":"The people of the Book were not divided among themselves till after the clear proof had come to them.","en.ahmedraza":"Nor did the People of the Book(s) get divided until after the clear proof came to them.","en.arberry":"And they scattered not, those that were given the Book, excepting after the Clear Sign came to them.","en.asad":"Now those who have been vouchsafed revelation aforetime did break up their unity [of faith] after such an evidence of the truth had come to them.","en.daryabadi":"And those who are vouchsafed the Book divided not save after there had come Unto them the evidence.","en.hilali":"And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence. (i.e. Prophet Muhammad (Peace be upon him) and whatever was revealed to him).","en.pickthall":"Nor were the People of the Scripture divided until after the clear proof came unto them.","en.qaribullah":"Those to whom the Book was given did not divide themselves until the Clear Proof came to them.","en.sahih":"Nor did those who were given the Scripture become divided until after there had come to them clear evidence.","en.sarwar":"Nor did the People of the Book disagreed among themselves until after receiving the ancient divine testaments.","en.yusufali":"Nor did the People of the Book make schisms, until after there came to them Clear Evidence.","en.maududi":"Nor did those to whom the Book had been given split up until after the Proof (of the Right Way) had come to them.","en.shakir":"And those who were given the Book did not become divided except after clear evidence had come to them.","en.itani":"Those who were given the Scripture did not splinter, except after the Clear Evidence came to them.","en.mubarakpuri":"And the People of the Scripture differed not until after there came to them the Bayyinah.","en.qarai":"Those who were given the Book did not divide except after the proof had come to them.","en.wahiduddin":"Those who were given the Book did not become divided except after clear evidence was given to them."},"tafsir":{"ar.muyassar":"وما اختلف الذين أوتوا الكتاب من اليهود والنصارى في كون محمد صلى الله عليه وسلم رسولا حقًا؛ لما يجدونه من نعته في كتابهم، إلا مِن بعد ما تبينوا أنه النبي الذي وُعِدوا به في التوراة والإنجيل، فكانوا مجتمعين على صحة نبوته، فلما بُعِث جحدوها وتفرَّقوا.","ar.jalalayn":"«وما تفرق الذين أوتوا الكتاب» في الإيمان به «إلا من بعد ما جاءتهم البينة» أي هو صلى الله عليه وسلم أو القرآن الجائي به معجزة له وقبل مجيئه صلى الله عليه وسلم كانوا مجتمعين على الإيمان به إذا جاءه فحسده من كفر به منهم.","ar.qurtubi":"قوله تعالى : وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينةقوله تعالى : وما تفرق الذين أوتوا الكتاب أي من اليهود والنصارى . خص أهل الكتاب بالتفريق دون غيرهم وإن كانوا مجموعين مع الكافرين ; لأنهم مظنون بهم علم فإذا تفرقوا كان غيرهم ممن لا كتاب له أدخل في هذا الوصف .إلا من بعد ما جاءتهم البينة أي أتتهم البينة الواضحة . والمعني به محمد - صلى الله عليه وسلم - ; أي القرآن موافقا لما في أيديهم من الكتاب بنعته وصفته . وذلك أنهم كانوا مجتمعين على نبوته ، فلما بعث جحدوا نبوته وتفرقوا ، فمنهم من كفر بغيا وحسدا ، ومنهم من آمن ; كقوله تعالى : وما تفرقوا إلا من بعد ما جاءهم العلم بغيا بينهم . وقيل : البينة : البيان الذي في كتبهم أنه نبي مرسل . قال العلماء : من أول السورة إلى قوله قيمة : حكمها فيمن آمن من أهل الكتاب والمشركين . وقوله : وما تفرق : حكمه فيمن لم يؤمن من أهل الكتاب بعد قيام الحجج .\n","ar.miqbas":"وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ (4)ارتقاء في الإِبطال وهو إبطال ثان لدعواهم بطريق النقض الجدلي المسمى بالمعارضة وهو تسليم الدليل والاستدلالُ لما ينافي ثبوت المدلول ، وهذا إبطال خاص بأهل الكتاب اليهود والنصارى ، ولذلك أظهر فاعل { تفرق } ولم يقل : وما تفرقوا إلا من بعد ما جاءتهم البينة ، إذ لو أضمر لتوُهِّمَت إرادة المشركين من جملة معاد الضمير ، بعد أن أبطل زعمهم بقوله : { رسول من الله يتلوا صحفاً مطهرة } [ البينة : 2 ] ارتقى إلى إبطال مزاعمهم إبطالاً مشوباً بالتكذيب وبشهادة ما حصل في الأزمان الماضية .فيجوز أن تكون الواو للعطف عاطفة إبطالاً على إبطال ، ويجوز أن تكون واو الحال .والمعنى : كيف يزعمون أن تمسكهم بما هم عليه من الدين مغيّاً بوقت أن تأتيهم البينة والحال أنهم جاءتهم بينة من قبل ظهور الإِسلام وهي بينة عيسى عليه السلام فتفرقوا في الإِيمان به فنشأ من تفرقهم حدوث مِلتين اليهودية والنصرانية .والمراد بهذه البينة الثانية مجيء عيسى عليه السلام فإن الله أرسله كما وعدهم أنبياؤهم أمثالُ إلياسَ واليسع وأشعياء . وقد أجمع اليهود على النبي الموعود به تجديد الدين الحق وكانوا منتظرين المخلص ، فلما جاءهم عيسى كذبوه ، أي فلا يطمع في صدقهم فيما زعموا من انتظار البينة بعد عيسى وهم قد كذبوا ببينة عيسى ، فتبين أن الجحود والعناد شنشنة فيهم معروفة .والمراد بالتفرق : تفرق بني إسرائيل بين مكذّب لعيسى ومؤمن به وما آمن به إلا نفر قليل من اليهود .وجُعل التفرق كناية عن إنكار البينة لأن تفرقهم كان اختلافاً في تصديق بينة عيسى عليه السلام ، فاستعمل التفرق في صريحه وكنايته لقصد إدماج مَذَمتهم بالاختلاف بعد ظهور الحق كقوله : { وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغياً بينهم } [ آل عمران : 19 ] .فالتعريف في { البينة } المذكورة ثانياً يجوز أن يكون للعهد الذهني ، أو للمعهود بَيْن المتحدَّث عنهم ، وهي بينة أخرى غير الأولى وإعادتُها من إعادة النكرة نكرة مثلها إذ المعرف بلام العهد الذهني بمنزلة النكرة ، أو من إعادة المعرفة المعهودة معرفةً مثلها ، وعلى كلا الوجهين لا تكون المعادة عين التي قبلها .وقد أطبقت كلمات المفسرين على أن معنى قوله تعالى : { وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة } أنهم ما تفرقوا عن اتباع الإِسلام ، أي تباعدوا عنه إلا من بعد ما جاء محمد صلى الله عليه وسلم وهذا تأويل للفظ التفرق وهو صرف عن ظاهره بعيد فأشكل عليهم وجه تخصيص أهل الكتاب بالذكر مع أن التباعد عن الإِسلام حاصل منهم ومن المشركين ، وجعلوا المراد ب { البينة } الثانية عين المراد بالأولى وهي بينة محمد صلى الله عليه وسلم سوى أن الفخر ذكر كلمات تنبىء عن مخالفة المفسرين في محمل تفرق الذين أوتوا الكتاب فإنه بعد أن قرر المعنى بما يوافق كلام بقية المفسرين أتى بما يقتضي حمل التفرق على حقيقته ، وحمل البينة الثانية على معنى مغاير لمحمل { البينة } الأولى ، إذ قال : «المقصود من هذه الآية تسلية محمد صلى الله عليه وسلم أي لا يغمنّك تفرقهم فليس ذلك لقصور في الحجة بل لعنادهم فسلفهم هكذا كانوا لم يتفرقوا في السبب وعبادة العجل إلا بعد ما جاءتهم البينة ، فهي عادة قديمة لهم» ، وهو معارض لأول كلامه ، ولعله بدا له هذا الوجه وشغله عن تحريره شاغل وهذا مما تركه الفخر في المسودة .\n","ar.waseet":"ثم بين - سبحانه - ما كان عليه أهل الكتاب من جحودهم للحق ، ومن إنكارهم له مع علمهم به ، فقال - تعالى - ( وَمَا تَفَرَّقَ الذين أُوتُواْ الكتاب إِلاَّ مِن بَعْدِ مَا جَآءَتْهُمُ البينة ) . أى : أن الجاحدين والمعاندين والحاسدين لك - أيها الرسول الكريم - من أهل الكتاب ، ما تفرقوا فى أمره ، وما اختلفوا فى شأن نبوتك . . إلأا من بعد أن جئتهم أنت بما يدل على صدقك ، دلالة لا يجحدها إلا جهول ، ولا ينكرها إلا حسود ، ولا يعرض عنها إلا من طغى وآثر الحياة الدنيا .فالآية الكريمة كلام مستأنف ، المقصود به تسليته صلى الله عليه وسلم عما أصابه من هؤلاء الجاحدين فكأنه - سبحانه - يقول له : لا تحزن - أيها الرسول الكريم - لإِعراض من أعرض عن دعوتك من أهل الكتاب ، فإن إعراضهم لم يكن عن جهل ، وإنما عن عناد وجحود وحسد لك على ما آتاك الله من فضله .وإنما خص - سبحانه - هنا أهل الكتاب بالذكر ، مع أن الكلام فى أول السورة كان فيهم وفى المشركين ، للدلالة على شناعة حالهم ، وقبح فعالهم ، لأن الإِعراض عن الحق ممن له كتاب ، أشد قبحا ونكرا ، ممن ليس له كتاب وهم المشركون .والاستثناء فى الآية مفرغ ، والمستثنى منه عموم الأوقات . والمعنى : لم يتفرق الجاحدون من الذين أوتوا الكتاب فى وقت من الأوقات ، إلا فى الوقت الكائن بعد مجئ البينة لهم .ومن الآيات القرآنية الكثيرة التى وردت فى هذا المعنى قوله - تعالى - ( وَمَا تفرقوا إِلاَّ مِن بَعْدِ مَا جَآءَهُمُ العلم بَغْياً بَيْنَهُمْ ).\n","ar.baghawi":"( وما تفرق الذين أوتوا الكتاب ) في أمر محمد - صلى الله عليه وسلم - ، ( إلا من بعد ما جاءتهم البينة ) أي البيان في كتبهم أنه نبي مرسل .قال المفسرون : لم يزل أهل الكتاب مجتمعين في تصديق محمد - صلى الله عليه وسلم - حتى بعثه الله ، فلما بعث تفرقوا في أمره واختلفوا ، فآمن به بعضهم ، وكفر آخرون .وقال بعض أئمة اللغة : معنى قوله \" منفكين \" : هالكين ، من قولهم : انفك [ صلا ] المرأة عند الولادة ، وهو أن ينفصل فلا يلتئم فتهلك .ومعنى الآية : لم يكونوا هالكين معذبين إلا من بعد قيام الحجة عليهم بإرسال الرسول وإنزال الكتاب ، والأول أصح .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6134.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6134.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6134.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ","transliteration":"Wa maa umiroo il-la liy'abu dul laaha mukhliseena lahud-deena huna faa-a wa yuqeemus salaahta wa yu-tuz zakaata; wa zaalika deenul qaiyimah","translations":{"en.ahmedali":"They were commanded only to serve God with all-exclusive faith in Him, to be upright, and to fulfil their devotional obligations, and to give zakat; for this is the even way.","en.ahmedraza":"And they were ordered only to worship Allah, believing purely in Him – devoted solely (to Him), and to establish the prayer and to pay the obligatory charity – and this is the straight religion.","en.arberry":"They were commanded only to serve God, making the religion His sincerely, men of pure faith, and to perform the prayer, and pay the alms -- that is the religion of the True.","en.asad":"And withal, they were not enjoined aught but that they should worship God, sincere in their faith in Him alone, turning away from all that is false; and that they should be constant in prayer; and that they should spend in charity: for this is a moral law endowed with ever-true soundness and clarity.","en.daryabadi":"And they were commanded not but that they should worship Allah, keeping religion pure for him, as upright men, and that they should establish prayer and give the poor-rate, And that is the right religion.","en.hilali":"And they were commanded not, but that they should worship Allah, and worship none but Him Alone (abstaining from ascribing partners to Him), and perform As-Salat (Iqamat-as-Salat) and give Zakat: and that is the right religion.","en.pickthall":"And they are ordered naught else than to serve Allah, keeping religion pure for Him, as men by nature upright, and to establish worship and to pay the poor-due. That is true religion.","en.qaribullah":"Yet they were ordered to worship Allah alone, making the Religion His sincerely, upright, and to establish their prayers and to pay the obligatory charity. That is indeed the Religion of Straightness.","en.sahih":"And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion.","en.sarwar":"They were only commanded to worship God, be uprightly devoted to His religion, steadfast in prayer and pay the zakat. This is truly the eternal religion.","en.yusufali":"And they have been commanded no more than this: To worship Allah, offering Him sincere devotion, being true (in faith); to establish regular prayer; and to practise regular charity; and that is the Religion Right and Straight.","en.maududi":"Yet all that they had been commanded was that they serve Allah, with utter sincerity, devoting themselves exclusively to Him, and that they establish Prayer and pay Zakah. That is the Right Faith.","en.shakir":"And they were not enjoined anything except that they should serve Allah, being sincere to Him in obedience, upright, and keep up prayer and pay the poor-rate, and that is the right religion.","en.itani":"They were commanded only to worship God, devoting their faith to Him alone, and to practice regular prayer, and to give alms. That is the upright religion.","en.mubarakpuri":"And they were commanded not, but that they should worship Allah, making religion purely for Him alone, Hunafa', and that they perform Salah and give Zakah, and that is the right religion.","en.qarai":"Though they were not commanded except to worship Allah, dedicating their faith to Him as men of pure faith, and to maintain the prayer and pay the zakat. That is the upright religion.","en.wahiduddin":"They were commanded only to worship God, offering Him sincere devotion, to be sincere in their faith, to pray regularly; and to give alms, for that is the right religion."},"tafsir":{"ar.muyassar":"وما أمروا في سائر الشرائع إلا ليعبدوا الله وحده قاصدين بعبادتهم وجهه، مائلين عن الشرك إلى الإيمان، ويقيموا الصلاة، ويُؤَدُّوا الزكاة، وذلك هو دين الاستقامة، وهو الإسلام.","ar.jalalayn":"«وما أمروا» في كتابهم التوراة والإنجيل «إلا ليعبدوا الله» أي أن يعبدوه فحذفت أن وزيدت اللام «مخلصين له الدين» من الشرك «حنفاء» مستقيمين على دين إبراهيم ودين محمد إذا جاء فكيف كفروا به «ويقيموا الصلاة ويؤتوا الزكاة وذلك دين» الملة «القيِّمة» المستقيمة.","ar.qurtubi":"قوله تعالى : وما أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة وذلك دين القيمةفيه ثلاث مسائل :الأولى : قوله تعالى : وما أمروا أي وما أمر هؤلاء الكفار في التوراة والإنجيلإلا ليعبدوا الله أي ليوحدوه . واللام في ليعبدوا بمعنى أن ; كقوله : يريد الله ليبين لكم أي أن يبين . و يريدون ليطفئوا نور الله . و أمرنا لنسلم لرب العالمين . وفي حرف عبد الله : وما أمروا إلا أن يعبدوا الله .مخلصين له الدين أي العبادة ; ومنه قوله تعالى : قل إني أمرت أن أعبد الله مخلصا له الدين . وفي هذا دليل على وجوب النية في العبادات فإن الإخلاص من عمل القلب وهو الذي يراد به وجه الله تعالى لا غيره .الثانية : قوله تعالى : حنفاء أي مائلين عن الأديان كلها ، إلى دين الإسلام ، وكان ابن عباس يقول : حنفاء على دين إبراهيم - عليه السلام - . وقيل : الحنيف : من اختتن وحج ; قاله سعيد بن جبير . قال أهل اللغة : وأصله أنه تحنف إلى الإسلام ; أي مال إليه .[ ص: 128 ] الثالثة : قوله تعالى : ويقيموا الصلاة أي بحدودها في أوقاتها .ويؤتوا الزكاة أي يعطوها عند محلها .وذلك دين القيمة أي ذلك الدين الذي أمروا به دين القيامة ; أي الدين المستقيم . وقال الزجاج : أي ذلك دين الملة المستقيمة . والقيمة : نعت لموصوف محذوف . أو يقال : دين الأمة القيمة بالحق ; أي القائمة بالحق . وفي حرف عبد الله وذلك الدين القيم . قال الخليل : القيمة جمع القيم ، والقيم والقائم : واحد . وقال الفراء : أضاف الدين إلى القيمة وهو نعته ، لاختلاف اللفظين . وعنه أيضا : هو من باب إضافة الشيء إلى نفسه ، ودخلت الهاء للمدح والمبالغة . وقيل : الهاء راجعة إلى الملة أو الشريعة . وقال محمد بن الأشعث ، الطالقاني القيمة هاهنا : الكتب التي جرى ذكرها ، والدين مضاف إليها .\n","ar.miqbas":"وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ (5)هذا إبطال ثالث لتنصلهم من متابعة الإِسلام بعلة أنهم لا يتركون ما هم عليه حتى تأتيهم البينة وزعمهم أن البينة لم تأتهم .وهو إبطال بطريق القول بالموجَب في الجدل ، أي إذا سلمنا أنكم مُوصَوْن بالتمسك بما أنتم عليه لا تنفكون عنه حتى تأتيكم البينة ، فليس في الإِسلام ما ينافي ما جاء به كتابكم لأن كتابكم يأمر بما أمر به القرآن ، وهو عبادة الله وحده دون إشراك ، وذلك هو الحنيفية وهي دين إبراهيم الذي أخذ عليهم العهد به ، فذلك دين الإِسلام وذلك ما أمرتم به في دينكم .فلك أن تجعل الواو عاطفة على جملة : { وما تفرق الذين أوتوا الكتاب } [ البينة : 4 ] الخ .ولك أن تجعل الواو للحال فتكون الجملة حالاً من الضمير في قوله : { حتى تأتيهم البينة } [ البينة : 1 ] . والمعنى والحال أن البينة قد أتتهم إذ جاء الإِسلام بما صدَّق قول الله تعالى لموسى عليه السلام : «أقيم لهم نبيئاً من وسط إخوتهم وأجعل كلامي في فمه» ، وقول عيسى عليه السلام : «فهو يعلمكم كل شيء ويذكركم بكل ما قلته لكم» .والتعبير بالفعل المسند للمجهول مفيد معنيين ، أي ما أمروا في كتابهم إلا بما جاء به الإِسلام . فالمعنى : وما أمروا في التوراة والإِنجيل إلا أن يعبدوا الله مخلصين إلى آخره . فإن التوراة أكدت على اليهود تجنب عبادة الأصنام ، وأمرت بالصلاة ، وأمرت بالزكاة أمراً مؤكداً مكرراً .  وتلك هي أصول دين الإِسلام قبل أن يفرض صَوم رمضان والحج ، والإِنجيل لم يخالف التوراة أو المعنى وما أمروا في الإِسلام إلا بمثل ما أمرهم به كتابهم ، فلا معذرة لهم في الإِعراض عن الإِسلام على كلا التقديرين .ونائب فاعل { أمروا } محذوف للعموم ، أي ما أمروا بشيء إلا بأن يعبدوا الله .واللام في قوله : { ليعبدوا اللَّه } هي اللام التي تكثر زيادتها بعد فعل الإِرادة وفعل الأمر وتقدم ذكرها عند قوله تعالى : { يريد اللَّه ليبين لكم } في سورة النساء ( 26 ) وقوله : { وأمرنا لنسلم لرب العالمين } في سورة الأنعام ( 71 ) ، وسماها بعض النحاة لام ( أنْ ) .والإخلاص : التصفية والإِنقاء ، أي غير مشاركين في عبادته معه غيره .والدين : الطاعة قال تعالى : { قل اللَّه أعبد مخلصاً له ديني } [ الزمر : 14 ] .وحنفاء : جمع حنيف ، وهو لقب للذي يؤمن بالله وحده دون شريك قال تعالى : { قل إنني هداني ربي إلى صراط مستقيم ديناً قيماً ملة إبراهيم حنيفاً وما كان من المشركين } [ الأنعام : 161 ] .وهذا الوصف تأكيد لمعنى : { مخلصين له الدين } مع التذكير بأن ذلك هو دين إبراهيم عليه السلام الذي ملئت التوراة بتمجيده واتباع هديه .وإقامة الصلاة من أصول شريعة التوراة كلَّ صباح ومساء .وإيتاء الزكاة : مفروض في التوراة فرضاً مؤكداً .واسم الإِشارة في قوله : { وذلك دين القيمة } متوجِّهٌ إلى ما بعد حرف الاستثناء فإنه مقترن باللام المسماة ( لام أنْ ) المصدرية فهو في تأويل مفرد ، أي إلا بعبادة الله وإقامة الصلاة وإيتاء الزكاة ، أي والمذكورُ دين القيمة .و { دين القيمة } يجوز أن تكون إضافته على بابها فتكون { القيمة } مراداً به غير المراد بدين مما هو مؤنث اللفظ مما يضاف إليه دين أي دين الأمة القيّمة أو دين الكُتُب القَيمة . ويرجّح هذا التقدير أن دليل المقدَّر موجود في اللفظ قبله . وهذا إلزام لهم بأحقية الإِسلام وأنه الدين القيم قال تعالى : { فأقم وجهك للدين حنيفاً فطرة اللَّه التي فطر الناس عليها لا تبديل لخلق اللَّه ذلك الدين القيم ولكن أكثر الناس لا يعلمون منيبين إليه واتقوه وأقيموا الصلاة } [ الروم : 30 31 ] .ويجوز أن تكون الإِضافة صورية من إضافة الموصوف إلى الصفة وهي كثيرة الاستعمال ، وأصله الدين القيم ، فأنث الوصف على تأويل دين بملة أو شريعة ، أو على أن التاء للمبالغة في الوصف مثل تاء علاّمة والمآل واحد ، وعلى كلا التقديرين فالمراد بدين القيمة دين الإِسلام .والقيمة : الشديدة الاستقامة وقد تقدم آنفاً .فالمعنى : وذلك المذكور هو دين أهل الحق من الأنبياء وصالحي الأمم وهو عين ما جاء به الإِسلام قال تعالى في إبراهيم : { ولكن كان حنيفاً مسلماً } [ آل عمران : 67 ] وقال عنه وعن إسماعيل : { ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك } [ البقرة : 128 ] . وحكى عنه وعن يعقوب قولهما : { فلا تموتن إلا وأنتم مسلمون } [ البقرة : 132 ] وقال سليمان : { وكنا مسلمين } [ النمل : 42 ] .وقد مضى القول في ذلك عند قوله تعالى : { فلا تموتن إلا وأنتم مسلمون } في سورة البقرة ( 132 ) .والإِشارة بذلك إلى الذي أمروا به أي مجموع ما ذكر هو دين الإِسلام ، أي هو الذي دعاهم إليه الإِسلام فحسبوه نقضاً لدينهم ، فيكون مهيع الآية مثل قوله تعالى : { قل يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أَلاَّ نعبد إلا الله ولا نشرك به شيئاً ولا يتخذ بعضنا بعضاً أرباباً من دون اللَّه فإن تولوا فقولوا اشهدوا بأنا مسلمون } [ آل عمران : 64 ] وقوله : { قل يا أهل الكتاب هل تنقمون منا إلا أن آمنا باللَّه وما أنزل إلينا وما أنزل من قبل } [ المائدة : 59 ] .والمقصود إقامة الحجة على أهل الكتاب وعلى المشركين تبعاً لهم بأنهم أعرضوا عما هم يتطلبونه فإنهم جميعاً مقرّون بأن الحنيفية هي الحق الذي أقيمت عليه الموسوية والعيسوية ، والمشركون يزعمون أنهم يطلبون الحنيفية ويأخذون بما أدركوه من بقاياها ويزعمون أن اليهودية والنصرانية تحريف للحنيفية ، فلذلك كان عامة العرب غير متهودين ولا متنصرين ويتمسكون بما وجدوا آباءهم متمسكين به وقلّ منهم من تهودوا أو تنصروا ، وذهب نفر منهم يتطلبون آثار الحنيفية مثل زيد بن عمرو بن نُفَيْل ، وأميَّة بن أبي الصَّلْت .وخصّ الضمير ب«أهل الكتاب» لأن المشركين لم يؤمروا بذلك قبل الإِسلام قال تعالى : { لتنذر قوماً ما أتاهم من نذير من قبلك } [ القصص : 46 ] .\n","ar.waseet":"ثم بين - سبحانه - ما كان يجب عليهم أن يفعلوه ، فقال : ( وَمَآ أمروا إِلاَّ لِيَعْبُدُواْ الله مُخْلِصِينَ لَهُ الدين حُنَفَآءَ وَيُقِيمُواْ الصلاة وَيُؤْتُواْ الزكاة وَذَلِكَ دِينُ القيمة ) .والواو فى قوله - تعالى - ( وَمَآ أمروا ) للحال ، فهذه الجملة حالية ، والمقصود منها بيان أن هؤلاء الضالين ، قد بلغوا النهاية فى قبح الأفعال ، وفى فساد العقول ، إذ أنهم تفرقوا واختلفوا وأعرضوا عن الهدى ، فى حال أنهم لم يؤمروا إلا بما فيه صلاحهم .وقوله : ( حنفاء ) من الحَنف ، وهو الميل من الدين الباطل إلى الدين الحق . كما أن الجنف هو الميل من الحق إلى الباطل .أى : أن هؤلاء الكافرين من أهل الكتاب تفرقوا واختلفوا فى شأن الحق ، والحال ، أنهم لم يؤمروا إلا بعبادة الله - تعالى - وحده ، مخلصين له الطاعة ، ومائلين عن الأديان الباطلة إلى الدين الحق ، مؤمنين بجميع الرسل بدون تفرقة بينهم ، إذ ملتهم جميعا وادحدة ، ولم يؤمروا - أيضا - إلا بإقامة الصلاة فى أوقاتها بخشوع وإخلاص لله رب العالمين ، وبإيتاء الزكاة التى تطهرهم وتزكيهم .( وذلك ) الذى أمرناهم به من إخلاص العبادة لنا ، ومن أداء فرائضنا ( دِينُ القيمة ) . أى : دين الملة المستقيمة القيمة ، أو دين الكتب القيمة .ولفظ \" القيمة \" بزنة فيعلة - من القوامة ، وهى غاية الاستقامة ، وهذا اللفظ صفة لموصوف محذوف .\n","ar.baghawi":"ثم ذكر ما أمروا به في كتبهم فقال : ( وما أمروا ) يعني هؤلاء الكفار ، ( إلا ليعبدوا الله ) يعني إلا أن يعبدوا الله ، ( مخلصين له الدين ) قال ابن عباس : ما أمروا في التوراة والإنجيل إلا [ بالإخلاص في ] العبادة لله موحدين ، ( حنفاء ) مائلين عن الأديان كلها إلى دين الإسلام ، ( ويقيموا الصلاة ) المكتوبة في أوقاتها ، ( ويؤتوا الزكاة ) عند محلها ، ( وذلك ) الذي أمروا به ، ( دين القيمة ) أي الملة والشريعة المستقيمة . أضاف الدين إلى القيمة وهي نعته ، لاختلاف اللفظين ، وأنث \" القيمة \" ردا بها إلى الملة .وقيل : الهاء فيه للمبالغة ، وقيل : \" القيمة \" هي الكتب التي جرى ذكرها ، أي وذلك دين الكتب القيمة فيما تدعو إليه وتأمر به ، كما قال : وأنزل معهم الكتاب بالحق ليحكم بين الناس فيما اختلفوا فيه ( البقرة 213 ) .قال النضر بن شميل : سألت الخليل بن أحمد عن قوله : \" وذلك دين القيمة \" ؟ فقال : \" القيمة \" : جمع القيم ، والقيم والقائم واحد ، ومجاز الآية : وذلك دين القائمين لله بالتوحيد .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6135.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6135.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6135.mp3","format":"mp3","local_path":null}}},{"verse":6,"arabic":"إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ","transliteration":"Innal lazeena kafaru min ahlil kitaabi wal mushri keena fee nari jahan nama khaali deena feeha; ulaa-ika hum shar rul ba reeyah","translations":{"en.ahmedali":"Surely the unbelievers among the people of the Book and the idolaters, will abide in the fire of Hell. They are the worst of creatures.","en.ahmedraza":"Indeed all disbelievers, the People of the Book(s) and the polytheists, are in the fire of hell – they will remain in it for ever; it is they who are the worst among the creation.","en.arberry":"The unbelievers of the People of the Book and the idolaters shall be in the Fire of Gehenna, therein dwelling forever; those are the worst of creatures.","en.asad":"Verily, those who [despite all evidence] are bent on denying the truth - [be they] from among the followers of earlier revelation or from among those who ascribe divinity to aught beside God - will find themselves in the fire of hell, therein to abide: they are the worst of all creatures.","en.daryabadi":"Verily those who disbelieve from among the people of the Book and the associaters shall be cast into the Hell-fire, as abiders therein. These! they are the worst of the creation.","en.hilali":"Verily, those who disbelieve (in the religion of Islam, the Quran and Prophet Muhammad (Peace be upon him)) from among the people of the Scripture (Jews and Christians) and Al-Mushrikun will abide in the Fire of Hell. They are the worst of creatures.","en.pickthall":"Lo! those who disbelieve, among the People of the Scripture and the idolaters, will abide in fire of hell. They are the worst of created beings.","en.qaribullah":"The unbelievers among the People of the Book and the idolaters shall be for ever in the Fire of Gehenna (Hell). They are the worst of all creatures.","en.sahih":"Indeed, they who disbelieved among the People of the Scripture and the polytheists will be in the fire of Hell, abiding eternally therein. Those are the worst of creatures.","en.sarwar":"The disbelievers among the People of the Book and the pagans will dwell forever in hell; they are the worst of all creatures.","en.yusufali":"Those who reject (Truth), among the People of the Book and among the Polytheists, will be in Hell-Fire, to dwell therein (for aye). They are the worst of creatures.","en.maududi":"Those who disbelieved – be they from among the People of the Book or among those who associated others with Allah in His Divinity– shall be in the Fire, and will abide in it. They are the worst of creatures.","en.shakir":"Surely those who disbelieve from among the followers of the Book and the polytheists shall be in the fire of hell, abiding therein; they are the worst of men.","en.itani":"Those who disbelieve among the People of the Scripture, and the Polytheists, will be in the Fire of Hell, where they will abide forever. These are the worst of creatures.","en.mubarakpuri":"Verily, those who disbelieve from among the People of the Scripture and idolators, will abide in the fire of Hell. They are the worst of creatures.","en.qarai":"Indeed the faithless from among the People of the Book and the polytheists will be in the fire of hell, to remain in it [forever]. It is they who are the worst of creatures.","en.wahiduddin":"Those of the deniers of truth among the People of the Book and the polytheists will dwell forever in Hell-fire. They are the worst of creatures."},"tafsir":{"ar.muyassar":"إن الذين كفروا من اليهود والنصارى والمشركين عقابهم نار جهنم خالدين فيها، أولئك هم أشد الخليقة شرا.","ar.jalalayn":"«إن الذين كفروا من أهل الكتاب والمشركين في نار جهنم خالدين فيها» حال مقدرة، أي مقدرا خلودهم فيها من الله تعالى «أولئك هم شر البرية».","ar.qurtubi":"قوله تعالى : إن الذين كفروا من أهل الكتاب والمشركين المشركين : معطوف على الذين ، أو يكون مجرورا معطوفا على أهل .في نار جهنم خالدين فيها أولئك هم شر البرية قرأ نافع وابن ذكوان بالهمز على الأصل في الموضعين ; من قولهم : برأ الله الخلق ، وهو البارئ الخالق ، وقال : من قبل أن نبرأها . الباقون بغير همز ، وشد الياء عوضا منه . قال الفراء : إن أخذت البرية من البرى ، وهو التراب ، فأصله غير الهمز ; تقول منه : براه الله يبروه بروا ; أي خلقه . قال القشيري : ومن قال البرية من البرى ، وهو التراب ، قال : لا تدخل الملائكة تحت هذه اللفظة . وقيل : البرية : من بريت القلم ، أي قدرته ; فتدخل فيه الملائكة . ولكنه قول ضعيف ; لأنه يجب منه تخطئة من همز . وقوله شر البرية أي شر الخليقة . فقيل يحتمل أن يكون على التعميم . وقال قوم : أي هم شر البرية الذين كانوا في عصر النبي - صلى الله عليه وسلم - ; كما قال تعالى : وأني فضلتكم على العالمين أي على عالمي زمانكم . ولا يبعد أن يكون في كفار الأمم قبل هذا من هو شر منهم ; مثل فرعون وعاقر ناقة صالح .\n","ar.miqbas":"إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا أُولَئِكَ هُمْ شَرُّ الْبَرِيَّةِ (6)بعد أن أنحى على أهل الكتاب والمشركين معاً ثم خَصَّ أهل الكتاب بالطعن في تعللاتهم والإِبطال لشبهاتهم التي يتابعهم المشركون عليها . أعقبه بوعيد الفريقين جمعاً بينهما كما ابتدأ الجمع بينهما في أول السورة لأن ما سبق من الموعظة والدلالة كاف في تدليل أنفسهم للموعظة .فالجملة استئناف ابتدائي ، وقدم أهل الكتاب على المشركين في الوعيد استتباعاً لتقديمهم عليهم في سببه كما تقدم في أول السورة ، ولأن معظم الرد كان موجهاً إلى أحوالهم من قوله : { وما تفرق الذين أوتوا الكتاب } إلى قوله : { دين القيمة } [ البينة : 4 ، 5 ] ، ولأنه لو آمن أهل الكتاب لقامت الحجة على أهل الشرك .و { مِن } بيانية مثل التي في قوله : { لم يكن الذين كفروا من أهل الكتاب والمشركين } [ البينة : 1 ] .وتأكيد الخبر ب { إنّ } للرد على أهل الكتاب الذين يزعمون أنهم لا تمسهم النار إلا أياماً معدودة ، فإن الظرفية التي اقتضتها { في } تفيد أنهم غير خارجين منها ، وتأكد ذلك بقوله : { خالدين فيها } ، وأما المشركون فقد أنكروا الجزاء رأساً .والإِخبارُ عنهم بالكون في نار جهنم إخبار بما يحصل في المستقبل بقرينة مقام الوعيد فإن الوعيد كالوعد يتعلق بالمستقبل وإن كان شأن الجملة الاسمية غير المقيدة بما يعين زمان وقوعها أن تفيد حصول مضمونها في الحال كما تقول : زيد في نعمة .وجملة : { أولئك هم شر البريئة } كالنتيجة لكونهم في نار جهنم خالدين فيها فلذلك فصلت عن الجملة التي قبلها وهو إخبار بسوء عاقبتهم في الآخرة وأريد بالبريئة هنا البريئة المشهورة في الاستعمال وهم البشر ، فلا اعتبار للشياطين في هذا الاسم وهذا يشبه الاستغراق العرفي .والبريئة : فعيلة من بَرأ الله الخلق ، أي صورهم .ومعنى كونهم { شر البريئة } أنهم أشد الناس شراً ، ف { شر } هنا أفعل تفضيل أصله أشر مثل خير الذي هو بمعنى أخير ، فإضافة { شر } إلى { البريئة } على نية { مِن } التفضيلية .وإنما كانوا كذلك لأنهم ضلوا بعد تلبسهم بأسباب الهدى ، فأما أهل الكتاب فلأن لديهم كتاباً فيه هدى ونور فعدلوا عنه ، وأما المشركون فلأنهم كانوا على الحنيفية فأدخلوا فيها عبادة الأصنام ثم إنهم أصرّوا على دينهم بعدما شاهدوا من دلائل صدق محمد صلى الله عليه وسلم وما جاء به القرآن من الإِعجاز والإِنباء بما في كتب أهل الكتاب ، وذلك مما لم يشاركهم فيه غيرهم فقد اجتنوا لأنفسهم الشر من حيث كانوا أهلاً لنوال الخير فحسرتهم على أنفسهم يوم القيامة أشد من حسرة من عداهم فكان الفريقان شراً من الوثنيين والزنادقة في استحقاق العقاب لا فيما يرجى منهم من الاقتراب .وأقحم اسم الإِشارة بين اسم { إنَّ } وخبرها للتنبيه على أنهم أحرياء بالحكم الوارد بعد اسم الإِشارة من أجل الأوصاف التي قبل اسم الإِشارة كما في قوله :{ أولئك على هدى من ربهم } [ البقرة : 5 ] . وتوسيط ضمير الفصل لإِفادة اختصاصهم بكونهم شر البريئة لا يشاركهم في ذلك غيرهم من فرق أهل الكفر لما علمت آنفاً . ولا يرد أن الشياطين أشد شراً منهم لما علمت أن اسم البريئة اعتبر إطلاقه على البشر .و { البريئة } قرأه نافع وحده وابنُ ذكوان عن ابن عامر بهمز بعد الياء فعيلة من برأ اللَّهُ ، إذا خلق .وقرأه بقية العشرة بياء تحتية مشددة دون همز على تسهيل الهمزة بعد الكسرة ياء وإدغام الياء الأولى في الياء الثانية تخفيفاً .وإثبات الهمزة لغة أهل الحجاز ، والتخفيف لغة بقية العرب ، كما تركوا الهمز في الدَّرِيَّة والنبيّ . قال سيبويه : ليس أحد من العرب إلا ويقول : تنبأ مسيلمة بالهمز غير أنهم تركوا الهمز في النبيّ كما تركوه في : الدَّرِيَّة والبَرِيَّة إلا أهل مكة فإنهم يهمزونها ويخالفون العرب في ذلك .\n","ar.waseet":"ثم - بين - سبحانه - سوء عاقبة هؤلاء الجاحدين من أهل الكتاب ومن المشركين فقال : ( إِنَّ الذين كَفَرُواْ مِنْ أَهْلِ الكتاب والمشركين فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَآ ) .أى : إن الذين أصروا على كفرهم بعد أن تبين لهم ، من اليهود والنصارى ، ومن المشركين الذين هم عبدة الأصنام . . مكانهم المهيأ لهم هو نار جهنم ، حالة كونهم خالدين فيها خلودا أبديا ( أولئك ) الموصوفون بتلك الصفات الذميمة ( هُمْ شَرُّ البرية ) أى : هم شر كل صنف من أصناف المخلوقات ، لإِصرارهم على الكفر والإِشراك مع علمهم بالحق .ولفظ \" البرية \" من البرَى وهو التراب ، لأنهم قد خلقوا فى الأصل منه ، يقال : فلان برَاه الله - تعالى - يبرُوه بَرْواً . أى : خلقه وقرأ نافع بالهمز ، من قولهم برأ الله - تعالى - الخلق يبرؤهم ، أى : خلقهم .وقدم سبحانه - أهل الكتاب فى المذمة ، لأن جنايتهم فى حق الرسول صلى الله عليه وسلم أشد ، إذا كانوا يستفتحون به على المشركين ويقولون لهم : إن نبيا قد أظللنا زمانه ، وإننا عند مبعثه سنتبعه .. فلما بعث صلى الله عليه وسلم كفروا به .وقد تضمنت هذه الآية الكريمة أمرين : الأول : أن هؤلاء الضالين خالدون فى النار ، والثانى : أنهم شر المخلوقات التى خلقها الله - تعالى - .\n","ar.baghawi":"ثم ذكر ما للفريقين فقال : ( إن الذين كفروا من أهل الكتاب والمشركين في نار جهنم خالدين فيها أولئك هم شر البرية ) قرأ نافع وابن عامر \" البريئة \" بالهمزة في الحرفين لأنه من قولهم : برأ الله الخلق وقرأ الآخرون مشددا بغير همز كالذرية ترك همزها في الاستعمال .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6136.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6136.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6136.mp3","format":"mp3","local_path":null}}},{"verse":7,"arabic":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ","transliteration":"Innal lazeena aamanu wa 'amilus saalihaati ula-ika hum khairul bareey yah","translations":{"en.ahmedali":"But those who believe and do the right are surely the best of created beings,","en.ahmedraza":"Indeed those who accepted faith and did good deeds – it is they who are the best among the creation.","en.arberry":"But those who believe, and do righteous deeds, those are the best of creatures;","en.asad":"[And,] verily, those who have attained to faith, and do righteous deeds - it is they, they who are the best of all creatures.","en.daryabadi":"Verily those who believe and work righteous works - these! they are the best of the creation.","en.hilali":"Verily, those who believe [in the Oneness of Allah, and in His Messenger Muhammad (Peace be upon him)) including all obligations ordered by Islam] and do righteous good deeds, they are the best of creatures.","en.pickthall":"(And) lo! those who believe and do good works are the best of created beings.","en.qaribullah":"But those who believe and do good deeds are the best of all creatures.","en.sahih":"Indeed, they who have believed and done righteous deeds - those are the best of creatures.","en.sarwar":"The righteously striving believers are the best of all creatures.","en.yusufali":"Those who have faith and do righteous deeds,- they are the best of creatures.","en.maududi":"But those that believe and work righteous deeds, they are the best of creatures.","en.shakir":"(As for) those who believe and do good, surely they are the -best of men.","en.itani":"As for those who believe and lead a righteous life—these are the best of creatures.","en.mubarakpuri":"Verily, those who believe and do righteous good deeds, they are the best of creatures.","en.qarai":"Indeed those who have faith and do righteous deeds—it is they who are the best of creatures.","en.wahiduddin":"Truly, those who believe and do good works are the best of creatures."},"tafsir":{"ar.muyassar":"إن الذين صَدَّقوا الله واتبعوا رسوله وعملوا الصالحات، أولئك هم خير الخلق.","ar.jalalayn":"«إن الذين آمنوا وعملوا الصالحات أولئك هم خير البرية» الخليقة.","ar.qurtubi":"وكذا [ ص: 129 ] خير البرية : إما على التعميم ، أو خير برية عصرهم . وقد استدل بقراءة الهمز من فضل بني آدم على الملائكة ، وقد مضى في سورة ( البقرة ) القول فيه . وقال أبو هريرة - رضي الله عنه - : المؤمن أكرم على الله - عز وجل - من بعض الملائكة الذين عنده .\n","ar.miqbas":"إِنَّ الَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَئِكَ هُمْ خَيْرُ الْبَرِيَّةِ (7) { البرية * إِنَّ الذين ءَامَنُواْ وَعَمِلُواْ الصالحات أولئك هُمْ خَيْرُ البرية } { البرية * جَزَآؤُهُمْ عِندَ رَبِّهِمْ جنات عَدْنٍ تَجْرِى مِنْ تَحْتِهَا الانهار } .قوبل حال الكفرة من أهل الكتاب وحالُ المشركين بحال الذين آمنوا بعد أن أشِير إليهم بقوله : { وذلك دين القيمة } [ البينة : 5 ] ، استيعاباً لأحوال الفِرق في الدنيا والآخرة وجرياً على عادة القرآن في تعقيب نذارة المنذَرين ببشارة المطمئنين وما ترتب على ذلك من الثناء عليهم ، وقدم الثناء عليهم على بشارتهم على عكس نظم الكلام المتقدم في ضدهم ليكون ذكر وعدهم كالشكر لهم على إيمانهم وأعمالهم فإن الله شكور .والجملة استئناف بياني ناشىء عن تكرر ذكر الذين كفروا من أهل الكتاب والمشركين فإن ذلك يثير في نفوس الذين آمنوا من أهل الكتاب والمشركين تساؤلاً عن حالهم لعل تأخر إيمانهم إلى ما بعد نزول الآيات في التنديد عليهم يَجعلهم في انحطاط درجةٍ ، فجاءت هذه الآية مبينة أن من آمن منهم هو معدود في خير البريئة .والقول في اسم الإِشارة ، وضمير الفصل والقصر وهمز البريئة كالقول في نظيره المتقدم .واسم الإِشارة والجملة المخبر بها عنه جميعها خبر عن اسم { إن } .\n","ar.waseet":"ثم بين - سبحانه - بعد ذلك حسن عاقبة المؤمنين فقال : ( إِنَّ الذين آمَنُواْ وَعَمِلُواْ الصالحات ) أى : وعملوا الأعمال الصالحات ( أولئك هُمْ خَيْرُ البرية ) أى : أولئك هم خير المخلوقات التى خلقها الله - تعالى - .\n","ar.baghawi":"\"إن الذين آمنوا وعملوا الصالحات أولئك هم خير البرية\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6137.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6137.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6137.mp3","format":"mp3","local_path":null}}},{"verse":8,"arabic":"جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ","transliteration":"Jazaa-uhum inda rabbihim jan naatu 'adnin tajree min tahtihal an haaru khalideena feeha abada; radiy-yallaahu 'anhum wa ra du 'an zaalika liman khashiya rabbah.","translations":{"en.ahmedali":"Whose reward is with their Lord -- gardens of Eden with rivers flowing by, where they will abide for ever, God pleased with their service, they with obedience to Him. This (awaits) him who stands in awe of his Lord.","en.ahmedraza":"Their reward is – with their Lord – everlasting Gardens of Eden beneath which rivers flow, in which they will abide for ever and ever; Allah is pleased with them and they are pleased with Him; this is for one who fears his Lord.","en.arberry":"their recompense is with their Lord-Gardens of Eden, underneath which rivers flow, therein dwelling for ever and ever. God is well-pleased with them, and they are well-pleased with Him; that is for him who fears his Lord.","en.asad":"Their reward [awaits them] with God: gardens of perpetual bliss, through which running waters flow, therein to abide beyond the count of time; well-pleased is God with them, and well-pleased are they with Him: all this awaits him who of his Sustainer stands in awe!.","en.daryabadi":"Their recompense with their Lord shall be Gardens Everlasting, whereunder rivers flow - as abiders therein for evermore. Well-pleases will be Allah with them and well-pleased will be they with Him, That is for him who feareth his Lord.","en.hilali":"Their reward with their Lord is 'Adn (Eden) Paradise (Gardens of Eternity), underneath which rivers flow, they will abide therein forever, Allah Well-Pleased with them, and they with Him. That is for him who fears his Lord.","en.pickthall":"Their reward is with their Lord: Gardens of Eden underneath which rivers flow, wherein they dwell for ever. Allah hath pleasure in them and they have pleasure in Him. This is (in store) for him who feareth his Lord.","en.qaribullah":"Their recompense is with their Lord; Gardens of Eden, underneath which rivers flow, where they shall live for ever. Allah is wellpleased with them, and theyare wellpleased with Him. That is for he who fears his Lord!","en.sahih":"Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord.","en.sarwar":"Their reward from their Lord will be the gardens of Eden wherein streams flow and wherein they will live forever. God will be pleased with them and they will be pleased with Him. This (reward) is for those who fear their Lord.","en.yusufali":"Their reward is with Allah: Gardens of Eternity, beneath which rivers flow; they will dwell therein for ever; Allah well pleased with them, and they with Him: all this for such as fear their Lord and Cherisher.","en.maududi":"Their recompense lies with their Lord: Gardens of eternity beneath which rivers flow; therein they shall dwell, forever and ever. Allah is well-pleased with them, and they are well-pleased with Him. All this is for him who fears his Lord.","en.shakir":"Their reward with their Lord is gardens of perpetuity beneath which rivers flow, abiding therein for ever; Allah is well pleased with them and they are well pleased with Him; that is for him who fears his Lord.","en.itani":"Their reward is with their Lord: Gardens of Eternity beneath which rivers flow, where they will abide forever. God is pleased with them, and they are pleased with Him. That is for whoever fears His Lord.","en.mubarakpuri":"Their reward with their Lord is Eternal Gardens, underneath which rivers flow. They will abide therein forever, Allah will be pleased with them, and they well-pleased with Him. That is for him who fears his Lord.","en.qarai":"Their reward, near their Lord, is the Gardens of Eden, with streams running in them, to remain in them forever. Allah is pleased with them, and they are pleased with Him. That is for those who fear their Lord.","en.wahiduddin":"God has a reward in store for them: Gardens of eternity, through which rivers flow; they will dwell therein forever. God is well pleased with them and they are well pleased with Him. Thus shall the God-fearing be rewarded."},"tafsir":{"ar.muyassar":"جزاؤهم عند ربهم يوم القيامة جنات إقامة واستقرار في منتهى الحسن، تجري من تحت قصورها الأنهار، خالدين فيها أبدًا، رضي الله عنهم فقبل أعمالهم الصالحة، ورضوا عنه بما أعدَّ لهم من أنواع الكرامات، ذلك الجزاء الحسن لمن خاف الله واجتنب معاصيه.","ar.jalalayn":"«جزاؤهم عند ربهم جنات عدن» إقامة «تجرى من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم» بطاعته «ورضوا عنه» بثوابه «ذلك لمن خشي ربه» خاف عقابه فانتهى عن معصيته تعالى.","ar.qurtubi":"قوله تعالى : جزاؤهم عند ربهم جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك لمن خشي ربهقوله تعالى : جزاؤهم أي ثوابهم .عند ربهم أي خالقهم ومالكهم .جنات أي بساتين .عدن أي إقامة . والمفسرون يقولون : جنات عدن بطنان الجنة ، أي وسطها ; تقول : عدن بالمكان يعدن [ عدنا وعدونا ] : أقام . ومعدن الشيء : مركزه ومستقره . قال الأعشى :وإن يستضافوا إلى حكمه يضافوا إلى راجح قد عدنتجري من تحتها الأنهار خالدين فيها أبدا لا يظعنون ولا يموتون .رضي الله عنهم أي رضي أعمالهم ; كذا قال ابن عباس .ورضوا عنه أي رضوا هم بثواب الله - عز وجل - .ذلك أي الجنة .لمن خشي ربه أي خاف ربه ، فتناهى عن المعاصي .\n","ar.miqbas":"جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ذَلِكَ لِمَنْ خَشِيَ رَبَّهُ (8)وجملة : { جزاؤهم عند ربهم جنات عدن } إلى آخرها مبيِّنة لجملة : { أولئك هم خير البريئة } .و { عند ربهم } ظرف وقع اعتراضاً بين { جزاؤهم } وبين { جنات عدن } للتنويه بعِظَم الجزاء بأنه مدَّخر لهم عند ربهم تكرمةً لهم لما في { عند } من الإِيماء إلى الحظوة والعناية ، وما في لفظ ربهم من الإِيماء إلى إجزال الجزاء بما يناسب عظم المضاف إليه { عندَ } ، وما يناسب شأن من يَرُب أن يبلغ بمربوبه عظيم الإحسان .وإضافة : { جنات } إلى { عدن } لإِفادة أنها مسكنهم لأن العَدْن الإِقامة ، أي ليس جزاؤهم تنزهاً في الجنات بل أقوى من ذلك بالإِقامة فيها .وقوله : { خالدين فيها أبداً } بشارة بأنها مسكنهم الخالد .ووصف الجنات ب { تجري من تحتها الأنهار } لبيان منتهى حسنها .وجَرْيُ النهر مستعار لانتقال السيْل تشبيهاً لسرعة انتقال الماء بسرعة المشي .والنهر : أخدود عظيم في الأرض يسيل فيه الماء فلا يطلق إلا على مجموع الأخدود ومائه . وإسناد الجري إلى الأنهار توسع في الكلام لأن الذي يجري هو ماؤها وهو المعتبر في ماهية النهر .وجعل جزاء الجماعة جمعَ الجنات فيجوز أن يكون على وجه التوزيع ، أي لكل واحد جنة كقوله تعالى : { يجعلون أصابعهم في آذانهم } [ البقرة : 19 ] وقولك : ركب القوم دوابَّهم ، ويجوز أن يكون لكل أحد جنات متعددة والفضل لا ينحصر قال تعالى : { ولمن خاف مقام ربه جنتان } [ الرحمن : 46 ] .وجملة : { رضي الله عنهم } حال من ضمير { خالدين } ، أي خالدين خلوداً مقارناً لرضى الله عنهم ، فهم في مدة خلودهم فيها محفوفون بآثار رضى الله عنهم ، وذلك أعظم مراتب الكرامة قال تعالى :{ ورضوان من اللَّه أكبر } [ التوبة : 72 ] ورِضَى الله تعلق إحسانه وإكرامه لعبده .وأما الرضى في قوله : { ورضوا عنه } فهو كناية عن كونهم نالهم من إحسان الله ما لا مطلب لهم فوقه كقول أبي بكر في حديث الغار : «فشَرب حتى رضيتَ» ، وقول مخرمة حين أعطاه رسول الله صلى الله عليه وسلم قَباءً : «رَضِيَ مخرمة» . وزاده حُسْن وقع هنا ما فيه من المشاكلة .{ عَنْهُ ذَلِكَ لِمَنْ خَشِىَ } .تذييل آت على ما تقدم من الوعد للذين آمنوا والوعيد للذين كفروا بُيّن به سبب العطاء وسبب الحرمان وهو خشية الله تعالى بمنطوق الصلة ومفهومها .والإِشارة إلى الجزاء المذكور في قوله : { جزاؤهم عند ربهم } يعني أن السبب الذي أنالهم ذلك الجزاء هو خشيتهم الله فإنهم لما خشوا الله توقعوا غضبه إذا لم يصغوا إلى من يقول لهم : إني رسول الله إليكم ، فأقبلوا على النظر في دلائل صدق الرسول فاهتدوا وآمنوا ، وأما الذين آثروا حظوظ الدنيا فأعرضوا عن دعوة رسول من عند الله ولم يتوقعوا غضب مرسله فبقوا في ضلالهم .فما صدْقُ : «من خشي ربه» هم المؤمنون ، واللام للملك ، أي ذلك الجزاء للمؤمنين الذين خشوا ربهم فإذا كان ذلك ملكاً لهم لم يكن شيء منه ملكاً لغيرهم فأفاد حرمان الكفرة المتقدم ذكرهم وتم التذييل .وفي ذكر الرب هنا دون أن يقال : ذلك لمن خشي الله ، تعريض بأن الكفار لم يرعوا حق الربوبية إذ لم يخشوا ربهم فهم عبيد سوء .\n","ar.waseet":"( جَزَآؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِى مِنْ تَحْتِهَا الأنهار خَالِدِينَ فِيهَآ أَبَداً ) أى : خالدين فى تلك الجنات خلودا أبديا .( رِّضِىَ الله عَنْهُمْ وَرَضُواْ عَنْهُ ) أى : قبل الله - تعالى - منهم أعمالهم ورضيها عنده ، وفرحوا هم ورضوا بما أعطاهم من خير عميم .فالمراد برضاء - تعالى - عنهم : قبوله لأعمالهم ، وبرضاهم عنه : فرحهم بما أعطاهم من فضله . ( ذلك ) أى : العطاء الجزيل ( لِمَنْ خَشِيَ رَبَّهُ ) أى : كائن وثابت لمن خاف مقام ربه ونهى النفس عن الهوى .نسأل الله - تعالى - أن يجعلنا جميعا من أصحاب الميمنة .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"( جزاؤهم عند ربهم جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك لمن خشي ربه ) وتناهى عن المعاصي .وقيل : الرضا ينقسم إلى قسمين : رضا به ورضا عنه ، فالرضا به : ربا ومدبرا ، والرضا عنه : فيما يقضي ويقدر .قال السدي رحمه الله : إذا كنت لا ترضى عن الله فكيف تسأله الرضا عنك ؟أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي أخبرنا محمد بن يوسف حدثنا محمد بن إسماعيل ، حدثنا محمد بن بشار حدثنا غندر حدثنا شعبة قال : سمعت قتادة عن أنس بن مالك قال النبي - صلى الله عليه وسلم - لأبي : \" إن الله تعالى أمرني أن أقرأ عليك : \" لم يكن الذين كفروا \" قال : وسماني ؟ قال : \" نعم \" فبكى .وقال همام عن قتادة : \" أمرني أن أقرأ عليك القرآن \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6138.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6138.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6138.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":102,"letters":782,"size":"80KB","priority":3,"commonlyRead":false}}