{"chapter":103,"name":{"arabic":"سورة 103","transliteration":"Chapter 103","translation":"Chapter 103","revelation":"unknown"},"revelation":"unknown","verses":3,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ وَالْعَصْرِ","transliteration":"Wal' asr","translations":{"en.ahmedali":"TIME AND AGE are witness","en.ahmedraza":"By oath of this era of yours (O dear Prophet Mohammed – peace and blessings be upon him).","en.arberry":"By the afternoon!","en.asad":"CONSIDER the flight of time!","en.daryabadi":"By the time,","en.hilali":"By Al-'Asr (the time).","en.pickthall":"By the declining day,","en.qaribullah":"By the time of the afternoon!","en.sahih":"By time,","en.sarwar":"By the time (of the advent of Islam),","en.yusufali":"By (the Token of) Time (through the ages),","en.maududi":"By the time!","en.shakir":"I swear by the time,","en.itani":"By time.","en.mubarakpuri":"By Al-`Asr.","en.qarai":"By Time!","en.wahiduddin":"I swear by the passage of time,"},"tafsir":{"ar.muyassar":"أقسم الله بالدهر على أن بني آدم لفي هلكة ونقصان. ولا يجوز للعبد أن يقسم إلا بالله، فإن القسم بغير الله شرك.","ar.jalalayn":"«والعصر» الدهر أو ما بعد الزوال إلى الغروب أو صلاة العصر.","ar.qurtubi":"تفسير سورة والعصروهي مكية . وقال قتادة مدنيةوروي عن ابن عباس . وهي ثلاث آياتبسم الله الرحمن الرحيموالعصرفيه مسألتان :الأولى : قوله تعالى : والعصر أي الدهر ; قاله ابن عباس وغيره . فالعصر مثل الدهر ; ومنه قول الشاعر :سبيل الهوى وعر وبحر الهوى غمر ويوم الهوى شهر وشهر الهوى دهرأي عصر .أقسم الله به - عز وجل - ; لما فيه من التنبيه بتصرف الأحوال وتبدلها ، وما فيها من الدلالة على الصانع . وقيل : العصر : الليل والنهار . قال حميد بن ثور :ولن يلبث العصران : يوم وليلة     إذا طلبا أن يدركا ما تيمماوالعصران أيضا : الغداة والعشي . قال :وأمطله العصرين حتى يملني     ويرضى بنصف الدين والأنف راغميقول : إذا جاءني أول النهار وعدته آخره . وقيل : إنه العشي ، وهو ما بين زوال الشمس وغروبها ; قاله الحسن وقتادة . ومنه قول الشاعر :تروح بنا يا عمرو قد قصر العصر     وفي الروحة الأولى الغنيمة والأجر[ ص: 161 ] وعن قتادة أيضا : هو آخر ساعة من ساعات النهار . وقيل : هو قسم بصلاة العصر ، وهي الوسطى ; لأنها أفضل الصلوات ; قاله مقاتل . يقال : أذن للعصر ، أي لصلاة العصر . وصليت العصر ; أي صلاة العصر . وفي الخبر الصحيح الصلاة الوسطى صلاة العصر . وقد مضى في سورة ( البقرة ) بيانه . وقيل : هو قسم بعصر النبي - صلى الله عليه وسلم - ; لفضله بتجديد النبوة فيه . وقيل : معناه ورب العصر .الثانية : قال مالك : من حلف ألا يكلم رجلا عصرا : لم يكلمه سنة . قال ابن العربي : إنما حمل مالك يمين الحالف ألا يكلم امرأ عصرا على السنة ; لأنه أكثر ما قيل فيه ، وذلك على أصله في تغليظ المعنى في الأيمان . وقال الشافعي : يبر بساعة ; إلا أن تكون له نية ، وبه أقول ; إلا أن يكون الحالف عربيا ، فيقال له : ما أردت ؟ فإذا فسره بما يحتمله قبل منه ، إلا أن يكون الأقل ، ويجيء على مذهب مالك أن يحمل على ما يفسر . والله أعلم .\n","ar.miqbas":"وَالْعَصْرِ (1) أقسم الله تعالى بالعصر قسماً يراد به تأكيد الخبر كما هو شأن أقسام القرآن .والمقسَم به من مظاهر بديع التكوين الرباني الدال على عظيم قدرته وسعة علمه .وللعصر معاننٍ يتعين أن يَكون المراد منها لا يعدو أن يكون حالة دالة على صفة من صفات الأفعال الربانية ، يتعين إما بإضافته إلى ما يُقدر ، أو بالقرينة ، أو بالعهد ، وأيَّاً ما كان المرادُ منه هنا فإن القسم به باعتبار أنه زمن يذكِّر بعظيم قدرة الله تعالى في خلق العالم وأحواله ، وبأمور عظيمة مباركة مثل الصلاة المخصوصة أو عصرٍ معين مبارك .وأشهر إطلاق لفظ العصر أنه علَم بالغلبة لوقتتٍ ما بين آخر وقت الظهر وبين اصفرار الشمس فمبدؤه إذا صار ظل الجسم مثلَه بعد القَدْر الذي كان عليه عند زوال الشمس ويمتد إلى أن يصير ظلُّ الجسم مثلَيْ قدرِه بعد الظل الذي كان له عند زوال الشمس . وذلك وقت اصفرار الشمس ، والعصر مبدأ العشيّ . ويعقبه الأصيل والاحمرار وهو ما قبل غروب الشمس ، قال الحارث بن حِلزة :آنستْ نبأة وأفزَعها القَنَّ ... اصُ عَصراً وقَدْ دَنَا الإِمساءفذلك وقت يؤذن بقرب انتهاء النهار ، ويذكر بخلقة الشمس والأرض ، ونظام حركة الأرض حول الشمس ، وهي الحركة التي يتكون منها الليل والنهار كل يوم وهو من هذا الوجه كالقسم بالضحى وبالليل والنهار وبالفجر من الأحوال الجوية المتغيرة بتغير توجه شعاع الشمس نحو الكرة الأرضية .وفي ذلك الوقت يتهيأ الناس للانقطاع عن أعمالهم في النهار كالقيام على حقولهم وجنَّاتهم ، وتجاراتهم في أسواقهم ، فيذكر بحكمة نظام المجتمع الإِنساني وما ألهم الله في غريزته من دأب على العمل ونظاممٍ لابتدائه وانقطاعه . وفيه يتحفز الناس للإِقبال على بيوتهم لمبيتهم والتأنس بأهليهم وأولادهم . وهو من النعمة أو من النعيم ، وفيه إيماء إلى التذكير بمَثَل الحياة حين تدنو آجال الناس بعد مضي أطوار الشباب والاكتهال والهَرم .وتعريفه باللام على هذه الوجوه تعريف العهد الذهني أي كل عَصْر .ويطلق العصر على الصلاة الموقتة بوقت العَصر . وهي صلاة معظمة . قيل : هي المراد بالوسطى في قوله تعالى : { حافظوا على الصلوات والصلاة الوسطى } [ البقرة : 238 ] . وجاء في الحديث : « من فاتته صلاة العصر فكأنما وُتِرَ أهلَه ومالَه » . وورد في الحديث الصحيح : « ثلاثة لا يكلمهم الله يوم القيامة » فذَكَر « ورجل حلف يميناً فاجرة بعد العصر على سلعة لقد أعطي بها ما لم يُعْطَ » وتعريفه على هذا تعريف العهد وصار علَماً بالغلبة كما هو شأن كثير من أسماء الأجناس المعرفة باللام مثل العَقَبَة .ويطلق العصر على مدة معلومة لوجود جِيل من الناس ، أو مَلِك أو نبيء ، أو دين ، ويعيَّن بالإِضافة ، فيقال : عصر الفِطَحْل ، وعصر إبراهيم ، وعصر الإِسكندر ، وعصر الجاهلية ، فيجوز أن يكون مراد هذا الإِطلاق هنا ويكون المعنيّ به عصرَ النبي صلى الله عليه وسلم والتعريف فيه تعريف العهد الحضوري مثل التعريف في ( اليوم ) من قوْلك : فعلت اليوم كذا ، فالقسم به كالقسم بحياته في قوله تعالى :{ لعمرك } [ الحجر : 72 ] . قال الفخر : فهو تعالى أقسم بزمانه في هذه الآية وبمكانه في قوله تعالى : { وأنت حل بهذا البلد } [ البلد : 2 ] وبعمره في قوله : { لعمرك } . اه .ويجوز أن يراد عصر الإِسلام كلِه وهو خاتمة عصور الأديان لهذا العالم وقد مثَّل النبي صلى الله عليه وسلم عصر الأمة الإِسلامية بالنسبة إلى عصر اليهود وعصر النصارى بما بعد صلاة العصر إلى غروب الشمس بقوله : « مثل المسلمين واليهود والنصارى كمثل رجل استأجر أجراء يعملون له يوماً إلى الليل فعملت اليهود إلى نصف النهار ثم قالوا : لا حاجة لنا إلى أجرك وما عملنا باطل ، واستأجر آخرين بعدهم فقال : أكملوا بقية يومكم ولكم الذي شرطت لهم فعملوا حتى إذا كان حين صلاة العصر قالوا : لك ما عملنا باطل ولك الأجر الذي جعلتَ لنا ، واستأجر قوماً أن يعملوا بقيةَ يومهم فعملوا حتى غابت الشمس واستكملوا أجر الفريقين كليهما فأنتم هُم » . فلعل ذلك التمثيل النبوي له اتصال بالرمز إلى عصر الإِسلام في هذه الآية .ويجوز أن يفسر العصر في هذه الآية بالزمان كله ، قال ابن عطية : قال أبي بن كعب : سألت رسول الله صلى الله عليه وسلم عن العصر فقال : أقسم ربكم بآخر النهار . وهذه المعاني لا يفي باحتمالها غير لفظ العصر .ومناسبة القَسَم بالعَصر لغرض السورة على إرادة عصر الإِسلام ظاهرة فإنها بينت حال الناس في عصر الإِسلام بين مَن كفر به ومن آمن واستوفى حظه من الأعمال التي جاء بها الإِسلام ، ويعرف منه حالُ من أسلموا وكان في أعمالهم تقصير متفاوت ، أما أحوال الأمم التي كانت قبل الإِسلام فكانت مختلفة بحسب مجيء الرسل إلى بعض الأمم ، وبقاء بعض الأمم بدون شرائع متمسكة بغير دين الإِسلام من الشرك أو بدين جاء الإِسلام لنسخه مثل اليهودية والنصرانية قال تعالى : { من يبتغ غير الإسلام ديناً فلن يقبل منه وهو في الآخرة من الخاسرين } في سورة آل عمران ( 85 ) .وتعريف الإنسان } تعريف الجنس مراد به الاستغراق وهو استغراق عرفي لأنه يستغرق أفراد النوع الإِنساني الموجودين في زمن نزول الآية وهو زمن ظهور الإِسلام كما علمت قريباً . ومخصوص بالناس الذين بلغتهم الدعوة في بلاد العالم على تفاوتها . ولما استُثني منه الذين آمنوا وعملوا الصالحات بقي حكمه متحققاً في غير المؤمنين كما سيأتي . . .والخُسر : مصدر وهو ضد الربح في التجارة ، استعير هنا لسوء العاقبة لمن يظن لنفسه عاقبةً حسنة ، وتلك هي العاقبة الدائمة وهي عاقبة الإِنسان في آخرته من نعيم أو عذاب .وقد تقدم في قوله تعالى { فما ربحت تجارتهم } في سورة البقرة ( 16 ) وتكررت نظائره من القرآن آنفاً وبَعيداً .\n","ar.waseet":"للعلماء أقوال متعددة فى المقصود بالعصر هنا فمنهم من يرى أن المقصود به : الدهر كله ، لما فيه من العبر التى تدل دلالة واضحة على عظيم قدرة الله - تعالى - ، ولما فيه من الأحداث التى يراها الناس بأعينهم ، ويعرفونها عن غيرهم . .فهم يرون ويسمعون كم من غنى قد صار فقيرا ، وقوى قد صار ضعيفا ، ومسرور قد أصبح حزينا . . ورحم الله القائل :أشاب الصغير وأفنى الكبير ... كر الغداة ومر العشىقال القرطبى : قوله - تعالى - : ( والعصر ) أى : الدهر ، قال ابن عباس وغيره فالعصر مثل الدهر . . وأقسم به - سبحانه - لما فيه من التنبيه بتصرف الأحوال وتبدلها .ومنهم من يرى أن المقصود به : وقت صلاة العصر ، وقد صدر صاحب الكشاف تفسيره لهذه الآية بهذا الرأى فقال : أقسم - سبحانه - بصلاة العصر لفضلها ، بدليل قوله - تعالى - : ( حَافِظُواْ عَلَى الصلوات والصلاة الوسطى ) - وهى صلاة العصر - ، وقوله صلى الله عليه وسلم : \" من فاتته صلاة العصر فكأنما وَتِرَ أهله وماله \" ولأن التكليف فى أدائها أشق لتهافت الناس فى تجاراتهم ومكاسبهم آخر النهار . .ومنهم من يرى أن المراد بالعصر هنا : عصر النبوة . لأفضليته بالنسبة لما سبقه من عصور .وقد رجح الإِمام ابن جرير القول الأول فقال : والصواب من القول فى ذلك أن يقال : إن ربنا أقسم بالعصر ، والعصر اسم الدهر ، وهو العشى ، والليل والنهار . .\n","ar.baghawi":"مكية( والعصر ) قال ابن عباس : والدهر . قيل : أقسم به لأن فيه عبرة للناظر . وقيل : معناه ورب العصر ، وكذلك في أمثاله . وقال ابن كيسان : أراد بالعصر الليل والنهار ، يقال لهما العصران . وقال الحسن : من بعد زوال الشمس إلى غروبها . وقال قتادة : آخر ساعة من ساعات النهار . وقال مقاتل : أقسم بصلاة العصر وهي الصلاة الوسطى .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6177.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6177.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6177.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"إِنَّ الْإِنْسَانَ لَفِي خُسْرٍ","transliteration":"Innal insaana lafee khusr","translations":{"en.ahmedali":"Man is certainly loss,","en.ahmedraza":"Indeed man is surely in a loss.","en.arberry":"Surely Man is in the way of loss,","en.asad":"Verily, man is bound to lose himself","en.daryabadi":"Verily man is in loss,","en.hilali":"Verily! Man is in loss,","en.pickthall":"Lo! man is a state of loss,","en.qaribullah":"Surely, the human is in a (state of) loss,","en.sahih":"Indeed, mankind is in loss,","en.sarwar":"the human being is doomed to suffer loss,","en.yusufali":"Verily Man is in loss,","en.maududi":"Lo! Man is in a state of loss;","en.shakir":"Most surely man is in loss,","en.itani":"The human being is in loss.","en.mubarakpuri":"Verily, man is in loss.","en.qarai":"Man is indeed in loss,","en.wahiduddin":"that man is surely in a state of loss,"},"tafsir":{"ar.muyassar":"أقسم الله بالدهر على أن بني آدم لفي هلكة ونقصان. ولا يجوز للعبد أن يقسم إلا بالله، فإن القسم بغير الله شرك.","ar.jalalayn":"«إنَّ الإنسان» الجنس «لفي خُسر» في تجارته.","ar.qurtubi":"قوله تعالى : إن الإنسان لفي خسرهذا جواب القسم . والمراد به الكافر ; قاله ابن عباس في رواية أبي صالح . وروى الضحاك عنه قال : يريد جماعة من المشركين : الوليد بن المغيرة ، والعاص بن وائل ، والأسود بن عبد المطلب بن أسد بن عبد العزى ، والأسود بن عبد يغوث . وقيل : يعني بالإنسان جنس الناس . لفي خسر لفي غبن . وقال الأخفش : هلكة . الفراء : عقوبة ; ومنه قوله تعالى : وكان عاقبة أمرها خسرا . ابن زيد : لفي شر . وقيل : لفي نقص ; المعنى متقارب . وروي عن سلام والعصر بكسر الصاد . وقرأ الأعرج وطلحة وعيسى الثقفي خسر بضم السين . وروى ذلك هارون عن أبي بكر عن عاصم . والوجه فيهما الإتباع . ويقال : خسر وخسر ; مثل عسر وعسر . وكان علي يقرؤها ( والعصر ونوائب الدهر إن الإنسان لفي خسر وإنه فيه إلى آخر الدهر ) . وقال إبراهيم : إن الإنسان إذا عمر في الدنيا وهرم ، لفي نقص وضعف وتراجع ; إلا المؤمنين ، فإنهم تكتب لهم أجورهم التي كانوا يعملونها في حال شبابهم ; نظيره قوله تعالى : لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين . قال : وقراءتنا ( والعصر إن الإنسان لفي خسر وإنه في آخر الدهر ) . والصحيح ما [ ص: 162 ] عليه الأمة والمصاحف . وقد مضى الرد في مقدمة الكتاب على من خالف مصحف عثمان ، وأن ذلك ليس بقرآن يتلى ; فتأمله هناك .\n","ar.miqbas":"إِنَّ الْإِنْسَانَ لَفِي خُسْرٍ (2) والظرفية في قوله : لفي خسر } مجازية شبهت ملازمة الخسر بإحاطة الظرف بالمظروف فكانت أبلغ من أن يقال : إن الإنسان لخاسر .ومجيء هذا الخبر على العموم مع تأكيده بالقَسم وحرففِ التوكيد في جوابه ، يفيد التهويل والإِنذار بالحالة المحيطة بمعظم الناس .\n","ar.waseet":"وقوله - سبحانه - : ( إِنَّ الإنسان لَفِى خُسْرٍ . . . ) جواب القسم ، والمراد بالإِنسان : جنسه ويدخل فيه الكافر دخولا أوليا . والخسر مثل الخسران ، كالكفر بمعنى الكفران . .أى : إن جنس الإِنسان لا يخلو من خسران ونقصان وفقدان للربح فى مساعيه وأعماله طوال عمره ، وإن هذا الخسران يتفاوت قوة وضعفا .فأخسر الأخسرين هو الكافر الذى أشرك مع خالقه إلها آخر فى العبادة ، وأقل الناس خسارة هو المؤمن الذى خلط عملا صالحا بآخر سيئا ثم تاب إلى الله - تعالى - توبة صادقة .وجاء الكلام بأسلوب القسم ، لتأكيد المقسم عليه ، وهو أن جنس الإِنسان فى خسر .وقال - سبحانه - ( لَفِى خُسْرٍ ) للإِشعار بأن الإِنسان كأنه مغمور بالخسر ، وأن هذا الخسران قد أحاط به من كل جانب ، وتنكير لفظ \" خسر \" للتهويل . أى : لفى خسر عظيم .\n","ar.baghawi":"( إن الإنسان لفي خسر ) أي خسران ونقصان ، قيل : أراد به [ الكافر ] بدليل أنه استثنى المؤمنين ، و \" الخسران \" : ذهاب رأس مال الإنسان في هلاك نفسه وعمره [ بالمعاصي ] ، وهما أكبر رأس ماله .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6178.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6178.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6178.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ","transliteration":"Il lal lazeena aamanu wa 'amilus saali haati wa tawa saw bil haqqi wa tawa saw bis sabr","translations":{"en.ahmedali":"Except those who believe, and do good and enjoin truth on one another, and enjoin one another to bear with fortitude (the trials that befall).","en.ahmedraza":"Except those who accepted faith, and did good deeds and urged one another to the truth – and urged one another to have patience.","en.arberry":"save those who believe, and do righteous deeds, and counsel each other unto the truth, and counsel each other to be steadfast.","en.asad":"unless he be of those who attain to faith, and do good works, and enjoin upon one another the keeping to truth, and enjoin upon one another patience in adversity.","en.daryabadi":"But not those who themselves believe and work righteous works, and enjoin upon each other the truth, and enjoin upon each other endurance.","en.hilali":"Except those who believe (in Islamic Monotheism) and do righteous good deeds, and recommend one another to the truth (i.e. order one another to perform all kinds of good deeds (Al-Ma'ruf) which Allah has ordained, and abstain from all kinds of sins and evil deeds (Al-Munkar) which Allah has forbidden), and recommend one another to patience (for the sufferings, harms, and injuries which one may encounter in Allah's Cause during preaching His religion of Islamic Monotheism or Jihad, etc.).","en.pickthall":"Save those who believe and do good works, and exhort one another to truth and exhort one another to endurance.","en.qaribullah":"except those who believe and do good works and charge one another with the truth and charge one another with patience.","en.sahih":"Except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.","en.sarwar":"except the righteously striving believers who exhort each other to truthful purposes and to patience.","en.yusufali":"Except such as have Faith, and do righteous deeds, and (join together) in the mutual teaching of Truth, and of Patience and Constancy.","en.maududi":"save those who have faith and do righteous deeds, and counsel each other to hold on to truth and counsel each other to be steadfast.","en.shakir":"Except those who believe and do good, and enjoin on each other truth, and enjoin on each other patience.","en.itani":"Except those who believe, and do good works, and encourage truth, and recommend patience.","en.mubarakpuri":"Except those who believe and do righteous deeds, and recommend one another to the truth, and recommend one another to patience.","en.qarai":"except those who have faith and do righteous deeds, and enjoin one another to [follow] the truth, and enjoin one another to patience.","en.wahiduddin":"except for those who believe and do good deeds and exhort one another to hold fast to the Truth, and who exhort one another to stead-fastness."},"tafsir":{"ar.muyassar":"إلا الذين آمنوا بالله وعملوا عملا صالحًا، وأوصى بعضهم بعضًا بالاستمساك بالحق، والعمل بطاعة الله، والصبر على ذلك.","ar.jalalayn":"«إلا الذين آمنوا وعملوا الصالحات» فليسوا في خسران «وتواصوا» أوصى بعضهم بعضاً «بالحق» الإيمان «وتواصوا بالصبر» على الطاعة وعن المعصية.","ar.qurtubi":"قوله تعالى : إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبرقوله تعالى : إلا الذين آمنوا استئناء من الإنسان ; إذ هو بمعنى الناس على الصحيح .قوله تعالى : وعملوا الصالحات أي أدوا الفرائض المفترضة عليهم ; وهم أصحاب رسول الله - صلى الله عليه وسلم - . قال أبي بن كعب : قرأت على رسول الله - صلى الله عليه وسلم - والعصر ثم قلت ما تفسيرها يا نبي الله ؟ قال : والعصر قسم من الله ، أقسم ربكم بآخر النهار : إن الإنسان لفي خسر : أبو جهل إلا الذين آمنوا : أبو بكر ، وعملوا الصالحات عمر . وتواصوا بالحق عثمان وتواصوا بالصبر علي . - رضي الله عنهم - أجمعين . وهكذا خطب ابن عباس على المنبر موقوفا عليه .وعنى وتواصوا أي تحابوا ; أوصى بعضهم بعضا وحث بعضهم بعضا .بالحق أي بالتوحيد ; كذا روى الضحاك عن ابن عباس . قال قتادة : بالحق أي القرآن . وقال السدي : الحق هنا هو الله - عز وجل - .وتواصوا بالصبر على طاعة الله - عز وجل - ، والصبر عن معاصيه وقد تقدم . والله أعلم .\n","ar.miqbas":"إِلَّا الَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ (3)وأعقب بالاستثناء بقوله : { إلا الذين آمنوا } الآية فيتقرر الحكم تاماً في نفس السامع مبيناً أن الناس فريقان : فريق يلحقه الخسران ، وفريق لا يلحقه شيء منه ، فالذين آمنوا وعملوا الصالحات لا يلحقهم الخسران بحال إذا لم يتركوا شيئاً من الصالحات بارتكاب أضدادها وهي السيئات .ومن أكبر الأعمال الصالحات التوبة من الذنوب لمقترفيها ، فمن تحقق فيه وصف الإِيمان ولم يعمل السيئات أو عملها وتاب منها فقد تحقق له ضد الخسران وهو الربح المجازي ، أي حسن عاقبة أمره ، وأما من لم يعمل الصالحات ولم يتب من سيئاته فقد تحقق فيه حكم المستثنى منه وهو الخسران .وهذا الخسر متفاوت فأعظمه وخالده الخسر المنجر عن انتفاء الإِيمان بوحدانية الله وصدق الرسول صلى الله عليه وسلم ودون ذلك تكونُ مراتب الخسر متفاوتة بحسب كثرة الأعمال السيئة ظاهرها وباطنها . وما حدده الإِسلام لذلك من مراتب الأعمال وغفران بعض اللمم إذا ترك صاحبه الكبائر والفواحشَ وهو ما فسر به قوله تعالى : { إن الحسنات يذهبن السيئات } [ هود : 114 ] .وهذا الخبر مراد به الحصول في المستقبل بقرينة مقام الإِنذار والوعيد ، أي لفي خسر في الحياة الأبدية الآخرة فلا التفات إلى أحوال الناس في الحياة الدنيا ، قال تعالى : { لا يغرنك تقلب الذين كفروا في البلاد متاع قليل ثم مأواهم جهنم وبئس المهاد } [ آل عمران : 196 ، 197 ] .وتنكير { خسر } يجوز أن يكون للتنويع ، ويجوز أن يكون مفيداً للتعظيم والتعميم في مقام التهويل وفي سياق القسَم .والمعنى : إن الناس لفي خسران عظيم وهم المشركون .والتعريف في قوله : { الصالحات } تعريف الجنس مراد به الاستغراق ، أي عملوا جميع الأعمال الصالحة التي أمروا بعملها بأمر الدين وعَمل الصالحات يشمل ترك السيئات . وقد أفاد استثناء المتصفين بمضمون الصلة ومعطوفها إيماء إلى علة حكم الاستثناء وهو نقيض الحكم الثابت للمستثنى منه فإنهم ليسوا في خسر لأجل أنهم آمنوا وعملوا الصالحات .فأما الإِيمان فهو حقيقة مقُول على جزئياتها بالتواطىء . وأما الصالحات فعمومها مقول عليه بالتشكك ، فيشير إلى أن انتفاء الخسران عنهم يتقدر بمقدار ما عملوه من الصالحات وفي ذلك مراتب كثيرة .وقد دل استثناء الذين آمنوا وعملوا الصالحات من أن يكونوا في خُسر على أن سبب كون بقية الإِنسان في خسر هو عدم الإِيمان والعمل الصالح بدلالة مفهوم الصفة . وعُلم من الموصول أن الإِيمان والعمل الصالح هما سبب انتفاء إحاطة الخسر بالإِنسان .وعُطف على عَمل الصالحات التواصي بالحق والتواصي بالصبر وإن كان ذلك من عمل الصالحات ، عَطْف الخاص على العام للاهتمام به لأنه قد يُغفل عنه ، يُظن أن العمل الصالح هو ما أثرُه عمل المرء في خاصته ، فوقع التنبيه على أن من العمل المأمور به إرشادَ المسلم غيره ودعوتَه إلى الحق ، فالتواصي بالحق يشمل تعليم حقائق الهدى وعقائد الصواب وإراضة النفس على فهمها بفعل المعروف وترك المنكر .والتواصي بالصبر عطف على التواصي بالحق عطف الخاص على العام أيضاً وإن كان خصوصه خصوصاً من وجهٍ لأن الصبر تحمَّل مشقة إقامة الحق وما يعترض المسلم من أذى في نفسه في إقامة بعض الحق .وحقيقة الصبر أنه : منع المرء نفسه من تحصيل ما يشتهيه أو من محاولة تحصيله ( إن كان صعبَ الحصول فيترك محاولة تحصيله لخوْف ضر ينْشأ عن تناوله كخوف غضب الله أو عقاب ولاة الأمور ) أو لرغبة في حصول نفع منه ( كالصبر على مشقة الجهاد والحج رغبة في الثواب والصبر على الأعمال الشاقة رغبة في تحصيل مال أو سمعة أو نحو ذلك ) .ومن الصبر الصبر على ما يلاقيه المسلم إذا أمَرَ بالمعروف من امتعاض بعض المأمورين به أو مِن أذاهم بالقول كمن يقول لآمره : هَلاّ نظرت في أمر نفسك ، أو نحو ذلك .وأما تحمل مشقة فعل المنكرات كالصبر على تجشّم السهر في اللهو والمعاصي ، والصبر على بشاعة طعم الخمر لشاربها ، فليس من الصبر لأن ذلك التحمل منبعث عن رجحان اشتهاء تلك المشقة على كراهية المشقة التي تعترضه في تركها .وقل اشتمل قوله تعالى : { وتواصوا بالحق وتواصوا بالصبر } على إقامة المصالح الدينية كلها ، فالعقائد الإِسلامية والأخلاق الدينية مندرجة في الحق ، والأعمال الصالحة وتجنب السيئات مندرجة في الصبر .والتخلق بالصبر ملاك فضائل الأخلاق كلها فإن الارتياض بالأخلاق الحميدة لا يخلو من حمل المرء نفسه على مخالفة شهوات كثيرة ، ففي مخالفتها تعب يقتضي الصبرَ عليه حتى تصير مكارم الأخلاق ملكه لمن راض نفسه عليها ، كما قال عمرو بن العاص: ... إذا المرءُ لم يَترُكْ طعاماً يُحبُّهولم يَنْهَ قلباً غاوياً حيثُ يمَّما ... فيوشِك أن تُلفَى له الدَّهرَ سُبّةٌإذا ذُكِرَتْ أمثالُها تَمْلأ الفَمَا ... وكذلك الأعمال الصالحة كلها لا تخلو من إكراه النفس على ترك ما تميل إليه . وفي الحديث : \" حُفَّت الجنة بالمكارِهِ وحُفّت النار بالشهوات \" . وعن علي بن أبي طالب : «الصبر مطية لا تكبو» .وقد مضى الكلام على الصبر مشبعاً عند قوله تعالى : { استعينوا بالصبر والصلاة } في سورة البقرة ( 45 ) .وأفادت صيغة التواصي بالحق وبالصبر أن يكون شأن حياة المؤمنين قائماً على شيوع التآمر بهما ديدناً لهم ، وذلك يقتضي اتصاف المؤمنين بإقامة الحق وصبرهم على المكاره في مصالح الإِسلام وأمته لما يقتضيه عرف الناس من أن أحداً لا يوصي غيره بملازمة أمر إلا وهو يرى ذلك الأمر خليقاً بالملازمة إذ قلّ أن يُقدم أحد على أمر بحق هو لا يفعله أو أمر بصبر وهو ذو جزع ، وقد قال الله تعالى توبيخاً لبني إسرائيل : { أتأمرون الناس بالبر وتنسون أنفسكم وأنتم تتلون الكتاب أفلا تعقلون } [ البقرة : 44 ] ، وقد تقدم هذا المعنى عند قوله تعالى : { ولا تحاضون على طعام المسكين } في سورة الفجر ( 18 ) .\n","ar.waseet":"وقوله - سبحانه - : ( إِلاَّ الذين آمَنُواْ وَعَمِلُواْ الصالحات . . . ) استثناء مما قبله ، والمقصود بهذه الآية الكريمة تسلية المؤمنين الصادقين . . وتبشيرهم بأنهم ليسوا من هذا الفريق الخاسر .وقوله - تعالى - : ( وَتَوَاصَوْاْ ) فعل ماض ، من الوصية وهى تقديم النصح للغير مقرونا بالوعظ .و \" الحق \" : هو الأمر الذى ثبتت صحته ثبوتا قاطعا . .و \" الصبر \" : قوة فى النفس تعينها على احتمال المكاره والمشاق ..أى : أن جميع الناس فى خسران ونقصان . . إلا الذين آمنوا بالله - تعالى - إيمانا حقا ، وعملوا الأعمال الصالحات ، من صلاة وزكاة وصيام وحج . . وغير ذلك من وجوه الخير ، وأوصى بعضهم بعضا بالتمسك بالحق ، الذى على رأسه الثبات على الإِيمان وعلى العمل الصالح . . وأوصى بعضهم بعضا كذلك بالصبر على طاعة الله - تعالى - ، وعلى البلايا والمصائب والآلام . . التى لا تخلو عنها الحياة .فهؤلاء المؤمنون الصادقون ، الذين أوصى بعضهم بعضا بهذه الفضائل ليسوا من بين الناس الذين هم فى خسران ونقصان ، لأن إيمانهم الصادق وعملهم الصالح . . قد حماهم من الخسران . .قال بعض العلماء : وقد اشتملت هذه السورة الكريمة على الوعيد الشديد ، وذلك لأنه - تعالى - حكم بالخسارة على جميع الناس ، إلا من كان متصفا بهذه الأشياء الأربعة ، وهى : الإِيمان ، والعمل الصالح ، والتواصى بالحق ، والتواصى بالصبر ، فدل ذلك على أن النجاة معلقة بمجموع هذه الأمور ، وأنه كما يجب على الإِنسان أن يأتى من الأعمال ما فيه الخير والنفع ، يجب عليه - أيضا - أن يدعو غيره إلى الدين ، وينصحه بعمل الخير والبر ، ويأمر بالمعروف وينهى عن المنكر ، ويحب لأخيه ما يحب لنفسه ، وأن يثبت على ذلك ، فلا يحيد عنه ، ولا يزحزحه عن الدعوة إليه ما يلاقيه من مشاق .نسأل الله - تعالى - أن يجعلنا من أصحاب هذه الصفات .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"( إلا الذين آمنوا وعملوا الصالحات ) فإنهم ليسوا في خسر ، ( وتواصوا ) أوصى بعضهم بعضا ، ( بالحق ) بالقرآن ، قاله الحسن وقتادة ، وقال مقاتل : بالإيمان والتوحيد . ( وتواصوا بالصبر ) على أداء الفرائض وإقامة أمر الله . وروى ابن عون عن إبراهيم قال : أراد أن الإنسان إذا عمر في الدنيا وهرم ، لفي نقص وتراجع إلا المؤمنين ، فإنهم يكتب لهم أجورهم ومحاسن أعمالهم التي كانوا يعملونها في شبابهم وصحتهم ، وهي مثل قوله : لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6179.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6179.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6179.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":18,"letters":164,"size":"24KB","priority":3,"commonlyRead":false}}