{"chapter":110,"name":{"arabic":"سورة 110","transliteration":"Chapter 110","translation":"Chapter 110","revelation":"unknown"},"revelation":"unknown","verses":3,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ","transliteration":"Iza jaa-a nas rullahi walfath","translations":{"en.ahmedali":"WHEN THE HELP of God arrives and victory,","en.ahmedraza":"When the help and victory of Allah come,","en.arberry":"When comes the help of God, and victory,","en.asad":"WHEN GOD'S SUCCOUR comes, and victory,","en.daryabadi":"When there cometh the succour of Allah and the victory,","en.hilali":"When comes the Help of Allah (to you, O Muhammad (Peace be upon him) against your enemies) and the conquest (of Makkah),","en.pickthall":"When Allah's succour and the triumph cometh","en.qaribullah":"When the victory of Allah and the opening comes,","en.sahih":"When the victory of Allah has come and the conquest,","en.sarwar":"(Muhammad), when help and victory comes from God,","en.yusufali":"When comes the Help of Allah, and Victory,","en.maududi":"When the help comes from Allah, and victory (is granted),","en.shakir":"When there comes the help of Allah and the victory,","en.itani":"When there comes God’s victory, and conquest.","en.mubarakpuri":"When there comes the help of Allah and the Conquest.","en.qarai":"When Allah’s help comes with victory,","en.wahiduddin":"When God's help and victory come,"},"tafsir":{"ar.muyassar":"إذا تمَّ لك -أيها الرسول- النصر على كفار قريش، وتم لك فتح \"مكة\".","ar.jalalayn":"«إذا جاء نصر الله» نبيَّه صلى الله عليه وسلم على أعدائه «والفتح» فتح مكة.","ar.qurtubi":"تفسير سورة النصروهي مدنية بإجماعوتسمى سورة ( التوديع ) . وهي ثلاث آيات .وهي آخر سورة نزلت جميعا ؛ قاله ابن عباس في صحيح مسلمبسم الله الرحمن الرحيمإذا جاء نصر الله والفتحالنصر : العون مأخوذ من قولهم : قد نصر الغيث الأرض : إذا أعان على نباتها ، من قحطها . قال الشاعر :إذا انسلخ الشهر الحرام فودعي بلاد تميم وانصري أرض عامرويروى :إذا دخل الشهر الحرام فجاوزي     بلاد تميم وانصري أرض عامريقال : نصره على عدوه ينصره نصرا ؛ أي أعانه . والاسم النصرة ، واستنصره على عدوه : أي سأله أن ينصره عليه . وتناصروا : نصر بعضهم بعضا . ثم قيل : المراد بهذا النصر نصر الرسول على قريش ؛ الطبري . وقيل : نصره على من قاتله من الكفار ؛ فإن عاقبة النصر كانت له . وأما الفتح فهو فتح مكة ؛ عن الحسن ومجاهد وغيرهما . وقال ابن عباس وسعيد بن جبير : هو فتح المدائن والقصور . وقيل : فتح سائر البلاد . وقيل : ما فتحه عليه من العلوم . و ( إذا ) بمعنى قد ؛ أي قد جاء نصر الله ؛ لأن نزولها بعد الفتح . ويمكن أن يكون معناه : إذا يجيئك .\n","ar.miqbas":"إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ (1) { } { أفواجا * فَسَبِّحْ بِحَمْدِ رَبِّكَ واستغفره إِنَّهُ كَانَ توابا } .{ إذا } اسم زمان مبهم يتعين مقدارهُ بمضمون جملةٍ يضاف إليها هو . ف { إذا } اسمُ زمان مطلق ، فقد يستعمل للزمن المستقبل غالباً . ولذلك يضمَّن معنى الشرط غالباً ، ويكون الفعل الذي تضاف إليه بصيغة الماضي غالباً لإفادة التحقق ، وقد يكون مضارعاً كقوله تعالى : { وهو على جمعهم إذا يشاء قدير } [ الشورى : 29 ] .ويستعمل في الزمن الماضي وحينئذ يتعين أن تقع الجملة بعده بصيغة الماضي ، ولا تضمن { إذا } معنى الشرط حينئذ وإنما هي لمجرد الإِخبار دون قصد تعليق نحو : { وإذَا رأوا تجارةً أو لهواً انفضوا إليها } [ الجمعة : 11 ] .و { إذا } هنا مضمنة الشرط لا محالة لوجود الفاء في قوله : { فسبح بحمد ربك } وقضية الاستقبال وعدمه تقدمت .والنصر : الإِعانة على العدوّ . ونصر الله يعقبه التغلب على العدو . و { الفتح } : امتلاك بلد العدوّ وأرضِه لأنه يكون بفتح باب البلد كقوله تعالى : { ادخلوا عليهم الباب فإذا دخلتموه فإنكم غالبون } [ المائدة : 23 ] ، ويكون باقتحام ثغور الأرض ومحارسها فقد كانوا ينزلون بالأَرضين التي لها شعاب وثغور قال لبيد :وأَجَنَّ عوراتتِ الثغور ظَلاَمُهاوقد فتح المسلمون خيْبر قبل نزول هذه الآية فتعين أن الفتح المذكور فيها فتح آخر وهو فتح مكة كما يشعر به التعريف بلام العهد ، وهو المعهود في قوله تعالى : { إنا فتحنا لك فتحاً مبيناً ليغفر لك اللَّه ما تقدم من ذنبك وما تأخر ويتم نعمته عليك ويهديك صراطاً مستقيماً وينصرك اللَّه نصراً عزيزاً } [ الفتح : 1 3 ] .فإضافة { نصر } إلى { اللَّه } تشعر بتعظيم هذا النصر وأنه نصر عزيز خارق للعادة اعتنى الله بإيجاد أسبابه ولم تجر على متعارف تولد الحوادث عن أمثالها .و { جاء } مستعمل في معنى : حصَل وتحقق مجازاً .والتعريف في «الفتح» للعهد وقد وعد الله رسوله صلى الله عليه وسلم به غير مرة من ذلك قوله تعالى : { إن الذي فرض عليك القرآن لرادك إلى معاد } [ القصص : 85 ] وقوله : { لتدخلن المسجد الحرام إن شاء اللَّه آمنين محلقين رؤوسكم ومقصرين لا تخافون فعلم ما لم تعلموا فجعل من دون ذلك فتحاً قريباً } [ الفتح : 27 ] . وهذه الآية نزلت عام الحديبية وذلك قبل نزول سورة { إذا جاء نصر الله } على جميع الأقوال .وقد اتفقت أقوال المفسرين من السلف فمَن بعدهم على أن الفتح المذكور في هذه السورة هو فتح مكة إلا رواية عن سعيد بن جبير عن ابن عباس هو فتح المدائن والقصور ، يعنون الحصون . وقد كان فتح مكة يخالج نفوس العرب كلهم فالمسلمون كانوا يرجونه ويعلمون ما أشار به القرآن من الوعد به وأهل مَكة يتوقعونه وبقية العرب ينتظرون ماذا يكون الحال بين أهل مكة وبين النبي صلى الله عليه وسلم ويتلومون بدخولهم في الإِسلام فتحَ مكة يقولون : إنْ ظهر محمد على قومه فهو نبيء .وتكرر أنْ صَدَّ بعضُهم بعضاً ممن يريد اتباع الاسلام عن الدخول فيه وإنظاره إلى ما سيظهر من غلب الإِسلام أو غلب الشرك .أخرج البخاري عن عمرو بن سلمة قال : «لما كان الفتح بادر كل قوم بإسلامهم إلى رسول الله صلى الله عليه وسلم وكانت الأحياء تتلوم بإسلامها فتح مكة فيقولون دَعوه وقومه فإن ظهر عليهم فهو نبيء» .وعن الحسن : لما فتحت مكة أقبلت العرب بعضها على بعض فقالوا : أما إذ ظفر بأهل الحرم فليس لنا به يَداننِ فكانوا يدخلون في الإِسلام أفواجاً . فعلى قول الجمهور في أن الفتح هو فتح مكة يستقيم أن تكون هذه السورة نزلت بعد فتح خيبر وهو قول الأكثرين في وقت نزولها .ويحتمل على قول القائلين بأنها نزلت عقب غزوة حنين أن يكون الفتح قد مضى ويكون التعليق على مجموع فتح مكة ومجيء نصر من الله آخر ودخول الناس في الإِسلام وذلك بما فتح عليه بعد ذلك ودخول العرب كلهم في الإِسلام سنة الوفود .وعلى ما روي عن ابن عمر : «أنها نزلت في حجة الوداع» يكون تعليق جملة : { فسبح بحمد ربك } على الشرط الماضي مراداً به التذكير بأنه حصل ، أي إذا تحقق ما وعدناك به من النصر والفتح وعموم الإِسلام بلادَ العرب فسبح بحمد ربك ، وهو مراد مَن قال من المفسرين { إذا } بمعنى ( قد ) ، فهو تفسير حاصل المعنى ، وليست { إذا } مما يأتي بمعنى ( قد ) .\n","ar.waseet":"النصر : التغلب على العدو ، والإِعانة على بلوغ الغاية ، ومنه قولهم : قد نصر الغيث الأرض ، أى : أعان على إظهار نباتها .والمراد به هنا : إعانة الله - تعالى - لنبيه صلى الله عليه وسلم على أعدائه ، حتى حقق له النصر عليهم .والفتح : يطلق على فتح البلاد عَنْوَةً والتغلب على أهلها ، ويطلق على الفصل والحكم بين الناس ، ومنه قوله - تعالى - : ( رَبَّنَا افتح بَيْنَنَا وَبَيْنَ قَوْمِنَا بالحق وَأَنتَ خَيْرُ الفاتحين ) والمراد به : هنا فتح مكة . وما ترتب عليه من إعزاز الدين ، وإظهار كلمة الحق .\n","ar.baghawi":"مكية( إذا جاء نصر الله والفتح ) أراد فتح مكة .وكانت قصته - على ما ذكر محمد بن إسحاق وأصحاب الأخبار - أن رسول الله - صلى الله عليه وسلم - لما صالح قريشا عام الحديبية ، واصطلحوا على وضع الحرب بين الناس عشر سنين ، يأمن فيهن الناس ، ويكف بعضهم عن بعض ، وأنه من أحب أن يدخل في عقد رسول الله - صلى الله عليه وسلم - وعهده دخل فيه ، ومن أحب أن يدخل في عقد قريش وعهدهم دخل فيه ، فدخلت بنو بكر في عقد قريش ، ودخلت خزاعة في عهد رسول الله - صلى الله عليه وسلم - ، وكان بينهما شر قديم .ثم إن بني بكر عدت على خزاعة ، وهم على ماء لهم بأسفل مكة ، يقال له \" الوتير \" ، فخرج نوفل بن معاوية الدؤلي في بني الدئل من بني بكر حتى بيت خزاعة ، وليس كل بكر تابعه ، فأصابوا منهم رجلا وتحاربوا واقتتلوا ، ورفدت قريش بني بكر بالسلاح ، وقاتل معهم من قريش من قاتل مستخفيا بالليل ، حتى حازوا خزاعة إلى الحرم ، وكان ممن أعان بني بكر من قريش على خزاعة ليلتئذ بأنفسهم متنكرين : صفوان بن أمية ، وعكرمة بن أبي جهل ، وسهيل بن عمرو ، مع عبيدهم فلما انتهوا إلى الحرم قالت بنو بكر : يا نوفل إنا دخلنا الحرم ، إلهك إلهك ، فقال كلمة عظيمة : إنه لا إله لي اليوم ، [ يا بني بكر ] أصيبوا ثأركم فيه .فلما تظاهرت قريش على خزاعة وأصابوا منهم ونقضوا ما بينهم وبين رسول الله - صلى الله عليه وسلم - من العهد بما استحلوا من خزاعة - وكانوا في عقده - خرج عمرو بن سالم الخزاعي ، حتى قدم على رسول الله - صلى الله عليه وسلم - المدينة ، وكان ذلك مما هاج فتح مكة ، فوقف عليه وهو في المسجد جالس بين ظهراني الناس ، فقال :لا هم إني ناشد محمدا حلف أبينا وأبيه الأتلدا     إن قريشا أخلفوك الموعداونقضوا ميثاقك المؤكداالأبيات كما ذكرنا في سورة التوبة .فقال رسول الله - صلى الله عليه وسلم - : \" قد نصرت يا عمرو بن سالم \" ، ثم عرض لرسول الله - صلى الله عليه وسلم - عنان من السماء ، فقال : \" إن هذه السحابة لتستهل ، بنصر بني كعب \" ، وهم رهط عمرو بن سالم .ثم خرج بديل بن ورقاء في نفر من خزاعة ، حتى قدموا على رسول الله - صلى الله عليه وسلم - فأخبروه بما أصيب منهم [ وبمظاهرة ] قريش بني بكر عليهم ، ثم انصرفوا راجعين إلى مكة ، وقد كان رسول الله - صلى الله عليه وسلم - قال للناس : كأنكم بأبي سفيان قد جاء ليشد العقد ويزيد في المدة .ومضى بديل بن ورقاء فلقي أبا سفيان بعسفان ، قد بعثته قريش إلى رسول الله - صلى الله عليه وسلم - ليشد العقد ويزيد في المدة ، وقد رهبوا الذي صنعوا ، فلما لقي أبو سفيان بديلا قال : من أين أقبلت يا بديل ؟ وظن أنه قد أتى رسول الله - صلى الله عليه وسلم - ، قال : سرت في خزاعة في هذا الساحل وفي بطن هذا الوادي ، قال : أوما أتيت محمدا ؟ قال : لا فلما راح بديل إلى مكة قال أبو سفيان : لئن كان جاء المدينة لقد علف ناقته بها النوى ، فعمد إلى مبرك ناقته فأخذ من بعرها ففته فرأى فيه النوى ، فقال : أحلف بالله لقد جاء بديل محمدا .ثم خرج أبو سفيان حتى قدم على رسول الله - صلى الله عليه وسلم - المدينة ، فدخل على ابنته أم حبيبة بنت أبي سفيان ، فلما ذهب ليجلس على فراش رسول الله - صلى الله عليه وسلم - طوته عنه ، فقال : يا بنية أرغبت بي عن هذا الفراش أم أرغبت به عني ؟ قالت : بلى هو فراش رسول الله - صلى الله عليه وسلم - ، وأنت رجل مشرك نجس ، فلم أحب أن تجلس على فراش رسول الله - صلى الله عليه وسلم - ، فقال : والله لقد أصابك يا بنية بعدي [ شيء ] ثم خرج حتى أتى رسول الله - صلى الله عليه وسلم - فكلمه فلم يرد عليه شيئا [ غير أنه قال : نقض أهل مكة العهد ] .ثم ذهب إلى أبي بكر فكلمه أن يكلم له رسول الله - صلى الله عليه وسلم - ، فقال : ما أنا بفاعل ، ثم أتى عمر بن الخطاب فكلمه فقال : أنا أشفع لكم إلى رسول الله - صلى الله عليه وسلم - ؟ ! فوالله لو لم أجد إلا الذر لجاهدتكم به ، ثم خرج فدخل على علي بن أبي طالب - رضي الله عنه - ، وعنده فاطمة بنت رسول الله - صلى الله عليه وسلم - وعندها الحسن بن علي رضي الله عنهما ، غلام يدب ، بين يديها ، فقال : يا علي إنك أمس القوم بي رحما وأقربهم مني قرابة ، وقد جئت في حاجة فلا أرجعن كما جئت خائبا ، اشفع لنا إلى رسول الله - صلى الله عليه وسلم - ، فقال : ويحك يا أبا سفيان لقد عزم رسول الله - صلى الله عليه وسلم - على أمر ما نستطيع أن نكلمه فيه ، فالتفت إلى فاطمة فقال : يا بنت محمد ، هل لك أن تأمري بنيك هذا فيجير بين الناس فيكون سيد العرب إلى آخر الدهر ؟ قالت : والله ما بلغ بني أن يجير بين الناس ، وما يجير على رسول الله - صلى الله عليه وسلم - أحد ، فقال : يا أبا الحسن - إني أرى الأمور قد اشتدت علي فانصحني ، قال : والله ما أعلم شيئا يغني عنك ، ولكنك سيد بني كنانة ، فقم فأجر بين الناس ، ثم الحق بأرضك ، قال أوترى ذلك مغنيا عني شيئا ؟ قال : لا والله ، ما أظن ، ولكن لا أجد لك غير ذلك .فقام أبو سفيان في المسجد فقال : يا أيها الناس إني قد أجرت بين الناس ، ثم ركب بعيره فانطلق فلما قدم على قريش قالوا : ما وراءك ؟ قال : جئت محمدا فكلمته والله ما رد علي شيئا ثم جئت ابن أبي قحافة ، فلم أجد عنده خيرا ، فجئت ابن الخطاب فوجدته أعدى القوم ، ثم أتيت علي بن أبي طالب فوجدته ألين القوم ، وقد أشار علي بشيء صنعته ، فوالله ما أدري هل [ يغنيني ] شيئا أم لا ؟ قالوا : وماذا أمرك ؟ قال : أمرني أن أجير بين الناس ففعلت ، قالوا : فهل أجاز ذلك محمد - صلى الله عليه وسلم - ؟ قال : لا قالوا : والله إن زاد علي على أن لعب بك ، فلا يغني عنا ما قلت ، قال : لا والله ما وجدت غير ذلك .قال : وأمر رسول الله - صلى الله عليه وسلم - الناس بالجهاز ، وأمر أهله أن يجهزوه ، فدخل أبو بكر على ابنته عائشة رضي الله عنها وهي تصلح بعض جهاز رسول الله - صلى الله عليه وسلم - ، فقال : أي بنية أمركم رسول الله - صلى الله عليه وسلم - بأن تجهزوه ؟ قالت : نعم فتجهز ، قال : فأين ترينه يريد ؟ قالت : ما أدري . ثم إن رسول الله - صلى الله عليه وسلم - أعلم الناس أنه سائر إلى مكة ، وأمرهم بالجد والتهيؤ ، وقال : اللهم خذ العيون والأخبار عن قريش حتى [ نبغتها ] في بلادها ، فتجهز الناس .وكتب حاطب بن أبي بلتعة كتابا إلى قريش [ - وفيه قصة ] ذكرناها في سورة الممتحنة - .ثم استخلف رسول الله - صلى الله عليه وسلم - على المدينة أبا رهم كلثوم بن حصين بن خلف الغفاري ، وخرج عامدا إلى مكة لعشر مضين من رمضان سنة ثمان ، فصام رسول الله - صلى الله عليه وسلم - وصام الناس معه ، حتى إذا كان بالكديد - ماء بين عسفان وأمج - أفطر .ثم مضى حتى نزل بمر الظهران في عشرة آلاف من المسلمين ، ولم يتخلف من المهاجرين والأنصار عنه أحد ، فلما نزل بمر الظهران ، وقد عميت الأخبار عن قريش ، فلا يأتيهم خبر عن رسول الله - صلى الله عليه وسلم - ولا يدرون ما هو فاعل ، فخرج في تلك الليلة : أبو سفيان بن حرب ، وحكيم بن حزام وبديل بن ورقاء ، يتحسسون الأخبار هل يجدون خبرا ؟ وقد قال العباس بن عبد المطلب ليلتئذ : واصباح قريش ، والله لئن [ بغتها ] رسول الله - صلى الله عليه وسلم - في بلادها فدخل مكة عنوة إنها لهلاك قريش إلى آخر الدهر .فخرج العباس على بغلة رسول الله وقال : أخرج إلى الأراك لعلي أرى حطابا أو صاحب لبن أو داخلا يدخل مكة فيخبرهم بمكان رسول الله - صلى الله عليه وسلم - فيأتونه فيستأمنونه قبل أن يدخلها عليهم عنوة .قال العباس فخرجت وإني - والله - لأطوف في الأراك ألتمس ما خرجت له إذ سمعت صوت أبي سفيان وحكيم بن حزام وبديل بن ورقاء ، وقد خرجوا يتحسسون الخبر ، فسمعت أبا سفيان يقول : والله ما رأيت كالليلة قط نيرانا ، وقال بديل : هذه والله نيران خزاعة [ حمشتها ] الحرب ، فقال أبو سفيان : خزاعة ألأم من ذلك وأذل فعرفت صوته فقلت : يا أبا حنظلة ، فعرف صوتي فقال : يا أبا الفضل ، فقلت : نعم ، فقال : مالك فداك أبي وأمي ؟ قلت : ويحك يا أبا سفيان هذا ، والله ، رسول الله - صلى الله عليه وسلم - قد جاء بما لا قبل لكم به ، بعشرة آلاف من المسلمين ، قال : وما الحيلة ؟ قلت : والله لئن ظفر بك ليضربن عنقك ، فاركب في عجز هذه البغلة حتى آتي بك رسول الله - صلى الله عليه وسلم - فأستأمنه فردفني ، ورجع صاحباه فخرجت أركض به بغلة رسول الله - صلى الله عليه وسلم - ، كلما مررت بنار من نيران المسلمين فنظروا إلي قالوا : هذا عم رسول الله - صلى الله عليه وسلم - ، حتى مررت بنار عمر بن الخطاب ، فقال : من هذا ؟ وقام إلي فلما رأى أبا سفيان على عجز الدابة ، قال : أبو سفيان عدو الله! الحمد لله الذي أمكن منك بغير عهد ولا عقد ، ثم اشتد نحو رسول الله - صلى الله عليه وسلم - فركضت البغلة وسبقته بما تسبق الدابة البطيئة الرجل البطيء ، فاقتحمت عن البغلة فدخلت على رسول الله - صلى الله عليه وسلم - ودخل عليه عمر ، فقال : يا رسول الله هذا أبو سفيان عدو الله قد أمكن الله منه بغير عهد ولا عقد ، فدعني فلأضرب عنقه ، فقلت : يا رسول الله إني قد أجرته ، ثم جلست إلى رسول الله فأخذت برأسه وقلت : والله لا يناجيه الليلة أحد دوني ، فلما أكثر فيه عمر - رضي الله عنه - قلت : مهلا يا عمر ، فوالله ما تصنع هذا إلا أنه رجل من بني عبد مناف ، ولو كان من بني عدي بن كعب ما قلت هذا . قال : مهلا يا عباس ، فوالله لإسلامك يوم أسلمت كان أحب إلي من إسلام الخطاب لو أسلم ، [ وذلك لأني أعلم أن إسلامك كان أحب إلى رسول الله - صلى الله عليه وسلم - من إسلام الخطاب لو أسلم ] ، فقال رسول الله - صلى الله عليه وسلم - : \" اذهب به يا عباس إلى رحلك ، فإذا أصبحت فأتني به \" ، قال : فذهبت إلى رحلي فبات عندي ، فلما أصبح غدوت به إلى رسول الله - صلى الله عليه وسلم - ، فلما رآه قال : \" ويحك يا أبا سفيان [ ألم يأن ] لك أن تعلم أن لا إله إلا الله ؟ \" قال : بأبي أنت وأمي ، ما أحلمك وأكرمك وأوصلك ! والله لقد ظننت أن لو كان مع الله إله غيره فقد أغنى عني شيئا بعد ، قال : ويحك يا أبا سفيان ألم يأن لك أن تعلم أني رسول الله ؟ قال : بأبي أنت وأمي وما أحلمك وأكرمك وأوصلك! أما هذه فإن في النفس منها [ حتى الآن ] شيئا ، قال العباس : قلت له : ويحك ! أسلم واشهد أن لا إله إلا الله وأن محمدا رسول الله ، قبل أن يضرب عنقك ، قال : فشهد شهادة الحق وأسلم ، قال العباس : قلت : يا رسول الله إن أبا سفيان رجل يحب هذا الفخر ، فاجعل له شيئا ، قال : نعم ، من دخل دار أبي سفيان فهو آمن ، ومن أغلق عليه بابه فهو آمن ، ومن دخل المسجد فهو آمن ، فلما ذهب لينصرف قال رسول الله - صلى الله عليه وسلم - : يا عباس احبسه ، بمضيق الوادي عند خطم الجبل حتى تمر به جنود الله فيراها ، قال : فخرجت به حتى حبسته حيث أمرني رسول الله - صلى الله عليه وسلم - .قال : ومرت به القبائل على راياتها ، كلما مرت قبيلة قال : من هؤلاء يا عباس ؟ قال : أقول : سليم ، قال يقول : مالي ولسليم ، ثم تمر القبيلة فيقول : من هؤلاء ؟ فأقول : مزينة ، فيقول : مالي ولمزينة ، حتى نفذت القبائل لا تمر قبيلة إلا سألني عنها ، فإذا أخبرته يقول : مالي ولبني فلان حتى مر رسول الله - صلى الله عليه وسلم - في الخضراء ، كتيبة رسول الله ، فيها المهاجرون والأنصار ، لا يرى منهم إلا الحدق من الحديد ، قال : سبحان الله من هؤلاء يا عباس ؟ قلت : هذا رسول الله - صلى الله عليه وسلم - في المهاجرين والأنصار ، فقال : والله ما لأحد بهؤلاء من قبل ولا طاقة ، والله يا أبا الفضل لقد أصبح ملك ابن أخيك عظيما ، فقال : ويحك! إنها النبوة ، قال : نعم إذا .فقلت : الحق الآن بقومك فحذرهم ، فخرج سريعا حتى أتى مكة فصرخ في المسجد بأعلى صوته : يا معشر قريش ، هذا محمد قد جاءكم فيما لا قبل لكم به ، قالوا : فمه ؟ قال : من دخل دار أبي سفيان فهو آمن ، قالوا : ويحك وما تغني عنا دارك ؟ قال : ومن دخل المسجد فهو آمن ، ومن أغلق عليه بابه فهو آمن ، فتفرق الناس إلى دورهم وإلى المسجد .قال : وجاء حكيم بن حزام وبديل بن ورقاء إلى رسول الله - صلى الله عليه وسلم - بمر الظهران فأسلما وبايعاه ، فلما بايعاه بعثهما رسول الله - صلى الله عليه وسلم - بين يديه إلى قريش يدعوانهم إلى الإسلام .ولما خرج حكيم بن حزام وبديل بن ورقاء من عند النبي - صلى الله عليه وسلم - عامدين إلى مكة بعث في إثرهما الزبير وأعطاه رايته وأمره على خيل المهاجرين والأنصار ، وأمره أن يركز رايته بأعلى مكة بالحجون ، وقال : لا تبرح حيث أمرتك أن تركز رايتي حتى آتيك ، ومن ثم دخل رسول الله - صلى الله عليه وسلم - مكة وضربت هناك قبته ، وأمر خالد بن الوليد فيمن أسلم من قضاعة وبني سليم أن يدخل من أسفل مكة وبها بنو بكر قد استنفرتهم قريش وبنو الحارث بن عبد مناف ومن كان من الأحابيش ، أمرتهم قريش أن يكونوا بأسفل مكة ، وإن صفوان بن أمية وعكرمة بن أبي جهل وسهيل بن عمرو ، وكانوا قد جمعوا أناسا بالخندمة ليقاتلوا ، وقال النبي - صلى الله عليه وسلم - لخالد والزبير حين بعثهما : لا تقاتلا إلا من قاتلكم ، وأمر سعد بن عبادة أن يدخل في بعض الناس من كدي ، فقال سعد حين توجه داخلا اليوم يوم الملحمة ، اليوم تستحل الحرمة ، فسمعها رجل من المهاجرين فقال : يا رسول الله ، اسمع ما قال سعد بن عبادة ، وما نأمن أن يكون له في قريش صولة فقال رسول الله - صلى الله عليه وسلم - لعلي بن أبي طالب : أدركه فخذ الراية منه ، فكن أنت الذي تدخل بها ، فلم يكن بأعلى مكة من قبل الزبير قتال ، وأما خالد بن الوليد فقدم على قريش وبني بكر والأحابيش بأسفل مكة ، فقاتلهم فهزمهم الله ، ولم يكن بمكة قتال غير ذلك .وقتل من المشركين قريب من اثني عشر أو ثلاثة عشر ، ولم يقتل من المسلمين إلا رجل من جهينة يقال له : سلمة بن الميلاء ، من خيل خالد بن الوليد ، ورجلان يقال لهما : كرز بن جابر [ وخنيس ] بن خالد ، كانا في خيل خالد بن الوليد ، فشذا عنه وسلكا طريقا غير طريقه ، فقتلا جميعا .وكان رسول الله - صلى الله عليه وسلم - قد عهد إلى أمرائه من المسلمين حين أمرهم أن يدخلوا مكة أن لا يقاتلوا أحدا إلا من قاتلهم ، إلا [ أنه قد عهد ] في نفر سماهم أمر بقتلهم ، وإن وجدوا تحت أستار الكعبة . منهم : عبد الله بن سعد بن أبي سرح ، وإنما أمر بقتله لأنه كان قد أسلم فارتد مشركا ، ففر إلى عثمان ، وكان أخاه من الرضاعة ، فغيبه حتى أتى به [ رسول الله - صلى الله عليه وسلم - بعد أن اطمأن أهل مكة ، فاستأمن له .وعبد الله بن خطل ، كان رجلا من بني تميم بن غالب ] ، وإنما أمر بقتله لأنه كان مسلما فبعثه رسول الله - صلى الله عليه وسلم - مصدقا ، وكان له مولى يخدمه وكان مسلما ، فنزل منزلا وأمر المولى أن يذبح له تيسا ويصنع له طعاما ونام فاستيقظ ولم يصنع له شيئا فعدا عليه فقتله ، ثم ارتد مشركا ، وكانت له قينتان تغنيان بهجاء رسول الله - صلى الله عليه وسلم - ، فأمر بقتلهما معه .والحويرث ، بن [ نقيذ ] بن وهب ، كان ممن يؤذيه بمكة .ومقيس بن صبابة ، وإنما أمر بقتله ، لقتله الأنصاري الذي قتل أخاه خطئا ورجوعه إلى قريش مرتدا .وسارة ; مولاة كانت لبعض بني المطلب كانت ممن يؤذيه بمكة .وعكرمة بن أبي جهل ، فأما عكرمة فهرب إلى اليمن ، وأسلمت امرأته أم حكيم بنت الحارث بن هشام ، فاستأمنت له رسول الله - صلى الله عليه وسلم - فأمنه ، فخرجت في طلبه حتى أتت به رسول الله - صلى الله عليه وسلم - فأسلم .وأما عبد الله بن خطل ، فقتله سعد بن حريث المخزومي وأبو برزة الأسلمي ، اشتركا في دمه ، وأما مقيس بن صبابة ، فقتله تميلة بن عبد الله ، رجل من قومه ، وأما قينتا ابن خطل ; فقتلت إحداهما وهربت الأخرى حتى استؤمن لها رسول الله - صلى الله عليه وسلم - ، فأمنها ، وأما سارة فتغيبت حتى استؤمن لها فأمنها ، فعاشت حتى أوطأها رجل من الناس فرسا له في زمن عمر بن الخطاب بالأبطح فقتلها ، وأما الحويرث بن نقيذ ، فقتله علي بن أبي طالب .فلما دخل رسول الله - صلى الله عليه وسلم - مكة وقف قائما على باب الكعبة وقال : لا إله إلا الله وحده ، صدق وعده ، ونصر عبده ، وهزم الأحزاب وحده ، ألا إن كل مأثرة أو دم أو مال في الجاهلية يدعى فهو تحت قدمي هاتين ، إلا سدانة البيت وسقاية الحاج ، يا معشر قريش ، إن الله قد أذهب عنكم نخوة الجاهلية وتعظمها بالآباء ، الناس من آدم وآدم خلق من تراب ، ثم تلا \" يا أيها الناس إنا خلقناكم من ذكر وأنثى \" ( الحجرات - 13 ) الآية ، يا أهل مكة ، ماذا ترون أني فاعل بكم ؟ قالوا : خيرا ، أخ كريم وابن أخ كريم ، قال : اذهبوا فأنتم الطلقاء فأعتقهم رسول الله - صلى الله عليه وسلم - ، وقد كان الله أمكنه من رقابهم عنوة ، فلذلك سمي أهل مكة الطلقاء .ثم اجتمع الناس للبيعة ; فجلس لهم رسول الله - صلى الله عليه وسلم - على الصفا ، وعمر بن الخطاب أسفل منه يأخذ على الناس ، فبايعوه على السمع والطاعة فيما استطاعوا ، فلما فرغ من بيعة الرجال بايع النساء .قال عروة بن الزبير : خرج صفوان بن أمية يريد جدة ليركب منها إلى اليمن ، فقال عمير بن وهب الجمحي : يا نبي الله إن صفوان بن أمية سيد قومي ، وقد خرج هاربا منك ليقذف نفسه في البحر ، فأمنه ، قال رسول الله - صلى الله عليه وسلم - : هو آمن ، قال : يا رسول الله أعطني شيئا يعرف به أمانك ، فأعطاه رسول الله - صلى الله عليه وسلم - عمامته التي دخل بها مكة ، فخرج بها عمير حتى أدركه بجدة وهو يريد أن يركب البحر فقال : يا صفوان فداك أبي وأمي أذكرك الله في نفسك أن تهلكها ، فهذا أمان رسول الله - صلى الله عليه وسلم - قد جئتك به ، فقال : ويلك اغرب عني فلا تكلمني ، قال : أي صفوان فداك أبي وأمي ، أفضل الناس وأبر الناس ، وأحلم الناس ، وخير الناس ، ابن عمك عزه عزك وشرفه شرفك وملكه ملكك . قال : إني أخافه على نفسي ، قال : هو أحلم من ذلك وأكرم ، فرجع به معه حتى وقف به على رسول الله - صلى الله عليه وسلم - ، فقال صفوان : إن هذا يزعم أنك أمنتني ؟ قال : صدق ، قال فاجعلني في أمري بالخيار شهرين ، قال : أنت فيه بالخيار أربعة أشهر .قال ابن إسحاق : وكان جميع من شهد فتح مكة من المسلمين عشرة آلاف ، وكان فتح مكة لعشر ليال بقين من رمضان سنة ثمان ، وأقام رسول الله - صلى الله عليه وسلم - بمكة بعد فتحها خمس عشرة ليلة [ يقصر ] الصلاة .ثم خرج إلى هوازن وثقيف ، قد نزلوا حنينا .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا أبو نعيم ، حدثنا شيبان عن يحيى بن أبي كثير عن أبي سلمة عن أبي هريرة ، أن خزاعة قتلوا رجلا . . . \" وقال محمد بن إسماعيل ، قال عبد الله بن رجاء : حدثنا حرب عن يحيى ، حدثنا أبو سلمة \" حدثنا أبو هريرة : أنه عام فتح مكة قتلت خزاعة رجلا من بني ليث بقتيل لهم في الجاهلية ، فقام رسول الله - صلى الله عليه وسلم - فقال : إن الله حبس عن مكة الفيل وسلط عليهم رسوله والمؤمنين . ألا وإنها لم تحل لأحد قبلي ، ولا تحل لأحد من بعدي ، ألا وإنها أحلت لي ساعة من نهار ، ألا وإنها ساعتي هذه ، حرام لا يختلى شوكها ولا يعضد شجرها ، ولا يلتقط ساقطتها إلا منشد ، ومن قتل له قتيل فهو بخير النظر إما يؤدى وإما أن يقاد فقام رجل من أهل اليمن يقال له أبو شاه فقال : اكتب لي يا رسول الله ، فقال رسول الله - صلى الله عليه وسلم - : اكتبوا لأبي شاه ثم قام رجل من قريش فقال : يا رسول الله إلا الإذخر فإنا نجعله في بيوتنا وقبورنا ، فقال رسول الله - صلى الله عليه وسلم - : \" إلا الإذخر \" .أخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب عن مالك ، عن أبي النضر - مولى عمر بن عبيد الله - أن أبا مرة مولى أم هانئ بنت أبي طالب أخبره أنه سمع أم هانئ بنت أبي طالب تقول : ذهبت إلى رسول الله - صلى الله عليه وسلم - عام الفتح ، فوجدته يغتسل ، وفاطمة ابنته تستره بثوب ، قالت : فسلمت ، فقال : من هذه ؟ فقلت : أنا أم هانئ بنت أبي طالب ، قال : مرحبا بأم هانئ ، فلما فرغ من غسله قام فصلى ثماني ركعات ملتحفا في ثوب واحد ، ثم انصرف فقلت له : يا رسول الله ، زعم ابن أمي ، علي بن أبي طالب ، أنه قاتل رجلا أجرته ، فلان بن هبيرة ، فقال رسول الله - صلى الله عليه وسلم - : قد أجرنا من أجرت يا أم هانئ ، وذلك ضحى .قوله - عز وجل - : ( إذا جاء نصر الله ) إذا جاءك نصر الله يا محمد على من عاداك وهم قريش ، ( والفتح ) فتح مكة .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6214.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6214.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6214.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا","transliteration":"Wa ra-aitan naasa yadkhuloona fee deenil laahi afwajah","translations":{"en.ahmedali":"And you see men enter God's discipline horde on horde,","en.ahmedraza":"And you see people entering the religion of Allah in multitudes,","en.arberry":"and thou seest men entering God's religion in throngs,","en.asad":"and thou seest people enter God's religion in hosts,","en.daryabadi":"And thou beholdest mankind entering the religion of Allah in crowds,","en.hilali":"And you see that the people enter Allah's religion (Islam) in crowds,","en.pickthall":"And thou seest mankind entering the religion of Allah in troops,","en.qaribullah":"and you see people embracing the Religion of Allah in throngs,","en.sahih":"And you see the people entering into the religion of Allah in multitudes,","en.sarwar":"you will see large groups of people embracing the religion of God.","en.yusufali":"And thou dost see the people enter Allah's Religion in crowds,","en.maududi":"and you see people entering Allah's religion in multitudes,","en.shakir":"And you see men entering the religion of Allah in companies,","en.itani":"And you see the people entering God’s religion in multitudes.","en.mubarakpuri":"And you see that the people enter Allah's religion in crowds.","en.qarai":"and you see the people entering Allah’s religion in throngs,","en.wahiduddin":"and you see people entering God's religion in multitudes,"},"tafsir":{"ar.muyassar":"ورأيت الكثير من الناس يدخلون في الإسلام جماعات جماعات.","ar.jalalayn":"«ورأيت الناس يدخلون في دين الله» أي الإسلام «أفواجا» جماعات بعدما كان يدخل فيه واحد واحد، وذلك بعد فتح مكة جاءه العرب من أقطار الأرض طائعين.","ar.qurtubi":"قوله تعالى : ورأيت الناس يدخلون في دين الله أفواجا قوله تعالى : ورأيت الناس أي العرب وغيرهم . يدخلون في دين الله أفواجا أي جماعات : فوجا بعد فوج . وذلك لما فتحت مكة قالت العرب : أما إذا ظفر محمد بأهل الحرم ، وقد كان الله أجارهم من أصحاب الفيل ، فليس لكم به يدان . فكانوا يسلمون أفواجا : أمة أمة . قال الضحاك : والأمة : أربعون رجلا . وقال عكرمة ومقاتل : أراد بالناس أهل اليمن . وذلك أنه ورد من اليمن سبعمائة إنسان مؤمنين طائعين ، بعضهم يؤذنون ، وبعضهم يقرءون القرآن ، وبعضهم يهللون ؛ فسر النبي - صلى الله عليه وسلم - بذلك ، وبكى عمر وابن عباس . وروى عكرمة عن ابن عباس أن النبي - صلى الله عليه وسلم - قرأ : إذا جاء نصر الله والفتح وجاء أهل اليمن رقيقة أفئدتهم ، لينة طباعهم ، سخية قلوبهم ، عظيمة خشيتهم ، فدخلوا في دين الله أفواجا . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : أتاكم أهل اليمن ، هم أضعف قلوبا ، وأرق أفئدة ، الفقه يمان ، والحكمة يمانية . وروي أنه - صلى الله عليه وسلم - قال : إني لأجد نفس ربكم من قبل اليمن وفيه تأويلان : أحدهما : أنه الفرج ؛ لتتابع إسلامهم أفواجا . والثاني : معناه أن الله تعالى نفس الكرب عن نبيه - صلى الله عليه وسلم - بأهل اليمن ، وهم الأنصار . وروى جابر بن عبد الله قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : إن الناس دخلوا في دين الله أفواجا ، وسيخرجون منه أفواجا ذكره الماوردي ، ولفظ الثعلبي : وقال أبو عمار حدثني جابر لجابر ، قال : سألني جابر عن حال الناس ، فأخبرته عن حال اختلافهم وفرقتهم ؛ فجعل يبكي ويقول : سمعت رسول الله - صلى الله عليه وسلم - يقول : إن الناس دخلوا في دين الله أفواجا ، وسيخرجون من دين الله أفواجا .\n","ar.miqbas":"وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا (2) والرؤية في قوله : { ورأيت الناس } يجوز أن تكون علمية ، أي وعلمت علم اليقين أن الناس يدخلون في دين الله أفواجاً وذلك بالأخبار الواردة من آفاق بلاد العرب ومواطن قبائلهم وبمَنْ يحضر من وفودهم . فيكون جملة { يدخلون } في محل المفعول الثاني ل { رأيت } .ويجوز أن تكون رؤية بصرية بأن رأى أفواج وفود العرب يردون إلى المدينة يدخلون في الإِسلام وذلك سنة تسع ، وقد رأى النبي صلى الله عليه وسلم ببصره ما علم منه دخولهم كلهم في الإِسلام بمن حضر معه الموقف في حجة الوداع فقد كانوا مائة ألف من مختلف قبائل العرب فتكون جملة { يدخلون } في موضع الحال من الناس .و { دين اللَّه } هو الإِسلام لقوله تعالى : { إن الدين عند اللَّه الإسلام } [ آل عمران : 19 ] وقوله : { فأقم وجهك للدين حنيفاً فطرت اللَّه التي فطر الناس عليها } [ الروم : 30 ] .والدخول في الدين : مستعار للنطق بكلمة الشهادة والتزام أحكام الدين الناشئة عن تلك الشهادة . فشُبه الدين ببيت أو حظيرة على طريقة المكنية ورمز إليه بما هو من لوازم المشبه به وهو الدخول ، على تشبيه التلبس بالدين بتلبس المظروف بالظرف ، ففيه استعارة أخرى تصريحية .و { الناس } : اسم جمع يدل على جماعة من الآدميين ، وقد تقدم عند قوله تعالى : { ومن الناس من يقول آمنا باللَّه } في سورة [ البقرة : 8 ] .وإذا عُرّف اسم ناس باللام احتملت العهد نحو : { الذين قال لهم الناس } [ آل عمران : 173 ] ، واحتملت الجنس نحو : { إن الناس قد جمعوا لكم } [ آل عمران : 173 ] واحتملت الاستغراق نحو : { ومن الناس من يقول } [ البقرة : 8 ] ونحو : { قل أعوذ برب الناس } [ الناس : 1 ] .والتعريف في هذه الآية للاستغراق العرفي ، أي جميع الناس الذين يخطرون بالبال لعدم إرادة معهودين معينني ولاستحالة دخول كل إنسان في دين الله بدليل المشاهدة ، فالمعنى : ورأيتَ ناساً كثيرين أو ورأيت العرب .قال ابن عطية : «قال أبو عُمر بن عبد البر النمري رحمه الله في كتاب «الاستيعاب» في باب خراش الهذلي : لم يمت رسول الله صلى الله عليه وسلم وفي العرب رجل كافر بل دخل الكل في الإِسلام بعد حُنين والطائِف ، منهم من قدِم ومنهم من قدِم وافده» ا ه . وإنما يراد عرب الحجاز ونجد واليمن لأن مِن عرب الشام والعراق من لم يدخلوا في الإِسلام ، وهم : تَغلب وغسان في مشارف الشام والشاممِ ، وكذلك لخم وكلب من العراق فهؤلاء كانوا نصارى ولم يسلم من أسلم منهم إلا بعد فتح الشام والعراق بعد رسول الله صلى الله عليه وسلم فلم يرهم رسول الله صلى الله عليه وسلم يدخلون في دين الله رؤية بصرية .ويجوز أن يكون اللَّهُ أعلمه بذلك إن جعلنا الرؤية علمية .والأفواج : جمع فوج وهو الجماعة الكثيرة ، وتقدم عند قوله تعالى : { هذا فوج مقتحم معكم } في سورة [ ص : 59 ] ، أي يدخلون في الإِسلام قبائل ، وانتصب أفواجاً } على الحال من ضمير { يدخلون } .\n","ar.waseet":"قال الإِمام ابن كثير : والمراد بالفتح هنا فتح مكة قولا واحدا ، فإن أحياء العرب كانت تتلوم - أى : تنتظر - بإسلامها فتح مكة ، يقولون : إن ظهر على قومه فهو نبى ، فلما فتح الله عليه مكة ، دخلوا فى دين الله أفواجا ، فلم تمض سنتان حتى استوسقت - أى : اجتمعت - جزيرة العرب على الإِيمان ، ولم يبق فى سائر قبائل العرب إلا مظهر للإِسلام ، ولله الحمد والمنة .والأفواج : جمع فوج ، وهو الجماعة والطائفة من الناس\n","ar.baghawi":"( ورأيت الناس يدخلون في دين الله أفواجا ) زمرا وأرسالا القبيلة بأسرها ، والقوم بأجمعهم من غير قتال .قال الحسن : لما فتح الله - عز وجل - مكة على رسوله قالت العرب بعضها لبعض : إذا ظفر محمد بأهل الحرم - وقد كان الله أجارهم من أصحاب الفيل - فليس لكم به يدان ، فكانوا يدخلون في دين الله أفواجا بعد أن كانوا يدخلون واحدا واحدا ، واثنين اثنين .وقال عكرمة ومقاتل : أراد بالناس أهل اليمن :أخبرنا أبو عبد الله محمد بن الفضل الخرقي أخبرنا أبو الحسن علي بن عبد الله الطيسفوني أخبرنا عبد الله بن عمر الجوهري حدثنا أحمد بن الكشميهني حدثنا علي بن حجر حدثنا إسماعيل بن جعفر حدثنا محمد بن عمرو بن علقمة عن أبي سلمة عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : \" أتاكم أهل اليمن هم أضعف قلوبا وأرق أفئدة الإيمان والحكمة يمانية \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6215.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6215.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6215.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا","transliteration":"Fa sab bih bihamdi rabbika was taghfir, innahu kaana tawwaaba","translations":{"en.ahmedali":"Then glorify your Lord and seek His forgiveness. Verily He is relenting.","en.ahmedraza":"Then proclaim the Purity of your Lord while praising Him, and seek forgiveness from Him; indeed He is the Most Acceptor of Repentance.","en.arberry":"then proclaim the praise of thy Lord, and seek His forgiveness; for He turns again unto men.","en.asad":"extol thy Sustainer's limitless glory, and praise Him, and seek His forgiveness: for, behold, He is ever an acceptor of repentance.","en.daryabadi":"Then hallow the praise of thy Lord, and ask forgiveness of Him. Verily He is ever Relenting.","en.hilali":"So glorify the Praises of your Lord, and ask for His Forgiveness. Verily, He is the One Who accepts the repentance and forgives.","en.pickthall":"Then hymn the praises of thy Lord, and seek forgiveness of Him. Lo! He is ever ready to show mercy.","en.qaribullah":"exalt with the praise of your Lord and ask forgiveness from Him. For indeed, He is the Turner (for the penitent).","en.sahih":"Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance.","en.sarwar":"Glorify your Lord with praise and ask Him for forgivenes. He accepts repentance.","en.yusufali":"Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).","en.maududi":"then extol the praise of your Lord and pray to Him for forgiveness. For He indeed is ever disposed to accept repentance.","en.shakir":"Then celebrate the praise of your Lord, and ask His forgiveness; surely He is oft-returning (to mercy).","en.itani":"Then celebrate the praise of your Lord, and seek His forgiveness. He is the Accepter of Repentance.","en.mubarakpuri":"So, glorify the praises of your Lord, and ask His forgiveness. Verily, He is the One Who accepts the repentance and Who forgives.","en.qarai":"celebrate the praise of your Lord, and plead to Him for forgiveness. Indeed, He is all-clement.","en.wahiduddin":"then glorify your Lord with His praise and seek His forgiveness. He is always ready to accept repentance."},"tafsir":{"ar.muyassar":"إذا وقع ذلك فتهيأ للقاء ربك بالإكثار من التسبيح بحمده والإكثار من استغفاره، إنه كان توابًا على المسبحين والمستغفرين، يتوب عليهم ويرحمهم ويقبل توبتهم.","ar.jalalayn":"«فسبح بحمد ربك» أي متلبسا بحمده «واستغفره إنه كان توابا» وكان صلى الله عليه وسلم بعد نزول هذه السورة يكثر من قول: سبحان الله وبحمده، أستغفر الله وأتوب إليه، وعلم بها أنه قد أقترب أجله وكان فتح مكة في رمضان سنة ثمان وتوفي صلى الله عليه وسلم في ربيع الأول سنة عشر.","ar.qurtubi":"قوله تعالى : فسبح بحمد ربك واستغفره إنه كان توابا قوله تعالى : فسبح بحمد ربك واستغفره أي إذا صليت فأكثر من ذلك . وقيل : معنى سبح : صل ؛ عن ابن عباس : بحمد ربك أي حامدا له على ما آتاك من الظفر والفتح . [ ص: 206 ] واستغفره أي : سل الله الغفران . وقيل : فسبح المراد به : التنزيه ؛ أي نزهه عما لا يجوز عليه مع شكرك له . واستغفره أي : سل الله الغفران مع مداومة الذكر . والأول أظهر . روى الأئمة ( واللفظ للبخاري ) عن عائشة - رضي الله عنها - قالت : ما صلى رسول الله - صلى الله عليه وسلم - صلاة بعد أن نزلت عليه سورة : إذا جاء نصر الله والفتح ، إلا يقول : سبحانك ربنا وبحمدك ، اللهم اغفر لي وعنها قالت : كان رسول الله - صلى الله عليه وسلم - يكثر أن يقول في ركوعه وسجوده : سبحانك اللهم ربنا وبحمدك ، اللهم اغفر لي . يتأول القرآن .وفي غير الصحيح : وقالت أم سلمة : كان النبي - صلى الله عليه وسلم - آخر أمره لا يقوم ولا يقعد ولا يجيء ولا يذهب إلا قال : \" سبحان الله وبحمده ، أستغفر الله وأتوب إليه - قال - فإني أمرت بها - ثم قرأ - إذا جاء نصر الله والفتح إلى آخرها \" . وقال أبو هريرة : اجتهد النبي بعد نزولها ، حتى تورمت قدماه . ونحل جسمه ، وقل تبسمه ، وكثر بكاؤه . وقال عكرمة : لم يكن النبي - صلى الله عليه وسلم - قط أشد اجتهادا في أمور الآخرة ما كان منه عند نزولها . وقال مقاتل : لما نزلت قرأها النبي - صلى الله عليه وسلم - على أصحابه ، ومنهم أبو بكر وعمر وسعد بن أبي وقاص ، ففرحوا واستبشروا ، وبكى العباس ؛ فقال له النبي - صلى الله عليه وسلم - : \" ما يبكيك يا عم ؟ \" قال : نعيت إليك نفسك . قال : \" إنه لكما تقول \" ؛ فعاش بعدها ستين يوما ، ما رئي فيها ضاحكا مستبشرا .وقيل : نزلت في منى بعد أيام التشريق ، في حجة الوداع ، فبكى عمر والعباس ، فقيل لهما : إن هذا يوم فرح ، فقالا : بل فيه نعي النبي - صلى الله عليه وسلم - . فقال النبي - صلى الله عليه وسلم - : \" صدقتما ، نعيت إلي نفسي \" . وفي البخاري وغيره عن ابن عباس قال : كان عمر بن الخطاب يأذن لأهل بدر ، ويأذن لي معهم . قال : فوجد بعضهم من ذلك ، فقالوا : يأذن لهذا الفتى معنا ومن أبنائنا من هو مثله ، فقال لهم عمر : إنه من قد علمتم . قال : فأذن لهم ذات يوم ، وأذن لي معهم ، فسألهم عن هذه السورة : إذا جاء نصر الله والفتح فقالوا : أمر الله جل وعز نبيه - صلى الله عليه وسلم - إذا فتح عليه أن يستغفره ، وأن يتوب إليه . فقال : ما تقول يا ابن عباس ؟ قلت : ليس كذلك ، ولكن أخبر الله نبيه - صلى الله عليه وسلم - حضور أجله ، فقال : إذا جاء نصر الله والفتح ، فذلك علامة موتك . [ ص: 207 ] فسبح بحمد ربك واستغفره إنه كان توابا . فقال عمر - رضي الله عنه - : تلومونني عليه ؟ وفي البخاري فقال عمر : ما أعلم منها إلا ما تقول . ورواه الترمذي ، قال : كان عمر يسألني مع أصحاب النبي - صلى الله عليه وسلم - ، فقال له عبد الرحمن بن عوف : أتسأله ولنا بنون مثله ؟ فقال له عمر : إنه من حيث نعلم . فسأله عن هذه الآية : إذا جاء نصر الله والفتح . فقلت : إنما هو أجل رسول الله - صلى الله عليه وسلم - ، أعلمه إياه ؛ وقرأ السورة إلى آخرها . فقال له عمر : والله ما أعلم منها إلا ما تعلم . قال : هذا حديث حسن صحيح . فإن قيل : فماذا يغفر للنبي - صلى الله عليه وسلم - حتى يؤمر بالاستغفار ؟ قيل له : كان النبي - صلى الله عليه وسلم - يقول في دعائه : رب اغفر لي خطيئتي وجهلي ، وإسرافي في أمري كله ، وما أنت أعلم به مني . اللهم اغفر لي خطئي وعمدي ، وجهلي وهزلي ، وكل ذلك عندي . اللهم اغفر لي ما قدمت وما أخرت ، وما أعلنت وما أسررت ، أنت المقدم وأنت المؤخر ، إنك على كل شيء قدير . فكان - صلى الله عليه وسلم - يستقصر نفسه لعظم ما أنعم الله به عليه ، ويرى قصوره عن القيام بحق ذلك ذنوبا . ويحتمل أن يكون بمعنى : كن متعلقا به ، سائلا راغبا ، متضرعا على رؤية التقصير في أداء الحقوق ؛ لئلا ينقطع إلى رؤية الأعمال . وقيل : الاستغفار تعبد يجب إتيانه ، لا للمغفرة ، بل تعبدا . وقيل : ذلك تنبيه لأمته ، لكيلا يأمنوا ويتركوا الاستغفار . وقيل : واستغفره أي استغفر لأمتك .إنه كان توابا أي على المسبحين والمستغفرين ، يتوب عليهم ويرحمهم ، ويقبل توبتهم . وإذا كان - عليه السلام - وهو معصوم يؤمر بالاستغفار ، فما الظن بغيره ؟ روى مسلم عن عائشة قالت : كان رسول الله - صلى الله عليه وسلم - يكثر من قول : سبحان الله وبحمده ، أستغفر الله وأتوب إليه . فقال : \" خبرني ربي أني سأرى علامة في أمتي ، فإذا رأيتها أكثرت من قول سبحان الله وبحمده ، أستغفر الله وأتوب إليه ، فقد رأيتها : إذا جاء نصر الله والفتح - فتح مكة - ورأيت الناس يدخلون في دين الله أفواجا فسبح بحمد ربك واستغفره إنه كان توابا \" .وقال ابن عمر : نزلت هذه السورة بمنى في حجة الوداع ؛ ثم نزلت اليوم أكملت لكم دينكم وأتممت عليكم نعمتي [ ص: 208 ] فعاش بعدهما النبي - صلى الله عليه وسلم - ثمانين يوما . ثم نزلت آية الكلالة ، فعاش بعدها خمسين يوما . ثم نزل لقد جاءكم رسول من أنفسكم فعاش بعدها خمسة وثلاثين يوما . ثم نزل واتقوا يوما ترجعون فيه إلى الله فعاش بعدها أحدا وعشرين يوما . وقال مقاتل سبعة أيام . وقيل غير هذا مما تقدم في ( البقرة ) بيانه والحمد لله .\n","ar.miqbas":"فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا (3)وجملة : { فسبح بحمد ربك } جواب { إذا } باعتبار ما تضمنته من معنى الشرط ، وفعل { فسبح } هو العامل في { إذا } النصبَ على الظرفية ، والفاء رابطة للجواب لأنه فعل إنشاء .وقَرن التسبيح بالحمد بباء المصاحبة المقتضية أن التسبيح لاحقٌ للحمد لأن باء المصاحبة بمعنى ( مع ) فهي مثل ( مع ) في أنها تدخل على المتبوع فكان حمد الله على حصول النصر والفتح ودخول الناس في الإِسلام شيئاً مفروغاً منه لا يحتاج إلى الأمر بإيقاعه لأن شأن الرسول صلى الله عليه وسلم أنه قد فعله ، وإنما يحتاج إلى تذكيره بتسبيح خاص لم يحصل من قبل في تسبيحاته وباستغفار خاص لم يحصل من قبل في استغفاره .ويجوز أن يكون التسبيح المأمور به تسبيحَ ابتهاج وتعجب من تيسير الله تعالى له ما لا يخطر ببال أحد أن يتم له ذلك ، فإن سبحان الله ونحوه يستعمل في التعجب كقول الأعشى: ... قد قلتُ لما جاءني فخرُهسبحانَ من علقمةَ الفاخِر ... وفي تقديم الأمر بالتسبيح والحمد على الأمر بالاستغفار تمهيد لإجابة استغفاره على عادة العرب في تقديم الثناء قبل سؤال الحاجة كما قال ابن أبي الصلت: ... إذا أثنى عليك المرء يوماًكفاه عن تعرضه الثناء ... فإن رسول الله صلى الله عليه وسلم لم يكن يخلو عن تسبيح الله فأريد تسبيح يقارن الحمد على ما أعطيه من النصر والفتح ودخول الأمة في الإِسلام .وعطف الأمر باستغفار الله تعالى على الأمر بالتسبيح مع الحمد يقتضي أنه من حَيِّز جواب { إذا } ، وأنه استغفار يحصل مع الحمد مثل ما قرر في { فسبح بحمد ربك } فيدل على أنه استغفار خاص لأن الاستغفار الذي يعم طلب غفران التقصير ونحوه مأمور به من قبل وهو من شأن النبي صلى الله عليه وسلم فقد قال : \" إنه لَيُغَانَ على قلْبي فأستغفر اللَّه في اليوم والليلة مائة مرة \" فكان تعليق الأمر بالتسبيح وبالاستغفار على حصول النصر والفتح إيماءً إلى تسبيح واستغفار يحصل بهما تقرب لم يُنْو من قبل ، وهو التهيّؤ للقاء الله ، وأن حياته الدنيوية أوشكت على الانتهاء ، وانتهاء أعمال الطاعات والقربات التي تزيد النبي صلى الله عليه وسلم في رفع درجاته عند ربه فلم يبق إلا أن يسأل ربه التجاوز عما يعرض له من اشتغال ببعض الحظوظ الضرورية للحياة أو من اشتغال بمهم من أحوال الأمة يفوته بسببه أمر آخر هو أهم منه ، مثل فِداء أسرى بدر مع فوات مصلحة استئصالهم الذي هو أصلح للأمة فعوتِبَ عليه رسول الله صلى الله عليه وسلم بقوله تعالى : { ما كان لنبيء أن يكون له أسرى } [ الأنفال : 67 ] الآية ، أو من ضرورات الإِنسان كالنوم والطعام التي تنقص من حالة شبهه بالملائكة الذين يسبحون الليل والنهار لا يفترون ، فكان هذا إيذاناً باقتراب وفاة رسول الله صلى الله عليه وسلم بانتقاله من حياة تحمل أعباء الرسالة إلى حياة أبدية في العلويات الملكية .والكلام من قبيل الكناية الرمزية وهي لا تنافي إرادة المعنى الصريح بأن يحمل الأمر بالتسبيح والاستغفار على معنى الإِكثار من قول ذلك . وقد دل ذوق الكلام بعضَ ذوي الأفهام النافذة من الصحابة على هذا المعنى وغاصت عليه مثل أبي بكر وعمر والعباس وابنه عبد الله وابن مسعود ، فعن مقاتل : \" لما نزلت قرأها النبي صلى الله عليه وسلم على أصحابه ففرحوا واستبشروا وبكى العباس فقال له النبي صلى الله عليه وسلم ما يبكيك يا عم؟ قال : نُعيتْ إليك نفسك . فقال : إنه لكَما تقول \" . وفي رواية : \" نزلت في منى فبكى عمر والعباس فقيل لهما ، فقالا : فيه نُعي رسول الله فقال النبي صلى الله عليه وسلم صدقتما نُعِيَتْ إليّ نفسي \" .وفي «صحيح البخاري» وغيره عن ابن عباس : «كان عمر يأذن لأهل بدر ويأذن لي معهم فوجد بعضهم من ذلك ، فقال لهم عمر : إنه مَن قد علمتم . قال : فأذن لهم ذات يوم وأذن لي معهم ، فسألهم عن هذه السورة : { إذا جاء نصر الله والفتح } فقالوا : أمر الله نبيئه إذا فتح عليه أن يستغفره ويتوب إليه فقال : ما تقول يا ابن عباس؟ قلت : ليس كذلك ولكن أخبر الله نبيئه حضور أجله فقال : { إذا جاء نصر الله والفتح } ، فذلك علامة موتك؟ فقال عمر : ما أعلم منها إلا ما تقول» فهذا فهم عمر والعباس وعبد الله ابنه .وقال في «الكشاف» : روي أنه لما نزلت خطب رسول الله صلى الله عليه وسلم فقال : \" إن عبداً خيّره الله بين الدنيا وبين ما عند الله فاختار ما عند الله عز وجل . فعلم أبو بكر فقال : فديناك بأنفسنا وأموالنا وآبائنا وأولادنا \" اه .قال ابن حجر في «تخريج أحاديث الكشاف» : الحديث متفق عليه إلا صدره دون أوله من كونه كان عند نزول السورة ا ه . ويحتمل أن يكون بكاء أبي بكر تكرر مرتين أولاهما عند نزول سورة النصر كما في رواية «الكشاف» والثانية عند خطبة النبي صلى الله عليه وسلم في مرضه .وعن ابن مسعود أن هذه السورة «تسمى سورة التوديع» أي لأنهم علموا أنها إيذان بقرب وفاة رسول الله صلى الله عليه وسلموتقديم التسبيح والحمد على الاستغفار لأن التسبيح راجع إلى وصف الله تعالى بالتنزه عن النقص وهو يجمع صفات السلب ، فالتسبيح متمحض لجانب الله تعالى ، ولأن الحمد ثناء على الله لإنعامه ، وهو أداء العبد ما يجب عليه لشكر المنعم فهو مستلزم إثبات صفات الكمال لله التي هي منشأ إنعامه على عبده فهو جامع بين جانب الله وحظ العبد ، وأما الاستغفار فهو حظ للعبد وحده لأنه طلبه اللَّه أن يعفو عما يؤاخذه عليه .ومقتضى الظاهر أن يقول : فسبح بحمده ، لتقدم اسم الجلالة في قوله : { إذا جاء نصر اللَّه } فعدل عن الضمير إلى الاسم الظاهر وهو { ربك } لما في صفة ( رب ) وإضافتها إلى ضمير المخاطب من الإِيماء إلى أن من حكمة ذلك النصر والفتح ودخول الناس في الإِسلام نعمةً أنعم الله بها عليه إذا حصل هذا الخير الجليل بواسطته فذلك تكريم له وعناية به وهو شأن تلطف الرب بالمربوب ، لأن معناه السيادة المرفوقة بالرفق والإِبلاغ إلى الكمال .وقد انتهى الكلام عند قوله : { واستغفره } . وقد روي : «أن النبي صلى الله عليه وسلم كان في قراءته يقف عند { واستغفره } ثم يكمل السورة» .{ واستغفره إِنَّهُ كَانَ } .تذييل للكلام السابق كله وتعليل لما يقتضي التعليل فيه من الأمر باستغفار ربه باعتبار الصريح من الكلام السابق كما سيتبين لك .وتوّاب : مثال مبالغة من تاب عليه . وفعل تاب المتعدي بحرف ( على ) يطلق بمعنى : وفّق للتوبة ، أثبته في «اللسان» و«القاموس» ، وهذا الإِطلاق خاص بما أسند إلى الله .وقد اشتملت الجملة على أربع مؤكدات هي : إنّ ، وكانَ ، وصيغة المبالغة في التوّاب ، وتنوين التعظيم فيه .وحيث كان توكيد ب ( إنَّ ) هنا غير مقصودٍ به ردُّ إنكار ولا إزالة تردد إذ لا يفرضان في جانب المخاطب صلى الله عليه وسلم فقد تمحض ( إنَّ ) لإفادة الاهتمام بالخبر بتأكيده .وقد تقرر أن من شأن ( إنَّ ) إذا جاءت على هذا الوجه أن تغني غَناء فاء الترتيب والتسبب وتفيد التعليل وربط الكلام بما قبله كما تفيده الفاء ، وقد تقدم غير مرة ، منها عند قوله تعالى : { إنك أنت العليم الحكيم } في سورة [ البقرة : 32 ] ، فالمعنى : هو شديد القبول لتوبة عباده كثير قبوله إياها .وإذ قد كان الكلام تذييلاً وتعليلاً للكلام السابق تعين أن حذف متعلق { تواباً } يُقدر بنحو : على التائبين . وهذا المقدر مراد به العموم ، وهو عموم مخصوص بالمشيئة تخصصه أدلة وصف الربوبية ، ولما ذكر دليل العموم عَقب أمرِه بالاستغفار أفاد أنه إذا استغفره غفر له دلالة تقتضيها مستتبعات التراكيب ، فأفادت هذه الجملة تعليل الأمر بالاستغفار لأن الاستغفار طلب لغفر ، فالطالب يترقب إجابة طلبه ، وأما ما في الجملة من الأمر بالتسبيح والحمد فلا يحتاج إلى تعليل لأنهما إنشاء تنزيه وثناء على الله .ومن وراء ذلك أفادت الجملة إشارة إلى وعدٍ بحسن القبول عند الله تعالى حينما يقدم على العالم القدسي ، وهذا معنى كنائي لأن من عُرف بكثرة قبول توبة التائبين شأنه أن يكرم وفادة الوافدين الذين سَعوْا جهودهم في مرضاته بمنتهى الاستطاعة ، أو هو مجاز بعلاقة اللزوم العرفي لأن منتهى ما يخافه الأحبة عند اللقاء مرارة العتاب ، فالإِخبار بأنه توّاب اقتضى أنه لا يخاف عتاباً .فهذه الجملة بمدلولها الصريح ومدلولها الكنائي أو المجازي ومستتبعاتها تعليل لما تضمنته الجملة التي قبلها من معنى صريح أو كنائي يناسبه التعليل بالتسبيح والحمد باعتبارهما تمهيداً للأمر بالاستغفار كما تقدم آنفاً لا يحتاجان إلى التعليل ، أو يغني تعليل الممهد له بهما عن تعليلهما ولكنهما باعتبار كونهما رمزاً إلى مداناة وفاة رسول الله صلى الله عليه وسلم يكون ما في قوله : { إنه كان تواباً } من الوعد بحسن القبول تعليلاً لمدلولهما الكنائي ، وأما الأمر بالاستغفار فمناسبة التعليل له بقوله : { إنه كان تواباً } ناهضة باعتبار كلتا دلالتيه الصريحة والكنائيّة ، أي إنه متقبل استغفارك ومتقبلك بأحسن قبول ، شأنَ من عهد من الصفح والتكرم .وفعل { كان } هنا مستعمل في لازم معنى الاتصاف بالوصف في الزمن الماضي . وهو أن هذا الوصف ذاتي له لا يتخلف معموله عن عباده فقد دل استقراء القرآن على إخبار الله عن نفسه بذلك من مبدأ الخليقة قال تعالى : { فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم } [ البقرة : 37 ] .ومقتضى الظاهر أن يقال : إنه كان غفّاراً ، كما في آية : { فقلت استغفروا ربكم إنه كان غفاراً } [ نوح : 10 ] فيُجرى الوصف على ما يناسب قوله : { واستغفره } ، فعُدل عن ذلك تلطفاً مع النبي صلى الله عليه وسلم بأنَّ أمره بالاستغفار ليس مقتضياً إثبات ذنب له لما علمت آنفاً من أن وصف ( تواب ) جاء من تاب عليه الذي يستعمل بمعنى وفقه للتوبة إيماء إلى أن أمره بالاستغفار إرشاد إلى مقام التأدب مع الله تعالى ، فإنه لا يُسأل عما يفعل بعباده ، لولا تفضله بما بيَّن لهم من مراده ، ولأن وصف ( توّاب ) أشد ملاءمة لإقامة الفاصلة مع فاصلة { أفواجاً } لأن حرف الجيم وحرف الباء كليهما حرف من الحروف الموصوفة بالشدة ، بخلاف حرف الراء فهو من الحروف التي صفتها بين الشدة والرِّخوة .وروي في «الصحيح» عن عائشة قالت : «ما صلى رسول الله صلى الله عليه وسلم صلاةً بعد أن نزلت عليه سورة : { إذا جاء نصر الله والفتح } إلا يقول : \" سبحانك ربّنا وبحمدك ، اللهم اغفر لي يتأول القرآن \" أي يتأول الأمر في قوله : { فسبح بحمد ربك واستغفره } على ظاهره كما تأوله في مقام آخر على معنى اقتراب أجله صلى الله عليه وسلم\n","ar.waseet":"وقوله ( فَسَبِّحْ ) جواب إذا والمعنى : إذا أتم الله - عليك - أيها الرسول الكريم - وعلى أصحابك النصر ، وصارت لكم الكلمة العليا على أعدائكم ، وفتح لكم مكة ، وشاهدت الناس يدخلون فى دين الإِسلام ، جماعات ثم جماعات كثيرة بدون قتال يذكر .إذا علمت ورأيت كل ذلك ، فداوم وواظب على تسبيح ربك ، وتنزيهه عن كل ما لا يليق به شكرا له على نعمه ، وداوم - أيضا - على طلب مغفرته لك وللمؤمنين .( إنه ) عز وجل - ( كان ) وما زال ( توابا ) أى : كثير القبول لتوبة عباده التائبين إليه ، كما قال - سبحانه - : ( وَهُوَ الذي يَقْبَلُ التوبة عَنْ عِبَادِهِ وَيَعْفُواْ عَنِ السيئات وَيَعْلَمُ مَا تَفْعَلُونَ ) نسأل الله - تعالى - أن يجعلنا من عباده التائبين توبة صادقة نصوحا .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"( فسبح بحمد ربك واستغفره إنه كان توابا ) فإنك حينئذ لاحق به .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا أبو النعمان ، حدثنا أبو عوانة عن أبي بشر ، عن سعيد بن جبير عن ابن عباس قال : كان عمر يدخلني مع أشياخ بدر قال بعضهم : لم تدخل هذا الفتى معنا ولنا أبناء مثله ؟ فقال : إنه ممن قد علمتم ، قال : فدعاهم ذات يوم ودعاني معهم ، قال : وما رأيته دعاني يومئذ إلا ليريهم مني ، فقال : ما تقولون في قوله : \" إذا جاء نصر الله والفتح \" حتى ختم السورة ؟ فقال بعضهم : أمرنا أن نحمد الله ونستغفره إذا جاء نصرنا وفتح علينا ، وقال بعضهم : لا ندري ، ولم يقل بعضهم شيئا ، فقال لي : يا ابن عباس أكذلك تقول ؟ قلت : لا قال : فما تقول ؟ قلت : هو أجل رسول الله - صلى الله عليه وسلم - أعلمه به ، \" إذا جاء نصر الله والفتح \" فتح مكة ، فذلك علامة أجلك \" فسبح بحمد ربك واستغفره إنه كان توابا \" ، فقال عمر : ما أعلم منها إلا ما تعلم .أخبرنا عبد الواحد بن أحمد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثني عثمان بن أبي شيبة ، حدثنا جرير عن منصور عن أبي الضحى عن مسروق ، عن عائشة رضي الله تعالى عنها قالت : كان رسول الله - صلى الله عليه وسلم - يكثر أن يقول في ركوعه وسجوده : \" سبحانك اللهم ربنا وبحمدك ، اللهم اغفر لي \" يتأول القرآن .أخبرنا إسماعيل بن عبد القاهر ، أخبرنا عبد الغافر بن محمد بن عيسى الجلودي ، حدثنا إبراهيم بن محمد بن سفيان ، حدثنا مسلم بن الحجاج ، حدثنا محمد بن المثنى ، حدثني عبد الأعلى ، حدثنا داود عن عامر ، عن مسروق ، عن عائشة ; قالت : كان رسول الله - صلى الله عليه وسلم - يكثر من قول : \" سبحان الله وبحمده أستغفر الله وأتوب إليه \" ، [ قالت : فقلت : يا رسول الله ، أراك تكثر من قول : \" سبحان الله وبحمده ، أستغفر الله وأتوب إليه ؟ فقال : أخبرني ربي أني سأرى علامة في أمتي ، فإذا رأيتها أكثر من قول : سبحان الله وبحمده ، أستغفر الله وأتوب إليه ، فقد رأيتها : \" إذا جاء نصر الله والفتح \" . فالفتح : فتح مكة ، \" ورأيت الناس يدخلون في دين الله أفواجا فسبح بحمد ربك واستغفره إنه كان توابا \" . \" ]قال ابن عباس : لما نزلت هذه السورة علم النبي - صلى الله عليه وسلم - أنه نعيت إليه نفسه .قال الحسن : أعلم أنه قد اقترب أجله فأمر بالتسبيح والتوبة ، ليختم له بالزيادة في العمل الصالح .قال قتادة ومقاتل : عاش النبي - صلى الله عليه وسلم - بعد نزول هذه السورة سنتين .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6216.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6216.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6216.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":24,"letters":184,"size":"49KB","priority":3,"commonlyRead":false}}