{"chapter":111,"name":{"arabic":"سورة 111","transliteration":"Chapter 111","translation":"Chapter 111","revelation":"unknown"},"revelation":"unknown","verses":5,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ","transliteration":"Tab bat yadaa abee Lahabinw-wa tabb","translations":{"en.ahmedali":"DESTROYED WILL BE the hands of Abu Lahab, and he himself will perish.","en.ahmedraza":"May both the hands of Abu Lahab be destroyed – and they are destroyed!","en.arberry":"Perish the hands of Abu Lahab, and perish he!","en.asad":"DOOMED are the hands of him of the glowing countence: and doomed is he!","en.daryabadi":"Perish the two hands of Abu Lahab, and perish he!","en.hilali":"Perish the two hands of Abu Lahab (an uncle of the Prophet), and perish he!","en.pickthall":"The power of Abu Lahab will perish, and he will perish.","en.qaribullah":"Perish the hands of AbiLahab, and perish he!","en.sahih":"May the hands of Abu Lahab be ruined, and ruined is he.","en.sarwar":"May the hands of Abu Lahab perish!","en.yusufali":"Perish the hands of the Father of Flame! Perish he!","en.maududi":"Destroyed were the hands of Abu Lahab, and he lay utterly doomed.","en.shakir":"Perdition overtake both hands of Abu Lahab, and he will perish.","en.itani":"Condemned are the hands of Abee Lahab, and he is condemned.","en.mubarakpuri":"Perish the two hands of Abu Lahab and perish he!","en.qarai":"Perish the hands of Abu Lahab, and perish he!","en.wahiduddin":"May the hands of Abu Lahab perish, may he be ruined."},"tafsir":{"ar.muyassar":"خسرت يدا أبي لهب وشقي بإيذائه رسول الله محمدا صلى الله عليه وسلم، وقد تحقق خسران أبي لهب.","ar.jalalayn":"لما دعا النبي صلى الله عليه وسلم قومه وقال: إني نذير لكم بين يدي عذاب شديد، فقال عمه أبو لهب: تبًا لك ألهذا دعوتنا، نزل «تبت» خسرت «يدا أبي لهب» أي جملته وعبر عنها باليدين مجازًا لأن أكثر الأفعال تزاول بهما، وهذه الجملة دعاء «وتبَّ» خسر هو، وهذه خبر كقولهم: أهلكه الله وقد هلك، ولما خوَّفه النبي بالعذاب، فقال: إن كان ابن أخي حقاً فإني أفتدي منه بمالي وولدي نزل: «ما أغنى عنه ماله وما كسب».","ar.qurtubi":"سورة تبتوهي مكية بإجماع . وهي خمس آياتبسم الله الرحمن الرحيمتبت يدا أبي لهب وتبفيه ثلاث مسائل :الأولى : قوله تعالى : تبت يدا أبي لهب في الصحيحين وغيرهما ( واللفظ لمسلم ) عن ابن عباس قال : لما نزلت وأنذر عشيرتك الأقربين ( ورهطك منهم المخلصين ) ، خرج رسول الله - صلى الله عليه وسلم - حتى صعد الصفا ، فهتف : يا صباحاه ! فقالوا : من هذا الذي يهتف ؟ قالوا محمد . فاجتمعوا إليه . فقال : يا بني فلان ، يا بني فلان ، يا بني فلان ، يا بني عبد مناف ، يا بني عبد المطلب فاجتمعوا إليه . فقال : أرأيتكم لو أخبرتكم أن خيلا تخرج بسفح هذا الجبل أكنتم مصدقي ؟ قالوا : ما جربنا عليك كذبا . قال : فإني نذير لكم بين يدي عذاب شديد . فقال أبو لهب : تبا لك ، أما جمعتنا إلا لهذا ! ثم قام ، فنزلت هذه السورة : [ ص: 210 ] تبت يدا أبي لهب وقد تب كذا قرأ الأعمش إلى آخر السورة . زاد الحميدي وغيره : فلما سمعت امرأته ما نزل في زوجها وفيها من القرآن ، أتت رسول الله - صلى الله عليه وسلم - وهو جالس في المسجد عند الكعبة ، ومعه أبو بكر - رضي الله عنه - ، وفي يدها فهر من حجارة ، فلما وقفت عليه أخذ الله بصرها عن رسول الله - صلى الله عليه وسلم - ، فلا ترى إلا أبا بكر . فقالت : يا أبا بكر ، إن صاحبك قد بلغني أنه يهجوني ، والله لو وجدته لضربت بهذا الفهر فاه ، والله إني لشاعرة :مذمما عصينا وأمره أبينا     ودينه قليناثم انصرفت . فقال أبو بكر : يا رسول الله ، أما تراها رأتك ؟ قال : \" ما رأتني ، لقد أخذ الله بصرها عني \" . وكانت قريش إنما تسمي رسول الله - صلى الله عليه وسلم - مذمما ؛ يسبونه ، وكان يقول : \" ألا تعجبون لما صرف الله عني من أذى قريش ، يسبون ويهجون مذمما وأنا محمد \" . وقيل : إن سبب نزولها ما حكاه عبد الرحمن بن زيد أن أبا لهب أتى النبي - صلى الله عليه وسلم - فقال : ماذا أعطى إن آمنت بك يا محمد ؟ فقال : \" كما يعطى المسلمون \" قال ما لي عليهم فضل ؟ . قال : \" وأي شيء تبغي \" ؟ قال : تبا لهذا من دين ، أن أكون أنا وهؤلاء سواء ؛ فأنزل الله تعالى فيه . تبت يدا أبي لهب وتب .وقول ثالث حكاه عبد الرحمن بن كيسان قال : كان إذا وفد على النبي - صلى الله عليه وسلم - وقد انطلق إليهم أبو لهب فيسألونه عن رسول الله - صلى الله عليه وسلم - ويقولون له : أنت أعلم به منا . فيقول لهم أبو لهب : إنه كذاب ساحر . فيرجعون عنه ولا يلقونه . فأتى وفد ، ففعل معهم مثل ذلك ، فقالوا : لا ننصرف حتى نراه ، ونسمع كلامه . فقال لهم أبو لهب : إنا لم نزل نعالجه فتبا له وتعسا . فأخبر بذلك رسول الله - صلى الله عليه وسلم - فاكتأب لذلك ؛ فأنزل الله تعالى : تبت يدا أبي لهب . . . السورة . وقيل : إن أبا لهب أراد أن يرمي النبي - صلى الله عليه وسلم - بحجر ، فمنعه الله من ذلك ، وأنزل الله تعالى : تبت يدا أبي لهب وتب للمنع الذي وقع به . ومعنى تبت : خسرت ؛ قال قتادة . وقيل : خابت ؛ قال ابن عباس . وقيل : ضلت ؛ قاله عطاء . وقيل : هلكت ؛ قاله ابن جبير . وقال يمان بن رئاب : صفرت من كل خبر . حكى الأصمعي عن أبي عمرو بن العلاء أنه لما قتل عثمان - رحمه الله - سمع الناس هاتفا يقول :لقد خلوك وانصرفوا     فما أبوا ولا رجعواولم يوفوا بنذرهم     فيا تبا لما صنعواوخص اليدين بالتباب ، لأن العمل أكثر ما يكون بهما ؛ أي خسرتا وخسر هو . وقيل : [ ص: 211 ] المراد باليدين نفسه . وقد يعبر عن النفس باليد ، كما قال الله تعالى : بما قدمت يداك . أي نفسك . وهذا مهيع كلام العرب ؛ تعبر ببعض الشيء عن كله ؛ تقول : أصابته يد الدهر ، ويد الرزايا والمنايا ؛ أي أصابه كل ذلك . قال الشاعر :لما أكبت يد الرزايا     عليه نادى ألا مجيروتب قال الفراء : التب الأول : دعاء والثاني خبر ؛ كما يقال : أهلكه الله وقد هلك . وفي قراءة عبد الله وأبي وقد تب وأبو لهب اسمه عبد العزى ، وهو ابن عبد المطلب عم النبي - صلى الله عليه وسلم - . وامرأته العوراء أم جميل ، أخت أبي سفيان بن حرب ، وكلاهما كان شديد العداوة للنبي - صلى الله عليه وسلم - .قال طارق بن عبد الله المحاربي : إني بسوق ذي المجاز ، إذ أنا بإنسان يقول : \" يأيها الناس ، قولوا لا إله إلا الله تفلحوا \" ، وإذا رجل خلفه يرميه ، قد أدمى ساقيه وعرقوبيه ويقول : يأيها الناس ، إنه كذاب فلا تصدقوه . فقلت من هذا ؟ فقالوا : محمد ، زعم أنه نبي . وهذا عمه أبو لهب يزعم أنه كذاب . وروى عطاء عن ابن عباس قال : قال أبو لهب : سحركم محمد إن أحدنا ليأكل الجذعة ، ويشرب العس من اللبن فلا يشبع ، وإن محمدا قد أشبعكم من فخذ شاة ، وأرواكم من عس لبن .الثانية : قوله تعالى : أبي لهب قيل : سمي باللهب لحسنه ، وإشراق وجهه . وقد ظن قوم أن في هذا دليلا على تكنية المشرك ؛ وهو باطل ، وإنما كناه الله بأبي لهب - عند العلماء - لمعان أربعة :الأول : أنه كان اسمه عبد العزى ، والعزى : صنم ، ولم يضف الله في كتابه العبودية إلى صنم .الثاني : أنه كان بكنيته أشهر منه باسمه ؛ فصرح بها .الثالث : أن الاسم أشرف من الكنية ، فحطه الله - عز وجل - عن الأشرف إلى الأنقص ؛ إذا لم يكن بد من الإخبار عنه ، ولذلك دعا الله تعالى الأنبياء بأسمائهم ، ولم يكن عن أحد منهم . ويدلك على شرف الاسم على الكنية : أن الله تعالى يسمى ولا يكنى ، وإن كان ذلك لظهوره وبيانه ؛ واستحالة نسبة الكنية إليه ، لتقدسه عنها .الرابع : أن الله تعالى أراد أن يحقق نسبته ، بأن يدخله النار ، فيكون أبا لها ، تحقيقا للنسب ، وإمضاء للفأل والطيرة التي اختارها لنفسه . وقد قيل : اسمه كنيته . فكان أهله يسمونه ( أبا لهب ) ، لتلهب وجهه وحسنه ؛ فصرفهم الله عن أن يقولوا : أبو [ ص: 212 ] النور ، وأبو الضياء ، الذي هو المشترك بين المحبوب والمكروه ، وأجرى على ألسنتهم أن يضيفوه إلى ( لهب ) الذي هو مخصوص بالمكروه المذموم ، وهو النار . ثم حقق ذلك بأن يجعلها مقره . وقرأ مجاهد وحميد وابن كثير وابن محيصن . ( أبي لهب ) بإسكان الهاء . ولم يختلفوا في ( ذات لهب ) إنها مفتوحة ؛ لأنهم راعوا فيها رءوس الآي .الثالثة : قال ابن عباس : لما خلق الله - عز وجل - القلم قال له : اكتب ما هو كائن ، وكان فيما كتب تبت يدا أبي لهب . وقال منصور : سئل الحسن عن قوله تعالى : تبت يدا أبي لهب . هل كان في أم الكتاب ؟ وهل كان أبو لهب يستطيع ألا يصلى النار ؟ فقال : والله ما كان يستطيع ألا يصلاها ، وإنها لفي كتاب الله من قبل أن يخلق أبو لهب وأبواه . ويؤيده قول موسى لآدم : أنت الذي خلقك الله بيده ، ونفخ فيك من روحه ، وأسكنك جنته ، وأسجد لك ملائكته ، خيبت الناس ، وأخرجتهم من الجنة . قال آدم : وأنت موسى الذي اصطفاك بكلامه ، وأعطاك التوراة ، تلومني على أمر كتبه الله علي قبل أن يخلق الله السماوات والأرض . قال النبي - صلى الله عليه وسلم - : فحج آدم موسى . وقد تقدم هذا .وفي حديث همام عن أبي هريرة أن آدم قال لموسى : \" بكم وجدت الله كتب التوراة قبل أن يخلقني \" ؟ قال : بألفي عام قال : فهل وجدت فيها : وعصى آدم ربه فغوى قال : نعم قال : أفتلومني على أمر وكتب الله علي أن أفعله من قبل أن أخلق بألفي عام . فحج آدم موسى \" . وفي حديث طاوس وابن هرمز والأعرج عن أبي هريرة : \" بأربعين عاما \" .\n","ar.miqbas":"تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ (1)افتتاح السورة بالتبات مشعر بأنها نزلت لتوبيخ ووعيد ، فذلك براعة استهلال مثل ما تفتتح أشعار الهجاء بما يؤذن بالذم والشتم ومنه قوله تعالى : { ويل للمطففين } [ المطففين : 1 ] إذ افتتحت السورة المشتملة على وعيد المطففين للفظ الويل ومن هذا القبيل قول عبد الرحمان بن الحكم من شعراء «الحماسة» : ... لَحَا الله قَيْساً قَيسَ عَيلان إنهاأضاعت ثُغور المسلمين وولَّتِ ... وقول أبي تمام في طالعةِ هجاء: ... النارُ والعارُ والمكروه والعطبومنه أخذ أبو بكر بن الخازن قوله في طالع قصيدة هناء بمولد: ... مجشري فقد أنجز الإِقبال ما وعدوالتَّبُّ : الخسران والهلاك ، والكلام دعاء وتقريع لأبي لهب دافع الله به عن نبيئه بمثل اللفظ الذي شَتَم به أبو لهب محمداً صلى الله عليه وسلم جزاءً وفاقاً .وإسناد التبّ إلى اليدين لِما روي من أن أبا لهب لما قال للنبيء : «تباً لك سائرَ اليوم ألهذا جمعتنا» أخذ بيده حجراً ليرميه به . وروي عن طارق المحاربي قال : «بينا أنا بسوق ذي المجاز إذا أنا برجل حديث السن يقول : أيها الناس قولوا : لا إله إلا الله تفلحوا ، وإذا رجل خلفَه يرميه قد أدمى ساقيه وعرقوبيه ويقول : «يا أيها الناس إنه كذاب فلا تصدقوه» . فقلت : من هذا؟ فقالوا : هذا محمد يزعم أنه نبيء ، وهذا عمه أبو لهب ، فوقع الدعاء على يديه لأنهما سبب أذى النبي صلى الله عليه وسلم كما يقال للذي يتكلم بمكروه : «بفيك الحجارة أو بفيك الكثكث» .وقول النابغة: ... قعود الذي أبياتهم يثمدونهمرمى الله في تلك الأكف الكوانع ... ويقال بضد ذلك للذي يقول كلاماً حسناً : لا فُضَّ فُوك ، وقال أعرابي من بني أسد: ... دَعَوْتُ لِمَا نابنِي مِسْوَراًفلبَّى فلبَّيْ يَديْ مِسْورِ ... لأنه دعاه لِما نابه من العدوِّ للنَّصر ، والنصر يكون بعمل اليد بالضرب أو الطعن .وأبو لهب : هو عبد العزى بن عبد المطلب وهو عمّ النبي صلى الله عليه وسلم وكنيته أبو عتبة تكنية باسم ابنه ، وأمّا كنيته بأبي لهب في الآية فقيل : كان يكنّى بذلك في الجاهلية ( لحسنه وإشراققِ وجهه ) وأنه اشتهر بتلك الكنية كما اقتضاه حديث طارق المحاربي ، ومثله حديث عن ربيعة بن عباد الديلي في «مسند أحمد» ، فسماه القرآن بكنيته دون اسمه لأن في اسمه عبادة العزى ، وذلك لا يُقره القرآن ، أو لأنه كان بكنيته أشهر منه باسمه العَلَممِ ، أو لأن في كنيته ما يتأتى به التوجيه بكونه صائراً إلى النار ، وذلك كناية عن كونه جهنمياً ، لأن اللهب ألسنةُ النار إذا اشتعلت وزال عنها الدخان . والأبُ : يطلق على ملازم ما أضيف إليه كقولهم : «أبوها وَكيَّالها» وكما كني إبراهيم عليه السلام : أبا الضيفان وكنَّى النبي صلى الله عليه وسلم عبدَ الرحمان بن صَخْر الدَّوْسي : أبا هريرة لأنه حمل هِرَّةً في كم قميصه ، وكُني شهرُ رمضان : أبَا البَركات ، وكني الذئب : أبا جَعدةٍ والجعدة سخلة المعز لأنه يلازم طلبها لافتراسها ، فكانت كنية أبي لهب صالحة موافقة لحاله من استحقاقه لهب جهنم فصار هذا التوجيه كناية عن كونه جهنمياً لينتقل من جعل أبي لهب بمعنى ملازم اللهب إلى لازم تلك الملازمة في العرف ، وهو أنه من أهل جهنم وهو لزوم ادعائي مبني على التفاؤل بالأسماء ونحوها كما أشار إليه التفتزاني في مبحث العَلَمِيَّة من «شرح المفتاح» وأنشد قول الشاعر: ... قصدت أبا المحاسن كي أراهلشوق كان يجذبني إليه ... فلما أن رأيتُ رأيت فرداًولم أر من بنيه ابنا لديه ... وقد يكون أبو لهب كنيته الحطب كما أنبأ عنه ما روي عن أبي هريرة : \" إن ابنة أبي لهب قالت للنبيء صلى الله عليه وسلم إن الناس يصيحون بي ويقولون إني ابنةُ حطب النار \" الحديث .وقرأ الجمهور لفظ { لهب } بفتح الهاء ، وقرأه ابن كثير بسكون الهاء وهو لغة لأنهم كثيراً ما يسكنون عين الكلمة المتحركة مع الفاء ، وقد يكون ذلك لأن { لهب } صار جزءَ عَلَم والعرب قد يغيرون بعض حركات الاسم إذا نقلوه إلى العلمية كما قالوا : شُمْس بضم الشين ، لشَمْس بن مالك الشاعر الذي ذكره تأبط شراً في قوله: ... إنّي لمُهْدٍ من ثَنائِي فقاصدبه لابن عَمِّ الصدققِ شُمْس بننِ مالك ... قال أبو الفتح بن جنّيّ في كتاب «إعراب الحماسة» : «يجوز أن يكون ضم الشين على وجه تغيير الأعلام نحو مَعدِ يكرب . وتَهْلُك ومَوْهَب وغير ذلك مما غُيِّر عن حال نظائره لأجل العلمية الحادثة فيه اه .وكما قالوا : أبو سُلْمى بضم السين كُنية والدِ زهير بن أبي سُلمى لأنهم نقلوا اسم سَلمى بفتح السين من أسماء النساء إلى جعله اسم رجل يكنى به لأنهم لا يكنون بأسماء النساء غالباً . ولذلك لم يسكن ابن كثير الهاء من قوله تعالى : { ذات لهب } وقراءةُ ابن كثير قراءة أهل مكة فلعل أهل مكة اشتهرت بينهم كنية أبي لهب بسكون الهاء تحقيقاً لكثرة دورانها على الألسنة في زمانه .وجملة : { وتب } إما معطوفة على جملة : { تبت يدا أبي لهب } عطف الدعاء على الدعاء إذا كان إسناد التبات إلى اليدين لأنهما آلة الأذى بالرمي بالحجارة كما في خبر طارق المحاربي ، فأعيد الدعاء على جميعه إغلاظاً له في الشتم والتقريع ، وتفيدُ بذلك تأكيداً لجملة : { تبت يدا أبي لهب } لأنها بمعناها ، وإنما اختلفتا بالكلية والجزئية ، وذلك الاختلاف هو مقتضِي عطفها ، وإلا لكان التوكيد غير معطوف لأن التوكيد اللفظي لا يعطف بالواو كما تقدم في سورة الكافرون .وإمّا أن تكون في موضع الحال ، والواو واوَ الحال ولا تكون دعاء إنما هي تحقيق لحصول ما دُعي عليه به كقول النابغة: ... جَزَى ربُّه عني عديَّ بن حاتمجَزَاء الكلاب العاويات وقَدْ فَعَلْ ... فيكون الكلام قبله مستعملاً في الذم والشماتة به أو لطلب الازدياد ، ويؤيد هذا الوجه قراءة عبد الله بن مسعود «وقد تَب» فيتمحض الكلام قبله لمعنى الذم والتحقير دون معنى طلب حصول التبات له ، وذلك كقول عبد الله بن رواحة حين خروجه إلى غزوة مُؤتة التي استشهد فيها: ... حتَّى يقولوا إذا مَرُّوا على جَدثيأرْشَدَك اللَّهُ من غَازٍ وقَدْ رَشِدا ... يعني ويقولوا : وقد رشدا ، فيصير قوله : أرشدك الله من غازٍ ، لمجرد الثناء والغبطة بما حصّله من الشهادة .\n","ar.waseet":"معنى ( تَبَّتْ ) هلكت وخسرت ، ومنه قوله - تعالى - : ( وَمَا كَيْدُ فِرْعَوْنَ إِلاَّ فِي تَبَابٍ ) - سبحانه - : ( وَمَا زَادُوهُمْ غَيْرَ تَتْبِيبٍ ) وقوله : ( وَتَبَّ ) أى : وقد تب وهلك وخسر ، فالجملة الأولى دعاء عليك بالهلاك والخسران ، والجملة الثانية : إخبار عن أن هذا الدعاء قد استجيب ، وأن الخسران قد نزل به فعلا .أى : خسرت وخابت يدا أبى لهب ، وقد نزل هذا الهلاك والخسران به ، بسبب عداوته الشديدة للحق ، الذى جاء به النبى صلى الله عليه وسلم من عند ربه - سبحانه - .والمراد باليدين هنا : ذاته ونفسه ، من باب إطلاق الجزء وإرادة الكل ، كما فى قوله - تعالى - : ( ذلك بِمَا قَدَّمَتْ يَدَاكَ ) ويجوز أن يكون المراد باليدين حقيقتهما ، وذلك لأنه كان يقول : يعدنى محمد صلى الله عليه وسلم بأشياء ، لا أدرى أنها كائنة ، يزعم أنها بعد الموت ، فلم يضع فى يدى شئ من ذلك ، ثم ينفخ فى يديه ويقول : تبا لكما ما أرى فيكما شيئا .\n","ar.baghawi":"مكية( تبت يدا أبي لهب وتب ) أخبرنا أحمد بن عبد الله الصالحي ، أخبرنا أبو بكر أحمد بن الحسن الحيري ، أخبرنا حاجب بن أحمد الطوسي ، حدثنا محمد بن حماد ، حدثنا أبو معاوية عن الأعمش ، عن عمرو بن مرة ، عن سعيد بن جبير عن ابن عباس قال : صعد رسول الله - صلى الله عليه وسلم - ذات يوم على الصفا فقال : يا صباحاه ، قال : فاجتمعت إليه قريش ، فقالوا له : مالك ؟ قال : أرأيتم لو أخبرتكم أن مصبحكم أو ممسيكم أما كنتم تصدقوني ؟ قالوا : بلى ، قال : فإني نذير لكم بين يدي عذاب شديد ، فقال أبو لهب : تبا لك ، ألهذا دعوتنا جميعا ؟ فأنزل الله - عز وجل - : \" تبت يدا أبي لهب وتب \" إلى آخرها .قوله : ( تبت ) أي : خابت وخسرت يدا أبي لهب ، [ أي هو ] ، أخبر عن يديه ، والمراد به نفسه على عادة العرب في التعبير ببعض الشيء عن كله .وقيل : \" اليد \" صلة ، كما يقال : يد الدهر ويد الرزايا والبلايا .وقيل : المراد بها ماله وملكه ، يقال : فلان قليل ذات اليد ، يعنون به المال ، و \" التباب \" : الخسار والهلاك .وأبو لهب : هو ابن عبد المطلب عم النبي - صلى الله عليه وسلم - واسمه عبد العزى . قال مقاتل : كني بأبي لهب لحسنه وإشراق وجهه .وقرأ ابن كثير \" أبي لهب \" ساكنة الهاء ، وهي مثل : نهر ونهر . واتفقوا في \" ذات لهب \" أنها مفتوحة الهاء لوفاق الفواصل .( وتب ) أبو لهب ، وقرأ عبد الله : وقد تب . قال الفراء : الأول دعاء ، والثاني خبر ، كما يقال : أهلكه الله ، وقد فعل .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6217.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6217.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6217.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ","transliteration":"Maa aghna 'anhu maaluhu wa ma kasab","translations":{"en.ahmedali":"Of no avail shall be his wealth, nor what he has acquired.","en.ahmedraza":"His wealth did not benefit him in the least, nor did whatever he earned.","en.arberry":"His wealth avails him not, neither what he has earned;","en.asad":"What will his wealth avail him, and all that he has gained?","en.daryabadi":"His substance availed him not, nor that which he earned.","en.hilali":"His wealth and his children (etc.) will not benefit him!","en.pickthall":"His wealth and gains will not exempt him.","en.qaribullah":"His wealth will not suffice him, neither what he has gained;","en.sahih":"His wealth will not avail him or that which he gained.","en.sarwar":"May he too perish!","en.yusufali":"No profit to him from all his wealth, and all his gains!","en.maududi":"His wealth did not avail him, nor his acquisitions.","en.shakir":"His wealth and what he earns will not avail him.","en.itani":"His wealth did not avail him, nor did what he acquired.","en.mubarakpuri":"His wealth and his children will not benefit him!","en.qarai":"Neither his wealth availed him, nor what he had earned.","en.wahiduddin":"Neither his wealth nor his gains will avail him."},"tafsir":{"ar.muyassar":"ما أغنى عنه ماله وولده، فلن يَرُدَّا عنه شيئًا من عذاب الله إذا نزل به.","ar.jalalayn":"«ما أَغنى عنه ماله وما كسب» أي وكسبه، أي ولده ما أغنى بمعنى يغني.","ar.qurtubi":"قوله تعالى : ما أغنى عنه ماله وما كسبأي ما دفع عنه عذاب الله ما جمع من المال ، ولا ما كسب من جاه . وقال مجاهد : من الولد ؛ وولد الرجل من كسبه . وقرأ الأعمش ( وما اكتسب ) ورواه عن ابن مسعود . وقال أبو الطفيل : جاء بنو أبي لهب يختصمون عند ابن عباس ، فاقتتلوا ، فقام ليحجز بينهم ، فدفعه بعضهم ، فوقع على الفراش ، فغضب ابن عباس وقال : أخرجوا عني الكسب الخبيث ؛ يعني ولده . وعن عائشة - رضي الله عنها - أن رسول الله - صلى الله عليه وسلم - قال : إن أطيب ما أكل الرجل من كسبه ، [ ص: 213 ] وإن ولده من كسبه . خرجه أبو داود . وقال ابن عباس : لما أنذر رسول الله - صلى الله عليه وسلم - عشيرته بالنار ، قال أبو لهب : إن كان ما يقول ابن أخي حقا فإني أفدي نفسي بمالي وولدي ؛ فنزل : ما أغنى عنه ماله وما كسب . و ما في قوله : ما أغنى : يجوز أن تكون نفيا ، ويجوز أن تكون استفهاما ؛ أي أي شيء أغنى عنه ؟ و ما الثانية : يجوز أن تكون بمعنى الذي ، ويجوز أن تكون مع الفعل مصدرا ؛ أي ما أغنى عنه ماله وكسبه .\n","ar.miqbas":"مَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ (2)استئناف ابتدائي للانتقال من إنشاء الشتم والتوبيخ إلى الإِعلام بأنه آيس من النجاة من هذا التبات ، ولا يغنيه ماله ، ولا كسبه ، أي لا يغني عنه ذلك في دفع شيء عنه في الآخرة .والتعبير بالماضي في قوله : { ما أغنى } لتحقيق وقوع عدم الإِغناء .و { ما } نافية ، ويجوز أن تكون استفهامية للتوبيخ والإِنكار .والمال : الممتلكات المتمولة ، وغلب عند العرب إطلاقه على الإِبل ، ومن كلام عمر : «لولاَ المال الذي أحمل عليه في سبيل الله» الخ في اتقاء دعوة المظلوم ، من «الموطأ» ، وقال زهير: ... صحيحات ماللٍ طالعات بمخرَموأهل المدينة وخيبر والبحرين يغلب عندهم على النخيل ، وقد تقدم عند قوله تعالى : { يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل } في سورة النساء ( 29 ) وفي مواضع .{ وما كسب } موصول وصلته والعائد محذوف جوازاً لأنه ضمير نصب ، والتقدير : وما كسبه ، أي ما جمعه . والمراد به : ما يملكه من غير النعَم من نقود وسلاح وربْع وعُروض وطعام ، ويجوز أن يراد بماله : جميع ماله ، ويكون عطف { وما كسب } من ذكر الخاص بعد العام للاهتمام به ، أي ما أغنى عنه ماله التالد وهو ما ورثه عن أبيه عبد المطلب وما كسبه هو بنفسه وهو طريفُه .وروي عن ابن مسعود أن أبا لهب قال : «إن كان ما يقول ابن أخي حقاً فأنا أفتدي نفسي يوم القيامة بمالي وولدي» فأنزل الله : { ما أغنى عنه ماله وما كسب } وقال ابن عباس : { ما كسب } هو ولده فإن الولد من كسب أبيه .\n","ar.waseet":"وقوله - سبحانه - ( مَآ أغنى عَنْهُ مَالُهُ وَمَا كَسَبَ ) كلام مستأنف للانتقال من ذمه والدعاء عليه بالهلاك ، إلى بيان أن ماله وجاهه . . لن يغنى عنه من عذاب الله - تعالى - شيئا .أى : أن أبا لهب لن يغنى عنه ماله الكثير ، وكسبه الوفير من حطام الدنيا . . لن يغنى عنه شيئا من عذاب الله - تعالى - ، أو شيئا من انتشار رسالة الله - تعالى - فى الأرض ، فإن الله - سبحانه - ناصر نبيه صلى الله عليه وسلم ومؤيده بروح منه .والتعبير بالماضى فى قوله : ( مَآ أغنى . . . ) لتحقيق وقوع عدم الإِغناء .والراجح أن \" ما \" الأولى نافية ، والثانية موصولة ، أى : ما أغنى عنه شيئا ماله الذى ورثه عن أبيه ، وأيضا ما أغنى عنه شيئا ماله الذى جمعه واكتسبه هو بنفسه عن طريق التجارة وغيرها .\n","ar.baghawi":"( ما أغنى عنه ماله وما كسب ) قال ابن مسعود : لما دعا رسول الله - صلى الله عليه وسلم - أقرباءه إلى الله - عز وجل - قال أبو لهب : إن كان ما يقول ابن أخي حقا فإني أفتدي نفسي ومالي وولدي ، فأنزل الله تعالى :( ما أغنى عنه ماله ) أي ما يغني ، وقيل : أي شيء يغني عنه ماله ، أي : ما يدفع عنه عذاب الله ما جمع من المال ، وكان صاحب مواش ( وما كسب ) قيل : يعني ولده ، لأن ولد الإنسان من كسبه كما جاء في الحديث : \" أطيب ما يأكل أحدكم من كسبه ، وإن ولده من كسبه \"\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6218.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6218.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6218.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ","transliteration":"Sa yas laa naran zaata lahab","translations":{"en.ahmedali":"He will be roasted in the fire,","en.ahmedraza":"He will soon enter the flaming fire.","en.arberry":"he shall roast at a flaming fire","en.asad":"[In the life to come] he shall have to endure a fire fiercely glowing;","en.daryabadi":"Anon he shall roast into Fire having flame.","en.hilali":"He will be burnt in a Fire of blazing flames!","en.pickthall":"He will be plunged in flaming Fire,","en.qaribullah":"he shall roast at a Flaming Fire,","en.sahih":"He will [enter to] burn in a Fire of [blazing] flame","en.sarwar":"His property and worldly gains will be of no help to him.","en.yusufali":"Burnt soon will he be in a Fire of Blazing Flame!","en.maududi":"Surely, he will be cast into a Flaming Fire","en.shakir":"He shall soon burn in fire that flames,","en.itani":"He will burn in a Flaming Fire.","en.mubarakpuri":"He will enter a Fire full of flames!","en.qarai":"Soon he will enter the blazing fire,","en.wahiduddin":"He shall soon enter a Blazing Fire,"},"tafsir":{"ar.muyassar":"سيدخل نارًا متأججة، هو وامرأته التي كانت تحمل الشوك، فتطرحه في طريق النبي صلى الله عليه وسلم؛ لأذيَّته.","ar.jalalayn":"«سيصلى ناراً ذات لهب» أي تلهب وتوقد فهي مآل تكنيته لتلهب وجهه إشراقاً وحمرة.","ar.qurtubi":"قوله تعالى : سيصلى نارا ذات لهبأي ذات اشتعال وتلهب . وقد مضى في سورة ( المرسلات ) القول فيه . وقراءة العامة : سيصلى بفتح الياء . وقرأ أبو رجاء والأعمش : بضم الياء . ورواها محبوب عن إسماعيل عن ابن كثير ، وحسين عن أبي بكر عن عاصم ، ورويت عن الحسن . وقرأ أشهب العقيلي وأبو سمال العدوي ومحمد بن السميقع سيصلى بضم الياء ، وفتح الصاد ، وتشديد اللام ؛ ومعناها سيصليه الله ؛ من قوله : وتصلية جحيم . والثانية من الإصلاء ؛ أي يصليه الله ؛ من قوله : فسوف نصليه نارا . والأولى هي الاختيار ؛ لإجماع الناس عليها ؛ وهي من قوله : إلا من هو صال الجحيم .\n","ar.miqbas":"سَيَصْلَى نَارًا ذَاتَ لَهَبٍ (3)بيان لجملة : { ما أغنى عنه ماله وما كسب } أي لا يغني عنه شيء من عذاب جهنم . ونزل هذا القرآن في حياة أبي لهب . وقد مات بعد ذلك كافراً ، فكانت هذه الآية إعلاماً بأنه لا يُسلم وكانت من دلائل النبوءة .والسين للتحقيق مثل قوله تعالى : { قال سوف أستغفر لكم ربي } [ يوسف : 98 ] .و«يصلى ناراً» يُشوَى بها ويحس بإحراقها . وأصل الفعل : صلاهُ بالنار ، إذا شواه ، ثم جاء منه صَلي كأفعال الإِحساس مثل فرِح ومرِض . ونُصب { ناراً } على نزع الخافض .ووصف النار ب { ذات لهب } لزيادة تقرير المناسبة بين اسمه وبين كفره إذ هو أبو لهب والنار ذات لهب .وهو ما تقدم الإِيماء إليه بذكر كنيته كما قدمناه آنفاً ، وفي وصف النار بذلك زيادة كشف لحقيقة النار وهو مِثل التأكيد .وبين لَفضي { لهب } الأول و { لهب } الثاني الجناس التام .\n","ar.waseet":"وقوله - سبحانه - : ( سيصلى نَاراً ذَاتَ لَهَبٍ ) بيان للعاقبة السيئة التى تنتظره ، بعد هذا الذم والتأنيب والوعيد . أى : سيلقى بأبى لهب فى نار شديدة الحرارة ، تشوى الوجوه والأبدان ، ووصف - سبحانه - النار بأنها \" ذات لهب \" لزيادة تقرير المناسبة بين اسمه وكفره ، إذ هو معروف بأبى لهب ، والنار موصوفة بأنها ذات لهب شديد .\n","ar.baghawi":"ثم أوعده بالنار فقال : ( سيصلى نارا ذات لهب ) أي نارا تلتهب عليه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6219.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6219.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6219.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ","transliteration":"Wam ra-atuh hamma latal-hatab","translations":{"en.ahmedali":"And his wife, the portress of fire wood,","en.ahmedraza":"And so will his wife; carrying a bundle of firewood on her head.","en.arberry":"and his wife, the carrier of the firewood,","en.asad":"together with his wife, that carrier of evil tales,","en.daryabadi":"And his wife also: the firewood carrier;","en.hilali":"And his wife too, who carries wood (thorns of Sadan which she used to put on the way of the Prophet (Peace be upon him), or use to slander him).","en.pickthall":"And his wife, the wood-carrier,","en.qaribullah":"and his wife, laden with firewood","en.sahih":"And his wife [as well] - the carrier of firewood.","en.sarwar":"He will suffer in a blazing fire","en.yusufali":"His wife shall carry the (crackling) wood - As fuel!-","en.maududi":"along with his wife, that carrier of slanderous tales;","en.shakir":"And his wife, the bearer of fuel,","en.itani":"And his wife—the firewood carrier.","en.mubarakpuri":"And his wife too, who carries wood.","en.qarai":"and his wife [too], the firewood carrier,","en.wahiduddin":"and also his wife who carries the fuel,"},"tafsir":{"ar.muyassar":"سيدخل نارًا متأججة، هو وامرأته التي كانت تحمل الشوك، فتطرحه في طريق النبي صلى الله عليه وسلم؛ لأذيَّته.","ar.jalalayn":"«وامرأته» عطف على ضمير يصلى سوغه الفصل بالمفعول وصفته وهي أم جميل «حمالة» بالرفع والنصب «الحطب» الشوك والسعدان تلقيه في طريق النبي صلى الله عليه وسلم.","ar.qurtubi":"قوله تعالى : وامرأته حمالة الحطب قوله تعالى : وامرأته أم جميل . وقال ابن العربي : العوراء أم قبيح ، وكانت عوراء . حمالة الحطب قال ابن عباس ومجاهد وقتادة والسدي : كانت تمشي بالنميمة بين الناس ؛ تقول العرب : فلان يحطب على فلان : إذا ورش عليه . قال الشاعر :إن بني الأدرم حمالو الحطب هم الوشاة في الرضا وفي الغضب     عليهم اللعنة تترى والحربوقال آخر :من البيض لم تصطد على ظهر لأمة     ولم تمش بين الحي بالحطب الرطب[ ص: 214 ] يعني : لم تمش بالنمائم ، وجعل الحطب رطبا ليدل على التدخين ، الذي هو زيادة في الشر . وقال أكثم بن صيفي لبنيه : إياكم والنميمة فإنها نار محرقة ، وإن النمام ليعمل في ساعة ما لا يعمل الساحر في شهر . أخذه بعض الشعراء فقال :إن النميمة نار ويك محرقة     فقر عنها وجانب من تعاطاهاولذلك قيل : نار الحقد لا تخبو . وثبت عن النبي - صلى الله عليه وسلم - : لا يدخل الجنة نمام . وقال : ذو الوجهين لا يكون عند الله وجيها . وقال عليه الصلاة والسلام : من شر الناس ذو الوجهين الذي يأتي هؤلاء بوجه ، وهؤلاء بوجه . وقال كعب الأحبار : أصاب بني إسرائيل قحط ، فخرج بهم موسى - عليه السلام - ثلاث مرات فلم يستسقوا . فقال موسى : \" إلهي عبادك \" فأوحى الله إليه : \" إني لا أستجيب لك ولا لمن معك لأن فيهم رجلا نماما ، قد أصر على النميمة \" . فقال موسى : \" يا رب من هو حتى نخرجه من بيننا \" ؟ فقال : \" يا موسى أنهاك عن النميمة وأكون نماما \" قال : فتابوا بأجمعهم ، فسقوا . والنميمة من الكبائر ، لا خلاف في ذلك ؛ حتى قال الفضيل بن عياض : ثلاث تهد العمل الصالح ويفطرن الصائم ، وينقضن الوضوء : الغيبة ، والنميمة ، والكذب . وقال عطاء بن السائب : ذكرت للشعبي قول النبي - صلى الله عليه وسلم - : لا يدخل الجنة سافك دم ، ولا مشاء بنميمة ، ولا تاجر يربي فقلت : يا أبا عمرو ، قرن النمام بالقاتل وآكل الربا ؟ فقال : وهل تسفك الدماء ، وتنتهب الأموال ، وتهيج الأمور العظام ، إلا من أجل النميمة .وقال قتادة وغيره : كانت تعير رسول الله - صلى الله عليه وسلم - بالفقر . ثم كانت مع كثرة مالها تحمل الحطب على ظهرها ؛ لشدة بخلها ، فعيرت بالبخل . وقال ابن زيد والضحاك : كانت تحمل العضاه والشوك ، فتطرحه بالليل على طريق النبي - صلى الله عليه وسلم - وأصحابه ؛ وقاله ابن عباس . قال الربيع : فكان النبي - صلى الله عليه وسلم - يطؤه كما يطأ الحرير . وقال مرة الهمداني : كانت أم جميل تأتي كل يوم بإبالة من الحسك ، فتطرحها على طريق المسلمين ، فبينما هي حاملة ذات يوم حزمة [ ص: 215 ] أعيت ، فقعدت على حجر لتستريح ، فجذبها الملك من خلفها فأهلكها .وقال سعيد بن جبير : حمالة الخطايا والذنوب ؛ من قولهم : فلان يحتطب على ظهره ؛ دليله قوله تعالى : وهم يحملون أوزارهم على ظهورهم . وقيل : المعنى حمالة الحطب في النار ؛ وفيه بعد . وقراءة العامة حمالة بالرفع ، على أن يكون خبرا وامرأته مبتدأ . ويكون في جيدها حبل من مسد جملة في موضع الحال من المضمر في حمالة . أو خبرا ثانيا . أو يكون حمالة الحطب نعتا لامرأته . والخبر في جيدها حبل من مسد ؛ فيوقف - على هذا - على ( ذات لهب ( . ويجوز أن يكون وامرأته معطوفة على المضمر في سيصلى فلا يوقف على ( ذات لهب ) ويوقف على وامرأته وتكون حمالة الحطب خبر ابتداء محذوف . وقرأ عاصم حمالة الحطب بالنصب على الذم ، كأنها اشتهرت بذلك ، فجاءت الصفة للذم لا للتخصيص ، كقوله تعالى : ملعونين أينما ثقفوا . وقرأ أبو قلابة ( حاملة الحطب ) .\n","ar.miqbas":"وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ (4) أعقب ذم أبي لهب ووعيدهُ بمثل ذلك لامرأته لأنها كانت تشاركه في أذى النبي صلى الله عليه وسلم وتعينه عليه .وامرأته : أي زوجُه ، قال تعالى في قصة إبراهيم : { وامرأته قائمة } [ هود : 71 ] وفي قصة لوط : { إلا امرأته كانت من الغابرين } [ الأعراف : 83 ] وفي قصة نسوة يوسف : { امرأة العزيز تراود فتاها عن نفسه } [ يوسف : 30 ] .وامرأة أبي لهب هي أم جَميل ، واسمها أرْوَى بنتُ حرب بن أمية وهي أخت أبي سفيان بن حرب ، وقيل : اسمها العَوراء ، فقيل هو وصف وأنها كانت عوراء ، وقيل : اسمها ، وذكر بعضهم : أن اسمها العَوَّاء بهمزة بعد الواو .وكانت أم جميل هذه تحمل حطب العضاه والشوككِ فتضعه في الليل في طريق النبي صلى الله عليه وسلم الذي يسلك منه إلى بيته ليعقِر قدميه .فلما حصل لأبي لهب وعيد مقتبس من كنيته جُعل لامرأته وعيد مقتبَس لفظُه من فِعلها وهو حَمْل الحطب في الدنيا ، فأُنذرت بأنها تحمل الحطب في جهنم ليوقَد به على زوجها ، وذلك خزي لها ولزوجها إذ جعل شدة عذابه على يد أحب الناس إليه ، وجعلها سبباً لعذاب أعز الناس عليها .فقوله : { وامرأته } عطف على الضمير المستتر في { سيصلى } [ المسد : 3 ] أي وتصلى امرأته ناراً .وقوله : { حمالةُ الحطب } قرأه الجمهور برفع { حمالةُ } على أنه صفة لامرأته فيَحتمل أنها صفتها في جهنم ويحتمل أنها صفتها التي كانت تعمل في الدّنيا بجلب حطب العضاه لتضعه في طريق النبي صلى الله عليه وسلم على طريقة التوجيه والإِيماء إلى تعليل تعذيبها بذلك .وقرأه عاصم بنصب { حمالة } على الحال من { امرأته } . وفيه من التوجيه والإِيماء ما في قراءة الرفع .\n","ar.waseet":"ثم أعقب - سبحانه - ذلك ، بذم زوجه التى كانت تشاركه العداوة لرسول الله صلى الله عليه وسلم فقال : ( وامرأته حَمَّالَةَ الحطب . فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ ) .وقوله : ( وامرأته ) معطوف على الضمير المستتر العائد على أبى لهب فى قوله ( سيصلى ) وانتصاب لفظ \" حمالةَ \" على الذم بفعل مضمر ، لأن المقصود به هنا الذم ، وقرأ الجمهور ( حَمَّالَةَ ) - بالرفع - على أنه صفة لها ، أو خبر لمبتدأ محذوف ، أى : هى حمالة الحطب .والمقصود بقوله - تعالى - ( حَمَّالَةَ الحطب ) الحقيقة ، فقد روى أنها كانت تحمل بنفسها حزمة الشَّوْك والحسك والسَّعْدَان ، فتنثرها بالليل فى طريقه صلى الله عليه وسلم ، لإِيذائه به ، ويصح أن يكون المراد بهذه الجملة الكناية عن مشيها بين الناس بالنميمة ، وإشاعة السوء حول الرسول صلى الله عليه وسلم فإنه يقول لمن يمشى بالنميمة ليفسد بين الناس ، إنسان يحمل الحطب بين الناس ، أى : أنه يفسد بينهم .ويصح أن يكون المقصود بهذه الجملة ، حملها للذنوب والخطايا ، من قولهم : فلان يَحْطِب على ظهره ، إذا كان يكتسب الذنوب والخطايا ، فاستعير الحطب لذلك .وقد رجح الإِمام ابن جرير القول الأول ، لأنها كانت تحمل الشوك فتطرحه فى طريق النبى صلى الله عليه وسلم .\n","ar.baghawi":"( وامرأته ) أم جميل بنت حرب بن أمية أخت أبي سفيان ( حمالة الحطب ) قال ابن زيد والضحاك : كانت تحمل الشوك والعضاة فتطرحه في طريق رسول الله - صلى الله عليه وسلم - ، وأصحابه لتعقرهم ، وهي رواية عطية عن ابن عباس .وقال قتادة ، ومجاهد ، والسدي : كانت تمشي بالنميمة وتنقل الحديث فتلقي العداوة بين الناس ، وتوقد نارها كما توقد النار [ بالحطب ] . يقال : فلان يحطب على فلان ، إذا كان يغري به .وقال سعيد بن جبير : حمالة الخطايا ، دليله : قوله : \" وهم يحملون أوزارهم على ظهورهم \" ( الأنعام - 31 ) .قرأ عاصم \" حمالة \" بالنصب على الذم ، كقوله : \" ملعونين \" .وقرأ . الآخرون بالرفع ، وله وجهان : أحدهما سيصلى نارا هو وامرأته حمالة الحطب . والثاني : وامرأته حمالة الحطب في النار أيضا .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6220.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6220.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6220.mp3","format":"mp3","local_path":null}}},{"verse":5,"arabic":"فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ","transliteration":"Fee jeediha hab lum mim-masad","translations":{"en.ahmedali":"Will have a strap of fibre rope around her neck.","en.ahmedraza":"A rope made from palm fibre around her neck!","en.arberry":"upon her neck a rope of palm-fibre.","en.asad":"[who bears] around her neck a rope of twisted strands!","en.daryabadi":"On her neck shall be a cord of twisted fibre.","en.hilali":"In her neck is a twisted rope of Masad (palm fibre).","en.pickthall":"Will have upon her neck a halter of palm-fibre.","en.qaribullah":"shall have a rope of palmfiber around her neck!","en.sahih":"Around her neck is a rope of [twisted] fiber.","en.sarwar":"and so too will his wife who (threw thorns and firewood in the Prophet's way). Around her neck will be a rope of palm fibre.","en.yusufali":"A twisted rope of palm-leaf fibre round her (own) neck!","en.maududi":"upon her neck shall be a rope of palm-fibre.","en.shakir":"Upon her neck a halter of strongly twisted rope.","en.itani":"Around her neck is a rope of thorns.","en.mubarakpuri":"In her neck is a twisted rope of Masad.","en.qarai":"with a rope of palm fibre around her neck.","en.wahiduddin":"with a rope of twisted fibre round her neck."},"tafsir":{"ar.muyassar":"في عنقها حبل محكم الفَتْلِ مِن ليف شديد خشن، تُرْفَع به في نار جهنم، ثم تُرْمى إلى أسفلها.","ar.jalalayn":"«في جيدها» عنقها «حبل من مسد» أي ليف وهذه الجملة حال من حمالة الحطب الذي هو نعت لامرأته أو خبر مبتدأ مقدر.","ar.qurtubi":"قوله تعالى : في جيدها حبل من مسد قوله تعالى : في جيدها أي عنقها . وقال امرؤ القيس :وجيد كجيد الريم ليس بفاحش إذا هي نصته ولا بمعطلحبل من مسد أي من ليف ؛ قال النابغة :مقذوفة بدخيس النحض بازلها     له صريف صريف القعو بالمسدوقال آخر :يا مسد الخوص تعوذ مني     إن كنت لدنا لينا فإنيما شئت من أشمط مقسئنوقد يكون من جلود الإبل ، أو من أوبارها ؛ قال الشاعر :ومسد أمر من أيانق     لسن بأنياب ولا حقائقوجمع الجيد أجياد ، والمسد أمساد . أبو عبيدة : هو حبل يكون من صوف . قال الحسن : هي حبال من شجر تنبت باليمن تسمى المسد ، وكانت تفتل . قال الضحاك وغيره : هذا في الدنيا ؛ فكانت تعير النبي - صلى الله عليه وسلم - بالفقر وهي تحتطب في حبل تجعله في جيدها من ليف ، فخنقها الله جل وعز به فأهلكها ؛ وهو في الآخرة حبل من نار . وقال ابن عباس في رواية أبي [ ص: 216 ] صالح : في جيدها حبل من مسد قال : سلسلة ذرعها سبعون ذراعا - وقاله مجاهد وعروة بن الزبير : تدخل من فيها ، وتخرج من أسفلها ، ويلوى سائرها على عنقها . وقال قتادة : حبل من مسد قال : قلادة من ودع . الودع : خرز بيض تخرج من البحر ، تتفاوت في الصغر والكبر . قال الشاعر :والحلم حلم صبي يمرث الودعهوالجمع : ودعات . الحسن : إنما كان خرزا في عنقها . سعيد بن المسيب : كانت لها قلادة فاخرة من جوهر ، فقالت : واللات والعزى لأنفقتها في عداوة محمد . ويكون ذلك عذابا في جيدها يوم القيامة . وقيل : إن ذلك إشارة إلى الخذلان ؛ يعني أنها مربوطة عن الإيمان بما سبق لها من الشقاء ، كالمربوط في جيده بحبل من مسد . والمسد : الفتل . يقال : مسد حبله يمسده مسدا ؛ أي أجاد فتله . قال :يمسد أعلى لحمه ويأرمهيقول : إن البقل يقوي ظهر هذا الحمار ويشده . ودابة ممسودة الخلق : إذا كانت شديدة الأسر . قال الشاعر :ومسد أمر من أيانق     صهب عتاق ذات مخ زاهقلسن بأنياب ولا حقائقويروى :ولا ضعاف مخهن زاهققال الفراء : هو مرفوع والشعر مكفأ . يقول : بل مخهن مكتنز ؛ رفعه على الابتداء . قال : ولا يجوز أن يريد ولا ضعاف زاهق مخهن . كما لا يجوز أن تقول : مررت برجل أبوه قائم ؛ بالخفض . وقال غيره : الزاهق هنا : بمعنى الذاهب كأنه قال : ولا ضعاف مخهن ، ثم رد الزاهق على الضعاف . ورجل ممسود : أي مجدول الخلق . وجارية حسنة المسد والعصب والجدل والأرم ؛ وهي ممسودة ومعصوبة ومجدولة ومأرومة . والمساد ، على فعال : لغة في المساب ، وهي نحي السمن ، وسقاء العسل . قال جميعه الجوهري . وقد اعترض فقيل : إن كان ذلك حبلها الذي تحتطب به ، فكيف يبقى في النار ؟ وأجيب عنه بأن الله - عز وجل - قادر على تجديده كلما احترق . والحكم ببقاء أبي لهب وامرأته في النار مشروط [ ص: 217 ] ببقائهما على الكفر إلى الموافاة ؛ فلما ماتا على الكفر صدق الإخبار عنهما . ففيه معجزة للنبي - صلى الله عليه وسلم - . فامرأته خنقها الله بحبلها ، وأبو لهب رماه الله بالعدسة بعد وقعة بدر بسبع ليال ، بعد أن شجته أم الفضل . وذلك أنه لما قدم الحيسمان مكة يخبر خبر بدر ؛ قال له أبو لهب : أخبرني خبر الناس . قال : نعم ، والله ما هو إلا أن لقينا القوم ، فمنحناهم أكتافنا ، يضعون السلاح منا حيث شاءوا ، ومع ذلك ما لمست الناس . لقينا رجالا بيضا على خيل بلق ، لا والله ما تبقي منا ؛ يقول : ما تبقي شيئا . قال أبو رافع : وكنت غلاما للعباس أنحت الأقداح في صفة زمزم ، وعندي أم الفضل جالسة ، وقد سرنا ما جاءنا من الخبر ، فرفعت طنب الحجرة ، فقلت : تلك والله الملائكة . قال : فرفع أبو لهب يده ، فضرب وجهي ضربة منكرة ، وثاورته ، وكنت رجلا ضعيفا ، فاحتملني ، فضرب بي الأرض ، وبرك على صدري يضربني . وتقدمت أم الفضل إلى عمود من عمد الحجرة ، فتأخذه وتقول : استضعفته أن غاب عنه سيده ! وتضربه بالعمود على رأسه فتفلقه شجة منكرة . فقام يجر رجليه ذليلا ، ورماه الله بالعدسة ، فمات ، وأقام ثلاثة أيام يدفن حتى أنتن ؛ ثم إن ولده غسلوه بالماء ، قذفا من بعيد ، مخافة عدوى العدسة . وكانت قريش تتقيها كما يتقى الطاعون . ثم احتملوه إلى أعلى مكة ، فأسندوه إلى جدار ، ثم رضموا عليه الحجارة .\n","ar.miqbas":"فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ (5)وجملة : { في جيدها حبل من مسد } صفة ثانية أو حال ثانية وذلك إخبار بما تعامل به في الآخرة ، أي جعل لها حبل في عنقها تحمِل فيه الحطب في جهنم لإِسعار النار على زوجها جزاء مماثلاً لعملها في الدنيا الذي أغضب الله تعالى عليها .والجِيد : العُنق ، وغلَب في الاستعمال على عنق المرأة وعلى محل القلادة منه فَقَلّ أن يذكر العُنق في وصف النساء في الشعر العربي إلا إذا كان عُنُقاً موصوفاً بالحسن وقد جمعهما امرؤ القيس في قوله: ... وجيدٍ كجِيد الرِئم ليس بفاحشإذا هي نَصَّتْه ولا بمُعَطَّل ... قال السهيلي في «الروض» : «والمعروف أن يذكر العنق إذا ذكر الحَلي أو الحُسن فإنما حَسُن هنا ذِكر الجيد في حكم البلاغة لأنها امرأة والنساء تحلي أجيادَهن وأم جميل لا حلي لها في الآخرة إلا الحَبل المجعول في عنقها فلما أقيم لها ذلك مقام الحَلي ذُكر الجيد معه ، ألا ترى إلى قول الأعشى: ... يومَ تبدي لنا قتيلةُ عن جيد أسيل تزينُه الأطواق ... ولم يقل عن عنق ، وقول الآخر: ... وأحسن من عقد المليحة جيدُهاولم يقل عنقها ولو قال لكان غثاً من الكلام . ا ه .قلت : وأما قول المعري: ... الحَجْلُ للرِّجْل والتاجُ المُنيفُ لمافوقَ الحِجَاج وعقْد الدرّ للعنق ... فإنما حسنه ما بين العقد والعنق من الجناس إتماماً للمجانسة التي بين الحَجْل والرجل ، والتاج والحجاج ، وهو مقصود الشاعر .والحبْل : ما يربط به الأشياء التي يراد اتصالُ بعضها ببعض وتقيدُ به الدابة والمسجون كيلا يبرح من المكان ، وهو ضفير من الليف أو من سُيور جلد في طول متفاوت على حسب قوة ما يشد به أو يربط في وتدٍ أو حلقة أو شجرة بحيث يمنع المربوط به من مغادرة موضعه إلى غيره على بعد يراد ، وتربط به قلوع السفن وتشد به السفن في الأرض في الشواطىء ، وتقدم في قوله تعالى : { واعتصموا بحبل اللَّه جميعاً } وقوله : { إلا بحبل من اللَّه وحبل من الناس } كلاها في سورة آل عمران ( 103 112 ) ، ويقال : حبله إذا ربطه .والمسدّ : ليف من ليف اليمن شديد ، والحِبال التي تفتل منه تكون قوية وصُلبة .وقدم الخبر من قوله : { في جيدها } للاهتمام بوصف تلك الحالة الفظيعة التي عوضت فيها بحبل في جيدها عن العقد الذي كانت تحلي به جيدها في الدنيا فتربط به إذ قد كانت هي وزوجها من أهل الثراء وسادة أهل البطحاء ، وقد ماتت أم جميل على الشرك .\n","ar.waseet":"وقوله - سبحانه - : ( فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ ) زيادة فى تبشيع صورتها ، وتحقير هيئتها .والجيد : العنق ، والمسد : الليف المتين الذى فتل بشدة ، يقال : حبل ممسود ، أى مفتول فتلا قويا .والمعنى : سيصلى أبو لهب نارا شديدة ، وستصلى معه امرأته التى تضع الشوك فى طريق النبى صلى الله عليه وسلم هذه النار المشتعلة - أيضا - ، وسيزيد الله - تعالى - فى إذلالها وتحقيرها ، بأن يأمر ملائكته بأن تضع فى عنقها حبلا مفتولا فتلا قويا ، على سبيل الإِذلال والإِهانة لها ، لأنها كانت فى الدنيا تزعم أنها من بنات الأشراف الأكابر .روى عن سعيد بن المسيب أنه قال : كان لها قلادة ثمينة فقالت : لأبيعنها ولأنفقن ثمنها فى عداوة محمد صلى الله عليه وسلم فأبدلها الله عنها حبلا فى جيدها من مسد النار .والذى يتأمل هذه السورة الكريمة ، يراها قد اشتملت على أوضح الأدلة وأبلغ المعجزات الدالة على صدق النبى صلى الله عليه وسلم فيما يبلغه عن ربه ، فإن الله - تعالى - قد أخبر بشقاء أبى لهب وامرأته ، وأنهما سيصليان نارا ذات لهب . . وقد علما بما جاء فى هذه السورة من عقاب الله لهما . . ومع ذلك فقد بقيا على كفرهما حتى فارقا الحياة ، دون أن ينطقا بكلمة التوحيد ، ولو فى الظاهر - فثبت أن هذا القرآن من عند الله ، وأن الرسول صلى الله عليه وسلم صادق فيما يبلغه عن ربه - عز وجل - .نسأل الله - تعالى - أن يلحقنا بعباده الصالحين .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"( في جيدها ) في عنقها ، وجمعه أجياد ، ( حبل من مسد ) واختلفوا فيه ، قال ابن عباس ، وعروة بن الزبير : سلسلة من حديد ذرعها سبعون ذراعا ، تدخل في فيها وتخرج من دبرها ، ويكون سائرها في عنقها ، وأصله من \" المسد \" وهو الفتل ، و \" المسد \" ما فتل وأحكم من أي شيء كان ، يعني : السلسلة التي في عنقها ففتلت من الحديد فتلا محكما .وروى الأعمش عن مجاهد : \" من مسد \" أي من حديد ، والمسد : الحديدة التي تكون في البكرة ، يقال لها المحور .وقال الشعبي ومقاتل : من ليف . قال الضحاك وغيره : في الدنيا من ليف ، وفي الآخرة من نار . وذلك الليف هو الحبل الذي كانت تحتطب به ، فبينما هي ذات يوم حاملة حزمة فأعيت فقعدت على حجر تستريح فأتاها ملك فجذبها من خلفها فأهلكها .قال ابن زيد : حبل من شجر ينبت باليمن يقال له مسد .قال قتادة : قلادة من ودع وقال الحسن : كانت خرزات في عنقها [ فاخرة ] وقال سعيد بن المسيب : كانت لها قلادة في عنقها فاخرة ، فقالت : لأنفقنها في عداوة محمد - صلى الله عليه وسلم - .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6221.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6221.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6221.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":27,"letters":186,"size":"41KB","priority":3,"commonlyRead":false}}