{"chapter":112,"name":{"arabic":"الإخلاص","transliteration":"Al-Ikhlas","translation":"The Sincerity","revelation":"meccan"},"revelation":"meccan","verses":4,"content":[{"verse":1,"arabic":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ قُلْ هُوَ اللَّهُ أَحَدٌ","transliteration":"Qul huwal laahu ahad","translations":{"en.ahmedali":"SAY: \"HE IS God the one the most unique,","en.ahmedraza":"Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “He is Allah, He is One.”","en.arberry":"Say: 'He is God, One,","en.asad":"SAY: \"He is the One God:","en.daryabadi":"Say thou: He is Allah, the One!","en.hilali":"Say (O Muhammad (Peace be upon him)): \"He is Allah, (the) One.","en.pickthall":"Say: He is Allah, the One!","en.qaribullah":"Say: 'He is Allah, the One,","en.sahih":"Say, \"He is Allah, [who is] One,","en.sarwar":"(Muhammad), say, \"He is the only God.","en.yusufali":"Say: He is Allah, the One and Only;","en.maududi":"Say: “He is Allah, the One and Unique;","en.shakir":"Say: He, Allah, is One.","en.itani":"Say, “He is God, the One.","en.mubarakpuri":"Say: \"He is Allah, One.\"","en.qarai":"Say, ‘He is Allah, the One.","en.wahiduddin":"Say, \"He is God, the One,"},"tafsir":{"ar.muyassar":"قل -أيها الرسول-: هو الله المتفرد بالألوهية والربوبية والأسماء والصفات، لا يشاركه أحد فيها.","ar.jalalayn":"سئل النبي صلى الله عليه وسلم عن ربه فنزل: «قل هو الله أحد» فالله خبر هو وأحد بدل منه أو خبر ثان.","ar.qurtubi":"سورة الإخلاصوهي أربع آياتمكية في قول ابن مسعود والحسن وعطاء وعكرمة وجابرومدنية في أحد قولي ابن عباس وقتادة والضحاك والسديبسم الله الرحمن الرحيمقل هو الله أحدقوله تعالى : قل هو الله أحد أي الواحد الوتر ، الذي لا شبيه له ، ولا نظير ولا صاحبة ، ولا ولد ولا شريك . وأصل أحد : وحد ؛ قلبت الواو همزة . ومنه قول النابغة :كأن رحلي وقد زال النهار بنا بذي الجليل على مستأنس وحدوقد تقدم في سورة ( البقرة ) الفرق بين واحد وأحد ، وفي كتاب ( الأسنى في شرح أسماء الله الحسنى ) أيضا مستوفى والحمد لله وأحد مرفوع ، على معنى : هو أحد . وقيل : المعنى : قل : الأمر والشأن : الله أحد . وقيل : أحد بدل من قوله : الله . وقرأ جماعة أحد الله بلا تنوين ، طلبا للخفة ، وفرارا من التقاء الساكنين ؛ ومنه قول الشاعر [ أبو الأسود الدؤلي ] :فألفيته غير مستعتب     ولا ذاكر الله إلا قليلا\n","ar.miqbas":"قُلْ هُوَ اللَّهُ أَحَدٌ (1)افتتاح هذه السورة بالأمر بالقول لإِظهار العناية بما بعد فعل القول كما علمت ذلك عند قوله تعالى : { قل يا أيها الكافرون } [ الكافرون : 1 ]ولذلك الأمر في هذه السورة فائدة أخرى ، وهي أنها نزلت على سبب قول المشركين : انْسُبْ لنا ربك ، فكانت جواباً عن سؤالهم فلذلك قيل له : { قل } كما قال تعالى : { قل الروح من أمر ربي } [ الإسراء : 85 ] فكان للأمر بفعل { قل } فائدتان .وضمير { هو } ضمير الشأن لإِفادة الاهتمام بالجملة التي بعده ، وإذا سمعه الذين سألوا تطلعوا إلى ما بعده .ويجوز أن يكون { هو } أيضاً عائداً إلى الرب في سؤال المشركين حين قالوا : انسب لنا ربك .ومن العلماء من عَدّ ضمير { هو } في هذه السورة اسماً من أسماء الله تعالى وهي طريقة صوفية درج عليها فخر الدين الرازي في «شرح الأسماء الحسنى» نقله ابن عرفة عنه في «تفسيره» وذكر الفخر ذلك في «مفاتيح الغيب» ولا بد من المزج بين كلاميه .وحاصلهما قوله : { قل هو الله أحد } فيه ثلاثة أسماء لله تعالى تنبيهاً على ثلاثة مقامات .الأول : مقام السابقين المقربين الناظرين إلى حقائق الأشياء من حيث هِيَ هِيَ ، فلا جرم ما رأوا موجوداً سوى الله لأنه هو الذي لأجله يجب وجوده فما سوى الله عندهم معدوم ، فقوله : { هو } إشارة مطلقة . ولما كان المشار إليه معيناً انصرف ذلك المطلق إلى ذلك المعين فكان قوله : { هو } إشارة من هؤلاء المقربين إلى الله فلم يفتقروا في تلك الإِشارة إلى مميز فكانت لفظة { هو } كافية في حصول العرفان التام لهؤلاء .المقام الثاني : مقام أصحاب اليمين المقتصدين فهم شاهَدُوا الحق موجوداً وشاهدوا الممكنات موجودة فحصلت كثرة في الموجودات فلم تكن لفظة { هو } تامة الإِفادة في حقهم فافتقروا معها إلى مميز فقيل لأجلهم { هو اللَّه } .والمقام الثالث : مقام أصحاب الشمال وهم الذين يجوزون تعدد الإله فقُرن لفظ { أحد } بقوله : { هو اللَّه } إبطالاً لمقالتهم ا ه .فاسمه تعالى العلَم ابتدىء به قبل إجراء الأخبار عليه ليكون ذلك طريق استحضار صفاته كلّها عند التخاطب بين المسلمين وعند المحاجَّة بينهم وبين المشركين ، فإن هذا الاسم معروف عند جميع العرب فمسماه لا نزاع في وجوده ولكنهم كانوا يصفونه بصفات تَنَزَّه عنها .أما { أحد } فاسم بمعنى ( وَاحِد ) . وأصل همزته الواو ، فيقال : وحَد كما يقال : أحد ، قلبت الواو همزة على غير قياس لأنها مفتوحة ( بخلاف قلب واو وُجوه ) ومعناه منفرد ، قال النابغة: ... كأنَّ رحلي وقد زال النهارُ بنابذي الجليللِ على مستأنِسسٍ وَحَدِ ... أي كأني وضعتُ الرجل على ثورِ وحْششٍ أحَسَّ بأنسيّ وهو منفردٌ عن قطيعه .وهو صفة مشبهة مثل حَسَن ، يقال : وَحُد مثل كرُم ، ووَحِدَ مثل فرِح .وصيغة الصفة المشبهة تفيد تمكن الوصف في موصوفها بأنه ذاتيٌّ له ، فلذلك أوثر { أحد } هنا على ( واحد ) لأن ( واحد ) اسم فاعل لا يفيد التمكن .ف ( واحد ) و { أحد } وصفان مصوغان بالتصريف لمادة متحدة وهي مادة الوحدة يعني التفرد .هذا هو أصل إطلاقه وتفرعت عنه إطلاقات صارت حقائق للفظ ( أحد ) ، أشهرها أنه يستعمل اسماً بمعنى إنسان في خصوص النفي نحو قوله تعالى : { لا نفرق بين أحد من رسله } في البقرة ( 285 ) ، وقوله : { ولا أشرك بربي أحداً } في الكهف ( 38 ) وكذلك إطلاقه على العدد في الحساب نحو : أحد عشر ، وأحد وعشرين ، ومؤنثه إحدى ، ومن العلماء من خلط بين ( واحد ) وبين { أحد } فوقع في ارتباك .فوصف الله بأنه { أحد } معناه : أنه منفرد بالحقيقة التي لوحظت في اسمه العلَم وهي الإلهية المعروفة ، فإذا قيل : { اللَّه أحد } فالمراد أنه منفرد بالإلهية ، وإذا قيل : الله واحد ، فالمراد أنه واحد لا متعدد فمَن دونه ليس بإله . ومآل الوصفين إلى معنى نفي الشريك له تعالى في إلهيته .فلما أريد في صدر البعثة إثبات الوحدة الكاملة لله تعليماً للناس كلهم ، وإبطالاً لعقيدة الشرك وُصف الله في هذه السورة ب { أحد } ولم يوصف ب ( واحد ) لأن الصفة المشبهة نهايةُ ما يُمكن به تقريب معنى وحدة الله تعالى إلى عقول أهل اللسان العربي المبين .وقال ابن سينا في تفسير له لهذه السورة : إن { أحد } دالّ على أنه تعالى واحد من جميع الوجوه وأنه لا كثرة هناك أصلاً لا كثرةً معنوية وهي كثرة المقومات والأجناس والفصول ، ولا كثرة حسيّة وهي كثرة الأجزاء الخارجية المتمايزة عقلاً كما في المادة والصورة . والكثرة الحسية بالقوة أو بالفعل كما في الجسم ، وذلك متضمن لكونه سبحانه منزهاً عن الجنس والفصل ، والمادة والصورة ، والأعراض والأبعَاض ، والأعضاء ، والأشكال ، والألوان ، وسائر ما يُثلم الوحدة الكاملة والبَساطة الحَقَّة اللائقة بكرم وجهه عز وجل عن أن يشبهه شيء أو يساويه سبحانه شيء . وتبيينُه : أما الواحد فمقول على ما تحته بالتشكيك ، والذي لا ينقسم بوجه أصلاً أولى بالوحدانيَّة مما ينقسم من بعض الوجوه ، والذي لا ينقسم انقساماً عقليّاً أوْلَى بالوحدانية من الذي ينقسم انقساماً بالحسّ بالقوة ثم بالفعل ، ف { أحد } جامع للدلالة على الوحدانية من جميع الوجوه وأنه لا كثرة في موصوفه اه .قلت : قد فهم المسلمون هذا فقد روي أن بلالاً كان إذا عذب على الإِسلام يقول : أحَد أحد ، وكان شعار المسلمين يوم بدر : أحَد أحَد .والذي درج عليه أكثر الباحثين في أسماء الله تعالى أن { أحد } ليس ملحقاً بالأسماء الحسنى لأنه لم يرد ذكره في حديث أبي هريرة عند الترمذي قال : \" قال رسول الله صلى الله عليه وسلم إنَّ لله تسعة وتسعين اسماً من أحصاها دخل الجنة \" . وعدّها ولم يذكر فيها وصف أحد ، وذكر وصف واحد وعلى ذلك درج إمام الحرمين في كتاب «الإِرشاد» وكتاببِ «اللمع» والغزالي في «شرح الأسماء الحسنى» .وقال الفهري في «شرحه على لُمع الأدلة» لإِمام الحرمين عند ذكر اسمه تعالى «الواحد» . وقد ورد في بعض الروايات الأحد فلم يجمع بين الاسمين في اسم .ودرح ابن بَرَّجَان الإِشبيلي في «شرح الأسماء» والشيخ مُحمد بن محمد الكومي ( بالميم ) التونسي ، ولُطف الله الأرضرُومي في «معارج النور» ، على عدّ ( أحد ) في عداد الأسماء الحسنى مع اسمه الوَاحد فقالا : الواحد الأحد بحيث هو كالتأكيد له كما يقتضيه عدهم الأسماء تسعة وتسعين ، وهذا بناء على أن حديث أبي هريرة لم يقتضضِ حصر الأسماء الحسنى في التسعة والتسعين ، وإنما هو لبيان فضيلة تلك الأسماء المعدودة فيه .والمعنى : أن الله منفرد بالإلهية لا يشاركه فيها شيء من الموجودات . وهذا إبطال للشرك الذي يدين به أهل الشرك ، وللتثليث الذي أحدثه النصارى المَلْكانية وللثانوية عند المجوس ، وللعَدَد الذي لا يُحصى عند البراهمة .فقوله : { اللَّه أحد } نظير قوله في الآية الأخرى : { إنما الله إله واحد } [ النساء : 171 ] . وهذا هو المعنى الذي يدركه المخاطبون بهذه الآية السائلون عن نسبة الله ، أي حقيقته فابتدىء لهم بأنه واحد ليعلموا أن الأصنام ليست من الإلهية في شيء .ثم إن الأحدية تقتضي الوجود لا محالة فبطل قول المعطلة والدُّهريين .وقد اصطلح علماء الكلام من أهل السنة على استخراج الصفات السلبية الربانية من معنى الأحدية لأنه إذا كان منفرداً بالإلهية كان مستغنياً عن المخصِّص بالإِيجاد لأنه لو افتقر إلى من يُوجده لكان من يوجده إلها أوَّلَ منه فلذلك كان وجود الله قديماً غير مسبوق بعدم ولا محتاج إلى مخصص بالوجُود بدَلاً عن العدم ، وكان مستعيناً عن الإمداد بالوجود فكان باقياً ، وكان غنياً عن غيره ، وكان مخالفاً للحوادث وإلا لاحتاج مثلَها إلى المخصص فكان وصفه تعالى : ب { أحد } جامعاً للصفات السلبية . ومثلُ ذلك يُقال في مرادفه وهو وصف وَاحد .واصطلحوا على أن أحدية الله أحدية واجبة كاملة ، فالله تعالى واحد من جميع الوجوه ، وعلى كل التقادير فليس لكُنْه الله كثرة أصلاً لا كثرة معنوية وهي تعدد المقوّمات من الأجناس والفصول التي تتقوم منها المواهي ، ولا كثرةُ الأجزاء في الخارج التي تتقوم منها الأجسام . فأفاد وصف { أحد } أنه منزه عن الجنس والفصل والمادة والصورة ، والأعراض والأبعاض ، والأعضاء والأشكال والألوان وسائر ما ينافي الوحدة الكاملة كما إشار إليه ابن سينا .قال في «الكشاف» : «وفي قراءة النبي صلى الله عليه وسلم { اللَّه أحد } بغير { قل هو } اه ، ولعله أخذه مما روي أن النبي صلى الله عليه وسلم قال من قرأ : { اللَّه أحد } كان بِعَدْل ثلثثِ القرآن ، كما ذكره بأثر قراءة أبيّ بدون { قل } كما تأوله الطيبي إذ قال : وهذا استشهاد على هذه القراءة .وعندي إن صح ما روي من القراءة أن النبي صلى الله عليه وسلم لم يقصد بها التلاوة وإنما قصد الامتثال لما أمر بأن يقوله ، وهذا كما كان يُكثر أن يقول : \" سبحان ربي العظيم وبحمده اللهم اغفر لي \" يَتأول قوله تعالى : { فسبح بحمد ربك واستغفره } [ النصر : 3 ] .\n","ar.waseet":"قد افتتحت بفعل الأمر \" قل \" لإِظهار العناية بما بعد هذا الأمر من توجيهات حكيمة ، ولتلقينه صلى الله عليه وسلم الرد على المشركين الذين سألوه أن ينسب لهم ربه .و ( هو ) ضمير الشأن مبتدأ ، والجملة التى بعده خبر عنه .والأحد : هو الواحد فى ذاته وفى صفاته وفى أفعاله ، وفى كل شأن من شئونه ، فهو منزه عن التركيب من جواهر متعددة ، أو من مادة معينة ، كما أنه - عز وجل - منزه عن الجسمية والتحيز ، ومشابهة غيره .وفى الإِتيان بضمير الشأن هنا : إشارة إلى فخامة مضمون الجملة ، مع ما فى ذلك من زيادة التحقيق والتقرير ، لأن الضمير يشير إلى شئ مبهم تترقبه النفس ، فإذا جاء الكلام من بعده زال الإِبهام ، وتمكن الكلام من النفس فضل تمكن .وجئ بالخبر نكره وهو لفظ \" أحد \" لأن المقصود الإِخبار عن الله - تعالى - بأنه واحد ، ولو قيل : الله الأحد ، لأفاد أنه لا واحد سواه ، وليس هذا المعنى مقصودا هنا ، وإنما المقصود إثبات أنه واحد فى ذاته وصفاته وأفعاله . . ونفى ما زعمه المشركون وغيرهم ، من أنه - تعالى - مركب من أصول مادية أو غير مادية ، أو من أنه له شريك فى ملكه .\n","ar.baghawi":"مكية( قل هو الله أحد ) روى أبو العالية عن أبي بن كعب أن المشركين قالوا لرسول الله - صلى الله عليه وسلم - : انسب لنا ربك ، فأنزل الله تعالى هذه السورة .وروى أبو ظبيان ، وأبو صالح ، عن ابن عباس : أن عامر بن الطفيل وأربد بن ربيعة أتيا النبي - صلى الله عليه وسلم - فقال عامر : إلام تدعونا يا محمد ؟ قال : إلى الله ، قال : صفه لنا أمن ذهب هو ؟ أم من فضة ؟ أم من حديد ؟ أم من خشب ؟ فنزلت هذه السورة فأهلك الله أربد بالصاعقة وعامر بن الطفيل بالطاعون ، وقد ذكرناه في سورة الرعد .وقال الضحاك وقتادة ومقاتل : جاء ناس من أحبار اليهود إلى النبي - صلى الله عليه وسلم - فقالوا : صف لنا ربك يا محمد لعلنا نؤمن بك ، فإن الله أنزل نعته في التوراة ، فأخبرنا من أي شيء هو ؟ وهل يأكل ويشرب ؟ ومن يرث منه ؟ فأنزل الله هذه السورة .( قل هو الله أحد ) أي واحد ، ولا فرق بين الواحد والأحد ، يدل عليه قراءة ابن مسعود : قل هو الله الواحد .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6222.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6222.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6222.mp3","format":"mp3","local_path":null}}},{"verse":2,"arabic":"اللَّهُ الصَّمَدُ","transliteration":"Allah hus-samad","translations":{"en.ahmedali":"God the immanently indispensable.","en.ahmedraza":"“Allah is the Un-wanting.” (Perfect, does not require anything.)","en.arberry":"God, the Everlasting Refuge,","en.asad":"\"God the Eternal, the Uncaused Cause of All Being.","en.daryabadi":"Allah, the Independent,","en.hilali":"\"Allah-us-Samad (The Self-Sufficient Master, Whom all creatures need, He neither eats nor drinks).","en.pickthall":"Allah, the eternally Besought of all!","en.qaribullah":"the called upon.","en.sahih":"Allah, the Eternal Refuge.","en.sarwar":"God is Absolute.","en.yusufali":"Allah, the Eternal, Absolute;","en.maududi":"Allah, Who is in need of none and of Whom all are in need;","en.shakir":"Allah is He on Whom all depend.","en.itani":"God, the Absolute.","en.mubarakpuri":"\"Allah As-Samad.\"","en.qarai":"Allah is the All-embracing.","en.wahiduddin":"God, the Self-sufficient One."},"tafsir":{"ar.muyassar":"الله وحده المقصود في قضاء الحوائج والرغائب.","ar.jalalayn":"«الله الصمد» مبتدأ وخبر أي المقصود في الحوائج على الدوام.","ar.qurtubi":"الله الصمد أي الذي يصمد إليه في الحاجات . كذا روى الضحاك عن ابن عباس ، [ ص: 219 ] قال : الذي يصمد إليه في الحاجات ؛ كما قال - عز وجل - : ثم إذا مسكم الضر فإليه تجأرون . قال أهل اللغة : الصمد : السيد الذي يصمد إليه في النوازل والحوائج . قال :ألا بكر الناعي بخير بني أسد     بعمرو بن مسعود وبالسيد الصمدوقال قوم : الصمد : الدائم الباقي ، الذي لم يزل ولا يزال . وقيل : تفسيره ما بعده لم يلد ولم يولد . قال أبي بن كعب : الصمد : الذي لا يلد ولا يولد ؛ لأنه ليس شيء إلا سيموت ، وليس شيء يموت إلا يورث . وقال علي وابن عباس أيضا وأبو وائل شقيق بن سلمة وسفيان : الصمد : هو السيد الذي قد انتهى سؤدده في أنواع الشرف والسؤدد ؛ ومنه قول الشاعر :علوته بحسام ثم قلت له     خذها حذيف فأنت السيد الصمدوقال أبو هريرة : إنه المستغني عن كل أحد ، والمحتاج إليه كل أحد . وقال السدي : إنه : المقصود في الرغائب ، والمستعان به في المصائب . وقال الحسين بن الفضل : إنه : الذي يفعل ما يشاء ويحكم ما يريد . وقال مقاتل : إنه : الكامل الذي لا عيب فيه ؛ ومنه قول الزبرقان :سيروا جميعا بنصف الليل واعتمدوا     ولا رهينة إلا سيد صمدوقال الحسن وعكرمة والضحاك وابن جبير : الصمد : المصمت الذي لا جوف له ؛ قال الشاعر :شهاب حروب لا تزال جياده     عوابس يعلكن الشكيم المصمداقلت : قد أتينا على هذه الأقوال مبينة في الصمد ، في ( كتاب الأسنى ) وأن الصحيح منها . ما شهد له الاشتقاق ؛ وهو القول الأول ، ذكره الخطابي . وقد أسقط من هذه السورة من أبعده الله وأخزاه ، وجعل النار مقامه ومثواه ، وقرأ الله الواحد الصمد في الصلاة ، والناس يستمعون ، فأسقط : قل هو ، وزعم أنه ليس من القرآن . وغير لفظ أحد ، وادعى أن هذا هو الصواب ، والذي عليه الناس هو الباطل والمحال ، فأبطل معنى الآية ؛ لأن أهل التفسير قالوا : نزلت الآية جوابا لأهل الشرك لما قالوا لرسول الله - صلى الله عليه وسلم - : صف لنا ربك ، أمن ذهب هو أم من نحاس أم من صفر ؟ فقال الله - عز وجل - ردا عليهم : قل هو الله أحد ففي ( هو ) دلالة على موضع الرد ، ومكان الجواب ؛ فإذا سقط بطل معنى الآية ، وصح الافتراء على الله - عز وجل - ، والتكذيب لرسوله - صلى الله عليه وسلم - .\n","ar.miqbas":"اللَّهُ الصَّمَدُ (2)جملة ثانية محكية بالقول المحكية به جملة : { اللَّه أحد } ، فهي خبر ثان عن الضمير . والخبر المتعدد يجوز عطفه وفصله ، وإنما فصلت عن التي قبلها لأن هذه الجملة مسوقة لتلقين السامعين فكانت جديرة بأن تكون كل جملة مستقلة بذاتها غيرَ ملحقة بالتي قبلها بالعطف ، على طريقة إلقاء المسائل على المتعلم نحو أن يقول : الحوزُ شرط صحة الحُبس ، الحوز لا يتم إلا بالمعانية ، ونحو قولك : عنترة من فحول الشعراء ، عنترة من أبطال الفرسان .ولهذا الاعتبار وقع إظهار اسم الجلالة في قوله : { اللَّه الصمد } وكان مقتضى الظاهر أن يقال : هو الصمد .و { الصَمد } : السيد الذي لا يستغنى عنه في المهمات ، وهو سيد القوم المطاع فيهم .قال في «الكشاف» : وهو فَعَل بمعنى مفعول من : صَمَد إليه ، إذا قصده ، فالصمد المصمود في الحوائج . قلت : ونظيره السَّند الذي تُسند إليه الأمور المهمة . والفَلَق اسم الصباح لأنه يتفلق عنه الليل .و { الصمد } : من صفات الله ، والله هو الصمد الحق الكامل الصمدية على وجه العموم .فالصمد من الأسماء التسعة والتسعين في حديث أبي هريرة عند الترمذي . ومعناه : المفتقر إليه كلُّ ما عداه ، فالمعدوم مفتقر وجودُه إليه والموجود مفتقر في شؤونه إليه .وقد كثرت عبارات المفسرين من السلف في معنى الصمد ، وكلها مندرجة تحت هذا المعنى الجامع ، وقد أنهاها فخر الدين إلى ثمانية عشر قولاً . ويشمل هذا الاسمُ صفاتتِ الله المعنويةَ الإِضافية وهي كونه تعالى حيّاً ، عالماً ، مريداً ، قادراً ، متكلماً ، سميعاً ، بصيراً ، لأنه لو انتفى عنه أحد هذه الصفات لم يكن مصموداً إليه .وصيغة { اللَّه الصمد } صيغة قصر بسبب تعريف المسند فتفيد قصر صفة الصمدية على الله تعالى ، وهو قصر قلب لإِبطال ما تعوّده أهل الشرك في الجاهلية من دعائهم أصنامهم في حوائجهم والفزع إليها في نوائبهم حتى نَسُوا الله . قال أبو سفيان ليلة فتح مكة وهو بين يدي النبي صلى الله عليه وسلم وقال له النبي صلى الله عليه وسلم \" أما آن لك أن تشهد أن لا إله إلا الله : «لقد علمتُ أن لو كان معه إله آخر لقد أغنى عني شيئاً \" .\n","ar.waseet":"وقوله - سبحانه - ( الله الصمد ) أى : الله - تعالى - هو الذى يَصْمدُ إليه الخلق فى حوائجهم ، ويقصدونه وحده بالسؤال والطلب . . مأخوذ من قولهم صمد فلان إلى فلان . بمعنى توجه إليه بطلب العون والمساعدة .قال صاحب الكشاف : والصمد فعل بمعنى مفعول ، من صمد إليه إذا قصده ، وهو - سبحانه - المصمود إليه فى الحوائج ، والمعنى : هو الله الذى تعرفونه وتقرون بأنه خالق السموات والأرض ، وخالقكم ، وهو واحد متوحد بالإِلهية لا يشارك فيها ، وهو الذى يصمد إليه كل مخلوق لا يستغنون عنه ، وهو الغنى عنهم . .وجاء لفظ \" الصمد \" محلى بأل ، لإِفادة الحصر فى الواقع ونفس الأمر ، فإن قصد الخلق إليه - سبحانه - فى الحوائج ، أعم من الصد الإِرادى ، والقصد الطبيعى ، والقصد بحسب الاستعداد الأصلى ، الثابت لجميع المخلوقات إذ الكل متجه إليه - تعالى - طوعا وكرها .\n","ar.baghawi":"( الله الصمد ) قال ابن عباس ، ومجاهد والحسن وسعيد بن جبير : \" الصمد \" الذي لا جوف له .قال الشعبي : الذي لا يأكل ولا يشرب .وقيل : تفسيره ما بعده ، روى أبو العالية عن أبي بن كعب قال : \" الصمد \" الذي لم يلد ولم يولد ; لأن من يولد سيموت ، ومن يرث يورث منه .قال أبو وائل شقيق بن سلمة : هو السيد الذي قد انتهى سؤدده ، وهو رواية علي بن أبي طلحة عن ابن عباس ، قال : هو السيد الذي قد كمل في جميع أنواع السؤدد . وعن سعيد بن جبير أيضا : هو الكامل في جميع صفاته وأفعاله . وقيل : هو السيد المقصود في [ الحوائج . وقال السدي ] هو المقصود إليه في الرغائب المستغاث به عند المصائب . تقول العرب : صمدت فلانا أصمده صمدا - بسكون الميم - إذا قصدته [ والمقصود ] : صمد بفتح الميم .وقال قتادة : \" الصمد \" الباقي بعد فناء خلقه . وقال عكرمة : \" الصمد \" الذي ليس فوقه أحد ، وهو قول علي . وقال الربيع : الذي لا تعتريه الآفات . قال مقاتل بن حيان : الذي لا عيب فيه .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6223.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6223.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6223.mp3","format":"mp3","local_path":null}}},{"verse":3,"arabic":"لَمْ يَلِدْ وَلَمْ يُولَدْ","transliteration":"Lam yalid wa lam yoolad","translations":{"en.ahmedali":"He has begotten no one, and is begotten of none.","en.ahmedraza":"“He has no offspring, nor is He born from anything.”","en.arberry":"who has not begotten, and has not been begotten,","en.asad":"\"He begets not, and neither is He begotten;","en.daryabadi":"He begetteth not, nor Was He begotten.","en.hilali":"\"He begets not, nor was He begotten;","en.pickthall":"He begetteth not nor was begotten.","en.qaribullah":"Who has not given birth, and has not been born,","en.sahih":"He neither begets nor is born,","en.sarwar":"He neither begets nor was He begotten.","en.yusufali":"He begetteth not, nor is He begotten;","en.maududi":"He neither begot any nor was He begotten,","en.shakir":"He begets not, nor is He begotten.","en.itani":"He begets not, nor was He begotten.","en.mubarakpuri":"\"He begets not, nor was He begotten.\"","en.qarai":"He neither begat, nor was begotten,","en.wahiduddin":"He does not give birth, nor was He born,"},"tafsir":{"ar.muyassar":"ليس له ولد ولا والد ولا صاحبة.","ar.jalalayn":"«لم يلد» لانتفاء مجانسته «ولم يولد» لانتفاء الحدوث عنه.","ar.qurtubi":"وروى الترمذي عن أبي بن كعب : أن المشركين قالوا [ ص: 220 ] لرسول الله - صلى الله عليه وسلم - : انسب لنا ربك ؛ فأنزل الله - عز وجل - : قل هو الله أحد الله الصمد . والصمد : الذي لم يلد ولم يولد ؛ لأنه ليس شيء يولد إلا سيموت ، وليس شيء يموت إلا سيورث ، وأن الله تعالى لا يموت ولا يورث . ولم يكن له كفوا أحد قال : لم يكن له شبيه ولا عدل ، وليس كمثله شيء . وروي عن أبي العالية : أن النبي - صلى الله عليه وسلم - ذكر آلهتهم فقالوا : انسب لنا ربك . قال : فأتاه جبريل بهذه السورة قل هو الله أحد ، فذكر نحوه ، ولم يذكر فيه عن أبي بن كعب ، وهذا صحيح ؛ قاله الترمذي .قلت : ففي هذا الحديث إثبات لفظ قل هو الله أحد وتفسير الصمد ، وقد تقدم . وعن عكرمة نحوه . وقال ابن عباس : لم يلد كما ولدت مريم ، ولم يولد كما ولد عيسى وعزير . وهو رد على النصارى ، وعلى من قال : عزير ابن الله\n","ar.miqbas":"لَمْ يَلِدْ وَلَمْ يُولَدْ (3)جملة : { لم يلد } خبر ثاننٍ عن اسم الجلالة من قوله : { اللَّه الصمد } ، أو حال من المبتدأ أو بدل اشتمال من جملة { اللَّه الصمد } ، لأن من يصمد إليه لا يكون من حاله أن يلد لأن طلب الولد لقصد الاستعانة به في إقامة شؤون الوالد وتدارك عجزه ، ولذلك استدل على إبطال قولهم : { اتخذ اللَّه ولداً } بإثبات أنه الغنيّ في قوله تعالى : { قالوا اتخذ اللَّه ولداً سبحانه هو الغني له ما في السماوات الأرض } [ يونس : 68 ] فبعدَ أن أبطلت الآية الأولى من هذه السورة تعدد الإله بالأصالة والاستقلال ، أبطلت هذه الآية تعدد الإله بطريق تولد إله عن إله ، لأن المتولِّد مساوٍ لما تولَّد عنه .والتعدُّد بالتولد مساوٍ في الاستحالة لتعدد الإله بالأصالة لتساوي ما يلزم على التعدد في كليهما من فساد الأكوان المشار إليه بقوله تعالى : { لو كان فيهما آلهة إلا اللَّه لفسدتا } [ الأنبياء : 22 ] ( وهو برهان التمانع ) ولأنه لو تولد عن الله موجود آخر للزم انفصال جزء عن الله تعالى وذلك مناف للأحدية كما علمت آنفاً وبَطل اعتقاد المشركين من العرب أن الملائكة بنات الله تعالى فعبدوا الملائكة لذلك ، لأن البنوّة للإله تقتضي إلهية الابن قال تعالى : { وقالوا اتخذ الرحمن ولداً سبحانه بل عباد مكرمون } [ الأنبياء : 26 ] .وجملة { لم يولد } عطف على جملة { لم يلد } ، أي ولم يلده غيره ، وهي بمنزلة الاحتراس سدّاً لتجويز أن يكون له والِد ، فأردف نفي الولد بنفي الوالد . وإنما قدم نفي الولد لأنه أهم إذ قد نَسب أهل الضلالة الولَد إلى الله تعالى ولم ينسبوا إلى الله والِداً . وفيه الإِيماء إلى أن من يكون مولوداً مثل عيسى لا يكون إلها لأنه لو كان الإله مولوداً لكان وجوده مسبوقاً بعدم لا محالة ، وذلك محال لأنه لو كان مسبوقاً بعدم لكان مفتقراً إلى من يُخصصه بالوجود بعد العدم ، فحصل من مجموع جملة : { لم يلد ولم يولد } إبطالُ أن يكون الله والداً لِمولود ، أو مولوداً من والد بالصراحة . وبطلت إلهية كل مولود بطريق الكناية فبطلت العقائد المبنية على تولد الإله مثل عقيدة ( زرادشت ) الثانوية القائلة بوجود إلهين : إله الخير وهو الأصل ، وإله الشر وهو متولد عن إله الخير ، لأن إله الخير وهو المسمى عندهم ( يزدان ) فكَّر فكرةً سوء فتولد منه إله الشر المسمى عندهم ( أهرُمنْ ) ، وقد أشار إلى مذهبهم أبو العلاء بقوله: ... قَال أناس باطل زعمهمفراقِبوا الله ولا تَزْعُمُنْ ... فكَّر ( يزدان ) على غِرةفصيغَ من تفكيره ( أهْرُمُنْ ) ... وبطلت عقيدة النصارى بإلهية عيسى عليه السّلام بتوهمهم أنه ابن الله وأن ابن الإله لا يكون إلاّ إلها بأن الإله يستحيل أن يكون له ولد فليس عيسى بابن لله ، وبأن الإله يستحيل أن يكون مولوداً بعد عدم . فالمولود المتفق على أنه مولود يستحيل أن يكون إلها فبطل أن يكون عيسى إلها .فلما أبْطَلَت الجملةُ الأولى إلهية إله غير الله بالأصالة ، وأبْطَلَتْ الجملة الثانية إلهية غير الله بالاستحقاق ، أبْطَلَت هذه الجملة إلهية غير الله بالفرعية والتولد بطريق الكناية .وإنما نفي أن يكون الله والداً وأن يكون مولوداً في الزمن الماضي ، لأن عقيدة التولد ادعت وقوعَ ذلك في زمن مضى ، ولم يدع أحد أن الله سيتخذ ولداً في المستقبل .\n","ar.waseet":"وقوله - سبحانه - : ( لَمْ يَلِدْ ) تنزيه له - تعالى - عن أن يكون له ولد أو بنت ، لأن الولادة تقتضى انفصال مادة منه ، وذلك يقتضى التركيب المنافى للأحدية والصمدية ، أو لأن الولد من جنس أبيه ، وهو - تعالى - منزه عن مجانسه أحد .وقوله : ( وَلَمْ يُولَدْ ) تنزيه له - تعالى - عن أن يكون له أب أو أم ، لأن المولودية تقتضى - أيضا - التركيب المنافى للأحدية والصمدية ، أو لاقتضائها سبق العدم ، أو المجانسة ، وكل ذلك مستحيل عليه - تعالى - فهو - سبحانه - :( الأول والآخر والظاهر والباطن وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ )\n","ar.baghawi":"\"لم يلد ولم يولد\".\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6224.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6224.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6224.mp3","format":"mp3","local_path":null}}},{"verse":4,"arabic":"وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ","transliteration":"Wa lam yakul-lahu kufuwan ahad","translations":{"en.ahmedali":"There is no one comparable to Him.\"","en.ahmedraza":"“And there is none equal to Him.”","en.arberry":"and equal to Him is not any one.'","en.asad":"\"and there is nothing that could be compared with Him.","en.daryabadi":"And there hath never been co-equal with Him anyone.","en.hilali":"\"And there is none co-equal or comparable unto Him.\"","en.pickthall":"And there is none comparable unto Him.","en.qaribullah":"and there is none equal to Him'","en.sahih":"Nor is there to Him any equivalent.\"","en.sarwar":"There is no one equal to Him.","en.yusufali":"And there is none like unto Him.","en.maududi":"and none is comparable to Him.”","en.shakir":"And none is like Him.","en.itani":"And there is nothing comparable to Him.”","en.mubarakpuri":"\"And there is none comparable to Him.\"","en.qarai":"nor has He any equal.’","en.wahiduddin":"and there is nothing like Him.\""},"tafsir":{"ar.muyassar":"ولم يكن له مماثلا ولا مشابهًا أحد من خلقه، لا في أسمائه ولا في صفاته، ولا في أفعاله، تبارك وتعالى وتقدَّس.","ar.jalalayn":"«ولم يكن له كفواً أحد» أي مكافئًا ومماثلاً، وله متعلق بكفوًا، وقُدِّم عليه لأنه مَحطُّ القصد بالنفي وأَخَّر أحد وهو اسم يكن عن خبرها رعاية للفاصلة.","ar.qurtubi":"ولم يكن له كفوا أحد أي لم يكن له مثلا أحد . وفيه تقديم وتأخير ؛ تقديره : ولم يكن له كفوا أحد ؛ فقدم خبر كان على اسمها ، لينساق أواخر الآي على نظم واحد . وقرئ كفوا بضم الفاء وسكونها ، وقد تقدم في ( البقرة ) أن كل اسم على ثلاثة أحرف أوله مضموم ، فإنه يجوز في عينه الضم والإسكان ؛ إلا قوله تعالى : وجعلوا له من عباده جزءا لعلة تقدمت . وقرأ حفص كفوا مضموم الفاء غير مهموز . وكلها لغات فصيحة .القول في الأحاديث الواردة في فضل هذه السورة ؛ وفيه ثلاث مسائل :الأولى : ثبت في صحيح البخاري عن أبي سعيد الخدري : أن رجلا سمع رجلا يقرأ قل هو الله أحد يرددها ؛ فلما أصبح جاء إلى النبي - صلى الله عليه وسلم - فذكر ذلك له ، وكان الرجل يتقالها ؛ فقال رسول الله - صلى الله عليه وسلم - : والذي نفسي بيده إنها لتعدل ثلث القرآن . وعنه قال : قال النبي - صلى الله عليه وسلم - لأصحابه : أيعجز أحدكم أن يقرأ ثلث القرآن في ليلة ؟ فشق ذلك عليهم ، وقالوا : [ ص: 221 ] أينا يطيق ذلك يا رسول الله ؟ فقال : الله الواحد الصمد ثلث القرآن خرجه مسلم من حديث أبي الدرداء بمعناه . وخرج عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" احشدوا فإني سأقرأ عليكم ثلث القرآن \" فحشد من حشد ؛ ثم خرج نبي الله - صلى الله عليه وسلم - فقرأ قل هو الله أحد ثم دخل فقال بعضنا لبعض : إني أرى هذا خبرا جاءه من السماء ، فذاك الذي أدخله . ثم خرج فقال : \" إني قلت لكم سأقرأ عليكم ثلث القرآن ، ألا إنها تعدل ثلث القرآن \" قال بعض العلماء : إنها عدلت ثلث القرآن لأجل هذا الاسم ، الذي هو الصمد ، فإنه لا يوجد في غيرها من السور . وكذلك أحد . وقيل : إن القرآن أنزل أثلاثا ، ثلثا منه أحكام ، وثلثا منه وعد ووعيد ، وثلثا منه أسماء وصفات ، وقد جمعت قل هو الله أحد أحد الأثلاث ، وهو الأسماء والصفات . ودل على هذا التأويل ما في صحيح مسلم ، من حديث أبي الدرداء عن النبي - صلى الله عليه وسلم - قال : \" إن الله جل وعز جزأ القرآن ثلاثة أجزاء ، فجعل قل هو الله أحد جزءا من أجزاء القرآن \" . وهذا نص ؛ وبهذا المعنى سميت سورة الإخلاص ، والله أعلم .الثانية : روى مسلم عن عائشة : أن رسول الله - صلى الله عليه وسلم - بعث رجلا على سرية ، وكان يقرأ لأصحابه في صلاتهم ، فيختم ب قل هو الله أحد ؛ فلما رجعوا ذكروا ذلك للنبي - صلى الله عليه وسلم - فقال : \" سلوه لأي شيء يصنع ذلك \" ؟ فسألوه فقال : لأنها صفة الرحمن ، فأنا أحب أن أقرأ بها . فقال رسول الله - صلى الله عليه وسلم - : \" أخبروه أن الله - عز وجل - يحبه \" . وروى الترمذي عن أنس بن مالك قال : كان رجل من الأنصار يؤمهم في مسجد قباء ، وكان كلما افتتح سورة يقرؤها لهم في الصلاة فقرأ بها افتتح ب قل هو الله أحد ؛ حتى يفرغ منها ، ثم يقرأ بسورة أخرى معها ، وكان يصنع ذلك في كل ركعة ، فكلمه أصحابه ، فقالوا : إنك تقرأ بهذه السورة ، ثم لا ترى أنها [ ص: 222 ] تجزيك حتى تقرأ بسورة أخرى ، فإما أن تقرأ بها ، وإما أن تدعها وتقرأ بسورة أخرى ؟ قال : ما أنا بتاركها وإن أحببتم أن أؤمكم بها فعلت ، وإن كرهتم تركتكم ؛ وكانوا يرونه أفضلهم ، وكرهوا أن يؤمهم غيره ، فلما أتاهم النبي - صلى الله عليه وسلم - أخبروه الخبر ، فقال : \" يا فلان ما يمنعك مما يأمر به أصحابك ؟ وما يحملك أن تقرأ هذه السورة في كل ركعة \" ؟ فقال : يا رسول الله ، إني أحبها ؛ فقال رسول الله - صلى الله عليه وسلم - : \" إن حبها أدخلك الجنة \" . قال : حديث حسن غريب صحيح .قال ابن العربي : ( فكان هذا دليلا على أنه يجوز تكرار سورة في كل ركعة . وقد رأيت على باب الأسباط فيما يقرب منه ، إماما من جملة الثمانية والعشرين إماما ، كان يصلي فيه التراويح في رمضان بالأتراك ؛ فيقرأ في كل ركعة الحمد لله و قل هو الله أحد حتى يتم التراويح ؛ تخفيفا عليه ، ورغبة في فضلها وليس من السنة ختم القرآن في رمضان ) .قلت : هذا نص قول مالك ، قال مالك : وليس ختم القرآن في المساجد بسنة .الثالثة : روى الترمذي عن أنس بن مالك قال : أقبلت مع النبي - صلى الله عليه وسلم - فسمع رجلا يقرأ قل هو الله أحد ؛ فقال رسول الله - صلى الله عليه وسلم - : \" وجبت \" . قلت : وما وجبت ؟ قال : \" الجنة \" . قال : هذا حديث حسن صحيح . قال الترمذي : حدثنا محمد بن مرزوق البصري قال حدثنا حاتم بن ميمون أبو سهل عن ثابت البناني عن أنس بن مالك عن النبي - صلى الله عليه وسلم - قال : من قرأ كل يوم مائتي مرة قل هو الله أحد ، محي عنه ذنوب خمسين سنة ، إلا أن يكون عليه دين .وبهذا الإسناد عن النبي - صلى الله عليه وسلم - قال : \" من أراد أن ينام على فراشه ، فنام على يمينه ، ثم قرأ قل هو الله أحد مائة مرة ، فإذا كان يوم القيامة يقول الرب : يا عبدي ، ادخل على يمينك الجنة \" . قال : هذا حديث غريب من حديث ثابت عن أنس . وفي مسند أبي محمد الدارمي ، عن أنس بن مالك ، قال : قال رسول الله - صلى الله عليه وسلم - : \" من قرأ قل هو الله أحد خمسين [ ص: 223 ] مرة ، غفرت له ذنوب خمسين سنة \" قال : وحدثنا عبد الله بن يزيد قال حدثنا حيوة قال : أخبرني أبو عقيل : أنه سمع سعيد بن المسيب يقول : إن نبي الله - صلى الله عليه وسلم - قال : \" من قرأ قل هو الله أحد عشرة مرات بني له قصر في الجنة . ومن قرأها عشرين مرة بني له بها قصران في الجنة . ومن قرأها ثلاثين مرة بني له بها ثلاثة قصور في الجنة \" . فقال عمر بن الخطاب : والله يا رسول الله إذا لنكثرن قصورنا ؛ فقال رسول الله - صلى الله عليه وسلم - : \" الله أوسع من ذلك \" قال أبو محمد : أبو عقيل زهرة بن معبد ، وزعموا أنه كان من الأبدال . وذكر أبو نعيم الحافظ من حديث أبي العلاء يزيد بن عبد الله بن الشخير عن أبيه ، قال : رسول الله - صلى الله عليه وسلم - : \" من قرأ قل هو الله أحد في مرضه الذي يموت فيه ، لم يفتن في قبره . وأمن من ضغطة القبر . وحملته الملائكة يوم القيامة بأكفها ، حتى تجيزه من الصراط إلى الجنة \" . قال : هذا حديث غريب من حديث يزيد ، تفرد به نصر بن حماد البجلي . وذكر أبو بكر أحمد بن علي بن ثابت الحافظ عن عيسى بن أبي فاطمة الرازي قال : سمعت مالك بن أنس يقول : إذا نقس بالناقوس اشتد غضب الرحمن ، فتنزل الملائكة ، فيأخذون بأقطار الأرض ، فلا يزالون يقرءون قل هو الله أحد حتى يسكن غضبه جل وعز . وخرج من حديث محمد بن خالد الجندي عن مالك عن نافع عن ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : \" من دخل يوم الجمعة المسجد ، فصلى أربع ركعات يقرأ في كل ركعة بفاتحة الكتاب و قل هو الله أحد خمسين مرة فذلك مائتا مرة في أربع ركعات ، لم يمت حتى يرى منزله في الجنة أو يرى له \" .وقال أبو عمر مولى جرير بن عبد الله البجلي ، عن جرير قال : قال رسول الله - صلى الله عليه وسلم - : \" من قرأ قل هو الله أحد حين يدخل منزله ، نفت الفقر عن أهل ذلك المنزل وعن الجيران \" .وعن أنس قال قال رسول الله - صلى الله عليه وسلم - : \" من قرأ قل هو الله أحد مرة بورك عليه ، ومن قرأها مرتين بورك عليه وعلى أهله ، ومن قرأها ثلاث مرات بورك عليه وعلى جميع جيرانه ، ومن قرأها اثنتي عشرة بنى الله له اثني عشر قصرا في الجنة ، وتقول الحفظة انطلقوا بنا ننظر إلى قصر أخينا ، فإن قرأها مائة مرة كفر الله عنه ذنوب خمسين سنة ، ما خلا الدماء والأموال ، فإن قرأها أربعمائة مرة كفر الله عنه ذنوب مائة سنة ، فإن قرأها ألف مرة لم يمت حتى يرى مكانه في الجنة أو يرى [ ص: 224 ] له \" . وعن سهل بن سعد الساعدي قال : شكا رجل إلى رسول الله - صلى الله عليه وسلم - الفقر وضيق المعيشة ؛ فقال له رسول الله - صلى الله عليه وسلم - : \" إذا دخلت البيت فسلم إن كان فيه أحد ، وإن لم يكن فيه أحد فسلم علي ، واقرأ قل هو الله أحد مرة واحدة \" ففعل الرجل فأدر الله عليه الرزق ، حتى أفاض على جيرانه . وقال أنس : كنا مع رسول الله - صلى الله عليه وسلم - بتبوك ، فطلعت الشمس بيضاء لها شعاع ونور ، لم أرها فيما مضى طلعت قط كذلك ، فأتى جبريل ، فقال له رسول الله - صلى الله عليه وسلم - : \" يا جبريل ، ما لي أرى الشمس طلعت بيضاء بشعاع لم أرها طلعت كذلك فيما مضى قط \" ؟ فقال : \" ذلك لأن معاوية الليثي توفي بالمدينة اليوم ، فبعث الله سبعين ألف ملك يصلون عليه \" . قال \" ومم ذلك \" ؟ قال : \" كان يكثر قراءة قل هو الله أحد آناء الليل وآناء النهار ، وفي ممشاه وقيامه وقعوده ، فهل لك يا رسول الله أن أقبض لك الأرض . فتصلي عليه \" ؟ قال : \" نعم \" فصلى عليه ثم رجع . ذكره الثعلبي ، والله أعلم .\n","ar.miqbas":"وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (4)في معنى التذييل للجمل التي قبلها لأنها أعم من مضمونها لأن تلك الصفات المتقدمة صريحَها وكنايتها وضمنيَّها لا يشبهه فيها غيره ، مع إفادة هذه انتفاء شبيه له فيما عداها مثل صفات الأفعال كما قال تعالى : { إن الذين تدعون من دون اللَّه لن يخلقوا ذباباً ولو اجتمعوا له } [ الحج : 73 ] .والواو في قوله : { ولم يكن له كفؤاً } اعتراضية ، وهي واو الحال ، كالواو في قوله تعالى : { وهل يجازى إلا الكفور } [ سبأ : 17 ] فإنها تذييل لجملة { ذلك جَزَيْنَاهم بما كفروا } [ سبأ : 17 ] ، ويجوز كون الواو عاطفة إن جعلت الواو الأولى عاطفة فيكون المقصود من الجملة إثبات وصف مخالفته تعالى للحوادث وتكون استفادة معنى التذييل تبعاً للمعنى ، والنكت لا تتزاحم .والكُفُؤ : بضم الكاف وضم الفاء وهمزة في آخره . وبه قرأ نافع وأبو عمرو وأبو بكر عن عاصم وأبو جعفر ، إلا أن الثلاثة الأولين حَققوا الهمزة وأبو جعفر سهَّلها ويقال : «كُفْء» بضم الكاف وسكون الفاء وبالهمز ، وبه قرأ حمزة ويعقوب ، ويقال : { كفواً } بالواو عوض الهمز ، وبه قرأ حفص عن عاصم وهي لغات ثلاث فصيحة .ومعناه : المساوي والمماثل في الصفات .و { أحد } هنا بمعنى إنسان أو موجود ، وهو من الأسماء النكرات الملازمة للوقوع في حيّز النفي .وحصل بهذا جناس تام مع قوله : { قل هو الله أحد } .وتقديم خبر ( كان ) على اسمها للرعاية على الفاصلة وللاهتمام بذكر الكُفؤ عقب الفعل المنفي ليكون أسبق إلى السمع .وتقديم المجرور بقوله : { له } على متعلَّقه وهو { كفؤاً } للاهتمام باستحقاق الله نفي كفاءة أحد له ، فكان هذا الاهتمام مرجحاً تقديم المجرور على متعلَّقه وإن كان الأصل تأخير المتعلَّق إذا كان ظرفاً لغواً . وتأخيره عند سيبويه أحسن ما لم يقتض التقديمَ مقتضضٍ كما أشار إليه في «الكشاف» .وقد وردت في فضل هذه السورة أخبار صحيحة وحسنة استوفاها المفسرون . وثبت في الحديث الصحيح في «الموطأ» و«الصحيحين» من طرق عدة : أن رسول الله صلى الله عليه وسلم قال : \" { قل هو اللَّه أحد } تعدل ثلث القرآن \" .واختلفت التأويلات التي تأول بها أصحاب معاني الآثار لهذا الحديث ويجمعها أربعة تأويلات :الأول : أنها تعدل ثلث القرآن في ثواب القراءة ، أي تعدل ثلث القرآن إذا قُرىء بدونها حتى لو كررها القارىء ثلاث مرات كان له ثواب من قرأ القرآن كله .الثاني : أنها تعدل ثلث القرآن إذا قرأها من لا يحسن غيرها من سورة القرآن .الثالث : أنها تعدل ثلث معاني القرآن باعتبار أجناس المعاني لأنّ معاني القرآن أحكام وأخبار وتوحيد ، وقد انفردت هذه السورة بجمعها أصول العقيدة الإِسلامية ما لم يجمعه غيرها .وأقول : إن ذلك كان قبل نزول آيات مثلها مثل آية الكرسي ، أو لأنه لا توجد سورة واحدة جامعة لما في سورة الإخلاص .التأويل الرابع : أنها تعدل ثلث القرآن في الثواب مثل التأويل الأول ولكن لا يكون تكريرها ثلاث مرات بمنزلة قراءة ختمة كاملة .قال ابن رشد في «البيان والتحصيل» : أجمع العلماء على أن من قرأ : { قل هو اللَّه أحد } ثلاثَ مرات لا يساوي في الأجر من أحَيَا بالقرآن كله اه . فيكون هذا التأويل قيداً للتأويل الأول ، ولكن في حكايته الإِجماع على أن ذلك هو المراد نظر ، فإن في بعض الأحاديث ما هو صريح في أن تكريرها ثلاث مرات يعدل قراءة ختمة كاملة .قال ابن رشد : واختلافهم في تأويل الحديث لا يرتفع بشيء منه عن الحديث الإِشكال ولا يتخلص عن أن يكون فيه اعتراض .وقال أبو عمر بن عبد البر السكوت على هذه المسألة أفضل من الكلام فيها .\n","ar.waseet":"وقوله - عز وجل - ( وَلَمْ يَكُنْ لَّهُ كُفُواً أَحَدٌ ) تنزيه له - تعالى - عن الشبيه والنظير والمماثل .والكفؤ : هو المكافئ والمماثل والمشابه لغيره فى العمل أو فى القدرة .أى : ولم يكن أحد من خلقه مكافئاً ولا مشاكلا ولا مناظرا له - تعالى - فى ذاته ، أو صفاته ، أو أفعاله ، فهو كما قال - تعالى - : ( لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السميع البصير ) وبذلك نرى أن هذه السورة الكريمة قد تضمنت نفى الشصرك بجميع ألوانه .فقد نفى - سبحانه - عن ذاته التعددد بقوله : ( الله أَحَدٌ ) ونفى عن ذاته النقص والاحتياج بقوله : ( الله الصمد ) ونفى عن ذاته أن يكون والدا أو مولودا بقوله : ( لَمْ يَلِدْ وَلَمْ يُولَدْ ) ، ونفى عن نفسه الأنداد والأشباه بقوله : ( وَلَمْ يَكُنْ لَّهُ كُفُواً أَحَدٌ ) .كما نراها قد تضمنت الرد على المشركين وأهل الكتاب ، وغيرهم من أصحاب الفرق الضالة ، الذين يقولون ، بالتثليث ، وبأن هناك آلهة أخرى تشارك الله - تعالى - فى ملكه .وبغير ذلك من الأقاويل الفاسدة والعقائد الزائفة . . - سبحانه وتعالى - عما يقولون علوا كبيرا .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم .\n","ar.baghawi":"(ولم يكن له كفوا أحد ) قرأ حمزة وإسماعيل : \" كفؤا \" ساكنة الفاء مهموزا ، وقرأ حفص عن عاصم بضم الفاء من غير همز ، وقرأ الآخرون بضم الفاء مهموزا ، وكلها لغات صحيحة ، [ ومعناه ] المثل ، أي : هو أحد .وقيل : هو التقديم والتأخير ، مجازه : ولم يكن له أحد كفوا أي مثلا .قال مقاتل : قال مشركو العرب : الملائكة بنات الله ، وقالت اليهود : عزير ابن الله ، وقالت النصارى : المسيح ابن الله ، فأكذبهم الله ونفى عن ذاته الولادة والمثل .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا أبو اليمان ، أخبرنا شعيب عن الزهري ، أخبرنا أبو الزناد ، عن الأعرج ، عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : \" قال الله تعالى : كذبني ابن آدم ولم يكن له ذلك ، وشتمني ولم يكن له ذلك ، فأما تكذيبه إياي فقوله : لن يعيدني كما بدأني ، وليس أول الخلق بأهون علي من إعادته . وأما شتمه إياي فقوله : اتخذ الله ولدا ، وأنا الأحد الصمد الذي لم ألد ولم أولد ولم يكن لي كفوا أحد \" .أخبرنا أبو الحسن محمد بن محمد السرخسي أخبرنا أبو علي زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب عن مالك عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة الأنصاري عن أبيه ، عن أبي سعيد الخدري أن رجلا سمع رجلا يقرأ : \" قل هو الله أحد \" ويرددها ، فلما أصبح أتى رسول الله - صلى الله عليه وسلم - فذكر ذلك له ، وكأن الرجل يتقالها ، فقال له رسول الله - صلى الله عليه وسلم - : \" والذي نفسي بيده إنها لتعدل ثلث القرآن .أخبرنا أبو سعيد الشريحي ، أخبرنا أبو إسحاق الثعلبي ، أخبرنا أبو بكر محمد بن الحسن الأصفهاني ، أخبرنا عبد الله بن جعفر بن أحمد بن فارس ، حدثنا يونس بن حبيب ، حدثنا أبو داود الطيالسي ، حدثنا شعبة عن قتادة : سمعت سالم بن أبي الجعد يحدث عن معدان بن أبي طلحة عن أبي الدرداء أن النبي - صلى الله عليه وسلم - قال : \" أيعجز أحدكم أن يقرأ ثلث القرآن في ليلة \" ؟ قلت : يا رسول الله ومن يطيق ذلك ؟ قال : اقرأوا قل هو الله أحد \" .وأخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ، أخبرنا أبو إسحاق الهاشمي ، أخبرنا أبو مصعب عن مالك ، عن عبيد الله بن عبد الرحمن عن عبيد بن جبير مولى زيد بن الخطاب أنه قال : سمعت أبا هريرة يقول : أقبلت مع رسول الله فسمع رجلا يقرأ \" قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوا أحد \" فقال رسول الله : \" وجبت \" فسألته : ماذا يا رسول الله ؟ فقال : \" الجنة \" . فقال أبو هريرة : فأردت أن أذهب إلى الرجل فأبشره ، ثم فرقت أن يفوتني الغداء مع رسول الله - صلى الله عليه وسلم - فآثرت الغداء ، ثم ذهبت إلى الرجل فوجدته قد ذهب .أخبرنا أحمد بن عبد الله الصالحي ، أخبرنا أبو بكر أحمد بن الحسن الحيري ، أخبرنا حاجب بن أحمد الطوسي ، حدثنا عبد الرحيم بن منيب ، حدثنا يزيد بن هارون ، حدثنا المبارك بن فضالة عن ثابت ، عن أنس قال : قال رجل لرسول الله - صلى الله عليه وسلم - : إني أحب هذه السورة : \" قل هو الله أحد \" : قال : \" حبك إياها أدخلك الجنة \" .\n"},"audio":{"ar.abdullahbasfar":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdullahbasfar/6225.mp3","format":"mp3","local_path":null},"ar.abdurrahmaansudais":{"url":"https://cdn.islamic.network/quran/audio/192/ar.abdurrahmaansudais/6225.mp3","format":"mp3","local_path":null},"ar.abdulsamad":{"url":"https://cdn.islamic.network/quran/audio/64/ar.abdulsamad/6225.mp3","format":"mp3","local_path":null}}}],"metadata":{"words":19,"letters":124,"size":"39KB","priority":1,"commonlyRead":true}}