{
  "collection": "muslim",
  "book": 52,
  "name": {
    "arabic": "كتاب Characteristics of the Day of Judgment, Paradise, and Hell",
    "transliteration": "characteristics of the day of judgment, paradise, and hell",
    "translation": "Characteristics of the Day of Judgment, Paradise, and Hell"
  },
  "totalHadith": 79,
  "hadithNumberRange": {
    "first": 7045,
    "last": 7129
  },
  "content": [
    {
      "hadithNumber": 7045,
      "arabicNumber": "2785",
      "book": 52,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّهُ لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِينُ يَوْمَ الْقِيَامَةِ لاَ يَزِنُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ اقْرَءُوا ‏{‏ فَلاَ نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا‏}‏ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:A bulky person would be brought on the Day of judgment and he would not carry the weight to the eye of Allah equal even to that of a gnat. Nor shall We set up a balance for them on the Day of Resurrection\" (xviii)",
          "ur": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( قیامت کے دن ایک بہت بڑا ( اور ) موٹا آدمی آئے گا ، ( لیکن ) اللہ تعالیٰ کے نزدیک وہ ( وزن میں ) مچھر کے پر کے برابر بھی نہ ہوگا ( یہ آیت ) پڑھ لو : \" پس ہم قیامت کے دن ان کے لئے کوئی وزن قائم نہیں کریں گے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Le Jour du Jugement, une personne corpulente sera amenée, mais elle ne pèsera même pas autant qu’un moustique aux yeux d’Allah. » Puis il récita : « Nous ne leur accorderons aucune importance le Jour de la Résurrection. » (sourate 18, verset)",
          "id": "Telah menceritakan kepadaku [Abu Bakr bin Ishaq] telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepadaku [Al Mughirah Al Hizami] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: Sungguh pada hari kiamat akan datang seseorang yang berbadan gemuk namun di sisi Allah timbangannya tidak dapat melebihi berat sayap seekor nyamuk. Bacalah ayat; …dan kami tidak memberikan penimbangan terhadap (amal) mereka pada hari kiamat (Al Kahfi:)",
          "tr": "Bana Ebû Bekr b. İshâk rivayet etti. (Dediki): Bize Yahya b. Bükeyr rivayet etti. (Dediki): Bana Muğîra (yâni; El-Hızâmî) Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hureyre'den, o da Resûlulluh (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. (Şöyle buyurmuşlar) ; «Kıyamet gününde semiz, İri bir adam gelecek. Fakat Allah indinde bîr sivrisineğin kanadı kadar ağırlığı olmayacaktır, (Bîr de onlar için Kıyâmet gününde tartı dikmeyiz...) âyetini okuyun.» [Kehf 105] buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 7046,
      "arabicNumber": "2786.01",
      "book": 52,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا فُضَيْلٌ، - يَعْنِي ابْنَ عِيَاضٍ - عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ السَّلْمَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ جَاءَ حَبْرٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ أَوْ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ تَعَالَى يُمْسِكُ السَّمَوَاتِ يَوْمَ الْقِيَامَةِ عَلَى إِصْبَعٍ وَالأَرَضِينَ عَلَى إِصْبَعٍ وَالْجِبَالَ وَالشَّجَرَ عَلَى إِصْبَعٍ وَالْمَاءَ وَالثَّرَى عَلَى إِصْبَعٍ وَسَائِرَ الْخَلْقِ عَلَى إِصْبَعٍ ثُمَّ يَهُزُّهُنَّ فَيَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَعَجُّبًا مِمَّا قَالَ الْحَبْرُ تَصْدِيقًا لَهُ ثُمَّ قَرَأَ ‏{‏ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ‏}‏",
        "translations": {
          "en": "Abdullah b. Mas'ud reported that a Jewish scholar came to Allah's Apostle (may peace he upon him) and said:Muhammad, or Abu al-Qasim, verily, Allah, the Exalted and Glorious would carry the Heavens on the Day of Judgment upon one finger and earths upon one finger and the mountains and trees upon one finger and the ocean and moist earth upon one finger, and in fact the whole of the creation upon one finger, and then He would stir them and say: I am your Lord, I am your Lord. Thereupon Allah's Messenger (ﷺ) smiled testifying what that scholar had said. He then recited this verse:\" And they honour not Allah with the honour due to Him; and the whole earth will be in His grip on the Day of Resurrection and the heaven rolled up in His right hand. Glory be to Him I and highly Exalted is He above what they associate (with Him)\" (Az-Zumar:)",
          "ur": "افضیل بن عیاض نے منصور سے ، انھوں نے ابراہیم سے ، انھوں نے عبیدہ سلمانی سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک یہودی عالم نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور کہا : اے محمد ( صلی اللہ علیہ وسلم ) یا کہا : ابو القاسم! بے شک اللہ تعالیٰ قیامت کے دن آسمانوں کو ایک انگلی پر رکھ لے گا ، اور زمینوں کو ایک انگلی پر ، اور پہاڑوں اور درختوں کو ایک انگلی پر اورپانی اور گیلی مٹی کو ایک انگلی پر اور تمام مخلوق کو ایک انگلی پر تھام لے گا ، پھر ان کو بلائے گا اور فرمائے گا : \" بادشاہ میں ہوں ، بادشاہ میں ہوں ۔ \" رسول اللہ صلی اللہ علیہ وسلم اس یہودی عالم کی بات پر تعجب اور اس کے تصدیق کرتے ہوئےہنسے ، پھر آپ نے ( یہ آیت ) پڑھی : \" انھوں نے اس طرح اللہ کی قدر نہیں کی جس طرح اس کی قدر کرنے کا حق ہے ۔ ساری زمین اور سب کے سب آسمان قیامت کے دن اس کے دائیں ہاتھ میں لپٹے ہوئے ہوں گے ۔ وہ ( ہراس چیز کی شراکت سے ) پاک اور بلند ہے جنھیں وہ ( اس کے ساتھ ) شریک کر تے ہیں ۔",
          "fr": "Rapporté par Abdullah b. Mas'ud : Un savant juif vint voir le Messager d’Allah ﷺ et dit : « Muhammad, ou Abu al-Qasim, vraiment, Allah, le Très-Haut et Glorieux, portera les cieux le Jour du Jugement sur un doigt, la terre sur un autre doigt, les montagnes et les arbres sur un autre doigt, l’océan et la terre humide sur un autre doigt, et toute la création sur un autre doigt. Ensuite, Il les secouera et dira : “Je suis votre Seigneur, je suis votre Seigneur.” » Le Messager d’Allah ﷺ sourit pour confirmer ce que le savant avait dit, puis il récita ce verset : « Ils n’ont pas estimé Allah à Sa juste valeur ; la terre entière sera dans Sa poigne le Jour de la Résurrection, et les cieux seront enroulés dans Sa main droite. Gloire à Lui ! Il est bien au-dessus de ce qu’ils Lui associent. » (sourate Az-Zumar, verset)",
          "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdullah bin Yunus] telah menceritakan kepada kami [Fudhail bin 'Iyadl] dari [Manshur] dari [Ibrahim] dari ['Ubaidah As Salmani] dari ['Abdullah bin Mas'ud] dia berkata; \"Seorang pendeta datang kepada Nabi shallallahu 'alaihi wasallam lalu dia berkata; 'Wahai Muhammad, atau wahai Abu Qasim! Kelak di hari kiamat Allah Ta'ala memegang langit, bumi, gunung-gunung, pohon-pohon, air, binatang-binatang, dan seluruh makhluk dengan jari-Nya. Kemudian Dia goncangkan seluruhnya sambil berkata; 'Akulah Raja (Penguasa)! Akulah Raja! ' Rasulullah shallallahu 'alaihi wasallam pun tertawa mendengar pendeta itu dan membenarkannya. Kemudian beliau membaca ayat: 'Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya, padahal bumi seluruhnya dalam genggaman-Nya pada hari kiamat dan langit digulung-Nya dengan tangan kanan-Nya; Maha Suci Allah dan Maha Tinggi Dia dari apa yang mereka persekutukan.' (Az Zumar (39): 67). Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] keduanya dari [Jarir] dari [Manshur] dengan sanad ini, dia berkata; 'Seorang pendeta dari Yahudi datang kepada Nabi shallallahu 'alaihi wasallam -yang serupa dengan Hadits Fudlail namun dia tidak menyebutkan kalimat; 'kemudian Dia mengguncangkan seluruhnya.' Dan dia juga berkata; 'Sungguh aku melihat Rasulullah shallallahu 'alaihi wasallam tertawa hingga terlihat gigi seri beliau sebagai rasa takjub sekaligus membenarkannya. Kemudian Rasulullah shallallahu 'alaihi wasallam membaca ayat; 'Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya (QS. Azzumar 67) ….dan seterusnya",
          "tr": "Bize Ahmed b. Abdillah b. Yûnus rivayet etti. (Dediki): Bize Fudayl (yâni; îbni İyâd) Mansur'dan, o da İbrahim'den, o da Abide's-Selmânî'dcn, o da Abdullah b. Mes'ud'dan naklen rivayet etti. (Şöyle demiş): Bir âlim Nebi (Satlallahu Aleyhi ve Seilem)'e gelerek. — Yâ Muhammedi Yahut Yâ Eba'l-Kâsım! Şüphesiz ki, Allah Teâlâ kıyamet gününde gökleri bîr parmak üstünde, yerleri bir parmak üstünde, dağlarla ağaçları bir parmak üstünde, su ile toprağı bir parmak üstünde, sâir mahlûkatı da bir parmak üstünde tutacak, sonra onları sallayarak: — Melik benîm; Melik benim; buyuracaktır, dedi. Bunun üzerine Resûlullah (Sallallahu. Aleyhi ve Sellem) bu âlimin söylediğine şaşarak onu tasdik için güldü. Sonra şu âyeti okudu : «Onlar Allah'ı hakkıyla takdir etmemişlerdir. Halbuki Kıyamet gününde bütün yer ve gökler onun sağ elinde dürülüp toplanacaklardır. Onu tenzih ederim. O müşriklerin koştukları şirkten münezzehdir.» [Zümer]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 7047,
      "arabicNumber": "2786.02",
      "book": 52,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، بِهَذَا الإِسْنَادِ قَالَ جَاءَ حَبْرٌ مِنَ الْيَهُودِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ فُضَيْلٍ وَلَمْ يَذْكُرْ ثُمَّ يَهُزُّهُنَّ ‏.‏ وَقَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ تَعَجُّبًا لِمَا قَالَ تَصْدِيقًا لَهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏{‏ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ‏}‏ ‏\"‏ ‏.‏ وَتَلاَ الآيَةَ ‏.‏",
        "translations": {
          "en": "This hadlth has been narrated on the authority of Mansur with the same chain of truemittm (and the words are):A Jew scholar came to Allah's Messenger (ﷺ). The rest of the hadith is the same, but there is no mention of\" then He would stir them.\" But there is this addition:\" I saw Allah's Messengcr (ﷺ) smiling so much that his front teeth appeared and testifying him (th Jew scholar) ; then Allah's Messenger (ﷺ) recited the verse:\" And they honour not Allah with the honour due to Him\" (xxxix)",
          "ur": "جریر نے منصور سے اسی سند کے ساتھ روایت کی ، کہا : یہود میں سے ایک عالم رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، فضیل کی حدیث کے مانند ، اور اس میں یہ بیان نہیں کیا : \"\" وہ ( اللہ ) ان ( انگلیوں ) کو ہلائے گا ۔ \"\" اور ( حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو د یکھا ، آپ اس بات پر تعجب سے اس کی تصدیق کرتے ہوئے ( اس طرح ) ہنسے کہ آپ سے پچھلے دندان مبارک ظاہر ہوگئے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" انھوں نے ( اس طرح ) اللہ کی قدر نہیں کی ( جس طرح ) اس کی قدر کرنے کا حق ہے ۔ \"\" ( اور ( پوری ) آیت تلاوت فرمائی ۔",
          "fr": "Rapporté par Mansur : Ce hadith a été rapporté par Mansur avec la même chaîne de transmetteurs (et les mots sont) : Un savant juif vint voir le Messager d’Allah ﷺ. Le reste du hadith est le même, sauf qu’il n’est pas mentionné « ensuite Il les secouera ». Mais il y a cette précision : « J’ai vu le Messager d’Allah ﷺ sourire au point que ses dents de devant étaient visibles, confirmant les propos du savant juif ; puis le Messager d’Allah ﷺ récita le verset : “Ils n’ont pas estimé Allah à Sa juste valeur.” » (sourate 39, verset)",
          "tr": "Bize Osman b. Ebî Şeybe ile İshak b. İbrahim rivayet etti. Her iki râvi Cerir'den, o da Mansur'dan bu isnadla rivayette bulumiıuşlardır. Mansûr: Yahudilerden bir âlim Resulullah (Sallallahu Aleyhi ve Sellem)'e geldi, diyerek Fudayl'ın hadîsi gibi rivayette bulunmuş. Fakat: «Sonra onları sallayacak...» dememiştir. O şunu söylemiştir: — Gerçekten Resulullah (Sallallahu Aleyhi ve Sellem)'in onun söylediğine şaşarak kendisini tasdik için güldüğünü gördüm. Hattâ yan dişleri göründü. Sonra Resulullah (Sallallahu Aleyhi ve Sellem): «Onlar Allah'ı hakkıyle takdir etmediler.» dedi ve âyeti okudu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 7048,
      "arabicNumber": "2786.03",
      "book": 52,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، يَقُولُ سَمِعْتُ عَلْقَمَةَ، يَقُولُ قَالَ عَبْدُ اللَّهِ جَاءَ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا أَبَا الْقَاسِمِ إِنَّ اللَّهَ يُمْسِكُ السَّمَوَاتِ عَلَى إِصْبَعٍ وَالأَرَضِينَ عَلَى إِصْبَعٍ وَالشَّجَرَ وَالثَّرَى عَلَى إِصْبَعٍ وَالْخَلاَئِقَ عَلَى إِصْبَعٍ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَنَا الْمَلِكُ ‏.‏ قَالَ فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَرَأَ ‏{‏ وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ‏}‏",
        "translations": {
          "en": "Abdullah reported that a person from the People of the Book came to Allah's Apostle (may peace he upon him) and said:Abu al-Qasim, verily, Allah holds the Heavens upon one finger and the earths upon one finger and the trees and moist earth upon one finger and in fact the whole of the creation upon one finger and then say: I am the King. I am the King. And he (the narrator) further said: I saw Allah's Messenger (ﷺ) smiling until his front teeth became visible and then he recited the verse: \"And they measure not the power of Allah with His true measure\" (39:)",
          "ur": "حفص بن غیاث نے کہا : ہمیں اعمش نے حدیث بیان کی ، انھوں نے کہا : میں نے ابراہیم کو کہتے ہوئے سنا : میں نے علقمہ کو کہتے ہوئے سنا کہ حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے کہا : اہل کتاب میں سے ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور اس نے کہا : ابو القاسم! بے شک اللہ تعالیٰ تمام آسمانوں کو ایک انگلی پر ، زمینوں کو ایک انگلی پر اور درختوں اور گیلی مٹی کو ایک انگلی پر اور تمام مخلوق کو ایک انگلی پر تھام لے گا ، پھر فرمائے گا : \" بادشاہ میں ہوں بادشاہ میں ہوں ۔ \" ( ابن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ ( اس بات پر ) ہنس پڑے یہاں تک کہ آپ کے پچھلے دندان مبارک ظاہر ہوئے ، پھرآپ نے ( اس آیت کی ) تلاوت کی : \" انھوں نے اللہ تعالیٰ کی ( اس طرح قدر نہیں پہچانی جس طرح قدر پہچاننے کا حق ہے ۔)",
          "fr": "Rapporté par Abdullah : Un homme parmi les gens du Livre vint voir le Messager d’Allah ﷺ et dit : « Abu al-Qasim, vraiment, Allah porte les cieux sur un doigt, la terre sur un autre, les arbres et la terre humide sur un autre, et toute la création sur un autre doigt, puis Il dira : “Je suis le Roi, Je suis le Roi.” » Le narrateur ajouta : « J’ai vu le Messager d’Allah ﷺ sourire au point que ses dents de devant étaient visibles, puis il récita le verset : “Ils n’ont pas estimé la puissance d’Allah à sa juste valeur.” » (sourate 39, verset)",
          "id": "Telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Al A'masy] dia berkata; aku mendengar [Ibrahim] berkata; aku mendengar ['Alqamah] berkata; ['Abdullah] berkata;; \"Seorang laki-laki dari ahlu kitab datang kepada Nabi shallallahu 'alaihi wasallam lalu dia berkata; 'Wahai Abu Qasim! Kelak di hari kiamat Allah Ta'ala memegang langit, bumi, pohon-pohon, binatang-binatang, dan seluruh makhluk dengan jari-Nya seraya berkata; 'Akulah Raja (Penguasa)! Akulah Raja! ' Abdullah berkata; 'Maka aku melihat Rasulullah shallallahu 'alaihi wasallam pun tertawa hingga nampak gigi serinya. Kemudian beliau membaca ayat: 'Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya. (QS. Azzumar 67).' Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] mereka berdua berkata; telah menceritakan kepada kami [Abu Mu'awiyah] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Ali bin Khasyram] mereka berdua berkata; telah mengabarkan kepada kami ['Isa bin Yunus] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami ['Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] semuanya dari [Al A'masy] dengan sanad ini. Namun di semua Hadits mereka disebutkan lafazh; 'pohon-pohon dan binatang binatang. sedangkan di dalam Hadits Jarir tidak di sebutkan; lafazh 'makhluk-makhluk' akan tetapi disebutkan lafazh gunung-gunung juga ada tambahan; sebagai pembenaran terhadapnya dan rasa kagum terhadap apa yang dia katakan",
          "tr": "Bize Ömer b. Hafs b. Gıyâs rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize A'meş rivayet etti. (Dediki): Ben İbrahim'i şöyle derken işittim: Alkame'yi dinledim, şunu söylüyordu: Abdullah dedi ki: Ehl-i Kitabdan bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek: — Yâ Eba'l-Kâsim! Şüphesiz ki, Allah gökleri bir parmak üzerinde, yerleri bir parmak üzerinde, ağaçlarla toprağı bir parmak üzerinde, mahlûkatı da bir parmak üzerinde tutacak; sonra : — Melik benim, Melik benim! buyuracaktır, dedi. Abdullah demiş ki: Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem)'in güldüğünü gordüm. Hattâ yan dişleri göründü. Sonra : «Onlar Allah'ı haklayle takdir etmediler.» âyetini okudu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 7049,
      "arabicNumber": "2786.04",
      "book": 52,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ، بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِهِمْ جَمِيعًا وَالشَّجَرَ عَلَى إِصْبَعٍ وَالثَّرَى عَلَى إِصْبَعٍ وَلَيْسَ فِي حَدِيثِ جَرِيرٍ وَالْخَلاَئِقَ عَلَى إِصْبَعٍ ‏.‏ وَلَكِنْ فِي حَدِيثِهِ وَالْجِبَالَ عَلَى إِصْبَعٍ ‏.‏ وَزَادَ فِي حَدِيثِ جَرِيرٍ تَصْدِيقًا لَهُ تَعَجُّبًا لِمَا قَالَ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters but with a slight variation of wording",
          "ur": "ابو معاویہ ، عیسی بن یونس اور جریر سب نے اعمش سے اسی سند کے ساتھ روایت کی ، مگران سب کی روایتوں میں ہے : \" اور درختوں کو ایک انگلی پر اور گیلی مٹی کو ایک انگلی پر تھام لےگااور جریر کی حدیث میں یہ نہیں ہے \" اور مخلوق کو ایک انگلی پر تھامے گا \" لیکن اس کی حدیث میں یہ ہے : \" اور پہاڑوں کو ایک انگلی پر تھام لے گا \" اور انھوں نے جریر کی حدیث میں مذید یہ کہا : \" اس کی بات کی تصدیق اور اس پر تعجب کا اظہار کرتے ہوئے ( آپ ہنسے ۔)",
          "fr": "Rapporté par A'mash : Ce hadith a été rapporté par A'mash avec la même chaîne de transmetteurs mais avec une légère variation dans les mots",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Ebû Muâviye rivayet etti. H. Bize İshak b. İbrahim ile Alî b. Haşrem de rivayet ettiler. (Dedilerki): Bize İsa b. Yûnus haber verdi. H. Bize Osman b. Ebî Şcybe dahi rivayet etti. (Dediki): Bize Cerîr rivayet etti. Bu râvilerin hepsi A'meş'den bu isııadla rivayette bulunmuşlardır. Şu kadar var ki: Her birinin hadîsinde: «Ağaçları bir parmak üzerinde ve toprağı bîr parmak üzerinde...» ifâdeleri vardır. Cerir'in hadîsinde: «Mahlûkatı da bir parmak üstünde...» ifâdesi yoktur. .Lâkin onun hadîsinde: «Dağları da bir parmak üstünde...» ibaresi vardır. Cerir'in hadîsinde şu ziyâde de vardır: «Onu tasdik için söylediğine şaşarak...»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 7050,
      "arabicNumber": "2787",
      "book": 52,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي ابْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَقْبِضُ اللَّهُ تَبَارَكَ وَتَعَالَى الأَرْضَ يَوْمَ الْقِيَامَةِ وَيَطْوِي السَّمَاءَ بِيَمِينِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الأَرْضِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:Allah, the Exalted and Glorious, will take in His grip the Earth on the Day of Judgment and He would roll up the sky in His right hand and would say: I am the Lord; where are the sovereigns of the world?",
          "ur": "ابن مسیب نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ بیان کیا کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ قیامت کے دن زمین کو اپنی مٹھی میں لے لے گا اور آسمان کو اپنے داہنے ہاتھ میں لپیٹ لے گا ، پھر فرمائے گا : \" بادشاہ میں ہوں ، زمین کے بادشاہ کہاں ہیں؟",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Allah, le Très-Haut et Glorieux, saisira la Terre dans Sa poigne le Jour du Jugement, enroulera le ciel dans Sa main droite et dira : “Je suis le Seigneur ; où sont les souverains du monde ?” »",
          "id": "Telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Ibnul Musayyab] bahwasanya [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kelak di hari kiamat Allah Tabaraka wa Ta'ala akan menggenggam bumi dan menggulung langit dengan tangan kanan-Nya. Kemudian Dia berfirman: 'Akulah Raja (penguasa)! Mana yang mengaku raja-raja di bumi?",
          "tr": "Bana Harmele b. Yahya rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihab'dan naklen haber verdi. (Demişki): Bana İbni Müseyyeb rivayet etti ki, Ebû Hureyre şöyle diyormuş: Resûlullah (Sallallahu Aleyhi ve Sellem) buyurdular ki: «Kıyamet gününde Allah Tebareke ve Teâla yeri kabzeder, göğü de sağ eliyle dürer. Sonra: Melîk benim! Nerede yerin melikleri? buyurur.» İZAH 2788 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 7051,
      "arabicNumber": "2788.01",
      "book": 52,
      "hadithInBook": 7,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ، عَنْ سَالِمِ، بْنِ عَبْدِ اللَّهِ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَطْوِي اللَّهُ عَزَّ وَجَلَّ السَّمَوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ثُمَّ يَطْوِي الأَرَضِينَ بِشِمَالِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ أَيْنَ الْمُتَكَبِّرُونَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. 'Umar reported Allah's Messenger (ﷺ) saying:Allah, the Exalted and Glorious, would fold the Heavens on the Day of Judgment and then He would place them on His right hand and say: I am the Lord; where are the haughty and where are the proud (today)? He would fold the' earth (placing it) on the left hand and say: I am the Lord; where are the haughty and where are the proud (today)?",
          "ur": "سالم بن عبداللہ نے کہا : مجھے عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے خبر دی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل قیامت کےدن آسمانوں کو لپیٹے گا ، پھران کو دائیں ہاتھ سے پکڑ لے گا اور فرمائے گا : بادشاہ میں ہوں ۔ ( آج دوسروں پر ) جبر کرنے والے کہاں ہیں؟تکبر کرنے والے کہاں ہیں؟پھر بائیں ہاتھ سے زمین کو لپیٹ لے گا ، پھر فرمائے گا : \" بادشاہ میں ہوں ، ( آج ) جبر کرنےوالے کہاں ہیں؟تکبر کرنے والے کہاں ہیں؟ ‘ ‘",
          "fr": "Rapporté par Abdullah b. 'Umar : Le Messager d’Allah ﷺ a dit : « Allah, le Très-Haut et Glorieux, pliera les cieux le Jour du Jugement, puis les placera dans Sa main droite et dira : “Je suis le Seigneur ; où sont les orgueilleux et les arrogants aujourd’hui ?” Il pliera la terre et la placera dans Sa main gauche et dira : “Je suis le Seigneur ; où sont les orgueilleux et les arrogants aujourd’hui ?” »",
          "id": "Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari ['Umar bin Hamzah] dari [Salim bin 'Abdullah] telah mengabarkan kepadaku ['Abdullah bin 'Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Pada hari kiamat kelak, Allah Subhanahu wa Ta'ala akan melipat langit. Setelah itu, Allah akan menggenggamnya dengan tangan kanan-Nya sambil berkata: 'Akulah Sang Maha Raja. Di manakah sekarang orang-orang yang selalu berbuat sewenang-wenang? Dan di manakah orang-orang yang selalu sombong dan angkuh? ' Setelah itu, Allah akan melipat bumi dengan tangan kiri-Nya sambil berkata: 'Akulah Sang Maha Raja. Di manakah sekarang orang-orang yang sering berbuat sewenang-wenang? Di manakah orang-orang yang sombong?",
          "tr": "Bize Ebû Bekr b. Ebi Şeybe de rivayet etti. (Dediki): Bize Ebû Usâme, Ömer b, Hamza'dan, o da Salim b. Abdillah'dan naklen rivayet etti. (Demişki): Bana Abdullah b. Ömer haber verdi. (Dediki): Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: «Allah (Azze ve Celle) Kıyamet gününde gökleri dürecek; sonra onları sağ eline alacaktır. Sonra: Melik benim; cebbarlar nerede? Nerede mütekebbirler? diyecektir. Sonra sol eliyle yerleri dürecek. Sonra: Melîk benim. Cebbarlar nerede? Nerede mütekebbirler? buyuracaktır.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 7052,
      "arabicNumber": "2788.02",
      "book": 52,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - حَدَّثَنِي أَبُو حَازِمٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، أَنَّهُ نَظَرَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ كَيْفَ يَحْكِي رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَأْخُذُ اللَّهُ عَزَّ وَجَلَّ سَمَوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ فَيَقُولُ أَنَا اللَّهُ - وَيَقْبِضُ أَصَابِعَهُ وَيَبْسُطُهَا - أَنَا الْمَلِكُ ‏\"‏ حَتَّى نَظَرْتُ إِلَى الْمِنْبَرِ يَتَحَرَّكُ مِنْ أَسْفَلِ شَىْءٍ مِنْهُ حَتَّى إِنِّي لأَقُولُ أَسَاقِطٌ هُوَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم",
        "translations": {
          "en": "Abdullah b. Miqsam reported that he saw Abdullah b. Umar as he narrated Allah's Messenger (ﷺ) as saying:Allah, the Exalted and Glorious, would take in His hand His Heavens and His Earth, and would say: I am Allah. And He would clench His fingers and then would open them (and say): I am your Lord. I saw the pulpit in commotion from underneath because of something (vib-ating) there. And (I felt this commotion so much) that I said (to myself): It may not fall with Allah's Massenger (ﷺ) upon it",
          "ur": "یعقوب بن عبدالرحمان نے کہا : مجھے ابو حازم نے عبیداللہ بن مقسم سے حدیث بیان کی ، انھوں نے حضر ت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کی طرف دیکھا کہ وہ ( حدیث بیان کرتے ہوئے عملاً ) کس طرح رسول اللہ صلی اللہ علیہ وسلم کی طرح کرکے دکھاتے ہیں ۔ ( ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ) فرمایا : \" اللہ عزوجل اپنے آسمانوں اور اپنی زمینوں کو اپنے دونوں ہاتھوں سے پکڑ لے گا پھر فرمائے گا \" میں اللہ ، میں بادشاہ ہوں ۔ \" اور آپ صلی اللہ علیہ وسلم ا پنی انگلیوں کو بند کرتے تھے اور کھولتے تھے ۔ حتیٰ کہ میں نے منبر کو دیکھا ، وہ اپنے نچلے حصے سے ( لے کر او پرکے حصے تک ) ہل رہاتھا ۔ یہاں تک کہ میں نے کہا : کیا وہ رسول اللہ صلی اللہ علیہ وسلم کو لے کر گرجائے گا؟",
          "fr": "Rapporté par Abdullah b. Miqsam : Il a vu Abdullah b. Umar rapporter que le Messager d’Allah ﷺ a dit : « Allah, le Très-Haut et Glorieux, prendra dans Sa main les cieux et la terre et dira : “Je suis Allah.” » Puis Il serrera Ses doigts et les ouvrira (en disant) : « Je suis votre Seigneur. » J’ai vu la chaire trembler en dessous, comme si quelque chose vibrait. J’ai eu si peur que je me suis dit : « Elle pourrait tomber avec le Messager d’Allah ﷺ dessus. »",
          "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Ya'qub bin 'Abdurrahman] telah menceritakan kepadaku [Abu Hazim] dari ['Ubaidullah bin Miqsam] bahwsanya dia pernah bertanya kepda ['Abdulah bin 'Umar]; Apa yang diceritakan oleh Rasulullah shallallahu 'alaihi wasallam? Dia menjawab; Beliau bersabda: \"Allah Azza Wa Jalla, menggenggam langit dan bumi dengan tangan-Nya seraya berfirman: Akulah Allah. Kemudian Dia genggam dan bentangkan jari-jari-Nya seraya berseru: 'Akulah Raja. Ibnu Umar berkata: hingga aku melihat bagian bawah mimbar bergerak-gerak. Sampai-sampai aku bergumam; \"Apakah mimbar tersebut akan roboh bersama Rasulullah shallallahu 'alaihi wasallam? Telah menceritakan kepada kami [Sa'id bin Manshur] Telah menceritakan kepada kami [Abdul Aziz bin Abu hazim] telah menceritakan kepadaku [bapakku] dari ['Ubaidullah bin Miqsam] dari ['Abdullah bin 'Umar] dia berkata; aku melihat Rasulullah shallallahu 'alaihi wasallam berada di atas mimbar seraya bersabda: \"Dzat yang Maha Perkasa, menggenggam langit dan bumi dengan tangan-Nya. -lalu dia menyebutkan yang serupa dengan Hadits Ya'qub",
          "tr": "Bize Saîd b. Mansûr rivayet etti, (Dediki): Bize Yakub (yâni; İbni Abdirrahman) rivayet etti. (Dediki): Bana Ebû Kâzim, Ubeydullah b. Miksem'den rivayet ettiki, kendisi Abdullah b. Ömer'in, Resûlullah (Sallallahu Aleyhi ve Sellem)'i nasıl taklid ettiğine bakmış: «Allah (Azze ve Celle) gökleriyle yerlerini ikî eliyle tutacak ve: Allah benim! Melik benim! buyuracaktır.» demiş. Parmaklarını yummuş ve açmış. (Abdullah demişki:) Hattâ minbere baktım, altından bir şey kıpırdıyordu. Kendi kendime : Acaba bu minber Resulullah (Sallallahu Aleyhi ve Sellem)'i düşürecek mi, dedim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 7053,
      "arabicNumber": "2788.03",
      "book": 52,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، حَدَّثَنِي أَبِي، عَنْ عُبَيْدِ، اللَّهِ بْنِ مِقْسَمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ ‏ \"‏ يَأْخُذُ الْجَبَّارُ عَزَّ وَجَلَّ سَمَوَاتِهِ وَأَرَضِيهِ بِيَدَيْهِ ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ يَعْقُوبَ ‏.‏",
        "translations": {
          "en": "Abdullah b. Miqsam reported that 'Abdullah b. 'Umar reported:I saw Allah'h Messenger (ﷺ) upon the pulpit and he was saying that the Mighty Lord, the Exalted and Glorious would take hold of the Heavens and earth in His hand. The rest of the hadith is the same",
          "ur": "عبدالعزیز بن ابی حازم نے کہا : مجھے میرے والد نے عبیداللہ بن مقسم سے حدیث بیان کی ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر دیکھا جب آپ صلی اللہ علیہ وسلم فرمارہے تھے : \" ( اللہ ) جبارعزوجل اپنے آسمانوں اور اپنی زمینوں کو اپنے ہاتھوں میں پکڑ لے گا ۔ \" پھر یعقوب کی حدیث کی طرح بیان کیا ۔",
          "fr": "Rapporté par Abdullah b. Miqsam d’après 'Abdullah b. 'Umar : J’ai vu le Messager d’Allah ﷺ sur la chaire, disant que le Seigneur Tout-Puissant, le Très-Haut et Glorieux, saisira les cieux et la terre dans Sa main. Le reste du hadith est le même",
          "tr": "Bire Saîd b. Mansûr rivayet etti. (Dediki): Bize Abdu'l-Aziz b. Ebi Hazim rivayet etti. (Dediki): Bana babam, Ubeydullah b. Miksem'den, o da Abdullah b. Ömer'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem)'i minber üzerinde gördüm: «Cebbar (Azze ve Celle) gökleriyle yerlerini iki eliyle tutacak...» buyuruyordu. Sonra Ya'kub'un hadîsi gibi rivayette bulunmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 7054,
      "arabicNumber": "2789",
      "book": 52,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ أَيُّوبَ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِي فَقَالَ ‏ \"‏ خَلَقَ اللَّهُ عَزَّ وَجَلَّ التُّرْبَةَ يَوْمَ السَّبْتِ وَخَلَقَ فِيهَا الْجِبَالَ يَوْمَ الأَحَدِ وَخَلَقَ الشَّجَرَ يَوْمَ الاِثْنَيْنِ وَخَلَقَ الْمَكْرُوهَ يَوْمَ الثُّلاَثَاءِ وَخَلَقَ النُّورَ يَوْمَ الأَرْبِعَاءِ وَبَثَّ فِيهَا الدَّوَابَّ يَوْمَ الْخَمِيسِ وَخَلَقَ آدَمَ عَلَيْهِ السَّلاَمُ بَعْدَ الْعَصْرِ مِنْ يَوْمِ الْجُمُعَةِ فِي آخِرِ الْخَلْقِ وَفِي آخِرِ سَاعَةٍ مِنْ سَاعَاتِ الْجُمُعَةِ فِيمَا بَيْنَ الْعَصْرِ إِلَى اللَّيْلِ ‏\"‏ ‏.‏ قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْبِسْطَامِيُّ، - وَهُوَ الْحُسَيْنُ بْنُ عِيسَى - وَسَهْلُ بْنُ عَمَّارٍ وَإِبْرَاهِيمُ ابْنُ بِنْتِ حَفْصٍ وَغَيْرُهُمْ عَنْ حَجَّاجٍ، بِهَذَا الْحَدِيثِ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that Allah's Messenger (ﷺ) took hold of my hands and said:Allah, the Exalted and Glorious, created the clay on Saturday and He created the mountains on Sunday and He created the trees on Monday and He created the things entailing labour on Tuesday and created light on Wednesday and He caused the animals to spread on Thursday and created Adam (peace be upon him) after 'Asr on Friday; the last creation at the last hour of the hours of Friday, i. e. between afternoon and night. This hadith is narrated through another chain of transmitters",
          "ur": "سریج بن یونس اور ہارون بن عبداللہ نے مجھے حدیث بیان کی ، دونوں نے کہا : ہمیں حجاج بن محمد نے حدیث بیان کی ، انھوں نے کہا : ابن جریج نے کہا : مجھے اسماعیل بن امیہ نے ایوب بن خالد سے حدیث بیان کی ۔ انھوں نے ام سلمہ رضی اللہ تعالیٰ عنہا کے آزاد کردہ غلام عبداللہ بن رافع سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے میرا ہاتھ پکڑا ، پھر فرمایا : \"\" اللہ عزوجل نے مٹی ( زمین ) کو ہفتے کےدن پیداکیا اور اس میں پہاڑوں کو اتوار کے دن پیدا کیا اور درختوں کو پیر کے دن پیدا کیا اور ناپسندیدہ چیزوں کو منگل کےدن پیدا کیا اور نور کو بدھ کے دن پیدا کیا اور اس میں چوپایوں کو جمعرات کے دن پھیلادیا اور سب مخلوقات کے آخر میں آخر میں آدم علیہ السلام کو جمعہ کے دن عصر کے بعد سے لے کر رات تک کے درمیان جمعہ ( کے دن کی آخری ساعتوں میں سے کسی ساعت میں پیدا فرمایا ۔ \"\" جلودی نے ہمیں حدیث بیان کی ، کہا : ہمیں امام مسلم رحمۃاللہ علیہ کے شاگرد ابراہیم نے حدیث بیان کی ، کہا : ہمیں حسین بن علی بسطامی ، سہل بن عمار ، حفص کے نواسے ابراہیم اور دوسروں نے حجاج سے یہی حدیث بیان کی ۔)",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a pris mes mains et a dit : « Allah, le Très-Haut et Glorieux, a créé l’argile le samedi, les montagnes le dimanche, les arbres le lundi, les choses nécessitant du travail le mardi, la lumière le mercredi, les animaux le jeudi, et Adam (paix sur lui) après le 'Asr le vendredi, la dernière création à la dernière heure du vendredi, c’est-à-dire entre l’après-midi et la nuit. » Ce hadith est aussi rapporté par une autre chaîne de transmetteurs",
          "id": "Telah menceritakan kepadaku [Suraij bin Yunus] dan [Harun bin 'Abdullah] mereka berdua berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepada kami [Isma'il bin Umayyah] dari [Ayyub bin Khalid] dari ['Abdullah bin Rafi'] -budak- Ummu Salamah dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memegang tangannya, lalu beliau bersabda: 'Allah Azza wa Jalla menjadikan tanah pada hari Sabtu, menancapkan gunung pada hari Ahad, menumbuhkan pohon-pohon pada hari Senin, menjadikan bahan-bahan mineral pada hari Selasa, menjadikan cahaya pada hari Rabu, menebarkan binatang pada hari Kamis, dan menjadikan Adam 'Alaihis Salam pada hari Jum'at setelah ashar, yang merupakan penciptaan paling akhir yaitu saat-saat terakhir di hari jum'at antara waktu ashar hingga malam",
          "tr": "Bana Süreye b. Yûnus ile Harun b. Abdillah rivayet ettiler. (Dedilerki): Bize Haccac b. Muhammed rivayet etti. (Dediki): İbni Cüreyc şunu söyledi: Bana İsmail b.-Ümeyye, Eyyûb b. Halid'den, o da Ümnıü Seleme'nin azatlısı Abdullah b. Rafi'den, o da Ebû Hureyre'den naklen haber verdi. (Demişki): Resulullah (Sallallahu Aleyhi ve Sellem) etimden tutarak şöyle buyurdular : «Allah (Azze ve Celle) yeri cumartesi günü yaratmış, o toprakta dağları pazar günü, ağaçları pazartesi günü, sevilen şeyleri salı günü, nuru çarşamba günü yaratmış. Yerin üzerine hayvanları perşembe günü yaymıştır. Adem (Aleyhisselam)'ı da cuma günü ikindiden sonra mahlûkatın en sonunda ve cum'a saatlerinin nihayetinde, ikindi ile akşam arasında yaratmıştır.» İbrahim dediki: Bise Bistamî (bu zat Hüseyn b. îsa'dır) ile Sehl b. Ammar, İbrahim b. binti Hafs ve başkaları bu hadîsi Haccac'dan rivayet ettiler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 7055,
      "arabicNumber": "2790",
      "book": 52,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي، كَثِيرٍ حَدَّثَنِي أَبُو حَازِمِ بْنُ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ النَّقِيِّ لَيْسَ فِيهَا عَلَمٌ لأَحَدٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Sahl b. Sa'd reported that Allah's Messenger (ﷺ) said:The people will be assembled on the Day of Resurrection on a white plain with a reddish tinge like the loaf of white bread with no marks set up for anyone",
          "ur": "حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن لوگوں کو غبار کی رنگت ملی ، سفید زمین پر اکٹھا کیا جا ئے گا ، جیسے چھنے ہوئے آٹے کی روٹی ہو تی ہے اور اس کسی شخص کے لیے کو ئی علامت موجود نہیں ہو گی ۔",
          "fr": "Rapporté par Sahl b. Sa'd : Le Messager d’Allah ﷺ a dit : « Les gens seront rassemblés le Jour de la Résurrection sur une plaine blanche, légèrement teintée de rouge, comme un pain blanc sans aucune marque pour distinguer qui que ce soit. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; telah menceritakan kepada kami [Khalid bin Makhlad] dari [Muhammad bin Ja'far bin Abu Katsir] telah menceritakan kepadaku [Abu Hazim bin Dinar] dari [Sahl bin Sa'd] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Pada hari kiamat kelak manusia akan dikumpulkan di bumi yang sangat putih berbentuk bulat pipih dan datar tanpa ada tanda bagi siapapun di atasnya",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Hâlid b. Mahled, Muhammed b. Ca'fer h, Ebî Kesîr'den rivayet etti. (Demişki): Bana Ebû Hâzim b. Dînar, Sehl b. Sa'd'dan rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Seilem): «Kıyamet gününde insanlar beyaz, kızıl beyaz, beyaz unun çöreği gibi bir yerin üzerinde toplanacak, orada hiç kimse için bir alâmet olmayacaktır.» buyurdular. İZAH 2791 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 7056,
      "arabicNumber": "2791",
      "book": 52,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ يَوْمَ تُبَدَّلُ الأَرْضُ غَيْرَ الأَرْضِ وَالسَّمَوَاتُ‏}‏ فَأَيْنَ يَكُونُ النَّاسُ يَوْمَئِذٍ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ عَلَى الصِّرَاطِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported:I asked Allah's Messenger (ﷺ) about the words of Allah, the Exalted and Glorious:\" The day when the earth would be changed for another earth and Heaven would be changed for another Heaven (XiV. 48), (and inquired: ) (Allah's Messenger), where would the people be on that day? He said: They would be on the Sirat",
          "ur": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے انھوں نے کہا میں نے رسول اللہ صلی اللہ علیہ وسلم سے اللہ عزوجل کے اس قول کے متعلق سوال کیا : \" جس دن زمین دوسری زمین سے بدل دی جا ئے گی اور آسمان ( بھی بدل دیا جائےگا ) تو اللہ کے رسول اللہ صلی اللہ علیہ وسلم !اس دن لوگ کہاں ہوں گے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( پل صراط پر ۔)",
          "fr": "Rapporté par Aïcha رضي الله عنها : J’ai demandé au Messager d’Allah ﷺ au sujet de ces paroles d’Allah, le Très-Haut et Glorieux : « Le jour où la terre sera changée en une autre terre, et les cieux aussi seront changés » (14:48). J’ai demandé : « Où seront les gens ce jour-là ? » Il a répondu : « Ils seront sur le Sirat. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami ['Ali bin Mushir] dari [Dawud] dari [Asy Sya'bi] dari [Masruq] dari ['Aisyah] dia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang firman Allah Azza Wa Jalla: 'Pada hari (ketika) bumi diganti dengan bumi yang lain dan begitu pula langit……' (QS. Ibrahim (14): 48), maka dimanakah umat manusia ketika itu, ya Rasulullah?\" Jawab beliau: 'Di Titian (shirath)",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ali b. Müshir, Dâvud'dan, o da Şa'bî'den, o da Mesrûk'dan, o da Âişe'den naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem)'e Allah (Azze ve Celle)'nin: «O gün yer, yerden başka bir kılığa değişecek, göklerde öyle olacak...» [İbrahim 48] âyet-i kerîmesini sordum, İnsanlar o gün nerede olacak yâ Resûlallah? dedim. «Sırat üzerinde!» buyurdular. Diğer tahric: Buhari Kitabu'r-Rikak; İbn Mace, zühd"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 7057,
      "arabicNumber": "2792",
      "book": 52,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ تَكُونُ الأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً يَكْفَؤُهَا الْجَبَّارُ بِيَدِهِ كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ نُزُلاً لأَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ فَأَتَى رَجُلٌ مِنَ الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ أَبَا الْقَاسِمِ أَلاَ أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ بَلَى ‏\"‏ ‏.‏ قَالَ تَكُونُ الأَرْضُ خُبْزَةً وَاحِدَةً - كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ فَنَظَرَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ قَالَ أَلاَ أُخْبِرُكَ بِإِدَامِهِمْ قَالَ ‏\"‏ بَلَى ‏\"‏ ‏.‏ قَالَ إِدَامُهُمْ بَالاَمُ وَنُونٌ ‏.‏ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا ‏.‏",
        "translations": {
          "en": "Abu al-Sa'id Khudri reported Allah's Messenger (ﷺ) as saying that the earth would turn to be one single bread on the Day of Resurrection and the Almighty would turn it in His hand as one of you turns a loaf while on a journey. It would be a feast arranged in the honour of the people of Paradise. He (the narrator) further narrated that a person from among the Jews came and he said:Abu al-Qasim, may the Compassionate Lord be pleased with you! May I inform you about the feast arranged in honour of the people of Paradise on the Day of Resurrection? He said: Do it, of course. He said: The earth would become one single bread. Then Allah's Messenger (ﷺ) looked towards us and laughed until his molar teeth became visible. He then again said: May I inform you about that with which they would season it? He said: Do it, of course. He said: Their seasoning would be balim and fish. The Companions of the Prophet (ﷺ) said: What is this balam? He said: Ox and fish from whose excessive livers seventy thousand people would be able to eat",
          "ur": "عطاءبن یسار نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن یہ زمین ایک ہی روئی بن جائے گی ۔ جبار ( اللہ تعالیٰ ) اہل جنت کی مہمانی کے لیے اسے اپنے ہاتھ سے الٹ پلٹ کرروئی کی طرح بنا دے گا جس طرح تم میں سے کو ئی شخص سفر میں روئی کو الٹ پلٹ کرتا ہے ۔ ( حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ نے ) کہا : اتنے میں یہودیوں میں سے ایک شخص آگیا اس نے کہا : ابو القاسم الرحمٰن آپ پر برکت نازل فرمائے !کیا میں آپ کو قیامت کے روز اہل جنت کی ضیافت کے بارے میں نہ بتاؤں ؟آپ نے ارشاد فرمایا : \" کیوں نہیں ! ( بتاؤ ) اس نے کہا : زمین ایک ( بڑی سی ) روئی بن جا ئے گی ۔ جس طرح ( اس کی آمد سے قبل خود ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ۔ ( ابو سعید رضی اللہ تعالیٰ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے ہماری طرف دیکھا پھر آپ ہنسے حتی کہ آپ کے پچھلے دندان مبارک نظر آنے لگے ۔ اس نے ( پھر ) کہا : کیامیں آپ کو ان کے سالن کے بارے میں نہ بتاؤں ؟آپ نے فرمایا : \" کیوں نہیں ( بتاؤ ) \" اس نے کہا \" ان کا سالن بالام اور نون ہو گا یہ صحابہ کرام رضوان اللہ عنھم اجمعین نے پوچھا وہ کیا ہے ؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" بیل اور مچھلی یہ اس کے جگر کے چھوٹے سے اضافی حصے کو ( جوا صل جگر کے ساتھ ایک طرف موجود ہو تا ہے ) ستر ہزار لوگ کھائیں ۔",
          "fr": "Rapporté par Abu Sa'id al-Khudri : Le Messager d’Allah ﷺ a dit : « Le Jour de la Résurrection, la terre deviendra comme un seul pain, et le Tout-Puissant la tournera dans Sa main comme l’un d’entre vous retourne un pain pendant un voyage. Ce sera un festin offert en l’honneur des gens du Paradis. » Il a aussi raconté qu’un homme parmi les Juifs est venu et a dit : « Abu al-Qasim, que le Seigneur Miséricordieux soit satisfait de toi ! Puis-je t’informer du festin offert aux gens du Paradis le Jour de la Résurrection ? » Il a répondu : « Vas-y, bien sûr. » L’homme a dit : « La terre deviendra un seul pain. » Alors le Messager d’Allah ﷺ nous a regardés et a souri jusqu’à ce que l’on voie ses molaires. Puis il a dit : « Voulez-vous que je vous dise avec quoi ils l’assaisonneront ? » Il a répondu : « Oui, bien sûr. » Il a dit : « L’assaisonnement sera du balim et du poisson. » Les Compagnons du Prophète ﷺ ont demandé : « Qu’est-ce que le balim ? » Il a répondu : « Un bœuf et un poisson dont le foie sera si grand que soixante-dix mille personnes pourront en manger. »",
          "id": "Telah menceritakan kepada kami ['Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepadaku [bapakku] dari [kakekku] telah menceritakan kepada kami [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Zaid bin Aslam] dari ['Atha bin Yasar] dari [Abu Sa'id Al Khudri] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Pada hari kiamat bumi itu akan seperti satu potong roti yang akan di ratakan oleh Allah dengan tangan-Nya hingga menjadi seimbang. Sebagaimana roti yang diratakan oleh salah seorang dari kalian diperjalanannya. sebagai hidangan bagi penghuni surga. Kemudian seorang laki-laki dari yahudi datang, ia berkata kepada beliau; \"semoga Allah memberkahi kepadamu wahai Abu Qasim, beliau berkata kepadanya; maukah kamu kuberitahu tentang hidangan penghuni surga pada hari kiamat? Dia menjawab; 'Ya.' Beliau bersabda: bumi akan menjadi satu potong roti -sebagaimana sabda Rasulullah shallallahu 'alaihi wasallam tadi.- maka Rasulullah shallallahu 'alaihi wasallam melihat kepada kami dan tertawa hingga terlihat gigi serinya. Beliau shallallahu 'alaihi wasallam bertanya; maukah kuberitahukan kepadamu tentang lauk pauk mereka. Dia menjawab; lauknya adalah balaam (bahasa Ibarahin) dan nun. Para sahabat bertanya; apakah itu? Beliau menjawab; yaitu seekor sapi, sedangkan nun adalah daging yang paling baik dari hatinya yang akan dimakan oleh tujuh puluh ribu penghuni surga yang masuk tanpa hisab",
          "tr": "Bize Abdu'I-Melik b. Şuayb b. Leys rivayet etti. (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Hâlid b. Yezid, Saîd b. Ebî Hilâl'den, o da Zeyd b. Eslem'den, o da Atâ' b. Yesâr'dan, o da Ebû Saîdi Hudrî'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Şöyle buyurmuşlar : «Kıyamet gününde yer bir çörek olacak. Onu Cebbar kendi yed-i kudretiyle sizden birinizin seferde çöreğini elden ele çevirdiği gibi, cennetliklere ikram olmak üzere çevirecektir.» Ebû Saîd demişki: Az sonra yahudilerden bir adam gelerek: —Rahman olan Allah sana bereket versin ey Eba'l-Kaâsım. Kıyamet giınünde cennetliklerin ağırlanacağı şeyi sana haber vereyim mi? dedi. Resulullah (Sallallahu Aleyhi ve Sellem): «Hay hay!» buyurdular. Yahudi: (Resulullah (Sallallahu Aleyhi ve Sellem)'in buyurduğu gibi) : — Yer bir çörek olacak, dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) bize baktı, sonra güldü, hattâ yan dişleri göründü. Yahudi: — Sana onların katığını haber vereyim mi? dedi. «Hay hay!» buyurdular. Yahudi: — Onların katıkları bâlâm ile nûn'dur, dedi. (Oradakiler) : — Bu ne demektir? diye sordular. —Öküzle balıktır. Onların ciğerlerinin kenarından yetmiş bin kişi yiypcektir, dedi. İZAH 2793 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 7058,
      "arabicNumber": "2793",
      "book": 52,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا قُرَّةُ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ تَابَعَنِي عَشْرَةٌ مِنَ الْيَهُودِ لَمْ يَبْقَ عَلَى ظَهْرِهَا يَهُودِيٌّ إِلاَّ أَسْلَمَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:If ten scholars of the Jews would follow me, no Jew would be left upon the surface of the earth who would not embrace Islam",
          "ur": "محمد بن سیرین نے ہمیں حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : اگر دس ( بڑے ) یہودی ( عالم ) میری پیروی کر لیتے تو روئے زمین پر کوئی یہودی باقی نہ رہتا مگر مسلمان ہو جا تا ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Si dix savants parmi les Juifs me suivaient, il ne resterait aucun Juif sur la surface de la terre qui n’embrasserait pas l’islam. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Qurrah] telah menceritakan kepada kami [Muhammad] dari [Abu Hurairah] berkata: \"Nabi Shallallahu 'alaihi wa Salam bersabda: 'Andai sepuluh orang Yahudi mengikutiku, tidaklah tersisa diatasnya (bumi) seorang Yahudi pun melainkan masuk Islam",
          "tr": "Bize Yahya b. Habîb El-Hârisî rivayet etti. (Dediki): Bize Halid b.Haris rivayet etti. (Dediki): Bize Kurra rivayet etti. (Dediki): Bize Muhammed, Ebû Hureyre'den rivayet etti (Şöyle demiş): Nebi (Sallallahu Aleyhi ve Sellem): Bana yahudilerden on kişi tabi olsa, yeryüzünde müslüman olmadık yahudi kalmazdı. buyurdular. Onlar bu ekmeği cennete girmeden durak yerinde yiyecek, orada beklerken acıkmıyacaklardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 7059,
      "arabicNumber": "2794.01",
      "book": 52,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا أَنَا أَمْشِي، مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرْثٍ وَهُوَ مُتَّكِئٌ عَلَى عَسِيبٍ إِذْ مَرَّ بِنَفَرٍ مِنَ الْيَهُودِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ فَقَالُوا مَا رَابَكُمْ إِلَيْهِ لاَ يَسْتَقْبِلُكُمْ بِشَىْءٍ تَكْرَهُونَهُ ‏.‏ فَقَالُوا سَلُوهُ فَقَامَ إِلَيْهِ بَعْضُهُمْ فَسَأَلَهُ عَنِ الرُّوحِ - قَالَ - فَأَسْكَتَ النَّبِيُّ صلى الله عليه وسلم فَلَمْ يَرُدَّ عَلَيْهِ شَيْئًا فَعَلِمْتُ أَنَّهُ يُوحَى إِلَيْهِ - قَالَ - فَقُمْتُ مَكَانِي فَلَمَّا نَزَلَ الْوَحْىُ قَالَ ‏{‏ وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏",
        "translations": {
          "en": "Abdullah (b. Mas`ud) reported:As I was going along with Allah's Apostle (ﷺ) in a cultivable land and he (the Holy Prophet) was walking with the support of a wood, a group of Jews happened to meet him. Some of them said to the others: Ask him about the Soul. They said: What is your doubt about it? There is a possibility that you may ask him about anything (the answer of) which you may not like. They said: Ask him. So one amongst them asked him about the Soul. Allah's Messenger (ﷺ) kept quiet and he gave no reply and I came to know that revelation was being sent to him, so I stood at my place and thus this revelation descended upon him:\" They ask thee about the Soul. Say: The Soul is by the Commandment of my Lord, and of Knowledge you are given but a little\" (xvii)",
          "ur": "حفص بن غیاث نے کہا : ہمیں میرے والد نے حدیث بیان کی کہا : ہمیں اعمش نے حدیث بیان کی ، کہا : مجھے ابراہیم نے علقمہ سے حدیث بیان کی ، انھوں نے حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک مرتبہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک کھیت میں چلا جارہا تھا نبی صلی اللہ علیہ وسلم کھجور کی ایک شاخ کا سہارا لے ( کر چل ) رہے تھے کہ آپ کا یہود کے چند لوگوں کے قریب سے گزر ہوا ان میں سے ایک نے دوسرے سے کہا : ان سے روح کے بارے میں سوال کرو پھر وہ ایک دوسرے سے کہنے لگے : ان کے بارے میں تمھیں شک کس بات کا ہے؟ایسا نہ ہو کہ وہ آگے سے ایسی بات کہہ دیں جو تمھیں بری لگے پھر ان میں سے ایک شخص کھڑا ہوکر آپ کے پاس آگیا اور آپ صلی اللہ علیہ وسلم سے روح کے بارے میں سوال کیا ۔ ( حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم ( تھوڑی دیر کے لیے ) خاموش ہو گئے اور ان کو کو ئی جواب نہ دیا ۔ مجھے معلوم ہو گیا کہ آپ پروحی نازل ہو رہی ہے ۔ کہا میں بھی اپنی جگہ پر ( رک کر ) کھڑا ہو گیا ۔ جب وحی نازل ہو چکی تو آپ صلی اللہ علیہ وسلم نے ( یہ پڑھتے ہوئے ) فرمایا : \" یہ لوگ آپ سے روح کے بارے میں سوال کرتے ہیں ۔ کہہ دیجیے روح میرے رب کے حکم سے ہے اور تم ( انسانوں ) کو بہت کم علم دیا گیا ہے ۔",
          "fr": "Rapporté par Abdullah ibn Mas'ud : Alors que je marchais avec le Messager d’Allah ﷺ dans un champ cultivable, il s’appuyait sur un bâton. Un groupe de Juifs l’a rencontré. Certains ont dit aux autres : « Interrogez-le sur l’âme. » Ils ont répondu : « Pourquoi ? Peut-être que vous lui demanderez quelque chose dont la réponse ne vous plaira pas. » Ils ont insisté : « Demandez-lui. » L’un d’eux lui a donc posé la question sur l’âme. Le Messager d’Allah ﷺ est resté silencieux sans répondre, et j’ai compris qu’une révélation lui était envoyée. Je suis donc resté à ma place, et la révélation suivante est descendue sur lui : « Ils t’interrogent au sujet de l’âme. Dis : L’âme relève de l’ordre de mon Seigneur, et vous n’avez reçu que peu de connaissance. » (17:)",
          "id": "Telah menceritakan kepada kami [Umar bin Hafsh bin Giyats] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepadaku [Ibrahim] dari [Alqamah] dari [Abdullah] berkata: \"Saat aku berjalan dengan nabi Shallallahu 'alaihi wa Salam disuatu ladang sementara beliau tengah bersandar, tiba-tiba beberapa orang Yahudi lewat, mereka saling berkata satu sama lain: 'Tanyakan padanya tentang ruh.' Mereka berkata: 'Apa yang meragukan kalian (hingga bertanya padanya) agar ia tidak menyambut dengan sesuatu yang tidak kalian sukai.' Mereka berkata, 'Bertanyalah padanya.' Kemudian sebagaian dari mereka menghampiri beliau lalu bertanya tentang ruh pada beliau'.\" Abdullah berkata: \"Nabi Shallallahu 'alaihi wa Salam diam dan tidak menjawab apa pun. Aku tahu beliau tengah diberi wahyu. Aku berdiri dari tempatku. Saat wahyu turun, beliau bersabda: 'Dan mereka bertanya kepadamu tentang roh. Katakanlah: 'Roh itu termasuk urusan Tuhan-ku, dan tidaklah kamu diberi pengetahuan melainkan sedikit.\" (Al Israa`: 85) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Waki']. Dan telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] dan [Ali bin Khasyram] keduanya berkata: Telah mengkhabarkan kepada kami [Isa bin Yunus] keduanya dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] berkata: Aku berjalan bersama nabi Shallallahu 'alaihi wa Salam di sebuah ladang Madinah, seperti hadits Hafsh, hanya saja dalam hadits Waki' disebutkan: \"Dan tidaklah kamu diberi pengetahuan melainkan sedikit.\" (Al Israa`: 85) dan dalam hadits Isa bin Yunus disebutkan: \"Dan tidaklah kamu diberi.\" Dari Rasulullah Ibnu Khasyram. Telah menceritakan kepada kami [Abu Sa'id Al Asyujj] berkata: Aku mendengar [Abdullah bin Idris] berkata: Aku mendengar [Al A'masy] meriwayatkannya dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah] berkata: Nabi Shallallahu 'alaihi wa Salam berada di kebun kurma, beliau telah bersandar pada pangkal kurma, Abdullah menyebut hadits yang sama seperti hadits dari Al A'masy dan ia berkata dalam riwayatnya: \"dan tidaklah kamu diberi pengetahuan melainkan sedikit.\" (Al Israa`:)",
          "tr": "Bize Ömer b. Hafs b. Gıyâs rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize A'meş rivayet etti. (Dediki): Bana İbrahim Alkame'den, o da Abdullah'dan naklen rivayet etti. (Şöyle demiş): Bir defa ben Nebi (Sallallahu Aleyhi ve Sellem)'le birlikte bir ekinlikte yürüyordum. Kendisi bir hurma dalına dayanıyordu. Aniden yahudilerden bir cemaatın üzerine uğradı. Yahudiler birbirlerine: — Ona ruh'u sorun! dediler. Ve şöyle konuştular: -- Ona sormaya sizi sevkeden nedir? O sizin karşınıza hoşlanmadığınız bir şeyle çıkmıyor! Fakat yine de ona sorun! dediler. Bunun üzerine biri kalkıp gelerek ona ruhu sordu. Nebi (Sallallahu Aleyhi ve Sellem) sükût buyurdu. Ona hiç bir cevab vermedi. Anladım ki, kendisine vahy geliyor. Yerimde durdum. Vahy inince şöyle buyurdular: «Sana ruhu soruyorlar. (De ki): Ruh Rabbimin işidir. Size ilim nâmına ancak az bîr şey verilmiştir.» [İsra]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 7060,
      "arabicNumber": "2794.02",
      "book": 52,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرْثٍ بِالْمَدِينَةِ ‏.‏ بِنَحْوِ حَدِيثِ حَفْصٍ غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً ‏.‏ وَفِي حَدِيثِ عِيسَى بْنِ يُونُسَ وَمَا أُوتُوا ‏.‏ مِنْ رِوَايَةِ ابْنِ خَشْرَمٍ ‏.‏",
        "translations": {
          "en": "Abdullah reported:I was walking along with Allah's Apostle (ﷺ) in a field of Medina. The rest of the hadith is the same, but there is a slight variation of wording",
          "ur": "ابو بکر بن ابی شیبہ اور ابو اشج نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں وکیع نے حدیث بیان کی ، نیز ہمیں اسحٰق بن ابراہیم حنظلی اور علی بن خشرم نے بھی حدیث بیان کی دونوں نے کہا : ہمیں عیسیٰ بن یونس نے خبر دی ۔ ان دونوں ( وکیع اور عیسیٰ ) نےاعمش سے ، انھوں نے ابراہیم سے ، انھوں نے حضرت عبد اللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : میں نبی صلی اللہ علیہ وسلم کے ساتھ مدینہ کے ایک ( اجزائے ہوئے ) کھیت میں جارہاتھا ۔ حفص کی حدیث کے مانند مکروکیع کی حدیث میں ہے : \"\" وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا \"\" \"\" اور تم لوگوں کو علم کا تھوڑا حصہ ہی دیا گیا ہے ۔ \"\" ( جس طرح قرآن کی مشہور متواتر قرآءت ہے ۔ اور عیسیٰ بن یو نس کی اس روایت میں جوان سے ( علی ) بن خشرم نے بیان کی ہے وما اوتوا \"\" انھیں نہیں دیا گیا \"\" کے الفاظ ہیں ۔",
          "fr": "Rapporté par Abdullah : Je marchais avec le Messager d’Allah ﷺ dans un champ de Médine. Le reste du hadith est le même, avec une légère différence dans les mots",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Saîd El-Eşecc rivayet ettiler. (Dedilerki): Bize Veki rivayet etti. H. --Bize İshak b. îbrâhim El-Hanzalî ile Alî b. Haşrem dahi rivayet ettiler. (Dedilerki): Bize İsa b. Yûnus haber verdi. Her iki râvî A'meş'den, o da İbrahim'den, o da Alkame'den, o da Abdullah'dan naklen rivayet etmişlerdir. Abdullah: Nebi (Sallallahu Aleyhi ve Sellem)'le birlikte Medine'de bîr ekinlikte yürüyordum, diyerek Hafs'ın hadîsi gibi rivayet etmiştir. Şu kadar var ki, Veki'in hadîsinde: «İlimden size ancak az bir şey verilmiştir.» İsa b. Yûnus'un hadîsinde ise İbni Haşrem'in rivayetinden olmak üzere: «Onlara ilimden ancak az bir şey verilmiştir.» ibareleri vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 7061,
      "arabicNumber": "2794.03",
      "book": 52,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ إِدْرِيسَ، يَقُولُ سَمِعْتُ الأَعْمَشَ، يَرْوِيهِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي نَخْلٍ يَتَوَكَّأُ عَلَى عَسِيبٍ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ عَنِ الأَعْمَشِ وَقَالَ فِي رِوَايَتِهِ وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً ‏.‏",
        "translations": {
          "en": "Abdullah reported that Allah's Apostle (ﷺ) was reclining against a tree in the garden. The rest of the hadith is the same with a slight variation of wording",
          "ur": "ابو سعید اشج نے ہمیں حدیث بیان کی ، کہا : میں نے عبد اللہ بن ادریس سے سنا وہ کہہ رہے تھے ، میں نے اعمش سے سنا وہ اس روایت کو عبداللہ رضی اللہ تعالیٰ عنہ بن مرہ سے اور وہ مسروق سے اور وہ حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کر رہے تھے ، انھوں نے کہا : نبی صلی اللہ علیہ وسلم کھجور کے درختوں میں ( کھجور کی ) ایک شاخ کا سہارا لیے ہوئے ( چلے جارہے ) تھے پھر اعمش سے ان سب کی حدیث کے مطابق بیان کیا اور انھوں نے ( بھی ) اپنی روایت میں مشہور اور متواتر قرآءت کے مطابق \"\" وَمَا أُوتِيتُم مِّنَ الْعِلْمِ إِلَّا قَلِيلًا \"\" بیان کیا ۔ ان روایات میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم حرث ( کھیت ) اور نخل ( کھجورکے درختوں ) کے درمیان جارہے تھے ۔ صحیح بخاری کی ایک روایت میں حرث ہے ۔ ( حدیث 4721 ۔ ) جبکہ دوسری روایت میں \"\" خرب \"\" ( اجازجگہ ) ہے ۔ ( حدیث : 125 ) اس سے معلوم ہوتا ہے کہ وہ کھیت جس میں آپ صلی اللہ علیہ وسلم چلے جارہے تھے ۔ مدینہ کے عام کھیتوں کی طرح کھجور کے باغ میں تھا اور اب اس میں کچھ کاشت نہیں ہو رہاتھا اجڑاہوا اور ناہموار ہونے کی وجہ سے آپ اس کے اندرکھجور کی شاخ کا سہارا لے کر چل رہے تھے ۔ جامع ترمذی میں حضرت عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ روح کے متعلق یہودیوں سے پوچھ کر قریش مکہ نے بھی سوال کیا تھا آپ صلی اللہ علیہ وسلم نے ان کو بھی یہی جواب دیا تھا ( جمع المومنین حدیث 3140 ) مدینہ میں جب یہود نے خود سوال کیا تو چونکہ وہ اہل کتاب تھے اس لیے یہ امکان تھا کہ ان کی کتاب میں یہی بات کسی اور رنگ میں کہی گئی ہو اور وہ انداز کے اس اختلاف کو اپنے لیےدلیل بنانے کی کو شش کریں اس لیے جواب دینے سے پہلے رسول اللہ صلی اللہ علیہ وسلم نے توقف کیا اور اللہ تعالیٰ نے دوبارہ وہی جواب وحی فرمادیا جو تورات کےعین مطابق تھا اور یہود کو اپنے لیے آپ کی رسالت سے انکار کا کو ئی عذر نہ مل سکا ۔",
          "fr": "Rapporté par Abdullah : Le Messager d’Allah ﷺ était allongé contre un arbre dans le jardin. Le reste du hadith est le même, avec une légère variation dans les mots",
          "tr": "Bize Ebû Saîd El-Eşecc rivayet etti. (Dediki): Abdullah b. İdris'i şöyle derken işittim. Ben A'meş'den dinledim. Bu hadîsi Abdullah b. Mûrra'dan, o da Mesruk'dan, o da Abdullah'dan naklen rivayet ediyordu. Abdullah şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem) bir hurmalık içindeydi. Bir hurma dalına dayanıyordu... Sonra râvî yukarkilerin A'meş'den rivayet ettikleri hadîs gibi nakletmiştir. O rivayetinde: «Size ilimden ancak az bir şey verilmiştir.» demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 7062,
      "arabicNumber": "2795.01",
      "book": 52,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ، - وَاللَّفْظُ لِعَبْدِ اللَّهِ - قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كَانَ لِي عَلَى الْعَاصِ بْنِ وَائِلٍ دَيْنٌ فَأَتَيْتُهُ أَتَقَاضَاهُ فَقَالَ لِي لَنْ أَقْضِيَكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ - قَالَ - فَقُلْتُ لَهُ إِنِّي لَنْ أَكْفُرَ بِمُحَمَّدٍ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ ‏.‏ قَالَ وَإِنِّي لَمَبْعُوثٌ مِنْ بَعْدِ الْمَوْتِ فَسَوْفَ أَقْضِيكَ إِذَا رَجَعْتُ إِلَى مَالٍ وَوَلَدٍ ‏.‏ قَالَ وَكِيعٌ كَذَا قَالَ الأَعْمَشُ قَالَ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏ أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏ إِلَى قَوْلِهِ ‏{‏ وَيَأْتِينَا فَرْدًا‏}‏",
        "translations": {
          "en": "Khabbab reported that Al-`As b. Wa'il owed debt to me. I came to him in order to demand that. He said:I will never repay you unless you belie Muhammad. I said: I would never belie Muhammad until you die and you are again raised up. He said: When I would be raised up after death, I would repay your debt when I would get my property and children back. Waki` said: This is how Al-A`mash has narrated and it was on this occasion that this verse was revealed: \"Hast thou seen him who disbelieves in Our message and says: I shall certainly be given wealth and children\" (xix, 77) up to \"he would come to Us alone\" (xix)",
          "ur": "وکیع نے کہا : ہمیں اعمش نے ابو ضحیٰ سے حدیث بیان کی ، انھوں نے مسروق سے اور انھوں نے حضرت خباب ( بن ارت رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا میرا کچھ قرض عاص بن وائل کے ذمے تھا ۔ میں اس سے قرض کا تقاضا کرنے کے لیے اس کے پاس گیا تو اس نے مجھ سے کہا : میں اس وقت تک تمھیں ادائیگی نہیں کروں گا ۔ یہاں تک کہ تم نعوذ باللہ محمد صلی اللہ علیہ وسلم سے کفر کرو ۔ کہا : میں نے اس سے کہا : تم مر کردوبارہ زندہ ہو جاؤ گے ۔ پھر بھی میں محمد صلی اللہ علیہ وسلم کے ساتھ کفر نہیں کروں گا ۔ اس نے کہا : اور میں موت کے بعد دوبارہ زندہ کیا جاؤں گا؟تو ( اس وقت ) جب میں دوبارہ مال اور اولاد کے پاس پہنچ جاؤں گاتو تمھیں ادائیگی کردوں گا ۔ وکیع نے کہا : اعمش نے اسی طرح کہا : انھوں نے کہا : اس پریہ آیت نازل ہوئی : \"\" کیا آپ نے اس شخص کو دیکھا جس نے ہماری آیات سے کفر کیا اور کہا : مجھے ( اپنا ) مال اور ( اپنی ) اولاد ضروری دی جائے گی \"\" سے لے کر اس ( اللہ ) کے فرمان \"\" اور وہ ہمارے پاس اکیلا آئے گا \"\" تک ۔",
          "fr": "Rapporté par Khabbab : Al-‘As b. Wa’il me devait une dette. Je suis allé le voir pour la réclamer. Il m’a dit : « Je ne te rembourserai jamais à moins que tu ne renies Muhammad. » J’ai répondu : « Je ne renierai jamais Muhammad, même si tu meurs et que tu es ressuscité. » Il a dit : « Quand je serai ressuscité après la mort, je te rembourserai quand je retrouverai mes biens et mes enfants. » Waki‘ a dit : C’est ainsi qu’Al-A‘mash l’a rapporté, et c’est à cette occasion que ce verset a été révélé : « As-tu vu celui qui nie Nos signes et dit : ‘On me donnera sûrement des richesses et des enfants’ » (19:77) jusqu’à « il viendra à Nous tout seul » (19:)",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abdullah bin Sa'id Al Asyujj], teks hadits milik Abdullah, keduanya berkata: Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dari [Abu Adh Dhuha] dari [Masruq] dari [Khabbab] berkata: Al 'Ash memiliki hutang padaku, aku mendatanginya untuk memperkarakannya, ia berkata padaku: Aku tidak akan membayar (hutang) mu sebelum kau kufur terhadap Muhammad. Aku berkata padanya: Aku tidak akan kufur terhadap Muhammad hingga kau mati lalu dibangkitkan lagi. Ia berkata: Bila kau bangkit lagi setelah mati, aku akan melunasi (hutang) mu bila aku kembali lagi ke harta dan anakku. Waki' berkata: Demikian Al A'masy berkata: Lalu ayat ini turun: \"Maka apakah kamu telah melihat orang yang kafir kepada ayat-ayat kami dan ia mengatakan: 'Pasti Aku akan diberi harta dan anak\" hingga firmanNya: \"Dan ia akan datang kepada kami dengan seorang diri.\" (Maryam: 77-80). Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah]. Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku]. Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Jarir]. Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan]. Semuanya dari [Al A'masy] dengan sanad ini seperti hadits Waki'. Dalam hadits Jarir disebutkan: Dimasa jahiliyah, aku budak milik Al Ash bin Wa`il, aku bekerja lalu mendatanginya untuk memperkarakannya",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Abdullah b. Saîd EI-Eşec rivayet etliler. Lâfız Abdullah'ındır. (Dedilerki): Bize Veki' rivayet etti. (Dediki): Bize A'meş, Ebû'd-Duhâ'dan, o da Mesruk'dan, o da Habbab'dan naklen rivayet etti. Habbab şöyle demiş: Benim Âs b. Vâil'de alacağım vardı. Onu almak için kendisine gittim de bana : — Muhammed'e küfretmedikçe sana asla bir şey ödemem, dedi. Ben de kendisine: — Sen ölüp sonra dirilinceye kadar, ben Muhammed'e asla küfredemem, dedim. — Ben öldükten sonra dirilecek miyim? Öyleyse mala ve çoluğa-Çocuğa döndüğüm vakit sana borcumu öderim, dedi. Veki demişki: A'meş de böyle söyledi, dediki: Bunun üzerine şu âyet indi: «Bizim âyetlerimize küfredene ne dersin. Bana mutlaka mal ve çoluk çocuk verilecektir, dedi.» Âyet tâ: «Bize yalnız başına gelecektir...» cümlesine kadar inmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 7063,
      "arabicNumber": "2795.02",
      "book": 52,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ وَكِيعٍ وَفِي حَدِيثِ جَرِيرٍ قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ فَعَمِلْتُ لِلْعَاصِ بْنِ وَائِلٍ عَمَلاً فَأَتَيْتُهُ أَتَقَاضَاهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Khabbib through another chain of transmitters and the words are. I in the pre-Islamic days used to work as an iron-smith. I did some work for 'As b. Wa'il and came to him for getting the remuneration of my wages",
          "ur": "ابو معاویہ عبد اللہ بن نمیر جریر اور سفیان سب نے اعمش سے اسی سند کے ساتھ وکیع کی حدیث کی طرح بیان کیا اور جریر کی حدیث میں ہے ۔ ( حضرت خباب رضی اللہ تعالیٰ عنہ نے ) کہا : میں زمانہ جاہلیت میں لوہار تھا تو میں نے عاص بن وائل کے لیے کام کیا پھر میں اس سے ( اجرت کا ) تقاضا کرنے کے لیے آیا ۔",
          "fr": "Rapporté par Khabbab (par une autre chaîne) : À l’époque préislamique, je travaillais comme forgeron. J’ai fait un travail pour ‘As b. Wa’il et je suis allé le voir pour recevoir le paiement de mon salaire",
          "tr": "Bize Ebû Kureyb rivayet etti. (Dediki): Bize Ebû Muâviye rivayet etti. H. Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize İshâk b. İbrahim dahi rivayet etti. (Dediki): Bize Cerir haber verdi. H. Bize İbni Ebî Ömer de rivayet etti. (Dediki): Bize Süfyan rivayet etti. Bu râvilerin hepsi A'meş'den bu isnadla Veki'in hadîsi gibi rivayette bulunmuşlardır. Cerir'in hadîsinde : «Dediki: Câhiliyyet devrinde demirci idim. Âs b. Vâile bir iş yaptım da, ondan alacağımı istemeğe gittim.» ibaresi de vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 7064,
      "arabicNumber": "2796",
      "book": 52,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ الزِّيَادِيِّ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو جَهْلٍ اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ ‏.‏ فَنَزَلَتْ ‏{‏ وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ * وَمَا لَهُمْ أَلاَّ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that Abu Jahl said:O Allah, if he is true, then shower upon us the volley of stones from the sky or inflict upon us a grievous torment, and it was on this occasion that this verse was revealed:\" 'Allah would never torment them so long as you are amongst them. And Allah is not going to torment them as long as they seek forgiveness. And why is it that Allah should not torment them and they prevent people from coming to the sacred mosque....\" (viii. 34) to the end",
          "ur": "شعبہ نے عبد الحمید زیادی سے روایت کی انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا : وہ کہہ رہے تھے کہ ابو جہل نے کہا : اے اللہ !اگر ( یہ جو محمد صلی اللہ علیہ وسلم لے کر آئے ہیں ) یہی تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسادے یا ہم پر کوئی دردناک عذاب لے آ ۔ تو اس پر ( آیت ) نازل ہوئی : \" اللہ تعالیٰ اس وقت ان پر ( اس طرح کا ) عذاب بھیجنے والا نہ تھا جبکہ آپ بھی ان میں موجود تھے اور اللہ تعالیٰ ان کو عذاب دینے والا نہ تھا جب وہ ( علیحدگی میں ) استغفار کیے جارہے تھے ۔ اور انھیں کیا ہے کہ اللہ انھیں عذاب نہ دےجبکہ وہ ( ایمان لانے والوں کو ) مسجد حرام سے روکتے ہیں ۔ \" آیت کے آخرتک ۔",
          "fr": "Rapporté par Anas b. Malik : Abu Jahl a dit : « Ô Allah, s’il dit la vérité, alors fais pleuvoir sur nous une pluie de pierres du ciel ou inflige-nous un terrible châtiment. » C’est à cette occasion que ce verset a été révélé : « Allah ne les châtiera pas tant que tu es parmi eux. Et Allah ne les châtiera pas tant qu’ils demandent pardon. Et pourquoi Allah ne les châtierait-Il pas alors qu’ils empêchent les gens d’accéder à la Mosquée sacrée… » (8:34) jusqu’à la fin du verset",
          "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz Al Anbari] telah menceritakan kepada kami [ayahku] dari [Syu'bah] dari [Abdul Hamid Az Ziyadi], ia mendengar [Anas bin Malik] berkata: Abu Jahal pernah berkata: Ya Allah, jika memang ini benar-benar berasal dariMu maka turunkanlah hujan batu atas kami dari langit atau datanglah adzab yang pedih kepada kami. Maka turunlah ayat: \"Dan Allah sekali-kali tidak akan mengazab mereka, sedang kamu berada di antara mereka. dan tidaklah (pula) Allah akan mengazab mereka, sedang mereka meminta ampun. Kenapa Allah tidak mengazab mereka padahal mereka menghalangi orang untuk (mendatangi) Masjidil haram.\" (Al Anfaal: 33) hingga akhir ayat",
          "tr": "Bize Ubeydullah b. Muâz El-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Abdû'l-Hanıid Ez-Ziyâdî'den rivayet etti. O da Enes b. Mâlik'i şunu söylerken işitmiş. Ebû Cehl: — Allahım! Eğer bu senin tarafından gelen hak (din) ise, bize gökten taş yağdır. Yahut bize acıklı bîr azab getir, dedi. Bunun üzerine şu âyet indi: «Halbuki sen içlerinde iken Allah, onlara azab edecek değildi. İstiğfar ettikleri sürece de Allah onlara azab edecek değildir. Şimdi ise Allah'ın kendilerine azab etmemesi için neleri var ki? Oysa Mescid-i Haram'dan menediyorlar. Üstelik onun hizmetine ehil kişiler de değiller. Çünkü onun hizmetine ehil olanlar ancak müttakilerdir. Lakin çoğu bunu bilmezler..» [Enfal 33 ve]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 7065,
      "arabicNumber": "2797",
      "book": 52,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الْقَيْسِيُّ، قَالاَ حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، حَدَّثَنِي نُعَيْمُ بْنُ أَبِي هِنْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو جَهْلٍ هَلْ يُعَفِّرُ مُحَمَّدٌ وَجْهَهُ بَيْنَ أَظْهُرِكُمْ قَالَ فَقِيلَ نَعَمْ ‏.‏ فَقَالَ وَاللاَّتِ وَالْعُزَّى لَئِنْ رَأَيْتُهُ يَفْعَلُ ذَلِكَ لأَطَأَنَّ عَلَى رَقَبَتِهِ أَوْ لأُعَفِّرَنَّ وَجْهَهُ فِي التُّرَابِ - قَالَ - فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يُصَلِّي زَعَمَ لِيَطَأَ عَلَى رَقَبَتِهِ - قَالَ - فَمَا فَجِئَهُمْ مِنْهُ إِلاَّ وَهُوَ يَنْكِصُ عَلَى عَقِبَيْهِ وَيَتَّقِي بِيَدَيْهِ - قَالَ - فَقِيلَ لَهُ مَا لَكَ فَقَالَ إِنَّ بَيْنِي وَبَيْنَهُ لَخَنْدَقًا مِنْ نَارٍ وَهَوْلاً وَأَجْنِحَةً ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ دَنَا مِنِّي لاَخْتَطَفَتْهُ الْمَلاَئِكَةُ عُضْوًا عُضْوًا ‏\"‏ ‏.‏ قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ لاَ نَدْرِي فِي حَدِيثِ أَبِي هُرَيْرَةَ أَوْ شَىْءٌ بَلَغَهُ ‏{‏ كَلاَّ إِنَّ الإِنْسَانَ لَيَطْغَى * أَنْ رَآهُ اسْتَغْنَى * إِنَّ إِلَى رَبِّكَ الرُّجْعَى * أَرَأَيْتَ الَّذِي يَنْهَى * عَبْدًا إِذَا صَلَّى * أَرَأَيْتَ إِنْ كَانَ عَلَى الْهُدَى * أَوْ أَمَرَ بِالتَّقْوَى * أَرَأَيْتَ إِنْ كَذَّبَ وَتَوَلَّى‏}‏ - يَعْنِي أَبَا جَهْلٍ - ‏{‏ أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى * كَلاَّ لَئِنْ لَمْ يَنْتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ * نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ * فَلْيَدْعُ نَادِيَهُ * سَنَدْعُ الزَّبَانِيَةَ * كَلاَّ لاَ تُطِعْهُ‏}‏ زَادَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ قَالَ وَأَمَرَهُ بِمَا أَمَرَهُ بِهِ ‏.‏ وَزَادَ ابْنُ عَبْدِ الأَعْلَى فَلْيَدْعُ نَادِيَهُ يَعْنِي قَوْمَهُ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that Abu Jahl asked (people) whether Muhammad placed his face (on the ground) in their presence. It was said to him:Yes. He said: By Lat and `Uzza. If I were to see him do that, I would trample his neck, or I would smear his face with dust. He came to Allah's Messenger (ﷺ) as he was engaged in prayer and thought of trampling his neck (and the people say) that he came near him but turned upon his heels and tried to repulse something with his hands. It was said to him: What is the matter with you? He said: There is between me and him a ditch of fire and terror and wings. Thereupon Allah's Messenger (may peace he upon him) said: If he were to come near me the angels would have torn him to pieces. Then Allah, the Exalted and Glorious, revealed this verse- (the narrator) said: We do not know whether it is the hadith transmitted by Abu Huraira or something conveyed to him from another source: \"Nay, man is surely inordinate, because he looks upon himself as self-sufficient. Surely to thy Lord is the return. Hast thou seen him who forbids a servant when he prays? Seest thou if he is on the right way, or enjoins observance of piety? Seest thou if he [Abu Jahl] denies and turns away? Knowest he not that Allah sees? Nay, if he desists not, We will seize him by the forelock-a lying, sinful forelock. Then let him summon his council. We will summon the guards of the Hell. Nay! Obey not thou him\" (lcvi, 6-19). (Rather prostrate thyself.) Ubaidullah made this addition: It was after this that (prostration) was enjoined upon and Ibn Abd al-Ala made this addition that by \"Nadiyah\" he meant his people",
          "ur": "عبید اللہ بن معاذ اور محمد بن عبد الاعلی قیسی نے ہمیں حدیث بیان کی دونوں نے کہا : ہمیں معتمر نے اپنے والد سے حدیث سنائی ، انھوں نے کہا : مجھے نعیم بن ابی ہندنےابوحازم سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : ابوجہل نے کہا : کیا محمدتم لوگوں کے سامنے اپنا چہرہ زمین پر رکھتے ہیں؟ ( حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : تو کہا گیا : ہاں چنانچہ اس نے کہا : لات اور عزیٰ کی قسم !اگر میں نے ان کو ایسا کرتے ہوئے دیکھ لیا تو میں ان کی گردن کو روندوں گا یا ان کے چہرےکو مٹی میں ملاؤں گا ( العیاذ باللہ! ) کہا : پھر جب رسول اللہ صلی اللہ علیہ وسلم نماز پڑھ رہے تھے وہ آپ کے پاس آیا اور یہ ارادہ کیا کہ آپ کی گردن مبارک کوروندے ( ابوہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : تووہ انھیں اچانک ایڑیوں کے بل پلٹتا ہوا اور اپنے دونوں ہاتھوں ( کو آگے کر کے ان ) سے اپنا بچاؤ کرتا ہوا نظر آیا ۔ ( ابوہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : تو اس سے کہا کیا : تمھیں کیا ہوا ؟تو اس نے کہا : میرے اور اس کے درمیان آگ کی ایک خندق اور سخت ہول ( پیدا کرنے والی مخلوق ) اور بہت سے پر تھے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" اگر وہ میرے قریب آتا تو فرشتے اس کے ایک ایک عضو کو اچک لیتے ۔ ( ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ) کہا : اس پر اللہ تعالیٰ نے یہ آیاتنازل فرمائیں ۔ ( ابو حازم نے کہا ۔ ( ہمیں معلوم نہیں کہ یہ ابو ہریرہ رضی اللہ تعالیٰ عنہ کی ( رسول اللہ صلی اللہ علیہ وسلم سے سنی ہوئی ) اپنی حدیث ہے یا انھیں ( کسی کی طرف سے ) پہنچی ہے ۔ ( وہ آیات یہ تھیں ) \"\" اس کے سواکوئی بات نہیں کہ انسان ہر صورت میں سر کشی کرتا ہے اس لیے کہ وہ خود کو دیکھتا ہے کہ وہ ہر ایک سے مستغنی ہے حقیقت یہ ہے کہ ( اسے ) آپ کے رب کی طرف واپس جانا ہے ۔ آپ نے اسے دیکھا جو روکتا ہے ۔ ( اللہ کے ) بندے کو جب وہ نماز اداکرتا ہے ۔ کیا تم نے دیکھا کہ اگر وہ ( اللہ کا بندہ ) ہدایت پر ہو اور تقوی کا حکم دیتا ہو ( تو روکنے والے کا کیا بنے گا؟ ) کیا آپ نے دیکھا کہ آکر اس یعنی ابو جہل نے جھٹلایا ہے اور ہدایت سے منہ پھیراہے ۔ ( تو ) کیا وہ نہیں جانتا کہ اللہ دیکھتا ہے ۔ ہر گز نہیں !اگر وہ باز نہ آیا تو ہم ( اسے ) پیشانی سے پکڑ کر کھینچیں کے ۔ ( اس کی ) جھوٹی گناہ کرنے والی پیشانی سے پھر وہ اپنی مجلس کو ( مددکے لیے ) پکارے ہم عذاب دینے والے فرشتوں کو بلائیں گے ۔ ہر گز نہیں!آپ اس کی ( کوئی بات بھی ) نہ مانیں ۔ \"\" عبید اللہ ( بن معاذ ) نے اپنی حدیث میں مزید کہا ۔ ( ابوہریرہ رضی اللہ تعالیٰ عنہ نے أَوْ أَمَرَ بِالتَّقْوَىٰ کی تفسیر کرتے ہوئے ) کہا : اور اس بات کا حکم دیتا ہو جس کا اس ( اللہ ) نے اسے حکم دیا ہے ۔ اور ( محمد ) بن عبد الاعلیٰ نے مزید یہ کہا : \"\" وہ اپنی مجلس کو پکارے \"\" یعنی اپنی قوم کو ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Abu Jahl demanda aux gens si Muhammad posait son visage au sol devant eux. On lui répondit : « Oui. » Il dit : « Par Lat et 'Uzza, si je le vois faire cela, j’écraserai son cou ou je salirai son visage de poussière. » Il s’approcha du Messager d’Allah ﷺ alors qu’il priait, voulant lui marcher sur le cou, mais il recula soudain, repoussant quelque chose de ses mains. On lui demanda : « Que t’arrive-t-il ? » Il répondit : « Il y a entre moi et lui un fossé de feu, de peur et d’ailes. » Le Messager d’Allah ﷺ dit alors : « S’il s’était approché de moi, les anges l’auraient mis en pièces. » Puis Allah, le Très-Haut, révéla ce verset : « Non, l’homme devient insolent parce qu’il se croit autosuffisant. Mais vers ton Seigneur est le retour. As-tu vu celui qui interdit à un serviteur de prier ? S’il est sur la bonne voie ou ordonne la piété ? S’il dément et tourne le dos ? Ne sait-il pas qu’Allah voit ? Non, s’il ne cesse pas, Nous le saisirons par le toupet, un toupet menteur et pécheur. Qu’il appelle donc son assemblée : Nous appellerons les gardiens de l’Enfer. Non ! N’obéis pas à cet homme… » (Sourate Al-‘Alaq, 6-19). (Après cela, la prosternation fut prescrite)",
          "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] dan [Muhammad bin Abdula'la Al Qaisi] keduanya berkata: Telah menceritakan kepada kami [Al Mu'tamir] dari [ayahnya] telah menceritakan kepadaku [Nu'aim bin Abu Hind] dari [Abu Hazim] dari [Abu Hurairah] berkata: Abu Jahal berkata: Apakah Muhammad menundukkan wajahnya (di tanah) di tengah-tengah kalian? Ada yang menjawab: Ya. Ia berkata: Demi Lata dan Uzzah, bila aku melihatnya melakukan seperti itu, aku akan menginjak lehernya atau aku akan benamkan wajahnya di tanah. Abu Hurairah berkata: Ia kemudian mendatangi Rasulullah Shallallahu 'alaihi wa Salam saat beliau tengah shalat, ia hendak menginjak leher beliau. Tidak ada yang mengejutkan mereka selain ia (Abu Jahal) mundur dan melindungi diri dengan tangan. Ada yang bertanya padanya: Kamu kenapa? Ia menjawab: Antara aku dan dia ada parit dari api, huru hara dan banyak sayap. Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Andai ia mendekatiku, malaikat akan menyambar anggota badannya satu per satu.\" Abu Hurairah berkata: Lalu Allah 'azza wajalla menurunkan -kami (Nu'aim) tidak tahu apakah ayat ini disebutkan dalam hadits Abu Hurairah ataukah Rasulullah yang ia (Abu Hazim) dengar-: \"Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas, karena dia melihat dirinya serba cukup. Sesungguhnya hanya kepada Rabbmulah kembali(mu). Bagaimana pendapatmu tentang orang yang melarang, seorang hamba ketika mengerjakan shalat. Bagaimana pendapatmu jika orang yang melarang itu berada di atas kebenaran, atau dia menyuruh bertakwa (kepada Allah)? Bagaimana pendapatmu jika orang yang melarang itu mendustakan dan berpaling?\" yaitu Abu Jahal \"Tidaklah dia mengetahui bahwa sesungguhnya Allah melihat segala perbuatannya? Ketahuilah, sungguh jika dia tidak berhenti (berbuat demikian) niscaya kami tarik ubun-ubunnya, (yaitu) ubun-ubun orang yang mendustakan lagi durhaka. Maka biarlah dia memanggil golongannya (untuk menolongnya), kelak kami akan memanggil malaikat Zabaniyah. Sekali-kali jangan, janganlah kamu patuh kepadanya.\" (Al 'Alaq: 7-19) Abdullah menambahkan dalam haditsnya: Ia berkata: Rasulullah Shallallahu 'alaihi wa Salam memerintahkan Abu Jahal dengan sesuatu yang diperintahkan pada beliau. Ibnu Abdula'la menambahkan: \"Maka biarlah dia memanggil golongannya\" yaitu kaumnya",
          "tr": "Bize Ubeydullah b. Muaz ile Muhammed b. Abdi'I-A'Ia [El-Kaysî rivayet ettiler. (Dedilerki): Bize Mu'temir, babasından rivayet 'etti. (Demişki): Bana Nuaym b. Ebî Hind, Ebû Hâzim'den, o da Ebû Hureyre'den naklen rivayet etti. (Demişki): Ebû Cehl: — Muhammed sizin aranızda halâ yüzünü toprağa sürtüyor mu? dedi. Kendisine : Evet! cevabı verildi. Bunun üzerine : — Lât ve Uzza'ya yemin ederim kî onu, bunu yaparken görürsem mutlaka boynuna basarım. Yahut mutlaka yüzünü toprağa gömerim, dedi. Az sonra Resulullah (Sallallahu Aleyhi ve Sellem) namaz kılarken onun yanına vardı. Boynuna basmak niyetinde idi, fakat birdenbire onu bırakıp geri döndüğünü ve elleriyle korunduğunu gördüler. Kendisine : — Sana ne oldu? denildi. — Gerçekten onunla benim aramda ateşten bir hendek, korkunç bir Şey ve bir takım kanatlar var, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) de: «Bana yaklaşmış olsaydı melekler onu birer birer uzuvlarını koparırdı!» buyurdular. Râvi demiş ki: Bunun üzerine Allah (Azze ve Celle) Ebû Hureyre'nin hadîsinde midir, yoksa duyduğu bir şey midir bilmiyoruz—: «Hayır! Gerçeklen İnsan kendini zengin görünce azar. Hiç şüphe yok ki, dönüş Rabbinedir. Bir kul'u namaz kılarken meneden kimseye ne dersin? Ya hidâyet üzere ise; veya takvayı emrederse ne dersin! Yalanladı ve dönüp gitti ise (Ebû Cehl'i kastediyor) ne dersin? Bilmez mi ki, Allah görüyor! Hayır! Eğer vazgeçmezse mutlaka alnına yapışacağız. Yalancı, günahkâr alına! O meclisini çağırsın. Biz zebanileri çağıracağız! Hayır! Ona itaat etme I» [Alak 6'dan 19'a] âyetlerini indirdi. Ubeydullah kendi hadîsinde ziyâde etti: «Ve ona ne emretti ise etti.» dedi. İbni Abdi'l-A'lâ da: Meclisini yâni; kavmini çağırsın...ibaresini ziyâde etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 7066,
      "arabicNumber": "2798.01",
      "book": 52,
      "hadithInBook": 22,
      "text": {
        "arabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ جُلُوسًا وَهُوَ مُضْطَجِعٌ بَيْنَنَا فَأَتَاهُ رَجُلٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ قَاصًّا عِنْدَ أَبْوَابِ كِنْدَةَ يَقُصُّ وَيَزْعُمُ أَنَّ آيَةَ الدُّخَانِ تَجِيءُ فَتَأْخُذُ بِأَنْفَاسِ الْكُفَّارِ وَيَأْخُذُ الْمُؤْمِنِينَ مِنْهُ كَهَيْئَةِ الزُّكَامِ فَقَالَ عَبْدُ اللَّهِ وَجَلَسَ وَهُوَ غَضْبَانُ يَا أَيُّهَا النَّاسُ اتَّقُوا اللَّهَ مَنْ عَلِمَ مِنْكُمْ شَيْئًا فَلْيَقُلْ بِمَا يَعْلَمُ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللَّهُ أَعْلَمُ فَإِنَّهُ أَعْلَمُ لأَحَدِكُمْ أَنْ يَقُولَ لِمَا لاَ يَعْلَمُ اللَّهُ أَعْلَمُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏ قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ‏}‏ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا رَأَى مِنَ النَّاسِ إِدْبَارًا فَقَالَ ‏\"‏ اللَّهُمَّ سَبْعٌ كَسَبْعِ يُوسُفَ ‏\"‏ ‏.‏ قَالَ فَأَخَذَتْهُمْ سَنَةٌ حَصَّتْ كُلَّ شَىْءٍ حَتَّى أَكَلُوا الْجُلُودَ وَالْمَيْتَةَ مِنَ الْجُوعِ وَيَنْظُرُ إِلَى السَّمَاءِ أَحَدُهُمْ فَيَرَى كَهَيْئَةِ الدُّخَانِ فَأَتَاهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ إِنَّكَ جِئْتَ تَأْمُرُ بِطَاعَةِ اللَّهِ وَبِصِلَةِ الرَّحِمِ وَإِنَّ قَوْمَكَ قَدْ هَلَكُوا فَادْعُ اللَّهَ لَهُمْ - قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ * يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنَّكُمْ عَائِدُونَ‏}‏ ‏.‏ قَالَ أَفَيُكْشَفُ عَذَابُ الآخِرَةِ ‏{‏ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ‏}‏ فَالْبَطْشَةُ يَوْمَ بَدْرٍ وَقَدْ مَضَتْ آيَةُ الدُّخَانِ وَالْبَطْشَةُ وَاللِّزَامُ وَآيَةُ الرُّومِ ‏.‏",
        "translations": {
          "en": "Masruq reported:We were sitting in the company of Abdullah and he was lying on the bed that a person came and said: Abd Abd al-Rabmin, a story-teller at the gates of Kinda says that the verse (of the Qur'an) which deals with the\" smoke\" implies that which is about to come and it would hold the breath of the infidels and would inflict the believers with cold. Thereupon Abdullah got up and said in anger. O people, fear Allah and say only that which one knows amongst you and do not say which he does not know and he should simply say: Allah has the best knowledge for He has the best knowledge amongst all of you. It does not behove him to say that which he does not know. Allah has the best knowledge of it. Verily Allah, the Exalted and Glorious, said to His Prophet (ﷺ) to state:\" I do not ask from you any remuneration and I am not the one to put you in trouble,\" and when Allah's Mesqenger (ﷺ) saw people turning back (from religion) he said: O Allah, afflict thern with seven famines as was done in the case of Yusuf, so they were afflicted with famine by which they were forced to eat everything until they were obliged to eat the hides and the dead bodies because of hunger, and every one of them looked towards the sky and he found a smoke. And Abu Sufyan came and he said: Muhammad, you have come to command us to obey Allah and cement the ties of blood- relation whereas your people are undone; supplicate Allah for tlicm. Thereupon Allah, the Exalted and Glorious, said:\" Wait for the day when there would be clear smoke from the sky which would envelop people and that would be grievous torivent\" up to the words:\" you are going to return to (evil).\" (if this verse implied the torment of the next life) could the chastisement of the next (life) be averted (as the Qur'an states): On the day when We seize (them) with the most violent seizing; surely We shall exact retribution\" (xliv. 16)? The seizing (in the hadith) implies that of the Day of Badr. And so far as the sign of smoke, seizing, inevitability and signs of Rome are concern- ed, they have become things of the past now",
          "ur": "منصور نے ابو ضحیٰ ( مسلم بن صحیح ) سے ، انھوں نے مسروق سے روایت کی ، کہا : ہم حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) کے پاس بیٹھے ہوئے تھے اور وہ ہمارے درمیان ( اپنے بستر یا بچھونے پر ) لیٹے ہوئے تھے تو ایک شخص آیا اور کہنے لگا : ابو عبدالرحمان!ابواب کندہ ( کوفہ کا ایک محلہ ) میں ایک قصہ گو ( واعظ ) آیا ہوا ہے ، وہ وعظ کررہا ہے اور یہ کہتا ہے کہ دھوئیں والی ( اللہ کی ) نشانی آئے گی اور ( یہ د ھواں ) کافروں کی روحیں قبض کرلے گا اور مومنوں کو یہ زکام جیسی کیفیت سے دو چار کرے گا ۔ حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) نے کہا اور وہ غصے کے عالم میں اٹھ کر بیٹھ گئے ، لوگو! اللہ سے ڈرو ، تم میں سے جو شخص کوئی چیز جانتا ہو ، وہ اتنی ہی بیان کرے جتنی جانتاہو اور جو نہیں جانتا ، وہ کہے : اللہ زیادہ جاننے والا ہے ۔ بے شک وہ ( اللہ تعالیٰ ) تم میں سے اس کو ( بھی ) زیادہ جاننے والاہے ۔ جو اس بات کے بارے میں جو وہ نہیں جانتا ، یہ کہتا ہے : اللہ زیادہ جاننے والا ہے ۔ اللہ عزوجل نے ا پنے نبی کریم صلی اللہ علیہ وسلم سے فرمایا؛ \"\" کہہ دیجئے : میں تم سے کوئی اجر نہیں مانگتا اور نہ ہی بناوٹ کرنے والوں میں سے ہوں ۔ \"\" رسول اللہ صلی اللہ علیہ وسلم نے جب لوگوں کی دین سے روگردانی دیکھی تو آپ نے ( دعا کرتے ہوئے ) فرمایا : \"\" اے اللہ! ( ان پر ) یوسف علیہ السلام کےسات سالوں جیسے سات سال ( بھیج دے ۔ ) \"\" ( عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : تو انھیں ( قحط کے ) ایک سال نے آلیا جس نے ہر چیز کاصفایاکرایا ، یہاں تک کہ ان ( مشرک ) لوگوں نے بھوک سے چمڑے اور مردار تک کھائے ۔ ان میں سے کوئی شخص آسمان کی طرف دیکھتا تو اسے دھوئیں کے جیسی ایک چیز چھائی ہوئی نظر آتی ۔ چنانچہ ابو سفیان رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا : اے محمد ( صلی اللہ علیہ وسلم ) آپ آئے ہیں ، اللہ کی اطاعت اور صلہ رحمی کاحکم دیتے ہیں ، آپ کی قوم ( قحط اور بھوک سے ) ہلاک ہورہی ہے ۔ ان کےلیے اللہ سے دعا کریں ۔ اللہ عزوجل نے فرمایا : \"\" آپ اس دن کا انتظار کریں جب آسمان ایک نظر آنے والے دھوئیں کو لے آئے گا ۔ ( اور وہ ) لوگوں کو ڈھانپ لے گا ۔ یہ دردناک عذاب ہوگا ، سے لے کر اس کے فرمان : \"\" نے شک تم ( کفر میں ) لوٹ جانے والے ہوگئے \"\" تک ۔ ( حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : کیا آخرت کا عذاب ہٹایا جائے گا؟ \"\" جس دن ہم تم پر بڑی گرفت کریں گے ( اس دن ) ہم انتقام لینے والے ہوں گے ۔ \"\" وہ گرفت بدر کے دن تھی ۔ اب تک دھوئیں کی نشانی گرفت اور چمٹ جانےوالا عذاب ( بدر میں شکست فاش اور قتل ) اور روم ( کی فتح ) کی نشانی ( سب ) آکر گذر چکی ہیں ۔",
          "fr": "Rapporté par Masruq : Nous étions assis avec Abdullah, qui était allongé sur son lit, lorsqu’une personne est venue et a dit : « Abd al-Rahman, un conteur aux portes de Kinda dit que le verset du Coran sur la “fumée” concerne un événement à venir qui coupera le souffle des mécréants et donnera froid aux croyants. » Abdullah s’est alors levé, en colère, et a dit : « Ô gens, craignez Allah et ne dites que ce que vous savez. Ne parlez pas de ce que vous ignorez ; dites simplement : “Allah sait mieux”, car c’est Allah qui a la meilleure connaissance parmi vous. Il ne convient pas de parler de ce qu’on ne sait pas. Allah sait mieux. En vérité, Allah, le Très-Haut et Glorieux, a dit à Son Prophète ﷺ de déclarer : “Je ne vous demande aucune récompense et je ne veux pas vous causer de peine.” » Quand le Messager d’Allah ﷺ a vu les gens se détourner de la religion, il a dit : « Ô Allah, afflige-les de sept années de famine comme à l’époque de Yusuf. » Ils ont alors souffert de la faim au point de manger tout ce qu’ils trouvaient, jusqu’à manger des peaux et des cadavres. Chacun d’eux levait les yeux vers le ciel et voyait une fumée. Abu Sufyan est venu et a dit : « Muhammad, tu nous ordonnes d’obéir à Allah et de renforcer les liens familiaux, alors que ton peuple est perdu ; invoque Allah pour eux. » Allah, le Très-Haut et Glorieux, a alors révélé : « Attends le jour où un nuage de fumée claire viendra du ciel et enveloppera les gens ; ce sera un châtiment douloureux » jusqu’aux mots : « vous reviendrez au mal. » (Si ce verset concernait le châtiment de l’au-delà, pourrait-il être écarté comme le Coran le dit : « Le jour où Nous les saisirons avec la prise la plus violente, Nous nous vengerons. » (44:16)) ? La prise mentionnée ici fait référence au jour de Badr. Quant aux signes de la fumée, de la prise, de l’inévitabilité et de la victoire des Romains, ils appartiennent désormais au passé",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Jarir] dari [Manshur] dari [Abu Adh Dhuha] dari [Masruq] berkata: Kami duduk didekat [Abdullah] dan ia tengah berbaring. Seseorang mendatanginya lalu berkata: Hai Abu Abdurrahman, seseorang bercerita didekat pintu gerbang Kindah, ia mengira bahwa tanda-tanda (kebesaran berupa) kabut datang lalu merenggut nyawa orang-orang kafir, kabut itu mencabut nyawa orang-orang mu`min seperti kondisi selesma. Abdullah duduk kemudian berkata dengan marah: Wahai sekalian manusia, bertakwalah kepada Allah, barangsiapa diantara kalian yang mengetahui sesuatu, hendaklah mengatakan seperti yang ia ketahui dan barangsiapa diantara kalian tidak mengetahui, hendaklah mengucapkan: Allahu a'lam, karena orang yang paling tahu diantara kalian adalah yang mengatakan untuk sesuatu yang tidak ia ketahui: Allahu a'lam, karena Allah Azza wa Jalla berfirman kepada nabiNya: \"Katakanlah (hai Muhammad): \"Aku tidak meminta upah sedikitpun padamu atas da'wahku dan bukanlah Aku termasuk orang-orang yang mengada-adakan.\" (Shaad: 86) Saat Rasulullah Shallallahu 'alaihi wa Salam melihat orang-orang berpaling, beliau berdoa: \"Ya Allah, (turunkanlah) kelaparan seperti kelaparannya Yusuf.\" Masruq berkata: Mereka pun tertimpa kelaparan yang menyerang segala sesuatu hingga mereka makan kulit dan bangkai karena lapar. Seseorang dari mereka melihat ke langit seperti wujud kabut lalu mereka mendatangi Abu Sufyan, ia berkata: Hai Muhammad, kau datang memerintahkan untuk menaati Allah dan menyambung silaturrahim, kaummu telah binasa, berdoalah kepada Allah 'azza wajalla untuk mereka.\"Maka tunggulah hari ketika langit membawa kabut yang nyata, yang meliputi manusia. inilah azab yang pedih\" hingga fimranNya \"Sesungguhnya kamu akan kembali (ingkar).\" (Ad Dukhaan: 10-15) ia berkata: Apakah siksaan akhirat akan dihilangkan?\"(Ingatlah) hari (ketika) kami menghantam mereka dengan hantaman yang keras. Sesungguhnya kami adalah pemberi balasan.\" (Ad Dukhaan: 16) hantaman keras adalah perang Badar. Tanda-tanda asap, hantaman keras, kematian dan ayat tentang (kemenangan) Romawi telah berlalu",
          "tr": "Bize İshak b. İbrahim rivayet etti. (Dediki): Bize Cerir Mansûr'dan, o da Ebû'd-Duhâ'dan, o da Mesrûk'dan naklen haber verdi. (Şöyle demiş): Abdullah'ın yanında oturuyorduk. Kendisi de aramızda yaslanmıştı. Derken ona bir adam gelerek : — Yâ Ebâ Abdirrahman! Gerçekten Kinde kapıları yanında bir hikayeci kıssa anlatıyor ve duman mucizesi gelerek kâfirlerin canlarını alacağını, mü'minlerinse ondan nezle şeklinde müteessir olacaklarını söylüyor, dedi. Bunun üzerine Abdullah kızarak oturdu ve şunları söyledi: — Ey insanlar! Allah'dan korkun! Sizdeiı kim bir şey bilirse, bildiğini söylesin. Bilmeyen de, Allah bilir, desin. Çünkü birinizin bilmediği bir şey için, Allah bilir, demesi en büyük ilimdir. Gerçekten Allah (Azze ve Celle) Nebisi (Sallallahu Aleyhi ve Sellem)'e : «Ben bunun için sizden bir ücret istemiyorum. Ben tekellüf yapanlardan da değilim de!» [Sad 86] buyurmuştur. Şüphesiz Resulullah (Sallallahu Aleyhi ve Sellem) insanlarda bir gerileme gördüğü vakit : «Allahım! Yûsuf'un yedi (sene) si gibi yedi (sene)!» buyurmuştu. Müteakiben başlarına öyle bir kıtlık gelmişti ki, her şeyi silip süpürmüş. Hattâ açlıktan deri ve laşeleri yemişlerdi. Onlardan biri gökyüzüne bakarak duman şeklinde bir şey gördü. Hemen Ebû Süfyan gelerek : — Yâ Muhammed Sen Allah'a tâatı ve akrabaya yardımı emrederek geldin. Ama kavmin helak oldular. İmdi onlar için Allah'a dua et, dedi. Allah (Azze ve Celle): «Semânın insanları saracak aşikâr bir duman getireceği günü gözet! Bu acıklı bir azabdır.» [Duhan 10-11] âyet-i kerîmesini: «Şüphesiz ki, siz döneceksiniz...» kavli kerîmine kadar buyurdu. Abdullah şöyle dedi : Hiç hakkında : «O gün biz en büyük savlette tutacağız, biz intikam alacağız [Duhan 16] buyurulan günde âhiretin azabı açılır mı? Batşe, Bedir günüdür. Duhan ayeti batşe, lızâm ve rûm âyeti geçmişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 7067,
      "arabicNumber": "2798.02",
      "book": 52,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ، الأَشَجُّ أَخْبَرَنَا وَكِيعٌ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، عَنْ مَسْرُوقٍ، قَالَ جَاءَ إِلَى عَبْدِ اللَّهِ رَجُلٌ فَقَالَ تَرَكْتُ فِي الْمَسْجِدِ رَجُلاً يُفَسِّرُ الْقُرْآنَ بِرَأْيِهِ يُفَسِّرُ هَذِهِ الآيَةَ ‏{‏ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ‏}‏ قَالَ يَأْتِي النَّاسَ يَوْمَ الْقِيَامَةِ دُخَانٌ فَيَأْخُذُ بِأَنْفَاسِهِمْ حَتَّى يَأْخُذَهُمْ مِنْهُ كَهَيْئَةِ الزُّكَامِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ مَنْ عَلِمَ عِلْمًا فَلْيَقُلْ بِهِ وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللَّهُ أَعْلَمُ فَإِنَّ مِنْ فِقْهِ الرَّجُلِ أَنْ يَقُولَ لِمَا لاَ عِلْمَ لَهُ بِهِ اللَّهُ أَعْلَمُ ‏.‏ إِنَّمَا كَانَ هَذَا أَنَّ قُرَيْشًا لَمَّا اسْتَعْصَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم دَعَا عَلَيْهِمْ بِسِنِينَ كَسِنِي يُوسُفَ فَأَصَابَهُمْ قَحْطٌ وَجَهْدٌ حَتَّى جَعَلَ الرَّجُلُ يَنْظُرُ إِلَى السَّمَاءِ فَيَرَى بَيْنَهُ وَبَيْنَهَا كَهَيْئَةِ الدُّخَانِ مِنَ الْجَهْدِ وَحَتَّى أَكَلُوا الْعِظَامَ فَأَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ اسْتَغْفِرِ اللَّهَ لِمُضَرَ فَإِنَّهُمْ قَدْ هَلَكُوا فَقَالَ ‏\"‏ لِمُضَرَ إِنَّكَ لَجَرِيءٌ ‏\"‏ ‏.‏ قَالَ فَدَعَا اللَّهَ لَهُمْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ إِنَّا كَاشِفُو الْعَذَابِ قَلِيلاً إِنَّكُمْ عَائِدُونَ‏}‏ قَالَ فَمُطِرُوا فَلَمَّا أَصَابَتْهُمُ الرَّفَاهِيَةُ - قَالَ - عَادُوا إِلَى مَا كَانُوا عَلَيْهِ - قَالَ - فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ * يَغْشَى النَّاسَ هَذَا عَذَابٌ أَلِيمٌ‏}‏ ‏{‏ يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى إِنَّا مُنْتَقِمُونَ‏}‏ قَالَ يَعْنِي يَوْمَ بَدْرٍ ‏.‏",
        "translations": {
          "en": "Masruq reported that there came to Abdullah a person and said:I have left behind in the mosque a man who explains the Qur'an according to his personal discretion and he explained this verse:\" So wait for the day when the Heaven brings a clear smoke.\" He says that a smoke would come to the people on the Day of Resurrection anl it will withhold breath and they would be inflicted with cold. 'Abdullah said: He who has knowledge should say something and he who has no knowledge should simply say: Allah is best aware. This reflects the understanding of a person that he should say about that which he does not know that it is Allah who knows best. The fact is that when the Quraish disobeyed Allah's Apostle (ﷺ) he supplicated Allah that they should be afflicted with famine and starvation as was done in case of Yusuf. And they were so much hard pressed that a person would ace the sky and he would see between him and the sky something like smoke and they were so much hard pressed that they began to cat the bones, and a person came to Allah's Apostle (ﷺ) and said: Allah's Messenger. seek forgiveness for the tribe of Mudar for (its people) have been undone. The Messenger (ﷺ) said: For Mudar? You are overbold, but he supplicated Allah for them. It was upon this that this verse was revealed:\" We shall remove the chastisement a little, but they will surely return to evil\" (xliv. 15). lie (the narrator) said: There was a downpoor of rain upon them. When there was some relief for them they returned to the same position as they had been before, and Allah, the Exalted and Glorious, revealed this verse:\" So wait for the day when the heaven brings a clear smoke enveloping people. This is a grievous torment on the day when We seize them with the most violent seizing; surely, We shall exact retribution.\" And this (seizing) implied (Battle) of Badr",
          "ur": "ابو معاویہ ، وکیع ، اور جریر نے اعمش سے ، انھوں نے مسلم بن صحیح سے اور انھوں نے مسروق سے روایت کی کہ حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) کے پاس ایک شخص آیا اور کہنے لگا : میں مسجد میں ایک ایسے شخص کو چھوڑ کر آرہا ہوں جو اپنی رائے سے قرآن مجید کی تفسیر کرتا ہے وہ ( قرآن کی ) آیت : \" جب آسمان سے واضح دھواں اٹھے گا \" کی تفسیر کرتا ہے ، کہتا ہے : \" قیامت کےدن لوگوں کے پاس ایک دھواں آئے گا جو لوگوں کی سانسوں کو گرفت میں لے لے گا ، یہاں تک کہ لوگوں کو زکام جیسی کیفیت ( جس میں سانس لینی مشکل ہوجاتی ہے ) درپیش ہوگی ، توحضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) نے کہا : جس کے پاس علم ہو وہ اس کے مطابق بات کہے اور جو نہ جانتا ہو ، وہ کہے : اللہ زیادہ جاننے والا ہے ۔ یہ بات انسان کے فہم ( دین ) کاحصہ ہے ۔ کہ جس بات کو وہ نہیں جانتا اس کے بارے میں کہے : اللہ زیادہ جاننے والاہے ۔ اس ( دھوئیں ) کی حقیقت یہ تھی کہ قریش نے جب نبی کریم صلی اللہ علیہ وسلم کے خلاف سخت نافرمانی سے کام لیا تو آپ نے ان کے خلاف یوسف علیہ السلام ( کے زمانےوالے ) قحط کے سالوں جیسی قحط سالی کی دعاکی ۔ انھیں قحط اور تنگ دستی نے آلیا یہاں تک کہ ( ان میں سے ) کوئی شخص آسمان کی طرف دیکھنے لگتا تو بھوک کی شدت سے اسے اپنے اور آسمان کے درمیان دھواں ساچھایا ہوا نظرآتا یہاں تک کہ ان لوگوں نے ( بھوک کی شدت سے ) ہڈیاں تک کھائیں ، چنانچہ ( ان میں سے ) ایک شخص نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !آپ ( قبیلہ ) مضر کے لئے بخشش طلب فرمائیں ۔ وہ ہلاکت کا شکار ہیں ، تو آ پ صلی اللہ علیہ وسلم نے فرمایا : \" مضر کے لئے؟تو بہت جراءت والا ہے ( کہ اللہ سے شرک اور اس کے رسول سے بغض کے باوجود د رخواست کررہا ہے کہ میں تمہارے لئے اللہ سے دعا کروں ) \" کہا : آپ صلی اللہ علیہ وسلم نے ( پھر بھی ) ان کے حق میں دعا فرمادی ۔ اس پر اللہ عزوجل نے ( آیت ) نازل فرمائی : \" ہم ( تم سے ) تھوڑے عرصے کے لئے عذاب ہٹادیتے ہیں ۔ تم ( پھر کفر ہی میں ) لوٹنے والا ہو ۔ \" ( حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) کہا : پھر ان پر بارش برسائی گئی ۔ انھیں خوشحالی مل گئی ، کہا : ( تو پھر ) وہ اپنی اسی روش پر لوٹ گئے جس سے پہلے تھے ۔ اس پر اللہ تعالیٰ نے ( یہ حصہ ) نازل فرمایا : \" آپ انتظار کیجئے جب آسمان ظاہر دھواں لے آئے گا ۔ جو لوگوں کو ڈھانپ لے گا ، یہ دردناک عذاب ہوگا ۔ ( پھر یہ آیت نازل فرمائی ) جس دن ہم بڑ ی گرفت میں لیں گے ، ہم انتقام لینے والے ہوں گے ۔ \" کہا : یعنی جنگ بدر کو ۔",
          "fr": "Rapporté par Masruq : Un homme est venu voir Abdullah et a dit : « J’ai laissé dans la mosquée un homme qui explique le Coran selon sa propre opinion et il a interprété ce verset : “Attends le jour où le ciel apportera une fumée claire.” Il dit qu’une fumée viendra sur les gens le Jour de la Résurrection, coupera leur souffle et leur donnera froid. » Abdullah a répondu : « Celui qui sait doit parler, et celui qui ne sait pas doit simplement dire : ‘Allah sait mieux.’ » Cela montre que si quelqu’un ne sait pas, il doit dire qu’Allah sait mieux. En réalité, lorsque les Quraysh ont désobéi au Messager d’Allah ﷺ, il a invoqué Allah pour qu’ils subissent la famine et la faim comme à l’époque de Yusuf. Ils ont tellement souffert qu’on voyait dans le ciel comme une fumée, et ils ont mangé des os. Un homme est venu voir le Messager d’Allah ﷺ et a dit : « Ô Messager d’Allah, demande pardon pour la tribu de Mudar, car ses gens sont perdus. » Le Messager ﷺ a répondu : « Pour Mudar ? Tu es bien audacieux ! » Mais il a tout de même invoqué Allah pour eux. C’est alors que ce verset a été révélé : « Nous lèverons un peu le châtiment, mais ils reviendront sûrement au mal. » (44:15) Il a plu sur eux. Quand ils ont eu un peu de répit, ils sont revenus à leur ancienne situation, et Allah, le Très-Haut et Glorieux, a révélé : « Attends le jour où le ciel apportera une fumée claire qui enveloppera les gens. Ce sera un châtiment douloureux le jour où Nous les saisirons avec la prise la plus violente ; Nous nous vengerons. » Cette prise fait référence à la bataille de Badr",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dan [Waki']. Telah menceritakan kepadaku [Abu Sa'id Al Asyujj] dan [Waki']. Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir], semuanya dari [Al A'masy]. Telah menceritakan kepada kami [Yahya bin Abu Yahya] dan [Abu Kuraib], teks milik Yahya, keduanya berkata: Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Muslim bin Shubaih] dari [Masruq] berkata: Seseorang mendatangi [Abdullah] lalu berkata: Aku meninggalkan seseorang di masjid yang menafsirkan ayat Al Qur'an berdasarkan pendapatnya: \"Maka tunggulah hari ketika langit membawa kabut yang nyata, yang meliputi manusia.\" (Ad Dukhaan: 10) ia berkata: Pada hari kiamat, kabut mendatangi manusia lalu mencabut nyawa mereka seperti wujud selesma. Setelah itu Abdullah berkata: Barangsiapa mengetahui sesuatu hendaklah disampaikan dan barangsiapa tidak tahu, hendaklah mengucapkan: Allahu a'lam. Salah satu pemahaman seseorang adalah dengan mengatakan Allahu a'lam untuk sesuatu yang tidak ia ketahui. Itu (kabut) terjadi saat kaum Quraisy mendurhakai nabi Shallallahu 'alaihi wa Salam. Beliau mendoakan mereka agar tertimpa kelaparan seperti kaum Yusuf. Mereka tertimpa kemarau dan keletihan hingga seseorang melihat ke langit, ia melihat seperti wujud kabut antara dirinya dan langit karena keletihan dan hingga mereka memakan tulang. Seseorang kemudian mendatangi nabi Shallallahu 'alaihi wa Salam dan berkata: Wahai Rasulullah, mintakan ampunan pada Allah untuk Mudlar karena mereka telah binasa. Beliau bersabda kepada Mudlar: \"Sesungguhnya kau gegabah.\" Abdullah berkata: Nabi Shallallahu 'alaihi wa Salam berdoa untuk mereka lalu Allah 'azza wajalla menurunkan: \"Sesungguhnya (kalau) kami akan melenyapkan siksaan itu agak sedikit. Sesungguhnya kamu akan kembali (ingkar).\" (Ad Dukhaan: 10-15) Abdullah berkata: Lalu mereka diberi hujan dan saat mereka mendapatkan kemakmuran, mereka kembali lagi seperti semula. Abdullah berkata: Lalu Allah 'azza wajalla menurunkan: \"Maka tunggulah hari ketika langit membawa kabut yang nyata, yang meliputi manusia. inilah azab yang pedih.\" (Ad Dukhaan: 10) Abdullah berkata: Yaitu perang Badar",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ebû Muâviye ile Veki' rivayet ettiler. H. Bana Ebû Saîd El-Eşec de rivayet etti. (Dediki): Bize Veki haber verdi. H. Bize Osman b. Ebî Şeybe dahi rivayet etti. (Dediki): Bize rivayet etti. Bunların hepsi A'meş'den rivayet etmişlerdir. H. Bize Yahya b. Yahya ile Ebû Kureyb de rivayet ettiler. Lâfız Yahya'nındır. (Dedilerki): Bize Ebû Muâviye, A'meş'den, o da Müslim b. Subeyh'den, o da Mesrûk'dan naklen rivayet etti. (Şöyle demiş): Abdullah'a bir adam gelerek: — Mescidde kendi re'yiyle Kur'ân'ı tefsir eden bir adam bıraktım. Şu âyeti tefsir ediyor: «O gün semâ aşikâre bir duman getirecektir.» Bu adam: İnsanlara kıyamet gününde bir duman gelecek ve canlarını alacak, hattâ ondan nezleye tutulmuş gibi olacaklar diyor, dedi. Bunun üzerine Abdullah şunları söyledi: — Her kim bir ilim biliyorsa, onu söylesin. Bilmeyen de, Allah bilir, desin. Çünkü bir adamın bilmediği hir şey için, Allah bilir, demesi anlayışından ma'duddıır. Bu mes'ele şöyle olmuştur. Kureyş (kabilesi) Peygamber (Sallallahu Aleyhi ve Sellem)'e âsi gelince onların aleyhine Yûsuf'un seneleri gibi seneler gelmesine dua etti. Bunun üzerine onlara kıtlık ve şiddetli meşakkat isabet etti. O derecedeki adam semâya bakıyor da, açlıktan kendisi ile semâ arasında duman gibi bir şey görüyordu. Kemikleri bile yediler. Nihayet Nebi (Sallallahu Aleyhi ve Sellem)'e bir adam gelerek: — Yâ Resûlallah! Mudar (kabilesi) için Allah'a istiğfar et! Çünkü onlar helak oldular, dedi. Resulullah (Sallallahu Aleyhi ve Sellem)'. «Mudar için mi? Sen hakikaten cüretkârsın!» buyurdu. Arkacığından onlar için duâ etti. Allah (Azze ve Celle) de: «Biz azabı biraz açacağız, siz gerçekten (yine) döneceksiniz.» [Duhan 15] âyetini indirdi. Ve kendilerine yağmur verildi. Onlar refaha kavuşunca yine eski hallerine döndüler. (Bu sefer) Allah (Azze ve Celle) de: «Semâ'nın insanları saracak aşikâr bîr duman getireceği günü gözet! Bu acıklı bir azabdır.» «O gün biz en büyük savletle tutacağız. Biz intikam alacağız.» âyetlerini indirdi. Abdullah, bundan Bedir gününü kastediyor, demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 7068,
      "arabicNumber": "2798.03",
      "book": 52,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ خَمْسٌ قَدْ مَضَيْنَ الدُّخَانُ وَاللِّزَامُ وَالرُّومُ وَالْبَطْشَةُ وَالْقَمَرُ ‏.‏",
        "translations": {
          "en": "Abdullah said that five signs have (become things) of the past (and have proved the truth of the Holy Prophet):(Enveloping) by the smoke, inevitable (punishment to the Meccans at Badr), (the victory of) Rome, (violent) seizing (of the Meccans at Badr) and (the splitting up of) the Moon",
          "ur": "قتیبہ بن سعید نے ہمیں حدیث بیان کی ، انھوں نے کہا : ہمیں جریر نے اعمش سے حدیث بیان کی ، انھوں نے ابو ضحیٰ سے ، انھوں نے مسروق سے اور انھوں نے حضرت عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : پانچ ( نشانیاں گزر چکی ہیں : دھواں ، چمٹ جانے والا عذاب ( بدر کے دن شکست اور ہلاکتیں ) روم کی فتح ( بدر کےدن ستر مشرکوں کی گرفتاری ) سخت گرفت اور چاند ( کادو ٹکڑے ہونا ۔)",
          "fr": "Rapporté par Abdullah : Cinq signes sont désormais du passé (et ont prouvé la véracité du Saint Prophète) : la fumée qui a enveloppé les gens, le châtiment inévitable (des Mecquois à Badr), la victoire des Romains, la prise violente (des Mecquois à Badr) et le fractionnement de la lune",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Adh Dhuha] dari [Masruq] dari [Abdullah] berkata: Lima (tanda-tanda) Telah terjadi: kabut, kematian, (kemenangan) Romawi, hantaman keras dan (terbelahnya) bulan. Telah menceritakan kepada kami [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dengan sanad ini dengan matan serupa",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Cerir, A'meş'den, o da Ebu'd-Duha'dan, o da Mesrûk'dan, o da Abdullah'dan naklen rivayet etti. (Şöyle demiş) ; Beş şey vardırki, bunlar geçmişlerdir. Duman, Hizâm, rûm, batşe ve kamer"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 7069,
      "arabicNumber": "2798.04",
      "book": 52,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters",
          "ur": "وکیع نے کہا : ہمیں اعمش نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
          "fr": "Rapporté par A'mash (par la même chaîne) : Le même hadith a été rapporté",
          "tr": "{M-41} Bize Ebû Saîd El-Eşec rivayet etti. (Dediki): Bixe Yeki' rivâet etti. (Dediki): Bize A'meş bu isnadla bu hadîsin mislini rivayet etti. İZAH 2799 DA Mahir: Sözü edilen hikayeci zat’ın iddiasını destekleyen hadis-i şerif 2901 dir, gözden geçirmenizi öneririm"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 7070,
      "arabicNumber": "2799",
      "book": 52,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنِ الْحَسَنِ الْعُرَنِيِّ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أُبَىِّ، بْنِ كَعْبٍ فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَلَنُذِيقَنَّهُمْ مِنَ الْعَذَابِ الأَدْنَى دُونَ الْعَذَابِ الأَكْبَرِ‏}‏ قَالَ مَصَائِبُ الدُّنْيَا وَالرُّومُ وَالْبَطْشَةُ أَوِ الدُّخَانُ ‏.‏ شُعْبَةُ الشَّاكُّ فِي الْبَطْشَةِ أَوِ الدُّخَانِ ‏.‏",
        "translations": {
          "en": "Ubayy b. Ka'b reported that the words of Allah, the Exalted and Glorious:\" We will, surely, make them taste the lesser punishment before the severer punishment (that haply they may return)\" (xxxii. 21) imply the torments of the world. (victory of) Rome, seizing (of the Meccans), or smoke. And Shalba was in doubt about seizing or smoke",
          "ur": "محمد بن جعفر نے شعبہ سے ، انھوں نے قتادہ سے ، انھوں نے عزرۃ سے انھوں نے حسن عرفی سے ، انھوں نے یحییٰ بن جزار سے ، انھوں نے عبدالرحمان بن ابی لیلیٰ سے اور انھوں نے حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ سے اللہ عزوجل کے فرمان : \" اور بڑے عذاب سے پہلے ہم انھیں قریب کا ( چھوٹا ) عذاب چکھائیں گے ۔ \" ( کی تفسیر ) کے بارے میں روایت کی ، انھوں نے کہا ( اسی ) دنیا میں پیش آنے والے مصائب ، روم کی فتح ، گرفت ( جنگ بدر ) یا دھواں ( مراد ) ہیں ۔ گرفت اور دھوئیں کے بارے میں شک کرنے والے شعبہ ہیں ۔ ( ان سے اوپر کے راویوں نے یقین سے بتایا ۔ شعبہ نے کہا : انھیں شک ہوا ہے)",
          "fr": "Rapporté par Ubayy b. Ka'b : Les paroles d’Allah, le Très-Haut et Glorieux : « Nous leur ferons sûrement goûter le châtiment moindre avant le châtiment plus sévère, afin qu’ils reviennent » (32:21) font référence aux tourments de ce monde : la victoire des Romains, la prise (des Mecquois) ou la fumée. Shalba avait un doute entre la prise ou la fumée",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mustanna] dan [Muhammad bin Basyar] keduanya berkata: Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah]. Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah], teks miliknya, telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Qatadah] dari [Azrah] dari [Al Hasan Al Urani] dari [Yahya bin Al Hazzar] dari [Abdurrahman bin Abi Laila] dari [Ubai bin Ka'ab] mengenai firman Allah 'azza wajalla: \"Dan Sesungguhnya kami merasakan kepada mereka sebahagian azab yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat).\" (As Sajdah: 21) Ia berkata: Musibah-musibah dunia, Perang Romawi, hantaman keras atau munculnya kabut Syu'bah ragu pada hantaman ataukah munculnya kabut",
          "tr": "Bize Muhammed b. Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. H. Bize Ebû Bekr h. Ebî Şeybe de rivayet etti. Lâfız onundur. (Dediki): Bize Gunder, Şu'be'den, o da Katâde'den, o da Azra'dan, o da Hasen El-Uranî'den, o da Yahya b. Cezzâr'dan, o da Abdurrahman b. Ebî Leylâ'dan, o da Ubey b. Ka'b'dan naklen, Allah (Azze ve Celle)'nin şu âyeti hakkında rivayette bulundu: «Büyük azabdan başka biz onlara mutlaka yakın azabdan da tattıracağız.» [Secde 21] Râvî demiş ki: (Yakın azab) dünya musibetleri, rum, batşe yahut dumandır. (Batşe mi yoksa duman mı? dediğinde şekkeden Şu'be'dir)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 7071,
      "arabicNumber": "2800.01",
      "book": 52,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي، نَجِيحٍ عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِشِقَّتَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اشْهَدُوا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Ma'mar reported on the authority of Abdullah that the moon was split up during lifetime by Allah's Messenger (ﷺ) in two parts and Allah's Messenger (ﷺ) said:Bear testimony to this",
          "ur": "مجاہد نے ابو معمر سے اور انھوں نے حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کے عہد میں چاند تقسیم ہوکر دوٹکڑے ہوگیاتو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" ( لوگو! اس کو دیکھ لو اور ) گواہ بن جاؤ ۔",
          "fr": "Rapporté par Abu Ma'mar d’après Abdullah : La lune a été fendue en deux du vivant du Messager d’Allah ﷺ, et le Messager d’Allah ﷺ a dit : « Soyez témoins de cela. »",
          "id": "Telah menceritakan kepada kami [Amru An Naqid] dan [Zuhair bin Harb] keduanya berkata: Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Abi Najih] dari [Mujahid] dari [Abu Ma'mar] dari [Abdullah] berkata: Bulan terbelah dua bagian dimasa Rasulullah Shallallahu 'alaihi wa Salam, Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Saksikan",
          "tr": "Bize Amru'n-Nâkıd ile Züheyr b. Harb rivayet ettiler. (Dedilerki): Bize Süfyan b. Uyeyne, İbni Ebî Necih'dan, o da Mücâhid'den, o da Ebû Ma'mer'den, o da Abdullah'tlan naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem) zamanında ay ikiye ayrıldı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Şahid olun!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 7072,
      "arabicNumber": "2800.02",
      "book": 52,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ أَبِي، مُعَاوِيَةَ ح وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي كِلاَهُمَا، عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِنًى إِذَا انْفَلَقَ الْقَمَرُ فِلْقَتَيْنِ فَكَانَتْ فِلْقَةٌ وَرَاءَ الْجَبَلِ وَفِلْقَةٌ دُونَهُ فَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اشْهَدُوا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Abdullah b. Mas'ud (who said):We were along with Allah's Messenger (ﷺ) at Mina, that moon was split up into two. One of its parts was behind the mountain and the other one was on this side of the mountain. Allah's Messenger (may peace be upbn him) said to us: Bear witness to this",
          "ur": "ابو معاویہ ، حفص بن غیاث اور ( علی ) ابن مسہر نے اعمش سے ، انھوں نے ابراہیم ( نخعی ) سے ، انھوں نے ابو معمر سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک بار ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ منیٰ میں موجودتھے کہ چاند دو ٹکڑوں میں تقسیم ہوگیا ، ایک ٹکڑا پہاڑ کے پیچھے ( نظر آتا ) تھا اوردوسرا ٹکڑا اس سے آگے ( دوسری طرف نظر آتا ) تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : \" ( اس کے ) گواہ بن جاؤ ۔",
          "fr": "Rapporté par Abdullah b. Mas'ud : Nous étions avec le Messager d’Allah ﷺ à Mina, lorsque la lune s’est fendue en deux. Une partie était derrière la montagne et l’autre de ce côté de la montagne. Le Messager d’Allah ﷺ nous a dit : « Soyez témoins de cela. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], [Abu Kuraib] dan [Ishaq bin Ibrahim] semuanya dari [Abu Mu'awiyah]. Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [ayahku], keduanya dari [Al A'masy]. Telah menceritakan kepada kami [Minjab bin Al Harits At Taimi], teks hadits miliknya, telah mengkhabarkan kepada kami [Ibnu Mushir] dari [Al A'masy] dari [Ibrahim] dari [Abu Ma'mar] dari [Abdullah bin Mas'ud] berkata: Saat kami bersama Rasulullah Shallallahu 'alaihi wa Salam di Mina, bulan terbelah menjadi dua bagian, salah satunya di belakang gunung dan yang lain di bawahnya, lalu Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Saksikan",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb ve İshak b. İbrahim toptan Ebû Muâviye'den rivayet ettiler. H. Bize Ömer b. Hafs b. Giyâs da rivayet etti. (Dediki): Bize babam rivayet etti. Her iki râvi A'meş'den rivayet etmişlerdir. H. Bize Mincab b. Haris Et-Temîmî dahi rivayet etti. Lâfız onundur. (Dediki): Bize İbni Mûshir, A'meş'den, o da İbrahim'den, o da Ebû Ma'mer'den, o da Abdullah b. Mes'ud'dan naklen haber verdi. (Şöyle demiş): Bir defa biz Mina'da Resulullah (Sallallahu Aleyhi ve Sellem)'le birlikte iken, ansızın ay iki parçaya ayrıldı. Bir parçası dağın arkasında, bir parçası da önünde idi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) bize: «Sahid olun!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 7073,
      "arabicNumber": "2800.03",
      "book": 52,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِلْقَتَيْنِ فَسَتَرَ الْجَبَلُ فِلْقَةً وَكَانَتْ فِلْقَةٌ فَوْقَ الْجَبَلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Mas'ud reported that the moon was split up in two parts during the lifetime of Allah's Messenger (ﷺ). The mountain covered one of its parts and one part of it was above the mountain and Allah's Messenger (ﷺ) said:Bear witness to this",
          "ur": "شعبہ نے اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے ابو معمر سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کے عہد میں چاند تقسیم ہوکردوٹکڑے ہوگیا ، ایک ٹکڑے کو پہاڑ نے ڈھانپ لیا ( اس پہاڑ کے پیچھے نظر آتا تھا ) اورایک ٹکڑا پہاڑ کے اوپر تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اے اللہ ! تو گواہ رہ ۔",
          "fr": "Rapporté par Abdullah b. Mas'ud : La lune a été fendue en deux du vivant du Messager d’Allah ﷺ. La montagne a caché une partie de la lune et l’autre partie était au-dessus de la montagne. Le Messager d’Allah ﷺ a dit : « Soyez témoins de cela. »",
          "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz Al Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari [Ibrahim] dari [Abu Ma'mar] dari [Abdullah bin Mas'ud] berkata: Bulan terbelah dimasa Rasulullah Shallallahu 'alaihi wa Salam menjadi dua bagian, salah satunya menutupi gunung atau yang lainnya di atas gunung, kemudian Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Ya Allah saksikanlah.\" Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari [Mujahid] dari [Ibnu Umar] dari nabi Shallallahu 'alaihi wa Salam seperti itu. Telah menceritakannya kepadaku [Bisyr bin Khalid] telah mengkhabarkan kepada kami [Muhammad bin Ja'far]. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ibnu Abi Adi], keduanya dari [Syu'bah] dengan sanad Ibnu Mu'adz dari Syu'bah seperti haditsnya, hanya saja dalam hadits Ibnu Abi Adi disebutkan: Lalu beliau bersabda: \"Saksikanlah, saksikanlah",
          "tr": "Bize Ubeydullah b. Muâz El-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, A'meş'den, o da İbrahim'den, o da Ebû Ma'mer'den, o da Abdullah b. Mes'ud'dan naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem) zamanında ay iki parçaya yarıldı da, parçanın birini dağ örttü, diğer parça dağın üzerinde idi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Allahım! Şahid ol!» dedi. İZAH 2803 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 7074,
      "arabicNumber": "2801.01",
      "book": 52,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ ‏.‏",
        "translations": {
          "en": "Another chain of transmitters reported the like of this hadith",
          "ur": "معاذ نے کہا : ہمیں شعبہ نے اعمش سے حدیث بیان کی ، انھوں نے مجاہد سے ، انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
          "fr": "Rapporté par une autre chaîne de transmetteurs : Un hadith similaire a été rapporté",
          "tr": "Bize Ubeydullah b. Muâz rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, A'meş'den, o da Mücâhid'den, o da ibni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etti. Kİ O 2800 DIR Bu nedenle buradaki sened’in metmi olarak 2800’ü görebilirsiniz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 7075,
      "arabicNumber": "2801.02",
      "book": 52,
      "hadithInBook": 31,
      "text": {
        "arabic": "وَحَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كِلاَهُمَا عَنْ شُعْبَةَ، بِإِسْنَادِ ابْنِ مُعَاذٍ عَنْ شُعْبَةَ، نَحْوَ حَدِيثِهِ غَيْرَ أَنَّ فِي، حَدِيثِ ابْنِ أَبِي عَدِيٍّ فَقَالَ ‏ \"‏ اشْهَدُوا اشْهَدُوا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording",
          "ur": "محمد بن جعفر اور ابن عدی دونوں نے شعبہ سے ، شعبہ سے ابن معاذ کی سند کے ساتھ اسی کی حدیث نے مانند روایت کی ، مکر ابن ابی عدی کی حدیث میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( اس کے ) گواہ بن جاؤ ، گواہ بن جاؤ ۔",
          "fr": "Rapporté par Shu'ba : Ce hadith a été transmis avec une légère variation dans les mots",
          "tr": "{M-45} Bu hadîsi bana Bişr b, Hâlid de rivayet etti. (Dediki): Bize Muhammed b. Ca'fer haber verdi. H. Bize Muhammed b. Beşşâr' dahi rivayet etti. (Dediki): Bize İbni Ebî Adiy rivayet etti. Her iki râvî Şu'be'den İbni Muâz'ın Şu'be'den isnâdıyla onun hadîsi gibi rivayette bulunmuşlardır. Yalnız İbni Ebî Adiyy'in hadîsinde : «Bunun özerine: Şahîd olun! Şahîd olun! buyurdular.» ifâdesi vardır. İZAH 2803 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 7078,
      "arabicNumber": "2802.03",
      "book": 52,
      "hadithInBook": 33,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ ح وَحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ انْشَقَّ الْقَمَرُ فِرْقَتَيْنِ ‏.‏ وَفِي حَدِيثِ أَبِي دَاوُدَ انْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Anas reported that the moon was split up in two parts and in the hadith recorded in Abu Dawud, the words are:\" The moon was split up into two parts during the life of Allah's Messenger (ﷺ)",
          "ur": "یحییٰ بن سعید ، محمد بن جعفر اور ابو داود سب نے شعبہ سے ، انھوں نے قتادہ سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : چاند دو ٹکڑوں میں پھٹ گیا ۔ اور ابو داود ( طیالسی ) کی حدیث میں ہے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں چاند پھٹ گیا ۔",
          "fr": "Rapporté par Anas : La lune a été fendue en deux, et dans le hadith rapporté par Abu Dawud, il est dit : « La lune a été fendue en deux du vivant du Messager d’Allah ﷺ. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Abu Dawud]. Telah menceritakan kepada kami [Ibnu Basyar] telah menceritakan kepada kami [Yahya bin Sa'id], [Muhammad bin Ja'far] dan [Abu Dawud], semuanya dari [Syu'bah] dari [Qatadah] dari [Anas] berkata: Bulan terbelah menjadi dua bagian. Dalam hadits Abu Dawud disebutkan: Bulan terbelah dimasa Rasulullah Shallallahu 'alaihi wa Salam",
          "tr": "Bize Muhammed b. Mûsennâ da rivayet etti. (Dediki): Bi2e Muhammed b. Ca'fer ile Ebû Dâvud rivayet ettiler. H. Bize îbni Beşşâr dahi rivayet etti. (Dediki): Bize Yahya b. Saîd ile Muhammed b. Ca'fer ve Ebû Dâvud rivayet ettiler. Bunların hepsi Şu'be*den, o da Katâde'den, o da Enes'den naklen rivayet etmişlerdir. Enes: «Ay iki parçaya ayrıldı.» demiştir. Ebû Davud'un hadîsinde: «Resulullah (Sallallahu Aleyhi ve Sellem) zamanında ay yarıldı.» ifâdesi vardır. İZAH 2803 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 7079,
      "arabicNumber": "2803",
      "book": 52,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ قُرَيْشٍ التَّمِيمِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرِ بْنِ مُضَرَ، حَدَّثَنِي أَبِي، حَدَّثَنَا جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّ الْقَمَرَ انْشَقَّ عَلَى زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas reported that the moon was split up during the lifetime of Allah's Messenger (may peace he upon him)",
          "ur": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں چاند پھٹ گیا ۔",
          "fr": "Rapporté par Ibn ‘Abbas : La lune a été fendue du vivant du Messager d’Allah ﷺ",
          "id": "Telah menceritakan kepada kami [Musa bin Quraisy At Taimi] telah menceritakan kepada kami [Ishaq bin Bukair bin Mudlar] telah menceritakan kepadaku [ayahku] telah menceritakan kepada kami [Ja'far bin Rabi'ah] dari [Irak bin Malik] dari [Ubaidullah bin Abdullah bin Utbah bin Mas'ud] dari [Ibnu Abbas] berkata: Di masa Rasulullah Shallallahu 'alaihi wa Salam bulan pernah terbelah",
          "tr": "Bize Musa b. Kureyş Et-Temîmî rivayet etti. (Dediki): Bize İshak b. Bekr b. Mudar rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Bize Ca'fer b. Rabîa, Irak b. Mâlik'den, o da Ubeydullah b. Abdillah b. Utbe b. Mes'ud'dan, o da İbni Abbas'dan naklen rivayet etti. İbnû Abbas: «Gerçekten ay Resulullah (Sallallahu Aleyhi ve Sellem) zamanında yarıldı.» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 7082,
      "arabicNumber": "2804.03",
      "book": 52,
      "hadithInBook": 36,
      "text": {
        "arabic": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا سَعِيدُ بْنُ، جُبَيْرٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ قَيْسٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا أَحَدٌ أَصْبَرَ عَلَى أَذًى يَسْمَعُهُ مِنَ اللَّهِ تَعَالَى إِنَّهُمْ يَجْعَلُونَ لَهُ نِدًّا وَيَجْعَلُونَ لَهُ وَلَدًا وَهُوَ مَعَ ذَلِكَ يَرْزُقُهُمْ وَيُعَافِيهِمْ وَيُعْطِيهِمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Qais reported from Allah's Messenger (ﷺ) that none is more forbearing in listening to the most irksome things than Allah, the Exalted. They associate rivals with him, attribute sonhood to Him, but in spite of this He provides them sustenance, grants them safety, confers upon them so many things",
          "ur": "عبیداللہ بن سعید نے مجھے حدیث بیان کی ، کہا : ہمیں ابو اسامہ نے اعمش سے حدیث بیان کی ، انھوں نے کہا : ہمیں سعید بن جبیر نے ابو عبدالرحمان سلمی سے روایت کی ، انھوں نے کہا : حضرت عبداللہ بن قیس ( ابو موسیٰ اشعری ) رضی اللہ تعالیٰ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی نہیں جو تکلیف دہ باتوں پر جنھیں وہ سنتا ہے اللہ تعالیٰ سے زیادہ صبر کرنے والا ہو ، لوگ ( دوسروں کو ) اس کاشریک ٹھہراتے ہیں ، اس کی اولاد بناتے ہیں اور وہ اس ( سب کچھ ) ک باوجود انھیں رزق دیتا ہے ، عافیت بخشتا ہے اور ( جو مانگتے ہیں ) عطا کرتا ہے ۔",
          "fr": "Rapporté par Abdullah b. Qais : Le Messager d’Allah ﷺ a dit : « Personne n’est plus patient qu’Allah, le Très-Haut, pour écouter les choses les plus pénibles. Les gens Lui associent des partenaires, Lui attribuent un fils, et malgré cela, Il leur accorde leur subsistance, leur donne la sécurité et leur accorde de nombreux bienfaits. »",
          "id": "Telah menceritakan kepadaku [Ubaidullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Al A'masy] telah menceritakan kepada kami [Sa'id bin Jubair] dari [Abu Abdurrahman As Sulami] berkata: [Abdullah bin Qais] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \" Tidak ada siapa pun yang lebih bersabar atas gangguan yang ia dengar melebihi Allah Ta'ala, mereka membuat tandingan untuknya dan menganggapNya punya anak, meski demikian Ia memberi mereka rizki, memaafkan dan memberi mereka",
          "tr": "Bana Ubeydullah b. Saîd de rivayet etti. (Dediki): Bize Ebû Usâme, A'meş'den rivayet etti. (Demişki): Bize Saîd b. Cübeyr, Ebû Abdirrahman Es-Sülemî'den rivayet etti. (Demişki): Abdullah b. Kays şunu söyledi. Resulullah (Sallallahu Aleyhi ve Sellem): «İşittiği bîr ezaya Allah Tealâ'dan daha sabırlı kimse yoktur, kâfirler ona şerik koşuyor, çocuk iddia ediyor, bununla beraber o kendilerine nzk ve afiyet ihsan ediyor, onlara veriyor!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 7083,
      "arabicNumber": "2805.01",
      "book": 52,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى لأَهْوَنِ أَهْلِ النَّارِ عَذَابًا لَوْ كَانَتْ لَكَ الدُّنْيَا وَمَا فِيهَا أَكُنْتَ مُفْتَدِيًا بِهَا فَيَقُولُ نَعَمْ فَيَقُولُ قَدْ أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ - أَحْسَبُهُ قَالَ - وَلاَ أُدْخِلَكَ النَّارَ فَأَبَيْتَ إِلاَّ الشِّرْكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:Allah, the Exalted and High, would say to one who shall have to undergo the least torture (on the Day of Resurrection): Would you like to go as ransom if you had all worldly riches; he would say: Yes. Allah would say to him: When you were in the loins of Adam, I demanded from you something easier than this that you should not associate anything with Me. (The narrator says): I think He also said: I would not cause you to enter Hell-Fire but you defied and attributed Divinity (to others besides Me)",
          "ur": "معاذ عنبری نے کہا : ہمیں شعبہ نے ابو عوان جونی سے ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" اللہ تبارک وتعالیٰ اس شخص سے ، جسے اہل جہنم میں سب سے کم عذاب ہوگا ، فرمائے گا : اگر پوری دنیا اور جو کچھ اس میں ہے ۔ تمہارے پاس ہوتو ( عذاب سے چھوٹ جانے کے لئے ) اسے بطور فدیہ دے دو گے؟وہ کہے گا : ہاں ، تو وہ ( اللہ تعالیٰ ) فرمائے گا : میں نے تم سے اس وقت جب تم آدم علیہ السلام کی پشت میں تھے ، اس کی نسبت بہت کم کا مطالبہ کیا تھا کہ تم شرک نہ کرنا ۔ میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے ( آگے یہ ) فرمایا ۔ ۔ ۔ اور میں تمھیں آگ میں نہیں ڈالوں گا ، مگر تم نے شرک ( کرنے ) کے سوا ہر چیز سے انکارکردیا ۔",
          "fr": "Rapporté par Anas b. Malik : Le Messager d’Allah ﷺ a dit : « Allah, le Très-Haut et le Sublime, dira à celui qui subira le plus léger des tourments le Jour de la Résurrection : “Si tu possédais toutes les richesses du monde, aimerais-tu t’en servir comme rançon ?” Il répondra : “Oui.” Allah lui dira : “Quand tu étais dans les reins d’Adam, Je t’ai demandé quelque chose de plus facile que cela : que tu n’associes rien à Moi.” (Le narrateur dit) : Je pense qu’Il a aussi dit : “Je ne t’aurais pas fait entrer en Enfer, mais tu as désobéi et tu as attribué des associés à Ma Divinité.” »",
          "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz Al Ambari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abu Imran Al Jauni] dari [Anas bin Malik] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Allah Tabaraka wa Ta'ala bertanya kepada penduduk neraka yang siksanya paling ringan: 'Andai kau memiliki dunia seisinya, apa kau akan menebusnya? ' orang itu menjawab: 'Ya.' Allah berfirman: 'Aku telah menginginkan yang lebih ringan dari (siksaan) ini saat kau masih berada ditulang rusuk Adam agar kau tidak menyekutukan -saya (Anas) kira beliau bersabda: 'Dan Aku tidak memasukkanmu ke neraka, tapi kau enggan dan tetap menyekutukan.\" Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Imran] berkata: Aku mendengar [Anas bin Malik] menceritakan dari nabi Shallallahu 'alaihi wa Salam sepertinya, hanya saja ia tidak menyebut: Dan Aku tidak memasukkanmu ke neraka",
          "tr": "Bize Ubeydullah b. Muâz EI-Anberî rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be, Ebû İmran El-Cevnî'den, o da Enes b. Mâlik*den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. (Şöyle buyurmuşlar) : «Allah Tebâreke ve Teâla cehennemliklerin en hafif azab edilenine: Dünya ve ondaki butun varlıklar senin olsa, onları fidye verir miydin? diye soracak. O kîmse : Evet! cevabını verecektir. Bunun üzerine : Ben senden daha Adem'in sulbünde iken bundan daha ehvenini, şirk koşmamanı (zannederim şöyle dedi)... Benim de seni cehenneme koymamamı diledim de, sen şirk'den başkasını kabul etmedin, buyuracaktır.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 7084,
      "arabicNumber": "2805.02",
      "book": 52,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ إِلاَّ قَوْلَهُ ‏ \"‏ وَلاَ أُدْخِلَكَ النَّارَ ‏\"‏ ‏.‏ فَإِنَّهُ لَمْ يَذْكُرْهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters, but with a slight variation of wording (and the words are):I shall cause him to enter Hell.\" (The words subsequent to these) have not been mentioned",
          "ur": "محمد بن جعفر نے کہا : ہمیں شعبہ نے ابو عمران سے حدیث بیان کی ، کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، وہ نبی اکرم صلی اللہ علیہ وسلم سے حدیث بیان کررہے تھے ، اسی کے مانند ، سوائے ( اللہ تعالیٰ کے ) اس قول کے : \" اور میں تمھیں آگ میں نہیں ڈالوں گا \" انھوں نے اسے بیان نہیں کیا ۔",
          "fr": "Rapporté par Anas ibn Malik : Ce hadith a été rapporté par Anas ibn Malik par une autre chaîne de transmetteurs, avec une légère variation dans les mots : « Je le ferai entrer en Enfer. » (Les paroles suivantes n’ont pas été mentionnées)",
          "tr": "{M-51} Bize bu hadîsi Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Muhammed (yâni; îbni Ca'fer) rivayet etti. (Dediki); Bize Şu'be, Ebû îmran'dan rivayet etti. (Demişki): Ben Enes b. Mâlik'i, Nebi (Sallallahu Aleyhi ve Sellemj'den naklen bu hadîsin mislini rivayet ederken dinledim. Yalnız: «Seni cehenneme koymamamı...» ifâdesi müstesna! Çünkü onu anmamıştır)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 7085,
      "arabicNumber": "2805.03",
      "book": 52,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُقَالُ لِلْكَافِرِ يَوْمَ الْقِيَامَةِ أَرَأَيْتَ لَوْ كَانَ لَكَ مِلْءُ الأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ ‏.‏ فَيُقَالُ لَهُ قَدْ سُئِلْتَ أَيْسَرَ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that Allah's Messenger (may peace be u n him) said:It would be said to the non-believers on the Day of Resurrection: If you were to possess gold, filling the whole earth, would you like to secure your freedom by paying that? He would say: Yes. Thereupon it would be said to him: Something easier (than this) was demanded from you (but you paid no heed to it)",
          "ur": "ہشام ( دستوائی ) نے قتادہ سےروایت کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا \" قیامت کے دن کافر سے کہا جائے گا : تمہارا کیا خیال ہے ، اگر تمہارے پاس زمین ( کی مقدار ) بھر سونا موجود ہوتو کیا تم ( جہنم کے عذاب سے بچنے کے لئے ) اس کو بطور فدیہ دے دو گے؟وہ کہے گا : ہاں ، تو اس سے کہا جائے گا : تم سے تو اس سے بہت آسان مطالبہ کیاگیا تھا ۔",
          "fr": "Rapporté par Anas ibn Malik : Le Messager d’Allah ﷺ a dit : « Il sera dit aux non-croyants le Jour de la Résurrection : “Si tu possédais de l’or remplissant toute la terre, voudrais-tu t’en servir pour te libérer ?” Il répondra : “Oui.” Alors il lui sera dit : “On t’a demandé quelque chose de bien plus facile que cela (mais tu n’y as pas prêté attention).” »",
          "id": "Telah menceritakan kepada kami [Ubaidullah bin Umar Al Qawariri], [Ishaq bin Ibrahim], [Muhammad bin Al Mutsanna] dan [Ibnu Basyar], [Ishaq] berkata: Telah mengkhabarkan kepada kami dan yang lainnya berkata: Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepada kami [ayahku] dari [Qatadah] telah menceritakan kepada kami [Anas bin Malik] bahwa nabi Shallallahu 'alaihi wa Salam bersabda: \"Pada hari kiamat orang kafir ditanya: 'Andai kau memiliki emas sepenuh bumi, apa akan kau jadikan penebus? ' ia menjawab: 'Ya.' Dikatakan padanya: 'Kau pernah diminta yang lebih ringan darinya'.\" Telah menceritakan kepada kami [Abdu bin Humaid] telah menceritakan kepada kami [Rouh bin Ubadah]. Telah menceritakan kepadaku [Amru bin Zurarah] telah mengkhabarkan kepada kami [Abdulwahahb bin Atho`], keduanya dari [Sa'id bin Abu Urubah] dari [Qatadah] dari [Anas] dari nabi Shallallahu 'alaihi wa Salam sepertinya, hanya saja ia berkata: Lalu dikatakan padanya: \"Kau pernah diminta sesuatu yang lebih ringan darinya",
          "tr": "Bize Ubeydullah b. Ömer El-Kavârîrî ile İshak b. İbrahim, Muhammed h. Müsennâ ve İbni Beşşâr rivayet ettiler. (İshak: Ahbeıana; ötekiler: Haddesena tâbirlerini kullandılar.) (Dedilerki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bize babam, Katâde'den rivayet etti. (Demişki): Bize Enes b. Mâlik rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurmuşlar : «Kıyamet gönünde kâfire: Ne dersin? Senin yer dolusu altının olsa, bunları fidye verir miydin? diye sorulacak. Kâfir: Evet! cevabını verecek. Bunun üzerine kendisine: Senden bundan daha kolayı istenmişti, denilecektir.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 7086,
      "arabicNumber": "2805.04",
      "book": 52,
      "hadithInBook": 40,
      "text": {
        "arabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، ح وَحَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - كِلاَهُمَا عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏ \"‏ فَيُقَالُ لَهُ كَذَبْتَ قَدْ سُئِلْتَ مَا هُوَ أَيْسَرُ مِنْ ذَلِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas reported this hadlth through another chain of transmitters and the words are:\" It would be said to him: You have told a lie; what had been demanded from you was quite easier than this (the belief in the Oneness of Allah)",
          "ur": "سعید بن ابی عرو بہ نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انھوں نے ( اس طرح ) کہا؛ \" تو اس سے کہاجائے گا : تم جھوٹ بولتے ہو ، تم سے تو اس سے بہت آسان ( بات کا ) مطالبہ کیاگیا تھا ۔",
          "fr": "Rapporté par Anas : Ce hadith a été rapporté par une autre chaîne de transmetteurs et les paroles sont : « Il lui sera dit : “Tu as menti ; ce qu’on t’a demandé était bien plus facile que cela (croire en l’Unicité d’Allah).” »",
          "tr": "Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Ravh b. Ubâde rivayet etti. H. Bana Amr b. Zürâra da rivayet etti. (Dediki): Bize Abdü'l-Vahhab (yâni; İbni Atâ') haber verdi. Her iki râvi Saîd b. Ebî Arûbe'den, o da Katâde'den, o da Enes'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etmiştir. Yalnız o: «Kendisine: Yalan söyledin, senden bundan daha kolayı istenmişti, buyurulacaktır...» demiştir. izah: Bu hadîsi Buhârî Kitâbu'l-Enbiya ile Kitabu sıfetü Nâr'da tahric etmiştir. İftida: Kişinin düştüğü vartadan kurtulmak için mal vermesidir. Bu hadîsdeki «diledim» tâbirinden murad; emrettim, demektir. Nitekim rivayetin birinde, senden istenildi, buyurulması bu mânâyı te'yid etmektedir. Çünkü ehl-i hakka göre Allah Teâlâ bir şeyi dilediği vakit olmaması imkânsızdır. Ehl-i Hakkın mezhebine göre Allah Teâlâ var olan şeylerin hepsini hayrıyle, şerriyle dileyerek yaratır. Bunlar da imanla küfürde dâhildir. Mü'minin imanını, kâfirin de küfrünü murad eder. Bu bâb da Mu'tezile fırkası muhalefet etmiş: «Allah kâfirin imânını murad etmiş; küfrünü dilememiştir.» demişlerdir. Bu söz bâtıldır. Çünkü Allah Teâlâ hakkında âciz isbatını istilzam eder. Bundan Allah Teâlâ'nın mülkünde dilemediği şeylerin vuku bulması lâzım gelir. Ki, Teâlâ Hazretleri bundan münezzehdir. Hadisin mânâsı şudur: Kıyamet gününde dünya bütün varlıklarıyla kâfirlerin elinde olsa ve azabdan kurtulmak için bunu fidye olarak vermek ellerinden gelse, hiç tereddüd etmeden verirlerdi. Hadîsdeki, yalan söyledin, tâbiri: Dünyaya dönmüş olsan bunu yapmazdın, yalan söylerdin, manasınadır. Yoksa âhirette mülk'e kadir olsalar onu gerçekten fidye olarak verirler. Hadîs-i şerif Allah buyuruyor. Allah diyor, gibi sözlerin caiz olduğu da delildir. Selefden bazıları bunu kerih görmüş: «Allah buyurdu...» denilmesi lâzım geldiğini söylemişlerdir. Bunun doğru olmadığını evvelce görmüş, bilûmum ulemânın cevaza kail olduklarını bildirmiştik"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 7087,
      "arabicNumber": "2806",
      "book": 52,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يُونُسُ، بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ قَالَ ‏ \"‏ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى رِجْلَيْهِ فِي الدُّنْيَا قَادِرًا عَلَى أَنْ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that a person said:Allah's Messenger, how the non-believers be made to assemble on the Day of Resurrection (by crawling) on their faces? Thereupon he said: Is He Who is powerful to make them walk on their feet not powerful enough to make them (crawl) upon their faces on the Day of Resurrection? Qatada said: Of course, it is so. (He adjured): By the might of our Lord",
          "ur": "شیبان نے ہمیں قتادہ سے حدیث بیان کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ ایک شخص نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! قیامت کے روز کافر کو کس طرح منہ کے بل میدان حشر میں لایا جائے گا؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کہ جس نے دنیا میں پاؤں کے بل چلایا ہےوہ اس بات پر قادر نہیں کہ قیامت کے دن اسے منہ کے بل چلائے؟ \"\" قتادہ نے ( حدیث سنانے کے بعد ) کہا : کیوں نہیں ، ہمارے رب کی عزت کی قسم! ( وہ قادر ہے)",
          "fr": "Rapporté par Anas ibn Malik : Un homme a demandé : « Ô Messager d’Allah, comment les non-croyants seront-ils rassemblés le Jour de la Résurrection en rampant sur leur visage ? » Il répondit : « Celui qui a le pouvoir de les faire marcher sur leurs pieds n’est-il pas capable de les faire ramper sur leur visage le Jour de la Résurrection ? » Qatada dit : « Bien sûr, c’est ainsi. » (Il jura) : « Par la puissance de notre Seigneur. »",
          "id": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [Abdu bin Humaid], teks milik Zuhair, keduanya berkata: Telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Syaiban] dari [Qatadah] telah menceritakan kepada kami [Anas bin Malik], seseorang bertanya: Wahai Rasulullah, bagaiaman orang kafir dikumpulkan (dengan berjalan) di atas wajahnya pada hari kiamat? Beliau menjawab: \"Bukankah Yang membuatnya berjalan dengan dua kaki di dunia mampu untuk membuatnya berjalan di atas wajahnya pada hari kiamat?\" Qatadah menjawab: Benar, demi kemuliaan Rabb kami",
          "tr": "Bana Züheyr b. Harb ile Abd b. Humeyd rivayet ettiler. Lâfız Züheyr'indir. (Dedilerki): Bize Yûnus b. Muhammed rivayet etti. (Dediki): Bize Şeyban, Katâde'den rivayet etti. (Demişki): Bize Enes b. Mâlik rivayet etti ki: Bir adam : — Yâ Resûlallah! Kıyamet gününde kâfir yüzüstü nasıl haşredilecek? diye sormuş. Resulullah (Sallallahu Aleyhi ve Selletn): «Onu dünyada iki ayağı üzerinde yürüten, Kıyamet gününde yüzüstü yürütmeye kadir değil midir?» buyurmuşlar. Katâde: Hay hay, Rabbimizin izzeti hakkı için, demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 7088,
      "arabicNumber": "2807",
      "book": 52,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النَّارِ صَبْغَةً ثُمَّ يُقَالُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ فَيَقُولُ لاَ وَاللَّهِ يَا رَبِّ ‏.‏ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ هَلْ مَرَّ بِكَ شِدَّةٌ قَطُّ فَيَقُولُ لاَ وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤُسٌ قَطُّ وَلاَ رَأَيْتُ شِدَّةً قَطُّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that Allah's Messenger (ﷺ) said that one amongst the denizens of Hell who had led a life of ease and plenty amongst the people of the world would be made to dip in Fire only once on the Day of Resurrection and then it would be said to him:O, son of Adam, did you find any comfort, did you happen to get any material blessing? He would say: By Allah, no, my Lord. And then that person from amongst the persons of the world be brought who had led the most miserable life (in the world) from amongst the inmates of Paradise. and he would be made to dip once in Paradise and it would be said to him. 0, son of Adam, did you face, any hardship? Or had any distress fallen to your lot? And he would say: By Allah, no,0 my Lord, never did I face any hardship or experience any distress",
          "ur": "سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : قیامت کے دن اہل دوزخ میں سے اس شخص کو لایا جائے گا جو دنیا میں سب سے زیادہ آسودہ تر اور خوشحال تھا ، پس دوزخ میں ایک بار غوطہ دیا جائے گا ، پھر اس سے پوچھا جائے گا کہ اے آدم کے بیٹے! کیا تو نے دنیا میں کبھی آرام دیکھا تھا؟ کیا تجھ پر کبھی چین بھی گزرا تھا؟ وہ کہے گا کہ اللہ کی قسم! اے میرے رب! کبھی نہیں اور اہل جنت میں سے ایک ایسا شخص لایا جائے گا جو دنیا میں سب لوگوں سے سخت تر تکلیف میں رہا تھا ، جنت میں ایک بار غوطہ دیا جائے گا ، پھر اس سے پوچھا جائے گا کہ اے آدم کے بیٹے! تو نے کبھی تکلیف بھی دیکھی ہے؟ کیا تجھ پر شدت اور رنج بھی گزرا تھا؟ وہ کہے گا کہ اللہ کی قسم! مجھ پر تو کبھی تکلیف نہیں گزری اور میں نے تو کبھی شدت اور سختی نہیں دیکھی ۔",
          "fr": "Rapporté par Anas ibn Malik : Le Messager d’Allah ﷺ a dit qu’une personne parmi les habitants de l’Enfer, qui avait vécu dans l’aisance et le confort ici-bas, sera plongée une seule fois dans le Feu le Jour de la Résurrection. On lui dira alors : « Ô fils d’Adam, as-tu connu le bonheur, as-tu eu des bienfaits matériels ? » Il répondra : « Par Allah, non, mon Seigneur. » Ensuite, on amènera une personne parmi les gens du Paradis qui avait eu la vie la plus difficile sur terre, et on la plongera une seule fois au Paradis. On lui dira : « Ô fils d’Adam, as-tu connu la misère ? As-tu eu des épreuves ? » Et il dira : « Par Allah, non, ô mon Seigneur, je n’ai jamais connu la misère ni la détresse. »",
          "tr": "Bize Amru'n-Nâkıd rivayet etti. (Dediki): Bize Yezid b. Harun rivayet etti. (Dediki): Bize Hammad b. Seleme, Sabit El-Bûnânî'den, o da Enes b. Mâlik'den naklen haber verdi. (Demişki): Resûlulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: «Kıyamet gününde cehennemliklerin dünyaya dalan en müreffehi getirilerek cehenneme bir kere daldırılacak. Sonra : — Ey âdemoğlu! Hiç bir hayır gördün mü? Sana hiç bir nimet uğradı mı? denilecek. O : — Hayır! Vallahi Yarabbi! diyecek. Bir de cennetliklerden dünyada iken insanların en yoksulu getirilecek ve cennete bîr kere daldırılacak. Kendisine : — Ey Âdemoğlu! Hiç yoksulluk gördün mü? Başından hiç şiddet geçti mi? dîye sorulacak. O da : — Hayır! Vallahi ya Rabbi! Başımdan hiç yoksulluk geçmedi : Hiç bir şiddet görmedim, diyecektir.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 7089,
      "arabicNumber": "2808.01",
      "book": 52,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ لاَ يَظْلِمُ مُؤْمِنًا حَسَنَةً يُعْطَى بِهَا فِي الدُّنْيَا وَيُجْزَى بِهَا فِي الآخِرَةِ وَأَمَّا الْكَافِرُ فَيُطْعَمُ بِحَسَنَاتِ مَا عَمِلَ بِهَا لِلَّهِ فِي الدُّنْيَا حَتَّى إِذَا أَفْضَى إِلَى الآخِرَةِ لَمْ تَكُنْ لَهُ حَسَنَةٌ يُجْزَى بِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:Verily, Allah does not treat a believer unjustly in regard to his virtues. He would confer upon him (His blessing) in this world and would give him reward in the Hereafter. And as regards a non-believer, he would be made to taste the reward (of virtue in this world) what he has done for himself so much that when it would be the Hereafter, he would find no virtue for which he should be rewarded",
          "ur": "ہمام بن یحییٰ نے قتادہ سے ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک اللہ تعالیٰ کسی مومن کے ساتھ ایک نیکی کے معاملے میں بھی ظلم نہیں فرماتا ۔ اس کے بدلے اسے دنیا میں بھی عطا کرتا ہے اور آخرت میں بھی اس کی جزا دی جاتی ہے ۔ رہا کافر ، اسے نیکیوں کے بدلے میں جو اس نے دنیا میں اللہ کے لئے کی ہوتی ہیں ، اسی دنیا میں کھلا ( پلا ) دیا جاتاہے حتیٰ کہ جب وہ آخرت میں پہنچتا ہے تو اس کے پاس کوئی نیکی باقی نہیں ہوتی جس کی اسے جزا دی جائے ۔",
          "fr": "Rapporté par Anas ibn Malik : Le Messager d’Allah ﷺ a dit : « En vérité, Allah n’est pas injuste envers le croyant pour ses bonnes actions. Il lui accorde Ses bienfaits dans cette vie et lui donnera une récompense dans l’Au-delà. Quant au non-croyant, il goûtera la récompense de ses bonnes actions dans ce monde, au point que, lorsqu’il sera dans l’Au-delà, il ne trouvera aucune bonne action pour laquelle il devrait être récompensé. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb], teks milik Zuhair, keduanya berkata: Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam bin Yahya] dari [Qatadah] dari [Anas bin Malik] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya Allah tidak menzhalimi kebaikan orang mu`min yang diberikan didunia dan akan dibalas diakhirat, sedangkan orang kafir diberi makan karena kebaikan-kebaikan yang dikerjakan karena Allah didunia hingga ia menuju akhirat tanpa memiliki suatu kebaikan pun yang bisa dibalas",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb rivayet ettiler. Lafız Züheyr'indir. (Dedilerki): Bize Yezîd b. Harun rivayet etti. (Dediki): Bize Hemmam b. Yahya, Katade'den, o da Enes b. Malik'den naklen haber verdi. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz ki, Allah hiç bir mü'mine işlediği hayrı mükafatsız bırakmaz. O hayır sebebiyle hem dünyada dilediği verilir, hem de ahirette mükafatlandırılır. Kafire gelince dünyada Allah için yaptığı hayırlar karşılığında ona rızık verilir. Ahirete vardığında ise onun kendisi ile mükafatlandırılacağı bir hayrı yoktur.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 7090,
      "arabicNumber": "2808.02",
      "book": 52,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْكَافِرَ إِذَا عَمِلَ حَسَنَةً أُطْعِمَ بِهَا طُعْمَةً مِنَ الدُّنْيَا وَأَمَّا الْمُؤْمِنُ فَإِنَّ اللَّهَ يَدَّخِرُ لَهُ حَسَنَاتِهِ فِي الآخِرَةِ وَيُعْقِبُهُ رِزْقًا فِي الدُّنْيَا عَلَى طَاعَتِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that Allah's Messenger (ﷺ) thus told him:When a non-believer does good he is made to taste Its reward in this world. And so far as the believer is concerned, Allah stores (the reward) of his virtues for the Hereafter and provides him sustenance in accordance with his obedience to Him",
          "ur": "معتمر کے والد ( سلیمان ) نے کہا : ہمیں قتادہ نے انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی : \" بلاشبہ ایک کافر جب کوئی نیک کام کر تا ہے ۔ تو اس کے بدلے اسے دنیاکے کھانوں ( نعمتوں ) میں سے ایک لقمہ ( نعمت کی صورت میں ) کھلادیتاہے اور مومن اللہ تعالیٰ اس کی نیکیوں کا ذخیرہ آخرت میں کرتا جاتا ہے ۔ اور اس کی اطاعت شعاری پر دنیا میں ( بھی ) اسے رزق عطا فرماتا ہے ۔",
          "fr": "Rapporté par Anas ibn Malik : Le Messager d’Allah ﷺ lui a dit : « Quand un non-croyant fait le bien, il en goûte la récompense dans ce monde. Quant au croyant, Allah garde la récompense de ses bonnes actions pour l’Au-delà et lui accorde sa subsistance selon son obéissance envers Lui. »",
          "id": "Telah menceritakan kepada kami [Ashim bin An Nadhr At Taimi] telah menceritakan kepada kami [Mu'tamir] berkata: Aku mendengar [ayahku] telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] ia menceritakan dari Rasulullah Shallallahu 'alaihi wa Salam, bila orang kafir mengerjakan suatu kebaikan, dengan kebaikan itu ia diberi sesuap makanan dari dunia, sedangkan orang mu`min itu kebaikan-kebaikannya disimpan oleh Allah diakhirat dan ia diberi rizki di dunia karena ketaatannya. Telah menceritakan kepada kami [Muhammad bin Abdullah Ar Ruzzi] telah mengkhabarkan kepada kami [Abdulwahhab bin Atho`] dari [Sa'id] dari [Qatadah] dari [Anas] dari nabi Shallallahu 'alaihi wa Salam dengan makna hadits mereka berdua",
          "tr": "Bize Asım b. Nadr Et-Teymî rivayet etti. (Dediki): Bize Mu'temir rivayet etti. (Dediki): Ben babamdan dinledim. (Dediki): Bize Katade, Enes b. Malik'den rivayet etti. O da Resûlullah (Sallallahu Aleyhi ve Sellem)'den rivayet etmişki: Şöyle buyurmuşlar: «Kafir bir hayır işlediği vakit onun sebebiyle kendisine dünyadan bir nimet verilir. Mü'mine gelince, şüphesiz Allah onun hasenatını ahirette biriktirir. Taatından dolayı dünyada da akabinde rıztk verir.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 7091,
      "arabicNumber": "2808.03",
      "book": 52,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمَا ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters",
          "ur": "سعید ( بن ابی عروبہ ) نے قتادہ سے ، انہوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ان دونوں ( ہمام اور سلیمان ) کی حدیث کے ہم معنی حدیث بیان کی ۔",
          "fr": "Rapporté par Anas ibn Malik : Ce hadith a été rapporté par une autre chaîne de transmetteurs",
          "tr": "{M-57} Bize Muhammed b. Abdillah Er-Ruzzî rivayet etti. (Dediki): Bize Abdu'l-Vehhab b. Ata', Saîd'den, o da Katade'den, o da Enes'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen yukarkilerin hadîsi manasında haber verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 7092,
      "arabicNumber": "2809.01",
      "book": 52,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لاَ تَزَالُ الرِّيحُ تُمِيلُهُ وَلاَ يَزَالُ الْمُؤْمِنُ يُصِيبُهُ الْبَلاَءُ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ شَجَرَةِ الأَرْزِ لاَ تَهْتَزُّ حَتَّى تَسْتَحْصِدَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Similitude of a believer is that of (a standing) crop which the air continues to toss from one side to another; in the same way a believer always (receives the strokes) of misfortune. The similitude of a hypocrite is that of a cypress tree which does not move until it is uprooted",
          "ur": "۔ عبدالاعلیٰ نے ہمیں معمر سے حدیث بیان کی ، انھوں نے زہری سے ، انہوں نے سعید سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مومن کی مثال کھیتی کی طرح ہے ۔ ہوا مسلسل اس کو ( ایک یا دوسری طرف ) جھکاتی رہتی ہے اور مومن پر مسلسل مصیبتیں آتی رہتی ہیں ، اور منافق کی مثال ودیوار درخت کی طرح ہے ( جس کا تناؤ ہوا میں بھی تن کرکھڑا رہتا ہے ) ۔ بلتا نہیں حتیٰ کہ ( ایک ہی بار ) اسے کاٹ کر گرادیاجاتا ہے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « L’exemple du croyant est comme une plante debout que le vent fait pencher d’un côté à l’autre ; de la même façon, le croyant subit toujours des épreuves. L’exemple de l’hypocrite est comme un cyprès qui ne bouge pas jusqu’à être déraciné. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Perumpamaan orang mu`min seperti tanaman, angin senantiasa menerpanya dan orang mu`min itu akan senantiasa tertimpa musibah. Sedangkan perumpamaan orang munafik seperti pohon cedar, tidaklah ia bergerak hingga di ketam.\" Telah menceritakan kepada kami [Muhammad bin Rafi'] dan [Abdu bin Humaid] dari [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dengan sanad ini, hanya saja dalam hadits Abdurrazzaq menyebut TUFII'UHU sebagai ganti TIMIILUHU",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdû'l-A'la, Ma'mer'den, o da Zûhrî'den, o da Saîd'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem): «Mü'min'in misâli ekin gibidir. Ekini rüzgâr sallar durur. Mü'mine de belâ gelmekte devam eder. Münafığın misâli ise erz ağacı gibidir. Kesilmedikçe sallanmaz.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 7093,
      "arabicNumber": "2809.02",
      "book": 52,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِ عَبْدِ الرَّزَّاقِ مَكَانَ قَوْلِهِ تُمِيلُهُ ‏ \"‏ تُفِيئُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters, but with a slight variation of wording",
          "ur": "عبدالرزاق نے کہا : ہمیں معمر نے زہری سے اسی سند کے ساتھ خبر دی مگر عبدالرزاق کی حدیث میں آپ صلی اللہ علیہ وسلم کے فرمان : \" اسے جھکاتی رہتی ہے \" کے بجائے \" اسے موڑتی رہتی ہے \" کے الفاظ ہیں ۔",
          "fr": "Rapporté par Zuhri : Ce hadith a été rapporté par la même chaîne de transmetteurs, avec une légère variation dans les mots",
          "tr": "{M-58} Bize Muhammed b. Râfi' ile Abd b. Humeyd, Ahdûrrezzak'dan rivayet ettiler. (Demişki) : Bize Ma'mer, Zührî'den bu isnadla rivayet etti. Yalnız Abdûrrezzâk'ın hadîsinde «tümîlühû» yerine «tülîühû» kelimesi vardır. İZAH 2810 DA"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 7094,
      "arabicNumber": "2810.01",
      "book": 52,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَمُحَمَّدُ بْنُ بِشْرٍ، قَالاَ حَدَّثَنَا زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ تُفِيئُهَا الرِّيحُ وَتَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا أُخْرَى حَتَّى تَهِيجَ وَمَثَلُ الْكَافِرِ كَمَثَلِ الأَرْزَةِ الْمُجْذِيَةِ عَلَى أَصْلِهَا لاَ يُفِيئُهَا شَىْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ka'b reported that Allah's Messenger (ﷺ) said that the similitude of a believer is that of a standing crop in a field which is shaken by wind and then it comes to its original position but it stands at its roots. The similitude of a non-believer is that of a cypress tree which stands on its roots and nothing shakes it but it is uprooted (with) one (violent stroke)",
          "ur": "زکریا بن ابی زائدہ نے سعد بن ابراہیم سے روایت کی ، انھوں نے کہا : مجھے کعب بن مالک رضی اللہ تعالیٰ عنہ کے بیٹے نے اپنے والد کعب بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مومن کی مثال کھیتی کے باریک تیلی جیسے تنے کی ہے ۔ ہوا اسے موڑ دیتی ، ایک مرتبہ زمین پر لٹادیتی ہے اور دوسری مرتبہ اسے سیدھا کریتی ہے ، یہاں تک کہ وہ پیلا ہوکر خشک ہوجاتا ہے اور کافر کی مثال ویودار درخت کی سی ہے جو اپنی جڑوں پر تن کر کھڑا ہوتا ہے ، اسے کوئی چیز موڑ نہیں سکتی ، یہاں تک کہ اس کا اکھڑ کاگرنا ایک ہی بار ہوتا ہے ۔",
          "fr": "Rapporté par Ka'b : Le Messager d’Allah ﷺ a dit que l’exemple du croyant est comme une plante debout dans un champ, secouée par le vent puis qui reprend sa position, mais qui reste enracinée. L’exemple du non-croyant est comme un cyprès qui reste sur ses racines, rien ne le secoue, mais il est déraciné d’un seul coup violent",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair] dan [Muhammad bin Bisyr] keduanya berkata: Telah menceritakan kepada kami [Zakariya bin Abu Za`idah] dari [Sa'ad bin Ibrahim] telah menceritakan kepadaku [Ibnu Ka'ab bin Malik] dari [ayahnya, Ka'ab] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Perumpamaan mu`min itu seperti tanaman yang kuat dan lentur, angin menerpanya, kadang menundukkannya dan kadang membuatnya tegak hingga bergerak, dan perumpamaan orang kafir itu seperti pohon cedar yang dicabut dengan akar-akarnya, tidak ada sesuatu pun yang menerpanya hingga ia dicabut sekali saja",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. Numeyr ile Muhammed b. Bişr rivayet ettiler. (Dedilerki): Bize Zekeriyya b.. Ebî Zaide, Sa'd b. İbrahim'den rivayet etti. (Demişki): Bana İbni Ka'b b. Mâlik, babası Ka'b'dan rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Mü'minin misali ekinden bir deste gibidir. Rüzgar onu eğiltir. Kimi yere yıkar, kimi doğrultur. Nihayet kurur. Kâfirin misâli ise kökü üzerinde dimdik duran erze ağacı gibidir. Onu hiç bir şey eğiltemez. Nihayet sökülmesi bir defada olur.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 7095,
      "arabicNumber": "2810.02",
      "book": 52,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ تُفِيئُهَا الرِّيَاحُ تَصْرَعُهَا مَرَّةً وَتَعْدِلُهَا حَتَّى يَأْتِيَهُ أَجَلُهُ وَمَثَلُ الْمُنَافِقِ مَثَلُ الأَرْزَةِ الْمُجْذِيَةِ الَّتِي لاَ يُصِيبُهَا شَىْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ka'b b. Malik reported on the authority of his father that the similitude of a believer is that of a standing crop. The wind sometimes shakes it and sometimes raises it up and then it comes to its destined end. And the similitude of a hypocrite is that of a cypress tree which is not affected by anything but is uprooted once for all",
          "ur": "زہیر بن حرب نے مجھے حدیث بیان کی ، کہا : ہمیں بشر بن سری اور عبدالرحمان بن مہدی نے حدیث بیان کی ، دونوں نے کہا : ہمیں سفیان بن عینیہ نے سعد بن ابراہیم سے ، انھوں نے عبدالرحمان بن کعب بن مالک سے ، انھوں نے اپنے والد سے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" مومن کی مثال کھیتی کے تیلی نمانرم تنے کی سی ہے جس کو ہوا موڑتی رہتی ہے ، کبھی اس کو لٹا دیتی ہے اور کبھی کھڑا کردیتی ہے ، حتیٰ کہ اس ( کے پک کرکٹنے ) کا وقت آجاتا ہے ، اور منافق کی مثال ویودار کے مضبوط جڑوں والے درخت کی طرح ہے ، اس پر ( ایسی ) کوئی مشکل نہیں آتی ، حتیٰ کہ ایک ہی دفعہ وہ جڑوں سے اکھڑ ( کرگر ) جاتا ہے ۔",
          "fr": "Rapporté par Ka'b ibn Malik, d’après son père : L’exemple du croyant est comme une plante debout. Le vent la secoue parfois, parfois la relève, puis elle atteint sa fin prévue. L’exemple de l’hypocrite est comme un cyprès qui n’est touché par rien, mais qui est déraciné d’un seul coup",
          "tr": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Bişr b. Seriy ile Abdurrahman b. Mehdi rivayet ettiler. (Dedilerki); Bize Süfyan, Sa'd b. İbrahim'den, o da Abdurrahman b. Ka'b b. Mâlik'den, o da babasından naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem): «Mü'minin misâli ekinden bir deste gibidir. Rüzgarlar onu eğiltîr. Bazen yere yıkar, bazen de doğrultur. Nihayet eceli gelir. Münafığın misali ise, kendisine hiç bir şey dokunmayan dimdik erze ağacı gibidir. Sonunda bu ağacın sökülmesi bir defada olur.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 7096,
      "arabicNumber": "2810.03",
      "book": 52,
      "hadithInBook": 50,
      "text": {
        "arabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، وَمَحْمُودُ بْنُ غَيْلاَنَ، قَالاَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ أَنَّ مَحْمُودًا قَالَ فِي رِوَايَتِهِ عَنْ بِشْرٍ ‏\"‏ وَمَثَلُ الْكَافِرِ كَمَثَلِ الأَرْزَةِ ‏\"‏ ‏.‏ وَأَمَّا ابْنُ حَاتِمٍ فَقَالَ ‏\"‏ مَثَلُ الْمُنَافِقِ ‏\"‏ ‏.‏ كَمَا قَالَ زُهَيْرٌ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated through a couple of other chains of transmitters, one which says \"the similitude of the disbeliever\" instead and another which agrees with the wording of the previous hadith",
          "ur": "محمد بن حاتم اور محمود بن غیلان نے مجھے یہی حدیث بیان کی ، دونوں نے کہا : ہمیں بشر بن سری نے حدیث بیان کی ، انھوں نے کہا : ہمیں سفیان نے سعد بن ابراہیم سے حدیث بیان کی ، انھوں نے عبداللہ بن کعب بن مالک سے ، انھوں نے ا پنے والد سے ، اورانھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ، مگر محمود نے بشر سے اپنی روایت میں کہا : \" کافر کی مثال ویودار کے درخت کی طرح ہے ۔ \" اور ابن حاتم نے \" منافق کی مثال \" کہا ، جس طرح زہیر نے کہا ہے ۔",
          "fr": "Rapporté par [anonyme] : Ce hadith a été rapporté par plusieurs autres chaînes de transmetteurs, l’une disant « l’exemple du non-croyant » à la place, et une autre reprenant la formulation du hadith précédent",
          "tr": "Bana bu hadîsi Muhammed b. Hatim ile Mahmud b. Gaylan da rivayet ettiler. (Dedilerki): Bize Bişr b. Seriy rivayet etti. (Dediki): Bize Süfyan, Sa'd b. İbrahim'den, o da Abdullah b. Ka'b b. Mâlik'den, o da babasından, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Şu kadar varki, Mahmud, Bişr'den naklettiği rivayetinde : «Kâfirin misâli ise erze ağacı gibidir.» demiş. İbni Hatim ise Züheyr'in dediği gibi münafığın misâli.» demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 7097,
      "arabicNumber": "2810.04",
      "book": 52,
      "hadithInBook": 51,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، وَعَبْدُ اللَّهِ بْنُ هَاشِمٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ سُفْيَانَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، - قَالَ ابْنُ هَاشِمٍ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، وَقَالَ ابْنُ بَشَّارٍ، عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، - عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ وَقَالاَ جَمِيعًا فِي حَدِيثِهِمَا عَنْ يَحْيَى، ‏ \"‏ وَمَثَلُ الْكَافِرِ مَثَلُ الأَرْزَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Ibn Ka'b through another chain of transmitters but with \" \"the similitude of the disbeliever is that of a cypress tree",
          "ur": "محمد بن بشار اور عبداللہ بن ہاشم نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں یحییٰ قطان نے سفیان سے ، انھوں نے سعد بن ابراہیم سے حدیث بیان کی ۔ ابن ہاشم نے کہا : عبداللہ بن کعب بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے اپنے والد سے روایت کی اور ابن بشار نے کہا : ابن کعب بن مالک رضی اللہ تعالیٰ عنہ سے ر وایت ہے انھوں نے اپنے والد سے ۔ انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، جیسے ان سب کی حدیث ہے ۔ اور ان دونوں نے اپنی حدیث میں کہا : یحییٰ سے روایت ہے : \" اورکافر کی مثال ویودار کے درخت جیسی ہے ۔",
          "fr": "Rapporté par Ibn Ka'b : Ce hadith a été rapporté par une autre chaîne de transmetteurs, mais avec la phrase : « l’exemple du non-croyant est comme un cyprès. »",
          "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Bisyr bin Ar Sari] dan [Abdurrahman bin Mahdi] keduanya berkata: telah menceritakan kepada kami [Sufyan] dari [Sa'id bin Ibrahim] dari [Abdurrahman bin Ka'ab bin Malik] dari [Ayahnya] ia berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan seorang mukmin seperti tanaman yang kuat dan lentur, ketika angin menerpanya, kadang menundukkannya dan kadang membuatnya tegak hingga waktunya tiba, dan perumpamaan orang kafir seperti pohon cedar yang dicabut dengan akar-akarnya, tidak ada sesuatu pun yang menerpanya hingga ia tercabut hanya sekali saja.\" telah menceritakannya kepadaku [Muhammad bin Hatim] dan [Mahmud bin Ghailan] keduanya berkata: telah menceritakan kepada kami [Bisyr bin As Sari] telah menceritakan kepada kami [Sufyan] dari [Sa'd bin Ibrahim] dari [Abdullah bin Ka'ab bin Malik] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, hanya saja Mahmud menyebutkan dalam riwayatnya dari Bisyr; \"Dan perumpamaan orang kafir seperti pohon cedar, sementara Ibnu Hatim menyebutkan; \"Perumpamaan orang munafik.\" sebagaimana yang disebutkan oleh Zuhair. Dan telah menceritakannya kepada kami [Muhammad bin Basyar] dan [Abdullah bin Hasyim] keduanya berkata; telah menceritakan kepada kami [Yahya Al Qaththan] dari [Sufyan] dari [Sa'd bin Ibrahim]. [Ibnu Hasyim] berkata; dari [Abdullah bin Ka'ab bin Malik] dari [Ayahnya]. Ibnu Basyar mengatakan dari Ka'b bin Malik dari Ayahnya dari Nabi shallallahu 'alaihi wasallam seperti hadits mereka, dan mereka menyebutkan dalam haditsnya dari Yahya: \"Dan perumpamaan orang kafir itu seperti pohon cedar",
          "tr": "Bize bu hadîsi Muhammed b. Beşşâr ile Abdullah b. Hâşim de rivayet ettiler. (Dedilerki): Bize Yahya (bu zat Kattân'dır.) Süfyan'dan, o da Sa'd b, İbrahim'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen yukarkilerin hadîsi gibi rivayet etti. Bunların ikisi de Yahya'dan rivayet ettikleri hadîslerinde: «Kâfirin misâli ise erze ağacı gbidir.» demişlerdir. (İbni Haşim: Abdullah b. Ka'b b. Mâlik'den, o da babasından naklen, dedi. İbni Beşşâr ise: İbni Ka'b b. Mâlik'den, o da babasından naklen, dedi)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 7098,
      "arabicNumber": "2811.01",
      "book": 52,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، - وَاللَّفْظُ لِيَحْيَى - قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ، اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا وَإِنَّهَا مَثَلُ الْمُسْلِمِ فَحَدِّثُونِي مَا هِيَ ‏\"‏ ‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي ‏.‏ قَالَ عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ فَقَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏ ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لِعُمَرَ قَالَ لأَنْ تَكُونَ قُلْتَ هِيَ النَّخْلَةُ أَحَبُّ إِلَىَّ مِنْ كَذَا وَكَذَا ‏.‏",
        "translations": {
          "en": "Abdullah b. Umar reported that Allah's Messenger (ﷺ) said:There is a tree amongst trees, the leaves of which do not wither and that is like a Muslim; tell me which that (tree) can be? The people began to think of the trees of the forest. Abdullah said: I thought that it could be the date-palm tree, but I felt hesitant (to say that). They (the Companions) then said: Allah's Messenger, (kindly) tell us which that can be? Thereupon he said: It is the date-palm tree. I made a mention of that to 'Umar, whereupon he said: Had you said that it meant the date-palin tree, this statement of yours (would have been dearer to me) than such and such things",
          "ur": "عبداللہ بن دینار نے کہا کہ انہوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئےسنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" درختوں میں سے ایک درخت ہے جس کے پتے نہیں جھڑتے اور وہ درخت مسلمان کی طرح ہے ۔ لہذا مجھے بتاؤ کہ وہ کون سادرخت ہے؟ \"\" تو لوگوں کا دھیان جنگل کے مختلف درختوں کی طرف کیا ۔ حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : میرے دل میں یہ خیال آیا کہ وہ کھجور کا درخت ہے ۔ لیکن میں جھجک گیا پھر وہ ( لوگ ) کہنے لگے : اللہ کے رسول صلی اللہ علیہ وسلم ! آ پ بتائیے کہ وہ کون سا ( درخت ) ہے؟ کہا : تو آپ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" وہ کھجور کا درخت ہے ۔ \"\" ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے ) کہا : تو میں نے یہ ( بات اپنے والد ) حضرت عمر رضی اللہ تعالیٰ عنہ کوبتائی تو انھوں نے کہا : اگر تم نے کہہ دیا ہوتا کہ وہ کھجور کا درخت ہے تو میرے نزدیک یہ ( جواب ) فلاں فلاں ( سرخ اونٹوں ) سے بھی زیادہ پسندیدہ ہوتا ۔",
          "fr": "Rapporté par Abdullah ibn Umar : Le Messager d’Allah ﷺ a dit : « Il y a un arbre parmi les arbres dont les feuilles ne tombent pas, et il ressemble au musulman. Savez-vous lequel c’est ? » Les gens ont commencé à penser aux arbres de la forêt. Abdullah a dit : « Je pensais que c’était le palmier-dattier, mais j’ai hésité à le dire. » Les Compagnons ont alors demandé : « Ô Messager d’Allah, dis-nous lequel c’est ? » Il répondit : « C’est le palmier-dattier. » J’en ai parlé à ‘Umar, qui m’a dit : « Si tu avais dit que c’était le palmier-dattier, cela m’aurait été plus cher que telle ou telle chose. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Ayyub], [Qutaibah bin Sa'id] dan [Ali bin Hujr As Sa'di], teks milik Yahya, mereka berkata: Telah menceritakan kepada kami [Ismail bin Ja'far] telah mengkhabarkan kepadaku [Abdullah bin Dinar] ia mendengar [Abdullah bin Umar] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \" Sesungguhnya di antara pepohonan ada sebuah pohon yang daunnya tidak gugur, itu seperti orang mu`min, katakan padaku pohon apa itu?\" Abdullah berkata: Orang-orang mengira pohon padang pasir sementara aku mengiranya pohon kurma. Nabi Shallallahu 'alaihi wa Salam bersabda: \"Ia pohon kurma\" tapi aku malu mengatakannya. Abdullah berkata: Aku beritahu Umar apa yang aku kira lalu Umar berkata: Sungguh kau mengatakannya itu lebih aku sukai dari pada aku memiliki ini dan ini",
          "tr": "Bize Yahya b. Eyyûb ile Kuteybe b. Saîd ve Ali b. Hucur Es-Saidî rivayet ettiler. Lâfız Yahya'nındır. (Dedilerki): Bize İsmail (yâni; îbni Ca'fer) rivayet etti. (Dediki): Bana Abdullah b. Dînar haber verdi ki: Abdullah b. Ömer'i şöyle derken işitmiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Gerçekten ağaçlardan bir ağaç vardır ki, yaprağı düşmez. Bu ağaç müslümanın misalidir. Şimdi bana söyleyin, bu ağaç nedir?» buyurdular. Bunun üzerine cemâatin zihinleri kırlardaki ağaçlara takıldı. Abdullah demiş ki: İçimden bunun hurma olduğu geçti. Fakat (söylemeye) utandım. Sonra cemaat: — Bize bunun ne olduğunu söyle yâ Resûlallah! dediler. Bunun üzerine : «O hurma ağacıdır.» buyurdu. Abdullah demiş ki: Ben bunu Ömer'e andım da : «O hurma ağacıdır deseydin, benim için filân ve filân şeyden makbul olurdu.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 7099,
      "arabicNumber": "2811.02",
      "book": 52,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الْخَلِيلِ، الضُّبَعِيِّ عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا لأَصْحَابِهِ ‏\"‏ أَخْبِرُونِي عَنْ شَجَرَةٍ مَثَلُهَا مَثَلُ الْمُؤْمِنِ ‏\"‏ ‏.‏ فَجَعَلَ الْقَوْمُ يَذْكُرُونَ شَجَرًا مِنْ شَجَرِ الْبَوَادِي ‏.‏ قَالَ ابْنُ عُمَرَ وَأُلْقِيَ فِي نَفْسِي أَوْ رُوعِيَ أَنَّهَا النَّخْلَةُ فَجَعَلْتُ أُرِيدُ أَنْ أَقُولَهَا فَإِذَا أَسْنَانُ الْقَوْمِ فَأَهَابُ أَنْ أَتَكَلَّمَ فَلَمَّا سَكَتُوا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ibn Umar reported that Allah's Messenger (ﷺ) one day said to his Companions:Tell me about a tree which has resemblance with a believer. The people began to mention (different) trees of the forest. Ibn 'Umar said: It was instilled in my mind or in my heart and it stuck therein that it implied the date- palm tree. I made up my mind to make a mention of that but could not do that because of the presence of the elderly people there. When there was a hush amongst them (after they had expressed their views), Allah's Messenger (ﷺ) said: It Is the date-palm tree",
          "ur": "ابوخلیل الضبعی نے مجاہد سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک دن رسول اللہ صلی اللہ علیہ وسلم نے ا پنے صحابہ سے فرمایا؛ \"\" مجھے اس درخت کے بارے میں بتاؤ جس کی مثال مومن جیسی ہے ۔ \"\" تو لوگ جنگلوں کے درختوں میں سے کوئی ( نہ کوئی ) درخت بتانے لگے ۔ ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : اور میرے دل میں یا ( کہا : ) میرے ذہن میں یہ بات ڈالی گئی کہ وہ کھجور کا د رخت ہے میں ارادہ کرنے لگا کہ بتادوں ، لیکن ( وہاں ) قوم کے معمر لوگ موجود تھے تو میں ان کی ہیبت سے متاثر ہوکر بولنے سے رک گیا ۔ جب وہ سب خاموش ہوگئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" وہ کھجور کا درخت ہے ۔",
          "fr": "Rapporté par Ibn Umar : Le Messager d’Allah ﷺ a dit un jour à ses Compagnons : « Dites-moi quel arbre ressemble au croyant. » Les gens ont commencé à citer différents arbres de la forêt. Ibn Umar a dit : « J’ai eu l’idée dans mon esprit ou dans mon cœur que c’était le palmier-dattier. J’ai voulu le dire, mais je n’ai pas osé à cause de la présence des personnes âgées. Quand tout le monde s’est tu, le Messager d’Allah ﷺ a dit : “C’est le palmier-dattier.” »",
          "id": "Telah menceritakan kepadaku [Muhammad bin Ubaid Al ghubari] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dari [Abu Al Khalil Adh Dhuba'i] dari [Mujahid] dari [Ibnu Umar] berkata: Rasulullah Shallallahu 'alaihi wa Salam bertanya kepada para sahabat beliau pada suatu hari: \"Beritahukanlah padaku tentang sebuah pohon, perumpamaannya sama seperti orang mu`min.\" orang-orang menyebut salah satu pepohonan gurun lalu Ibnu Umar berkata: Hatiku mengatakan -atau mempertimbangkan pohon tersebut adalah pohon kurma, aku ingin mengatakannya tapi mereka semua orang-orang tua, aku segan berbicara. Saat mereka diam, Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Itu adalah pohon kurma.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ibnu Umar] keduanya berkata: telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Abi Najih] dari [Mujahid] berkata: Aku menemani Ibnu Umar ke Madinah, aku hanya mendengarnya menceritakan satu hadits saja dari Rasulullah Shallallahu 'alaihi wa Salam, ia berkata: Kami berada di dekat nabi Shallallahu 'alaihi wa Salam, beliau diberi daging kurma yang lunak lalu Ibnu Umar menyebutkan seperti hadits mereka berdua. Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Saif] berkata: Aku mendengar [Mujahid] berkata: Aku mendengar [Ibnu Umar] berkata: Rasulullah Shallallahu 'alaihi wa Salam diberi daging kurma yang lunak lalu ia menyebut seperti hadits mereka",
          "tr": "Bana Muhammed b. Ubeyd El-Guberî rivayet etti. (Dediki): Bize Hammad b. Zeyd rivayet etti. (Dediki): Bize Eyyûb Ebû'l-Halil Ed-Dubaî'den, o da Mücahid'den, o da İbni Ömer'den naklen rivayet etti. (Demişki): Bir gün Resulullah (Sallallahu Aleyhi ve Sellem) ashabına : «Bana misâli mü'min gibi olan bir ağaç haber verin!» dedi. Bunun üzerine cemâat çölün ağaçlarından birini anmaya başladılar. İhni Ömer demiş ki: İçimden yahut kalbimden bu ağacın hurma olduğu geçti. Bunu söyleyecek oldum, bir de baktım ki, karşımdakiler kavmin büyükleri! Konuşmaktan çekindim. Onlar susunca Resulullah (Sallallahu Aleyhi ve Sellem): «Bu ağaç hurmadır.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 7100,
      "arabicNumber": "2811.03",
      "book": 52,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَمَا سَمِعْتُهُ يُحَدِّثُ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ حَدِيثًا وَاحِدًا قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِجُمَّارٍ ‏.‏ فَذَكَرَ بِنَحْوِ حَدِيثِهِمَا ‏.‏",
        "translations": {
          "en": "Mujahid said:(I have had the privilege) of accompanying Ibn 'Umar up to Medina but I did not hear him narrate anything from Allah's Messenger (ﷺ) except one hadith. And he said: We were in the presence of Allah's Messenger (ﷺ) that there was brought to him the kernel of a date. The rest of the hadith is the same",
          "ur": "ابن ابی نجیح نے مجاہد سے روایت کی ، کہا : میں مدینہ تک حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے ساتھ رہا ، میں نے انھیں ایک حدیث کے سوا رسول اللہ صلی اللہ علیہ وسلم سے کوئی حدیث بیان کرتے ہوئے نہیں سنا ۔ انھوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے تو آپ کے پاس کھجور کے تنے کانرم گودا لایا گیا ۔ پھر ان دونوں ( ابوخلیل ضبعی اورعبداللہ بن دینار ) کی حدیث کی طرح بیان کیا ۔",
          "fr": "Rapporté par Mujahid : J’ai eu le privilège d’accompagner Ibn ‘Umar jusqu’à Médine, mais je ne l’ai entendu rapporter qu’un seul hadith du Messager d’Allah ﷺ. Il a dit : « Nous étions en présence du Messager d’Allah ﷺ lorsqu’on lui a apporté le noyau d’une datte. » Le reste du hadith est le même",
          "tr": "{m-64} Bize Ebû Bekr b. Ebî Şeybe İle İbni Ebî Ömer rivayet ettiler. (Dedilerki): Bize Süfyan b. Uyeyne îbni Ebî Necih'dan, o da Mücâhid'den naklen rivayet etti. (Şöyle demiş) : İbnû Ömer'le Medine'ye doğru arkadaşlık ettim. Ama onu Resulullah (Sûllallahu Aleyhi ve Sellem)'den bir hadîsden başka hadîs rivayet ederken işitmedim. (Dediki): Nebi (Sallallahu Aleyhi ve Sellem)'in yanında idik. Kendisine hurma özü getirildi... Ve râvî hadîsi yukarkilerin hadîsi gibi nakletmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 7101,
      "arabicNumber": "2811.04",
      "book": 52,
      "hadithInBook": 55,
      "text": {
        "arabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَيْفٌ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ سَمِعْتُ ابْنَ، عُمَرَ يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِجُمَّارٍ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِهِمْ ‏.‏",
        "translations": {
          "en": "Mujahid reported:I heard Ibn 'Umar as saying: There was brought to Allah's Messenger (ﷺ) the kernel. The rest of the hadith is tile same",
          "ur": "سیف نے ہمیں حدیث بیان کی ، انھوں نے کہا : میں نے مجاہد کو سنا ، وہ کہہ رہے تھے : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ کو بیان کرتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے پا س کھجور کے تنے کا نرم گودا لایا کیا ، پھر ان کی حدیث کی طرح بیان کیا ۔",
          "fr": "Rapporté par Mujahid : J’ai entendu Ibn ‘Umar dire : « On a apporté au Messager d’Allah ﷺ un noyau. » Le reste du hadith est le même",
          "tr": "{m-64-2} Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Seyf rivayet etti. (Dediki): Mücâhidi şöyle derken işittim. Ben İbni Ömer'i: Resulullah (Sallallahu Aleyhi ve Sellem)'e hurma özü getirildi... derken dinledim. Ve râvî yukarkilerin hadîsi gibi anlatmıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 7102,
      "arabicNumber": "2811.05",
      "book": 52,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَخْبِرُونِي بِشَجَرَةٍ شِبْهِ أَوْ كَالرَّجُلِ الْمُسْلِمِ لاَ يَتَحَاتُّ وَرَقُهَا ‏\"‏ ‏.‏ قَالَ إِبْرَاهِيمُ لَعَلَّ مُسْلِمًا قَالَ وَتُؤْتِي أُكُلَهَا ‏.‏ وَكَذَا وَجَدْتُ عِنْدَ غَيْرِي أَيْضًا وَلاَ تُؤْتِي أُكُلَهَا كُلَّ حِينٍ ‏.‏ قَالَ ابْنُ عُمَرَ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ لاَ يَتَكَلَّمَانِ فَكَرِهْتُ أَنْ أَتَكَلَّمَ أَوْ أَقُولَ شَيْئًا فَقَالَ عُمَرُ لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَىَّ مِنْ كَذَا وَكَذَا ‏.‏",
        "translations": {
          "en": "Ibn Umar reported:We were'in the company of Allah's Messenger (ﷺ) that he said: Tell me of a tree which has resemblance to a Muslim and the leaves of which do not wither. Ibrahim said that perhaps Imam Muslim had stated like this: It constantly bears fruit but I have, however, seen [It does not bear fruit constantly]. Ibn Umar said: It crossed my mind that it could be the date-palm tree, but as I saw Aba Bakr and Umar observe silence, I did not deem it fit that I should speak or I should say something. 'Umar said: Had you said so, it would have been dearer to me than such and such thing",
          "ur": "نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے ، آپ نے فرمایا : \"\" مجھے اس درخت کے متعلق بتاؤ جو ایک مسلمان آدمی سے مشابہ یا ( فرمایا : ) کی طرح ہے ، اس کے پتے نہیں جھڑتے ۔ \"\" ( امام مسلم رحمۃ اللہ علیہ کےشاگرد ) ابراہیم ( بن سفیان ) نے کہا : غالباً ( ہمارے شیخ ) امام مسلم نے \"\" اور وہ ( درخت ) اپنا پھل دیتاہے \"\" کہا ہوگا ( لیکن میرے پاس \"\" نہیں دیتا \"\" لکھا ہے ) اور میں نے اپنے دوسرے ساتھیوں کے ہاں بھی ( ان کے نسخوں میں ) یہی پایا ہے : اور وہ ہر وقت اپنا پھل نہیں دیتا ۔ حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : تو میرے دل میں آیا کہ وہ کھجور کا درخت ہے ۔ مگر میں نے حضرت ابو بکر وعمر رضی اللہ تعالیٰ عنہ کو دیکھاکہ وہ نہیں بول رہے تھے تو میں نے یہ بات ناپسندی کہ میں بولوں اور کچھ کہوں ، چنانچہ ( میری بات سن کر حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : اگر تم یہ بات کہہ دیتے تو مجھے یہ فلاں فلاں ( سرخ اونٹوں ) سے زیادہ پسندہوتا ۔",
          "fr": "Rapporté par Ibn Umar رضي الله عنه : Nous étions en compagnie du Messager d’Allah ﷺ lorsqu’il dit : « Dites-moi quel arbre ressemble au musulman, dont les feuilles ne tombent jamais. » Ibrahim a dit que peut-être l’imam Muslim a précisé : « Il donne constamment des fruits », mais j’ai vu (qu’il ne donne pas toujours des fruits). Ibn Umar dit : « J’ai pensé que c’était le palmier-dattier, mais voyant Abu Bakr et Omar se taire, je n’ai pas osé parler. » Omar dit : « Si tu l’avais dit, cela m’aurait été plus cher que telle ou telle chose. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] berkata: Kami berada di dekat Rasulullah Shallallahu 'alaihi wa Salam lalu beliau bertanya: \"Beritahukan padaku suatu pohon yang mirip orang muslim, daunnya tidak berguguran!\" Ibrahim berkata: Mungkin beliau menyebut: Muslim, beliau bersabda: \"Selalu berbuah\" -seperti ini yang aku temukan dalam riwayat yang lain: \"Dan ia tidak berbuah setiap waktu.\" Ibnu Umar berkata: Hatiku mengatakan bahwa pohon itu adalah pohon kurma. Aku melihat Abu Bakar dan Umar tidak berbicara sehingga aku tidak mau berbicara atau mengatakan apa pun. Umar berkata: Andai kau mengatakannya, itu lebih aku sukai dari ini dan ini",
          "tr": "{m-64-3} Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. (Dediki): Bize Ubeydullah b. Ömer, Nâfi'den, o da İbni Ömer'den naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında idik: «Bana müsiüman bir adamın benzeri yahut müslöman bir adam gibi bir ağaç haber verin, o ağacın yaprakları dökülmez.» buyurdular. İbrahim demiş ki: Umulur ki Müslim, meyve verir de, dedi. Başkasının nüshasında da : Her zaman meyve vermez, şeklinde buldum. îbni Ömer demiş ki: Bu ağacın hurma olduğu içimden geçti ama Ebû Bekr'le Ömer'in konuşmadıklarını gördüm. Ben de konuşmaktan yahut bir şey söylemekten çekindim. Müteakiben Ömer: Onu söylemiş olsaydın, benim için filân ve filân şeyden daha makbul olurdu, dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 7103,
      "arabicNumber": "2812.01",
      "book": 52,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ فِي جَزِيرَةِ الْعَرَبِ وَلَكِنْ فِي التَّحْرِيشِ بَيْنَهُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported:I heard Allah's Apostle (ﷺ) as saying: Verily, the Satan has lost all hopes that the worshippers would ever worship (him) in the peninsula of Arabia, but he (is hopeful) that he would sow the seed of dissension amongst them",
          "ur": "جریر نےاعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا میں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" شیطان اس بات سے ناامید ہوگیا ہے کہ جزیر ہ عرب میں نماز پڑھنے والے اس کی عبادت کریں گے لیکن وہ ان کے درمیان لڑائی جھگڑے کرانے سے ( مایوس نہیں ہوا ۔)",
          "fr": "Rapporté par Jabir : J’ai entendu le Messager d’Allah ﷺ dire : « En vérité, Satan a perdu tout espoir d’être adoré par les adorateurs dans la péninsule arabique, mais il espère semer la discorde entre eux. »",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim], berkata [Ishaq]: Telah mengkhabarkan kepada kami sedangkan [Utmsan] berkata: Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] berkata: Aku mendengar nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya setan telah putus asa untuk disembah orang-orang yang shalat dijazirah arab, tapi ia mengadu domba diantara mereka.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki']. Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Mu'awiyah], keduanya dari [Al A'masy] dengan sanad ini",
          "tr": "Bize Osman b. Ebî Şeybe ile İshak b. İbrahim rivayet ettiler. (îshak bize haber verdi; Osman ise bize rivayet etti tâbirlerini kullandılar. Osman dediki): Bize Cerir, A'meş'den, o da Ebû Süfyan'dan, o da Câbir'den naklen rivayet etti. (Şöyle demiş): Ben Nebi (Sallallahu Aleyhi ve Sellem)'i: «Şeytan Arab yarımadasında namaz kılanların kendisine ibâdet etmesinden ümidini kesmiştir. Lâkin aralarında aldatma hususunda (çalışmaktadır).» buyururken İşittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 7104,
      "arabicNumber": "2812.02",
      "book": 52,
      "hadithInBook": 58,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters",
          "ur": "وکیع اور ابو معاویہ دونوں نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ۔",
          "fr": "Rapporté par A'mash : Ce hadith a été rapporté par la même chaîne de transmetteurs",
          "tr": "{m-65} Bize bu hadîsi Ebû Bekr b. Ebî Şeybe de rivayet etti. (Dediki): Bize Veki' rivayet etti. H. Bize Ebû Kureyb dahi rivayet etti. (Dediki): Bize Ebû Muaviye rivayet etti. Her iki râvi A'meş'den bu isnadla rivayet etmişlerdir. İZAH 2815 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 7105,
      "arabicNumber": "2813.01",
      "book": 52,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ فَيَبْعَثُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ عِنْدَهُ أَعْظَمُهُمْ فِتْنَةً ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported:I heard Allah's Messenger (way peace be upon him) as saying: The throne of Iblis is upon the ocean and he sends detachments (to different parts) inorder to put people to trial and the most important figure in his eyes is one who is most notorious in sowing the seed of dissension",
          "ur": "جریر اعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" ابلیس کا تخت سمندرپر ہے ۔ وہ اپنے لشکر روانہ کرتا رہتا ہے تاکہ وہ فتنے برپا کریں ۔ اس کے نزدیک ( شیطنت کے ) درجے میں سب سے بڑا وہ ہے جو زیادہ بڑا فتنہ برپا کرے ۔",
          "fr": "Rapporté par Jabir : J’ai entendu le Messager d’Allah ﷺ dire : « Le trône d’Iblis est sur l’océan et il envoie des groupes (dans différentes régions) pour mettre les gens à l’épreuve. Celui qui a le plus d’importance à ses yeux est celui qui est le plus connu pour semer la discorde. »",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim], berkata [Ishaq]: Telah mengkhabarkan kepada kami, sedangkan [Utsman] berkata: Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] berkata: Aku mendengar nabi Shallallahu 'alaihi wa Salam bersabda: Sesungguhnya singgasana Iblis berada di atas laut, ia mengirim bala tentaranya kemudian mereka menggoda manusia. Yang paling agung bagi iblis adalah (setan) yang paling besar godaannya",
          "tr": "Bize Osman b. Ebî Şeybe ile tshak b. İbrahim rivayet ettiler. (İshak: Ahberana; Osman ise: Haddesena tâbirlerini kullandılar. Osman dediki): Bize Cerir, A'meş'den, o da Ebû Süfyan'dan, o da Câbir'den naklen rivayet etti. Câbir şöyle demiş: Ben Nebi (Sallallahu Aleyhi ve Sellem)'i: «Şüphesiz iblisin tahtı denizin üzerindedir. Çetelerini gönderir de insanlara fitne verirler. Ona göre bunların en büyüğü, en büyük fitne verendir.» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 7106,
      "arabicNumber": "2813.02",
      "book": 52,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ إِبْلِيسَ يَضَعُ عَرْشَهُ عَلَى الْمَاءِ ثُمَّ يَبْعَثُ سَرَايَاهُ فَأَدْنَاهُمْ مِنْهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً يَجِيءُ أَحَدُهُمْ فَيَقُولُ فَعَلْتُ كَذَا وَكَذَا فَيَقُولُ مَا صَنَعْتَ شَيْئًا قَالَ ثُمَّ يَجِيءُ أَحَدُهُمْ فَيَقُولُ مَا تَرَكْتُهُ حَتَّى فَرَّقْتُ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ - قَالَ - فَيُدْنِيهِ مِنْهُ وَيَقُولُ نِعْمَ أَنْتَ ‏\"‏ ‏.‏ قَالَ الأَعْمَشُ أُرَاهُ قَالَ ‏\"‏ فَيَلْتَزِمُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported that Allah's Messenger (ﷺ) said:Iblis places his throne upon water; he then sends detachments (for creating dissension) ; the nearer to him in rank are those who are most notorious in creating dissension. One of them comes and says: \"I did so and so.\" And he says: \"You have done nothing.\" Then one amongst them comes and says: \"I did not spare so and so until I sowed the seed of discord between a husband and a wife.\" The Satan goes near him and says: \"You have done well.\" A'mash said: He then embraces him",
          "ur": "ابو معاویہ نے کہا : ہمیں اعمش نے ابو سفیان سے حدیث بیان کی ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ابلیس اپنا تخت پانی پر بچھاتا ہے پھر وہ اپنے لشکر روانہ کرتا ہے اس کے سب سے زیادہ قریب وہ ہوتا ہے جو سب سے بڑا فتنہ ڈالتا ہے ان میں سے ایک آکر کہتا ہے میں نے فلاں فلاں کا م کیا ہے ، وہ کہتا ہے ۔ تم نے کچھ نہیں کیا ، پھر ان میں سے ایک آکر کہتا ہے : میں نے اس شخص کو ( جس کے ساتھ میں تھا ) اس وقت تک نہیں چھوڑا ، یہاں تک کہ اس کے اور اس کی بیوی کے درمیان تفریق کرادی کہا : کہا : وہ اس کو اپنے قریب کرتا ہے اور کہتا ہے تم سب سے بہتر ہو ۔ \"\" اعمش نے کہا میراخیال ہے اس ( ابو سفیان طلحہ بن نافع ) نے کہا : \"\" پھر وہ اسے اپنے ساتھ لگالیتا ہے ۔",
          "fr": "Rapporté par Jabir : Le Messager d’Allah ﷺ a dit : « Iblis place son trône sur l’eau, puis il envoie des groupes pour semer la discorde. Ceux qui sont les plus proches de lui en rang sont ceux qui sont les plus connus pour créer des divisions. L’un d’eux vient et dit : “J’ai fait ceci et cela.” Et il lui répond : “Tu n’as rien fait.” Puis l’un d’eux vient et dit : “Je n’ai pas laissé untel jusqu’à ce que je sème la discorde entre un mari et sa femme.” Alors Satan s’approche de lui et dit : “Tu as bien fait.” A'mash a dit : Il l’embrasse alors",
          "id": "Telah menceritakan kepada kami [Abu Kuraib, Muhammad bin Al Ala`] dan [Ishaq bin Ibrahim], teks milik Abu Kuraib, keduanya berkata: Telah mengkhabarkan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya Iblis meletakkan singgasananya di atas air lalu mengirim bala tentaranya, (setan) yang kedudukannya paling rendah bagi Iblis adalah yang paling besar godaannya. Salah satu diantara mereka datang lalu berkata: 'Aku telah melakukan ini dan itu.' Iblis menjawab: 'Kau tidak melakukan apa pun.' Lalu yang lain datang dan berkata: 'Aku tidak meninggalkannya hingga aku memisahkannya dengan istrinya.' Beliau bersabda: \"Iblis mendekatinya lalu berkata: 'Bagus kamu.\" Al A'masy menyebutkan dalam riwayatnya: \"Iblis berkata: 'Tetaplah (menggodanya)",
          "tr": "Bize Ebû Kureyb Muhammed b. Ala ile İshak b. İbrahim rivayet ettiler, Lafız Ebû Kureyb'indir. (Dedilerki): Bize Ebû Muâviye haber verdi. (Dediki): Bize A'meş, Ebû Süfyan'dan, o da Câbir'den naklen rivayet etti. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem): «Gerçekten iblis tahtını suyun üzerine koyar. Sonra çetelerini gönderir. Bunların ona derece itibariyle en yakın olanı, en büyük fitne çıkaranıdır. Bunlardan biri gelerek: Şöyle şöyle yaptım, der. O da: Hiç bir şey yapmamışsın, der. Sonra biri gelerek onu karısıyla birbirinden ayırmadan bırakmadım, der. Bunu kendisine yaklaştırır ve: Sen ne iyisin, der.» buyurdular, A'meş demiş ki: «Zannederim onu iltizam eder, dedi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 7107,
      "arabicNumber": "2813.03",
      "book": 52,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَبْعَثُ الشَّيْطَانُ سَرَايَاهُ فَيَفْتِنُونَ النَّاسَ فَأَعْظَمُهُمْ عِنْدَهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported that Allah's Apostle (may peace be upqn him) said:The Satan sends detachments of his own in order to put people to trial and the highest in rank, in his eyes, is one who is most notorious in sowing the seed of dissension",
          "ur": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" شیطان اپنے لشکروں کو بھیجتا ہے اور وہ لوگوں کو فتنوں میں ڈالتے ہیں اس کے نزدیک ان میں سے بڑے مرتبے والا وہ ہو تا ہے جو زیادہ بڑا فتنہ ڈالتا ہے ۔",
          "fr": "Rapporté par Jabir : Le Messager d’Allah ﷺ a dit : « Satan envoie ses groupes pour mettre les gens à l’épreuve, et le plus haut en rang à ses yeux est celui qui est le plus connu pour semer la discorde. »",
          "id": "Telah menceritakan kepadaku [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'yan] telah menceritakan kepada kami [Ma'qil] dari [Abu Az Zubair] dari [Jabir] ia mendengar nabi Shallallahu 'alaihi wa Salam bersabda: \"Setan mengutus bala tentaranya lalu mereka menggoda manusia. Yang paling agung bagi iblis adalah (setan) yang paling besar godaannya",
          "tr": "Bana Seleme b. Şebîb rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, Ebû'z-Zübeyr'den, o da Câbir'den naklen rivayet etti. Câbir, Nebi (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işitmiş : «Şeytan çetelerini gönderir de insanlara fitne verirler. Onun indinde derece itibariyle bunların en büyüğü, en büyük fitne çıkaranıdır.» İZAH 2815 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 7108,
      "arabicNumber": "2814.01",
      "book": 52,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنَ الْجِنِّ ‏\"‏ ‏.‏ قَالُوا وَإِيَّاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَإِيَّاىَ إِلاَّ أَنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ فَلاَ يَأْمُرُنِي إِلاَّ بِخَيْرٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Mas'ud reported that Allah's Messenger (ﷺ) said:There is none amongst you with whom is not an attache from amongst the jinn (devil). They (the Companions) said: Allah's Messenger, with you too? Thereupon he said: Yes, but Allah helps me against him and so I am safe from his hand and he does not command me but for good",
          "ur": "عثمان بن ابی شیبہ اور اسحٰق بن ابراہیم نے کہا : ہمیں جریر نے منصور سے حدیث بیان کی ، انھوں نے سالم بن ابی جعد سے ، انھوں نےاپنے والد سے اور انھوں نےحضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کو ئی شخص بھی نہیں مگر اللہ نے اس کے ساتھ جنوں میں سے اس کا ایک ساتھی مقرر کردیا ہے ( جو اسے برائی کی طرف مائل رہتا ہے ۔ ) \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ کے ساتھ بھی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اور میرے ساتھ بھی لیکن اللہ تعالیٰ نے اس کے مقابلے میں میری مدد فرمائی ہے اور وہ مسلمان ہوگیا ، اس لیے ( اب ) وہ مجھے خیر کے سواکوئی بات نہیں کہتا ۔",
          "fr": "Rapporté par Abdullah ibn Mas'ud : Le Messager d’Allah ﷺ a dit : « Il n’y a aucun d’entre vous sans qu’un compagnon parmi les djinns (le diable) ne soit avec lui. » Les Compagnons dirent : « Ô Messager d’Allah, même avec toi ? » Il répondit : « Oui, mais Allah m’aide contre lui et je suis en sécurité contre ses ruses, et il ne me commande que le bien. »",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim], berkata [Ishaq]: Telah mengkhabarkan kepada kami, sedangkan [Utsman] berkata: Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [ayahnya] dari [Abdullah bin Mas'ud] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidaklah seorang pun dari kalian melainkan dikuasai pendamping dari kalangan jin.\" Mereka bertanya: Tuan juga, wahai Rasulullah? beliau menjawab: \"Aku juga, hanya saja Allah membantuku mengalahkannya lalu ia masuk Islam, ia hanya memerintahkan kebaikan padaku.\" Telah menceritakan kepada kami [Ibnu Abi Al Mutsanna] dan [Ibnu Basyar] keduanya berkata: Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan]. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Adam] dari [Ammar bin Ruzaiq] keduanya dari [Manshur] dengan sanad jarir seperti haditsnya, hanya saja dalam hadits Sufyan disebutkan: \"Melainkan dikuasai pendamping dari kalangan jin dan dari kalangan malaikat",
          "tr": "Bize Osman b. Ebî Şeybe ile İshak b. İbrahim rivayet ettiler. (İshak: Ahberana; Osman ise: Haddesena tâbirlerini kullandılar. Dedilerki): Bize Cerir, Mansûr'dan, o da Sâlim b. Ebi'I-Ca'd'dan, o da babasından, o da Abdullah b. Mes'ud'dan naklen rivayet etti. (İbn-i Mes’ud şöyle demiştir:) Resulullah (Sallallahu Aleyhi ve Sellem): «Siz’den hiç bir kimse yoktur ki: Kendisine cinlerden bir arkadaşı vekil kılınmamış olsun !» buyurdu. Ashab : — Yâ sana yâ Resûlallah? dediler. «Bana da: Şu kadar var ki, Allah onun hakkında bana yardım etti de o müslümnn oldu. Artık bana hayırdan başka bir şey emretmiyor.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 7109,
      "arabicNumber": "2814.02",
      "book": 52,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِيَانِ ابْنَ مَهْدِيٍّ - عَنْ سُفْيَانَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، كِلاَهُمَا عَنْ مَنْصُورٍ، بِإِسْنَادِ جَرِيرٍ ‏.‏ مِثْلَ حَدِيثِهِ غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ ‏ \"‏ وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنَ الْجِنِّ وَقَرِينُهُ مِنَ الْمَلاَئِكَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Mansiir with the same chain of transmitters but with a slight variation of wording",
          "ur": "سفیان اور عمار بن رزیق دونوں نے منصور سے جریر کی سند کے ساتھ انھی کی حدیث کے مانند روایت کی ، مگر سفیان کی حدیث میں ہے : \" ہر شخص کے لیے ایک ساتھی جنوں میں سے اور ایک ساتھی فرشتوں میں سے مقرر کر دیاہے ۔ ( جن اسے برائی کی طرف مائل کرتا ہے اور فرشتہ نیکی کی طرف ۔ فیصلہ خود اسی کو کرنا ہوتا ہے ۔)",
          "fr": "Rapporté par Mansur : Ce hadith a été rapporté par Mansur avec la même chaîne de transmetteurs, mais avec une légère différence dans les mots",
          "tr": "{m-69} Bize İbni Müsenna ile İbni Beşşâr rivayet ettiler. (Dedilerki): Bize Abdurrahman (yâni; İbni Mehdi) Süfyan'dan rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Yahyâ b. Âdem, Ammâr b. Ruzeyk'dan rivayet etti. Her iki râvî Mansur'dan, Cerir'in isnadıyle onun hadîsi gibi rivayet etmişlerdir. Şu kadar var ki, Süfyan'ın hadîsinde : «Kendisine cinlerden bir arkadaşı, meleklerden de bir arkadaşı vekil kılınmıştır.» ibaresi vardır. İZAH 2815 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 7110,
      "arabicNumber": "2815",
      "book": 52,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنِ ابْنِ، قُسَيْطٍ حَدَّثَهُ أَنَّ عُرْوَةَ حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ مِنْ عِنْدِهَا لَيْلاً ‏.‏ قَالَتْ فَغِرْتُ عَلَيْهِ فَجَاءَ فَرَأَى مَا أَصْنَعُ فَقَالَ ‏\"‏ مَا لَكِ يَا عَائِشَةُ أَغِرْتِ ‏\"‏ ‏.‏ فَقُلْتُ وَمَا لِي لاَ يَغَارُ مِثْلِي عَلَى مِثْلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَقَدْ جَاءَكِ شَيْطَانُكِ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ أَوَمَعِيَ شَيْطَانٌ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قُلْتُ وَمَعَ كُلِّ إِنْسَانٍ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قُلْتُ وَمَعَكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ وَلَكِنْ رَبِّي أَعَانَنِي عَلَيْهِ حَتَّى أَسْلَمَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha the wife of Allah's Apostle (ﷺ), reported that one day Allah's Messenger (ﷺ) came out of her (apartment) during the night and she felt jealous. Then he came and he saw me (in what agitated state of mind) I was. He said:A'isha, what has happened to you? Do you feel jealous? Thereupon she said: How can it be (that a woman like me) should not feel jealous in regard to a husband like you. Thereupon Allah's Messenger (ﷺ) said: It was your devil who had come to you, and she said: Allah's Messenger, is there along with me a devil? He said: Yes. I said: Is a devil attached to everyone? He said: Yes. I (Aisha) again said: Allah's Messenger, is it with you also? He said: Yes, but my Lord has helped me against him and as such I am absolutely safe from his mischief",
          "ur": "عروہ نے کہا : نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم ایک رات ان کے پاس سے اٹھ کر باہر نکل گئے ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : مجھے آپ کے معاملے میں شدید غیرت محسوس ہوئی ، پھر آپ واپس آئے اور دیکھا کہ میں کیا کر رہی ہوں ( شدید غصے کے عالم میں ہوں ) تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" عائشہ رضی اللہ تعالیٰ عنہا !تمھیں کیاہوا ہے کیا تم غیرت میں مبتلا ہو گئی ہو؟ \" میں نے کہا : مجھے کیا ہوا ہے کہ مجھ جیسی عورت کو ( جس کی کئی سو کنیں ہوں ) آپ جیسے مرد پر ( جو ایک کو ایک سے بڑھ کر محبوب ہو ) غیرت نہ آئے \" تورسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تمھارے پاس تمھارا شیطان آیا تھا ( اور اس نے تمھیں شک میں مبتلا کیا؟ ) \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہ نے ) کہا : اللہ کے رسول صلی اللہ علیہ وسلم !کیا میرے ساتھ شیطان بھی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ۔ \" میں نے کہا : ہر انسان کے ساتھ شیطان ہوتا ہے؟ آپ نے فرمایا : \" ہاں ۔ \" میں نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کے ساتھ بھی ہے؟آپ نے فرمایا : \" ہاں لیکن میرے رب نے اس پر ( قابو پانے میں ) میری مددفرمائی اور وہ اسلام لے آیا ہے ۔",
          "fr": "Rapporté par Aïsha (l’épouse du Messager d’Allah ﷺ) رضي الله عنها : Un jour, le Messager d’Allah ﷺ est sorti de chez elle pendant la nuit et elle a ressenti de la jalousie. Puis il est revenu et a vu dans quel état elle était. Il a dit : « Aïsha, qu’est-ce qui t’arrive ? Es-tu jalouse ? » Elle a répondu : « Comment une femme comme moi ne serait-elle pas jalouse d’un mari comme toi ? » Le Messager d’Allah ﷺ a alors dit : « C’est ton diable qui est venu vers toi. » Elle a demandé : « Ô Messager d’Allah, ai-je un diable avec moi ? » Il a répondu : « Oui. » Elle a dit : « Est-ce que chacun a un diable attaché à lui ? » Il a répondu : « Oui. » (Aïsha) a encore demandé : « Ô Messager d’Allah, même toi ? » Il a dit : « Oui, mais mon Seigneur m’a aidé contre lui et je suis totalement protégé de ses ruses. »",
          "id": "Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahab] telah mengkhabarkan kepadaku [Abu Shakr] dari [Ibnu Qusaith] telah menceritakan kepadanya bahwa [Urwah] telah menceritakan kepadanya bahwa [Aisyah], istri nabi Shallallahu 'alaihi wa Salam, telah menceritakan kepadanya bahwa Rasulullah Shallallahu 'alaihi wa Salam keluar dari kediamannya pada suatu malam. Aisyah berkata: Aku merasa cemburu pada beliau lalu beliau datang dan aku melihat yang beliau lalukan. Beliau bertanya: \"Kau kenapa, wahai Aisyah?\" aku menjawab: Orang sepertiku mengapa tidak menyemburui orang seperti Tuan? Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Apa setanmu mendatangimu?\" Aisyah bertanya: Waha Rasulullah, apakah ada setan menyertaiku? Beliau menjawab: \"Ya.\" Aisyah bertanya: Juga menyertai semua manusia? Beliau menjawab: \"Ya.\" Ia bertanya: Menyertai Tuan juga? Beliau menjawab: \"Ya, hanya saja Rabbku menolongku mengalahkannya hingga ia masuk Islam",
          "tr": "Bana Harun b. Saîd EI-Eylî rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Ebû Sahr, İbni Kuseyt'dan naklen haber verdi. Ona da Urve, ona da Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe rivayet etmişki: (Aişe r.anha şöyle demiştir:) Resulullah (Salîallahu Aleyhi ve Sellem) geceleyin Âişe'nin yanından çıkmış. Âişe demiş ki: Ben onu kıskandim. Az sonra gelerek benim ne yaptığımı gördü. Ve: «Sana ne oldu ya Âişe! Kıskandın mı?» diye sordu. — Bana ne olacak, benim gibisi, senin gibi bir zâtı kıskanmaz dedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem)'. «Sana şeytan’ın mı geldi?» dedi. Ben: — Yâ Resûlallah! Benimle beraber şeytan mı var? dîye sordun «Evet!» dedi. — Yâ her insanla birlikte? dedim. «Evet!» cevâbını verdi. — Seninle de mi yâ Resûlallah? dedim. «Evet! Lâkin Rabbîm onun hakkında bana yardım etti, tâ ki müsluman oldu.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 7113,
      "arabicNumber": "2816.03",
      "book": 52,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ أَحَدٍ يُدْخِلُهُ عَمَلُهُ الْجَنَّةَ ‏\"‏ ‏.‏ فَقِيلَ وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي رَبِّي بِرَحْمَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There is none whose deeds alone would entitle him to get into Paradise. It was said to him: And, Allah's Messenger, not even you? Thereupon he said: Not even I, but that my Lord wraps me in Mercy",
          "ur": "ایوب نے محمد ( بن سیرین ) اسے اور انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ۔ کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کو اس کا عمل جنت میں نہیں لے جائے گا ۔ \" پوچھا گیا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ کو بھی نہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ میرا رب مجھے اپنی رحمت میں چھپالے ۔",
          "fr": "Rapporté par Abou Hourayra رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Personne ne pourra entrer au Paradis uniquement grâce à ses actions. » On lui a demandé : « Même toi, ô Messager d’Allah ? » Il a répondu : « Même moi, sauf si mon Seigneur m’enveloppe de Sa miséricorde. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayub] dari [Muhammad] dari [Abu Hurairah] Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidak ada seorang pun yang dimasukkan surga oleh amalnya.\" Dikatakan: Tidak juga Tuan, wahai Rasulullah? beliau menjawab: \"Tidak juga aku, kecuali bila Rabbmu melimpahkan rahmat padaku",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Hammad (yâni; İbni Zeyd) Eyyûb'dan, o da Muhammed'den, o da Ebû Hureyre'­den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. (Şöyle buyurmuşlar) : «Hiç bir kimseyi ameli cennet'e koymaz.» Bunun üzerine: — Seni de mi yâ Resûlallah? denilmiş. «Beni de! Meğer ki, Rabbim beni rahmetiyle örte.» buyurmuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 7114,
      "arabicNumber": "2816.04",
      "book": 52,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي، هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَيْسَ أَحَدٌ مِنْكُمْ يُنْجِيهِ عَمَلُهُ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ ‏\"‏ ‏.‏ وَقَالَ ابْنُ عَوْنٍ بِيَدِهِ هَكَذَا وَأَشَارَ عَلَى رَأْسِهِ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِمَغْفِرَةٍ وَرَحْمَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There is none amongst you whose deeds alone would attain salvation for him. They (the Companions) said: Allah's Messenger, not even you? He (the Holy Prophet) said: Not even I, but that Allah wraps me in Mercy and He grants me pardon. Ibn 'Aun pointed towards his head with his hand saying: Not even I, but that Allah wraps me in His Forgiveness and Mercy",
          "ur": "ابن عون نے محمد ( بن سیرین ) سے اور انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کو اس کا عمل نجات نہیں دلائے گا ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنی رحمت اور مغفرت میں چھپالے ۔ \" اور ابن عون نے اس طرح اپنے ہاتھ سے بتایا اور اپنے سرکی طرف ( رحمت سے ڈھانپ لینےکا ) اشارہ کیا ( فرمایا ) \" اور مجھے بھی نہیں مگر یہ کہ اللہ مجھے ( اس طرح ) اپنی رحمت اور مغفرت سے ڈھانپ لے ۔",
          "fr": "Rapporté par Abou Hourayra رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Aucun d’entre vous ne sera sauvé uniquement grâce à ses actions. » Les Compagnons ont demandé : « Ô Messager d’Allah, même toi ? » Il a répondu : « Même moi, sauf si Allah m’enveloppe de Sa miséricorde et me pardonne. » Ibn ‘Aoun a montré sa tête de la main en disant : « Même moi, sauf si Allah m’enveloppe de Son pardon et de Sa miséricorde. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abi Adi] dari [Ibnu Aun] dari [Muhammad] dari [Abu Hurairah] berkata: Nabi Shallallahu 'alaihi wa Salam bersabda: \"Tidaklah seorang pun dari kalian yang diselamatkan oleh amalnya.\" Seseorang bertanya: Tuan juga, wahai Rasulullah? beliau menjawab: \"Tidak juga aku, kecuali bila Allah melimpahkan ampunan dan rahmat padaku.\" Ibnu Aun menunjukkan tangan ke kepalanya dan berkata: Tidak juga aku, kecuali bila Allah melimpahkan ampunan dan rahmat padaku",
          "tr": "Bize Muhammed b. Müsennâ rivayet etti. (Dediki): Bize İbni Ebî Adiy, İbni Avn'dan, o da Muhammed'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Nebi (Sallallahu Aleyh: ve Sellem): «Sizden hiç bir kimse yoktur ki, kendisini ameli kurtarsın!» buyurdu. Ashab: — Seni de mi yâ Resûlallah? dediler. «(Evet!) Benî de! Meğer ki, Allah kendinden bir mağfiret ve rahmetle beni sarmış ola!» buyurdu. îbni Avn eliyle şöyle yapmış ve başına işaret ederek : Beni de! Meğer ki, Allah kendinden bir mağfiret ve rahmetle beni örtmüş ola!» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 67
      }
    },
    {
      "hadithNumber": 7115,
      "arabicNumber": "2816.05",
      "book": 52,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ أَحَدٌ يُنْجِيهِ عَمَلُهُ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَدَارَكَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There is none whose deeds alone can'secure salvation for him. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that, the Mercy of Allah should take hold of me",
          "ur": "سہیل کے والد ( ابو صالح ) نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی کو اس کا عمل نجات نہیں دلائے گا ۔ \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں ؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنی رحمت میں لے لے ۔",
          "fr": "Rapporté par Abou Hourayra رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Personne ne peut assurer son salut uniquement par ses actions. » Ils ont demandé : « Ô Messager d’Allah, même toi ? » Il a répondu : « Même moi, à moins que la miséricorde d’Allah ne me couvre. »",
          "id": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidaklah seorang pun dari kalian yang diselamatkan oleh amalnya.\" Seseorang bertanya: Tuan juga, wahai Rasulullah? beliau menjawab: \"Tidak juga aku, kecuali bila rahmat dariNya menjemputku",
          "tr": "Bana Züheyr h. Harb rivayet etti. (Dediki): Bize Cerir, Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aieyhi ve Sellem): «Hiç bîr kimseyi ameli kurtaracak değildir.» buyurdu. Ashab : — Seni de mi yâ Resûlallah! dediler. «(Evet!) Beni de! Meğer ki, Allah kendinden bîr rahmet ile imdadıma yetişe!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 68
      }
    },
    {
      "hadithNumber": 7116,
      "arabicNumber": "2816.06",
      "book": 52,
      "hadithInBook": 69,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا أَبُو عَبَّادٍ، يَحْيَى بْنُ عَبَّادٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَنْ يُدْخِلَ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِفَضْلٍ وَرَحْمَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:None amongst you can get. into Paradise by virtue of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Grace and Mercy",
          "ur": "حضرت عبدالرحمٰن بن عوف رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام ابو عبید نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کو اس کا عمل جنت میں نہیں لے جائے گا ۔ \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟ آپ نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنے فضل اور رحمت سے ڈھانپ لے ۔)",
          "fr": "Rapporté par Abou Hourayra رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Aucun d’entre vous n’entrera au Paradis uniquement grâce à ses actions. » Ils ont demandé : « Ô Messager d’Allah, même toi ? » Il a répondu : « Même moi, sauf si Allah m’enveloppe de Sa grâce et de Sa miséricorde. »",
          "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Abu Abbad Yahya bin Abbad] telah menceritakan kepada kami [Ibrahim bin Sa'ad] telah menceritakan kepada kami [Ibnu Syihab] dari [Abu 'Ubaid] budak Abdurrahman bin Auf, dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidak ada seorang pun yang dimasukkan surga oleh amalnya.\" Dikatakan: Tidak juga Tuan, wahai Rasulullah? beliau menjawab: \"Tidak juga aku, kecuali bila Rabbmu melimpahkan karunia dan rahmat padaku",
          "tr": "Bana Muhammed b. Hatim de rivayet etti. (Dediki): Bize Ebû Abbâd Yahya b. Abbâd rivayet etti. (Dediki): Bize İbrahim b. Sa'd rivayet etti. (Dediki): Bize İbni Şihab Abdurralunan b. Avf'ın azatlısı Ebû Ubeyd'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Sizden hiç birinizi ameli cennete koyacak değildir.» buyurdu. Ashab: — Seni de mi yâ Resûlallah! dediler, «(Evet!) Beni de! Meğer ki, Allah kendinden bir fadl-u rahmetle beni örte!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 7117,
      "arabicNumber": "2816.07",
      "book": 52,
      "hadithInBook": 70,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَارِبُوا وَسَدِّدُوا وَاعْلَمُوا أَنَّهُ لَنْ يَنْجُوَ أَحَدٌ مِنْكُمْ بِعَمَلِهِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلاَ أَنْتَ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ بِرَحْمَةٍ مِنْهُ وَفَضْلٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Observe moderation in deeds (and if it is not possible, try to be near moderation) and understand that none amongst you can attain salvation because of his deeds alone. They said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah should wrap me in His Mercy and Grace",
          "ur": "محمد بن عبد اللہ بن نمیر نے ہمیں حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں اعمش نے ابو صالح سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( عمل کے اعلیٰ ترین معیار کے ) قریب تر رہنے کی کوشش کرو ۔ صحیح راستہ اختیار کرو اور یقین رکھو کہ تم میں سے کسی شخص کو اس کا عمل نجات نہیں دے گا ۔ \" انھوں نے ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے بھی نہیں مگر یہ کہ اللہ تعالیٰ مجھے اپنی رحمت اور فضل سے ڈھانپ لے ۔",
          "fr": "Rapporté par Abou Hourayra رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Soyez modérés dans vos actions (et si vous n’y arrivez pas, essayez de vous en approcher), et sachez qu’aucun d’entre vous ne sera sauvé uniquement grâce à ses actions. » Ils ont demandé : « Ô Messager d’Allah, même toi ? » Il a répondu : « Même moi, sauf si Allah m’enveloppe de Sa miséricorde et de Sa grâce. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Mendekatlah, tujulah kebenaran dan ketahuilah bahwa sesungguhnya tidak seorang pun dari kalian yang selamat karena amalnya.\" Mereka bertanya: \"Tidak juga Tuan, wahai Rasulullah? beliau menjawab: \"Tidak juga aku, kecuali bila Rabbmu melimpahkan rahmat dan karunia padaku.\" Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari nabi Shallallahu 'alaihi wa Salam sepertinya. Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dengan kedua dua sanad secara keseluruhan seperti riwayat Ibnu Numar. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata: Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam sepertinya dan ia menambahi: \"Dan bergembiralah",
          "tr": "Bize Muhammed b. Abdillah b. Numeyr rivayet etti. (Dediki); Bize babam rivayet etti. (Dediki): Bize A'meş, Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Yaklaşın ve doğruyu arayın! Bilmiş olun ki, sîzden hiç bir kimse ameliyle kurtulacak değildir.» buyurdu. Ashab — Yâ Resûlallah! Sen de mi? dediler. «(Evetl) Ben de! Meğer ki, Allah kendinden bîr rahmet ve fad! ile beni örtmüş ola.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 70
      }
    },
    {
      "hadithNumber": 7118,
      "arabicNumber": "2817.01",
      "book": 52,
      "hadithInBook": 71,
      "text": {
        "arabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Jabir through another chain of transmitters",
          "ur": "ابن نمیر نے ہمیں حدیث بیان کی ، انھوں نے کہا : ہمیں میرے والد نے حدیث سنائی ، انھوں نے کہا : ہمیں اعمش نے ابو سفیان سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
          "fr": "Rapporté par Jabir رضي الله عنه : Ce hadith a été rapporté par Jabir à travers une autre chaîne de transmetteurs",
          "tr": "Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize A'meş, Ebû Süfyan'dan, o da Câbir'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 71
      }
    },
    {
      "hadithNumber": 7119,
      "arabicNumber": "2817.02",
      "book": 52,
      "hadithInBook": 72,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، بِالإِسْنَادَيْنِ جَمِيعًا كَرِوَايَةِ ابْنِ نُمَيْرٍ ‏.‏",
        "translations": {
          "en": "A hadith like this has been narrated on the authority of A'mash through two other chains of transmitters. The wording is, however, the same",
          "ur": "جریر نے اعمش سے گزشتہ دونوں سندوں کے ساتھ ابن نمیر کی روایت کی طرح بیان کیا ۔",
          "fr": "Rapporté par A’mash : Un hadith similaire a été rapporté par A’mash à travers deux autres chaînes de transmetteurs. Les mots sont cependant les mêmes",
          "tr": "{m-76} Bize İshak b. İbrahim rivayet etti, (Dediki): Bize Cerir, A'meş'den iki isnadla birden İbni Numeyr'in rivayeti gibi rivayette bulundu. İZAH 2818 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 72
      }
    },
    {
      "hadithNumber": 7120,
      "arabicNumber": "2816.08",
      "book": 52,
      "hadithInBook": 73,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَزَادَ ‏ \"‏ وَأَبْشِرُوا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters with this addition:\" Give them glad tidings",
          "ur": "ابو معاویہ نے اعمش سے انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی اور اس میں مزید کہا : \" اور خوش خبری لو ۔ \" ( کہ اس کی رحمت بہت وسیع ہے ، اچھے عمل قبول ہو جائیں گے ۔)",
          "fr": "Rapporté par Abou Hourayra رضي الله عنه : Ce hadith a été rapporté par une autre chaîne de transmetteurs avec ce rajout : « Annoncez-leur la bonne nouvelle. »",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Ebû Muaviye, A'meş'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etti. O: «Müjde size!» cümlesini de ziyâde etmiştir. İZAH 2818 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 73
      }
    },
    {
      "hadithNumber": 7121,
      "arabicNumber": "2817.03",
      "book": 52,
      "hadithInBook": 74,
      "text": {
        "arabic": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلاَ يُجِيرُهُ مِنَ النَّارِ وَلاَ أَنَا إِلاَّ بِرَحْمَةٍ مِنَ اللَّهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported:I heard Allah's Apostle (ﷺ) as saying: None of you would get into Paradise because of his good deeds alone, and he would not be rescued from Fire, not even I, but because of the Mercy of Allah",
          "ur": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نےنبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" تم میں سے کسی شخص کو اس کا عمل نہ جنت میں لے جائے گا ۔ نہ دوزخ سے محفوظ رکھے گا اور نہ مجھے سوائے اللہ کی طرف سے رحمت کے ( جو نجات کا سبب بنے گی ۔)",
          "fr": "Rapporté par Jabir رضي الله عنه : J’ai entendu le Messager d’Allah ﷺ dire : « Aucun d’entre vous n’entrera au Paradis grâce à ses bonnes actions seulement, et il ne sera pas sauvé du Feu, pas même moi, mais uniquement par la miséricorde d’Allah. »",
          "id": "Telah menceritakan kepada kami [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'yan] telah menceritakan kepada kami [Ma'qil] dari [Abu Az Zubair] dari [Jabir] berkata: Aku mendengar nabi Shallallahu 'alaihi wa Salam bersabda: \"Tidak seorang pun dari kalian yang dimasukkan surga oleh amalnya dan tidak juga diselamatkan dari neraka karenanya, tidak juga aku kecuali karena rahmat dari Allah",
          "tr": "Bana Seleme b. Şebîb rivayet elti. (Dediki); Bize Hasen b. A'yen rivayet etti, (Dediki): Bize Ma'kil Ebû'z-Zübeyr'den, o da Câbir'den naklen rivayet etti. Câbir şöyle demiş: Ben Nebi (Sallallahu Aleyhi ve Sellem): «Sizden hiç bir kimseyi ameli cennete koyamaz. Onu cehennemden de koruyamaz. Beni de (öyle)! Ancak Allah'dan bir rahmetle (olursa) o başka!» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 74
      }
    },
    {
      "hadithNumber": 7122,
      "arabicNumber": "2818.01",
      "book": 52,
      "hadithInBook": 75,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا مُوسَى بْنُ، عُقْبَةَ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى، بْنُ عُقْبَةَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، يُحَدِّثُ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا فَإِنَّهُ لَنْ يُدْخِلَ الْجَنَّةَ أَحَدًا عَمَلُهُ ‏\"‏ ‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِيَ اللَّهُ مِنْهُ بِرَحْمَةٍ وَاعْلَمُوا أَنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha, the wife of Allah's Apostle (ﷺ), reported that Allah's Messenger (ﷺ) used to say:Observe moderation (in doing deeds), and if you fail to observe it perfectly, try to do as much as you can do (to live up to this ideal of moderation) and be happy for none would be able to get into Paradise because of his deeds alone. They (the Companions of the Holy Prophet) said: Allah's Messenger, not even you? Thereupon he said: Not even I, but that Allah wraps me in His Mercy, and bear this in mind that the deed loved most by Allah is one which is done constantly even though it is small",
          "ur": "عبد العزیزبن محمد اور وہیب نے کہا : ہمیں موسیٰ بن عقبہ نے حدیث بیان کی انھوں نے کہا : میں نے ابو سلمہ بن عبد الرحمٰن بن عوف کو حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کرتے ہوئے سنا ، وہ کہا کرتی تھیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" صحیح عمل کرو ( اعلی ترین معیار کے ) قریب تر رہواور ( اللہ کی رحمت کی ) خوش خبری ( کی امید ) رکھو ۔ حقیقت یہی ہے کہ کسی کو اس کا عمل ہر گز جنت میں داخل نہیں کرے گا ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کو بھی نہیں؟فرمایا : \" مجھے بھی نہیں الایہ کہ اللہ مجھے اپنی رحمت سے ڈھانپ لے اور جان رکھو کہ اللہ کے نزدیک محبوب ترین عمل وہ ہے جو ہمیشہ کیا جائے چاہے کم ہو ۔",
          "fr": "Rapporté par Aïsha (l’épouse du Messager d’Allah ﷺ) رضي الله عنها : Le Messager d’Allah ﷺ disait : « Soyez modérés dans vos actions, et si vous n’y arrivez pas parfaitement, faites de votre mieux pour vous en approcher et soyez heureux, car personne ne pourra entrer au Paradis uniquement grâce à ses actions. » Les Compagnons ont demandé : « Ô Messager d’Allah, même toi ? » Il a répondu : « Même moi, sauf si Allah m’enveloppe de Sa miséricorde. » Et souvenez-vous que l’action la plus aimée d’Allah est celle qui est faite régulièrement, même si elle est petite",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Abdul Aziz bin Muhammad] telah mengkhabarkan kepada kami [Musa bin Uqbah]. Telah menceritakan kepadaku [Muhammad bin Hatim], teks hadits miliknya, telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Musa bin Uqbah] berkata: Aku mendengar [Abu Salamah bin Aburrahman bin Auf] menceritakan dari [Aisyah, istri nabi] Shallallahu 'alaihi wa Salam, ia berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tujulah (kebenaran), mendekatlah dan bergembiralah bahwa sesungguhnya tidak seorang pun dari kalian yang dimasukkan surga oleh amalnya.\" Mereka bertanya: \"Tidak juga Tuan, wahai Rasulullah? beliau menjawab: \"Tidak juga aku, kecuali bila Rabbmu melimpahkan rahmat dan karunia padaku. Dan ketahuilah bahwa amal yang paling sukai Allah adalah yang paling rutin meski sedikit.\" Telah menceritakannya kepada kami [Hasan Al Hulwani] telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'ad] telah menceritakan kepada kami [Abdul Aziz bin Al Muthallib] dari [Musa bin Uqbah] dengan sanad ini, mereka tidak menyebutkan: \"Dan bergembiralah",
          "tr": "Bize İshak b. İbrahim de rivayet etti. (Dediki): Bize Abdû'l-Aziz b. Muhammed haber verdi. (Dediki): Bize Musa b. Ukbe haber verdi. H. Bana Muhammed b. Hatim dahi rivayet etti. Lâfız onundur. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Vûheyb rivayet etti. (Dediki): Bize Musa b. Ukbe rivayet etti. (Dediki): Ebû Seleme b. Abdirrahman b. Avf'ı, Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'den rivayet ederken dinledim. Âişe şöyle diyormuş: Resulullah (Sallallahu Aleyhi ve Sellem): «Doğruyu arayın, yaklaşın ve müjde size! Çünkü hiç bir kimseyi ameli cennete koyacak değildir.» buyurdu Ashab: — Seni de mi yâ Resûlallah? dediler. «(Evet!) Beni de! Meğer ki, Allah kendinden bir rahmetle beni örtmüş ola iyi bilin kî, Allah'a en makbul amel az da olsa en devamlı yapılandır.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 75
      }
    },
    {
      "hadithNumber": 7123,
      "arabicNumber": "2818.02",
      "book": 52,
      "hadithInBook": 76,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، بْنُ الْمُطَّلِبِ عَنْ مُوسَى بْنِ عُقْبَةَ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ ‏ \"‏ وَأَبْشِرُوا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Musa b. `Uqba with the same chain of transmitters and he did not make a mention of:\"Be happy",
          "ur": "عبد العزیز بن مطلب نے ہمیں موسیٰ بن عقبہ سے اسی سند کے ساتھ حدیث بیان کی اور \" خوش خبری ( کی امید ) رکھو \" ذکر نہیں کیا ۔",
          "fr": "Rapporté par Moussa ibn ‘Uqba : Ce hadith a été rapporté avec la même chaîne de transmetteurs, mais il n’a pas mentionné : « Soyez heureux. »",
          "tr": "{m-78} Bize bu hadîsi Hasen EI-Hulvânî de rivayet etti. (Dediki): Bize Ya'kub b. İbrahim b. Sa'd rivayet etti. (Dediki): Bize Abdü'l-Aziz b. Muttalib, Musa b. Ukbe'den bu isnadla rivayet etti.'Ama «Müjdeleyin...» sözünü anmadı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 76
      }
    },
    {
      "hadithNumber": 7124,
      "arabicNumber": "2819.01",
      "book": 52,
      "hadithInBook": 77,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنِ الْمُغِيرَةِ بْنِ، شُعْبَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى حَتَّى انْتَفَخَتْ قَدَمَاهُ فَقِيلَ لَهُ أَتَكَلَّفُ هَذَا وَقَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ ‏ \"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Mughira b. Shu'ba reported that Allah's Apostle (ﷺ) worshipped so much that his feet were swollen. It was said to him:(Why do you undergo so much hardship despite the fact that) Allah has pardoned for you your earlier and later sins? Thereupon he said: May I not (prove myself) to be a grateful servant (of Allah)?",
          "ur": "ابو عوانہ نے زیاد بن علاقہ سے اور انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے اتنی ( اتنی لمبی ) نمازیں پڑھیں کہ آپ کے قدم مبارک سوج گئے ۔ آپ سے کہاگیا کہ آپ اس قدر تکلیف اٹھاتے ہیں؟حالانکہ اللہ تعالیٰ نے آپ کے اگلے اور پچھلےگناہوں کی مغفرت فرمادی ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کیا میں اللہ تعالیٰ کا شکرگزار بندہ نہ بنوں ؟",
          "fr": "Rapporté par Mougheira ibn Shu’ba رضي الله عنه : Le Messager d’Allah ﷺ adorait tellement qu’il en avait les pieds enflés. On lui a dit : « Pourquoi te donnes-tu autant de mal alors qu’Allah t’a déjà pardonné tes péchés passés et futurs ? » Il a répondu : « Ne devrais-je pas être un serviteur reconnaissant envers Allah ? »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu Awanah] dari [Ziyad bin Ilaqah] dari [Al Mughirah bin Syu'bah] nabi Shallallahu 'alaihi wa Salam shalat hingga kedua kaki beliau bengkak, dikatakan pada beliau: Apa Tuan memaksakan ini padahal Allah telah mengampuni dosa yang terlalu dan yang dikemudian. Beliau menyahut: \"Apakah aku tidak menjadi hamba yang bersyukur?",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki); Bize Ebû Avâne, Ziyâd b. ilâka'dan, o da Muğira b. Şu'be'den naklen rivayet etti kî, Nebi (Sallallahu Aleyhi ve Sellem) ayakları şişinceye kadar namaz kılmış. Kendisine: — Sen hâlâ bu külfete katlanıyor musun? Halbuki Allah senin gelmiş geçmiş bütün günahlarını atfetmiştir, denilmiş. Bunun üzerine: «Şükreden bir kul olmayayım mı?» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 77
      }
    },
    {
      "hadithNumber": 7125,
      "arabicNumber": "2819.02",
      "book": 52,
      "hadithInBook": 78,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم حَتَّى وَرِمَتْ قَدَمَاهُ قَالُوا قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ ‏.‏ قَالَ ‏ \"‏ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Mughira b. Shu'ba and the words are:Allah's Apostle (ﷺ) kept standing in prayer (for such long hours) that his feet were swollen. They (his Companions) said: Verily, Allah has pardoned for thee the earlier and the later of thine sins. Thereupon he said: Should I not prove myself to be a grateful servant (of Allah)?",
          "ur": "سفیان نے ہمیں زیاد بن علاقہ سے حدیث بیان کی ، انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا : نبی صلی اللہ علیہ وسلم نے اتنا ( اتنا لمبا ) قیام کیا کہ آپ کے قدم مبارک سوج گئے ۔ انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : اللہ تعالیٰ نے آپ کے اگلے پچھلےتمام گناہ معافکردیے ہیں ( پھر اس قدر مشقت کیوں؟ ) تو آپ نے فرمایا : \" کیا میں اللہ کا شکرگزار بندہ نہ بنوں؟",
          "fr": "Rapporté par Mougheira ibn Shu’ba رضي الله عنه : Le Messager d’Allah ﷺ restait debout en prière si longtemps que ses pieds en étaient enflés. Ses Compagnons lui ont dit : « En vérité, Allah t’a pardonné tes péchés passés et futurs. » Il a répondu : « Ne devrais-je pas être un serviteur reconnaissant envers Allah ? »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ibnu Numair] keduanya berkata: Telah menceritakan kepada kami [Sufyan] dari [Ziyad bin Ilaqah] ia mendengar [Al Mughirah bin Syu'bah] berkata: Nabi Shallallahu 'alaihi wa Salam shalat malam hingga kedua kaki beliau bengkak, mereka berkata: Allah telah mengampuni dosa Tuan yang telah berlalu dan yang dikemudian. Beliau bersabda: \"Apakah aku tidak menjadi hamba yang bersyukur?",
          "tr": "Bİze Ebû Bekr b. Ebî Şeybe ile İbni Numeyr rivayet ettiler. (Dedilerki): Bize Süfyan Ziyâd b. İlâka'dan rivayet e«i. O da Muğîra b. Şu'be'yi şöyle derken işitmiş: Nebi (Sallallahu Aleyhi ve Sellem) ayakları şişinceye kadar namaz kıldı. Ashab : — Allah senin gelmiş geçmiş bütün günahlarını atfetmiştir, dediler. O: «Şükreden bir kul olmayayım mı?» buyurdular. İZAH 2820 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 78
      }
    },
    {
      "hadithNumber": 7126,
      "arabicNumber": "2820",
      "book": 52,
      "hadithInBook": 79,
      "text": {
        "arabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى قَامَ حَتَّى تَفَطَّرَ رِجْلاَهُ قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ أَتَصْنَعُ هَذَا وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ فَقَالَ ‏ \"‏ يَا عَائِشَةُ أَفَلاَ أَكُونُ عَبْدًا شَكُورًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported that when Allah's Messenger (ﷺ) occupied himself in prayer, he observed such a (long) qiyam (posture of standing in prayer) that his feet were swollen. A'isha said:Allah's Messenger you do this (in spite of the fact) that your earlier and later sins have been pardoned for you? Thereupon, he said. A'isha should I not prove myself to be a thanksgiving servant (of Allah)?",
          "ur": "عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم جب نماز پڑھتے تو ( بہت لمبا ) قیام کرتے یہاں تک کہ آپ کے قدم مبارک سوج جاتے ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ ایسا کرتے ہیں ۔ حالانکہ آپ کے اگلےپچھلے تمام گناہوں کی مغفرت کی ( یقین دہانی کرائی ) جاچکی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اے عائشہ رضی اللہ تعالیٰ عنہا !کیا میں ( اللہ تعالیٰ کا ) شکرگزار بندہ نہ بنوں؟",
          "fr": "Rapporté par Aïsha رضي الله عنها : Quand le Messager d’Allah ﷺ priait, il restait debout si longtemps que ses pieds en étaient enflés. Aïsha lui a dit : « Ô Messager d’Allah, tu fais cela alors qu’Allah t’a pardonné tes péchés passés et futurs ? » Il a répondu : « Aïsha, ne devrais-je pas être un serviteur reconnaissant envers Allah ? »",
          "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] dan [Harun bin Sa'id Al Aili] keduanya berkata: Telah menceritakan kepada kami [Ibnu Wahb] telah mengkhabarkan kepadaku [Abu Shakhr] dari [Ibnu Qusaith] dari [Urwah bin Az Zubair] dari [Aisyah] berkata: Bila shalat, Rasulullah Shallallahu 'alaihi wa Salam berdiri hingga kaki beliau bengkak. Aisyah berkata: Wahai Rasulullah, kenapa Tuan melakukan ini padahal Allah telah mengampuni dosa Tuan yang telah berlalu dan yang dikemudian. Beliau bersabda: \"Apakah aku tidak menjadi hamba yang bersyukur?",
          "tr": "Bize Harun b. Mâruf ile Harun b. Saîd EI-Eylî rivayet ettiler. (Dedilerki): Bire İbni Vehb rivayet etti. (Dediki): Bana Ebû Sahr, İbni Kuseyt'den, o da Urve b. Zübeyr'den, o da Âişe'den naklen haber verdi. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem) namaz kıldığı vakit ayakları patlayacak derecede ayakta dururdu, Aişe : — Ya Resûlallah! Allah senin gelmiş geçmiş bütün günahlarını sana bağışladığı halde yine bunu mu yapıyorsun? demiş. Bunun üzerine: «Ya Aişe! Şükreden bir kul olmayayım mı?» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 79
      }
    },
    {
      "hadithNumber": 7127,
      "arabicNumber": "2821.01",
      "book": 52,
      "hadithInBook": 80,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ كُنَّا جُلُوسًا عِنْدَ بَابِ عَبْدِ اللَّهِ نَنْتَظِرُهُ فَمَرَّ بِنَا يَزِيدُ بْنُ مُعَاوِيَةَ النَّخَعِيُّ فَقُلْنَا أَعْلِمْهُ بِمَكَانِنَا ‏.‏ فَدَخَلَ عَلَيْهِ فَلَمْ يَلْبَثْ أَنْ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ فَقَالَ إِنِّي أُخْبَرُ بِمَكَانِكُمْ فَمَا يَمْنَعُنِي أَنْ أَخْرُجَ إِلَيْكُمْ إِلاَّ كَرَاهِيَةُ أَنْ أُمِلَّكُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَا ‏.‏",
        "translations": {
          "en": "Shaqiq reported:We were sitting at the door of Abdullah (b. Mas'ud) waiting for him (to come out and deliver a sermon to us). It was at this time that there happened to pass by us Yazid b. Mu'awiya an-Nakha'i. We said: Inform him ('Abdullah b. Mas'ud) of our presence here. He went in and Abdullah b. Mas'ud lost no time in coming out to us and said: I was informed of your presence here but nothing hindered me to come out to you but the fact that I did not like to bore you (by stuffing your minds with sermons) as Allah's Messenger (ﷺ) did not deliver us sermon on certain days fearing that it might prove to be boring for us",
          "ur": "ابو معاویہ نے اعمش سے اور انھوں نے شقیق سے روایت کی ، کہا : ہم حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کے انتظار میں ان کے گھر کے دروازےپربیٹھےہوئے تھے کہ اتنے میں یزید بن معاویہ نخعی ہمارے پاس سے گزرے تو ہم نے کہا : ان ( عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ ) کو ہمارے آنے کی اطلاع کردیں وہ ان کے پاس گئے تو تھوڑی ہی دیر میں حضرت عبد اللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) آگئے ۔ اور فرمایا : \" مجھے تمھارے آنے کی اطلاع کردی گئی تھی اور مجھے تمھارے پاس آنے سے صرف یہ ناپسندیدگی مانع تھی کہ میں تمھاری اکتاہٹ کا سبب نہ بن جاؤں ۔ بلاشبہ رسول اللہ صلی اللہ علیہ وسلم بھی ہمارے اکتا جانے کے ڈرسے صرف بعض دنوں میں ہی وعظو نصیحت سے نوازاکرتے تھے ۔",
          "fr": "Rapporté par Shaqiq رضي الله عنه : Nous étions assis devant la porte de ‘Abdullah ibn Mas’oud en attendant qu’il sorte pour nous faire un sermon. À ce moment-là, Yazid ibn Mu’awiya an-Nakha’i est passé devant nous. Nous lui avons dit : « Informe ‘Abdullah ibn Mas’oud de notre présence ici. » Il est entré et ‘Abdullah ibn Mas’oud est vite sorti vers nous et a dit : « On m’a informé de votre présence, mais la seule raison pour laquelle je n’étais pas encore sorti, c’est que je ne voulais pas vous lasser (en vous donnant trop de sermons), car le Messager d’Allah ﷺ ne nous faisait pas de sermons certains jours, de peur que cela ne devienne ennuyeux pour nous. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah]. Telah menceritakan kepada kami [Ibnu Numair] dan teks hadits miliknya, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] berkata: Kami duduk di dekat pintu Abdullah seraya menantinya, lalu Yazid bin Mu'awiyah An Nakha'i melewati kami, kami berkata padanya: Beritahukan keberadaan kami padanya. Ia masuk, tidak lama kemudian [Abdullah] keluar lalu berkata: Aku telah diberitahu keberadaan kalian dan tidak ada yang menghalangiku untuk keluar menemui kalian kecuali karena aku tidak ingin membuat kalian jemu. Rasulullah Shallallahu 'alaihi wa Salam mengatur (penyampaian) nasehat bagi kami dalam beberapa hari karena khawatir kami jemu. Telah menceritakan kepada kami [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Ibnu Idris]. Telah menceritakan kepada kami [Minjab bin Al Harits At Taimi] telah menceritakan kepada kami [ibnu Mushir]. Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Khaysram] keduanya berkata: Telah mengkhabarkan kepada kami [Isa bin Yunus]. Telah menceritakan kepada kami [Ibnu Abi Umar] telah menceritakan kepada kami [Sufyan], semuanya dari [Al A'masy] dengan sanad ini dengan matan serupa. Minjab menambahkan dalam riwayatnya: Dari Ibnu Mushir. Al A'masy berkata: Telah menceritakan kepadaku [Amru bin Murrah] dari [Syaqiq] dari [Abdullah] sepertinya",
          "tr": "Bize Ebû Bekr.b. Ebî Şeybe rivayet etti. (Dediki): Bize Veki' ile Ebû Muâviye rivayet ettiler. H. Bize İbni Numeyr de rivayet etti. Lâfız onundur. (Dediki): Bize Ebû Muâviye, A'meş'den, o da Şakik'den naklen rivayet etti. (Şöyle demiş): Abdullah'ın kapısı yanında oturduk, onu bekliyorduk, derken yanımızdan Yezid b. Muâviyete'n-Nehaî geçti. — Bize şunun yerini bildir, dedik. Hemen onun yanına girdi. Ve az sonra Abdullah yanımıza çıkarak: — Ben sizin burada olduğunuzu haber aldım. Ama yanınıza çıkmama sizi bıktırırım endişesi mani oldu. Gerçekten Resûlullah (Sallallahu Aleyhi ve Sellem) bizi bıktırır endişesiyle bazı günler va'z hususunda bizden söz alırdı, dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 80
      }
    },
    {
      "hadithNumber": 7128,
      "arabicNumber": "2821.02",
      "book": 52,
      "hadithInBook": 81,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا ابْنُ إِدْرِيسَ، ح وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، حَدَّثَنَا ابْنُ مُسْهِرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى، بْنُ يُونُسَ ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ ‏.‏ وَزَادَ مِنْجَابٌ فِي رِوَايَتِهِ عَنِ ابْنِ مُسْهِرٍ قَالَ الأَعْمَشُ وَحَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of 'Abdullah through other chains of transmitters",
          "ur": "ابو سعید اشج نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن ادریس نے حدیث بیان کی ، نیز ہمیں منجانب بن حارث تمیمی نے حدیث بیان کی ، کہا : ہمیں ابن مسہر نے خبر دی ، نیز ہمیں اسحٰق بن ابراہیم اور علی بن خشرم نے حدیث بیان کی ، دونوں نے کہا : ہمیں عیسیٰ بن یونس نے خبر دی ، نیز ہمیں ابن ابی عمر نے حدیث بیان کی ، انھوں نے کہا : ہمیں سفیان نے حدیث بیان کی ، ان سب نے اعمش سے اسی سند کے ساتھ اسی کے مطابق روایت کی ۔ اور منجانب نے اپنی روایت میں مزید یہ کہا : ابن مسہر سے روایت ہے اعمش نے کہا : اور مجھے عمرو بن مرہ نے شیقق سے اور انھوں نے عبد اللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے اسی کے مانند حدیث بیان کی ۔",
          "fr": "Rapporté par ‘Abdullah رضي الله عنه : Ce hadith a été rapporté par d’autres chaînes de transmetteurs",
          "tr": "{m-82} Bize Ebû Saîd El-Eşec rivayet etti. (Dediki): Bize İbni İdris rivayet etti, H. Bize Mincab b. Haris Et-Temîmî de rivayet etti. (Dediki): Bize İbni Müshir rivayet etti. H. Bize İshak b. İbrahim ile Ali b. Haşrem de rivayet ettiler. (Dedilerki): Bize İsa b. Yûnus haber verdi. H. Bize İbni Ebî Ömer dahi rivayet etti. (Dediki): Bize Süfyan rivayet etti. Bu râvilerin hepsi A'meş'den bu isnadla bu hadîsin mislini rivayet etmişlerdir. Mincâb İbni Müshir'den rivayetinde şunu zîyâde etti: «A'meş dediki: Bana Amr b. Murra dahî Şakîk'dan, o da Abdullah'dan naklen bu hadîsin mislini rivayet etti.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 81
      }
    },
    {
      "hadithNumber": 7129,
      "arabicNumber": "2821.03",
      "book": 52,
      "hadithInBook": 82,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنْ مَنْصُورٍ، عَنْ شَقِيقٍ أَبِي وَائِلٍ، قَالَ كَانَ عَبْدُ اللَّهِ يُذَكِّرُنَا كُلَّ يَوْمِ خَمِيسٍ فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نُحِبُّ حَدِيثَكَ وَنَشْتَهِيهِ وَلَوَدِدْنَا أَنَّكَ حَدَّثْتَنَا كُلَّ يَوْمٍ ‏.‏ فَقَالَ مَا يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ إِلاَّ كَرَاهِيَةُ أَنْ أُمِلَّكُمْ ‏.‏ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ كَرَاهِيَةَ السَّآمَةِ عَلَيْنَا ‏.‏",
        "translations": {
          "en": "Shaqiq b. Wi'il reported that 'Abdullah used to give us sermon on every Thursday. A person said:Abu 'Abd al-Rahman, we love your talk and so we yearn (to listen to you) and earnestly desire that you should deliver us lecture every day. Thereupon he said: There is nothing to hinder me in giving you talk (every day) but the fact that you may be bored. Allah's Messenger (ﷺ) did not deliver sermons on certain days (fearing that we might be bored)",
          "ur": "منصور نے شیقق ابو وائل سے روایت کی کہ حضرت عبد اللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) ہمیں ہر جمعرات کے دن وعظ و نصیحت فرمایا کرتے تھے تو ایک شخص نے کہا : ابو عبد الرحمٰن !ہمیں آپ کی باتیں ( بہت ) پسند ہیں اور ہم ان کی طرف شدید رغبت رکھتے ہیں ۔ ہم چاہتے ہیں کہ آپ ہر روز ہمیں احادیث بیان فرمایا کریں ۔ انھوں نے کہا : مجھے اس کے علاوہ تمھیں احادیث بیان کرنے سے صرف یہ ناپسندیدگی مانع ہے کہ میں تمھیں اکتاہٹ کا شکار نہ کردوں ۔ رسول اللہ صلی اللہ علیہ وسلم اس بات کو ناپسند کرتے ہوئے کہ ہم پر اکتاہٹ طاری ہو جائے کچھ ( خاص ) دنوں میں ہی ہمیں وعظ و نصیحت سے نواازاکرتے تھے ۔",
          "fr": "Rapporté par Shaqiq ibn Wi’il رضي الله عنه : ‘Abdullah nous faisait un sermon chaque jeudi. Une personne lui a dit : « Abou ‘Abd ar-Rahman, nous aimons t’écouter et nous avons très envie que tu nous parles chaque jour. » Il a répondu : « La seule chose qui m’empêche de le faire, c’est que vous pourriez vous lasser. Le Messager d’Allah ﷺ ne faisait pas de sermons certains jours, de peur que cela ne devienne ennuyeux pour nous. »",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengkhabarkan kepada kami [Jarir] dari [Manshur]. Telah menceritakan kepada kami [Ibnu Abi Umar], teks hadits miliknya, telah menceritakan kepada kami [Fudhail bin Iyadh] dari [Manshur] dari [Syaqiq Abu Wa`il] berkata: [Abdullah] menyampaikan nasehat untuk kami setiap hari kamis lalu seseorang berkata padanya: Hai Abu Abdurrahman, kami menyukai penyampaianmu. Kami ingin kau menceritakan kepada kami setiap hari. Abdullah berkata: Tidak ada yang menghalangiku untuk menceritakan kepada kalian selain karena aku tidak ingin membuat kalian jemu. Rasulullah Shallallahu 'alaihi wa Salam mengatur (penyampaian) nasehat pada kami dalam beberapa hari karena tidak mau membuat kami jemu",
          "tr": "Bize İshak b. İbrahim de rivayet etti. (Dediki): Bize Cerir, Mansûr'dan naklen haber verdi. H. Bize İbni Ebî Ömer dahi rivayet etti. Lâfız onundur. (Dediki): Bize Fudayl b. Iyâd, Mansûr'dan, o da Ebû Vâil Şakîk'dan naklen rivayet etti. (Şöyle demiş): Abdullah bize her perşembe günü müzâkere yapardı. Bir adam kendisine : — Yâ Ebâ Abdirrahman! Biz senin konuşmanı seviyor, onu arzu ediyoruz. Bize her gün konuşmuş olmanı diliyoruz, dedi. Bunun üzerine Abdullah şunu söyledi; — Sizinle konuşmaktan beni men eden sizi bıktırırım korkusudur, Gerçekten Resûlullah (Sallallahu Aleyhi ve Sellem) bizi bıktırır endişesiyle bazı günler va'z hususunda bizden söz alırdı. izah: Bu hadîsi Buhârî «Kitâbu'l-İlim»'de tahric etmiştir. Ebû Abdirrahman, Hz. Abdullah b. Mesud'un künyesidir. «Yetehavvelûnâ» kelimesinin meşhur mânâsı bizden söz alırdı, demektir. Bazıları bunun bizi ıslâh ederdi, mânâsına geldiğini; bir takımları va'z için bize anîden gelirdi, demek olduğunu söylemişlerdir. -Bizi bir insanın hizmet işini kapadığı gibi hapsederdi...» mânâsına geldiğini söyleyenler de vardır. Hadîs-i şerif cemaatı bıktırmamak için va'zı fazla uzatmayıp orta hâle dikkat etmenin lüzumuna delildir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 52,
        "hadith": 82
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "53KB"
  }
}