{
  "collection": "muslim",
  "book": 7,
  "name": {
    "arabic": "كتاب The Book of Prayer - Friday",
    "transliteration": "kitab prayer - friday",
    "translation": "The Book of Prayer - Friday"
  },
  "totalHadith": 93,
  "hadithNumberRange": {
    "first": 1951,
    "last": 2043
  },
  "content": [
    {
      "hadithNumber": 1951,
      "arabicNumber": "844.01",
      "book": 7,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَأْتِيَ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah is reported to have heard Allah's Messenger (ﷺ) as saying:When any one of you intends to come for Jumu'a prayer, he should take a bath",
          "ur": "نافع نے حضرت عبداللہ ( بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نےکہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئےسنا : \" جب تم میں سے کوئی شخص جمعے کےلئے آنے کاارادہ کرے تو وہ غسل کرے ۔",
          "fr": "Rapporté par Abdullah : J’ai entendu le Messager d’Allah ﷺ dire : « Quand l’un de vous veut venir à la prière du vendredi, qu’il prenne un bain. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Muhammad bin Rumh bin Al Muhajir] keduanya berkata, telah mengabarkan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Laits] dari [Nafi'] dari [Abdullah] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian hendak menunaikan shalat Jum'at, hendaklah ia mandi terlebih dahulu",
          "tr": "Bize Yahya b. Yahya Et-Temîmî ile Muhammed b. Rumh b. EI-Muhacir rivayet ettiler. Dedilerki: Bize Leys rivayet etti, H. Bize Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Leys, Nâfi'-den, o da Abdullah'dan naklen rivayet etti. Abdullah şöyle demiş: Ben, Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Biriniz Cumâ'ya gelmek isterse yıkansın!» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 1952,
      "arabicNumber": "844.02",
      "book": 7,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ، شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ ‏ \"‏ مَنْ جَاءَ مِنْكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Umar is reported to have said that The Messenger of Allah (may peace be up on him) was standing on the pulpit when he said this:He who comes for Jumu'a he should take a bath",
          "ur": "لیث نے ابن شہاب سے ، انھوں نے عبداللہ بن عبداللہ بن عمیر سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے منبر پر کھڑے ہوئے فرمایا : \" تم میں سے جو جمعے کے لئے آئے غسل کرے ۔",
          "fr": "Rapporté par Abdullah b. Umar : Le Messager d’Allah ﷺ était debout sur le minbar quand il a dit ceci : « Celui qui vient pour la prière du vendredi, qu’il prenne un bain. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Rumh] telah mengabarkan kepada kami [Laits] dari [Ibnu Syihab] dari [Abdullah bin Abdullah bin Umar] dari [Abdullah bin Umar] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda disaat berada di atas mimbar: \"Barangsiapa di antara kalian ingin mendatangi shalat Jum'at hendaklah ia mandi.\" Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Salim] dan [Abdullah] -keduanya adalah anak Abdullah bin Umar- dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan hadits semisalnya. Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [bapaknya] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda. Yakni dengan hadits yang serupa",
          "tr": "Bize Kuteybetü'bnü Saîd rivayet etti. Dediki: Bize Leys rivayet etti. H. Bize İbni Rumh dahi rivayet etti. Dediki: Bize Leys, İbni Şihâb'dan, o da Abdullah b. Abdillâh b. Ömer'den, o da Abdullah b. Ömer'den. o da Resûlullah (Sallallahu Aleyhi ve Sellem) 'den naklen rivayet etti ki, Minber üzerinde ayakta iken : «Sizden kim cumâ'ya gelecekse yıkansın!» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 1953,
      "arabicNumber": "844.03",
      "book": 7,
      "hadithInBook": 3,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سَالِمٍ، وَعَبْدِ اللَّهِ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم .‏ بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Ibn Umar by another chain of transmitters",
          "ur": "ابن جریج نے کہا : ابن شہاب نے عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے دونوں بیٹوں سالم اورعبداللہ سے خبر دی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اس ( سابقہ حدیث ) کے مانندروایت کی ۔",
          "fr": "Rapporté par Ibn Umar par une autre chaîne de transmetteurs",
          "tr": "{….} Bana Muhammed b. Râfî' rivayet etti. Dediki: Bize Abdurrazzâk rivayet etti. Dediki: Bize İbni Cüreyc rivayet etti. Dediki: Bize İbni Şihâb, Abdullah b. Ömer'in oğulları Salim ile Abdullah'dan, onlar da İbni Ömer'den, o da Nebi (Sallallahu Aleyhi ve Selîem)'den naklen bu hadîsin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 1954,
      "arabicNumber": "844.04",
      "book": 7,
      "hadithInBook": 4,
      "text": {
        "arabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏.‏ بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "Abdullah (b. Umar) reported on the authority of his father that he heard like this from the Messenger of Allah (ﷺ)",
          "ur": "یونس نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ سے اورانھوں نے اپنے والد سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئےسنا ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے مانند ہے ۔",
          "fr": "Rapporté par ‘Abdullah (b. Umar), d’après son père : Il a entendu cela du Messager d’Allah ﷺ",
          "tr": "{….} Bana Harmeletü'bnü Yahya rivayet etti. Dediki: Bize İbni Vehb haber verdi. Dediki: Bana Yûnus, İbni Şihâb'dan, o da Salim b. Abdillâh'dan, o da babasından naklen haber verdi. Babası; «Resûlullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim...» diyerek yukarki hadîsin mislini rivayet etmiş. İzah Bu hadîsi Buhari; Tirmizî; Nesâî ve İbni Mâce «cum'a» bahsinde muhtelif râvîlerden tahrîc etmişlerdir. Yine bu hadîsi İbni Hibbân «Sahîh» inde; Ebû Avane de «Müstahrec» inde tahrîc etmişlerdir. Onların rivayetinde: «Erkek ve kadınlardan her kim cum'aya gelecekse yıkansın'.. buyurulmaktadır. Hadîsin İbni Huzeyme rivayetinde: «Cum'aya gelmeyen erkek ve kadınlara gusûl lâzım değildir.» ziyâdesi vardır. Bu hadîsi Bezzâr, Hz. Âişe ile Abdullah b. Büreyde 'den; îbni Mâce Abdullah b. Abbas (Radiyallahû anh) 'dan tahrîc etmişlerdir. İbni Abbâs rivayetinde: «Resûlullah (Sallallahu Aleyhi ve Sellem): «Şüphesiz ki bu günü, Allah, insanlara bir bayram günü yapmışdir. Şu hâlde kim cum'aya gelirse yıkansın! buyurdular.» denilmişdir. Taberânî bu hadîsi Hz. Ebû Eyyûb El-Ensâr.î 'den rivayet eder. Bu hadîsin pek çok tarîkleri vardır. îbni Mendeh Nâfi' tarîki ile, Abdullah İbni Ömer 'den rivayet edenleri saymış; 300 kişiye baliğ olmuşlar; İbni Ömer 'den başka râvîlerini saymış; 24 Sahabîye baliğ olmuşlardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 1955,
      "arabicNumber": "845.01",
      "book": 7,
      "hadithInBook": 5,
      "text": {
        "arabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، ‏.‏ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَيْنَا هُوَ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ إِنِّي شُغِلْتُ الْيَوْمَ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ النِّدَاءَ فَلَمْ أَزِدْ عَلَى أَنْ تَوَضَّأْتُ ‏.‏ قَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِالْغُسْلِ ‏.‏",
        "translations": {
          "en": "Abdullah (b. 'Umar) reported from his father that while he was addressing the people on Friday (sermon), a person, one of the Companions of the Messenger of Allah (ﷺ), entered (the mosque). Umar said to him loudly:What is this hour (for attending the prayer)? He said: I was busy today and I did not return to my house when I heard the call (to Friday prayer), and I did no more but performed ablution only. Upon this Umar said: just ablution! You know that the Messenger of Allah (ﷺ) commanded (us) to take a bath (on Friday)",
          "ur": "حضرت عبداللہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ جمعے کے دن لوگوں کوخطاب فرمارہےتھے ( کہ اسی اثناء میں ) رسول اللہ صلی اللہ علیہ وسلم کے صحابہ رضوان اللہ عنھم اجمعین میں سے ایک شخص داخل ہوا ، حضرت عمر رضی اللہ تعالیٰ عنہ نے انھیں آوازدی : ( آنےکی ) یہ کون سی گھڑی ہے؟انھوں نے کہا : میں آج مصروف ہوگیا ، گھر لوٹتے ہیں میں نے اذان سنی اور صرف وضو کیا ( اورحاضر ہوگیاہوں ) حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : اور وہ بھی ( صرف ) وضو؟حالانکہ آپ کو معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم غسل کرنے کاحکم دیتے تھے ۔",
          "fr": "Rapporté par Abdullah ibn Umar رضي الله عنه alors qu'il donnait un sermon : Un des Compagnons du Messager d’Allah ﷺ entra (dans la mosquée) pendant qu’Omar parlait aux gens le vendredi. Omar lui dit à haute voix : « Pourquoi arrives-tu à cette heure pour la prière ? » Il répondit : « J’étais occupé aujourd’hui et je ne suis pas rentré chez moi quand j’ai entendu l’appel à la prière du vendredi, alors je n’ai fait que les ablutions. » Omar lui dit alors : « Seulement les ablutions ! Tu sais pourtant que le Messager d’Allah ﷺ nous a ordonné de prendre un bain le vendredi. »",
          "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Salim bin Abdullah] dari [bapaknya] bahwa; Ketika [Umar bin Al Khaththab] sedang berkhuthbah pada hari jum'at dihadapan jama'ah, masuklah seorang laki-laki dari sahabat Rasulullah shallallahu 'alaihi wasallam, lalu Umar pun memanggilnya seraya bertanya, \"Sudah jam berapakah ini?\" Laki-laki itu menjawab, \"Aku sangat sibuk hari ini. Aku tidak sempat pulang, sehingga ketika kedengaran adzan, tidak ada yang dapat aku lakukan kecuali berwudlu.\" Umar berkata, \"Engkau hanya berwudlu?. Bukankah Engkau tahu bahwa Rasulullah shallallahu 'alaihi wasallam juga memerintahkan untuk mandi?",
          "tr": "Bana Harmeletü'bnü Yahya rivayet etti. Dediki: Bize İbni Vehb rivayet etti. Dediki: Bana Yûnus İbni Şihâb'dan naklen haber verdi. Demişki: Bana Salim b. Abdillâh, babasından naklen rivayet ettiki, Ömeru'bnü'l-Hattâb bir cuma günü cemaata hutbe okurken Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabından biri (mescide) girmiş. Ömer ona : — Bu saat hangi saatdir diye nida etmiş. Gelen zât: — Ben, bu gün çalıştım, evime dönemeden ezanı işittim de abdest almakdan fazla bir şey yapamadım; cevâbını vermiş. Ömer: — Abdestle yetinmen de öyle! Bilirsin ki Resûlullah (Sallallahu Aleyhi ve Sellem) yıkanmayı emrederdi., demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 1956,
      "arabicNumber": "845.02",
      "book": 7,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ عُثْمَانُ بْنُ عَفَّانَ فَعَرَّضَ بِهِ عُمَرُ فَقَالَ مَا بَالُ رِجَالٍ يَتَأَخَّرُونَ بَعْدَ النِّدَاءِ ‏.‏ فَقَالَ عُثْمَانُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا زِدْتُ حِينَ سَمِعْتُ النِّدَاءَ أَنْ تَوَضَّأْتُ ثُمَّ أَقْبَلْتُ ‏.‏ فَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا أَلَمْ تَسْمَعُوا رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا جَاءَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported:Umar b. Khattab was delivering a sermon to the people on Friday when 'Uthman b. 'Affan came there. 'Umar hinting to him said: What would become of those persons who come after the call to prayer? Upon this 'Uthman said: Commander of the faithful, I did no more than this that after listening to the call, I performed ablution and came (to the mosque). 'Umar said: Just ablution! Did you not hear the Messenger of Allah (my peace be upon him) say this: When any one of you comes for Jumu'a, he should take a bath",
          "ur": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : ( ایک بار ) حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ جمعے کے دن لوگوں کو خطبہ ارشادفرمارہے تھے کہ اسی دوران میں حضرت عثمان بن عفان رضی اللہ تعالیٰ عنہ مسجد میں داخل ہوئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے ان پر تعریف کی ( اعتراض کیا ) اور کہا : لوگوں کو کیا ہوا کہ اذان کےبعد دیر لگاتے ہیں؟حضرت عثمان رضی اللہ تعالیٰ عنہ نے کہا : اے امیر المومنین رضی اللہ تعالیٰ عنہ !میں نے اذان سننے پر اس سے زیادہ کچھ نہیں کیا کہ وضو کیا ہے اورحاضر ہوگیاہوں ، اس پر عمر رضی اللہ تعالیٰ عنہ نے کہا اور وہ بھی ( صرف ) وضو؟ کیا تم لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے نہیں سنا : \" جب تم میں سے کوئی جمعے کے لئے آئے تو وہ غسل کرے؟",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Omar ibn Khattab رضي الله عنه faisait un sermon aux gens le vendredi quand Uthman ibn Affan رضي الله عنه arriva. Omar, en lui faisant un signe, dit : « Que dire de ceux qui viennent après l’appel à la prière ? » Uthman répondit : « Commandeur des croyants, je n’ai fait que cela : après avoir entendu l’appel, j’ai fait mes ablutions et je suis venu. » Omar dit : « Seulement les ablutions ! N’as-tu pas entendu le Messager d’Allah ﷺ dire : “Quand l’un de vous vient pour la prière du vendredi, qu’il prenne un bain.” »",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Al Walid bin Muslim] dari [Al Auza'i] ia berkata, telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] telah menceritakan kepadaku [Abu Hurairah] ia berkata; Ketika [Umar bin Al Khathab] berkhutbah di hadapan manusia pada hari Jum'at, tiba-tiba masuklah Utsman bin Affan, maka Umar pun memanggilnya seraya bertanya, \"Bagaimana orang-orang pada terlambat setelah mendengar adza?\" Utsman pun menjawab, \"Wahai Amirul Mukminin, saya tidak berbuat lagi setelah mendengar adzan kecuali langsung berwudlu dan berangkat.\" Umar berkata, \"Wudlu juga harus. Tetapi, bukankan kalian telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jika salah seorang dari kalian hendak menunaikan shalat Jum'at, hendaklah ia mandi terlebih dahulu",
          "tr": "Bize İshâk b. İbrahim rivayet etti. Dediki: Bize Velîd b. Müslim, Evzâî'den rivayet etti. Demişki: Bana Yahya b. Ebî Kesir rivayet etti. Dediki: Bana Ebû Selemete'bnü Abdirrahmân rivayet etti. Dediki: Bana Ebû Hureyre rivayet etti. Dediki: Bir cuma günü Ömeru'bnü'I-Hattâb cemaata hutbe okurken Osman b. Affân mescide giriverdi. Ömer ona ta'rîzde bulunarak: — Bâzı kimselere ne oluyor ki ezan okundukdan sonraya gecikiyorlar? dedi. Bunun üzerine Osman: — Yâ Emîre'l-Mü'minîn ezanı işittikden sonra abdest almakdan fazla bir şey yapamadım; sonra buraya geldim! dedi. Ömer : — Abdest de öyle! Siz Resulullah (Sallallahu Aleyhi ve Sellem)'i: «Biriniz Cumâ'ya gelecek mi, yıkansın!» buyururken işitmedinizmi? dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 1957,
      "arabicNumber": "846.01",
      "book": 7,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ، بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:Taking a bath on Friday is essential for every adult person",
          "ur": "حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جمعے کے دن ہر بالغ شخص پر غسل کرنا واجب ہے ۔",
          "fr": "Rapporté par Sa’id al-Khudri رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Prendre un bain le vendredi est obligatoire pour chaque adulte. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Shafwan bin Sulaim] dari [Atha` bin Yasar] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari jum'at adalah wajib bagi setiap muhtalim (yang telah beranjak dewasa)",
          "tr": "Bize Yahya b. Yahya rivayet etti. Dediki: Malik'e, Safyan b. Süleym'den dinlediğim, onun da Ata' b. Yesar'dan, onun'da Ebu Said-i Hudri'den naklen rivayet ettiği şu hadis’i okudum: Resulullah Sallallahu aleyhi ve selem dediki: «Cum’a günü yıkanmak her ihtilam olan kimseye vacipdir.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 1958,
      "arabicNumber": "847.01",
      "book": 7,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ، حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ النَّاسُ يَنْتَابُونَ الْجُمُعَةَ مِنْ مَنَازِلِهِمْ مِنَ الْعَوَالِي فَيَأْتُونَ فِي الْعَبَاءِ وَيُصِيبُهُمُ الْغُبَارُ فَتَخْرُجُ مِنْهُمُ الرِّيحُ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم إِنْسَانٌ مِنْهُمْ وَهُوَ عِنْدِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Aisha reported:The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foul smell. A person among them (those who were dressed so) came to the Messenger of Allah (ﷺ) while he was in my house. The Messenger of Allah (may peace he upon him) said to him: Were you to cleanse yourselves on this day",
          "ur": "عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : جمعے کے لیے لو گ اپنے گھروں سے اور عوالی سے باری باری آتے تھے وہ اونی عبائیں پہنے ہو تے تھے اور ( راستے میں ) ان پر گردو غبار بھی پڑتا تھا جس کی وجہ سے ان سے بو پھوٹتی تھی ان میں سے ایک انسان رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور اس وقت آپ صلی اللہ علیہ وسلم میرے ہاں تشریف فر ما تھے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کیا ہی اچھا ہو کہ تم لو گ اس دن کے لیے صاف ستھرے ہو جا یا کرو ۔",
          "fr": "Rapporté par Aisha (la mère des croyants) رضي الله عنها : Les gens venaient pour la prière du vendredi depuis leurs maisons dans les villages voisins, habillés de vêtements en laine couverts de poussière, ce qui dégageait une mauvaise odeur. L’un d’eux entra chez le Messager d’Allah ﷺ alors qu’il était dans ma maison. Le Messager d’Allah ﷺ lui dit : « Ne pourriez-vous pas vous laver en ce jour ? »",
          "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] dan [Ahmad bin Isa] keduanya berkata. Telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] dari [Ubaidullah bin Ja'far] bahwa [Muhammad bin Ja'far] telah menceritakan kepadanya dari [Urwah bin Zubair] dari [Aisyah] bahwa ia berkata; \"Ada orang-orang yang bergiliran datang untuk menunaikan shalat Jum'at dari rumah-rumah mereka di pegunungan. Mereka datang dengan memakai mantel lalu dipenuhi debu (hingga berbau tidak sedap). Beberapa orang di antara mereka mendatangi Rasulullah shallallahu 'alaihi wasallam yang ketika itu beliau berada di dekatku. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda kepada mereka: \"Alangkah baiknya, jika kalian pada hari ini mandi yang bersih",
          "tr": "Bana Hârûn b. Said El-Eylî ile Ahmed b. îsâ rivayet ettiler. Dedilerki: Bize İbni Vehb rivayet etti. Dediki: Bana Amr, Ubeydullah b. Ebî Ca'fer'den naklen haber verdi. Ona da Muhammed b. Ca'feı Urvetü'bnü'z-Zübeyr'den naklen rivayet etmiş. Urve de Âişe'den rivâye etmiş ki, Âişe şöyle demiş: «Halk cumâ'ya yaylalardaki evlerinden gelirlerdi. Aba içinde gelirler de toza bulanırlar; kendilerinden (ter) kokusu çıkardı. (Bir defa) Resulullah (Sallallahu Aleyhi ve Sellem) benim yanımda iken ona, bunlardan bir adam geldi. Resulullah (Sallallahu Aleyhi ve Sellem (onun hâlini görünce) : — Siz bu gün için temizlensenize!...» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 1959,
      "arabicNumber": "847.02",
      "book": 7,
      "hadithInBook": 9,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ النَّاسُ أَهْلَ عَمَلٍ وَلَمْ يَكُنْ لَهُمْ كُفَاةٌ فَكَانُوا يَكُونُ لَهُمْ تَفَلٌ فَقِيلَ لَهُمْ لَوِ اغْتَسَلْتُمْ يَوْمَ الْجُمُعَةِ ‏.‏",
        "translations": {
          "en": "Aisha reported:The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday",
          "ur": "عمرہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : لو گ کا م کا ج والے تھے ان کے نوکر چاکر نہ ہو تے تھے وہ ایسے تھے کہ ان سے بو آتی تھی تو ان سے کہا گیا : کیا ہی اچھا ہو کہ تم جمعے کے دن نہا لیا کرو ۔",
          "fr": "Rapporté par Aisha (la mère des croyants) رضي الله عنها : La plupart des gens étaient des ouvriers et n’avaient pas de serviteurs. Ils dégageaient donc une mauvaise odeur. On leur disait : « Pourquoi ne pas prendre un bain le vendredi ? »",
          "id": "Dan telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Amrah] dari [Aisyah] bahwa ia berkata; Dulu pada pekerja tidak memiliki pelayan hingga tubuh mereka mengeluarkan aroma yang tidak sedap, maka dikatakanlah kepada mereka, \"Sekiranya, kalian semua mandi pada hari jum'at",
          "tr": "{….} Bize Muhammed b. Rumh rivayet etti. Dediki: Bize Leys, Yahya b. Saîd'den, o da Amra'dan o da Âişe'den naklen rivayet etti ki, Âişe şöyle demiş: «Halk İş göç sahibi idiler. Kendilerine bakacak kimseleri yokdu. Bu sebeple nahoş koktukları olurdu. (Onun için) kendilerine siz cuma günü yıkansanız a!...» denildi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 1960,
      "arabicNumber": "846.02",
      "book": 7,
      "hadithInBook": 10,
      "text": {
        "arabic": "وَحَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ، الْحَارِثِ أَنَّ سَعِيدَ بْنَ أَبِي هِلاَلٍ، وَبُكَيْرَ بْنَ الأَشَجِّ، حَدَّثَاهُ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، عَنْ عَمْرِو، بْنِ سُلَيْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ غُسْلُ يَوْمِ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَسِوَاكٌ وَيَمَسُّ مِنَ الطِّيبِ مَا قَدَرَ عَلَيْهِ ‏\"‏ ‏.‏ إِلاَّ أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِي الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ ‏.‏",
        "translations": {
          "en": "Abd al-Rahman son of Abd Sa'id al-Khudri reported on the authority of his father that the Messenger of Allah (ﷺ) said:Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady",
          "ur": "سعید بن ابی بلال اور بکیر بن اشج نے ابو بکر بن منکد ر سے حدیث بیان کی ، انھوں نے عمرو بن سلیم سے انھوں نے عبد الرحمٰن بن ابی سعید خدری رضی اللہ تعالیٰ عنہ سے اور انھوں نے اپنے والد ( حضڑت ابو سعید رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جمعے کے دن غسل کرنا ہر بالگ شخص پر واجب ہے اور مسواک کرنا بھی اور ( ہر شخص ) اپنی استطاعت کے مطا بق خوشبو استعمال کرے ۔ \"\" البتہ بکیر نے ( سند میں ) عبد الرحمان کا ذکر نہیں کیا اورخوشبوکے بارے میں کہا : \"\" چاہے وہ عورت کی خوشبو کیوں نہ ہو ۔",
          "fr": "Rapporté par Abd al-Rahman, fils de Abd Sa’id al-Khudri, d’après son père رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Prendre un bain le vendredi pour chaque adulte, utiliser le siwak et mettre du parfum disponible : tout cela est recommandé. Pour le parfum, il peut même s’agir de celui utilisé par une femme. »",
          "id": "Dan telah menceritakan kepada kami [Amru bin Sawwad Al Amiri] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepada kami [Amru bin Harits] bahwa [Sa'id bin Abu Hilal] dan [Bukair bin Al Asyaj] keduanya telah menceritakan kepadanya dari [Abu Bakr bin Al Munkadir] dari [Amru bin Sulaim] dari [Abdurrahman bin Abu Sa'id Al Khudri] dari [bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari jum'at adalah wajib bagi setiap muslim yang muhtalim (telah dewasa). Begitu pula menggosok gigi, memakai wewangian sekedar yang dapat ia lakukan.\" Kemudian Bukair tidak menyebutkan Abdurrahman. Dan ia berkata, berkenaan dengan wewangian; \"Meskipun dengan wewangian wanita",
          "tr": "Bize Amru'bnü Sevvâd El-Âmirî rivayet etti. Dediki: Bize Abdullah b. Vehb rivayet etti. (Dediki): Bize Amru'bnü'l-Haris rivayet etti. Ona da Saîd b. Ebi Hilâl ile Bükeyr b. Eşecc, Ebû Bekir b. Müiv kedir'den, o da Amr b. Süleym'den, o da Abdurrahmân b. Ebî Saîd'il-Hudrî'den, o da babasından naklen rivayet etmişler kî, Resûlullah (Sallallahu Aleyhi ve Sellem); «Cuma gönü yıkanmak, her ihtilâm olana farzdır. Bir de misvak tutunmak!... Bulabildiği kadar koku da sürünür.» buyurmuşlar. Yalnız Bükeyr, Abdurrahmân'i zikretmemiş; koku hakkında da: demiştir. «Velev kadının kokusundan!..» demiştir. İzah 848 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 1961,
      "arabicNumber": "848.01",
      "book": 7,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ، بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ ذَكَرَ قَوْلَ النَّبِيِّ صلى الله عليه وسلم فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ ‏.‏ قَالَ طَاوُسٌ فَقُلْتُ لاِبْنِ عَبَّاسٍ وَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ قَالَ لاَ أَعْلَمُهُ ‏.‏",
        "translations": {
          "en": "Tawus reported that Ibn Abbas narrated the words of the Messenger of Allah (ﷺ) about taking bath on Friday. Tawus said:I asked Ibn Abbas it one should apply to oneself perfume or oil which is available with his wife. He (Ibn Abbas) said: I do not know of it",
          "ur": "روح بن عباوہ اور عبد الرزاق نے ابن جریج سے حدیث بیان کی انھوں نے کہا مجھے ابراہیم بن میسر ہ نے طاوس سے خبر دی اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے جمعے کے دن غسل کرنے کے بارے میں نبی صلی اللہ علیہ وسلم کا فر ما ن بیان کیا ۔ طاوس نے کہا : میں نے ابن عباس رضی اللہ تعالیٰ عنہ سے پو چھا : اگر اس کے گھر والوں کے پاس موجود ہو تو وہ خوشبو تیل بھی استعمال کر سکتا ہے ؟انھوں نے ( جواب میں ) کہا : میں یہ بات نہیں جا نتا ۔",
          "fr": "Rapporté par Tawus رضي الله عنه : Ibn Abbas رضي الله عنه a rapporté les paroles du Messager d’Allah ﷺ concernant le bain du vendredi. Tawus dit : « J’ai demandé à Ibn Abbas si on pouvait utiliser le parfum ou l’huile de sa femme. » Il répondit : « Je n’en sais rien. »",
          "id": "Telah menceritakan kepada kami [Hasan Al Hulwani] telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Ibnu Juraij] -dalam jalur lain- Dan telah menceritakan kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibrahim bin Maisarah] dari [Thawus] dari [Ibnu Abbas] bahwa ia menyebutkan sabda Nabi shallallahu 'alaihi wasallam mengenai mandi pada hari Jum'at. [Thawus] berkata; Lalu saya bertanya kepada [Ibnu Abbas], \"Apakah beliau memakai wewangian atau minyak wangi saat berada bersama keluarganya?\" Ibnu Abbas menjawab, \"Saya tidak tahu.\" Dan telah menceritakannya kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Muhammad bin Bakar] -dalam jalur lain- Dan Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Adl Dlahhak bin Makhlad] keduanya dari [Ibnu Juraij] dengan isnad ini",
          "tr": "Bize Hasanü'I-Hulvânî rivayet etti. (Dediki): Bize Ravhu'bnü Ubâde riivâyet etti. (Dediki): Bize İbni Cüreyc rivayet etti. H. Bana Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdurrazzâk rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana İbrahim b. Meysera, Tâvûs'dan, o da İbni Abbâs'dan naklen haber verdi. İbni Abbas, Nebi (Sallallahu Aleyhi ve Sellem)'in cum’a günü yıkanmak hususundaki hadîsini anlatmış. Tavus diyor ki: Ben, İbni Abbas'a: «Şayet ailesi nezdinde güzel koku yahut yağ varsa, ondan da sürünür mü? dedim; İbni Abbas: — Onu bilmiyorum!., cevabını verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 1962,
      "arabicNumber": "848.02",
      "book": 7,
      "hadithInBook": 12,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ، اللَّهِ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الإِسْنَادِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Ibn Juraij with the came chain of transmitters",
          "ur": "محمد بن بکر اور ضحاک بن مخلددونوں نے بن جریج سے اسی سند کے ساتھ ( سابقہ ) حدیث بیان کی ۔",
          "fr": "Rapporté par Ibn Juraij رضي الله عنه : Ce hadith a été rapporté par Ibn Juraij avec la même chaîne de transmetteurs",
          "tr": "{….} Bize, bu hadîsi İshâk b. İbrâhîm dahî rivayet etti. (Dediki): Bize Muhammed b. Bekir haber verdi. H. Bize Hârûn b. Abdillâh dahî rivayet etti. (Dediki): Bize Dahhâk b. Mahled rivayet etti. Bu râvîlerin ikisi de İbni Cüreyc'den bu isnâdla rivâyetde bulunmuşlardır. izah: Bu hadîsleri Buhârî «Kitâbü'l-Cumua» da; Ebû Dâvûd ile Nesâî «Kitâbü't-Tahâre» de tahrîc etmişlerdir. Tıyb: Güzel koku. Dihnai: Kokulu veya kokusuz yağ demekdir. Hadîsdeki: «Bulabildiği kadar koku da sürünür.» cümlesi hakkında Kaadi Iyâz : «Bu cümle, bulabildiğini sürünmesi hususunda te'kîd İçin yahut çok sürünmek istediğini anlatmak için söylenmiş olabilir. Birinci mânâ daha zahirdir.» diyor. «Velev ki kadının kokusundan!...» cümlesi de bu mânâyı te'yîd etmektedir. Çünkü kadına mahsûs olan kokuyu erkeklerin sürünmesi mekruhdur. O devirde bu koku renkli idi. Ve pek keskin değildi. Böyle bir kokunun erkeğe mubah kılınması: Koku sürünmenin bit'te'kîd matlûb olduğuna delildir. Görülüyor ki cuma günü cemaata eziyet verecek kerih kokuların her cihetle önüne geçmek emrolunmuştur. Cemaata ve meleklere eziyet verecek kerîh kokular ya terlemeden yahut ağızdan hâsıl olur. Terlemeden hâsıl olan kokuyu gidermek için evvelâ yıkanmak, sonra bir de bulabildiği güzel kokuyu sürünmek; ağız kokusunu gidermek için de ağzı güzelce misvaklamak, emir buyurulmuşdur. Mânevi temizliğin yanısıra maddî temizliğe de bu derece ehemmiyet veren başka bir dîn bilmiyoruz. Tâvûs'un, Hz. İbni Abbâs'a: «Şayet ailesi nezdinde güzel koku yahut yağ varsa, ondan da sürünür mü?» diye sorması «hadîsin metninde bu ibare de yokmuydu?» manasınadır. İbni Abbâs (Rûdiyallahû anh) bunun hadîsden olup olmadığını hatırlayamarmşdır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 1963,
      "arabicNumber": "849",
      "book": 7,
      "hadithInBook": 13,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ حَقٌّ لِلَّهِ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَغْسِلُ رَأْسَهُ وَجَسَدَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that the Messenger of Allah (ﷺ) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body",
          "ur": "طاوس نے حضڑت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی آپ نے فر ما یا : ہر مسلمان پر اللہ تعا لیٰ کا حق ہے کہ وہ ہر سات دنوں میں ( کم سے کم ) ایک بار نہائے اپنا سر اور اپنا جسم دھوئے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « C’est un droit d’Allah sur chaque musulman de prendre un bain au moins un jour (le vendredi) parmi les sept jours de la semaine, et de se laver la tête et le corps. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abdullah bin Thawus] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Merupakan hak Allah atas setiap muslim untuk mandi di setiap tujuh hari, dengan mencuci kepala dan seluruh badannya",
          "tr": "Bana Muhammed b. Hatim rivayet etti. (Dediki): Bize, Behz rivayet etti. (Dediki): Bize Vüheyb rivayet etti. (Dediki): Bize Abdullah b. Tâvûs, baabsmdan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Efendimiz: «Her yedi günde bir gusül edip, başını ve bedenini yıkamak her müslüman üzerinde Allah'ın bir hakkıdır.» buyurmuşlar. İzah 850 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 1964,
      "arabicNumber": "850.01",
      "book": 7,
      "hadithInBook": 14,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that the Messenger of, Allah (ﷺ) said. He who takes a bath on Friday, the bath which is obligatory after the sexual discharge and then goes (to the mosque), he is like one who offers a she-camel as a sacrifice, and he who comes at the second hour would be like one who offers a cow, and he who comes at the third hour is live one who offers a ram with horns, and he who comes at the fourth hour is like one who offers a hen, and he who comes at the fifth hour is like one who offers an egg. And when the Imam comes out, the angels are also present and listen to the mention of God (the sermon)",
          "ur": "ابو صالح سمنان نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے جمعے کے دن غسل جنابت ( جیسا غسل ) کیا پھر مسجد ) چلا گیا تو اس نے گو یا ایک اونٹ قربان کیا اور جودوسری گھڑی میں گیا تو گو یا اس نے گا ئے قربان کی اور جو تیسری گھڑی میں گیا گو یا اس نے سینگوں والا ایک مینڈھا قربان کیا اور جو چوتھی گھڑی میں گیا اس نے گو یا ایک مرغ اللہ کے تقرب کے لیے پیش کیا اور جو پانچویں گھڑی میں گیا اس نے گو یا ایک انڈا تقرب کے لیے پیش کیا اس کے بعد جب امام آجا تا ہے تو فرشتے ذکر ( عبادتاور امور خیر کی یاد دہانی ) سنتے ہیں ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Celui qui prend un bain le vendredi, comme celui qui est obligatoire après un rapport intime, puis se rend à la mosquée, c’est comme s’il offrait une chamelle en sacrifice. Celui qui vient à la deuxième heure, c’est comme s’il offrait une vache ; à la troisième heure, un bélier cornu ; à la quatrième heure, une poule ; à la cinquième heure, un œuf. Et quand l’imam sort, les anges sont aussi présents et écoutent le rappel d’Allah (le sermon). »",
          "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] -sesuai yang telah dibacakan kepadanya- dari [Sumayy] Maula Abu Bakar, dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mandi seperti mandi janabah pada hari jum'at, kemudian ia pergi ke masjid pada waktu yang pertama, maka pahalanya seperti pahala berkurban seekor unta. Siapa yang pergi ke masjid pada waktu kedua, maka pahalanya seperti berkorban seekor sapi. Dan siapa yang pergi ke masjid pada waktu yang ketiga, maka pahalanya seperti berkurban seekor kambing. Dan siapa yang pergi ke masjid pada waktu yang keempat, maka pahalanya seperti pahala berkorban dengan seekor ayam. Dan siapa yang tiba di masjid pada waktu yang kelima, maka pahalanya seperti berkurban sebutir telur. Apabila imam telah keluar, para malaikat hadir untuk mendengarkan khutbah (dan tidak ada lagi yang mencatat setelah itu)",
          "tr": "Bize Kuteybetü'bü Saîd, Mâlik b. Enes'den, ona da Ebû Bekir'in âzâdlısı Sümeyy'den naklen okunan; Sümeyy'in de Ebû Salih Es-Semmân'dan, onun da Ebû Hureyre'den naklen rivayet ettiği hadîsler cümlesinden olmak üzere şu hadîsi rivayet etti: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Bir kimse cuma günü cünüplükden yıkanır gibi yıkanır da sonra (cuma namazına) giderse bir deve tesadduk etmiş gibi olur; ikinci saatde giderse bir sığır tesadduk etmiş gibi; üçnücü saatde giderse boynuzlu bir koç tesadduk etmiş gibi; dördüncü saatde giderse bir tavuk tesadduk et'miş gibi; beşinci saatde giderse bir yumurta tesadduk etmiş gibi (sevaba nâii) olur. İmam minbere çıktımı artık melekler hutbeyi dinlemeye gelirler.» buyurmuşlar. Bu sayfa’nın devamı niteliğindeki sayfa için buraya tıklayabilirsiniz. Aşağıdaki izah linki bulunduğunuz sayfa’ya aittir, devam sayfaya gitmeden önce aşağıdaki izah’a gitmeniz önerilir, sonrasında Geri gelip devam linkine tıklayın! İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 1965,
      "arabicNumber": "851.01",
      "book": 7,
      "hadithInBook": 15,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، قَالَ ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ ‏.‏ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:If you (even) ask your companion to be quiet on Friday while the Imam is delivering the sermon, you have in fact talked irrelevance",
          "ur": "قتیبہ بن سعید اور محمد بن رمح بن مہاجر نے حدیث بیان کی ، ابن رمح نے کہا : ہمیں لیث نے عقیل بن خالد سے خبر دی انھوں نے بن شہاب سے روایت کی انھوں نے کہا مجھے سعید بن مسیب نے خبر دی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جمعے کے دن جب امام خطبہ دے رہا ہو ( اس وقت ) اگر تم نے اپنے ساتھی سے کہا : خاموش رہو تو تم نے فضول گو ئی کی ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Si tu demandes même à ton voisin de se taire pendant que l’imam fait le sermon du vendredi, tu as dit quelque chose d’inutile. »",
          "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Rumh bin Muhajir] -[Ibnu Rumh]- berkata, telah mengabarkan kepada kami [Laits] dari [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bila kamu berkata kepada temanmu, 'Diamlah, ' pada hari jum'at padahal Imam sedang berkhutbah, maka sungguh telah sia-sialah ibadah Jum'atmu.\" Dan telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Laits] telah menceritakan kepadaku [bapakku] dari [kakekku] Uqail bin Khalid, dari [Ibnu Syihab] dari [Umar bin Abdul Aziz] dari [Abdullah bin Ibrahim bin Qarizh] dan dari [Ibnul Musayyab] bahwa keduanya telah menceritakan kepadanya bahwa [Abu Hurairah] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda. Yakni dengan hadits semisalnya. Dan telah menceritakannya kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dengan dua sanad, yakni semua yang terdapat dalam haditsnya ini adalah serupa dengannya. Hanya saja [Ibnu Juraij] berkata; [Ibrahim bin Abdullah bin Qarizh]",
          "tr": "Bize Kuteybetü'bnü Saîd ile Muhammedü'bnü Rumh b. EI-Muhâcir rivayet ettiler, ibni Rumh Dediki: Bize Leys, Ukayl'den, o da ibni Şihâb'dan naklen haber verdi. (Demişki): Bana Saîdü'bnü'l-Müseyyeb haber verdi. Ona da Ebû Hureyre haber vermişki, Resulullah (Sallallahu Aleyhi ve Sellem) : «Cuma günü imam hutbe okurken arkadaşına (sus!) dedinmi boş yere lakırdı etmiş olursun!» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 1966,
      "arabicNumber": "851.02",
      "book": 7,
      "hadithInBook": 16,
      "text": {
        "arabic": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ، خَالِدٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ، وَعَنِ ابْنِ الْمُسَيَّبِ، أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏.‏ بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "A hadith like this has been narrated by Abu Huraira by another chain of transmitters",
          "ur": "عبد الملک بن شعیب بن لیث نے کہا : مجھ سے میرے والد شعیب نے میرے دادالیث سے حدیث بیان کی انھوں نے کہا : مجھ سے عقیل بن خالد نے ابن شہاب سے انھوں نے عمربن عبد العزیز سے انھوں نے عبد اللہ بن ابرا ہیم بن قارظ سے روایت کی نیز انھوں نے ( ابن شہاب زہری ) نے ابن مسیب سے بھی روا یت کی ان دو نوں ( عمربن عبد العزیز اور سعید بن مسیب ) نے ان ( بن شہاب سے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے سنا ۔ ۔ ۔ ( آگے اسی سند حدیث ) کے مانند ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Un hadith similaire a été rapporté par Abu Huraira رضي الله عنه par une autre chaîne de transmetteurs",
          "tr": "{….} Bana Abdülmelik b. Şuayb b. Leys de rivayet etti. (Dediki): Bana babam, dedem'den rivayet etti. (Demişki): Bana Ukayl b. Hâîid, İbni Şihâb'dan, o da Ömeru'bnü Abdilazîz'den, o da Abdullah b. İbrahim b. Kaariz ile İbni'l-Müseyyeb'den naklen rivayet etti. Onlar da Ebû Hureyre'den rivayet etmişler ki, Ebû Hureyre: «Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken işittim..» diyerek yukarki hadîsin mislini rivayet etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 1967,
      "arabicNumber": "851.03",
      "book": 7,
      "hadithInBook": 17,
      "text": {
        "arabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ، شِهَابٍ بِالإِسْنَادَيْنِ جَمِيعًا فِي هَذَا الْحَدِيثِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّ ابْنَ جُرَيْجٍ قَالَ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ قَارِظٍ ‏.‏",
        "translations": {
          "en": "Ibn Juraij narrated a similar Hadith (as no. 1965) from Ibn Shihab with both chains, except that Ibn Juraij said:\"Ibrahim bin 'Abdullah bin Qariz",
          "ur": "ابن جریج نے کہا : ابن شہاب نے مجھے اس حدیث کی دونوں سندوں کے ساتھ اس حدیث میں اسی کے مانند خبردی البتہ ابن جریج نے ( عبد اللہ بن ابرا ہیم بن قارظ کے بجا ئے ) ابرا ہیم بن عبد اللہ بن قارظ کہا ہے ۔ ( امام مسلم نے نا م کی درستی کے لیے یہ سند بیان کی)",
          "fr": "Rapporté par Ibn Juraij رضي الله عنه : Ibn Juraij a rapporté un hadith similaire (au n°1965) d’après Ibn Shihab avec les deux chaînes, sauf qu’il a dit : « Ibrahim bin Abdullah bin Qariz. »",
          "tr": "{….} Bana, bu hadîsi Muhammed b. Hatim de rivayet etti. (Dediki): Bize Muhammed b. Bekr rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana İbni Şihab iki isnadı ile birden bu hadisin mislini haber verdi. Yalnız İbni Cüreyc: «İbrahim b. Abdîllâh b. Kaariz...» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 1968,
      "arabicNumber": "851.04",
      "book": 7,
      "hadithInBook": 18,
      "text": {
        "arabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ ‏.‏ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغِيتَ ‏\"‏ ‏.‏ قَالَ أَبُو الزِّنَادِ هِيَ لُغَةُ أَبِي هُرَيْرَةَ وَإِنَّمَا هُوَ فَقَدْ لَغَوْتَ ‏.‏",
        "translations": {
          "en": "The same hadith has been narrated by Abu Huraira, but instead of the word laghauta the word laghita has been used. Abu Zinad (one of the narrators) says that laghita is the dialect of Abu Huraira, whereas it is laghauta",
          "ur": "ابو زناد نے عرج سے انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جمعے کے دن جب امام خطبہ دے رہا ہو ( اس وقت ) اگر تم نے اپنے ساتھی سے کہا : خا مو ش رہو تو تم نے ( خود ) شور مچا یا ۔ \"\" ابو زناد نے کہا : یہ ( فقد لغيت ) ابو ہریرہ رضی اللہ تعالیٰ عنہ ( کے قبیلے ) کی لغت ہے جبکہ ( عام مروج لغت ) ( فقد لغوت ) ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le même hadith a été rapporté par Abu Huraira رضي الله عنه, mais au lieu du mot « laghauta », le mot « laghita » a été utilisé. Abu Zinad (un des rapporteurs) dit que « laghita » est le dialecte d’Abu Huraira, alors que c’est « laghauta »",
          "id": "Dan Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila kamu mengatakan kepada temanmu pada hari Jum'at, 'Diamlah, ' padahal Imam sedang berkhutbah, maka sungguh kamu telah berbuat kesia-siaan.\" Abu Zinad berkata; Kata, 'FAQAD LAGHIITA' adalah menurut bahasanya Abu Hurairah, namun yang benar adalah, 'FAQAD LAGHAUTA",
          "tr": "Bize İbni Ebî Ömer dahî rivayet etti. (Dediki): Bize Süfyân, Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Şöyle buyurmuşlar: «Cuma günü imam hutbe okurken arkadaşına (sus!) declinmi lagv yapmış olursun.» Ebû'z-Zinâd; «Bu (lağita) Ebu Hureyre'nin lügatidir. O(nun doğrusu) ancak Iâğavte'dir.» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 1969,
      "arabicNumber": "852.01",
      "book": 7,
      "hadithInBook": 19,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏ \"‏ فِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ زَادَ قُتَيْبَةُ فِي رِوَايَتِهِ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There is a time on Friday at which no Muslim servant would pray and would ask Allah for a thing (that is good) but He would give it to him. Qutaiba pointed with the help of his hand that it (the time) is short",
          "ur": "یحییٰ بن یحییٰ اور قتیبہ بن سعید نے مالک بن انس انھوں نے ابو زناد سے انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعے کا ذکر کرتے ہو ئے فر ما یا : \"\" اس میں ایک گھڑی ہے اس ( گھڑی ) کی موافقت کرتے ہو ئے کو ئی مسلمان بندہ نماز پڑھتے ہو ئے اللہ تعا لیٰ سے جو کچھ بھی مانگتا ہے اللہ تعا لیٰ اسے عطا کر دیتا ہے ۔ قتیبہ نے اپنی روایت میں اضافہ کیا : آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارا فر ما کر اس گھڑی کے قلیل ہو نے کو واضح کیا ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Il y a un moment le vendredi où aucun serviteur musulman ne prie et ne demande une chose bonne à Allah sans qu’Il ne la lui accorde. » Qutaiba a montré de la main que ce moment est court",
          "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] -dalam jalur lain- Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang hari Jum'at, maka beliau bersabda: \"Di dalamnya terdapat satu waktu, tidaklah seorang muslim mendapati waktu itu lalu berdoa memohon kebaikan kepada Allah, kecuali Allah akan mengabulkan permohonannya.\" Qutaibah menambahkan di dalam riwayatnya; Beliau memberikan isyarat dengan tangannya, yakni waktunya sempit",
          "tr": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlîk'e okudum. H. Bize Kuteybetü'bnü Saîd, Mâlik b. Enes'den, o da Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet ettiki, Resulullah (Sallallahu Aleyhi ve Sellem) Cum'â gününü anarak : «Onda öyle bir saat vardır ki, şayet bir müslüman kul namaz kılarken o saate rastlar da, Allah'dan bir şey isterse Allah, ona dilediğini mutlaka verir.» buyurmuşlar. Kuteybe, kendi rivayetinde: «Onun az olduğuna eli ile işarette bulunmuş.» ifâdesini ziyâde etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 1970,
      "arabicNumber": "852.02",
      "book": 7,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لاَ يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ خَيْرًا إِلاَّ أَعْطَاهُ إِيَّاهُ.\" وَقَالَ بِيَدِهِ يُقَلِّلُهَا يُزَهِّدُهَا",
        "translations": {
          "en": "Abu Huraira reported Abu'l-Qasim (the kunya of the Holy Prophet) (ﷺ) as saying:There is a time on Friday at which no Muslim would stand and pray and beg Allah for what Is good but He would give it to him; and he pointed with his hand that (this time) is short and narrow",
          "ur": "ایوب نے محمد سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : ابو القاسم صلی اللہ علیہ وسلم نے فر ما یا : \" بیشک جمعے کے دن میں ایک گھڑی ہے کوئی مسلمان بھی کھڑا نماز پڑھتے ہو ئے اس کی موافقت کر لیتا ( اسے پالیتا ) ہے ( اور ) اللہ تعا لیٰ سے کسی خیر کا سوال کرتا ہے تو اللہ تعا لیٰ اسے وہی ( خیر ) عطا کر دیتا ہے ۔ اور آپ صلی اللہ علیہ وسلم نے ہا تھ سے اس کے قلیل اور کم ہو نے کو بیان کیا ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Abu’l-Qasim (le surnom du Prophète ﷺ) a dit : « Il y a un moment le vendredi où aucun musulman ne se lève pour prier et demander à Allah ce qui est bon sans qu’Il ne le lui accorde. » Et il a montré de la main que ce moment est court et limité",
          "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Abu Hurairah] ia berkata; Abul Qasim shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pada hari Jum'at terdapat satu waktu, tidaklah seorang mukmin mendapati saat itu dengan berdo'a, memohon kebaikan kepada Allah, kecuali Allah akan mengabulkan permohonannya.\" Kemudian beliau memberikan isyarat dengan tangannya, yakni mempersempitnya. Telah menceritakan kepada kami [Ibnul Mutsanna] Telah menceritakan kepada kami [Ibnu Abu Adi] dari [Ibnu Aun] dari [Muhammad] dari [Abu Hurairah] ia berkata; Abul Qasim shallallahu 'alaihi wasallam bersabda: Yakni dengan hadits semisalnya. Dan telah menceritakan kepadaku [Humaid bin Mas'adah Al Bahili] Telah menceritakan kepada kami [Bisyr] yakni Ibnu Mufadldlal, Telah menceritakan kepada kami [Salamah bin Alqamah] dari [Muhammad] dari [Abu Hurairah] ia berkata; Abul Qasim shallallahu 'alaihi wasallam bersabda: Yakni dengan hadits yang semisalnya",
          "tr": "Bize Züheyr b. Harb rivayet etti. (Dediki): Bize İsmâîl b. İbrahim rivayet etti. (Dediki): Bize Eyyûb, Muhammed'den, o da Ebu Hureyre'den naklen rivayet etti, Ebû Hureyre şöyle demiş: Ebû'l-Kaasim «Hakîkaten cum'âda öyle bir saat vardır ki eğer bir müslüman kalkıp namaz kılarken ona rastlar da, Allah'dan bir hayır dilerse, Allah dilediğni ona mutlaka verir.» buyurdular. Ve eliyle onun azlığına, ehemmiyetsizliğine işaret etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 1971,
      "arabicNumber": "852.03",
      "book": 7,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "A hadith like this has been narrated by Abu Huraira",
          "ur": "ابن عون نے محمد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا ابو القاسم صلی اللہ علیہ وسلم نے فر ما یا ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے ما نند ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Un hadith similaire a été rapporté par Abu Huraira رضي الله عنه",
          "tr": "{….} Bize İbnü'l-Müsennâ rivayet etti. (Dediki): Bize İbni Ebî Adiy İbni Avn'dan, o da Muhammed'den, o da Ebû Hureyre'den, naklen rivâyet etti. Ebû Hureyre: «Ebû'l-Kaasîm (Sallallahu Aleyhi ve Sellem) şöyle buyurdu...» diyerek yukarıki hadîsin mislini rivayet etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 1972,
      "arabicNumber": "852.04",
      "book": 7,
      "hadithInBook": 22,
      "text": {
        "arabic": "وَحَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ، حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ مُفَضَّلٍ - حَدَّثَنَا سَلَمَةُ، وَهُوَ ابْنُ عَلْقَمَةَ عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Abu Huraira by another chain of transmitters",
          "ur": "سلمہ بن علقمہ نے محمد سے اورانھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : ابو القاسم صلی اللہ علیہ وسلم نے فر ما یا ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے مانند ہے",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Ce hadith a été rapporté par Abu Huraira رضي الله عنه par une autre chaîne de transmetteurs",
          "tr": "{….} Bana Humeydü'bnü Mes'adete'l-Bâhilî rivayet etti. (Dediki): Bize Bişr (yâni İbni Mufaddâl) rivayet etti. (Dediki): Bize Seleme —ki İbni Alkame dir— Muhammed'den, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre : Ebû'l-Kaasim (Sallallahu Aleyhi ve Sellem) şöyle buyurdu... diyerek yukarki hadîsin mislini rivayet etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 1973,
      "arabicNumber": "852.05",
      "book": 7,
      "hadithInBook": 23,
      "text": {
        "arabic": "وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ، - يَعْنِي ابْنَ مُسْلِمٍ - عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لا يُوَافِقُهَا مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ وَهِيَ سَاعَةٌ خَفِيفَةٌ",
        "translations": {
          "en": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:\"There is a time on Friday at which no Muslim would ask Allah for what is good but He would give it to him.\" And further said: \"This is a very short time",
          "ur": "محمد بن زیاد نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ۔ آپ نے فر ما یا \" جمعے کے دن میں ایک گھڑی ایسی ہے کہ کو ئی مسلمان اللہ تعا لیٰ سے کسی خیر کا سوال کرتے ہو ئے اس کی موافقت نہیں کرتا مگر اللہ تعا لیٰ اسے وہی خیر عطا کر دیتا ہے \" فر ما یا یہ ایک چھوٹی سی گھڑی ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Il y a un moment le vendredi où aucun musulman ne demande à Allah ce qui est bon sans qu’Il ne le lui accorde. » Et il a ajouté : « C’est un moment très court. »",
          "id": "Dan Telah menceritakan kepada kami [Abdurrahman bin Sallam Al Jumahi] Telah menceritakan kepada kami [Ar Rabi'] yakni Ibnu Muslim, dari [Muhammad bin Ziyad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Sesungguhnya pada hari Jum'at terdapat satu waktu, tidaklah seorang mukmin mendapati waktu tersebut dengan berdo'a, memohon kebaikan kepada Allah, kecuali Allah akan mengabulkan permohonannya. Dan waktu itu sangatlah singkat.\" Dan telah menceritakannya kepadaku [Muhammad bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam; namun ia tidak mengatakan; \"Dan saat itu sangatlah sempit",
          "tr": "Bize Abdurrahman b. Sellâm El-cum'ahî rivayet etti. (Dediki): Bize Rabih' (yânî İbni Müslim) Muhammed b. Ziyâd'dan, o da Ebu Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivâyet ettiki, şöyle buyurmuşlar : «Hakikaten cum'âda öyle bir saat vardır kir şayet bir müslüman o saate rastlar da Allah dan bir hayır dilerse Allah onu kendisine mutlaka verir. (Ebu Hureyre): O hafif bir saatdir.. demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 1974,
      "arabicNumber": "852.06",
      "book": 7,
      "hadithInBook": 24,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَلَمْ يَقُلْ وَهِيَ سَاعَةٌ خَفِيفَةٌ ‏.‏",
        "translations": {
          "en": "Hammam b. Munabbih reported this hadith from Abu Huraira who reported from the Messenger of Allah (ﷺ) but he did not say:\" That time is short",
          "ur": "ہمام بن منبہ نے حضڑت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی لیکن انھوں نے ( وهي ساعة خفيفة ) ( وہ ایک چھوٹی سی گھڑی ہے ) نہیں کہا ۔",
          "fr": "Rapporté par Hammam ibn Munabbih رضي الله عنه : Il a rapporté ce hadith d’Abu Huraira رضي الله عنه, qui le tenait du Messager d’Allah ﷺ, mais il n’a pas dit : « Ce moment est court. »",
          "tr": "{….} Bize bu hadîsi Muhammed b. Râfi'de rivayet etti. (Dediki): Bize Abdurrazzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Yalnız: «o, hafif bir saatdir.» cümlesini söylemedi. İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 1975,
      "arabicNumber": "853",
      "book": 7,
      "hadithInBook": 25,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَخْرَمَةَ بْنِ، بُكَيْرٍ ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَسَمِعْتَ أَبَاكَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَأْنِ سَاعَةِ الْجُمُعَةِ قَالَ: قُلْتُ نَعَمْ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الإِمَامُ إِلَى أَنْ تُقْضَى الصَّلاَةُ»",
        "translations": {
          "en": "Abu Burda b. Abu Musa al-Ash'ari reported:'Abdullah b. Umar said to me: Did you hear anything from your father narrating something from the messenger of Allah (ﷺ) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah (ﷺ) (these words):\" It is between the time when the Imam sits down and the end of the prayer",
          "ur": "ابو بردہ بن ابی مو سیٰ اشعری رضی اللہ تعالیٰ عنہ سے روا یت ہے کہا : مجھ سے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : کیا تم نے اپنے والد کو جمعے کی گھڑی کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کرتے ہو ئے سنا ہے ؟کہ کہا : میں نے کہا : جی ہاں میں نے انھیں یہ کہتے سنا ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ فر ما رہے تھے : \" یہ امام کے بیٹھنے سے لے کر نماز مکمل ہو نے تک ہے ۔",
          "fr": "Rapporté par Abu Burda ibn Abu Musa al-Ash’ari رضي الله عنه : Abdullah ibn Umar رضي الله عنه m’a dit : « As-tu entendu ton père rapporter quelque chose du Messager d’Allah ﷺ au sujet du moment du vendredi ? » J’ai répondu : « Oui, je l’ai entendu dire du Messager d’Allah ﷺ : “Ce moment se situe entre le moment où l’imam s’assoit et la fin de la prière.” »",
          "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Ali bin Khasyram] keduanya berkata, telah mengabarkan kepada kami [Ibnu Wahb] dari [Makhramah bin Bukair] -dalam jalur lain- Dan telah menceritakan kepada kami [Harun bin Sa'id Al Aili] dan [Ahmad bin Isa] keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Makhramah] dari [bapaknya] dari [Abu Burdah bin Abu Musa Al Asy'ari] ia berkata; Abdullah bin Umar bertanya padaku, \"Apakah kamu pernah mendengar [ayahmu] meriwayatkan hadits dari Rasulullah shallallahu 'alaihi wasallam perihal satu waktu (yang mustajab) pada hari Jum'at?\" Abu Burdah berkata; Saya menjawab, \"Ya, aku mendengarnya berkata: Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Waktunya ialah antara imam duduk (di mimbar) hingga selesai shalat Jum'at",
          "tr": "Bana Ebu't-Tâhir ile Alîyyü'bnü Haşrem rivayet ettiler. Dedilerki: Bize İbni Vehb, Mahrametü'bnü Bükeyr'den naklen haber verdi. H. Bize Hârûn b. Saîd EI-Eyîî ile Ahmed b. îsâ da rivayet ettiler. Dedilerki: Bize Vehb rivayet etti. (Dediki) : Bize Mahrame, babasından, o da Ebû Bürdete'bnü Ebû Mûse'l-Eş'arî'den naklen haber verdi. Şöyle demiş: Bana, Abdullah b. Ömer: — «Babanın cum'a saati hakkında Resulullah (Sallallahu Aleyhi ve Sellem)'den hadîs rivayet ettiğini işittinmi?» dedi. Ben: — Evet, babamı şöyle derken işittim dedim: Resulullah (Sallallhu Aleyhi ve Sellem)'i: «İcabet saati, imamın (minber üzerinde) oturması ile namazın edâ edilmesi arasındadır.» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 1976,
      "arabicNumber": "854.01",
      "book": 7,
      "hadithInBook": 26,
      "text": {
        "arabic": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ الأَعْرَجُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The best day on which the sun has risen is Friday; on it Adam was created, on it he was made to enter Paradise, on it he. was expelled from it",
          "ur": "ابن شہاب نے کہا : مجھے عبد الرحمٰن اعرج نے خبر دی انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بہترین دن جس پر سورج طلوع ہو تا ہے جمعے کا دن ہے اسی دن آدم ؑپیدا کیے گئے اور اسی دن جنت میں داخل کیے گئے اور اسی دن اس سے نکا لے گئے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Le meilleur jour sur lequel le soleil s’est levé est le vendredi : c’est ce jour-là qu’Adam a été créé, qu’il est entré au Paradis et qu’il en a été expulsé. »",
          "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abdurrahman bin Al A'raj] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hari adalah hari Jum'at, karena pada hari itulah Adam diciptakan. Pada hari itu pula ia dimasukkan ke dalam surga dan pada hari itu pula ia dikeluarkan daripadanya",
          "tr": "Bana harmeletü'bnü Yahya rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihâb'dan naklen haber verdi. (Demişki): Bana Abdurrahmân EI-A'rac haber verdi ki, Ebû Hureyre'yi şöyle derken işitmiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Üzerine güneş doğan en hayırlı gün cum'a günüdür. (Zîra) Âdem o gün cennetden çıkarıldı.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 1977,
      "arabicNumber": "854.02",
      "book": 7,
      "hadithInBook": 27,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلاَ تَقُومُ السَّاعَةُ إِلاَّ فِي يَوْمِ الْجُمُعَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported the Messenger of Allah (ﷺ) as saying:The best day on which the sun has risen is Friday; on it Adam was created. on it he was made to enter Paradise, on it he was expelled from it. And the last hour will take place on no day other than Friday",
          "ur": "ابو زناد نے اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے رو یت کی کہ نبی کریم صلی اللہ علیہ وسلم نے فر ما یا : بہترین دن جس میں سورج نکلتا ہے جمعے کا ہے اسی دن آدم ؑکو پیدا کیا گیا تھا اور اسی دن انھیں جنت میں داخل کیا گیا اور اسی میں انھیں اس سے نکا لا گیا ( خلا فت ارضی سونپی گئی ) اور قیامت بھی جمعے کے دن ہی بر پاہو گی ۔ \" صالح مومنوں کے لیے یہ انعام عظیم حا صل کرنے کا دن ہو گا ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Le meilleur jour sur lequel le soleil s’est levé est le vendredi : c’est ce jour-là qu’Adam a été créé, qu’il est entré au Paradis et qu’il en a été expulsé. Et l’Heure finale n’aura lieu qu’un vendredi. »",
          "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Al Mughirah] yakni Al Hizami, dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hari adalah hari Jum'at, karena pada hari itulah Adam diciptakan. Pada hari itu pula ia dimasukkan ke dalam surga dan pada hari itu pula ia dikeluarkan daripadanya. Dan hari kiamat tidak terjadi kecuali pada hari Jum'at",
          "tr": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Muğîre (yâni El-Nizamî) Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) : «Üzerine güneş doğan en hayırlı gün cum'a günüdür. Âdem o gün yaratıldı; o gün cennete konuldu ve o gün cennetden çıkarıldı. Kıyamet de ancak cum'a günü kopacakdır.» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 1978,
      "arabicNumber": "855.01",
      "book": 7,
      "hadithInBook": 28,
      "text": {
        "arabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَحْنُ الآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّ كُلَّ أُمَّةٍ أُوتِيَتِ الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ ثُمَّ هَذَا الْيَوْمُ الَّذِي كَتَبَهُ اللَّهُ عَلَيْنَا هَدَانَا اللَّهُ لَهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:We who are the last shall be the first on the Day of Resurrection, except that every Ummah was given the Book before us and we were given it after them. It was this day which Allah prescribed for us and guided us to it and the people came after us with regard to it, the Jews observing the next day and the Christians the day following that",
          "ur": "عمر و ناقد نے کہا : ہمیں سفیان بن عیینہ نے ابو زناد سے حدیث سنا ئی انھوں نے اعرج سے اور انھوں نے حجرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم سب سے آخری ہیں اور قیامت کے دن سب سے پہلے ہو ں گے یہ اس کے باوجود ہے کہ ہر امت کو کتاب ہم سے پہلے دی گئی اور ہمیں ( ہماری کتاب ) ان کے بعد دی گئی پھر یہ دن جسے اللہ تعالیٰ نے ہمارے لئے لکھ دیا تھا اللہ تعا لیٰ نے اس کے لیے ہماری رہنما ئی فر ما ئی لو گ اس معاملے میں ہمارے بعد ہیں یہود کل ( جمعے سے اگلا دن یعنی ہفتہ منا ئیں گے ) اور نصاریٰ پرسوں ( ہفتےسے اگلا دن اتوار کا منا ئیں گے ۔)",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Nous qui sommes les derniers, nous serons les premiers au Jour de la Résurrection. Chaque communauté a reçu le Livre avant nous et nous l’avons reçu après eux. C’est ce jour qu’Allah nous a prescrit et vers lequel Il nous a guidés, et les gens sont venus après nous à ce sujet : les Juifs observent le jour suivant et les Chrétiens le jour d’après. »",
          "id": "Dan Telah menceritakan kepada kami [Amru An Naqid] Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah umat yang terakhir (datang ke dunia), tetapi kita adalah umat yang terdahulu (diadili) pada hari kiamat. Padahal seluruh umat telah diberi kitab sebelum kita, sedangkan kita (diberi kitab) setelah mereka. Kemudian pada hari ini, yakni hari yang telah ditetapkan oleh Allah untuk kita, Allah telah memberikan petunjuk kepada kita. Dan umat-umat lain terkait dengan hari itu adalah pengikut, bagi orang-orang Yahudi adalah esok, sementara bagi orang-orang Nasrani adalah esok lusa.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Zinad] dari [Al A'raj] dari [Abu Hurairah] dan [Ibnu Thawus] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah umat yang terakhir (datang ke dunia), tetapi kita adalah umat yang terdahulu (diadili) pada hari kiamat.\" Yakni dengan hadits semisalnya",
          "tr": "Bize Amru'n-Nâkıd rivayet etti. (Dediki): Bize Süfyân b. Uyeyne, Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Bizler en son gelenleriz; ama kıyamet gününde herkesi geçenler de biz olacağız. Şu kadar var ki her ümmete kitap bizden önce verilmiş, bize onlardan sonra verilrorşdir. Sonra Allah'ın bize farz kıldığı şu gün yok mu! Allah bizi ona hidâyet buyurmuştur. Sâir İnsanlar bu husûsda bize tabidirler. Yahudilerin bayramı yârın, hıristiyanlartnki ise öbür göndür, buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 1979,
      "arabicNumber": "855.02",
      "book": 7,
      "hadithInBook": 29,
      "text": {
        "arabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، وَابْنِ طَاوُسٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَحْنُ الآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "A hadith like this has been narrated by Abu Huraira that the Messenger of Allah (ﷺ) said:We are the last and would be the first on the Day of Resurrection",
          "ur": "ابن ابی عمر نے کہا : ہمیں سفیان نے ابو زناد سے حدیث سنا ئی انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی نیز ( سفیان نے عبد اللہ ) بن طاوس سے انھوں نے اپنے والد ( طاوس بن کیسان ) سے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم سب کے بعد آنے والے ہیں اور قیامت کے دن ہم سب سے پہلے ہو ں گے ۔ ۔ ۔ \" اسی ( مذکورہ با لا حدیث ) کے مانند ہے",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Un hadith similaire a été rapporté par Abu Huraira رضي الله عنه, où le Messager d’Allah ﷺ a dit : « Nous sommes les derniers et nous serons les premiers au Jour de la Résurrection. »",
          "tr": "{….} Bize İbni Ebî Ömer rivayet etti. (Dediki): Bize Süfyân, Ebu'z-Zinâd'dan, o da A'rac'dan, o da Ebû Hureyre'den; bir de (yine Ebu'z-Zinad) İbni Tâvûs'dan o da babasından, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre: Resûlullah (Sailallahu Aleyhi ve Sellem): Bizler en son gelenleriz; ama kıyamet gününde herkesi geçenler de biz olacağız...» buyurdular., diyerek hadisi yukarki gibi rivayet etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 1980,
      "arabicNumber": "855.03",
      "book": 7,
      "hadithInBook": 30,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَحْنُ الآخِرُونَ الأَوَّلُونَ يَوْمَ الْقِيَامَةِ وَنَحْنُ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ فَاخْتَلَفُوا فَهَدَانَا اللَّهُ لِمَا اخْتَلَفُوا فِيهِ مِنَ الْحَقِّ فَهَذَا يَوْمُهُمُ الَّذِي اخْتَلَفُوا فِيهِ هَدَانَا اللَّهُ لَهُ - قَالَ يَوْمُ الْجُمُعَةِ - فَالْيَوْمُ لَنَا وَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:We are the last (but) we would be the first on the Day of Resurrection, and we would be the first to enter Paradise, but that they were given the Book before us and we were given after them. They disagreed and Allah guided us aright on whatever they disagreed regarding the truth. And it was this day of theirs about which they disagreed, but Allah guided us to it, and that is Friday for us; the next day is for the Jews and the day following for the Christians",
          "ur": "ابو صالح نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم آخری ہیں ( پھر بھی ) قیامت کے دن پہلے ہو ں گے اور ہم ہی پہلے جنت میں داخل ہوں گے البتہ انھیں ( انکی ) کتاب ہم سب سے پہلے دی گئی اور ہمیں ( ہماری کتاب ) ان کے بعد دی گئی انھوں نے ( آپس میں ) اختلا ف کیا اور اللہ تعا لیٰ نے ہماری اس حق کی طرف رہنما ئی فر ما ئی جس میں انھوں نے اختلا ف کیا تھا یہ ( جمعہ ) ان کا وہی دن تھا جس کے بارے میں انھوں نے اختلا ف کیا اللہ تعا لیٰ نے ہمیں اس کی طرف رہنما ئی کردی ۔ ۔ ۔ راوی نے کہا : جمعے کا دن مرادہے ۔ ۔ آج کا دن ہمارا ہے اور کل کا دن یہودیوں کا ہے اس سے اگلا دن عیسائیوں کا ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Nous sommes les derniers, mais nous serons les premiers au Jour de la Résurrection, et nous serons les premiers à entrer au Paradis. Pourtant, le Livre leur a été donné avant nous et il nous a été donné après eux. Ils se sont disputés, et Allah nous a guidés vers la vérité sur ce sujet. C’est ce jour-là à propos duquel ils se sont opposés, mais Allah nous a guidés vers lui : pour nous, c’est le vendredi ; le jour suivant est pour les Juifs et celui d’après pour les Chrétiens. »",
          "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Zuhair bin Harb] keduanya berkata, telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah yang terakhir (datang ke dunia), tetapi yang terdahulu (diadili) pada hari kiamat. Kita adalah yang paling dahulu masuk surga, padahal mereka diberi kitab lebih dahulu dari kita, sedangkan kita sesudah mereka. Lalu mereka berselisih, kemudian Allah memberikan petunjuk kepada kita, yakni kebenaran dari apa yang mereka perselisihkan. Inilah hari yang mereka perselisihkan, sedangkan Allah telah menunjukkannya kepada kita.\" Beliau bersabda lagi: \"Maka hari ini (Jum'at) adalah untuk kita. Esok (hari Sabtu) untuk kaum Yahudi, dan lusa (Ahad) untuk kaum Nasrani",
          "tr": "Bize Kuteybetü'bnü Said ile Züheyr b. Harb rivayet ettiler. Dedilerki: Bize Cerîr, A'meş'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Bizler (dünyâda) en sonra gelenler, kıyamet gününde en öne geçecekleriz. Cennete ilk girenler de biz olacağız : Şu kadar varki onlara kitap bizden önce, bize onlardan sonra verildi. Onlar ihtilâfa düştüler. Bizi ise Allah, onlar ihtilâf ettikleri hakka hidâyet buyurdu. İşte bu gün onların hakkında ihtilâfa düştükleri gündür. Allah bizi, ona (yânı cum'a gününe) hidâyet buyurdu. Binâenaleyh bu gün bizim, yârın yahudilerin, yârından sonraki günde hıristiyanlanndır.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 1981,
      "arabicNumber": "855.04",
      "book": 7,
      "hadithInBook": 31,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَخِي وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ وَهَذَا يَوْمُهُمُ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ لَهُ فَهُمْ لَنَا فِيهِ تَبَعٌ فَالْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Muhammad, the Messenger of Allah (ﷺ), as saying:We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that",
          "ur": "وہب بن منبہ کے بھا ئی ہمام بن منبہ نے کہا : یہ حدیث ہے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم سے بیان کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ہم آخری ہیں ( مگر ) قیامت کے دن سبقت لے جا نے والے ہو ں گے اس کے باوجود کہ ان کے بعد دی گئی اور یہ ( جمعہ ) ان کا وہی دن ہے جو ان پر فرض کیا گیا تھا اور وہ اس کے بارے میں اختلاف میں پڑگئے پھر اللہ تعا لیٰ نے اس کے بارے میں ہماری رہنمائی فر ما ئی اس لیے وہ لو گ اس ( عبادت کے دن کے ) معاملے میں ہم سے پیچھے ہیں یہود ( اپنا دن ) کل منا ئیں گے اور عیسا ئی پر سوں ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Muhammad, le Messager d’Allah ﷺ, a dit : « Nous qui sommes les derniers, nous serons les premiers au Jour de la Résurrection. Mais les autres communautés ont reçu le Livre avant nous, et nous l’avons reçu après eux. Ce jour leur avait été prescrit, mais ils se sont opposés à son sujet. Allah nous a guidés vers ce jour, et ils sont venus après nous à ce sujet : les Juifs observent le jour suivant, et les Chrétiens celui d’après. »",
          "id": "Dan Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] saudaranya Wahb bin Munabbih, ia berkata, telah menceritakan kepada kami [Abu Hurairah] dari Muhammad shallallahu 'alaihi wasallam, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita (umat Muhammad) adalah yang terakhir (datang ke dunia), tetapi yang terdahulu (diadili) pada hari kiamat. Padahal mereka diberi kitab lebih dahulu dari kita, sedangkan kita sesudah mereka. Dan hari ini (Jum'at) adalah hari yang telah diwajibkan atas mereka, namun mereka berselisih tentangnya. Kemudian Allah menunjukkannya pada kita. Karena itu, umat-umat lain terkait dengan hari Jum'at adalah pengikut. Bagi kaum Yahudi, besok. Sedangkan bagi kaum Nasrani lusa",
          "tr": "Bize Muhammed b. Rafi' rivayet etti. (Dediki): Bize Abdurrazzâk rivayet etti. (Dediki): Bize Ma'mer, Vehb b. Münebbih'in kardeşi Hemmâm b. Münebbih'den naklen haber verdi. Hemmâm şöyle demiş: Ebû Hureyre'nin, Allah'ın. Resulü Muhammed (Sallallahu Aleyhi ve Sellem)'den bize rivayet ettiği şudur: Dediki: Resulullah (Sallallahu Aleyhi ve Sellem): «Bizler (dünyâda) en sonra gelenler, kıyamet gününde en öne geçecekleriz. Şu kadar var ki onlara bizden önce, bize ise onlardan sonra kitap verilmişdir. İşte bu gün onlara farz kılınıp da, hakkında ihtilâfa düştükleri gündür. Allah bizi bu güne hidâyet buyurdu. Binâenaleyh bu husûsda onlar bize tâbidir. Yahudilerin bayramı yarın, hıristiyanlarınki ise öbür gündür.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 1982,
      "arabicNumber": "856.01",
      "book": 7,
      "hadithInBook": 32,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَوَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِي مَالِكٍ، الأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَضَلَّ اللَّهُ عَنِ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الأَحَدِ فَجَاءَ اللَّهُ بِنَا فَهَدَانَا اللَّهُ لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالأَحَدَ وَكَذَلِكَ هُمْ تَبَعٌ لَنَا يَوْمَ الْقِيَامَةِ نَحْنُ الآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلاَئِقِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ وَاصِلٍ الْمَقْضِيُّ بَيْنَهُمْ ‏.‏",
        "translations": {
          "en": "It is narrated by Abu Huraira and Huraira that the Messenger of Allah (ﷺ) said:It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them",
          "ur": "ابو کریب اور واصل بن عبدالاعلیٰ نے کہا : ہم سے ابن فضیل نے ابومالک اشجعی ( سعد بن طارق ) سے حدیث بیان کی ، انھوں نے ابو حازم سے اورانھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز انھوں ( ابو مالک ) نے ربعی بن حراش سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، ان دونوں ( صحابیوں ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو لوگ ہم سے پہلے تھے اللہ تعالیٰ نے انھیں جمعہ کی راہ سے ہٹادیا ، اس لئے یہود کے لئے ہفتے کا دن ہوگیا اور نصاریٰ کے لئے اتوار کا دن ۔ پھراللہ تعالیٰ نے ہمیں ( اس دنیا میں لایا ) اور جمعے کے دن کی طرف ہماری راہنمائی فرمادی ۔ اس نے جمعہ پھر ہفتہ پھر اتوار رکھا ( جس طرح وہ عبادت کے دنوں میں ہم سے پیچھے ہیں ) اسی طرح قیامت کے دن بھی ہم سے پیچھے ہوں گے ۔ اہل دنیا میں سے ہم سب کے بعد ہیں اور قیامت کےدن سب سے پہلے ہوں گے ۔ جن کا فیصلہ ( باقی ) مخلوقات سے پہلے کردیا جائے گا ۔ \"\" واصل کی روایت میں ( المقضي لهم کی جگہ ) المقضي بينهم ( جن کے درمیان فیصلہ ) ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه et Huraira : Le Messager d’Allah ﷺ a dit : « C’est du vendredi qu’Allah a détourné ceux qui étaient avant nous. Pour les Juifs, le jour réservé à la prière était le samedi, et pour les Chrétiens, c’était le dimanche. Allah s’est tourné vers nous et nous a guidés vers le vendredi comme jour de prière. En réalité, Allah a fait du vendredi, du samedi et du dimanche des jours de prière. Dans cet ordre, ils (les Juifs et les Chrétiens) viendront après nous au Jour de la Résurrection. Nous sommes les derniers des communautés dans ce monde, mais les premiers parmi les créatures à être jugés au Jour de la Résurrection. » Dans une autre version : « ... à être jugés parmi eux. »",
          "id": "Dan telah menceritakan kepada kami [Abu Kuraib] dan [Washil bin Abdul A'la] keduanya berkata, telah menceritakan kepada kami [Ibnu Fudlail] dari [Abu Malik Al Asyja'i] dari [Abu Hazim] dari [Abu Hurairah] dari [Rab'i bin Hirasy] dari [Hudzaifah] keduanya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menyesatkan orang-orang yang sebelum kita tentang hari Jumat. Bagi orang Yahudi jatuhnya pada hari Sabtu, dan bagi orang Nasrani jatuhnya pada hari Ahad. Lalu Allah menunjuki kita yaitu pada hari Jum'at. Karena itu, terjadilah berturut-turut tiga hari berkumpul (hari besar), yaitu Jum'at, Sabtu dan Ahad. Hari kiamat kelak, mereka pun mengikuti kita juga, kita yang terakhir ke dunia, tetapi kitalah yang lebih dahulu diadili sebelum umat-umat yang lain.\" Sementara dalam riwayat Washil; \"Yang diadili di antara mereka.\" Telah menceritakan kepada kami [Abu Kuraib] telah mengabarkan kepada kami [Ibnu Abu Za`idah] dari [Sa'd bin Thariq] telah menceritakan kepadaku [Rib'i bin Hirasy] dari [Hudzaifah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita ditunjukkan dengan hari Jum'at, sementara Allah telah menyesatkan umat-umat sebelum kita darinya.\" Dan ia pun menyebutkan hadits yang semakna dengan hadits Ibnu Fudlail",
          "tr": "Bize Ebû Kureyb ile Vâsıl b. Abdila'lâ rivayet ettiler. Dedilerki: Bize Fudayl, Ebû Mâlik-i Eşcaî'den, o da Ebû Hâzim'den, o da Ebû Hureyre'den bir de Rib'î b. Hirâş'dan, o da Huzeyfe'den naklen rivayet etti. Ebû Hureyre ile Huzeyfe şöyle demişler: Resulullah (Sallallahu Aleyhi ve Sellem) : «Bizden önce geçenleri Allah cum'â'dan şaşırtmışdır. Bu sebeple yahudîlerin günü : cum'artesi, hıristiyanların da pazar olmuştur. Sonra Allah, bizi dünyâya getirmiş ve bize cum'a gününü bulmaya hidâyet vermişdir. Bu suretle cum'a cum'artesi ve pazar günlerini (ibâdet içinî va'z etmişdir. Yine böyle kıyamet gününde onlar bize tâbi olacaklardır. Biz dünyâ ehlinin en sona kalanlarıyız; fakat kıyamet gününde, en başta bulunanlar ve bütün kullardan önce kendilerine hüküm verilenleriz.» buyurdular. Vasıl'in rivayetinde «Aralarında hüküm verilecek.» ibaresi vardır)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 1983,
      "arabicNumber": "856.02",
      "book": 7,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ سَعْدِ بْنِ طَارِقٍ، حَدَّثَنِي رِبْعِيُّ بْنُ، حِرَاشٍ عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ هُدِينَا إِلَى الْجُمُعَةِ وَأَضَلَّ اللَّهُ عَنْهَا مَنْ كَانَ قَبْلَنَا ‏\"‏ ‏.‏ فَذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ فُضَيْلٍ ‏.‏",
        "translations": {
          "en": "Huraira reported Allah's Messenger (ﷺ) as saying:We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same",
          "ur": "ابن ابی زائدہ نے ( ابومالک ) سعد بن طارق سے خبر دی ، انھوں نے کہا : ربعی بن حراش نے مجھے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نےکہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہماری راہنمائی جمعے کی طرف کی گئی اور جو لوگ ہم سے پہلے تھے ان کو اللہ تعالیٰ نے ا س سےدوسری راہ پر لگادیا ۔ ۔ ۔ \" آگے ابن فضیل کے ہم معنی حدیث بیان کی ۔",
          "fr": "Rapporté par Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Nous avons été guidés vers le vendredi comme jour de prière et de recueillement, alors qu’Allah a détourné ceux qui étaient avant nous de ce jour. » Le reste du hadith est identique",
          "tr": "Bize Ebû Kureyb rivayet etti. (Dediki): Bize İbni Ebî Zaide, Sa'd b. Târık'dan, naklen haber verdi. (Demişki): Bana Rib'î b. Hırâş, Huzeyfe'den rivayet etti. Huzeyfe şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Biz, cum'âyı bulmağa hidâyet olunduk; ama bizden önce geçenlere Allah onu şaşırttı...» buyurdular, diyerek ibni Fudayl hadîsi mânâsında rivâyetde bulunrmışdur. İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 1984,
      "arabicNumber": "850.02",
      "book": 7,
      "hadithInBook": 34,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو عَبْدِ اللَّهِ، الأَغَرُّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلاَئِكَةٌ يَكْتُبُونَ الأَوَّلَ فَالأَوَّلَ فَإِذَا جَلَسَ الإِمَامُ طَوَوُا الصُّحُفَ وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي الْبَدَنَةَ ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً ثُمَّ كَالَّذِي يُهْدِي الْكَبْشَ ثُمَّ كَالَّذِي يُهْدِي الدَّجَاجَةَ ثُمَّ كَالَّذِي يُهْدِي الْبَيْضَةَ»",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg",
          "ur": "ابوعبداللہ اغر نے خبر دی کہ انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایاجب جمعے کا دن ہوتا ہے تو مسجد کے دروازوں میں سے ہر دروازے پر فرشتے ہوتے ہیں جو ( آنے والوں کی ترتیب کے مطابق ( پہلے پھر پہلے کا نام لکھتے ہیں ، اور جب امام ( منبر پر ) بیٹھ جاتا ہے تو وہ ( ناموں والے ) صحیفے لپیٹ دیتے ہیں اورآکرذکر ( خطبہ ) سنتے ہیں ۔ اور گرمی میں ( پہلے ) آنے والے کی مثال اس انسان جیسی ہے جو اونٹ قربان کرتا ہےپھر ( جو آیا ) گویا وہ گائے قربان کردیتا ہے ۔ پھر ( جو آیا ) گویا وہ مینڈھا قربان کردیتاہے ، پھر ( جو آیا ) گویا وہ تقرب کے لئے مرغی پیش کرتاہے پھر ( جو آیا ) گویا وہ تقریب کے لئے انڈا پیش کرتا ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Le vendredi, les anges se tiennent à chaque porte de la mosquée et inscrivent les gens selon leur ordre d’arrivée. Quand l’imam s’assoit sur le minbar pour prononcer le sermon, ils referment leurs registres et écoutent le rappel d’Allah. Celui qui arrive tôt est comme quelqu’un qui offre une chamelle en sacrifice, puis celui qui vient après est comme s’il offrait une vache, puis un bélier, puis une poule, puis un œuf. »",
          "id": "Dan telah menceritakan kepadaku [Abu Thahir] dan [Harmalah] dan [Amru bin Sawwad Al Amiri] - [Abu Thahir] berkata- telah menceritakan kepada kami -sementara yang lain mengatakan- telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Abdullah Al Agharr] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila hari Jum'at telah tiba, para Malaikat berdiri di setiap pintu Masjid, mencatat orang yang pertama-tama datang dan seterusnya. Apabila Imam telah datang (naik mimbar), maka mereka pun menutup shuhuf (buku catatan) dan bersegera untuk mendengarkan khutbah. Perumpamaan orang yang pertama-tama datang adalah seperti berkorban dengan seekor unta. Kemudian orang yang datang sesudah itu, seperti orang yang berkurban dengan seekor lembu. Kemudian seperti orang yang berkurban kibas. Kemudian seperti orang yang berkurban dengan seekor ayam. Dan kemudian seperti orang yang berkurban dengan sebutir telur.\" Telah menceritakan kepada kami [Yahya bin Yahya] dan [Amru An Naqid] dari [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam semisalnya",
          "tr": "Bana Ebû't-Tâhir ile Harmele ve Amru'bnü Sevvâd El-Âmiri rivayet ettiler. Ebû't-Tâhir (bize rivayet etti.) tâbirini kullandı.. Ötekiler: (Bize İbni Vehb haber verdi.) dediler, (İbni Vehb demişki:) Bana Yûnus, İbni Şihâb'dan naklen haber verdi. (Demişkî) Bana Ebû Abdillâh EI-Eğarr haber verdiki, kendisi Ebû Hureyre'yî şöyle derken işitmiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «cum'a günü oldumu mescidin bütün kapılarında melekler bulunur. Bunlar evvel beevel gelenleri yazarlar. İmam (minbere) oturduğu vakit sahifeleri dürerler de, hutbeyi dinlemeğe gelirler. Evvel gelen bir deve kurban etmiş gibi olur; ondan sonra gelen, inek kurban eîmiş gibi; ondan sonra gelen koç kurban etmiş gibi; ondan sonra gelen tavuk kurban etmiş gibi; ondan sonra gelen de yumurta kurban etmiş gibi olur.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 1985,
      "arabicNumber": "850.03",
      "book": 7,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Abu Huraira through another chain of transmitters",
          "ur": "سعید ( بن مسیب ) نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی ( سابقہ حدیث ) کے مانند روایت کی ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه à travers une autre chaîne de transmetteurs",
          "tr": "{….} Bize Yahya b. Yahya ile Amru'n-Nâkıd, Süfyân'dan, o da Zührî'den, o da Saîd'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem) 'den naklen yukarki hadîsin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 1986,
      "arabicNumber": "850.04",
      "book": 7,
      "hadithInBook": 36,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَكٌ يَكْتُبُ الأَوَّلَ فَالأَوَّلَ - مَثَّلَ الْجَزُورَ ثُمَّ نَزَّلَهُمْ حَتَّى صَغَّرَ إِلَى مَثَلِ الْبَيْضَةِ - فَإِذَا جَلَسَ الإِمَامُ طُوِيَتِ الصُّحُفُ وَحَضَرُوا الذِّكْرَ ‏\"‏ ‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There is an angel on every door of the mosque recording him first who (comes) first (to the mosque for Friday prayer). And he [the Prophet] likened him to one who offers a camel as a sacrifice and then he went on in the descending order till he reached the point at which the minimum (sacrifice) is that of an egg. And when the Imam sits (on the pulpit) the sheets are folded and they (the angels) attend to the mention of Allah",
          "ur": "سہیل کے والد ابو صالح سمان نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسجد کے دروازوں میں سے ہر ایک دروازے پر ایک فرشتہ ہوتاہے جو پہلے پھر پہلے آنے والے کا نام لکھتا ہے ۔ آپ نے اونٹ کی قربانی کی مثال دی ، پھر بتدریج کم کرتے گئے یہاں تک کہ ( آخر میں ) انڈے جیسے چھوٹے ( صدقے ) کی مثال دی ۔ پھر جب امام منبر پر بیٹھ جاتا ہے تو ( اندراج کے ) صحیفے لپیٹ دیئے جاتے ہیں اور ( فرشتے ) ذکر ونصیحت ( سننے ) کے لئے حاضر ہوجاتے ہیں ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Il y a un ange à chaque porte de la mosquée qui inscrit le premier arrivé pour la prière du vendredi. » Et il ﷺ a comparé cette personne à celle qui offre un chameau en sacrifice, puis il a continué en décrivant des sacrifices de plus en plus petits jusqu’à mentionner que le minimum est un œuf. Et lorsque l’imam s’assoit sur la chaire, les registres sont refermés et les anges écoutent le rappel d’Allah",
          "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di setiap pintu Masjid terdapat Malaikat yang akan mencatat orang yang pertama kali datang dan seterusnya. Beliau mempermisalkan mereka seperti orang berkurban dengan seekor unta, kemudian diturunkannya lagi hingga seperti seorang yang berkurban dengan sebutir telur. Dan ketika Imam telah duduk, maka shuhuf (lembaran catatan) ditutup, dan para Malaikat pun menyimak khutbah",
          "tr": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Yakûb (yânî İbni Abdirrahmân) Süheyl'den, o da babasından, o da Ebû Hueyre'den naklen rivayet ettiki, Resulullah (Sallallahu Aleyhi ve Sellem}: «Mescidin her kapısının üzerinde, evvel beevvel gelenleri yazan bir melek vardır. (Resulullah (Sallallahu Aleyhi ve Sellem) evvelâ deve kurban etmekle temsil yapmış. Sonra gelenlerin derecelerini indire İndire yumurta kadar küçültmüş). İmam minber üzerine oturunca sahîfeler dürülür ve melekler hutbe dinlemeğe gelirler.» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 1987,
      "arabicNumber": "857.01",
      "book": 7,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اغْتَسَلَ ثُمَّ أَتَى الْجُمُعَةَ فَصَلَّى مَا قُدِّرَ لَهُ ثُمَّ أَنْصَتَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ثُمَّ يُصَلِّيَ مَعَهُ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى وَفَضْلَ ثَلاَثَةِ أَيَّامٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu-Huraira reported Allah's Apostle (ﷺ) as saying:He who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more",
          "ur": "سہیل نے اپنے والد ( ابو صالح ) سے ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کہ آپ نے فرمایا : \" جس نے غسل کیا ، پھر جمعے کے لئے حاضر ہوا ، پھر اس کے مقدر میں جتنی ( نفل ) نماز تھی پڑھی ، پھر خاموشی سے ( خطبہ ) سنتا رہا حتیٰ کہ خطیب اپنے خطبے سے فارغ ہوگیا ، پھر اس کے ساتھ نماز پڑھی ، اس کے اس جمعے سے لے کر ایک اور ( پچھلے یا اگلے ) جمعے تک کے گناہ بخش دیے جاتے ہیں اور مزید تین دنوں کے بھی ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Celui qui prend un bain, puis vient pour la prière du vendredi, prie ce qui lui est prescrit, reste silencieux jusqu’à la fin du sermon de l’imam, puis prie avec lui, ses péchés entre ce vendredi et le suivant seront pardonnés, et même trois jours de plus. »",
          "id": "Telah menceritakan kepada kami [Umayyah bin Bistham] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Rauh] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang mandi kemudian mendatangi Jum'at, lalu ia shalat semampuannya dan diam (mendengarkan khutbah) hingga selesai, kemudian ia lanjutkan dengan shalat bersama Imam, maka ia akan diampuni (dosa-dosa yang dilakukannya) antara hari itu dan hari jum'at yang lain. Dan bahkan hingga lebih tiga hari",
          "tr": "Bize Ümeyyetü'bnü Bistâm rivayet etti. (Dediki): Bize Yezîd (yânî ibni Zürey') rivayet etti (Dediki): Bize Ravh, Süheyl'den, o da babasından, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. Şöyle buyurmuşlar: «Bir kimse gusûl eder, sonra cum'aya gelir ve kendisine mukadder olan namazı kıtar, sonra hatîb hutbesini bitirinceye kadar dînler, sonra onunla beraber cum'a namazını kılarsa, o kimsenin o cum'a ile öbür cum'a arasındaki günahları; üç günlük de fazla günahı affolunur.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 1988,
      "arabicNumber": "857.02",
      "book": 7,
      "hadithInBook": 38,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلاَثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:He who performed ablution well, then came to Friday prayer, listened (to the sermon), kept silence all (his sins) between that time and the next Friday would be forgiven with three days extra, and he who touched pebbles caused an interruption",
          "ur": "اعمش نے ابو صالح سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے وضو کیا اوراچھی طرح وضو کیا ، پھر جمعے کے لئے آیا ، غور کے ساتھ خاموشی سے خطبہ سنا ، اس کے جمعے سے لے کر جمعے تک گناہ معاف کردئیے جاتے ہیں ۔ اورتین دن زائد کے بھی ۔ اور جو ( بلاوجہ ) کنکریوں کو ہاتھ لگاتا رہا ( ان سے کھیلتا رہا ) ، اس نے لغو اورفضول کام کیا ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Celui qui fait bien ses ablutions, puis vient à la prière du vendredi, écoute le sermon et garde le silence, tous ses péchés entre ce vendredi et le suivant seront pardonnés, avec trois jours supplémentaires. Mais celui qui touche les cailloux a interrompu (son attention). »",
          "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] -Yahya berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berwudlu, lalu ia menyempurnakan wudlunya, kemudian mendatangi Jum'at, mendengarkan (khutbah) tanpa berkata-kata, maka akan diampuni (dosa-dosa yang dilakukannya) antara hari itu dengan hari jum'at yang lain, ditambah tiga hari. Dan barangsiapa yang memegang-megang batu kerikil, maka ia telah berbuat kesia-siaan",
          "tr": "Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe ve Ebû Kureyb rivayet ettiler. Yahya (Bize haber verdi.) tâbirini kullandı. Ötekiler: (Bize Ebû Muâviye rivayet etti.) dediler. Ebû Muâviye, A'meş'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etmiş. Ebû Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Bir kimse abdest alır da, onu tertemiz almayı becerir sonra cum'âya gelerek susar ve hutbeyi dinlerse, gelecek cum'âya kadar işleyeceği (küçük) günahları ile üç günlük fazla günahı affolunur. Her kim de yerden çakıl taşı alırsa, abesle iştigâl etmiş olur.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 1989,
      "arabicNumber": "858.01",
      "book": 7,
      "hadithInBook": 39,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى، بْنُ آدَمَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا ‏.‏ قَالَ حَسَنٌ فَقُلْتُ لِجَعْفَرٍ فِي أَىِّ سَاعَةٍ تِلْكَ قَالَ زَوَالَ الشَّمْسِ ‏.‏",
        "translations": {
          "en": "Jabir b. 'Abdullah reported:We used to observe (Jumu'a) prayer with the Messenger of Allah (ﷺ) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian",
          "ur": "حسن بن عیاش نے جعفر بن محمد سے ، انھوں نے اپنے والد ( محمد ) سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تھے ، پھر واپس آتے ، پھر اپنے پانی لانے والے اونٹوں کو آرام کا وقت دیتے ، حسن نےکہا : میں نے جعفر سے کہا : یہ ( نماز ) کس وقت ہوتی؟انھوں نے کہا : سورج کے ڈھلنے کے وقت ۔",
          "fr": "Rapporté par Jabir ibn ‘Abdullah رضي الله عنه : Nous accomplissions la prière du vendredi avec le Messager d’Allah ﷺ, puis nous rentrions et laissions reposer nos chameaux qui servaient à transporter l’eau. Hassan (l’un des rapporteurs) a dit : J’ai demandé à Ja’far à quel moment cela se passait. Il a répondu : C’est lorsque le soleil a passé le zénith",
          "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Hasan bin Ayyasy] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] ia berkata; Kami pernah shalat (Jum'at) bersama Rasulullah shallallahu 'alaihi wasallam, kemudian kami pulang dan mengistirahatkan ternak kami. Hasan berkata; Saya bertanya kepada Ja'far, \"Kapankah waktunya?\" ia menjawab, \"Saat tergelincirnya matahari",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe ile İshâk b. İbrahim rivayet ettiler. Ebû Bekir Dediki: Bize Yahya b. Âdem rivayet etti. (Dediki): Bize Hasan b. Ayyaş, Ca'fer b. Muhammed'den, o da babasından, o da Câbir b. Abdillâh'dan naklen rivayet etti. Câbir şöyle demiş: «Biz cum'a namazını Resulullah (Sallallahu Aleyhi ve Sellem) ile bîrlikde kılar; sonra döner de su taşıdığımız develeri dinlendirirdik.» Hasan demiş ki: «Ben, Ca'fer'e: Bu hangi saatde oluyordu? dedim. Ca'fer : — Güneşin zevâli vaktinde., cevâbını verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 1990,
      "arabicNumber": "858.02",
      "book": 7,
      "hadithInBook": 40,
      "text": {
        "arabic": "وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، ح وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ، الرَّحْمَنِ الدَّارِمِيُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، قَالاَ جَمِيعًا حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ جَابِرَ بْنَ عَبْدِ اللَّهِ مَتَى كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْجُمُعَةَ قَالَ كَانَ يُصَلِّي ثُمَّ نَذْهَبُ إِلَى جِمَالِنَا فَنُرِيحُهَا ‏.‏ زَادَ عَبْدُ اللَّهِ فِي حَدِيثِهِ حِينَ تَزُولُ الشَّمْسُ يَعْنِي النَّوَاضِحَ ‏.‏",
        "translations": {
          "en": "Ja'far reported on the authority of his father:that he asked Jabir b. 'Abdullah when the Messenger of Allah (ﷺ) observed Jumu'a prayer. He said: He used to observe prayer, and we then went (back) to our camels and gave them rest. 'Abdullah made this addition in his narration: \"Till the sun passed the meridian. and the camels used for carrying water (took rest)",
          "ur": "قاسم بن زکریا نے کہا : ہمیں خالد بن مخلد نے حدیث بیان کی ، نیز عبداللہ بن عبدالرحمان دارمی نے کہا : ہمیں یحییٰ بن حسان نے حدیث بیان کی ، ان دونوں ( خالد اوریحییٰ ) نے کہا : ہمیں سلیمان بن بلال نے جعفر سےحدیث بیا ن کی ، انھوں نےاپنے والد ( محمد ) سے روایت کی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم کس وقت جمعہ پڑھتے تھے؟انھوں نے کہا : آپ جمعہ پڑھاتے ، پھر ہم اونٹوں کے پاس جاتے ، پھر انہیں آرام کا وقت دیتے ۔ عبداللہ نے اپنی روایت میں یہ اضافہ کیا : جس وقت سورج ڈھل جاتا ۔ ( جمال سے مراد ) تواضح ، یعنی پانی لانے والے اونٹ ہیں ۔",
          "fr": "Rapporté par Ja'far d’après son père : Il a demandé à Jabir ibn 'Abdullah رضي الله عنه à quel moment le Messager d’Allah ﷺ faisait la prière du vendredi. Il a répondu : « Il priait, puis nous retournions à nos chameaux et nous les laissions se reposer. » 'Abdullah a ajouté dans son récit : « Jusqu’à ce que le soleil ait passé le zénith, et les chameaux qui transportaient l’eau se reposaient. »",
          "id": "Dan telah menceritakan kepadaku [Al Qasim bin Zakariya] telah menceritakan kepada kami [Khalid bin Makhlad] -dalam jalur lain- Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Yahya bin Hassan] keduanya berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Ja'far] dari [bapaknya] bahwa ia bertanya kepada [Jabir], \"Kapan Rasulullah shallallahu 'alaihi wasallam menunaikan shalat Jum'at?\" Ia menjawab, \"Bisanya beliau shalat Jum'at, kemudian setelah itu kami pulang ke ternak unta kami, dan mengistirahatkannya.\" Abdullah menambahkan di dalam haditsnya; \"Saat matahari tergelincir, yakni setelah unta diberi minum",
          "tr": "Bana Kaasim b. Zekeriyyâ rivayet etti. (Dediki): Bize Hâlid b. Mahled rivayet etti. H. Bana Abdullah b. Abdirrahmân Ed-Dârimî de rivayet etti. {Dediki): Bize Yahya b. Hassan rivayet etti. Her iki râvî birden demişlerki: Bize Süleyman b. Bilâl, Ca'fer'den, o da babasından naklen rivayet ettiki, Babası Câbir b. Abdillâh'a : — Resulullah (Sallallahu Aleyhi ve Sellem) cum'a namazını ne zaman kılardı? diye sormuş; Câbir: — (Bize) cum'a namazını kıldırır, sonra develerimizin yanına giderek onları dinlendirirdik.» cevâbını vermiş. Abdullah kendi rivayetinde: «Güneş zevale erdiği vakit., yâni su taşıyan develeri...» ibaresini ziyâde etmişdir. İzah 860 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 1991,
      "arabicNumber": "859",
      "book": 7,
      "hadithInBook": 41,
      "text": {
        "arabic": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، وَيَحْيَى بْنُ يَحْيَى، وَعَلِيُّ بْنُ حُجْرٍ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ مَا كُنَّا نَقِيلُ وَلاَ نَتَغَدَّى إِلاَّ بَعْدَ الْجُمُعَةِ - زَادَ ابْنُ حُجْرٍ - فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Sahl b. Said said:We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) \"During the lifetime of the Messenger of Allah (ﷺ)",
          "ur": "عبداللہ بن مسلمہ بن قعنب ، یحییٰ بن یحییٰ اور علی بن حجر میں سے یحییٰ نے کہا : ہمیں خبر دی اور دوسرے دونوں نے کہا : ہم سے حدیث بیا ن کی عبدالعزیز بن ابی حازم نے اپنے والد ابوحازم سے ، انھوں نے حضرت سہیل رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم جمعہ کے بعد ہی قیلولہ کرتے اور کھانا کھاتے تھے ۔ ( علی ) ابن حجر نے اضافہ کیا : رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ۔",
          "fr": "Rapporté par Sahl ibn Saïd رضي الله عنه : Nous ne faisions la sieste ni ne déjeunions avant la prière du vendredi. (Ibn Hajr a ajouté : « Du vivant du Messager d’Allah ﷺ. »)",
          "id": "Dan Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] dan [Yahya bin Yahya] dan [Ali bin Hujr] - [Yahya] berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [bapaknya] dari [Sahl] ia berkata; \"Biasanya kami tidak pernah tidur siang, dan tidak pula makan siang kecuali setelah menunaikan shalat Jum'at.\" Ibnu Hujr berkata; \"(Yakni) pada masa Rasulullah shallallahu 'alaihi wasallam",
          "tr": "Bize Abdullah b. Meslemete'bni Ka'neb ile Yahya b. Yahya ve Alîyyü'bnü Hucr rivayet ettiler. Yahya (Bize haber verdi.) tâbirini kullandı; ötekiler: (Bize, Abdülâzîz b. Ebî Hâzim rivayet etti.) dediler. Abdülazîz, babasından, o da Sehl'den naklen rivayet etmiş. Sehl: «Biz ancak cum'a namazından sonra kaylûle yapar; yemek yerdik.» demiş. İbni Hucr: «Resulullah (Sallallahu Aleyhi ve Sellem) zamanında...» ifâdesini ziyâde etti. İzah 860 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 1992,
      "arabicNumber": "860.01",
      "book": 7,
      "hadithInBook": 42,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالاَ أَخْبَرَنَا وَكِيعٌ، عَنْ يَعْلَى بْنِ، الْحَارِثِ الْمُحَارِبِيِّ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، قَالَ كُنَّا نُجَمِّعُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذَا زَالَتِ الشَّمْسُ ثُمَّ نَرْجِعُ نَتَتَبَّعُ الْفَىْءَ ‏.‏",
        "translations": {
          "en": "Iyas b. Salama b. al-Akwa' reported on the authority of his father:We used to observe the Friday prayer with the Messenger of Allah (ﷺ) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun)",
          "ur": "وکیع نے یعلیٰ بن حارث محاربی سے روایت کی ، انھوں نے ایاس بن سلمہ بن اکوع سے اور انھوں نے اپنے والد ( حضرت سلمہ بن اکوع رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : جب سورج ڈھلتا ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے ، پھر ہم سایہ تلاش کرتے ہوئے لوٹتے ۔",
          "fr": "Rapporté par Iyas ibn Salama ibn al-Akwa’ d’après son père رضي الله عنه : Nous faisions la prière du vendredi avec le Messager d’Allah ﷺ quand le soleil avait passé le zénith, puis nous rentrions et cherchions l’ombre des murs pour nous protéger de la chaleur du soleil",
          "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Ishaq bin Ibrahim] keduanya berkata, telah mengabarkan kepada kami [Waki'] dari [Ya'la bin Al Harits Al Maharibi] dari [Iyas bin Salamah bin Al Akwa'] dari [bapaknya] ia berkata; \"Kami shalat Jum'at bersama Rasulullah shallallahu 'alaihi wasallam ketika matahari tergelincir. Setelah itu kami pulang dalam keadaan masih perlu mencari-cari naungan untuk tempat berlindung",
          "tr": "Bize Yahya b. İbrâhîm rivayet ettiler. Dedilerki: Bize Vekî', Ya'lâ b. Haris El-Muhâribî'den, o da İyâs b. Selemete'bni Ekva'dan* o da baabsından naklen haber verdi. Şöyle demiş: «Biz, Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikde güneş zevale erdiği vakit cum'a namazını kılar; sonra gölgeyi araştırarak dönerdik»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 1993,
      "arabicNumber": "860.02",
      "book": 7,
      "hadithInBook": 43,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ، عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْجُمُعَةَ فَنَرْجِعُ وَمَا نَجِدُ لِلْحِيطَانِ فَيْئًا نَسْتَظِلُّ بِهِ ‏.‏",
        "translations": {
          "en": "Iyas b. Salama b. Akwa' reported on the authority of his father, saying:We used to observe the Friday prayer with the Messenger of Allah (ﷺ), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun)",
          "ur": "ہشام بن عبدالملک نے یعلیٰ بن حارث سے باقی ماندہ اسی سند کے ساتھ روایت کی ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے پھر لوٹتے تو ہمیں دیواروں کا اتنا بھی سایہ نہ ملتا کہ ہم ( سورج سے ) اس کی اوٹ لے سکیں ۔",
          "fr": "Rapporté par Iyas ibn Salama ibn Akwa’ d’après son père رضي الله عنه : Nous faisions la prière du vendredi avec le Messager d’Allah ﷺ, et quand nous rentrions, nous ne trouvions pas l’ombre des murs pour nous abriter de la chaleur du soleil",
          "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Hisyam bin Abdul Malik] Telah menceritakan kepada kami [Ya'la bin Harits] dari [Iyas bin Salamah bin Al Akwa'] dari [bapaknya] ia berkata; \"Kami shalat Jum'at bersama Rasulullah shallallahu 'alaihi wasallam, kemudian kami pulang namun kami tidak lagi mendapati naungan pada dinding untuk berteduh",
          "tr": "Bize İshâk b. İbrâhîm rivayet etti. (Dediki): Hişâm b. Abdilmelik haber verdi (Dediki): Bize Ya'Iâ b. Haris, İyâs b. Selemete'bini Ekva'dan, o da babasından naklen rivayet etti. İyâs'ın baabsı şöyle demiş: «Biz, Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikde cumâ'yı kılar da dönerdik. Ama (henüz) duvarların, gölgeleneceğimiz kadar gölgesini bulamazdık.» İzah Kaylûle hadîsini Buhari «Kitâbü'l-Cumua» da, gölge hadîsini de «Kitâbü'l-Megâzî» de tahrîc etmişdir. Gölge hadîsini Ebû Dâvûd , Nesâi ve İbni Mâce «Kitâbu's-Salât» da tahrîc etmişlerdir. Kaylûle: Öğle istirâhati, demekdir. Gadât : Kaba kuşluk; gadâ ise: Kuşluk yemeği mânâsına gelir. Güneşin zevalinden. murâd: Semânın ortasından batıya doğru biraz yanlamasıdır. Nitekim Buhâri'nin «cum'a» bahsinde Hz. Enes'den rivayet ettiği bir hadîsde: «Nebi (Sallallahu Aleyhi ve Sellem) cum'a namazını güneş (semânın ortasından) yanladığı vakit kılardı.» denilmişdir. Mezkûr hadîsi Tirmizî ile Ebû Dâvûd dahî rivayet etmiş; Tirmizî onun hakkında «Hasen sahîhdir.» tâbirini kullanmış ve «Bu bâbda Selemetü'bnü Ekvâ' ile Câbir ve Zübeyr b. Avvam 'dan da hadisler rivayet edilmişdir. demiştir. Yine bu bâbda Sehl b. Sa'd , Abdullah b. Mesûd, Ammâr b. Yâsir, Sa'dü'l-Kurazî ve Bilâl (Radiyallahû anhûm) hazerâtından da rivayetler vardır. Selemetü'bnü Ekva hadîsini Tirmizî'nin dışında bütün kütüb-i sitte sahihleri tahrîc etmişlerdir. Gölge hadîsi adını verdiğimiz bu hadîs, babımızın son rivayetidir. Mezkûr hadîsdeki «Gölgeyi araştırarak dönerdik.» ifâdesinden murâd: Gölgenin azlığını beyândır. Gölgenin en az olduğu zaman ise güneşin tam gökyüzünün ortasında bulunduğu andır. Ondan sonraki zamana zeval denir. Râvî bu sözü ile cum'a namazının zeval vaktinde kılındığına işaret etmişdir. Çünkü güneşin tam gökyüzünün ortasında bulunduğu zamanda namaz kılmak mekruhdur. Câbir (Radiyallahû anh) hadîsini Müslim ile Nesâî rivayet etmişlerdir. Babımızın birinci ve ikinci rivayetleri bu hadîse âiddir. Zübeyrü'bnü Avvâm hadîsini imam Ahmed b. Hanbel tahrîc etmişdir. Mezkûr hadîsde : «Biz, Nebi (Sallallahu Aleyhi ve Sellem) ile birlikde cum'a namazını kılar; sonra namazdan çıkarak kale duvarlarına koşuşurduk. Fakat gölge nâmına ancak ayaklarımızı koyacak kadar bir şey bulabilirdik.» denilmişdir. Sehl b. Sa'd hadîsini Buhârî, Müslim, Nesâî ve Tirmizî tahrîc etmişlerdir. Abdullah b. Mes'ûd hadîsini imam Ahmed b. Hanbel «Müsned» inde rivayet etmişdir. Ammâr b. Yâsir hadîsini Taberânî «El-Kebîr» inde rivayet etmişdir. Bu hadîs Selemetü'bnü Ekva' hadîsi gibidir. Sa'dü'l-Kurazî hadîsini İbni Mâce tahrîc etmişdir. Bilâl (Radiyallahû anh) hadîsini dahî Taberânî «El-Kebîr» inde rivayet etmişdir. Bu hadîsde : «Resulullah (Sallallahu Aleyhi ve Sellem) cum'a günü gölge nalın bağı kadar olduğu ve Nebi (Sallallahu Aleyhi ve Sellem) minber üzerine oturduğu zaman ezan okunurdu.» denilmektedir. Sa'd-ı Kurâzî hadîsi dahî hemen hemen bunun gibidir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 1994,
      "arabicNumber": "861",
      "book": 7,
      "hadithInBook": 44,
      "text": {
        "arabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ جَمِيعًا عَنْ خَالِدٍ، - قَالَ أَبُو كَامِلٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، - حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ ‏.‏ قَالَ كَمَا يَفْعَلُونَ الْيَوْمَ ‏.‏",
        "translations": {
          "en": "Ibn 'Umar said that the Messenger of Allah (ﷺ) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays",
          "ur": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن کھڑے ہوکر خطبہ ارشاد فرماتے ، پھر ( تھوڑی دیر ) بیٹھ جاتے ، پھر کھڑے ہوجاتے ۔ کہا : جس طرح آجکل ( خطبہ دینے والے ) کرتے ہیں ۔",
          "fr": "Rapporté par Ibn 'Umar رضي الله عنه : Le Messager d’Allah ﷺ faisait le sermon du vendredi debout. Ensuite, il s’asseyait, puis se relevait (pour le second sermon), comme les musulmans le font aujourd’hui",
          "id": "Dan telah menceritakan kepada kami [Ubaidullah bin Umar Al Qawariri] dan [Abu Kamil Al Jahdari] semuanya dari [Khalid] - [Abu Kamil] berkata- telah menceritakan kepada kami [Khalid bin Harits] telah menceritakan kepada kami [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata; \"Adalah Rasulullah shallallahu 'alaihi wasallam berkhutbah pada hari Jum'at dengan berdiri kemudian beliau duduk dan berdiri lagi.\" Ibnu Umar berkata; \"Persis seperti yang dilakukan orang-orang pada hari ini",
          "tr": "Bize Ubeydullah b. Ömer El-Kavârîrî ile Ebû Kâmil El-Cahderî hep birden Hâlid'den rivayet ettiler. Ebû Kâmil Dediki: Bize HâIid b. Hâris rivayet etti. (Dediki): Bize Ubeydullah, Nâfi'den, o da İbni Ömer'den naklen rivayet etti. İbni Ömer şöyle demiş: «Resulullah (Sallallahu Aleyhi ve Sellem) cum'a günü ayakta hutbe okur; sonra oturur; sonra (yine) kalkardı. Tıpkı sizin bu gün yaptığınız gibi.» İzah 863 te"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 1995,
      "arabicNumber": "862.01",
      "book": 7,
      "hadithInBook": 45,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَحَسَنُ بْنُ الرَّبِيعِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَتْ لِلنَّبِيِّ صلى الله عليه وسلم خُطْبَتَانِ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَ ‏.‏",
        "translations": {
          "en": "Jabir b. Samura said:The Apostle of Allah (ﷺ) gave two sermons between which he sat, recited the Qur'an and exhorted the people",
          "ur": "ابو احوص نے سماک سے اور انھوں نے حضرت جابر بن سمرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : نبی کریم صلی اللہ علیہ وسلم کے دو خطبے ہوتے تھے جن کے درمیان آپ بیٹھتے تھے ۔ آپ قرآن پڑھتے اور لوگوں کو نصیحت اور تذکیر فرماتے ۔",
          "fr": "Rapporté par Jabir ibn Samura رضي الله عنه : Le Messager d’Allah ﷺ faisait deux sermons entre lesquels il s’asseyait, récitait le Coran et exhortait les gens",
          "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Hasan bin Rabi'] dan [Abu Bakar bin Abu Syaibah] -Yahya berkata- telah mengabarkan kepada kami -sementara dua orang yang lain berkata- telah menceritakan kepada kami [Abul Ahwash] dari [Simak] dari [Jabir bin Samurah] ia berkata; \"Nabi shallallahu 'alaihi wasallam melakukan khutbah Jum'at dua kali, di mana beliau duduk di antara keduanya. Dalam khutbahnya beliau membaca Al Qur`an dan memberi peringatan kepada jama'ah",
          "tr": "Bize Yahya b. Yahya ile Hasanu'bnü'r-Rabî' ve Ebû Bekir b. Ebî Şeybe rivâyet ettiler. Yahya (Bize haber verdi.) tâbirini kullandı. Ötekiler: Bize Ebû'I-Ahvas, Simâk'den, o da Câbir b. Semura'dan naklen rivayet etti. dediler. Câbir : «Nebi (Sallallahu Aleyhi Sellem)'in iki hutbesi vardı. Aralarında oturur; Kur'ân okur ve cemaata hatırlatma yapardı.» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 1996,
      "arabicNumber": "862.02",
      "book": 7,
      "hadithInBook": 46,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ سِمَاكٍ، قَالَ أَنْبَأَنِي جَابِرُ بْنُ، سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَائِمًا فَمَنْ نَبَّأَكَ أَنَّهُ كَانَ يَخْطُبُ جَالِسًا فَقَدْ كَذَبَ فَقَدْ وَاللَّهِ صَلَّيْتُ مَعَهُ أَكْثَرَ مِنْ أَلْفَىْ صَلاَةٍ",
        "translations": {
          "en": "Jabir b. Samura said that the Messenger of Allah (ﷺ) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times",
          "ur": "ابو خثیمہ نے سماک سے روایت کی ، انھوں نے کہا : حضرت جابر بن سمرۃ رضی اللہ تعالیٰ عنہ نے مجھے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوکر خطبہ دیتے تھے ، پھر بیٹھ جاتے ، پھر کھڑے ہوتے اور کھڑے ہوکر خطبہ دیتے ، اس لئے جس نے تمھیں یہ بتایا کہ آپ بیٹھ کر خطبہ دیتے تھے ، اس نے جھوٹ بولا ۔ اللہ کی قسم! میں نے آپ کے ساتھ دو ہزار سے زائد نمازیں پڑھی ہیں ۔ ( جن میں بہت سے جمعے بھی آئے اور آپ صلی اللہ علیہ وسلم نے تمام خطبے کھڑے ہوکر دیے ۔)",
          "fr": "Rapporté par Jabir ibn Samura رضي الله عنه : Le Messager d’Allah ﷺ faisait le sermon debout. Ensuite, il s’asseyait, puis se relevait et parlait à nouveau debout. Celui qui t’a dit qu’il faisait le sermon assis a menti. Par Allah, j’ai prié avec lui plus de deux mille fois",
          "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Simak] ia berkata, ia telah memberitakan kepadaku [Jabir bin Samurah] bahwasanya Rasulullah shallallahu 'alaihi wasallam berkhutbah sambil berdiri. Kemudian beliau duduk, setelah itu beliau berdiri kembali dan menyampaikan khutbah kedua. Maka barangsiapa yang memberitakan kepadamu bahwa beliau berkhutbah sambil duduk, sesungguhnya ia telah berkata dusta. Demi Allah, saya telah shalat bersama beliau lebih dari duaribu kali",
          "tr": "Bize Yahya b. Yahya rivayet etti. (Dediki): Biez Ebû Hayseme, Simâk'dan naklen haber verdi. Demişki: Bana Câbir b. Semura haber verdi. Dediki: «Resûlullah (Sallallahu Aleyhi ve Sellem) ayakta hutbe okur; sonra oturur; sonra (tekrar) kalkarak ayakta hutbe okurdu. Sana kim oturarak hutbe okuduğunu haber verdiyse muhakkak yalan söylemiş. Vallahi ben, onunla birlikde ikibinden fazla namaz kılmişımdır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 1997,
      "arabicNumber": "863.01",
      "book": 7,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرٍ، - قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ، - عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرِ، بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَخْطُبُ قَائِمًا يَوْمَ الْجُمُعَةِ فَجَاءَتْ عِيرٌ مِنَ الشَّامِ فَانْفَتَلَ النَّاسُ إِلَيْهَا حَتَّى لَمْ يَبْقَ إِلاَّ اثْنَا عَشَرَ رَجُلاً فَأُنْزِلَتْ هَذِهِ الآيَةُ الَّتِي فِي الْجُمُعَةِ ‏{‏ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا‏}‏",
        "translations": {
          "en": "Jabir b. Abdullah reported that the Apostle (ﷺ) was delivering the sermon on Friday in a standing posture when a caravan from Syria arrived. The people flocked towards it till no one was left (with the Holy Prophet) but twelve persons, and it was on this occasion that this verse in regard to Jumu'a was revealed.\" And when they see merchandise or sport. they break away to it and leave thee standing",
          "ur": "جریر نے حصین بن عبدالرحمان سے روایت کی ، انھوں نے سالم بن ابی جعد سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم جمعے کےی دن کھڑے ہوکر خطبہ دے رہے تھے کہ شام سے ایک تجارتی قافلہ آگیا ، لوگوں نے اس کا رخ کرلیا حتیٰ کہ پیچھے بارہ آدمیوں کے سوا کوئی نہ بچا تویہ آیت نازل کی گئی جو سورہ جمعہ میں ہے : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں اور آپ کو کھڑا چھوڑ جاتے ہیں ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Le Prophète ﷺ faisait le sermon du vendredi debout lorsqu’une caravane venant de Syrie est arrivée. Les gens se sont précipités vers elle, si bien qu’il ne resta plus que douze personnes avec le Prophète ﷺ. C’est à cette occasion que ce verset concernant la prière du vendredi a été révélé : « Et quand ils voient un commerce ou un divertissement, ils s’y précipitent et te laissent debout. »",
          "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] keduanya dari [Jarir] - [Utsman] berkata- telah menceritakan kepada kami [Jarir] dari [Hushain bin Abdurrahman] dari [Salim bin Abul Ja'd] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam menyampaikan khutbah dengan berdiri pada hari Jum'at, tiba-tiba datanglah suatu Kafilah dagang dari negeri Syam; maka jama'ah pun berlarian menjemput Kafilah itu, hingga yang tinggal di Masjid hanya dua belas orang lagi. Maka diturunkanlah ayat ini (yakni pada surat Al Jumu'ah): \"Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya dan mereka tinggalkan kamu sedang berdiri (berkhutbah).\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [Hushain] dengan isnad ini, ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah. -ia tidak mengatakan; berdiri",
          "tr": "Bize Osman b. Ebî Şeybe ile İshâk b. İbrahim ikisi birden Cerîr'den rivayet ettiler. Osman Dediki: Bize Cerîr, Huseyn b. Abdirrahmân'dan, o da Salim b. Ebî'l-Ca'd'dan, o da Câbir b. Abdillâh'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) cum'a günü ayakta hutbe okuyormuş. Bu sırada Şam'dan bir kervan gelmiş. Derken cemâat ona doğru sökün etmişler. Hatta on iki kişiden başka kimse kalmamış. Bunun üzerine cum'a süresindeki şu âyet nâzîl olmuş: (Onlar bir ticâret veya eğlence gördükleri vakit ona doğru sökün ettiler de, seni ayakta bıraktılar.) [ Cum'a]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 1998,
      "arabicNumber": "863.02",
      "book": 7,
      "hadithInBook": 48,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، بِهَذَا الإِسْنَادِ قَالَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ ‏.‏ وَلَمْ يَقُلْ قَائِمًا ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Husain with the same chain of transmitters but with this alteration that he did not make mention of the standing position",
          "ur": "عبداللہ بن ادریس نے حصین سے اسی سند کے ساتھ روایت کی ، کہا : ( جب تجارتی قافلہ آیاتو ) رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے ۔ یہ نہیں کہا : کھڑے ہوئے ۔",
          "fr": "Rapporté par Husain avec la même chaîne de transmetteurs, mais il n’a pas mentionné la position debout",
          "tr": "{….} Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abdullah b. İdrîs, Husayn'dan bu isnâdla rivayet etti. (Yalnız o): «Resulullah (Sallallahu Aleyhi ve Sellem) hutbe okurken...» demiş «ayakta» kelimesini söylememişdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 1999,
      "arabicNumber": "863.03",
      "book": 7,
      "hadithInBook": 49,
      "text": {
        "arabic": "وَحَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي الطَّحَّانَ - عَنْ حُصَيْنٍ، عَنْ سَالِمٍ، وَأَبِي، سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ فَقَدِمَتْ سُوَيْقَةٌ قَالَ فَخَرَجَ النَّاسُ إِلَيْهَا فَلَمْ يَبْقَ إِلاَّ اثْنَا عَشَرَ رَجُلاً أَنَا فِيهِمْ - قَالَ - فَأَنْزَلَ اللَّهُ ‏{‏ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏",
        "translations": {
          "en": "Jabir b. Abdullah reported:I was along with the Messenger of Allah (ﷺ) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed:\" And when they see merchandise or sport away to it, and leave thee standing\" (lxii. 1 1). they break",
          "ur": "خالد طحان نے حصین سے روایت کی ، انھوں نے سالم اور ابو سفیان سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ایک چھوٹا سا بازار ( سامان بیچنے والوں کا قافلہ ) آگیا تو لوگ اس کی طرف نکل گئے اور ( صرف ) بارہ آدمیوں کے سوا کوئی نہ بچا ، میں بھی ان میں تھا ، کہا : اس پر اللہ تعالیٰ نے یہ آیت اتاری : \" اور جب وہ تجارت یاکوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں اور آ پ کو کھڑا چھوڑ دیتے ہیں \" آیت کے آخر تک ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : J’étais avec le Messager d’Allah ﷺ un vendredi quand une caravane est arrivée. Les gens sont partis vers elle, et il ne resta que douze personnes, dont moi. C’est à ce moment que ce verset a été révélé : « Et quand ils voient un commerce ou un divertissement, ils s’y précipitent et te laissent debout. » (Coran 62:)",
          "id": "Dan Telah menceritakan kepada kami [Rifa'ah bin Al Haitsam Al Wasithi] telah menceritakan kepada kami [Khalid] yakni Ath Thahhan, dari [Hushain] dari [Salim] dan [Abu Sufyan] dari [Jabir bin Abdullah] ia berkata; Kami sedang bersama Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at, tiba-tiba datanglah suatu Kafilah dagang sehingga para jama'ah pun keluar menjemputnya hingga tidak tersisa lagi kecuali dua belas orang dan saya adalah salah seorang dari mereka. Maka Allah menurunkan ayat: \"Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya dan mereka tinggalkan kamu sedang berdiri (berkhotbah).\" Hingga akhir ayat",
          "tr": "Bize Rifâatü'bnü Heysem El-Vâsitî rivayet etti. (Dediki): Bize Hâlid (yâni Tahhân) Husayn'dan, o da Salim ile Ebû Süfyân'dan, onlar da Câbir b. AbdiIIâh'dan naklen rivayet etti. Câbir şöyle demiş: cum'a günü Nebi (Sallallahu Aleyhi ve Selletn) ile beraber bulunuyorduk. Derken bir kervan geldi. Cemâat hemen onun yanına çıktılar. Nebi (Sallallahu Aleyhi ve Sellem)'in yanında oniki kişiden başka kimse kalmadı. Ben kalanların, içinde idim. Bunun üzerine Allah (Celle Celâluhu) : (Onlar bir ticâret veya eğlence gördükleri vakit ona doğru sökün ettiler de, seni ayakta bıraktılar... ilâh.) [cum'a suresi 11.] âyet-i kerimesini indirdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 2000,
      "arabicNumber": "863.04",
      "book": 7,
      "hadithInBook": 50,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْمَاعِيلُ بْنُ سَالِمٍ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا حُصَيْنٌ، عَنْ أَبِي سُفْيَانَ، وَسَالِمِ، بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم قَائِمٌ يَوْمَ الْجُمُعَةِ إِذْ قَدِمَتْ عِيرٌ إِلَى الْمَدِينَةِ فَابْتَدَرَهَا أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى لَمْ يَبْقَ مَعَهُ إِلاَّ اثْنَا عَشَرَ رَجُلاً فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ - قَالَ - وَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا‏}‏",
        "translations": {
          "en": "Jabir b. Abdullah reported:While the Messenger of Allah (ﷺ) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah (ﷺ) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed.\" And when they see merchandise or sport, they break away to it",
          "ur": "ہشیم نے کہا : ہمیں حصین نے ابو سفیان اور سالم بن ابی جعد سے خبر دی ، انھوں نے حضرت جابربن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے بیان کیا ، ایک بار جب نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن کھڑے ہوئے ( خطبہ دے رہے ) تھے کہ ایک تجارتی قافلہ مدینہ آگیا ، رسول اللہ صلی اللہ علیہ وسلم کے ساتھی اس کی طرف لپک پڑے حتیٰ کہ آپ کے ساتھ بارہ آدمیوں کے سوا کوئی نہ بچا ۔ ان میں ابو بکر اور عمر رضی اللہ تعالیٰ عنہ بھی موجود تھے ۔ کہا : تو ( اس پر ) یہ آیت اتری : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Pendant que le Messager d’Allah ﷺ faisait un sermon le vendredi, une caravane de marchandises est arrivée à Médine. Les Compagnons du Messager d’Allah ﷺ se sont précipités vers elle, si bien qu’il ne resta que douze personnes avec lui, dont Abu Bakr et 'Omar. C’est à ce moment que ce verset a été révélé : « Et quand ils voient un commerce ou un divertissement, ils s’y précipitent. »",
          "id": "Dan telah menceritakan kepada kami [Isma'il bin Salim] telah mengabarkan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushaim] dari [Abu Sufyan] dan [Salim bin Abul Ja'di] dari [Jabir bin Abdullah] ia berkata; Ketika Nabi shallallahu 'alaihi wasallam berdiri menyampaikan khutbah pada hari Jum'at, tiba-tiba datanglah suatu Kafilah dagang ke Madinah, maka para sahabat Rasulullah shallallahu 'alaihi wasallam bergegas mendatanginya hingga tidak tersisa lagi orang yang bersamanya kecuali dua belas orang. Di antara mereka ada Abu Bakar dan Umar. Maka turunlah ayat ini: \"Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya",
          "tr": "Bize İsmail b. Sâlâm rivayet etti. (Dediki): Bize Hüseyin haber verdi. (Dediki): Bize Husayn, Ebû Süfyân ile Salim b. Ebî'l-Ca'd'dan, onlar da Câbir b. AbdiIIâh'dan naklen haber verdi. Câbir şöyle demiş: «Bir cum'a günü Nebi {Sallallahu Aleyhi ve Sellem) ayakta (hutbe okumakda) iken Medine'ye bir kervan geliverdi. Resulullah (Sallallahu Aleyhi ve Sellem)'in ashabı hemen ona doğru koşuştular. Binnetîce yanında oniki kişiden başka kimse kalmadı. Kalanların içinde Ebû Bekir ile Ömer de vardı. (Bunun üzerine) şu âyet nazil oldu : (Onlar bîr ticâret veya eğlence gördükler! vakit ona doğru sökün ettiler...) (cum'a 11) İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 2001,
      "arabicNumber": "864",
      "book": 7,
      "hadithInBook": 51,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ دَخَلَ الْمَسْجِدَ وَعَبْدُ الرَّحْمَنِ بْنُ أُمِّ الْحَكَمِ يَخْطُبُ قَاعِدًا فَقَالَ انْظُرُوا إِلَى هَذَا الْخَبِيثِ يَخْطُبُ قَاعِدًا وَقَالَ اللَّهُ تَعَالَى ‏{‏ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا‏}‏",
        "translations": {
          "en": "Ka'b b. 'Ujra reported that he entered the mosque and saw Abd al-Rahman b. Umm Hakam delivering the sermon in a sitting posture. Upon this he said:Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing",
          "ur": "حضرت کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ وہ مسجد میں آئے ، دیکھاکہ ( اموی والی ) عبدالرحمان بن ام حکیم بیٹھ کر خطبہ دے رہا ہے ، انھوں نے فرمایا : اس خبیث کودیکھو ، بیٹھ کر خطبہ دے رہا ہے ، جبکہ اللہ تعالیٰ کا فرمان ہے : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو ادھر ٹوٹ پڑتے ہیں اور آپ کوکھڑا چھوڑ جاتے ہیں ۔",
          "fr": "Rapporté par Ka'b ibn 'Ujra رضي الله عنه : Il entra dans la mosquée et vit Abd al-Rahman ibn Umm Hakam faire le sermon assis. Il dit alors : « Regardez ce malheureux : il fait le sermon assis, alors qu’Allah a dit : “Et quand ils voient un commerce ou un divertissement, ils s’y précipitent et te laissent debout.” »",
          "id": "Dan Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari ['Amru bin Murrah] dari [Abu 'Ubaidah] dari [Ka'ab bin 'Ujrah], bahwa ia pernah memasuki sebuah masjid dan ketika itu Abdur Rahman bin Ummi Al Hakam menyampaikan khutbah sambil duduk, maka iapun berkata, \"Lihatlah orang yang buruk ini, ia berkhutbah sambil duduk padahal Allah Ta'ala telah berfirman: 'Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya dan mereka tinggalkan kamu sedang berdiri (berkhotbah) …",
          "tr": "Bize Muhammedü'bnü'I-Müsennâ ile İbni Beşşâr rivayet ettiler. Dediler ki: Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Mansûr'dan, o da Amr b. Mürra'dan, o da Ebû Ubeyde'den, o da Kâ'b b. Ucra'dan naklen rivayet etti. Demiş ki : «Kâ'b, mescide girdi. Abdurrahmân b. Ümmi Hakem oturduğu yerden hutbe okuyordu. Kâ'b : — Şu habise bakın! Oturduğu yerden hutbe okuyor. Hâlbuki Allah Teâlâ (onlar bir ticâret veya eğlence gördükleri vakit, ona doğru sökün ettiler de seni ayakta bıraktılar.) buyuruyor; dedi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 2002,
      "arabicNumber": "865",
      "book": 7,
      "hadithInBook": 52,
      "text": {
        "arabic": "وَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو تَوْبَةَ، حَدَّثَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - عَنْ زَيْدٍ، - يَعْنِي أَخَاهُ - أَنَّهُ سَمِعَ أَبَا سَلاَّمٍ، قَالَ حَدَّثَنِي الْحَكَمُ بْنُ مِينَاءَ، أَنَّحَدَّثَاهُ أَنَّهُمَا، سَمِعَا رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى أَعْوَادِ مِنْبَرِهِ ‏ \"‏ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمُ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ ثُمَّ لَيَكُونُنَّ مِنَ الْغَافِلِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Umar and Abu Huraira said that they heard Allah's Messenger (ﷺ) say on the planks of his pulpit:People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent",
          "ur": "حکم بن مینا ء نے حدیث بیان کی کہا : حضرت عبد اللہ بن عمر اور حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے انھیں حدیث بیان کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ اپنے منبر کی لکڑیوں پر ( کھڑے ہو ئے ) فر ما رہے تھے \" لو گوں کے گروہ ہر صورت جمعہ چھوڑ دینے سے باز آجا ئیں یا اللہ تعا لیٰ ان کے دلوں پر مہر لگا دے گا پھر وہ غا فلوں میں سے ہو جا ئیں گے ۔",
          "fr": "Rapporté par Abdullah ibn Umar رضي الله عنه et Abu Huraira رضي الله عنه : Ils ont entendu le Messager d’Allah ﷺ dire sur les planches de son minbar : « Les gens doivent cesser de négliger la prière du vendredi, sinon Allah scellera leurs cœurs et ils feront partie des insouciants. »",
          "id": "Dan telah menceritakan kepadaku [Al Hasan bin Ali Al Hulwani] telah menceritakan kepada kami [Abu Taubah] telah menceritakan kepada kami [Mu'awiyah] yaitu Ibnu Sallam dari [Zaid] yakni saudaranya, bahwa ia mendengar [Abu Sallam] ia berkata, telah menceritakan kepadaku [Al Hakam bin Mina`] bahwa [Abdullah bin Umar] dan [Abu Hurairah] keduanya telah menceritakan kepadanya, bahwa keduanya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbarnya: \"Hendaklah orang yang suka meninggalkan shalat Jum'at menghentikan perbuatannya, ataukah mereka ingin Allah membutakan hati mereka, dan sesudah itu mereka benar-benar menjadi orang yang lalai",
          "tr": "Bana Hasen b. Aliy El-Hulvânî rivayet etti. (Dediki): Bize Ebû Tevbe rivayet etti. (Dediki): Bize Muâviye —ki İbni Sellâm'dır—, Zeyd'den (yâni kardeşinden) naklen rivayet etti. Zeyd, Ebû Sellâm'dan dinlemiş. Ebû Sellâm demiş ki: Bana, Hakem b. Mînâ rivayet etti. Ona da Abdullah b. Ömer ile Ebû Hureyre rivayet etmişler. Onlar da Resulullah (Sallallahu Aleyhi ve Sellem)'i minberinin basamakları üzerinde şöyle buyururken işitmişler : «Yâ bir takım adamlar cum'a namazlarını terk etmekden vazgeçerler yahut Allah, onların kalplerine muhakkak sûretde mühür vurur,da bir daha gafillerden olurlar!»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 2003,
      "arabicNumber": "866.01",
      "book": 7,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كُنْتُ أُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكَانَتْ صَلاَتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا ‏.‏",
        "translations": {
          "en": "Jabir b. Samura reported:I used to pray with the Messenger of Allah (ﷺ) and both his prayer and sermon were of moderate length",
          "ur": "ابوا حوص نے سما ک بن حرب سے اور انھوں نے حضرت جا بربن سمرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتا تھا آپ کی نماز ( طوالت میں ) متوسط ہو تی تھی اور آپ کا خطبہ بھی متوسط ہو تا تھا ۔",
          "fr": "Rapporté par Jabir ibn Samura رضي الله عنه : Je priais avec le Messager d’Allah ﷺ et sa prière ainsi que son sermon étaient d’une longueur modérée",
          "id": "Telah menceritakan kepada kami [Hasan bin Rabi'] dan [Abu Bakar bin Abu Syaibah] keduanya berkata, Telah menceritakan kepada kami [Abul Ahwash] dari [Simak] dari [Jabir bin Samurah] ia berkata; Saya pernah shalat (Jum'at) bersama Rasulullah shallallahu 'alaihi wasallam, lama shalat dan khutbah beliau pertengahan (tidak terlalu panjang atau terlalu pendek)",
          "tr": "Bize Hasen b. Rabî' ile Ebû Bekr b. Ebî Şeybe rivayet ettiler. Dedilerki: Bize Ebu'l-Ahvas, Simâk'den, o da Câbir b. Semura'dan naklen rivayet etti. Câbir şöyle demiş : «Ben Resulullah (Sallallahu Aleyhi ve Sellem) ile birlikte namaz kılardım. Onun namazı orta, hutbesi dahî orta idi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 2004,
      "arabicNumber": "866.02",
      "book": 7,
      "hadithInBook": 54,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا زَكَرِيَّاءُ، حَدَّثَنِي سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كُنْتُ أُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الصَّلَوَاتِ فَكَانَتْ صَلاَتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ زَكَرِيَّاءُ عَنْ سِمَاكٍ",
        "translations": {
          "en": "Jabir b. Samura reported:I used to observe prayer with the Messenger of Allah (ﷺ) and his prayer was of moderate length and his sermon too was of moderate length",
          "ur": "ابو بکر بن ابی شیبہ اور ابن نمیر نے کہا : ہمیں محمد بن بشر نے حدیث بیان کی ، ہمیں زکریا نے حدیث بیان کی کہا : مجھ سے سماک بن حرب نے حضرت جا بر بن سمرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا : میں نماز یں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھتا تھا تو آپ کی نماز در میانی ہو تی تھی اور آپ کا خطبہ بھی درمیانہ ہو تا تھا ابو بکر بن ابی شیبہ کی روا یت میں ( زکریا نے کہا : ( حدثني سماك بن حرب ) \" مجھے سماک بن حرب نے حدیث بیان کی \" کے بجائے ) زكريا نےمجھے سماک سے روایت کی \" کے الفا ظ ہیں ۔",
          "fr": "Rapporté par Jabir ibn Samura رضي الله عنه : J’accomplissais la prière avec le Messager d’Allah ﷺ ; sa prière était d’une durée modérée, et son sermon aussi",
          "id": "Dan Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ibnu Numair] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Zakariya] telah menceritakan kepadaku [Simak bin Harb] dari [Jabir bin Samurah] ia berkata; \"Kami telah beberapa kali shalat (Jum'at) bersama Rasulullah shallallahu 'alaihi wasallam, maka shalat dan khutbah beliau adalah pertengahan (tidak terlalu panjang dan tidak pula terlalu pendek).\" Sementara dalam riwayat Abu Bakar bin Zakariya dari Simak",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe île İbni Numeyr rivayet ettiler. Dedilerki: Bize Muhammed b. Bişr rivayet etti. (Dedi ki) . Bize Zekeriyyâ rivayet etti. (Dediki): Bana Simâk b. Harb, Câbir b. Semura'dan naklen rivayet etti. Câbir şöyle demiş: «Ben Nebi (Sallallahu Aleyhi ve Sellem) ile birlikte bir çok namazlar kılıyordum. Onun namazı orta, hutbesi de orta idi.» Ebû Bekr'in rivayetinde: «Zekeriyyâ Simâk'den» denilmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 2005,
      "arabicNumber": "867.01",
      "book": 7,
      "hadithInBook": 55,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا خَطَبَ احْمَرَّتْ عَيْنَاهُ وَعَلاَ صَوْتُهُ وَاشْتَدَّ غَضَبُهُ حَتَّى كَأَنَّهُ مُنْذِرُ جَيْشٍ يَقُولُ ‏\"‏ صَبَّحَكُمْ وَمَسَّاكُمْ ‏\"‏ ‏.‏ وَيَقُولُ ‏\"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏ ‏.‏ وَيَقْرُنُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى وَيَقُولُ ‏\"‏ أَمَّا بَعْدُ فَإِنَّ خَيْرَ الْحَدِيثِ كِتَابُ اللَّهِ وَخَيْرُ الْهُدَى هُدَى مُحَمَّدٍ وَشَرُّ الأُمُورِ مُحْدَثَاتُهَا وَكُلُّ بِدْعَةٍ ضَلاَلَةٌ ‏\"‏ ‏.‏ ثُمَّ يَقُولُ ‏\"‏ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ مَنْ تَرَكَ مَالاً فَلأَهْلِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَإِلَىَّ وَعَلَىَّ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir b. Abdullah said:When Allah's Messenger (may peace he upon him) delivered the sermon, his eyes became red, his voice rose, and his anger increased so that he was like one giving a warning against the enemy and saying: \"The enemy has made a morning attack on you and in the evening too.\" He would also say: \"The Last Hour and I have been sent like these two.\" And he would join his forefinger and middle finger; and would further say: \"The best of the speech is embodied in the Book of Allah, and the best of the guidance is the guidance given by Muhammad. And the most evil affairs are their innovations; and every innovation is error.\" He would further say:, I am more dear to a Muslim even than his self; and he who left behind property that is for his family; and he who dies under debt or leaves children (in helplessness), the responsibility (of paying his debt and bringing up his children) lies on me",
          "ur": "عبد الوہاب بن عبد المجید ( ثقفی ) نے جعفر ( صادق ) بن محمد ( باقر ) سے روایت کی انھوں نے اپنے والد سے اور انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب خطبہ دیتے تو آپ کی آنکھیں سرخ ہو جا تیں ، آواز بلند ہو جا تی اور جلال کی کیفیت طاری ہو جا تی تھی حتیٰ کہ ایسا لگتا جیسے آپ کسی لشکر سے ڈرا رہے ہیں فر ما رہے ہیں کہ وہ ( لشکر ) صبح یا شام ( تک ) تمھیں آلے گا اور فر ما تے \" میں اور قیامت اس طرح بھیجے گئے ہیں \" اور آپ اپنی انگشت شہادت اور درمیانی انگلی کو ملا کر دکھا تے اور فر ما تے ۔ \" ( حمدو صلاۃ ) کے بعد بلا شبہ بہترین حدیث ( کلام ) اللہ کی کتاب ہے اور زندگی کا بہترین طریقہ محمد صلی اللہ علیہ وسلم کا طریقہ زندگی ہے اور ( دین میں ) بد ترین کا وہ ہیں جو خود نکا لے گئے ہوں اور ہر نیا نکا لا ہوا کا م گمراہی ہے پھر فر ما تے : \" میں ہر مو من کے ساتھ خود اس کی نسبت زیادہ محبت اور شفقت رکھنے والا ہوں جو کو ئی ( مومن اپنے بعد ) مال چھوڑ گیا تو وہ اس کے اہل و عیال ( وارثوں ) کا ہے اور جو مومن قرض یا بے سہارا اہل و عیال چھوڑ گیا تو ( اس قرض کو ) میری طرف لو ٹا یا جا ئے ( اور اس کے کنبے کی پرورش ) میرے ذمے ہے ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Lorsque le Messager d’Allah ﷺ prononçait le sermon, ses yeux devenaient rouges, sa voix s’élevait et sa colère augmentait, au point qu’il ressemblait à quelqu’un qui avertit contre un ennemi en disant : « L’ennemi vous attaque le matin et aussi le soir. » Il disait aussi : « L’Heure dernière et moi avons été envoyés comme ces deux-là. » Et il joignait son index et son majeur. Il disait encore : « La meilleure parole est celle contenue dans le Livre d’Allah, et la meilleure voie est celle de Muhammad. Les pires choses sont les innovations, et chaque innovation est un égarement. » Il ajoutait : « Je suis plus cher à un musulman que sa propre personne. Celui qui laisse des biens, ils sont pour sa famille ; mais celui qui meurt endetté ou laisse des enfants sans soutien, c’est à moi d’en assumer la responsabilité. »",
          "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Abdul Wahhab bin Abdul Majid] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] ia berkata, bahwasanya; Apabila Rasulullah shallallahu 'alaihi wasallam menyampaikan khutbah, maka kedua matanya memerah, suaranya lantang, dan semangatnya berkobar-kobar bagaikan panglima perang yang sedang memberikan komando kepada bala tentaranya. Beliau bersabda: \"Hendaklah kalian selalu waspada di waktu pagi dan petang. Aku diutus, sementara antara aku dan hari kiamat adalah seperti dua jari ini (yakni jari telunjuk dan jari tengah).\" Kemudian beliau melanjutkan bersabda: \"Amma ba'du. Sesungguhnya sebaik-baik perkataan adalah Kitabullah, sebaik-baik petunjuk adalah petunjuk Muhammad shallallahu 'alaihi wasallam. Seburuk-buruk perkara adalah perkara yang diada-adakan dan setiap bid'ah adalah sesat.\" Kemudian beliau bersabda: \"Aku lebih utama bagi setiap muslim daripada dirinya sendiri. Karena itu, siapa yang meninggalkan harta, maka harta itu adalah miliki keluarganya. Sedangkan siapa yang mati dengan meninggalkan hutang atau keluarga yang terlantar, maka hal itu adalah tanggungjawabku.\" Dan telah menceritakan kepada kami [Abdu bin Humaid] telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepadaku [Sulaiman bin Bilal] telah menceritakan kepadaku [Ja'far bin Muhammad] dari [bapaknya] ia berkata; Saya mendengar [Jabir bin Abdullah] berkata; Isi khutbah Nabi shallallahu 'alaihi wasallam pada hari Jum'at adalah, beliau memuji Allah, dan membaca puji-pujian atas-Nya, kemudian berliau menyampaikan khutbah dengan suara yang lantang. Kemudian ia pun menyebutkan hadits. Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ja'far] dari [Bapaknya] dari [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam jika berkhotbah, beliau memuji Allah dan bersyukur kepadaNya kemudian beliau melanjutkan dengan kata; \"Barangsiapa yang Allah memberinya petunjuk, niscaya tidak ada yang akan menyesatkannya, dan barangsiapa yang sesat, niscaya tidak ada yang menunjukinya, dan sebaik-baik perkataan adalah Kitab Allah, \" kemudian hadits sebagaimana hadits Ats Tsaqafi",
          "tr": "Bana Muhammed b. el-Müsennâ rivayet etti. (Dediki): Bize Abdülvehhâb b. Abdilmecîd, Cafer b. Muhammed'den, o da Babasından, o da Câbir b. AbdiIIâh'dan naklen rivayet etti. Demişki : «Resulullah (Sallallahu Aleyhi ve Sellem); hutbe okudu mu gözleri kızarır; sesi yükselir, ve hiddeti artardı. Hatta bir orduyu tehdîdde bulunarak: (düşman) akşama sabah size baskın yapacak diyen (ordu kumandanı) gibi olur; ve şehâdet parmağı ile orta parmağını yan yana getirerek: «Ben kıyamete şunlar (in bir birine olan yakınlığı) gibi yakın (bir zamanda) gönderildim.» der; ve şöyle devam ederdi: «Bundan sonra =[Emma ba'du ](malûmunuz olsun ki) sözün en hayırlısı Allah'ın kitabıdır. Irşadların en hayırlısı da Muhammed'in irşadıdır. Umurun en kötüsü, sonradan çıkarılanlarıdır. Her bid'at dalâlettir.» der; Sonra : «Ben her mü'mine kendi nefsinden ileriyim. Bir kimse (ölürken) mal bırakırsa o mal onun yakınlarına âiddir. Fakat borç veya çoluk çocuk bırakırsa bana âid ve benim üzerimedir.» buyururlardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 2006,
      "arabicNumber": "867.02",
      "book": 7,
      "hadithInBook": 56,
      "text": {
        "arabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي جَعْفَرُ، بْنُ مُحَمَّدٍ عَنْ أَبِيهِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كَانَتْ خُطْبَةُ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ ثُمَّ يَقُولُ عَلَى إِثْرِ ذَلِكَ وَقَدْ عَلاَ صَوْتُهُ ‏.‏ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "Ja'far b. Muhammad said on the authority of his father:I heard Jabir b. 'Abdullah saying that in the sermon of the Messenger of Allah (ﷺ) he praised Allah, lauded Him (and subsequently said [other words] and raised his voice, and the rest of the hadith is the same",
          "ur": "سلیمان بن بلال نے کہا : مجھ سے جعفر بن محمد نے اپنے نے اپنے والد سے روایت کی انھوں نے کہا : میں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا وہ کہتے تھے جمعے کے دن نبی اکرم صلی اللہ علیہ وسلم کا خطبہ اس طرح ہوتا تھاکہ آپ اللہ تعا لیٰ کی حمد و ثناء بیان کرتے پھر اس کے بعد آپ ( اپنی بات ارشاد فر ما تے اور آپ کی اواز بہت بلند ہو تی ۔ ۔ ۔ پھر اس ( سابقہ حدیث ) کے مانند حدیث بیان کی ۔",
          "fr": "Rapporté par Ja’far ibn Muhammad, d’après son père : J’ai entendu Jabir ibn ‘Abdullah dire que, lors du sermon du Messager d’Allah ﷺ, il louait Allah, Le glorifiait, puis élevait la voix (et la suite du hadith est similaire)",
          "tr": "Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Hâlid b. Mahled rivayet etti. (Dediki): Bana Süleyman b. Bilâl rivayet etti. (Dedi kî) : Bana Ca'fer b. Muhammed, babasından naklen rivayet etti. Demiş ki: Câbir b. Abdülâhı : «Nebi (Sallallahu Aleyhi ve Sellem) 'in cum'a günkü hutbesi şöyle idî : (evvelâ) Allaha hamdü sena eder, sonra onun ardınca sesi yükselmiş olarak konuşurdu... diyerek yukariki hadîs gibi rivayet ederken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 2007,
      "arabicNumber": "867.03",
      "book": 7,
      "hadithInBook": 57,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ النَّاسَ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ يَقُولُ ‏ \"‏ مَنْ يَهْدِهِ اللَّهُ فَلاَ مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلاَ هَادِيَ لَهُ وَخَيْرُ الْحَدِيثِ كِتَابُ اللَّهِ ‏\"‏ ‏.‏ ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ الثَّقَفِيِّ ‏.‏",
        "translations": {
          "en": "Jabir reported that the Messenger of Allah (ﷺ), while delivering the sermon' to the people, praised Allah, and lauded Him for what He deserves, and would then say:He whom Allah guides aright, there is none to mislead him, and he who is led astray, there is none to guide him (aright), and the best of the talk is embodied in the Book of Allah. And the rest of the hadith is the same",
          "ur": "سفیان نے جعفر سے انھوں نے اپنے والد ( محمد باقر ) سے اور انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم لو گوں کو ( اس طرح ) خطبہ دیتے پہلے اللہ کی شان کے مطابق اس کی حمد و ثنا ء بیان کرتے پھر فر ما تے ۔ \" جسے اللہ سیدھی راہ پر چلا ئے اسے کو ئی گمراہ نہیں کر سکتا اور جسے وہ سیدھی راہ سے ہٹا دے اسے کو ئی ہدایت نہیں دے سکتا اور بہترین بات ( حدیث ) اللہ کی کتاب ہے ۔ ۔ ۔ \" آگے ( عبد الوہاب بن عبد المجید ) ثقفی کی حدیث ( 2005 ) کے ما نند ہے ۔",
          "fr": "Rapporté par Jabir رضي الله عنه : Le Messager d’Allah ﷺ, lorsqu’il prononçait le sermon devant les gens, louait Allah et Le remerciait comme Il le mérite, puis disait : « Celui qu’Allah guide, nul ne peut l’égarer, et celui qu’Il égare, nul ne peut le guider. La meilleure parole est celle contenue dans le Livre d’Allah. » Et le reste du hadith est identique",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Vekî', Süfyân'dan, o da Ca'fer'den, o da babasından, o da Câbir'den naklen rivayet etti. Şöyle demiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) cemaate hutbe okurken. (Evvelâ) Allaha lâyık olduğu veçhile hamdü sena eyler; sonra : «Bir kimseye Allah hidâyet verirse artık onu saptıracak yoktur; Allahın saptırdığına da hidâyet verecek yoktur. Sözün en hayırlısı Allanın Kitabıdır.» [Men yehdillahu.... ila ahir....] buyururdu. Bundan sonra râvî hadîsi Sakafî'nin hadisi gibi rivayet etti. İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 2008,
      "arabicNumber": "868",
      "book": 7,
      "hadithInBook": 58,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، كِلاَهُمَا عَنْ عَبْدِ الأَعْلَى، - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الأَعْلَى، وَهُوَ أَبُو هَمَّامٍ - حَدَّثَنَا دَاوُدُ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ ضِمَادًا، قَدِمَ مَكَّةَ وَكَانَ مِنْ أَزْدِ شَنُوءَةَ وَكَانَ يَرْقِي مِنْ هَذِهِ الرِّيحِ فَسَمِعَ سُفَهَاءَ مِنْ أَهْلِ مَكَّةَ يَقُولُونَ إِنَّ مُحَمَّدًا مَجْنُونٌ ‏.‏ فَقَالَ لَوْ أَنِّي رَأَيْتُ هَذَا الرَّجُلَ لَعَلَّ اللَّهَ يَشْفِيهِ عَلَى يَدَىَّ - قَالَ - فَلَقِيَهُ فَقَالَ يَا مُحَمَّدُ إِنِّي أَرْقِي مِنْ هَذِهِ الرِّيحِ وَإِنَّ اللَّهَ يَشْفِي عَلَى يَدِي مَنْ شَاءَ فَهَلْ لَكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْحَمْدَ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ مَنْ يَهْدِهِ اللَّهُ فَلاَ مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلاَ هَادِيَ لَهُ وَأَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَمَّا بَعْدُ ‏\"‏ ‏.‏ قَالَ فَقَالَ أَعِدْ عَلَىَّ كَلِمَاتِكَ هَؤُلاَءِ ‏.‏ فَأَعَادَهُنَّ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ - قَالَ - فَقَالَ لَقَدْ سَمِعْتُ قَوْلَ الْكَهَنَةِ وَقَوْلَ السَّحَرَةِ وَقَوْلَ الشُّعَرَاءِ فَمَا سَمِعْتُ مِثْلَ كَلِمَاتِكَ هَؤُلاَءِ وَلَقَدْ بَلَغْنَ نَاعُوسَ الْبَحْرِ - قَالَ - فَقَالَ هَاتِ يَدَكَ أُبَايِعْكَ عَلَى الإِسْلاَمِ - قَالَ - فَبَايَعَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَعَلَى قَوْمِكَ ‏\"‏ ‏.‏ قَالَ وَعَلَى قَوْمِي - قَالَ - فَبَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم سَرِيَّةً فَمَرُّوا بِقَوْمِهِ فَقَالَ صَاحِبُ السَّرِيَّةِ لِلْجَيْشِ هَلْ أَصَبْتُمْ مِنْ هَؤُلاَءِ شَيْئًا فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَصَبْتُ مِنْهُمْ مِطْهَرَةً ‏.‏ فَقَالَ رُدُّوهَا فَإِنَّ هَؤُلاَءِ قَوْمُ ضِمَادٍ ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas reported:Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad (ﷺ) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah (ﷺ) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah (ﷺ) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah (ﷺ) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah (ﷺ) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad",
          "ur": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ضمادمکہ آیا ، وہ ( قبیلہ ) از دشنوء سے تھا اور آسیب کا دم کیا کرتا تھا ( جسے لوگ ریح کہتے تھے ، یعنی ایسی ہوا جو نظرنہیں آتی ، اثر کرتی ہے ) اس نے مکہ کے بے وقوفوں کو یہ کہتے سنا کہ محمد ( صلی اللہ علیہ وسلم ) کو جنون ہوگیا ہے ( نعوذ باللہ ) اس نے کہا : اگر میں اس آدمی کو دیکھ لوں تو شاید اللہ تعالیٰ اسے میرے ہاتھوں شفا بخش دے ۔ کہا : وہ آپ سے ملا اور کہنے لگا : اے محمد صلی اللہ علیہ وسلم !میں اس نظر نہ آنے والی بیماری ( ریح ) کو زائل کرنے کے لئے دم کرتا ہوں اور اللہ تعالیٰ جسے چاہتا ہے میرے ہاتھوں شفا بخشتا ہے تو آپ کیا چاہتے ہیں ( کہ میں دم کروں؟ ) رسول اللہ صلی اللہ علیہ وسلم نے ( جواب میں ) کہا : \" ان الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل فلا هادي له واشهد ان لا اله الا الله وحده لا شريك له وان محمدا عبده ورسوله اما بعد \" یقیناً تمام حمد اللہ کے لیے ہے ، ہم اسی کی حمد کرتے ہیں اور اسی سے مدد مانگتے ہیں ، جس کو اللہ سیدھی راہ پرچلائے ، اسے کوئی گمراہ نہیں کرسکتا اور جسے وہ گمراہ چھوڑ دے ، اسے کوئی راہ راست پر نہیں لاسکتا اور میں گواہی دیتا ہوں کہ اللہ کے سواکوئی سچا معبود نہیں ، وہی اکیلا ( معبود ) ہے ، ا س کا کوئی شریک نہیں اور بلاشبہ محمد ( صلی اللہ علیہ وسلم ) اس کا بندہ اور اس کا رسول ہے ، اس کے بعد! \" کہا : وہ بول اٹھا : اپنے یہ کلمات مجھے دوبارہ سنائیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے تین مرتبہ یہ کلمات اس کے سامنے دہرائے ۔ اس پر اس نے کہا : میں نے کاہنوں ، جادوگروں اور شاعروں ( سب ) کے قول سنے ہیں ، میں نے آپ کے ان کلمات جیسا کوئی کلمہ ( کبھی ) نہیں سنا ، یہ تو بحر ( بلاغت ) کہ تہ تک پہنچ گئے ہیں اور کہنے لگا : ہاتھ بڑھایئے!میں آپ کے ساتھ اسلام پر بیعت کرتا ہوں ۔ کہا : تو اس نے آپ کی بیعت کرلی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اور تیری ( طرف سے تیری ) قوم ( کے اسلام ) پر بھی ( تیری بیعت لیتاہوں ) \" اس نے کہا : اپنی قوم ( کے اسلام ) پر بھی ( بیعت کرتاہوں ) اس کے بعد آپ نے ایک سریہ ( چھوٹا لشکر ) بھیجا ، وہ ان کی قوم کے پاس سے گزرے تو امیر لشکر نے لشکر سے پوچھا : کیا تم نے ان لوگوں سے کوئی چیز لی ہے؟تو لوگوں میں سے ایک شخص نے کہا : میں نے ان سے ایک لوٹا لیا ہے اس نے کہا : اسے واپس کردو کیونکہ یہ ( کوئی اور نہیں بلکہ ) ضماد رضی اللہ تعالیٰ عنہ کی قوم ہے ۔",
          "fr": "Rapporté par Ibn Abbas رضي الله عنه : Dimad vint à La Mecque ; il appartenait à la tribu d’Azd Shanu’a et avait l’habitude de soigner ceux qui étaient sous l’emprise d’un charme. Il entendit des gens insensés de La Mecque dire que Muhammad ﷺ était ensorcelé. Il dit alors : « Si je rencontre cet homme, peut-être qu’Allah le guérira par mes mains. » Il le rencontra et dit : « Muhammad, je peux protéger celui qui est sous l’effet d’un charme, et Allah guérit qui Il veut par mes mains. Veux-tu cela ? » Le Messager d’Allah ﷺ répondit : « Louange à Allah, nous Le louons, demandons Son aide ; celui qu’Allah guide, nul ne peut l’égarer, et celui qu’Il égare, nul ne peut le guider. J’atteste qu’il n’y a pas de divinité en dehors d’Allah, Unique, sans associé, et que Muhammad est Son serviteur et Son Messager. » Après cela, Dimad dit : « Répète ces paroles devant moi. » Le Messager d’Allah ﷺ les répéta trois fois. Dimad dit alors : « J’ai entendu les paroles des devins, des magiciens et des poètes, mais jamais je n’ai entendu de paroles comme les tiennes ; elles vont au fond des choses. Donne-moi ta main pour que je te prête serment d’allégeance à l’islam. » Il lui prêta donc serment. Le Messager d’Allah ﷺ dit : « Ce serment est aussi pour ton peuple. » Il répondit : « Oui, pour mon peuple aussi. » Plus tard, une expédition envoyée par le Prophète ﷺ passa près de son peuple. Le chef de la troupe demanda : « Avez-vous trouvé quelque chose chez ces gens ? » Quelqu’un répondit : « J’ai trouvé un récipient pour l’eau. » Le chef dit : « Rendez-le, car il fait partie du peuple de Dimad. »",
          "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Al Mutsanna] keduanya dari [Al A'la] - [Ibnul Mutsanna] berkata- telah menceritakan kepadaku [Abdul A'la] ia adalah Abu Hammam, telah menceritakan kepada kami [Dawud] dari [Amru bin Sa'id] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwasanya; \"Suatu ketika, Dlimam pernah datang ke Makkah. Dia berasal dari Azdi Syanu`ah, dan pandai meruqyah (mengobati dengan bacaan-bacaan tertentu) seorang yang gila atau terkena gangguan jin. Kemudian pada suatu hari ia mendengar orang-orang bodoh penduduk Makkah mengatakan bahwa Muhammad itu gila. Maka Dlimad berkata, \"Sekiranya aku dapat melihat laki-laki ini, mudah-mudahan Allah menyembuhkannya melalui tanganku.\" Maka Dlimad pun menemui beliau, dan berkata, \"Wahai Muhammad, saya biasa meruqyah penyakit ini, dan Allah akan menyembuhkan melaliau tanganku siapa saja yang dikehendakinya. Maukah kamu?\" Maka Rasulullah shallallahu 'alaihi wasallam membaca: \"INNAL HAMDA LILLAHI NAHMADUHU WA NASTA'IINUHU MAN YAHDIHILLAHU FALAA MUDLILLA LAHU WA MAN YUDLLIL FALAA HAADLIYA LAHU WA ASYHADU AN LAA ILAAHA ILLALLAH WAHDAHU LAA SYARIIKA LAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH AMMA BA'DU.\" Dlimad berkata, \"Ulangilah lagi kata-katamu tadi.\" Maka Nabi shallallahu 'alaihi wasallam pun mengulanginya kembali hingga tiga kali. Akhirnya Dlimad berkata, \"Aku telah mendengar kata-kata tukang tenun, kata-kata tukang sihir dan kata-kata tukang sya'ir tetapi aku belum pernah mendengar kata-kata seperti yang Anda ucapkan itu, akupun juga pernah mengarungi lautan. Berikanlah tangan Anda padaku, aku akan bersumpah setia dengan Anda untuk memeluk Islam.\" Maka beliau pun membai'atnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dan juga untuk kaummu.\" Dlimad berkata, \"Ya, juga untuk kaumku.\" Tidak berapa lama kemudian, Rasulullah shallallahu 'alaihi wasallam mengutus Sariyah (pasukan khusus yang ditugaskan utuk operasi tertentu), lalu mereka melewati kaumnya Dlimad. Lalu komandan pasukan itu bertanya kepada para prajuritnya, \"Adakah kalian mengambil sesuatu dari kampun itu?\" maka seorang laki-laki menyahut, \"Ada, saya telah mengambil ember mereka.\" maka sang komandan pun berkata, \"Kembalikanlah. Karena mereka adalah kaumnya Dlimad",
          "tr": "Bize İshâk b. İtrâhîm ile Muhammed b. Müsennâ ikisi birden Abdi'la'lâ'dan rivayet ettiler. İbnü'l-Müsennâ Dediki: Bana Abdi'l-a'lâ —ki Ebû Hemmâmdır— rivayet etti. (Dediki): Bize Dâvûd, Amr b. Saîd'den, o da Saîd b. Cübeyr'den, o da İbni Abbas'dan naklen rivayet ettiki: Dımâd Mekke'ye gelmiş. Kendisi Ezd-i Şenûe kabilesinden olup delilere okurmuş. Mekkeli bazı alçakların «Muhammed delidir» dediklerini işitmiş. Bunun üzerine (kendi kendine): «Şu zâtı bir görsem!.. belki Allah ona benim elimde şifâ nâsîb eder» demiş. Sonra ona tesadüf ederek: «Yâ Muhammedi Ben delilere okurum; hem Allah benim elimde dilediğine şifâ ihsan eder. Okumamı istermisin?» demiş. Resûlullah (Sallallahu Aleyhi ve Sellem) şu mukabelede bulunmuş: «Şüphesiz ki hamd Allaha mahsustur. Biz ona hamd eder; ondan yardım dileriz. Her kime Allah hidâyet verirse artık onu şaşırtacak kimse yoktur. Kimi şaşırtırsa onu da hidâyete erdirecek yoktur. Ben Allahdan başka ilâh olmadığına, bir Allah olup şeriki bulunmadığına; Muhammed'in de onun kulu ve resulü olduğuna şehâdet ederim. Bundan sonra. ...» Dımâd : — Şu sözlerini bana bir daha tekrarla! demiş. Resûlullah (Sallallahu Aleyhi ve Sellem) bunları ona üç defa tekrarlamış. Bunun üzerine Dımâd: «Vallahi ben kâhinlerin sözlerini de, sihirbazların sözlerini de, şâirlerin sözlerini de dinledim; ama senin şu sözlerin gibi hiç bir söz işitmedim. Bunlar gerçekten deryanın dibine vardı. Ver elini sana islâmiyet üzerine bîat edeyim!» diyerek ona bîat etmiş. Resûiullah (Sallallahu Aleyhi ve Sellem): «Kavmin için de mi?» buyurmuşlar. Dımâd : —(Evet) kavmim nâmına da., demiş. Derken Resûlullah (Sallallahu Aleyhi ve Sellem) (bir tarafa) bir seriyye göndermiş. Bunlar Dımâd'ın kavmine uğramışlar. Seriyyenin kumandanı askerlerine: — Bunlardan bir şey aldınız mı? diye sormuş. Oradakilerden biri: — Ben onlardan bir matara aldım; demiş. Kumandan: __ Onu sahibine iade edin; çünkü bunlar Dımâd'ın kavmidir; mukaabelesinde bulunmuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 2009,
      "arabicNumber": "869",
      "book": 7,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ، عَنْ أَبِيهِ، عَنْ وَاصِلِ بْنِ حَيَّانَ، قَالَ قَالَ أَبُو وَائِلٍ خَطَبَنَا عَمَّارٌ فَأَوْجَزَ وَأَبْلَغَ فَلَمَّا نَزَلَ قُلْنَا يَا أَبَا الْيَقْظَانِ لَقَدْ أَبْلَغْتَ وَأَوْجَزْتَ فَلَوْ كُنْتَ تَنَفَّسْتَ ‏.‏ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ طُولَ صَلاَةِ الرَّجُلِ وَقِصَرَ خُطْبَتِهِ مَئِنَّةٌ مِنْ فِقْهِهِ فَأَطِيلُوا الصَّلاَةَ وَاقْصُرُوا الْخُطْبَةَ وَإِنَّ مِنَ الْبَيَانِ سِحْرًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Wa'il reported:'Ammar delivered to us the sermon. It was short and eloquent. When he (, Ammir) descended (from the pulpit) we said to him: 0 Abd al-Yaqzn, you have delivered a short and eloquent sermon. Would that you had lengthened (the sermon). He said: I have heard the Messenger of Allah (ﷺ) as saying: The lengthening of prayer by a man and the shortness of the sermon is the sign of his understanding (of faith). So lengthen the prayer and shorten the sermon, for there is charm (in precise) expression",
          "ur": "ابو وائل نے کہا : ہمارے سامنے حضرت عمار رضی اللہ تعالیٰ عنہ نے خطبہ دیا ۔ انتہائی مختصر اورانتہائی بلیغ ( بات کی ) جب وہ منبر سے اترے تو ہم نے کہا : ابویقظان! آپ نے انتہائی پر تاثیر اور انتہائی مختصر خطبہ دیاہے ، کاش! آپ سانس کچھ لمبی کرلیتے ( زیادہ دیر بات کرلیتے ) انھوں نے فرمایا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے : \" انسان کی نماز کا طویل ہونا اوراس کے خطبے کاچھوٹا ہونا اس کی سمجھداری کی علامت ہے ، اس لئے نماز لمبی کرو اور خطبہ چھوٹا دو ، اوراس میں کوئی شبہ نہیں کہ کوئی بیان جادو ( کی طرح ) ہوتا ہے ۔",
          "fr": "Rapporté par Abu Wa’il رضي الله عنه : Ammar رضي الله عنه nous a fait un sermon court et éloquent. Quand il est descendu, nous lui avons dit : « Ô Abd al-Yaqzn, tu as fait un sermon court et éloquent. Si seulement tu l’avais un peu allongé. » Il répondit : « J’ai entendu le Messager d’Allah ﷺ dire : “La longueur de la prière et la brièveté du sermon sont un signe de compréhension (de la religion). Allongez donc la prière et raccourcissez le sermon, car il y a de la beauté dans la concision.” »",
          "id": "Telah menceritakan kepadaku [Suraij bin Yunus] telah menceritakan kepada kami [Abdurrahman bin Abdul Malik bin Abjar] dari [bapaknya] dari [Washil bin Hayyan] ia berkata, [Abu Wa`il] berkata; [Ammar] pernah menyampaikan khutbah Jum'at kepada kami dengan bahasa yang singkat dan padat. Maka ketika ia turun dari mimbar, kami pun berkata kepadanya, \"Wahai Abu Yaqzhan! Khutbah Anda begitu singkat dan padat. Alangkah baiknya kalau Anda panjangkan lagi.\" Ammar berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya lamanya shalat dan pendeknya khutbah seseorang itu menunjukkan tentang pemahaman ia tentang agamanya. Karena itu, panjangkanlah shalat dan pendekkanlah khutbah, karena sebagian dari bayan (penjelasan) adalah sihir",
          "tr": "Bana Süreye b. Yûnus rivayet etti. (Dediki): Bize Abdurrahmân b. Abdilmelik b. Ebcer, babasından, o da Vâsıl b. Hayyân'dan naklen rivayet etti. Demişki: Ebû Vâil şunları söyledi: Bize Ammâr hutbe okudu, ama hutbeyi hem kısa; hemde belîğ bir şekilde okudu. Minberden inince (kendisine). — Yâ Ebe'l-Yakzân! Hakîkaten vecîz ve belîg bir hutbe îrâd ettin. Biraz daha uzatsan iyi ederdin, dedik. Bunun üzerine Ammâr: — Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i: «Şüphesiz ki kişinin namazı uzun, hutbeyi kısa tutması anlayışlı olduşuna alâmetdir. Binâenaleyh siz, namazı uzun tutun fakat hutbeyi kısa kesin. Muhakkak beyânın sihir olanı vardır.» buyururken işittim, dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 2010,
      "arabicNumber": "870",
      "book": 7,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّ رَجُلاً، خَطَبَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ رَشِدَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بِئْسَ الْخَطِيبُ أَنْتَ ‏.‏ قُلْ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ نُمَيْرٍ فَقَدْ غَوِيَ ‏.‏",
        "translations": {
          "en": "Adi b. Hatim reported:that a person recited a sermon before the Messenger of Allah (ﷺ) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah (ﷺ) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray",
          "ur": "ابو بکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے کہا : ہمیں وکیع نے سفیان سے حدیث بیان کی ، انھوں نے عبدالعزیز بن رفیع سے ، انھوں نے تمیم بن طرفہ سے اور انھوں نے حضرت عدی بن حاتم رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے خطبہ دیا اور ( اس میں ) کہا : جو اللہ اور اس کے رسو ل کی اطاعت کرتاہے اس نے رشدوہدایت پالی اور جو ان دونوں کی نافرمانی کرتاہے وہ بھٹک گیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تو بُرا خطیب ہے ، ( فقرے کے پہلے حصے کی طرح ) یوں کہو ، جس نے اللہ کی اور اس کے ر سول کی نافرمانی کی ( وہ گمراہ ہوا ۔ ) \"\" ابن نمیر کی ر وایت میں غوي ( واہ کے نیچے زیر ) ہے ۔",
          "fr": "Rapporté par ‘Adi ibn Hatim رضي الله عنه : Un homme fit un sermon devant le Messager d’Allah ﷺ en disant : « Celui qui obéit à Allah et à Son Messager suit le droit chemin, et celui qui leur désobéit s’égare. » Le Messager d’Allah ﷺ dit alors : « Quel mauvais orateur tu es ! Dis plutôt : “Celui qui désobéit à Allah et à Son Messager.” » Ibn Numair ajouta : « Il s’est en effet égaré. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammd bin Abdullah bin Numair] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abdul Aziz bin Rufai'] dari [Tamim bin Tharafah] dari [Adi bin Hatim] bahwa seorang laki-laki berkhutbah di sisi Nabi shallallahu 'alaihi wasallam seraya berkata, \"Barangsiapa yang taat kepada Allah dan Rasul-Nya, maka ia telah mendapat petunjuk, dan siapa yang bermaksiat kepada keduanya, maka ia telah tersesat.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seburuk-buruk Khathib adalah kamu. Maka katakanlah, 'Dan barangsiapa yang bermaksiat kepada Allah dan Rasul-Nya.\" Ibnu Numair mengatakan; \"Maka ia telah tersesat",
          "tr": "Bize Ebû Bekir b. Ebi Şeybe ile Muhammed b. Abdillâh b. Nümeyr rivayet ettiler. Dedilerki: Bize Vekî', Süfyân'dan, o da Abdülazîz b. Rufey'den, o da Temîm b. Tarafe'den, o da Adiyyu'bnu Hâtîm'den naklen rivayet ettiki, Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'in yanında hutbe okuyarak : — Her kim Allah ve Resulüne itaat ederse, muhakkak doğru yalu bulnuşdur. Onlara isyan eden ise muhakkak sapmışdır; demiş. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) : «Sen ne fena hatîbsin! (onlara diyeceğine) Allah ve Resulüne isyan eden ise muhakkak sapmışdır de.» buyurmuşlar. îbni Numeyr «Gavâ» kelimesini «Gaviye» şeklinde söyledi. İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 2011,
      "arabicNumber": "871",
      "book": 7,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَاقُ الْحَنْظَلِيُّ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ، - عَنْ عَمْرٍو، سَمِعَ عَطَاءً، يُخْبِرُ عَنْ صَفْوَانَ بْنِ، يَعْلَى عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ عَلَى الْمِنْبَرِ ‏{‏ وَنَادَوْا يَا مَالِكُ‏}‏",
        "translations": {
          "en": "Safwan b. Ya'la reported on the authority of his father that he heard the Messenger of Allah (ﷺ) reciting (verses of the Qur'an) on the pulpit. and\" They cried:0 Malik",
          "ur": "صفوان کے والد حضرت یعلیٰ بن امیہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر پڑھ رہے تھے : وَنَادَوْا يَا مَالِكُ \" اور وہ پکاریں گے : اے مالک! \" ( الزخرف 77 :)",
          "fr": "Rapporté par Safwan ibn Ya’la d’après son père رضي الله عنه : Il a entendu le Messager d’Allah ﷺ réciter des versets du Coran sur le minbar, notamment : « Ils ont crié : Ô Malik. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakar bin Abu Syaibah] dan [Ishaq Al Hanzhali] semuanya dari [Ibnu Uyainah] - [Qutaibah berkata] - telah menceritakan kepada kami [Sufyan] dari [Amru] ia mendengar [Atha`] mengabarkan kepadanya dari [Shafwan bin Ya'la] dari [bapaknya] bahwa ia mendengar Nabi shallallahu 'alaihi wasallam membaca (ayat) di atas mimbar. Dan mereka memanggil, \"Wahai Malik",
          "tr": "Bize Kuteybetü'bnu Saîd ile Ebû Bekir b. Ebî Şeybe ve İshâk-i Hanzalî toptan İbni Uyeyne'den rivayet ettiler. Kuteybe Dediki: Bize Süfyân, Amr'dan naklen rivayet etti. Anır, Atâ'dan, o da Safvân b. Ya'lâ'dan, o da babasından naklen haber verirken işitmiş. Ya'lâ, Peygamber (Sallallahu Aleyhi ve Sellem)'i minber üzerinde: «Cehennemlikler [ Zuhruf 77 ] : Ey Mâlik! diye çağrışacaklar.» âyet-i kerimesini okurken işitmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 2012,
      "arabicNumber": "872.01",
      "book": 7,
      "hadithInBook": 62,
      "text": {
        "arabic": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا سُلَيْمَانُ، بْنُ بِلاَلٍ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ أُخْتٍ، لِعَمْرَةَ قَالَتْ أَخَذْتُ ‏{‏ ق وَالْقُرْآنِ الْمَجِيدِ‏}‏ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ وَهُوَ يَقْرَأُ بِهَا عَلَى الْمِنْبَرِ فِي كُلِّ جُمُعَةٍ ‏.‏",
        "translations": {
          "en": "Amra daughter of Abd al-Rahman reported on the authority of the sister of Amra:I memorised (surah) \"Qaf, by the glorious Qur'an\" from the mouth of the Messenger of Allah (ﷺ) on Friday for he recited it on the pulpit on every Friday",
          "ur": "سلیمان بن بلال نے یحییٰ بن سعید سے روایت کی ، انھوں نے عمرہ بنت عبدالرحمان ( بن سعد بن زرارہ انصاریہ ) سے ، انھوں نے کہا : ( ماں کی طرف سے ) اپنی بہن کی طرف سے روایت کی ، انھوں نے کہا : میں نے سورہ ق ۚ وَالْقُرْ‌آنِ الْمَجِيدِ جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک سے سن کریاد کی ۔ آپ اسے ہر جمعے منبر پر پڑھ کر سنایا ( اور سمجھایا ) کرتے تھے ۔",
          "fr": "Rapporté par ‘Amra, fille de Abd al-Rahman, d’après la sœur de ‘Amra رضي الله عنها : J’ai mémorisé la sourate « Qaf, par le Coran glorieux » de la bouche du Messager d’Allah ﷺ, car il la récitait sur le minbar chaque vendredi",
          "id": "Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Yahya bin Sa'id] dari [Amrah binti Abdurrahman] dari [saudara perempuan Amrah], ia berkata, \"Aku menghafal surat Qaaf langsung dari mulut Rasulullah shallallahu 'alaihi wasallam, yakni ketika beliau membacanya beberapa kali di atas mimbar dalam khutbah Jum'at.\" Dan telah menceritakannya kepadaku [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahb] dari [Yahya bin Ayyub] dari [Yahya bin Sa'id] dari [Amrah] dari [saudara perempuan] Amrah binti Abdurrahman dan lebih besar darinya. yakni sebagaimana hadits Sulaiman bin Bilal",
          "tr": "Bana Abdullah b. Abdirrahmân ed-Dârimî rivayet etti. (Dediki): Bize Yahya b. Hassan haber verdi. (Dediki): Bize Süleyman b. Bilâl, Yahya b. Saîd'den, o da Amra binti Abdirrahmân'dan, o da Amra'nın bir kız kardeşinden naklen rivayet etti. Demişki: Ben Kaf sûresini cum'a günü Resulullah (Sallallahu Aleyhi ve Sellem)'in ağzından öğrendim. Onu her cum'a minberde okuyordu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 2013,
      "arabicNumber": "872.02",
      "book": 7,
      "hadithInBook": 63,
      "text": {
        "arabic": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ أُخْتٍ، لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ كَانَتْ أَكْبَرَ مِنْهَا ‏.‏ بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ ‏.‏",
        "translations": {
          "en": "The daughter of Haritha b. Nu'man said:I did not memorise (Surah) Qaf but from the mouth of the Messenger of Allah (ﷺ) as he used to deliver the. sermon along with it on every Friday. She also added: Our oven and that of the Messenger of Allah (ﷺ) was one",
          "ur": "یحییٰ بن ایوب نے یحییٰ بن سعید سے ، انھوں نے عمرہ سے اور انھوں نے اپنی بہن سے جو عمر میں ان سے بڑی تھیں ، روایت کی ۔ ۔ ۔ سلیمان بن بلال کی حدیث کے مانند ۔",
          "fr": "Rapporté par la fille de Haritha ibn Nu’man رضي الله عنها : Je n’ai mémorisé la sourate Qaf que de la bouche du Messager d’Allah ﷺ, car il la récitait lors de chaque sermon du vendredi. Elle ajouta aussi : « Notre four et celui du Messager d’Allah ﷺ étaient le même. »",
          "tr": "{….} Bu hadîsi bana Ebû't-Tahir dahî rivayet etti. (Dediki): Bize İbni Vehb, Yahya b; Eyyûb'dan, o da Yahya b. Saîd'den, o da Amra'dan, o da Amra binti Abdirrahmân'ın kendinden büyük olan bir kız kardeşinden naklen Süleyman b. Bilâl hadîsi gibi haber verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 2014,
      "arabicNumber": "873.01",
      "book": 7,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبٍ، عَنْ عَبْدِ، اللَّهِ بْنِ مُحَمَّدِ بْنِ مَعْنٍ عَنْ بِنْتٍ لِحَارِثَةَ بْنِ النُّعْمَانِ، قَالَتْ مَا حَفِظْتُ ‏{‏ ق‏}‏ إِلاَّ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم يَخْطُبُ بِهَا كُلَّ جُمُعَةٍ ‏.‏ قَالَتْ وَكَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاحِدًا ‏.‏",
        "translations": {
          "en": "Umm Bisham hint Haritha b. Nu'man said:Our oven and that of the Messenger of Allah (ﷺ) was one for two years, or for one year or for a part of a year; and I learnt\" Qaf. By the Glorious Qur'an\" from no other source than the tongue of Allah's Messenger (ﷺ) who used to recite it every Friday on the pulpit when he delivered the sermon to the people",
          "ur": "عبداللہ بن محمد بن معن نے حارثہ بن نعمان کی بیٹی ( ام ہشام ) سے روایت کی ، انھوں نے کہا : میں نے سورہ ق ( کسی اور سے نہیں براہ راست ) رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی ، آپ ہر جمعے میں اسےپڑھ کر خطاب فرماتے تھے ۔ انھوں نے کہا : ہمارا اور رسول اللہ صلی اللہ علیہ وسلم کا تندور ایک ہی تھا ۔",
          "fr": "Rapporté par Umm Bisham bint Haritha ibn Nu’man رضي الله عنها : Notre four et celui du Messager d’Allah ﷺ étaient le même pendant deux ans, ou pendant un an ou une partie d’une année. Et je n’ai appris « Qaf. Par le Coran glorieux » que de la bouche du Messager d’Allah ﷺ, qui la récitait chaque vendredi sur le minbar lorsqu’il faisait le sermon aux gens",
          "tr": "Bana Muhammed b. Beşşâr rivayet etti. (Dediki):. Bize, Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Hubeyb'den, o da Abdullah b. Muhammed b. Ma'n'dan, o da Hârisetü'bnu Nu'mân'ın bir kızından naklen rivayet etti. Şöyle demiş : «Ben, Kaaf sûresini ancak Resulullah (Sallallahu Aleyhi ve Sellem)'in (mübarek) ağzından belledim. Onu her cum'a hutbede okurdu. Bizim tandırımızla, Resulullah (Sallallahu Aleyhi ve Sellem)'\\n tandırı birdi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 2015,
      "arabicNumber": "873.02",
      "book": 7,
      "hadithInBook": 65,
      "text": {
        "arabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ، بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ الأَنْصَارِيُّ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ، عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ، قَالَتْ لَقَدْ كَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاحِدًا سَنَتَيْنِ أَوْ سَنَةً وَبَعْضَ سَنَةٍ وَمَا أَخَذْتُ ‏{‏ ق وَالْقُرْآنِ الْمَجِيدِ‏}‏ إِلاَّ عَنْ لِسَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقْرَؤُهَا كُلَّ يَوْمِ جُمُعَةٍ عَلَى الْمِنْبَرِ إِذَا خَطَبَ النَّاسَ ‏.‏",
        "translations": {
          "en": "It was narrated that Umm Hisham bin Harithah bin An-Nu'man said:\"Our oven and the oven of the Messenger of Allah (ﷺ) were the same for two years, or for one year and part of a year. And I only learned \"Surah Qaf. By the Glorious Quran\" from the tongue of the Messenger of Allah (ﷺ), who used to recited it every Friday from the Minbar, when he addresses the people",
          "ur": "یحییٰ بن عبداللہ بن عبدالرحمان بن سعد نے زرارہ نے ام ہشام بنت حارثہ بن نعمان رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہمارا اور رسول اللہ صلی اللہ علیہ وسلم کا تندور دو یا ایک سال سے کچھ زیادہ عرصہ ایک ہی رہا اور میں نے سورہ ق ۚ وَالْقُرْ‌آنِ الْمَجِيدِ ( کسی اور سے نہیں بلکہ ) رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی ، آپ ہر جمعے کے دن جب لوگوں کو خطبہ دیتے تو اسے منبر پر پڑھتے تھے ۔",
          "fr": "Rapporté par Umm Hisham bint Haritha ibn Nu’man رضي الله عنها : Notre four et celui du Messager d’Allah ﷺ étaient le même pendant deux ans, ou pendant un an et une partie d’une année. Et je n’ai appris la sourate « Qaf. Par le Coran glorieux » que de la bouche du Messager d’Allah ﷺ, qui la récitait chaque vendredi depuis le minbar lorsqu’il s’adressait aux gens",
          "id": "Dan Telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [bapakku] dari [Muhammad bin Ishaq] ia berkata, telah menceritakan kepadaku [Abdullah bin Abu Bakar bin Muhammad bin Amru bin Hazm Al Anshari] dari [Yahya bin Abdullah bin Abdurrahman bin Sa'd bin Zurarah] dari [Ummi Hisyam binti Haritsah bin Nu'man] ia berkata, \"Tempat pembuatan roti kami dan tempat pembuatan roti Rasulullah shallallahu 'alaihi wasallam adalah sama selama dua atau satu tahun lebih, dan tidaklah saya menghafal surat 'QAAF WAL QUR`ANIL MAJIID' kecuali dari lisan Rasulullah shallallahu 'alaihi wasallam, beliau membacanya pada setiap hari Jum'at di atas mimbar saat beliau menyampaikan khutbah kepada manusia",
          "tr": "Bize, Amru'n-Nâkıd rivayet etti. (Dediki): Bize Ya'kûb b. İbrâhîm b. Sa'd rivayet etti. (Dediki): Bize babam, Muhammed b. İshâk'dan rivayet etti. Demişki: Bana Abdullah b. Ebî Bekir b. Muhammed b. Amr b. Hazm EI-Ensârî, Yahya b. Abdillâh b. Abdirrahmân b. Sa'd b. Zürâra'dan, o da Ümmü Hişâm binti Hârisete'bni Nu'mân'dan naklen rivayet etti. Ümmü Hişâm şöyle demiş : «Gerçekden iki sene yahut bir seneden biraz fazla müddet zarfında bizim tandırımızla Resûlullah (Sallallahu Aleyhi ve Sellem)'in tandırı birdi. Ben Kaaf sûresini ancak Resulullah (Sallallahu Aleyhi ve Sellem)'in dilinden öğrendim. Onu her cum'a cemaata hutbe îrâd ederken minberde okurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 65
      }
    },
    {
      "hadithNumber": 2016,
      "arabicNumber": "873.03",
      "book": 7,
      "hadithInBook": 66,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، عَنْ عُمَارَةَ، بْنِ رُؤَيْبَةَ قَالَ رَأَى بِشْرَ بْنَ مَرْوَانَ عَلَى الْمِنْبَرِ رَافِعًا يَدَيْهِ فَقَالَ قَبَّحَ اللَّهُ هَاتَيْنِ الْيَدَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا يَزِيدُ عَلَى أَنْ يَقُولَ بِيَدِهِ هَكَذَا ‏.‏ وَأَشَارَ بِإِصْبَعِهِ الْمُسَبِّحَةِ ‏.‏",
        "translations": {
          "en": "Umara b. Ruwaiba said he saw Bishr b. Marwan on the pulpit raising his hands and said:Allah, disfigure these hands! I have seen Allah's Messenger (ﷺ) gesture no more than this with his hands, and he pointed with his forefinger",
          "ur": "عبداللہ بن ادریس نے حصین سے اور انھوں نے حضرت عمارہ بن رویبہ ( ثقفی ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : انھوں نے بشر بن مروان ( بن حکم ، عامل مدینہ ) کو منبر پر ( تقریر کے دوران ) دونوں ہاتھ بلند کرتے دیکھا تو کہا : اللہ تعالیٰ ان دونوں ہاتھوں کو بگاڑے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنے ہاتھ سے اس سےزیادہ اشارہ نہیں کرتے تھے اور اپنی انگشت شہادت سے اشارہ کیا ۔",
          "fr": "Rapporté par Umara ibn Ruwaiba رضي الله عنه : Il a vu Bishr ibn Marwan lever les mains sur le minbar et il a dit : « Ô Allah, défigure ces mains ! J’ai vu le Messager d’Allah ﷺ ne faire aucun autre geste avec ses mains que celui-ci », et il montra son index",
          "id": "Dan Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Idris] dari [Hushain] dari [Umarah bin Ru`aibah] bahwa suatu ketika ia melihat Bisyra bin Marwan mengangkat kedua tangannya di atas mimbar, maka ia pun berkata; Semoga Allah menjelekkan kedua tangan ini. Sungguh, saya telah melihat Rasulullah shallallahu 'alaihi wasallam, beliau tidak menambah lagi setelah memberikan isyarat dengan tangannya seperti ini -ia pun memberi isyarat dengan jari telunjuknya-. Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu Awanah] dari [Hushain bin Abdurrahman] ia berkata; Saya melihat Bisyra bin Marwan pada hari Jum'at mengangkat kedua tangannya, maka [Umarah bin Ru`aibah] pun berkata. Kemudian ia pun menyebutkan hadits semisal",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdullah b. İdrîs, Husayn'dan, o da Umâratu'bnü Rueybe'den naklen rivayet etti. Rueybe, Bişru'bnü Mervân'ı minber üzerinde elllerini kaldırırken görerek: Allah bu ellerin cezasını versin! Vallahi ben Resulullah (Sallallahu Aleyhi ve Sellem) (duâ ederken) gördüm; ellerini şu kadarcıktan fazla kaldırmıyordu; dediğini söylemiş; ve şehâdet parmağı ile (ne kadar kaldırdığına) işaret etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 2017,
      "arabicNumber": "874",
      "book": 7,
      "hadithInBook": 67,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ رَأَيْتُ بِشْرَ بْنَ مَرْوَانَ يَوْمَ جُمُعَةٍ يَرْفَعُ يَدَيْهِ ‏.‏ فَقَالَ عُمَارَةُ بْنُ رُؤَيْبَةَ ‏.‏ فَذَكَرَ نَحْوَهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by another chain of transmitters on the authority of Husain b. Abd al-Rahman",
          "ur": "ابو عوانہ نے حصین بن عبدالرحمان سے روایت کی ، انھوں نے کہا : میں نے جمعے کے دن بشر بن مروان کو دونوں ہاتھ اٹھاتے ہوئے دیکھا تو اس پر عمارہ بن رویبہ رضی اللہ تعالیٰ عنہ نے کہا ۔ ۔ ۔ اس کے بعد اس ( مذکورہ بالا روایت ) کے ہم معنی روایت بیان کی ۔",
          "fr": "Rapporté par Husain ibn Abd al-Rahman رضي الله عنه : Ce hadith a été rapporté par une autre chaîne de transmetteurs selon Husain ibn Abd al-Rahman",
          "tr": "{….} Bize bu hadîsi Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize Ebû Avâne, Husayn b. Abdirrahmân'dan naklen rivayet etti. Husayn: «Ben Bişru'bnü Mervân'ı cum'a günü ellerini kaldırırken gördüm. Bunun üzerine Umâratü'bnü Rueybe şunları söyledi...» diyerek yukarıki hadis gibi rivayet etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 67
      }
    },
    {
      "hadithNumber": 2018,
      "arabicNumber": "875.01",
      "book": 7,
      "hadithInBook": 68,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا حَمَّادٌ، - وَ هُوَ ابْنُ زَيْدٍ - عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَصَلَّيْتَ يَا فُلاَنُ \"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ قُمْ فَارْكَعْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir b. 'Abdullah reported that while Allah's Messenger (ﷺ) was delivering the sermon on Friday a person came there, and the Messenger of Allah (ﷺ) said to him:So and so, have you prayed (two rak'ahs)? He said: No. He (the Holy Prophet) said: Then stand and pray",
          "ur": "حماد بن زید نے عمرو بن دینار سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : اسی اثناء میں جب جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے ایک آدمی ( مسجد میں ) آیا تو نبی کریم صلی اللہ علیہ وسلم نے اس سے پوچھا : \" اے فلاں ( نام لیا ) !کیا تو نے نماز پڑھ لی ہے؟ \" اس نے کہا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اور اٹھو اور نماز پڑھو ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Alors que le Messager d’Allah ﷺ prononçait le sermon du vendredi, un homme arriva et le Prophète ﷺ lui dit : « Untel, as-tu prié deux rak‘a ? » Il répondit : « Non. » Le Prophète ﷺ dit alors : « Lève-toi et prie. »",
          "id": "Dan Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] dan [Qutaibah bin Sa'id] keduanya berkata, telah menceritakan kepada kami [Hammad] ia adalah Ibnu Zaid dari [Amru bin Dinar] dari [Jabir bin Abdullah] ia berkata; Ketika Rasulullah shallallahu 'alaihi wasallam menyampaikan khutbah pada hari Jum'at, tiba-tiba datanglah seorang laki-laki dan Nabi shallallahu 'alaihi wasallam pun bertanya kepadanya: \"Apakah kamu telah menunaikan shalat (dua raka'at) wahai Fulan?\" laki-laki itu pun menjawab, \"Belum.\" Beliau bersabda: \"Bangun dan shalatlah.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ya'qub Ad Dauraqi] dari [Ibnu Ulayyah] dari [Ayyub] dari [Amru] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, yakni sebagaimana apa yang dikatakan Hammad, namun ia tidak menyebutkan dua raka'at",
          "tr": "Bize Ebu'r-Rabî' ez-Zehrânî ile Kuteybetü'bnü Saîd rivayet ettiler. Dedilerki: Bize Hammâd —ki İbni Zeyddir— Amr b. Dinar'dan, o da Câbir b. Abdillâh'dan naklen rivayet etti. Câbir şöyle demiş: «Bir cum'a günü Nebi (Sallallahu Aleyhi ve Sellem) hutbe okurken bir adam çıkageldi. Nebi (Sallallahu Aleyhi ve Sellem) ona: «Namaz kıldın mı ey fülân!» diye sordu. Gelen zât: — Hayır; cevâbını verdi. Resulullah (Sallallahu Aleyhi ve Sellem) : «Kalk namaz kıl!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 68
      }
    },
    {
      "hadithNumber": 2019,
      "arabicNumber": "875.02",
      "book": 7,
      "hadithInBook": 69,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَيَعْقُوبُ الدَّوْرَقِيُّ، عَنِ ابْنِ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم كَمَا قَالَ حَمَّادٌ وَلَمْ يَذْكُرِ الرَّكْعَتَيْنِ ‏.‏",
        "translations": {
          "en": "This hadith is narrated by Jabir through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs",
          "ur": "ایوب نے عمرو ( بن دینار ) سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے حماد کی طرح روایت کی ، اور انھوں ( ایوب ) نے بھی اس میں دو رکعت کا ذکر نہیں کیا ( البتہ اگلی روایت میں سفیان نے کیا ہے ۔)",
          "fr": "Rapporté par Jabir رضي الله عنه : Ce hadith est rapporté par Jabir selon une autre chaîne, mais Hammad (l’un des rapporteurs) ne mentionne pas les deux rak‘a",
          "tr": "{….} Bize Ebû Bekr b. Ebî Şeybe ije Ya'kubu Devrakî, İbni Uleyye'den, o da Eyyûb'dan, o da Amr'dan, o da Nebi (Sallallahu Aleyhi ve Sellem) 'den naklen Hammâd'ın dediği gibi rivayet etti. Yalnız (burada râvî) iki rekâtı zikretmemiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 2020,
      "arabicNumber": "875.03",
      "book": 7,
      "hadithInBook": 70,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُتَيْبَةُ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ دَخَلَ رَجُلٌ الْمَسْجِدَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَالَ ‏\"‏ أَصَلَّيْتَ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ قُمْ فَصَلِّ الرَّكْعَتَيْنِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ قُتَيْبَةَ قَالَ ‏\"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir b. 'Abdullah said that a person entered the Mosque while the Messenger of Allah (ﷺ) was delivering the sermon on Friday. Upon this he (the Holy Prophet) said:Have you observed prayer? He said: No. He (the Holy Prophet) said: Stand and offer the two rak'ahs. According to Qutaiba, the words are:\" He said: Offer two rak'ahs",
          "ur": "قتیبہ بن سعید اور اسحاق بن ابراہیم میں سے قتیبہ نے کہا : ہمیں حدیث سنائی اور اسحاق نے کہا : ہمیں خبر دی سفیان نے عمرو سے ، انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سےسنا ، وہ کہہ رہے تھے : ایک آدمی مسجد میں داخل ہوا جب رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن خطبہ دےرہے تھے ۔ تو آپ نے پوچھا : \" کیا تم نے نماز پڑھ لی؟ \" اس نے کہا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اٹھو اور دو رکعتیں پڑھ لو ۔ \" قتیبہ کی حدیث میں ( فصل ركعتين کے بجائے ) صل ركعتين ( دو رکعتیں پڑھو ) ہے ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Un homme entra dans la mosquée pendant que le Messager d’Allah ﷺ prononçait le sermon du vendredi. Le Prophète ﷺ lui demanda : « As-tu accompli la prière ? » Il répondit : « Non. » Le Prophète ﷺ dit alors : « Lève-toi et accomplis les deux rak‘a. » Selon Qutaiba, il dit : « Accomplis deux rak‘a. »",
          "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ishaq bin Ibrahim] -Qutaibah berkata- telah menceritakan kepada kami -dan Ishaq berkata- telah mengabarkan kepada kami [Sufyan] dari [Amru] ia mendengar [Jabir bin Abdullah] berkata; Seorang laki-laki masuk Masjid sementara Rasulullah shallallahu 'alaihi wasallam sedang menyampaikan khutbah Jum'at, maka beliau pun bertanya: \"Apakah kamu telah shalat?\" Laki-laki itu menjawab, \"belum.\" Maka beliau bersabda: \"Bangun dan shalatlah dua raka'at.\" dan dalam riwayat Qutaibah, \"Shalatlah dua raka'at",
          "tr": "Bize Kuteybetü'bnü Saîd ile îshâk b. İbrâhîm rivayet ettiler. Kuteybe (Bize rivayet etti) ta'bîrini kullandı. İshâk ise: Bize Süfyân, Amr'dan naklen haber verdi, dedi. Amr, Câbir b. Abdillâh'ı şunları söylerken işitmiş ;, Resulullah (Sallallahu Aleyhi ve Sellem) cum'a günü hutbe okurken mescid'e bir adam girdi. Nebi (Sallallahu Aleyhi ve Sellem) ona: «Sen namaz kıldın mı?» diye sordu. Adam : — Hayır; dedi. Resulullah (Sallallahu Aleyhi ve Sellem) : «Kalk da iki rekât namazı kıl!» buyurdular. Kuteybe'nin rivayetinde: «Kalk iki rek'ât namaz kıl! buyurdu.» denilmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 70
      }
    },
    {
      "hadithNumber": 2021,
      "arabicNumber": "875.04",
      "book": 7,
      "hadithInBook": 71,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ وَالنَّبِيُّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ يَخْطُبُ فَقَالَ لَهُ ‏ \"‏ أَرَكَعْتَ رَكْعَتَيْنِ ‏\"‏ ‏.‏ قَالَ لاَ. فَقَالَ: «ارْكَعْ»",
        "translations": {
          "en": "Jabir b. 'Abdullah reported that a person came (in the Mosque) while the Messenger of Allah (ﷺ) was delivering the sermon on Friday (standing) on the pulpit. He (the Holy Prophet) said to him:Have you offered two rak'ahs? He said: No. Upon this he said: Then observe (them)",
          "ur": "ابن جریج نے کہا : ہمیں عمرو بن دینار نے خبر دی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : ایک آدمی آیا جب کہ نبی اکرم صلی اللہ علیہ وسلم منبر پر تھے ، جمعے کے دن خطبہ ارشاد فرمارہے تھے تو آپ نے اس سے پوچھا : \" کیا تم نے دو رکعتیں پڑھ لی ہیں؟ \" اس نے کہا : نہیں ۔ آپ نے فرمایا : \" پڑھ لو ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Un homme entra dans la mosquée pendant que le Messager d’Allah ﷺ prononçait le sermon du vendredi, debout sur le minbar. Le Prophète ﷺ lui demanda : « As-tu accompli deux rak‘a ? » Il répondit : « Non. » Le Prophète ﷺ dit alors : « Accomplis-les. »",
          "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abdu bin Humaid] -Ibnu Rafi' berkata- telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] bahwa ia mendengar [Jabir bin Abdullah] berkata; Seorang laki-laki datang, sementara Nabi shallallahu 'alaihi wasallam sedang menyampaikan khutbah Jum'at di atas mimbar. Maka beliau pun bertanya padanya: \"Apakah kamu telah shalat dua raka'at?\" laki-laki itu menjawab, \"belum.\" Beliau bersabda: \"Ruku'lah (shalatlah)",
          "tr": "Bana Muhammed b. Râfi' ile Abd b. Humeyd rivayet ettiler. İbni Râfi' Dediki: Bize Abdürrezzâk rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana Amr b. Dînâr haber verdi. O da Câbir b. Abdillâh'ı şöyle derken işitmiş: Nebi (Sallallahu Aleyhi ve Sellem) cum'a günü minberde hutbe okurken bir adam geldi. Resûlullah (Sallallahu Aleyhi ve Sellem) ona : «Sen iki rek'ât namaz kıldın mı?» diye sordu Gelen zât : — Hayır; cevâbını verince Resulullah (Sallallahu Aleyhi ve Sellem): «Kıl!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 71
      }
    },
    {
      "hadithNumber": 2022,
      "arabicNumber": "875.05",
      "book": 7,
      "hadithInBook": 72,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ فَقَالَ ‏ \"‏ إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَقَدْ خَرَجَ الإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir b. 'Abdullah said that the Messenger of Allah (ﷺ) delivered the sermon and said:When any one of you comes for the Friday (prayer) and the Imam comes out (from his apartment), (even then) should observe two rak'ahs (of prayer)",
          "ur": "شعبہ نے عمرو ( بن دینار ) سے روایت کی ، انھوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا کہ نبی اکرم صلی اللہ علیہ وسلم نے خطبے میں فرمایا : \" جب تم میں سے کوئی شخص جمعے کے دن آئے جبکہ امام ( گھر سے ) نکل ( کر ) آچکا ہے تو وہ دو رکعت پڑھ لے ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Le Messager d’Allah ﷺ prononça le sermon et dit : « Lorsque l’un d’entre vous vient pour la prière du vendredi et que l’imam est déjà sorti (pour le sermon), il doit quand même accomplir deux rak‘a. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Amru] ia berkata, saya mendengar [Jabir bin Abdulah] bahwa Nabi shallallahu 'alaihi wasallam berkhutbah seraya bersabda: \"Jika salah seorang dari kalian datang untuk mengerjakan shalat Jum'at, sementara imam telah keluar (naik mimbar), hendaklah ia shalat dua raka'at",
          "tr": "Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Muhammed —yânî ibni Ca'fer— rivayet etti. (Dediki): Bize Şu'be, Amr'dari rivayet etti. Amr şöyle demiş: Ben Câbir b. Abdillâh'dan dinledim ki: Nebi (Sallallahu Aleyhi ve Sellem) hutbe okurken : «Sîzden biriniz cum'a, günü imam minbere çıktıkdan sonra mescide gelirse iki rek'ât namaz kılsın!» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 72
      }
    },
    {
      "hadithNumber": 2023,
      "arabicNumber": "875.06",
      "book": 7,
      "hadithInBook": 73,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّهُ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَاعِدٌ عَلَى الْمِنْبَرِ فَقَعَدَ سُلَيْكٌ قَبْلَ أَنْ يُصَلِّيَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَكَعْتَ رَكْعَتَيْنِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ قُمْ فَارْكَعْهُمَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported that Sulaik Ghatafani came on Friday (for prayer) while the Messenger of Allah (ﷺ) was sitting on the pulpit. Sulaik also sat down before observing prayer. The Apostle of Allah (ﷺ) said:Have you observed two rak'ahs? He said: No. He (the Holy Prophet) said: Stand and observe them",
          "ur": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ سلیک غطفانی رضی اللہ تعالیٰ عنہ جمعے کے دن آئے جبکہ رسول اللہ صلی اللہ علیہ وسلم منبر پر بیٹھے ہوئے تھے تو سلیک نماز پڑھنے سے پہلے ہی بیٹھ گئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے کہا : \" کیا تم نے دو رکعتیں پڑھ لی ہیں؟ \" انھوں نے کہا : نہیں ۔ آپ نے فرمایا : \" اٹھو اور دو ر کعتیں پڑھو ۔",
          "fr": "Rapporté par Jabir رضي الله عنه : Sulaik Ghatafani vint un vendredi alors que le Messager d’Allah ﷺ était assis sur le minbar. Sulaik s’assit sans avoir prié. Le Messager d’Allah ﷺ lui demanda : « As-tu accompli deux rak‘a ? » Il répondit : « Non. » Le Prophète ﷺ dit alors : « Lève-toi et accomplis-les. »",
          "id": "Dan Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Abu Zubair] dari [Jabir] bahwa ia berkata; Sulaik Al Ghathafani datang pada hari Jum'at sementara Rasulullah shallallahu 'alaihi wasallam sedang duduk di atas mimbar, maka Sulaik pun duduk sebelum ia shalat. Maka Nabi shallallahu 'alaihi wasallam bertanya padanya, \"Apakah kamu telah shalat dua raka'at?\" ia menjawab, \"belum.\" Beliau bersabda: \"Bangunlah, dan shalatlah dua raka'at",
          "tr": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. ve Bize Muhammed b. Rumh rivayet etti. (Dediki): Bize Leys, Ebu'z-Zübeyr'den oda Câbir'den naklen haber verdi, ki şöyle demiş: Cum'a günü Resülullah (Sallallahu Aleyhi ve Sellem) minber üzerinde otururken Süleyk-i Gatafânî geldi; ve namaz kılmadan oturdu. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem) ona: «Sen iki rek'ât namaz kıldın mı?» diye sordu. Süieyk : — Hayır, cevabını verdi. Resulullah (Sallallahu Aleyhi ve Sellem) : «Kalk da onları kıl!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 73
      }
    },
    {
      "hadithNumber": 2024,
      "arabicNumber": "875.07",
      "book": 7,
      "hadithInBook": 74,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، كِلاَهُمَا عَنْ عِيسَى بْنِ يُونُسَ، - قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى، - عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَخْطُبُ فَجَلَسَ فَقَالَ لَهُ ‏ \"‏ يَا سُلَيْكُ قُمْ فَارْكَعْ رَكْعَتَيْنِ وَتَجَوَّزْ فِيهِمَا - ثُمَّ قَالَ - إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَلْيَرْكَعْ رَكْعَتَيْنِ وَلْيَتَجَوَّزْ فِيهِمَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir b. 'Abdullah reported:Sulaik Ghatafani came on Friday when the Messenger of Allah (ﷺ) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short",
          "ur": "ابو سفیان ( طلحہ بن نافع واسطی ) نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا : سلیک غطفانی رضی اللہ تعالیٰ عنہ جمعے کے دن ( اس وقت ) آئے جب رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے تو وہ بیٹھ گئے ۔ آپ نے ان سے کہا : \" اے سلیک!ا ٹھ کر دو رکعتیں پڑھو اور ان میں سے اختصار برتو ۔ \" اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا! \" جب تم میں سے کوئی جمعے کےدن آئے جبکہ امام خطبہ دے رہا ہو تو وہ دو رکعتیں پڑھے اور ان میں اختصار کرے ۔",
          "fr": "Rapporté par Jabir ibn Abdullah رضي الله عنه : Sulaik Ghatafani vint un vendredi pendant que le Messager d’Allah ﷺ prononçait le sermon. Sulaik s’assit. Le Prophète ﷺ lui dit : « Ô Sulaik, lève-toi et accomplis deux rak‘a, mais fais-les courtes. » Puis il ajouta : « Quand l’un d’entre vous vient le vendredi pendant que l’imam prononce le sermon, qu’il accomplisse deux rak‘a courtes. »",
          "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Khasyram] keduanya dari [Isa bin Yunus] - [Ibnu Khasyram] berkata- telah mengabarkan kepada kami [Isa] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir bin Abdullah] ia berkata; Sulaik Al Ghathafani datang pada hari Jum'at, sementara Rasulullah shallallahu 'alaihi wasallam sedang berkhutbah, ia pun duduk, maka beliau pun bertanya padanya: \"Wahai Sulaik, bangun dan shalatlah dua raka'at, kerjakanlah dengan ringan.\" Kemudian beliau bersabda: \"Jika salah seorang dari kalian datang pada hari Jum'at, sedangkan Imam sedang berkhutbah, maka hendaklah ia shalat dua raka'at dengan ringan",
          "tr": "Bize İshâk b. İbrahim ile Aliyyü'bnü Haşrem ikisi birden îsâ b. Yûnus'dan rivayet ettiler. İbni Haşrem Dediki: Bize îsâ, A'meş'den, o da Ebû Süfyân'dan, o da Câbir b. Abdillâh'dan naklen haber verdi. Câbir şöyle demiş: cum'a günü Resulullah (Sallallahu Aleyhi ve Sellem) hutbe okurken Süleyk-i Gatafânî geldi ve oturdu. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) ona : «Yâ Süleyk! Kalk iki rek'ât namaz kıl! ama onları hafif tut!» buyurdu. Sonra şunları söyledi: «Biriniz cum'a günü imâm hutbe okurken gelirse hemen iki rek'ât namaz kılsın; ve onları hafif tutsun!» İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 74
      }
    },
    {
      "hadithNumber": 2025,
      "arabicNumber": "876",
      "book": 7,
      "hadithInBook": 75,
      "text": {
        "arabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، قَالَ قَالَ أَبُو رِفَاعَةَ انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَخْطُبُ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ رَجُلٌ غَرِيبٌ جَاءَ يَسْأَلُ عَنْ دِينِهِ لاَ يَدْرِي مَا دِينُهُ - قَالَ - فَأَقْبَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَتَرَكَ خُطْبَتَهُ حَتَّى انْتَهَى إِلَىَّ فَأُتِيَ بِكُرْسِيٍّ حَسِبْتُ قَوَائِمَهُ حَدِيدًا - قَالَ - فَقَعَدَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَعَلَ يُعَلِّمُنِي مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ أَتَى خُطْبَتَهُ فَأَتَمَّ آخِرَهَا ‏.‏",
        "translations": {
          "en": "Abu Rifa'a reported:I came to the Prophet (ﷺ) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah (ﷺ) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah (ﷺ) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end",
          "ur": "حضرت ابو رفاعہ ( تمیم بن اُسید عدوی رضی اللہ تعالیٰ عنہ ) نے کہا کہ میں نبی صلی اللہ علیہ وسلم کے پاس ( اس وقت ) پہنچا جبکہ آپ خطبہ دے رہے تھے ، میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ایک پردیسی آدمی ہے اپنے دین کے بارے میں پوچھنے آیا ہے اسے معلوم نہیں کہ ا س کادین کیا ہے کہا : تو رسول اللہ صلی اللہ علیہ وسلم میری طرف متوجہ ہوئے اور اپنا خطبہ چھوڑا ، یہاں تک کہ میرے پاس پہنچ گئے ۔ ایک کرسی لائی گئی میرے خیال میں اس کے پائے لوہے کے تھے ، کہا : تو رسول اللہ صلی اللہ علیہ وسلم اس پر بیٹھ گئے اور اللہ تعالیٰ نے جو کچھ آپ کو سکھایا تھا اس میں سے مجھے سکھانے لگے پھر اپنے خطبے کے لئے بڑھے اور اس کا آخری حصہ مکمل فرمایا ۔",
          "fr": "Rapporté par Abu Rifa’a رضي الله عنه : Je suis venu voir le Prophète ﷺ alors qu’il prononçait le sermon et j’ai dit : « Messager d’Allah, voici un étranger qui veut apprendre cette religion et il ne sait pas ce que c’est. » Le Messager d’Allah ﷺ me regarda, laissa son sermon, vint vers moi, on lui apporta une chaise dont je crus que les pieds étaient en fer. Le Messager d’Allah ﷺ s’y assit et commença à m’enseigner ce qu’Allah lui avait appris. Ensuite, il retourna au minbar pour terminer son sermon",
          "id": "Dan Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Sulaiman bin Al Mughirah] telah menceritakan kepada kami [Humaid bin Hilal] ia berkata, [Abu Rifa'ah] berkata; \"Aku tiba di tempat Rasulullah shallallahu 'alaihi wasallam saat beliau sedang berkhutbah. Lalu aku berkata kepada beliau, \"Wahai Rasulullah, ada orang asing yang sengaja datang kepada Anda untuk bertanya tentang agama, ia tidak tahu apa agamanya.\" Maka Rasulullah shallallahu 'alaihi wasallam pun mendatangiku dan memutuskan khutbahnya. Ketika beliau sampai di dekatku, diberikanlah sebuah kursi -aku memperkirakan kaki-kakinya terbuat dari besi- untuk beliau duduki. Selanjutnya Rasulullah shallallahu 'alaihi wasallam duduk di kursi tersebut dan mengajarkan kepadaku perihal agama yang telah diajarkan Allah kepada beliau. Setelah itu, beliau meneruskan khutbahnya hingga selesai",
          "tr": "Bize, Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Süleyman b. Mugîra rivayet etti. (Dediki): Bize Humeyd b. Hilâl rivayet etti. Dediki: Ebû Rifâ'a şunları söyledi: Nebi (Sallallahu Aleyhi ve Sellem)'in yanına vardım; hutbe okuyordu : — Yâ Resûlallah! Yabancı, dînini sormaya gelmiş; dîninin ne olduğunu bilmeyen bir adamım, dedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) bana döndü ve hutbesini bırakarak tâ yanıma kadar geldi. Kendisine bir sandalye getirdiler. Zannederim ayakları demirdendi. Resulullah (Sallallahu Aleyhi ve Sellem) bu sandalyenin üzerine oturarak, Allah'ın kendisine öğretmiş olduğu bilgilerden bana da öğretmeye başladı. Sonra tekrar hutbesine dönerek, onu sonuna kadar tamamladı.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 75
      }
    },
    {
      "hadithNumber": 2026,
      "arabicNumber": "877.01",
      "book": 7,
      "hadithInBook": 76,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ بِلاَلٍ - عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي رَافِعٍ، قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ وَخَرَجَ إِلَى مَكَّةَ فَصَلَّى لَنَا أَبُو هُرَيْرَةَ الْجُمُعَةَ فَقَرَأَ بَعْدَ سُورَةِ الْجُمُعَةِ فِي الرَّكْعَةِ الآخِرَةِ ‏{‏ إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ - قَالَ - فَأَدْرَكْتُ أَبَا هُرَيْرَةَ حِينَ انْصَرَفَ فَقُلْتُ لَهُ إِنَّكَ قَرَأْتَ بِسُورَتَيْنِ كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ يَقْرَأُ بِهِمَا بِالْكُوفَةِ ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِهِمَا يَوْمَ الْجُمُعَةِ ‏.‏",
        "translations": {
          "en": "Ibn Abu Rafi' said:Marwan appointed Abu Huraira as his deputy in Medina and he himself left for Mecca. Abu Huraira led us in the Jumu'a prayer and recited after Surah Jumu'a in the second rak'ah:\" When the hypocrites came to thee\" (Surah 63). I then met Abu Huraira as he came back and said to him: You have recited two surahs which 'Ali b. Abu Talib used to recite in Kufah. Upon this Abu Huraira said: I heard the Messenger of Allah (ﷺ) reciting these two in the Friday (prayer)",
          "ur": "سلیمان جو ہلال ( تمیمی ) کے بیٹے ہیں ، انھوں نے جعفر ( صادق ) سے ، انھوں نے اپنے والد سے اور انھوں نے ابو رافع ( مولیٰ رسول اللہ صلی اللہ علیہ وسلم کے بیٹے عبیداللہ ) سے ر وایت کی ، انھوں نے کہا : مروان نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کو مدینہ میں اپنا جانشین مقرر کیا اور خود مکہ چلا گیا ۔ حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے ہمیں جمعے کی نماز پڑھائی اور ( پہلی رکعت میں ) سورہ جمعہ پڑھنے کے بعد دوسری رکعت میں إِذَا جَاءَكَ الْمُنَافِقُونَ پڑھی اور کہا : جب ابو ہریرۃ رضی اللہ تعالیٰ عنہ جمعے کی نماز سے فارغ ہوئے تو میں ان کے پاس جاپہنچا اور ان سے کہا : آپ نے وہ دو سورتیں پڑھی ہیں جو علی ابن طالب رضی اللہ تعالیٰ عنہ کوفہ میں پڑھا کرتے تھے ۔ ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو جمعے کے دن یہ سورتیں پڑھتے ہوئے سنا ہے ۔",
          "fr": "Rapporté par Ibn Abu Rafi’ رضي الله عنه : Marwan nomma Abu Huraira comme son adjoint à Médine et partit lui-même à La Mecque. Abu Huraira dirigea la prière du vendredi pour nous et, après la sourate Al-Jumu’a, il récita dans la seconde rak‘a : « Quand les hypocrites viennent à toi » (sourate 63). Ensuite, je rencontrai Abu Huraira et lui dis : « Tu as récité deux sourates qu’Ali ibn Abu Talib récitait à Koufa. » Abu Huraira répondit : « J’ai entendu le Messager d’Allah ﷺ réciter ces deux sourates lors de la prière du vendredi. »",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] Telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Ja'far] dari [bapaknya] dari [Ibnu Abu Rafi'] ia berkata; Suatu ketika (khalifah) Marwan meminta kepada [Abu Hurairah] untuk menggantikannya (sebagai pemimpin) di Madinah, sementara Marwan pergi ke Makkah. Maka pada suatu hari Jum'at, Abu Hurairah mengimami kami shalat Jum'at. Ia membaca surat Al Jumu'ah pada raka'at pertama, dan surat Al Munafiqun pada raka'at kedua. Setelah selesai shalat, kutemui Abu Hurairah dan kukatakan kepadanya, \"Kedua surat yang Anda baca tadi, pernah dibaca oleh Ali bin Abi Thalib ketika ia berada di Kufah.\" Abu Hurairah berkata, \"Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam membaca kedua surat itu pada hari Jum'at.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Bakar bin Abu Syaibah] keduanya berkata, telah menceritakan kepada kami [Hatim bin Isma'il] -dalam jalur lain- Dan telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz] yakni Ad Darawardi, keduanya dari [Ja'far] dari [bapaknya] dari [Ubaidullah bin Abu Rafi'] ia berkata; Marwan meminta kepada [Abu Hurairah] untuk menggantikannya. Yakni semisalnya. Hanya saja dalam riwayat Hatim; \"Maka ia pun membaca surat Al Jumu'ah pada sujud yang pertama, sedangkan pada sujud (raka'at) terakhir ia membaca, 'IDZAA JAA`AKAL MUNAAFIQUUNA..'\" Sedangkan pada riwayat Abdul Aziz adalah serupa dengan hadits Sulaiman bin Bilal",
          "tr": "Bize Abdullah b. Meslemete'bni Ka'neb rivayet etti. (Dediki): Bize Süleyman yâni İbni Bilâl, Ca'fer'den, o da babasından, o da İbni Ebî Râfi'den naklen rivayet etti. İbni Ebî Râfi' şöyle demiş: (Medine valisi) Mervân, Ebû Hureyre'yi kendi yerine bırakarak Mekke'ye gitti. Bu sebeple bize cum'ayı Ebû Hureyre kıldırdı da ilk rek'atta cum'a sûresini okudukdan sonra son rek'âtda Münâfikûn sûresini okudu. Namazdan çıktıkdan sonra Ebû Hureyre'ye yetişerek: — «Gerçekden sen, Alî b. Ebî Tâlib'in Kûfe'de iken okuduğu iki sûreyi okudun.» dedim. Ebû Hureyre: — «Çünkü ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i cum'a günü bu sûreleri okurken işittim.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 76
      }
    },
    {
      "hadithNumber": 2027,
      "arabicNumber": "877.02",
      "book": 7,
      "hadithInBook": 77,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - كِلاَهُمَا عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّ فِي، رِوَايَةِ حَاتِمٍ فَقَرَأَ بِسُورَةِ الْجُمُعَةِ فِي السَّجْدَةِ الأُولَى وَفِي الآخِرَةِ ‏{‏ إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ وَرِوَايَةُ عَبْدِ الْعَزِيزِ مِثْلُ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ ‏.‏",
        "translations": {
          "en": "This hadith is narrated by Abdullah b. Abu Rafi' with the same chain of transmitters but with this modification:\" That he recited Surah Jumu'a (lxii.) in the first rak'ah and\" The hypocrites came\" in the second rak'ah",
          "ur": "حاتم بن اسماعیل اور عبدالعزیز دراوردی دونوں نے ( اپنی اپنی سندکے ساتھ ) جعفر سے روایت کی ، انھوں نے اپنے والد سے اور انھوں نے عبیداللہ بن ابی رافع سے روایت کی ، انھوں نے کہا : مروان رضی اللہ تعالیٰ عنہ نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ کو قائم مقام گورنر بنایا ۔ ۔ ۔ آگے اسی کے مانندہے ، سوائے اس کے کہ حاتم کی روایت ( ان الفاظ ) میں ہے : انھوں نے پہلی رکعت میں سورہ جمعہ پڑھی اور دوسری رکعت میں إِذَا جَاءَكَ الْمُنَافِقُونَ ۔ عبدالعزیز کی روایت سلیمان بن بلال کی ( سابقہ ) ر وایت کی طرح ہے ۔",
          "fr": "Rapporté par Abdullah ibn Abu Rafi’ رضي الله عنه : Ce hadith est rapporté avec la même chaîne, mais avec cette précision : il récitait la sourate Al-Jumu’a (62) dans la première rak‘a et « Quand les hypocrites viennent » dans la seconde",
          "tr": "{….} Bize, Kuteybetü'bnü Saîd ile Ebû Bekir b. Ebî Şeybe rivayet ettiler. Dedilerki: Bize, Hatim b. İsmail rivayet etti. H. Bize, Kuteybe rivayet etti. (Dediki): Bize, Abdülazîz yâni Derâverdî rivayet etti. Bu râvîlerin ikisi birden Ca'fer'den, o da babasından, o da Ubeydullah b. Ebî Râfi'den naklen rivayet etmişlerdir. Ubeydullah: «Mervân, Ebû Hureyre'yi kendi yerine bıraktı...» diyerek yukarkî hadîsin mislini rivayet etmişdir. Şu kadar var ki Hâtim'in rivayetinde: «Brinci rek'atda cum'a süresini, son rek'atda da Münâfkûn sûresini okudu...» ibaresi vardır. Abdülazîz'in rivayeti Süleyman b. Bilâl'ın hadisi gibidir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 77
      }
    },
    {
      "hadithNumber": 2028,
      "arabicNumber": "878.01",
      "book": 7,
      "hadithInBook": 78,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَاقُ جَمِيعًا عَنْ جَرِيرٍ، - قَالَ يَحْيَى أَخْبَرَنَا جَرِيرٌ، - عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، عَنْ حَبِيبِ بْنِ، سَالِمٍ مَوْلَى النُّعْمَانِ بْنِ بَشِيرٍ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الْعِيدَيْنِ وَفِي الْجُمُعَةِ بِـ ‏{‏ سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى‏}‏ وَ ‏{‏ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ‏}‏ قَالَ وَإِذَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فِي يَوْمٍ وَاحِدٍ يَقْرَأُ بِهِمَا أَيْضًا فِي الصَّلاَتَيْنِ",
        "translations": {
          "en": "Nu'man b. Bashir reported that the Messenger of Allah (ﷺ) used to recite on two 'Ids and in Friday prayer:\" Glorify The name of Thy Lord, the Most High\" (Surah lxxxvii.), and:\" Has there come to thee the news of the overwhelming event\" (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers",
          "ur": "(جریر نے ابراہیم بن محمد بن منتشر سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت نعمان بن بشیر کے آزاد کردہ غلام حبیب بن سالم سے اور انھوں نے حضرت نعمان بن بشیر رضی اللہ تعالیٰ عنہ سےروایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم عیدین اور جمعے میں سَبِّحِ اسْمَ رَ‌بِّكَ الْأَعْلَى اور ) هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ پڑھتے ۔ کہا : اور اگر عید اور جمعہ ایک ہی دن اکھٹے ہوجاتے تو آپ یہی دو سورتیں دونوں نمازوں میں پڑھتے تھے ۔",
          "fr": "Rapporté par Nu’man ibn Bashir رضي الله عنه : Le Messager d’Allah ﷺ récitait lors des deux fêtes (‘Id) et à la prière du vendredi : « Glorifie le nom de ton Seigneur, le Très-Haut » (sourate 87) et « T’est-il parvenue la nouvelle de l’événement écrasant ? » (sourate 88). Et lorsque la fête et le vendredi tombaient le même jour, il récitait ces deux sourates dans les deux prières",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan [Ishaq] semuanya dari [Jarir] - [Yahya] berkata- telah mengabarkan kepada kami [Jarir] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [bapaknya] dari [Habib bin Salim] Maula Nu'man bin Basyir, dari [Nu'man bin Basyir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa membaca surat Al A'la dan surat Al Ghasyiah dalam shalat dua hari raya dan shalat Jum'at. Bila shalat Id bertepatan dengan hari Jum'at, beliau juga membaca kedua surat tersebut dalam kedua shalat itu.\" Dan telah menceritakannya kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dengan sanad-sanad ini",
          "tr": "Bize Yahya b. Yahya ile Ebu Bekir b. Ebî Şeybe ve İshâk toptan Cerîr'den rivayet ettiler. Yahya Dediki: Bize Cerîr, İbrahim b. Muhammed b. Münteşîr'den, o da babasından, o da Nu'mân b. Beşîr'in azatlısı Habîb b. Sâîim'den, o da Nu'mân b. Beşîr'den naklen haber verdi. Nu'mân şöyle demiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) bayramlar ile cum'â'da A'lâ ve Ğâşiye sûrelerini okurdu. Bayramla cum'a aynı gün'e tesadüf ederse, bu sûreleri her iki namazda okurdu.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 78
      }
    },
    {
      "hadithNumber": 2029,
      "arabicNumber": "878.02",
      "book": 7,
      "hadithInBook": 79,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، بِهَذَا الإِسْنَادِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Ibrahim b Muhammad b. al-Muntashir with the same chain of transmitters",
          "ur": "ابو عوانہ نے ابراہیم بن محمد بن منتشر سے اسی سند کے ساتھ ( اسی کے مانند ) ر وایت کی ۔",
          "fr": "Rapporté par Ibrahim ibn Muhammad ibn al-Muntashir رضي الله عنه : Ce hadith a été rapporté avec la même chaîne de transmetteurs",
          "tr": "{….} Bize, bu hadîsi Kuteybetü'bnü Saîd de rivayet etti. (Dediki): Bize, Ebû Avâne, İbrahim b. Muhammed b. Münteşir'den bu isnâdla riva­yet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 79
      }
    },
    {
      "hadithNumber": 2030,
      "arabicNumber": "878.03",
      "book": 7,
      "hadithInBook": 80,
      "text": {
        "arabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ، عَنْ عُبَيْدِ، اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ كَتَبَ الضَّحَّاكُ بْنُ قَيْسٍ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ يَسْأَلُهُ أَىَّ شَىْءٍ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ سِوَى سُورَةِ الْجُمُعَةِ فَقَالَ كَانَ يَقْرَأُ ‏{‏ هَلْ أَتَاكَ‏}‏",
        "translations": {
          "en": "Dahhak b. Qais wrote to Nu'man b. Bashir asking him what the Messenger of Allah (ﷺ) recited on Friday besides Surah Jumu'a He said that he recited:\" Has there reached...\" (Surah lxxxviii)",
          "ur": "عبیداللہ بن عبداللہ نے کہا : ضحاک بن قیس نے حضرت نعمان بن بشیر رضی اللہ تعالیٰ عنہ کوخط لکھ کر پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعے کے دن سورہ جمعہ کے علاوہ ( اور ) کون سی سورت پڑھی؟انھوں نے جواب دیا : آپ صلی اللہ علیہ وسلم هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ پڑھا کرتے تھے ۔",
          "fr": "Rapporté par Dahhak b. Qais : Il a écrit à Nu'man b. Bashir pour lui demander ce que le Messager d’Allah ﷺ récitait le vendredi en dehors de la sourate Al-Jumu'a. Il a répondu qu’il récitait : « Est-ce qu’il t’est parvenu… » (Sourate)",
          "id": "Dan Telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Dlamrah bin Sa'id] dari [Ubaidullah bin Abdullah] ia berkata, Adl Dlahak bin Qais menulis surat kepada [An Nu'man bin Basyir] menanyakan tentang surat yang apa yang dibaca oleh Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at selain surat Jumu'ah. Maka ia menjawab, \"Beliau membaca surat Al Ghasyiah",
          "tr": "Bize Amru'n-Nâkıd rivayet etti. (Dediki): Bize Süfyân b. Uyeyne, Damratü'bnü Saîd'den, o da Ubeydillâh ibni Abdillâh'dan naklen rivayet etti. Ubeydullah şöyle demiş: «Dahhâk b. Kays, Nu'mân b. Beşir'e mektup yazarak Resûlullah (Sallallahu Aleyhi ve Sellem)'in cum'a günü, cum'a sûresinden başka neyi okuduğunu sordu.. Nu'mân : — Gâşiye sûresini okurdu, cevâbını verdi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 80
      }
    },
    {
      "hadithNumber": 2031,
      "arabicNumber": "879.01",
      "book": 7,
      "hadithInBook": 81,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سُفْيَانَ، عَنْ مُخَوَّلِ، بْنِ رَاشِدٍ عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي صَلاَةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ ‏{‏ الم * تَنْزِيلُ‏}‏ السَّجْدَةُ وَ ‏{‏ هَلْ أَتَى عَلَى الإِنْسَانِ حِينٌ مِنَ الدَّهْرِ‏}‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي صَلاَةِ الْجُمُعَةِ سُورَةَ الْجُمُعَةِ وَالْمُنَافِقِينَ ‏.‏",
        "translations": {
          "en": "Ibn Abbas reported:The Apostle of Allah (ﷺ) used to recite in the morning prayer on Friday Surah\" Alif-Lam-Mim, Tanz'il ul-Sajda\" (Surah xxxii.): Surely there came over the man a time\" (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin",
          "ur": "عبدہ بن سلیمان نے سفیان سے روایت کی ، انھوں نے مخول بن راشد سے ، انھوں نے مسلم البطین سے ، انہوں نے سعید بن جبیر سے اورانھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن فجر کی نماز میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ السجدہ اور هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ‌ پڑھتے تھے ۔ آپ صلی اللہ علیہ وسلم جمعے کی نماز میں سورہ جمعہ اورسورہ منافقون پڑھتے تھے ۔",
          "fr": "Rapporté par Ibn Abbas : Le Messager d’Allah ﷺ récitait, lors de la prière du matin du vendredi, la sourate « Alif-Lam-Mim, Tanzil as-Sajda » (Sourate 32) et « Il est certes venu sur l’homme un temps… » (Sourate 76). Et pendant la prière du vendredi, il récitait les sourates Al-Jumu'a et Al-Munafiqun",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Sufyan] dari [Mukhawwal bin Rasyid] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa biasanya Nabi shallallahu 'alaihi wasallam ketika mengerjakan shalat Shubuh pada hari Jum'at, beliau membaca: \"ALIF LAAM MIIM TANZIIL\" (surat As Sajadah) dan, \"HAL ATAA 'ALAL INSAANI HIINUM MINAD DAHRI\" (surat Al Insan). Dan dalam shalat Jum'at beliau membaca surat Al Jumu'ah dan surat Al Munafiqun. Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [bapakku] -dalam jalur lain- dan Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] keduanya dari [Sufyan] dengan isnad ini. Dan telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Mukhawwal] dengan sanad-sanad ini semisalnya pada dua shalat, sebagaimana yang dikatakan Sufyan",
          "tr": "Bize, Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Abdetü'bnü Süleyman, Süfyân'dan, o da Muhavvel b. Râşit'den, o da Müslim-i Batin'den, o da Saîdü'bnü Cübeyr'den^ o da İbni Abbâs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) cum'a günü sabah namazında Secde ile Hel'etâ sûrelerini; cum'a namazında ise Sûre-i Cumua ile Sûre-i Münâfikûn'u okurmuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 81
      }
    },
    {
      "hadithNumber": 2032,
      "arabicNumber": "879.02",
      "book": 7,
      "hadithInBook": 82,
      "text": {
        "arabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، كِلاَهُمَا عَنْ سُفْيَانَ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "A hadith like this has been narrated by Sufyan with the same chain of transmitters",
          "ur": "عبداللہ بن نمیر اور وکیع دونوں نے سفیان سے اسی سند کے ساتھ اسی ( سابقہ حدیث ) کے مانند روایت کی ۔",
          "fr": "Rapporté par Sufyan avec la même chaîne de transmetteurs : Un hadith similaire a été rapporté",
          "tr": "{….} Bize İbni Numeyr rivayet etti. (Dediki): Bize babam rivayet etti H. Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Vekî' rivayet etti. Bu râvîlerin ikisi de Süfyân'dan bu hadîsin mislini rivayet etmişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 82
      }
    },
    {
      "hadithNumber": 2033,
      "arabicNumber": "879.03",
      "book": 7,
      "hadithInBook": 83,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُخَوَّلٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ فِي الصَّلاَتَيْنِ كِلْتَيْهِمَا ‏.‏ كَمَا قَالَ سُفْيَانُ",
        "translations": {
          "en": "Mukhawwil has narrated this hadith on the authority of Sufyan",
          "ur": "شعبہ نے مخول سے اسی سندکے ساتھ دونوں نمازوں کے بارے میں اسی ( سابقہ حدیث ) کے مانند روایت کی جس طرح سفیان نے ( اپنی روایت میں ) کہا ۔",
          "fr": "Rapporté par Mukhawwil d’après Sufyan : Ce hadith a été transmis par Mukhawwil selon l’autorité de Sufyan",
          "tr": "{….} Bize Muhammed b. Beşşâr rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be Muhavvel'den bu isnâdla, bu hadîsin mislini her iki namaz hakkında da Süfyân'ın dediği gibi rivayet etti. İzah 880 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 83
      }
    },
    {
      "hadithNumber": 2034,
      "arabicNumber": "880.01",
      "book": 7,
      "hadithInBook": 84,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ، الرَّحْمَنِ الأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ أَنَّهُ كَانَ يَقْرَأُ فِي الْفَجْرِ يَوْمَ الْجُمُعَةِ ‏{‏ الم * تَنْزِيلُ‏}‏ وَ ‏{‏ هَلْ أَتَى‏}‏",
        "translations": {
          "en": "Abu Huraira reported that the Messenger of Allah (ﷺ) used to recite in the dawn prayer on Friday\" Alif-Lam-Mim, Tanzil\" and\" Surely there came",
          "ur": "سفیان نے سعد بن ابراہیم سے ، انہوں نے عبدالرحمان اعرج سے ، انھوں نے ابوہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ جمعے کے دن فجر کی نماز میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ اور هَلْ أَتَىٰ عَلَى الْإِنسَانِ پڑھتے تھے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ récitait, lors de la prière de l’aube du vendredi, « Alif-Lam-Mim, Tanzil » et « Il est certes venu… »",
          "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Sa'd bin Ibrahim] dari [Abdurrahman bin Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, bahwa biasanya Nabi shallallahu 'alaihi wasallam dalam shalat Shubuh pada hari Jum'at, beliau membaca: \"ALIF LAAM MIIM TANZIIL\" (surat As Sajadah) dan, \"HAL ATAA\" (surat Al Insan)",
          "tr": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Vekî', Süfyân'dan, o da Sa'd b. İbrahim'den, o da Abdurrahmân EI-A'rac'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem) Efendimiz cum'a günü sabah namazında Secde ile Hel'etâ sûrelerini okurmuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 84
      }
    },
    {
      "hadithNumber": 2035,
      "arabicNumber": "880.02",
      "book": 7,
      "hadithInBook": 85,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الصُّبْحِ يَوْمَ الْجُمُعَةِ بِـ ‏{‏ الم * تَنْزِيلُ‏}‏ فِي الرَّكْعَةِ الأُولَى وَفِي الثَّانِيَةِ ‏{‏ هَلْ أَتَى عَلَى الإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا‏}‏",
        "translations": {
          "en": "Abu Huraira reported that the Messenger of Allah (ﷺ) used to recite in the dawn prayer on Friday:\" Alif-Lam-Mim, Tanzil\" in the first rak'ah, and in the second one:\" Surely there came over the man a time when he was nothing that could be mentioned",
          "ur": "۔ ابراہیم بن سعد نے اپنے والد ( سعد بن ابراہیم ) سے ، انھوں نے عبدالرحمان اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن صبح کی نماز کی پہلی رکعت میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ اور دوسری رکعت میں هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ‌لَمْ يَكُن شَيْئًا مَّذْكُورً‌ا پڑھتے تھے ۔ ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ récitait, lors de la prière de l’aube du vendredi, « Alif-Lam-Mim, Tanzil » dans la première rak'a, et dans la seconde : « Il est certes venu sur l’homme un temps où il n’était rien dont on puisse parler. »",
          "id": "Telah menceritakan kepadaku [Abu Thahir] telah menceritakan kepada kami [Ibnu Wahb] dari [Ibrahim bin Sa'd] dari [bapaknya] dari [Al A'raj] dari [Abu Hurairah] bahwa dalam shalat Shubuh pada hari Jum'at biasanya Nabi shallallahu 'alaihi wasallam membaca \"ALIF LAAM MIIM TANZIIL\" (surat As Sajadah) pada raka'at pertama, dan pada raka'at kedua, \"HAL ATAA 'ALAL INSAANI HIINUM MINAD DAHRI LAM YAKUN SYAI`AN MADZKUURAA.\" (surat Al Insan)",
          "tr": "Bana Ebû't-Tâhir rivayet etti. (Dediki): Bize ibni Vehb, İbrahim b. Sa'd'dan, o da babasından, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) cum'a günü sabah namazının ilk rek'atmda Secde sûresini, ikincide Hel'etâ'yı okurmuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 85
      }
    },
    {
      "hadithNumber": 2036,
      "arabicNumber": "881.01",
      "book": 7,
      "hadithInBook": 86,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي، هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا صَلَّى أَحَدُكُمُ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When any one of you observes the Jumu'a prayer (two obligatory rak'ahs in congregation), he should observe four (rak'ahs) afterwards",
          "ur": "۔ خالد بن عبداللہ نے سہیل سے ، انھوں نے اپنے والد ( ابوصالح ) سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی جمعہ پڑھ چکے تو اس کے بعد چار رکعتیں پڑھے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Lorsque l’un d’entre vous accomplit la prière du vendredi (les deux rak'a obligatoires en groupe), il doit ensuite accomplir quatre rak'a. »",
          "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian telah menunaikan shalat Jum'at, maka hendaklah ia shalat empat raka'at setelahnya",
          "tr": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hâlid b. Abdillâh, Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen haber verdi, Ebû Hureyre şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) : «Biriniz cum'a'yi kıldımı arkasından dört rekat namaz daha kılsın.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 86
      }
    },
    {
      "hadithNumber": 2037,
      "arabicNumber": "881.02",
      "book": 7,
      "hadithInBook": 87,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا صَلَّيْتُمْ بَعْدَ الْجُمُعَةِ فَصَلُّوا أَرْبَعًا ‏\"‏ ‏.‏ - زَادَ عَمْرٌو فِي رِوَايَتِهِ قَالَ ابْنُ إِدْرِيسَ قَالَ سُهَيْلٌ فَإِنْ عَجِلَ بِكَ شَىْءٌ فَصَلِّ رَكْعَتَيْنِ فِي الْمَسْجِدِ وَرَكْعَتَيْنِ إِذَا رَجَعْتَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Suhail reported on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:When you observe prayer after (the two obligatory rak'ahs) of Jumu'ah, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house)",
          "ur": "ابوبکر بن ابی شیبہ اور عمرو الناقد نے کہا : ہمیں عبداللہ بن ادریس نے سہیل سے حدیث سنائی ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم جمعے کے بعد نماز پڑھو تو چار رکعتیں پڑھو \" عمرو نے اپنی روایت میں اضافہ کیا ، ابن ادریس نے کہا سہیل نے کہا : اگر تمھیں کسی چیز کی وجہ سے جلدی ہو تو دو رکعتیں مسجد میں پڑھ لو اور دو رکعتیں و اپس جا کر ( گھر میں ) پڑ ھ لو ۔",
          "fr": "Rapporté par Suhail d’après Abu Huraira : Le Messager d’Allah ﷺ a dit : « Lorsque vous priez après les deux rak'a obligatoires du vendredi, accomplissez quatre rak'a. » (‘Amr ajoute dans son récit que Ibn Idris a dit cela d’après Suhail) : « Et si vous êtes pressé pour une raison, priez deux rak'a à la mosquée et deux autres en rentrant chez vous. »",
          "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Amru An Naqid] keduanya berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian ingin shalat (sunah) setelah menunaikan shalat Jum'at, maka shalatlah empat raka'at.\" Amru menambahkan di dalam riwayatnya; Ibnu Idris berkata, Suhail berkata; \"Jika kamu terburu-buru (karena suatu keperluan), maka shalatlah dua raka'at di Masjid dan dua raka'at di rumah",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe ile Amru'n-Nâkid rivayet ettîler. Dedilerki: Bize Abdullah b. İdrîs, Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre şöyle demiş. Resûlullah (Sallallahu Aleyhi ve Sellem): «Cum'a'dan sonra namaz kılacaksanız dört rek'ât kılın.» buyurdular. Amr kendi rivayetinde şu ibareyi ziyâde etmişdir: «İbni İdris Dediki: (Süheyl şunları söyledi: Eğer seni her hangi bir şey acele ettiriyorsa, mescidde iki rek'at namaz kıl; evine döndüğün zaman iki rek'at daha kıl)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 87
      }
    },
    {
      "hadithNumber": 2038,
      "arabicNumber": "881.03",
      "book": 7,
      "hadithInBook": 88,
      "text": {
        "arabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، كِلاَهُمَا عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا ‏\"‏ ‏.‏ وَلَيْسَ فِي حَدِيثِ جَرِيرٍ ‏\"‏ مِنْكُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When any one amongst you observes prayer after Jumu'a, he should observe four rak'ahs. (In the hadith transmitted by Jarir the word minkum is not recorded)",
          "ur": "جریر اور سفیان نے سہیل سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" تم میں سے جو شخص جمعے کے بعد نماز پڑھے توچار رکعتیں پڑھے ۔ \"\" جریر کی حدیث میں \"\" منكم \"\" ( تم میں سے ) کے الفاظ نہیں ہیں ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Lorsque l’un d’entre vous accomplit la prière après le vendredi, il doit faire quatre rak'a. » (Dans la version transmise par Jarir, le mot « parmi vous » n’est pas mentionné)",
          "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] -dalam jalur lain- Dan telah menceritakan kepada kami [Amru An Naqid] dan [Abu Kuraib] keduanya berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] keduanya dari [Suhail] dari [bapaknya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang ingin menunaikan shalat setelah shalat Jum'at, maka hendaklah ia shalat empat raka'at.\" Sedangkan di dalam hadits Jarir tidak terdapat kata, \"diantara kalian",
          "tr": "Bana Züheyr b. Harb rivayet etti. (Dediki): Bize Cerir rivayet etti. H. Bize Amru'n-Nâkıd ile Ebû Kureyb dahî rivayet ettiler. Dediler ki: Bize Vekî', Süfyân'dan rivayet etti. Cerîr ile Süfyân'ın ikisi birden Süheyl'den, o da babasından, o da Ebû Hureyre'den naklen rivayet etmişler. Ebû Hureyre şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Sizden her kim cumâ'dan sonra namaz kılacaksa dört rek'ât kılsın.» buyurdular. Cerîr'in rivayetinde: «Sizden.» tâbiri yokdur. İzah 883 te"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 88
      }
    },
    {
      "hadithNumber": 2039,
      "arabicNumber": "882.01",
      "book": 7,
      "hadithInBook": 89,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَسَجَدَ سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ ‏.‏",
        "translations": {
          "en": "Nafi' reported that when 'Abdullah (b. 'Umar) observed the Friday prayer and came back he observed two rak'ahs in his house, and then said:The Messenger of Allah (may peace be updn him) used to do this",
          "ur": "لیث نے نافع سے اورانھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ جب وہ جمعہ پڑھ لیتے تو واپس جاتے اور اپنے گھر میں دو ر رکعتیں پڑھتے ۔ پھر انھوں ( ابن عمر رضی اللہ تعالیٰ عنہ ) نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم ایسا ہی کرتے تھے ۔",
          "fr": "Rapporté par Nafi' : Quand ‘Abdullah b. ‘Umar accomplissait la prière du vendredi puis rentrait chez lui, il priait deux rak'a à la maison et disait : « Le Messager d’Allah ﷺ faisait ainsi. »",
          "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Rumh] keduanya berkata, telah mengabarkan kepada kami [Laits] -dalam jalur lain- Dan telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Laits] dari [Nafi'] dari [Abdullah] bahwasanya bila ia telah menunaikan shalat Jum'at, maka ia pulang dan shalat dua raka'at di rumahnya. Kemudian ia berkata, \"Rasulullah shallallahu 'alaihi wasallam biasa melakukan amalan tersebut",
          "tr": "Bize Yahya b. Yahya ile Muhammed b. Rumh rivayet ettiler. Dedilerki: Bize Leys haber verdi. H. Bize Kuteybe de rivayet etti. (Dediki): Bize Leys, Nâfi'den, o da Abdullah'dan naklen rivayet ettiki Abdullah cumâ'yı kıldımı mescidden giderek evinde iki rek'at namaz kılar sonra : «Resûlullah (Sallallahu Aleyhi ve Sellem) böyle yapardı, dermiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 89
      }
    },
    {
      "hadithNumber": 2040,
      "arabicNumber": "882.02",
      "book": 7,
      "hadithInBook": 90,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ وَصَفَ تَطَوُّعَ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّي رَكْعَتَيْنِ فِي بَيْتِهِ ‏.‏ قَالَ يَحْيَى أَظُنُّنِي قَرَأْتُ فَيُصَلِّي أَوْ أَلْبَتَّةَ ‏.‏",
        "translations": {
          "en": "Abdullah b. 'Umar, while describing the Nafl prayer of the Messenger of Allah (ﷺ), said:He did not observe (Nafl) prayer after Jumu'a till he went back and observed two rak'ahs in his house. Yahya said: I guess that I uttered these words (before Imam Malik) that he of course observed (them)",
          "ur": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالکؒ پر ( حدیث کی ) قراءت کی ، انھوں نے نافع سے اورانھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی نفل نماز کو بیان کیا اورکہا کہ آپ جمعے کے بعد کوئی ( نفل ) نماز نہ پڑھے حتیٰ کہ واپس تشریف لے جاتے پھر ا پنے گھر میں د و رکعتیں پڑھتے تھے ۔ یحییٰ بن یحییٰ نے کہا : میرا خیال ہے کہ میں نے ( امام مالکؒ کے سامنے ) \" فيصلي \" پڑھا تھا یا یقین ہے ( کہ یہی پڑھاتھا)",
          "fr": "Rapporté par ‘Abdullah b. ‘Umar, en décrivant la prière surérogatoire du Messager d’Allah ﷺ : Il n’accomplissait pas de prière surérogatoire après le vendredi avant de rentrer chez lui, puis il priait deux rak'a à la maison. Yahya a dit : « Je pense avoir dit ces mots (devant l’imam Malik) qu’il les accomplissait effectivement. »",
          "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata; Saya telah membacakan kepada [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa ia menshifati shalat tathawwu' Rasulullah shallallahu 'alaihi wasallam, ia berkata; \"Biasanya beliau tidak shalat setelah Shalat Jum'at hingga beliau pulang, kemudian beliau baru shalat dua raka'at di rumahnya.\" Yahya berkata; saya menduga kuat, bahwa saya telah membacakan; \"Maka (beliau) shalat atau Al Batah (benar-benar)",
          "tr": "Bize Yahya b. Yahya rivayet etti. Dediki: Mâlik'e Nâfi'den duyduğum, onun da Abdullah b. Ömer'den naklettiği şu hadîsi okudum: Abdullah, Resûlullah (Sallailahü Aleyhi ve Sellem) 'in nafile namazını tavsif ederek, şöyle demiş: «Nebi (Sallallahu Aleyhi ve Sellem) cum'a namazından sonra mescidden ayrılmadıkça (nafile) namaz kılmazdı. Sonra evinde iki rek'ât namaz kılardı.» Yahya: «Zannederim sonra kılardı, diye okudum; yahut: Yüzde yüz öyle okudum.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 90
      }
    },
    {
      "hadithNumber": 2041,
      "arabicNumber": "882.03",
      "book": 7,
      "hadithInBook": 91,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ حَدَّثَنَا عَمْرٌو، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ‏.‏",
        "translations": {
          "en": "Salim narrated on the authority of his father that the Messenger of Allah (ﷺ) used to observe two rak'ahs after Jumu'a",
          "ur": "سالم نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم جمعے کےبعددو ر کعتیں پڑھتے تھے ۔",
          "fr": "Rapporté par Salim d’après son père : Le Messager d’Allah ﷺ accomplissait deux rak'a après la prière du vendredi",
          "id": "Dan Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ibnu Numair] -Zhuhair berkata- telah menceritakan kepada kami [Sufyan bin Uyainah] telah menceritakan kepada kami [Amru] dari [Az Zuhri] dari [Salim] dari [bapaknya] bahwa Nabi shallallahu 'alaihi wasallam biasanya shalat dua raka'at setelah shalat Jum'at",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve İbni Nümeyr rivayet ettiler. Züheyr Dediki: Bize Süfyân b. Uyeyne rivayet etti. (Dediki): Bize Amr, Zührî'den, o da Sâlim'den, o da babasından naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellem) cum'a dan sonra iki rek'ât namaz kılarmış. İzah 883 te"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 91
      }
    },
    {
      "hadithNumber": 2042,
      "arabicNumber": "883.01",
      "book": 7,
      "hadithInBook": 92,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عُمَرُ، بْنُ عَطَاءِ بْنِ أَبِي الْخُوَارِ أَنَّ نَافِعَ بْنَ جُبَيْرٍ، أَرْسَلَهُ إِلَى السَّائِبِ ابْنِ أُخْتِ نَمِرٍ يَسْأَلُهُ عَنْ شَىْءٍ، رَآهُ مِنْهُ مُعَاوِيَةُ فِي الصَّلاَةِ فَقَالَ نَعَمْ ‏.‏ صَلَّيْتُ مَعَهُ الْجُمُعَةَ فِي الْمَقْصُورَةِ فَلَمَّا سَلَّمَ الإِمَامُ قُمْتُ فِي مَقَامِي فَصَلَّيْتُ فَلَمَّا دَخَلَ أَرْسَلَ إِلَىَّ فَقَالَ لاَ تَعُدْ لِمَا فَعَلْتَ إِذَا صَلَّيْتَ الْجُمُعَةَ فَلاَ تَصِلْهَا بِصَلاَةٍ حَتَّى تَكَلَّمَ أَوْ تَخْرُجَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَنَا بِذَلِكَ أَنْ لاَ تُوصَلَ صَلاَةٌ حَتَّى نَتَكَلَّمَ أَوْ نَخْرُجَ ‏.‏",
        "translations": {
          "en": "Umar b. `Ata' b. Abu Khuwar said that Nafi` b. Jubair sent him to al- Sa'ib the son of Namir's sister to ask him about what he had seen in the prayer of Mu`awiya. He said:Yes, I observed the Jumu`a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak`ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu`a prayer, do not observe (Sunan prayer) till you, have talked or gone out, for the Messenger of Allah (ﷺ) had ordered us to do this and not to combine two (types of) prayers without talking or going out",
          "ur": "غندر نے ابن جریج سے روایت کی ، انھوں نے کہا : مجھے عمر بن عطاء بن ابی خوار نے بتایا کہ نافع بن جبیر نے انھیں نمر کے بھانجے سائب کے پاس بھیجے ان سے اس چیز کے بارے میں پوچھنے کے لئے جو حضرت معاویہ رضی اللہ تعالیٰ عنہ نے ان کی نماز میں دیکھی تھی ۔ سائب نے کہا : ہاں ، میں نے مقصورہ ( مسجد کے حجرے ) میں ان کے ساتھ جمعہ پڑھا تھا ۔ اور جب امام نے سلام پھیرا تو میں اپنی جگہ پر کھڑا ہوگیا اور نماز پڑھی ۔ جب معاویہ رضی اللہ تعالیٰ عنہ اندرداخل ہوئے تو مجھے بلوایا اور کہا : جو کام تم نے کیا ہے آئندہ نہ کرنا ۔ جب تم جمعہ پڑھ لو تو اسے کسی دوسری نماز سے نہ ملانا یہاں تک کہ گفتگو کرلو یا اس جگہ سے نکل جاؤ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اس بات کا حکم دیاتھا کہ ہم کسی نماز کو دوسری نماز سے نہ ملائیں حتیٰ کہ ہم گفتگو کرلیں یا ( اس جگہ سے ) نکل جائیں ۔",
          "fr": "Rapporté par ‘Umar b. ‘Ata’ b. Abu Khuwar : Nafi‘ b. Jubair l’a envoyé auprès d’al-Sa’ib, fils de la sœur de Namir, pour lui demander ce qu’il avait vu de la prière de Mu‘awiya. Il a répondu : « Oui, j’ai prié le vendredi avec lui dans la Maqsura. Quand l’imam a terminé la prière, je me suis levé à ma place pour accomplir la prière surérogatoire. Quand il est rentré (dans son appartement), il m’a fait appeler et m’a dit : “Ne recommence pas ce que tu as fait. Quand tu as accompli la prière du vendredi, n’enchaîne pas avec une autre prière avant d’avoir parlé ou d’être sorti, car le Messager d’Allah ﷺ nous a ordonné cela et de ne pas combiner deux prières sans avoir parlé ou quitté l’endroit.” »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ghundar] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Umar bin Atha` bin Abul Khuwar] bahwa Nafi' bin Jubair mengutusnya kepada [Sa`ib] putra saudara perempuan Namir untuk menanyakan sesuatu yang pernah dilihat oleh [Mu'awiyah] dalam shalat, maka Sa`ib berkata, \"Benar aku pernah shalat Jum'at bersama Mu'awiyah di dalam Maqshurah (suatu ruangan yang dibangun di dalam masjid). Setelah imam salam aku berdiri di tempatku kemudian aku menunaikan shalat sunnah. Ketika Mu'awiyah masuk, ia mengutus seseorang kepadaku dan utusan itu mengatakan, 'Jangan kamu ulangi perbuatanmu tadi. Jika kamu telah selesai mengerjakan shalat Jum'at, janganlah kamu sambung dengan shalat sunnah sebelum kamu berbincang-bincang atau sebelum kamu keluar dari masjid. Karena Rasulullah shallallahu 'alaihi wasallam memerintahkan hal itu kepada kita yaitu 'Janganlah suatu shalat disambung dengan shalat lain, kecuali setelah kita mengucapkan kata-kata atau keluar dari Masjid.'\" Dan telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Hajjaj bin Muhammad] ia berkata, [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Umar bin Atha`] bahwa Nafi' bin Jubair telah mengutusnya kepada [Sa`ib bin Yazid bin Ukhti Namir]. Ia pun menyebutkan hadits yang semisalnya, hanya saja ia mengatakan; \"Ketika ia salam, saya langsung berdiri di tempatku.\" Ia tidak menyebutkan kata Imam",
          "tr": "Bize Ebû Bekir b. Ebi Şeybe rivayet etti. (Dediki): Bize Gunder, İbni Cüreyc'den rivayet etti. Demişki: Bana Ömer b. Atâ' b. Ebi'l-Huvâr haber verdiki: Nâfi' b. Cübeyr, kendisini Sâib ibni Uht-i Nemir'e göndererek Muâviye'nin namaz hususunda onda gördüğü bir şey'i sordurmuş. Sâib şu cevâbı vermiş: «Evet, ben onunla birlikde Maksûre'de cum'a namazını kıldım. İmam selâm verince ben olduğum yerde ayağa kalkarak namaz kıldım. (Muâviye) içeriye girince bana: — Bir daha böyle yapma! Cumâ'yı kıldığın vakit konuşmadıkça yahut oradan çıkmadıkça ona başka namaz ekleme. Çünkü Resûlullah (Sallallahu Aleyhi ve Sellem) bize, bunu (yani) konuşmadıkça yahut mescıdden çıkmadıkça hiç bir namazın, başka namaza eklenmemesini emretti dıye haber gönderdi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 92
      }
    },
    {
      "hadithNumber": 2043,
      "arabicNumber": "883.02",
      "book": 7,
      "hadithInBook": 93,
      "text": {
        "arabic": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءٍ، أَنَّ نَافِعَ بْنَ جُبَيْرٍ، أَرْسَلَهُ إِلَى السَّائِبِ بْنِ يَزِيدَ ابْنِ أُخْتِ نَمِرٍ ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَلَمَّا سَلَّمَ قُمْتُ فِي مَقَامِي وَلَمْ يَذْكُرِ الإِمَامَ ‏.‏",
        "translations": {
          "en": "The same hadith is narrated on the authority of 'Umar b. Ata' but with this modification:When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it",
          "ur": "حجاج بن محمد نے کہا : ابن جریج نے کہا : مجھے عمر بن عطاء نے بتایا کہ نافع بن جبیر نے انھیں نمر کے بھانجے سائب بن یزید کے پاس بھیجا ۔ ۔ ۔ آگے سابقہ حدیث کے کی مانند بیان کیا ۔ مگر ( اس روایت میں ) یہ ہے کہ سائب نے کہا : جب انھوں نے سلام پھیرا تو میں اپنی جگہ کھڑا ہوگیا ۔ انھوں نے ( سلام پھیرا کہا ) امام کا ذکر نہیں کیا ۔",
          "fr": "Rapporté par ‘Umar b. Ata’ : Le même hadith est rapporté, mais avec cette modification : « Quand il (l’imam) a terminé la prière, je me suis levé à ma place. » Il n’est pas fait mention de l’imam dans ce récit",
          "tr": "{….} Bize Hârûn b. Abdillâh rivayet etti. (Dediki): Bize Haccâcu'bunu Muhammed rivayet etti. Dediki: İbni Cüreyc: Bana Ömer b. Ata' haber verdiki, Nâfi' b. Cübeyr, kendisini Sâib b. Yezîd İbni Uht-i Nemir'e göndermiş... diyerek hadisi yukarki hadîs tarzında rivayet etti. Şu kadar var ki Amr (burada) : «Selâm verince olduğum yerde ayağa kalktım.» demiş: «imam» ı zikretmemişdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 7,
        "hadith": 93
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "54KB"
  }
}