{
  "collection": "muslim",
  "book": 8,
  "name": {
    "arabic": "كتاب The Book of Prayer - Two Eids",
    "transliteration": "kitab prayer - two eids",
    "translation": "The Book of Prayer - Two Eids"
  },
  "totalHadith": 22,
  "hadithNumberRange": {
    "first": 2044,
    "last": 2069
  },
  "content": [
    {
      "hadithNumber": 2044,
      "arabicNumber": "884.01",
      "book": 8,
      "hadithInBook": 1,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، - قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ، عَبَّاسٍ قَالَ شَهِدْتُ صَلاَةَ الْفِطْرِ مَعَ نَبِيِّ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ يُصَلِّيهَا قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُ قَالَ فَنَزَلَ نَبِيُّ اللَّهِ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجَلِّسُ الرِّجَالَ بِيَدِهِ ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ وَمَعَهُ بِلاَلٌ فَقَالَ ‏{‏ يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ فَتَلاَ هَذِهِ الآيَةَ حَتَّى فَرَغَ مِنْهَا ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا ‏\"‏ أَنْتُنَّ عَلَى ذَلِكِ ‏\"‏ فَقَالَتِ امْرَأَةٌ وَاحِدَةٌ لَمْ يُجِبْهُ غَيْرُهَا مِنْهُنَّ نَعَمْ يَا نَبِيَّ اللَّهِ لاَ يُدْرَى حِينَئِذٍ مَنْ هِيَ قَالَ ‏\"‏ فَتَصَدَّقْنَ ‏\"‏ ‏.‏ فَبَسَطَ بِلاَلٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ فِدًى لَكُنَّ أَبِي وَأُمِّي ‏.‏ فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِمَ فِي ثَوْبِ بِلاَلٍ ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas reported:I participated in the Fitr prayer with the Messenger of Allah (ﷺ) and Abu Bakr, 'Umar and 'Uthman, and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah (ﷺ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah\" (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal",
          "ur": "حسن بن مسلم نے طاوس سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : میں عید الفطر کی نماز میں رسول اللہ صلی اللہ علیہ وسلم ابو بکر رضی اللہ تعالیٰ عنہ عمر اور عثمان رضی اللہ تعالیٰ عنہ کے ساتھ حاضر ہوا ہوں یہ سب خطبے سے پہلے نماز پڑھتے تھے پھر خطبہ دیتے تھے ایک دفعہ اللہ کے نبی صلی اللہ علیہ وسلم ( بلند جگہ سے ) نیچے آئے ایسا محسوس ہو تا ہے کہ میں ( اب بھی ) آپ کو دیکھ رہا ہوں جب آپ اپنے ہاتھ سے مردوں کو بٹھا رہے تھے پھر ان کے در میان میں سے راستہ بنا تے ہو ئے آگے بڑھے حتیٰ کہ عورتوں کے قریب تشریف لے آئے اور بلال رضی اللہ تعالیٰ عنہ آپ کے ساتھ تھے آپ نے ( قرآن کا یہ حصہ تلاوت ) فر ما یا ۔ \" اے نبی صلی اللہ علیہ وسلم !جب آپ کے پاس مومن عورتیں اس بات پر بیعت کرنے کے لیے آئیں کہ وہ اللہ تعا لیٰ کے ساتھ کسی چیز کو شریک نہیں بنا ئیں گی ۔ آپ نے یہ آیت تلاوت فر ما ئی حتیٰ کہ اس سے فارغ ہو ئے پھر فر ما یا ۔ \" تم اس پر قائم ہو؟ \" تو ایک عورت نے ( جبکہ ) آپ کو اس کے علاوہ ان میں سے اور کسی نے جواب نہیں دیا کہا : ہاں اے اللہ کے نبی صلی اللہ علیہ وسلم ! ۔ ۔ اس وقت پتہ نہیں چل رہا تھا کہ وہ کو ن ہے ۔ ۔ ۔ آپ نے فر ما یا ۔ \" تم صدقہ کرو ۔ ۔ ۔ اس پر بلال رضی اللہ تعالیٰ عنہ نے اپنا کپڑا پھیلا دیا پھر کہنے لگے لاؤ تم سب پر میرے ماں باپ قربان ہوں !تو وہ اپنے بڑے بڑے چھلے اور انگوٹھیا ں بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں ڈالنے لگیں ۔",
          "fr": "Rapporté par Ibn ‘Abbas : J’ai participé à la prière de l’Aïd avec le Messager d’Allah ﷺ, Abu Bakr, ‘Umar et ‘Uthman, et tous accomplissaient la prière avant le sermon, puis le Prophète ﷺ prononçait le sermon. Ensuite, le Messager d’Allah ﷺ est descendu (du minbar) et je le vois encore, ordonnant aux gens de s’asseoir avec sa main. Il s’est frayé un chemin jusqu’aux femmes, accompagné de Bilal. Il a alors récité ce verset : « Ô Prophète, lorsque des femmes croyantes viennent te prêter serment qu’elles n’associeront rien à Allah… » (Sourate 60, verset 12), jusqu’à la fin. Puis il a dit : « Acceptez-vous cela ? » Seule une femme a répondu : « Oui, Messager d’Allah », mais aucune autre n’a répondu. On ne savait pas qui elle était. Le Prophète ﷺ les a encouragées à donner l’aumône. Bilal a étendu son vêtement et a dit : « Venez donner l’aumône. Que mon père et ma mère soient votre rançon. » Elles ont alors commencé à jeter des bagues et des anneaux dans le vêtement de Bilal",
          "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abdu bin Humaid] semuanya dari [Abdurrazaq] - [Ibnu Rafi'] - berkata, telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu Abbas] ia berkata; \"Saya pernah menghadiri shalat Idul Fithri bersama Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman, mereka semua shalat terlebih dahulu sebelum khutbah.\" Kemudian Ibnu Abbas mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam turun dari mimbar, sepertinya aku sempat melihat beliau ketika menyuruh orang-orang lelaki duduk dengan isyarat tangan beliau lalu beliau lewat di tengah sehingga beliau mendatangi kaum wanita disertai Bilal, dan beliau membaca ayat: \"Hai nabi, apabila datang kepadamu perempuan-perempuan yang beriman untuk mengadakan janji setia, bahwa mereka tiada akan menyekutukan Allah…\" beliau membaca ayat itu hingga selesai. Setelah itu, beliau bertanya: \"Apakah kalian ingin termasuk seperti yang disebutkan ayat itu?\" seorang wanita menjawab -ketika itu tidak ada wanita lain yang menjawab-, \"Benar, wahai Nabiyullah.\" Saat itu, beliau tidak tahu siapa perempuan itu. Beliau bersabda: \"Kalau demikian, bersedekahlah.\" Lalu Bilal membentangkan kainnya, kemudian ia mengatakan, \"Ayolah! Sungguh, sedekah ini menjadi penebus kalian dari (siksa neraka).\" Akhirnya para wanita itu pun meletakkan cincinnya di atas kain yang dihamparkan Bilal",
          "tr": "Bana Muhammed b. Râfi' ile Abd b. Humeyd hep birden Abdürrezzâk'dan rivayet ettiler. İbni Râfi' dediki: Bize, Abdürrezzak rivayet etti. (dediki): Bize ibni Cüreyc haber verdi (dediki): Bana Hasen b. Müslim, Tâvûs'dan, o da İbni Abbâs'dan naklen haber verdi. İbni Abbâs şöyle demiş: «Ramazan bayramı namazında Nebiyyullah (Sallallahu Aleyhi ve Sellem) Ebu Bekir, Ömer ve Osman ile beraber bulundum. Hepsi onu hutbeden önce kılar, sonra hutbe okurlardı. (Bir defa) Nebiyyullah (Sallallahu Aleyhi ve Sellem) minber’den indi; onun eliyle erkekleri oturttuğunu hala görür gibiyim. Sonra erkek saflarını yararak, kadınların yanına geldi; Bilal de beraberinde idi. Resulullah (Sallallahu Aleyhi ve Sellem)- (Ey Nebi ! Şayet mü'min kadınlar Allah'a hiç bir şey'i şerik koşmamak şartı ile sana bey'at etmeye gelirlerse... kabul et.) [Mümtehîne 12.] ayet-i kerimesini bitinceye kadar okudu. Onu bitirdiği vakit (kadınlara): — Siz, bu ayet de zikredilen şartlar üzere devam ediyor musunuz? diye sordu. İçlerinden bir tek kadın: — Evet, yâ Nebiyyallah! dedi. Resûlullah (Sallallahu Aleyhi ve Sellem)'e ondan başka cevap veren olmadı. O anda bu kadın’ın kim olduğu bilinmiyordu. Resûlullah (Sallallahu Aleyhi ve Sellem) : — O halde sadaka verin!., buyurdu. Bunun üzerine Bilal elbisesini yere yayarak: — Haydi buyurun! Annem babam size feda olsun... dedi. Artık kadınlar kimi halkalarını, kimi yüzüklerini Bilâl'in elbisesi içine atmaya başladılar.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 2047,
      "arabicNumber": "885.01",
      "book": 8,
      "hadithInBook": 3,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ يَوْمَ الْفِطْرِ فَصَلَّى فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَلَمَّا فَرَغَ نَبِيُّ اللَّهِ صلى الله عليه وسلم نَزَلَ وَأَتَى النِّسَاءَ فَذَكَّرَهُنَّ وَهُوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ يُلْقِينَ النِّسَاءُ صَدَقَةً ‏.‏ قُلْتُ لِعَطَاءٍ زَكَاةَ يَوْمِ الْفِطْرِ قَالَ لاَ وَلَكِنْ صَدَقَةً يَتَصَدَّقْنَ بِهَا حِينَئِذٍ تُلْقِي الْمَرْأَةُ فَتَخَهَا وَيُلْقِينَ وَيُلْقِينَ ‏.‏ قُلْتُ لِعَطَاءٍ أَحَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِيَ النِّسَاءَ حِينَ يَفْرُغُ فَيُذَكِّرَهُنَّ قَالَ إِي لَعَمْرِي إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ وَمَا لَهُمْ لاَ يَفْعَلُونَ ذَلِكَ",
        "translations": {
          "en": "Jabir b. 'Abdullah reported:The Apostle of Allah (ﷺ) stood up on the day of 'Id al-Fitr and observed prayer. And he commenced the prayer before the sermon. He then delivered the sermon. When the Messenger of Allah (ﷺ) had finished (the sermon) he came down from (the pulpit), and made his way to the women and exhorted them (to do good acts), and he was leaning on the hand of Bilal. Bilal had stretched his cloth in which women were throwing alms. I (one of the narrators) said to 'Ata' (the other narrator): It must be Zakat on the day of Fitr. He ('Ata') said: No. It was alms (which) they were giving on that occasion, and a woman gave her ring, and then others gave, and then others gave. I said to 'Ata': Is It right now for the Imam to come to the women when he has finished (his address to the men) that he should exhort them (to good deeds)? He said: (Why not) by my life, it is right for them (to do so). What is the matter with them that they do not do it now?",
          "ur": "ابن جریج نے کہا : ہمیں عطاء نے حجرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے خبر دی کہا : میں نے ان ( جابر رضی اللہ تعالیٰ عنہ ) کو یہ کہتے ہوئے سنا کہ نبی صلی اللہ علیہ وسلم عید الفطر کے دن ( نماز کے لیے ) کھڑے ہو ئے پھر نماز پڑھا ئی چنانچہ آپ نے خطبے سے پہلے نماز سے ابتدا کی پھر لو گوں کو خطاب فر ما یا ۔ جب نبی صلی اللہ علیہ وسلم ( خطبہ سے ) فارغ ہو ئے تو ( چبوترے سے ) اتر کر عورتوں کے پاس آئے انھیں تذکیر و نصیحت کی جبکہ آپ بلال رضی اللہ تعالیٰ عنہ کے بازوکا سہارا لیے ہو ئے تھے اور بلال رضی اللہ تعالیٰ عنہ اپنا کپڑا پھیلا ئے ہو ئے تھے عورتیں اس میں صدقہ ڈال رہی تھیں ( ابن جریج نے کہا : ) میں نے عطاء سے پوچھا فطر کے دن کا صدقہ ( ڈال رہی تھیں ؟ ) انھوں نے کہا : نہیں اس وقت ( اپنا ) صدقہ کر رہی تھیں ( کو ئی عورت چھلا ڈالتی تھی ( اسی طرح یکے بعد دیگر ے ( ڈال رہی تھیں اور ڈال رہی تھیں ۔ میں نے عطاء سے ( پھر ) پوچھا : کیا اب بھی امام کے لیے لا زم ہے کہ جب ( مردوں کے خطبے سے ) فارغ ہو تو عورتوں کو تلقین اور نصیحت کرے ؟ انھوں نے کہا : ہاں مجھے اپنی زندگی کی قسم ! یہ ان پر عائد شدہ ) حق ہے انھیں کیا ہو گیا ہے کہ وہ ایسا نہیں کرتے ۔",
          "fr": "Rapporté par Jabir b. ‘Abdullah : Le Messager d’Allah ﷺ s’est levé le jour de l’Aïd al-Fitr et a accompli la prière, la précédant du sermon. Ensuite, il a prononcé le sermon. Quand il a terminé, il est descendu du minbar, s’est dirigé vers les femmes et les a exhortées à faire le bien, en s’appuyant sur la main de Bilal. Bilal avait étendu son vêtement dans lequel les femmes jetaient leurs aumônes. J’ai dit à ‘Ata’ : « C’était sûrement la zakat du jour de l’Aïd al-Fitr. » Il a répondu : « Non, c’étaient des aumônes qu’elles donnaient à ce moment-là. Une femme a donné sa bague, puis d’autres ont donné à leur tour. » J’ai demandé à ‘Ata’ : « Est-il permis aujourd’hui à l’imam d’aller voir les femmes après avoir fini son discours aux hommes pour les exhorter ? » Il a répondu : « Bien sûr, pourquoi ne le ferait-il pas ? Qu’est-ce qui les empêche de le faire aujourd’hui ? »",
          "id": "Dan Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi' bin Rafi'] Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] dari [Jabir bin Abdullah] ia berkata, saya mendengarnya berkata; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam berdiri pada hari raya Iedul Fithri, lalu beliau shalat. Beliau shalat sebelum menyampaikan khuthbah. Seusai shalat, baru beliau menyampaikan khuthbah kepada manusia. Setelah Nabi shallallahu 'alaihi wasallam berkhutbah, beliau mendatangi kaum wanita lalu mengingatkan mereka sambil bersandar pada tangan Bilal. Sedangkan Bilal membentangkan kainnya, akhirnya kaum wanita pun melemparkan sedekahnya.\" Saya bertanya kepada Atha`, \"Apakah itu merupakan Zakat Fithri?\" ia menjawab, \"Tidak, akan tetapi itu adalah sedekah yang mereka keluarkan, saat itu para wanita melemparkan cincin, sehingga yang lain pun turut melempar.\" Saya bertanya lagi kepada Atha`, \"Apakah sekarang dapat dibenarkan, bila seorang imam mendatangi kaum wanita setelah menyampaikan khutbah lalu mengingatkan mereka?\" ia menjawab, \"Wahai Amru, sesungguhnya hal itu benar-benar termasuk tindakan yang benar, apa alasan mereka untuk tidak melakukannya?",
          "tr": "Bize îshâk b. İbrahim İle Muhammed b. Râfi' rivayet ettiler. ibni Râfl dediki: Bize, Abdürrazzak 1rivayet etti. (dediki): Bize, ibni Cüreyc haber verdi, (dediki) Bana Ata', Câbir b. Abdillâh' dan naklen haber verdi. dediki: Ben, Câbir'i şöyle derken işittim.- Nebi (Sallallahu Aleyhi ve Sellem) Ramazan Bayramı günü kalkarak namaz kıldı ve hutbeden önce namazla işe başladı. Sonra cemaata hutbe okudu. Neblyyullah (Sallallahu Aleyhi ve Sellem) hutbeyî bitirince minberden indi. Ve kadınların yanına gelerek, onlara va'z-u nasîhatda bulundu. Kendisi Bilâl'in eline dayanıyordu. Bilâl ise elbisesini yaymıştı. Kadınlar (onun içine) sadaka atıyorlardı. Ben, Ata* (b. Rabâh)'a: «Kadınların bu verdikleri Ramazan Bayramı zekâtı mıydı?» diye sordum. — «Hayır. Lâkin bu, onların o zamana mahsûs verdikleri bir sadaka idi. Kadınlar yüzüklerini atıyor da atıyorlardı.» cevâbını verdi. — Şimdi de imamın hutbeyi bitirince kadınların yanına gelerek, onlara va'z-u nasîhatta bulunmasını, üzerine bir vecibe görüyor musun? dedim: — Evet, ömrüme yemin ederim ki bu onlar üzerinde gerçekden bir hakdır. Bunun için yapmazlar; bilmem, dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 2048,
      "arabicNumber": "885.02",
      "book": 8,
      "hadithInBook": 4,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الصَّلاَةَ يَوْمَ الْعِيدِ فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلاَ إِقَامَةٍ ثُمَّ قَامَ مُتَوَكِّئًا عَلَى بِلاَلٍ فَأَمَرَ بِتَقْوَى اللَّهِ وَحَثَّ عَلَى طَاعَتِهِ وَوَعَظَ النَّاسَ وَذَكَّرَهُمْ ثُمَّ مَضَى حَتَّى أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ فَقَالَ تَصَدَّقْنَ فَإِنَّ أَكْثَرَكُنَّ حَطَبُ جَهَنَّمَ فَقَامَتْ امْرَأَةٌ مِنْ سِطَةِ النِّسَاءِ سَفْعَاءُ الْخَدَّيْنِ فَقَالَتْ لِمَ يَا رَسُولَ اللَّهِ قَالَ لِأَنَّكُنَّ تُكْثِرْنَ الشَّكَاةَ وَتَكْفُرْنَ الْعَشِيرَ قَالَ فَجَعَلْنَ يَتَصَدَّقْنَ مِنْ حُلِيِّهِنَّ يُلْقِينَ فِي ثَوْبِ بِلَالٍ مِنْ أَقْرِطَتِهِنَّ وَخَوَاتِمِهِنَّ",
        "translations": {
          "en": "Jabir b. 'Abdullah reported:I observed prayer with the Messenger of Allah (ﷺ) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal, and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal",
          "ur": "عبد الملک بن ابی سلیمان نے عطاء سے اور انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : میں عید کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز میں حاضر ہوا آپ نے خطبے سے پہلے اذان اور تکبیر کے بغیر نماز سے ابتدا کی پھر بلال رضی اللہ تعالیٰ عنہ کا سہارا لے کر کھڑے ہو ئے اللہ کے تقوے کا حکم دیا اس کی اطاعت پر ابھا را لو گو ں کو نصیحت کی اور انھیں ( دین کی بنیادی باتوں کی ) یاد دہانی کرا ئی پھر چل پڑے حتیٰ کہ عورتوں کے پاس آگئے ( تو ) انھیں وعظ و تلقین ( تذکیر ) کی اور فر ما یا ۔ \" صدقہ کرو کیونکہ تم میں اسے اکثر جہنم کا ایندھن ہیں ۔ \" عورتوں کے در میان سے ایک بھلی سیاہی مائل رخساروں والی عورت نے کھڑے ہو کر پوچھا : اللہ کے رسول صلی اللہ علیہ وسلم !کیوں ؟آپ نے فر ما یا : اس لیے کہ تم شکا یت بہت کرتی ہو اور اپنے رفیق زندگی کی ناشکری کرتی ہو ۔ ( جا بر رضی اللہ تعالیٰ عنہ نے ) کہا اس پردہ عورتیں اپنے زیورات سے صدقہ کرنے لگیں وہ بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں اپنی بالیاں اور انگھوٹھیاں ڈالنے لگیں ۔",
          "fr": "Rapporté par Jabir b. ‘Abdullah : J’ai prié avec le Messager d’Allah ﷺ le jour de l’Aïd. Il a commencé par la prière avant le sermon, sans adhan ni iqama. Ensuite, il s’est levé, s’appuyant sur Bilal, et a ordonné de craindre Allah, les a exhortés à Lui obéir, a prêché et conseillé les gens. Puis il s’est dirigé vers les femmes, leur a prêché, conseillé et demandé de donner l’aumône, car la plupart d’entre elles sont le combustible de l’Enfer. Une femme au visage marqué s’est levée et a dit : « Pourquoi cela, Messager d’Allah ? » Il a répondu : « Parce que vous vous plaignez souvent et montrez de l’ingratitude envers vos époux. » Elles ont alors commencé à donner leurs bijoux, comme des boucles d’oreilles et des bagues, qu’elles jetaient dans le vêtement de Bilal",
          "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] dari [Atha`] dari [Jabir bin Abdullah] ia berkata; Aku telah mengikuti shalat hari raya bersama Rasulullah shallallahu 'alaihi wasallam. Beliau memulainya dengan shalat sebelum menyampaikan khutbah, tanpa disertai adzan dan Iqamah. Setelah itu beliau berdiri sambil bersandar pada tangan Bilal. Kemudian beliau memerintahkan untuk selalu bertakwa kepada Allah, dan memberikan anjuran untuk selalu mentaati-nya. Beliau juga memberikan nasehat kepada manusia dan mengingatkan mereka. Setelah itu, beliau berlalu hingga sampai di tempat kaum wanita. Beliau pun memberikan nasehat dan peringatan kepada mereka. Beliau bersabda: \"Bersedekahlah kalian, karena kebanyakan kalian akan menjadi bahan bakar neraka jahannam.\" Maka berdirilah seorang wanita terbaik di antara mereka dengan wajah pucat seraya bertanya, \"Kenapa ya Rasulullah?\" beliau menjawab: \"Karena kalian lebih banyak mengadu (mengeluh) dan mengingkari kelebihan dan kebaikan suami.\" Akhirnya mereka pun menyedekahkan perhiasan yang mereka miliki dengan melemparkannya ke dalam kain yang dihamparkan Bilal, termasuk cincin dan kalung-kalung mereka",
          "tr": "Bize, Muhammed b. Abdillâh b. Numeyr ivayet etti (dediki): Bize, babam rivayet etti. (dediki): Bize, Abdülmelik b. Ebi Süleyman, Atâ'dan, o da Câbir b. Abdillâh'dan naklen rivayet etti Câbir şöyle demiş: Ben, Resûlullah (Sallallahu Aleyhi ve Sellem) ile birlikde bayram günü namazda bulundum, hutbeden önce ezan ve ikaametsiz olarak işe namazdan başladı. Sonra Bilâl'e dayanarak ayakta durdu ve Allah'dan korkmayı emretti. Ona taat'ı teşvîkde bulundu. Cemaata va'z-u nasihat etti. Sonra yürüdü, kadınların yanına gelince onlara va'z-u nasîhatda bulunarak: «Tesadduk edin! Zira çoğunuz cehennem odunu olacaksınız!» buyurdu. Bunun üzerine kadınlardan kara yağız güzeli biri kalkarak: — «Niçin yâ Resûlallah? diye sordu. Nebi (Sallallahu Aleyhi ve Sellem) — «Çünkü sizler hâlinizden çok şikâyet eder, kocalarınızın nimetine karşı küfranda bulunursunuz.» cevâbını verdi. Derken kadınlar kendi ziynetlerinden tesadduk etmeğe başladılar. Bilâl'ın elbisesi içine küpe ve yüzüklerini atıyorlardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 2049,
      "arabicNumber": "886.01",
      "book": 8,
      "hadithInBook": 5,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى ‏.‏ ثُمَّ سَأَلْتُهُ بَعْدَ حِينٍ عَنْ ذَلِكَ فَأَخْبَرَنِي قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ",
        "translations": {
          "en": "Ibn 'Abbas and Jaibir b. 'Abdullah al-Ansari reported:There was no Adhan on the (occasion) of Id-ul-Fitr and Id-ul-Adha. I (Ibn Juraij) said: I asked him after some time about it. He ('Ata', one of the narrators) said: Jabir b. 'Abdullah al-Ansari told me: There is neither any Adhan on Id-ul-Fitr when the Imam comes out, nor even after his coming out; their is neither lqama nor call nor anything of the sort of calling on that day and nor Iqama",
          "ur": "سیدنا ابن عباس اور سیدنا جابر ؓ نے کہا کہ اذان نہ عیدالفطر میں ہوتی تھی اور نہ عید الاضحیٰ میں ۔ پھر میں نے ان سے پوچھا تھوڑی دیر کے بعد اسی بات کو ، (یہ قول ہے ابن جریج راوی کا) تو انہوں نے کہا (یعنی ان کے شیخ عطاء نے) کہ خبر دی مجھے سیدنا جابر بن عبداللہ انصاری ؓ نے کہ نہ اذان ہوتی تھی عیدالفطر میں جب نکلتا تھا اور نہ بعد اس کے نکلنے کے اور نہ تکبیر ہوتی ، نہ اذان اور نہ اور کچھ وہ دن ایسا ہے کہ اس دن نہ اذان ہے نہ تکبیر ۔",
          "fr": "Rapporté par Ibn ‘Abbas et Jabir b. ‘Abdullah al-Ansari : Il n’y avait pas d’adhan lors de l’Aïd al-Fitr ni de l’Aïd al-Adha. (Ibn Juraij rapporte :) Je lui ai demandé plus tard à ce sujet. (‘Ata’, l’un des rapporteurs, a dit :) Jabir b. ‘Abdullah al-Ansari m’a dit : « Il n’y a ni adhan à l’Aïd al-Fitr quand l’imam arrive, ni après son arrivée ; il n’y a ni iqama, ni appel, ni rien de semblable ce jour-là. »",
          "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] dari [Ibnu Abbas] dan dari [Jabir bin Abdullah Al Anshari] keduanya berkata; \"Tidak pernah dikumandangkan adzan pada saat Iedul Fithri dan tidak pula pada saat shalat Iedul Adlha.\" Kemudian setelah itu, saya menanyakan hal itu kepadanya, maka ia pun mengabarkan kepadaku, ia berkata; telah menceritakan kepadaku Jabir bin Abdullah Al Anshari bahwasanya; \"Tidak ada adzan untuk shalat Iedul Fithri saat Imam keluar, atau setelah keluarnya Imam. Dan tidak ada pula Iqamah, pengumuman serta tidak ada pula yang lain, tidak ada adzan dan tidak pula Iqamah",
          "tr": "Bana Muhammed b. Râfi' rivayet etti. (dediki): Bize Abdurrazzâk rivayet etti. (dediki): Bize, İbni Cüreyc haber verdi (dediki): Bana Ata', ibni Abbâs ile Câbir b. Abdullâh El-Ensari'den naklen haber verdi. Demişlerki: Gerek Ramazan Bayramı gerekse Kurban Bayramı günü ezan okunmazdı. (İbni Cüreyc diyor ki:) Bir müddet sonra ben, Atâ'ya bu mes'eleyi yine sordum, bana haber vererek, dediki: «Bana Câbir b. Abdillâh EI-Ensâri haber verdiki, Ramazan Bayramı günü gerek İmam minbere çıkarken gerekse çıktıktan sonra namaz için ezan, ikaamet, nida ve hiç bir şey yokmuş. O gün ne ezan varmış ne de İkaamet.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 2050,
      "arabicNumber": "886.02",
      "book": 8,
      "hadithInBook": 6,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ أَوَّلَ مَا بُويِعَ لَهُ أَنَّهُ لَمْ يَكُنْ يُؤَذَّنُ لِلصَّلاَةِ يَوْمَ الْفِطْرِ فَلاَ تُؤَذِّنْ لَهَا - قَالَ - فَلَمْ يُؤَذِّنْ لَهَا ابْنُ الزُّبَيْرِ يَوْمَهُ وَأَرْسَلَ إِلَيْهِ مَعَ ذَلِكَ إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ وَإِنَّ ذَلِكَ قَدْ كَانَ يُفْعَلُ - قَالَ - فَصَلَّى ابْنُ الزُّبَيْرِ قَبْلَ الْخُطْبَةِ ‏.‏",
        "translations": {
          "en": "Ata' reported that Ibn 'Abbas sent (him) to Ibn Zubair at the commencement of the oath of allegiance to him (for Caliphate saying):As there is no Adhan on 'Id-ul-Fitr, so you should not pronounce it. Ibn Zubair did not pronounce Adhan on that day. He (Ibn 'Abbas) also sent him (with this message) that sermon (is to be delivered) after the prayer, and thus it was done. So lbn Zubair observed prayer before Khutba",
          "ur": "۔ محمد بن رافع نے کہا : ہمیں عبد الرزاق نے حدیث سنا ئی کہا : ہمیں ابن جریج نے خبر دی کہا : مجھے عطاء نے خبر دی کہ ابن زبیر رضی اللہ تعالیٰ عنہ کی بیعت کے آغاز ہی میں ابن عباس رضی اللہ تعالیٰ عنہ نے ان کی طرف پیغام بھیجا کہ عید الفطرکے دن نماز ( عید کے لیے اذان نہیں دی جا تی تھی لہذا آپ اس کے لیے اذان نہ کہلوائیں ابن زبیر رضی اللہ تعالیٰ عنہ نے اس اذان نہ کہلوائی اور اس کے ساتھ یہ پیغام بھی بھیجا کہ خطبہ نماز کے بعد ہے اور ( عہد نبوی اور خلا فت راشدہ میں ) ایسے ہی کیا جا تا تھا ( عطاء نے ) کہا : تو ابن زبیر رضی اللہ تعالیٰ عنہ نے نماز خطبے سے پہلے پڑھا ئی ۔",
          "fr": "Rapporté par ‘Ata’ : Ibn ‘Abbas l’a envoyé auprès d’Ibn Zubair au début de son allégeance comme calife, en disant : « Comme il n’y a pas d’adhan à l’Aïd al-Fitr, tu ne dois pas le faire. » Ibn Zubair n’a donc pas fait l’adhan ce jour-là. (Ibn ‘Abbas) lui a aussi envoyé ce message : « Le sermon doit être après la prière. » C’est ainsi qu’Ibn Zubair a accompli la prière avant le sermon",
          "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Atha`] bahwasanya; [Ibnu Abbas] mengirim seseorang kepada Ibnu Zubiar ketika pertama kali keluar (untuk menunaikan shalat Ied), \"Bahwa shalat Ied (ditunaikan) tanpa adzan. Karena itu, jangankan kamu mengumandangkan adzan.\" Maka Ibnu Zubair pun tidak menyuruh untuk mengumandangkan adzan. Kemudian para hari itu, ia juga mengutus kepadanya, bahwa penyampaian khutbah adalah sesudah shalat. Dan bahwa hal itu sebelumnya telah dilakukan oleh Rasulullah shallallahu 'alaihi wasallam. Akhirnya Ibnu Zubair pun shalat Ied sebelum khutbah",
          "tr": "Bana Muhammed b. Râfi' rivayet etti. (dediki): Bize Abdurrazzâk rivayet etti. (dediki): Bize İbni Cüreyc haber verdi. (dediki) Bana, Atâ' haber verdi ki ibni Abbâs, ibni Zübeyr'e ilk biyat edildiği zaman ona: «Ramazan Bayramı günü, bayram namazı için ezan okunmazdı. Binâenaleyh onun için sen de ezan okutma!» diye haber göndermiş; o da, o gün bayram namazı için ezan okutmamış, ibni Abbâs, bu haberle blrlikde ibni Zübeyr'e: «Hutbe de namazdan sonra okunur. Bu, böyle yapılırdı.» diye haber göndermiş. Bunun üzerine ibni Zübeyr, bayram namazını hutbeden önce kıldırmış. İzah 888 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 2051,
      "arabicNumber": "887",
      "book": 8,
      "hadithInBook": 7,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَحَسَنُ بْنُ الرَّبِيعِ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ، سَمُرَةَ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعِيدَيْنِ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ بِغَيْرِ أَذَانٍ وَلاَ إِقَامَةٍ ‏.‏",
        "translations": {
          "en": "Jabir b. Samura said:I prayed with the Messenger of Allah (ﷺ) prayers on two I'ds wore than once or twice without there being Adhan and Iqama",
          "ur": "حضرت جا بر بن سمرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ عید ین کی نماز ایک یا دو دفعہ پڑھی ہے ۔",
          "fr": "Rapporté par Jabir b. Samura : J’ai prié avec le Messager d’Allah ﷺ lors de deux fêtes de l’Aïd, plus d’une ou deux fois, sans qu’il y ait adhan ni iqama",
          "id": "Dan Telah menceritakan kepada kami [Yahya bin Yahya] dan [Hasan bin Rabi'] dan [Qutaibah bin Sa'id] dan [Abu Bakar bin Abu Syaibah] - [Yahya] berkata- telah mengabarkan kepada kami -sementara orang-orang yang lain berkata- telah menceritakan kepada kami [Abul Ahwash] dari [Simak] dari [Jabir bin Samurah] ia berkata; Saya telah menunaikan shalat dua hari raya bersama Rasulullah shallallahu 'alaihi wasallam lebih dua kali, yakni (beliau menunaikannya) tanpa adzan dan iqamah",
          "tr": "Bize Yahya b. Yahya ile Hasen b. Rabi, Kuteybetü'bnü Sald ve Ebû Bekir b. Ebî Şeybe rivayet etti. Yahya (Bize haber verdi) tâbirini kullandı. Ötekiler: Bize, Ebû'l-Ahvas, Simâk'den, o da Câbir b. Semura'dan naklen rivayet etti, dediler. Cabir şunları söylemiş: Ben, Resûlullah (Sallallahu Aleyhi ve Sellem) ile birlikde bayram namazlarını bir değil, iki değil; bir çok defalar ezan ve ikaametsiz olarak kıldım.» İzah 888 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 2052,
      "arabicNumber": "888",
      "book": 8,
      "hadithInBook": 8,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ، اللَّهِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ ‏.‏",
        "translations": {
          "en": "Ibn 'Umar reported that the Messenger of Allah (ﷺ), Abu Bakr and 'Umar used to observe the two 'Id prayers before the sermon",
          "ur": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم ابو بکر اور عمر رضی اللہ تعالیٰ عنہ عید ین کی نماز خطبے سے پہلے پڑھتے تھے ۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah ﷺ, Abu Bakr et ‘Umar accomplissaient les deux prières de l’Aïd avant le sermon",
          "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdah bin Sulaiman] dan [Abu Usamah] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam, Abu Bakar dan Umar, mereka semua menunaikan shalat dua hari raya sebelum khutbah",
          "tr": "Bize Ebû Bekir b. Ebî Şevbe rivayet etti. (dediki): Bize Abdetü'bnü Süleyman ile Ebû Usâme, Ubeydullah'dan, o da Nâfi'den, o da ibni Ömer'den naklen rivayet ettiki, Nebi (Sallallahu Aleyhi ve Sellem) ile Ebû Bekir ve Ömer bayram namazlarını hutbeden önce kılarlarmış. İzah îbni Abbâs ile Câbir ve İbni Ömer hadislerini Buhâri «Cum'a» bahsinde; ayrıca, İbni Abbâs hadîsini Ebû Dâvûd «Namaz» bahsinde tahric etmişlerdir. Abdullah b. Zübeyr'e ilk biat olunduğu zamandan murâd: hicri 64 târihinde Yezid b. Muâviye'nin yerine halife seçilmesidir. Nevevi diyorki: «Câbir hadisinde: (Ramazan Bayramı namazından ezan, ikaamet, nida ve hiç bir şey yokdur.) denilmesi, zahirine bakılırsa gerek bizim ulemâmızın, gerekse başkalarının (Toplayıcı namaza buyurun.) diye seslenmeyi müstebab saymalarına muhalif görünürse de, hadis-i şerif: Bayram namazı için ezan ikaamet ve bunların mânâsında bir şey yokdur, şeklinde te'vil olunur.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 2053,
      "arabicNumber": "889",
      "book": 8,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ دَاوُدَ بْنِ قَيْسٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَخْرُجُ يَوْمَ الأَضْحَى وَيَوْمَ الْفِطْرِ فَيَبْدَأُ بِالصَّلاَةِ فَإِذَا صَلَّى صَلاَتَهُ وَسَلَّمَ قَامَ فَأَقْبَلَ عَلَى النَّاسِ وَهُمْ جُلُوسٌ فِي مُصَلاَّهُمْ فَإِنْ كَانَ لَهُ حَاجَةٌ بِبَعْثٍ ذَكَرَهُ لِلنَّاسِ أَوْ كَانَتْ لَهُ حَاجَةٌ بِغَيْرِ ذَلِكَ أَمَرَهُمْ بِهَا وَكَانَ يَقُولُ ‏ \"‏ تَصَدَّقُوا تَصَدَّقُوا تَصَدَّقُوا ‏\"‏ ‏.‏ وَكَانَ أَكْثَرَ مَنْ يَتَصَدَّقُ النِّسَاءُ ثُمَّ يَنْصَرِفُ فَلَمْ يَزَلْ كَذَلِكَ حَتَّى كَانَ مَرْوَانُ بْنُ الْحَكَمِ فَخَرَجْتُ مُخَاصِرًا مَرْوَانَ حَتَّى أَتَيْنَا الْمُصَلَّى فَإِذَا كَثِيرُ بْنُ الصَّلْتِ قَدْ بَنَى مِنْبَرًا مِنْ طِينٍ وَلَبِنٍ فَإِذَا مَرْوَانُ يُنَازِعُنِي يَدَهُ كَأَنَّهُ يَجُرُّنِي نَحْوَ الْمِنْبَرِ وَأَنَا أَجُرُّهُ نَحْوَ الصَّلاَةِ فَلَمَّا رَأَيْتُ ذَلِكَ مِنْهُ قُلْتُ أَيْنَ الاِبْتِدَاءُ بِالصَّلاَةِ فَقَالَ لاَ يَا أَبَا سَعِيدٍ قَدْ تُرِكَ مَا تَعْلَمُ ‏.‏ قُلْتُ كَلاَّ وَالَّذِي نَفْسِي بِيَدِهِ لاَ تَأْتُونَ بِخَيْرٍ مِمَّا أَعْلَمُ ‏.‏ ثَلاَثَ مِرَارٍ ثُمَّ انْصَرَفَ ‏.‏",
        "translations": {
          "en": "Abu Sa'id al-Khudri reported that the Messenger of Allah (ﷺ) used to go out on the day of Adha and on the day of Fitr and commenced the prayer. And after having observed his prayer and pronounced the salutation, he stood up facing people as they were seated at their places of worship. And if he intended to send out an army he made mention of it to the people, and if he intended any other thing besides it, he commanded them (to do that). He used to say (to the people):Give alms, give alms, give alms, and the majority that gave alms was of women. He then returned and this (practice) remained (in vogue) till Marwan b. al- Hakam (came into power). I went out hand in hand with Marwan till we came to the place of worship and there Kathir b. Salt had built a pulpit of clay and brick. Marwan began to tug me with his hand as though he were pulling me towards the pulpit, while I was pulling him towards the prayer. When I saw him doing that I said: What has happened to the practice of beginning with prayer? He said: No, Abu Sa'id, what you are familiar with has been abandoned. I thereupon said (three times and went back): By no means, by Him in Whose hand my life is, you are not doing anything better than what I am familiar with",
          "ur": "حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روا یت کہ رسول اللہ صلی اللہ علیہ وسلم عید الاضحیٰ اور عید الفطر کے دن تشریف لا تے تو نماز سے آغاز فرماتے اور جب اپنی نماز پڑھ لیتے اور سلام پھیر تے تو کھڑے ہو جا تے لوگوں کی طرف رخ فر ما تے جبکہ لو گ اپنی نماز پڑھنے کی جگہ میں بیٹھے ہو تے اگر آپ کو کو ئی لشکر بھیجنے کی ضرورت ہو تی تو اس کا لو گو ں کے سامنے ذکر فر ما تے اور اگر آپ کو اس کے سوا کو ئی اور ضرورت ہوتی تو انھیں اس کا حکم دیتے اور فر ما یا کرتے \" صدقہ کرو صدقہ کرو صدقہ کرو زیادہ صدقہ عورتیں دیا کرتی تھیں پھر آپ واپس ہو جا تے اور یہی معمول چلتا رہا حتیٰ کہ مردان بن حکم کا دور آگیا میں اس کے ساتھ ہاتھ میں ہاتھ ڈال کر نکلا حتیٰ کہ ہم عید گا ہ میں پہنچ گئے تو دیکھا کہ کثیر بن صلت نے وہاں مٹی ( کے گا رے ) اور اینٹوں سے منبر بنا یا ہو اتھا تو اچانک مردان کا ہا تھ مجھ سے کھنچا تا نی کرنے لگا جیسے وہ مجھے منبر کی طرف کھنچ رہا ہو اور میں اسے نماز کی طرف کھنچ رہا ہوں جب میں نے اس کی طرف سے یہ بات دیکھی تو میں نے کہا : نماز سے آغاز ( کا مسنون کا طریقہ ) کہاں ہے؟ اس نے کہا : اے ابو سعید !نہیں جو آپ جا نتے ہیں اسے ترک کر دیا گیا ہے میں نے کہا : ہر گز نہیں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! جو میں جانتا ہوں تم اس سے بہتر طریقہ نہیں لاسکتے ۔ ۔ ۔ ابو سعید رضی اللہ تعالیٰ عنہ نے تین دفہ کہا ، پھر چل دئیے ۔",
          "fr": "Rapporté par Abu Sa’id al-Khudri : Le Messager d’Allah ﷺ sortait le jour de l’Aïd al-Adha et de l’Aïd al-Fitr et commençait par la prière. Après avoir terminé la prière et salué, il se levait face aux gens alors qu’ils étaient assis à leurs places. S’il voulait envoyer une armée, il en parlait aux gens, et s’il avait une autre chose à annoncer, il leur en donnait l’ordre. Il disait : « Donnez l’aumône, donnez l’aumône, donnez l’aumône », et la plupart de ceux qui donnaient étaient des femmes. Puis il repartait, et cette pratique a continué jusqu’à l’arrivée de Marwan b. al-Hakam (au pouvoir). Je suis sorti main dans la main avec Marwan jusqu’au lieu de prière, où Kathir b. Salt avait construit un minbar en argile et en briques. Marwan a commencé à me tirer vers le minbar, tandis que je le tirais vers la prière. Voyant cela, je lui ai dit : « Qu’est-il arrivé à la pratique de commencer par la prière ? » Il a répondu : « Non, Abu Sa’id, ce que tu connais a été abandonné. » J’ai alors dit (trois fois en repartant) : « Jamais, par Celui qui détient ma vie, tu ne fais rien de mieux que ce que je connais. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata, telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Dawud bin Qais] dari [Iyadl bin Abdullah bin Sa'd] dari [Abu Sa'id Al Khudri] bahwasanya Rasulullah shallallahu 'alaihi wasallam ketika keluar pada hari 'iedul Fitri dan 'iedul Adlha, beliau selalu memulainya dengan shalat. Dan jika beliau telah selesai mengerjakan shalat dan menutupnya dengan salam, beliau segera berdiri menghadap ke arah para jama'ah yang sedang duduk di tempat mereka shalat. Apabila beliau memiliki suatu keperluan seperti ingin mengutus sebuah pasukan beliau mengumumkannya kepada para jama'ah, atau beliau memiliki keperluan lain beliau menyuruh mereka agar mengerjakannya. Dan beliau selalu bersabda: \"Bersedekahlah kalian, bersedekahlah kalian, bersedekahlah kalian!.\" Dan orang yang paling banyak bersedekah adalah dari kalangan kaum wanita. Kemudian setelah itu beliau baru meninggalkan lapangan. Hal ini masih terus berlangsung sampai pada masa Marwan bin Al Hakam. Aku keluar dengan menggandeng Marwan hingga sampai di lapangan. Namun ternyata Katsir bin Ash Shalt telah membangun mimbar yang terbuat dari tanah dan batu bata. Dan tiba-tiba Marwan menarik tanganku seakan-akan ia menyuruhku naik ke mimbar dan memulainya dengan khutbah terlebih dahulu, dan akupun menyuruhnya untuk memulainya dengan shalat terlebih dahulu. Ketika aku melihat kejadian itu, aku berkata kepadanya, \"Mulailah dengan shalat!\" Namun ia menjawab, \"Tidak wahai Abu Sa'id, sesuatu yang kau ketahui itu telah ditinggalkan.\" Aku menjawab, \"Sekali-kali tidak, demi Dzat yang jiwaku berada di tanganNya, setahuku kalian tidak akan mendatangkan kebaikan sedikitpun (ia mengulangi hingga tiga kali).\" Kemudian ia pergi meninggalkan tempat itu",
          "tr": "Bize Yahya b. Eyyûb ile Kuteybe ve İbni Hucur rivayet ettiler. Dedilerki; Bize İsmail b. Cafer, Dâvûd b. Kays'dan, o da Iyâz b. Abdillâh b. Sa'd'dan, o da Ebû Said-i Hudrî'den naklen rivayet ettij şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem) Kurban ve Ramazan bayramı günleri musalla'ya çıkar ve evvelâ namazla işe başlardı. Namazını kıldı da, selâm verdimi ayağa kalkarak cemaata karşı dönerdi. Cemâat ise namazgahlarında otururlardı. Eğer (bu taraf'a) bir müfreze göndermeye ihtiyacı varsa, onu cemaata hatırlatır, bundan başka bir ihtiyâcı olursa, onu kendilerine emrederdi. (Hutbe esnasında): — Sadaka verin, sadaka verin, sadaka verin!» buyururdu. En ziyâde sadaka veren de kadınlar olurdu. Ondan sonra namazgâhdan ayrılırdı. Mervân b. Hakem zamanına kadar hâl, bu minval üzre devam etti. Bir def'â ben Mervân ile el ele vererek (namaza) çıktım. Namazgaha vardığımızda ne görelim! Kesîru'bnu Salt, çamurla kerpiçten bir minber yapmış. Bir de baktım Mervân'ın eli beni çekiştiriyor. Gâlibâ beni minbere doğru çekiyordu. Ben de onu namaza çekiyordum. Onun bu hâlini görünce: — «İş'e namazdan başlamak nerede kaldı?» dedim. Mervân: «Hayır, yâ Ebâ Said! Senin bildiğin (şekil) terk edildi.» dedi. — «Asla olamaz ! Nefsim kabza-i kudretinde olan Allah'a yemin ederim ki siz, benim bildiğimden daha hayırlısını yapamazsınız.» dedim. Ebû Saîd, bunu üç defa tekrârladıkdan sonra oradan ayrılmış"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 2054,
      "arabicNumber": "890.01",
      "book": 8,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَمَرَنَا - تَعْنِي النَّبِيَّ صلى الله عليه وسلم - أَنْ نُخْرِجَ فِي الْعِيدَيْنِ الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ وَأَمَرَ الْحُيَّضَ أَنْ يَعْتَزِلْنَ مُصَلَّى الْمُسْلِمِينَ ‏.‏",
        "translations": {
          "en": "Umm 'Atiyya said:He (the Messenger of Allah) commanded us that we should take out unmarried women and the screened away ladies for 'Id prayers, and he commanded the menstruating women to remain away from the place of worship of the Muslims",
          "ur": "محمد ( بن سیرین ) نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : آپ نے ہمیں حکم دیا ۔ ۔ ۔ ان کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ۔ ۔ ۔ کہ ہم عیدین میں بالغہ اور پردہ نشین عورتوں کو لے جایا کریں اور آپ نے حیض والی عورتوں کو حکم دیا کہ وہ مسلمانوں کی نماز کی جگہ سے ہٹ کر بیٹھیں ۔",
          "fr": "Rapporté par Umm ‘Atiyya : Le Messager d’Allah nous a ordonné de faire sortir les jeunes filles non mariées et les femmes à l’écart pour la prière de l’Aïd, et il a demandé aux femmes ayant leurs règles de rester à l’écart du lieu de prière des musulmans",
          "id": "Telah menceritakan kepada kami [Abu Rabi' Az Zahrani] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ummu 'Athiyah] ia berkata; Nabi shallallahu 'alaihi wasallam memerintahkan kepada kami agar mengajak serta keluar para gadis dan wanita-wanita yang dipingit pada dua hari raya, dan beliau memerintahkan para wanita yang sedang haidl menjauh dari mushalla (tempat shalat) kaum muslimin",
          "tr": "Bana Ebû'r-Rabî' Ez-Zehrânî rivayet etti. (dediki): Bize, Hammâd rivayet etti. (dediki): Bize Eyyûb, Muhammed'den, o da Ümmü Atiyye'den naklen rivayet etti. Ümmü Atiyye, Peygamber (Sallallahu Aleyhi ve Sellem)'i kastederek: «Bize bayramlarda kocaya gitmemiş delikanlı kızlarla, perdenişin hanımları namazgaha çıkarmamızı; hayızlı kadınlara da Müslümanların namazgahından biraz uzaklaşmalarını emir buyurdu.» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 2055,
      "arabicNumber": "890.02",
      "book": 8,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ حَفْصَةَ بِنْتِ، سِيرِينَ عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا نُؤْمَرُ بِالْخُرُوجِ فِي الْعِيدَيْنِ وَالْمُخَبَّأَةُ وَالْبِكْرُ قَالَتِ الْحُيَّضُ يَخْرُجْنَ فَيَكُنَّ خَلْفَ النَّاسِ يُكَبِّرْنَ مَعَ النَّاسِ ‏.‏",
        "translations": {
          "en": "Umm Atiyya reported:We were commanded to go out as well as the hidden away ladies and those unmarried. She said menstruating women were to come out amongst you, but remain behind people and pronounce takbir (Allah-o-Akbar) along with them",
          "ur": "عاصم احول نے حفصہ بنت سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : \" ہمیں عیدین میں نکلنے کا حکم دیاجاتاتھا ، پردہ نشین اوردوشیزہ کو بھی ۔ \" انھوں نے کہا : حیض والی عورتیں بھی نکلیں گی اور لوگوں کے پیچھے رہیں گی اور لوگوں کے ساتھ تکبیر کہیں گی ۔",
          "fr": "Rapporté par Umm Atiyya : On nous a ordonné de sortir, ainsi que les femmes cachées et les jeunes filles. Elle a dit que les femmes ayant leurs règles devaient sortir parmi vous, mais rester derrière les gens et prononcer le takbir (Allahou Akbar) avec eux",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Ashim Al Ahwal] dari [Hafshah binti Sirin] dari [Ummu Athiyyah] ia berkata; Kami diperintahkan untuk turut keluar pada dua hari raya, demikian juga para para gadis. Dan para wanita yang sedang haid juga keluar, namun mereka berada di belakang jamaah dan ikut bertakbir bersama mereka",
          "tr": "Bize Yahya b. Yahya rivayet etti. (dediki): Bize Ebû Hayseme, Âsım-ı Ahval'den, o da Hafsa binti Sîrin'den, o da Ümmü Atiyye'den naklen haber verdi. Ümmü Atiyye şöyle demiş: Bayramlarda örtülü hanımlar ve bakire kızlarla beraber namazgaha çıkmaya me'mûr olurduk. Hayızlılar da çıkar fakat cemâatin arkasında bulunurlar; cemaatla beraber tekbîr alırlardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 2056,
      "arabicNumber": "890.03",
      "book": 8,
      "hadithInBook": 12,
      "text": {
        "arabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا هِشَامٌ، عَنْ حَفْصَةَ بِنْتِ، سِيرِينَ عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نُخْرِجَهُنَّ فِي الْفِطْرِ وَالأَضْحَى الْعَوَاتِقَ وَالْحُيَّضَ وَذَوَاتِ الْخُدُورِ فَأَمَّا الْحُيَّضُ فَيَعْتَزِلْنَ الصَّلاَةَ وَيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِحْدَانَا لاَ يَكُونُ لَهَا جِلْبَابٌ قَالَ ‏ \"‏ لِتُلْبِسْهَا أُخْتُهَا مِنْ جِلْبَابِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Umm 'Atiyya reported:The Messenger of Allah (ﷺ) commanded us to bring out on'Id-ul-Fitr and 'Id-ul-Adha young women, menstruating women and screened away ladies, menstruating women kept back from prayer, but participated in goodness and supplication of the Muslims. I said: Messenger of Allah, one of us does not have an outer garment (to cover her face and body). He said: Let her sister cover her with her outer garment",
          "ur": "۔ ہشام نے حفصہ بن سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم عید الفطر اورعید الاضحیٰ میں عورتوں کو باہر نکالیں ، دوشیزہ ، حائضہ اور پردہ نشیں عورتوں کو باہر نکالیں ، دوشیزہ اور حائضہ اور پردہ نشین عورتوں کو ، لیکن حائضہ نمازسےدور رہیں ۔ وہ خیروبرکت اور مسلمانوں کی دعا میں شریک ہوں ۔ میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! ہم میں سے کسی عورت کے پاس چادر نہیں ہوتی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس کی ( کوئی مسلمانک ) بہن اس کو اپنی چادر کا ایک حصہ پہنا دے ۔",
          "fr": "Rapporté par Umm ‘Atiyya : Le Messager d’Allah ﷺ nous a ordonné de faire sortir, lors de l’Aïd al-Fitr et de l’Aïd al-Adha, les jeunes filles, les femmes ayant leurs règles et celles qui restent à l’écart ; les femmes ayant leurs règles devaient rester à l’écart de la prière, mais participer aux invocations et au bien avec les musulmans. J’ai dit : « Messager d’Allah, l’une d’entre nous n’a pas de vêtement pour se couvrir. » Il a répondu : « Que sa sœur la couvre avec son vêtement. »",
          "id": "Dan telah menceritakan kepada kami [Amru An Naqid] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Hisyam] dari [Hafshah binti Sirin] dari [Ummu Athiyyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kepada kami agar mengajak serta keluar melakukan shalat idul fithri dan idul Adlha para gadis, wanita haid dan wanita yang sedang dipingit. Adapun mereka yang sedang haidl tidak ikut shalat, namun turut menyaksikan kebaikan dan menyambut seruan kaum muslimin. Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, di antara kami ada yang tidak memiliki baju.\" Beliau menjawab: \"Hendaknya saudaranya yang memiliki jilbab memakaikannya",
          "tr": "Bize Amru'n-Nakıd rivayet etti. (dediki): Bize îsâ b. Yûnus rivayet etti. (dediki): Bize, Hişâm, Hafsa binti Sîrin'den, o da Ümmü Atiyye'den naklen rivayet etti. Ümmü Atiyye şöyle demiş: «Bize, Resulullah (Sallallahu Aleyhi ve Sellem) Ramazan ve Kurban bayramlarında genç kızlarla hayızlı kadınları ve perdenişln hanımları (namazgaha) çıkarmamızı emretti. Ama hayızlı kadınlar namaz (gah) dan biraz uzak durur, hayırda ve Müslümanların dualarında hâzır bulunurlar, dedi. Ben: — Yâ Resûlallah! (Bazen) birimizin örtüsü bulunmuyor» dedim; Resûlullah (Sallallahu Aleyhi ve Sellem): — Ona din kardeşi, kendi cllbâblarından birini giydiriversin, buyurdu.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 2059,
      "arabicNumber": "891.01",
      "book": 8,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ مَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الأَضْحَى وَالْفِطْرِ فَقَالَ كَانَ يَقْرَأُ فِيهِمَا بِـ ‏{‏ ق وَالْقُرْآنِ الْمَجِيدِ‏}‏ وَ ‏{‏ اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ‏}‏",
        "translations": {
          "en": "Abdullah b. 'Umar reported that (his father) 'Umar b. Khattab asked Abu Waqid al-Laithi what the Messenger of Allah (ﷺ) used to recite on 'Id-ul-Adha and 'Id-ul-Fitr. He said:He used to recite in them:\" Qaf. By the Glorious Qur'an\" (Surah 1),\" The Hour drew near, and the moon was rent asunder\" (Surah liv)",
          "ur": "مالک نے ضمرہ بن سعید مازنی سے اور انھوں نے عبیداللہ بن عبداللہ سے روایت کی کہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے ابو واقدلیثی سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم عید الاضحیٰ اور عید الفطر میں کون سی سورت قراءت فرماتے تھے؟توانھوں نے کہا : آپ صلی اللہ علیہ وسلم ان دونوں میں سورہ ق وَالْقُرْ‌آنِ الْمَجِيدِ اور سورہ اقْتَرَ‌بَتِ السَّاعَةُ وَانشَقَّ الْقَمَرُ‌ پڑھا کرتے تھے ۔",
          "fr": "Rapporté par ‘Abdullah ibn ‘Umar رضي الله عنه : ‘Umar ibn Khattab رضي الله عنه demanda à Abu Waqid al-Laithi ce que le Messager d’Allah ﷺ récitait lors de l’Aïd al-Adha et de l’Aïd al-Fitr. Il répondit : « Il récitait : “Qaf. Par le Noble Coran” (Sourate 50) et “L’Heure approche et la lune s’est fendue” (Sourate 54). »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] ia berkata, saya telah membacakan kepada [Malik] dari [Dlamrah bin Sa'id Al Mazini] dari [Ubaidullah bin Abdullah] bahwasa Umar bin Al Khaththab pernah bertanya kepada [Abu Waqid Al Laitsi], \"Surat apa yang dibaca oleh Rasulullah shallallahu 'alaihi wasallam ketika mengerjakan shalat Iedul Adlha dan Iedul Fithri?\" ia menjawab, \"Beliau membaca surat 'QAAF WAL QUR`ANIL MAJIID' dan 'IQTARABATIS SAA'ATU WAN SYAQQAL QAMAR",
          "tr": "Bize Yahya b. Yahya rivayet etti. dediki: Mâlik'e Damratü'bnu Said-i Maziniden dinlediğim, onun da Ubeydullah b. Abdillah'dan rivayet ettiği şu hadisi okudum: Ömer b. el-Hattâb, Ebû Vâkıd-ı Leysi'ye: — «Resulullah (Sallallahu Aleyhi ve Sellem), Ramazan ve Kurban bayramı namazlarında ne okuyordu?» diye sormuş; o da: — «Resulullah (Sallallahu Aleyhi ve Sellem) onlarda sûre-i Kaat ile sûre-l İnşikaak'ı okurdu.» cevâbını vermiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 2060,
      "arabicNumber": "891.02",
      "book": 8,
      "hadithInBook": 15,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا فُلَيْحٌ، عَنْ ضَمْرَةَ، بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، قَالَ سَأَلَنِي عُمَرُ بْنُ الْخَطَّابِ عَمَّا قَرَأَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَوْمِ الْعِيدِ فَقُلْتُ بِـ ‏{‏ اقْتَرَبَتِ السَّاعَةُ‏}‏ وَ ‏{‏ ق وَالْقُرْآنِ الْمَجِيدِ‏}‏",
        "translations": {
          "en": "Utba reported that his father Waqid al-Laithi said:'Umar b. Khattab asked me what the Messenger of Allah (ﷺ) recited on 'Id day. I said:\" The Hour drew near\" and Qaf. By the Glorious Qur'an",
          "ur": "فلیح نے ضمر ہ بن سعید سے ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ سے اور انھوں نے حضرت ابو واقد لیثی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے فرمایا ، حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے مجھ سے اس بارے میں پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے عید کی نماز میں کیا پڑھا؟تو میں نے کہا : اقْتَرَ‌بَتِ السَّاعَةُ اور ق وَالْقُرْ‌آنِ الْمَجِيدِ",
          "fr": "Rapporté par ‘Utba : Son père Waqid al-Laithi a dit : ‘Umar ibn Khattab رضي الله عنه m’a demandé ce que le Messager d’Allah ﷺ récitait le jour de l’Aïd. J’ai répondu : « Il récitait : “L’Heure approche” et “Qaf. Par le Noble Coran”. »",
          "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abu Amir Al 'Aqadi] telah menceritakan kepada kami [Fulaih] dari [Dlamrah bin Sa'id] dari [Ubaidullah bin Abdullah bin Utbah] dari [Abu Waqid Al Laitsi] ia berkata; Umar bin Al Khathab bertanya kepadaku, \"Surat apa yang dibaca oleh Rasulullah shallallahu 'alaihi wasallam pada saat shalat Ied?\" saya menjawab, \"Yaitu, belia membaca surat, 'IQTARABATIS SAA'ATU' dan 'QAAF WAL QUR`ANIL MAJIID",
          "tr": "Bize, İshak b. îbrâhim rivayet etti. (dediki) Bize, Ebû Amiri Akadî haber verdi, (dediki) Bize Füleyh, Damratü'bnu Said' den, o da Ubeydullah b. Abdillâh b. Utbe'den, o da Ebû Vâkıd-ı Leysi den naklen rivayet etti. Ebû Vâkıd şöyle demiş: «Ömerü'bnü'l-Hattâb, bana Resulullah (Sallallahu Aleyhi ve Sellem) bayram namazında neyi okuduğunu sordu; ben de. — «Sûre-l inşikaak ile Süre-l Kaaf'ı dedim.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 2061,
      "arabicNumber": "892.01",
      "book": 8,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ أَبُو بَكْرٍ وَعِنْدِي جَارِيَتَانِ مِنْ جَوَارِي الأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتْ بِهِ الأَنْصَارُ يَوْمَ بُعَاثٍ قَالَتْ وَلَيْسَتَا بِمُغَنِّيَتَيْنِ ‏.‏ فَقَالَ أَبُو بَكْرٍ أَبِمُزْمُورِ الشَّيْطَانِ فِي بَيْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَلِكَ فِي يَوْمِ عِيدٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا وَهَذَا عِيدُنَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported:Abu Bakr came to see me and I had two girls with me from among the girls of the Ansar and they were singing what the Ansar recited to one another at the Battle of Bu'ath. They were not, however, singing girls. Upon this Abu Bakr said: What I (the playing of) this wind instrument of Satan in the house of the Messenger of Allah (ﷺ) and this too on 'Id day? Upon this the Messenger of Allah (ﷺ) said: Abu Bakr, every people have a festival and it is our festival (so let them play on)",
          "ur": "ابو اسامہ نے ہشام سے ، انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : حضرت ابو بکر میرے ہاں تشریف لائے جبکہ میرے پاس انصار کی دو بچیاں تھیں ۔ اور انصار نے جنگ بعاث میں جو اشعار ایک دوسرے کے مقابلے میں کہےتھے ، انھیں گارہی تھیں ۔ کہا : وہ کوئی گانے والیاں نہ تھیں ۔ حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے ( انھیں دیکھ کر ) کہا : کیا رسول اللہ صلی اللہ علیہ وسلم کے گھر میں شیطان کی آواز ( بلند ہورہی ) ہے؟اور یہ عید کے دن ہوا تھا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ابو بکر!ہر قوم کے لئے ایک عید ہے اور یہ ہماری عید ہے ۔",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Abu Bakr رضي الله عنه est venu me voir alors que j’avais avec moi deux jeunes filles parmi les Ansar qui chantaient ce que les Ansar avaient l’habitude de chanter lors de la bataille de Bu’ath. Ce n’étaient pas des chanteuses professionnelles. Abu Bakr رضي الله عنه dit alors : « Est-ce la flûte du diable dans la maison du Messager d’Allah ﷺ, et cela le jour de l’Aïd ? » Le Messager d’Allah ﷺ dit alors : « Abu Bakr, chaque peuple a sa fête, et c’est notre fête, alors laisse-les. »",
          "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Usamah] dari [Hisyam] dari [bapaknya] dari [Aisyah] ia berkata; Abu Bakar masuk ke dalam rumahku, sementara di tempatku terdapat dua orang budak wanita Anshar sedang bernyanyi sebagaimana yang dibawakan oleh orang-orang Anshar pada hari Bu'ats. Ia berkata, \"Namun keduanya bukanlah penyanyi yang terkenal.\" Maka Abu Bakar pun bertanya, \"Apakah di tempat Rasulullah shallallahu 'alaihi wasallam terdapat nyanyian syetan?\" Pada hari itu merupakan hari raya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Bakar, sesungguhnya setiap kaum itu miliki hari raya, dan hari ini merupakan hari raya untuk kita.\" Dan telah menceritakannya kepada kami [Yahya bin Yahya] dan [Abu Kuraib] semuanya dari [Abu Mu'awiyah] dari [Hisyam] dengan isnad ini. Dan di dalamnya dikatakan; Dua budak wanita yang bermain rebana",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (dediki): Bize, Ebû Usâme, Hişâm'dan, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş: «(Bir defa) yanıma Ebû Bekir girdi, yanımda Ensâr'ın cariyelerinden iki câriye bulunuyor; Buâs harbinde ensâr'ın biribirlerine söyledikleri şiirleri terennüm ediyorlardı. Ama bu cariyeler şarkıcı değildiler. Ebû Bekir: — Resulullah (Sallallahu Aleyhi ve Sellem)'in evinde şeytan ıslığı mı çalıyorsun, hem de bayram gününde? dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) : — Yâ Ebâ Bekir! Her milletin bir bayramı vardır; bu da bizim bayramımızdır.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 2062,
      "arabicNumber": "892.02",
      "book": 8,
      "hadithInBook": 17,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ‏.‏ وَفِيهِ جَارِيَتَانِ تَلْعَبَانِ بِدُفٍّ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Hisham with the same chain of transmitters, but there the words are:\" Two girls were playing upon a tambourine",
          "ur": "ابو معاویہ نے ہشام بن عروہ سے اسی سند کے ساتھ ( سابقہ حدیث کے مانند ) روایت کی اور اس میں ہے دو بچیاں دف سے کھیل ہی تھیں ( دف بجارہیں تھیں)",
          "fr": "Rapporté par Hisham avec la même chaîne de transmetteurs : Les mots sont : « Deux jeunes filles jouaient du tambourin. »",
          "tr": "{….} Bize, bu hadîsi Yahya ile Ebû Kureyb hep birden Ebû Muâviye'den, o da Hişâm'dan naklen bu isnâdla rivayet ettiler. Bu hadîsde: «Yanımda defle oynayan iki câriye vardı...» denilmişdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 2063,
      "arabicNumber": "892.03",
      "book": 8,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ ابْنَ شِهَابٍ، حَدَّثَهُ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ، دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُغَنِّيَانِ وَتَضْرِبَانِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُسَجًّى بِثَوْبِهِ فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْهُ وَقَالَ ‏ \"‏ دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ ‏\"‏ ‏.‏ وَقَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتُرُنِي بِرِدَائِهِ وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ وَأَنَا جَارِيَةٌ فَاقْدِرُوا قَدْرَ الْجَارِيَةِ الْعَرِبَةِ الْحَدِيثَةِ السِّنِّ ‏.‏",
        "translations": {
          "en": "A'isha reported that Abu Bakr came to her and there were with her two girls on Adha days who were singing and beating the tambourine and the Messenger of Allah (ﷺ) had wrapped himself with his mantle. Abu Bakr scolded them. The Messenger of Allah (may peace he upon him) uncovered (his face) and said:Abu Bakr, leave them alone for these are the days of 'Id. And 'A'isha said: I recapitulate to my mind the fact that once the Messenger of Allah (ﷺ) screened me with his mantle and I saw the sports of the Abyssinians, and I was only a girl, and so you can well imagine how a girl of tender age is fond of watching the sport",
          "ur": "عمرو نے کہا کہ ابن شہاب نے انھیں عروہ سے حدیث سنائی اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ( انھوں نے کہا ) کہ حضرت ابو بکر رضی اللہ تعالیٰ عنہ میرے ہاں تشریف لائے جبکہ منیٰ کے ایام میں میرے پاس دو بچیاں گارہی تھیں ۔ اور دف بجا رہی تھیں ۔ اور رسول اللہ صلی اللہ علیہ وسلم کپڑا اوڑھے لیٹے ہوئے تھے ، ابو بکر رضی اللہ تعالیٰ عنہ ان دونوں کو ڈانٹا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے اپنے آپ سے کپڑا ہٹایا اور فرمایا : \" ابو بکر!انھیں چھوڑیئے کہ یہ عید کے دن ہیں ۔ \" اور ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ مجھےاپنی چادر سے چھپائے ہوئے تھے اور میں حبشیوں کو دیکھ رہی تھی کہ وہ کھیل رہے تھے اور میں کم سن لڑکی تھی ، ذرا اندازہ لگاؤ اس لڑکی کو شوق کس قدر ہوگا جو کھیل کی شوقین ، نو عمر تھی ( وہ کتنی دیر کھیل دیکھے گی؟)",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Abu Bakr رضي الله عنه est venu chez moi alors que deux jeunes filles étaient avec moi pendant les jours de l’Aïd al-Adha. Elles chantaient et jouaient du tambourin, et le Messager d’Allah ﷺ s’était couvert de son manteau. Abu Bakr رضي الله عنه les réprimanda. Le Messager d’Allah ﷺ découvrit son visage et dit : « Abu Bakr, laisse-les, car ce sont les jours de l’Aïd. » Aïsha رضي الله عنها ajouta : « Je me souviens que le Messager d’Allah ﷺ m’a un jour cachée avec son manteau pour que je voie les Abyssiniens jouer, et j’étais une jeune fille, donc vous pouvez imaginer combien une enfant aime regarder ce genre de spectacle. »",
          "id": "Telah menceritakan kepadaku [Harun bin Sa'id Al `Aili] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] bahwa [Ibnu Syihab] telah menceritakan kepadanya dari [Urwah] dari [Aisyah] bahwa pada hari-hari di Mina Abu Bakar masuk ke dalam rumahnya, sementara di tempatnya terdapat dua orang budak wanita yang sedang bernyanyi dan memukul rebana, sementara Rasulullah shallallahu 'alaihi wasallam menutup diri dengan kainnya. Kemudian Abu Bakar pun menghentikan keduanya, maka Rasulullah shallallahu 'alaihi wasallam pun menyingkap kainnya dan bersabda: \"Biarkanlah keduanya, wahai Abu Bakar. Karena hari-hari ini adalah hari raya.\" Aisyah berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam menutupiku dengan kainnya, sementara saya sedang melihat kepada orang-orang Habasyah yang sedang bermain. Saya adalah seorang anak wanita, karena itu berilah kesempatan kepada para anak wanita untuk bermain",
          "tr": "Bana Hârûn b. Saîd El-Eylî rivayet etti. (dediki): Bize, İbni Vehb rivayet etti. (dediki): Bana, Amr haber verdi; ona da ibni Şihâb, Urve'den, o da Âişe'den naklen rivayet etmişki: Mina günlerinde Aişe'nin yanına Ebû Bekir girmiş; Aişe'nin yanında şarkı söyleyip, def çalan iki câriye bulunuyormuş. Resulullah (Sallallahu Aleyhi ve Sellem) de elbisesine bürünmüş; yatıyormuş. Ebû Bekir, cariyeleri azarlamış, bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) yüzünü açarak: «Bırak onları, Yâ Ebâ Bekir! Zira bu günler, bayram günleridir.» buyurmuşlar. Âişe demiş ki: «Ben, oynayan Habeş'lilere bakarken Resulullah (Sallallahu Aleyhi ve Sellem)'in, elbisesi ile beni örttüğünü görmüşümdür. O zaman henüz bir taze idim. Siz oyunu seven genç yaştaki bir tazenin buna ne derece can atacağını takdir buyurun.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 2064,
      "arabicNumber": "892.04",
      "book": 8,
      "hadithInBook": 19,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، بْنِ الزُّبَيْرِ قَالَ قَالَتْ عَائِشَةُ وَاللَّهِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُومُ عَلَى بَابِ حُجْرَتِي - وَالْحَبَشَةُ يَلْعَبُونَ بِحِرَابِهِمْ فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم - يَسْتُرُنِي بِرِدَائِهِ لِكَىْ أَنْظُرَ إِلَى لَعِبِهِمْ ثُمَّ يَقُومُ مِنْ أَجْلِي حَتَّى أَكُونَ أَنَا الَّتِي أَنْصَرِفُ ‏.‏ فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ حَرِيصَةً عَلَى اللَّهْوِ ‏.‏",
        "translations": {
          "en": "A'isha reported:BY Allah, I remember the Messenger of Allah (ﷺ) standing on the door of my apartment screening me with his mantle enabling me to see the sport of the Abyssinians as they played with their daggers in the mosque of the Messenger of Allah (may peace be upom him). He (the Holy Prophet) kept standing for my sake till I was satiated and then I went back; and thus you can well imagine how long a girl tender of age who is fond of sports (could have watched it)",
          "ur": "یونس نے ابن شہاب سے او انھوں نے عروہ بن زبیر سے روایت کی ، انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اللہ کی قسم !میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھاکہ آپ صلی اللہ علیہ وسلم میرے حجرے کے دروازے پر کھڑے ہیں اور حبشی اپنے چھوٹے نیزوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں کھیل ( مشقین کر رہے ) رہے تھے ۔ اور آپ مجھے اپنی چادر سے چھپائے ہوئے ہیں تاکہ میں ان کے کرتب دیکھ سکوں ، پھر آپ میری خاطر کھڑے رہے حتیٰ کہ میں ہی ہوں جو واپس پلٹی ، اندازہ کرو ایک نو عمر لڑکی کا شوق کس قدر ہوگا جو کھیل کی شوقین ہو ( کتنی دیر تک کھڑی رہی ہوگی ۔)",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Par Allah, je me souviens du Messager d’Allah ﷺ debout à la porte de ma chambre, me cachant avec son manteau pour que je puisse voir les Abyssiniens jouer avec leurs poignards dans la mosquée du Messager d’Allah ﷺ. Il est resté debout pour moi jusqu’à ce que j’en sois satisfaite, puis je suis repartie. Vous pouvez donc imaginer combien une jeune fille passionnée de jeux aurait pu rester à regarder",
          "id": "Dan telah menceritakan kepadaku [Abu Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Urwah bin Zubair] ia berkata, [Aisyah] berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam berdiri di pintu kamarku, sementara orang-orang Habasyah sedang bermain tombak di masjid Rasulullah shallallahu 'alaihi wasallam, maka beliau menutupiku dengan kainnya agar aku dapat melihat permainan mereka. Kemudian beliau berdiri (agar aku lebih leluasa melihat), sampai saya sendiri yang berhenti (setelah bosan) melihatnya. Karena itu, berilah keleluasaan kepada anak-anak wanita untuk bermain",
          "tr": "Bana Ebû't-Tâhir rivayet etti. (dediki): Bize ibni Vehb haber verdi. (dediki): Bana Yûnus, ibni Şihâb'dan, o da Urvetü'bnu'z-Zübeyr'den naklen haber verdi. Urve şöyle demiş: «Âişe dediki: Vallahi Resulullah {Sallallahu Aleyhi ve Sellem)'i odamın kapısında dururken gördüm; Habeşliler, Resulullah (Sallallahu Aleyhi ve Sellem)'in mescidinde harbeleri ile oynuyorlar; Resulullah (Sallallahu Aleyhi ve Sellem) de, ben oyunlarını göreyim diye elbisesi ile beni örtüyordu. Ben (bakmakdan) vazgeçinceye kadar, benim (hatırım) İçin ayakda duruyordu. Siz, eğlenceye düşkün genç yaştaki bir tazenin buna ne derece can atacağını takdir buyurun.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 2065,
      "arabicNumber": "892.05",
      "book": 8,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، - وَاللَّفْظُ لِهَارُونَ - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ، حَدَّثَهُ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثٍ فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ فَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارُ الشَّيْطَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ فَإِمَّا سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏ ‏.‏ فَقُلْتُ نَعَمْ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ وَهُوَ يَقُولُ ‏\"‏ دُونَكُمْ يَا بَنِي أَرْفَدَةَ ‏\"‏ ‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported:The Messenger of Allah (ﷺ) came (to my apartment) while there were two girls with me singing the song of the Battle of Bu`ath. He lay down on the bed and turned away his face. Then came Abu Bakr and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah (ﷺ)! The Messenger of Allah (ﷺ) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of `Id and the black men were playing with shields and spears. (I do not remember) whether I asked the Messenger of Allah (ﷺ) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go",
          "ur": "محمد بن عبد الرحمان نے عروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سےروایت کی ، انھوں نےکہا : رسول اللہ صلی اللہ علیہ وسلم ( گھر میں ) داخل ہوئے جبکہ میرے پاس دو بچیاں جنگ بعاث کے اشعار بلندآواز سے سنارہی تھیں ۔ آپ بستر پرلیٹ گئے اور اپنا چہرہ ( دوسری سمیت ) پھیر لیا ۔ اس کے بعدحضرت ابو بکر رضی اللہ تعالیٰ عنہ تشریف لائے ۔ تو انھوں نے مجھے سرزنش کی اور کہا : رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں شیطان کی آواز؟اس پر رسول اللہ صلی اللہ علیہ وسلم ان کی طرف متوجہ ہوئے اورفرمایا : \" انھیں چھوڑیئے \" جب ان ( ابو بکر رضی اللہ تعالیٰ عنہ ) کی توجہ ہٹی تو میں ان کو اشارہ کیا اور وہ چلی گئیں ۔ اورعید کا ایک دن تھا ، کالے لوگ ڈھالوں اور بھالوں کےکرتب دکھا رہے تھے تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے د رخواست کی یا آپ نے خود ہی فرمایا : \" دیکھنے کی خواہش رکھتی ہو؟ \" میں نے کہا : جی ہاں ۔ آ پ نے مجھے اپنے پیچھے کھڑاکرلیا ، میرا رخسار آپ کے رخسار پر ( لگ رہا ) تھا اور آ پ فرمارہے تھے : \" اے ارفدہ کے بیٹو! ( اپنا مظاہرہ ) جاری رکھو ۔ \" حتیٰ کہ جب میں اکتا گئی ( تو ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمھارےلئے کافی ہے؟ \" میں نے کہا : جی ہاں ۔ فرمایا : \" توچلی جاؤ ۔",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Le Messager d’Allah ﷺ est venu chez moi alors que deux jeunes filles chantaient le chant de la bataille de Bu’ath. Il s’est allongé sur le lit et a détourné son visage. Puis Abu Bakr رضي الله عنه est entré, m’a réprimandée et a dit : « Oh ! Cet instrument du diable dans la maison du Messager d’Allah ﷺ ! » Le Messager d’Allah ﷺ se tourna vers lui et dit : « Laisse-les. » Quand il ne faisait plus attention, je fis signe aux filles et elles sortirent. C’était le jour de l’Aïd et des hommes noirs jouaient avec des boucliers et des lances. (Je ne me souviens plus) si j’ai demandé au Messager d’Allah ﷺ ou s’il m’a proposé de regarder ce spectacle. J’ai dit : « Oui. » Je me suis tenue derrière lui, son visage à côté du mien, et il a dit : « Ô Banu Arfada, continuez vos jeux. » Jusqu’à ce que j’en sois satisfaite. Il me demanda : « Est-ce suffisant ? » J’ai répondu : « Oui. » Alors il me dit de partir",
          "id": "Telah menceritakan kepadaku [Harun bin Sa'id Al `Aili] dan [Yunus bin Abdul A'la] -sedangkan lafazhnya dari Harun- keduanya berkata, telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami [Amru] bahwa [Muhammad bin Abdur Rahman] telah menceritakan kepadanya dari ['Urwah] dari [Aisyah] ia berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam masuk ke dalam rumahku, sementara di tempatku terdapat dua orang budak wanita yang sedang bernyanyi dengan nyanyian Bu'ats, lalu beliau langsung berbaring diatas tempat tidur dengan membalikkan wajahnya. Setelah itu, masuklah Abu Bakar dan langsung marah seraya berkata, \"Nyanyian syetan ada di sisi Rasulullah shallallahu 'alaihi wasallam?.\" Maka Rasulullah shallallahu 'alaihi wasallam pun menemuinya dan bersabda: \"Biarkanlah mereka berdua.\" Ketika ia tidak mengindahkan lagi, maka saya pun memberi isyarat pada kedua budak wanita itu sehingga keduanya pun keluar. Kemudian pada hari raya, orang-orang berkulit hitam bermain baju besi dan tombak. Kemungkinan saya yang bertanya kepada Rasulullah shallallahu 'alaihi wasallam atau pun beliau yang bertanya padaku, \"Apakah kamu ingin melihatnya?\" Saya menjawab, \"Ya.\" Maka beliau pun meletakkanku berdiri di belakangnya, pipiku menempel di pipi beliau. Dan beliau bersabda: \"Silahkan kalian bermain-main, wahai bani Arfidah (gelar bangsa Habasyah).\" Hingga apabila aku bosan, beliau bertanya, \"Cukup?\" Aku menjawab, \"Ya.\" Beliau berkata, \"Pergilah",
          "tr": "Bana, Harun b. Said El-Eylî ile Yûnus b. Abdi'l-A'lâ rivayet ettiler. Lafız: Harun'undur. Dedilerki: Bize İbni Vehb rivayet etti. (dediki): Bize, Amr haber verdi. Ona da Muhammed b. Abdirrahmn, Urve'den, o da Aişe'den naklen rivayet etmiş. Âişe şöyle demiş: (Bir defa) yanımda Buâs şarkılarını okuyan iki câriye bulunduğu hâlde (içeriye) Resulullah (Sallallahu Aleyhi ve Sellem) girdi ve yatağa uzanarak yüzünü çevirdi. Derken Ebû Bekir girdi. Hemen beni azarladı ve: — «Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında şeytan düdüğü mü üflüyorsunuz?)» dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), ona dönerek: — «Bırak onları!» dedi. Ebü Bekir (in zihni) dalınca, ben cariyelere işaret ettim; onlar da çıktılar. O gün bayram idi. Sudanlılar kalkan ve mızrak oyunu oynuyorlardı. Yâ ben Resulullah (Sallallahu Aleyhi ve Sellem)'den bakmak için izin istedim yahut o (kendiliğinden): — «Bakmak ister misin?» dedi. Ben: — «Evet...» cevâbını verdim. Bunun üzerine beni yanağım, yanağına değecek şekilde arkasına durdurdu. Sudanlılara da: — «Haydi bakalım Erfide oğulları (oynayın!)» diyordu. Nihayet ben bıkınca: — «Artık yeter mi?» diye sordu. — «Evet.» dedim. — «Öyle ise haydi git!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 2066,
      "arabicNumber": "892.06",
      "book": 8,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَ حَبَشٌ يَزْفِنُونَ فِي يَوْمِ عِيدٍ فِي الْمَسْجِدِ فَدَعَانِي النَّبِيُّ صلى الله عليه وسلم فَوَضَعْتُ رَأْسِي عَلَى مَنْكِبِهِ فَجَعَلْتُ أَنْظُرُ إِلَى لَعِبِهِمْ حَتَّى كُنْتُ أَنَا الَّتِي أَنْصَرِفُ عَنِ النَّظَرِ إِلَيْهِمْ",
        "translations": {
          "en": "A'isha reported that some Abyssinians came and gave a demonstration of armed fight on the 'Id day in the mosque. The Apostle of Allah (ﷺ) invited me (to see that fight). I placed my head on his shoulder and began to see their sport till it was I who turned away from watching them",
          "ur": "جریر نے ہشام سے ، انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : حبشی آکر عید کے دن مسجد میں ہتھیاروں کے ساتھ اچھل کود رہے تھے ، ( ہتھیاروں کا مظاہرہ کررہے تھے ) تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے بلایا ، میں نے اپنا سر آپ کے کندھے پر رکھا اور ان کا کھیل ( کرتب ) دیکھنے لگی ( آپ صلی اللہ علیہ وسلم کھڑے رہے ) یہاں تک کہ میں نے خود ہی ان کے کھیل کے نظارے سے واپسی اختیار کی ۔",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Des Abyssiniens sont venus et ont fait une démonstration de combat armé le jour de l’Aïd dans la mosquée. Le Messager d’Allah ﷺ m’a invitée à regarder. J’ai posé ma tête sur son épaule et j’ai regardé leur spectacle jusqu’à ce que ce soit moi qui décide d’arrêter de regarder",
          "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Hisyam] dari [bapaknya] dari [Aisyah] ia berkata; Orang-orang Habasyah sedang bermain-main di Masjid pada hari raya. Maka Nabi shallallahu 'alaihi wasallam memanggilku, aku pun meletakkan kepala di atas pundaknya untuk melihat permainan mereka sampai aku sendiri yang berhenti melihat mereka. Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yahya bin Zakariya bin Abu Za`idah] -dalam jalur lain- Dan telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Muhammad bin Bisyr] keduanya dari [Hisyam] dengan isnad ini, namun ia tidak menyebutkan; \"Di dalam masjid",
          "tr": "Bize Züheyrü'bnü Harb rivayet etti. (dediki): Bize Cerîr, Hişâm'dan, o da babasından, o da Aişe'den naklen rivayet etti; Demiş ki: «Bir bayram günü bir takım Habeş'liler gelerek mescidde raksetmeğe başladılar. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) beni çağırdı; ben de (gelerek) başımı onun omuzuna dayadım. Ve Habeş'lilerin oyunlarına bakmaya başladım. Nihayet onlara bakmaktan İlk vazgeçen ben oldum.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 2067,
      "arabicNumber": "892.07",
      "book": 8,
      "hadithInBook": 22,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، كِلاَهُمَا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرَا فِي الْمَسْجِدِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated by Hisham with the same chain of transmitters but (the narrators) did not make mention of the mosque",
          "ur": "یحییٰ بن زکریا بن ابی زائدہ اور محمد بن بشر دونوں نے ہشام سے اسی سندکے ساتھ ( سابقہ حدیث کی طرح ) روایت کی اور انھوں نےفي المسجد ( مسجد میں ) کے الفاظ ذکر نہیں کیے ۔",
          "fr": "Rapporté par Hisham avec la même chaîne de transmetteurs, mais les narrateurs n’ont pas mentionné la mosquée",
          "tr": "{….} Bize Yahya b. Yahya rivayet etti. (dediki). Bize Yahya b. Zekeriyyâ b. Ebi Zaide haber verdi. H. Bize İbni Numeyr de rivayet etti. (dediki): Bize Muhammed b. Bişr rivayet etti. Bu râvîlerin ikisi birden Hişâm'dan bu isnadla rivâyet etmişler, yalnız «Mescidde...» kaydını zikretmemişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 2068,
      "arabicNumber": "892.08",
      "book": 8,
      "hadithInBook": 23,
      "text": {
        "arabic": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ دِينَارٍ، وَعُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، كُلُّهُمْ عَنْ أَبِي، عَاصِمٍ - وَاللَّفْظُ لِعُقْبَةَ - قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَخْبَرَنِي عُبَيْدُ بْنُ عُمَيْرٍ، أَخْبَرَتْنِي عَائِشَةُ، أَنَّهَا قَالَتْ لِلَعَّابِينَ وَدِدْتُ أَنِّي أَرَاهُمْ قَالَتْ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقُمْتُ عَلَى الْبَابِ أَنْظُرُ بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ ‏.‏ قَالَ عَطَاءٌ فُرْسٌ أَوْ حَبَشٌ ‏.‏ قَالَ وَقَالَ لِي ابْنُ عَتِيقٍ بَلْ حَبَشٌ ‏.‏",
        "translations": {
          "en": "A'isha said that she sent a message to the players (of this armed fight) saying:I like to see them (fighting). She further said: The Messenger of Allah (ﷺ) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians",
          "ur": "عطاء نے بتایا کہ مجھے عبید بن عمیر نے خبر دی ، انھوں نے کہا : مجھے حضرت عائشہ رضی اللہ تعالیٰ عنہا نے خبر دی کہ انھوں نے کھیلنے والوں کے بارے میں کہا : میں ان کاکھیل دیکھناچاہتی ہوں ۔ کہا : اس پر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوگئے اور میں دروازے پر کھڑی ہوکر آپ کے کانوں اور کندھوں کےدرمیان سے دیکھنے لگی اور وہ لوگ مسجد میں کھیل رہے تھے ۔ عطاء نے کہا : وہ ایرانی تھے یا حبشی ۔ اور کہا : مجھے ابن عتیق یعنی عبید بن عمیر نے بتایا کہ وہ حبشی تھے ۔",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Elle a envoyé un message aux joueurs (de ce combat armé) disant qu’elle aimerait les voir. Elle ajouta : Le Messager d’Allah ﷺ s’est levé et je me suis tenue à la porte derrière lui et j’ai regardé ce combat entre ses oreilles et ses épaules, ils jouaient dans la mosquée. ‘Ata’ demanda : « Étaient-ils Perses ou Abyssiniens ? » Ibn ‘Atiq m’a dit qu’ils étaient Abyssiniens",
          "id": "Dan telah menceritakan kepadaku [Ibrahim bin Dinar] dan [Uqbah bin Murqam Al Amiy] dan [Abdu bin Humaid] semuanya dari [Abu Ashim] -sementara lafazhnya dari Uqbah- ia berkata, Telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Atha`] telah mengabarkan kepadaku [Ubaid bin Umair] telah mengabarkan kepadaku [Aisyah] bahwa ia berkata berkenaan dengan orang sedang bermain-main, \"Saya ingin melihat mereka.\" Maka Rasulullah shallallahu 'alaihi wasallam berdiri dan saya pun ikut berdiri di atas pintu sehingga saya melihat di antara kedua telinga dan pundak beliau, sementara mereka bermain-main di masjid. Atha` bertanya; Orang-orang Faris ataukah Habasyi? Dan Ibnu 'Atiq berkata kepadaku; Bahkan mereka adalah orang-orang Habasyi",
          "tr": "Bana İbrâhîm b. Dinar ile Ukbetü'bnü Mükrem El-Ammî ve Abd b. Humeyd hep birden Ebû Âsım'dan rivayet ettiler. Lafız Ukbe'nindir. dediki: Bize Ebû Âsim, îbni Cüreyc'den rivayet etti. Demişki: Bana Ata' haber verdi. (dediki): Bana Ubeyd b. Umeyr haber verdi. (Dediki): Bana Aişe haber verdi ki kendisi, oynayanlar için: «Ben, onları görmek istedim. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), ayağa kalktı; ben de kapıya durdum. Onun kulakları ile omuzu arasından bakıyordum. Habeşliler mescidde oynuyorlardı.» demiş. Atâ: «Bunlar yâ İranlılar yâ Habeşliler idi.»; «Bana İbni Atik, bunların Habeşliler olduğunu söyledi.» demişdir. İzah 893 te"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 2069,
      "arabicNumber": "893",
      "book": 8,
      "hadithInBook": 24,
      "text": {
        "arabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا الْحَبَشَةُ يَلْعَبُونَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِحِرَابِهِمْ إِذْ دَخَلَ عُمَرُ بْنُ الْخَطَّابِ فَأَهْوَى إِلَى الْحَصْبَاءِ يَحْصِبُهُمْ بِهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ يَا عُمَرُ",
        "translations": {
          "en": "Abu Huraira reported:While the Abyssinians were busy playing with their arms in the presence of the Messenger of Allah (ﷺ) 'Umar b. Khattab came there. He bent down to take up pebbles to throw at them (in order to make them go off). The Messenger of Allah (ﷺ) said to him: 'Umar, leave them alone",
          "ur": "حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : جبکہ حبشی رسول اللہ صلی اللہ علیہ وسلم کے سامنے اپنے بھالوں سے کھیل رہے تھے توحضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ پہنچ گئے اور کنکریاں اٹھانے کے لئے جھکے تاکہ وہ انھیں کنکریاں ماریں تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" عمر!انھیں چھوڑ دو ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Pendant que les Abyssiniens jouaient avec leurs armes en présence du Messager d’Allah ﷺ, ‘Umar ibn Khattab رضي الله عنه arriva. Il se pencha pour ramasser des cailloux afin de les chasser. Le Messager d’Allah ﷺ lui dit : « ‘Umar, laisse-les. »",
          "id": "Dan telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abdu bin Humaid] -Abdu berkata- telah mengabarkan kepada kami -Ibnu Rafi' berkata- telah menceritakan kepada kami [Abdur Razaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnul Musayyab] dari [Abu Hurairah] ia berkata; Ketika orang-orang Habasyah bermain-main tombak di sisi Rasulullah shallallahu 'alaihi wasallam, tiba-tiba Umar bin Al Khathab masuk dan segera mengulurkan tangannya mengambil tombak kecil untuk melempar mereka. Namun Rasulullah shallallahu 'alaihi wasallam segera bersabda: \"Biarkanlah mereka wahai Umar",
          "tr": "Bana Muhammed b. Râfİ ile Abd b. Humeyd rivayet ettiler. Abd: (Bize haber verdi...) tâbirini kullandı, ibni Râfi' ise: (Bize Abdürrazzâk rivayet etti.) dedi. (Abdürrazzak demişkil: Bize Ma'mer, Zührî'den, o da Îbnü'l-Müseyyeb'den, o da Ebû Hureyre'den naklen haber verdi. Ebû Hureyre şöyle demiş: «Habeşliler Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında harbeleri ile oynarlarken Ömerü'bnü'l-Hattâb giriverdi. Hemen onları taşlamak için (yerdeki) taşlara uzandı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem): «Bırak onları yâ Ömer!» buyurdular. İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 8,
        "hadith": 24
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "16KB"
  }
}