{
  "collection": "muslim",
  "book": 31,
  "name": {
    "arabic": "كتاب The Book of Lost Property",
    "transliteration": "kitab lost property",
    "translation": "The Book of Lost Property"
  },
  "totalHadith": 19,
  "hadithNumberRange": {
    "first": 4498,
    "last": 4518
  },
  "content": [
    {
      "hadithNumber": 4498,
      "arabicNumber": "1722.01",
      "book": 31,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ، الرَّحْمَنِ عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهُ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَشَأْنَكَ بِهَا ‏\"‏ ‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏ ‏.‏ قَالَ فَضَالَّةُ الإِبِلِ قَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏ ‏.‏ قَالَ يَحْيَى أَحْسِبُ قَرَأْتُ عِفَاصَهَا",
        "translations": {
          "en": "Zaid b. Khalid al-Juhani reported:A man came to Allah's Apostle (ﷺ) and asked him about picking up of stray articles. He said: Recognise (well) its bag and the strap (by which it is tied) then make announcement of that for a year. If its owner comes (within this time return that to him), otherwise it is yours. He (again) said: (What about) the lost goat? Thereupon he (the Holy Prophet) said: It is yours or for your brother, or for the wolf. He said: (What about) the lost camel? Thereupon he said: You have nothing to do with it; it has a leather bag along with it, and its shoes also. It comes to the watering-place, eats (the leaves of the) trees until its master finds him",
          "ur": "ہمیں یحییٰ بن یحییٰ تمیمی نے حدیث بیان کی ، انہوں نے کہا : میں نے امام مالک کے سامنے قراءت کی ، انہوں نے ربیعہ بن ابی عبدالرحمٰن سے ، انہوں نے منبعث رضی اللہ عنہ کے مولیٰ یزید سے اور انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا : ایک آدمی نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے ( کسی کی ) گری ، بھولی چیز کے بارے میں دریافت کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کے ڈھکنے/تھیلی اور بندھن کی شناخت کر لو ، پھر ایک سال اس کی تشہیر کرو ، اگر اس کا مالک آ جائے ( تو اسے دے دو ) ورنہ اس کا جو چاہو کرو ۔ \"\" اس نے کہا : گمشدہ بکری ( کا کیا حکم ہے؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تمہاری ہے یا تمہارے بھائی کی ہے یا بھیڑیے کی ہے ۔ \"\" اس نے پوچھا : تو گمشدہ اونٹ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تمہارا اس سے کیا تعلق ہے؟ اس کی مشک اور اس کا موزہ اس کے ساتھ ہے ، وہ ( خود ہی ) پانی پر پہنچتا ہے اور درخت ( کے پتے ) کھاتا ہے یہاں تک کہ اس کا مالک اسے پا لیتا ہے ۔ \"\" ( یحییٰ نے کہا : میرا خیال ہے میں نے عفاصها پڑھا تھا ۔ ( بعض روایات میں \"\" وكاءها \"\" ( اس کا بندھن ) ہے",
          "fr": "Rapporté par Zayd ibn Khalid al-Juhani : Un homme est venu voir le Messager d’Allah ﷺ et lui a demandé ce qu’il fallait faire lorsqu’on trouve un objet perdu. Il a dit : « Reconnais bien son sac et sa corde, puis annonce-le pendant un an. Si son propriétaire se présente, rends-le-lui, sinon il est à toi. » Il a demandé : « Et pour une chèvre perdue ? » Le Prophète ﷺ a répondu : « Elle est à toi, ou à ton frère, ou au loup. » Il a demandé : « Et pour un chameau perdu ? » Le Prophète ﷺ a répondu : « Tu n’as rien à faire, il a sa gourde et ses chaussures, il va à l’abreuvoir, mange les feuilles des arbres jusqu’à ce que son maître le retrouve. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dia berkata; aku bacakan di hadapan [Malik]; dari [Rabi'ah bin Abu Abdurrahman] dari [Yazid] bekas budak Al Munba'is, dari [Zaid bin Khalid Al Juhani] bahwa dia berkata, \"Seseorang datang kepada Nabi shallallahu 'alaihi wasallam dan menanyakan mengenai barang temuan.\" Lalu beliau bersabda: \"Kenalilah wadah dan talinya, setelah itu umumkanlah kepada khalayak ramai, apabila pemiliknya datang maka berikanlah barang tersebut kepadanya.\" Kemudian orang itu juga bertanya, \"Wahai Rasulullah, bagaimana jika yang ditemukan adalah kambing?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Mungkin ia dapat menjadi milikmu atau milik saudaramu atau bahkan menjadi milik serigala.\" Dia berkata, \"Wahai Rasulullah, bagaimana jika yang ditemukan adalah unta?\" beliau menjawab: \"Apa urusanmu dengan unta yang hilang? Ia telah membawa sepatu (punya kaki) dan wadah airnya sendiri. Ia dapat mendatangi mata air dan makan dedaunan sampai ia bertemu pemiliknya.\" Yahya berkata, \"Sepertinya aku membaca 'iffashaha (wadahnya)",
          "tr": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Mâlik'e Rabia b. Ebî Abdirrahmân'dan dinlediğim, onun da Münbais'in âzâdlısı Yezid'den, onun da Zcyd b. Hâlid El-Cühenî'den naklen rivayet ettiği şu hadîsi okudum. Zeyd şöyle demiş: Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek ona lukata'nın hükmünü sordu. Resûlullah (Sallallahu Aleyhi ve Sellem): «Onun mahafazasını ve bağını belle! Sonra onu bir sene i'lân et! Sahibi gelirse ne âlâ! Aksi takdirde onu nasıl istersen öyle yap!» buyurdu. Adam: — Kaybolmuş koyun (un hükmü nedir?) dedi. «Senin yahut dîn kardeşinin yahut da kurdundur.» buyurdular. Adam: — Ya kaybolmuş deve ne olacak? dedi. «Ondan sana ne? Su tulumu ve çarığı beraberinde! Sahibi rastlayıncaya kadar suya gider ve ağaçları otlar!» buyurdular. Yahya: «Zannederim ifâsahâ okudum.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 4499,
      "arabicNumber": "1722.02",
      "book": 31,
      "hadithInBook": 2,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ ابْنُ حُجْرٍ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهْوَ ابْنُ جَعْفَرٍ - عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ عَرِّفْهَا سَنَةً ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ اسْتَنْفِقْ بِهَا فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الإِبِلِ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى احْمَرَّتْ وَجْنَتَاهُ - أَوِ احْمَرَّ وَجْهُهُ - ثُمَّ قَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Zaid b. Khalid al-Juhani reported that a person asked Allah's Apostle (ﷺ) about picking up of stray articles, whereupon he said:Make announcement about it for a year, and recognise well the strap and the bag (containing that) ; then spend that; and if its owner comes, make him the payment of that. He (the inquirer) said: Messenger of Allah, what about the lost goat? he said: Take it, for that is yours or for your brother, or for the wolf. He (again) said: (What about) the lost camel? The Messenger of Allah (ﷺ) was enraged until his cheeks became red (or his face became red) and then said: You have nothing to do about that; it has feet and a leather bag (to quench its thirst) until its owner finds it",
          "ur": "اسماعیل بن جعفر نے ہمیں ربیعہ بن ابی عبدالرحمٰن سے حدیث بیان کی ، انہوں نے منبعث کے مولیٰ ( آزاد کردہ غلام ) یزید سے اور انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے ( کسی کی ) گری پڑی چیز کے بارے میں دریافت کیا تو آپ نے فرمایا : \" ایک سال اس کا اعلان کرو ، پھر اس کے بندھن اور تھیلی وغیرہ کی شناخت رکھو ، پھر اس سے خرچ کرو ، اگر اس کا مالک آ جائے تو اسے دے دو ۔ \" اس نے کہا : اے اللہ کے رسول! گمشدہ بکری؟ آپ نے فرمایا : \" اسے پکڑ لو ، وہ تمہاری ہے یا تمہارے بھائی کی ہے یا بھیڑیے کی ہے ۔ \" اس نے کہا : اے اللہ کے رسول! گمشدہ اونٹ؟ کہا : اس پر رسول اللہ صلی اللہ علیہ وسلم غصے ہوئے حتی کہ آپ کے دونوں رخسار سرخ ہو گئے ۔ ۔ یا آپ کا چہرہ مبارک سرخ ہو گیا ۔ پھر فرمایا : \" تمہار اس سے کیا تعلق؟ اس وقت تک کہ اس کا مالک اسے پا لے ، اس کا موزہ اور اس کی مشک اس کے ساتھ ہے",
          "fr": "Rapporté par Zayd ibn Khalid al-Juhani : Un homme a demandé au Messager d’Allah ﷺ ce qu’il fallait faire lorsqu’on trouve un objet perdu. Il a répondu : « Annonce-le pendant un an, reconnais bien sa corde et son sac, puis utilise-le ; si son propriétaire se présente, rembourse-le-lui. » L’homme a demandé : « Ô Messager d’Allah, et pour une chèvre perdue ? » Il a répondu : « Prends-la, elle est à toi, ou à ton frère, ou au loup. » Il a demandé : « Et pour un chameau perdu ? » Le Messager d’Allah ﷺ s’est mis en colère au point que ses joues (ou son visage) sont devenues rouges, puis il a dit : « Tu n’as rien à faire avec cela ; il a ses pattes et sa gourde pour boire jusqu’à ce que son propriétaire le retrouve. »",
          "id": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] dan [Qutaibah] dan [Ibin Hujr]. Ibnu Hujr berkata; telah mengabarkan kepada kami, sedangkan yang dua orang mengatakan; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu Ja'far- dari [Rabi'ah bin Abu Abdurrahman] dari [Yazid] -bekas budak Al Munba'its- dari [Zaid bin Khalid Al Juhani] bahwa seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang barang temuan, lalu beliau bersabda: \"Umumkanlah selama setahun, lalu kenalilah wadah dan talinya setelah itu manfaatkanlah ia, jika pemiliknya datang maka berikanlah barang tersebut kepadanya.\" Kemudian orang itu bertanya lagi, \"Wahai Rasulullah, bagaimana dengan kambing yang hilang?\" Beliau menjawab: \"Ambillah, mungkin ia dapat menjadi milikmu atau milik saudaramu atau bahkan menjadi milik serigala.\" Dia bertanya lagi, \"Wahai Rasulullah, bagaimana jika yang ditemukan adalah unta?\" Zaid bin Khalid berkata, \"Maka Rasulullah shallallahu 'alaihi wasallam marah hingga wajahnya memerah, kemudian beliau bersabda: \"Apa urusanmu dengan unta yang hilang? Ia telah membawa sepatu (punya kaki) dan wadah airnya sendiri hingga ia bertemu pemiliknya.\" Dan telah menceritakanku [Abu At Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Sufyan Ats Tsauri] dan [Malik bin Anas] dan ['Amru bin Al Harits] dan yang lainnya, bahwa [Rabi'ah bin Abu Abdurrahman] telah menceritakan kepada mereka dengan isnad ini seperti hadits Malik, hanya saja ia menambahkan; Zaid berkata, \"Seorang laki-laki datang menemui Rasulullah shallallahu 'alaihi wasallam, sedangkakn saat itu aku bersama beliau, lantas dia bertanya mengenai barang temuan.\" Perawi berkata; Amru menyebutkan dalam hadits, \"Jika pemiliknya belum datang untuk mengambilnya, maka kamu boleh memanfaatkannya.\" Dan telah menceritakanku [Ahmad bin Utsman bin Hakim Al Audi] telah menceritakan kepadaku [Khlaid bin Makhlad] telah menceritakanku [Sulaiman] -yaitu Ibnu Bilal- dari [Rabi'ah bin Abu Abdurrahman] dari [Yazid] -bekas budak Al Munba'its- dia berkata; aku pernah mendengar [Zaid bin Khalid Al Juhani] berkata, \"Seorang laki-laki datang menemui Rasulullah shallallahu 'alaihi wasallam, lalu dia menyebutkan seperti hadits Isma'il bin Ja'far, namun dia menyebutkan, \"Lalu beliau marah sampai terlihat wajahnya memerah.\" Dan setelah perkataanya, \"kemudian umumkanlah selama setahun, jika pemiliknya belum datang maka ia menjadi barang titipan untukmu",
          "tr": "Bize Yahya b. Eyyûb ile Kuteybe ve İbni Hucr da rivayet ettiler. İbni Hucr «Bize haber verdi» ta'bîrini kullandı. Ötekiler: Bize İsmâîl —ki İbni Ca'fer'dir— tahdîs etti, dediler. O da Rabîa b. Ebî Abdirrahmân'dan, o da Münbais'in âzâdlısı Yezîd'den, o da Zeyd b. Hâlid El-Cühenî'den naklen rivayet etmişki, bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e lukatanın hükmünü sormuş. O da : «Onu bir sene i'lân et! Sonra (bir de) onun bağını ve kabını bellel Sonra onu harca! Şayet sahibi gelirse onu kendisine veriver!» buyurmuş. Adanı: — Yâ Rcsûlâllah! Kaybolmuş koyunun hükmü nedir? demiş. «Onu al! Zîra o ya senin ya dîn kardeşinin yahut da kurdundur.» buyurmuş. Adam: — Yâ Resulâllah! Ya kaybolmuş develer ne olacak? diye sormuş. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kızmış. Hattâ yanakları kızarmış. (Yahut yüzü kızarmış.) Sonra: «Onlardan sana ne? Sahibi rastlayıncaya kadar onun çarığı ve su tulumu beraberindedir.» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 4500,
      "arabicNumber": "1722.03",
      "book": 31,
      "hadithInBook": 3,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي سُفْيَانُ الثَّوْرِيُّ، وَمَالِكُ، بْنُ أَنَسٍ وَعَمْرُو بْنُ الْحَارِثِ وَغَيْرُهُمْ أَنَّ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، حَدَّثَهُمْ بِهَذَا الإِسْنَادِ، مِثْلَ حَدِيثِ مَالِكٍ غَيْرَ أَنَّهُ زَادَ قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَنَا مَعَهُ فَسَأَلَهُ عَنِ اللُّقَطَةِ ‏.‏ قَالَ وَقَالَ عَمْرٌو فِي الْحَدِيثِ ‏ \"‏ فَإِذَا لَمْ يَأْتِ لَهَا طَالِبٌ فَاسْتَنْفِقْهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Rabi'a b. Abu Abd al-Rahman with the same chain of transmitters but with this addition:\" There came a person to Allah's Messenger (ﷺ) while I was with him, and he asked him about picking up of a stray article, and he said: When none comes to demand it, then spend that",
          "ur": "عبداللہ بن وہب نے ہمیں خبر دی ، کہا : مجھے سفیان ثوری ، مالک بن انس ، عمرو بن حارث اور دیگر لوگوں نے خبر دی کہ ربیعہ بن ابی عبدالرحمان نے انہیں اسی سند کے ساتھ مالک کی حدیث کے مانند حدیث بیان کی ، البتہ انہوں نے یہ اضافہ کیا : کہا : ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو میں آپ کے ساتھ تھا ، اس نے آپ سے کسی کی گری پڑی چیز کے بارے میں پوچھا ۔ اور ( ابن وہب نے ) کہا : عمرو نے حدیث میں کہا : \" جب اسے تلاش کرنے والا کوئی نہ آئے تو اسے خرچ کر لو",
          "fr": "Rapporté par Rabi’a ibn Abu Abd al-Rahman : Ce hadith a été rapporté avec la même chaîne de transmetteurs, mais avec cette précision : « Un homme est venu voir le Messager d’Allah ﷺ alors que j’étais avec lui et lui a demandé au sujet d’un objet perdu. Il a dit : “Si personne ne vient le réclamer, alors utilise-le.” »",
          "tr": "Bana Ebû't-Tâhir de rivayet etti. (Dediki): Bize Abdullah b. Vehb El-Hâris ve başkaları haber verdiler. Onlara da Rabîa b. Ebî Abdirrahmân bu isnâdla Mâlik hadîsinin mislini rivayet etmiş. Yalnız o şunu ziyade etmiş: «Dediki: Resûlullah (Sallallahu Aleyhi ve Sellem)'e ben de beraberinde iken bir adam geldi; ve ona lukatanın hükmünü sordu. Bu hadîste Amr: Şayet lukatamn arayıcısı gelmezse onu harcayıver! cümlesini söyledi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 4501,
      "arabicNumber": "1722.04",
      "book": 31,
      "hadithInBook": 4,
      "text": {
        "arabic": "وَحَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِيُّ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ، - وَهُوَ ابْنُ بِلاَلٍ - عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ قَالَ سَمِعْتُ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، يَقُولُ أَتَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ إِسْمَاعِيلَ بْنِ جَعْفَرٍ ‏.‏ غَيْرَ أَنَّهُ قَالَ فَاحْمَارَّ وَجْهُهُ وَجَبِينُهُ وَغَضِبَ ‏.‏ وَزَادَ بَعْدَ قَوْلِهِ ‏\"‏ ثُمَّ عَرِّفْهَا سَنَةً ‏\"‏ ‏.‏ ‏\"‏ فَإِنْ لَمْ يَجِئْ صَاحِبُهَا كَانَتْ وَدِيعَةً عِنْدَكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Zaid b. Khalid al-Juhani reported. There came to Allah's Messenger (ﷺ) a person, the rest of the hadith is the same but with the variation (of these words):His face became red, his forehead too, and he felt annoyed; and made an addition after the words: He should make announcement of that for a year, and if its owner does not turn up, then it is a trust with you",
          "ur": "سلیمان بن بلال نے مجھے ربیعہ بن ابی عبدالرحمان سے حدیث بیان کی ، انہوں نے منبعث کے مولیٰ یزید سے روایت کی ، انہوں نے کہا : میں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ۔ ۔ اس کے بعد اسماعیل بن جعفر کی حدیث کی طرح بیان کیا ، مگر انہوں نے کہا : \" تو آپ کا چہرہ اور پیشانی سرخ ہو گئے اور آپ غصہ ہوئے ۔ \" اور انہوں نے اس قول \" پھر ایک سال اس کی تشہیر کرو ۔ \" کے بعد ۔ ۔ یہ اضافہ کیا : \" اگر اس کا مالک نہ آیا تو وہ تمہارے پاس امانت ہو گی",
          "fr": "Rapporté par Zayd ibn Khalid al-Juhani : Un homme est venu voir le Messager d’Allah ﷺ. Le reste du hadith est le même, mais avec cette variante : Son visage et son front sont devenus rouges, il était contrarié ; et il a ajouté après les mots : « Il doit l’annoncer pendant un an, et si son propriétaire ne se manifeste pas, alors c’est un dépôt chez toi. »",
          "tr": "Bana Ahmed b. Osman b. Hakîm El-Evdî dahî rivayet etti. (Dediki): Bize Hâlid b. Mahled rivayet etti. (Dediki): Bana Süleyman —ki İbni Bilâl'dir— Rabîa b. Ebî Abdirrahman'dan, o da Münbais'in âzâdlısı Yezîd'den naklen rivayet etti. Yezîd şöyle demiş: Ben Zeyd b. Hâlid El-Cühenî'yi şunları söylerken işittim: «Bir adam Resûlullah (Sallallahu Aleyhi ve Sellem)'e geldi...» arkacığından râvi hadîsi İsmail b. Ca'fer hadîsi gibi rivayet etmiştir. Yalnız o : «Yüzü ve alnı kıpkırmızı kesildi ve kızdı.» demiş. «Sonra onu bir sene i'lân et!» cümlesinden sonra: «Şayet sahibi gelmezse Iukata senin yannda emânet olur.» ibaresini ziyâde etmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 4502,
      "arabicNumber": "1722.05",
      "book": 31,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ أَنَّهُ سَمِعَ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ الذَّهَبِ أَوِ الْوَرِقِ فَقَالَ ‏\"‏ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ لَمْ تَعْرِفْ فَاسْتَنْفِقْهَا وَلْتَكُنْ وَدِيعَةً عِنْدَكَ فَإِنْ جَاءَ طَالِبُهَا يَوْمًا مِنَ الدَّهْرِ فَأَدِّهَا إِلَيْهِ ‏\"‏ ‏.‏ وَسَأَلَهُ عَنْ ضَالَّةِ الإِبِلِ فَقَالَ ‏\"‏ مَا لَكَ وَلَهَا دَعْهَا فَإِنَّ مَعَهَا حِذَاءَهَا وَسِقَاءَهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَجِدَهَا رَبُّهَا ‏\"‏ ‏.‏ وَسَأَلَهُ عَنِ الشَّاةِ فَقَالَ ‏\"‏ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Zaid b. Khalid al-Juhani, the Companion ot Allah's Messenger (ﷺ), said that Allah's Messenger (ﷺ) was asked about the picking up of stray gold or silver, whereupon he said:Recognise well the strap and the bag (containing) that and then make an announcement regarding that for one year, but if none recognises it, then spend that and it would be a trust with you; and if someone comes one day to make demand of that, then pay that to him. He (the inquirer) asked about the lost camel, whereupon he said: You have nothing to do with that. Leave that alone, for it has feet and also a leather bag, it drinks water, and eats (the leaves) of the trees. He asked him about sheep, whereupon he said: Take it, it is for you, or for your brother, or for the wolf",
          "ur": "سلیمان بن بلال نے ہمیں یحییٰ بن سعید سے حدیث بیان کی ، انہوں نے منبعث کے مولیٰ یزید سے روایت کی کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھی حضرت زید بن خالد جہنی رضی اللہ عنہ سے سنا ، وہ کہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم سے کسی کے گرے یا بھولے ہوئے سونے اور چاندی کے بارے میں پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس کی تھیلی اور ( باندھنے کی ) رسی کی شناخت کر لو ، پھر ایک سال اس کی تشہیر کرو ، اگر ( کچھ بھی ) نہ جان پاؤ تو اسے خرچ کر لو اور وہ تمہارے پاس امانت ہو گی ، اگر کسی بھی دن اس کا طلب کرنے والا آ جائے تو اسے اس کی ادائیگی کر دو ۔ \" اس شخص نے آپ صلی اللہ علیہ وسلم سے گمشدہ اونٹ کے بارے میں پوچھا : تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارا اس سے کیا واسطہ؟ اس کا جوتا اور مشکیزہ اس کے ساتھ ہے ، وہ مالک کے پا لینے تک ( خود ہی ) پانی پر آتا اور درخت کھاتا ہے ۔ اس نے آپ سے بکری کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : اسے پکڑ لو ، وہ تمہاری ہے یا تمہارے بھائی کی ہے یا بھیڑیے کی ہے",
          "fr": "Rapporté par Zayd ibn Khalid al-Juhani, compagnon du Messager d’Allah ﷺ : On a demandé au Messager d’Allah ﷺ ce qu’il fallait faire lorsqu’on trouve de l’or ou de l’argent perdu. Il a répondu : « Reconnais bien la corde et le sac, puis annonce-le pendant un an. Si personne ne le réclame, utilise-le, mais ce sera un dépôt chez toi ; et si un jour quelqu’un vient le réclamer, rends-le-lui. » Il a été interrogé sur le chameau perdu, il a répondu : « Tu n’as rien à faire, laisse-le, il a ses pattes et sa gourde, il boit et mange les feuilles jusqu’à ce que son maître le retrouve. » Il a été interrogé sur la brebis, il a dit : « Prends-la, elle est à toi, ou à ton frère, ou au loup. »",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Sulaiman] -yaitu Ibnu Bilal- dari [Yahya bin Sa'id] dari [Yazid] -bekas budak Al Munba'its- bahwa dia mendengar [Zaid bin Khalid Al Juhani] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai barang temuan yang berisi emas atau perak.\" Maka beliau bersabda: \"Kenalilah wadah dan talinya, kemudian umumkanlah selama setahun, apabila pemiliknya tidak datang untuk mengenalinya, maka -untuk sementara waktu- kamu boleh memanfaatkan, dan itu sebagai barang titipan untukmu. Seandainya di suatu hari pemiliknya datang mencari barang tersebut, maka berikanlah barang tersebut kepadanya.\" Lalu dia bertanya menegani temuan unta, maka beliau balik bertanya kepada dia: \"Apa urusanmu dengan unta yang hilang? Biarkanlah unta itu pergi, karena ia membawa sepatu (punya kaki) dan wadah airnya sendiri. Ia dapat mendatangi mata air dan makan dedaunan sampai ia bertemu pemiliknya.\" Orang itu bertanya lagi mengenai temuan kambing, beliau menjawab: \"Ambillah ia, mungkin ia dapat menjadi milikmu atau milik saudaramu atau bahkan menjadi milik serigala.\" Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Habban bin Hilal] telah menceritakan kepada kami [Hamamd bin Salamah] telah menceritakan kepadaku [Yahya bin Sa'id] dan [Rabi'ah Ar Ra'iy bin Abu Abdurrahman] dari [Yazid] bekas budak Al Munba'its, dari [Zaid bin Khalid Al Juhani], bahwa ada seorang laki-laki yang bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai unta temuan, Rabi'ah menambahkan, \"Lalu beliau marah hingga terlihat wajahnya memerah...lalu dia menceritakan hadits tersebut seperti hadits mereka. Dia juga menambahkan, \"Jika pemiliknya datang dan mengenali talinya, jumlah serta wadahnya maka berikanlah kepadanya, jika tidak maka itu menjadi milikmu",
          "tr": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Süleyman (yâni İbni Bilâl), Yahya b. Saîd'den, o da Münbais'in âzâdlısı Yezîd'den naklen rivayet ettiki, Yezîd, Resûlullah (Sallallahu Aleyhi ve Sellem)'in sahâbîsi Zeyd b. Hâlid El-Cühenî'yi şunu söylerken işitmiş : — Resûlullah (Sallallahu Aleyhi ve Sellem)'e altın veya gümüş lukatanın hükmü soruldu da: «Onun bağını ve mahfazasını belle! Sonra onu bir sene i'lân et! Şayet (sahibini) öğrenemezsen onu harca (ya bilirsin). Lukata senin elinde bir emânet olsun! Şayet günlerden bîr gün arayıcısı gelirse onu kendisine veri ver!» buyurdu. Soran zât ona kaybolan develeri de sordu. Bunun üzerine: «Onlardan sana ne? Bırak onları! Zîrâ onların çarıkları ve su tulumları yanlarındadır. Sahipleri onları buluncaya kadar suya gelirler, ağaçları otlarlar!» buyurdu. O zât koyunu da sordu. Efendimiz : «Onu al! Çünkü o ancak ya senin, ya dîn kardeşinin yahut da kurdundur.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 4503,
      "arabicNumber": "1722.06",
      "book": 31,
      "hadithInBook": 6,
      "text": {
        "arabic": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، وَرَبِيعَةُ الرَّأْىِ بْنُ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ، خَالِدٍ الْجُهَنِيِّ أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنْ ضَالَّةِ الإِبِلِ ‏.‏ زَادَ رَبِيعَةُ فَغَضِبَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ ‏.‏ وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ وَزَادَ ‏ \"‏ فَإِنْ جَاءَ صَاحِبُهَا فَعَرَفَ عِفَاصَهَا وَعَدَدَهَا وَوِكَاءَهَا فَأَعْطِهَا إِيَّاهُ وَإِلاَّ فَهْىَ لَكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Zaid b. Khalid al-Juhani reported:A person asked Allah's Apostle (ﷺ) about a lost camel; Rabi'a made this addition: He (the Holy Prophet) was so much annoyed that his cheeks became red.\" The rest of the hadith is the same. He (the narrator) made this addition:\" If its (that of the article) owner comes and he recognises the bag (which contained it) and its number, and the strap. then give that to them, but if not, then it is for you",
          "ur": "حماد بن مسلمہ نے ہمیں حدیث بیان کی ، کہا : مجھے یحییٰ بن سعید اور ربیعہ رائے بن ابو عبدالرحمان نے منبعث کے مولیٰ یزید سے حدیث بیان کی ، انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ ایک آدمی نے نبی صلی اللہ علیہ وسلم سے گمشدہ اونٹ کے بارے میں پوچھا ۔ ( اس روایت میں ) ربیعہ نے اضافہ کیا : تو آپ غصے ہوئے حتی کہ آپ کے دونوں رخسار مبارک سرخ ہو گئے ۔ ۔ اور انہوں نے انہی کی حدیث کی طرح حدیث بیان کی اور ( آخر میں ) یہ اضافہ کیا : \" اگر اس کا مالک آ جائے اور اس کی تھیلی ، ( اندر جو تھا اس کی ) تعداد اور اس کے بندھن کو جانتا ہو تو اسے دے دو ورنہ وہ تمہاری ہے",
          "fr": "Rapporté par Zayd ibn Khalid al-Juhani : Un homme a demandé au Messager d’Allah ﷺ au sujet d’un chameau perdu. Rabi’a a ajouté : Le Prophète ﷺ s’est tellement fâché que ses joues sont devenues rouges. Le reste du hadith est le même. Le narrateur a ajouté : « Si le propriétaire (de l’objet) se présente et reconnaît le sac, le nombre et la corde, rends-le-lui ; sinon, il est à toi. »",
          "tr": "Bana İshâk b. Mansûr da rivayet etti. (Dediki): Bize Habbân b. Hilâl haber verdi. (Dediki): Bize Hammâd b. Seleme rivâyet etti. (Dediki): Bana Yahya b. Saîd ile Rabîatü'r-Re'y b. Ebî Abdirrahmân, Münbais'in âzâdlısı Yezîd'den, o da Zeyd b. Hâlid El-Cühenî'den naklen rivayet ettiki, Bir adam Nebi (Sallallahu Aleyhi ve Sellem)'e kaybolan develerin hükmünü sormuş...» Rabîa şunu ziyade etmiş: «Bunun üzerine kızdı; hatta yanakları kızardı.» ve hadîsi yukarıdakilerin hadîsi gibi rivayet etmiş. Şunu da ziyade eylemiş: «Şayet sahibi gelir de mahfazasını, sayısını ve bağını bilirse onu kendisine veriver! Aksi takdirde o senindir.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 4506,
      "arabicNumber": "1723.01",
      "book": 31,
      "hadithInBook": 8,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي أَبُو بَكْرِ، بْنُ نَافِعٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ سَمِعْتُ سُوَيْدَ، بْنَ غَفَلَةَ قَالَ خَرَجْتُ أَنَا وَزَيْدُ بْنُ صُوحَانَ، وَسَلْمَانُ بْنُ رَبِيعَةَ، غَازِينَ فَوَجَدْتُ سَوْطًا فَأَخَذْتُهُ فَقَالاَ لِي دَعْهُ ‏.‏ فَقُلْتُ لاَ وَلَكِنِّي أُعَرِّفُهُ فَإِنْ جَاءَ صَاحِبُهُ وَإِلاَّ اسْتَمْتَعْتُ بِهِ ‏.‏ قَالَ فَأَبَيْتُ عَلَيْهِمَا فَلَمَّا رَجَعْنَا مِنْ غَزَاتِنَا قُضِيَ لِي أَنِّي حَجَجْتُ فَأَتَيْتُ الْمَدِينَةَ فَلَقِيتُ أُبَىَّ بْنَ كَعْبٍ فَأَخْبَرْتُهُ بِشَأْنِ السَّوْطِ وَبِقَوْلِهِمَا فَقَالَ إِنِّي وَجَدْتُ صُرَّةً فِيهَا مِائَةُ دِينَارٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُ بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ قَالَ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ ‏.‏ فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ ‏.‏ فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ‏.‏ فَقَالَ ‏\"‏ احْفَظْ عَدَدَهَا وَوِعَاءَهَا وَوِكَاءَهَا فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَاسْتَمْتِعْ بِهَا ‏\"‏ ‏.‏ فَاسْتَمْتَعْتُ بِهَا ‏.‏ فَلَقِيتُهُ بَعْدَ ذَلِكَ بِمَكَّةَ فَقَالَ لاَ أَدْرِي بِثَلاَثَةِ أَحْوَالٍ أَوْ حَوْلٍ وَاحِدٍ ‏.‏",
        "translations": {
          "en": "Salama b. Kuhail reported:I heard Sowaid b. Ghafala say: I went out, and also Zaid b. Suhan and Salman b. Rabi'a for Jihad, and I found a whip and took it up. They said to me: Leave it. I said: No. but I will make announcement of it and if its owner comes (then I will return that), otherwise I will use it, and I refused them. When we returned from Jihad. by a good fortune for me, I performed Pilgrimage. I came to Medina and met Ubayy b. Ka'b, and related to him the affair of the whip and their opinion (the opinion of Zaid b. Suhan and Salman b. Rabi'a) about it (i. e. I should throw it). Thereupon he said: I found a money bag during the lifetime of Allah's Messenger (ﷺ) which contained one hundred dinars. I came to him along with it, and he said: Make an announcement of it for one year; so I announced it, but did not find anyone who could (claim it after) recognising it. I again came to him and he said: Make announcement for one year. So I made announcement of it, but I found none who could recognise it. I came to him he said: Make announcement of it for one year. I made announcement of that but did not find one who could recognise it, whereupon he said: Preserve (in your mind) its number, its bag and its strap, and if its owner comes (then return that to him), otherwise make use of it. So I made use of that. I (Shu'ba) met him (Salama b. Kuhail) after this in Mecca, and he said: I do not know whether he said three years or one year",
          "ur": "(محمد بن جعفر ) غندر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے سلمہ بن کہیل سے حدیث بیان کی ، انہوں نے کہا : میں نے سوید بن غفلہ سے سنا ، انہوں نے کہا : میں ، زید بن صوحان اور سلمان بن ربیعہ جہاد کے لیے نکلے ، مجھے ایک کوڑا ملا تو میں نے اسے اٹھا لیا ، ان دونوں نے مجھ سے کہا : اسے رہنے دو ۔ میں نے کہا : نہیں ، بلکہ میں اس کا اعلان کروں گا ، اگر اس کا مالک آ گیا ( تو اسے دے دوں گا ) ورنہ اس سے فائدہ اٹھاؤں گا ۔ کہا : میں نے ان دونوں ( کی بات ماننے ) سے انکار کر دیا ۔ جب ہم اپنی جنگ سے واپس ہوئے ( تو ) میرے مقدور میں ہوا کہ میں نے حج کرنا ہے ، چنانچہ میں مدینہ آیا ، حضرت ابی بن کعب رضی اللہ عنہ سے ملاقات کی اور انہیں کوڑے کے واقعے اور ان دونوں کی باتوں سے آگاہ کیا تو انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے عہد میں مجھے ایک تھیلی ملی جس میں سو دینار تھے ، میں اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ نے فرمایا : \"\" سال بھر اس کی تشہیر کرو ۔ \"\" میں نے ( دوسرا سال ) اس کی تشہیر کی تو مجھے کوئی شخص نہ ملا جو اسے پہچان پاتا ، میں پھر آپ کے پاس آیا تو آپ نے فرمایا : \"\" ایک سال اس کی تشہیر کرو ۔ \"\" میں نے ( پھر سال بھر ) اس کی تشہیر کی تو مجھے کوئی شخص نہ ملا جو اسے پہچان پاتا ، میں پھر آپ کے پاس آیا تو آپ نے فرمایا : \"\" ایک سال اس کی تشہیر کرو ۔ \"\" میں نے اس کی تشہیر کی تو مجھے کوئی ایسا شخص نہ ملا جو اسے پہچان پاتا ۔ تو آپ نے فرمایا : \"\" اس کی تعداد ، اس کی تھیلی اور اس کے بندھن کو یاد رکھنا ، اس اگر اس مالک آ جائے ( تو اسے دے دینا ) ورنہ اس سے فائدہ اٹھا لینا ۔ \"\" پھر میں نے اسے استعمال کیا ۔ ( شعبہ نے کہا : ) اس کے بعد میں انہیں ( سلمہ بن کہیل کو ) مکہ میں ملا تو انہوں نے کہا : مجھے معلوم نہیں ( حضرت اُبی رضی اللہ عنہ نے ) تین سال ( تشہیر کی ) یا ایک سال",
          "fr": "Rapporté par Salama ibn Kuhail : J’ai entendu Sowaid ibn Ghafala dire : Je suis parti avec Zayd ibn Suhan et Salman ibn Rabi’a pour le jihad, et j’ai trouvé une cravache que j’ai ramassée. Ils m’ont dit : « Laisse-la. » J’ai répondu : « Non, mais je vais l’annoncer, et si son propriétaire se présente, je la lui rendrai, sinon je l’utiliserai », et j’ai refusé de les écouter. À notre retour du jihad, par chance, j’ai accompli le pèlerinage. Je suis allé à Médine et j’ai rencontré Ubayy ibn Ka’b, à qui j’ai raconté l’histoire de la cravache et l’avis de Zayd ibn Suhan et Salman ibn Rabi’a (qu’il fallait la laisser). Il m’a dit : « J’ai trouvé une bourse d’argent du vivant du Messager d’Allah ﷺ qui contenait cent dinars. Je suis allé le voir avec, et il m’a dit : “Annonce-la pendant un an.” Je l’ai annoncée, mais personne ne l’a reconnue. Je suis retourné le voir, il a dit : “Annonce-la pendant un an.” Je l’ai fait, mais personne ne l’a reconnue. Je suis encore revenu, il a dit : “Annonce-la pendant un an.” Je l’ai fait, mais personne ne l’a reconnue. Il m’a alors dit : “Garde bien en mémoire son nombre, son sac et sa corde, et si son propriétaire se présente, rends-la-lui, sinon utilise-la.” Alors je l’ai utilisée. » (Shu’ba dit : J’ai revu Salama ibn Kuhail à La Mecque après cela, et il a dit : Je ne sais plus s’il a dit trois ans ou un an)",
          "id": "Dan telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu Bakar bin Nafi'] sedangkan lafadznya dari dia, telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] dia berkata; aku mendengar [Suwaid bin Ghafalah] dia berkata, \"Aku bersama Zaid bin Shuhan serta Salman bin Rabi'ah pergi berperang, di tengah perjalanan aku menemukan cemeti dan kuambil. Maka kedua temanku tersebut berkata, \"Jangan diambil, biarkan saja.\" Maka aku menimpalinya, 'Tidak, tetapi aku akan mengumumkannya, jika pemiliknya datang meminta aku akan berikan kepadanya, namun jika tidak ada yang datang meminta, aku akan memanfaatkannya sendiri.' Aku tidak setuju dengan pendapat kedua kawanku itu. Setelah kami kembali dari peperangan, Allah mentakdirkanku untuk menunaikan ibadah haji, setibanya aku di Madinah, aku bertemu dengan [Ubay bin Ka'ab], lantas aku memeberitahukan kepadanya perihal cambuk temuanku dan pendapat kedua kawanku tentangnya. Dia menjawab, \"Pada masa Rasulullah shallallahu 'alaihi wasallam, aku juga pernah menemukan pundi-pundi berisi seratus dinar emas, lalu pundi-pundi itu aku bawa ke hadapan Rasulullah shallallahu 'alaihi wasallam, lantas beliau bersabda: \"Umumkanlah selama setahun.\" Maka aku mengumumkannya selama setahun, namun tidak ada seorang pun yang mengakuinya. Kemudian aku bawa kembali kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Umumkanlah selama setahun.\" Lalu aku mengumumkannya lagi, akan tetapi tidak ada seorang pun yang memintanya. Maka beliau bersabda: \"Catatlah berapa jumlahnya, tandai tali pengikat dan wadahnya, jika pemiliknya datang dan memintanya maka berikanlah kepadanya, jika tidak ada yang datang meminta maka kamu boleh mempergunakannya.\" Akhirnya emas itu aku pergunakan untuk keperluanku, lalu aku bertemu dengannya di Makkah, dia berkata, \"Aku tidak tahu apakah dia mengumumkan sampai tiga tahun atau hanya setahun.\" Dan telah menceritakan kepadaku [Abdurrahman bin Bisyr Al 'Abdi] telah menceritakan kepada kami [Bahs] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Salamah bin Kuhail] atau dia telah mengabarkan kepada suatu kaum, sedangkan aku termasuk yang ikut mendengarnya, dia berkata; aku pernah mendengar [Suwaid bin Ghafalah] berkata, \"Aku pergi bersama Zaid bin Shuhan dan Salman bin Rabi'ah, lalu aku menemukan cemeti …lalu dia meneruskan seperti hadits di atas, sampai kepada perkataannya, 'Kemudian aku pergunakan untuk keperluanku'.\" Syu'bah berkata, \"Aku pernah mendengarnya sejak sepuluh tahun yang lalu, bahwa dia berkata, \"Umumkanlah selama setahun.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Al A'masy]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] semuanya dari [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqi] telah menceritakan kepada kami [Ubaidullah] -yaitu Ibnu 'Amru- dari [Zaid bin Abu Unaisah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abdurrahman bin Bisyr] telah menceritakan kepada kami [Bahs] telah menceritakan kepada kami [Hammad bin salamah] mereka semua dari [Salamah bin Kuhail] dengan isnad ini yang semakna dengan hadits Syu'bah. Dan dalam hadits mereka semua disebutkan, 'Tiga tahun', kecuali hadits Hamamd bin Salamah, disebutkan, 'dua tahun atau tiga tahun'.\" Dan dalam hadits Sufyan dan Zaid bin Abu Unaisah serta Hammad bin Salamh disebutkan, 'Jika ada seseorang datang kepadamu dan memberitahukan jumlahnya, wadahnya, dan talinya, maka berikanlah kepadanya'. Sufyan menambahkan dalam riwayatnya Waki', 'Jika tidak, maka ia seperti hak kepemilikan'. Dan dalam riwayatnya Ibnu Numair disebutkan, 'Jika tidak, maka pergunakanlah ia",
          "tr": "Bize Muhammed b. Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. H. Bana Ebû Bekir b. Nâfi' dahî rivayet etti. Lâfız onundur. (Dedikî): Bize Gunder rivayet etti. (Dediki): Bize Şu'be, Seleme b. Küheyl'den naklen rivayet etti. (Demişki): Süveyd b. Gafele'yi dinledim; şunları söyledi: Ben, Zeyd b. Sûhân ve Selmân b. Rabîa gazaya çıktık. Ben bir kamçı bularak onu aldım. Arkadaşlarım bana: — Bırak onu! dediler. Ben: — Hayır (bırakmam) lâkin ben onu ilân ederim; sahibi gelirse ne âla! Gelmezse ondan kendim faydalanırım; dedim. Hasılı (bu işte) onlara karşı çıktım. Gazamızdan dönünce haccetmem mukaddermiş. Medine'ye geldim. Ve Übeyy b. Kâ'b'a rastlayarak kamçı meselesini ve arkadaşlarımın sözünü kendisine haber verdim, Übeyy şunu söyledi: — Ben Resûlullah (Sallallahu Aleyhi ve Sellem) zamanında, İçinde yüz altın bulunan bir kese buldum da onu Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirdim. «Onu bir sene i'lân et!» buyurdular. Ben de İ'lân ettim; fakat onu bilen bir kimse bulamadım. Sonra kendilerine vardım. Yine: «Onu bir sene i'lân et!» buyurdular. Tekrar i'lân ettim; fakat (yine) onu bilen bir kimse bulamadım. Bilâhare (tekrar) kendilerine vardım. (Yine) : «Onu bir sene i'lân et!» buyurdular. İlân ettim; fakat (yine) onu bilen bir kimse bulamadım. Bunun üzerine: «O altınların sayısını, mahfazasını ve bağını belle! Şayet sahibi gelirse ne âlâ! Gelmezse onlardan (kendin) istifâde et ! buyurdular. Artık ben de onlardan istifâde ettim. (Şu'be demişki): Bundan sonra Seleme'ye Mekke'de rast geldim. «Süveyd üç sene mi dedi, bir sene mi bilmiyorum.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 4507,
      "arabicNumber": "1723.02",
      "book": 31,
      "hadithInBook": 9,
      "text": {
        "arabic": "وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي سَلَمَةُ، بْنُ كُهَيْلٍ أَوْ أَخْبَرَ الْقَوْمَ، وَأَنَا فِيهِمْ، قَالَ سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ، قَالَ خَرَجْتُ مَعَ زَيْدِ بْنِ صُوحَانَ وَسَلْمَانَ بْنِ رَبِيعَةَ فَوَجَدْتُ سَوْطًا ‏.‏ وَاقْتَصَّ الْحَدِيثَ بِمِثْلِهِ إِلَى قَوْلِهِ فَاسْتَمْتَعْتُ بِهَا ‏.‏ قَالَ شُعْبَةُ فَسَمِعْتُهُ بَعْدَ عَشْرِ سِنِينَ يَقُولُ عَرَّفَهَا عَامًا وَاحِدًا ‏.‏",
        "translations": {
          "en": "Shu'ba reported:Salama b. Kuhail informed me or he informed people and I was among them. He said: I heard Sawaid b. Ghafala who reported: I went out along with Zaid b. Suhan and Salman b. Rabi'a, and found a whip, the rest of the hadith is the same up to the words:\" I made use of that.\" Shu'ba said: I heard him say after ten years, that he made an announcement of it for one year",
          "ur": "بہز نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : مجھے سلمہ بن کہیل نے خبر دی یا انہوں نے کچھ لوگوں کو خبر دی اور میں بھی ان میں ( شامل ) تھا ، انہوں نے کہا : میں نے سوید بن غفلہ سے سنا ، انہوں نے کہا : میں زید بن صُوحان اور سلمان بن ربیعہ کے ساتھ ( سفر پر ) نکلا ، مجھے ایک کوڑا ملا ۔ ۔ انہوں نے اسی ( سابقہ روایت ) کے مانند اس قول تک حدیث بیان کی : \" پھر میں نے اسے استعمال کیا ۔ \" شعبہ نے کہا : میں نے دس سال بعد ان سے سنا ، وہ کہہ رہے تھے : انہوں ان سے سنا ، وہ کہہ رہے تھے : انہوں نے ایک سال اس کی تشہیر کی تھی",
          "fr": "Rapporté par Shu’ba : Salama ibn Kuhail m’a informé, ou il a informé des gens parmi lesquels j’étais. Il a dit : J’ai entendu Sowaid ibn Ghafala qui a rapporté : Je suis parti avec Zayd ibn Suhan et Salman ibn Rabi’a, et j’ai trouvé une cravache. Le reste du hadith est le même jusqu’aux mots : « Je l’ai utilisée. » Shu’ba a dit : Je l’ai entendu dire dix ans plus tard qu’il l’a annoncée pendant un an",
          "tr": "{…} Bana Abdurrahmân b. Bişr El-Abdî dahî rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Baha Seleme b. Küheyl haber verdi; yahut ben de içlerinde olduğum halde cemaata haber verdi. (Dediki): Süveyd b. Gafele'yi dinledim. Şunu söyledi: «Zeyd b. Sûhân ve Selmân b. Rabîa ile birlikte yola çıktım; ve bir kamçı buldum...» Ravi hadîsi: «Artık ben de onlardan istifâde ettim.» sözüne kadar yukarki hadis gibi rivayet etmiştir. Şu'be demiş ki: — Seleme'yi on sene sonra dinledim: «»Onları bir sene ilân etti.» diyordu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 4508,
      "arabicNumber": "1723.03",
      "book": 31,
      "hadithInBook": 10,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي جَمِيعًا، عَنْ سُفْيَانَ، ح وَحَدَّثَنِي مُحَمَّدُ، بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - يَعْنِي ابْنَ عَمْرٍو - عَنْ زَيْدِ، بْنِ أَبِي أُنَيْسَةَ ح وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، كُلُّ هَؤُلاَءِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ شُعْبَةَ ‏.‏ وَفِي حَدِيثِهِمْ جَمِيعًا ثَلاَثَةَ أَحْوَالٍ إِلاَّ حَمَّادَ بْنَ سَلَمَةَ فَإِنَّ فِي حَدِيثِهِ عَامَيْنِ أَوْ ثَلاَثَةً ‏.‏ وَفِي حَدِيثِ سُفْيَانَ وَزَيْدِ بْنِ أَبِي أُنَيْسَةَ وَحَمَّادِ بْنِ سَلَمَةَ ‏\"‏ فَإِنْ جَاءَ أَحَدٌ يُخْبِرُكَ بِعَدَدِهَا وَوِعَائِهَا وَوِكَائِهَا فَأَعْطِهَا إِيَّاهُ ‏\"‏ ‏.‏ وَزَادَ سُفْيَانُ فِي رِوَايَةِ وَكِيعٍ ‏\"‏ وَإِلاَّ فَهِيَ كَسَبِيلِ مَالِكَ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ ‏\"‏ وَإِلاَّ فَاسْتَمْتِعْ بِهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Salama b. Kuhail through different chains of transmitters. In their ahadith, it is three years, except in the hadith of Hammid b. Salama it is two years or three years. In the hadith transmitted on the authority of Sufyan and Zaid b. Abu Unaisa and Hammid b. Salama (the words are):\" If someone comes and informs you about the number (of articles) of the bag and the straps, then give that to him.\" Sufyan has made this addition in the narration of Waki':\" Otherwise it is like your property.\" And in the narration of Ibn Numair the words are:\" Otherwise make use of that",
          "ur": "قتیبہ بن سعید نے کہا : ہمیں جریر نے اعمش سے حدیث بیان کی ۔ ابوبکر بن ابی شیبہ نے کہا : ہمیں وکیع نے حدیث بیان کی ۔ ابن نمیر نے کہا : ہمیں میرے والد نے حدیث بیان کی ، وکیع اور عبداللہ بن نمیر نے سفیان سے روایت کی ۔ محمد بن حاتم نے کہا : ہمیں عبداللہ بن جعفر رَقی نے حدیث بیان کی ، کہا : ہمیں عبیداللہ بن عمر نے زید بن ابی انیسہ سے حدیث بیان کی ۔ عبدالرحمٰن بن بشر نے کہا : ہمیں بہز نے حدیث بیان کی ، کہا : ہمیں حماد بن سلمہ نے حدیث بیان کی ، ان سب ( اعمش ، سفیان ، زید بن ابی انیسہ اور حماد بن سلمہ ) نے سلمہ بن کہیل سے اسی سند کے ساتھ شعبہ کی حدیث کی طرح حدیث بیان کی ۔ حماد بن سلمہ کے سوا ، ان سب کی حدیث میں تین سال ہیں اور ان ( حماد ) کی حدیث میں دو یا تین سال ہیں ۔ سفیان ، زید بن ابی انیسہ اور حماد بن سلمہ کی حدیث میں ہے : \" اگر کوئی ( تمہارے پاس ) آ کر تمہیں اس کی تعداد ، تھیلی اور بندھن کے بارے میں بتا دے تو وہ اسے دے دو ۔ \" وکیع کی روایت میں سفیان نے یہ اضافہ کیا : \" ورنہ وہ تمہارے مال کے طریقے پر ہے ۔ \" اور ابن نمیر کی روایت میں ہے : \" اور اگر نہیں ( آیا ) تو اسے فائدہ اٹھاؤ",
          "fr": "Rapporté par Salama ibn Kuhail : Ce hadith a été rapporté par différentes chaînes de transmetteurs. Dans leurs versions, il est mentionné trois ans, sauf dans le hadith de Hammid ibn Salama où il est dit deux ou trois ans. Dans le hadith transmis par Sufyan, Zayd ibn Abu Unaisa et Hammid ibn Salama, il est dit : « Si quelqu’un vient et te donne le nombre d’objets dans le sac et la corde, rends-les-lui. » Sufyan a ajouté dans la narration de Waki’ : « Sinon, c’est comme ta propriété. » Et dans la narration d’Ibn Numair, il est dit : « Sinon, utilise-la. »",
          "tr": "Bize Kuteybetü'bnü Said de rivayet etti. (Dediki): Bize Cerîr, A'meş'den naklen rivayet etti. H. Bize Ebû Bekir b. Ebi Şeybe dahî rivayet etti. (Dediki): Bize Veki' rivayet etti. H. Bize ibni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. Bu râvilerin hepsi Süfyân'dan rivayet etmişlerdir. H. Bana Muhammed b. Hatim dahî rivayet etti. (Dediki): Bize Abdullah b. Ca'fer Er-Rakkî rivayet etti. (Dediki): Bize Ubeydullah (yâni İbni Amr Zeyd b. Ebî Üneyse'den) rivayet eyledi. H. Bana Abdurrahmân b. Bişr de rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Hammâd b. Seleme rivayet etti. Bu râvilerin hepsi Seleme b. Küheyl'den bu isnadla Şu'be Hadîsi gibi rivayette bulunmuşlardır. Her birinin hadîsinde «üç sene» kaydı vardır. Yalnız Hammâd b. Seleme müstesna! Zîrâ onun hadîsinde: -İki veya üç sene» kaydı vardır. Süfyân, Zeyd b. Ebî Üneyse ve Hammâd b. Seleme hadîsinde: «Şayet sana biri gelir, onun sayısını, mahfazasını ve bağını haber verirse onu kendisine veriver!» ifâdesi vardır. Vekî'in rivayetinde Süfyân: «Aksi takdirde o senin malının sebili gibidir.» cümlesini ziyâde eylemiştir. İbni Numeyr'in rivayetinde ise: «Aksi takdirde ondan (kendin) istifâde et!» cümlesi vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 4509,
      "arabicNumber": "1724",
      "book": 31,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ لُقَطَةِ الْحَاجِّ ‏.‏",
        "translations": {
          "en": "Abd al-Rahman b. 'Uthman al-Taimi reported that Allah's Messenger (ﷺ) forbade taking into custody the stray thing of the pilgrims",
          "ur": "حضرت عبدالرحمان بن عثمان تیمی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حاجیوں کی گری پڑی چیز اٹھانے سے منع فرمایا",
          "fr": "Rapporté par Abd al-Rahman ibn Uthman al-Taimi : Le Messager d’Allah ﷺ a interdit de prendre en charge les objets perdus des pèlerins",
          "id": "Telah menceritakan kepadaku [Abu At Thahir] dan [Yunus bin Abdul A'la] keduanya berkata; telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Amru bin Al Harits] dari [Bukair bin Abdullah Al Asyaj] dari [Yahya bin Abdurrahman bin Hathib] dari [Abdurrahman bin 'Utsman At Taimi], bahwa Rasulullah shallallahu 'alaihi wasallam melarang mengambil barang temuan (jamaah) haji",
          "tr": "Bana Ebû't-Tahir ile Yûnus b. Abdüâlâ rivayet ettiler. (Dedilerki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana Amr b. Haris, Bukeyr b. Abdillâh b. Eşecc'den, o da Yahya b. Abdirrahmân b. Hâtıb'dan, o da Abdurrahmân b. Osman b. Et-Teymî'den naklen haber verdiki, Resûlullah (Sallallahu Aleyhi ve Sellem) hacının lukatasından nehî buyurmuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 4510,
      "arabicNumber": "1725",
      "book": 31,
      "hadithInBook": 12,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بَكْرِ بْنِ سَوَادَةَ، عَنْ أَبِي سَالِمٍ الْجَيْشَانِيِّ، عَنْ زَيْدِ بْنِ خَالِدٍ، الْجُهَنِيِّ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ مَنْ آوَى ضَالَّةً فَهُوَ ضَالٌّ مَا لَمْ يُعَرِّفْهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Zaid b. Khalid al-Juhani reported Allah's Messenger (ﷺ) as sayin.:He who found a stray article is himself led astray if he does not advertise it",
          "ur": "حضرت زید بن خالد جہنی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" جس نے ( کسی کے ) بھٹکتے ہوئے جانور ( اونٹنی ) کو اپنے پاس رکھ لیا ہے تو وہ ( خود ) بھٹکا ہوا ہے جب تک اس کی تشہیر نہیں کرتا",
          "fr": "Rapporté par Zayd ibn Khalid al-Juhani : Le Messager d’Allah ﷺ a dit : « Celui qui trouve un objet perdu s’égare lui-même s’il ne le signale pas. »",
          "id": "Dan telah menceritakan kepadaku [Abu At Thahir] dan [Yunus bin Abdul A'la] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Wahb] dia berkata; telah mengabarkan kepadaku ['Amru bin Harits] dari [Bakr bin Sawadah] dari [Abu Salim Al Jaisyani] dari [Zaid bin Khalid Al Juhani] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa menyembunyikan barang temuan (emas atau perak), maka dia bersalah selama tidak mengumumkannya",
          "tr": "Bana Ebû't-Tâhir ile Yûnus b. Abdilâlâ da rivayet ettiler. (Dedilerki): Bize Abdullah b. Vehb rivayet etti. (Dediki): Bana Amr b. Haris, Bekir b. Sevâde'den, o da Ebû Salim El-Ceyşânî'den, o da Zeyd b. Hâlid El-Cühenî'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi ki: «Her kim kayıb bir hayvanı evine kaparsa onu i'Iân etmedikçe kendisi kayıptır.» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 4511,
      "arabicNumber": "1726.01",
      "book": 31,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ فَيُنْتَقَلَ طَعَامُهُ إِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَتَهُمْ فَلاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said this:None (of you) should milk the animal of another, but with his permission. Does any one of you like that his chamber be raided, and his vaults be broken, and his foodstuff be removed? Verily the treasures for them (those who keep animals) are the udders of the animals which feed them. So none of you should milk the animal of another but with his permission",
          "ur": "عبداﷲ بن عمر رضی ‌اللہ ‌عنہ سے روایت ہے جناب رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا کوئی تم میں سے دوسرے کے جانور کا دودھ نہ دھوئے مگر اس کی اجازت سے۔ کیا تم میں کوئی یہ چاہتا ہے کہ اس کی کوٹھری میں کوئی آئے اور اس کا خزانہ توڑ کر اس کے کھانے کا غلہ نکال لے جائے؟ اسی طرح جانوروں کے تھن ان کے خزانے ہیں کھانے کو تو کوئی نہ دوھوہے کسی کے جانور کا دودھ بغیر اس کی اجازت کے۔ ( مگر جو مرتا ہو مارے بھوک کے وہ بقدر ضرورت کے دوسرے کا کھانا بعیر اجازت کے کھا سکتا ہے۔ لیکن اس پر قیمت لازم ہوگی اور بعض سلف اور محدثین کے نزدیک لازم نہ ہوگی۔ اگر مردار بھی موجود ہو تو اس میں اختلاف ہے۔ بعضوں کے نزدیک مردار کھالے اور بعضوں کے نزدیک غیر کا کھانا۔)",
          "fr": "Rapporté par Ibn 'Umar رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Aucun de vous ne doit traire l’animal d’autrui sans sa permission. Est-ce que l’un de vous aimerait qu’on entre de force dans sa chambre, qu’on brise ses coffres et qu’on emporte sa nourriture ? En vérité, les trésors de ceux qui possèdent des animaux sont les pis de ces bêtes qui les nourrissent. Donc, aucun de vous ne doit traire l’animal d’autrui sans sa permission. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dia berkata; aku bacakan di hadapan [Malik bin Anas]; dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian memeras susu ternak orang lain kecuali minta izin darinya, sukakah salah seorang dari kalian jika wadah airnya diberikan namun tempat penyimpanannya dipecahkan serta makanannya dipindahkan? Hanyasanya kantung-kantung susu kambing merekalah yang menjadi tempat penyimpanan makanan mereka, maka jangan sekali-kali salah seorang dari kalian memerah susu ternak orang lain tanpa izin pemiliknya.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Rumh] semuanya dari [Laits bin Sa'd]. (dalam riwayat lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir]. (dalam riwayat lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepadaku [ayahku] keduanya dari [Ubaidullah]. (dalam riwayat lain disebutkan) Telah menceritakan kepadaku [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; telah menceritakan kepada kami [Hammad]. (dalam riwayat lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] -yaitu Ibnu 'Ulayyah- semuanya dari [Ayyub]. (dalam riwayat lain disebutkan) Telah menceritakan kepada kami [Ibnu Abu 'Umar] telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Umayyah]. (dalam riwayat lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Ayyub] dan [Ibnu Juraij] dari [Musa] mereka semua dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits Malik, hanya saja hadits mereka semua disebutkan, 'hendaknya dia memberikan sebagian makanannya', kecuali riwayat Laits bin Sa'd disebutkan, 'hendaknya memberikan makanannya', sebagaimana riwayat Malik",
          "tr": "{…} Bize bu hadîsi Kuteybetü'bnü Saîd ile Muhammed b. Rumh dahî hep birden Leys b. Sa'd'dan rivayet ettiler. H. Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Aliy b. Müshir rivayet etti. H. Bize İbnü Numeyr dahi rivayet etti. (Dediki): Bana babam rivayet etti. Her iki râvi Ubeydullah'dan rivayet etmişlerdir. H. Bana Ebû'r-Rabî' ile Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd rivayet etti. H. Bana Züheyr b. Harb da rivayet etti. (Dediki): Bize İsmâîl (yâni îbni Uleyye) rivayet etti. Bu râviler toptan Eyyûb'dan rivayet etmişlerdir. H. Bize İbni Ebî Ömer dahî rivayet etti. (Dediki): Bize Süfyân, İsmail b, Ümeyye'den naklen rivayet etti. H. Bize Muhammed b. Râfi' de rivayet etti. (Dediki): Bize Abdürrazzâk, Ma'mer'den, o da Eyyûb'dan, İbni Cüreyc dahî Musa'dan naklen rivayet etti. Bu râvilerin hepsi Nâfi'den, o da İbni Ömer'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen Mâlik'in hadîsi gibi rivayette bulunmuşlardır. Şu kadar varki her birinin hadîsinde «Fe yünte-sele» denilmiştir. Yalnız Leys b. Sa'd müstesna! Çünkü onun hadîsinde Mâlik'in rivayetinde olduğu gibi «fe* yüntekalü taâmuh» ibaresi vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 4512,
      "arabicNumber": "1726.02",
      "book": 31,
      "hadithInBook": 14,
      "text": {
        "arabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنِي أَبِي كِلاَهُمَا، عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنِي أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - جَمِيعًا عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ،عَنْ أَيُّوبَ، وَابْنُ، جُرَيْجٍ عَنْ مُوسَى، كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ نَحْوَ حَدِيثِ مَالِكٍ غَيْرَ أَنَّ فِي حَدِيثِهِمْ جَمِيعًا ‏\"‏ فَيُنْتَثَلَ ‏\"‏ ‏.‏ إِلاَّ اللَّيْثَ بْنَ سَعْدٍ فَإِنَّ فِي حَدِيثِهِ ‏\"‏ فَيُنْتَقَلَ طَعَامُهُ ‏\"‏ ‏.‏ كَرِوَايَةِ مَالِكٍ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated through another chain of transmitters with a slight variation of words",
          "ur": "مذکورہ بالا حدیث اس سند سے بھی مروی ہے",
          "fr": "Ce hadith a été rapporté par une autre chaîne de transmetteurs avec une légère variation dans les mots",
          "tr": "Bu hadîsi Buhâri «lukata» bahsinde; Ebû Dâvûd «Cihad»da tahrîc etmişlerdir. Mâşiye: Deve, sığır, koyun, keçi mânâlarına gelirse de ekseriyetle koyun hakkında kullanılır. Meşrube ve meşrabe: İçerisinde zahire ve eşya muhafaza edilen kilerdir. Bu kelime hassaten meşrabe şeklinde kullanılırsa, su yeri; mişrabe de su kabı mânâsına gelir. Hızâne muhafazası istenilen şeyin yeri veya kabıdır. Fe yüntesele: Saçılmasını demektir. Bu kelime birinci rivayetteki «aşırılmasını» kelimesinin yerine kullanılmıştır. Duru': Dır'ın cem'idir. Dır' hayvanın yelini yâni sütünün toplandığı yerdir. Resulü Ekrem (Sallallahu Aleyhi ve Sellem) hayvanın yelinindeki sütü, kiler veya anbarda saklanan zahireye benzetmiştir. Yâni bir kimsenin izni olmaksızın anbarındaki zahiresini almak nasıl helâl değilse, davarının sütünü sağmak da helâl değildir. Bu hususta hurma, üzüm ve karpuz gibi şeylerin hüküm i'tibari ile sütten bir farkı yoktur. Ancak süt meselesinde insanlar daha lâkayıd davrandıkları için hassaten zikredilmiştir. Kurtubi diyor ki: «Cumhura göre sahibinin rızâsı olmadan ne davarın sütünden bir şey helâl olur ne de hurmadan! Bâzıları sahibinin haberi olmasa da bu gibi şeylerin helâl sayılacağını söylemiş; ve: Çünkü bu Şâri' hazretlerinin ona bahşettiği bir haktır; demişlerdir...» Sahibinden izin almadan onun davarını sağmayı, yemişinden yemeyi mubah hatta bir hak sayanlar bâzı hadîslerle istidlal ederler. Şöyle ki: Ebû Davud'un Semûra (Radiyallahu anh}'dan tahrîc ettiği bîr hadîste Nebi (Sallallahu Aleyhi ve Sellem): «Bîriniz bir davar sürüsünün yanına vardığı zaman şayet sahibi orada ise ondan izin istesin! Kendisine izin verirse ne âlâ! Vermezse hemen davarı sağıp sütünü içsin! Sahibi orada yoksa üç defa seslensin! Cevap verirse ondan izin istesin! İzin verirse ne âlâ! Vermezse hemen davarı sağıp sütünü içsin! Ama alıp götürmesin!» buyurmuşlardır. Bu hadîsi Tirmizi dahî rivayet etmiş; ve: «Semûra hadîsi hasen garîb, sahîh bir hadîstir. Ulemadan bazıları bununla âmel etmişlerdir...» demiştir. Filhakika İmam Ahmed'le îshâk'ın mezhepleri budur. Tirmizî ile ibni Mâce'nin «Sünen»lerinde buna benzer rivayetler vardır. Bunların birinde süt meselesinden sonra: «Bir bahçeye geldiğin vakit üç defa haykır! Şayet sana icabet ederse ne âlâ! Etmezse ifsad etmemek şartı ile hemen ye!» Buyurulmaktadır. Bir delilleri de hicret esnasında Nebi (Sallallahu Aleyhi ve Sellem) ile Hz. Ebû Bekr'in bir çobanın koyunlarından süt içmeleridir. Hanefîlerle, Şâfiîler'e, Mâlikıler'e ve cumhûr-u ulemâya göre izinsiz hiç bir kimse birinin bağ ve bahçesinden yemiş yiyemez; davarının sütünü içemez. Meğer ki muztar kala! O zaman zaruret miktarı yiyip içebilir. Bu zevat cevaz bildiren hadîsler hakkında muhtelif yönlerden cevaplar vermişlerdir. a) Kurtubî: «Malûm kaide ile amel etmek daha iyidir.» demiştir. b) Nehî bildiren hadîs, cevaz hadîsinden daha sahihtir. c) Cevaz bildiren hadîsler âdete nazaran mal sahiplerinin razı olduklarının bilinmesine hamledilirler. d) Cevaz meselesi zaruret zamanlarına hamledilir. Nitekim islâm'ın ilk zamanlannda hâl böyle idi. Bu hususta Tahâvi de şunları söylemiştir: «Bu hadîsler misafir kabul etmenin vâcib olduğu zamanlara mahsustur. Resûlullah (Sallallahu Aleyhi ve Sellem) bunu emir buyurmuş; gelen misafir için hane sahibine vacip kılmıştır. Bilâhare vücup neshedilerek hükmü kaldırılınca adı geçen hadîslerin hükmü de kalkmıştır.» Hicret esnasında Nebi (Sallallahu Aleyhi ve Sellem) ile Hz. Ebû Bekr'in içtikleri süt hakkmda Kurtubî: «Bu Koyun sahibine bir idlâl (yâni nazı geçme) idî. Çünkü Hz. Ebû Bekir onu tanıyordu. Yahut o çobanın oradan geçenlere süt takdim edilmesine izin verdiğini bilirdi. Yahut o süt, kendisine emân verilmemiş bir harbîye ait olduğu için içmişlerdi...» diyor. Bu hususta daha başka sözler de söylenmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 4513,
      "arabicNumber": "48.02",
      "book": 31,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ سَمِعَتْ أُذُنَاىَ، وَأَبْصَرَتْ، عَيْنَاىَ حِينَ تَكَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتَهُ ‏\"‏ ‏.‏ قَالُوا وَمَا جَائِزَتُهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ يَوْمُهُ وَلَيْلَتُهُ وَالضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ فَمَا كَانَ وَرَاءَ ذَلِكَ فَهُوَ صَدَقَةٌ عَلَيْهِ - وَقَالَ - مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abd Shuraib al-Adawi reported:My eare listened and my eye saw when Allah's Messenger (ﷺ) spoke and said: He who believes In Allah and the eireafter should show respect to the guest even with utmost kindness and courtesy. They said: Messenger of Allah, what is this utmost kindness and courtesy? He replied: It is for a day and a night. Hospitality extends for three days, and what is beyond that is a Sadaqa for him; and he who believes in Allah and the Hereafter should say something good or keep quiet",
          "ur": "لیث نے سعید بن ابی سعید سے ، انہوں نے ابو شریح عدوی سے روایت کی ، انہوں نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم نے گفتگو کی ، تو میرے دونوں کانوں نے سنا اور میری دونوں آنکھوں نے دیکھا ، آپ نے فرمایا : \" جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہے وہ اپنے مہمان کو ، جو پیش کرتا ہے ، اس کو لائق عزت بنائے ۔ \" صحابہ نے پوچھا : اے اللہ کے رسول! اس کو جو پیش کیا جائے ، وہ کیا ہے؟ آپ نے فرمایا : \" اس کے ایک دن اور ایک رات کا اہتمام اور مہمان نوازی تین دن ہے ، جو اس سے زائد ہے وہ اس پر صدقہ ہے ۔ \" اور آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ اور یومِ آخرت پر ایمان رکھتا ہے وہ اچھی بات کہے یا خاموش رہے",
          "fr": "Rapporté par Abd Shuraib al-Adawi : J’ai entendu de mes oreilles et vu de mes yeux quand le Messager d’Allah ﷺ a parlé et a dit : « Celui qui croit en Allah et au Jour dernier doit honorer son invité, même avec la plus grande gentillesse et courtoisie. » Ils ont demandé : « Ô Messager d’Allah, qu’est-ce que cette plus grande gentillesse et courtoisie ? » Il a répondu : « C’est pour un jour et une nuit. L’hospitalité dure trois jours, et ce qui dépasse cela est une aumône pour lui. Et celui qui croit en Allah et au Jour dernier doit dire du bien ou se taire. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Sa'id bin Abu Sa'id] dari [Abu Syuraih Al 'Adawi] bahwa dia berkata, \"Aku telah mendengar dengan kedua telingaku dan melihat dengan kedua mataku, ketika Rasulullah shallallahu 'alaihi wasallam mengucapkan sabdanya: \"Barangsiapa beriman kepada Allah dan hari akhir maka hendaklah memuliakan tamu dan menjamunya?\" mereka bertanya, \"Apa yang dimaksud dengan menjamunya wahai Rasulullah?\" beliau menjawab: \"Yaitu pada siang dan malam harinya, bertamu itu tiga hari, lebih dari itu adalah sedekah bagi tamu tersebut.\" Dan beliau bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir, hendaknya dia berkata dengan perkataan yang baik atau diam",
          "tr": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den, o da Ebû Şüreyh El-Adevî'den naklen rivayet etti ki, şöyle demiş : ResûluIIah (Sallallahu Aleyhi ve Sellem) konuşurken kulaklarım duydu ve gözlerim gördü; buyurdular ki: «Her kîm Allah'a ve son güne îmân ediyorsa misafirine caizesini ikram etsin!» Ashab: — Onun caizesi nedir yâ Resûlâllah? dediler. «Günü ile gecesîdir. Misafirlik üç gündür. Bundan ötesi ona sadakadır.» buyurdu. Birde: «Her kim Allah'a ve son güne îmân ediyorsa (ya) hayır söylesin yahut sussun!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 4514,
      "arabicNumber": "48.03",
      "book": 31,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ وَجَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَلاَ يَحِلُّ لِرَجُلٍ مُسْلِمٍ أَنْ يُقِيمَ عِنْدَ أَخِيهِ حَتَّى يُؤْثِمَهُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ يُؤْثِمُهُ قَالَ ‏\"‏ يُقِيمُ عِنْدَهُ وَلاَ شَىْءَ لَهُ يَقْرِيهِ بِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Shuriah al-Khuza'i reported Allah's Messenger (ﷺ) as saying:(The period of the entertainment of a guest is three days, and utmost kindness and courtesy is for a day and a night. =\" It is not permissible for a Muslim to stay with, his brother until he makes him sinful. They said: Messenger of Allah, how he would make him sinful? He (the Holy Prophet) said: He stays with him (so long) that nothing is left with him to entertain him",
          "ur": "وکیع نے کہا : ہمیں عبدالحمید بن جعفر نے سعید بن ابی سعید مقبری سے حدیث بیان کی ، انہوں نے ابوشریح خزاعی سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مہمان نوازی تین دن ہے اور خصوصی اہتمام ایک دن اور ایک رات کا ہے اور کسی مسلمان آدمی کے لیے حلال نہیں کہ وہ اپنے بھائی کے ہاں ( ہی ) ٹھہرا رہے حتی کہ اسے گناہ میں مبتلا کر دے ۔ \" صحابہ نے پوچھا : اے اللہ کے رسول! وہ اسے گناہ میں کیسے مبتلا کرے گا؟ آپ نے فرمایا : \" وہ اس کے ہاں ٹھہرا رہے اور اس کے پاس کچھ نہ ہو جس سے وہ اس کی میزبانی کر سکے ( تو وہ غلط کام کے ذریعے سے اس کی میزبانی کا انتظام کرے)",
          "fr": "Rapporté par Abu Shuriah al-Khuza'i : Le Messager d’Allah ﷺ a dit : « La durée de l’hospitalité pour un invité est de trois jours, et la plus grande gentillesse et courtoisie est pour un jour et une nuit. » Il n’est pas permis à un musulman de rester chez son frère au point de le mettre dans le péché. Ils ont demandé : « Ô Messager d’Allah, comment pourrait-il le mettre dans le péché ? » Il a répondu : « C’est en restant chez lui jusqu’à ce qu’il ne lui reste plus rien pour l’accueillir. »",
          "tr": "Bize Ebû Kureyb Muhammed b. El-Alâ' rivayet etti. (Dediki): Bize Vekî' rivayet etti. (Dediki): Bize Abdülhamîd b. Cafer, Said b. Ebî Saîd EI-Makburî'den, o da Ebû Şüreyh El-Huzâî'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Misafiriik üç gündür. Misafirin caizesi de bir gün bir gecedir. Müslüman bîr adama dîn kardeşinin yanında onu günaha sokacak kadar (fazla) kalması helâl olmaz!..» buyurdu. Ashâb: — Yâ Resûlâllah, onu nasıl günaha sokar? dediler. «Onun yanında oturur kalır; kendisini ağırlayacak bir şeyi de yoktur!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 4515,
      "arabicNumber": "48.04",
      "book": 31,
      "hadithInBook": 17,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو بَكْرٍ، - يَعْنِي الْحَنَفِيَّ - حَدَّثَنَا عَبْدُ الْحَمِيدِ، بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، أَنَّهُ سَمِعَ أَبَا شُرَيْحٍ الْخُزَاعِيَّ، يَقُولُ سَمِعَتْ أُذُنَاىَ، وَبَصُرَ، عَيْنِي وَوَعَاهُ قَلْبِي حِينَ تَكَلَّمَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ اللَّيْثِ وَذَكَرَ فِيهِ ‏ \"‏ وَلاَ يَحِلُّ لأَحَدِكُمْ أَنْ يُقِيمَ عِنْدَ أَخِيهِ حَتَّى يُؤْثِمَهُ ‏\"‏ ‏.‏ بِمِثْلِ مَا فِي حَدِيثِ وَكِيعٍ ‏.‏",
        "translations": {
          "en": "Sa'id al-Maqburi reported:I heard Abu Shuraih al-Khuzill saying: My ears heard and my eyes saw and my mind retained it, when Allah's Messenger (ﷺ) spok this, and he then narrated the hadith and made mention of this:\" It is not permissible for any one of you to stay with his brother until he makes him sinful",
          "ur": "ابوبکر حنفی نے کہا : ہمیں عبدالحمید بن جعفر نے حدیث بیان کی ، کہا : مجھے سعید مقبری نے حدیث بیان کی کہ انہوں نے ابوشریح خزاعی رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : میرے دونوں کانوں نے سنا اور میری آنکھ نے دیکھا اور میرے دل نے یاد رکھا جب رسول اللہ صلی اللہ علیہ وسلم نے یہ گفتگو فرمائی ۔ ۔ ( آگے ) لیث کی حدیث کی طرح بیان کیا اور اس میں یہ ذکر کیا : \" تم میں سے کسی کے لیے حلال نہیں کہ اپنے بھائی کے ہاں ٹھہرا رہے حتی کہ اسے گناہ میں ڈال دے ۔ \" اسی کے مانند جس طرح وکیع کی حدیث میں ہے",
          "fr": "Rapporté par Sa'id al-Maqburi : J’ai entendu Abu Shuraih al-Khuza'i dire : « Mes oreilles ont entendu, mes yeux ont vu et mon esprit s’en souvient, lorsque le Messager d’Allah ﷺ a dit cela. » Puis il a rapporté le hadith et a mentionné ceci : « Il n’est pas permis à l’un de vous de rester chez son frère jusqu’à le mettre dans le péché. »",
          "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al Khuza'i] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bertamu itu selama tiga hari, dan pelayanannya selama siang atau malam hari. Tidak halal bagi seorang muslim bermukim di rumah saudaranya sampai saudaranya berdosa karenanya.\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana dia bisa berdosa?\" beliau menjawab: \"Dia bermukim di rumah saudaranya hingga saudaranya tidak punya apa-apa lagi untuk menjamunya.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Bakar] -yaitu Al Hanafi- telah menceritakan kepada kami [Abdul Hamid bin Ja'far] telah menceritakan kepada kami [Sa'id Al Maqbury] bahwa dia mendengar [Abu Syuraih Al Khuza'i] berkata, \"Aku mendengar sendiri dengan kedua telingaku, melihat dengan kedua mataku dan hatiku ketika Rasulullah shallallahu 'alaihi wasallam mengucapkan sabdanya…kemudian dia menyebutkan seperti haditsnya Laits, dan dalam hadits tersebut ia menyebutkan, \"Dan tidak dihalalkan salah seorang dari kalian bermukim di tempat saudaranya hingga saudaranya berdosa karenanya…seperti hadits riwayat Waki",
          "tr": "Bize bu hadîsi Muhammed b. El-Müsennâ da rivayet etti. (Dediki): Bize Ebû Bekir (yâni El-Hanefî) rivayet etti. (Dediki): Bize Abdülhamîd b. Ca'fer rivayet etti. (Dediki): Bize Saîd El-Makburî ri­vayet etti. Kendisi Ebû Şüreyh El-Huzâî'yi şöyle derken İşitmiş: «Resûlullah (Sallallahu Aleyhi ve Sellem) bunu söylerken kulaklarım duydu, gözüm gördü ve kalbim belledi...» Müteakiben râvi, Leys'in hadîsi gibi nakletmiştir. Bu hadîste o Vekî'in hadîsinde olduğu gibi: «Hiç birinize dîn kardeşinin yanında onu günaha sokacak kadar katması helâl olmaz!» cümlesini de zikretti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 4516,
      "arabicNumber": "1727",
      "book": 31,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّهُ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ فَلاَ يَقْرُونَنَا فَمَا تَرَى فَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا فَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ الَّذِي يَنْبَغِي لَهُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Uqba b. Amir reported:We said to Allah's Messenger (ﷺ): You send us out and we come to the people who do not give us hospitality, so what is your opinion? Thereupon Allah's Messenger (ﷺ) said: If you come to the people who order for you what is befitting a guest, accept it; but if they do not. take from them what befits them to give to a guest",
          "ur": "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : ہم نے عرض کی : اے اللہ کے رسول! آپ ہمیں کسی ( اہم کام کے لیے ) روانہ کرتے ہیں ، ہم کچھ لوگوں کے ہاں اترتے ہیں تو وہ ہماری مہمان نوازی نہیں کرتے ، آپ کی رائے کیا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فرمایا : \" اگر تم کسی قوم کے ہاں اترو اور وہ تمہارے لیے ایسی چیز کا حکم دیں جو مہمان کے لائق ہے تو قبول کر لو اور اگر وہ ایسا نہ کریں تو ان سے مہمان کا اتنا حق لے لو جو ان ( کی استطاعت کے مطابق ان ) کے لائق ہو ۔",
          "fr": "Rapporté par 'Uqba b. Amir : Nous avons dit au Messager d’Allah ﷺ : « Tu nous envoies chez des gens qui ne nous offrent pas l’hospitalité, qu’en penses-tu ? » Le Messager d’Allah ﷺ a répondu : « Si vous allez chez des gens qui vous offrent ce qui convient à un invité, acceptez-le. Mais s’ils ne le font pas, prenez d’eux ce qui est dû à un invité. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] bahwa dia berkata, \"Kami pernah bertanya, \"Wahai Rasulullah, sesungguhnya anda mengirim kami, lalu kami singgah di suatu kaum sebagai tamu, akan tetapi mereka tidak melayani kami sebagaimana layaknya, bagaimana menurut anda?\" maka Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami: \"Jika kalian singgah di suatu kaum, lalu mereka melayani kalian sebagaimana layaknya seorang tamu maka terimalah layanan mereka. Jika mereka tidak melayani kalian, maka kalian boleh mengambil dari mereka hak tamu yang pantas mereka berikan",
          "tr": "Bize Kuteybetü'bnü Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys, Yezîd b. Eb! Habîb'ten, o da Ebû'l-Hayr'dan, o da Ukbetü'bnü Amir'den naklen haber verdiki, şunları söylemiş: Biz: — Yâ Resûlâllah! Sen bizi gönderiyorsun; biz de bir kavme misafir oluyoruz; ama onlar bize ikramda bulunmuyorlar; ne buyurursun? dedik. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) bize : «Bir kavme misafir olur da sizin için misafire yaraşan şeyleri emrederlerse kabul edin ! Bunu yapmazlarsa kendilerine yaraşan misafir hakkını onlardan alın !» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 4517,
      "arabicNumber": "1728",
      "book": 31,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو الأَشْهَبِ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَمَا نَحْنُ فِي سَفَرٍ مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ عَلَى رَاحِلَةٍ لَهُ قَالَ فَجَعَلَ يَصْرِفُ بَصَرَهُ يَمِينًا وَشِمَالاً فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَ مَعَهُ فَضْلُ ظَهْرٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لاَ ظَهْرَ لَهُ وَمَنْ كَانَ لَهُ فَضْلٌ مِنْ زَادٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لاَ زَادَ لَهُ ‏\"‏ ‏.‏ قَالَ فَذَكَرَ مِنْ أَصْنَافِ الْمَالِ مَا ذَكَرَ حَتَّى رَأَيْنَا أَنَّهُ لاَ حَقَّ لأَحَدٍ مِنَّا فِي فَضْلٍ ‏.‏",
        "translations": {
          "en": "Abu Sa'id al-Khudri reported:While we were with the Messenger of Allah (ﷺ) on a journey, a person came upon his mount and began to stare on the right and on the left, (it was at this moment) that Allah's Messenger (ﷺ) said: He who has an extra mount should give that to one who has no mount for him, and he who has surplus of provisions should give them to him who has no provisions, and he made mention of so many kinds of wealth until we were of the opinion that none of us has any right over the surplus",
          "ur": "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : ہم نبی صلی اللہ علیہ وسلم کے ساتھ سفر میں تھے ، اس اثنا میں ایک آدمی اپنی سواری پر آپ کے پاس آیا ، کہا : پھر وہ اپنی نگاہ دائیں بائیں دوڑانے لگا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کے پاس ضرورت سے زائد سواری ہو ، وہ اس کے ذریعے سے ایسے شخص کے ساتھ نیکی کرے جس کے پاس سواری نہیں ہے اور جس کے پاس زائد از ضرورت زادِ راہ ہے وہ اس کے ذریعے سے ایسے شخص کی خیرخواہی کرے جس کے پاس زاد راہ نہیں ہے ۔ کہا : آپ نے مال کی بہت سی اقسام کا ذکر کیا جس طرح کیا ، حتی کہ ہم نے خیال کیا کہ زائد مال پر ہم میں سے کسی کا کوئی حق نہیں ہے",
          "fr": "Rapporté par Abu Sa'id al-Khudri : Alors que nous étions en voyage avec le Messager d’Allah ﷺ, un homme est arrivé sur sa monture et a regardé à droite et à gauche. À ce moment, le Messager d’Allah ﷺ a dit : « Celui qui a une monture en trop doit la donner à celui qui n’en a pas, et celui qui a des provisions en surplus doit les donner à celui qui n’en a pas. » Il a mentionné tant de types de biens que nous pensions qu’aucun de nous n’avait de droit sur ce qu’il possédait en trop",
          "id": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Abu Al Asyhab] dari [Abu Nashrah] dari [Sa'id Al Khudri] dia berkata, \"Ketika kami dalam perjalanan bersama-sama dengan Nabi shallallahu 'alaihi wasallam, tiba-tiba ada seorang laki-laki datang dengan mengendarai kendaraannya sambil menoleh ke kanan dan ke kiri, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang memiliki kelebihan tempat pada kendaraannya, hendaklah dia memberikannya kepada orang yang tidak memiliki tempat, dan siapa yang memiliki kelebihan perbekalan hendaklah dia memberikannya kepada orang yang tidak memiliki perbekalan.\" Abu Sa'id berkata, \"Lalu beliau menyebutkan golongan yang berhak mendapatkan harta sehingga kami melihat bahwa tidak ada lagi dari kami yang berhak mendapatkan kelebihan harta",
          "tr": "Bize Şeybân b. Ferrûh rivayet etti. (Dediki): Bize Ebû'l-Eşheb, Ebû Nadra'dan, o da Ebû Saîd-i Hudrî'den naklen rivayet etti. Şöyle demiş: Bir defa biz Nebi (Sallallahu Aleyhi ve Sellem)'le beraber bir seferde iken devesi üzerinde bir adam geliverdi. Ve gözünü sağa sola çevirmeye başladı. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Kimin yanında fazla hayvan varsa onu hayvanı olmayana versin! Ve kimin fazla azığı varsa onu azığı olmayana versin!» buyurdular. Râvi demiş ki: Mal çeşitlerinden söylediğini söyledi. Hattâ bir artan malda hiç birimizin hakkı olmadığı düşüncesine vardık"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 4518,
      "arabicNumber": "1729",
      "book": 31,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا النَّضْرُ، - يَعْنِي ابْنَ مُحَمَّدٍ الْيَمَامِيَّ - حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ فَأَصَابَنَا جَهْدٌ حَتَّى هَمَمْنَا أَنْ نَنْحَرَ بَعْضَ ظَهْرِنَا فَأَمَرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَجَمَعْنَا مَزَاوِدَنَا فَبَسَطْنَا لَهُ نِطَعًا فَاجْتَمَعَ زَادُ الْقَوْمِ عَلَى النِّطَعِ قَالَ فَتَطَاوَلْتُ لأَحْزُرَهُ كَمْ هُوَ فَحَزَرْتُهُ كَرَبْضَةِ الْعَنْزِ وَنَحْنُ أَرْبَعَ عَشْرَةَ مِائَةً قَالَ فَأَكَلْنَا حَتَّى شَبِعْنَا جَمِيعًا ثُمَّ حَشَوْنَا جُرُبَنَا فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلْ مِنْ وَضُوءٍ ‏\"‏ ‏.‏ قَالَ فَجَاءَ رَجُلٌ بِإِدَاوَةٍ لَهُ فِيهَا نُطْفَةٌ فَأَفْرَغَهَا فِي قَدَحٍ فَتَوَضَّأْنَا كُلُّنَا نُدَغْفِقُهُ دَغْفَقَةً أَرْبَعَ عَشْرَةَ مِائَةً ‏.‏ قَالَ ثُمَّ جَاءَ بَعْدَ ذَلِكَ ثَمَانِيَةٌ فَقَالُوا هَلْ مِنْ طَهُورٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَرِغَ الْوَضُوءُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Iyas b. Salama reported on the authority of his father:We set out on an expedition with, Allah's Messenger (ﷺ). We faced hardship (in getting provisions) until we decided to slaughter some of our riding animals. Allah's Apostle (ﷺ), commanded us to pool our provisions of food. So we spread a sheet of leather and the provisions of the people were collected on it. I stretched myself to measure how much that was (the length and breadth of the sheet on which the provisions were laid). I measured it and (found) that it was (in length and breadth) of (so much size) on which a goat could sit. We were fourteen hundred persons. We (all) ate until we were fully satisfied and then filled our bags with provisions. Then Allah's Apostle (ﷺ) said: Is there any water for performing ablution. Then there came a man with a small bucket containing some water. He threw it in a basin. We all fourteen hundred persons performed ablution using the water in plenty. Then there came after that eight persons and they said: Is there any water to perform ablution? Thereupon Allah's Messenger (ﷺ) said: The ablution has already been performed",
          "ur": "ایاس بن سلمہ نے ہمیں اپنے والد حضرت سلمہ بن اکوع رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں نکلے ، ( راستے میں ) تنگی ( زاد راہ کی کمی ) کا شکار ہو گئے حتی کہ ہم نے ارادہ کر لیا کہ اپنی بعض سواریاں ذبح کر لیں ۔ اس پر نبی صلی اللہ علیہ وسلم نے حکم دیا تو ہم نے اپنا زادراہ اکٹھا کر لیا ۔ ہم نے اس کے لیے چمڑے کا دسترخوان بچھایا تو سب لوگوں کا زادراہ اس دسترخوان پر اکٹھا ہو گیا ۔ کہا : میں نے نگاہ اٹھائی کہ اندازہ کر سکوں کہ وہ کتنا ہے؟ تو میں نے اندازہ لگایا کہ وہ ایک بکری کے بیٹھنے کی جگہ کے بقدر تھا اور ہم چودہ سو آدمی تھے ۔ کہا : تو ہم نے کھایا حتی کہ ہم سب سیر ہو گئے ، پھر ہم نے اپنے ( خوراک کے ) تھیلے ( بھی ) بھر لیے ۔ اس کے بعد نبی صلی اللہ علیہ وسلم نے پوچھا : \"\" کیا وضو کے لیے پانی ہے؟ \"\" کہا : تو ایک آدمی اپنا ایک برتن لایا ۔ اس میں تھوڑا سا پانی تھا ، اس نے وہ ایک کھلے منہ والے پیالے میں انڈیلا تو ہم سب نے وضو کیا ، ہم چودہ سو آدمی اسے کھلا استعمال کر رہے تھے ۔ کہا : پھر اس کے بعد آٹھ افراد ( اور ) آئے ، انہوں نے کہا : کیا وضو کے لیے پانی ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" وضو کاپانی ختم ہو چکا",
          "fr": "Rapporté par Iyas b. Salama, d’après son père : Nous sommes partis en expédition avec le Messager d’Allah ﷺ. Nous avons eu du mal à trouver des provisions, au point de vouloir abattre nos montures. Le Messager d’Allah ﷺ nous a ordonné de rassembler nos provisions. Nous avons étendu une peau et chacun y a mis sa nourriture. J’ai mesuré la taille de la peau : elle était à peine assez grande pour qu’une chèvre s’y tienne. Nous étions quatorze cents. Nous avons tous mangé à satiété, puis nous avons rempli nos sacs de provisions. Ensuite, le Messager d’Allah ﷺ a demandé s’il y avait de l’eau pour les ablutions. Un homme est venu avec un petit seau d’eau qu’il a versé dans un bassin. Nous étions quatorze cents à faire nos ablutions avec cette eau, et il y en avait en abondance. Ensuite, huit personnes sont venues et ont demandé s’il restait de l’eau pour les ablutions. Le Messager d’Allah ﷺ a répondu : « Les ablutions ont déjà été faites. »",
          "id": "Telah menceritakan kepadaku [Ahmad bin Yusuf Al Azdi] telah menceritakan kepada kami [An Nadlr] -yaitu Ibnu Muhamamd Al Yamami- telah menceritakan kepada kami [Ikrimah] -yaitu Ibnu 'Ammar- telah menceritakan kepada kami [Iyas bin Salamah] dari [ayahnya] dia berkata, \"Suatu ketika, kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam sebuah peperangan, lalu kami mendapat kesulitan sampai-sampai kami berniat untuk mengorbankan sebagian dari unta tunggangan kami. Lalu Nabi shallallahu 'alaihi wasallam menyuruh kami untuk mengumpulkan semua perbekalan kami, lalu kamipun membentangkan sebuah tikar hingga semua perbekalan kami terkumpul di atas tikar tersebut.\" Salamah berkata, \"Lalu aku berusaha menghitung jumlah anggota pasukan saat itu, seperti halnya seorang pengembala kambing, dan ternyata kami saat itu berjumlah seratus empat belas.\" Salamah melanjutkan, \"Kemudian kami makan hingga kami semua merasa kenyang, lalu kami mengisi kantong kulit kami. Kemudian Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Adakah air untuk berwudlu?\" Maka datanglah seorang lelaki dengan membawa kantong airnya, lalu beliau menuangkannya ke dalam ember, hingga kami semua yang saat berjumlah seratus empat belas orang dapat berwudlu dengannya.\" Salamah melanjutkan, \"Setelah itu ada delapan orang yang datang dan menanyakan, \"Apakah masih ada air untuk bersuci?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Air wudlu telah habis",
          "tr": "Bana Ahmed b. Yûsuf El-Ezdî rivayet etti. (Dediki): Bize Nadr (yâni İbni Muhammed El-Yemâmî) rivayet etti. (Dediki): Bize İkrime —ki İbni Ammâr'dır— rivayet etti. (Dediki): Bize İyâs b. Seleme, babasından naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte bir gazaya çıktık da bize kıtlık isabet etti. Hattâ bazı binek develerimizi boğazlamayı gönülden geçirdik. Derken Nebiyyullah (Sallallahu Aleyhi ve Sellem) emir buyurdu da yiyecek kaplarımızı topladık. Bunların mecmuu için de (yere) bir yaygı serdik. Artık cemaatin yiyecekleri yaygının üzerinde toplandı. Ben toplananın ne kadar olduğunu tahmin için uzandım: Ve onu keçi ağılı kadar tahmin ettim. Halbuki biz yüz ondört kişi idik. Hepimiz doyuncaya kadar yedik. Sonra dağarcıklarımızı doldurduk. Müteakiben Nebiyyullah (Sallallahu Aleyhi ve Sellem): «Abdest suyu var mı?» diye sordu. Bunun üzerine bir adam içinde biraz su bulunan matarasını getirdi; ve onu bir tasa boşalttı. Artık hepimiz abdest aldık. Yüz on dört kişi onu şarıl şarıl döküyorduk!.. Râvi demiş ki; Bundan sonra sekiz kişi daha geldi; ve abdest suyu var mı? diye sordular. Fakat Resûlullah (Sallallahu Aleyhi ve Sellem): «Abdest suyu bitti!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 31,
        "hadith": 20
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "16KB"
  }
}