{
  "collection": "muslim",
  "book": 46,
  "name": {
    "arabic": "كتاب The Book of Destiny",
    "transliteration": "kitab destiny",
    "translation": "The Book of Destiny"
  },
  "totalHadith": 52,
  "hadithNumberRange": {
    "first": 6723,
    "last": 6774
  },
  "content": [
    {
      "hadithNumber": 6723,
      "arabicNumber": "2643.01",
      "book": 46,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ قَالُوا حَدَّثَنَا الأَعْمَشُ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ الْمَصْدُوقُ ‏ \"‏ إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ فِي ذَلِكَ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ فِي ذَلِكَ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يُرْسَلُ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيدٌ فَوَالَّذِي لاَ إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah (b. Mas'ud) reported that Allah's Messenger (ﷺ) who is the most truthful (of the human beings) and his being truthful (is a fact) said:Verily your creation is on this wise. The constituents of one of you are collected for forty days in his mother's womb in the form of blood, after which it becomes a clot of blood in another period of forty days. Then it becomes a lump of flesh and forty days later Allah sends His angel to it with instructions concerning four things, so the angel writes down his livelihood, his death, his deeds, his fortune and misfortune. By Him, besides Whom there is no god, that one amongst you acts like the people deserving Paradise until between him and Paradise there remains but the distance of a cubit, when suddenly the writing of destiny overcomes him and he begins to act like the denizens of Hell and thus enters Hell, and another one acts in the way of the denizens of Hell, until there remains between him and Hell a distance of a cubit that the writing of destiny overcomes him and then he begins to act like the people of Paradise and enters Paradise",
          "ur": "عبداللہ بن نمیر ہمدانی ، ابومعاویہ اور وکیع نے ہمیں حدیث بیان کی ، انہوں نے کہا : ہمیں اعمش نے زید بن وہب سے حدیث بیان کی ، انہوں نے حضرت عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی کہ اللہ کے رسول صلی اللہ علیہ وسلم اور وہ سچ بتاتے ہیں اور انہیں ( وحی کے ذریعے سے ) سچ بتایا جاتا ہے نے فرمایا : \" تم میں سے ہر ایک شخص کا مادہ تخلیق چالیس دن تک اس کی ماں کے پیٹ میں اکٹھا کیا جاتا ہے ، پھر وہ اتنی مدت ( چالیس دن ) کے لیے علقہ ( جونک کی طرح رحم کی دیوار کے ساتھ چپکا ہوا ) رہتا ہے ، پھر اتنی ہی مدت کے لیے مُضغہ کی شکل میں رہتا ہے ( جس میں ریڑھ کی ہڈی کے نشانات دانت سے چبائے جانے کے نشانات سے مشابہ ہوتے ہیں ۔ ) پھر اللہ تعالیٰ فرشتے کو بھیجتا ہے جو ( پانچویں مہینے نیوروسیل ، یعنی دماغ کی تخلیق ہو جانے کے بعد ) اس میں روح پھونکتا ہے ۔ اور اسے چار باتوں کا حکم دیا جاتا ہے کہ اس کا رزق ، اس کی عمر ، اس کا عمل اور یہ کہ وہ خوش نصیب ہو گا یا بدنصیب ، لکھ لیا جائے ۔ مجھے اس ذات کی قسم جس کے سوا کوئی عبادت کے لائق نہیں! تم میں سے کوئی ایک شخص اہل جنت کے سے عمل کرتا رہتا ہے ، یہاں تک کہ جب اس کے اور جنت کے درمیان ایک بالشت کا فاصلہ رہ جاتا ہے تو ( اللہ کے علم کے مطابق ) لکھا ہوا اس پر غالب آ جاتا ہے تو وہ اہل جہنم کا عمل کر لیتا ہے اور اس ( جہنم ) میں داخل ہو جاتا ہے ۔ اور تم میں سے ایک شخص اہل جہنم کے سے عمل کرتا رہتا ہے حتی کہ اس کے اور جہنم کے درمیان ایک بالشت کا فاصلہ رہ جاتا ہے تو ( اللہ کے علم کے مطابق ) لکھا ہوا اس پر غالب آ جاتا ہے اور وہ اہل جنت کا عمل کر لیتا ہے اور اس ( جنت ) میں داخل ہو جاتا ہے ۔",
          "fr": "Rapporté par Abdullah (b. Mas’ud) : Le Messager d’Allah ﷺ, le plus véridique des hommes, a dit : « Voici comment se passe votre création : les éléments qui composent l’un d’entre vous sont rassemblés pendant quarante jours dans le ventre de sa mère sous forme de sperme, puis cela devient une adhérence de sang pendant une autre période de quarante jours. Ensuite, cela devient un morceau de chair, et quarante jours plus tard, Allah envoie un ange chargé d’écrire quatre choses : sa subsistance, sa mort, ses actions, son bonheur ou son malheur. Par Celui en dehors de qui il n’y a pas de divinité, l’un d’entre vous agit comme les gens du Paradis au point qu’il ne reste entre lui et le Paradis qu’une coudée, mais ce qui est écrit le rattrape et il commence à agir comme les gens de l’Enfer, et il y entre. Un autre agit comme les gens de l’Enfer jusqu’à ce qu’il ne reste entre lui et l’Enfer qu’une coudée, puis ce qui est écrit le rattrape et il commence à agir comme les gens du Paradis, et il y entre. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; Telah menceritakan kepada kami [Abu Mu'awiyah] dan [Waki']; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair Al Mahdani] dan lafazh ini miliknya; Telah menceritakan kepada kami [Bapakku] dan [Abu Mu'awiyah] dan [Waki'] mereka berkata; Telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] dari ['Abdullah] dia berkata; Telah menceritakan kepada kami Rasulullah shallallahu 'alaihi wasallam yaitu -Ash Shadiq Al Mashduq-(seorang yang jujur menyampaikan dan berita yang disampaikannya adalah benar): 'Sesungguhnya seorang manusia mulai diciptakan dalam perut ibunya setelah diproses selama empat puluh hari. Kemudian menjadi segumpal daging pada empat puluh hari berikutnya. Lalu menjadi segumpal daging pada empat puluh hari berikutnya. Setelah empat puluh hari berikutnya, Allah pun mengutus seorang malaikat untuk menghembuskan ruh ke dalam dirinya dan diperintahkan untuk menulis empat hal; rezekinya, ajalnya, amalnya, dan sengsara atau bahagianya.' Demi Allah yang tiada Tuhan selain Dia, sungguh ada seseorang darimu yang mengerjakan amal perbuatan ahli surga, hingga jarak antara dirinya dan surga hanyalah satu hasta, namun suratan takdir rupanya ditetapkan baginya hingga ia mengerjakan amal perbuatan ahli neraka dan akhirnya ia pun masuk neraka. Ada pula orang yang mengerjakan amal perbuatan ahli neraka, hingga jarak antara ia dan neraka hanya satu hasta, namun suratan takdir rupanya ditetapkan baginya hingga kemudian ia mengerjakan amal perbuatan ahli surga dan akhirnya ia pun masuk surga.' Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] keduanya dari [Jarir bin 'Abdul Hamid]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ishaq bin Ibrahim]; Telah mengabarkan kepada kami ['Isa bin Yunus]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Abu Sa'id Al Asyaj]; Telah menceritakan kepada kami [Waki']; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakannya kepada kami ['Ubaidullah bin Mu'adz]; Telah menceritakan kepada kami [Bapakku]; Telah menceritakan kepada kami [Syu'bah bin Hajjaj] seluruhnya dari [Al A'masy] melalui jalur ini, dia berkata di dalam Hadits Waki'; sesungguhnya penciptaan salah seorang dari kalian dimulai dari perut ibunya selama empat puluh malam. Dan di sebutkan di dalam Hadits Mu'adz dari Syu'bah empat puluh malam, kemudian empat puluh hari. Sedangkan di dalam Hadits Jarir, empat puluh hari",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Ebû Muâviye ile Veki' rivayet ettiler. H. Bize Muhammed b. Abdillah b. Numeyr El-Hemdânî de rivayet etti. Lâfız onundur. (Dediki): Bize babam ile Ebû Muâviye ve Vekî' rivayet ettiler. (Dedilerki): Bize A'meş, Zeyd b. Vehb'den, o da Abdullah'dan naklen rivayet etti. (Şöyle demiş): Bize Resûlullah (Sallallahu Aleyhi ve Sellem) —Ki sâdık ve masduk'dur__: «Şüphesiz siz’den birinizin teşekkülâtı annesinin karnında kırk günde toplanır. Sonra orada o kadar bir müddet de bir pıhtı olur. Sonra o kadar müddet de orada bir parça et hâline gelir. Sonra melek gönderilir ve kendisine ruh üfürülür. Meleğe dört kelime emrolunur: Rızkını, ecelini, amelîni ve şaki yahut said olacağını yazması. Kendinden başka ilâh olmayan Allah'a yemin ederimki: Sizden biriniz cennetliklerin yaptığını yapar, hattâ cennetle kendisi arasında bir arşından başka mesafe kalmaz, fakat kitab onu geçmiş bulunur da, cehennemliklerin yaptığını yapar ve cehenneme girer. Ve yine muhakkak ki, sizden biriniz cehennemliklerin yaptığını yapar, hattâ cehennemle kendisi arasında bir arşından fazla mesafe kalmaz. Fakat kitab onu geçmiş olur da, cennetliklerin yaptığını yapar ve cennete girer.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 6724,
      "arabicNumber": "2643.02",
      "book": 46,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرِ بْنِ عَبْدِ، الْحَمِيدِ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ، الأَشَجُّ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ قَالَ فِي حَدِيثِ وَكِيعٍ ‏\"‏ إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ لَيْلَةً ‏\"‏ ‏.‏ وَقَالَ فِي حَدِيثِ مُعَاذٍ عَنْ شُعْبَةَ ‏\"‏ أَرْبَعِينَ لَيْلَةً أَرْبَعِينَ يَوْمًا ‏\"‏ ‏.‏ وَأَمَّا فِي حَدِيثِ جَرِيرٍ وَعِيسَى ‏\"‏ أَرْبَعِينَ يَوْمًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been reported on the authority of A'mash with the same chain of transmitters and in the hadith transmitted on the authority of Waki' (the words are):\" The creation of any one of you is like this that (semen) is collected in the womb of the mother for forty nights,\" and in the hadith transmitted on the authority of Shu'ba (the words are):\" Forty nights and forty days.\" And in the hadith transmitted on the authority of Jarir and 'Isa (the words are):\" Forty days",
          "ur": "عثمان بن ابی شیبہ اور اسحٰق بن ابراہیم نے ہمیں حدیث بیان کی ، دونوں نے جریر بن عبدالحمید سے روایت کی ، نیز ہمیں اسحق بن ابراہیم نے عیسیٰ بن یونس سے خبر دی ۔ اور ابوسعید اشج نے مجھے بیان کیا ، کہا : ہمیں وکیع نے حدیث بیان کی کہ عبیداللہ بن معاذ نے کہا : ہمیں میرے والد نے حدیث بیان کی ، انہوں نے کہا : ہمیں شعبہ بن حجاج نے حدیث بیان کی ، ان سب ( جریر ، عیسیٰ ، وکیع اور شعبہ ) نے اعمش سے ، اسی سند کے ساتھ روایت کی ۔ وکیع کی حدیث میں کہا : \" تم میں سے ایک انسان کا مادہ تخلیق چالیس راتوں تک اپنی ماں کے پیٹ میں اکٹھا ( ہونے کے مرحلے میں ) ہوتا ہے ۔ \" اور شعبہ سے معاذ کی حدیث میں \" چالیس راتیں یا چالیس دن \" اور جریر اور عیسیٰ کی حدیث میں \" چالیس دن \" ہے ۔",
          "fr": "Rapporté par Abdullah (b. Mas’ud) : Ce hadith a été rapporté par A’mash avec la même chaîne de transmetteurs. Dans la version de Waki’, il est dit : « La création de l’un d’entre vous est telle que (le sperme) reste dans le ventre de la mère pendant quarante nuits. » Dans celle de Shu’ba : « Quarante nuits et quarante jours. » Dans celle de Jarir et ‘Isa : « Quarante jours. »",
          "tr": "{M-1} Bize Osman b. Ebî Şeybe ile İshak b. İbrahim ikisi birden Cerîr b. Abdü'l-Hamid'den rivayet ettiler. H. Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize îsâ b. Yûnus haber verdi. H. Bana Ebû, Saîd El-Eşec dahî rivayet etti. (Dediki): Bize Veki' rivayet etti. H. Bize bu hadîsi Ubeydullah-b. Muâz da rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize Şu'be b. Haccac rivayet etti. Bu râvilerin hepsi A'meş'den bu isnadla rivayette bulunmuşlardır. Veki'in hadîsinde : «Şüphesiz sizden birinizin teşekkülâtı annesinin karnında kırk gecede toplanır.» Muaz'ın Şu'be'den rivayet ettiği hadîsinde : «Kırk gece yahut kırk gün.» Cerîr ve isa'nın hadîslerinde ise: «Kırk gün.» buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 6725,
      "arabicNumber": "2644",
      "book": 46,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَدْخُلُ الْمَلَكُ عَلَى النُّطْفَةِ بَعْدَ مَا تَسْتَقِرُّ فِي الرَّحِمِ بِأَرْبَعِينَ أَوْ خَمْسَةٍ وَأَرْبَعِينَ لَيْلَةً فَيَقُولُ يَا رَبِّ أَشَقِيٌّ أَوْ سَعِيدٌ فَيُكْتَبَانِ فَيَقُولُ أَىْ رَبِّ أَذَكَرٌ أَوْ أُنْثَى فَيُكْتَبَانِ وَيُكْتَبُ عَمَلُهُ وَأَثَرُهُ وَأَجَلُهُ وَرِزْقُهُ ثُمَّ تُطْوَى الصُّحُفُ فَلاَ يُزَادُ فِيهَا وَلاَ يُنْقَصُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Hudhaifa b. Usaid reported directly from Allah's Messenger (ﷺ) that he said:When the drop of (semen) remains in the womb for forty or forty five nights, the angel comes and says: My Lord, will he be good or evil? And both these things would be written. Then the angel says: My Lord, would he be male or female? And both these things are written. And his deeds and actions, his death, his livelihood; these are also recorded. Then his document of destiny is rolled and there is no addition to nor subtraction from it",
          "ur": "عمرو بن دینار نے ابوطفیل ( عامر بن واثلہ رضی اللہ عنہ ) سے ، انہوں نے حذیفہ بن اسید رضی اللہ عنہ سے روایت کی جو انہوں نے نبی صلی اللہ علیہ وسلم تک پہنچائی ( مرفوع بیان کی ) ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب نطفہ ( چالیس چالیس دنوں کے دو مرحلوں کے بعد تیسرے مرحلے میں ) چالیس یا پینتالیس راتیں رحم میں ٹھہرا رہتا ہے تو ( اللہ کا مقرر کیا ہوا ) فرشتہ اس کے پاس جاتا ہے اور کہتا ہے : اے رب! یہ خوش نصیب ہو گا یا بدنصیب ہو گا؟ تو دونوں ( باتوں میں سے اللہ کو بتائے اس ) کو لکھ لیا جاتا ہے ، پھر کہتا ہے : اے رب! یہ مرد ہے یا عورت؟ پھر دونوں ( میں سے جو اللہ بتائے اس ) کو لکھ لیا جاتا ہے ، پھر اس کا عمل ، اس کے قدموں کے نشانات ، اس کی مدت عمر اور اس کا رزق لکھ لیا جاتا ہے ، پھر ( اندراج کے ) صحیفے لپیٹ دیے جاتے ہیں ، پھر ان میں کوئی چیز بڑھائی جاتی ہے ، نہ کم کی جاتی ہے ۔",
          "fr": "Rapporté par Hudhayfa b. Usaid : Le Messager d’Allah ﷺ a dit directement : « Quand la goutte de sperme reste dans l’utérus pendant quarante ou quarante-cinq nuits, l’ange vient et dit : “Mon Seigneur, sera-t-il bon ou mauvais ?” Et les deux choses sont écrites. Ensuite l’ange dit : “Mon Seigneur, sera-t-il un garçon ou une fille ?” Et cela aussi est écrit. Ses actes, sa mort, sa subsistance : tout cela est aussi inscrit. Ensuite, son destin est enroulé et il n’y a ni ajout ni retrait. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin 'Abdullah bin Numair] dan [Zuhair bin Harb], lafazh ini milik Ibnu Numair keduanya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru bin Dinar] dari [Abu Ath Thufail] dari [Hudzaifah bin Asid] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya malaikat akan mendatangi nuthfah yang telah menetap dalam rahim selama empat puluh atau empat puluh lima malam seraya berkata; 'Ya Tuhanku, apakah nantinya ia ini sengsara atau bahagia? ' Maka ditetapkanlah (salah satu dari) keduanya. Kemudian malaikat itu bertanya lagi; 'Ya Tuhanku, apakah nanti ia ini laki-laki ataukah perempuan? ' Maka ditetapkanlah antara salah satu dari keduanya, ditetapkan pula amalnya, umurnya, ajalnya, dan rezekinya. Setelah itu catatan ketetapan itu dilipat tanpa ditambah ataupun dikurangi lagi",
          "tr": "Bize Muhammed b. Abdillah b. Numeyr ile Züheyr b. Harb rivayet ettiler. Lâfız İbnü Numeyr'indir. (Dedilerki); Bize Süfyân b. Uyeyne, Amr b. Dinar'dan, o da Ebû't-Tufeyl'dcn, o da Huzeyfe b, Esîd'den, o da Nebi (Sullallahu Aleyhi ve Se!lem)'e iblâğ etmiş olmak üzere rivayet etti, (Şöyle buyurmuşlar) : «Melek nutfenin üzerine rahimde kırk yahut kırk beş gecede karar kıldıktan sonra girer ve : — Yârab (bu) şaki mi olacak, saîd mi? diye sorar. Bunlar yazılırlar. Müteakiben : — Ey Rabbim! Erkek mi olacak, yoksa dişi mî? diye sorar. Bunlar da yazılırlar. Ameli, eseri, eceli ve rızkı hep yazılır. Sonra sahifeler dürülür. Bir daha bu hususlarda ziyâde ve noksan yapılmaz.» İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 6726,
      "arabicNumber": "2645.01",
      "book": 46,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو، بْنُ الْحَارِثِ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ عَامِرَ بْنَ وَاثِلَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، يَقُولُ الشَّقِيُّ مَنْ شَقِيَ فِي بَطْنِ أُمِّهِ وَالسَّعِيدُ مَنْ وُعِظَ بِغَيْرِهِ ‏.‏ فَأَتَى رَجُلاً مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُقَالُ لَهُ حُذَيْفَةُ بْنُ أَسِيدٍ الْغِفَارِيُّ فَحَدَّثَهُ بِذَلِكَ مِنْ قَوْلِ ابْنِ مَسْعُودٍ فَقَالَ وَكَيْفَ يَشْقَى رَجُلٌ بِغَيْرِ عَمَلٍ فَقَالَ لَهُ الرَّجُلُ أَتَعْجَبُ مِنْ ذَلِكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا مَرَّ بِالنُّطْفَةِ ثِنْتَانِ وَأَرْبَعُونَ لَيْلَةً بَعَثَ اللَّهُ إِلَيْهَا مَلَكًا فَصَوَّرَهَا وَخَلَقَ سَمْعَهَا وَبَصَرَهَا وَجِلْدَهَا وَلَحْمَهَا وَعِظَامَهَا ثُمَّ ‏.‏ قَالَ يَا رَبِّ أَذَكَرٌ أَمْ أُنْثَى فَيَقْضِي رَبُّكَ مَا شَاءَ وَيَكْتُبُ الْمَلَكُ ثُمَّ يَقُولُ يَا رَبِّ أَجَلُهُ ‏.‏ فَيَقُولُ رَبُّكَ مَا شَاءَ وَيَكْتُبُ الْمَلَكُ ثُمَّ يَقُولُ يَا رَبِّ رِزْقُهُ ‏.‏ فَيَقْضِي رَبُّكَ مَا شَاءَ وَيَكْتُبُ الْمَلَكُ ثُمَّ يَخْرُجُ الْمَلَكُ بِالصَّحِيفَةِ فِي يَدِهِ فَلاَ يَزِيدُ عَلَى مَا أُمِرَ وَلاَ يَنْقُصُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Mas'ud reported:Evil one is he who is evil in the womb of his mother and the good one is he who takes a lesson from the (fate of) others. The narrator came to a person from amongst the Companions of Allah's Messenger (ﷺ) who was called Hudhaifa b. Usaid Ghifari and said: How can a person be an evil one without (committing an evil) deed? Thereupon the person said to him: You are surprised at this, whereas I have heard Allah's Messenger (ﷺ) as saying: When forty-two nights pass after the semen gets into the womb, Allah sends the angel and gives him shape. Then he creates his sense of hearing, sense of sight, his skin, his flesh, his bones, and then says: My Lord, would he be male or female? And your Lord decides as He desires and the angel then puts down that also and then says: My Lord, what about his age? And your Lord decides as He likes it and the angel puts it down. Then he says: My Lord, what about his livelihood? And then the Lord decides as He likes and the angel writes it down, and then the angel gets out with his scroll of destiny in his hand and nothing is added to it and nothing is subtracted from it",
          "ur": "عمرو بن حارث نے ابوزبیر علی سے روایت کی کہ حضرت عامر بن واثلہ رضی اللہ عنہ نے انہیں حدیث بیان کی ، انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ کو یہ کہتے ہوئے سنا : بدبخت وہ ہے جو اپنی ماں کے پیٹ میں ( تھا تو اللہ کے علم کے مطابق ) بدبخت تھا اور سعادت مند وہ ہے جو اپنے علاوہ دوسرے سے نصیحت حاصل کرے ، پھر رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے ایک شخص آئے جنہیں حضرت حذیفہ بن اسید غفاری رضی اللہ عنہ کہا جاتا تھا ، انہوں ( عامر بن واثلہ رضی اللہ عنہ ) نے ان کو حضرت ابن مسعود رضی اللہ عنہ کے الفاظ میں یہ حدیث سنائی اور ( ان سے پوچھنے کے لیے ) کہا : وہ شخص کوئی عمل کیے بغیر بدبخت کیسے ہو جاتا ہے؟ تو اس ( عامر ) کو آدمی ( حذیفہ رضی اللہ عنہ ) نے کہا : کیا آپ اس پر تعجب کرتے ہیں؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے : \" جب نطفے پر ( تیسرے مرحلے کی ) بیالیس راتیں گذر جاتی ہیں تو اللہ تعالیٰ اس کے پاس ایک فرشتہ بھیجتا ہے ، وہ اس کی صورت بناتا ہے ، اس کے کان ، آنکھیں ، کھال ، گوشت اور اس کی ہڈیاں بناتا ہے ، پھر کہتا ہے : اے میرے رب! یہ مرد ہو گا کہ عورت؟ پھر تمہارا رب جو چاہتا ہوتا ہے وہ فیصلہ بتاتا ہے اور فرشتہ لکھ لیتا ہے ، پھر وہ کہتا ہے : اے میرے رب! اس کی مدت حیات ( کتنی ہو گی؟ ) پھر تمہارا رب جو اس کی مچیت ہوتی ہے ، بتاتا ہے اور فرشتہ لکھ لیتا ہے ، پھر وہ ( فرشتہ ) کہتا ہے : اے میرے رب! اس کا رزق ( کتنا ہو گا؟ ) تو تمہارا رب جو چاہتا ہوتا ہے وہ فیصلہ بتاتا ہے اور فرشتہ لکھ لیتا ہے ، پھر فرشتہ اپنے ہاتھ میں صحیفہ لے کر نکل جاتا ہے ، چنانچہ وہ شخص کسی معاملے میں نہ اس سے بڑھتا ہے ، نہ کم ہوتا ہے ۔",
          "fr": "Rapporté par ‘Abdullah b. Mas’ud : Est mauvais celui qui est mauvais dans le ventre de sa mère, et est bon celui qui tire une leçon du destin des autres. Le narrateur est allé voir un compagnon du Messager d’Allah ﷺ nommé Hudhayfa b. Usaid al-Ghifari et lui a demandé : « Comment quelqu’un peut-il être mauvais sans avoir commis d’acte mauvais ? » Il répondit : « Tu t’étonnes de cela, alors que j’ai entendu le Messager d’Allah ﷺ dire : “Quand quarante-deux nuits passent après que le sperme est entré dans l’utérus, Allah envoie l’ange qui lui donne forme. Il crée ensuite son ouïe, sa vue, sa peau, sa chair, ses os, puis l’ange demande : ‘Mon Seigneur, sera-t-il un garçon ou une fille ?’ Et ton Seigneur décide comme Il veut, et l’ange l’inscrit. Ensuite il demande : ‘Mon Seigneur, quel sera son âge ?’ Et ton Seigneur décide comme Il veut, et l’ange l’inscrit. Ensuite il dit : ‘Mon Seigneur, qu’en est-il de sa subsistance ?’ Et le Seigneur décide comme Il veut, et l’ange l’inscrit. Puis l’ange part avec le registre de son destin en main, et rien n’y est ajouté ni retiré.” »",
          "id": "Telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru bin Sarh]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Abu Az Zubair Al Makki] bahwa ['Amir bin Watsilah] Telah menceritakan kepadanya dia pernah mendengar ['Abdullah bin Mas'ud] berkata; \"Orang yang sengsara adalah orang yang telah ditetapkan untuk menjadi orang sengsara semenjak ia berada dalam perut ibunya. Sedangkan orang yang bahagia adalah orang yang telah ditetapkan untuk menjadi orang yang bahagia semenjak ia berada dalam perut ibunya.\" Kemudian ada seorang sahabat Rasulullah shallallahu 'alaihi wasallam, yang bernama [Hudzaifah bin Asid Al Ghifari], datang. Lalu Amir bin Watsilah menuturkan ucapan Abdullah bin Mas'ud itu kepadanya seraya berkata; 'Bagaimana mungkin seseorang akan menjadi sengsara sebelum ia berbuat apa-apa? ' Hudzaifah berkata kepada Amir; 'Apakah kamu masih merasa heran mendengar pernyataan itu? Sesungguhnya saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Ketika nuthfah telah berusia empat puluh dua malam, maka Allah akan mengutus satu malaikat mendatangi nuthfah tersebut. Kemudian Allah akan membentuk tubuhnya, menciptakan pendengarannya, penglihatannya, kulitnya, dagingnya, dan juga tulangnya. Setelah itu, malaikat tersebut akan bertanya; 'Ya Tuhan, apakah janin yang berada dalam rahim ini laki-laki ataukah perempuan? ' Maka Allah, Tuhanmu, akan menentukan menurut kehendak-Nya. Kemudian malaikat pun mencatatnya. Setelah itu, malaikat tersebut akan bertanya lagi; Ya Tuhan, bagaimana halnya dengan ajal janin ini? ' Lalu Allah akan menentukan ajalnya menurut kehendak-Nya. Maka, setelah itu, malaikat pun akan mencatatnya. Kemudian malaikat tersebut akan bertanya lagi; 'Ya Tuhan, bagaimanakah halnya dengan rezekinya? ' Lalu Allah, Tuhanmu, akan menentukan rezekinya menurut kehendak-Nya. Setelah itu, malaikat pun akan mencatatnya. Kemudian malaikat tersebut keluar dengan membawa selembar catatan yang berada di tangannya -tanpa menambah ataupun mengurangi- apa telah diperintahkan Allah untuk mencatatnya.' Telah menceritakan kepada kami [Ahmad bin 'Utsman An Naufali]; Telah mengabarkan kepada kami [Abu 'Ashim]; Telah menceritakan kepada kami [Ibnu Juraij]; Telah mengabarkan kepadaku [Abu Az Zubair] bahwa [Abu Ath Thufail]; Telah mengabarkan kepadanya dia mendengar ['Abdullah bin Mas'ud] berkata; -lalu dia menyebutkan Hadits- yang serupa dengan Hadits 'Amru bin Al Harits",
          "tr": "Bana Ebû't-Tahir Ahmed b. Amr b. Şerh rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Bana Amr b. Haris, Ebû'z-Zübeyr El-Mekkî'den naklen haber verdi. Ona da Amir b. Vasile rivayet etmişki, kendisi Abdullah b. Mes'ud'u şöyle derken işitmiş : Şaki, annesinin karnında şakî olandır. Saîd ise başkasından ibret alandır. Müteakiben Âmir, Resûlullah (Sallallahu Aleyhi ve Sellem)'in ashabından Huzeyfe b. Esîd El-Gıfârî denilen bir zat'a gelerek bunu İbni Mes'ud'un sözü olmak üzere ona rivayet etmiş. Huzeyfe: — Bir adam amelsiz nasıl şakî olabilir? demiş. Bu zât ona : — Sen buna şaşıyor musun? Gerçekten ben Resûlullah (Sallallahu Aleyhi ve Sellem)'i «Nutfenin özerinden kırk iki gece geçti mi, Allah ona bir melek gönderir. Melek ona sûret verir; kulağını, gözünü, cildini, etini ve kemiklerini yaratır. Sonra : — Yâ Rabbi! Erkek mi olacak, dişi mi? diye sorar. Rabbin dilediğini hüküm buyurur; Melek de yazar. Sonra : — Yâ Rabbi! Eceli ne olacak? der. Rabbin dilediğini söyler. Melek yine yazar. Sonra : — Yâ Rabbi! Rızkı ne olacak? der. Rabbin dilediğini hükmeder. Melek yine yazar. Sonra melek: Sahîfe elinde olduğu halde çıkar, emrolunduğunun üzerine ziyâde eksik yapmaz.» buyururken işittim, demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 6727,
      "arabicNumber": "2645.02",
      "book": 46,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، أَخْبَرَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّ أَبَا الطُّفَيْلِ، أَخْبَرَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، يَقُولُ ‏.‏ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of 'Abdullah b. Mas'ud through another chain of transmitters",
          "ur": "ابن جریج نے کہا : مجھے ابوزبیر نے خبر دی کہ ابوطفیل رضی اللہ عنہ نے انہیں بتایا کہ انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے اور عمرو بن حارث کی حدیث کی طرح حدیث بیان کی ۔",
          "fr": "Rapporté par ‘Abdullah b. Mas’ud : Ce hadith a été rapporté par une autre chaîne de transmetteurs",
          "tr": "{M-3} Bize Ahmed b. Osman En-Nevfelî rivayet etti. (Dediki): Bize Ebu Asım haber verdi. (Dediki): Bize İbnü Cüreyc rivayet etti. (Dediki): Bana Ebû'z-Zubeyr haber verdi. Ona da Ebû't-Tufeyl haber vermişki: Kendisi Abdullah b. Mes'ud'u şöyle derken işitmiş... Ve râvi hadîsi Amr b. Hâris'in hadîsi gibi hikâye etmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 6728,
      "arabicNumber": "2645.03",
      "book": 46,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرٌ أَبُو خَيْثَمَةَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَطَاءٍ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ، حَدَّثَهُ أَنَّ أَبَا الطُّفَيْلِ حَدَّثَهُ قَالَ دَخَلْتُ عَلَى أَبِي سَرِيحَةَ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِأُذُنَىَّ هَاتَيْنِ يَقُولُ ‏\"‏ إِنَّ النُّطْفَةَ تَقَعُ فِي الرَّحِمِ أَرْبَعِينَ لَيْلَةً ثُمَّ يَتَصَوَّرُ عَلَيْهَا الْمَلَكُ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ حَسِبْتُهُ قَالَ الَّذِي يَخْلُقُهَا ‏\"‏ فَيَقُولُ يَا رَبِّ أَذَكَرٌ أَوْ أُنْثَى فَيَجْعَلُهُ اللَّهُ ذَكَرًا أَوْ أُنْثَى ثُمَّ يَقُولُ يَا رَبِّ أَسَوِيٌّ أَوْ غَيْرُ سَوِيٍّ فَيَجْعَلُهُ اللَّهُ سَوِيًّا أَوْ غَيْرَ سَوِيٍّ ثُمَّ يَقُولُ يَا رَبِّ مَا رِزْقُهُ مَا أَجَلُهُ مَا خُلُقُهُ ثُمَّ يَجْعَلُهُ اللَّهُ شَقِيًّا أَوْ سَعِيدًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Tufail reported:I visited Abu Sariha Hudhaifa b. Usaid al-Ghifari who said: I listened with these two ears of mine Allahs Messenger (ﷺ) as saying: The semen stays in the womb for forty nights, then the angel, gives it a shape. Zubair said: I think that he said: One who fashions that and decides whether he would be male or female. Then he (the angel) says: Would his limbs be full or imperfect? And then the Lord makes thein full and perfect or otherwise as He desires. Then he says: My Lord, what about his livelihood, and his death and what about his disposition? And then the Lord decides about his misfortune and fortune",
          "ur": "یحییٰ بن ابوبکیر نے کہا : ہمیں ابوخیثمہ زہیر نے حدیث بیان کی ، انہوں نے کہا : مجھے عبداللہ بن عطاء نے حدیث بیان کی ، انہیں عکرمہ بن خالد نے حدیث بیان کی ، انہیں ابوطفیل رضی اللہ عنہ نے حدیث بیان کی ، کہا : میں ابو سریحہ حذیفہ بن اسید غفاری رضی اللہ عنہ کے پاس حاضر ہوا تو انہوں نے کہا : میں نے اپنے ان دونوں کانوں سے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے : \" نطفہ ( اصل میں تین مرحلوں میں چالیس ) چالیس راتیں رحم مادر میں رہتا ہے ، پھر فرشتہ اس کی صورت بناتا ہے ۔ \" زہیر نے کہا : میرا گمان ہے کہ انہوں نے کہا : ( فرشتہ ) اسے بتایا ہے : \" تو وہ کہتا ہے : اے میرے رب! عورت ہو گی یا مرد ہو گا؟ پھر اللہ تعالیٰ اس کے مذکر یا مؤنث ہونے کا فیصلہ بتا دیتا ہے ، وہ ( فرشتہ ) پھر کہتا ہے : اے میرے رب! مکمل ( پورے اعضاء والا ہے ) یا غیر مکمل؟ پھر اللہ تعالیٰ مکمل یا غیر مکمل ہونے کے بارے میں اپنا فیصلہ بتا دیتا ہے ، پھر وہ کہتا ہے : اے میرے پروردگار! اس کا رزق کتنا ہو گا؟ اس کی مدت حیات کتنی ہو گی؟ اس کا اخلاق کیسا ہو گا؟ پھر اللہ تعالیٰ اس کے بدبخت یا خوش بخت ہونے کے بارے میں بھی ( جو طے ہو چکا ) بتا دیتا ہے ۔",
          "fr": "Rapporté par Abou Toufayl : Je suis allé rendre visite à Abou Sariha Hudhayfa b. Usaid al-Ghifari qui m’a dit : « J’ai entendu de mes propres oreilles le Messager d’Allah ﷺ dire : “Le sperme reste dans l’utérus pendant quarante nuits, puis l’ange lui donne forme.” » Zoubayr ajouta : « Je pense qu’il a dit : ‘Celui qui façonne cela décide s’il sera garçon ou fille.’ » Ensuite l’ange demande : « Ses membres seront-ils complets ou non ? » Et le Seigneur les rend complets ou non, selon Sa volonté. Ensuite il dit : « Mon Seigneur, qu’en est-il de sa subsistance, de sa mort et de son caractère ? » Et le Seigneur décide de son malheur ou de son bonheur",
          "id": "Telah menceritakan kepadaku [Muhammad bin Ahmad bin Abu Khalaf]; Telah menceritakan kepada kami [Yahya bin Abu Bukair]; Telah menceritakan kepada kami [Zuhair Abu Khaitsamah]; Telah menceritakan kepadaku ['Abdullah bin 'Athaa] bahwa ['Ikrimah bin Khalid]; Telah menceritakan kepadanya bahwa [Abu Ath Thufail] Telah menceritakan kepadanya dia berkata; Aku menemui [Abu Sarihah Hudzaifah bin Asid Al Ghifari] lalu dia berkata; Aku mendengar dengan kedua telingaku ini Rasulullah shallallahu 'alaihi wasallam bersabda: Sesunggunya nuthfah disimpan di dalam rahim setelah empat puluh malam. Lalu datanglah malaikat -aku kira beliau berkata; - yang akan membentuknya seraya berkata; Ya Rabb, apakah dia laki-laki atau perempuan? Lalu Allah menjadikannya laki-laki atau perempuan. Kemudian malaikat itu berkata; Ya Rabb, apakah dia menyimpang ataukah tidak? Lalu Allah menetapkan dia menyimpang dan tidaknya. Lalu malaikat berkata; Ya Rabb, bagaimana rizkinya, ajalnya, akhlaknya? Kemudian Allah menetapkan dia bahagia atau celaka. Telah menceritakan kepada kami ['Abdul Warits bin 'Abdush Shamad]; Telah menceritakan kepadaku [Bapakku]; Telah menceritakan kepada kami [Rabi'ah bin Kultsum]; Telah menceritakan kepadaku bapakku [Kultsum] dari [Abu At Thufail] dari [Hudzaifah bin Asid Al Ghifari] sahabat Rasulullah shallallahu 'alaihi wasallam -secara marfu'-; bahwa apabila Allah ingin menciptakan sesuatu dengan izin-Nya, Dia mengutus Malaikat ke dalam rahim, setelah lebih dari empat puluh malam. -kemudian dia menyebutkan Hadits yang serupa",
          "tr": "Bana Muhammed b. Ahmed b. Ebî Halef rivayet etti. (Dediki): Bize Yahya b. Ebi Bükeyr rivayet etti. (Dediki): Bize Ebû Hayseme Züheyr rivayet etti. (Dediki): Bana Abdullah b. Atâ' rivayet etti. Ona da İkrime b. Hâlid, ona da Ebû't-Tufeyl rivayet etmiş. (Demişki): Ebû Serîha Huzeyfe b. Esîd El-Gıfârî'nin yanına girdim de şunu söyledi: Resûlullah (Sallallahu Aleyhi ve Sellem)'i şu iki kulağımla: «Gerçekten nutfe rahim'in içine kırk gecede düşer. Sonra onun üzerine melek iner. —Züheyr: Zannederim onu yaratan melek dedi, demiş — Ve: — Yâ Rabbİ! Erkek mi (olacak), yoksa dişi mî? diye sorar. Allah onu erkek yahut dişi olarak yaratır. Sonra : — Yâ Rabbi! Tam mı olacak, yoksa sakat mı? diye sorar. Allah onu ya tam yaratır yahut sakat! Sonra : — Yâ Rabbil Bunun rızkı, eceli, ahlâkı ne olacak? diye sorar. Sonra Allah onu ya şakî yahut saîd yaratır.» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 6729,
      "arabicNumber": "2645.04",
      "book": 46,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا رَبِيعَةُ بْنُ كُلْثُومٍ، حَدَّثَنِي أَبِي كُلْثُومٌ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَفَعَ الْحَدِيثَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَّ مَلَكًا مُوَكَّلاً بِالرَّحِمِ إِذَا أَرَادَ اللَّهُ أَنْ يَخْلُقَ شَيْئًا بِإِذْنِ اللَّهِ لِبِضْعٍ وَأَرْبَعِينَ لَيْلَةً ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ ‏.‏",
        "translations": {
          "en": "Hadhaifa b. Usaid Ghifari, a Companion of Allah's Messenger (ﷺ), reported it directly from Allah's Messenger (may peace upon him). as he said:There is an angel who looks after the womb when Allah decides to create any- thing after more than forty nights are over; the rest of the hadith is the same",
          "ur": "کلثوم نے ابوطفیل رضی اللہ عنہ سے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی حضرت حذیفہ بن اسید غفاری رضی اللہ عنہ سے روایت کی ، انہوں نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے مرفوعا روایت کی : \" تخلیق کے دوران میں رحم پر ایک فرشتہ مقرر ہوتا ہے ، جب اللہ تعالیٰ اپنے اذن سے کوئی چیز پیدا کرنا چاہتا ہے تو چالیس اور کچھ اوپر راتیں گزارنے کے بعد \" پھر ان سب کی روایت کردہ حدیث کے مطابق بیان کیا ۔",
          "fr": "Rapporté par Hudhayfa b. Usaid al-Ghifari, compagnon du Messager d’Allah ﷺ : Il a rapporté directement du Messager d’Allah ﷺ : « Il y a un ange chargé de veiller sur l’utérus. Quand Allah décide de créer quelque chose après plus de quarante nuits, le reste du hadith est le même. »",
          "tr": "{M-4} Biae Abdü'l-Vâris b. Abdi's-Samed rivayet etti. (Dediki): Bana babam rivayet etti. (Dediki): Bize Rabîa b. Külsûm rivayet etti. (Dediki): Bana babam Külsûm, Ebû't-Tufeyl'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'in sahâbîsi Huzeyfe b. Esîd El-Gıfârî'den, o da hadîsi Resûlullah (Sallallahu Aleyhi ve Sellem)'e ref etmiş olmak üzere naklen rivayet etti. Ki: «Allah biiznillah bir şey halketmek dilediği vakit, rahime müvekkel bir meleği kırk küsur gecenin tamamında gönderir...» buyurmuşlar. Sonra, râvi yukarkilerin hadîsi gibi anlatmıştır. İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 6730,
      "arabicNumber": "2646",
      "book": 46,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عُبَيْدُ، اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ، وَرَفَعَ الْحَدِيثَ، أَنَّهُ قَالَ ‏ \"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ وَكَّلَ بِالرَّحِمِ مَلَكًا فَيَقُولُ أَىْ رَبِّ نُطْفَةٌ أَىْ رَبِّ عَلَقَةٌ أَىْ رَبِّ مُضْغَةٌ ‏.‏ فَإِذَا أَرَادَ اللَّهُ أَنْ يَقْضِيَ خَلْقًا - قَالَ - قَالَ الْمَلَكُ أَىْ رَبِّ ذَكَرٌ أَوْ أُنْثَى شَقِيٌّ أَوْ سَعِيدٌ فَمَا الرِّزْقُ فَمَا الأَجَلُ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported directly from Allah's Messenger (ﷺ) that he said:Allah, the Exlated and Glorious, has appointed an angel as the caretaker of the womb, and he would say: My Lord, it is now a drop of semen; my Lord, It is now a clot of blood; my Lord, it has now become a lump of flesh, and when Allah decides to give it a final shape, the angel says: My Lord, would it be male or female or would he be an evil or a good person? What about his livelihood and his age? And it is all written as he is in the womb of his mother",
          "ur": "عبیداللہ بن ابی بکر نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے یہ حدیث مرفوعا بیان کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل رحم پر ایک فرشتہ مقرر کر دیتا ہے ، وہ کہتا ہے : اے میرے رب! ( اب ) یہ نطفہ ہے ، اے میرے رب! ( اب ) یہ عقلہ ہے ، اے میرے رب! ( اب یہ مضغہ ہے ، پھر جب اللہ تعالیٰ اس کی ( انسان کی صورت میں ) تخلیق کا فیصلہ کرتا ہے تو انہوں نے کہا : فرشتہ کہتا ہے : اے میرے رب! مرد ہو یا عورت؟ بدبخت ہو یا خوش نصیب؟ رزق کتنا ہو گا؟ مدت عمر کتنی ہو گی؟ وہ ماں کے پیٹ میں ہوتا ہے اور اسی طرح ( سب کچھ ) لکھ لیا جاتا ہے ۔",
          "fr": "Rapporté par Anas b. Malik : Le Messager d’Allah ﷺ a dit directement : « Allah, le Très-Haut et le Glorieux, a désigné un ange comme gardien de l’utérus. Il dit : “Mon Seigneur, c’est maintenant une goutte de sperme ; mon Seigneur, c’est maintenant un caillot de sang ; mon Seigneur, c’est maintenant un morceau de chair.” Et quand Allah décide de lui donner sa forme finale, l’ange demande : “Mon Seigneur, sera-t-il garçon ou fille ? Sera-t-il mauvais ou bon ? Qu’en est-il de sa subsistance et de son âge ?” Et tout cela est écrit alors qu’il est encore dans le ventre de sa mère. »",
          "id": "Telah menceritakan kepadaku [Abu Kamil Fudhail bin Husain Al Jahdari]; Telah menceritakan kepada kami [Hammad bin Zaid]; Telah menceritakan kepada kami ['Ubaidullah bin Abu Bakr] dari [Anas bin Malik] -secara marfu'- dia berkata; \"Sesungguhnya Allah Azza wa Jalla telah mengirim malaikat pada setiap rahim, dan malaikat itu berkata; Wahai Rabb nutfah, Rabb 'alaqah, Rabb mudhghah. Jika Allah Azza wa Jalla hendak menentukan takdir pada mahluk-Nya, Malaikat itu berkata \"Wahai Rabb, laki-laki atau perempuan? celaka atau bahagia, bagaimana rizki dan bagaimana ajalnya?\" Maka ditulislah ketetapan itu dalam perut ibunya",
          "tr": "Bana Ebû Kamil Fudayl b. Hüseyn El-Cahderî rivayet etti. (Dediki): Bize Hammâd h. Zeyd rivayet etti. (Dediki): Bize Ubeydullah b. Ebî Bekr Enes b. Mâtik'den naklen rivayet etti. Ve hadîsi ref etti. Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuşlar: «Gerçekten Allah (Azze ve Celle) rohime bir melek vekîl kılmıştır. (Bu melek) : — Ey Rabbim! Nutfe. Ey Rabbim! Pıhtı. Ey Rabbim! Et parçası, der. Allah bir şeyi yaratmak murad ettiği vakit melek : — Ey Rabbim i Erkek mi, yokta dişi mi? Şakî mi, yoksa saîd mî? Rızk ne olacak? Ecel ne olacak? diye sorar. Ve böylece annesinin karnında iken yazılır.» İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 6731,
      "arabicNumber": "2647.01",
      "book": 46,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ، قَالَ كُنَّا فِي جَنَازَةٍ فِي بَقِيعِ الْغَرْقَدِ فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَعَدَ وَقَعَدْنَا حَوْلَهُ وَمَعَهُ مِخْصَرَةٌ فَنَكَّسَ فَجَعَلَ يَنْكُتُ بِمِخْصَرَتِهِ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ مَا مِنْ نَفْسٍ مَنْفُوسَةٍ إِلاَّ وَقَدْ كَتَبَ اللَّهُ مَكَانَهَا مِنَ الْجَنَّةِ وَالنَّارِ وَإِلاَّ وَقَدْ كُتِبَتْ شَقِيَّةً أَوْ سَعِيدَةً ‏\"‏ ‏.‏ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَفَلاَ نَمْكُثُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ فَقَالَ ‏\"‏ مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ السَّعَادَةِ وَمَنْ كَانَ مِنْ أَهْلِ الشَّقَاوَةِ فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ الشَّقَاوَةِ ‏\"‏ ‏.‏ فَقَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ السَّعَادَةِ وَأَمَّا أَهْلُ الشَّقَاوَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ الشَّقَاوَةِ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{‏ فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى * فَسَنُيَسِّرُهُ لِلْيُسْرَى * وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى * وَكَذَّبَ بِالْحُسْنَى * فَسَنُيَسِّرُهُ لِلْعُسْرَى‏}‏",
        "translations": {
          "en": "Ali reported:We were in a funeral in the graveyard of Gharqad when Allah's Messenger (ﷺ) came to us and we sat around him. He had a stick with him. He lowered his head and began to scratch the earth with his stick, and then said: There is not one amongst you whom a seat in Paradise or Hell has not been allotted and about whom it has not been written down whether he would be an evil person or a blessed person. A person said: Allah's Messenger, should we not then depend upon our destiny and abandon our deeds? Thereupon he said: Acts of everyone will be facilitated in that which has been created for him so that whoever belongs to the company of the blessed will have good works made easier for him and whoever belongs to the unfortunate ones will have evil acts made easier for him. He then recited this verse (from the Qur'an): \"Then, who gives to the needy and guards against evil and accepts the excellent (the truth of Islam and the path of righteousness it prescribes), We shall make easy for him the easy end and who is miserly and considers himself above need, We shall make easy for him the difficult end\" (xcii)",
          "ur": "جریر نے ہمیں منصور سے حدیث بیان کی ۔ انہون نے سعید بن عبیدہ سے ، انہوں نے ابوعبدالرحمٰن سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، کہا : ہم ایک جنازے کے ساتھ بقیع غرقد میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور بیٹھ گئے ، ہم آپ صلی اللہ علیہ وسلم کے اردگرد بیٹھ گئے ۔ آپ نے اپنا سر مبارک جھکا لیا اور اپنی چھڑی سے زمین کریدنے لگے ( جس طرح کہ فکر مندی کے عالم میں ہوں ۔ ) پھر فرمایا : \" تم میں سے کوئی ایک بھی نہیں ، کوئی سانس لینے والا جاندار شخص نہیں ، مگر اللہ تعالیٰ نے ( اپنے ازلی ابدی حتمی علم کے مطابق ) جنت یا جہنم میں اس کا ٹھکانا لکھ دیا ہے اور ( کوئی نہیں ) مگر ( یہ بھی ) لکھ دیا گیا ہے کہ وہ بدبخت ہے یا خوش بخت ۔ \" کہا : تو کسی آدمی نے کہا : اللہ کے رسول! کیا ہم اپنے لکھے پر ہی نہ رہ جائیں اور عمل چھوڑ دیں؟ تو آپ نے فرمایا : \" جو خوش بختوں میں سے ہو گا تو وہ خوش بختوں کے عمل کی طرف چل پڑے گا ۔ \" پھر آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا : \" عمل کرو ، ہر ایک کا راستہ آسان کر دیا گیا ہے ۔ جو خوش بخت ہیں ان کے لیے خوش بختوں کے اعمال کا راستہ آسان کر دیا جاتا ہے اور جو بدبخت ہیں ان کے لیے بدبختوں کے عملوں کا راستہ آسان کر دیا جاتا ہے ۔ \" پھر آپ صلی اللہ علیہ وسلم نے تلاوت کیا : \" پس وہ شخص جس نے ( اللہ کی راہ میں ) دیا اور تقویٰ اختیار کیا اور اچھی بات کی تصدیق کر دی تو ہم اسے آسانی کی زندگی ( تک پہنچنے ) کے لیے سہولت عطا کریں گے اور وہ جس نے بخل کیا اور بے پروائی اختیار کی اور اچھی بات کی تکذیب کی تو ہم اسے مشکل زندگی ( تک جانے ) کے لیے سہولت دیں گے ۔",
          "fr": "Rapporté par Ali رضي الله عنه : Nous assistions à des funérailles dans le cimetière de Gharqad lorsque le Messager d’Allah ﷺ vint vers nous et nous nous sommes assis autour de lui. Il avait un bâton avec lui, baissa la tête et se mit à gratter la terre avec son bâton, puis il dit : « Il n’y a pas un seul parmi vous à qui une place au Paradis ou en Enfer n’ait pas été attribuée, et il a déjà été écrit s’il sera une personne mauvaise ou bénie. » Quelqu’un demanda : « Ô Messager d’Allah, ne devrions-nous pas alors nous reposer sur notre destin et abandonner les actes ? » Il répondit : « Les actes de chacun seront facilités dans ce pour quoi il a été créé ; ainsi, celui qui fait partie des bienheureux trouvera les bonnes actions faciles, et celui qui fait partie des malheureux trouvera les mauvaises actions faciles. » Il récita ensuite ce verset : « Celui qui donne aux nécessiteux, craint le mal et accepte le meilleur (la vérité de l’islam et la voie droite qu’elle enseigne), Nous lui faciliterons la voie facile. Mais celui qui est avare et se croit au-dessus du besoin, Nous lui faciliterons la voie difficile. » (Coran 92 :)",
          "id": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ishaq bin Ibrahim] lafazh ini milik Zuhair. [Ishaq] berkata; Telah mengabarkan kepada kami. Sedangkan yang lainnya berkata; Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Sa'ad bin 'Ubaidah] dari [Abu 'Abdur Rahman] dari ['Ali] dia berkata; \"Kami pernah menguburkan jenazah di pemakaman Baqi Al Gharqad. Tak lama kemudian, Rasulullah shallallahu 'alaihi wasallam datang kepada kami. Lalu beliau duduk dan kami pun duduk mengelilingi beliau. Setelah itu Rasulullah memegang sebuah batang kayu pendek dan beliau menggaris-gariskan dan memukul-mukulkannya diatas tanah seraya berkata: 'Tidaklah seseorang diciptakan melainkan Allah telah menentukan tempatnya di surga ataupun di neraka, serta ditentukan pula sengsaranya atau bahagianya.' Ali bin Abu Thalib berkata; 'Kemudian seseorang bertanya; 'Ya Rasulullah, kalau begitu apakah sebaiknya kami berdiam diri saja tanpa harus berbuat apa-apa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Barang siapa termasuk dalam golongan orang-orang yang beruntung, maka ia pasti akan mengerjakan amal perbuatan orang-orang yang beruntung. Sebaliknya barang siapa termasuk dalam golongan orang-orang yang sengsara, maka ia pasti akan mengerjakan amal perbuatan orang-orang yang sengsara.' Selanjutnya Rasulullah shallallahu 'alaihi wasallam bersabda: 'Berbuatlah! Karena masing-masing telah dipermudah untuk berbuat sesuai dengan ketentuan sengsara dan bahagianya. Orang yang termasuk dalam golongan orang-orang yang berbahagia akan dimudahkan untuk mengerjakan amal perbuatan orang-orang yang beruntung. Dan orang yang termasuk dalam golongan orang-orang yang sengsara akan dimudahkan untuk mengerjakan amal perbuatan orang-orang yang sengsara.' Setelah itu Rasulullah pun membacakan ayat Al Qur'an: 'Adapun orang yang memberikan hartanya di jalan Allah dan bertakwa serta membenarkan adanya pahala yang terbaik (surga), maka Kami akan menyiapkan baginya jalan yang mudah. Adapun orang yang bakhil dan merasa dirinya cukup serta mendustakan adanya pahala yang terbaik, maka Kami akan menyiapkan baginya jalan yang sukar.' (Qs. A1-LaiI (92): 5-10). Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hannad bin As Sari] keduanya berkata; Telah menceritakan kepada kami [Abu Al Ahwash] dari [Manshur] melalui jalur ini dengan Hadits yang semakna dan dia berkata; 'Lalu beliau mengambil 'Uud.' (sebatang kayu), ' -bukan mikhsharah.- Ibnu Abu Syaibah berkata di dalam Haditsnya dari Abul Ahwash; lalu Rasulullah shallallahu 'alaihi wasallam membaca…",
          "tr": "Bize Osman b. Ebi Şeybe ile Züheyr b. Harb ve İshâk h. İbrahim rivayet ettiler. Lâfız Züheyr'indir. İshâk: Ahberanâ; Ötekiler: Haddesenâ tâbirini kullandılar. (Dedilerki); Bize Cerîr Mânsûr'dan, o da Sa'd b. Ubeyde'den. o da Ebû Abdirrahman'dan, o da Ali'den naklen rivayet «ttİ. Ali şöyle demiş: Bakîu'I-Garkad de bir cenazede idik. Derken yanımıza Resûlullah (Sallallahu Aleyhi ve Sellem} geldi ve oturdu. Biz de etrafîna oturduk. Beraberinde bir âsâ vardı. Başını eğdi. Ve âsâ'sıyla yeri çizmeye başladı. Sonra şöyle buyurdu: «Sizden hiç bir kimse ve dünyaya geten biç bir nefis yoktur ki, Allah onun cennetden veya cehennemden yerini takdir etmemiş olsun! Ve şakî yahut saîd yazılmış olmasın!» Bunun üzerine bir adam: — Yâ Resûlallah! Biz kitabımız üzere durarak ameli bırakmayalım mı? dedi. Bunun üzerine: «He»- kim saadet ehlinden ise, saadet ehlinin ameline varacak ve her kim şekavet ehlinden ise, şekavet ehlinin ameline varacaktır.» buyurdu. Şunu da ilâve etti: «Amel edm! Herkese imkân verilmiştir. Saadet ehline, saadet ehlinin ameli müyesser olacaktsr. Şekavet ehline ise, şekavet ehlinin amelî müyesser olacaktır.» Sonra şu âyeti okudu: «5- Bundan böyle her kim malını hayır için verir ve korunursa, 6- Ve en güzel olanı doğrularsa, 7- Biz onu en kolay yola muvaffak kılacağız. 8- Kim de cimrilik eder ve kendini hiçbir şeye ihtiyacı kalmamış görür. 9- Ve en güzeli de yalanlarsa, 10- Onu da en zor yola hazırlarız. .» [Leyl 5 den 10 a]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 6732,
      "arabicNumber": "2647.02",
      "book": 46,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ مَنْصُورٍ، بِهَذَا الإِسْنَادِ فِي مَعْنَاهُ وَقَالَ فَأَخَذَ عُودًا ‏.‏ وَلَمْ يَقُلْ مِخْصَرَةً ‏.‏ وَقَالَ ابْنُ أَبِي شَيْبَةَ فِي حَدِيثِهِ عَنْ أَبِي الأَحْوَصِ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Mansur with the same chain of transmitters but with a slight variation of wording",
          "ur": "ابوبکر بن ابی شیبہ اور ہناد بن سری نے ہمیں حدیث بیان کی ، انہوں نے کہا : ہمیں ابو احوص نے منصور سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی اور کہا : آپ صلی اللہ علیہ وسلم نے ایک لکڑی پکڑی اور چھڑی نہیں کہا ۔ اور ابن ابی شیبہ نے ابو احوص سے بیان کردہ اپنی حدیث میں ( \" آپ صلی اللہ علیہ وسلم نے \" کی جگہ ) کہا : پھر رسول اللہ صلی اللہ علیہ وسلم نے تلاوت کیا ۔",
          "fr": "Rapporté par Ali رضي الله عنه : Ce hadith a été rapporté par Mansur avec la même chaîne de transmetteurs, mais avec une légère variation dans les mots",
          "tr": "{M-6} Bize Ebû Bckr b. Ebî Şeybe ile Hennad b. Seriy rivayet ettiler. (Dedilerki): Bize Ebu'l-Ahvas Mansûr'dan bu İsnadla bu hadîsin mânâsında rivayette bulundu. Ve: «Bir sopa aldı...» dedi. Asâ demedi. İbnü Ebî Şeybe, Ebû'l-Ahvas'dan rivayet ettiği kendi hadîsinde: «Sonra Resûlullah {Sallallahu Aleyhi ve Sellem) okudu.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 6733,
      "arabicNumber": "2647.03",
      "book": 46,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالُوا حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ جَالِسًا وَفِي يَدِهِ عُودٌ يَنْكُتُ بِهِ فَرَفَعَ رَأْسَهُ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ نَفْسٍ إِلاَّ وَقَدْ عُلِمَ مَنْزِلُهَا مِنَ الْجَنَّةِ وَالنَّارِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَلِمَ نَعْمَلُ أَفَلاَ نَتَّكِلُ قَالَ ‏\"‏ لاَ ‏.‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{‏ فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ إِلَى قَوْلِهِ ‏{‏ فَسَنُيَسِّرُهُ لِلْعُسْرَى‏}‏",
        "translations": {
          "en": "Ali reported that one day Allah's Messenger (ﷺ) was sitting with a wood in his hand and he was scratching the ground. He raised his head and said:There is not one amongst you who has not been allotted his seat in Paradise or Hell. They said: Allah's Messenger. then, why should we perform good deeds, why not depend upon our destiny? Thereupon he said. No, do perform good deeds, for everyone is facilitated in that for which he has been created; then he recited this verse:\" Then, who gives to the needy and guards against evil and accepts the excellent (the truth of Islam and the path of righteousness it prescribes), We shall make easy for him the easy end...\" (xcii)",
          "ur": "وکیع ، عبداللہ بن نمیر اور ابومعاویہ نے کہا : ہمیں اعمش نے سعد بن عبیدہ سے حدیث بیان کی ، انہوں نے ابوعبدالرحمٰن سلمی سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ایک دن بیٹھے ہوئے تھے ، اور آپ کے ہاتھ میں ایک چھڑی تھی جس سے آپ زمین کرید رہے تھے ، پھر آپ نے اپنا سر اقدس اٹھا کر فرمایا : \" تم میں سے کوئی ذی روح نہیں مگر جنت اور دوزخ میں اس کا مقام ( پہلے سے ) معلوم ہے ۔ \" انہوں ( صحابہ ) نے عرض کی : اللہ کے رسول! پھر ہم کس لیے عمل کریں؟ ہم اسی ( لکھے ہوئے ) پر تکیہ نہ کریں؟ آپ نے فرمایا : \" نہیں ، تم عمل کرو ، ہر شخص کے لیے اسی کی سہولت میسر ہے جس ( کو خود اپنے عمل کے ذریعے حاصل کرنے ) کے لیے اس کو پیدا کیا گیا ۔ \" پھر آپ صلی اللہ علیہ وسلم نے : \" تو وہ شخص جس نے ( اللہ کی راہ میں ) دیا اور اچھی بات کی تصدیق کی \" سے لے کر \" تو ہم اسے مشکل زندگی ( تک جانے ) کے لیے سہولت دیں گے \" تک پڑھا ۔",
          "fr": "Rapporté par Ali رضي الله عنه : Un jour, le Messager d’Allah ﷺ était assis avec un morceau de bois à la main et il grattait le sol. Il leva la tête et dit : « Il n’y a pas un seul parmi vous à qui une place au Paradis ou en Enfer n’ait pas été attribuée. » Ils dirent : « Ô Messager d’Allah, alors pourquoi faire de bonnes actions, pourquoi ne pas se reposer sur notre destin ? » Il répondit : « Non, faites de bonnes actions, car chacun sera facilité dans ce pour quoi il a été créé. » Puis il récita ce verset : « Celui qui donne aux nécessiteux, craint le mal et accepte le meilleur (la vérité de l’islam et la voie droite qu’elle enseigne), Nous lui faciliterons la voie facile… » (Coran 92 :)",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe ile Züheyr b. Harb ve Ebû Saîd El-Eşec rivayet ettiler. (Dedilerki): Bize Vekî' rivayet etti. H. Btee İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. (Dediki): Bize A'meş rivayet etti. H. Bize Ebû Kureyb dahi rivayet etti. Lâfız onundur. (Dediki): Bize Ebû Muâviye rivayet etti, (Dediki): Bize A'meş, Sa'd b. Ubeyde'den, o da Ebû Abdirrahman Es-Sülemî'den, o da Ali'den naklen rivayet etti. (Şöyle demiş): Bir gün Resûlullah (Sallaliahu Aleyhi ve Sellem) oturuyordu. Elinde bir sopa olup, onunla yeri çiziyordu. Derken başını kaldırarak şöyle buyurdu: «Sîzden hiç bir kimso yoktur ki! Cennetten veya cehennemden yerî ma'lûm olmasınl» Ashnb: — Yâ Resûlallah! O halde niçin çalışıyoruz? Tevekkül etmeyelim mi? dediler. «Hayır! Çalışın, zira herkese ne maksatla yaratıldıysa, onun için imkân verilmiştir.» buyurdu. Sonra «Her kim atiyye verir, korunur ve hüsnayı tasdik ederse...» âyetlerini «Biz ona güçlüğü müyesser kılarız...»[Leyl 5 den 10'a] kavline kadar okudu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 6734,
      "arabicNumber": "2647.04",
      "book": 46,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، أَنَّهُمَا سَمِعَا سَعْدَ بْنَ عُبَيْدَةَ، يُحَدِّثُهُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of 'Ali through another chain of transmitters",
          "ur": "ہمیں شعبہ نے منصور اور اعمش سے حدیث بیان کی ، ان دونوں نے سعد بن عبیدہ سے سنا ، وہ ابوعبدالرحمٰن سلمی سے ، وہ حضرت علی رضی اللہ عنہ سے اور وہ نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کر رہے تھے ۔",
          "fr": "Rapporté par Ali رضي الله عنه : Ce hadith a été rapporté par une autre chaîne de transmetteurs",
          "tr": "{M-7} Bize Muhammed b. Müsennâ ile İbnî Beşgâr rivayet ettiler, (Dedilerki): Bize Muhammed b, Ca'fer rivayet etti. (Dediki); Bize Şu'be Mansûr ile A'meş'den rivayet etti. Onlar 4a Sa'd b. Ubeyde'yi Ebû Abdirrahman Es-Sülemî'den, o da Ali'den, o da Nebi (Sallallahu Aleyhi ve Scllem)'den naklen bu hadîsin mislini rivayet ederken işitmişler. İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 6735,
      "arabicNumber": "2648.01",
      "book": 46,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جَاءَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ قَالَ يَا رَسُولَ اللَّهِ بَيِّنْ لَنَا دِينَنَا كَأَنَّا خُلِقْنَا الآنَ فِيمَا الْعَمَلُ الْيَوْمَ أَفِيمَا جَفَّتْ بِهِ الأَقْلاَمُ وَجَرَتْ بِهِ الْمَقَادِيرُ أَمْ فِيمَا نَسْتَقْبِلُ قَالَ ‏\"‏ لاَ ‏.‏ بَلْ فِيمَا جَفَّتْ بِهِ الأَقْلاَمُ وَجَرَتْ بِهِ الْمَقَادِيرُ ‏\"‏ ‏.‏ قَالَ فَفِيمَ الْعَمَلُ قَالَ زُهَيْرٌ ثُمَّ تَكَلَّمَ أَبُو الزُّبَيْرِ بِشَىْءٍ لَمْ أَفْهَمْهُ فَسَأَلْتُ مَا قَالَ فَقَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir reported that Suriqa b. Malik b. Ju'shuin came and said:Allah's Messenger, explain our religion to us (in a way) as if we have been created just now. Whosoever deeds we do today, is it because of the fact that-the pens have dried (after recording them) and the destitiles have began to operate or these have effects in future? Thereupon he said: The pens have dried tmd destinies have begun to operate. (Suraqa b. Malik) said: If it Is so, then what is the use of doing good deeds? Zuhair said: Then Abu Zubair said something but I could not understand that and I said. What did he say? Thereupon he said: Act, for everyone is facilitated what he intends to do",
          "ur": "ابوخیثمہ زہیر ( بن حرب ) نے ابوزبیر سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا : حضرت سراقہ بن مالک بن جعشم رضی اللہ عنہ آئے اور عرض کی : اللہ کے رسول! آپ ہمارے لیے دین کو اس طرح بیان کیجئے ، گویا ہم ابھی پیدا کیے گئے ہیں ، آج کا عمل ( جو ہم کر رہے ہیں ) کس نوع میں آتا ہے؟ کیا اس میں جسے ( لکھنے والی ) قلمیں ( لکھ کر ) خشک ہو چکیں اور جو پیمارنے مقرر کیے گئے ہیں ان کا سلسلہ جاری ہو چکا ہے ( ہم بس انہی کے مطابق عمل کیے جا رہے ہیں؟ ) یا اس میں جو ہم از سر نو کر رہے ہیں ( پہلے سے ان کے بارے میں کچھ طے نہیں؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" نہیں ، بلکہ جسے لکھنے والی قلمیں ( لکھ کر ) خشک ہو چکیں اور جن کے مقرر شدہ پیمانوں کے مطابق عمل شروع ہو چکا ۔ \"\" انہوں نے کہا : تو پھر عمل کس لیے ( کیا جائے؟ ) زہیر نے کہا : پھر اس کے بعد ابوزبیر نے کوئی بات کی جو میں نہیں سمجھ سکا ، تو میں نے پوچھا : آپ صلی اللہ علیہ وسلم نے کیا فرمایا؟ انہوں نے کہا : ( آپ نے فرمایا : ) \"\" تم عمل کرو ، ہر ایک کو سہولت میسر کی گئی ہے ۔",
          "fr": "Rapporté par Jabir : Souraqa b. Malik b. Ju’shum vint et dit : « Ô Messager d’Allah, explique-nous notre religion comme si nous venions d’être créés. Les actions que nous faisons aujourd’hui, est-ce parce que les plumes ont déjà séché (après les avoir inscrites) et que les destins sont déjà en marche, ou bien auront-elles un effet dans le futur ? » Il répondit : « Les plumes ont séché et les destins sont déjà en marche. » (Souraqa b. Malik) demanda : « Si c’est ainsi, à quoi bon faire de bonnes actions ? » Zuhair dit : « Puis Abou Zoubayr a dit quelque chose que je n’ai pas compris, alors j’ai demandé : “Qu’a-t-il dit ?” Il répondit : “Agis, car chacun sera facilité vers ce qu’il veut faire.” »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Yunus]; Telah menceritakan kepada kami [Zuhair]; Telah menceritakan kepada kami [Abu Az Zubair]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Az Zubair] dari [Jabir] dia berkata; suatu ketika Suraqah bin Malik bin Ju'syam datang kepada Rasulullah seraya berkata; 'Ya Rasulullah, terangkanlah kepada kami agama ini, seolah-olah kami baru diciptakan! Apakah hakikat amalan hari ini? apakah karena telah tertulis oleh pena yang telah kering, dan taqdir yang pasti berlaku, ataukah amalan yang harus kita hadapi? Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak, tapi karena pena yang telah kering dan taqdir yang mesti berlaku.\" Suraqah Bin Malik berkata; 'lalu untuk apa kita beramal? Zuhair berkata; lalu Abu Az-Zubair berkata sesuatu yang tidak dapat aku pahami. Maka aku bertanya kepadanya tentang apa yang di ucapkan oleh beliau shallallahu 'alaihi wasallam, dia menjawab; \"Beramallah, karena semuanya akan dipermudah\". Telah menceritakan kepadaku [Abu Ath Thahir]; Telah mengabarkan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Abu Az Zubair] dari [Jabir bin 'Abdullah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang semakna. Di didalam disebutkan; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Setiap orang yang beramal akan dipermudah untuk melaksanakan amalnya",
          "tr": "Bize Ahmed b. Yûnus rivayet etti. (Dediki): Bize Züheyr rivayet etti. (Dediki): Bize Ebû'z-Zübeyr rivayet etti. H. Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Ebû Hayseme, Ebû'z-Zübeyr'den, o da Câbir'den naklen haber verdi. Câbir şöyle demiş: Sürâka b. Mâlik b. Cu'şum: — Yâ Resûlallah! Bize sanki şimdi yaratılmışız gibi dinimizi beyân et! Bugün amel ne hususta olacak? Hakkında kalemler kuruyup miktarların cereyan ettiği hususta mı? Yoksa istikbâlimize ait şeylerde mi? dedi. Resûlullah (Sallallahu Aleyhi ve Sellem): «Hayır! Bilâkis hakkında kalemler kuruyup miktarların cereyan ettiği hususta!» buyurdular. Sürâka: — O halde amel ne hakkında olacak? dedi, Züheyr şöyle demiş: Sonra Ebû'z-Zübeyr bir şey söyledi. Ama ben aklını denemek istedim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 6736,
      "arabicNumber": "2648.02",
      "book": 46,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْمَعْنَى وَفِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ عَامِلٍ مُيَسَّرٌ لِعَمَلِهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Jabir b. Abdullah with the same wording (and includes these words):\" Allah's Messenger (ﷺ) said: Every doer of deed is facilitated in his action",
          "ur": "عمرو بن حارث نے ابوزبیر سے ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی معنی میں روایت کی اور اس میں یہ الفاظ ہیں : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر عمل کرنے والا اپنے عمل کے لیے آسانی پاتا ہے ۔",
          "fr": "Rapporté par Jabir b. Abdullah : Ce hadith a été transmis avec les mêmes mots (et inclut ces paroles) : « Le Messager d’Allah ﷺ a dit : “Chaque personne est facilitée dans ses actions.” »",
          "tr": "{m-8} Bana Ebu’t-Tahir haber verdi (Dediki): Bize İbn-i Vehb (Dediki): Bana Amr b. Haris İbn-i Zübeyr’den oda Cabir bin Abdullah r.a. den rivayet etti. Cabir r.a. dediki: Müzeyne'den iki adam Resûlullah (Sallallahu AUyhi ve Sellem)'e geldiler de: — Yâ Resûlallah! Ne buyurursun? Bugün insanlar ne amel edecek, neye çaba gösterecekler? Haklarında hükmolunmuş ve bitmiş, geçmiş bir kader hakkında mı, yoksa istikballerine ait Nebilerinin kendilerine getirdiği ve haklarında hüccet sabit olan bir hususta mı? dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) : «Hayır! Bilâkis haklarında hüküm verilmiş ve geçmiş bir şey hususunda (amel edecekler) Allah (Azze ve Celle)'nin kitabında bunun tasdîkİ: Nefse v« bu nefsi kusursuz yaratıp kendisine sapıklığını, takvasını ilham eden Allah'a yemin olsun. [Şems 7-8] âyetidir.» buyurdu, dedi. İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 6737,
      "arabicNumber": "2649.01",
      "book": 46,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَزِيدَ الضُّبَعِيِّ، حَدَّثَنَا مُطَرِّفٌ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ أَعُلِمَ أَهْلُ الْجَنَّةِ مِنْ أَهْلِ النَّارِ قَالَ فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ قِيلَ فَفِيمَ يَعْمَلُ الْعَامِلُونَ قَالَ ‏\"‏ كُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Imran b. Husain repotted that it was said to Allah's Messenger (ﷺ):Has there been drawn a distinction between the people of Paradise and the denizens of hell? He said: Yes. It was again said: (If it is so), then What is the use of doing good deeds? Thereupon he said: Everyone is facilitated in what has been created for him",
          "ur": "حماد بن زید نے یزید ضبعی سے روایت کی ، کہا : ہمیں مطرف نے حضرت عمران بن حصین رضی اللہ عنہ سے حدیث بیان کی ، کہا : آپ صلی اللہ علیہ وسلم سے عرض کی گئی : اللہ کے رسول! کیا یہ معلوم ہے کہ جہنم والوں سے ( الگ ) جنت والے کون ہیں؟ کہا : آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ۔ \" کہا : عرض کی گئی : تو پھر عمل کرنے والے کس لیے عمل کریں؟ آپ نے فرمایا : \" ہر ایک کو اسی ( منزل کی طرف جانے ) کی سہولت میسر کر دی جاتی ہے جس ( تک اپنے اعمال کے ذریعے پہنچنے ) کے لیے اسے پیدا کیا گیا تھا ۔",
          "fr": "Rapporté par ‘Imran b. Husain : On a dit au Messager d’Allah ﷺ : « Une distinction a-t-elle été faite entre les gens du Paradis et les habitants de l’Enfer ? » Il a répondu : « Oui. » On lui a alors demandé : « Dans ce cas, à quoi sert de faire de bonnes actions ? » Il a dit : « Chacun est facilité vers ce pour quoi il a été créé. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Hammad bin Zaid] dari [Yazid Adh Dhuba'i]; Telah menceritakan kepada kami [Mutharif] dari ['Imran bin Hushain] dia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya; Ya Rasulullah, apakah penghuni surga dapat mengetahui siapa penghuni neraka? Beliau menjawab: 'Ya.' Imran bertanya lagi; Kalau begitu buat apa mereka beramal? Beliau menjawab; 'Setiap orang akan dipermudah untuk melaksanakan apa yang telah ditetapkan baginya.' Telah menceritakan kepada kami [Syaiban bin Farrukh]; Telah menceritakan kepada kami [Abdul Warits]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ishaq bin Ibrahim] dan [Ibnu Numair] dari [Ibnu 'Ulayyah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Yahya bin Yahya]; Telah mengabarkan kepada kami [Ja'far bin Sulaiman]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Al Mutsanna]; Telah menceritakan kepada kami [Muhammad bin Ja'far]; Telah menceritakan kepada kami [Syu'bah] seluruhnya dari [Yazid Ar Risyki] melalui jalur ini yang semakna dengan Hadits 'Abdu Warits. Dia berkata; Aku bertanya; 'Ya Rasulullah",
          "tr": "Bize Yahya b. Yahya rivayet etti. (Dediki): Bize Hammad b. Zeyd, Yezid ed-Dubai'den naklen haber verdi. (Demişki): Bize Mutarrif, İmran b. Husayn'dan rivayet etti. (Şöyle demiş): --Ya Resullah! Cennetliklerin Cehennemliklerden ayrıldığı malum oldu mu? denildir. ''Evet !'' buyurdu. -- O Halde amel edenler ne hususta amel edecekler ? denildi. ''Herkes'e yaratıldığı şey için imkan verilmiştir.'' buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 6738,
      "arabicNumber": "2649.02",
      "book": 46,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ عَنِ ابْنِ عُلَيَّةَ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ يَزِيدَ الرِّشْكِ، فِي هَذَا الإِسْنَادِ ‏.‏ بِمَعْنَى حَدِيثِ حَمَّادٍ وَفِي حَدِيثِ عَبْدِ الْوَارِثِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated through other chains of transmiters with slight variations of wording",
          "ur": "عبدالوارث ، ابن علیہ ، جعفر بن سلیمان اور شعبہ سب نے یزید رشک سے اسی سند کے ساتھ حماد کی حدیث کے ہم معنی روایت کی اور عبدالوارث کی حدیث میں ( عرض کی گئی کے بجائے ) اس طرح ہے : ( عمران بن حصین رضی اللہ عنہ نے ) کہا : میں نے عرض کی : اللہ کے رسول",
          "fr": "Rapporté par ‘Imran b. Husain : Ce hadith a été rapporté par d’autres chaînes de transmetteurs avec de légères différences dans les mots",
          "tr": "{M-9} Bize Şeyban b. Ferruh rivayet etti. (Dediki): Bize Abdu'l-Varis rivayet etti. H. Bize Ebu Bekr b. Ebi Şeybe ile Züheyr b. Harb İshak b. İbrahim ve İbni Numeyr, İbni Aliyye'den rivayet ettiler. H. Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Ca'fer b. Süleyman haber verdi. H. Bize İbni Nüsenna dahi rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. Bu ravilerin hepsi Yezid Er-Rişk'den bu isnadda Hammad'ın Hadis'i manasında rivayette bulunmuşlardır. Abdu'l-Varis'in hadis'inde: ''(Dediki): Ya Resulullah ! dedim'' ibaresi vardır. İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 6739,
      "arabicNumber": "2650",
      "book": 46,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَزْرَةُ بْنُ، ثَابِتٍ عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمُرَ، عَنْ أَبِي الأَسْوَدِ الدِّئَلِيِّ، قَالَ قَالَ لِي عِمْرَانُ بْنُ الْحُصَيْنِ أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ وَيَكْدَحُونَ فِيهِ أَشَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى عَلَيْهِمْ مِنْ قَدَرِ مَا سَبَقَ أَوْ فِيمَا يُسْتَقْبَلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ فَقُلْتُ بَلْ شَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى عَلَيْهِمْ قَالَ فَقَالَ أَفَلاَ يَكُونُ ظُلْمًا قَالَ فَفَزِعْتُ مِنْ ذَلِكَ فَزَعًا شَدِيدًا وَقُلْتُ كُلُّ شَىْءٍ خَلْقُ اللَّهِ وَمِلْكُ يَدِهِ فَلاَ يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ ‏.‏ فَقَالَ لِي يَرْحَمُكَ اللَّهُ إِنِّي لَمْ أُرِدْ بِمَا سَأَلْتُكَ إِلاَّ لأَحْزُرَ عَقْلَكَ إِنَّ رَجُلَيْنِ مِنْ مُزَيْنَةَ أَتَيَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالاَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ وَيَكْدَحُونَ فِيهِ أَشَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ مِنْ قَدَرٍ قَدْ سَبَقَ أَوْ فِيمَا يُسْتَقْبَلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ فَقَالَ ‏\"‏ لاَ بَلْ شَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ وَتَصْدِيقُ ذَلِكَ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ ‏{‏ وَنَفْسٍ وَمَا سَوَّاهَا * فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا‏}‏ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu al-Aswad reported that 'Imran b Husain asked him:What is your view, what the people do today in the world, and strive for, is it something decreed for them or preordained for them or will their fate in the Hereafter be deterrained by the fact that their Prophets brought them teaching which they did not act upon? I said: Of course, it is something which is predetermined for them and preordained for them. He (further) said: Then, would it not be an injustice (to punish them)? I felt greatly disturbed because of that, and said: Everything is created by Allah and lies in His Power. He would not be questioned as to what He does, but they would be questioned; thereupon he said to me: May Allah have mercy upon you, I did not mean to ask you but for testing your intelligence. Two men of the tribe of Muzaina came to Allah's Messenger (ﷺ) and said: Allah's Messenger, what is your opinion that the people do in the world and strive for, is something decreed for them; something preordained for them and will their fate in the Hereafter be determined by the fact that their Prophets brought them teachings which they did not act upon. and thus they became deserving of punishment? Thereupon, he said: Of course, it happens as it is decreed by Destiny and preordained for them, and this view is confirmed by this verse of the Book of Allah, the Exalted and Glorious:\" Consider the soul and Him Who made it perfect, then breathed into it its sin and its piety\" (xci)",
          "ur": "یحییٰ بن یعمر نے ابو اسود دیلی سے روایت کی ، کہا : حضرت عمران بن حصین رضی اللہ عنہ نے مجھ سے کہا : تمہارا کیا خیال ہے کہ جو عمل لوگ آج کر رہے ہیں اور اس میں مشقت اٹھا رہے ہیں ، کیا یہ ایسی چیز ہے جس کا ان کے بارے میں فیصلہ ہو چکا اور پہلے ہی سے مقدر ہے جو ان میں جاری ہو چکا ہے یا وہ نئے سرے سے ان کے سامنے پیش کی جا رہی ہے ، جس طرح اسے ان کے نبی صلی اللہ علیہ وسلم ان کے پاس لائے ہیں اور ان پر حجت قائم ہوئی ہے؟ میں نے جواب دیا : بلکہ جس طرح ان کے بارے میں فیصلہ ہو چکا ہے اور اس کا سلسلہ ان میں جاری ہے ۔ ( دیلی نے ) کہا : تو ( عمران بن حصین رضی اللہ عنہ نے ) کہا : تو کیا یہ ظلم نہیں؟ ( دیلی نے ) کہا : تو اس بات پر میں سخت خوفزدہ اور پریشان ہو کیا اور میں نے کہا : ہر چیز اللہ کی پیدا کی ہوئی ہے اور اس کی ملکیت ہے ۔ جو بھی وہ کرے اس سے پوچھا نہیں جا سکتا اور وہ ( اس کے مملوک بندے ) جو کریں ان سے پوچھا جا سکتا ہے ۔ تو انہوں نے مجھ سے کہا : اللہ تم پر رحم کرے! میں نے جو تم سے پوچھا صرف اسی لیے پوچھا تھا تاکہ تمہاری عقل کا امتحان لوں ۔ مزینہ کے دو آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی : اللہ کے رسول! آپ کس طرح دیکھتے ہیں ، لوگ جو عمل آج کر رہے اور اس میں مشقت اٹھا رہے ہیں کوئی ایسی چیز ہے جا کا ان کے بارے میں فیصلہ ہو چکا اور پہلے سے مقدر ہے جو ان میں جاری ہو چکی ہے یا وہ اب ان کے سامنے پیش کی جا رہی ہے ، جس طرح اسے ان کے رسول ان کے پاس لائے ہیں اور ان پر حجت تمام ہوئی ہے؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ، بلکہ بلکہ ایسی چیز ہے جو ان کے بارے میں طے ہو گئی ہے اور ان میں جاری ہو چکی ، اور اس کی تصدیق اللہ عزوجل کی کتاب میں ہے : \" اور نفس انسانی اور اس ذات کی قسم جس نے اس کو ٹھیک بنایا! پھر اس کو اس کی بدی بھی الہام کر دی اور نیکی بھی ۔",
          "fr": "Rapporté par Abu al-Aswad : ‘Imran b. Husain m’a demandé : « À ton avis, ce que les gens font aujourd’hui dans ce monde et pour quoi ils s’efforcent, est-ce quelque chose qui a été décrété ou prédestiné pour eux, ou bien leur sort dans l’au-delà dépendra-t-il du fait que leurs prophètes leur ont apporté des enseignements qu’ils n’ont pas suivis ? » J’ai répondu : « Bien sûr, c’est quelque chose qui a été prédéterminé et décrété pour eux. » Il a ajouté : « Alors, n’est-ce pas une injustice de les punir ? » Cela m’a beaucoup troublé et j’ai dit : « Tout est créé par Allah et dépend de Sa puissance. Il ne sera pas interrogé sur ce qu’Il fait, mais eux seront interrogés. » Il m’a alors dit : « Qu’Allah te fasse miséricorde, je ne t’ai posé la question que pour tester ton intelligence. » Deux hommes de la tribu de Muzaina sont venus voir le Messager d’Allah ﷺ et ont dit : « Ô Messager d’Allah, que penses-tu de ce que les gens font dans ce monde et pour quoi ils s’efforcent : est-ce quelque chose de décrété pour eux, prédestiné pour eux, et leur sort dans l’au-delà dépend-il du fait que leurs prophètes leur ont apporté des enseignements qu’ils n’ont pas suivis, ce qui les rend dignes de châtiment ? » Il a répondu : « Oui, cela se passe comme cela a été décrété par le Destin et prédestiné pour eux, et cela est confirmé par ce verset du Livre d’Allah, le Très-Haut et Glorieux : “Considère l’âme et Celui qui l’a façonnée, puis lui a inspiré son immoralité et sa piété.” » (Coran 91:)",
          "tr": "Bize İshak b. İbrahim el-Hanzali rivayet etti. (Dediki): Bize Osman b. Ömer rivayet etti. (Dediki): Bize Azra b. Sabit, Yahya b. Ukayl'dan o da Yahya b. Ya'mur'dan, o da Ebu'l-Esved ed-Dieli'den naklen rivayet etti. (Şöyle demiş): İmran b. Husayn bana şunu söyledi: --Ne dersin, İnsanların bu gün yapmakta olduğu ve hakkında çaba gösterdikleri şey, onlara takdir edilmiş ve geçmişte haklarında kaza buyurulmuş bir kader midir ? Yoksa geleceklerine ait Nebilerinin kendilerine getirdiği ve haklarında huccet sabit olan bir şeymidir ? Ben: -- Belki onlar hakkında kaza buyurulmuş ve geçmiş bir şeydir, dedim. İmran: -- O halde zulüm olmaz mı ? dedi. Ben bundan fena halde korktum ve: -- Her şey Allah'ın mahluku ve mülküdür. O yaptığından sorulmaz ! Ama mahluklar sorulurlar, dedim. İmran bana: -- Allah sana rahmet eylesin ! Ben sana sorduklarımla ancak senin aklını denemek istedim. Müzeyne'den iki adam Resulullah (Sallallahu Aleyhi ve Sellem)'e geldiler de: -- Ya Resulullah ! Ne buyurursun ? Bu gün insanlar ne amel edecek, neye çaba gösterecekler ? Haklarında hükmolunmuş ve bitmiş, geçmiş bir kader hakkında mı, yoksa istikballerine ait Nebilerinin kendilerine getirdiği ve haklarında huccet sabit olan bir hususta mı ? dediler. Resulullah (Sallallahu Aleyhi ve Sellem): ''Hayır ! bilakis haklarında hüküm verilmiş ve geçmiş bir şey hususunda (amel edecekler) Allah (Azze ve Celle)'nin Kitabında bunun tasdiki: ''Nefs'e ve o nefsi kusursuz yaratıp kendisine sapıklığını, takvasını ilham eden Allah'a yemin olsun! {[Şems 7 ve 8] ayetidir.'' buyurdu, dedi. İzah 2651 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 6740,
      "arabicNumber": "2651",
      "book": 46,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الرَّجُلَ لَيَعْمَلُ الزَّمَنَ الطَّوِيلَ بِعَمَلِ أَهْلِ الْجَنَّةِ ثُمَّ يُخْتَمُ لَهُ عَمَلُهُ بِعَمَلِ أَهْلِ النَّارِ وَإِنَّ الرَّجُلَ لَيَعْمَلُ الزَّمَنَ الطَّوِيلَ بِعَمَلِ أَهْلِ النَّارِ ثُمَّ يُخْتَمُ لَهُ عَمَلُهُ بِعَمَلِ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Verily, a man would perform the deeds of the people of Paradise for a long time, then his deeds would be concluded with the deeds of the people of Hell. And verily, a man would perform the deeds of the people of Hell for a long time, and then his deeds would be concluded with the deeds of the people of Paradise",
          "ur": "علاء کے والد ( عبدالرحمٰن ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ انسان ایک لمبی مدت تک اہل جنت کے سے عمل کرتا رہتا ہے ، پھر اس کے لیے اس کے عمل کا خاتمہ اہل جہنم کے سے عمل پر ہوتا ہے اور بلاشبہ ایک آدمی لمبا زمانہ اہل جہنم کے سے عمل کرتا رہتا ہے ، پھر اس کے لیے اس کے عمل کا خاتمہ اہل جنت کے سے عمل پر ہوتا ہے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Un homme peut accomplir longtemps les actions des gens du Paradis, puis finir par faire les actions des gens de l’Enfer. Et un homme peut accomplir longtemps les actions des gens de l’Enfer, puis finir par faire les actions des gens du Paradis. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami ['Abdul 'Aziz] yaitu Ibnu Muhammad dari [Al A'laa] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Ada orang yang mengamalkan amalan ahli surga pada waktu yang sangat lama, lalu ia menutup akhir hidupnya dengan amalan ahli neraka. Ada pula orang yang mengerjakan amalan ahli neraka pada waktu yang sangat lama, tetapi kemudian ia menutup akhir hidupnya dengan amalan ahli surga",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Abdü'l-Aıiz (yâni İbni Muhammed) Alâ'dan, o da babasından, o da Ebû Hureyre'den naklen rivayet ettiki: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuşlar: «Gerçekten bir kimse uzun zaman cennetliklerin amelini işler, sonra amelî cehennemliklerin ameliyle hitama erdirİlir. Bir kimse de uzun zaman cehennemliklerin amelini işler. Sonra ameli cennetliklerin ameliyle hitama erdirilir.» İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 6741,
      "arabicNumber": "112.02",
      "book": 46,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ ‏.‏ وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Sahl b. Sa'd reported it from Allah's Messenger (ﷺ) that a person performs deeds like the deeds of the people of Paradise apparently before people and he would be amongst the dwellers of Hell and a person acts apparently like the people of Hell, but (in fact) he would be among the dwellers of Paradise",
          "ur": "حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک شخص ، جس طرح وہ لوگوں کو نظر آ رہا ہوتا ہے ، اہل جنت کے سے عمل کر رہا ہوتا ہے ، لیکن ( آخر کار ) وہ اہل جہنم میں سے ہوتا ہے اور ایک آدمی ، جس طرح سے وہ لوگوں کو نظر آ رہا ہوتا ہے اہل جہنم کے سے عمل کر رہا ہوتا ہے لیکن ( انجام کار ) وہ اہل جنت میں سے ہوتا ہے ۔",
          "fr": "Rapporté par Sahl b. Sa’d : Le Messager d’Allah ﷺ a dit qu’une personne peut, aux yeux des gens, agir comme les gens du Paradis, mais être en réalité parmi les habitants de l’Enfer ; et une personne peut, apparemment, agir comme les gens de l’Enfer, mais être en réalité parmi les habitants du Paradis",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id]; Telah menceritakan kepada kami [Ya'qub] yaitu Ibnu 'Abdur Rahman Al Qari dan [Abu Hazim] dari [Sahl bin Sa'ad As Sa'idi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada seseorang yang melakukan amalan penghuni surga hingga terlihat oleh manusia menjadi penghuninya padahal ia termasuk penghuni neraka, sebaliknya ada seseorang yang melakukan amalan penghuni neraka hingga terlihat oleh manusia ia menjadi penghuninya padahal ia adalah penghuni surga",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Ya'kûb (yâni ibni Abdirrahman El-Kaâri), Ebû Hâzim'den, o da Sehl b. Sa'd Es-Saidîden naklen rivayet ettiki: Resûlullah (Sallallahu Aleyhi ve Sellem): «Gerçekten bir kimse kendisi cehennemliklerden olduğu halde insanlara zahir olan hususta cennetliklerin amelîni işler. Ve gerçekten bîr kimse kendisi cennetliklerden olduğu halde insanlara zahir olan hususta cehennemliklerin amelini işler.» buyurdular. İzah için buraya tıklayın DİKKAT BİR ÖNCEKİ SAYFA OLAN 2651’İN İZAHI İLE AYNIDIR"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 6742,
      "arabicNumber": "2652.01",
      "book": 46,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَإِبْرَاهِيمُ بْنُ دِينَارِ، وَابْنُ أَبِي عُمَرَ الْمَكِّيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ، الضَّبِّيُّ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ لاِبْنِ حَاتِمٍ وَابْنِ دِينَارٍ - قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ، عُيَيْنَةَ عَنْ عَمْرٍو، عَنْ طَاوُسٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجَّ آدَمُ وَمُوسَى فَقَالَ مُوسَى يَا آدَمُ أَنْتَ أَبُونَا خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنَ الْجَنَّةِ فَقَالَ لَهُ آدَمُ أَنْتَ مُوسَى اصْطَفَاكَ اللَّهُ بِكَلاَمِهِ وَخَطَّ لَكَ بِيَدِهِ أَتَلُومُنِي عَلَى أَمْرٍ قَدَّرَهُ اللَّهُ عَلَىَّ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً ‏\"‏ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَحَجَّ آدَمُ مُوسَى فَحَجَّ آدَمُ مُوسَى ‏\"‏ ‏.‏ وَفِي حَدِيثِ ابْنِ أَبِي عُمَرَ وَابْنِ عَبْدَةَ قَالَ أَحَدُهُمَا خَطَّ ‏.‏ وَقَالَ الآخَرُ كَتَبَ لَكَ التَّوْرَاةَ بِيَدِهِ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (way peace be upon him) as saying:There was argument between Adam and Moses. Moses said to Adam: You are our father. You did us harm and caused us to get out of Paradise. Adam said to him: You are Moses. Allah selected you (for direct conversation with you) and wrote with His own Hand the Book (Torah) for you. Despite this you blame me for an act which Allah had ordained for me forty years before He created me. Allah's Apostle (ﷺ) said:. This is how Adam came the better of Moses and Adam came the better of Moses",
          "ur": "محمد بن حاتم ، ابراہیم بن دینار ، ابن ابی عمر مکی اور احمد بن عبدہ ضبی نے ہمیں ابن عیینہ سے حدیث بیان کی ، الفاظ ابن حاتم اور ابن دینار کے ہیں ۔ ۔ ان دونوں نے کہا : ہمیں سفیان بن عمرو ( بن دینار ) سے حدیث بیان کی ، انہوں نے طاوس سے روایت کی ، انہوں نے کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" حضرت آدم اور حضرت موسیٰ علیہم السلام نے ( ایک دوسرے کو ) اپنی اپنی دلیلیں دیں ۔ حضرت موسیٰ علیہ السلام نے کہا : آدم! آپ ہمارے والد ہیں ، آپ نے ہمیں ناکام کر دیا اور ہمیں جنت سے باہر نکال لائے ۔ حضرت آدم علیہ السلام نے فرمایا : تم موسیٰ ہو ، تمہیں اللہ تعالیٰ نے اپنی ہم کلامی کے لیے منتخب فرمایا اور اپنے ہاتھ سے تمہارے لیے ( اپنے احکام کو ) لکھا ، کیا تم مجھے اس بات پر ملامت کر رہے ہو جسے اللہ تعالیٰ نے میرے بارے میں مجھے پیدا کرنے سے بھی چالیس سال پہلے مقدر کر دیا تھا؟ \"\" نبی صلی اللہ علیہ وسلم نے فرمایا : تو حضرت آدم علیہ السلام ( دلیل میں ) حضرت موسیٰ علیہ السلام پر غالب آ گئے ، حضرت آدم علیہ السلام حضرت موسیٰ علیہ السلام پر غالب آ گئے ۔ \"\" ابن ابی عمر اور ابن عبدہ کی حدیث میں ہے کہ ایک نے کہا : \"\" لکھا \"\" اور دوسرے نے کہا : \"\" تمہارے لیے اپنے ہاتھ سے تورات لکھی ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Il y a eu un débat entre Adam et Moussa. Moussa a dit à Adam : “Tu es notre père. Tu nous as causé du tort et tu nous as fait sortir du Paradis.” Adam lui a répondu : “Tu es Moussa. Allah t’a choisi pour te parler directement et Il a écrit de Sa propre main le Livre (la Torah) pour toi. Malgré cela, tu me reproches un acte qu’Allah avait décrété pour moi quarante ans avant de me créer.” Le Messager d’Allah ﷺ a dit : “C’est ainsi qu’Adam a eu le dessus sur Moussa, et Adam a eu le dessus sur Moussa.” »",
          "id": "Telah menceritakan kepadaku [Muhammad bin Hatim] dan [Ibrahim bin Dinar] dan [Ibnu Abu 'Umar Al Makki] dan [Ahmad bin 'Abdah Adh Dhabbi] seluruhnya dari [Ibnu 'Uyainah] dan lafazh ini milik Ibnu Hatim dan Ibnu Dinar keduanya berkata; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru] dari [Thawus] dia berkata; Aku mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adam dan Musa 'Alaihimas Salam saling berdebat. Musa berkata: 'Wahai Adam, engkau adalah bapak kami. Engkau telah mengecewakan kami dan mengeluarkan kami dari surga karena dosamu.' Adam menjawab: 'Wahai Musa, Allah telah memilihmu dengan kalam-Nya dan menulis Taurat untukmu dengan tangan-Nya. Apakah kamu mencelaku atas perkara yang telah Allah tentukan terhadapku empat puluh tahun sebelum Dia menciptakanku.' Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Maka argumentasi Adam mengalahkan Musa, maka argumentasi Adam mengalahkan Musa.' Dan di dalam Hadits Ibnu Abu Umar dan Abdah salah seorang dari mereka berkata dengan lafazh; 'Khattha.' (mencatat). Sedangkan yang lainnya mengatakan; 'Dia telah menuliskan untukmu kitab Taurat dengan tangan-Nya",
          "tr": "Bana Muhammed b. Hâtim ile İbrahim b. Dinar İbni Ebî Ömer El-Mekki ve Ahmed b. Abdete'd-Dabbî toptan İbnü Uyeyne'den rivâyet ettiler. Lâfız İbni Hatim ile İbni Dinar'ındır. (Dedilerki): Bize Süfyân b. Uyeyne, Amr'dan, o da Tâvus'daıı naklen rivayet etti. (Demişki): Ben Ebû Hureyre'yi şunu söylerken işittim: Resulullah (Sallallahu Aleyhi ve Sellem): «Âdemle Musa münakaşa ettiler. Musa : — Yâ Âdem, sen bizim babamızsın! Bizi mahrumiyete düşürdün ve bizi cennetten çıkardın! dedi. Âdem de ona : — Sen Musa'sın! Allah seni kelâmiyle seçkin kıldı. Ve senin için yed-i kudretiyle yazdı. Beni yaratmazdan kırk yıl önco Allah'ın bana takdir etttği bir şeyden dolayı muaheze mi ediyorsun? dedi.» Müteakiben Nebi (Sallallahu Aleyhi ve Sellemj: «Böylece Âdem, Musa'ya galebe çaldı! Böylece Âdem, Musa'ya galebe çaldı!» buyurdular. İbni Ebî Ömer ile İbni Abde hadîslerinde: «Biri (yazdı), diğeri: Senin için Tevrat'ı kendi yed-i kudretiyle yazdı» demişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 6743,
      "arabicNumber": "2652.02",
      "book": 46,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ تَحَاجَّ آدَمُ وَمُوسَى فَحَجَّ آدَمُ مُوسَى فَقَالَ لَهُ مُوسَى أَنْتَ آدَمُ الَّذِي أَغْوَيْتَ النَّاسَ وَأَخْرَجْتَهُمْ مِنَ الْجَنَّةِ فَقَالَ آدَمُ أَنْتَ الَّذِي أَعْطَاهُ اللَّهُ عِلْمَ كُلِّ شَىْءٍ وَاصْطَفَاهُ عَلَى النَّاسِ بِرِسَالَتِهِ قَالَ نَعَمْ ‏.‏ قَالَ فَتَلُومُنِي عَلَى أَمْرٍ قُدِّرَ عَلَىَّ قَبْلَ أَنْ أُخْلَقَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There was argument between Adam and Moses, and Adam came the better of Moses. Moses said to him: You are the same Adam who misled people, and caused them to get out of Paradise. Adam said: You are the same (Moses) whom Allah endowed the knowledge of everything and selected him amongst the people as His Messenger. He said: Yes. Adam then again said: Even then you blame me for an affair which had been ordained for me before I was created",
          "ur": "ابوزناد نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" حضرت آدم اور حضرت موسیٰ علیہم السلام نے ایک دوسرے کو دلائل دیے اور آدم علیہ السلام نے موسیٰ علیہ السلام کو دلیل دے ہرا دیا ۔ موسیٰ علیہ السلام نے ان سے کہا : آپ وہی آدم ہیں جنہوں نے ( خود غلطی کر کے اپنی اولاد کے ) لوگوں کو غلطیاں کرنے کا راستہ دکھایا اور انہیں جنت سے نکلوا دیا؟ تو آدم علیہ السلام نے فرمایا : تمہی ہو جسے اللہ نے ہر چیز کا علم دیا اور جسے لوگوں میں سے اپنی رسالت کے لیے منتخب فرمایا؟ انہوں نے کہا : ہاں ، ( تو آدم علیہ السلام نے ) فرمایا : تم مجھے اس بات پر ملامت کر رہے ہو جو مجھے پیدا کیے جانے سے بھی پہلے میرے مقدر کر دی گئی تھی؟",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Il y a eu un débat entre Adam et Moussa, et Adam a eu le dessus sur Moussa. Moussa lui a dit : “Tu es bien cet Adam qui a égaré les gens et les a fait sortir du Paradis.” Adam a répondu : “Tu es bien ce Moussa à qui Allah a donné la connaissance de toute chose et qu’Il a choisi parmi les gens comme Son Messager.” Moussa a dit : “Oui.” Adam a alors dit : “Et malgré cela, tu me reproches une affaire qui avait été décrétée pour moi avant même que je sois créé ?” »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari apa yang telah dibacakan kepadanya dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adam dan Musa pernah berdebat. Musa berkata kepada Adam; 'Kamu yang telah menyesatkan manusia dan mengeluarkan mereka dari Surga. Adam menjawab: 'Bukankah kamu yang telah diberikan oleh Allah ilmu tentang segala sesuatu dan dipilihnya dari yang lain dengan risalah-Nya? Musa menjawab: 'Ya.' Adam berkata; 'kalau begitu kenapa kamu mencelaku karena suatu perkara yang telah ditetapkan Allah Azza wa Jalla kepadaku sebelum aku diciptakan?",
          "tr": "Bize Kuteybe b. Saîd, Mâlik b. Enes'den —ona okunanlar meyanmda —, o da Ehû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hureyre'-den, naklen rivayet etti ki: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuşlar : «Âdem i!e Musa münakaşa ettiler de; Âdem, Musa'ya galebe çaldı, Musa ona : — Sen İnsanları azdıran ve onları cennetten çıkaran Âdem'sin! dedi. Âdem de: — Sen Allah'ın her şeyin ilmini verdiği ve risâletiy!e insanlar üzorine seçkin kıldığı kimsesin! dedi. Musa : — Evet! cevâbını verdi. Âdem : — O halde ben yaratılmazdan önce bana takdir buyurulan bir şey üzerine beni muaheze mi ediyorsun? dedi.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 6744,
      "arabicNumber": "2652.03",
      "book": 46,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ الأَنْصَارِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنِي الْحَارِثُ بْنُ أَبِي ذُبَابٍ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ هُرْمُزَ - وَعَبْدِ الرَّحْمَنِ الأَعْرَجِ قَالاَ سَمِعْنَا أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجَّ آدَمُ وَمُوسَى عَلَيْهِمَا السَّلاَمُ عِنْدَ رَبِّهِمَا فَحَجَّ آدَمُ مُوسَى قَالَ مُوسَى أَنْتَ آدَمُ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ وَأَسْجَدَ لَكَ مَلاَئِكَتَهُ وَأَسْكَنَكَ فِي جَنَّتِهِ ثُمَّ أَهْبَطْتَ النَّاسَ بِخَطِيئَتِكَ إِلَى الأَرْضِ فَقَالَ آدَمُ أَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلاَمِهِ وَأَعْطَاكَ الأَلْوَاحَ فِيهَا تِبْيَانُ كُلِّ شَىْءٍ وَقَرَّبَكَ نَجِيًّا فَبِكَمْ وَجَدْتَ اللَّهَ كَتَبَ التَّوْرَاةَ قَبْلَ أَنْ أُخْلَقَ قَالَ مُوسَى بِأَرْبَعِينَ عَامًا ‏.‏ قَالَ آدَمُ فَهَلْ وَجَدْتَ فِيهَا ‏{‏ وَعَصَى آدَمُ رَبَّهُ فَغَوَى‏}‏ قَالَ نَعَمْ ‏.‏ قَالَ أَفَتَلُومُنِي عَلَى أَنْ عَمِلْتُ عَمَلاً كَتَبَهُ اللَّهُ عَلَىَّ أَنْ أَعْمَلَهُ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَحَجَّ آدَمُ مُوسَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There was an argument between Adam and Moses (peace be upon both of them) in the presence of their Lord. Adam came the better of Moses. Moses said: Are you that Adam whom Allah created with His Hand and breathed into himHis sprit, and commanded angels to fall in prostration before him and He made you live in Paradise with comfort and ease. Then you caused the people to get down to the earth because of your lapse. Adam said: Are you that Moses whom Allah selected for His Messengership and for His conversation with him and conferred upon you the tablets, in which everything was clearly explained and granted you the audience in order to have confidential talk with you. What is your opinion, how long Torah would haye been written before I was created? Moses said: Forty years before. Adam said: Did you not see these words: Adam committed an error and he was enticed to (do so). He (Moses) said: Yes. Whereupon, he (Adam) said: Do you then blame me for an act which Allah had ordained for me forty years before He created me? Allah's Messenger (ﷺ) said: This is how Adam came the better of Moses",
          "ur": "حارث بن ابی ذباب نے یزید بن ہرمز اور عبدالرحمٰن اعرج سے روایت کی ، ان دونوں نے کہا : ہم نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" حضرت آدم اور حضرت موسیٰ علیہم السلام نے اپنے رب کے سامنے ایک دوسرے کو دلیلیں دیں اور حضرت آدم علیہ السلام دلیل میں حضرت موسیٰ علیہ السلام پر غالب آ گئے ، حضرت موسیٰ نے کہا : آپ وہ آدم ہیں جن کو اللہ تعالیٰ نے اپنے ہاتھ سے پیدا کیا ، اور آپ میں اپنی روح کو پھونکا اور آپ کو فرشتوں سے سجدہ کرایا اور آپ کو اپنی جنت میں رکھا ، پھر آپ نے اپنی غلطی سے لوگوں کو جنت سے نکلوا کر زمین میں اتروا دیا؟ حضرت آدم علیہ السلام نے فرمایا : تم وہ موسیٰ ہو جسے اللہ تعالیٰ نے اپنی رسالت اور اپنی ہم کلامی کے ذریعے سے فضیلت بخشی اور تمہیں ( تورات کی ) وہ تختیاں عطا کیں جن میں ہر چیز کی وضاحت ہے اور تمہیں سرگوشی کے لیے جانے والا بنا کر اپنا قرب عطا فرمایا ۔ ( تم یہ بتاؤ ) تمہارے علم کے مطابق اللہ نے میری پیدائش سے کتنی مدت پہلے تورات کو ( اس صورت میں ) لکھا ( جس طرح وہ تم پر نازل ہوئی؟ ) موسیٰ علیہ السلام نے کہا : چالیس سال سے ( قبل ۔ ) حضرت آدم علیہ السلام نے کہا : کیا تم نے اس میں یہ ( لکھا ہوا ) پایا : \" آدم نے اپنے پروردگار ( کے حکم ) سے سرتابی کی اور راہ سے ہٹ گیا \" ؟ ( حضرت موسیٰ علیہ السلام نے ) کہا : ہاں ، تو انہوں نے کہا : کیا تم مجھے اس بات پر ملامت کر رہے ہو کہ میں نے وہ کام کیا جو اللہ نے میری پیدائش سے چالیس سال پہلے مجھ پر لکھ دیا تھا کہ میں وہ کام کروں گا؟ \" رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس طرح آدم علیہ السلام نے دلیل سے موسیٰ علیہ السلام کو لاجواب کر دیا ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Il y a eu un débat entre Adam et Moussa (que la paix soit sur eux) devant leur Seigneur. Adam a eu le dessus sur Moussa. Moussa a dit : “Es-tu cet Adam qu’Allah a créé de Sa main, à qui Il a insufflé de Son esprit, à qui Il a ordonné aux anges de se prosterner devant toi, et qu’Il a fait vivre dans le Paradis dans le confort et la facilité ? Puis tu as fait descendre les gens sur terre à cause de ta faute.” Adam a répondu : “Es-tu ce Moussa qu’Allah a choisi pour transmettre Son message et pour parler avec Lui, à qui Il a donné les tablettes où tout était clairement expliqué, et à qui Il a permis de s’entretenir avec Lui en privé ? À ton avis, depuis combien de temps la Torah avait-elle été écrite avant que je sois créé ?” Moussa a dit : “Quarante ans avant.” Adam a dit : “N’as-tu pas vu ces mots : ‘Adam a commis une erreur et il a été tenté de le faire’ ?” Moussa a répondu : “Oui.” Adam a alors dit : “Alors, me reproches-tu un acte qu’Allah avait décrété pour moi quarante ans avant de me créer ?” Le Messager d’Allah ﷺ a dit : “C’est ainsi qu’Adam a eu le dessus sur Moussa.” »",
          "id": "Telah menceritakan kepada kami [Ishaq bin Musa bin 'Abdullah bin Musa bin 'Abdullah bin Yazid Al Anshari]; Telah menceritakan kepada kami [Anas bin 'Iyadh]; Telah menceritakan kepadaku [Al Harits bin Abu Dzubab] dari [Yazid] yaitu Ibnu Hurmuz dan ['Abdur Rahman Al A'raj] keduanya berkata; Kami mendengar [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Adam dan Musa alaihimas salam pernah berdebat di sisi Allah. Namun akhirnya Adam dapat mengalahkan Musa alaihi salam.\" Musa berkata; 'Kamulah Adam yang telah diciptakan Allah dengan kekuasaan-Nya. Kemudian Allah menghembuskan ruh-Nya ke dalam dirimu. Setelah itu, Allah memerintahkan semua malaikat-Nya untuk bersujud kepadamu dan Dia menempatkanmu di dalam surga-Nya, tetapi kemudian kamu membuat manusia turun ke bumi karena kesalahanmu.' Adam menjawab; 'Kamulah Musa yang telah dipilih Allah dengan risalah dan firman-Nya. Allah juga telah memberimu beberapa lembaran yang berisi penjelasan tentang segala sesuatu dan mendekatkanmu untuk menerima firman-Nya. Berapa tahunkah Allah telah menulis kitab Taurat sebelum aku diciptakan? ' Musa menjawab; 'Empat puluh tahun.' Adam bertanya lagi; 'Apakah kamu dapatkan, di dalam kitab Taurat, ayat yang berbunyi: '…dan durhakalah Adam kepada Tuhannya serta sesatlah ia.' (Qs. Thaahaa (20): 12 1).\" Musa menjawab; 'Ya.' Adam bertanya lagi; 'Mengapa kamu mencelaku karena suatu perbuatan yang telah ditetapkan Allah Azza wa Jalla empat puluh tahun sebelum Allah menciptakanku? ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Akhirnya Adam dapat memberikan jawaban kepada Musa",
          "tr": "Bize İshâk b. Musa b. Abdillah b. Musa b. Abdillah b. Yezid El-Ensârî rivayet etti. (Dediki): Bize Enes b. Iyâz rivayet etti. (Dediki): Bana Haris b. Ebî Zübab, Yezîd (bu zât İbni Hürmüz'dür) ile Abdurrahman EI-A'rac'dan rivayet etti. (Demişlerki): Biz Ebû Hureyre'nin şunu söylediğini dinledik. Resulullah (Sallallahu Aleyhi ve Sellem) buyurdular ki: «Âdem ile Musa (Aleyhisselâtn) Rableri nezdinde münakaşa ettiler de Âdem, Musa'ya galebe çaldı. Musa : — Sen o Âdem'sin ki, Allah seni kendi yed-i kudretiyle yaratmış. Sana kendi ruhundan üfürmüş. Sana melekleri secde ettirmiş ve seni cennetine iskân buyurmuştur. Sonra işlediğin günah sebebiyle insanları yeryüzüne indirdin, dedi. Âdem de : — Sen o Musa'sın ki; Allah seni Nebi göndermesi ve konuşmasıyla seçkin kılmış; sana içinde her şeyin beyânı bulunan levhaları vermiş ve seni sırdaş olarak kendine yaklaştırmıştır. Acaba Tevrat'ı Allah'ın ben yaratılmazdan kaç sene önce yazdığını buldun? dedi. Musa : — Kırk yıl (önce)! cevabını verdi. Âdem : — Onda: Âdem Rabbine isyan etti de azdı...[Ta-ha 121] âyetini buldun mu? dedi. Musa : — Evet! cevâbını verdi. Âdem : — O halde işlememi beni yaratmazdan kırk yıl Önce Allah'ın bana takdir ettiği bir ameli işledim diye beni muaheze mi ediyorsun? dedi.» Resûlullah (Sallallahu Aleyhi ve Sellem): «Böylece Âdem, Musa'ya galebe çaldı.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 6745,
      "arabicNumber": "2652.04",
      "book": 46,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، حَاتِمٍ قَالاَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ احْتَجَّ آدَمُ وَمُوسَى فَقَالَ لَهُ مُوسَى أَنْتَ آدَمُ الَّذِي أَخْرَجَتْكَ خَطِيئَتُكَ مِنَ الْجَنَّةِ فَقَالَ لَهُ آدَمُ أَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلاَمِهِ ثُمَّ تَلُومُنِي عَلَى أَمْرٍ قَدْ قُدِّرَ عَلَىَّ قَبْلَ أَنْ أُخْلَقَ فَحَجَّ آدَمُ مُوسَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There was an argument between Adam and Moses. Moses said: Are you that Adam whose lapse caused you to get out of Paradise? Adam said to him: Are you that Moses whom Allah selected for His Messengership, for His conversation and you blame me for an affair which had been ordained for me before I was created? This is how Adam came the better of Moses",
          "ur": "حمید بن عبدالرحمٰن نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" حضرت آدم اور حضرت موسیٰ علیہم السلام نے دلائل کا تبادلہ کیا ۔ موسیٰ علیہ السلام نے کہا : آپ آدم ہیں جن کی خطا نے انہیں جنت سے باہر نکالا؟ تو حضرت آدم علیہ السلام نے ان سے کہا : کیا تم موسیٰ ہو جسے اللہ نے اپنی رسالت اور ہم کلامی سے دوسروں پر فضیلت دی ، پھر تم مجھے اس معاملے میں ملامت کر رہے ہو جو میری پیدائش سے پہلے میرے لیے مقدر کر دیا گیا تھا؟ اس طرح آدم علیہ السلام نے موسیٰ علیہ السلام کو دلیل سے خاموش کر دیا ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Il y a eu un débat entre Adam et Moussa. Moussa a dit : “Es-tu cet Adam dont la faute t’a fait sortir du Paradis ?” Adam lui a répondu : “Es-tu ce Moussa qu’Allah a choisi pour transmettre Son message, pour parler avec Lui, et tu me reproches une affaire qui avait été décrétée pour moi avant même que je sois créé ?” C’est ainsi qu’Adam a eu le dessus sur Moussa. »",
          "id": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [Ibnu Hatim] keduanya berkata; Telah menceritakan kepada kami [Ya'qub bin Ibrahim]; Telah menceritakan kepada kami [Bapakku] dari [Ibnu Syihab] dari [Humaid bin 'Abdur Rahman] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Adam dan Musa alaihima salam pernah melakukan perdebatan. Musa berkata; 'Kamulah Adam yang karena kesalahanmu kamu dikeluarkan dari Surga. Adam menjawab; 'Kamulah Musa yang telah dipilih Allah dengan risalah dan firman-Nya. Tapi kenapa kamu mencelaku karena suatu perbuatan yang telah ditetapkan Allah Azza wa Jalla. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Akhirnya Adam dapat memberikan jawaban kepada Musa.' Telah menceritakan kepadaku ['Amru An Naqid]; Telah menceritakan kepada kami [Ayyub bin An Najjar Al Yamami]; Telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Ibnu Rafi']; Telah menceritakan kepada kami ['Abdur Razzaq]; Telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan Hadits yang semakna. Dan telah menceritakan kepada kami [Muhammad bin Minhal Adh Dharir]; Telah menceritakan kepada kami [Yazid bin Zurai']; Telah menceritakan kepada kami [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam dengan Hadits yang serupa",
          "tr": "{M-15} Bana Züheyr b. Harb ile İbni Hatim rivayet ettiler. (Dedilerki): Bize Ya'kub b. İbrahim rivayet etti. (Dediki): Bize babam İbni Şihab'dan, o da Humeyd b. Abdirrahman'dan, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Âdem ile Musa münakaşa ettiler, Musa ona : — Sen o Âdem'sin ki; günahın seni cennetten çıkarmıştır, dedi. Âdem de ona : — Sen o Musa'sın ki: Allah seni rîsâlet ve konuşmasıyla seçkin kılmıştır. Sonra (bir de} beni yaratılmamdan önce takdir buyurulan bir şey üzerine muaheze ediyorsun! dedi. Böylece Âdem, Musa'ya galebe çaldı.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 6746,
      "arabicNumber": "2652.05",
      "book": 46,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَيُّوبُ بْنُ النَّجَّارِ الْيَمَامِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح",
        "translations": {
          "en": "Abu Huraira narrated a hadith like this through another chain of transmitters",
          "ur": "ابوسلمہ اور ہمام بن منبہ نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ان ( گزشتہ راویوں ) کی حدیث کے ہم معنی حدیث بیان کی ۔",
          "fr": "Rapporté par Abu Huraira : Un hadith similaire a été rapporté par une autre chaîne de transmetteurs",
          "tr": "{M-15-2} Bana Amru'n-Nâkid rivayet etti. (Dediki): Bize Eyyûb b. Neccar EI-Yemâmî rivayet etti. (Dediki): Bize Yahya b. Ebî Kesîr, Ebû Seleme'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'dan naklen rivayet etti. H. Bize İbni Râfi' de rivayet etti. (Dediki): Bize Abdürrezzak rivayet etti. (Dediki): Bize Ma'mer, Hemmam b. Münebbih'den, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen yukarkilerin hadîsi mânâsında rivayette bulundu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 6747,
      "arabicNumber": "2652.06",
      "book": 46,
      "hadithInBook": 25,
      "text": {
        "arabic": "وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي، هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمْ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters",
          "ur": "محمد بن سیرین نے ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے ان سب کی حدیث کے مانند حدیث بیان کی ۔",
          "fr": "Rapporté par Abu Huraira : Ce hadith a été rapporté d’Abu Huraira par une autre chaîne de transmetteurs"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 6748,
      "arabicNumber": "2653.01",
      "book": 46,
      "hadithInBook": 26,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم نَحْوَ حَدِيثِهِمْ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported a hadith like this through another chain of transmitters",
          "ur": "ابن وہب نے ہمیں حدیث بیان کی ، کہا : مجھے ابوہانی خولانی نے ابو عبدالرحمٰن حبلی سے خبر دی ، انہوں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" اللہ تعالیٰ نے آسمانوں اور زمین کو پیدا کرنے سے پچاس ہزار سال پہلے مخلوقات کی تقدیریں تحریر فرما دیں تھی ۔ فرمایا : اور اس کا عرش پانی پر تھا ۔",
          "fr": "Rapporté par Abu Huraira : Un hadith similaire a été rapporté par une autre chaîne de transmetteurs",
          "id": "Telah menceritakan kepadaku [Abu Ath Thahir Ahmad bin 'Amru bin 'Abdullah bin Sarh]; Telah menceritakan kepada kami [Ibnu Wahb]; Telah mengabarkan kepadaku [Abu Hani Al Khalwani] dari [Abu 'Abdur Rahman Al Hubuli] dari ['Abdullah bin 'Amru bin Al 'Ash] dia berkata; \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah telah menentukan takdir bagi semua makhluk lima puluh tahun sebelum Allah menciptakan langit dan bumi.' Rasulullah menambahkan: 'Dan arsy Allah itu berada di atas air.\" Telah menceritakan kepada kami [Ibnu Abu 'Umar]; Telah menceritakan kepada kami [Al Muqri]; Telah menceritakan kepada kami [Haiwah]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepadaku [Muhammad bin Sahl At Tamimi]; Telah menceritakan kepada kami [Ibnu Abu Maryam]; Telah mengabarkan kepada kami [Nafi'] yaitu Ibnu Yazid keduanya dari [Abu Hani] melalui jalur ini dengan Hadits yang serupa. Namun keduanya tidak menyebutkan lafazh: \"Dan 'arsy Allah itu berada di atas air",
          "tr": "{M-15-3} Bize Muhammed b. Minhal Ed-Darîr de rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Hişâm b. Hassan, Muhammed b. Sîrîn'den, o da Ebû Hureyre'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen yukarkilerin hadîsi gibi rivayette bulundu. İZAH 2653 TE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 6749,
      "arabicNumber": "2653.02",
      "book": 46,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ حَدَّثَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو، بْنِ الْعَاصِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ كَتَبَ اللَّهُ مَقَادِيرَ الْخَلاَئِقِ قَبْلَ أَنْ يَخْلُقَ السَّمَوَاتِ وَالأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍ - قَالَ - وَعَرْشُهُ عَلَى الْمَاءِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. 'Amr b. al-'As reported:I heard Allah's Messenger (ﷺ) as saying: Allah ordained the measures (of quality) of the creation fifty thousand years before He created the heavens and the earth, as His Throne was upon water",
          "ur": "حیوہ اور نافع بن یزید نے ابوہانی سے اسی سند کے ساتھ اسی حدیث کے مانند حدیث بیان کی مگر ان دونوں نے یہ نہیں کہا : \" اور اس کا عرش پانی پر تھا ۔",
          "fr": "Rapporté par Abdullah b. ‘Amr b. al-‘As : J’ai entendu le Messager d’Allah ﷺ dire : « Allah a fixé les mesures (de la création) cinquante mille ans avant de créer les cieux et la terre, alors que Son Trône était sur l’eau. »",
          "tr": "Bana Ebû't-Tâhir Ahmed b. Amr b. Abdillah b. Amr b. Şerh rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Ebû Hâni' EI-Havlânî, Ebû Abdirrahman El-Hubulî'den, o da Abdullah b. Amr b. Âs'dan naklen haber verdi. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem)i: «Allah mahlukatın miktarlarını göklerle yeri yaratmazdan elli bin sene önce yazdı. Arşı da su üzerinde İdi.» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 6750,
      "arabicNumber": "2654",
      "book": 46,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا نَافِعٌ، - يَعْنِي ابْنَ يَزِيدَ - كِلاَهُمَا عَنْ أَبِي هَانِئٍ، ‏.‏ بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُمَا لَمْ يَذْكُرَا وَعَرْشُهُ عَلَى الْمَاءِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Abu Hani with the same chain of transmitters, but there is no mention of\" His Throne was upon water",
          "ur": "حیوہ نے ہمیں حدیث بیان کی ، انہوں نے کہا : مجھے ابوہانی نے بتایا ، انہوں نے ابوعبدالرحمٰن حبلی سے سنا ، انہوں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ کو بیان کرتے ہوئے سنا ، کہا : انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" بنی آدم کے سارے دل ایک دل کی صورت میں اللہ تعالیٰ کی انگلیوں میں سے دو انگلیوں کے درمیان ہیں ، وہ جس طرح چاہتا ہے اسے ( ان سب کو ) گھماتا ہے ۔ \" اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ( دعا کرتے ہوئے ) فرمایا : \" اے اللہ! اے دلوں کو پھیرنے والے! ہمارے دلوں کو اپنی اطاعت پر پھیر دے ۔",
          "fr": "Rapporté par Abdullah b. ‘Amr b. al-‘As : Ce hadith a été rapporté par Abu Hani avec la même chaîne de transmetteurs, mais il n’est pas fait mention de : « Son Trône était sur l’eau. »",
          "id": "Telah menceritakan kepadaku [Zuhair bin Harb] dan [Ibnu Numair] keduanya dari [Al Muqri]. [Zuhair] berkata; Telah menceritakan kepada kami ['Abdullah bin Yazid Al Muqri] dia berkata; Telah menceritakan kepada kami [Haiwah]; Telah mengabarkan kepadaku [Abu Hani] bahwa dia mendengar [Abu 'Abdur Rahman Al Hubuli] dia mendengar ['Abdullah bin 'Amru bin Al 'Ash] berkata; bahwasanya ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya hati semua manusia itu berada di antara dua jari dari sekian jari Allah Yang Maha Pemurah. Allah Subhanahhu wa Ta'ala akan memalingkan hati manusia menurut kehendak-Nya.\" Setelah itu, Rasulullah shallallahu 'alaihi wasallam berdoa; 'Ya Allah, Dzat yang memalingkan hati, palingkanlah hati kami kepada ketaatan beribadah kepada-Mu",
          "tr": "{M-16} Bize İbni Ebî Ömer rivayet etti. (Dediki): Bize El-Mukri' rivayet etti. (Dediki): Bize Hayve rivayet etti. H. Bana Muhammed b. Sehl Et-Temîmî de rivayet etti. (Dediki): Bize İbni Ebî Meryem rivayet etti. Dediki); Bize Nâfi' (yâni İbni Zeyd) haber verdi. Her iki râvi Ebû Hâni'den naklen bu isnadla bu hadîsin mislini haber vermişlerdir. Yalnız onlar: «Arşı da su üzerindeydi...» cümlesini anmamışlardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 6751,
      "arabicNumber": "2655",
      "book": 46,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ كِلاَهُمَا عَنِ الْمُقْرِئِ، قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدُ، اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا حَيْوَةُ، أَخْبَرَنِي أَبُو هَانِئٍ، أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ قُلُوبَ بَنِي آدَمَ كُلَّهَا بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ كَقَلْبٍ وَاحِدٍ يُصَرِّفُهُ حَيْثُ يَشَاءُ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah b. Amr b. al-'As reported that he heard Allah's Messenger (ﷺ) as saying:Verily, the hearts of all the sons of Adam are between the two fingers out of the fingers of the Compassionate Lord as one heart. He turns that to any (direction) He likes. Then Allahs Messenger (ﷺ) said: 0 Allah, the Turner of the hearts, turn our hearts to Thine obedience",
          "ur": "عمرو بن مسلم نے طاوس سے روایت کی ، انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے متعدد صحابہ کو پایا وہ سب کے سب یہ کہتے تھے کہ ہر چیز ( اللہ کی مقرر کردہ ) مقدار سے ہے اور میں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر چیز ( اللہ کی مقرر کردہ ) مقدار سے ہے یہاں تک کہ ( کسی کام کو ) نہ کر سکنا اور کر سکنا بھی ، یا کہا : ( کسی کام کو ) کر سکنا اور نہ کر سکنا ( بھی اسی مقدار سے ہے ۔)",
          "fr": "Rapporté par Abdullah b. ‘Amr b. al-‘As : J’ai entendu le Messager d’Allah ﷺ dire : « En vérité, les cœurs de tous les fils d’Adam sont entre deux doigts parmi les doigts du Seigneur Miséricordieux, comme un seul cœur. Il les oriente comme Il veut. » Puis le Messager d’Allah ﷺ a dit : « Ô Allah, Toi qui fais tourner les cœurs, oriente nos cœurs vers Ton obéissance. »",
          "id": "Telah menceritakan kepadaku ['Abdul A'laa bin Hammad] dia berkata; Aku membaca Hadits [Malik bin Anas]; Demikian juga diriwayatkan dari jalur lainnya, Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari apa yang telah dibacakan kepadanya dari [Ziyad bin Sa'ad] dari ['Amru bin Muslim] dari [Thawus] dia berkata; \"Saya pernah mendapati beberapa orang sahabat Rasulullah shallallahu 'alaihi wasallam mengatakan; 'Segala sesuatu itu sesuai takdirnya.' Ibnu Thawus berkata; 'Saya pernah mendengar [Abdullah bin Umar] mengatakan; 'Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Segala sesuatu itu sesuai takdirnya, hingga kelemahan dan kecerdasan (atau kecerdasan dan kelemahan)",
          "tr": "Bana Züheyr b. Harb ile İbni Numeyr ikisi birden El-Mukrî'den rivayet ettiler. Züheyr dediki: Bize Abdullah b. Yezîd El-Mukrî rivayet etti. (Dediki): Bize Hayve rivayet etti. (Dediki): Bana Ebû Hâni' haber verdi. Kendisi Ebû Abdirrahman El-Hubulî'den, o da Abdullah h. Amr b. Âs'dan dinlemiş. O da Resûlullah (Sallallahu Aleyhi ve Sellem)'den şöyle buyururken dinlediğini söylemiş: «Şüphesiz ki, bütün Âdemoğullarının kalpleri bîr kalp gibi Rahmanın parmaklarından iki parmak arasındadır. Onu dilediği yere çevirir.» Bundan sonra Resûlullah (Sallallahu Aleyhi ve Sellem): «Allahım! Ey kalbleri çeviren! Bizim kalblerimizi taatına çevir!» diye dua etmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 6752,
      "arabicNumber": "2656",
      "book": 46,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ ح وَحَدَّثَنَا قُتَيْبَةُ، بْنُ سَعِيدٍ عَنْ مَالِكٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، أَنَّهُ قَالَ أَدْرَكْتُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُونَ كُلُّ شَىْءٍ بِقَدَرٍ ‏.‏ قَالَ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ شَىْءٍ بِقَدَرٍ حَتَّى الْعَجْزُ وَالْكَيْسُ أَوِ الْكَيْسُ وَالْعَجْزُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Tawus reported:I found some Companions of Allah's Messenger (ﷺ) as saying: Everything is by measure. And he further said: I heard Abdullah b. 'Umar as saying: There is a neasure for everything-even for incapacity and-capability",
          "ur": "محمد بن عباد بن جعفر مخزومی نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : مشرکین قریش تقدیر کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے بحث کرنے کے لیے آئے ، اس وقت ( یہ آیت ) نازل ہوئی : \" جس دن وہ جہنم میں اوندھے منہ گھسیٹے جائیں گے ، ( کہا جائے گا : ) دوزخ کا عذاب چکھو ، بےشک ہم نے ہر چیز کو ( طے شدہ ) مقدار کے مطابق بنایا ہے ۔",
          "fr": "Rapporté par Tawus : J’ai trouvé certains Compagnons du Messager d’Allah ﷺ qui disaient : « Tout est déterminé par une mesure. » Il a aussi dit : « J’ai entendu Abdullah b. ‘Umar dire : “Il y a une mesure pour toute chose, même pour l’incapacité et la capacité.” »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ziyad bin Isma'il] dari [Muhammad bin 'Abbad bin Ja'far Al Makhrumi] dari [Abu Hurairah] dia berkata; \"Pada suatu hari, kaum musyrik Quraisy datang menemui Rasulullah shallallahu 'alaihi wasallam untuk memperdebatkan masalah qadar (takdir). Tak lama kemudian, turunlah ayat Al Qur'an yang berbunyi: 'Ingatlah pada hari di mana mereka diseret ke neraka pada muka mereka. Dikatakan kepada mereka; 'Rasakanlah sentuhan api neraka. Sesungguhnya Kami menciptakan segala sesuatu menurut qadarnya.'\" (Al Qamar (54):",
          "tr": "Bana Abdü;l-A'lâ b. Hammad rivayet etti. (Dediki): Mâlik b. Enes'e okudum. H. Bize Kuteybe b. Saîd dahi Mâlik'den — ona okunanlar meyanında—, o da Ziyâd b. Sa'd'dan, o da Amr b. Müslim'den, o da Tâvus'dan naklen rivayet ettiki: (Şöyle demiş): (Sallallahu Aleyhi ve Sellem)'in ashabından bir takım insanlara yetiştim ki: Her şey kaderledir, diyorlar. Abdullah b. Ömer'i de şunu söylerken dinledim Resûlullah (Sallallahu Aleyhi ve Sellem): «Her şey kaderledir. Acz ve Keys yahut keys ve acz bile !» buyurdular. Kaadî İyâd bu hadisdeki Acz ve Keys kelimelerinin ibaredeki «şey» üzerine atfedilerek mecrur dahi rivayet edildiklerini söylemiş ve: «İhtimal buradaki âciz'den murad; zahirî mânâsıdır. Ki: O da kudretsizliktir. Bazıları onun yapılması gereken şeyi terketmek, sonraya bırakmak ve vaktini geçirmek mânâsına geldiğini söylemişlerdir. Bu kelimenin tâatlardan âciz kalmak mânâsına gelmesi dahi ihtimal olduğu gibi, dünya ve âhirete ait umumî işlerde acz kastedilmiş olması da muhtemeldir. Keys, aczin zıddı olup, neşat ve iktidar mânâsına gelir. Hadîs-i şerif âciz'in aczi, muktedirin kudreti bile mukadderdir manasınadır.» diyor. İZAH 2657 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 6753,
      "arabicNumber": "2657.01",
      "book": 46,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ زِيَادِ، بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ الْمَخْزُومِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ مُشْرِكُو قُرَيْشٍ يُخَاصِمُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْقَدَرِ فَنَزَلَتْ ‏{‏ يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ* إِنَّا كُلَّ شَىْءٍ خَلَقْنَاهُ بِقَدَرٍ‏}‏",
        "translations": {
          "en": "Abu Huraira reported that the polytheists of the Quraish came to have an argument with Allah's Messenger (ﷺ) in regard to Destiny and then this verse was revealed:\" On the day when they are dragged into the Fire upon their faces, taste the touch of Fire. Surely, We have created everything according to a measure\" (liv)",
          "ur": "اسحٰق بن ابراہیم اور عبد بن حمید نے ہمیں حدیث بیان کی ۔ ۔ الفاظ اسحٰق کے ہیں ۔ ۔ دونوں نے کہا : ہمیں عبدالرزاق نے خبر دی ، انہوں نے کہا؛ ہمیں معمر نے ابن طاوس سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا : جو ابوہریرہ رضی اللہ عنہ نے کہا ، میں نے اس سے بڑھ کر ( قرآن کے لفظ ) \"\" اللمم \"\" سے مشابہ کوئی اور چیز نہیں دیکھی ، نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ نے ابن آدم پر اس کے حصے کا زنا لکھ دیا ہے ، وہ لامحالہ اپنا حصہ لے گا ۔ آنکھ کا زنا ( جس کا دیکھنا حرام ہے اس کو ) دیکھنا ہے ۔ زبان کا زنا ( حرام بات ) کہنا ہے ، دل تمنا رکھتا ہے ، خواہش کرتا ہے ، پھر شرم گاہ اس کی تصدیق کرتی ہے ( اور وہ زنا کا ارتکاب کر لیتاہے ) یا تکذیب کرنی ہے ( اور وہ اس کا ارتکاب نہیں کرتا ۔ ) \"\" عبد نے اپنی روایت میں کہا : ابن طاوس نے اپنے والد سے روایت کی ( کہا : ) میں نے حضرت ابن عباس رضی اللہ عنہ سے سنا ، ( اس سند میں سماع کی صراحت ہے ۔)",
          "fr": "Rapporté par Abu Huraira : Les polythéistes de Quraysh ont discuté avec le Messager d’Allah ﷺ au sujet du Destin, puis ce verset a été révélé : « Le jour où ils seront traînés sur leurs visages dans le Feu : “Goûtez le contact du Feu.” Nous avons certes créé toute chose selon une mesure. » (Coran 54:)",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan ['Abd bin Humaid] dan lafazh ini milik Ishaq dia berkata; Telah mengabarkan kepada kami ['Abdur Razzaq] Telah menceritakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [Bapaknya] dari [Ibnu Abbas] dia berkata; 'Saya tidak berpendapat tentang sesuatu yang paling dekat dengan makna Al lamam (dosa dosa kecil) selain dari apa yang telah dikatakan oleh [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam: \"Sesungguhnya Allah Allah `Azza Wa Jalla telah menetapkan pada setiap anak cucu Adam bagiannya dari perbuatan zina yang pasti terjadi dan tidak mungkin dihindari. Maka zinanya mata adalah melihat, zinanya lisan adalah ucapan, sedangkan nafsu berkeinginan dan berangan-angan, dan kemaluanlah sebagai pembenar atau tidaknya.\" 'Abad berkata; dalam riwayatkannya dari Ibnu Thawus dari Bapaknya dengan lafazh; 'Aku mendengar Ibnu 'Abbas",
          "tr": "Bize Ebû Bekr b. Ebî Şeyhe ile Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Veki' Süfyân'dan, o da Ziyâd b. İsmail'den, o da Muhammed b. Abbâd b. Ca'fer El-Mahzûmî'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Kureyş müşrikleri Resûlullah (Sallnllahu Aleyhi ve Sellem) ile kader hakkında münakaşaya geldiler. Bunun üzerine şu âyet-i kerîme nazil oldu: «O gün onlar yüzleri üstü cehennem'e sürüklenecekler. (Kendilerine) Sekar'ın çarpmasını tadın! Biz her şeyi kaderle halketmişizdir.» [Kamer 48 ve 49] (denilecek)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 6754,
      "arabicNumber": "2657.02",
      "book": 46,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لإِسْحَاقَ - قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَى أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ فَزِنَى الْعَيْنَيْنِ النَّظَرُ وَزِنَى اللِّسَانِ النُّطْقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يُصَدِّقُ ذَلِكَ أَوْ يُكَذِّبُهُ ‏\"‏ ‏.‏ قَالَ عَبْدٌ فِي رِوَايَتِهِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ سَمِعْتُ ابْنَ عَبَّاسٍ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:Verily Allah has fixed the very portion of adultery which a man will indulge in, and which he of necessity must commit. The adultery of the eye is the lustful look, and the adultery of the tongue is the licentious speech, the heart desires and yearns, which the parts may or may not put into effect",
          "ur": "ابوصالح نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" ابن آدم کے متعلق زنا میں سے اس کا حصہ لکھ دیا گیا ہے ۔ وہ لا محالہ اس کو حاصل کرنے والا ہے ، پس دونوں آنکھیں ، ان کا زنا دیکھنا ہے اور دونوں کان ، ان کا زنا سننا ہے اور زبان ، اس کا زنا بات کرنا ہے اور ہاتھ ، اس کا زنا پکڑنا ہے اور پاؤں ، اس کا زنا چل کر جانا ہے اور دل تمنا رکھتا ہے اور خواہش کرتا ہے اور شرم گاہ ان تمام باتوں کی تصدیق کرتی ہے ( اسے عملا سچ کر دکھاتی ہے اور حرام کا ارتکاب ہو جاتا ہے ) یا اس کی تکذیب کرتی ہے ( حقیقی زنا سے بچاؤ ہو جاتا ہے ۔)",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « En vérité, Allah a fixé la part d’adultère que chacun commettra, et il y succombera nécessairement. L’adultère des yeux, c’est le regard plein de désir ; l’adultère de la langue, c’est la parole indécente ; le cœur désire et espère, et les parties du corps peuvent ou non concrétiser cela. »",
          "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu Hisyam Al Makhzumi] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Suhail bin Abu Shalih] dari [bapaknya] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya manusia itu telah ditentukan nasib perzinaannya yang tidak mustahil dan pasti akan dijalaninya. Zina kedua mata adalah melihat, zina kedua telinga adalah mendengar, zina lidah adalah berbicara, zina kedua tangan adalah menyentuh, zina kedua kaki adalah melangkah, dan zina hati adalah berkeinginan dan berangan-angan, sedangkan semua itu akan ditindak lanjuti atau ditolak oleh kemaluan",
          "tr": "Bize İshâk b. İbrahim ile Abd b. Humeyd rivayet ettiler. Lâfız İshâk'ındır. (Dedilerki): Bize Abdürrezzâk haber verdi. (Dediki): Bize Ma'mer, İbni Tâvus'dan, o da babasından, o da İbni Abbâs'dan naklen rivayet etti. (Şöyle demiş): Ebû Hureyre'nin şu sözü söylediğinden daha ziyâde Lemem'e benziyen bir şey görmedim. Nebi (Sallallahu Aleyhi ve Sellem): «Hiç şüphe yok ki, Allah Âdemoğluna zinadan nasibini yazmıştır. Buna behemehal erişecektir. İmdi gözlerin zinası bakmak, dilin zinası da konuşmaktır. Nefis temenni eder de şehvetlenir. Ferc de buna ya tasdik eder ya tekzib!» buyurdular. Abd kendi rivayetinde: «İbni Tâvus'dan, o da babasından rivayet etti. (Demişki): Ben İbni Abbas'dan dinledim.» demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 6755,
      "arabicNumber": "2658.01",
      "book": 46,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُتِبَ عَلَى ابْنِ آدَمَ نَصِيبُهُ مِنَ الزِّنَى مُدْرِكٌ ذَلِكَ لاَ مَحَالَةَ فَالْعَيْنَانِ زِنَاهُمَا النَّظَرُ وَالأُذُنَانِ زِنَاهُمَا الاِسْتِمَاعُ وَاللِّسَانُ زِنَاهُ الْكَلاَمُ وَالْيَدُ زِنَاهَا الْبَطْشُ وَالرِّجْلُ زِنَاهَا الْخُطَا وَالْقَلْبُ يَهْوَى وَيَتَمَنَّى وَيُصَدِّقُ ذَلِكَ الْفَرْجُ وَيُكَذِّبُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying. Allah fixed the very portion of adultery which a man will indulge in. There would be no escape from it. The adultery of the eye is the lustful look and the adultery of the ears is listening to voluptuous (song or talk) and the adultery of the tongue is licentious speech and the adultery of the hand is the lustful grip (embrace) and the adultery of the feet is to walk (to the place) where he intends to commit adultery and the heart yearns and desires which he may or may not put into effect",
          "ur": "زُبیدی نے زہری سے روایت کی ، انہوں نے کہا : مجھے سعید بن مسیب نے حضرت ابوہریرہ رضی اللہ عنہ سے خبر دی کہ وہ کہا کرتے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر پیدا ہونے والا بچہ فطرت ( اللہ پر ایمان اور اچھائی کی محبت ) پر پیدا ہوتا ہے ، پھر اس کے ماں باپ اس کو یہودی ، نصرانی اور مجوسی بنا دیتے ہیں ، جیسے ایک جانور ( ماں ) کامل الاعضاء جانور ( بچے ) کو جنم دیتی ہے ، کیا تمہیں ان میں کوئی عضو کٹا ہوا جانور نظر آتا ہے؟ \" پھر حضرت ابوہریرہ رضی اللہ عنہ کہتے تھے : تم چاہو تو یہ آیت پڑھ لو : \" یہی اللہ کی ( عطا کردہ ) فطرت ہے جس پر اس نے لوگوں کی تخلیق فرمائی ، اللہ کی تخلیق میں ردوبدل نہیں ہوتا ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Allah a fixé la part d’adultère que chacun commettra, et il n’y a pas d’échappatoire. L’adultère des yeux, c’est le regard plein de désir ; l’adultère des oreilles, c’est écouter des propos ou des chants voluptueux ; l’adultère de la langue, c’est la parole indécente ; l’adultère de la main, c’est le contact ou l’étreinte ; l’adultère des pieds, c’est marcher vers l’endroit où il compte commettre l’adultère ; et le cœur désire et espère, ce qui peut ou non être réalisé. »",
          "id": "Telah menceritakan kepada kami [Hajib bin Al Walid] telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] telah mengabarkan kepadaku [Sa'id bin Al Musayyab] dari [Abu Hurairah], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Seorang bayi tidak dilahirkan (ke dunia ini) melainkan ia berada dalam kesucian (fitrah). Kemudian kedua orang tuanyalah yang akan membuatnya menjadi Yahudi, Nasrani, ataupun Majusi -sebagaimana hewan yang dilahirkan dalam keadaan selamat tanpa cacat. Maka, apakah kalian merasakan adanya cacat? ' Lalu Abu Hurairah berkata; 'Apabila kalian mau, maka bacalah firman Allah yang berbunyi: '…tetaplah atas fitrah Allah yang telah menciptakan manusia menurut fitrahnya itu. Tidak ada perubahan atas fitrah Allah.' (QS. Ar Ruum (30): 30). Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah]; telah menceritakan kepada kami ['Abdul 'Alaa] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami ['Abd bin Humaid]; telah mengabarkan kepada kami ['Abdurrazzaq] keduanya dari [Ma'mar] dari [Az Zuhri] dengan sanad ini dan dia berkata; 'Sebagaimana hewan ternak melahirkan anaknya. -tanpa menyebutkan cacat",
          "tr": "Bize İshâk b. Mansûr rivayet etti. (Dediki); Bize Ebû Hişâm El-Mahzûmî haber verdi. (Dediki): Bize Vûheyb rivayet etti. (Dediki): Bize Süheyl b. Ebi Salih babasından, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen rivayet etti. (Şöyle buyurmuşlar) : «Adomoğluna zinadan nasibi yazılmıştır. Buna behemehal erişecektir. Gözlerin zinası bakmak, kulakların zinası dinlemek, dilin zinası konuşmak, elin zinası tutmak, ayağın zinası da yürümektir. Kalb ise heves eder, diler. Ferc bunu ya tasdik eder ya tekzib!»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 6756,
      "arabicNumber": "2658.02",
      "book": 46,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُمَجِّسَانِهِ كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ‏\"‏ ‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ وَاقْرَءُوا إِنْ شِئْتُمْ ‏{‏ فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ‏}‏ الآيَةَ ‏.‏",
        "translations": {
          "en": "There is none born but is created to his true nature (Islam). It is his parents who make him a Jew or a Christian or a Magian quite as beasts produce their young with their limbs perfect. Do you see anything deficient in them? Then he quoted the Qur'an., The nature made by Allah in which He has created men there is no altering of Allah's creation; that is the right religion\" (ar-Rum:)",
          "ur": "معمر نے زہری سے اسی سند کے ساتھ روایت کی اور کہا : \" جس طرح ایک ( مادہ ) جانور بچے کو جنم دیتی ہے ۔ \" انہوں نے \" کامل الاعضاء \" ذکر نہیں کیا ۔",
          "fr": "Rapporté par Abu Huraira : Tout nouveau-né naît selon sa nature (l’Islam). Ce sont ses parents qui font de lui un Juif, un Chrétien ou un Mage, tout comme les animaux donnent naissance à des petits avec leurs membres intacts. Voyez-vous une quelconque déficience chez eux ? Puis il a cité le Coran : « La nature qu’Allah a donnée aux hommes, il n’y a pas de changement dans la création d’Allah ; voilà la religion droite. » (ar-Rum :)",
          "tr": "Bize Hâcib b. Velid rivayet etti. (Dediki): Bize Muhammed b. Harb Zubeydî'den, o da Zührî'den naklen rivayet etti. (Demişki): Bana Saîd b. Müseyyeh, Ebû Hureyre'den naklen haber verdiki, şöyle diyormuş; Resûlullah (Sallallahu Aleyhi ve Sellem): «Hiç bir doğan çocuk yoktur ki, fıtrat üzere doğmuş olmasın. Sonra onu annesi, babası yahûdileştirir; hıristiyanlaştınr ve mecûsîleştirirler. Tıpkı bir hayvanın dertop bir hayvan doğurduğu gibi. Bu hayvanda hiç bir kesik aza hissediyor musunuz?» buyurdular. Sonra Ebû Hureyre: İsterseniz şu âyeti okuyun! dedi. «O fıtrata ki, Allah insanları onun üzerine yaratmıştır. Allah'ın halkettiğini değiştirmek yoktur.» [Rum]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 6757,
      "arabicNumber": "2658.03",
      "book": 46,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، كِلاَهُمَا عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ وَقَالَ ‏ \"‏ كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ جَمْعَاءَ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters and there is no mention of his deficiency in limbs",
          "ur": "یونس بن یزید نے ابن شہاب سے روایت کی ، انہیں ابوسلمہ بن عبدالرحمٰن نے بتایا کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی پیدا ہونے والا بچہ نہیں مگر اس کی ولادت فطرت پر ہوتی ہے ۔ \" پھر ( ابوہریرہ رضی اللہ عنہ ) کہتے : یہ آیت پڑھ لو : \" یہی اللہ کی ( عطا کردہ ) فطرت ہے جس پر اس نے لوگوں کی تخلیق کی ، اللہ کی تخلیق میں تبدیلی نہیں ہو گی ، یہی سیدھا مستحکم دین ہے ( جس کی انسانی فطرت امانت دار ہے ۔)",
          "fr": "Rapporté par Abu Huraira : Ce hadith a été rapporté par Zuhri avec la même chaîne de transmetteurs, mais il n’est pas fait mention d’une déficience dans les membres",
          "id": "Telah menceritakan kepadaku [Abu Ath Thahir] dan [Ahmad bin 'Isa] mereka berdua berkata; telah menceritakan kepada kami [lbnu Wahb] telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] bahwasanya [Abu Salamah bin 'Abdurrahman] mengabarkan kepadanya bahwasanya [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Seorang bayi tidak dilahirkan (ke dunia ini) melainkan ia berada dalam kesucian (fitrah). Lalu dia berkata; Bacalah oleh kalian firman Allah yang berbunyi: '…tetaplah atas fitrah Allah yang telah menciptakan manusia menurut fitrahnya itu. Tidak ada perubahan atas fitrah Allah itulah agama yang lurus.' (QS. Ar Ruum (30):",
          "tr": "{m-22} Bize Ebû Bekr b. Ebî Şeybe rivayet etti, (Dediki): Bize Abdü'l-A'Iâ rivayet etti. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Abdürrezzâk haber verdi. Her iki râvi Ma'mer'den, o da Zührî'den naklen bu isnadla rivayet etmişlerdir. O: «Hayvan hayvan doğurduğu gibi...» demiş; «Der top» kelimesini anmamıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 6758,
      "arabicNumber": "2658.04",
      "book": 46,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ، يَزِيِدَ عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ ‏\"‏ ‏.‏ ثُمَّ يَقُولُ اقْرَءُوا ‏{‏ فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ ذَلِكَ الدِّينُ الْقَيِّمُ‏}‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No child is born but upon Fitra. He then said. Recite: The nature made by Allah in which He created man, there is no altering of Allah's nature; that is the right religion",
          "ur": "جریر نے اعمش سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی ولادت پانے والا نہیں مگر وہ فطرت ہی پر پیدا ہوا ہے ، پھر اس کے والدین اسے یہودی ، نصرانی اور مشرک بنا دیتے ہیں ۔ \" ایک آدمی نے کہا : اللہ کے رسول! اگر وہ اس سے پہلے مر جائے؟ آپ نے فرمایا : \" اللہ ہی زیادہ جاننے والا ہے کہ ( بڑے ہو کر ) وہ بچے کیا عمل کرنے والے تھے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Aucun enfant ne naît sans être sur la Fitra. » Puis il a dit : « Récitez : “La nature qu’Allah a donnée aux hommes, il n’y a pas de changement dans la création d’Allah ; voilà la religion droite.” »",
          "tr": "{m-22-2} Bana Ebû't-Tâhir ile Ahmed h. îsa rivayet ettiler. (Dedilerki): Bize İbni Vehb rivayet etti. (Dediki): Bana Yûnus b. Yezîd, İbni Şi-hab'dan naklen haber verdi. Ona da Ebû Seleme b. Abdirrahman haber vermişki, Ebû Hureyre (şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem): «Hiç bir doğan çocuk yoktur ki; fıtrat üzere doğmuş olmasın.» buyurdular. Sonra Ebû Hureyre (Şöyle demiş) : İsterseniz : «O fıtrattaki : \"Allah insanları onun üzerine yaratmıştır. Allah'ın halkettiğini değiştirmek yoktur. İşte dosdoğru din budur.\" âyetini okuyun!» demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 6759,
      "arabicNumber": "2658.05",
      "book": 46,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُلِدَ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُشَرِّكَانِهِ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ لَوْ مَاتَ قَبْلَ ذَلِكَ قَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No babe is born but upon Fitra. It is his parents who make him a Jew or a Christian or a Polytheist. A person said: Allah's Messenger, what is your opinion if they were to die before that (before reaching the age of adolescence when they can distinguish between right and wrong)? He said: It is Allah alone Who knows what they would be doing",
          "ur": "ابوبکر بن ابی شیبہ اور ابوکریب نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں ابومعاویہ نے حدیث بیان کی ، نیز ہمیں ابن نمیر نے بھی ( یہی ) حدیث بیان کی ، انہوں نے کہا : ہمیں میرے والد نے حدیث بیان کی ، ( ابومعاویہ اور ابن نمیر کے والد ) دونوں نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ۔ ابن نمیر کی حدیث میں ہے : \"\" کوئی بچہ پیدا ہونے والا بچہ نہیں مگر وہ ملت پر ہوتا ہے ۔ \"\" اور ابومعاویہ سے ابوبکر نے جو روایت کی اس میں ہے : \"\" مگر وہ اس ملت ( ملت اسلامی ) پر ہوتا ہے یہاں تک کہ اس کی زبان اس ( کے کفر یا ایمان ) کو بیان کر دیتی ہے ۔ \"\" اور ابومعاویہ سے ابوکریب کی روایت میں ہے : \"\" کوئی ولادت پانے والا نومولود نہیں مگر وہ اسی فطرت پر ہوتا ہے یہاں تک کہ اس کی زبان اس کے ( ماحول سے اخذ کردہ ) خیالات کی ترجمانی کرتی ہے ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Aucun bébé ne naît sans être sur la Fitra. Ce sont ses parents qui font de lui un Juif, un Chrétien ou un polythéiste. » Quelqu’un a demandé : « Ô Messager d’Allah, que penses-tu s’ils meurent avant cela (avant d’atteindre l’âge où ils peuvent distinguer le bien du mal) ? » Il a répondu : « C’est Allah seul qui sait ce qu’ils auraient fait. »",
          "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang bayi yang dilahirkan melainkan dalam keadaan fitrah, maka bapaknyalah yang menjadikannya Yahudi, atau Nasrani atau Musyrik.\" Lalu seseorang bertanya kepada beliau: \"Wahai Rasulullah, bagaimana pendapatmu jika bayi itu meninggal sebelum itu?\" Maka beliau bersabda: \"Allah lebih tahu dengan apa yang mereka kerjakan.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] mereka berdua berkata; telah menceritakan kepada kami [Abu Mu'awiyah] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Ibnu Numair], [bapakku] telah menceritakan kepada kami; keduanya dari [Al A'masy] dengan sanad ini dalam hadits Ibnu Numair dengan lafazh; \"Tidaklah setiap anak yang dilahirkan kecuali dalam keadaan di atas millah (Islam) \". Dan dalam riwayat Abu Bakr dari Abu Mu'awiyah; 'Kecuali di atas millah (agama Islam) ini.' Sedangkan dalam riwayat Abu Kuraib dari Abu Mu'awiyah; Tidaklah seorang anak yang dilahirkan kecuali berada di atas fitrah ini, hingga dia mengucapkannya dengan lisannya",
          "tr": "Bize Züheyr b. Harb rivayet etti. (Dediki): Bize Cerîr A'meş'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem) : «Hiç bir doğan çocuk yoktur ki; fıtrat üzere doğmuş olmasın! Sonra annesi; babası onu yahûdileştirir, hıristiyanlaştırır ve müşrikleştirirler.» buyurdular. Bunun üzerine bir adam : — Yâ Resûlallah! Bundan evvel ölürse ne buyurursun? dedi. «Allah onların ne yapacak olduklarını bilir.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 6760,
      "arabicNumber": "2658.06",
      "book": 46,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ حَدَّثَنَا أَبِي كِلاَهُمَا، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ فِي حَدِيثِ ابْنِ نُمَيْرٍ ‏\"‏ مَا مِنْ مَوْلُودٍ يُولَدُ إِلاَّ وَهُوَ عَلَى الْمِلَّةِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ عَنْ أَبِي مُعَاوِيَةَ ‏\"‏ إِلاَّ عَلَى هَذِهِ الْمِلَّةِ حَتَّى يُبَيِّنَ عَنْهُ لِسَانُهُ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي كُرَيْبٍ عَنْ أَبِي مُعَاوِيَةَ ‏\"‏ لَيْسَ مِنْ مَوْلُودٍ يُولَدُ إِلاَّ عَلَى هَذِهِ الْفِطْرَةِ حَتَّى يُعَبِّرَ عَنْهُ لِسَانُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "It is reported on the authority of Abu Mu'awiya that (the Holy Prophet) said:Every new-born babe is born on the millat (of Islam and he) remains on this until his tongue is enabled to express himself. This hadith has been narratted on the authority of Abu Mu'awiya through another chain of transmitters (and the words are):\" Every child is born but on this Fitra so long as he does not express himself with his tongue",
          "ur": "معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے سنائیں ، پھر انہوں نے کئی احادیث بیان کیں ، ان میں سے ایک حدیث یہ ہے : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو ( بچہ ) پیدا ہوتا ہے ، وہ اسی فطرت پر پیدا ہوتا ہے ، پھر اس کے والدین اس کو یہودی اور نصرانی بنا دیتے ہیں جس طرح تم اونٹوں کے بچوں کو جنم دلواتے ہو ۔ کیا تم ان میں سے کسی کو کان کٹا ہوا پاتے ہو؟ یہاں تک کہ تم خود اس کا کان کاٹ دو \" لوگوں نے کہا : اللہ کے رسول! کیا آپ نے دیکھا کہ اگر وہ چھوٹا ہی فوت ہو جائے؟ فرمایا : \" اللہ ہی زیادہ جاننے والا ہے وہ ( چھوٹی عمر میں فوت ہونے والے بچے ) کیا عمل کرنے والے تھے ۔",
          "fr": "Rapporté par Abu Mu’awiya : Le Prophète ﷺ a dit : « Tout nouveau-né vient au monde sur la millat (de l’Islam) et il y reste jusqu’à ce que sa langue puisse s’exprimer. » Ce hadith a aussi été rapporté par Abu Mu’awiya par une autre chaîne de transmetteurs avec ces mots : « Tout enfant naît sur cette Fitra tant qu’il ne s’exprime pas avec sa langue. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami ['Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dia berkata; ini adalah apa yang telah diceritakan oleh [Abu Hurairah] kepada kami dari Rasulullah shallallahu 'alaihi wasallam -lalu dia menyebutkan beberapa Hadits di antaranya; - Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang bayi yang dilahirkan melainkan dalam keadaan fitrah ini, maka bapaknyalah yang menjadikannya Yahudi, atau Nasrani, sebagaimana mereka mendapatkan unta yang lahir, akankah mereka mendapatkan padanya cacat, sehingga kalianlah yang membuatnya cacat?\" para sahabat bertanya; \"Bagaimana pendapat anda dengan seorang anak kecil yang meninggal?\" Beliau menjawab: \"Allah lebih tahu dengan apa yang mereka kerjakan",
          "tr": "{m-23} Bize Ebû Bekr b. Ebî Şeybe ile Ebû Kureyb rivayet ettiler. {Dedilerki): Bize Ebû Muâviye rivayet etti. H. Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. Her iki râvi A'meş'den bu isnadla rivayet etmişlerdir. İbni Numeyr'in hadîsinde : «Hiç bir doğan çocuk yoktur ki, millet üzere doğmuş olmasın.» Ebû Bekr'in, Ebû Muâviye'den rivayetinde: «Bu millet üzere doğmuş olmasın. Tâ dili söyleyinceye kadar.» Ebû Kureyb'in Ebû Muâviye'den rivayetinde ise: «Doğan hiç bir çocuk yoktur ki, şu fıtrat üzere olmasın. 'Tâ dili söyleyinceye kadar.» cümleleri vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 6761,
      "arabicNumber": "2658.07",
      "book": 46,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يُولَدُ يُولَدُ عَلَى هَذِهِ الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ كَمَا تَنْتِجُونَ الإِبِلَ فَهَلْ تَجِدُونَ فِيهَا جَدْعَاءَ حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ صَغِيرًا قَالَ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported from Allah's Messenger (may peace be upom him) many ahadith and one amongst them is that he is reported to have said:An infant is born according to his (true) nature. It is his parents Who make him a Jew, a Christian, just as a she-camel gives birth to its young ones. Do you find any deficiency in their limbs? You cut their ears (i. e. after birth). They (the Companions of the Holy Prophet) said: What is your opinion about him who dies in infancy? Thereupon Allah's Apostle (ﷺ) said: It is Allah alone Who knows best what they would be doing",
          "ur": "علاء کے والد عبدالرحمٰن نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہر انسان کو اس کی ماں فطرت پر جنم دیتی ہے اور اس کے ماں باپ بعد میں اس کو یہودی یا نصرانی یا مجوسی بنا دیتے ہیں ۔ اگر وہ دونوں ( صحیح ) مسلمان ہوں تو وہ مسلمان رہتا ہے اور ہر انسان کو جب اس کی ماں جنم دیتی ہے تو شیطان اس کے دونوں پہلوؤں میں ہاتھ سے مارتا ہے سوائے حضرت مریم علیہ السلام اور ان کے بیٹے کے ( انہیں اللہ نے اس سے محفوظ رکھا ۔)",
          "fr": "Rapporté par Abu Huraira : J’ai rapporté du Messager d’Allah ﷺ de nombreux hadiths, et l’un d’eux est celui-ci : « Un enfant naît selon sa vraie nature. Ce sont ses parents qui font de lui un Juif ou un Chrétien, tout comme une chamelle donne naissance à ses petits. Trouvez-vous une quelconque déficience dans leurs membres ? Vous leur coupez les oreilles (après la naissance). » Les Compagnons ont demandé : « Que dis-tu de celui qui meurt en bas âge ? » Le Messager d’Allah ﷺ a répondu : « C’est Allah seul qui sait ce qu’ils auraient fait. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami ['Abdul 'Aziz Ad Darawadri] dari [Al 'Ala] dari [bapaknya] dari [Abu Hurairah] bahwasanya Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Setiap anak itu dilahirkan dalam keadaan fitrah lalu kedua orang tuanyalah yang menjadikannya sebagai seorang yahudi, nasrani dan majusi (penyembah api). Apabila kedua orang tuanya muslim, maka anaknya pun akan menjadi muslim. Setiap bayi yang dilahirkan dipukul oleh syetan pada kedua pinggangnya, kecuali Maryam dan anaknya (Isa)",
          "tr": "Bize Muhammed b. Râfi' rivayet etti. (Dediki): Bize Abdürrezzâk rivayet etti. (Dediki): Bize Ma'mer, Hemmâm b. Münebbih'den rivayet etti. Hemmâm: Ebû Hureyre'nin, Resûlullah (Sallallahu Aleyhi ve Sellem)'den bize rivayet ettikleri şunlardır, diyerek bir takım hadîsler zikretmişlerdir. Onlardan biri de şudur: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Doğan bir kimse bu fıtrat üzere doğar. Sonra annosi, babası onu yahûdileştirir ve hıristiyanlaştırırlar. Sizin develeri ürettiğiniz gibi. Onlarda hiç azası kesik buluyor musunuz? Sonra onların azasını siz kesiyorsunuz.» buyurdular. Ashâb : — Yâ Resûlallah! Küçükken ölene ne buyurursun? dediler. «Allah onların ne yapacak olduklarını bilir.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 6762,
      "arabicNumber": "2659.01",
      "book": 46,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ إِنْسَانٍ تَلِدُهُ أُمُّهُ عَلَى الْفِطْرَةِ وَأَبَوَاهُ بَعْدُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُمَجِّسَانِهِ فَإِنْ كَانَا مُسْلِمَيْنِ فَمُسْلِمٌ كُلُّ إِنْسَانٍ تَلِدُهُ أُمُّهُ يَلْكُزُهُ الشَّيْطَانُ فِي حِضْنَيْهِ إِلاَّ مَرْيَمَ وَابْنَهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The mother of every person gives him birth according to his true nature. It is subsequently his parents who make him a Jew or a Christian or a Magian. Had his parents been Muslim he would have also remained a Muslim. Every person to whom his mother gives birth (has two aspects of his life) ; when his mother gives birth Satan strikes him but it was not the case with Mary and her son (Jesus Christ)",
          "ur": "ابن ابی ذئب اور یونس نے ابن شہاب سے روایت کی ، انہوں نے عطاء بن یزید سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں سوال کیا گیا تو آپ نے فرمایا : \" اللہ ہی زیادہ جانتا ہے کہ ( بڑے ہو کر ) وہ کیا عمل کرنے والے تھے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « La mère de chaque personne le met au monde selon sa nature d’origine. Ensuite, ce sont ses parents qui font de lui un Juif, un Chrétien ou un Mage. Si ses parents étaient musulmans, il serait aussi resté musulman. Chaque personne à qui sa mère donne naissance a deux aspects dans sa vie : quand sa mère l’accouche, Satan le touche, sauf Marie et son fils (Jésus). »",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Abdü'l-Aziz (yâni Ed-Derâverdî), Alâ'dan, o da babasından, o da Ebû Hureyre'den naklen rivayet etti ki: Resûlullah (Sallallahu Aleyhi ve Sellem) : «Her insanı annesi fıtrat üzere doğurur. Sonra annesi, babası onu yahudileştirir, hristiyanlaştırır ve mecûsîleştirir. Eğer annesi, babası müslüman İseler çocuk da müslüman olur. Annesinin doğurduğu her insanı şeytan iki yanından çarpar. Yalnız Meryem'le oğlu müstesna!» buyurmuşlar. İZAH 2662 DE EBU DAVUDDAKİ ŞU HADİS ÇOK ÖNEMLİ BURAYA TIKLAYIN"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 6763,
      "arabicNumber": "2659.02",
      "book": 46,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، وَيُونُسُ، عَنِ ابْنِ، شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏ \"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that Allah's Messenger (ﷺ) was asked about the children of the polytheists, whereupon he said:It is Allah Who knows best what they would be doing",
          "ur": "معمر ، شعیب اور معقل بن عبیداللہ نے زہری سے یونس اور ابن ابی ذئب کی سند کے ساتھ ان دونوں کی حدیث کے مانند حدیث بیان کی ، مگر شعیب اور معقل کی حدیث میں ( مشرکین کی اولاد کی بجائے ) \" مشرکین کے چھوٹے بچوں \" کے الفاظ ہیں ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : On demanda au Messager d’Allah ﷺ au sujet des enfants des polythéistes. Il répondit : « C’est Allah qui sait le mieux ce qu’ils auraient fait. »",
          "id": "Telah menceritakan kepada kami [Abu Ath Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu Abu Dzi'b] dan [Yunus] dari [Ibnu Syihab] dari ['Atha bin Yazid] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam ditanya tentang anak-anak kaum Musyrikin? lalu beliau bersabda: \"Allah maha mengetahui terhadap apa yang mereka perbuat.\" Telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami ['Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami ['Abdullah bin 'Abdurrahman bin Bihram] telah mengabarkan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepada kami [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'yan] telah menceritakan kepada kami [Ma'qil bin 'Ubaidullah] semuanya dari [Az Zuhri] dengan sanad [Yunus] dan [Ibnu Abu Dzi'b] seperti hadits keduanya. Hanya saja pada hadits Syu'aib dan Ma'qil dengan menggunakan lafazh; 'Beliau ditanya mengenai keturunan orang-orang Musyrik",
          "tr": "Bize Ebu't-Tâhir rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki); Bana İbni Ebi Zi'b ile Yûnus, İbni Şîhab'dan, o da Atâ' b. Yezîd'den, o da Ebû Hureyre'den naklen hafeer verdiki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e müşriklerin çocukları sorulmuş da: «Onların ne yapacak olduklarını Allah bilir.» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 6764,
      "arabicNumber": "2659.03",
      "book": 46,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ، عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، ح وَحَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ اللَّهِ - كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِإِسْنَادِ يُونُسَ وَابْنِ أَبِي ذِئْبٍ ‏.‏ مِثْلَ حَدِيثِهِمَا غَيْرَ أَنَّ فِي، حَدِيثِ شُعَيْبٍ وَمَعْقِلٍ سُئِلَ عَنْ ذَرَارِيِّ الْمُشْرِكِينَ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Shu'aib and Ma'qil with a slight variation of wording",
          "ur": "اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کے بچوں کے بارے میں سوال کیا گیا ، ان میں سے جو چھوٹی عمر میں فوت ہو جائیں ( تو ان کا انجام کیا ہو گا؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ زیادہ جانتا ہے کہ وہ کیا عمل کرنے والے تھے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Ce hadith a été transmis par Shu'aib et Ma'qil avec une légère différence dans les mots",
          "id": "Telah menceritakan kepada kami [Ibnu Abu 'Umar] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; bahwa Rasulullah Shallallahu 'alaihi wa Salam pernah ditanya mengenai anak-anak orang-orang musyrik yang meninggal ketika mereka masih kecil, lalu beliau menjawab: \"Allah lebih mengetahui apa yang mereka kerjakan",
          "tr": "{m-26} Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Abdürrezzâk haber verdi. (Dediki): Bize Ma'mer haber verdi. H. Bize Abdullah b. Ahdirrahman İbni Behram da rivayet etti. (Dediki): Bize Ebû'l-Yeman haber verdi. (Dediki) Bize Şuayb haber verdi. H. Bize Seleme b. Şebib de rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl (bu zât İbni Ubeydillah'dır) rivayet etti. Bu râvüerin hepsi Zührî'den Yûnus ve İbnü Ebî Zi'b'in isnadıyla onların hadîsleri gibi rivayet etmişlerdir. Yalnız Şuayb ile Ma'kil'in hadîslerinde : «Müşriklerin zürriyetleri soruldu...» cümlesi vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 6765,
      "arabicNumber": "2660",
      "book": 46,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَطْفَالِ الْمُشْرِكِينَ مَنْ يَمُوتُ مِنْهُمْ صَغِيرًا فَقَالَ ‏ \"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that Allahs Messenger (way peace be upon him) was asked about the children of the polytheists who die young. Thereupon Allah's Apostle (ﷺ) said:It is Allah Who knows what they would be doing",
          "ur": "سعید بن جبیر نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کے بچوں کے متعلق سوال کیا گیا تو آپ نے فرمایا : \" اللہ تعالیٰ نے جب ان کو پیدا کیا تو وہ زیادہ جاننے والا ہے کہ وہ کیا عمل کرنے والے تھے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : On demanda au Messager d’Allah ﷺ au sujet des enfants des polythéistes morts jeunes. Il répondit : « C’est Allah qui sait ce qu’ils auraient fait. »",
          "id": "dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang nasib anak-anak kaum musyrik yang meninggal dunia sebelum usia baligh. Kemudian Rasulullah shallallahu 'alaihi wasallam menjawab: 'Allah lah Yang Maha tahu tentang apa yang mereka kerjakan semenjak Allah menciptakannya",
          "tr": "Bize İbni Ebi Ömer rivayet etti. (Dediki): Bize Süfyân Ebû'z-Zinad'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem)'e müşriklerin çocuklarından küçükken ölenler soruldu da : «Allah onların ne yapacak olduklarını bilir.» buyurdular. İZAH 2662 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 6766,
      "arabicNumber": "2661",
      "book": 46,
      "hadithInBook": 44,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَطْفَالِ الْمُشْرِكِينَ قَالَ ‏ \"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ إِذْ خَلَقَهُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ibn Abbas reported that Allah's Messenger (ﷺ) was asked about the children of the polytheists, whereupon he said:It is Allah alone Who knows what they would be doing according to their creation",
          "ur": "سعید بن جبیر نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت ابی بن کعب رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس لڑکے کو حضرت خضر علیہ السلام نے قتل کیا تھا وہ طبعا کافر بنایا گیا تھا ، اگر وہ زندہ رہتا تو زبردستی اپنے ماں باپ کو سرکشی اور کفر کی طرف لے جاتا ۔",
          "fr": "Rapporté par Ibn Abbas رضي الله عنه : On demanda au Messager d’Allah ﷺ au sujet des enfants des polythéistes. Il répondit : « C’est Allah seul qui sait ce qu’ils auraient fait selon leur création. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Mu'tamar bin Sulaiman] dari [bapaknya] dari [Raqabah bin Masqalah] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dari [Ubay bin Ka'b] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Sesungguhnya anak laki-laki yang dibunuh oleh Nabi Khidhir alaihi salam itu telah ditakdirkan menjadi orang kafir. Seandainya anak laki-laki tersebut terus hidup, maka ia akan menyesatkan kedua orang tuanya untuk menjadi durhaka dan kafir",
          "tr": "Bize Yahya b. Yahya da rivayet etti. (Dediki): Bize Ebû Avâne, Ebû Bişr'den, o da Said b. Cübeyr'den, o da İbni Abbas'dan. naklen haber verdi. (Şöyle demiş): Resulullah (Sallallahu Aleyhi ve Sellem)' müşriklerin çocukları soruldu. «Allah onları yarattığı vakit ne yapacak olduklarını bilir.» buyurdular. İZAH 2662 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 6767,
      "arabicNumber": "2662.01",
      "book": 46,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ رَقَبَةَ، بْنِ مَسْقَلَةَ عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْغُلاَمَ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ubayy b. Ka'b reported that Allah's Messenger (ﷺ) said:The young man whom Khadir killed was a non-believer by his very nature and had he survived he would have involved his parents in defiance and unbelief",
          "ur": "فضیل بن عمرو نے عائشہ بنت طلحہ سے اور انہوں نے ام المومنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے روایت کی کہ ایک بچہ فوت ہوا تو میں نے کہا : اس کے لیے خوش خبری ہو ، وہ تو جنت کی چڑیوں میں سے ایک چڑیا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم نہیں جانتی کہ اللہ تعالیٰ نے جنت کو پیدا کیا اور دوزخ کو پیدا کیا اور اس کے لیے بھی اس میں جانے والے بنائے اور اُس کے لیے بھی اس میں رہنے والے بنائے؟",
          "fr": "Rapporté par Ubayy ibn Ka'b رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Le jeune homme que Khadir a tué était incroyant par nature, et s’il avait vécu, il aurait entraîné ses parents dans la rébellion et l’incroyance. »",
          "tr": "Bize Abdullah b. Mesleme b. Ka'neb rivayet etti. (Dediki): Bize Mu'temir b. Süleyman babasından, o da Rakabe b. Meskale'den, o da Ebû İshâk'dan, o da Saîd b. Cübeyr'den, o da İbni Abbâs'dan, o da Ubey b. Ka'b'dan naklen rivayet etti. Ubey şöyle demiş: Resulullah (Sallallahu Aleyhi ve Sellem): «Hızır'ın öldürdüğü çocuk kâfir olarak mühürlenmişti. Yaşasaydı annesine, babasına azgınlık ve küfürle zulmederdi.» buyurdular. İZAH 2662 DE"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 6768,
      "arabicNumber": "2662.02",
      "book": 46,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، عَنْ فُضَيْلِ بْنِ عَمْرٍو، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ تُوُفِّيَ صَبِيٌّ فَقُلْتُ طُوبَى لَهُ عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَوَلاَ تَدْرِينَ أَنَّ اللَّهَ خَلَقَ الْجَنَّةَ وَخَلَقَ النَّارَ فَخَلَقَ لِهَذِهِ أَهْلاً وَلِهَذِهِ أَهْلاً ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha, the mother of the believers, reported that a child died and I said:There is happiness for this child who is a bird from amongst the birds of Paradise. Thereupon Allah's Messenger (ﷺ) said: Don't you know that Allah created the Paradise and He created the Hell and He created the dwellers for this (Paradise) and the denizens for this (Hell)?",
          "ur": "وکیع نے طلحہ بن یحییٰ سے ، انہوں نے اپنی پھوپھی عائشہ بنت طلحہ سے اور انہوں نے ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کو انصار کے ایک بچے کے جنازے کے لیے بلایا گیا ، میں نے کہا : اللہ کے رسول! اس کے لیے خوش خبری ہو یہ جنت کی چڑیوں میں سے ایک چڑیا ہے ، اس نے کوئی گناہ کیا ، نہ گناہ کرنے کی عمر پائی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" یا اس کے علاوہ کچھ اور؟ عائشہ! اللہ تعالیٰ نے جنت میں رہنے والے لوگ پیدا فرمائے ، انہیں اس وقت جنت کے لیے تخلیق کیا جب وہ اپنے باپوں کی پشتوں میں تھے اور دوزخ کے لیے بھی رہنے والے بنائے ، انہیں اس وقت دوزخ کے لیے تخلیق کیا جب وہ اپنے باپوں کی پشتوں میں تھے ۔",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Un enfant est mort et j’ai dit : « Il y a du bonheur pour cet enfant, qui est un oiseau parmi les oiseaux du Paradis. » Le Messager d’Allah ﷺ répondit : « Ne sais-tu pas qu’Allah a créé le Paradis et l’Enfer, et qu’Il a créé les habitants pour chacun d’eux ? »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Thalhah bin Yahya] dari [bibinya, 'Aisyah binti Thalhah] dari ['Aisyah ummul Mu'minin] dia berkata; \"Pada suatu ketika, Rasulullah shallallahu 'alaihi wasallam pernah diundang untuk melayat jenazah seorang bayi dari kaum Anshar. Kemudian saya (Aisyah) berkata kepada beliau; 'Ya Rasulullah, sungguh berbahagia bayi kecil ini! Ia seperti seekor burung dari sekian burung surga yang belum pernah berbuat dosa dan belum pernah ternodai oleh dosa.' Mendengar pernyataan tersebut, Rasulullah shallallahu 'alaihi wasallam bersabda: 'Mungkin juga tidak seperti itu hai Aisyah. Sebenarnya Allah telah menciptakan orang-orang yang akan menjadi penghuni surga ketika mereka masih berada dalam tulang rusuk (sulbi) bapak-bapak mereka. Dan sebaliknya, Allah pun telah menciptakan orang-orang yang akan menjadi penghuni neraka ketika mereka masih berada dalam tulang rusuk bapak-bapak mereka.' Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] telah menceritakan kepada kami [Isma'il bin Zakaria] dari [Thalhah bin Yahya] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepadaku [Sulaiman bin Ma'bad] telah menceritakan kepada kami [Al Husain bin Hafsh] Demikian juga diriwayatkan dari jalur lainnya, dan telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Muhammad bin Yusuf] keduanya dari [Sufyan Ats Tsauri] dari [Thalhah bin Yahya] dengan sanad Waki' seperti haditsnya",
          "tr": "Bana Zübeyr b. Harb rivayet etti. (Dediki):,Bize Cerîr, Alâ' b. Müseyyeb'den, o da Fudayl b, Amr'dan, o da Âişe binti Talha'dan, o da Ümmü'l-Mü'miniıı Âîşe'den naklen rivayet etti. (Şöyle demiş): Bir çocuk öldü de ben: Ne mutlu ona, cennet serçelerinden tir serçe! dedim. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem}; «Bilmez misin ki, Allah cennetle cehennemi yaratmış ve ona da, buna da ehil yaratmıştır.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 6769,
      "arabicNumber": "2662.03",
      "book": 46,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَمَّتِهِ، عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ دُعِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى جَنَازَةِ صَبِيٍّ مِنَ الأَنْصَارِ فَقُلْتُ يَا رَسُولَ اللَّهِ طُوبَى لِهَذَا عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلِ السُّوءَ وَلَمْ يُدْرِكْهُ قَالَ ‏ \"‏ أَوَغَيْرَ ذَلِكَ يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ لِلْجَنَّةِ أَهْلاً خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ وَخَلَقَ لِلنَّارِ أَهْلاً خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha, the mother of the believers, said that Allah's Messenger (ﷺ) was called to lead the funeral prayer of a child of the Ansar. I said:Allah's Messenger, there is happiness for this child who is a bird from the birds of Paradise for it committed no sin nor has he reached the age when one can commit sin. He said: 'A'isha, per adventure, it may be otherwise, because God created for Paradise those who are fit for it while they were yet in their father's loins and created for Hell those who are to go to Hell. He created them for Hell while they were yet in their father's loins",
          "ur": "اسماعیل بن زکریا اور سفیان ثوری نے طلحہ بن یحییٰ سے وکیع کی حدیث کے مانند اسی کی سند کے ساتھ روایت کی ۔",
          "fr": "Rapporté par Aïsha (la mère des croyants) رضي الله عنها : Le Messager d’Allah ﷺ fut appelé pour diriger la prière funéraire d’un enfant des Ansar. J’ai dit : « Messager d’Allah, il y a du bonheur pour cet enfant, qui est un oiseau parmi les oiseaux du Paradis, car il n’a commis aucun péché et n’a pas atteint l’âge où l’on peut pécher. » Il répondit : « Aïsha, il se peut que ce soit autrement, car Allah a créé pour le Paradis ceux qui y sont destinés alors qu’ils étaient encore dans les reins de leurs pères, et Il a créé pour l’Enfer ceux qui y iront, alors qu’ils étaient encore dans les reins de leurs pères. »",
          "tr": "Bize Ebû Bekr b. Ebî Şeybe rivayet etti. (Dediki): Bize Veki', Talha b. Yahya'dan, o da halası Âişe binti Talha'dan, o da Ümmül-Mü'minin Aişe'den naklen rivayet etti. (Şöyle demiş): Resûlullah (Sallallahu Aleyhi ve Sellem} ensardaıı bir sabinin cenazesine çağrıldı da, ben: — Yâ Resûlallahî Buna ne mutlu, cennet serçelerinden bîr serçe! Kötülük işlemedi. Ona erişmedi, dedim. «Bundan başka bir sözün yok mu yâ Âişe! Çünkü Allah, cennet için ehil yaratmış; onları, daha babalarının sulblerinde iken cennet için yaratmıştır. Cehennem için de ehil yaratmış; onları daha babalarının sulblerinde iken cehennem içİn yaratmıştır.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 6770,
      "arabicNumber": "2663.01",
      "book": 46,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ طَلْحَةَ بْنِ يَحْيَى، ح وَحَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ، كِلاَهُمَا عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ طَلْحَةَ بْنِ يَحْيَى، بِإِسْنَادِ وَكِيعٍ نَحْوَ حَدِيثِهِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Yahya with the same chain of transmitters",
          "ur": "وکیع نے ہمیں معمر سے حدیث بیان کی ، انہوں نے علقمہ بن مرثد سے ، انہوں نے مغیرہ بن عبداللہ یشکری سے ، انہوں نے معرور بن سوید سے اور انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت ام حبیبہ رضی اللہ عنہا نے یہ دعا کی : اے اللہ! مجھے اپنے خاوند رسول اللہ صلی اللہ علیہ وسلم اپنے والد حضرت ابوسفیان رضی اللہ عنہ اور اپنے بھائی حضرت معاویہ رضی اللہ عنہ ( کی زندگیوں ) سے مستفید فرما! ( حضرت عبداللہ رضی اللہ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے عمروں کی ایسی مدتوں کا ، جو مقرر کر دی گئی ہیں اور ان دنوں کا جو گنے جا چکے ہیں اور ایسے رزقوں کا جو بانٹے جا چکے ہیں ، سوال کیا ہے ۔ اگر تم اللہ سے یہ مانگتی کہ تمہیں آگ میں دیے جانے والے یا قبر میں دیے جانے والے عذاب سے پناہ عطا فرما دے تو یہ زیادہ اچھا اور زیادہ افضل ہوتا ۔ \"\" ( عبداللہ بن مسعود رضی اللہ عنہ نے ) کہا : آپ کے سامنے بندروں کے بارے میں بات چیت ہوئی ، مسعر نے کہا : میرا خیال ہے کہ انہوں ( حضرت عبداللہ رضی اللہ عنہ ) نے کہا : خنزیروں کا بھی ( ذکر کیا گیا کہ وہ ) مسخ ہو کر بنے ہیں تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ نے مسخ ہونے والوں کی نہ نسل بنائی ہے نہ اولاد ، بندر اور خنزیر اس ( مسخ ہونے کے واقعے ) سے پہلے بھی ہوتے تھے ( جو موجودہ ہیں وہ انہی کی نسلیں ہیں ۔)",
          "fr": "Rapporté par Yahya (avec la même chaîne de transmetteurs) : Ce hadith a été rapporté avec la même chaîne de transmetteurs",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib] - dan lafadh ini milik Abu Bakr- mereka berdua berkata; telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari ['Alqamah bin Martsad] dari [Al Mughirah bin 'Abdullah Al Yasykuri] dari [Al Ma'rur bin Suwaid] dari ['Abdullah] dia berkata; \"Ummu Habibah -istri Rasulullah- pernah berdoa sebagai berikut; 'Ya Allah, berikanlah aku kenikmatan (panjangkanlah usiaku) bersama suamiku, Rasulullah shallallahu 'alaihi wasallam, ayahku, Abu Sufyan, dan saudaraku, Mu'awiyah.' Abdullah berkata; Mendengar doa itu, maka Rasulullah shallallahu 'alaihi wasallam berkata kepada istrinya, Ummu Habibah: 'Sesungguhnya kamu memohon kepada Allah Subhanahu wa Ta'ala: ajal, kematian, dan rezeki yang telah ditentukan, di mana Allah tidak akan mengajukan ataupun memundurkan sebelum waktunya. Apabila kamu memohon kepada Allah Suhhanahu wa Ta'ala agar Dia menyelamatkanmu dari siksa neraka dan siksa kubur, maka hal itu lebih baik bagimu dan lebih utama.' Abdullah bin Mas'ud berkata; lalu ditanyakan kepada Rasulullah tentang kera. Mis'ar berkata; aku kira dia berkata; Apakah babi itu berasal dari manusia yang telah berubah rupa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Sesungguhnya Allah Azza wa Jalla tidak akan menghancurkan atau menyiksa suatu kaum, kemudian menjadikan keturunan bagi mereka. Sesungguhnya keturunan babi dan kera itu sudah ada sebelumnya.' Telah menceritakannya kepada kami [Abu Kuraib] Telah menceritakan kepada kami [Ibnu Bisyr] dari [Mis'ar] melalui sanad ini. Hanya saja dia menyebutkan di dalam Haditsnya, dari Ibnu Bisyr dan Waki' -secara keseluruhan-. Lafazh; dari adzab neraka dan adzab kubur",
          "tr": "{m-31} Bize Muhammed b. Sabbah rivayet etti. (Dediki): Bize İsmail b. Zekeriyya, Talha b. Yahya'dan rivayet etti. H. Bana Süleyman b. Ma'bed de rivayet etti. (Dediki): Bize Hüseyn b. Hafs rivayet etti. H. Bana İshâk b. Mansûr dahî rivayet etti. (Dediki): Bize Muhanımed b. Yûsuf haber verdi. Her iki râvi Süfyân'i Sevrî'den, o da Talha b. Yahya'dan naklen Vekî'nin isnâdıyle onun hadîsi gibi rivayette bulunmuşlardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 6771,
      "arabicNumber": "2663.02",
      "book": 46,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْيَشْكُرِيِّ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَتْ أُمُّ حَبِيبَةَ زَوْجُ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ أَمْتِعْنِي بِزَوْجِي رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِأَبِي أَبِي سُفْيَانَ وَبِأَخِي مُعَاوِيَةَ ‏.‏ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ سَأَلْتِ اللَّهَ لآجَالٍ مَضْرُوبَةٍ وَأَيَّامٍ مَعْدُودَةٍ وَأَرْزَاقٍ مَقْسُومَةٍ لَنْ يُعَجِّلَ شَيْئًا قَبْلَ حِلِّهِ أَوْ يُؤَخِّرَ شَيْئًا عَنْ حِلِّهِ وَلَوْ كُنْتِ سَأَلْتِ اللَّهَ أَنْ يُعِيذَكِ مِنْ عَذَابٍ فِي النَّارِ أَوْ عَذَابٍ فِي الْقَبْرِ كَانَ خَيْرًا وَأَفْضَلَ ‏\"‏ ‏.‏ قَالَ وَذُكِرَتْ عِنْدَهُ الْقِرَدَةُ قَالَ مِسْعَرٌ وَأُرَاهُ قَالَ وَالْخَنَازِيرُ مِنْ مَسْخٍ فَقَالَ ‏\"‏ إِنَّ اللَّهَ لَمْ يَجْعَلْ لِمَسْخٍ نَسْلاً وَلاَ عَقِبًا وَقَدْ كَانَتِ الْقِرَدَةُ وَالْخَنَازِيرُ قَبْلَ ذَلِكَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah reported that Umm Habiba, the wife of Allah's Apostle (ﷺ), said:0 Allah, enable me to derive benefit from my husband, the Messenger of Allah (ﷺ), and from my father Abu Sufyan and from my brother Mu'awiya. Allah's Apostle (ﷺ) said: You have asked from Allah about durations of life already set, and the length of days already allotted and the sustenances the share of which has been fixed. Allah would not do anything earlier before its due time, or He would not delay anything beyond its due time. And if you were to ask Allah to provide you refuge from the torment of the HellFire, or from the torment of the grave, it would have good in store for you and better for you also. He (the narrator) further said: Mention was made before him about monkeys, and Mis'ar (one of the narrators) said: I think that (the narrator) also (made a mention) of the swine, which had suffered metamorphosis. Thereupon he (the Holy Prophet) said: Verily, Allah did not cause the race of those which suffered metamorphosis to grow or they were not survived by young ones. Monkeys and swine had been in existence even before (the metamorphosis of the human beings)",
          "ur": "ابن بشر نے مسعر سے اسی سند کے ساتھ خبر دی ، مگر ابن بشر اور وکیع دونوں سے ان کی ( روایت کردہ ) حدیث میں یہ الفاظ منقول ہیں : \" آگ میں دیے جانے والے اور قبر میں دیے جانے والے عذاب سے ( پناہ مانگتی تو بہتر تھا ۔ ) \" ( \" یا \" کی بجائے \" اور \" ہے ۔)",
          "fr": "Rapporté par Abdullah رضي الله عنه : Umm Habiba, l’épouse du Messager d’Allah ﷺ, a dit : « Ô Allah, permets-moi de profiter de mon mari, le Messager d’Allah ﷺ, de mon père Abou Soufyan et de mon frère Mu’awiya. » Le Messager d’Allah ﷺ répondit : « Tu as demandé à Allah des durées de vie déjà fixées, des jours déjà comptés et des subsistances dont la part est déterminée. Allah n’avance rien avant son terme, et Il ne retarde rien au-delà de son terme. Si tu avais demandé à Allah de te protéger du châtiment de l’Enfer ou du châtiment de la tombe, cela aurait été meilleur pour toi. » Il ajouta : On parla devant lui des singes, et Mis’ar (un des rapporteurs) dit : Je pense qu’il a aussi mentionné les porcs, qui avaient subi une métamorphose. Le Prophète ﷺ dit alors : « En vérité, Allah n’a pas fait survivre la descendance de ceux qui ont subi une métamorphose. Les singes et les porcs existaient déjà avant cela. »",
          "tr": "Bize Ehû Bekr b. Ebî Şeyhe ile Ebû Kureyb rivayet ettiler. Lâfız Ebû Bekr'indir. (Dedilerki): Bize Veki', Mis'ar'dan, o da AIkame b. Mersed'den, o da Muğîra b. Abdillah EI-Yeşkürî'den, o da Ma'rur b. Süveyd'den, o da Abdullah'dan naklen rivayet etti. Şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Habîbe: — Allahım! Bana zevcim Resûlullah (Sallallahu Aleyhi ve Sellem), babam Ebû Süfyân ve kardeşim Muâviye ile fayda ver! dedi. Bunun üzerine Peygamber (Sallallahu Aleyhi ve Sellem}: «Sen Allah'dan muayyen ecellere, ma'dud günlere ve taksim edilmiş rızıklara ait bir şey istedin. O hiç bîr şeyi vakti gelmeden yaratacak, yahut bir şeyi vaktinden sonraya bırakacak değildir. Şayet Allah'tan seni cehennemdeki bir azabdan veya kabirdeki azabdan korumasını isteseydin daha hayırlı ve daha faziletli olurdu.» buyurdular. Abdullah demişki: Resûlullah (Sallallahu Aleyhi ve Sellem)'in yanında maymunların da zikri geçti. — Mis'ar şöyle demiş: Zannederim domuzlar da mesh'ten meydana gelmişlerdir, dedi. — Bunun üzerine: «Şüphesiz ki Allah, mesh edilenler için nesil ve çoluk çocuk halketmemiştir. Maymunlarla domuzlar bundan önce de vardı.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 6772,
      "arabicNumber": "2663.03",
      "book": 46,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِهِ عَنِ ابْنِ بِشْرٍ وَوَكِيعٍ جَمِيعًا ‏ \"‏ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been reported on the authority of Mis'ar with the same chain of transmitters but with this variation that the hadith transmitted on the authority of Ibn Bishr and Waki', the torment of the Hell-Fire and the torment of grave have been mentioned together (and there is no conjunction\" iw\" or\" between them)",
          "ur": "عبدالرزاق نے کہا : ہمیں ثوری نے علقمہ بن مرثد سے خبر دی ، انہوں نے مغیرہ بن عبداللہ یشکری سے ، انہوں نے معرور بن سوید سے اور انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا : حضرت ام حبیبہ رضی اللہ عنہا نے ( دعا کرتے ہوئے ) کہا : اے اللہ! مجھے میرے خاوند رسول اللہ صلی اللہ علیہ وسلم ، میرے والد ابوسفیان اور میرے بھائی ( کی درازی عمر ) سے مستفید فرما! تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \"\" تم نے اللہ تعالیٰ سے ان مدتوں کا سوال کیا ہے جو مقرر کی جا چکیں اور قدموں کے ان نشانوں کا جن پر قدم رکھے جا چکے اور ایسے رزقوں کو جو تقسیم کیے جا چکے ۔ نہ ان میں سے کوئی چیز اپنا وقت آنے سے پہلے آ سکتی ہے اور نہ آنے کے بعد مؤخر ہو سکتی ہے ۔ اگر تم اللہ تعالیٰ سے یہ مانگتی کہ وہ تمہیں جہنم میں دیے جانے والے عذاب اور قبر میں دیے جانے والے عذاب سے بچا لے تو تمہارے لیے بہتر ہوتا ۔ \"\" ( عبداللہ بن مسعود رضی اللہ عنہ نے ) کہا : ایک آدمی نے پوچھا : اللہ کے رسول! یہ بندر اور خنزیر کیا انہی میں سے ہیں جو مسخ ہو کر بنے تھے؟ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ نے کسی قوم کو ہلاک نہیں کیا یا ( فرمایا : ) کسی قوم کو عذاب نہیں دیا کہ پھر ان ( لوگوں ) کی نسل بنائے ( ان کے بچے پیدا کر کے انہیں آگے چلائے ۔ ) اور بلاشبہ بندر اور خنزیر پہلے بھی موجود تھے ۔ \"\" ( آگے انہی کی نسلیں چلی ہیں ۔)",
          "fr": "Rapporté par Mis’ar (avec la même chaîne de transmetteurs) : Ce hadith a été rapporté avec la même chaîne de transmetteurs, mais avec cette différence : dans la version transmise par Ibn Bishr et Waki', le châtiment de l’Enfer et celui de la tombe sont mentionnés ensemble (sans la conjonction “et” entre eux)",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] dan [Hajjaj bin Asy Sya'ir] -dan lafadh ini milik Hajjaj- Ishaq berkata; telah mengabarkan kepada kami, dan Hajjaj berkata; telah menceritakan kepada kami ['Abdurrazzaq] telah mengabarkan kepada kami [Ats Tsauri] dari ['Alqamah bin Martsad] dari [Al Mughirah bin 'Abdullah Al Yasykuri] dari [Ma'rur bin Suwaid] dari ['Abdullah bin Mas'ud] dia berkata; \"Ummu Habibah pernah berdoa sebagai berikut; 'Ya Allah, berikanlah aku kenikmatan (panjangkanlah usiaku) bersama suamiku, Rasulullah shallallahu 'alaihi wasallam, ayahku, Abu Sufyan, dan saudaraku, Muawiyah.' Mendengar doa itu, Rasulullah shallallahu 'alaihi wasallam berkata kepada istrinya, Ummu Habibah: 'Sesungguhnya kamu memohon kepada Allah Subhanahu wa Ta'ala: ajal, kematian, dan rezeki yang telah ditentukan, yang Allah tidak akan mengajukan ataupun memundurkan sebelum waktunya. Apabila kamu memohon kepada Allah Suhhanahu wa Ta'ala agar Dia menyelamatkanmu dari siksa neraka dan siksa kubur, maka hal itu lebih baik bagimu.' Abdullah bin Mas'ud berkata; 'Ada seorang laki-laki bertanya; 'Ya Rasulullah, apakah kera dan babi itu berasal dari manusia yang telah berubah rupa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Sesungguhnya Allah Azza wa Jalla tidak akan menghancurkan atau menyiksa suatu kaum, kemudian menjadikan keturunan bagi mereka. Sesungguhnya keturunan babi dan kera itu sudah ada sebelumnya.' Telah menceritakannya kepadaku [Abu Dawud Sulaiman bin Ma'bad] telah menceritakan kepada kami [Al Husain bin Hafsh] telah menceritakan kepada kami [Sufyan] dengan isnad ini. Namun dia berkata dengan lafazh; wa atsarin mablughah (kehidupan yang sudah ditentukan) Ibnu Ma'bad berkata; dan sebagian mereka meriwayatkan lafazh; 'sebelum waktunya yaitu sebelum turunnya",
          "tr": "{m-32} Bize bu hadîsi Ebû Kureyb rivayet etti. (Dediki): Bize îbnül Bişr, Mis'ar'dan bu isnadla rivayet etti, Şu kadar varki, onun İbni Bişr ile Veki'den beraberce rivayet ettiği hadîsinde : «Cehennemdeki bir azabdan ve kabirdeki azabdan...» cümlesi vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 6773,
      "arabicNumber": "2663.04",
      "book": 46,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، - وَاللَّفْظُ لِحَجَّاجٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، حَجَّاجٌ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْيَشْكُرِيِّ، عَنْ مَعْرُورِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَتْ أُمُّ حَبِيبَةَ اللَّهُمَّ مَتِّعْنِي بِزَوْجِي رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِأَبِي أَبِي سُفْيَانَ وَبِأَخِي مُعَاوِيَةَ ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكِ سَأَلْتِ اللَّهَ لآجَالٍ مَضْرُوبَةٍ وَآثَارٍ مَوْطُوءَةٍ وَأَرْزَاقٍ مَقْسُومَةٍ لاَ يُعَجِّلُ شَيْئًا مِنْهَا قَبْلَ حِلِّهِ وَلاَ يُؤَخِّرُ مِنْهَا شَيْئًا بَعْدَ حِلِّهِ وَلَوْ سَأَلْتِ اللَّهَ أَنْ يُعَافِيَكِ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ لَكَانَ خَيْرًا لَكِ ‏\"‏ ‏.‏ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ الْقِرَدَةُ وَالْخَنَازِيرُ هِيَ مِمَّا مُسِخَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يُهْلِكْ قَوْمًا أَوْ يُعَذِّبْ قَوْمًا فَيَجْعَلَ لَهُمْ نَسْلاً وَإِنَّ الْقِرَدَةَ وَالْخَنَازِيرَ كَانُوا قَبْلَ ذَلِكَ ‏\"‏ ‏.‏ حَدَّثَنِيهِ أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ ‏\"‏ وَآثَارٍ مَبْلُوغَةٍ ‏\"‏ ‏.‏ قَالَ ابْنُ مَعْبَدٍ وَرَوَى بَعْضُهُمْ ‏\"‏ قَبْلَ حِلِّهِ ‏\"‏ ‏.‏ أَىْ نُزُولِهِ ‏.‏",
        "translations": {
          "en": "Ibn Mas'dd reported that Umm Habiba said:0 Allah, enable me to derive benefit from my husband, Allah's Messenger (ﷺ), and from my father Abu Sufyan, and from my brother Mu'awiya. Allah's Messenger (ﷺ) said to her: Verily, you have asked Allah about the durations of life already set, and the steps which you would take, and the sustenances the share of which is fixed. Nothing would take place earlier than its due time, and nothing would be deferred beyond that when it is due. So, if you were to ask Allah about your safety from the torment of Hell-Fire and from the torment of the grave, it would have been better for you. A person said: Allah's Messenger, what about those apes and swine which suffered metamorphosis? Thereupon Allah's Apostle (ﷺ) said: Verily, Allah, the Exalted and Glorious, did not destroy a people or did not torment a people, and let their race grow. Apes and swine had been even before that (when the deniers of truth were tormented and suffered metamorphosis). This hadith has been narrated on the authority of Sufyin through another chain of transmitters but with a slight variation of wording",
          "ur": "ابوداود سلیمان بن معبد نے کہا : ہمیں حسین بن حفص نے حدیث بیان کی ، انہوں نے کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث بیان کی ، مگر انہوں نے کہا : \"\" اور قدموں کے ایسے نشان جن تک قدم پہنچ چکے ہیں ۔ \"\" ابن معبد نے کہا : ان ( اساتذہ ) میں سے بعض نے ( آپ صلی اللہ علیہ وسلم کے فرمان ) : \"\" اس کے حل ہونے سے پہلے ۔ \"\" یعنی اس کے اترنے سے پہلے ( وضاحتی الفاظ کے ساتھ ) روایت کی ۔",
          "fr": "Rapporté par Ibn Mas’oud رضي الله عنه : Umm Habiba a dit : « Ô Allah, permets-moi de profiter de mon mari, le Messager d’Allah ﷺ, de mon père Abou Soufyan et de mon frère Mu’awiya. » Le Messager d’Allah ﷺ lui répondit : « Tu as demandé à Allah des durées de vie déjà fixées, des pas déjà déterminés et des subsistances dont la part est fixée. Rien n’arrivera avant son terme, et rien ne sera retardé au-delà de son moment. Si tu avais demandé à Allah la protection contre le châtiment de l’Enfer et de la tombe, cela aurait été meilleur pour toi. » Quelqu’un demanda : « Ô Messager d’Allah, qu’en est-il des singes et des porcs qui ont subi une métamorphose ? » Le Messager d’Allah ﷺ répondit : « En vérité, Allah, le Très-Haut, n’a jamais détruit un peuple ni ne l’a châtié tout en laissant sa descendance survivre. Les singes et les porcs existaient déjà avant cela (avant que les négateurs de la vérité ne soient châtiés et transformés). » Ce hadith a aussi été rapporté par Sufyan à travers une autre chaîne, avec une légère différence dans les mots",
          "tr": "(Bana bu hadîsi Ebû Dâvud Süleyman b. Ma'bed rivâyet etti. ki): Bize Hüseyin b. Hafs rivâyet etti. ki): Bize Süfyân bu isnadla rivâyette bulundu. Yalnız o: «Ve varılmış eserler...» demiştir. Ma'bed: «Bazıları (bu hadîsi) hillinden yani vukuundan önce diye rivâyet etti.» dedi. hadîs ecellerle rizıklann mukadder olduğuna, binâenaleyh ziyâde veya eksik kabul etmediğine açık delildir. Gerçi bir hadîsde: «Sıle-i Rahm Ömrü artırır...» buyurulmuştur. Fakat bu ve emsali hadîslerin te'vil olunduğunu Sıle-i Rahm bahsinde görmüştük. şöyle diyor: «Kafi delillerle tekarrur etmiştir ki, ecelleri, rızıkları vesâireyi Allah bilir. Bilmenin hakikati, bilinen şeyi bulunduğu hâl üzere anlamaktır. Allahü teâlâ Zeyd'in beşyüz tarihinde öleceğini bildi mi, artık onun bu tarihten önce veya sonra ölmesi imkânsızdır. Çünkü ilim cehle münkalib olur. Binâenaleyh Allah'ın bildiği ecellerin artıp eksilmesi imkânsızdır. Şu halde artma meselesini Ölüm melâikesine yahut ruhları kabz için vekil kıldığı başka bir meleğe nisbetledir, diye tevil etmek gerekir. Meleğe uzun eceller yazmasını emir buyurduktan veya bunu Levh-i Mahfuz'a yazdırdıktan sonra, ezelî ilmi iktizası bu yazılana ziyâde ve noksan yapabilir. îşte: dilediğini mahveder, dilediğini sabit bırakır.» âyet-i kerîmesinin mânâsı budur.» Hakkın mezhebine göre öldürülen kimse eceliyle ölmüştür. Dalâlet fırkalarından Mu'tezile onun eceliyle Ölmediğini, ömrünün kesildiğini söylemişlerdir. ki: Hazret-i Ümmü Habîbe , Resûlüllah (sallallahü aleyhi ve sellem) ile babasının ve kardeşinin çok yaşamalarına ve kendisine faydaları dokunmalarına dua etmiş, fakat Peygamber (sallallahü aleyhi ve sellem) onu bu duadan men etmiştir. Burada şöyle bir sual hatıra gelebilir: Peygamber (sallallahü aleyhi ve sellem) ecel mukadderden fazla ve eksik olamıyacağı için men ettiyse, azab meselesi de mukadderdir. Hazret-i Ümmü Habibe'ye niçin azabdan kurtulmak istemesini tavsiye buyurmuştur? Evet, azab meselesi de mukadderdir. Lâkin cehennem azabından, kabir azabından ve emsali şeylerden kurtulmak istemek bir ibâdettir, îbâdetlerse şeriatın emridirler. ne ise o olur deyip namaz ve oruç gibi ibâdetleri terketmek nasıl caiz değilse, afiyet duasında bulunmak da öyledir. Suretini değiştirmek, insani maymun ve domuz gibi çirkin hayvanlar kılığına tebdil etmektir. hâdise Benî İsrâi zamanında vuku bulmuştur. Fakat başka hayvanlar suretine tebdil edilen insanların nesli olmadığı, maymunlarla domuzlarınsa meshden Önce de mevcut oldukları bu hadîsde sarahaten bildirilmiştir. Binâenaleyh bugün yaşayan maymunlarla domuzlar insandan dönme değillerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 6774,
      "arabicNumber": "2664",
      "book": 46,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ رَبِيعَةَ بْنِ عُثْمَانَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ وَفِي كُلٍّ خَيْرٌ احْرِصْ عَلَى مَا يَنْفَعُكَ وَاسْتَعِنْ بِاللَّهِ وَلاَ تَعْجِزْ وَإِنْ أَصَابَكَ شَىْءٌ فَلاَ تَقُلْ لَوْ أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا ‏.‏ وَلَكِنْ قُلْ قَدَرُ اللَّهِ وَمَا شَاءَ فَعَلَ فَإِنَّ لَوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone, (but) cherish that which gives you benefit (in the Hereafter) and seek help from Allah and do not lose heart, and if anything (in the form of trouble) comes to you, don't say: If I had not done that, it would not have happened so and so, but say: Allah did that what He had ordained to do and your\" if\" opens the (gate) for the Satan",
          "ur": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" طاقت ور مومن اللہ کے نزدیک کمزور مومن کی نسبت بہتر اور زیادہ محبوب ہے ، جبکہ خیر دونوں میں ( موجود ) ہے ۔ جس چیز سے تمہیں ( حقیقی ) نفع پہنچے اس میں حرص کرو اور اللہ سے مدد مانگو اور کمزور نہ پڑو ( مایوس ہو کر نہ بیٹھ ) جاؤ ، اگر تمہیں کوئی ( نقصان ) پہنچے تو یہ نہ کہو : کاش! میں ( اس طرح ) کرتا تو ایسا ایسا ہوتا ، بلکہ یہ کہو : ( یہ ) اللہ کی تقدیر ہے ، وہ جو چاہتا ہے کرتا ہے ، اس لیے کہ ( حشرت کرتے ہوئے ) کاش ( کہنا ) شیطان کے عمل ( کے دروازے ) کو کھول دیتا ہے ۔",
          "fr": "Rapporté par Abu Huraira رضي الله عنه : Le Messager d’Allah ﷺ a dit : « Le croyant fort est meilleur et plus aimé d’Allah que le croyant faible, mais il y a du bien en chacun. Recherche ce qui t’est bénéfique (dans l’au-delà), demande l’aide d’Allah et ne te décourage pas. Si un malheur t’arrive, ne dis pas : “Si je n’avais pas fait ceci, cela ne serait pas arrivé”, mais dis : “Allah a fait ce qu’Il avait décidé.” Car le “si” ouvre la porte au diable. »",
          "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ibnu Numair] mereka berdua berkata; telah menceritakan kepada kami ['Abdullah bin Idris] dari [Rabi'ah bin 'Utsman] dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Orang mukmin yang kuat lebih baik dan lebih dicintai oleh Allah Subhanahu wa Ta 'ala daripada orang mukmin yang lemah. Pada masing-masing memang terdapat kebaikan. Capailah dengan sungguh-sungguh apa yang berguna bagimu, mohonlah pertolongan kepada Allah Azza wa Jalla dan janganlah kamu menjadi orang yang lemah. Apabila kamu tertimpa suatu kemalangan, maka janganlah kamu mengatakan; 'Seandainya tadi saya berbuat begini dan begitu, niscaya tidak akan menjadi begini dan begitu'. Tetapi katakanlah; 'lni sudah takdir Allah dan apa yang dikehendaki-Nya pasti akan dilaksanakan-Nya. Karena sesungguhnya ungkapan kata 'law' (seandainya) akan membukakan jalan bagi godaan syetan",
          "tr": "Bize Ebû Bekr b. Ebi Şeybe ile İbnü Nurneyr rivayet ettiler. (Dedilerki): Bize Abdullah b. İdris Rabia b. Osman'dan, o da Muhammed b. Yahya b. Habbaan'dan, o da A'rac'dan, o da Ebû Hureyre'den naklen rivayet etti. Şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) «Kuvvetli mü'min Allah'a zayıf mü'minden daha hayırlı ve daha makbuldür. Ama her birinde hayr vardır. Sana fayda veren şeye çaba göster; Allah'dan yardım dile ve âciz olma! Başına bir say gelirse şöyle yapsam şöyle olurdu deme! Velâkin (bu) Allah'ın kaderi, O ne dilerse yapar, de! Çünkü eğer (kelimesi) şeytanın amelini açar.» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 46,
        "hadith": 52
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "38KB"
  }
}