{
  "collection": "muslim",
  "book": 29,
  "name": {
    "arabic": "كتاب The Book of Legal Punishments",
    "transliteration": "kitab legal punishments",
    "translation": "The Book of Legal Punishments"
  },
  "totalHadith": 70,
  "hadithNumberRange": {
    "first": 4398,
    "last": 4469
  },
  "content": [
    {
      "hadithNumber": 4398,
      "arabicNumber": "1684.01",
      "book": 29,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِيَحْيَى - قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْطَعُ السَّارِقَ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
        "translations": {
          "en": "A'isha reported that Allah's Messenger (ﷺ) cut off the hand of a thief for a quarter of a dinar rid upwards",
          "ur": "سفیان بن عیینہ نے زہری سے ، انہوں نے عمرہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ( سونے کے ) دینار کے چوتھے حصے یا اس سے زیادہ ( کی مالیت ) میں چور کا ہاتھ کاٹتے تھے",
          "fr": "Rapporté par Aïsha رضي الله عنها : Le Messager d’Allah ﷺ a coupé la main d’un voleur pour un quart de dinar ou plus",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] dan ini adalah lafadz Yahya. Ibnu Abu Umar berkata; telah menceritakan kepada kami, sedangkan yang dua mengatakan; telah mengabarkan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Amrah] dari ['Aisyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam hanya memotong tangan pecuri jika ia mencuri seperempat dinar atau lebih.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Abd bin Humaid] keduanya berkata; telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Sulaiman bin Katsir] dan [Ibrahim bin Sa'd] semuanya dari [Az Zuhri] seperti hadits di atas dengan isnad ini",
          "tr": "Bize Yahya b. Yahya ile İshfik b. İbrahim ve ibni Ebî Ömer rivayet ettiler. Lâfız Yahya'nındır, ibni Ebî Ömer: Bize rivayet etti ta'bîrini kullandı. Ötekiler: Bize Siifyân b. Uyeyne Zührî'den, o da Aınra'dan, o da Aişe'den naklen haber verdi, dediler. Aişe şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) çeyrek altında ve fazlasında hırıızın elini keserdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 4399,
      "arabicNumber": "1684.02",
      "book": 29,
      "hadithInBook": 2,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، وَإِبْرَاهِيمُ بْنُ سَعْدٍ كُلُّهُمْ عَنِ الزُّهْرِيِّ، ‏.‏ بِمِثْلِهِ فِي هَذَا الإِسْنَادِ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Zuhri",
          "ur": "، سلیمان بن کثیر اور ابراہیم بن سعد سب نے زہری سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Ce hadith a été transmis par Zuhri",
          "tr": "{…} Bize İshâk b. İbrahim ile Abd b. Humeyd de rivayet ettiler. (Dedilerki): Bize Abdûrrazzak haber verdi. (Dediki): Bize Ma'mer haber verdi. H. Bize Ebû Bekir b. Ebî Şeybe dahi rivayet etti. (Dediki): Bize Yezîd b. Hârûn rivayet etti. (Dediki): Bize Süleyman b. Kesir ile İbrahim b. Sa'd haber verdi. Bunların hepsi Zühri'den bu hadîsin mislini bu isnâdda rivayet etmişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 2
      }
    },
    {
      "hadithNumber": 4400,
      "arabicNumber": "1684.03",
      "book": 29,
      "hadithInBook": 3,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَحَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ، - وَاللَّفْظُ لِلْوَلِيدِ وَحَرْمَلَةَ - قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، وَعَمْرَةَ، عَنْ عَائِشَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُقْطَعُ يَدُ السَّارِقِ إِلاَّ فِي رُبْعِ دِينَارٍ فَصَاعِدًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported Allah's Messenger (ﷺ) as saying:The hand of a thief should not be cut off but for a quarter of a dinar and upwards",
          "ur": "ابن شہاب نے عروہ اور عمرہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" ( سونے کے ) دینار کے چوتھے حصے یا اس سے زیادہ ( کی چوری ) کے سوا چور کا ہاتھ نہیں کاٹا جائے گا",
          "fr": "Rapporté par Aïsha رضي الله عنها : Le Messager d’Allah ﷺ a dit : « La main d’un voleur ne doit être coupée que pour un quart de dinar ou plus. »",
          "id": "Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah bin Yahya], dan telah menceritakan kepada kami [Al Walid bin Syuja'] dan ini adalah lafadz Al Walid, dan [Harmalah] mereka berkata; telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Urwah] dan ['Amrah] dari ['Aisyah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tangan pencuri tidak dipotong hingga ia mencuri (harta) senilai seperempat dinar atau lebih",
          "tr": "Bana Ebû't-Tâhir ile Harmele b. Yahya rivayet ettiler. (Dedilerki): Bize Velîd b. Şucâ' dahî rivayet etti. Lâfız Velîd ile Harmele'nindir. (Dedilerki): Bize İbni Vehb rivayet etti. (Dediki): Bana Yûnus, İbni Şihâb'dan, o da Urve ile Amra'dan, onlar da Âişe'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen haber verdi. «Hırsızın eli ancak çeyrek altında veya daha fazlada kesilir.» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 4401,
      "arabicNumber": "1684.04",
      "book": 29,
      "hadithInBook": 4,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، - وَاللَّفْظُ لِهَارُونَ وَأَحْمَدَ - قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَمْرَةَ، أَنَّهَا سَمِعَتْ عَائِشَةَ، تُحَدِّثُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تُقْطَعُ الْيَدُ إِلاَّ فِي رُبْعِ دِينَارٍ فَمَا فَوْقَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported:I heard Allah's Messenger (ﷺ) as saying: The hand (of a thief) should not be cut off but for a quarter of a dinar and what is above that",
          "ur": "سلیمان بن یسار نے عمرہ سے روایت کی کہ انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، وہ بیان کر رہی تھیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" چوتھائی دینار یا اس سے زیادہ کے سوا ہاتھ نہیں کاٹا جائے گا",
          "fr": "Rapporté par Aïsha رضي الله عنها : J’ai entendu le Messager d’Allah ﷺ dire : « La main (d’un voleur) ne doit être coupée que pour un quart de dinar et plus. »",
          "id": "Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harun bin Sa'id Al Aili] serta [Ahamad bin Isa] dan ini adalah lafadz Harun dan Ahmad, Abu At Thahir berkata; telah mengabarkan kepada kami, sedangkan yang dua mengatakan; telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Mahramah] dari [Ayahnya] dari [Sulaiman bin Yasar] dari ['Amrah] bahwa dia pernah mendengar ['Aisyah] menceritakan bahwa, dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan pencuri tidak dipotong hingga ia mencuri (harta) senilai seperempat dinar atau lebih",
          "tr": "Bana Ebû't-Tâhir ile Hârûn b. Saîd El-Eylî ve Ahmed b. İsa rivayet ettiler. Lâfız Harun ile Ahmed'indir. Ebû't-Tâhir: Bize haber verdi ta'bîrini kullandı. Ötekiler: Bize İbni Vehb rivayet etti dediler. (Demişki): Bana Mahrame, babasından, o da Süleyman b. Yesâr'dan, o da Amra'dan, o da Âişe'yi rivayet ederken dinlemiş olmak üzere haber verdi, ki Âişe Resûlullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken dinlemiş: «El ancak çeyrek altında ve onun yukarısında kesilir.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 4402,
      "arabicNumber": "1684.05",
      "book": 29,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ الْعَبْدِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ، بْنِ الْهَادِ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تُقْطَعُ يَدُ السَّارِقِ إِلاَّ فِي رُبْعِ دِينَارٍ فَصَاعِدًا ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported that she heard Allah's Apostle (ﷺ) as saying:The hand of the thief may not be cut off but for a quarter of a dinar and upwards",
          "ur": "عبدالعزیز بن محمد نے یزید بن عبداللہ بن ہاد سے ، انہوں نے ابوبکر بن محمد سے ، انہوں نے عمرہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ انہوں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" چوتھائی دینار یا اس سے زیادہ کے سوا چور کا ہاتھ نہیں کاٹا جائے گا",
          "fr": "Rapporté par Aïsha رضي الله عنها : Elle a entendu le Messager d’Allah ﷺ dire : « La main du voleur ne peut être coupée que pour un quart de dinar ou plus. »",
          "id": "Telah menceritakan kepadaku [Bisyr bin Al Hakam Al 'Abdi] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Yazid bin Abdullah bin Al Hadi] dari [Abu Bakar bin Muhammad] dari ['Amrah] dari ['Aisyah], bahwa dia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah tangan pencuri dipotong kecuali jika telah mencapai seperempat dinar atau lebih.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Al Mutsanna] dan [Ishaq bin Manshur] semuanya dari [Abu 'Amir Al 'Aqadi] telah menceritakan kepada kami [Abdullah bin Ja'far] dari anaknya Al Miswar bin Mahzamah, dari [Yazid bin Abdullah bin Al Hadi] dengan isnad seperti ini",
          "tr": "Bana Bişr b. Hakem El-Abdî rivayet etti. (Dediki): Bize Abdülâzîz b. Muhammed, Yezid b. Abdillâh b. Hâd'dan, o da Ebû Bekir b. Muhammed'den, o da Amra'dan, o da Âişe'den naklen rivayet etti ki, Âişe Peygamber (Sallallahu Aleyhi ve Sellem)'i: «Hırsızın eli ancak çeyrek altında ve daha fazlada kesilir.» buyururken işitmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 4403,
      "arabicNumber": "1684.06",
      "book": 29,
      "hadithInBook": 6,
      "text": {
        "arabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَإِسْحَاقُ بْنُ مَنْصُورٍ، جَمِيعًا عَنْ أَبِي عَامِرٍ الْعَقَدِيِّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، - مِنْ وَلَدِ الْمِسْوَرِ بْنِ مَخْرَمَةَ - عَنْ يَزِيدَ بْنِ، عَبْدِ اللَّهِ بْنِ الْهَادِ بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "A hadith like this has been narrated on the authority of Yazid b. 'Abdullah b. al-Had with the same chain of transmitters",
          "ur": "مسور بن مخرمہ رضی اللہ عنہ کی اولاد میں سے عبداللہ بن جعفر نے یزید بن عبداللہ بن ہاد سے ( باقی ماندہ ) اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Rapporté par Yazid ibn Abdullah ibn al-Had : Un hadith semblable a été rapporté avec la même chaîne de transmetteurs",
          "tr": "{…} Bize İshâk b. İbrahim ile Muhammed b. El-Müsennâ ve İshâk b. Mansûr toptan Ebû Âmir El-Akadî'den rivayet ettiler. (Dedilerki): Bize Misver b. Mahreme oğullarından Abdullah b. Ca'fer, Yezîd b. Abdillâh b. Hâd'dan bu isnâdla bu hadîsin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 4404,
      "arabicNumber": "1685.01",
      "book": 29,
      "hadithInBook": 7,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمْ تُقْطَعْ يَدُ سَارِقٍ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي أَقَلَّ مِنْ ثَمَنِ الْمِجَنِّ حَجَفَةٍ أَوْ تُرْسٍ وَكِلاَهُمَا ذُو ثَمَنٍ ‏.‏",
        "translations": {
          "en": "A'isha reported that during the lifetime of Allah's Messenger (ﷺ) the hand of the thief was not cut off for less than the price of a shield, iron coat or armour and both of them are valuable",
          "ur": "محمد بن عبداللہ بن نمیر نے کہا : حمید بن عبدالرحمان رؤاسی نے ہمیں ہشام بن عروہ سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے عہد میں چور کا ہاتھ ڈھال سے کم مالیت میں نہیں کاٹا گیا ، وہ چمڑے کی ڈھال ہو یا لوہے کی ، یہ دونوں اچھی خاصی قیمت والی تھیں ۔ ( معمولی چیز میں نہیں کاٹا)",
          "fr": "Rapporté par Aïsha رضي الله عنها : Du vivant du Messager d’Allah ﷺ, la main d’un voleur n’était pas coupée pour moins que la valeur d’un bouclier, d’une cotte de mailles ou d’une armure, et ces objets étaient précieux",
          "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Humaid bin Abdurrahman Ar Ru`asi] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] dia berkata, \"Pada zaman Rasulullah shallallahu 'alaihi wasallam tangan pencuri belum bisa dipotong jika (ia mencuri) kurang dari seharga tameng atau perisai yang keduanya punya nilai.\" Dan telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah mengabarkan kepada kami ['Abdah bin Sulaiman] dan [Humaid bin Abdurrahman]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] semuanya dari [Hisyam] dengan isnad ini, seperti hadits Ibnu Numair, dari Humaid bin Abdurrahman Ar Ru`asi. Dan dalam hadits Abdurrahim dan Abu Usamah disebutkan, \"keduanya mempunyai nilai",
          "tr": "Bize Muhammed b. Abdillâh b. Nuraeyr rivayet etti. (Dediki): Bize Humeyd b. Abdirrahmân El-Ruâsî, Hişâm b. Urve'den, o da babasından, o da Âişe'den naklen rivayet etti. Âişe şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem) zamanında hırsızın eli çelik veya deriden mamul bir kalkan kıymetinden —ki İkisi de kıymet sahibidir— daha azda kesilmemiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 4405,
      "arabicNumber": "1685.02",
      "book": 29,
      "hadithInBook": 8,
      "text": {
        "arabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَ حَدِيثِ ابْنِ نُمَيْرٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، الرُّؤَاسِيِّ وَفِي حَدِيثِ عَبْدِ الرَّحِيمِ وَأَبِي أُسَامَةَ وَهُوَ يَوْمَئِذٍ ذُو ثَمَنٍ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Hisham through another chain of transmitters, and in the hadith narrated by 'Abd al-Rahim and Abu Usama (the words are):\" That (the shield) was valuable those days",
          "ur": "عبدہ بن سلیمان ، حمید بن عبدالرحمٰن ، عبدالرحیم بن سلیمان اور ابواسامہ سب نے ہشام سے اسی سند کے ساتھ ابن نمیر کی حمید سے بیان کردہ روایت کی طرح حدیث بیان کی ۔ اور عبدالرحیم اور ابواسامہ کی حدیث میں ہے : ان دنوں وہ ( ڈھال ) قیمتی چیز تھی",
          "fr": "Rapporté par Hisham : Ce hadith a été rapporté par une autre chaîne de transmetteurs, et dans le hadith rapporté par Abd al-Rahim et Abu Usama, il est dit : « Ce bouclier était précieux à cette époque. »",
          "tr": "{…} Bize Osman b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abde b. Süleyman ile Humeyd b. Abdirrahmân haber verdiler. H. Bize Ebû Bekir b. Ebi Şeybe dahî rivayet etti. (Dediki): Bize Abdurrahîm b. Süleyman rivayet etti. H. Bize Ebû Kureyb de rivayet etti. (Dediki): Bize Ebû Usâme rivayet etti. Bu râvilerin hepsi Hişâm'dan bu isnâdla ibni Numeyr'in, Humeyd b. Abdirrahmân Er-Ruasî'den naklettiği hadis gibi rivayette bulunmuşlardır. Abdurrahîm ile Ebû Usâme'nin hadîslerinde: O gün o kıymet sahibi idi.» cümlesi de vardır. İzah 1687 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 4406,
      "arabicNumber": "1686.01",
      "book": 29,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ سَارِقًا فِي مِجَنٍّ قِيمَتُهُ ثَلاَثَةُ دَرَاهِمَ ‏.‏",
        "translations": {
          "en": "Ibn 'Umar reported that Allah's Messenger (may peace upon him) cut off the hand of a thief (in case of the theft) of a shield the price of which was three dirhams",
          "ur": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی ، انہوں نے نافع سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے چور کا ہاتھ ایک ڈھال ( کی چوری ) میں کاٹا جس کی قیمت تین درہم تھی",
          "fr": "Rapporté par Ibn Omar رضي الله عنه : Le Messager d’Allah (que la paix soit sur lui) a coupé la main d’un voleur pour le vol d’un bouclier d’une valeur de trois dirhams",
          "tr": "Bize Yahya b. Yahya rivayet etti. (Dediki): Mâlik'e, Nâfî'den dinlediğim, onun da İbni Ömer'den naklen rivayet ettiği şu hadîsi okudum: Resûlullâh (SalIallahu Aleyhi ve Sellem) bir hırsızın elini, kıymeti üç dirhem olan bir kalkandan dolayı kesmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 4407,
      "arabicNumber": "1686.02",
      "book": 29,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ الْمُثَنَّى قَالاَ حَدَّثَنَا يَحْيَى، وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، وَأَيُّوبَ، بْنِ مُوسَى وَإِسْمَاعِيلَ بْنِ أُمَيَّةَ ح. وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، وَإِسْمَاعِيلَ بْنِ أُمَيَّةَ، وَعُبَيْدِ اللَّهِ، وَمُوسَى بْنِ عُقْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ الْجُمَحِيِّ، وَعُبَيْدِ اللَّهِ بْنِ عُمَرَ، وَمَالِكِ بْنِ أَنَسٍ، وَأُسَامَةَ، بْنِ زَيْدٍ اللَّيْثِيِّ كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ يَحْيَى عَنْ مَالِكٍ غَيْرَ أَنَّ بَعْضَهُمْ قَالَ قِيمَتُهُ وَبَعْضُهُمْ قَالَ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Ibn 'Umar through some other chains of transmitters but with a slight variation of words",
          "ur": "لیث بن سعد ، عبیداللہ ( بن عمر بن حفص العمری ) ، ایوب سختیانی ، ایوب بن موسیٰ ، اسماعیل بن امیہ ، موسیٰ بن عقبہ ، حنظلہ بن ابی سفیان جمحی ، عبیداللہ بن عمر ( عمری ) مالک بن انس اور اسامہ بن زید لیثی تک ان کے شاگردوں کی مختلف سندیں ہیں ۔ ان کے بعد ان سب نے نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ، امام مالک سے یحییٰ کی حدیث کے مانند روایت کی ، البتہ ان میں سے بعض نے اس کی قیمت کہا اور بعض نے تین درہم کا ثمن ( معنی وہی ہے)",
          "fr": "Rapporté par Ibn 'Umar : Ce hadith a été rapporté par Ibn 'Umar à travers d’autres chaînes de transmetteurs, mais avec de légères différences dans les mots",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; aku bacakan di hadapan [Malik]; dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam pernah memotong tangan seseorang yang mencuri tameng senilai tiga dirham.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ibnu Rumh] dari [Al Laits bin Sa'd]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Zuhair bin Harb] dan [Ibnu Mutsanna] keduanya berkata; telah menceritakan kepada kami [Yahya yaitu Al Qatthan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Mushir] semuanya dari ['Ubaidullah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] -yaitu Ibnu 'Ulayyah-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Ar Rabi'] dan [Abu Kamil] keduanya berkata; telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Sufyan] dari [Ayyub As Sahtiyani] dan [Ayyub bin Musa] serta [Isma'il bin Umayah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dan [Isma'il bin Umayyah] dan ['Ubaidullah] dan [Musa bin 'Uqbah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Isma'il bin Umayyah]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] dari [Hanzhalah bin Abu Sufyan Al Jumahi] dan [Abdullah bin Umar] dan [Malik bin Anas] dan [Usamah bin Zaid Al Laitsi] semuanya dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, seperti hadit Yahya dari Malik. Hanyasaja sebagian dari mereka menyebutkan, \"Nilainya.\" Sedangkan sebagian yang lain menyebutkan, \"Harganya tiga dirham",
          "tr": "{…} Bize Kuteybe b. Saîd île İbni Rumh, Leys b. Sa'd'dan rivayet ettiler. H. Bize Züheyr b. Harb ile Îbni'l-Müsennâ dahî rivayet ettiler. (Dedilerki): Bize Yahya —ki El-Kattân'dır— rivayet etti. H. Bize İbni Numeyr de rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize Ebû Bekir b. Ebî Şeybe de rivayet etti, (Dediki): Bize Aliy b. Müshir rivayet etti. Bunların hepsi Ubeydullah'dan rivayet etmişlerdir. H. Bana Züheyr b. Harb dahî rivayet etti. (Dediki): Bize İsmail (yâni İbni Uleyye) rivayet etti. H. Bize Ebû'r-Rabî' ile Ebû Kâmil de rivayet ettiler. (Dedilerki): Bize Hammâd rivayet etti. H. Bana Muhammed b. Râfi' dahî rivayet etti, (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize Süfyân, Eyyûb-i Sahtiyanı ile Eyyûb b. Mûsâ ve İsmail b. Ümeyye'den naklen haber verdi. H. Bana Abdullah b. Abdirrahmân Ed-Dârimî de rivayet etti. (Dediki): Bize Ebû Nuaym haber verdi. (Dediki): Bize Süfyân, Eyyûb ile İsmâîl b. Ümeyye'den ve Ubeydullah ile Mûsâ b. Ukbe'den rivayet etti. H. Bize Muhammed b. Râfi' dahî rivayet etti. (Dediki): Bize Abdürrazzâk rivayet etti. (Dediki): Bize İbni Cüreyc haber verdi. (Dediki): Bana İsmâîl b. Ümeyye haber verdi. H. Bana Ebû't-Tâhir de rivayet etli. (Dediki): Bize İbni Vehb, Hanzale b. Ebi Süfyân El-Cümahî ile Ubeydullah b. Ömer, Mâlik b. Enes ve Usâme b. Zeyd El-Leysî'den naklen haber verdi. Bu râvİIerin hepsi Nâfi'den, o- da İbni Ömer'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen Yahya'nın, Mâlîk'den naklettiği hadîs gibi rivayette bulunmuşlardır. Şu kadar var ki, bazısı (sadece) «kıymeti» demiş; bazıları: «kıymeti üç dirhem olan» demişlerdir. İzah 1687 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 4408,
      "arabicNumber": "1687.01",
      "book": 29,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَعَنَ اللَّهُ السَّارِقَ يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Let there be the curse of Allah upon the thief who steals an egg and his hand is cut off, and steals a rope and his hand is cut off",
          "ur": "ابومعاویہ نے اعمش سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ چور پر لعنت کرے ، وہ انڈہ چراتا ہے تو اس کا ہاتھ کٹتا ہے اور رسی چراتا ہے تو اس کا ہاتھ کٹتا ہے",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Qu’Allah maudisse le voleur qui vole un œuf et se fait couper la main, ou vole une corde et se fait couper la main. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah melaknat seorang pencuri yang mencuri telur, lalu dipotong tangannya dan mencuri seutas tali lalu dipotong tangannya.\" Dan telah menceritakan kepada kami ['Amru An Naqid] dan [Ishaq bin Ibrahim] dan [Ali bin Khasyram] semuanya dari [Isa bin Yunus] dari [Al A'masy] dengan sanad seperti ini, namun ia menyebutkan, \"Jika ia mencuri seutas tali atau sebutir telur",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe ile Ebû Kureyb rivayet ettiler. (Dedilerki): Bize Ebû Muâviye, A'meş'den, o da Ebû Sâlih'den, o da Ebû Hureyre'den naklen rivayet etti. Ebû Hureyre göyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah hırsıza lanet eylesin! Bir yumurtayı çalar da eli kesilir; ipi çalar da eli kesilir!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 4409,
      "arabicNumber": "1687.02",
      "book": 29,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، كُلُّهُمْ عَنْ عِيسَى، بْنِ يُونُسَ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ غَيْرَ أَنَّهُ يَقُولُ ‏ \"‏ إِنْ سَرَقَ حَبْلاً وَإِنْ سَرَقَ بَيْضَةً ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith is narrated on the authority of A'mash with the same chain of transmitters with a slight variation of words",
          "ur": "عیسیٰ بن یونس نے اعمش سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، البتہ وہ کہتے ہیں : \" وہ خواہ رسی چرائے ، خواہ انڈہ چرائے",
          "fr": "Rapporté par A'mash : Ce hadith est rapporté par A'mash avec la même chaîne de transmetteurs, mais avec de légères différences dans les mots",
          "tr": "{…} Bize Amrû'n-Nâkıd ile ishâk b. İbrahim ve Aliy b. Haşrem hep birden îsâ b. Yûnus'dan, o da A'meş'den naklen bu isnâdla bu hadîsin mislini rivayet ettiler. Yalnız o: «Bir ip çalsa... ve bir yumurta çalsa...» diyormuş. İzah için buraya tıklayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 4410,
      "arabicNumber": "1688.01",
      "book": 29,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنَ عَائِشَةَ، أَنَّ قُرَيْشًا، أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ حِبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَكَلَّمَهُ أُسَامَةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏ ‏.‏ ثُمَّ قَامَ فَاخْتَطَبَ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ إِنَّمَا أَهْلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ‏\"‏ ‏.‏ وَفِي حَدِيثِ ابْنِ رُمْحٍ ‏\"‏ إِنَّمَا هَلَكَ الَّذِينَ مِنْ قَبْلِكُمْ ‏\"‏ ‏.‏",
        "translations": {
          "en": "A'isha reported that the Quraish had been anxious about the Makhzumi woman who had committed theft, and said:Who will speak to Allah's Messenger (ﷺ) about her? They said: Who dare it, but Usama, the loved one of Allah's Messenger (ﷺ)? So Usama spoke to him. Thereupon Allah's Messenger (ﷺ) said: Do you intercede regarding one of the punishments prescribed by Allah? He then stood up and addressed (people) saying: O people, those who have gone before you were destroyed, because if any one of high rank committed theft amongst them, they spared him; and it anyone of low rank committed theft, they inflicted the prescribed punishment upon him. By Allah, if Fatima, daughter of Muhammad, were to steal, I would have her hand cut off. In the hadith transmitted on the authority of Ibn Rumh (the words are):\" Verily those before you perished",
          "ur": "قتیبہ بن سعید اور محمد بن رمح نے کہا : ہمیں لیث نے ابن شہاب سے خبر دی ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ قریش کو ایک مخزومی عورت ، جس نے چوری کی تھی ، کے معاملے نے فکر مند کر دیا ، انہوں نے کہا : اس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے کون بات کرے گا؟ کہنے لگے : رسول اللہ صلی اللہ علیہ وسلم کے پیارے حضرت اسامہ رضی اللہ عنہ ہی اس کی جراءت کر سکتے ہیں؟ چنانچہ حضرت اسامہ رضی اللہ عنہ نے آپ سے گفتگو کی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" کیا تم حدود اللہ میں سے ایک حد ( کو ساقط کرنے ) کے بارے میں سفارش کر رہے ہو؟ \"\" پھر آپ صلی اللہ علیہ وسلم اٹھے ، خطبہ دیا اور فرمایا : \"\" اے لوگو! تم سے پہلے لوگوں کو اسی چیز نے تباہ کر ڈالا کہ جب ان کا کوئی معزز آدمی چوری کرتا تو اسے چھوڑ دیتے اور جب ان میں سے کوئی کمزور آدمی چوری کرتا تو اس پر حد نافذ کرتے ۔ اللہ کی قسم! اگر فاطمہ بنت محمد بھی چوری کرتی تو میں اس کا ہاتھ بھی کاٹ دیتا ۔ \"\" ابن رمح کی حدیث میں : \"\" تم سے پہلے لوگ تباہ ہو گئے \"\" کے الفاظ ہیں",
          "fr": "Rapporté par Aïcha رضي الله عنها : Les Quraysh étaient préoccupés par la femme de la tribu de Makhzoum qui avait commis un vol et ils se demandaient : « Qui parlera au Messager d’Allah ﷺ à son sujet ? » Ils dirent : « Qui oserait, à part Usama, le bien-aimé du Messager d’Allah ﷺ ? » Usama lui parla donc. Le Messager d’Allah ﷺ dit alors : « Intercédez-vous au sujet d’un des châtiments prescrits par Allah ? » Puis il se leva et fit un discours : « Ô gens, ceux qui vous ont précédés ont été détruits parce que, si une personne de haut rang commettait un vol parmi eux, ils l’épargnaient, mais si c’était une personne de rang inférieur, ils appliquaient la peine prescrite. Par Allah, si Fatima, la fille de Muhammad, volait, je lui couperais la main. » Dans le hadith transmis par Ibn Rumh, il est dit : « En vérité, ceux qui vous ont précédés ont péri. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah], bahwa orang-orang Quraisy merasa kebingungan dengan masalah seorang wanita Makhzumiyah yang ketahuan mencuri, lalu mereka berkata, \"Siapakah yang kiranya berani membicarakan hal ini kepada Rasulullah shallallahu 'alaihi wasallam?\" Maka mereka mengusulkan, \"Tidak ada yang berani melakukan hal ini kecuali Usamah, seorang yang dicintai oleh Rasulullah shallallahu 'alaihi wasallam.\" Sesaat kemudian, Usamah mengadukan hal itu kepada beliau, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kamu hendak memberi Syafa'at (keringanan) dalam hukum dari hukum-hukum Allah?\" Kemudian beliau berdiri dan berkhutbah, sabdanya: \"Wahai sekalian manusia, hanyasanya yang membinasakan orang-orang sebelum kalian adalah, ketika orang-orang terpandang mereka mencuri, mereka membiarkannya (tidak menghukum), sementara jika orang-orang yang rendahan dari mereka mencuri mereka menegakkan hukuman had. Demi Allah, sekiranya Fatimah binti Muhammad mencuri, sungguh aku sendiri yang akan memotong tangannya.\" Dan dalam hadits Ibnu Rumh disebutkan, \"Hanyasanya yang menyebabkan kebinasaan orang-orang sebelum kalian",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Ley», İbni Şihâb'dan, o da Urve'den, o da Âişe'den naklen haber verdi ki : Hırsızlık eden Mahzûmiyye kadının hâli Kureyş'i üzmüş; ve : Bunun hakkında Resûlullah (Sallallahu Aleyhi ve Sellem)'le kim konuşacak? demişler : (Bâzıları) : Buna kim cesaret edebilir! Meğer ki Resulullah (Sallallahu Aleyhi ve Sellem)'in habîbi Umâme ola! demişler. Bunun üzerine onunla Usâme konuşmuş. Resûlullah (Sallallahu Aleyhi ve Sellem): «Allah'ın hadlerinden bîr hadd hakkında şefaat mı ediyorsun?» buyurmuş. Sonra ayağa kalkarak hutbe okumuş ve şunları söylemiş : «Ey nâs! Sizden öncekileri (Allah) ancak şunun için helak etmiştir ki, onlar aralarından şerefti biri hırsızlık ederse onu bırakırlar; zayıf olan çalarsa üzerine haddi tatbik ederlerdi. Allah'a yemin olsun ki. Muhammed'in kızı Fâtıme hırsızlık etse mutlaka elini keserdim!..» İbni Rumh'un hadîsinde : «Sizden öncekiler helak oldu.» cümlesi vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 4411,
      "arabicNumber": "1688.02",
      "book": 29,
      "hadithInBook": 14,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ، وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الَّتِي سَرَقَتْ فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم فِي غَزْوَةِ الْفَتْحِ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأُتِيَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَلَّمَهُ فِيهَا أُسَامَةُ بْنُ زَيْدٍ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏ ‏.‏ فَقَالَ لَهُ أُسَامَةُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ ‏.‏ فَلَمَّا كَانَ الْعَشِيُّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاخْتَطَبَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَإِنِّي وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ‏\"‏ ‏.‏ ثُمَّ أَمَرَ بِتِلْكَ الْمَرْأَةِ الَّتِي سَرَقَتْ فَقُطِعَتْ يَدُهَا ‏.‏ قَالَ يُونُسُ قَالَ ابْنُ شِهَابٍ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَحَسُنَتْ تَوْبَتُهَا بَعْدُ وَتَزَوَّجَتْ وَكَانَتْ تَأْتِينِي بَعْدَ ذَلِكَ فَأَرْفَعُ حَاجَتَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "A'isha, the wife of Allah's Apostle (ﷺ), reported that the Quraish were concerned about the woman who had committed theft during the lifetime of Allah's Apostle (ﷺ), in the expedition of Victory (of Mecca). They said:Who would speak to Allah's Messenger (ﷺ) about her? They (again) said: Who can dare do this but Usama b. Zaid, the loved one of Allah's Messenger (ﷺ)? She was brought to Allah's Messenger (ﷺ) and Usama b. Zaid spoke about her to him (interceded on her behalf). The color of the face of Allah's Messenger (ﷺ) changed, and he said: Do you intercede in one of the prescribed punishments of Allah? He (Usama) said: 'Messenger of Allah, seek forgiveness for me.' When it was dusk. Allah's Messenger (ﷺ) stood up and gave an address. He (first) glorified Allah as He deserves, and then said: Now to our topic. This (injustice) destroyed those before you that when any one of (high) rank committed theft among them, they spared him, and when any weak one among them committed theft, they inflicted the prescribed punishment upon him. By Him in Whose Hand is my life, even if Fatima daughter of Muhammad were to commit theft, I would have cut off her hand. He (the Holy Prophet) then commanded about that woman who had committed theft, and her hand was cut off. `A'isha (further) said: Hers was a good repentance, and she later on married and used to come to me after that, and I conveyed her needs (and problems) to Allah's Messenger (ﷺ)",
          "ur": "یونس بن یزید نے مجھے ابن شہاب سے خبر دی ، انہوں نے کہا : مجھے عروہ بن زبیر نے نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت عائشہ رضی اللہ عنہا سے خبر دی کہ قریش کو اس عورت کے معاملے نے فکر مند کیا جس نے رسول اللہ صلی اللہ علیہ وسلم کے عہد میں ، غزوہ فتح مکہ ( کے دنوں ) میں چوری کی تھی ۔ انہوں نے کہا : اس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے کون بات کرے گا؟ ( کچھ ) لوگوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے چہیتے اسامہ بن زید رضی اللہ عنہ ہی اس کی جراءت کر سکتے ہیں ۔ وہ عورت رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کی گئی تو حضرت اسامہ بن زید رضی اللہ عنہ نے اس کے بارے میں بات کی ، اس پر رسول اللہ صلی اللہ علیہ وسلم کے چہرہ مبارک کا رنگ بدل گیا اور فرمایا : \"\" کیا تم اللہ کی حدود میں سے ایک حد کے بارے میں سفارش کر رہے ہو؟ \"\" تو حضرت اسامہ رضی اللہ عنہ نے عرض کی : اللہ کے رسول! میرے لئے مغفرت طلب کیجیے ۔ جب شام کا وقت ہوا تو رسول اللہ صلی اللہ علیہ وسلم اٹھے ، خطبہ دیا ، اللہ کے شایانِ شان اس کی ثنا بیان کی ، پھر فرمایا : \"\" امام بعد! تم سے پہلے لوگوں کو اسی چیز نے ہلاک کر ڈالا کہ جب ان میں سے کوئی معزز انسان چوری کرتا تو وہ اسے چھوڑ دیتے اور جب کمزور چوری کرتا تو اس پر حد نافذ کر دیتے اور میں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اگر فاطمہ بنت محمد بھی چوری کرتی تو اس کا ( بھی ) ہاتھ کاٹ دیتا ۔ \"\" پھر آپ صلی اللہ علیہ وسلم نے اس عورت کے بارے میں حکم دیا جس نے چوری کی تھی تو اس کا ہاتھ کاٹ دیا گیا ۔ یونس نے کہا : ابن شہاب نے کہا : عروہ نے کہا : حضرت عائشہ رضی اللہ عنہا نے کہا : اس کے بعد اس کی توبہ ( اللہ کی طرف توجہ بہت ) اچھی ( ہو گئی ) اور اس نے شادی کر لی اور اس کے بعد وہ میرے پاس آتی تھی تو میں اس کی ضرورت رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کرتی تھی ۔",
          "fr": "Rapporté par Aïcha (l’épouse du Messager d’Allah ﷺ) رضي الله عنها : Les Quraysh étaient préoccupés par la femme qui avait commis un vol du vivant du Messager d’Allah ﷺ, lors de la conquête de La Mecque. Ils dirent : « Qui parlera au Messager d’Allah ﷺ à son sujet ? » Ils dirent encore : « Qui oserait, à part Usama ibn Zaid, le bien-aimé du Messager d’Allah ﷺ ? » Elle fut amenée au Messager d’Allah ﷺ et Usama ibn Zaid intercéda pour elle. Le visage du Messager d’Allah ﷺ changea de couleur et il dit : « Intercédez-vous au sujet d’un des châtiments prescrits par Allah ? » Usama répondit : « Ô Messager d’Allah, demande pardon pour moi. » Le soir venu, le Messager d’Allah ﷺ se leva et fit un discours. Il glorifia d’abord Allah comme Il le mérite, puis dit : « Venons-en au sujet. Cette injustice a détruit ceux qui vous ont précédés : quand une personne de haut rang volait parmi eux, ils l’épargnaient, mais quand une personne faible volait, ils appliquaient la peine prescrite. Par Celui qui détient ma vie dans Sa main, même si Fatima, la fille de Muhammad, volait, je lui couperais la main. » Ensuite, il ordonna que la main de cette femme soit coupée. Aïcha ajouta : « Elle s’est bien repentie, s’est mariée plus tard et venait me voir, et je transmettais ses besoins au Messager d’Allah ﷺ. »",
          "id": "Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah bin Yahya] dan ini adalah lafadz Harmalah, keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa saat penaklukan Kota Makkah di masa Rasulullah shallallahu 'alaihi wasallam, orang-orang Quraisy pernah kebingungan mengenai masalahnya seorang wanita (mereka) yang ketahuan mencuri. Maka mereka berkata, \"Siapa kiranya yang berani mengadukan permasalahan ini kepada Rasulullah shallallahu 'alaihi wasallam?\" maka sebagian mereka mengusulkan, \"Siapa lagi kalau bukan Usamah bin Zaid, orang yang paling dicintai oleh Rasulullah shallallahu 'alaihi wasallam.\" Lalu wanita itu dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam dan Usamah bin Zaid pun mengadukan permasalahannya kepada beliau, tiba-tiba wajah Rasulullah shallallahu 'alaihi wasallam berubah menjadi merah seraya bersabda: \"Apakah kamu hendak meminta syafa'at (keringanan) dalam hukum Allah (yang telah ditetapkan)!\" Maka Usamah berkata kepada beliau, \"Mohonkanlah ampuanan bagiku wahai Rasulullah.\" Sore harinya Rasulullah shallallahu 'alaihi wasallam berdiri dan berkhutbah, setelah memuji Allah dengan ujian yang layak untuk-Nya, beliau bersabda: \"Amma Ba'du. Sesungguhnya yang membinasakan orang-orang sebelum kalian adalah manakala ada orang yang terpandang (terhormat) dari mereka mencuri, maka merekapun membiarkannya. Namun jika ada orang yang lemah dan hina di antara mereka ketahuan mencuri, maka dengan segera mereka melaksanakan hukuman atasnya. Demi Dzat yang jiwaku berada tangan-Nya, sekiranya Fatimah binti Muhammad mencuri, sungguh aku sendiri yang akan memotong tangannya.\" Akhirnya beliau memerintahkan terhadap wanita yang mencuri, lalu dipotonglah tangan wanita tersebut.\" [Yunus] berkata; [Ibnu Syihab] berkata; [Urwah] berkata; ['Aisyah] berkata, \"Setelah peristiwa itu, wanita tersebut malakukan taubat nasuha dan menikah, hingga pada suatu ketika ia datang kepadaku untuk meminta tolong mengajukan permintaannya kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku memnuhi permintaannya tersebut.\" Dan telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata, \"Seorang wanita Makhzumiyah pernah meminjam suatu barang, setelah itu dia mengaku barang tersebut adalah miliknya. Maka Nabi shallallahu 'alaihi wasallam menyuruh supaya tangannya dipotong, hingga keluarga wanita tersebut menemui Usamah bin Zaid dan mengadukan permasalahan wanita itu. Usamah lalu mengadukannya kepada Rasulullah shallallahu 'alaihi wasallam …', kemudian dia menyebutkan seperti hadits Laits dan Yunus",
          "tr": "Bana Ebû't-Tâhir ile Harmele b. Yahya da rivayet ettiler. Lâfız Harmele'nindir. (Dedilerki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus b. Yezîd, İbni Şihâb'dan naklen haber verdi. (Demişki): Bana Urve b. Zübeyr, Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Âişe'den naklen haber verdi ki: Nebi (Sallallahu Aleyhi ve Sellem) zamanında Fetih gazasında hırsızlık eden kadının hali Kureyş'i üzmüş de : Bunun hakkında Resulullah (Sallallahu Aleyhi ve Sellem)'le kim konuşacak? demişler. (Bâzıları): Buna kim cesaret edebilir! Meğer ki Resûlullah (Sallallahu Aleyhi ve Sellem)'in habîbi Usâme ola! demişler. Bunun üzerine kadın Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirilerek onun hakkında kendileri ile Usâme b. Zeyd konuşmuş. Derken Resûlullah (Sallallahu Aleyhi ve Sellem)'in yüzü renklenmiş; ve : «Allah'ın hadlerinden bir hadd hakkında şefâaf mı ediyorsun?» buyurmuş. Bunun üzerine Usâme kendilerine : — Benim için mağfiret dile yâ Resûlâllah! demiş. Akşam olunca Resûlullah (Sallallahu Aleyhi ve Sellem) ayağa kalkarak hutbe okumuş: Allah'a gerektiği gibi senada bulunmuş. Sonra şunları söylemiş: «Bundan sonra (malum ola ki) : (Allah) sizden öncekileri ancak şunun için helak etmiştir ki, onlar aralarından şerefli biri hırsızlık ederse onu bırakırlar; zayıf olan çalarsa üzerine haddi tatbik ederlerdi. Hiç şüphe yoîc ki ben —nefsim yed-i kudretinde bulunan Allah'a yemin olsun!— Muhammed'İn kızı Fâtıme hırsızlık etse mutlaka elini keserdim!» Bundan sonra emir buyurmuş ve hırsızlık eden o kadının eli kesilmiş. Yûnus şunları söylemiş: İbni Şihâb dedi ki: Urve şunu söyledi: Aişc: — Sonraları kadın güzelce tevbe etti; ve evlendi. Bu işten sonra bana gelir; ben de onun hacetini Resûlullah (Sallallahu Aleyhi ve Sellem)'e arz ederdim.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 4412,
      "arabicNumber": "1688.03",
      "book": 29,
      "hadithInBook": 15,
      "text": {
        "arabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَتِ امْرَأَةٌ مَخْزُومِيَّةٌ تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ تُقْطَعَ يَدُهَا فَأَتَى أَهْلُهَا أُسَامَةَ بْنَ زَيْدٍ فَكَلَّمُوهُ فَكَلَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِيهَا ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ اللَّيْثِ وَيُونُسَ ‏.‏",
        "translations": {
          "en": "A'isha reported that a woman from the tribe of Makhzum used to borrow things (from people) and then denied (having taken them). Allah's Apostle (ﷺ) commanded her hand to be cut off. Her relatives came to Usama b. Zaid and spoke to him (requesting him to intercede on her behalf). He spoke to Allah's Messenger (ﷺ) about her. The rest of the hadith is the same",
          "ur": "معمر نے زہری سے ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : بنو مخزوم کی ایک عورت عاریتا سامان لیتی تھی اور پھر اس کا انکار کر دیا کرتی تھی ، ( پھر اس نے چوری کر ڈالی ) تو نبی صلی اللہ علیہ وسلم نے اس کا ہاتھ کاٹنے کا حکم دیا ۔ اس پر اس کے گھر والے حضرت اسامہ بن زید رضی اللہ عنہ کے پاس آئے اور ان سے بات کی تو انہوں نے اس سلسلے میں رسول اللہ صلی اللہ علیہ وسلم سے بات کی ، پھر لیث اور یونس کی حدیث کی طرح بیان کیا",
          "fr": "Rapporté par Aïcha رضي الله عنها : Une femme de la tribu de Makhzoum empruntait des objets puis niait les avoir pris. Le Messager d’Allah ﷺ ordonna qu’on lui coupe la main. Ses proches allèrent voir Usama ibn Zaid pour qu’il intercède en sa faveur. Il parla au Messager d’Allah ﷺ à son sujet. Le reste du hadith est identique",
          "tr": "Bize Abd b. Humeyd dahî rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den, o da Urve'den, o da Aişe'den naklen haber verdi. Şöyle demiş: «Mahzûm kabilesinden bir kadın eşyayı âriyeten alır; ve bunu inkâr ederdi. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) elinin kesilmesini emir buyurdu. Derken ailesi Usâme b. Zeyd'e gelerek onunla konuştular. O da kadın hakkında Resûlullah (Sallallahu Aleyhi ve Sellem) le konuştu.» Bundan sonra râvi hadîsi, Leys ve Yûnus hadîsi gibi rivayet etmiştir. İzah 1689 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 4413,
      "arabicNumber": "1689",
      "book": 29,
      "hadithInBook": 16,
      "text": {
        "arabic": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ امْرَأَةً، مِنْ بَنِي مَخْزُومٍ سَرَقَتْ فَأُتِيَ بِهَا النَّبِيُّ صلى الله عليه وسلم فَعَاذَتْ بِأُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ وَاللَّهِ لَوْ كَانَتْ فَاطِمَةُ لَقَطَعْتُ يَدَهَا ‏\"‏ ‏.‏ فَقُطِعَتْ ‏.‏",
        "translations": {
          "en": "Jaibir reported that a woman from the tribe of Makhzum committed theft. She was brought to Allah's Apostle (ﷺ) and she sought refuge (intercession) from Umm Salama, the wife of Allah's Apostle (ﷺ). Thereupon Allah's Apostle (ﷺ) said:By Allah, even if she were Fatima, I would have her hand cut off. And thus her hand was cut off",
          "ur": "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ بنو مخزوم کی ایک عورت نے چوری کی ، اسے نبی صلی اللہ علیہ وسلم کے سامنے لایا گیا تو اس نے نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت ام سلمہ رضی اللہ عنہا کی پناہ لی تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" اگر فاطمہ ( بنت محمد صلی اللہ علیہ وسلم بھی ) ہوتی تو میں اس کا ہاتھ کاٹ دیتا ۔ \" چنانچہ اس عورت کا ہاتھ کاٹ دیا گیا",
          "fr": "Rapporté par Jabir : Une femme de la tribu de Makhzoum commit un vol. Elle fut amenée devant le Messager d’Allah ﷺ et chercha la protection (l’intercession) d’Umm Salama, l’épouse du Prophète ﷺ. Le Messager d’Allah ﷺ dit alors : « Par Allah, même si c’était Fatima, je lui couperais la main. » Sa main fut donc coupée",
          "id": "Dan telah menceritakan kepadaku [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'yan] telah menceritakan kepada kami [Ma'qil] dari [Abu Az Zubair] dari [Jabir], bahwa seorang wanita dari Bani Mahzum telah mencuri, lalu dia dihadapkan kepada Nabi shallallahu 'alaihi wasallam, namun wanita tersebut meminta perlindungan kepada Ummu Salamah isteri Nabi shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Allah, sekiranya yang melakukannya adalah Fatimah, sungguh aku akan memotong tangannya!\" Maka dipotonglah tangan wanita tersebut",
          "tr": "Bana Seleme b. Şebîb de rivayet etti. (Dediki): Bize Hasen b. A'yen rivayet etti. (Dediki): Bize Ma'kıl, Ebû'z-Zübeyr'den, o da Câbir'den naklen rivayet etti ki, Benî Mahzûm kabilesinden bir kadın hırsızlık etmiş de Nebi (Sallallahu Aleyhi ve Sellem)'e getirilmiş; ve hemen Nebi (Sallallahu Aleyhi ve Sellem)'in zevcesi Ümmü Seleme'ye sığınmış. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem): «Vallahi bu kadın Fâtıme olsa mutlaka elini keserdim!» buyurmuş; ve kadının eli kesilmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 4414,
      "arabicNumber": "1690.01",
      "book": 29,
      "hadithInBook": 17,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا هُشَيْمٌ، عَنْ مَنْصُورٍ، عَنِ الْحَسَنِ، عَنْ حِطَّانَ، بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلاً الْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ وَنَفْىُ سَنَةٍ وَالثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ وَالرَّجْمُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ubada b. as-Samit reported:Allah's Messenger (ﷺ) as saying: Receive (teaching) from me, receive (teaching) from me. Allah has ordained a way for those (women). When an unmarried male commits adultery with an unmarried female (they should receive) one hundred lashes and banishment for one year. And in case of married male committing adultery with a married female, they shall receive one hundred lashes and be stoned to death",
          "ur": "یحییٰ بن یحییٰ تمیمی نے کہا : ہشیم نے ہمیں منصور سے خبر دی ، انہوں نے حسن سے ، انہوں نے حطان بن عبداللہ رقاشی سے اور انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مجھ سے سیکھ لو ، مجھ سے سیکھ لو ، مجھ سے سیکھ لو ( جس طرح اللہ نے فرمایا تھا : \" یا اللہ ان کے لیے کوئی راہ نکالے ۔ \" ( النساء : 15 : 4 ) اللہ نے ان کے لیے راہ نکالی ہے ، کنوارا ، کنواری سے ( زنا کرے ) تو ( ہر ایک کے لیے ) سو کوڑے اور ایک سال کی جلا وطنی ہے اور شادی شدہ سے زنا کرے تو ( ہر ایک کے لیے ) سو کوڑے اور رجم ہے",
          "fr": "Rapporté par 'Ubada ibn as-Samit : Le Messager d’Allah ﷺ a dit : « Recevez l’enseignement de moi, recevez l’enseignement de moi. Allah a prescrit une voie pour ces femmes : lorsqu’un homme non marié commet l’adultère avec une femme non mariée, ils doivent recevoir cent coups de fouet et être exilés un an. Et si un homme marié commet l’adultère avec une femme mariée, ils doivent recevoir cent coups de fouet et être lapidés à mort. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Husyaim] dari [Manshur] dari [Al Hasan] dari [Hitthan bin Abdullah Ar Raqasyi] dari ['Ubadah bin Shamit] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ikutilah semua ajaranku, ikutilah semua ajaranku. Sungguh, Allah telah menetapkan hukuman bagi mereka (kaum wanita), perjaka dengan perawan hukumannya adalah cambuk seratus kali dan diasingkan selama setahun, sedangkan laki-laki dan wanita yang sudah menikah hukumannya adalah dera seratus kali dan dirajam.\" Dan telah menceritakan kepada kami ['Amru An Naqid] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Manshur] dengan isnad seperti ini",
          "tr": "Bize Yahya b. Yahya Et-Temîmî rivayet etti. (Dediki): Bize Hüseyin, Mansûr'dan, o da El-Hasen'den, o da Hıttân b. Abdillâh Er-Rakaaşî'den, o da Ubâde b. Sâmit'den naklen haber verdi. Ubâde şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem): «Benden Öğrenin! Benden öğrenin!.. Allah o (kadı) nlara (çıkar) bir yol haIketti. Bekârla bekâr (zina ederse) yüz dayakla bir sene sürgün; evli ile evliye yüz dayak ve recim (var!)» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 4415,
      "arabicNumber": "1690.02",
      "book": 29,
      "hadithInBook": 18,
      "text": {
        "arabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا مَنْصُورٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "The above hadith is likewise narrated through another chain of transmitters",
          "ur": "عمرو الناقد نے کہا : ہمیں ہشیم نے حدیث بیان کی ، کہا : ہمیں منصور نے اسی سند کے ساتھ اسی کے مانند خبر دی",
          "fr": "Rapporté par un autre transmetteur : Le hadith ci-dessus est également rapporté par une autre chaîne de transmetteurs",
          "tr": "{…} Bize Amru'n-Nâkıd da rivayet etti. (Dediki): Bize Hüseyni rivayet etti. (Dediki): Bize Mansûr bu isnâdla bu hadîsin mislini haber verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 4416,
      "arabicNumber": "1690.03",
      "book": 29,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنْ عَبْدِ الأَعْلَى، قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِذَا أُنْزِلَ عَلَيْهِ كُرِبَ لِذَلِكَ وَتَرَبَّدَ لَهُ وَجْهُهُ - قَالَ - فَأُنْزِلَ عَلَيْهِ ذَاتَ يَوْمٍ فَلُقِيَ كَذَلِكَ فَلَمَّا سُرِّيَ عَنْهُ قَالَ ‏ \"‏ خُذُوا عَنِّي فَقَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلاً الثَّيِّبُ بِالثَّيِّبِ وَالْبِكْرُ بِالْبِكْرِ الثَّيِّبُ جَلْدُ مِائَةٍ ثُمَّ رَجْمٌ بِالْحِجَارَةِ وَالْبِكْرُ جَلْدُ مِائَةٍ ثُمَّ نَفْىُ سَنَةٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ubada b. as-Samit reported that whenever Allah's Apostle (ﷺ) received revelation, he felt its rigour and the complexion of his face changed. One day revelation descended upon him, he felt the same rigour. When it was over and he felt relief, he said:Take from me. Verily Allah has ordained a way for them (the women who commit fornication),: (When) a married man (commits adultery) with a married woman, and an unmarried male with an unmarried woman, then in case of married (persons) there is (a punishment) of one hundred lashes and then stoning (to death). And in case of unmarried persons, (the punishment) is one hundred lashes and exile for one year",
          "ur": "سعید نے قتادہ سے ، انہوں نے حسن سے ، انہوں نے حِطان بن عبداللہ رقاشی سے اور انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم پر جب وحی نازل کی جاتی تو آپ پر اس کی وجہ سے تکلیف ( کی کیفیت ) طاری ہو جاتی تھی اور آپ کے چہرے کا رنگ تبدیل ہو جاتا تھا ، کہا : ایک دن آپ پر وحی نازل کی گئی تو آپ اسی کیفیت سے دوچار ہوئے ، جب آپ سے یہ کیفیت دور ہوئی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھ سے سیکھ لو ، اللہ نے ان ( عورتوں ) کے لیے راہ نکال دی ہے ، شادی شدہ ، شادی شدہ سے ( زنا کرے ) اور کنوارا ، کنواری سے ( یا کنوارا شادی شدہ سے تو ) شادی شدہ کے لیے ( سزا ) سو کوڑے ، پھر پتھروں سے رجم کرنا ہے اور کنوارے کے لیے سو کوڑے پھر ایک سال کی جلا وطنی ہے",
          "fr": "Rapporté par 'Ubada ibn as-Samit : Chaque fois que le Messager d’Allah ﷺ recevait une révélation, il ressentait sa rigueur et la couleur de son visage changeait. Un jour, une révélation descendit sur lui, il en ressentit la rigueur. Quand ce fut terminé et qu’il se sentit soulagé, il dit : « Prenez de moi. En vérité, Allah a prescrit une voie pour celles (les femmes qui commettent la fornication) : lorsqu’un homme marié commet l’adultère avec une femme mariée, et un homme non marié avec une femme non mariée, alors pour les mariés, la peine est cent coups de fouet puis la lapidation à mort. Et pour les non mariés, la peine est cent coups de fouet et l’exil pour un an. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] semuanya dari [Abdul A'la], [Ibnu Mutsanna] berkata; telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Hitthan bin Abdullah Ar Raqasyi] dari ['Ubadah bin Shamit] dia berkata, \"Setiap kali turun wahyu kepada Nabi Allah Shallallahu 'Alaihi Wasalam, maka beliau terlihat sangat susah dan wajahnya berubah menjadi pucat.\" 'Ubadah bin Shamit berkata, \"Pada suatu ketika wahyu turun kepada beliau, maka beliau terlihat sangat kepayahan, setelah kondisinya tenang kembali, beliau bersabda: \"Ikutilah semua ajaranku, sungguh Allah telah menetapkan hukum buat mereka. Allah telah menetapkan hukuman bagi mereka (kaum wanita); laki-laki dan wanita yang sudah menikah, dan perjaka dengan perawan. Bagi yang sudah menikah adalah hukuman cambuk seratus kali dan rajam dengan batu, sedangkan bagi yang belum menikah adalah cambuk seratus kali lalu diasingkan selama satu tahun.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] keduanya dari [Qatadah] dengan isnad ini, namun dalam hadits keduanya disebutkan, \"Hukuman bagi seorang yang belum menikah adalah dera dan diasingkan, sedangkan bagi orang yang telah menikah adalah dera dan dirajam.\" Dan tidak disebutkan, \"Selama setahun, dan tidak seratus kali",
          "tr": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr hep birden Abdülâlâ'dan rivayet ettiler. İbni'I-Müsennâ (Dediki): Bize Abdil-âla rivayet etti. (Dediki): Bize Saîd, Katâde'den, o da El-Hasen'dcn, o da Hittân b. Abdillâh Er-Rakaaşî'den, o da Ubâde b. Sâmil'den naklen rivayet ettî. Şöyle demiş: Nebi (Sallallahu Aleyhi ve Sellem) üzerine vahy indirildiği zaman bundan dolayı gussalamr ve yüzü rengini atardı. Bir gün kendisine vahy indirildi de yine böyle oldu. Açıldığı vakit: «Benden öğrenin! Allah o (kadı) nlara (çıkar) bir yol haIk etti. Evli ile evli, bekârla bekâr!.. Eliyle yüz dayak... sonra taşlarla recim! Bekâra yüz dayak... sonra bir sene sürgün!..» buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 4417,
      "arabicNumber": "1690.04",
      "book": 29,
      "hadithInBook": 20,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي كِلاَهُمَا، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ ‏.‏ غَيْرَ أَنَّ فِي، حَدِيثِهِمَا ‏ \"‏ الْبِكْرُ يُجْلَدُ وَيُنْفَى وَالثَّيِّبُ يُجْلَدُ وَيُرْجَمُ ‏\"‏ ‏.‏ لاَ يَذْكُرَانِ سَنَةً وَلاَ مِائَةً ‏",
        "translations": {
          "en": "This hadith has been reported on the authority of Qatada with the same chain of transmitters except with this variation that the unmarried is to be lashed and exiled, and the married one is to be lashed and stoned. There is neither any mention of one year nor that of one hundred",
          "ur": "شعبہ اور ہشام نے قتادہ سے اسی سند کے ساتھ حدیث بیان کی ، البتہ ان دونوں کی حدیث میں ہے : \" کنوارے کو کوڑے لگائے جائیں گے اور جلا وطن کیا جائے گا اور شادی شدہ کو کوڑے لگائے جائیں گے اور رجم کیا جائے گا ۔ \" ان دونوں نے ( جلا وطنی کے لیے ) ایک سال اور ( کوڑوں کے لیے ) ایک سو کا تذکرہ نہیں کیا",
          "fr": "Rapporté par Qatada : Ce hadith a été rapporté avec la même chaîne de transmetteurs, sauf que la variation est la suivante : le non marié doit être fouetté et exilé, et le marié doit être fouetté et lapidé. Il n’est pas mentionné la durée d’un an ni le nombre de cent",
          "tr": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. H. Bİze Muhammed b. Beşşar da rivayet etti. (Dediki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam rivayet eyledi. Bu râvilerin ikisi de Katâde'den bu isnadla rivayette bulunmuşlardır. Yalnız onların hadîsinde: «Bekâra dayak vurulur ve sürgün edilir. Evli ise döğülerek recmolunur.» ibaresi vardır. Sene ve yüz kelimelerini zikretmezler. İzah «Benden öğrenin» diye terceme ettiğimizt cümlesinin lügat mânâsı: «Benden alın!» demekse de bu cümle «an» edatı ile kullanılırsa: Benden öğrenin, benden nakledin! mânâsına gelir. ResûIallah (Sallallahu Aleyhi ve Sellem): «Allah onlara çıkar bir yol halketti...» buyurmakla Teâlâ Hazretlerinin : «Ölüm canlarını alıncaya yahut Allah kendilerine çıkar bir yol halkedinceye kadar o (kadı) nları evlerde tutun!» âyet-i kerîmesine işaret ederek çıkar yolun bu olduğunu anlatmıştır. Ulemâ bu âyet hakkında ihtilâf etmişlerdir. Bazılarına göre muhkemdir; bu hadîs onu tefsir etmiştir. Bir takımları Nûr sûresinin ilk âyeti ile neshedildiğini söylemiş; başkaları Nûr âyetinin bekârlar hakkında, bunun da evliler hususunda nazil olduğunu bildirmişlerdir. Bekârdan murâd: Henüz sahîh nikâhla cima' etmemiş âkil baliğ ve hür olan kimsedir. Ömründe bir defa olsun sahîh nikâhla cima' edene Araplar «seyyib» derler. Bu kelime Türkçede evli ve dul mânâlarına gelir. Aynı mânâda «muhsan» kelimesi de kullanılır. Zina eden bekâra yüz dayak, evliye recim cezası verileceği hususunda ulemâ ittifak etmişlerdir. Keadî İyâd'ın beyanına göre bu meselede ehl-i kıbleden bir tek muhalif çıkmamış; yalnız Hariciler'le Mu'tezile'den Nazzâm ve arkadaşları recme kail olmamışlardır. Recim: Bir kimseyi taşlayarak öldürmektir. Zina eden muhsana recimle birlikte dayak cezası verilip verilmiyeceğinde ihtilâf olunmuştur. Bir kısım ulemâya göre bunların ikisi de tatbîk edilir. Hz. Alî (Radiyallahu anh)'in, Hasan-ı Basrî, îshâk b. Râhuye ve Zahirîler'le bâzı Şâfiîler'in kavli budur. Cumhûr-u ulemâya göre yalnız recimle iktifa edilir. Delilleri: Peygamher Ayet : Beyine, delil, alamet. 'in muhsanı sadece recmettiğini bildiren hadîslerdir. Muhsan hakkında hem recim hem dayak cezası verileceğini bildiren hadîs mensuhtur. İlk zamanlarda tatbîk edilmiş; sonra hükmü kalkmıştır. Bekâr zânînin sürgün edilip edilmiyeceği meselesi de ihtilaflıdır. Şâfiîlerle diğer birçok ulemâya göre bekâr zânî erkek olsun kadın olsun dayaktan sonra bir sene sürgün edilir. Hanefîler'le diğer ulema sürgüne muhaliftirler. Delilleri Kur'ân-ı Kerîm'in zahiridir. Âyette sürgünden bahsedilmemiştir. îmam Mâlik ile Evzâî sürgünün erkeğe mahsus olduğuna kaildirler. Kadın avret olduğu, sürgün ise fitneye sebebiyet vereceği için bu ceza ona tatbik edilmez. Bu kavlin benzeri Hz. Alî (Radiyallahu anh)'dan da rivayet olunmuştur. Köle ve cariyelere gelince: Onlar recmedilmezler. Çünkü kendilerine verilecek cezanın hürlerinkinin yarısı kadar olacağı nass-ı Kur'ân'la bil­dirilmiştir. Recim ise yarıya bölünen şeylerden değildir. Binâenaleyh Hanefîler'e göre muhsan olmayan köle ve cariyelere ellişer dayak vurulur. îmam Şafiî'den bu hususta üç kavil nakledilmiştir: a) Köle ve câriye birer sene sürgün edilirler. Süfyân-ı Sevrî, Ebû Sevr, Dâvûd-u Zahirî ve İbni Cerîr'in kavilleri de budur. b) Altı ay sürgün edilirler. Çünkü ALLAH Teâlâ onlara hürlerinkinin yarısı kadar ceza ta'yîn etmiştir. Şâfiîler'ce esah olan kavil budur. c) Köle ve cariyeler asla sürgün edilemezler. Hasan-ı Basrî, Hammâd, îmam Mâlik, İmam Ahmed ve îshak’ın mezhepleri de budur. Resûlullah (Sallallahu Aleyhi ve Sellem)'in : «Bekârla bekâr zina ederse... ilâ ahir » sözü şartıyet bildirmek için değil, bekârla muhsanın haddlerini tayin için sevkedilmiştir. Yâni bekâr bir kimse gerek bekâr gerekse evli bir kadınla zina etsin, onun cezası yüz dayakla, bir yıl sürgün; keza evli bir kimse, evli veya bekâr bir kadınla zina etsin, cezası recimdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 4418,
      "arabicNumber": "1691.01",
      "book": 29,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، يَقُولُ قَالَ عُمَرُ بْنُ الْخَطَّابِ وَهُوَ جَالِسٌ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ اللَّهَ قَدْ بَعَثَ مُحَمَّدًا صلى الله عليه وسلم بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ مِمَّا أُنْزِلَ عَلَيْهِ آيَةُ الرَّجْمِ قَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا فَرَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَجَمْنَا بَعْدَهُ فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ مَا نَجِدُ الرَّجْمَ فِي كِتَابِ اللَّهِ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اللَّهُ وَإِنَّ الرَّجْمَ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أَحْصَنَ مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كَانَ الْحَبَلُ أَوْ الاِعْتِرَافُ ‏.‏",
        "translations": {
          "en": "Abdullah b. 'Abbas reported that 'Umar b. Khattab sat on the pulpit of Allah's Messenger (ﷺ) and said:Verily Allah sent Muhammad (ﷺ) with truth and He sent down the Book upon him, and the verse of stoning was included in what was sent down to him. We recited it, retained it in our memory and understood it. Allah's Messenger (ﷺ) awarded the punishment of stoning to death (to the married adulterer and adulteress) and, after him, we also awarded the punishment of stoning, I am afraid that with the lapse of time, the people (may forget it) and may say: We do not find the punishment of stoning in the Book of Allah, and thus go astray by abandoning this duty prescribed by Allah. Stoning is a duty laid down in Allah's Book for married men and women who commit adultery when proof is established, or it there is pregnancy, or a confession",
          "ur": "یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے کہا : مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی کہ انہوں نے حضرت عبداللہ بن عباس رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : حضرت عمر بن خطاب رضی اللہ عنہ نے کہا ، اور وہ رسول اللہ صلی اللہ علیہ وسلم کے منبر پر تشریف فرما تھے : بلاشبہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا اور آپ پر کتاب نازل فرمائی ، اللہ نے آپ پر جو نازل کیا اس میں رجم کی آیت بھی تھی ، ہم نے اسے پڑھا ، یاد کیا اور سمجھا ، اس لیے رسول اللہ صلی اللہ علیہ وسلم نے بھی رجم کی سزا دی اور آپ نے بعد ہم نے بھی رجم کی سزا دی ، مجھے ڈر ہے کہ لوگوں پر ایک لمبا زمانہ گزر جائے گا تو کوئی کہنے والا کہے گا : ہم اللہ کی کتاب میں رجم ( کا حکم ) نہیں پاتے ، تو وہ لوگ ایسے فرض کو چھوڑنے سے گمراہ ہو جائیں گے جسے اللہ نے نازل کیا ہے اور بلاشبہ اللہ کی کتاب میں رجم ( کا حکم ) عورتوں اور مردوں میں سے ہر ایک پرجس نے زنا کیا ، جب وہ شادی شدہ ہو ، برحق ہے ۔ ( یہ سزا اس وقت دی جائے گی ، ) جب شہادت قائم ہو جائے یا حمل ٹھہر جائے یا ( زانی کی طرف سے ) اعتراف ہو",
          "fr": "Rapporté par Abdullah ibn Abbas : Omar ibn Khattab رضي الله عنه monta sur la chaire du Messager d’Allah ﷺ et dit : « En vérité, Allah a envoyé Muhammad ﷺ avec la vérité et Il a fait descendre le Livre sur lui, et le verset de la lapidation faisait partie de ce qui lui a été révélé. Nous l’avons récité, mémorisé et compris. Le Messager d’Allah ﷺ a appliqué la peine de lapidation à mort (pour l’homme et la femme mariés qui commettent l’adultère), et après lui, nous l’avons aussi appliquée. J’ai peur qu’avec le temps, les gens l’oublient et disent : “Nous ne trouvons pas la peine de lapidation dans le Livre d’Allah”, et qu’ils s’égarent en abandonnant ce devoir prescrit par Allah. La lapidation est une obligation dans le Livre d’Allah pour les hommes et femmes mariés qui commettent l’adultère, lorsque la preuve est établie, ou en cas de grossesse, ou d’aveu. »",
          "id": "Telah menceritakan kepada kami [Abu At Thahir] dan [Harmalah bin Yahya] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah menceritakan kepadaku [Ubaidullah bin Abdullah bin 'Utbah] bahwa dia pernah mendengar [Abdullah bin Abbas] berkata, \" [Umar bin Khattab] berkata sambil duduk di atas mimbar Rasulullah shallallahu 'alaihi wasallam, \"Sesungguhnya Allah telah mengutus Muhammad shallallahu 'alaihi wasallam dengan kebenaran, dan Dia juga telah menurunkan kitab kepadanya, di antara ayat yang diturunkan kepadanya, yang kita semua telah membacanya, mempelajari dan berusaha memahaminya adalah ayat tentang rajam. Rasulullah shallallahu 'alaihi wasallam telah melaksanakan hukuman rajam tersebut, begitu juga kita akan tetap melaksanakan hukum tersebut setelah kepergian beliau. Aku khawatir, jika semakin lama, maka akan ada yang berkata, 'Di dalam al Qur'an tidak kita dapati ayat mengenai hukum rajam'. Lantas mereka tersesat karena meninggalkan hukum wajib itu yang telah diturunkan oleh Allah Ta'la. Sesungguhnya hukuman rajam yang terdapat dalam kitabullah, wajib dijalankan atas orang laki-laki dan perempuan yang telah menikah melakukan perzinahan apabila ada saksi, ada bukti dan juga ada pengakuan.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ibnu Abu Umar] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dengan isnad ini",
          "tr": "Bana Ebû't-Tâhir ile Harmele b. Yahya rivayet ettiler. (Dedilerki): Bize îbnî Vehb rivayet etti. (Dediki): Bana Yûnus, İbni Şihâb'dan naklen haber verdi. (Demişki): Bana Ubeydullah b. Abdİllâh b. Utbe haber verdi ki, kendisi Abdullah b. Abbâs'ı şunu söylerken işitmiş: Ömer b. Hattâb, Resûlullah (Sallallahu Aleyhi ve Sellem)'in minberi üzerinde otururken şöyle dedi: «Hiç şüphe yok ki Allah, Muhammed (Sallallahu Aleyhi ve Sellem)'i Hak (din) ile göndermiş ve kendisine kitabı indirmiştir. Ona indirilenlerden biri de recim âyetidir. Biz bu âyeti okuduk, belledik ve anladık. Resûlulllah (Sallallahu Aleyhi ve Sellem), recmetti; ondan sonra biz de recmetttk. Ama insanların üzerinden uzun zaman geçerse korkarım biri: Biz Allah'ın kitabında recmi bulamıyoruz, der de Allah'ın indirdiği bir farizayı terk etmekle dalâlete düşerler : Gerçekten erkek ve kadınlardan zina eden kimse üzerine —muhsan olmak, beyyine veya gebelik yahut i'tirâf bulunmak şartı ile— recim Allah'ın kitabında haktır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 4419,
      "arabicNumber": "1691.02",
      "book": 29,
      "hadithInBook": 22,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters",
          "ur": "سفیان نے زہری سے اسی سند کے ساتھ حدیث بیان کی",
          "fr": "Rapporté par Zuhri : Ce hadith a été rapporté par Zuhri avec la même chaîne de transmetteurs",
          "tr": "{…} Bize bu hadisi Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve İbni Ebî Ömer de rivayet ettiler. (Dedilerki) Bize Süfyân, Zührî'den bu isnadla rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 4420,
      "arabicNumber": "1691.03",
      "book": 29,
      "hadithInBook": 23,
      "text": {
        "arabic": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ أَتَى رَجُلٌ مِنَ الْمُسْلِمِينَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ ‏.‏ فَأَعْرَضَ عَنْهُ فَتَنَحَّى تِلْقَاءَ وَجْهِهِ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ ‏.‏ فَأَعْرَضَ عَنْهُ حَتَّى ثَنَى ذَلِكَ عَلَيْهِ أَرْبَعَ مَرَّاتٍ فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ دَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ أَحْصَنْتَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اذْهَبُوا بِهِ فَارْجُمُوهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that a person from amongst the Muslims came to Allah's Messenger (ﷺ) while he was in the mosque. He called him saying:Allah's Messenger. I have committed adultery. He (the Holy Prophet) turned away from him, He (again) came round facing him and said to him: Allah's Messenger, I have committed adultery. He (the Holy Prophet) turned away until he did that four times, and as he testified four times against his own self, Allah's Messenger (ﷺ) called him and said: Are you mad? He said: No. He (again) said: Are you married? He said: Yes. Thereupon Allah's Messenger (ﷺ) said: Take him and stone him",
          "ur": "عقیل ( بن خالد اموی ) نے ابن شہاب سے ، انہوں نے ابوسلمہ بن عبدالرحمان بن عوف اور سعید بن مسیب سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا : مسلمانوں میں سے ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، آپ مسجد میں تشریف فرما تھے ، اس نے آپ کو آواز دی اور کہا : اے اللہ کے رسول! میں نے زنا کیا ہے ۔ آپ صلی اللہ علیہ وسلم نے اس کی طرف سے منہ پھیر لیا ، وہ گھوم کر ایک طرف سے آپ کے سامنے آیا اور کہنے لگا : اللہ کے رسول! میں نے زنا کیا ہے ۔ آپ نے ( پھر ) اس سے منہ پھر لیا حتی کہ اس نے آپ کے سامنے یہی کلمات چار مرتبہ دہرائے ۔ جب اس نے اپنے خلاف چار گواہیاں دیں تو رسول اللہ صلی اللہ علیہ وسلم نے اسے بلایا اور پوچھا : \"\" کیا تمہیں جنون ہے؟ \"\" اس نے کہا : نہیں ۔ آپ نے پوچھا : \"\" کیا تم نے شادی کی ہے؟ \"\" اس نے کہا : جی ہاں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے لے جاؤ اور رجم کرو ۔ \"\" ابن شہاب نے کہا : مجھے اس آدمی نے بتایا جس نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے یہ حدیث سنی تھی ، وہ کہہ رہے تھے : میں بھی ان لوگوں میں تھا جنہوں نے اسے رجم کیا ، ہم نے اسے جنازہ گاہ میں رجم کیا تھا ، جب پتھروں نے اس کی برداشت ختم کر دی تو وہ بھاگ نکلا ، ہم نے اسے سیاہ پتھروں والی زمین میں جا لیا اور رجم کر دیا",
          "fr": "Rapporté par Abu Huraira : Un homme parmi les musulmans vint voir le Messager d’Allah ﷺ alors qu’il était à la mosquée. Il l’appela en disant : « Ô Messager d’Allah, j’ai commis l’adultère. » Le Prophète ﷺ se détourna de lui. Il revint se placer devant lui et répéta : « Ô Messager d’Allah, j’ai commis l’adultère. » Le Prophète ﷺ se détourna, et cela se répéta quatre fois. Après qu’il eut témoigné contre lui-même quatre fois, le Messager d’Allah ﷺ l’appela et lui demanda : « Es-tu fou ? » Il répondit : « Non. » Il demanda encore : « Es-tu marié ? » Il répondit : « Oui. » Le Messager d’Allah ﷺ dit alors : « Emmenez-le et lapidez-le. »",
          "id": "Telah menceritakan kepadaku [Abdul Malik bin Syu'aib bin Laits bin Sa'd] telah menceritakan kepadaku [ayahku] dari [kakekku] dia berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman bin 'Auf] dan [Sa'id bin Musayyab] dari [Abu Hurairah] bahwa dia berkata, \"Seorang laki-laki Muslim datang kepada Rasulullah shallallahu 'alaihi wasallam saat beliau berada di Masjid. Laki-laki itu berkata, \"Wahai Rasulullah, aku telah berzina!\" Namun beliau berpaling, lalu laki-laki itu pindah dan menghadap wajah beliau seraya berkata, \"Wahai Rasulullah, aku telah berzina!\" Beliau tetap memalingkan muka ke arah lain hingga hal itu terjadi berulang sampai empat kali, setelah laki-laki itu mengakui sampai empat kali bahwa dirinya telah berzina, Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Apakah kamu gila?\" Jawab orang itu, \"Tidak.\" Beliau bertanya kepadanya lagi: \"Apakah kamu telah menikah?\" dia menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepada para sahabat: \"Bawa orang ini, kemudian rajamlah dia.\" [Ibnu Syihab] berkata; telah menceritakan kepadaku dari [orang] yang pernah mendengar [Jabir bin Abdullah] berkata, \"Dan aku termasuk dari orang yang merajamnya, lalu kami merajamnya di dekat Mushalla, ketika bebatuan menimpanya maka dia berusaha kabur, lalu kami dapatkan dia di bawah terik (matahari), kemudian kami merajamnya lagi.\" Dan telah diriwayatkan juga oleh [Laits] dari [Abdurrahman bin Khalid bin Musafir] dari [Ibnu Syihab] dengan isnad seperti ini.\" Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Abu Al Yaman] telah menceritakan kepada kami [Syua'ib] dari [Az Zuhri] dengan isnad ini juga, dan dalam hadits keduanya, [Ibnu Syihab] berkata; telah menceritakan kepada dari orang yang pernah mendengar [Jabir bin Abdullah] sebagaimana yang telah di sebutkan oleh 'Uqail.\" Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah bin Yahya] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Yunus]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dan [Ibnu Juraij] semuanya dari [Az Zuhri] dari [Abu salamah] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam seperti riwayatnya 'Uqail dari Az Zuhri dari Sa'id dan Abu Salamah dari Abu Hurairah",
          "tr": "Bana Abdülmelik b. Şuayb b. Leys b. Sa'd rivayet etti. (Dediki): Bana babam, dedemden rivayet etti. (Demişki): Bana Ukayl, İbni Şihâb'dan, o da Ebû Seleme b. Abdirrahmân b. Avf ile Saîd b. El-Müseyyeb'den, onlar da Ebû Hureyre'den naklen rivayet etti ki, Ebû Hureyre şöyle demiş: Resûlullah (Sallallahu Aleyhi ve Sellem)'e mescidde iken müslümanlardan bir adam geldi ve kendilerine seslenerek: Yâ Resûlâllah, ben zina ettim; dedi. Resûlullah (Sallallahu Aleyhi ve Sellem) ondan yüzünü çevirdi. Fakat adam yüzünü çevirdiği tarafa dönerek kendilerine (tekrar) : Yâ Resûlâllah, ben zina ettim; dedi. Ondan yine yüzünü çevirdi. Tâ ki bunu dört defa tekrarladı. Adam kendi aleyhine dört defa şehâdette bulununca Resûlullah (Sallallahu Aleyhi ve Sellem) kendisini çağırdı; ve: «Sende delilik var mı?» diye sordu. Adam: — Hayır! cevâbını verdi. «Hiç evlendin mi?» diye sordu. Adam: — Evet! dedi. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem): «Bunu götürün de recmedin!» buyurdular. İbni Şihâb (Demişki): Bana Câbir b. Abdillâh'ı dinleyen biri haber verdi. Câbir: «Onu recmedenler arasında ben de vardım. Onu musalla'da recmettik. Taşlar kendisini yaraladığı zaman kaçtı. Fakat biz ona Harra'da yetişerek kendisini recmettik.» diyormuş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 4421,
      "arabicNumber": "1691.04",
      "book": 29,
      "hadithInBook": 24,
      "text": {
        "arabic": "قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي مَنْ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ فَكُنْتُ فِيمَنْ رَجَمَهُ فَرَجَمْنَاهُ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ فَأَدْرَكْنَاهُ بِالْحَرَّةِ فَرَجَمْنَاهُ ‏.‏",
        "translations": {
          "en": "Ibn Shihab (one of the narrators) said:One who had heard Jabir b. 'Abdullah saying this informed me thus: I was one of those who stoned him. We stoned him at the place of prayer (either that of 'Id or a funeral). When the stones hurt him, he ran away. We caught him in the Harra and stoned him (to death)",
          "ur": "عبدالرحمان بن خالد بن مسافر نے ابن شہاب سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Rapporté par Ibn Shihab : Quelqu’un qui avait entendu Jabir ibn Abdullah dire cela m’a informé ainsi : « J’étais parmi ceux qui l’ont lapidé. Nous l’avons lapidé à l’endroit de la prière (soit celle de l’Aïd, soit d’un enterrement). Quand les pierres l’ont blessé, il s’est enfui. Nous l’avons rattrapé dans la Harra et nous l’avons lapidé (jusqu’à la mort). »",
          "tr": "Bu hadîsi Leys dahi Abdurrahmân b. Hâlid b. Müsâfir'den, o da İbn Şihâb'dan bu isnadla bunun gibi rivâyet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 4422,
      "arabicNumber": "1691.05",
      "book": 29,
      "hadithInBook": 25,
      "text": {
        "arabic": "وَرَوَاهُ اللَّيْثُ أَيْضًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَالِدِ بْنِ مُسَافِرٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏ وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ أَيْضًا وَفِي حَدِيثِهِمَا جَمِيعًا قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ كَمَا ذَكَرَ عُقَيْلٌ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated through another chain of transmitters",
          "ur": "شعیب نے بھی شہری سے اسی سند کے ساتھ خبر دی اور ان دونوں ( عبدالرحمان بن خالد بن مسافر اور شعیب ) کی حدیث میں ہے : ابن شہاب نے کہا : مجھے اس شخص نے بتایا جس نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ۔ اسی طرح جیسے عقیل نے حدیث بیان کی",
          "fr": "Rapporté par un autre transmetteur : Ce hadith a été rapporté par une autre chaîne de transmetteurs",
          "tr": "(Bana bu hadisi Abdullah b. Abdirrahmân Ed-Dârimî de rivâyet etti. ki): Bize Ebû'l-Yemân rivâyet etti. ki): Bize Şuayb, Zührî'den yine bu isnâdla haber verdi. ikisinin hadîsinde Ukayl'in zikrettiği gibi: «İbn Şihâb ki): Bana Câbir b. Abdillâh'ı dinleyen biri haber verdi.» ibaresi vardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 4423,
      "arabicNumber": "1691.06",
      "book": 29,
      "hadithInBook": 26,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، وَابْنُ، جُرَيْجٍ كُلُّهُمْ عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ نَحْوَ رِوَايَةِ عُقَيْلٍ عَنِ الزُّهْرِيِّ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Abu Huraira through other chains of transmitters",
          "ur": "یونس ، معمر اور ابن جریج سب نے زہری سے ، انہوں نے ابوسلمہ سے ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی طرح روایت بیان کی جس طرح عقیل نے زہری سے ، انہوں نے سعید ( بن مسیب ) اور ابوسلمہ ( بن عبدالرحمان بن عوف ) سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی",
          "fr": "Rapporté par un autre transmetteur : Ce hadith a été rapporté par Abu Huraira à travers d’autres chaînes de transmetteurs",
          "tr": "{…} Bana Ebû't-Tâhir ile Harmele b. Yahya da rivayet ettiler. (Dedilerki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus haber verdi. H. Bize İshâk b. İbrahim dahi rivayet etti. (Dediki): Bize Abdürrazzâk haber verdi. (Dediki): Bize Ma'mer ile İbni Cüreyc haber verdi. Bu râvilerin hepsi Zührî'den, o da Ebû Seleme'den, o da Câbir b. Abdillâh'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen Ukayl'in, Zührî'den, onun da Saîd ile Ebû Seleme'den, onların da Ebû Hureyre'den naklettikleri gibi rivayet etmişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 4424,
      "arabicNumber": "1692.01",
      "book": 29,
      "hadithInBook": 27,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ، حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ مَاعِزَ بْنَ مَالِكٍ حِينَ جِيءَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم رَجُلٌ قَصِيرٌ أَعْضَلُ لَيْسَ عَلَيْهِ رِدَاءٌ فَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ أَنَّهُ زَنَى فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلَعَلَّكَ ‏\"‏ ‏.‏ قَالَ لاَ وَاللَّهِ إِنَّهُ قَدْ زَنَى الأَخِرُ - قَالَ - فَرَجَمَهُ ثُمَّ خَطَبَ فَقَالَ ‏\"‏ أَلاَ كُلَّمَا نَفَرْنَا غَازِينَ فِي سَبِيلِ اللَّهِ خَلَفَ أَحَدُهُمْ لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ يَمْنَحُ أَحَدُهُمُ الْكُثْبَةَ أَمَا وَاللَّهِ إِنْ يُمْكِنِّي مِنْ أَحَدِهِمْ لأُنَكِّلَنَّهُ عَنْهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Jabir b. Samura reported:As he was being brought to Allah's Apostle (ﷺ) I saw Ma'iz b. Malik-a short-statured person with strong sinews, having no cloak around him. He bore witness against his own self four times that he had committed adultery, whereupon Allah's Messenger (ﷺ) said: Perhaps (you kissed her or embraced her). He said: No. by God, one deviating (from the path of virtue) has committed adultery. He then got him stoned (to death), and then delivered the address: Behold, as we set out for Jihad in the cause of Allah, one of you lagged behind and shrieked like the bleating of a male goat, and gave a small quantity of milk. By Allah, in case I get hold of him, I shall certainly punish him",
          "ur": "ابو عوانہ نے سماک بن حرب سے ، انہوں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں نے ماعز بن مالک کو ، جب وہ نبی صلی اللہ علیہ وسلم کے سامنے پیش کیے گئے ، دیکھا ، وہ چھوٹے قد کے مضبوط پٹھوں والے آدمی تھے ، ان پر کوئی چادر نہیں تھی ۔ انہوں نے اپنے خلاف چار مرتبہ گواہی دی کہ انہوں نے زنا کیا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" شاید تم نے ( کچھ اور مثلا : بوس و کنار کیا ہو گا؟ ) \" انہوں نے کہا : نہیں ، اللہ کی قسم! اِس بدبخت نے زنا ( ہی ) کیا ہے ۔ کہا : آپ نے اسے رجم کرنے کا حکم دیا ، پھر خطبہ دیا اور فرمایا : \" سنو ، جب ہم اللہ کی راہ میں جہاد کے لیے نکلتے ہیں تو ان لوگوں میں سے کوئی پیچھے رہ جاتا ہے ، وہ نسل کشی کے بکرے کی طرح جوش سے آوازیں نکالتا ہے اور ( عورتوں کو آمادہ کرنے کے لیے ) معمولی چیز پیش کرتا ہے ۔ سنو! اللہ کی قسم! اگر اُس نے مجھے ان میں سے کسی ایک کو ( ثبوت سمیت ) میرے قابو میں دیا تو میں اس کو عبرتناک سزا دوں گا",
          "fr": "Rapporté par Jabir ibn Samura : Alors qu’on amenait Ma’iz ibn Malik devant le Messager d’Allah ﷺ, j’ai vu un homme de petite taille, musclé, sans manteau. Il témoigna contre lui-même quatre fois d’avoir commis l’adultère. Le Messager d’Allah ﷺ lui dit : « Peut-être l’as-tu seulement embrassée ou enlacée ? » Il répondit : « Non, par Dieu, j’ai vraiment commis l’adultère. » Le Prophète ﷺ ordonna alors qu’il soit lapidé à mort, puis fit un discours : « Sachez que lorsque nous partons pour le jihad dans la voie d’Allah, l’un d’entre vous reste en arrière et crie comme un bouc, et donne un peu de lait. Par Allah, si je l’attrape, je le punirai. »",
          "id": "Telah menceritakan kepadaku [Abu Kamil Fudlail bin Hushain Al Jahdari] telah menceritakan kepada kami [Abu 'Awanah] dari [Simak bin Harb] dari [Jabir bin Samurah] dia berkata, \"Aku melihat Ma'iz bin Malik ketika dia datang kepada Nabi shallallahu 'alaihi wasallam, kelihatan olehku bahwa dia adalah orang yang pendek betisnya dan tidak memakai mantel, lalu dia mengaku sampai empat kali bahwa dirinya telah berzina. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Barangkali kamu hanya sekedar mencium.\" Namun dia memperkuat pengakuannya dengan diserati sumpah, bahwa dia memang telah berzina.\" Jabir melanjutkan, \"Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya merajamnya. Setelah itu beliau berkhutbah: \"Ketika kami akan berangkat perang di jalan Allah, ternyata salah seorang dari kalian ada yang tidak ikut serta, lalu dia mempunyai desahan seperti kambing jantan mendesah (saat kawin), lalu dia memberikan sedikit sesuatu (kepada wanita tersebut). Demi Allah, sekiranya aku diberikan kesempatan, niscaya aku akan memberikan hukuman kepadanya sebagai suatu pelajaran",
          "tr": "Bana Ebû Kâmil Fudayl b. Huseyn El-Cahderî rivayet etti. (Dediki): Bize Ebû Avâne, Simâk b. Harb'dan, o da Câbir b. Semura'dan naklen rivayet etti. Şöyle demiş : Mâiz b. Mâlik'i Nebi (Sallallahu Aleyhi ve Sellem)'e getirildiği vakit gördüm. Kısa tıknaz bir adam! üzerinde cübbe yok! Zina ettiğine nefsi aleyhine dört defa şâhidlik etti. Resûlullah (Sallallahu Aleyhi ve Sellem): «Olabilir ki sen...» buyurdu. Mâiz: — Hayır vallahi! Bu alçak gerçekten zina etti... dedi. Bunun üzerine onu recmetti(rdi). Sonra hutbe okuyarak: «Dikkat! Biz Allah yolunda her gazaya gidişimizde bunlardan biri kalır; onun teke melemesi gibi bir meleyişi vardır. Bunlardan biri (karıya) bir şeyler veriri.. Beri bakın! Vallahi, Allah bunlardan bîri hakkında bana imkân verse bu işten dolayı onu mutlaka İbretlik ederdim!..» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 4425,
      "arabicNumber": "1692.02",
      "book": 29,
      "hadithInBook": 28,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَجُلٍ قَصِيرٍ أَشْعَثَ ذِي عَضَلاَتٍ عَلَيْهِ إِزَارٌ وَقَدْ زَنَى فَرَدَّهُ مَرَّتَيْنِ ثُمَّ أَمَرَ بِهِ فَرُجِمَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلَّمَا نَفَرْنَا غَازِينَ فِي سَبِيلِ اللَّهِ تَخَلَّفَ أَحَدُكُمْ يَنِبُّ نَبِيبَ التَّيْسِ يَمْنَحُ إِحْدَاهُنَّ الْكُثْبَةَ إِنَّ اللَّهَ لاَ يُمْكِنِّي مِنْ أَحَدٍ مِنْهُمْ إِلاَّ جَعَلْتُهُ نَكَالاً ‏\"‏ ‏.‏ أَوْ نَكَّلْتُهُ ‏.‏ قَالَ فَحَدَّثْتُهُ سَعِيدَ بْنَ جُبَيْرٍ فَقَالَ إِنَّهُ رَدَّهُ أَرْبَعَ مَرَّاتٍ ‏.‏",
        "translations": {
          "en": "Jabir b. Samura reported that there was brought to Allah's Messenger (ﷺ) a short-statured person with thick uncombed hair, muscular body, having a mantle around him and he had committed adultery. He turned him away twice and then made pronouncement about him and he was stoned. Then Allah's Messenger (ﷺ) said:We set out for Jihad in the cause of Allah and one of you lagged behind and shrieked like the bleating of a male goat and one of then (goats' gave a small quantity of milk. In case Allah gives me power over one of them, I will punish him (in such a way that it may have a deterrent effect upon others). In another narration transmitted on the authority of Sa'id b Jubair (the words are), that He (the Holy Prophet) turned him away four times",
          "ur": "محمد بن جعفر نے کہا : ہمیں شعبہ نے سماک بن حرب سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے پاس چھوٹے قد ، پراگندہ بالوں اور مضبوط پٹھوں والا ایک شخص لایا گیا ، اس ( کے جسم ) پر ایک تہبند تھا اور اس نے زنا کا ارتکاب کیا تھا ، آپ نے اسے دوبارہ لوٹایا ، پھر اسے ( رجم کرنے کا ) حکم دیا تو اسے رجم کر دیا گیا ، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ( خطبہ دیتے ہوئے ) فرمایا : \"\" ہم جب بھی اللہ کی راہ میں جہاد کے لیے نکلتے ہیں تو تم لوگوں میں سے کوئی شخص پیچھے رہ جاتا ہے ، وہ نسل کشی کے بکرے کی طرح جوش سے آوازیں نکالتا ہے اور عورتوں میں سے کسی کو ( آمادہ کرنے کے لیے ) معمولی سی چیز پیش کرتا ہے ۔ بلاشبہ اللہ جب بھی مجھے ان میں سے کسی ایک پر قابو دے گا تو میں لازما اسے ( لوگوں کے لیے ) عبرت بنا دوں گا ، یا عبرتناک سزا دوں گا کہا : میں نے یہ حدیث سعید بن جبیر کو بیان کی تو انہوں نے کہا : آپ نے اسے چار بار واپس کیا تھا",
          "fr": "Rapporté par Jabir ibn Samura : On amena devant le Messager d’Allah ﷺ un homme de petite taille, aux cheveux épais et ébouriffés, au corps musclé, portant un manteau, qui avait commis l’adultère. Le Prophète ﷺ le repoussa deux fois, puis prononça le jugement et il fut lapidé. Ensuite, le Messager d’Allah ﷺ dit : « Nous sommes partis pour le jihad dans la voie d’Allah et l’un d’entre vous est resté en arrière, criant comme un bouc, et l’une des chèvres a donné un peu de lait. Si Allah me donne la capacité de l’attraper, je le punirai pour servir d’exemple. » Dans une autre version rapportée par Sa’id ibn Jubair, il est dit que le Prophète ﷺ l’a repoussé quatre fois",
          "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] sedangkan lafadznya dari Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dia berkata; aku pernah mendengar [Jabir bin Samurah] berkata, \"Pada suatu hari, seorang laki-laki bertubuh pendek dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam, dia terlihat kusut, dekil dan mengenakan kain sarung, Dia mengaku bahwa dirinya telah berzina, pada awalnya beliau menolak pengakuannya sampai dua kali. Setelah itu, barulah beliau memerintahkan para sahabatnya untuk merajamnya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika kami akan berangkat perang untuk berjihad di jalan Allah, ternyata salah seorang dari kalian ada yang tidak ikut berangkat bersama kami, dia mempunyai desahan seperti desahan hewan dan memberikan sesuatu kepada salah seorang para wanita tersebut. Sekiranya Allah memberikan kesempatan kepadaku untuk berbuat sesuatu kepadanya, niscaya aku akan memberikan hukuman kepadanya sebagai pelajaran -atau akan aku kasih pelajaran-.\" Perawi berkata, \"Kemudian hal ini aku ceritakan kepada [Sa'id bin Jubair] maka dia berkata, \"Beliau menolaknya sampai empat kali.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Syababah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Abu 'Amir Al 'Aqdi] keduanya dari [Syu'bah] dari [Simak] dari [Jabir bin Samurah] dari Nabi shallallahu 'alaihi wasallam seperti hadits Ibnu Ja'far. [Syababah] juga sepakat mengenai perkataannya, \"Maka beliau menolaknya sampai dua kali.\" Sedangkan dalam hadits Abu 'Amir disebutkan, \"Maka beliau menolaknya dua kali atau tiga kali",
          "tr": "Bize Muhammed b. El-Müsennâ ile İbni Beşşâr da rivayet ettiler. Lafız İbni'l-Müsennâ'nındır. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be, Simâk b. Harb'dan rivayet etti. (Demişki): Câbir b. Semura'yı şunları söylerken işittim: Resûlullah (Sallallahu Aleyhi ve Sellem)'e kısa, dağınık saçlı, adaleli bir adam getirdiler. Üzerinde bir gömlek vardı; zina etmişti. Nebi (Sallallahu Aleyhi ve Sellem) onu iki defa reddetti. Sonra emir verdi de recm-olundu. Müteakiben Resûlullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdular: «Biz Allah yolunda her gazaya gittiğimizde biriniz kalır; teke meleyişi gibi meler; o karılardan birine bir şeyler verir! Allah bunlardan biri hakkında bana imkân vermez ki!.. Yoksa onu ibret yapardım! (Yahut: Onu tenkil ederdim!» Simâk demiş ki: Ben bu hadîsi Saîd b. Cübeyr'e rivayet ettim de: Nebi (Sallallahu Aleyhi ve Sellem) onu dört defa reddetti... dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 4426,
      "arabicNumber": "1692.03",
      "book": 29,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ نَحْوَ حَدِيثِ ابْنِ جَعْفَرٍ وَوَافَقَهُ شَبَابَةُ عَلَى قَوْلِهِ فَرَدَّهُ مَرَّتَيْنِ ‏.‏ وَفِي حَدِيثِ أَبِي عَامِرٍ فَرَدَّهُ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Jabir b. Samura through another chain of transmitters with the difference that along with the mentioning (of the fact) that he (the Holy Prophet) turned him away twice, or thrice",
          "ur": "شبابہ اور ابوعامر عقدی دونوں نے شعبہ سے حدیث بیان کی ، انہوں نے سماک سے ، انہوں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ابن جعفر کی حدیث کی طرح روایت کی اور شبابہ نے اس بات میں ان کی موافقت کی کہ آپ صلی اللہ علیہ وسلم نے اسے دوبار لوٹایا ۔ اور ابوعامر کی حدیث میں ہے : آپ نے اسے دو یا تین بار واپس کیا",
          "fr": "Rapporté par Jabir ibn Samura : Ce hadith a été rapporté par une autre chaîne de transmetteurs, avec la différence que le Prophète ﷺ l’a repoussé deux ou trois fois",
          "tr": "{…} Bize Ebû Bekir b. Ebî Şeybe rivayet etti. (Dediki): Bize Şebâbe rivayet etti. H. Bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Ebû Âmir El-Akadî haber verdi. Bunların ikisi de Şu'be'den, o da Simâk'den, o da Câbir b. Semûra'dan, o da Nebi (Sallallahu Aleyhi ve Sellem)'den İbni Ca'fer'in hadîsi gibi rivayette bulunmuşlardır. Şebâbe: «Onu iki defa reddetti.» cümlesinde İbni Ca'fer'e muvafakat etmiştir. Ebû Âmir'in hadîsinde: «Onu iki yahut üç defa reddetti.» ibaresi vardır. İzah 1696 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 4427,
      "arabicNumber": "1693",
      "book": 29,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لِقُتَيْبَةَ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِمَاعِزِ بْنِ مَالِكٍ ‏\"‏ أَحَقٌّ مَا بَلَغَنِي عَنْكَ ‏\"‏ ‏.‏ قَالَ وَمَا بَلَغَكَ عَنِّي قَالَ ‏\"‏ بَلَغَنِي أَنَّكَ وَقَعْتَ بِجَارِيَةِ آلِ فُلاَنٍ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ ‏.‏ ثُمَّ أَمَرَ بِهِ فَرُجِمَ ‏.‏",
        "translations": {
          "en": "Ibn Abbas reported that Allah's Apostle (ﷺ) said to Ma'iz b. Malik:Is it true what has reached me about you? He said: What has reached you about me? He said: It has reached me that you have committed (adultery) with the slave-girl of so and so? He said: Yes. He (the narrator) said: He testified four times. He (the Holy Prophet) then made pronouncement about him and he was stoned (to death)",
          "ur": "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے ( چار بار واپس کرنے اور اس کے اصرار کے بعد ) ماعز بن مالک رضی اللہ عنہ سے پوچھا : \" کیا وہ بات سچ ہے جو مجھے تمہارے بارے میں پہنچی ہے؟ \" انہوں نے کہا : میرے بارے میں آپ کو کیا بات پہنچی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے یہ بات پہنچی ہے کہ تم نے فلاں خاندان کی لونڈی سے زنا کیا ہے ۔ \" انہوں نے کہا : جی ہاں ۔ کہا : تو انہوں نے ( اپنے خلاف ) چار گواہیاں دیں ، پھر آپ نے ان ( کو رجم کرنے ) کے بارے میں حکم دیا تو انہیں رجم کر دیا گیا",
          "fr": "Rapporté par Ibn Abbas : Le Messager d’Allah ﷺ demanda à Ma’iz ibn Malik : « Est-ce vrai ce que j’ai entendu à ton sujet ? » Il répondit : « Qu’as-tu entendu à mon sujet ? » Le Prophète ﷺ dit : « J’ai entendu dire que tu as commis l’adultère avec la servante d’untel. » Il répondit : « Oui. » Il témoigna alors quatre fois. Le Prophète ﷺ prononça le jugement et il fut lapidé à mort",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abu Kamil Al Jahdari] sedangkan lafadznya dari Wutaibah, keduanya berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Simak] dari [Sa'id bin Jubair] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Ma'iz bin Malik: \"Apakah benar berita yang telah sampai kepadaku tentangmu?\" Ma'iz balik bertanya, \"Berita apa kiranya yang sampai kepada anda tentangku?\" beliau menjawab: \"Benarkah kamu telah berzina dengan budak perempuan keluarga fulan?\" Ma'iz menjawab, \"Ya, benar.\" Ibnu Abbas berkata, \"Kemudian dia bersaksi sampai empat kali persaksian, kemudian beliau memerintahkan untuk merajamnya",
          "tr": "Bize Kuteybe b. Saîd ile Ebû Kâmil El-Cahderî rivayet ettiler. Lâfız Kuteybe'nindir. (Dedilerki): Bize Ebû Avâne, Simâk'den, o da Saîd b. Cübeyr'den, o da İbni Abbâs'dan naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) Mâiz b. Mâlik'e : «Senin hakkında kulağıma gelen doğru mudur?»diye sormuş. Mâiz: — Benim hakkımda duyduğun nedir? demiş. «Duydum ki filân oğullarının cariyesi ile cinsî münasebette bulunmuşsun!» buyurmuşlar. Mâiz: — Evet! demiş. Bunun üzerine kendisi dört defa şehâdette bulunmuş. Sonra emir buyurarak recmolunmuş. İzah 1696 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 4428,
      "arabicNumber": "1694.01",
      "book": 29,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الأَعْلَى، حَدَّثَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي، سَعِيدٍ أَنَّ رَجُلاً، مِنْ أَسْلَمَ يُقَالُ لَهُ مَاعِزُ بْنُ مَالِكٍ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أَصَبْتُ فَاحِشَةً فَأَقِمْهُ عَلَىَّ ‏.‏ فَرَدَّهُ النَّبِيُّ صلى الله عليه وسلم مِرَارًا قَالَ ثُمَّ سَأَلَ قَوْمَهُ فَقَالُوا مَا نَعْلَمُ بِهِ بَأْسًا إِلاَّ أَنَّهُ أَصَابَ شَيْئًا يَرَى أَنَّهُ لاَ يُخْرِجُهُ مِنْهُ إِلاَّ أَنْ يُقَامَ فِيهِ الْحَدُّ - قَالَ - فَرَجَعَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَمَرَنَا أَنْ نَرْجُمَهُ - قَالَ - فَانْطَلَقْنَا بِهِ إِلَى بَقِيعِ الْغَرْقَدِ - قَالَ - فَمَا أَوْثَقْنَاهُ وَلاَ حَفَرْنَا لَهُ - قَالَ - فَرَمَيْنَاهُ بِالْعَظْمِ وَالْمَدَرِ وَالْخَزَفِ - قَالَ - فَاشْتَدَّ فَاشْتَدَدْنَا خَلْفَهُ حَتَّى أَتَى عُرْضَ الْحَرَّةِ فَانْتَصَبَ لَنَا فَرَمَيْنَاهُ بِجَلاَمِيدِ الْحَرَّةِ - يَعْنِي الْحِجَارَةَ - حَتَّى سَكَتَ - قَالَ - ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَطِيبًا مِنَ الْعَشِيِّ فَقَالَ ‏ \"‏ أَوَكُلَّمَا انْطَلَقْنَا غُزَاةً فِي سَبِيلِ اللَّهِ تَخَلَّفَ رَجُلٌ فِي عِيَالِنَا لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ عَلَىَّ أَنْ لاَ أُوتَى بِرَجُلٍ فَعَلَ ذَلِكَ إِلاَّ نَكَّلْتُ بِهِ ‏\"‏ ‏.‏ قَالَ فَمَا اسْتَغْفَرَ لَهُ وَلاَ سَبَّهُ ‏.‏",
        "translations": {
          "en": "Abu Sa'id reported that a person belonging to the clan of Aslam, who was called Ma, iz b. Malik, came to Allah's Messenger (ﷺ) and said:I have committed immorality (adultery), so inflict punishment upon me. Allah's Apostle (ﷺ) turned him away again and again. He then asked his people (about the state of his mind). They said: We do not know of any ailment of his except that he has committed something about which he thinks that he would not be able to relieve himself of its burden but with the Hadd being imposed upon him. He (Ma'iz) came back to Allah's Apostle (ﷺ) and he commanded us to stone him. We took him to the Baqi' al-Gharqad (the graveyard of Medina). We neither tied him nor dug any ditch for him. We attacked him with bones, with clods and pebbles. He ran away and we ran after him until he came upon the ston ground (al-Harra) and stopped there and we stoned him with heavy stones of the Harra until he became motionless (lie died). He (the Holy Prophet) then addressed (us) in the evening saying Whenever we set forth on an expedition in the cause of Allah, some one of those connected with us shrieked (under the pressure of sexual lust) as the bleating of a male goat. It is essential that if a person having committed such a deed is brought to me, I should punish him. He neither begged forgiveness for him nor cursed him",
          "ur": "عبدالاعلیٰ نے کہا : ہمیں داود نے ابونضرہ سے حدیث بیان کی ، انہوں نے حضرت ابوسعید رضی اللہ عنہ سے روایت کی کہ اسلم قبیلے کا ایک آدمی ، جسے ماعز بن مالک رضی اللہ عنہ کہا جاتا تھا ، رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہا : مجھ سے بدکاری ہو گئی ہے ، مجھ پر اس کی حد نافذ کیجئے ۔ نبی صلی اللہ علیہ وسلم نے اسے کئی بار واپس کیا ۔ کہا : پھر آپ صلی اللہ علیہ وسلم نے اس کی قوم سے پوچھا تو انہوں نے کہا : ہم ان کی کسی برائی کو نہیں جانتے ، مگر ان سے کوئی بات سرزد ضرور ہوئی ہے ۔ ہم سمجھتے ہیں کہ انہیں اس کیفیت سے ، اس کے علاوہ اور کوئی چیز نہیں نکال سکتی کہ ان پر حد قائم کر دی جائے ۔ کہا : اس کے بعد وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس پھر واپس آئے تو آپ نے ہمیں حکم دیا کہ انہیں رجم کر دیں ۔ کہا : ہم انہیں بقیع الغرقد کی طرف لے کر گئے ۔ کہا : نہ ہم نے انہیں باندھا ، نہ ان کے لیے گڑھا کھودا ۔ کہا : ہم نے انہیں ہڈیوں ، مٹی کے ڈھیلوں اور ٹھیکروں سے مارا ۔ کہا : وہ بھاگ نکلے تو ہم بھی ان کے پیچھے بھاگے حتی کہ وہ حرہ ( سیاہ پتھروں والی زمین ) کے ایک کنارے پر آئے اور ہمارے سامنے جم کر کھڑے ہو گئے ، پھر ہم نے انہیں حرہ کی چٹانوں کے ٹکڑوں ، یعنی ( بڑے بڑے ) پتھروں سے مارا حتی کہ وہ بے جان ہو گئے ، کہا : پھر شام کو رسول اللہ صلی اللہ علیہ وسلم خطبہ دینے کے لیے کھڑے ہوئے اور فرمایا : \" جب بھی ہم اللہ کی راہ میں جہاد کرنے کے لیے نکلتے ہیں کوئی آدمی پیچھے ہمارے اہل و عیال کے درمیان رہ جاتا ہے اور بکرے کی طرح جوش میں آوازیں نکالتا ہے ، مجھ پر لازم ہے کہ میرے پاس کوئی ایسا آدمی نہیں لایا جائے گا جس نے ایسا کیو ہو گا مگر میں اسے عبرتناک سزا دوں گا ۔ \" کہا : آپ صلی اللہ علیہ وسلم نے ( خطبے کے دوران میں ) نہ ان کے لیے استغفار کیا ، نہ انہیں برا بھلا کہا",
          "fr": "Rapporté par Abu Sa’id : Un homme du clan d’Aslam, appelé Ma’iz ibn Malik, vint voir le Messager d’Allah ﷺ et dit : « J’ai commis un acte immoral (adultère), applique sur moi la peine. » Le Messager d’Allah ﷺ le repoussa plusieurs fois. Il interrogea ensuite ses proches sur son état mental. Ils dirent : « Nous ne connaissons chez lui aucune maladie, sauf qu’il pense qu’il ne pourra se libérer du poids de son acte qu’en subissant la peine. » Ma’iz revint alors vers le Messager d’Allah ﷺ, qui ordonna qu’on le lapide. Nous l’avons emmené au cimetière de Baqi’ al-Gharqad. Nous ne l’avons ni attaché ni mis dans une fosse. Nous avons lancé sur lui des os, des mottes de terre et des cailloux. Il s’est enfui, nous l’avons poursuivi jusqu’à la Harra, où il s’est arrêté, et nous l’avons lapidé avec de grosses pierres jusqu’à ce qu’il ne bouge plus (il est mort). Le soir, le Prophète ﷺ nous adressa un discours : « Chaque fois que nous partons en expédition dans la voie d’Allah, quelqu’un parmi nous crie sous l’effet du désir comme un bouc. Si une personne ayant commis un tel acte m’est amenée, je la punirai. » Il n’a ni demandé pardon pour lui ni invoqué de malédiction contre lui",
          "id": "Telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Abdul A'la] telah menceritakan kepada kami [Daud] dari [Abu Nadlrah] dari [Abu Sa'id], bahwa seorang laki-laki dari Bani Aslam yang bernama Ma'iz bin Malik mendatangi Rasulullah shallallahu 'alaihi wasallam sambil berkata, \"Sesungguhnya aku telah berbuat keji, oleh karena itu luruskanlah daku!\" Namun Nabi shallallahu 'alaihi wasallam berpaling darinya, hal itu terjadi sampai berkali-kali.\" Abu Sa'id berkata, \"Kemudian beliau bertanya kepada kaumnya, mereka menjawab, \"Kami tidak melihatnya berbuat keji melainkan dia telah melakukan sesuatu, dan dia tidak bisa keluar dari permasalahan itu kecuali jika telah ditegakkan had atasnya.\" Abu Sa'id melanjutkan, \"Lalu dia kembali kepada Nabi shallallahu 'alaihi wasallam, lantas beliau memerintahkan kami untuk merajamnya.\" Abu Sa'id melanjutkan, \"Setelah itu kami pergi ke Baqi' Gharqad, kami tidak mengikatnya dan tidak pula memendamnya.\" Abu Sa'id melanjutkan, \"Lalu kami melemparinya dengan tulang belulang dan tanah liat yang keras.\" Abu Sa'id berkata, \"Ma'iz berusaha lari hingga sampai dekat Hurrah, namun kami mengejarnya dan mendapatkannya kembali, lalu kami melemparinya dengan bebatuan yang besar hingga dia diam (mati).\" Di sore harinya Rasulullah shallallahu 'alaihi wasallam berdiri dan berkhutbah, sabdanya: \"Kenapa ketika kami berangkat perang untuk berjihad di jalan Allah, salah seorang dari kalian ada yang tidak ikut berangkat dan bersama keluarga kami, ia memiliki desahan seperti kambing jantan (saat kawin). Maka tidaklah kalian menghadapkan kepadaku orang yang melakukan perbuatan itu melainkan aku akan memberinya sanksi.\" Abu Sa'id berkata, \"Maka beliau tidak memintakan ampun untuknya dan tidak pula mencacinya.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Daud] dengan sanad ini, seperti makna hadits tersebut. Dalam hadits tersebut ia menyebutkan, \"Di sore harinya, Nabi shallallahu 'alaihi wasallam berdiri dan memuji Allah dan mengagungkan-Nya, lalu bersabda: \"Amma Ba'du. Kenapa sekelompok orang ketika kami berangkat perang lalu salah seorang dari mereka mundur (tidak ikut) bersama kami, ia memiliki desahan seperti desahan kambing jantan (saat kawin) '. dan ia tidak menyebutkan, 'bersama keluarga kami'.\" Dan telah menceritakan kepada kami [Suraij bin Yunus] telah menceritakan kepada kami [Yahya bin Zakaria bin Abu Zaidah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah menceritakan kepada kami [Sufyan] keduanya dari [Daud] dengan isnad sebagian hadits ini, namun dalam hadits Sufyan disebutkan, 'Jika ia mengakui telah berzina sebanyak tiga kali",
          "tr": "Bana Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bana Abdüla'Iâ rivayet etti. (Dediki): Bize Dâvûd, Ebû Nadra'dan, o da Ebû Sad'den naklen rivayet etti ki, Eslem kabilesinden Mâiz b. Mâlik denilen bir adam Resûlüllah (Sallallahu Aleyhi ve Sellem)'e gelerek: — Ben bir kötülük işledim; onun haddini bana vur! demiş. Peygamber (Sallallahu Aleyhi ve Sellem) kendisini birkaç defa reddetmiş. Râvi diyor ki: Sonra kavmine sordu. Onlar: — Biz onu zararsız biliriz; yalnız başına bir iş geldi ki, ondan kendisini badd vurulmaktan başka bir şey kurtaramayacağını sanıyor! dediler. Müteakiben (Mâiz) Nebi (Sallallahu Aleyhi ve Sellem)'e: döndü. O da bize kendisini recmetmemizi emir buyurdu. Onu Bakî-i Garkad'e götürdük. Kendisini ne bağladık, ne de kuyu kazdık. Ona kemik, topaç ve tuğla parçaları attık. Koşmaya başladı. Biz de arkasından koştuk. Nihayet Harra kenarına geldi ve karşımıza dikildi. Biz de kendisine Harra'nın kayalarını (yâni taşları) attık; nihayet sustu. Sonra Resûlullah (Sallallahu Aleyhi ve Sellem) akşamlayın hutbe okumak üzere ayağa kalktı ve : «Acaba biz Allah yolunda her gazaya gittikçe çoluk çocuğumuz arasında, teke meleyişi gibi melemesi olan bir adam kalacak mı! Şu boynuma borç olsun ki, Bunu yapan bir adam bana getirilmeye görsün! Yoksa onu (âleme) ibret yaparım!» buyurdular. Artık onun için ne istiğfar etti, ne de söğdü"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 4429,
      "arabicNumber": "1694.02",
      "book": 29,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا دَاوُدُ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَ مَعْنَاهُ ‏.‏ وَقَالَ فِي الْحَدِيثِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْعَشِيِّ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَمَا بَالُ أَقْوَامٍ إِذَا غَزَوْنَا يَتَخَلَّفُ أَحَدُهُمْ عَنَّا لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ ‏\"‏ ‏.‏ وَلَمْ يَقُلْ ‏\"‏ فِي عِيَالِنَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Dawud narrated the hadith with the same chain of transmitters (and the words are):Allah's Apostle (ﷺ) stood tip (to address the audience) in the evening and praised Allah, glorified Him and then said: What about the people, that as we set out on an expedition, one of you remained behind us and he shrieked like the bleating of a male goat? But he did not mention (these words): People connected with us",
          "ur": "یزید بن زریع نے کہا : ہمیں داود نے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی اور انہوں نے حدیث میں کہا : شام کو نبی صلی اللہ علیہ وسلم کھڑے ہوئے ، اللہ کی حمد اور ثنا بیان کی ، پھر فرمایا : \" اما بعد! لوگوں کا کیا حال ہے؟ جب ہم جہاد کے لیے جاتے ہیں تو ان میں سے کوئی شخص پیچھے رہ جاتا ہے ، وہ نسل کشی کے بکرے کی طرح آوازیں نکالتا ہے ۔ ۔ \" انہوں ( یزید بن زریع ) نے \" ہمارے اہل و عیال میں \" کے الفاظ نہیں کہے",
          "fr": "Rapporté par Dawud : Le hadith est rapporté avec la même chaîne de transmetteurs (et les mots sont) : Le Messager d’Allah ﷺ se leva le soir, loua Allah, Le glorifia, puis dit : « Qu’en est-il des gens qui, lorsque nous partons en expédition, l’un d’entre vous reste derrière et crie comme un bouc ? » Mais il n’a pas mentionné : « Les gens parmi nous. »",
          "tr": "Bana Muhammed b. Hatim rivayet etti. (Dediki): Bize Behz rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Dâvûd bu isnâdla bu hadîsin mânâsı gibi rivayette bulundu. Bu hadîste şunu da söyledi: Derken akşamsı Nebi (Sallallahu Aleyhi ve Sellem) ayağa kalkarak Allah'a hamdü sena etti. Sonra şöyle buyurdular: «Bundan sonra! Acep bâzı kavimlere ne oluyor ki, biz gazaya gittiğimiz vakit bunlardan, teke melemesi gibi meleyişi olan birisi arkamızda kalıyor!..» «Çoluk çocuğumuz arasında» demedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 4430,
      "arabicNumber": "1694.03",
      "book": 29,
      "hadithInBook": 33,
      "text": {
        "arabic": "وَحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ دَاوُدَ، بِهَذَا الإِسْنَادِ ‏.‏ بَعْضَ هَذَا الْحَدِيثِ ‏.‏ غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ فَاعْتَرَفَ بِالزِّنَى ثَلاَثَ مَرَّاتٍ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Dawud with the same chain of transmitters but with this variation that in the hadith narrated by Sufyan (the words are):\" He made a confession of having committed adultery, thrice",
          "ur": "یحییٰ بن زکریا بن ابی زائدہ اور سفیان دونوں نے داود سے اسی سند کے ساتھ اس حدیث کا کچھ حصہ بیان کیا ، البتہ سفیان کی حدیث میں ہے : اس نے تین بار زنا کا اعتراف کیا ۔ ( چوتھی بار کے اعتراف پر اسے سزا سنائی گئی)",
          "fr": "Rapporté par Dawud : Ce hadith a été rapporté par Dawud avec la même chaîne de transmetteurs, mais avec cette variation : dans le hadith rapporté par Sufyan, il est dit : « Il a avoué avoir commis l’adultère, trois fois. »",
          "tr": "{…} Bize Süreye b. Yûnus da rivayet etti. (Dediki): Bize Yahya b. Zekeriyyâ b. Ebî Zaide rivayet etti. H. Bize Ebû Bekir b. Ebi Şeybe dahî rivayet etti. (Dediki): Bize Mııâviye b. Hişâm rivayet etti. (Dediki): Bize Süfyân rivayet etti. Bu râvilerin ikisi de Dâvûd'dan bu isnâdla bu hadîsin bir kısmını rivayet etmişlerdir. Yalnız Süfyân'ın hadîsinde : «Ve zinayı üç defa i'tîrâf etti.» ibaresi vardır. İzah 1696 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 4431,
      "arabicNumber": "1695.01",
      "book": 29,
      "hadithInBook": 34,
      "text": {
        "arabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، حَدَّثَنَا يَحْيَى بْنُ يَعْلَى، - وَهُوَ ابْنُ الْحَارِثِ الْمُحَارِبِيُّ - عَنْ غَيْلاَنَ، - وَهُوَ ابْنُ جَامِعٍ الْمُحَارِبِيُّ - عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ، بْنِ بُرَيْدَةَ عَنْ أَبِيهِ، قَالَ جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ ‏\"‏ وَيْحَكَ ارْجِعْ فَاسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ ‏\"‏ ‏.‏ قَالَ فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَيْحَكَ ارْجِعْ فَاسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ ‏\"‏ ‏.‏ قَالَ فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَ ذَلِكَ حَتَّى إِذَا كَانَتِ الرَّابِعَةُ قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِيمَ أُطَهِّرُكَ ‏\"‏ ‏.‏ فَقَالَ مِنَ الزِّنَى ‏.‏ فَسَأَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَبِهِ جُنُونٌ ‏\"‏ ‏.‏ فَأُخْبِرَ أَنَّهُ لَيْسَ بِمَجْنُونٍ ‏.‏ فَقَالَ ‏\"‏ أَشَرِبَ خَمْرًا ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَاسْتَنْكَهَهُ فَلَمْ يَجِدْ مِنْهُ رِيحَ خَمْرٍ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَزَنَيْتَ ‏\"‏ ‏.‏ فَقَالَ نَعَمْ ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ فَكَانَ النَّاسُ فِيهِ فِرْقَتَيْنِ قَائِلٌ يَقُولُ لَقَدْ هَلَكَ لَقَدْ أَحَاطَتْ بِهِ خَطِيئَتُهُ وَقَائِلٌ يَقُولُ مَا تَوْبَةٌ أَفْضَلَ مِنْ تَوْبَةِ مَاعِزٍ أَنَّهُ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَوَضَعَ يَدَهُ فِي يَدِهِ ثُمَّ قَالَ اقْتُلْنِي بِالْحِجَارَةِ - قَالَ - فَلَبِثُوا بِذَلِكَ يَوْمَيْنِ أَوْ ثَلاَثَةً ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُمْ جُلُوسٌ فَسَلَّمَ ثُمَّ جَلَسَ فَقَالَ ‏\"‏ اسْتَغْفِرُوا لِمَاعِزِ بْنِ مَالِكٍ ‏\"‏ ‏.‏ قَالَ فَقَالُوا غَفَرَ اللَّهُ لِمَاعِزِ بْنِ مَالِكٍ ‏.‏ - قَالَ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ تَابَ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ أُمَّةٍ لَوَسِعَتْهُمْ ‏\"‏ ‏.‏ قَالَ ثُمَّ جَاءَتْهُ امْرَأَةٌ مِنْ غَامِدٍ مِنَ الأَزْدِ فَقَالَتْ يَا رَسُولَ اللَّهِ طَهِّرْنِي ‏.‏ فَقَالَ ‏\"‏ وَيْحَكِ ارْجِعِي فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ ‏\"‏ ‏.‏ فَقَالَتْ أَرَاكَ تُرِيدُ أَنْ تُرَدِّدَنِي كَمَا رَدَّدْتَ مَاعِزَ بْنَ مَالِكٍ ‏.‏ قَالَ ‏\"‏ وَمَا ذَاكِ ‏\"‏ ‏.‏ قَالَتْ إِنَّهَا حُبْلَى مِنَ الزِّنَا ‏.‏ فَقَالَ ‏\"‏ آنْتِ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ فَقَالَ لَهَا ‏\"‏ حَتَّى تَضَعِي مَا فِي بَطْنِكِ ‏\"‏ ‏.‏ قَالَ فَكَفَلَهَا رَجُلٌ مِنَ الأَنْصَارِ حَتَّى وَضَعَتْ قَالَ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ قَدْ وَضَعَتِ الْغَامِدِيَّةُ ‏.‏ فَقَالَ ‏\"‏ إِذًا لاَ نَرْجُمَهَا وَنَدَعَ وَلَدَهَا صَغِيرًا لَيْسَ لَهُ مَنْ يُرْضِعُهُ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ إِلَىَّ رَضَاعُهُ يَا نَبِيَّ اللَّهِ ‏.‏ قَالَ فَرَجَمَهَا ‏.‏",
        "translations": {
          "en": "Sulaiman b. Buraida reported on the authority of his father that Ma, iz b. Malik came to Allah's Apostle (ﷺ) and said to him:Messenger of Allah, purify me, whereupon he said: Woe be upon you, go back, ask forgiveness of Allah and turn to Him in repentance. He (the narrator) said that he went back not far, then came and said: Allah's Messenger, purify me. whereupon Allah's Messenger (ﷺ) said: Woe be upon you, go back and ask forgiveness of Allah and turn to Him in repentance. He (the narrator) said that he went back not far, when he came and said: Allah's Messenger, purify me. Allah's Apostle (ﷺ) said as he had said before. When it was the fourth time, Allah's Messenger (may, peace be upon him) said: From what am I to purify you? He said: From adultery, Allah's Messenger (ﷺ) asked if he had been mad. He was informed that he was not mad. He said: Has he drunk wine? A person stood up and smelt his breath but noticed no smell of wine. Thereupon Allah's Messenger (ﷺ) said: Have you committed adultery? He said: Yes. He made pronouncement about him and he was stoned to death. The people had been (divided) into two groups about him (Ma'iz). One of them said: He has been undone for his sins had encompassed him, whereas another said: There is no repentance more excellent than the repentance of Ma'iz, for he came to Allah's Apostle (ﷺ) and placing his hand in his (in the Holy Prophet's) hand said: Kill me with stones. (This controversy about Ma'iz) remained for two or three days. Then came Allah's Messenger (ﷺ) to them (his Companions) as they were sitting. He greeted them with salutation and then sat down and said: Ask forgiveness for Ma'iz b. Malik. They said: May Allah forgive Ma'iz b. Malik. Thereupon Allah's Messenger (ﷺ) said: He (Ma'iz) has made such a repentance that if that were to be divided among a people, it would have been enough for all of them. He (the narrator) said: Then a woman of Ghamid, a branch of Azd, came to him and said: Messenger of of Allah, purify me, whereupon he said: Woe be upon you; go back and beg forgiveness from Allah and turn to Him in repentance. She said: I find that you intend to send me back as you sent back Ma'iz. b. Malik. He (the Holy, Prophet) said: What has happened to you? She said that she had become pregnant as a result of fornication. He (the Holy Prophet) said: Is it you (who has done that)? She said: Yes. He (the Holy Prophet) said to her: (You will not be punished) until you deliver what is there in your womb. One of the Ansar became responsible for her until she was delivered (of the child). He (that Ansari) came to Allah's Apostle (ﷺ) and said the woman of Ghamid has given birth to a child. He (the Holy Prophet) said: In that case we shall not stone her and so leave her infant with none to suckle him. One of the Ansar got up and said: Allah's Apostle, let the responsibility of his suckling be upon me. She was then stoned to death",
          "ur": "سلیمان بن بریدہ نے اپنے والد ( بریدہ بن حصیب اسلمی رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا : ماعز بن مالک ( اسلمی ) رضی اللہ عنہ نبی صلی اللہ علیہ وسلم کے پاس آئے اور کہنے لگے : اے اللہ کے رسول! مجھے پاک کیجیے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم پر افسوس! جاؤ ، اللہ سے استغفار کرو اور اس کی بارگاہ میں توبہ کرو ۔ \"\" کہا : وہ لوٹ کر تھوڑی دور تک گئے ، پھر واپس آئے اور کہنے لگے : اے اللہ کے رسول! مجھے پاک کیجیے ۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" تم پر افسوس! جاؤ ، اللہ سے استغفار کرو اور اس کی طرف رجوع کرو ۔ \"\" کہا : وہ لوٹ کر تھوڑی دور تک گئے ، پھر آئے اور کہنے لگے : اے اللہ کے رسول! مجھے پاک کیجیے ۔ تو نبی صلی اللہ علیہ وسلم نے ( پھر ) اسی طرح فرمایا حتی کہ جب چوتھی بارر ( یہی بات ) ہوئی ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا : \"\" میں تمہیں کس چیز سے پاک کروں؟ \"\" انہوں نے کہا : زنا سے ۔ رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" کیا اسے جنون ہے؟ \"\" تو آپ کو بتایا گیا کہ یہ مجنون نہیں ہے ۔ تو آپ نے پوچھا : \"\" کیا اس نے شراب پی ہے؟ \"\" اس پر ایک آدمی کھڑا ہوا اور اس کا منہ سونگھا تو اسے اس سے شراب کی بو نہ آئی ۔ کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" کیا تم نے زنا کیا ہے؟ \"\" انہوں نے جواب دیا : جی ہاں ( یہیں آپ نے اس سے اس واقعے کی تصدیق چاہی جو آپ تک پہنچا تھا ) پھر آپ نے ان ( کو رجم کرنے ) کے بارے میں حکم دیا ، چنانچہ انہیں رجم کر دیا گیا ۔ بعد ازاں ان کے حوالے سے لوگوں کے دو گروہ بن گئے ، کچھ کہنے والے یہ کہتے : وہ تباہ و برباد ہو گیا ، اس کے گناہ نے اسے گھیر لیا ۔ اور کچھ کہنے والے یہ کہتے : ماعز کی توبہ سے افضل کوئی توبہ نہیں ( ہو سکتی ) کہ وہ ( خود ) نبی صلی اللہ علیہ وسلم کے پاس آئے اور آپ کے ہاتھ میں اپنا ہاتھ دیا ، پھر کہا : مجھے پتھروں سے مار ڈالیے ۔ کہا : دو یا تین دن وہ ( اختلاف کی ) اسی کیفیت میں رہے ، پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، وہ سب بیٹحے ہوئے تھے ، آپ نے سلام کہا ، پھر بیٹھ گئے اور فرمایا : \"\" ماعز بن مالک کے لیے بخشش مانگو ۔ \"\" کہا : تو لوگوں نے کہا : اللہ ماعز بن مالک کو معاف فرمائے! تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" بلاشبہ انہوں نے ایسی توبہ کی ہے کہ اگر وہ ایک امت میں بانٹ دی جائے تو ان سب کو کافی ہو جائے ۔ \"\" کہا : پھر آپ کے پاس ازد قبیلے کی شاخ غامد کی ایک عورت آئی اور کہنے لگی : اللہ کے رسول! مجھے پاک کیجیے ۔ تو آپ نے فرمایا : \"\" تم پر افسوس! لوٹ جاؤ ، اللہ سے بخشش مانگو اور اس کی طرف رجوع کرو ۔ \"\" اس نے کہا : میرا خیال ہے آپ مجھے بھی بار بار لوٹانا چاہتے ہیں جیسے ماعز بن مالک کو لوٹایا تھا ۔ آپ نے پوچھا : \"\" وہ کیا بات ہے ( جس میں تم تطہیر چاہتی ہو؟ ) \"\" اس نے کہا : وہ زنا کی وجہ سے حاملہ ہے ۔ تو آپ نے ( تاکیدا ) پوچھا : کیا تم خود؟ \"\" اس نے جواب دیا : جی ہاں ، تو آپ نے اسے فرمایا : \"\" ( جاؤ ) یہاں تک کہ جو تمہارے پیٹ میں ہے اسے جنم دے دو ۔ \"\" کہا : تو انصار کے ایک آدمی نے اس کی کفالت کی حتی کہ اس نے بچے کو جنم دیا ۔ کہا : تو وہ آدمی نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ور کہنے لگا : غامدی عورت نے بچے کو جنم دے دیا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تب ہم ( ابھی ) اسے رجم نہیں کریں گے اور اس کے بچے کو کم سنی میں ( اس طرح ) نہیں چھوڑیں گے کہ کوئی اسے دودھ پلانے والا نہ ہو ۔ \"\" پھر انصار کا ایک آدمی کھڑا ہوا ور کہا : اے اللہ کے نبی! اس کی رضاعت میرے ذمے ہے ۔ کہا : تو آپ نے اسے رجم کرنے کا حکم دے دیا",
          "fr": "Rapporté par Sulaiman ibn Buraida, d’après son père : Ma’iz ibn Malik vint voir le Messager d’Allah ﷺ et lui dit : « Ô Messager d’Allah, purifie-moi. » Il répondit : « Malheur à toi, retourne, demande pardon à Allah et repens-toi. » Le narrateur dit qu’il ne s’éloigna pas beaucoup, puis revint et dit : « Ô Messager d’Allah, purifie-moi. » Le Messager d’Allah ﷺ répondit : « Malheur à toi, retourne, demande pardon à Allah et repens-toi. » Il ne s’éloigna pas beaucoup, puis revint et dit : « Ô Messager d’Allah, purifie-moi. » Le Prophète ﷺ répéta la même chose. À la quatrième fois, le Messager d’Allah ﷺ dit : « De quoi dois-je te purifier ? » Il répondit : « De l’adultère. » Le Messager d’Allah ﷺ demanda s’il était fou. On lui répondit qu’il ne l’était pas. Il demanda : « A-t-il bu du vin ? » Quelqu’un se leva, sentit son haleine et ne détecta aucune odeur d’alcool. Le Messager d’Allah ﷺ demanda : « As-tu commis l’adultère ? » Il répondit : « Oui. » Le Prophète ﷺ prononça alors le jugement et il fut lapidé à mort. Les gens étaient divisés à son sujet : certains disaient : « Il a été perdu car ses péchés l’ont accablé », d’autres disaient : « Il n’y a pas de repentir meilleur que celui de Ma’iz, car il est venu voir le Messager d’Allah ﷺ, a mis sa main dans la sienne et a dit : “Tuez-moi à coups de pierres.” » Cette controverse dura deux ou trois jours. Puis le Messager d’Allah ﷺ vint alors qu’ils étaient assis, les salua, s’assit et dit : « Demandez pardon pour Ma’iz ibn Malik. » Ils dirent : « Qu’Allah pardonne à Ma’iz ibn Malik. » Le Messager d’Allah ﷺ dit : « Il a fait un repentir qui, s’il était partagé entre un peuple, suffirait pour tous. » Le narrateur dit : Ensuite, une femme de Ghamid, une branche d’Azd, vint le voir et dit : « Ô Messager d’Allah, purifie-moi. » Il répondit : « Malheur à toi, retourne et demande pardon à Allah, repens-toi. » Elle dit : « Je vois que tu veux me renvoyer comme tu as renvoyé Ma’iz ibn Malik. » Le Prophète ﷺ demanda : « Qu’as-tu donc ? » Elle répondit qu’elle était enceinte à la suite d’une fornication. Le Prophète ﷺ demanda : « C’est bien toi qui as fait cela ? » Elle répondit : « Oui. » Il lui dit : « (On ne te punira pas) jusqu’à ce que tu accouches. » Un des Ansar se porta garant d’elle jusqu’à ce qu’elle accouche. Cet Ansari vint voir le Messager d’Allah ﷺ et dit : « La femme de Ghamid a accouché. » Le Prophète ﷺ dit : « Dans ce cas, nous ne la lapiderons pas pour ensuite laisser son enfant sans nourrice. » Un des Ansar se leva et dit : « Ô Messager d’Allah, je prends la responsabilité de l’allaiter. » Elle fut alors lapidée à mort",
          "id": "Dqan telah menceritakan kepadaku [Muhammad bin Al 'Ala Al Hamdani] telah menceritakan kepada kami [Yahya bin Ya'la] -yaitu Ibnu Al Harits Al Muharibi- dari [Ghailan] -yaitu Ibnu Jami' Al Muharibi- dari ['Alqamah bin Murtsad] dari [Sulaiman bin Buraidah] dari [ayahnya] dia berkata, \"Ma'iz bin Malik datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, sucikanlah diriku.\" Rasulullah menjawab: \"Celaka kamu! Pulang dan mintalah ampun kepada Allah, dan bertaubatlah kepada-Nya.\" Kemudian Ma'iz pergi, tidak lama kemudian dia kembali lagi sambil berkata: \"Wahai Rasulullah, sucikanlah daku.\" Beliau menjawab: \"Celaka kamu! Pulang dan mintalah ampun kepada Allah, dan bertaubatlah kepada-Nya.\" Lalu Ma'iz pergi, tetapi belum begitu jauh dia pergi, dia kembali lagi dan berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, sucikanlah daku.\" Beliau menjawab sebagaimana jawabannya yang pertama, dan hal itu berulang-ulang sampai empat kali. Pada kali yang ke empat, Rasulullah shallallahu 'alaihi wasallam bertanya: \"Dari hal apakah kamu harus aku sucikan?\" Ma'iz menjawab, \"Dari dosa zina.\" Rasulullah shallallahu 'alaihi wasallam bertanya kepada para sahabat yang ada di sekitar beliau: \"Apakah Ma'iz ini mengidap penyakit gila?\" lalu beliau diberitahu bahwa dia tidaklah gila.\" Beliau bertanya lagi: \"Apakah dia habis minum Khamr?\" lantas seorang laki-laki langsung berdiri untuk mencium bau mulutnya, namun dia tidak mendapapti bau khamr darinya.\" Buraidah melanjutkan, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya: \"Betulkah kamu telah berzina?\" Dia menjawab, \"Ya, benar.\" Lantas beliau memerintahkan untuk ditegakkan hukuman rajam atas dirinya, lalu dia pun dirajam. Dalam permasalahan ini, orang-orang berbeda menjadi dua pendapat, yaitu; Ma'iz meninggal dan dosanya terhapuskan karena hukuman itu dijalaninya dengan ikhlas. Dan yang lain mengatakan bahwa Ma'iz bertaubat dengan sebenar-benarnya taubat, tiada taubat yang melebihi taubatnya Ma'iz. Dia datang menghadap Nabi shallallahu 'alaihi wasallam, lalu tangannya diletakkan di atas tangan beliau kemudian dia berkata, \"Wahai Rasulullah, rajamlah aku dengan batu.\" Dan mereka senantiasa dalam perbedaan pendapat seperti itu selama dua atau tiga hari. Kemudian Rasulullah shallallahu 'alaihi wasallam datang, setelah memberi salam beliau duduk bersama-sama dengan mereka, lalu beliau bersabda: \"Mintakanlah ampun bagi Ma'iz bin Malik.\" Lalu mereka memohonkan ampun untuknya, \"Semoga Allah mengampuni Ma'iz bin Malik.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh Ma'iz telah betaubat dengan sempurna, dan seandainya taubat Ma'iz dapat dibagi di antara satu kaum, pasti taubatnya akan mencukupi mereka semua",
          "tr": "Bize Muhammed b. El-AIâ' El-Hemdânî rivayet etti. (Dediki): Bize Yahya b. Ya'lâ —kî İbni'l-Hâris El-Muhâribî'dir— Gaylân'dan (bu zât Câmiu'l-Muhâribî'nin oğludur.), o da Alkame b. Mersed'den, o da Süleyman b. Büreyde'den, o da babasından naklen rivayet etti. Babası şöyle demiş: Mâiz b. Mâlik Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: — Yâ Resûlâllah! Beni temizle! dedi. Bunun üzerine: «Vah sana! Dön de Allah'tan mağfiret dîlel Ona tevbe et!» buyurdu. (Mâiz) uzağa gitmemek üzere geri döndü. Sonra gelerek: — Yâ Resûlâllah! Beni temizle! dedi. Resulullah (Sallallahu Aleyhi ve Sellem) tekrar: «Vah sana! Dön de Allah'tan mağfiret dile! Ona tevbe et!» buyurdu. Mâiz yine uzağa gitmemek üzere geri döndü. Sonra gelerek: — Yâ Resûlâllah! Beni temizle! dedi. Nebi (Sallallahu Aleyhi ve Sellem) ona : «Seni ne hususta temizliyeyim?» diye sordu. Mâiz: — Zina'dan! dedi. Bunu müteâkib Resulullah (Sallallahu Aleyhi ve Sellem): «Bunda delilik var mı?» diye sordu. Kendilerine onun deli olmadığı haber verildi. «Şarab içmiş mi?» diye sordu. Hemen bir zât kalkarak onun ağzını kokladı; fakat şarap kokusu bulamadı. Resulullah (Sallallahu Aleyhi ve Sellem) tekrar: «Sen zina mı ettin?» diye sordu. Mâiz: — Evet! cevâbını verdi. Artık emir buyurdular ve Mâiz recmedildi. Onun hakkında cemaat iki fırka olmuştu. Kimisi: Helak oldu! Onu günahı kuşattı!., diyor; bazısı da: Mâiz'in tevbesinden efdal tevbe olmaz.!.. Zira o Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek elini onun eline koydu. Sonra: Benî taşlarla öldür! dedi... diyordu. Bu minval üzere iki veya üç gün durdular. Bilâhare onlar otururken Resûlullah (Sallallahu Aleyhi ve Sellem) gelerek selâm verdi ve oturdu. Arkacığından: «Mâiz b. Mâlik için istiğfar edin!» buyurdular. Ashâb: — Allah Mâiz b. Mâlik'e mağfiret eylesin! dediler. Resûlullah (Sallallahu Aleyhi ve Sellem) de : «Gerçekten öyle bir tevbe etti ki, bu tevbe bir ümmet arasında taksim edilse onlara yeterdi.» buyurdu. Sonra Ezd kabilesinin Gâmid kolundan bir kadın geldi; ve : — Ya Resûlâllah! Beni temizle! dedi. «Vah sana!.. Dön de Allah'tan mağfiret dile! Ona tevbe et!» buyurdular,. Kadın: Görüyorum beni, Mâiz'i çevirdiğin gibi geri çevirmek istiyorsun, dedi. «Ne oldu sana?» diye sordu. Kadın kendisinin zinadan gebe olduğunu söyledi. Bunun üzerine: «Sen mi?» buyurdu. Kadın : — Evet! cevâbını verdi. Ona: «Karnındakini doğuruncaya kadar...» buyurdular. Derken kadın doğuruncaya kadar geçimini Ensârdan bir zât üzerine aldı. Bilâhare Peygamber (Sallallahu Aleyhi ve Sellem)'e gelerek: — Gâmid'li kadın doğurdu; dedi. Efendimiz : «O halde onu recmedip de çocuğunu küçük olduğu halde emzirecek kimsesiz bırakamayız!» buyurdu. Bunun üzerine Ensâr'dan bir zât ayağa kalkarak: — Çocuğun bakımı bana âid olsun ya Nebiyyaîlah! dedi. O da kadını recmetti(rdi)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 4432,
      "arabicNumber": "1695.02",
      "book": 29,
      "hadithInBook": 35,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ - وَتَقَارَبَا فِي لَفْظِ الْحَدِيثِ - حَدَّثَنَا أَبِي، حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ مَاعِزَ بْنَ مَالِكٍ الأَسْلَمِيَّ، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ ظَلَمْتُ نَفْسِي وَزَنَيْتُ وَإِنِّي أُرِيدُ أَنْ تُطَهِّرَنِي ‏.‏ فَرَدَّهُ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ زَنَيْتُ ‏.‏ فَرَدَّهُ الثَّانِيَةَ فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى قَوْمِهِ فَقَالَ ‏\"‏ أَتَعْلَمُونَ بِعَقْلِهِ بَأْسًا تُنْكِرُونَ مِنْهُ شَيْئًا ‏\"‏ ‏.‏ فَقَالُوا مَا نَعْلَمُهُ إِلاَّ وَفِيَّ الْعَقْلِ مِنْ صَالِحِينَا فِيمَا نُرَى فَأَتَاهُ الثَّالِثَةَ فَأَرْسَلَ إِلَيْهِمْ أَيْضًا فَسَأَلَ عَنْهُ فَأَخْبَرُوهُ أَنَّهُ لاَ بَأْسَ بِهِ وَلاَ بِعَقْلِهِ فَلَمَّا كَانَ الرَّابِعَةَ حَفَرَ لَهُ حُفْرَةً ثُمَّ أَمَرَ بِهِ فَرُجِمَ ‏.‏ قَالَ فَجَاءَتِ الْغَامِدِيَّةُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ زَنَيْتُ فَطَهِّرْنِي ‏.‏ وَإِنَّهُ رَدَّهَا فَلَمَّا كَانَ الْغَدُ قَالَتْ يَا رَسُولَ اللَّهِ لِمَ تَرُدُّنِي لَعَلَّكَ أَنْ تَرُدَّنِي كَمَا رَدَدْتَ مَاعِزًا فَوَاللَّهِ إِنِّي لَحُبْلَى ‏.‏ قَالَ ‏\"‏ إِمَّا لاَ فَاذْهَبِي حَتَّى تَلِدِي ‏\"‏ ‏.‏ فَلَمَّا وَلَدَتْ أَتَتْهُ بِالصَّبِيِّ فِي خِرْقَةٍ قَالَتْ هَذَا قَدْ وَلَدْتُهُ ‏.‏ قَالَ ‏\"‏ اذْهَبِي فَأَرْضِعِيهِ حَتَّى تَفْطِمِيهِ ‏\"‏ ‏.‏ فَلَمَّا فَطَمَتْهُ أَتَتْهُ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ هَذَا يَا نَبِيَّ اللَّهِ قَدْ فَطَمْتُهُ وَقَدْ أَكَلَ الطَّعَامَ ‏.‏ فَدَفَعَ الصَّبِيَّ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ ثُمَّ أَمَرَ بِهَا فَحُفِرَ لَهَا إِلَى صَدْرِهَا وَأَمَرَ النَّاسَ فَرَجَمُوهَا فَيُقْبِلُ خَالِدُ بْنُ الْوَلِيدِ بِحَجَرٍ فَرَمَى رَأْسَهَا فَتَنَضَّحَ الدَّمُ عَلَى وَجْهِ خَالِدٍ فَسَبَّهَا فَسَمِعَ نَبِيُّ اللَّهِ صلى الله عليه وسلم سَبَّهُ إِيَّاهَا فَقَالَ ‏\"‏ مَهْلاً يَا خَالِدُ فَوَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ ‏\"‏ ‏.‏ ثُمَّ أَمَرَ بِهَا فَصَلَّى عَلَيْهَا وَدُفِنَتْ ‏.‏",
        "translations": {
          "en": "Abdullah b. Buraida reported on the authority of his father that Ma'iz b. Malik al-Aslami came to Allah's Messenger (ﷺ) and said:Allah's Messenger, I have wronged myself; I have committed adultery and I earnestly desire that you should purify me. He turned him away. On the following day, he (Ma'iz) again came to him and said: Allah's Messenger, I have committed adultery. Allah's Messenger (ﷺ) turned him away for the second time, and sent him to his people saying: Do you know if there is anything wrong with his mind. They denied of any such thing in him and said: We do not know him but as a wise good man among us, so far as we can judge. He (Ma'iz) came for the third time, and he (the Holy Prophet) sent him as he had done before. He asked about him and they informed him that there was nothing wrong with him or with his mind. When it was the fourth time, a ditch was dug for him and he (the Holy Prophet) pronounced judg- ment about him and he wis stoned. He (the narrator) said: There came to him (the Holy Prophet) a woman from Ghamid and said: Allah's Messenger, I have committed adultery, so purify me. He (the Holy Prophet) turned her away. On the following day she said: Allah's Messenger, Why do you turn me away? Perhaps, you turn me away as you turned away Ma'iz. By Allah, I have become pregnant. He said: Well, if you insist upon it, then go away until you give birth to (the child). When she was delivered she came with the child (wrapped) in a rag and said: Here is the child whom I have given birth to. He said: Go away and suckle him until you wean him. When she had weaned him, she came to him (the Holy Prophet) with the child who was holding a piece of bread in his hand. She said: Allah's Apostle, here is he as I have weaned him and he eats food. He (the Holy Prophet) entrusted the child to one of the Muslims and then pronounced punishment. And she was put in a ditch up to her chest and he commanded people and they stoned her. Khalid b Walid came forward with a stone which he flung at her head and there spurted blood on the face of Khalid and so he abused her. Allah's Apostle (ﷺ) heard his (Khalid's) curse that he had huried upon her. Thereupon he (the Holy Prophet) said: Khalid, be gentle. By Him in Whose Hand is my life, she has made such a repentance that even if a wrongful tax-collector were to repent, he would have been forgiven. Then giving command regarding her, he prayed over her and she was buried",
          "ur": "بُشیر بن مہاجر نے حدیث بیان کی ، کہا : عبداللہ بن بریدہ نے ہمیں اپنے والد سے حدیث بیان کی کہ ماعز بن مالک اسلمی رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا : اے اللہ کے رسول! میں نے اپنی جان پر ظلم کیا ہے ، میں نے زنا کا ارتکاب کیا ہے اور میں چاہتا ہوں کہ آپ مجھے ( گناہ کی آلودگی سے ) پاک کر دیں ۔ آپ نے انہیں واپس بھیج دیا ، جب اگلا دن ہوا ، وہ آپ کے پاس آئے اور کہا : اے اللہ کے رسول! میں نے زنا کیا ہے ۔ تو آپ نے دوسری بار انہیں واپس بھیج دیا ۔ آپ صلی اللہ علیہ وسلم نے ان کی قوم کی طرف پیغام بھیجا اور پوچھا : \"\" کیا تم جانتے ہو کہ ان کی عقل میں کوئی خرابی ہے ، ( ان کے عمل میں ) تمہیں کوئی چیز غلط لگتی ہے؟ \"\" تو انہوں نے جواب دیا : ہمارے علم میں تو یہ پوری عقل والے ہیں ، جہاں تک ہمارا خیال ہے ۔ یہ ہمارے صالح افراد میں سے ہیں ۔ وہ آپ کے پاس تیسری بات آئے تو آپ نے پھر ان کی طرف ( اسی طرح ) پیغام بھیجا اور ان کے بارے میں پوچھا تو انہوں نے بتایا کہ ان میں اور ان کی عقل میں کوئی خرابی نہیں ہے ، جب چوتھی بار ایسا ہوا تو آپ نے ان کے لیے ایک گڑھا کھدوایا ، پھر ان ( کو رجم کرنے ) کے بارے میں حکم دیا تو انہیں رجم کر دیا گیا ۔ کہا : اس کے بعد غامد قبیلے کی عورت آئی اور کہنے لگی : اے اللہ کے رسول! میں نے زنا کیا ہے ، مجھے پاک کیجئے ۔ آپ نے اسے واپس بھیج دیا ، جب اگلا دن ہوا ، اس نے کہا : اے اللہ کے رسول! آپ مجھے واپس کیوں بھیجتے ہیں؟ شاید آپ مجھے بھی اسی طرح واپس بھیجنا چاہتے ہیں جیسے ماعز کو بھیجا تھا ، اللہ کی قسم! میں حمل سے ہوں ۔ آپ نے فرمایا : \"\" اگر نہیں ( مانتی ہو ) تو جاؤ حتی کہ تم بچے کو جنم دے دو ۔ \"\" کہا : جب اس نے اسے جنم دیا تو بچے کو ایک بوسیدہ کپڑے کے ٹکڑے میں لے کر آپ کی خدمت میں حاضر ہوئی اور کہا : یہ ہے ، میں نے اس کو جنم دے دیا ہے ۔ آپ نے فرمایا : \"\" جاؤ ، اسے دودھ پلاؤ حتی کہ تم اس کا دودھ چھڑا دو ۔ \"\" جب اس نے اس کا دودھ چھڑا دیا تو بچے کو لے کر آپ کے پاس حاضر ہوئی ، اس کے ہاتھ میں روٹی کا ٹکڑا تھا ، اس نے کہا : اے اللہ کے نبی! میں نے اس کا دودھ چھڑا دیا ہے اور اس نے کھانا بھی کھا لیا ہے ۔ ( ابھی اس کی مدت رضاعت باقی تھی ۔ ایک انصاری نے اس کی ذمہ داری اٹھا لی ) تو آپ نے بچہ مسلمانوں میں سے ایک آدمی ( اس انصاری ) کے حوالے کیا ، پھر اس کے لیے ( گڑھا کھودنے کا ) حکم دیا تو سینے تک اس کے لیے گڑھا کھودا گیا اور آپ نے لوگوں کو حکم دیا تو انہوں نے اسے رجم کر دیا ۔ حضرت خالد بن ولید رضی اللہ عنہ ایک پتھر لے کر آگے بڑھے اور اس کے سر پر مارا ، خون کا فوارہ پھوٹ کر حضرت خالد رضی اللہ عنہ کے چہرے پر پڑا تو انہوں نے اسے برا بھلا کہا ، نبی صلی اللہ علیہ وسلم نے ان کے برا بھلا کہنے کو سن لیا تو آپ نے فرمایا : \"\" خالد! ٹھہر جاؤ ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! اس عورت نے ایسی توبہ کی ہے کہ اگر ناجائز محصول لینے والا ( جو ظلما لاتعداد انسانوں کا حق کھاتا ہے ) ایسی توبہ کرے تو اسے بھی معاف کر دیا جائے ۔ \"\" پھر آپ نے اس کے بارے میں حکم دیا اور اس کی نمازِ جنازہ پڑھائی اور اسے دفن کر دیا گیا",
          "fr": "Rapporté par Abdullah ibn Buraida, d’après son père : Ma’iz ibn Malik al-Aslami vint voir le Messager d’Allah ﷺ et lui dit : « Ô Messager d’Allah, je me suis fait du tort ; j’ai commis l’adultère et je souhaite sincèrement que tu me purifies. » Le Prophète ﷺ le repoussa. Le lendemain, Ma’iz revint et dit : « Ô Messager d’Allah, j’ai commis l’adultère. » Le Messager d’Allah ﷺ le repoussa une seconde fois et l’envoya vers les siens en leur demandant : « Savez-vous s’il a un problème mental ? » Ils nièrent cela et dirent : « Nous ne le connaissons que comme un homme sage et bon parmi nous, autant que nous pouvons en juger. » Ma’iz revint une troisième fois, et le Prophète ﷺ fit comme auparavant. Il se renseigna sur lui et on l’informa qu’il n’avait aucun problème, ni lui ni son esprit. À la quatrième fois, on creusa une fosse pour lui, le Prophète ﷺ prononça le jugement et il fut lapidé. Le narrateur dit : Une femme de Ghamid vint alors voir le Prophète ﷺ et dit : « Ô Messager d’Allah, j’ai commis l’adultère, purifie-moi. » Il la repoussa. Le lendemain, elle dit : « Ô Messager d’Allah, pourquoi me repousses-tu ? Peut-être me repousses-tu comme tu as repoussé Ma’iz. Par Allah, je suis enceinte. » Il dit : « Si tu insistes, alors pars jusqu’à ce que tu accouches. » Quand elle eut accouché, elle revint avec l’enfant enveloppé dans un tissu et dit : « Voici l’enfant que j’ai mis au monde. » Il dit : « Va l’allaiter jusqu’à ce que tu le sèvres. » Quand elle l’eut sevré, elle revint avec l’enfant qui tenait un morceau de pain dans la main. Elle dit : « Ô Messager d’Allah, le voici, je l’ai sevré et il mange de la nourriture. » Le Prophète ﷺ confia l’enfant à un musulman, puis il prononça la peine : elle fut placée dans une fosse jusqu’à la poitrine et il ordonna aux gens de la lapider. Khalid ibn Walid lança une pierre qui la toucha à la tête et du sang jaillit sur le visage de Khalid, qui l’insulta alors. Le Messager d’Allah ﷺ entendit la malédiction de Khalid et dit : « Khalid, sois doux. Par Celui qui détient ma vie dans Sa main, elle a fait un repentir tel que même un collecteur d’impôts injuste, s’il se repentait ainsi, serait pardonné. » Puis il ordonna qu’on prie sur elle et elle fut enterrée",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] sedangkan lafadz haditsnya saling berdekatan, telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Basyir bin Muhajir] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [ayahnya], bahwa Ma'iz bin Malik Al Aslami pergi menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, sesungguhnya aku telah menzhalimi diriku, karena aku telah berzina, oleh karena itu aku ingin agar anda berkenan membersihkan diriku.\" Namun beliau menolak pengakuannya. Keesokan harinya, dia datang lagi kepada beliau sambil berkata, \"Wahai Rasulullah, sesungguhnya aku telah berzina.\" Namun beliau tetap menolak pengakuannya yang kedua kalinya. Lalu Rasulullah shallallahu 'alaihi wasallam mengutus seseorang untuk menemui kaumnya dengan mengatakan: \"Apakah kalian tahu bahwa pada akalnya Ma'iz ada sesuatu yang tidak beres yang kalian ingkari?\" mereka menjawab, \"Kami tidak yakin jika Ma'iz terganggu pikirannya, setahu kami dia adalah orang yang baik dan masih sehat akalnya.\" Untuk ketiga kalinya, Ma'iz bin Malik datang menemui Rasulullah shallallahu 'alaihi wasallam untuk membersihkan dirinya dari dosa zina yang telah diperbuatnya. Lalu Rasulullah shallallahu 'alaihi wasallam pun mengirimkan seseorang menemui kaumnya untuk menanyakan kondisi akal Ma'iz, namun mereka membetahukan kepada beliau bahwa akalnya sehat dan termasuk orang yang baik. Ketika Ma'iz bin Malik datang keempat kalinya kepada beliau, maka beliau memerintahkan untuk membuat lubang ekskusi bagi Ma'iz. Akhirnya beliau memerintahkan untuk merajamnya, dan hukuman rajam pun dilaksanakan.\" Buraidah melanjutkan, \"Suatu ketika ada seorang wanita Ghamidiyah datang menemui Rasulullah shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, diriku telah berzina, oleh karena itu sucikanlah diriku.\" Tetapi untuk pertama kalinya Rasulullah shallallahu 'alaihi wasallam tidak menghiraukan bahkan menolak pengakuan wanita tersebut. Keesokan harinya wanita tersebut datang menemui Rasulullah shallallahu 'alaihi wasallam sambil berkata, \"Wahai Rasulullah, kenapa anda menolak pengakuanku? Sepertinya anda menolak pengakuan aku sebagaimana pengakuan Ma'iz. Demi Allah, sekarang ini aku sedang mengandung bayi dari hasil hubungan gelap itu.\" Mendengar pengakuan itu, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya kamu ingin tetap bertaubat, maka pulanglah sampai kamu melahirkan.\" Setelah melahirkan, wanita itu datang lagi kepada beliau sambil menggendong bayinya yang dibungkus dengan kain, dia berkata, \"Inilah bayi yang telah aku lahirkan.\" Beliau lalu bersabda: \"Kembali dan susuilah bayimu sampai kamu menyapihnya.\" Setelah mamasuki masa sapihannya, wanita itu datang lagi dengan membawa bayinya, sementara di tangan bayi tersebut ada sekerat roti, lalu wanita itu berkata, \"Wahai Nabi Allah, bayi kecil ini telah aku sapih, dan dia sudah dapat menikmati makanannya sendiri.\" Kemudian beliau memberikan bayi tersebut kepada laki-laki muslim, dan memerintahkan untuk melaksanakan hukuman rajam. Akhirnya wanita itu ditanam dalam tanah hingga sebatas dada. Setelah itu beliau memerintahkan orang-orang supaya melemparinya dengan batu. Sementara itu, Khalid bin Walid ikut serta melempari kepala wanita tersebut dengan batu, tiba-tiba percikan darahnya mengenai wajah Khalid, seketika itu dia mencaci maki wanita tersebut. Ketika mendengar makian Khalid, Nabi Allah shallallahu 'alaihi wasallam bersabda: \"Tenangkanlah dirimu wahai Khalid, demi dzat yang jiwaku berada di tangan-Nya, sesungguhnya perempuan itu telah benar-benar bertaubat, sekiranya taubat (seperti) itu dilakukan oleh seorang pelaku dosa besar niscaya dosanya akan diampuni.\" Setelah itu beliau memerintahkan untuk menshalati jenazahnya dan menguburkannya",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Abdullah b. Numeyr rivayet etti. H. Bize Muhammed b. Abdillâh b. Numeyr dahî rivayet etti. Hadîsin lâfzı hususunda birbirlerine yakındırlar. (Dediki): Bize babam rivayet etti. (Dediki): Bize Büşeyr b. El-Muhâcîr rivayet etti. (Dediki): Bize Abdullah b. Büreyde, babasından naklen rivayet etti ki: Mâiz b. Mâlik El-Eslemî, Resûlullah (Sallallahu Aleyhi ve Sellem)'e gelerek : — Yâ Resûlâllah! Ben nefsime zulmettim; zina ettim. Beni temizlemeni dilerim! demiş. Nebi (Sallallahu Aleyhi ve Sellem) onu geri çevirmiş. Ertesi gün olunca (tekrar) gelerek: — Yâ Resûlâllah! Ben gerçekten zina ettim! demiş. O da kendisini ikinci defa geri çevirmiş. Derken Resûlullah (Sallallahu Aleyhi ve Sellem) onun kavmine haber göndererek : «Bunun aklında yadırgadığınız bir kusur biliyor musunuz?» diye sormuş. — Biz onu ancak aklı başında, kendi görüşümüze göre sulehâmızdan biliriz! cevabını vermişler. Mâiz üçüncü defa (tekrar) gelmiş. Resûlullah (Sallallahu Aleyhi ve Sellem) yine kavmine haber göndererek onu soruşturmuş. Onlar da : — Ne kendinde bir kusur vardır, ne aklında! diye haber vermişler Dördüncü gün gelince onun için bir çukur kaz(dır)nuş: Sonra emir buyurarak recmedilmiş. Bilâhare Gâmid'li kadın gelmiş; ve : — Yâ Resûlâllah! Ben zina ettim, imdi beni temizle! demiş. Peygamber (Sallallahu Aleyhi ve Sellem) onu da geri çevirmiş. Ertesi gün gelince kadın : — Yâ Resûlâllah! Beni neye geri çeviriyorsun? Galiba beni, Mâiz'i Çevirdiğin gibi geri çevireceksin! Vallahi ben gebeyim! demiş. Efendimiz: «Olmazsa haydi doğuruncaya kadar git (buradan!) » buyurmuşlar. Kadın doğurduğu zaman çocuğu bir bez parçası içinde getirmiş; ve : — İşte! Onu doğurdum; demiş. (Yine) : «Git de bu çocuğu sütten kesilinceye kadar emzîr!» buyurmuş. Kadın onu memeden ayırdıktan sonra çocuğu, elinde bir parça ekmek olduğu halde getirmiş ve: — İşte yâ Nebiyyâllah! Onu memeden ayırdım. Yemek yemeğe de başladı... demiş. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) çocuğu müslümanlardan birine vermiş. Sonra emir buyurarak kadın için göğsüne kadar bir çukur kazılmış. Cemaate de emir vermiş ve kadını recmetmişler. Hâlid b. Velîd bir taşla gelerek başına atmış da kan Hâlid'in yüzüne sıçramış; Hâlid de ona söğmüş. Nebi (Sallallahu Aleyhi ve Sellem) onun kadına söğdüğünü işiterek: «Yavaş ol yâ Hâlid! Nefsim yed-i kudretinde olan Allah'a yemîn ederim! Bu kadın öyle bir tevbe etti ki, onu bir baççı yapsaydı mutlaka mağfiret olunurdu!» buyurmuşlar. Sonra kadın (in ihzarın) ı emrederek cenazesini kılmış ve kadın defnedilmiş. İzah 1696 da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 4433,
      "arabicNumber": "1696.01",
      "book": 29,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنِي أَبُو غَسَّانَ، مَالِكُ بْنُ عَبْدِ الْوَاحِدِ الْمِسْمَعِيُّ حَدَّثَنَا مُعَاذٌ، - يَعْنِي ابْنَ هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو قِلاَبَةَ، أَنَّ أَبَا الْمُهَلَّبِ، حَدَّثَهُ عَنْ عِمْرَانَ، بْنِ حُصَيْنٍ أَنَّ امْرَأَةً، مِنْ جُهَيْنَةَ أَتَتْ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَهِيَ حُبْلَى مِنَ الزِّنَى فَقَالَتْ يَا نَبِيَّ اللَّهِ أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ فَدَعَا نَبِيُّ اللَّهِ صلى الله عليه وسلم وَلِيَّهَا فَقَالَ ‏\"‏ أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَائْتِنِي بِهَا ‏\"‏ ‏.‏ فَفَعَلَ فَأَمَرَ بِهَا نَبِيُّ اللَّهِ صلى الله عليه وسلم فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ ثُمَّ صَلَّى عَلَيْهَا فَقَالَ لَهُ عُمَرُ تُصَلِّي عَلَيْهَا يَا نَبِيَّ اللَّهِ وَقَدْ زَنَتْ فَقَالَ ‏\"‏ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ تَوْبَةً أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ تَعَالَى ‏\"‏ ‏.‏",
        "translations": {
          "en": "Imran b. Husain reported that a woman from Juhaina came to Allah's Apostle (ﷺ) and she had become pregnant because of adultery. She said:Allah's Apostle, I have done something for which (prescribed punishment) must be imposed upon me, so impose that. Allah's Apostle (ﷺ) called her master and said: Treat her well, and when she delivers bring her to me. He did accordingly. Then Allah's Apostle (ﷺ) pronounced judgment about her and her clothes were tied around her and then he commanded and she was stoned to death. He then prayed over her (dead body). Thereupon Umar said to him: Allah's Apostle, you offer prayer for her, whereas she had committed adultery! Thereupon he said: She has made such a repentance that if it were to be divided among seventy men of Medina, it would be enough. Have you found any repentance better than this that she sacr ficed her life for Allah, the Majestic?",
          "ur": "ہشام نے مجھے یحییٰ بن ابی کثیر سے حدیث بیان کی ، کہا : مجھے ابوقلابہ نے حدیث بیان کی کہ انہیں ابومہلب نے حضرت عمران بن حصین رضی اللہ عنہ سے حدیث بیان کی کہ قبیلہ جہینہ کی ایک عورت نبی صلی اللہ علیہ وسلم کے پاس آئی ، وہ زنا سے حاملہ تھی ، اس نے کہا : اللہ کے رسول! میں ( شرعی ) حد کی مستحق ہو گئی ہوں ، آپ وہ حد مجھ پر نافذ فرمائیں ۔ نبی صلی اللہ علیہ وسلم نے اس کے ولی کو بلوایا اور فرمایا : \" اس کے ساتھ اچھا سلوک کرو ، جب یہ بچے کو جنم دے تو اسے میرے پاس لے آنا ۔ \" اس نے ایسا ہی کیا ۔ پھر نبی صلی اللہ علیہ وسلم نے اس کے بارے میں حکم دیا تو اس کے کپڑے اس پر کس کر باندھ دیے گئے ، پھر آپ نے حکم دیا تو اسے رجم کر دیا گیا ، پھر آپ نے اس کی نماز جنازہ پڑھائی ۔ تو حضرت عمر رضی اللہ عنہ نے آپ سے عرض کی : اللہ کے نبی! آپ اس کی نماز جنازہ پڑھائیں گے حالانکہ اس نے زنا کیا ہے؟ آپ نے فرمایا : \" اس نے یقینا ایسی توبہ کی ہے کہ اگر اہل مدینہ کے ستر گھروں کے درمیان تقسیم کر دی جائے تو ان کے لیے بھی کافی ہو جائے گی ۔ اور کیا تم نے اس سے بہتر ( کوئی ) توبہ دیکھی ہے کہ اس نے اللہ ( کو راضی کرنے ) کے لیے اپنی جان قربان کر دی ہے",
          "fr": "Rapporté par Imran ibn Husayn : Une femme de Juhaina vint voir le Messager d’Allah ﷺ alors qu’elle était enceinte à la suite d’un adultère. Elle dit : « Ô Messager d’Allah, j’ai fait quelque chose qui mérite une peine légale, alors applique-la. » Le Messager d’Allah ﷺ fit venir son maître et lui dit : « Traite-la bien, et quand elle aura accouché, amène-la-moi. » Il fit ainsi. Ensuite, le Messager d’Allah ﷺ prononça le jugement : ses vêtements furent attachés autour d’elle, puis il ordonna qu’elle soit lapidée. Il pria ensuite sur elle. Omar lui dit alors : « Ô Messager d’Allah, tu pries pour elle alors qu’elle a commis l’adultère ! » Il répondit : « Elle a fait un repentir tel que, s’il était partagé entre soixante-dix hommes de Médine, cela suffirait. As-tu vu un repentir meilleur que celui où elle a sacrifié sa vie pour Allah, le Majestueux ? »",
          "id": "Telah menceritakan kepadakuu [Abu Ghassan Malik bin Abdul Wahid Al Misma'i] telah menceritakan kepada kami [Mu'adz] -yaitu Ibnu Hisyam- telah menceritakan kepadaku [ayahku] dari [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Qilabah] bahwa [Abu Al Muhallab] telah menceritakan kepadanya dari ['Imran bin Hushain], bahwa seorang wanita dari Juhainah datang menghadap kepada Nabi shallallahu 'alaihi wasallam, padahal dia sedang hamil akibat melakukan zina. Wanita itu berkata, \"Wahai Rasulullah, aku telah melanggar hukum, oleh karena itu tegakkanlah hukuman itu atasku.\" Lalu Nabi Allah memanggil wali perempuan itu dan bersabda kepadanya: \"Rawatlah wanita ini sebaik-baiknya, apabila dia telah melahirkan, bawalah dia ke hadapanku.\" Lalu walinya melakukan pesan tersebut. setelah itu Nabi shallallahu 'alaihi wasallam memerintahkan untuk merajam wanita tersebut, maka pakaian wanita tersebut dirapikan (agar auratnya tidak terbuka saat dirajam). Kemudian beliau perintahkan agar ia dirajam. Setelah dirajam, beliau menshalatkan jenazahnya, namun hal itu menjadkan Umar bertanya kepada beliau, \"Wahai Nabi Allah, perlukah dia dishalatkan? Bukankah dia telah berzina?\" beliau menjawab: \"Sunnguh, dia telah bertaubat kalau sekiranya taubatnya dibagi-bagikan kepada tujuh puluh orang penduduk Madinah, pasti taubatnya akan mencukupi mereka semua. Adakah taubat yang lebih utama daripada menyerahkan nyawa kepada Allah Ta'ala secara ikhlas?\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Aban Aal 'Athar] telah menceritakan kepada kami [Yahya bin Abu Katsir] dengan isnad seperti ini",
          "tr": "Bana Ebû Gassân Mâlik b. AbdiIvâhİd El-Mismaî rivayet etti. (Dediki): Bize Muâz (yâni İbni Hişâm) rivayet etti. (Dediki): Bana babam, Yahya b. Ebî Kesirden rivayet etti. (Demişki): Bana Ebû Kılâbe rivayet etti. Ona da Ebû'l-Mühelleb, İmrân b. Husayn'dan naklen rivayet etmiş ki, Cüheyne (kabilesin) den bîr kadın zinadan gebe olarak Nebi (Sallallahu Aleyhi ve Sellem)'e gelmiş ve: — Yâ Nebiyyâllah! Ben haddi hak ettim. Onu bana tatbik ediver! demiş. Nebiyyullah (Sallallahu Aleyhi ve Seliem) de velîsini çağırarak: «Buna iyi bak, doğurduğu zaman onu bana getir!» buyurmuş. Velisi de öyle yapmış. Bunun üzerine Nebiyyullah (Sallallahu Aleyhi ve Sellem) kadın hakkında emir vererek üzerine elbisesi bağlanmış. Sonra emir buyurarak recmedilmiş; ve cenazesini kılmış. Ömer kendisine : — Bunun cenazesini kılacak mısın yâ Nebiyyâllah? Halbuki zina etmiştir; demiş. Efendimiz: «Gerçekten o öyle bir tevbe etti kî, bu tevbe Medinelilerden yetmiş kişi arasında taksim edilse onlara yeterdi. Sen Allah için canını vermekten daha faziletli bir tevbe gördün mü?» buyurmuşlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 4434,
      "arabicNumber": "1696.02",
      "book": 29,
      "hadithInBook": 37,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبَانٌ الْعَطَّارُ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Yahya b. Abu Kathir",
          "ur": "ابان عطار نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Rapporté par Yahya ibn Abu Kathir : Ce hadith a été transmis par cette chaîne de rapporteurs",
          "tr": "{…} Bize bu hadîsi Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Affân b. Müslim rivayet etti. (Dediki): Bize Ebân El-Attâr rivayet etti. (Dediki): Bize Yahya b. Ebî Kesir bu isnadla bu hadîsin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 4437,
      "arabicNumber": "1699.01",
      "book": 29,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِيَهُودِيٍّ وَيَهُودِيَّةٍ قَدْ زَنَيَا فَانْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى جَاءَ يَهُودَ فَقَالَ ‏\"‏ مَا تَجِدُونَ فِي التَّوْرَاةِ عَلَى مَنْ زَنَى ‏\"‏ ‏.‏ قَالُوا نُسَوِّدُ وُجُوهَهُمَا وَنُحَمِّلُهُمَا وَنُخَالِفُ بَيْنَ وُجُوهِهِمَا وَيُطَافُ بِهِمَا ‏.‏ قَالَ ‏\"‏ فَأْتُوا بِالتَّوْرَاةِ إِنْ كُنْتُمْ صَادِقِينَ ‏\"‏ ‏.‏ فَجَاءُوا بِهَا فَقَرَءُوهَا حَتَّى إِذَا مَرُّوا بِآيَةِ الرَّجْمِ وَضَعَ الْفَتَى الَّذِي يَقْرَأُ يَدَهُ عَلَى آيَةِ الرَّجْمِ وَقَرَأَ مَا بَيْنَ يَدَيْهَا وَمَا وَرَاءَهَا فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلاَمٍ وَهْوَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُرْهُ فَلْيَرْفَعْ يَدَهُ فَرَفَعَهَا فَإِذَا تَحْتَهَا آيَةُ الرَّجْمِ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ كُنْتُ فِيمَنْ رَجَمَهُمَا فَلَقَدْ رَأَيْتُهُ يَقِيهَا مِنَ الْحِجَارَةِ بِنَفْسِهِ ‏.‏",
        "translations": {
          "en": "Abdullah b. 'Umar reported that a Jew and a Jewess were brought to Allah's Messenger (ﷺ) who had committed adultery. Allah's Messenger (ﷺ) came to the Jews and said:What do you find in Torah for one who commits adultery? They said: We darken their faces and make them ride on the donkey with their faces turned to the opposite direction (and their backs touching each other), and then they are taken round (the city). He said: Bring Torah if you are truthful. They brought it and recited it until when they came to the verse pertaining to stoning, the person who was reading placed his hand on the verse pertaining to stoning, and read (only that which was) between his hands and what was subsequent to that. Abdullah b. Salim who was at that time with the Messenger of Allah (ﷺ) said: Command him (the reciter) to lift his hand. He lifted it and there was, underneath that, the verse pertaining to stoning. Allah's Messenger (ﷺ) pronounced judgment about both of them and they were stoned. Abdullah b. 'Umar said: I was one of those who stoned them, and I saw him (the Jew) protecting her (the Jewess) with his body",
          "ur": "عبیداللہ نے ہمیں نافع سے خبر دی ، کہا : حضرت عبداللہ بن عمر رضی اللہ عنہ نے انہیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک یہودی مرد اور ایک یہودی عورت کو لایا گیا جنہوں نے زنا کیا تھا ، تو رسول اللہ صلی اللہ علیہ وسلم چل پڑے حتی کہ یہود کے پاس آئے اور پوچھا : \"\" تم تو رات میں اس آدمی کے بارے میں کیا سزا پاتے ہو جس نے زنا کیا ہو؟ \"\" انہوں نے کہا : ہم ان دونوں کا منہ کالا کرتے ہیں ، انہیں ( گدھے پر ) سوار کرتے ہیں ، ان دونوں کے چہرے مخالف سمت میں کر دیتے ہیں اور انہیں ( گلیوں بازاروں میں ) پھرایا جاتا ہے ۔ آپ نے فرمایا : \"\" اگر تم سچے ہو ، تو رات لے آؤ ۔ \"\" وہ اسے لائے اور پڑھنے لگے حتی کہ جب رجم کی آیت کے نزدیک پہنچے تو اس نوجوان نے ، جو پڑھ رہا تھا ، اپنا ہاتھ رجم کی آیت پر رکھا اور وہ حصہ پڑھ دیا جو آگے تھا اور جو پیچھے تھا ۔ اس پر حضرت عبداللہ بن سلام رضی اللہ عنہ نے آپ سے عرض کی ، اور وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھے ، آپ اسے حکم دیجیے کہ اپنا ہاتھ اٹھائے ۔ اس نے ہاتھ اٹھایا تو اس نے نیچے رجم کی آیت ( موجود ) تھی ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں ( کو رجم کرنے ) کا حکم صادر فرمایا تو انہیں رجم کر دیا گیا ۔ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا : میں بھی ان لوگوں میں تھا جنہوں نے انہیں رجم کیا ، میں نے اس آدمی کو دیکھا وہ اپنے ( جسم کے ) ذریعے سے اس عورت کو بچا رہا تھا",
          "fr": "Rapporté par Abdullah ibn Umar : Un homme et une femme juifs furent amenés devant le Messager d’Allah ﷺ pour avoir commis l’adultère. Le Messager d’Allah ﷺ alla voir les Juifs et leur dit : « Que trouvez-vous dans la Torah pour celui qui commet l’adultère ? » Ils dirent : « Nous noircissons leurs visages, nous les faisons monter à l’envers sur un âne, dos à dos, puis on les promène dans la ville. » Il dit : « Apportez la Torah si vous êtes véridiques. » Ils l’apportèrent et la récitèrent jusqu’à arriver au verset concernant la lapidation. Celui qui lisait posa sa main sur ce verset et lut ce qui était avant et après. Abdullah ibn Salim, qui était avec le Messager d’Allah ﷺ, dit : « Ordonne-lui de lever la main. » Il la leva et il y avait en dessous le verset sur la lapidation. Le Messager d’Allah ﷺ prononça le jugement contre eux et ils furent lapidés. Abdullah ibn Umar dit : « J’étais parmi ceux qui les ont lapidés et j’ai vu l’homme protéger la femme avec son corps. »",
          "id": "Telah menceritakan kepadaku [Al Hakam bin Musa Abu Shalih] telah menceritakan kepada kami [Syua'ib bin Ishaq] telah mengabarkan kepada kami ['Ubaidullah] dari [Nafi'] bahwa [Abdullah bin Umar] telah mengabarkan kepadanya, bahwa seorang laki-laki dan seorang wanita dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam karena keduanya dituduh telah berbuat zina. Rasulullah shallallahu 'alaihi wasallam lantas pergi hingga menemui orang-orang Yahudi, beliau kemudian bertanya: \"Apa yang kalian ketahui dalam Taurat tentang hukuman bagi orang yang telah berzina?\" mereka menjawab: \"Kami lumuri muka mereka dengan arang, kemudian kami naikkan kedua orang tersebut ke atas kendaraan dengan posisi berbelakang-belakangan lalu diarak keliling kota.\" Beliau bersabda: \"Jika kalian benar, coba perlihatkan kitab Tauratmu.\" Lalu mereka bawa kitab Taurat dan mereka membacanya di hadapan beliau. Ketika bacaannya sampai kepada ayat rajam, pemuda yang membacanya meletakkan tangannya agar bisa menutupi ayat tersebut hingga lewat sampai ayat berikutnya. Tetapi Abdullah bin Salam, yang ketika itu mendampingi Rasulullah shallallahu 'alaihi wasallam berkata, \"Wahai Rasulullah, suruhlah dia mengangkat tangannya.\" Ketika pemuda itu mengangkat tangannya, ternyata di bawah tangannya terdapat ayat rajam. Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya keduanya dihukum rajam, akhirnya keduanya dihukum rajam.\" Abdullah bin Umar berkata, \"Aku ikut serta merajam keduanya, aku lihat yang laki-laki berusaha melindungi wanita (ya) dengan tubuhnya dari lemparan-lemparan batu.\" Dan telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] -yaitu Ibnu 'Ulayyah- dari [Ayyub]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku tokoh laki-laki dari alim ulama, di antaranya adalah [Malik bin Anas], bahwa [Nafi'] telah mengabarkan kepada mereka dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam pernah merajam laki-laki dan wanita Yahudi yang ketahuan berzina, lalu orang-orang Yahudi menyerahkan keduanya kepada Rasulullah shallallahu 'alaihi wasallam …lalu mereka melanjutkan hadits seperti hadits di atas.\" Dan telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar], bahwa orang-orang Yahudi datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa seorang laki-laki dan seorang wanita yang telah berzina…lalu dia menyebutkan sebagaimana hadits Ubaidullah dari Nafi",
          "tr": "Bana Hakem b. Mûsâ Ebû Salih rivayet etti. (Dediki): Bize Şuayb b. İshak rivayet etti. (Dediki): Bize UbeyduIIah, Nâfi'den naklen haber verdi. Ona da Abdullah b. Ömer haber vermiş ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e zina etmiş bir yahudi erkekle bir yahudi kadın getirmişler. Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) kalkarak yahudilere gelmiş ve: «Zina eden bir kimseye siz Tevrat'ta ne (ceza) buluyorsunuz?» diye sormuş. Yahudiler: — Yüzlerini karaya boyar; kendilerini yük üzerine bindirir; yüzlerini birbirlerine ters döndürürüz ve (sokaklarda) dolaştırılırlar! demişler. «Doğru söylüyorsanız o halde Tevrat'ı getirin!» buyurmuş. Yahudiler hemen Tevrat'ı getirerek okumuşlar. Recim âyetine gelince, okuyan genç elini recim âyetinin üzerine koymuş ve onun evvelindekini ve sonundakini okumuş. Abdullah b. Selâm —ki Resûlullah (Sallallahu Aleyhi ve Sellem)'le birlikte bulunuyormuş. (Efendimize) : — Buna emir buyur da elini kaldırsın! demiş. Yahudi elini kaldırınca bakmışlar ki altında recm âyeti var! Bunun üzerine Resûlullah (Sallallahu Aleyhi ve Sellem) her ikisi için de emir vererek recmedilmişler. Abdullah b. Ömer: — Ben de onları recmedenler arasında idim. Yemin olsun yahûdînin kadını kendi vücudu ile koruduğunu gördüm! demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 4438,
      "arabicNumber": "1699.02",
      "book": 29,
      "hadithInBook": 41,
      "text": {
        "arabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ أَيُّوبَ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي رِجَالٌ، مِنْ أَهْلِ الْعِلْمِ مِنْهُمْ مَالِكُ بْنُ أَنَسٍ أَنَّ نَافِعًا، أَخْبَرَهُمْ عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَجَمَ فِي الزِّنَى يَهُودِيَّيْنِ رَجُلاً وَامْرَأَةً زَنَيَا فَأَتَتِ الْيَهُودُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِهِمَا ‏.‏ وَسَاقُوا الْحَدِيثَ بِنَحْوِهِ ‏.‏",
        "translations": {
          "en": "Ibn Umar reported that Allah's Messenger (ﷺ) stoned to death the Jews, both male and female, who had committed adultery. The Jews brought them to Allah's Messenger (may peace he upon him). The rest of the hadith is the same",
          "ur": "ابن علیہ نے ہمیں ایوب سے خبر دی ، نیز عبداللہ بن وہب نے کہا : مجھے اہل علم میں سے بہت سے آدمیوں نے جن میں امام مالک بن انس رحمۃ اللہ علیہ بھی شامل ہیں ، خبر دی کہ انہیں نافع نے بتایا ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے زنا ( کی حد ) میں دو یہودیوں ، ایک مرد اور ایک عورت کو ، جنہوں نے زنا کیا تھا ، رجم کرایا ۔ یہود انہیں لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے تھے ۔ ۔ آگے اسی ( سابقہ حدیث کی ) طرح حدیث بیان کی",
          "fr": "Rapporté par Ibn Umar : Le Messager d’Allah ﷺ a lapidé à mort les Juifs, homme et femme, qui avaient commis l’adultère. Les Juifs les avaient amenés au Messager d’Allah ﷺ. Le reste du hadith est identique",
          "tr": "Bize Züheyr b. Harb da rivayet etti. (Dediki): Bize İsmail (yâni İbni Uleyye), Eyyûb'dan rivayet etti. H. Bana Ebû't-Tâhir dahî rivayet etti. (Dediki): Bize Abdullah b. Vehb haber verdi. (Dediki): Bana ehl-i ilimden bâzı zevat haber verdi ki, Mâlik b. Enes de onlardan biridir. Onlara da Nâfi', İbni Ömer'den naklen haber vermiş ki, Resûlullah (Sallallahu Aleyhi ve Sellem) zina sebebi ile iki yahudiyi recmetmiş. Zina eden bir erkekle bir kadını! Yahudiler onları Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirmişler... Raviler hadîsi yukarı ki hadîs gibi nakletmişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 41
      }
    },
    {
      "hadithNumber": 4439,
      "arabicNumber": "1699.03",
      "book": 29,
      "hadithInBook": 42,
      "text": {
        "arabic": "وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ، عُمَرَ أَنَّ الْيَهُودَ، جَاءُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ قَدْ زَنَيَا ‏.‏ وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ ‏.‏",
        "translations": {
          "en": "Ibn 'Umar reported that the Jews brought to Allah's Messenger (ﷺ) a man and a woman who had committed adultery. The rest of the hadith is the same",
          "ur": "موسیٰ بن عقبہ نے ہمیں نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ یہود اپنے ایک مرد اور ایک عورت کو ، جنہوں نے زنا کیا تھا ، لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے ۔ ۔ آگے نافع سے عبیداللہ کی روایت کردہ حدیث کی طرح بیان کیا",
          "fr": "Rapporté par Ibn Umar : Les Juifs amenèrent devant le Messager d’Allah ﷺ un homme et une femme qui avaient commis l’adultère. Le reste du hadith est identique",
          "tr": "{…} Bize Ahmed b. Yûnus da rivayet etti. (Dedikî): Bize Züheyr rivayet etti. (Dediki): Bize Mûsâ b. Ukbe, Nâfi'den, o da İbni Ömer'­den naklen rivayet etti ki, Yahudiler içlerinden zina eden bir erkekle bir kadını Resûlullah (Sallallahu Aleyhi ve Sellem)'e getirmişler... Ravi hadîsi, Ubeydullah'ın Nâfi'den rivayeti tarzında nakletnıiştir. İzah 1702 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 42
      }
    },
    {
      "hadithNumber": 4440,
      "arabicNumber": "1700.01",
      "book": 29,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنْ أَبِي مُعَاوِيَةَ، قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ مُرَّ عَلَى النَّبِيِّ صلى الله عليه وسلم بِيَهُودِيٍّ مُحَمَّمًا مَجْلُودًا فَدَعَاهُمْ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَكَذَا تَجِدُونَ حَدَّ الزَّانِي فِي كِتَابِكُمْ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَدَعَا رَجُلاً مِنْ عُلَمَائِهِمْ فَقَالَ ‏\"‏ أَنْشُدُكَ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى أَهَكَذَا تَجِدُونَ حَدَّ الزَّانِي فِي كِتَابِكُمْ ‏\"‏ ‏.‏ قَالَ لاَ وَلَوْلاَ أَنَّكَ نَشَدْتَنِي بِهَذَا لَمْ أُخْبِرْكَ نَجِدُهُ الرَّجْمَ وَلَكِنَّهُ كَثُرَ فِي أَشْرَافِنَا فَكُنَّا إِذَا أَخَذْنَا الشَّرِيفَ تَرَكْنَاهُ وَإِذَا أَخَذْنَا الضَّعِيفَ أَقَمْنَا عَلَيْهِ الْحَدَّ قُلْنَا تَعَالَوْا فَلْنَجْتَمِعْ عَلَى شَىْءٍ نُقِيمُهُ عَلَى الشَّرِيفِ وَالْوَضِيعِ فَجَعَلْنَا التَّحْمِيمَ وَالْجَلْدَ مَكَانَ الرَّجْمِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ إِنِّي أَوَّلُ مَنْ أَحْيَا أَمْرَكَ إِذْ أَمَاتُوهُ ‏\"‏ ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ يَا أَيُّهَا الرَّسُولُ لاَ يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ‏}‏ إِلَى قَوْلِهِ ‏{‏ إِنْ أُوتِيتُمْ هَذَا فَخُذُوهُ‏}‏ يَقُولُ ائْتُوا مُحَمَّدًا صلى الله عليه وسلم فَإِنْ أَمَرَكُمْ بِالتَّحْمِيمِ وَالْجَلْدِ فَخُذُوهُ وَإِنْ أَفْتَاكُمْ بِالرَّجْمِ فَاحْذَرُوا ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْكَافِرُونَ‏}‏ ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الظَّالِمُونَ‏}‏ ‏{‏ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْفَاسِقُونَ‏}‏ فِي الْكُفَّارِ كُلُّهَا ‏.‏",
        "translations": {
          "en": "Al-Bara' b. 'Azib reported:There happened to pass by Allah's Apostle (ﷺ) a Jew blackened and lashed. Allah's Apostle (ﷺ) called them (the Jews) and said: Is this the punishment that you find in your Book (Torah) as a prescribed punishment for adultery? They said: Yes. He (the Holy Prophet) called one of the scholars amongst them and said: I ask you in the name of Allah Who sent down the Torah on Moses if that is the prescribed punishment for adultery that you find in your Book. He said: No. Had you not asked me in the name of Allah, I would not have given you this information. We find stoning to death (as punishment prescribed in the Torah). But this (crime) became quite common amongst our aristocratic class. So when we caught hold of any rich person (indulging in this offence) we spared him, but when we caught hold of a helpless person we imposed the prescribed punishment upon him. We then said: Let us argree (on a punishment) which we can inflict both upon the rich and the poor. So We decided to blacken the face with coal and flog as a substitute punishment for stoning. Thereupon Allah's Messenger (ﷺ) said: O Allah, I am the first to revive Thy command when they had made it dead. He then commanded and he (the offender) was stoned to death. Allah, the Majestic and Glorious, sent down (this verse):\" O Messenger, (the behaviour of) those who vie with one another in denying the truth should not grieve you...\" up to\" is vouchsafed unto you, accept it\" (v. 41) 2176 It was said (by the Jews): Go to Muhammad; it he commands you to blacken the face and award flogging (as punishment for adultery), then accept it, but it he gives verdict for stoning, then avoid it. It was (then) that Allah, the Majestic and Great, sent down (these verses):\" And they who do not judge in accordance with what Allah has revealed are, indeed, deniers of the truth\" (v. 44) ;\" And they who do not judge in accordance with what Allah has revealed-they, they indeed are the wrongdoers\" (v. 45) ;\" And they who do not judge in accordance with what God has revealed-they are the iniquitous (v. 47). (All these verses) were revealed in connection with the non-believers",
          "ur": "ابومعاویہ نے اعمش سے ، انہوں نے عبداللہ بن مرہ سے اور انہوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : ایک یہودی کو رسول اللہ صلی اللہ علیہ وسلم کے قریب سے گزارا گیا جس کا منہ کالا کیا ہوا تھا اسے کوڑے لگائے گئے تھے ، آپ نے انہیں ( ان کے عالموں کو ) بلایا اور پوچھا : \" کیا تم اپنی کتاب میں زانی کی حد اسی طرح پاتے ہو؟ \" انہوں نے کہا : جی ہاں ۔ ( بعد ازاں آپ کے حکم سے تورات منگوائی گئی ۔ انہوں نے آیت رجم چھپا لی ، وہ ظاہر ہو گئی ۔ اس کے بعد ) آپ نے ان کے علماء میں سے ایک آدمی کو بلایا اور فرمایا : \" میں تمہیں اس اللہ کی قسم دیتا ہوں جس نے موسیٰ علیہ السلام پر تورات نازل کی! کیا تم لوگ اپنی کتاب میں زانی کی حد اسی طرح پاتے ہو؟ \" اس نے جواب دیا : نہیں ، اور اگر آپ مجھے یہ قسم نہ دیتے تو میں آپ کو نہ بتاتا ۔ ( ہم کتاب مین ) رجم ( کی سزا لکھی ہوئی ) پاتے ہیں ۔ لیکن ہمارے اشراف میں زنا بہت بڑھ گیا ۔ ( اس وجہ سے ) ہم جب کسی معزز کو پکڑتے تھے تو اسے چھوڑ دیتے تھے اور جب کسی کمزور کو پکڑتے تو اس پر حد نافذ کر دیتے تھے ۔ ہم نے ( آپس میں ) کہا : آؤ! کسی ایسی چیز ( سزا ) پر جمع ہو جائیں جسے ہم معزز اور معمولی آدمی ( دونوں ) پر لاگو کر سکیں ، تو ہم نے رجم کے بجائے منہ کالا کرنے اور کوڑے لگانے ( کی سزا ) بنا لی ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اے اللہ! میں وہ پہلا شخص ہوں جس نے تیرے حکم کو زندہ کیا جبکہ انہوں نے اسے مردہ کر دیا تھا ۔ \" پھر آپ نے اس کے بارے میں حکم دیا تو اسے رجم کر دیا گیا ۔ اس پر اللہ عزوجل نے ( یہ آیت ) نازل فرمائی : \" اے رسول! آپ ان لوگوں کے پیچھے نہ کڑھیے جو تیزی سے کفر میں داخل ہوتے ہیں ۔ ۔ \" اس فرمان تک : \" اگر تمہیں یہی حکم دیا جائے تو قبول کر لینا ۔ \" ( النائدہ : 41 : 5 ) ( ان کو مشورہ دینے والا ) کہتا تھا : محمد صلی اللہ علیہ وسلم کے پاس جاؤ ، اگر وہ تمہیں ( یہی ) منہ کالا کرنے اور کوڑے لگانے کا حکم دیں تو قبول کر لینا اور اگر رجم کا فتویٰ دیں تو احتراز کرنا ۔ اس پر اللہ تعالیٰ نے ( یہ آیت ) نازل فرمائی : \" اور جو لوگ اس ( حکم ) کے مطابق فیصلہ نہ کریں جو اللہ نے نازل کیا ہے تو وہی لوگ کافر ہیں ۔ \" ( المائدہ : 44 : 5 ) \" اور جو اس کے مطابق فیصلہ نہ کریں جو اللہ نے نازل کیا ہے تو وہی لوگ ظالم ہیں ۔ \" ( المائدۃ؛ 45 : 5 ) \" اور جو اس کے مطابق فیصلہ نہ کریں جو اللہ نے اتارا ہے تو وہی لوگ فاسق ہیں ۔ \" ( المائدہ : 47 : 5 ) یہ ساری آیات کفار کے بارے میں ہیں",
          "fr": "Rapporté par Al-Bara’ ibn Azib : Le Messager d’Allah ﷺ passa près d’un Juif au visage noirci et fouetté. Le Messager d’Allah ﷺ appela les Juifs et dit : « Est-ce la peine que vous trouvez dans votre Livre (la Torah) pour l’adultère ? » Ils dirent : « Oui. » Le Prophète ﷺ fit venir l’un de leurs savants et lui dit : « Je te demande, au nom d’Allah qui a révélé la Torah à Moïse, est-ce la peine prévue pour l’adultère dans votre Livre ? » Il répondit : « Non. Si tu ne m’avais pas interrogé au nom d’Allah, je ne t’aurais pas informé. Nous trouvons la lapidation à mort comme peine dans la Torah. Mais ce crime est devenu fréquent chez nos notables : quand nous attrapions un riche, nous l’épargnions, mais pour un pauvre, nous appliquions la peine. Nous avons alors décidé d’un châtiment applicable aux riches comme aux pauvres : noircir le visage et fouetter, à la place de la lapidation. » Le Messager d’Allah ﷺ dit alors : « Ô Allah, je suis le premier à rétablir Ton commandement après qu’ils l’ont abandonné. » Il ordonna alors la lapidation. Allah, le Majestueux et Glorieux, fit descendre ce verset : « Ô Messager, que ceux qui rivalisent dans le déni de la vérité ne t’attristent pas… jusqu’à : “ce qui t’est donné, accepte-le” (v. 41). » Les Juifs dirent : « Allez voir Muhammad ; s’il ordonne de noircir le visage et de fouetter, acceptez, mais s’il juge la lapidation, évitez-le. » C’est alors qu’Allah, le Majestueux et Grand, fit descendre ces versets : « Ceux qui ne jugent pas selon ce qu’Allah a révélé sont des négateurs de la vérité » (v. 44) ; « Ceux qui ne jugent pas selon ce qu’Allah a révélé sont des injustes » (v. 45) ; « Ceux qui ne jugent pas selon ce qu’Allah a révélé sont des pervers » (v. 47). Tous ces versets ont été révélés à propos des non-croyants",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] keduanya dari [Abu Mu'awiyah], [Yahya] berkata; telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Al Barra` bin 'Azib] dia berkata, \"Suatu ketika seorang Yahudi yang dicat hitam dan didera lewat di hadapan Nabi shallallahu 'alaihi wasallam, kemudian beliau memanggil mereka seraya bersabda: \"Beginikah hukuman zina yang kalian dapati dalam kitab Taurat kalian?\" mereka menjawab, \"Ya benar.\" Lalu beliau memanggil seorang laki-laki yang tergolong dari ulama mereka, beliau bertanya: \"Aku mengharap kamu mau bersumpah dengan nama Allah yang telah menurunkan kitab Taurat kepada Musa, betulkah begini caranya hukuman zina yang kalian dapati dalam kitab tauratmu?\" dia menjawab, \"Tidak, seandainya anda tidak menyumpahku dengan nama Allah, aku tidak akan mengatakan yang sebenarnya kepada anda. Dan yang kami ketahui dalam kitab Taurat, hukumannya adalah rajam, akan tetapi biasanya hukuman itu tidak berlaku bagi pembesar-pembesar kami, jika yang tertangkap itu dari pembesar, maka kami biarkan begitu saja, akan tetapi jika yang tertangkap rakyat kecil maka kami tegakkan hukum sesuai Taurat. Akhirnya kami bermusyawarah, membicarakan hukum yang dapat kami tegakkan bagi pembesar dan rakyat biasa. Lalu kami putuskan untuk membuat hitam tubuh dan mendera pelaku zina sebagai pengganti hukum rajam.\" Setelah laki-laki itu selesai bicara, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, sesungguhnya akulah orang yang pertama-tama menghidupkan kembali sunnah-Mu setelah mereka hapus perintah tersebut.\" Setelah itu, beliau memerintahkan supaya Yahudi yang berzina itu dihukum rajam, lalu Allah 'azza wajalla menurunkan ayat: '(Wahai rasul, janganlah kamu merasa sedih, karena orang-orang yang bersegera menuju kekafiran -hingga firman-Nya- Jika diberikan ini kepadamu, maka terimalah) ' (Qs. Al Maidah: 41). Orang-orang Yahudi berkata, \"Datanglah kalian kepada Muhammad shallallahu 'alaihi wasallam, jika beliau memutuskan hukuman kepadamu dengan menghitamkan tubuh dan didera, maka terimalah, namun jika dia berfatwa kepadamu dengan hukuman rajam, maka waspadalah. Maka Allah Ta'ala menurunkan ayat: '(Barangsiapa tidak berhukum dengan sesuatu yang telah di turunkan Allah, maka mereka itu adalah orang-orang yang kafir. Dan barangsiapa tidak berhukum dengan sesuatu yang telah diturunkan Allah, maka mereka itu adalah orang-orang yang Zhalim. Dan barangsiapa tidak berhukum dengan sesuatu yang telah di turunkan Allah, maka mereka itu adalah orang-orang yang fasik' (Qs. Al Maidah: 44- 47). Hal ini juga berlaku kepada orang-orang kafir semuanya.\" Telah menceritakan kepada kami [Ibnu Numair] dan [Abu Sa'id Al Asyaj] keduanya berkata; telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dengan isnad seperti ini sampai kepada perkataannya, \"Lalu Nabi shallallahu 'alaihi wasallam memerintahkan untuk merajmanya, akhirnya dia pun dirajam.\" Dan tidak menyebutkan sesuatu setelahnya seperti turunnya ayat"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 43
      }
    },
    {
      "hadithNumber": 4441,
      "arabicNumber": "1700.02",
      "book": 29,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ ‏.‏ نَحْوَهُ إِلَى قَوْلِهِ فَأَمَرَ بِهِ النَّبِيُّ صلى الله عليه وسلم فَرُجِمَ ‏.‏ وَلَمْ يَذْكُرْ مَا بَعْدَهُ مِنْ نُزُولِ الآيَةِ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of A'mash up to the words:\" Allah's Apostle (ﷺ) pronounced judgment and he was stoned (to death)\" And he mentioned nothing subsequent to that pertaining to the revelation of verses",
          "ur": "وکیع نے ہمیں حدیث بیان کی ، کہا : ہمیں اعمش نے اسی سند کے ساتھ اس قول تک ، اسی طرح حدیث بیان کی : \" نبی صلی اللہ علیہ وسلم نے حکم دیا تو اسے رجم کر دیا گیا ۔ \" انہوں نے اس کے بعد کا ، آیات کے نازل ہونے والا حصہ بیان نہیں کیا",
          "fr": "Rapporté par A’mash : Ce hadith a été rapporté jusqu’aux mots : « Le Messager d’Allah ﷺ prononça le jugement et il fut lapidé », sans mentionner la révélation des versets ensuite",
          "tr": "{…} Bize İbni Numeyr ile Ebû Saîd El-Eşecc rivayet ettiler. (Dedilerki): Bize Vekî' rivayet etti. (Dediki): Bize A'meş bu isnâdla bu hadisin mislini: -Ve emir vererek yahudi recmolundu.» cümlesine kadar rivayet etti. Ama ondan sonra âyetin inmesi kısmını anmadı. İzah 1702 de"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 44
      }
    },
    {
      "hadithNumber": 4442,
      "arabicNumber": "1701.01",
      "book": 29,
      "hadithInBook": 45,
      "text": {
        "arabic": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ رَجَمَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً مِنْ أَسْلَمَ وَرَجُلاً مِنَ الْيَهُودِ وَامْرَأَتَهُ ‏.‏",
        "translations": {
          "en": "Jabir b. 'Abdullah reported that Allah's Apostle (ﷺ) stoned (to death) a person from Banu Aslam, and a Jew and his wife",
          "ur": "حجاج بن محمد نے ہمیں حدیث بیان کی ، کہا : ابن جریج نے کہا : مجھے ابوزبیر نے خبر دی کہ انہون نے حضرت جابر بن عبداللہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا : نبی صلی اللہ علیہ وسلم نے قبیلہ اسلم کے ایک مرد اور یہود کے ایک مرد اور اس کی ( آشنا ) عورت کو رجم کروایا",
          "fr": "Rapporté par Jabir ibn Abdullah : Le Messager d’Allah ﷺ a lapidé à mort un homme des Banu Aslam, ainsi qu’un Juif et sa femme",
          "id": "Dan telah menceritakan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam pernah merajam seorang laki-laki dan wanita Yahudi yang berzina.\" Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami [Ibnu Juraij] dengan isnad seperti ini, namun dia menyebutkan, \"Dan seorang wanita",
          "tr": "mükerr ancak hem Arapça orjinalde hem türk nüshasında böyle!!! Bana Hârûn b. Abdillâh da rivayet etti. (Dediki): Bize Haccâc b. Muhanmed rivayet etti. (Dediki): İbni Cüreyc şunu söyledi: Bana Ebû'z-Zübeyr haber verdi ki, kendisi Câbir b. Abdillâh'ı şöyle derken işitmiş: — Nebi (Sallallahu Aleyhi ve Sellem) Eslem (kabilesin)'den bir adamla, yahudîlerden bîr erkek ve kadınını recmetti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 4443,
      "arabicNumber": "1701.02",
      "book": 29,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏ غَيْرَ أَنَّهُ قَالَ وَامْرَأَةً ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Juraij with a slight variation of words",
          "ur": "رَوح بن عبادہ نے ابن جریج سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، البتہ انہوں نے ( اور اس کی عورت کے بجائے صرف \" اور عورت \" کہا)",
          "fr": "Rapporté par Juraij : Ce hadith a été transmis avec une légère variation dans les mots",
          "tr": "{…} Bize İshâk b. İbrahim rivayet etti. (Dediki): Bize Ravh b. Ubâde haber verdi. (Dediki): Bize İbni Cüreyc bu isnadla bu hadîsin mislini rivayet etti. Yalnız o: «Bir de kadın» demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 46
      }
    },
    {
      "hadithNumber": 4444,
      "arabicNumber": "1702",
      "book": 29,
      "hadithInBook": 47,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ح. وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ أَبِي، إِسْحَاقَ الشَّيْبَانِيِّ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى هَلْ رَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏ قَالَ قُلْتُ بَعْدَ مَا أُنْزِلَتْ سُورَةُ النُّورِ أَمْ قَبْلَهَا قَالَ لاَ أَدْرِي ‏.‏",
        "translations": {
          "en": "Abu Ishaq Shaibani said:I asked 'Abdullah b. Abu Aufi if Allah's Messenger (ﷺ) awarded (the punishment) of stoning (to death). He said: Yes. I said: After Sura al-Nur was revealed or before that? He said: I do not know",
          "ur": "ابواسحاق شیبانی سے روایت ہے ، انہوں نے کہا : میں نے عبداللہ بن ابی اوفیٰ رضی اللہ عنہ سے پوچھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے رجم کیا؟ انہوں نے کہا : ہاں ۔ کہا : میں نے پوچھا : سورہ نور نازل کیے جانے کے بعد یا اس سے پہلے؟ انہوں نے کہا : میں نہیں جانتا",
          "fr": "Rapporté par Abu Ishaq Shaibani : J’ai demandé à Abdullah ibn Abu Aufa si le Messager d’Allah ﷺ avait appliqué la peine de lapidation. Il répondit : « Oui. » J’ai demandé : « Après la révélation de la sourate an-Nur ou avant ? » Il répondit : « Je ne sais pas. »",
          "id": "Dan telah menceritakan kepada kami [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abdul Wahid] telah menceritakan kepada kami [Sulaiman Asy Syaibani] dia berkata; aku bertanya kepada [Abdullah bin Abu Aufa]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] sedangkan lafadznya dari dia, telah menceritakan kepada kami [Ali bin Mushir] dari [Abu Ishaq Asy Syaibani] dia berkata; aku pernah bertanya kepada [Abdullah bin Abu Aufa], \"Apakah Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan hukuman rajam?\" dia menjawab, \"Ya, benar.\" Aku bertanya, \"Apakah beliau melakukan hal itu setelah turunnya surat An Nuur atau sebelumnya?\" dia menjawab, \"Aku tidak tahu",
          "tr": "Bize Ebû Kâmil El-Cahderî rivayet etti. (Dediki): Bize Abdülvâhtd rivayet etti. (Dediki): Bize Süleyman Eş-Şeybânî rivayet etti. (Dediki): Ben Abdullah b. Ebî Evfa'ya sordum. H. Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. Lâfız onundur. (Dediki): Bize Aliy b. Mtishir, Ebû İshâk Eş-Şeybânî'den rivayet etti. (Demişki): Abdullah b. Ebî Evfa'ya: Resûlullah (Sallallahu Aleyhi ve Sellem) hiç recim yaptı mı? diye sordum. — Evet! cevabım verdi. — Nûr sûresi indirildikten sonra mı, ondan önce mi? dedim. — Bilmiyorum! dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 47
      }
    },
    {
      "hadithNumber": 4445,
      "arabicNumber": "1703.01",
      "book": 29,
      "hadithInBook": 48,
      "text": {
        "arabic": "وَحَدَّثَنِي عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَخْبَرَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا الْحَدَّ وَلاَ يُثَرِّبْ عَلَيْهَا ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا الْحَدَّ وَلاَ يُثَرِّبْ عَلَيْهَا ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَتَبَيَّنَ زِنَاهَا فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that he heard Allah's Messenger (ﷺ) as saying:When the slave-woman of any of you commits adultery and this (offence of hers) becomes clear, she should be flogged (as the prescribed) punishment, but hurl no reproach at her. If she commits adultery again, she should (again be punished) by flogging, but hurl no reproach upon her. If she commits fornication for the third time and it becomes clear, then he should sell her, even if only for a rope of hair",
          "ur": "لیث نے سعید بن ابی سعید سے ، انہوں نے اپنے والد سے خبر دی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے ( ابوہریرہ رضی اللہ عنہ ) یہ کہتے ہوئے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \" جب تم میں سے کسی کی لونڈی زنا کرے اور اس کا زنا ( کسی دلیل سے ) واضح ( ثابت ) ہو جائے تو وہ ( مالک ) اس پر حد لگائے اور اسے ملامت نہ کرتا رہے ، پھر اگر وہ زنا کرے تو اس کو حد لگائے اور اسے ملامت نہ کرتا رہے ، پھر اگر وہ تیسری بار زنا کرے اور اس کا زنا واضھ ہو جائے تو اسے فروخت کر دے ، چاہے بالوں کی ایک رسی ہی کے عوض کیوں نہ بِکے",
          "fr": "Rapporté par Abu Huraira : J’ai entendu le Messager d’Allah ﷺ dire : « Quand la servante de l’un d’entre vous commet l’adultère et que cela est prouvé, elle doit être fouettée, mais ne la blâmez pas. Si elle recommence, elle doit être fouettée à nouveau, mais ne la blâmez pas. Si elle recommet l’adultère une troisième fois et que cela est prouvé, alors vendez-la, même pour une corde de cheveux. »",
          "id": "Dan telah menceritakan kepadaku [Isa bin Hammad Al Mishir] telah mengabarkan kepada kami [Laits] dari [Sa'id bin Abu Abu Sa'id] dari [ayahnya] dari [Abu Hurairah], bahwa dia mendengarnya berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari sahaya perempuan kalian jelas-jelas berzina, maka hukumlah dia dengan hukuman dera, dan jangan sekali-kali kamu memakinya. Kemudian jika dia melakukan zina lagi, maka deralah dia, dan jangan sekali-kali kamu memakinya. Dan jika dia masih melakukan zina pada kali ketiganya, sedangkan tuduhan zina memang terbukti padanya, maka juallah dia walaupun seharga seutas tali rambut.\" Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Ibnu 'Uyainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr Al Bursani] telah mengabarkan kepada kami [Hisyam bin Hasan] keduanya dari [Ayyub bin Musa]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dan [Ibnu Numair] dari [Ubaidullah bin Umar]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Usamah bin Zaid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Hannad bin As Sarri] dan [Abu Kuraib] dan [Ishaq bin Ibrahim] dari ['Abdah bin Sulaiman] dari [Muhammad bin Ishaq] semuanya dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, hanya saja [Ibnu Ishaq] menyebutkan dalam haditsnya ia menyebutkan; dari [Sa'id] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, hendaknya mendera seorang sahaya perempuan sampai tiga kali, jika terbukti berzina, dan menjualnya jika melakukan zina sampai empat kali",
          "tr": "Bana îsâ b. Hammâd El-Mısri rivayet etti. (Dediki): Bize Leys, Saîd b. Ebî Saîd'den, o da babasından, o da Ebû Hureyre'den naklen haber verdi, ki onu şöyle derken işitmiş: Ben Resûlullah (Sallellahu Aleyhi ve Sellem): «Birinizin cariyesi zina eder de zinası sübut bulursa ona (lâyık olan) haddi vursun! Ama (suçunu) başına kakmasın! Sonra yine zina ederse ona (lâyık olan) haddi vursun! Fakat (suçunu) başına kakmasın! Sonra üçüncü defa tekrar zina eder de zinası sübût bulursa artık onu velev kıldan bir ip mukabilinde olsun salıversin!» buyururken işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 48
      }
    },
    {
      "hadithNumber": 4446,
      "arabicNumber": "1703.02",
      "book": 29,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ، كِلاَهُمَا عَنْ أَيُّوبَ بْنِ مُوسَى، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، بْنُ زَيْدٍ ح وَحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ عَنْ عَبْدَةَ بْنِ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، كُلُّ هَؤُلاَءِ عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ أَنَّ ابْنَ إِسْحَاقَ قَالَ فِي حَدِيثِهِ عَنْ سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي جَلْدِ الأَمَةِ إِذَا زَنَتْ ثَلاَثًا ‏ \"‏ ثُمَّ لْيَبِعْهَا فِي الرَّابِعَةِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith his been narrated on the authority of Abu Huraira through another chain of transmitters with a slight variation of words",
          "ur": "ایوب بن موسیٰ ، عبیداللہ بن عمر ، اسامہ بن زید اور محمد بن اسحاق سب نے سعید مقبری سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، البتہ ابن اسحاق نے اپنی حدیث میں کہا : سعید نے اپنے والد سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے لونڈی کو ، جب وہ تین بار زنا کرے ، کوڑے لگانے کی بات روایت کی ، ( آگے فرمایا ) \" پھر چوتھی بار اسے فروخت کر دے",
          "fr": "Rapporté par un autre transmetteur d’Abu Huraira : Ce hadith a été rapporté par une autre chaîne avec une légère variation dans les mots",
          "tr": "Bize Ebû Bekir b, Ebî Şeybe ile İshâk b. İbrahim hep bîrden İbni Uyeyne'den rivayet ettiler. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Muhammed b. Bekr El-Bursânî haber verdi. (Dediki): Bize Hişâm b. Hassan haber verdi. Bunların ikisi de Eyyûb b. Musa'dan rivayet etmişlerdir. H. Bize Ebû Bekir b. Ebî Şeybe dahî rivayet etti. (Dediki): Bize Ebû Usâme ile İbni Numeyr, Ubeydullah b. Ömer'den rivayet ettiler. H. Bana Hârûn b. Saîd El-Eylî de rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Usâme b. Zeyd rivayet etti. H. Bize Hennâd b. Seriy ile Ebû Kureyb ve İshâk b. İbrahim de Abde b. Süleyman'dan, o da Muhammed b. İshâk'dan naklen rivayet ettiler. Bu râvilerin hepsi Said El-Makburî'den, o da Ebû Hureyre'den, o da Peygamber (Sallallahu Aleyhi ve Sellem)'den naklen rivayette bulunmuşlardır. Şu kadar var ki İbni İshâk kendi hadîsinde: «Saîd'den, o da babasından, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen üç defa zina ettiği vakit cariyeye dayak atılması hususun, da: «Sonra dördüncüde onu satsın!» demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 49
      }
    },
    {
      "hadithNumber": 4447,
      "arabicNumber": "1703.03",
      "book": 29,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الأَمَةِ إِذَا زَنَتْ وَلَمْ تُحْصِنْ قَالَ ‏ \"‏ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ بِيعُوهَا وَلَوْ بِضَفِيرٍ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ لاَ أَدْرِي أَبَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏.‏ وَقَالَ الْقَعْنَبِيُّ فِي رِوَايَتِهِ قَالَ ابْنُ شِهَابٍ وَالضَّفِيرُ الْحَبْلُ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported that Allah's Messenger (ﷺ) was asked about the slave-woman who committed adultery and was not protected (married). He said:If she commits adultery, then flog her and if she commits adultery again, then flog her and then sell her even for a rope. Ibn Shihab said: I do not know whether he said this (his statement pertaining to the sale of slave-woman) at the third or the fourth time. Ibn Shihab said that the word dafir (used in the text) means rope",
          "ur": "عبداللہ بن مسلمہ قعنبی نے کہا : ہمیں مالک نے حدیث سنائی ، اور یحییٰ بن یحییٰ نے ۔ ۔ حدیث کے الفاظ انہی کے ہیں ۔ ۔ کہا : میں نے امام مالک کے سامنے قراءت کی ، انہوں نے ابن شہاب سے ، انہوں نے عبیداللہ بن عبداللہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم سے لونڈی کے بارے میں پوچھا گیا ، جب وہ زنا کرے اور شادی شدہ نہ ہو ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اگر وہ زنا کرے تو اسے کوڑے لگاؤ ، پھر اگر زنا کرے تو اسے کوڑے لگاؤ ، پھر اسے فروخت کر دو ، چاہے ایک گندھی ہوئی رسی کے عوض کیوں نہ ہو ۔ \"\" ابن شہاب نے کہا : میں نہیں جانتا یہ ( بیچتے کا حکم ) تیسری بار کے بعد ہے یا چوتھی بار کے بعد ۔ قعنبی نے اپنی روایت میں کہا : ابن شہاب نے کہا : اور ضفیر سے مراد رسی ہے",
          "fr": "Rapporté par Abu Huraira : On interrogea le Messager d’Allah ﷺ au sujet d’une servante qui avait commis l’adultère et n’était pas mariée. Il dit : « Si elle commet l’adultère, fouettez-la. Si elle recommence, fouettez-la, puis vendez-la, même pour une corde. » Ibn Shihab dit : « Je ne sais pas s’il a parlé de la vente à la troisième ou à la quatrième fois. » Ibn Shihab précisa que le mot “dafir” signifie corde",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] telah menceritakan kepada kami [Malik]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Yahya] sedangkan lafadz darinya, dia berkata; aku bacakan di hadapan [Malik]; dari [Ibnu Syihab] dari [Ubaidullah bin Abdullah] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang sahaya perempuan yang berzina, sedangkan dia belum menikah. Beliau bersabda: \"Jika dia berzina maka deralah dia, kemudian jika dia berzina maka deralah dia, kemudian jika dia berzina deralah dia, kemudian juallah dia walaupun seharga seutas tali rambut.\" [Ibnu Syihab] berkata, \"Aku tidak tahu, apakah setelah tiga kali (berzina) ataukah sampai empat kali.\" Sedangkan dalam riwayatnya Al Qa'nabi menyebutkan, \"Ibnu Syihab mengatakan, \"Maksud Dlafir adalah seutas tali.\" Dan telah menceritakan kepada kami [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] dia berkata; aku pernah mendengar [Malik] berkata; telah menceritakan kepadaku [Ibnu Syihab] dari [Ubaidullah bin Abdullah bin 'Utbah] dari [Abu Hurairah] dan [Zaid bin Khalid Al Juhani], bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai sahaya perempuan yang berzina seperti hadits keduanya, dan tidak menyebutkan perkataannya Ibnu Syihab 'maksud Dlafir adalah seutas tali'.\" Telah menceritakan kepadaku ['Amru An Naqid] telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepadaku [ayahku] dari [Shalih]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] keduanya dari [Az Zuhri] dari ['Ubaidullah] dari [Abu Hurairah] dan [Zaid bin Khalid Al Juhani] dari Nabi shallallahu 'alaihi wasallam seperti hadits riwayat Malik, ternyata riwayat mereka semua juga terdapat keraguan supaya menjualnya, apakah dikali ke tiga atau ke empat",
          "tr": "Bize Abdullah b. Meslemete'l-Ka'nebî rivayet etti. (Dediki): Bize Mâlik rivayet etti. H. Bize Yahya b. Yahya da rivayet etti. Lâfız onundur. (Dediki): Mâlik'e, İbni Şihâb'dan dinlediğim, onun da Ubeydullah b. Abdillâh'dan, onun da Ebû Hureyre'den naklettiği şu hadîsi okudum: Resûlullah (Sallallahu Aleyhi ve Sellem)'e muhsan olmayan câriye zina ederse hükmü ne olacağı sorulmuş. «Zina ederse ona dayak vurun! Sonra yine zina ederse dayak vurun! Sonra tekrar zina ederse dayak vurun! Sonra onu velev bir dafİr mukabilinde olsun satın!» buyurmuşlar. İbnî Şihâb: «Üçüncüden sonra mı, dördüncüden sonra mı bilmiyorum.» demiş. Ka'nebî kendi rivayetinde şöyle demiştir: «İbni Şihâb: Dafır iptir, dedi.» İzah 1704 te"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 50
      }
    },
    {
      "hadithNumber": 4448,
      "arabicNumber": "1704.01",
      "book": 29,
      "hadithInBook": 51,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ مَالِكًا، يَقُولُ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الأَمَةِ ‏.‏ بِمِثْلِ حَدِيثِهِمَا وَلَمْ يَذْكُرْ قَوْلَ ابْنِ شِهَابٍ وَالضَّفِيرُ الْحَبْلُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Abu Huraira and Zaid b. Khalid al-Jubani, but in this no merition is made of the words of Ibn Shihab that dafir means rope",
          "ur": "ابن وہب نے کہا : میں نے امام مالک سے سنا ، وہ کہہ رہے تھے : مجھے ابن شہاب نے عبیداللہ بن عبداللہ بن عتبہ سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ اور زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم سے لونڈی کے بارے میں پوچھا گیا ۔ ۔ جس طرح ان دونوں کی حدیث ہے ۔ ۔ اور انہوں نے ابن شہاب کے قول : \" ضفیر سے مراد رسی ہے \" کا تذکرہ نہیں کیا",
          "fr": "Rapporté par Abu Huraira et Zaid ibn Khalid al-Jubani : Ce hadith a été rapporté, mais sans mention de la parole d’Ibn Shihab selon laquelle “dafir” signifie corde",
          "tr": "Bize Ebû't-Tâhir de rivayet etti. (Dediki): Bize İbni Vehb haber verdi. (Dediki): Mâlik'i şunları söylerken işittim: Bana İbni Şihâb, Ubeydullah b. Abdillâh b. Utbe'den, o da Ebû Hureyre ile Zeyd b. Hâlid El-Cüheni'den naklen rivayet etti ki, Resûlullah (Sallallahu Aleyhi ve Sellem)'e cariyenin hükmü sorulmuş... Râvi yukarıki iki râvinin hadîsi (1703) gibi rivayette bulunmuş; fakat İbni Şihâb'ın : «Dafîr iptir.» sözünü anmamıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 51
      }
    },
    {
      "hadithNumber": 4449,
      "arabicNumber": "1704.02",
      "book": 29,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ، اللَّهِ عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِ حَدِيثِ مَالِكٍ وَالشَّكُّ فِي حَدِيثِهِمَا جَمِيعًا فِي بَيْعِهَا فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏.‏",
        "translations": {
          "en": "This hadith has been transmitted on the authority of Abu Huraira and Zaid b. Khalid al-Juhani in the same way as transmitted by Malik with this (difference) tnat there is a doubt whether her sale (that of the slave-girl committing adultery) was mentioned after the third or the fourth time",
          "ur": "صالح اور معمر دونوں ن زہری سے ، انہوں نے عبیداللہ سے ، انہوں نے حضرت ابوہریرہ اور حضرت خالد بن جہنی رضی اللہ عنہما سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، جس طرح امام مالک کی حدیث ہے ۔ اور اس کی بیع تیسری بار ہے یا چوتھی بار ، اس میں شک دونوں کی حدیث میں ہے",
          "fr": "Rapporté par Abu Huraira et Zaid ibn Khalid al-Juhani : Ce hadith a été transmis de la même façon que par Malik, avec un doute sur le fait que la vente de la servante ait été mentionnée après la troisième ou la quatrième fois",
          "tr": "{…} Bana Amru'h-Nâkıd rivayet etti. (Dediki): Bize Ya'kûb b. İbrahim b. Sa'd rivayet etti. (Dediki): Bana babam, Salih'den rivayet etti. H. Bize Abd b. Humeyd de rivayet etti. (Dediki): Bize Abdurrazzâk haber verdi. (Dediki): Bize Ma'mer haber verdi. Bu râvilerin ikisi de Zührî'den, o da Ubeydullah'dan, o da Ebû Hureyre ile Zeyd b. Hâlid El-Cühenî'den, onlar da Nebi (Sallallahu Aleyhi ve Sellem)'den Mâlik'in hadîsi gibi rivayette bulunmuşlardır. Her ikisinin hadisinde şek, cariyenin üçüncüde mi yoksa dördüncüde mi satılacağı hususundadır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 52
      }
    },
    {
      "hadithNumber": 4450,
      "arabicNumber": "1705.01",
      "book": 29,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا سُلَيْمَانُ أَبُو دَاوُدَ، حَدَّثَنَا زَائِدَةُ، عَنِ السُّدِّيِّ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، قَالَ خَطَبَ عَلِيٌّ فَقَالَ يَا أَيُّهَا النَّاسُ أَقِيمُوا عَلَى أَرِقَّائِكُمُ الْحَدَّ مَنْ أَحْصَنَ مِنْهُمْ وَمَنْ لَمْ يُحْصِنْ فَإِنَّ أَمَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم زَنَتْ فَأَمَرَنِي أَنْ أَجْلِدَهَا فَإِذَا هِيَ حَدِيثُ عَهْدٍ بِنِفَاسٍ فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَحْسَنْتَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abd al-Rahman reported that 'Ali, while delivering the address said:O people, impose the prescribed punishment upon your slaves, those who are married and those not married, for a slave-woman belonging to Allah's Messenger (ﷺ) had committed adultery, and he committed me to flog her. But she had recently given birth to a child and I was afraid that if I flogged her I might kill her. So I mentioned that to Allah's Apostle (ﷺ) and he said: You have done well",
          "ur": "زائدہ نے سُدی سے ، انہوں نے سعد بن عبیدہ سے اور انہوں نے ابوعبدالرحمان سے روایت کی ، انہوں نے کہا : حضرت علی کرم اللہ وجہہ نے خطبہ دیا اور کہا : اے لوگو! اپنے غلاموں پر حد نافذ کرو ، جو ان میں سے شادی شدہ ہوں اور جو شادی شدہ نہ ہوں ، رسول اللہ صلی اللہ علیہ وسلم ( کے خاندان ) کی ایک لونڈی نے زنا کیا تو آپ نے مجھے حکم دیا کہ اسے کوڑے لگاؤں ، تو اچانک پتہ چلا کہ اسے نفاس ( بچے کی ولادت سے خون آنے ) کی حالت میں تھوڑا ہی عرصہ گزرا تھا ۔ مجھے ڈر محسوس ہوا کہ اگر میں نے اسے کوڑے مارے تو میں اسے مار ڈالوں گا ، چنانچہ میں نے نبی صلی اللہ علیہ وسلم سے یہ بات عرض کی ، تو آپ نے فرمایا : \" تم نے اچھا کیا",
          "fr": "Rapporté par Abd al-Rahman : Ali رضي الله عنه, alors qu’il faisait un sermon, dit : « Ô gens, appliquez la peine légale à vos esclaves, qu’ils soient mariés ou non, car une servante du Messager d’Allah ﷺ a commis l’adultère et il m’a chargé de la fouetter. Mais elle venait d’accoucher et j’ai eu peur que si je la fouettais, elle ne meure. J’en ai parlé au Messager d’Allah ﷺ et il m’a dit : “Tu as bien fait.” »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abu Bakar Al Muqaddami] telah menceritakan kepada kami [Sulaiman Abu Daud] telah menceritakan kepada kami [Zaidah] dari [As Suddi] dari [Sa'd bin Ubaidah] dari [Abu Abdurrahman] dia berkata, \" [Ali] pernah berkata dalam khutbahnya; \"Wahai sekalian manusia, tegakkanlah hukum kepada sahaya kalian, baik yang sudah menikah atau yang belum menikah, sesungguhnya hal ini pernah dialami oleh sahaya perempuan Rasulullah shallallahu 'alaihi wasallam yang berzina, beliau menyuruhku untuk menderanya. Dia (wanita itu) baru saja melahirkan, maka aku khawatir jika menderanya maka ia akan meninggal. Lantas kuberitahukan hal itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Kamu telah berbuat baik (menangguhkan pelaksana had sampai waktu yang sesuai).\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Israil] dari [As Suddi] dengan isnad ini, namun dihaditsnya tidak disebutkan, \"Baik yang sudah menikah ataupun belum.\" Dan dalam haditsnya juga disebutkan, \"Tangguhkanlah sampai waktunya sesuai",
          "tr": "Bize Muhammed b. Ebi Bekir El-Mukaddemi rivayet etti. (Dediki): Bize Süleyman Ebû Dâvûd rivayet etti. (Dediki): Bize Zaide, Süddî'den, o da Sa'd b. Ubeyde'den, o da Ebû Abdirrahmân'dan naklen rivayet etti. (Demişki): Ali hutbe okuyarak şunları söyledi: Ey nâs! Memlüklerinize, muhsan olsunlar olmasınlar, haddi tatbik edin! Zîra Resulullah (Sallallahu Aleyhi ve Sellem)'in bir cariyesi zina etti de, ona dayak vurmamı bana emretti. Bir de baktık yeni nifâs olmuş. Ben ona dayak vurursam öldürürüm dîye korktum; ve keyfiyeti Peygamber (Sallallahu Aleyhi ve Sellem)'e andım. Bunun üzerine: «İyi ettin!» buyurdular"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 53
      }
    },
    {
      "hadithNumber": 4451,
      "arabicNumber": "1705.02",
      "book": 29,
      "hadithInBook": 54,
      "text": {
        "arabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِسْرَائِيلُ، عَنِ السُّدِّيِّ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ مَنْ أَحْصَنَ مِنْهُمْ وَمَنْ لَمْ يُحْصِنْ ‏.‏ وَزَادَ فِي الْحَدِيثِ ‏ \"‏ اتْرُكْهَا حَتَّى تَمَاثَلَ ‏\"‏ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of as-Suddi with the same chain of trznsmitters, but he did not mention:\" Those who are married and those who are not married.\" There is also an addition in it:\" I spare her until she is all right",
          "ur": "اسرائیل نے سُدی سے اسی سند کے ساتھ حدیث بیان کی اور انہوں نے یہ بیان کیا : \" جو ان میں سے شادی شدہ ہوں اور جو شادی شدہ نہ ہوں ۔ \" اور انہوں نے حدیث میں یہ اضافہ کیا : \" اس ( کنیز ) کو چھوڑ دو یہاں تک کہ وہ صحت مند ہو جائے",
          "fr": "Rapporté par as-Suddi : Ce hadith a été rapporté par la même chaîne, mais il n’a pas mentionné : « Ceux qui sont mariés et ceux qui ne le sont pas. » Il y a aussi un ajout : « Je l’ai épargnée jusqu’à ce qu’elle aille mieux. »",
          "tr": "{…} Bu hadîsi bize İshâk b. İbrahim de rivayet etti. (Dediki): Bize Yahya b. Âdem haber verdi. (Dediki): Bize İsrail, Süddî'den bu isnâd-la rivayet etti. Yalnız «Memlüklerden muhsan olanı da olmayanı da» cümlesini zikretmedi. O hadîste: «İyileşinceye kadar onu bırak!» cümlesini ziyade etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 4452,
      "arabicNumber": "1706.01",
      "book": 29,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَجَلَدَهُ بِجَرِيدَتَيْنِ نَحْوَ أَرْبَعِينَ ‏.‏ قَالَ وَفَعَلَهُ أَبُو بَكْرٍ فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ فَقَالَ عَبْدُ الرَّحْمَنِ أَخَفَّ الْحُدُودِ ثَمَانِينَ ‏.‏ فَأَمَرَ بِهِ عُمَرُ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that a person who had drink wine was brought to Allah's Apostle (ﷺ). He gave him forty stripes with two lashes. Abu Bakr also did that, but when Umar (assumed the responsibilities) of the Caliphate, he consulted people and Abd al-Rahman said:The mildest punishment (for drinking) is eighty (stripes) and 'Umar their prescribed this punishment",
          "ur": "محمد بن جعفر نے ہمیں حدیث سنائی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، انہوں نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ نبی صلی اللہ علیہ وسلم کے پاس ایک آدمی کو لایا گیا جس نے شراب پی تھی ، تو آپ نے اسے کھجور کی دو ٹہنیوں سے تقریبا چالیس ضربیں لگائیں ۔ کہا : حضرت ابوبکر رضی اللہ عنہ نے بھی ایسا ہی کیا ، جب حضرت عمر رضی اللہ عنہ کا زمانہ آیا ، انہوں نے لوگوں سے مشورہ لیا تو حضرت عبدالرحمٰن رضی اللہ عنہ نے کہا : حدود میں سب سے ہلکی حد اسی کوڑے ہے ، چنانچہ حضرت عمر رضی اللہ عنہ نے اسی کا حکم صادر کر دیا",
          "fr": "Rapporté par Anas ibn Malik : Un homme qui avait bu du vin fut amené au Messager d’Allah ﷺ. Il lui donna quarante coups avec deux fouets. Abu Bakr fit de même, mais quand Omar devint calife, il consulta les gens et Abd al-Rahman dit : « La peine la plus légère pour la boisson est de quatre-vingts coups. » Omar prescrivit alors cette peine",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; aku pernah mendengar [Qatadah] menceritakan dari [Anas bin Malik], bahwa Nabi shallallahu 'alaihi wasallam pernah dihadapkan seorang laki-laki yang terbukti meminum khamer, lalu beliau menderanya dengan dua pelepah kurma sebanyak empat puluh kali, hal itu juga dilakukan oleh Abu Bakar. Ketika pada masa pemerintahan Umar, maka ia minta pendapat kepada orang-orang. Abdurrahman berkata, \"Hukuman dera yang paling ringan adalah delapan puluh kali.\" Lantas Umar memutuskannya seperti itu.\" Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi] telah menceritakan kepada kami [Khalid] -yaitu Ibnu Harits- telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Qatadah] dia berkata; aku pernah mendengar [Anas] berkata, \"Suatu ketika, seorang laki-laki dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam …lalu dia menyebutkan hadits semisalnya",
          "tr": "Bize Muhammed b. El-Müsennâ ile Muhammed b. Beşşâr rivayet ettiler. (Dedilerki): Bize Muhammed b. Ca'fer rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Katâde'yi, Enes b. Mâlik'-den naklen rivayet ederken dinledim ki, Nebi (Sallallahu Aleyhi ve Sellem)'e şarap içmiş bir adam getirmişler de ona iki hurma dalı ile kırk kadar dayak vur (dur) muş. Enes: — Bunu Ebû Bekir de yaptı. Ömer halife olunca insanlarla istişare etti de Abdurrahmân : — Hududun en hafifini seksen (değnek)'i vur! dedi. Bunun üzerine Ömer de onu emretti; demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 4453,
      "arabicNumber": "1706.02",
      "book": 29,
      "hadithInBook": 56,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَجُلٍ ‏.‏ فَذَكَرَ نَحْوَهُ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Anas through another chain of transmitters",
          "ur": "خالد بن حارث نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انہوں نے کہا : ہمیں قتادہ نے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی لایا گیا ۔ ۔ ۔ پھر اسی طرح بیان کیا",
          "fr": "Rapporté par un autre transmetteur d’Anas : Ce hadith a été rapporté par une autre chaîne",
          "tr": "{…} Bize Yahya b. Habîb El-Hârisî de rivayet etti. (Dediki): Bize Hâlid (yâni İbni'l-Hâris) rivayet etti. (Dediki): Bize Şu'be rivayet etti. (Dediki): Bize Katâde rivayet etti. (Dedik): Enes'i: — Resûlullah (Sallallahu Aleyhi ve Sellem)'e bir adam getirdiler... derken işittim. Râvi hadisi yukanki gibi zikretmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 56
      }
    },
    {
      "hadithNumber": 4454,
      "arabicNumber": "1706.03",
      "book": 29,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسِ، بْنِ مَالِكٍ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم جَلَدَ فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ ثُمَّ جَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ ‏.‏ فَلَمَّا كَانَ عُمَرُ وَدَنَا النَّاسُ مِنَ الرِّيفِ وَالْقُرَى قَالَ مَا تَرَوْنَ فِي جَلْدِ الْخَمْرِ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَرَى أَنْ تَجْعَلَهَا كَأَخَفِّ الْحُدُودِ ‏.‏ قَالَ فَجَلَدَ عُمَرُ ثَمَانِينَ ‏.‏",
        "translations": {
          "en": "Anas b. Malik reported that Allah's Apostle (ﷺ) gave a beating with palm branches and shoes, and that Abu Bakr gave forty lashes. When Umar (became the Commander of the Faithful) and the people went near to pastures and towns, he said (to the Companions of the Holy Prophet). What is your opinion about lashing for drinking? Thereupon Abd al-Rahman b. Auf said:My opinion is that you fix it as the mildest punishment. Then 'Umar inflicted eighty stripes",
          "ur": "معاذ بن ہشام نے کہا : مجھے میرے والد نے قتادہ سے حدیث بیان کی ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے شراب میں کھجور کی ٹہنی اور جوتوں سے مارا ۔ پھر حضرت ابوبکر رضی اللہ عنہ نے چالیس ( کوڑے ) مارے ، جب حضرت عمر رضی اللہ عنہ کا دور آیا اور لوگ سرسبز و شاداب مقامات اور بستیوں کے قریب جا بسے تو انہوں نے ( مشورہ کرتے ہوئے ) پوچھا : شراب کی سزا کے بارے میں تمہاری کیا رائے ہے؟ تو حضرت عبدالرحمان بن عوف رضی اللہ عنہ نے کہا : میری رائے ہے کہ آپ اسے سب سے ہلکی حد کے برابر مقرر کر دیں ۔ کہا : اس کے بعد حضرت عمر رضی اللہ عنہ نے اسی کوڑے مارے",
          "fr": "Rapporté par Anas ibn Malik : Le Messager d’Allah ﷺ a frappé avec des branches de palmier et des sandales, et Abu Bakr a donné quarante coups. Quand Omar devint Commandeur des croyants et que les gens s’étaient rapprochés des pâturages et des villes, il demanda aux Compagnons du Prophète ﷺ : « Quel est votre avis sur la flagellation pour la boisson ? » Abd al-Rahman ibn Awf répondit : « Mon avis est que tu fixes la peine la plus légère. » Omar infligea alors quatre-vingts coups",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Anas bin Malik], bahwa Nabi Allah shallallahu 'alaihi wasallam pernah mendera terhadap orang yang meminum khamer dengan pelepah kurma dan terompah (sebanyak empat puluh kali), kemudian (masa pemerintahan) Abu Bakar juga menderanya sebanyak empat puluh kali. Ketika pemerintahannya Umar, maka orang-orang semakin banyak yang tinggal di daerah pelosok-pelosok dan di daerah pedesaan. Karena itu Umar bertanya, \"Bagaimana pendapat kalian mengenai hukuman dera bagi peminum khamer?\" maka Abdurrahman bin Auf berkata, \"Aku berpendapat bahwa seringan-ringannya hukuman adalah delapan puluh kali dera.\" Anas berkata, \"Lantas Umar melaksanakan hukuman dera sebanyak empat puluh kali.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Hisyam] dengan isnad seperti ini.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Hisyam] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah mendera peminum khamer dengan menggunakan terompah dan pelepah kurma sebanyak empat puluh kali. Kemudian dia menyebutkan seperti hadits keduanya, dan dia tidak menyebutkan, \"Daerah pelosok-pelosok dan daerah pedesaan",
          "tr": "Bize Muhammed b. EI-Müsennâ rivayet etti. (Dediki): Bize Muâz b. Hişâm rivayet etti. (Dediki): Bana babam, Katâde'den, o da Enes b. Mâlik'den naklen rivayet etti ki, Nebiyyullah (Sallallahu Aleyhi ve Sellem) şarap hakkında hurma dalları ve ayakkaplan ile had vurmuş. Sonra Ebû Bekir 40 değnek hadd vurmuş. Ömer halîfe olup insanlar verimli yerlere ve köylere sarkınca: — Şarabın haddi hususunda ne diyorsunuz? diye sormuş. Abdurrahmân b. Avf: — Onu cezaların en hafifi gibi yapman fikrindeyim; demiş. Enes: Ömer de 80 değnek hadd vurdu; demiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 4455,
      "arabicNumber": "1706.04",
      "book": 29,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ",
        "translations": {
          "en": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters",
          "ur": "یحییٰ بن سعید نے ہشام سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Rapporté par Hisham : Ce hadith a été rapporté par la même chaîne de transmetteurs",
          "tr": "{…} Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Yahya b. Saîd rivayet etti. (Dediki): Bize Hişâm bu isnâdla bu hadisin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 58
      }
    },
    {
      "hadithNumber": 4456,
      "arabicNumber": "1706.05",
      "book": 29,
      "hadithInBook": 59,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّوسلم كَانَ يَضْرِبُ فِي الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ أَرْبَعِينَ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمَا وَلَمْ يَذْكُرِ الرِّيفَ وَالْقُرَى ‏.‏",
        "translations": {
          "en": "Anas reported that Allah's Apostle (ﷺ) used to strike forty times with shoes and palm branches (in case of drinking of) wine. The rest of the hadith is the same and there is no mention of pastures and towns",
          "ur": "انس ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌جناب ‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌شراب ‌میں ‌چالیس ‌مار ‌مارتے ‌تھے ‌ٹہنیوں ‌سے ‌اور ‌جوتوں ‌سے ‌اخیر ‌تك ‌",
          "fr": "Rapporté par Anas : Le Messager d’Allah ﷺ frappait quarante fois avec des sandales et des branches de palmier (pour la consommation de vin). Le reste du hadith est identique, sans mention des pâturages et des villes",
          "tr": "Bize Ebû Bekir b. Ebî Şeybe de rivayet etti. (Dediki): Bize Vckî' Hişâm'dan, o da Katâde'den, o da Enes'den naklen rivayet etti ki, Nebi (Sallallahu Aleyhi ve Sellem) şarap için ayak kapları ve hurma dalları ile 40 değnek (hadd) vururmuş... Bundan sonra râvi yukarıdakilerin hadisi gibi rivayette bulunmuş yalnız «verimli yerlerle köylere» cümlesini anmamıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 59
      }
    },
    {
      "hadithNumber": 4457,
      "arabicNumber": "1707.01",
      "book": 29,
      "hadithInBook": 60,
      "text": {
        "arabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ عَبْدِ اللَّهِ الدَّانَاجِ، ح وَحَدَّثَنَا إِسْحَاقُ، بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ فَيْرُوزَ، مَوْلَى ابْنِ عَامِرٍ الدَّانَاجِ حَدَّثَنَا حُضَيْنُ بْنُ الْمُنْذِرِ أَبُو سَاسَانَ، قَالَ شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِيَ بِالْوَلِيدِ قَدْ صَلَّى الصُّبْحَ رَكْعَتَيْنِ ثُمَّ قَالَ أَزِيدُكُمْ فَشَهِدَ عَلَيْهِ رَجُلاَنِ أَحَدُهُمَا حُمْرَانُ أَنَّهُ شَرِبَ الْخَمْرَ وَشَهِدَ آخَرُ أَنَّهُ رَآهُ يَتَقَيَّأُ فَقَالَ عُثْمَانُ إِنَّهُ لَمْ يَتَقَيَّأْ حَتَّى شَرِبَهَا فَقَالَ يَا عَلِيُّ قُمْ فَاجْلِدْهُ ‏.‏ فَقَالَ عَلِيٌّ قُمْ يَا حَسَنُ فَاجْلِدْهُ ‏.‏ فَقَالَ الْحَسَنُ وَلِّ حَارَّهَا مَنْ تَوَلَّى قَارَّهَا - فَكَأَنَّهُ وَجَدَ عَلَيْهِ - فَقَالَ يَا عَبْدَ اللَّهِ بْنَ جَعْفَرٍ قُمْ فَاجْلِدْهُ ‏.‏ فَجَلَدَهُ وَعَلِيٌّ يَعُدُّ حَتَّى بَلَغَ أَرْبَعِينَ فَقَالَ أَمْسِكْ ‏.‏ ثُمَّ قَالَ جَلَدَ النَّبِيُّ صلى الله عليه وسلم أَرْبَعِينَ وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ وَعُمَرُ ثَمَانِينَ وَكُلٌّ سُنَّةٌ وَهَذَا أَحَبُّ إِلَىَّ ‏.‏ زَادَ عَلِيُّ بْنُ حُجْرٍ فِي رِوَايَتِهِ قَالَ إِسْمَاعِيلُ وَقَدْ سَمِعْتُ حَدِيثَ الدَّانَاجِ مِنْهُ فَلَمْ أَحْفَظْهُ ‏.‏",
        "translations": {
          "en": "Hudain b. al-Mundhir Abu Sasan reported:I saw that Walid was brought to Uthmin b. 'Affan as he had prayed two rak'ahs of the dawn prayer, and then he said: I make an increase for you. And two men bore witness against him. One of them was Humran who said that he had drunk wine. The second one gave witness that he had seen him vomiting. Uthman said: He would not have vomited (wine) unless he had drunk it. He said: 'Ali, stand up and lash him. 'Ali said: Hasan, stand up and lash him. Thereupon Hasan said: Let him suffer the heat (of Caliphate) who has enjoyed its coolness. ('Ali felt annoyed at this remark) and he said: 'Abdullah b. Ja'far, stand up and flog him, and he began to flog him and 'Ali counted the stripes until these were forty. He (Hadrat 'Ali) said: Stop now, and then said: Allah's Apostle (ﷺ) gave forty stripes, and Abu Bakr also gave forty stripes, and Umar gave eighty stripes, and all these fall under the category of the Sunnab, but this one (forty stripes) is dearer to me",
          "ur": "ابوبکر بن ابی شیبہ ، زہیر بن حرب اور علی بن حجر سب نے کہا : ہمیں اسماعیل بن علیہ نے ابن ابی عروبہ سے حدیث بیان کی ، انہوں نے عبداللہ داناج ( فارسی کے لفظ دانا کو عرب اسی طرح پڑھتے تھے ) سے روایت کی ، نیز اسحاق بن ابراہیم حنظلی نے ۔ ۔ الفاظ انہی کے ہیں ۔ ۔ کہا : ہمیں یحییٰ بن حماد نے خبر دی ، کہا : ہمیں عبدالعزیز بن مختار نے حدیث بیان کی ، کہا : ہمیں ان عامر داناج کے مولیٰ عبداللہ بن فیروز نے حدیث بیان کی : ہمیں ابو ساسان حُضین بن منذر نے حدیث بیان کی ، انہوں نے کہا : میں حضرت عثمان بن عفان رضی اللہ عنہ کے پاس حاضر ہوا ، ان کے پاس ولید ( بن عقبہ بن ابی معیط ) کو لایا گیا ، اس نے صبح کی دو رکعتیں پڑھائیں ، پھر کہا : کیا تمہیں اور ( نماز ) پڑھاؤں؟ تو دو آدمیوں نے اس کے خلاف گواہی دی ۔ ان میں سے ایک حمران تھا ( اس نے کہا ) کہ اس نے شراب پی ہے اور دوسرے نے گواہی دی کہ اس نے اسے ( شراب کی ) قے کرتے ہوئے دیکھا ہے ۔ اس پر حضرت عثمان رضی اللہ عنہ نے کہا : اس نے شراب پی ہے تو ( اس کی ) قے کی ہے ۔ اور کہا : علی! اٹھو اور اسے کوڑے مارو ۔ تو حضرت علی رضی اللہ عنہ نے کہا : حسن! اٹھیں اور اسے کوڑے ماریں ۔ حضرت حسن رضی اللہ عنہ نے کہا : اس ( خلافت ) کی ناگوار باتیں بھی انہی کے سپرد کیجیے جن کے سپرد اس کی خوش گوار ہیں ۔ تو ایسے لگا کہ انہیں ناگوار محسوس ہوا ہے ، تب انہوں نے کہا : عبداللہ بن جعفر! اٹھو اور اسے کوڑے مارو ۔ تو انہوں نے اسے کوڑے لگائے اور حضرت علی رضی اللہ عنہ شمار کرتے رہے حتی کہ وہ چالیس تک پہنچے تو کہا : رک جاؤ ۔ پھر کہا : نبی صلی اللہ علیہ وسلم نے چالیس کوڑے لگوائے ، ابوبکر رضی اللہ عنہ نے چالیس لگوائے اور عمر رضی اللہ عنہ نے اسی ( کوڑے ) لگوائے ، یہ سب سنت ہیں اور یہ ( چالیس کوڑے لگانا ) مجھے زیادہ پسند ہے ۔ علی بن حجر نے اپنی روایت میں اضافہ کیا : اسماعیل نے کہا : میں نے داناج کی حدیث ان سے سنی تھی لیکن اسے یاد نہ رکھ سکا",
          "fr": "Rapporté par Hudain ibn al-Mundhir Abu Sasan : J’ai vu qu’on avait amené Walid devant Uthman ibn Affan parce qu’il avait prié deux unités de la prière de l’aube, puis il dit : « Je vous en donne plus. » Deux hommes témoignèrent contre lui. L’un d’eux, Humran, dit qu’il l’avait vu boire du vin. Le second témoigna l’avoir vu vomir. Uthman dit : « Il n’aurait pas vomi (du vin) s’il ne l’avait pas bu. » Il dit : « Ali, lève-toi et fouette-le. » Ali dit : « Hasan, lève-toi et fouette-le. » Hasan répondit : « Que celui qui profite de la fraîcheur (du califat) en supporte la chaleur. » (Ali fut contrarié par cette remarque) et dit : « Abdullah ibn Ja’far, lève-toi et fouette-le. » Il se mit à le fouetter et Ali compta les coups jusqu’à quarante. Il dit alors : « Arrête maintenant. » Puis il ajouta : « Le Messager d’Allah ﷺ donnait quarante coups, Abu Bakr aussi, et Omar en donnait quatre-vingts. Tout cela relève de la Sunna, mais quarante coups me plaisent davantage. »",
          "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Ali bin Hujr] mereka berkata; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu Ulayyah- dari [Ibnu Abu 'Arubah] dari [Abdullah Ad Danaj]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] sedangkan lafadznya dari dia, telah mengabarkan kepada kami [Yahya bin Hammad] telah menceritakan kepada kami [Abdul Aziz bin Mukhtar] telah menceritakan kepada kami [Abdullah bin Fairuz] bekas budak Ibnu 'Amir Ad Dannaj, telah menceritakan kepada kami [Hudlain bin Mundzir Abu Sasan] dia berkata, \"Aku pernah melihat Al Walid dihadapkan kepada 'Utsman bin Affan, setelah melaksanakan shalat subuh dua rakaat, Utsman lalu berkata, \"Apakah aku boleh menambahkan untuk kalian? Ada dua orang laki-laki yang menjadi saksi atas perbuatannya, salah seorang di antaranya adalah Humran, dia menyaksikan sendiri bagaimana dia meminum khamer, sedangkan yang lainnya bersaksi bahwa dia pernah melihat Al Walid sedang muntah-muntah (setelah meminum khamer).\" Lalu Utsman berkata, \"Dia tidak akan muntah kecuali ia minum khamer.\" Setelah itu, Utsman berkata kepada Ali, \"Wahai Ali, bangun dan deralah Al Walid.\" [Ali] pun berkata kepada Hasan, \"Wahai Hasan, bangun dan deralah Al Walid.\" Kemudian Hasan pun berkata, \"Sebaiknya kita serahkan saja pelaksanaan hukuman dera ini kepada khalifah Utsman dan para aparatnya.\" Akhirnya dia berkata kepada Abdullah bin Ja'far, \"Wahai Abdullah, bangun dan laksanakanlah hukuman dera kepada Al Walid.\" Setelah itu Abdullah bin Ja'far menderanya sedangkan Ali yang menghitungnya, ketika deraan telah sampai pada hitungan ke empat puluh, Ali berseru, \"Berhentilah.\" Lalu dia berkata, \"Dahulu Rasulullah shallallahu 'alaihi wasallam pernah mendera peminum khamer sebanyak empat puluh kali, Abu Bakar juga pernah melakukan hal yang sama, sementara Umar bin Khattab pernah melaksanakan hukuman dera sebanyak delapan puluh kali. Sebenarnya semua itu adalah sunnah (pernah dilakukan), dan itulah yang lebih aku sukai.\" [Ali bin Hujr] menambahkan dalam riwayatnya, \" [Isma'il] berkata, \"Sungguh aku pernah mendengar hadits Ad Dannaj darinya, namun aku tidak begitu menghafalnya",
          "tr": "Bize, Ebû Bekir b. Ebî Şeybe ile Züheyr b. Harb ve Aliy b. Hucr rivayet ettiler. (Dedilerki): Bize İsmail (yâni İbni Uleyye), İbni Ebî Arûbe'den, o da Abdullah Ed-Dânâc'dan naklen rivayet etti. H. Bize İshâk b. İbrahim El-Hanzali de rivayet etti. Lâfız onundur. (Dediki): Bize Yahya b. Hammâd haber verdi. (Dediki): Bize Abdülaziz b. Muhtar rivayet etti. (Dediki): Bize İbni Âmir Ed-Dânâc'ın âzâdlısı Abdullah b. Feyrûz rivayet etti. (Dediki): Bize Hudayn b. Münzir Ebû Sâsân rivayet etti. (Dediki): Osman b. Affân'a şâhid oldum. Kendisine Velid getirilmişti. Velîd sabah namazını iki rek'at kıldırmış; sonra: Size daha ziyâde edeyim mî? demişti. Onun aleyhine iki zât şehâdet etti. Biri Humran olup şarap içtiğine; diğeri de onu kusarken gördüğüne şehadette bulundu. Bunun üzerine Osman: — Bu adam şarabı içmese kusmazdı! dedi. Ve: Yâ Ali! Kalk da şuna dayak vur! emrini verdi. Alî de: — Kalk yâ Hasan şuna dayak vur! dedi. Hasan : — Sen onun cefâsını, sefasını sürene yükle! dedi. Galiba Osman'a dargındı. Nihayet Alî: — Yâ Abdullah b. Ca'fer! Kalk da şuna dayak vur! dedi. O, dayağı vurdu. Alî de sayıyordu. Kırka varınca : — Kes! dedi. Sonra şunları söyledi. Nebi (Sallallahu Aleyhi ve Sellem) kırk değnek (hadd) vurdu. Ebû Bekir de kırk değnek vurdu, Ömer ise 80 değnek vurdu. Bunların hepsi sünnettir. Ama bence bu daha makbuldür. Aliy b. Hucr kendi rivayetinde şunu ziyâde etti: «İsmail (Dedikî): Ben ondan Dânâc'ın hadîsini de dinledim ama onu bellemedim.» Dikkat izahtan sonra da rivayetler var"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 60
      }
    },
    {
      "hadithNumber": 4458,
      "arabicNumber": "1707.02",
      "book": 29,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ أَبِي حَصِينٍ، عَنْ عُمَيْرِ بْنِ سَعِيدٍ، عَنْ عَلِيٍّ، قَالَ مَا كُنْتُ أُقِيمُ عَلَى أَحَدٍ حَدًّا فَيَمُوتَ فِيهِ فَأَجِدَ مِنْهُ فِي نَفْسِي إِلاَّ صَاحِبَ الْخَمْرِ لأَنَّهُ إِنْ مَاتَ وَدَيْتُهُ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَسُنَّهُ ‏.‏",
        "translations": {
          "en": "Ali reported:If I impose Hadd on anyone, and he (in course of punish ment) dies, I would not mind except in case of a drunkard. If he dies. I would pay indemnity for him because the Messenger of Allah (ﷺ) has laid down no rule for it",
          "ur": "یزید بن زریع نے کہا : ہمیں سفیان ثوری نے ابوحصین سے حدیث بیان کی ، انہوں نے عمیر بن سعد سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں کسی شخص پر حد نہیں لگاتا کہ وہ اس میں مر جائے تو میں اس سے اپنے دل میں کوئی ملال محسوس کروں ، سوائے شراب پینے والے کے ، وہ اگر مر جائے تو میں اس کی دیت ادا کروں گا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس طریقے ( اسی کوڑوں کی سزا ) کو جاری نہیں کیا",
          "fr": "Rapporté par Ali رضي الله عنه : Si j’applique la peine légale à quelqu’un et qu’il meurt pendant la punition, cela ne me dérange pas, sauf dans le cas d’un buveur d’alcool. S’il meurt, je paierai le prix du sang pour lui, car le Messager d’Allah ﷺ n’a pas fixé de règle à ce sujet",
          "id": "Telah menceritakan kepadaku [Muhammad bin Minhal Ad Dlarir] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sufyan Ats Tsauri] dari [Abu Hashin] dari ['Umair bin Sa'id] dari ['Ali] dia berkata, \"Aku tidak suka jika menegakkan hukuman kepada seseorang peminum khamer sampai dia meninggal, sebab jika sampai meninggal maka negaralah yang akan membayar diyatnya, dan Rasulullah shallallahu 'alaihi wasallam tidak pernah mencontohkan yang demikian itu.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dengan isnad seperti ini",
          "tr": "Bana Muhammed b. Minhâl Ed-Darîr rivayet etti. (Dediki): Bize Yezîd b. Zürey' rivayet etti. (Dediki): Bize Süfyân-ı Sevrî, Ebû Hasîn'den, o da Umeyr b. Saîd'den, o da Alî'den naklen rivayet etti. (Şöyle demiş): Ben bir kimseye hadd vurur da bu sebeple ölürse ona acımam! Yalnız sarhoş müstesna! O Ölürse diyetini veririm. Çünkü Resûlüllah (Sallallahu Aleyhi ve Sellem): onu (n hakkında mazbut bir) sünnet bırakmadı. {…} Bize Muhammed b. El-Müsennâ rivayet etti. (Dediki): Bize Abdurrahmân rivayet etti. (Dediki): Bize Süfyân bu isnâdla bu hadîsin mislini rivayet etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 61
      }
    },
    {
      "hadithNumber": 4459,
      "arabicNumber": "1707.03",
      "book": 29,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
        "translations": {
          "en": "This hadith is narrated on the authority of Sufyan",
          "ur": "عبدالرحمان نے سفیان سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Rapporté par Sufyan : Ce hadith est rapporté de l’autorité de Sufyan",
          "tr": "(Bize Muhammed b. El-Müsennâ rivâyet etti. ki): Bize Abdurrahmân rivâyet etti. ki): Bize Sütyân bu isnâdla bu hadîsin mislini rivâyet etti. hadîsi Buhârî, Ebû Dâvûd ve İbn Mâce «Hudûd» bahsinde muhtelif râvilerden tahrîc etmişlerdir. murâd: «Bu hususta mazbut bir miktar tayîn etmedi.» demektir. Alînin bu hadîsi «hadd vurulurken ölen kimsenin diyeti ödenmez.» diyenlerin delilidir. Nevevî'nin beyanına göre bu hususta ulemânın ittifakı vardır. Yalnız ta'zîr edilirken ölen hakkında ihtilâf edilmiştir. Şâfiîler'e göre böylesinin diyeti hâkimin âkılesine ödettirilir. Hâkime de keffâret îcâb eder! Bazıları diyetin Beytülmâlden verileceğini söylemişlerdir. Cumhûr-u ulemaya göre kimsenin bir şey ödemesi lâzım gelmez. hadîsteki cümlesinin doğrusu şeklinde olacağını söylemişlerdir. Nitekim Sahîh-i Buhârî'de öyledir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 62
      }
    },
    {
      "hadithNumber": 4460,
      "arabicNumber": "1708",
      "book": 29,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، قَالَ بَيْنَا نَحْنُ عِنْدَ سُلَيْمَانَ بْنِ يَسَارٍ إِذْ جَاءَهُ عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ فَحَدَّثَهُ فَأَقْبَلَ، عَلَيْنَا سُلَيْمَانُ فَقَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ، عَنْ أَبِيهِ، عَنْ أَبِي بُرْدَةَ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يُجْلَدُ أَحَدٌ فَوْقَ عَشَرَةِ أَسْوَاطٍ إِلاَّ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Barda Ansari reported Allah's Messenger (ﷺ) as saying:None should be given more than ten lashes, but in case of any Hadd out of the Huded of Allah",
          "ur": "حضرت ابوبردہ انصاری رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" حدوداللہ میں سے کسی حد کے علاوہ کسی کو دس سے زیادہ کوڑے نہ مارے جائیں",
          "fr": "Rapporté par Abu Barda Ansari : Le Messager d’Allah ﷺ a dit : « Personne ne doit recevoir plus de dix coups de fouet, sauf dans le cas d’une peine légale (Hadd) parmi les peines fixées par Allah. »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Isa] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru] dari [Bukair bin Al Asyaj] dia berkata, \"Ketika kami berada di sisi Sulaiman bin Yasar, tiba-tiba Abdurrahman Jabir datang lalu menceritakan (hadits) kepadanya, kemudian [Sulaiman] menghadapkan wajahnya kepada kami sambil berkata; telah menceritakan kepadaku [Abdurrahman bin Jabir] dari [ayahnya] dari [Abu Burdah Al Anshari], bahwa dia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang tidak boleh didera lebih dari sepuluh kali, melainkan hukuman yang telah jelas ditetapkan oleh Allah",
          "tr": "Bize Ahmed b. îsâ rivayet etti. (Dediki): Bize İbni Vehb rivayet etti. (Dediki): Bana Amr, Bükeyr b. El-Eşecc'den naklen haber verdi. (Demişki): Bir defa biz Süleyman b. Yesâr'ın yanında otururken aniden Abdurrahmân b. Câbir gelerek onunla konuştu. Derken Süleyman bize dönerek şunları söyledi: Bana Abdurrahmân b. Câbir, babasından, o da Ebî Bürdete'l-Ensârî'den naklen rivayet etti ki Ebû Bürde: Resûlullah (Sallallahu Aleyhi ve Sellem)'i: «Hiç bir kimseye on kamçıdan fazla vurulmaz. Meğer ki Allah'ın haddlerinden bir hadd hakkında ola!» buyururken işitmiş"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 63
      }
    },
    {
      "hadithNumber": 4461,
      "arabicNumber": "1709.01",
      "book": 29,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ لِعَمْرٍو قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَجْلِسٍ فَقَالَ ‏ \"‏ تُبَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَزْنُوا وَلاَ تَسْرِقُوا وَلاَ تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَعُوقِبَ بِهِ فَهُوَ كَفَّارَةٌ لَهُ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَسَتَرَهُ اللَّهُ عَلَيْهِ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَذَّبَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ubida b. as-Samit reported:While we were in the company of Allah's Messenger (may peace be upoi him) he said: Swear allegiance to me that you will not associate anything with Allah, that you will not commit adultery, that you will not steal, that you will not take any life which it is forbidden by Allah to take but with (legal) justification; and whoever among you fulfils it, his reward is with Allah and he who commits any such thing and is punished for it, that will be all atonement for it And if anyone commits anything and Allah conceals (his faultfls), his matter rests with Allah. He may forgive if He likes, and He may punish him if He likes",
          "ur": "عبادہ بن صامتؓ سے روایت ہے رسول اﷲ ﷺ کے ساتھ بیٹھے تھے آپ نے فرمایا بیعت کرو مجھ سے اس اقرار پر کہ اﷲ تعالیٰ کا شریک کسی کو نہیں کرنے کے اور زنا اور چوری اور ناحق خون جس کو اﷲ تعالیٰ نے حرام کیا نہیں کریں گے ۔ پھر جو کوئی اپنے اقرار کو پورا کرے گااس کا ثواب اﷲ تعالیٰ پر ہوگااور جو کوئی کام ان میں سے کر بیٹھے گا پھر اس کو دنیا میں اس کی سزا ملے گی ( یعنی حد لگے گی ) تو وہی اس کیگ ناہ کا کفارہ ہے اور جو دنیا میں اﷲ تعالیٰ اس کے کام کو چھپالے تو ( عاقبت میں ) اﷲ تعالیٰ کو اختیار ہے چاہے اس کو معاف کردے چاہے عذاب کرلے ۔",
          "fr": "Rapporté par Ubida b. as-Samit : Alors que nous étions avec le Messager d’Allah ﷺ, il a dit : « Faites-moi allégeance sur le fait de n’associer rien à Allah, de ne pas commettre l’adultère, de ne pas voler, de ne pas ôter la vie à qui Allah l’a interdit sauf en droit. Celui d’entre vous qui respecte cela aura sa récompense auprès d’Allah. Celui qui commet l’un de ces actes et est puni pour cela, cette punition sera une expiation pour lui. Et celui qui commet l’un de ces actes et qu’Allah couvre (sa faute), son cas dépend d’Allah : s’Il veut, Il lui pardonne, et s’Il veut, Il le punit. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Bakar bin Abu Syaibah] dan [Amru An Naqid] dan [Ishaq bin Ibrahim] dan [Ibnu Numair] mereka semua dari [Ibnu 'Uyainah], sedangkan lafadznya dari 'Amru, dia berkata; telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Abu Idris] dari ['Ubadah bin Shamit] dia berkata, \"Ketika kami bersama Rasulullah shallallahu 'alaihi wasallam di suatu majlis, beliau bersabda: \"Berbaiatlah kalian kepadaku bahwa kalian tidak akan menyekutukan Allah dengan sesuatu apapun, tidak berzina, tidak mencuri dan tidak membunuh jiwa yang Allah haramkan kecuali dengan hak. Barangsiapa di antara kalian yang memenuhi janji tersebut maka pahalanya ada pada Allah. Barangsiapa melanggar janji tersebut, namun Allah menutupi kesalahannya (tidak diketahui orang lain), maka urusannya terserah Allah; jika Dia menghendaki maka akan diampuni, namun jika Dia menghendaki maka akan disiksa-Nya (di akhirat kelak).\" Telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dengan isnad seperti ini, dan dalam haditsnya dia menambahkan, \"Kemudian dia membacakan kepada kami ayat (dalam surat) An Nisa': '(Hendaknya kalian tidak menyekutukan Allah dengan sesuatu apapun) ' (Qs. Al Mumtahanah:)",
          "tr": "Bize Yahya b. Yahya Et-Temîmî ile Ebû Bekir b. Ebî Şeybe, Amru'n-Nâkıd, İshâk b. İbrahim ve İbni Numeyr hep birden İbni Uyeyne'den rivayet ettiler. Lâfız Amr'ındır. (Dediki): Bize Süfyân b. Uyeyne, Zührî'den, o da Ebû İdrîs'den, o da Ubâde b. Sâmit'den naklen rivayet etti. Ubâde şöyle demiş: Bir mecliste Resulullah (SalIallahu Aleyhi ve Sellem)'le beraberdik. Şöyle buyurdular: «Allah'a hiç bîr şeyi şerik koşmayacağınıza, zina yapmayacağınıza hırsızlık ehniyeceğinize, Allah'ın haram kıldığı nefsi haksız yere öldürtmyeceğinize dair bana bey'at ediyorsunuz. İmdi siz’den her kim sözünde durursa onun ecri Allah'a aiddir. Kim bunlardan birini yapar da o sebeple cezalanırsa bu da onun için keffârettir. Ve kim bunlardan bir şey yapar da Allah onu ört bas ederse onun işi de Allah'a kalmıştır. Dilerse kendisini affeder; dilerse azâb eyler!»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 64
      }
    },
    {
      "hadithNumber": 4462,
      "arabicNumber": "1709.02",
      "book": 29,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ وَزَادَ فِي الْحَدِيثِ فَتَلاَ عَلَيْنَا آيَةَ النِّسَاءِ ‏{‏ أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ الآيَةَ ‏.‏",
        "translations": {
          "en": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters with this addition:\" He recited to us the verse pertaining to women, viz, that they will not associate anything with Allah",
          "ur": "معمر نے زہری سے اسی سند کے ساتھ حدیث بیان کی اور حدیث میں یہ اضافہ کیا : اس کے بعد آپ نے ہمارے سامنے عورتوں ( کے احکام ) والی ( سورۃ الممتحنہ کی ) یہ آیت تلاوت کی : \" کہ وہ اللہ کے ساتھ کسی چیز کو شریک نہ کریں",
          "fr": "Rapporté par Zuhri : Ce hadith a été rapporté par Zuhri avec la même chaîne de transmission, avec cette précision : « Il nous a récité le verset concernant les femmes, à savoir qu’elles n’associeront rien à Allah. »",
          "tr": "Bize Abd b. Humeyd rivayet etti. (Dediki): Bize Abdurrazzâk haber verdi. (Dediki): Bize Ma'mer, Zührî'den bu isnâdla haber verdi. O bu hadiste şunu da ziyade etti: «Arkacığından bize kadınlar ayetini okudu: Mü'min kadınlar Allah'a hiç bir şeyi şerik koşmayacaklarına dâir sana bey'at'a gelirlerse...» [Mümtehine]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 65
      }
    },
    {
      "hadithNumber": 4463,
      "arabicNumber": "1709.03",
      "book": 29,
      "hadithInBook": 66,
      "text": {
        "arabic": "وَحَدَّثَنِي إِسْمَاعِيلُ بْنُ سَالِمٍ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم كَمَا أَخَذَ عَلَى النِّسَاءِ أَنْ لاَ نُشْرِكَ بِاللَّهِ شَيْئًا وَلاَ نَسْرِقَ وَلاَ نَزْنِيَ وَلاَ نَقْتُلَ أَوْلاَدَنَا وَلاَ يَعْضَهَ بَعْضُنَا بَعْضًا ‏ \"‏ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَتَى مِنْكُمْ حَدًّا فَأُقِيمَ عَلَيْهِ فَهُوَ كَفَّارَتُهُ وَمَنْ سَتَرَهُ اللَّهُ عَلَيْهِ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Ubida b. as-Samit reported:Allah's Messenger (ﷺ) took (a pledge) from us as he took from the women that we will not associate anything with Allah and we will not steal, and we will not commit adultery, and we will not kill our children, and we will not bring calumny upon one another. And he who amongst you fulfils (this pledge), his reward rests with Allah, and he upon whom amongst you is imposed the prescribed punishment and that is carried out, that is his expiation (for that sin), and he whose (sins) were covered by Allah, his matter rests with Allah. He may punish him if He likes or may forgive him if He so likes",
          "ur": "ابو اشعث صنعانی نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہم سے ( اسی طرح ) عہد لیا جس طرح آپ نے عورتوں سے عہد لیا تھا : ہم اللہ کے ساتھ کسی کو شریک نہ کریں گے ، چوری نہ کریں گے ، زنا نہ کریں گے ، اپنی اولاد کو قتل نہ کریں گے اور ایک دوسرے پر تہمت نہ لگائیں گے : \" تم میں سے جس نے ایفا کیا اس کا اجر اللہ پر ہے اور جس نے ایسا کام کیا جس پر حد ہے اور اس کو حد لگا دی گئی تو وہ اس کا کفارہ ہو گی ، اور جس کا اللہ نے پردہ رکھا اس کا معاملہ اللہ کے سپرد ہے ، اگر چاہے تو اسے عذاب دے اور چاہے تو معاف کر دے",
          "fr": "Rapporté par 'Ubida b. as-Samit : Le Messager d’Allah ﷺ a pris de nous un engagement, comme il l’a pris des femmes, de n’associer rien à Allah, de ne pas voler, de ne pas commettre l’adultère, de ne pas tuer nos enfants et de ne pas nous accuser injustement les uns les autres. Celui d’entre vous qui respecte cet engagement, sa récompense est auprès d’Allah. Celui d’entre vous qui subit une peine légale et qu’elle est appliquée, cela sera une expiation pour lui. Et celui dont les péchés sont couverts par Allah, son cas dépend d’Allah : s’Il veut, Il le punit, et s’Il veut, Il lui pardonne",
          "id": "Dan telah menceritakan kepadaku [Ismail bin Salim] telah mengabarkan kepada kami [Husyaim] telah mengabarkan kepada kami [Khalid] dari [Abu Qilabah] dari [Abu Al Asy'ats Ash Shan'ani] dari ['Ubadah bin Shamit] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengambil sumpah setia kepada kami sebagaimana beliau mengambil sumpah setia terhadap kaum wanita, yaitu; hendaknya kami tidak menyekutukan Allah dengan sesuatu apapun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kami, dan tidak melemparkan kedustaan antara satu dengan yang lain. Barangsiapa menepati janji tersebut maka pahalanya ada bersama Allah, dan barangsiapa melanggar batasan tersebut maka akan ditegakkan had atasnya, yaitu sebagai kafarah (denda). Namun siapa yang Allah tutupi perbuatan tersebut (tidak diperlihatkan kepada orang-orang), maka urusannya terserah kepada Allah; jika menghendaki Allah akan menyiksanya, namun jika menghendaki Allah juga akan mengampuninya",
          "tr": "Bana İsmail b. Salim de rivayet etti. (Dediki): Bize Hüşeym haber verdi. (Dediki): Bize Hâlid, Ebû Kilâbe'den, o da Ebû'l-Eş'as Es-San'ânî'den, o da Ubâde b. Sâmit'den naklen haber verdi. Şöyle demiş: Bizden Resûlullah (SalIallahu Aleyhi ve Sellem) kadınlardan aldığı gibi: Allah'a hiç bir şeyi şerik koşmayacağınıza, çalmıyacağınıza, zina etmiyeceğinize, çocuklarınızı öldürmeyeceğinize, birbirimize bühtanda bulunmıyacağımiza dair söz aldı. Ve: «Sizden her kim sözünde durursa onun ecri Allah'a âiddir. Her kim haddi mucip bîr şey yapar da kendisine hadd vurulursa bu onun keffâretidir. Kimi Allah örtbas ederse onun işi de Allah'a kalmıştır. Dilerse kendisini azâb eder; dilerse mağfiret eyler.» buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 66
      }
    },
    {
      "hadithNumber": 4464,
      "arabicNumber": "1709.04",
      "book": 29,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنِ الصُّنَابِحِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّهُ قَالَ إِنِّي لَمِنَ النُّقَبَاءِ الَّذِينَ بَايَعُوا رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَالَ بَايَعْنَاهُ عَلَى أَنْ لاَ نُشْرِكَ بِاللَّهِ شَيْئًا وَلاَ نَزْنِيَ وَلاَ نَسْرِقَ وَلاَ نَقْتُلَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَلاَ نَنْتَهِبَ وَلاَ نَعْصِيَ فَالْجَنَّةُ إِنْ فَعَلْنَا ذَلِكَ فَإِنْ غَشِينَا مِنْ ذَلِكَ شَيْئًا كَانَ قَضَاءُ ذَلِكَ إِلَى اللَّهِ ‏.‏ وَقَالَ ابْنُ رُمْحٍ كَانَ قَضَاؤُهُ إِلَى اللَّهِ ‏.‏",
        "translations": {
          "en": "Ubida b. as-Samit repnrted:I was one of those headmen who swore allegiance to Allah's Messenger (ﷺ) that we will not associate anything with Allah, and will not commit adultery, and will not steal, and will not kill any soul which Allah has forbidden, but with justice nor plunder, nor disobey (Allah and His Apostle), then Paradise (will be the reward) in case we do these (acts) ; and if we commit any outrage (and that goes unpunished in the world), it is Allah Who would decide about it. Ibn Rumh said: Its judgment lies with Allah",
          "ur": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے ، انہوں نے یزید بن ابی حبیب سے ، انہوں نے ابوالخیر سے ، انہوں نے ( عبدالرحمان ) صنابحی سے اور انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا : میں ان نقیبوں میں سے ہوں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کی بیعت کی تھی ۔ اور کہا : ہم نے اس بات پر آپ کے ساتھ بیعت کی کہ اللہ کے ساتھ کسی کو شریک نہ کریں گے ، زنا نہ کریں گے ، چوری نہ کریں گے ، کسی زندہ ( انسان ) کو ناحق قتل نہ کریں گے جسے اللہ نے حرمت عطا کی ہے ، ڈاکے نہ ڈالیں گے اور نافرمانی نہ کریں گے ۔ اگر ہم نے اس پر عمل کیا تو جنت ہے اور اگر ہم نے ان میں سے کسی چیز کا ارتکاب کیا تو اس کا فیصلہ اللہ کے سپرد ہو گا ۔ ابن رمح نے اس کا فیصلہ کے بجائے \" اس شخص کا فیصلہ اللہ عزوجل کے سپرد ہو گا \" کہا",
          "fr": "Rapporté par Ubida b. as-Samit : J’étais l’un de ceux qui ont prêté allégeance au Messager d’Allah ﷺ pour ne rien associer à Allah, ne pas commettre l’adultère, ne pas voler, ne pas tuer une âme qu’Allah a interdite sauf en droit, ne pas piller, et ne pas désobéir (à Allah et à Son Messager). Si nous respectons cela, le Paradis sera la récompense. Si nous commettons une faute (et qu’elle n’est pas punie dans ce monde), c’est Allah qui en décidera. Ibn Rumh a dit : Son jugement appartient à Allah",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari [Ash Shunabihi] dari ['Ubadah bin Shamit] bahwa dia berkata, \"Kami termasuk dari pembesar tokoh yang pernah ikut berbaiat kepada Rasulullah shallallahu 'alaihi wasallam, dia berkata, \"Lalu kami membaiat beliau supaya kami tidak menyekutukan Allah dengan sesuatu apapun, tidak berzina, tidak mencuri, tidak membunuh jiwa yang telah diharamkan Allah kecuali dengan hak (dibenarkan Agama), tidak merampok dan tidak bermaksiat, maka surgalah pahalanya jika kami menepati janji tersebut, namun jika kami melanggar hal itu, maka keputusannya terserah Allah.\" Ibnu Rumh berkata, \"Dan keputusannya terserah kepada Allah",
          "tr": "Bize Kuteybe b. Saîd rivayet etti. (Dediki): Bize Leys rivayet etti. H. Bize Muhammed b. Rumh da rivayet etti. (Dediki): Bize Leys, Yezîd b. Eb! Habîb'den, o da Ebûl-Hayr'dan, o da Sunâbihî'den, o da Ubâde b. Sâmit'den naklen onun şöyle dediğini haber verdi: Ben Resulullah (SalIallahu Aleyhi ve Sellem)'e bey'at eden nakîblerdenim! Ona: Allah'a hiç bir şeyi şerik koşmayacağımıza, zina etmiyeceğimize, çalmayacağımıza, Allah'ın haram kıldığı nefsi haksız yere öîdürmiyeceğimize, yağmacılık yapmayacağımıza ve isyan etmlyeceğimize (dair) bey'at ettik. Bunu yaparsak cennet!.. Bunlardan birinde bozuk çalarsak onun hükmü Allah kalmıştır. İbni Rumh: «Onun hükmü Allah'a kalır.» dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 67
      }
    },
    {
      "hadithNumber": 4465,
      "arabicNumber": "1710.01",
      "book": 29,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No requital is payable for a wound caused by an animal, for (falling into) a well and a mine, and one-fifth (is the share of the government) in the buried treasure (treasure-trove)",
          "ur": "ابو ‌ہریرہ ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌جناب ‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌جانور ‌كا ‌زخمی ‌كرنا ‌لغو ‌ہے ( ‌یعنی ‌اس ‌كا ‌تاوان ‌كسی ‌پر ‌نہ ‌ہوگا ) ‌ ‌اور ‌كنواں ‌لغو ‌ہے ‌. ‌اور ‌ركاز ‌میں ‌پانچواں ‌حصہ ‌ہے ‌. ‌",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Il n’y a pas de compensation à payer pour une blessure causée par un animal, une chute dans un puits ou une mine. Et un cinquième (du trésor trouvé) revient au gouvernement. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Muhammad bin Rumh] keduanya berkata; telah mengabarkan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dan [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa dia bersabda: \"Binatang ternah yang merusak maka tidak ada denda, sumur yang mencelakai (jatuh ke dalamnya) tidak ada denda, galian barang tambang yang mencelakai (jatuh ke dalamnya) tidak ada denda, dan pada harata yang terpenda (harta karun) zakatnya adalah seperlima.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Bakar bin Abu Syaibah] dan [Zuhair bin Harb] dan [Abdul A'la bin Hammad] mereka semua dari [Ibnu 'Uyainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Ishaq] -yaitu Ibnu Isa- telah menceritakan kepada kami [Malik] keduanya dari [Az Zuhri] dengan sanadnya Laits seperti haditsnya dia juga.\" Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah] keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Ibnu Musayyab] dan ['Ubaidullah bin Abdullah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam seperti hadits tersebut",
          "tr": "Bize Yahya b. Yahya ile Muhammed h. Rumh rivayet ettiler. (Dedilerki): Bize Leys haber verdi. H. Bize Kuteybe b. Saîd de rivayet etti. (Dediki): Bize Leys, İbni Şihâb'dan, o da Saîd b. El-Müseyyeb ile Ebû Seleme'den, onlar da Ebû Hureyre'den, o da Resûlullah (Sallallahu Aleyhi ve Sellem)'den naklen onun şöyle buyurduğunu rivayet etti: «Hayvanın yaralaması hederdir. Kuyu da hederdir; ma'den de hederdir. Rikâzda ise beşte bir vardır.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 68
      }
    },
    {
      "hadithNumber": 4466,
      "arabicNumber": "1710.02",
      "book": 29,
      "hadithInBook": 69,
      "text": {
        "arabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا إِسْحَاقُ، - يَعْنِي ابْنَ عِيسَى - حَدَّثَنَا مَالِكٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ اللَّيْثِ ‏.‏ مِثْلَ حَدِيثِهِ ‏.‏",
        "translations": {
          "en": "A hadith like this has been transmitted on the authority of Zuhri",
          "ur": "ابن عیینہ اور امام مالک دونوں نے زہری سے لیث کی سند کے ساتھ اسی کے مانند حدیث بیان کی",
          "fr": "Rapporté par Zuhri : Un hadith similaire a été transmis par Zuhri",
          "tr": "{…} Bize Yahya b. Yahya ile Ebû Bekir b. Ebî Şeybe, Züheyr b. Harb ve Abdülâ'lâ b. Hammad dahî hep birden İbni Uyeyne'den rivayet ettiler. H. Bize Muhammed b. Râfi' de rivayet etti. (Dediki): Bize İshâk (yâni îbni îsâ) rivayet etti. (Dediki): Bize Mâlik rivayet etti. Her iki râvi Zührî'den, Leys'in isnadı ile onun hadîsinin mislini rivayet etmişlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 69
      }
    },
    {
      "hadithNumber": 4467,
      "arabicNumber": "1710.03",
      "book": 29,
      "hadithInBook": 70,
      "text": {
        "arabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ، شِهَابٍ عَنِ ابْنِ الْمُسَيَّبِ، وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "A hadith like this has been transmitted on the authority of Abu Huraira",
          "ur": "یونس نے ابن شہاب سے ، انہوں نے ابن مسیب اور عبیداللہ بن عبداللہ سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی",
          "fr": "Rapporté par Abu Huraira : Un hadith similaire a été transmis par Abu Huraira",
          "tr": "{…} Bana Ebû't-Tâhir ile Harmele de rivayet ettiler. (Dedilerki): Bize İbni Vehb haber verdi. (Dediki): Bana Yûnus, İbni Şihâb'dan, o da İbnil-Müseyyeb ile Ubeydullah b. Abdillâh'dan, onlar da Ebû Hureyre'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen bu hadisin mislini haber verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 70
      }
    },
    {
      "hadithNumber": 4468,
      "arabicNumber": "1710.04",
      "book": 29,
      "hadithInBook": 71,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنِ الأَسْوَدِ، بْنِ الْعَلاَءِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ الْبِئْرُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جَرْحُهُ جُبَارٌ وَالْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The wound caused (by falling) in the well, in the mine, and caused bv the animal has no requital for it; and there is one-fifth (for the government) in the buried treasure",
          "ur": "اسود بن علاء نے ابوسلمہ بن عبدالرحمان سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" کنویں کے زخم پر تاوان نہیں ، ( دھات وغیرہ کی ) کان کے زخم پر تاوان نہیں ، چوپائے کے زخم ( یا نقصان ) پا تاوان نہیں اور دفینے میں پانچواں حصہ ہے",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah ﷺ a dit : « Il n’y a pas de compensation pour une blessure causée par une chute dans un puits, une mine ou par un animal. Et un cinquième du trésor trouvé revient au gouvernement. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Rumh bin Muhajir] telah mengabarkan kepada kami [Laits] dari [Ayyub bin Musa] dari [Al Aswad] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sumur yang mencelakai (jatuh ke dalamnya) tidak ada denda, galian barang tambang yang mencelakai (jatuh ke dalamnya) tidak ada denda, binatang ternah yang merusak maka tidak ada denda, dan pada harata yang terpenda (harta karun) zakatnya adalah seperlima.\" Dan telah menceritakan kepada kami [Abdurrahman bin Salam Al Jumahi] telah menceritakan kepada kami [Ar Rabi'] -yaitu Ibnu Muslim-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] telah menceritakan kepada kami [ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] dia berkata; telah menceritakan kepada kami [Syu'bah] keduanya dari [Muhammad bin Ziyad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu",
          "tr": "Bize Muhammed h. Runıh b. El-Muhâcir rivayet etti. (Dediki): Bize Leys, Eyyûb b. Musa'dan, o da Esved b. EI-Alâ'dan, o da Ebû Seleme b. Abdirrahmân'dan, o da Ebû Hureyre'den, o da Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen onun şöyle .buyurduğunu haber verdi: «Kuyunun yaralaması hederdir; ma'denin yaralaması da hederdir; hayvanın yaralaması da hederdir. Rikâzda ise beşte bir vardır.»"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 71
      }
    },
    {
      "hadithNumber": 4469,
      "arabicNumber": "1710.05",
      "book": 29,
      "hadithInBook": 72,
      "text": {
        "arabic": "وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ يَعْنِي ابْنَ مُسْلِمٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
        "translations": {
          "en": "A hadith like this has been transmitted on the authority of Abu Huraira",
          "ur": "محمد بن زیاد نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی",
          "fr": "Rapporté par Abu Huraira : Un hadith similaire a été transmis par Abu Huraira",
          "tr": "{…} Bize Abdurrahmân b. Sellâm El-Cumah! de rivayet etti. (Dediki): Bize Rabi' (yâni İbni Müslim) rivayet etti. H. Bize Ubeydullah b. Muâz dahî rivayet etti. (Dediki): Bize babam rivayet etti. H. Bize İbni Beşşâr da rivayet etti. (Dediki): Bize Muhammed b. Ca'fer rivayet etti. Her iki râvi: Bize Şu'be rivayet etti; demişler; ikisi de Muhammed b. Ziyâd'dan, o da Ebû Hureyre'den, o da Nebi (Sallallahu Aleyhi ve Sellem)'den naklen bu hadîsin mislini rivayet etmişler dir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "muslim",
        "book": 29,
        "hadith": 72
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "51KB"
  }
}