{
  "collection": "tirmidhi",
  "book": 15,
  "name": {
    "arabic": "كتاب The Chapters On Judgements From The Messenger of Allah",
    "transliteration": "the chapters on judgements from the messenger of allah",
    "translation": "The Chapters On Judgements From The Messenger of Allah"
  },
  "totalHadith": 64,
  "hadithNumberRange": {
    "first": 1322,
    "last": 1385
  },
  "content": [
    {
      "hadithNumber": 1322,
      "arabicNumber": 1322,
      "book": 15,
      "hadithInBook": 1,
      "text": {
        "arabic": "",
        "translations": {
          "ur": "عبداللہ بن موہب کہتے ہیں کہ عثمان رضی الله عنہ نے ابن عمر رضی الله عنہما سے کہا: جاؤ ( قاضی بن کر ) لوگوں کے درمیان فیصلے کرو، انہوں نے کہا: امیر المؤمنین! کیا آپ مجھے معاف رکھیں گے، عثمان رضی الله عنہ نے کہا: ”تم اسے کیوں برا سمجھتے ہو، تمہارے باپ تو فیصلے کیا کرتے تھے؟“ اس پر انہوں نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”جو قاضی ہوا اور اس نے عدل انصاف کے ساتھ فیصلے کئے تو لائق ہے کہ وہ اس سے برابر سرابر چھوٹ جائے“ ( یعنی نہ ثواب کا مستحق ہو نہ عقاب کا ) ، اس کے بعد میں ( بھلائی کی ) کیا امید رکھوں، حدیث میں ایک قصہ بھی ہے۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث غریب ہے، میرے نزدیک اس کی سند متصل نہیں ہے۔ اور عبدالملک جس سے معتمر نے اسے روایت کیا ہے عبدالملک بن ابی جمیلہ ہیں، ۲- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے۔",
          "tr": "Muhammed b. İsmail, Hüseyin b. Bişr’den, Şerik’den, A’meş’den, Sehl b. Ubeyde’den, İbn Büreyde’nin babasından rivâyet ederek şöyle demiştir: “Hüküm verme, hakimlik üç çeşittir; ikisi Cehennem’de biri Cennet’tedir. Bir hâkim ki bilerek haksız yere hüküm verir bu Cehennemliktir. Bir hâkim ki delil ve belgeleri araştırmaksızın insanların haklarını bilgisiz ve cahilliğinden dolayı gasbeder ki bu da Cehennemliktir. Bir hâkim ki hak ve adaletle hükmeder ki bu Cennetliktir.” Ebû Dâvûd, Adiye; İbn Mâce, Ahkam"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 1
      }
    },
    {
      "hadithNumber": 1323,
      "arabicNumber": 1323,
      "book": 15,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ عَبْدِ الأَعْلَى، عَنْ بِلاَلِ بْنِ أَبِي مُوسَى، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ أُجْبِرَ عَلَيْهِ يُنْزِلُ اللَّهُ عَلَيْهِ مَلَكًا فَيُسَدِّدُهُ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Anas bin Malik narrated that the Messenger of Allah (sallAllahu Alayhi wa sallam) said:\"Whoever asks for a position as a judge, then he left on his own. And whoever is forced onto it, Allah sends an angel down to him so that he can be correct.\" (Daif)",
          "ur": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو قضاء کا مطالبہ کرتا ہے وہ اپنی ذات کے حوالے کر دیا جاتا ہے ( اللہ کی مدد اس کے شامل حال نہیں ہوتی ) اور جس کو جبراً قاضی بنایا جاتا ہے، اللہ اس کے پاس ایک فرشتہ بھیجتا ہے جو اسے راہ راست پر رکھتا ہے“۔",
          "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Abdul A'la] dari [Bilal bin Abu Musa] dari [Anas bin Malik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta untuk dijadikan hakim maka ia akan dibebankan atas dirinya (dalam mengemban tugasnya), namun barangsiapa dipaksa (tidak atas kehendak dirinya) untuk menjadi hakim, maka Allah akan menurunkan malaikat untuk menolong dan membimbingnya dalam kebenaran",
          "tr": "Enes b. Mâlik (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Hakimliği isteyen kimse kendisiyle baş başa bırakılmış olur yani Allah tarafından kendisine yardım edilmez. Kim de bu görüşe zorla getirilirse Allah ona bir melek gönderir de onu doğruya yöneltir.” Diğer tahric: İbn Mâce, Ahkam"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 3
      }
    },
    {
      "hadithNumber": 1324,
      "arabicNumber": 1324,
      "book": 15,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ، عَنْ أَبِي عَوَانَةَ، عَنْ عَبْدِ الأَعْلَى الثَّعْلَبِيِّ، عَنْ بِلاَلِ بْنِ مِرْدَاسٍ الْفَزَارِيِّ، عَنْ خَيْثَمَةَ، وَهُوَ الْبَصْرِيُّ عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ ابْتَغَى الْقَضَاءَ وَسَأَلَ فِيهِ شُفَعَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ أُكْرِهَ عَلَيْهِ أَنْزَلَ اللَّهُ عَلَيْهِ مَلَكًا يُسَدِّدُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَهُوَ أَصَحُّ مِنْ حَدِيثِ إِسْرَائِيلَ عَنْ عَبْدِ الأَعْلَى ‏.‏",
        "translations": {
          "en": "Anas narrated that the Prophet (ﷺ) said:\"Whoever seeks to be a judge, and asks others to intercede for him with it, then he will be left on his own. And whoever is coerced into it, Allah sends an angel down to him so that he can be correct.\" (Daif)",
          "ur": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو قضاء کا طالب ہوتا ہے اور اس کے لیے سفارشی ڈھونڈتا ہے، وہ اپنی ذات کے سپرد کر دیا جاتا ہے، اور جس کو جبراً قاضی بنایا گیا ہے، اللہ اس کے پاس ایک فرشتہ بھیجتا ہے جو اس کو راہ راست پر رکھتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اور یہ اسرائیل کی ( سابقہ ) روایت سے جسے انہوں نے عبدالاعلیٰ سے روایت کی ہے زیادہ صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman], telah mengabarkan kepada kami [Yahya bin Hammad] dari [Abu 'Awanah] dari [Abdul A'la Ats Tsa'labi] dari [Bilal bin Mirdas Al Fazari] dari [Khaitsamah] ia adalah orang Bashrah dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa mengharap menjadi seorang hakim maka (tugas dan tanggung jawabnya) akan dibebankan kepada dirinya, dan barangsiapa tidak menginginkannya (jabatan itu), maka Allah akan menurunkan malaikat untuk menolong dan membimbingnya dalam kebenaran.\" Abu Isa berkata; Hadits ini hasan gharib, namun lebih shahih dari hadits Isra`il dari Abdul A'la",
          "tr": "Enes (r.a.)’den rivâyete göre, Nebi (s.a.v.) şöyle buyurmuştur: Hakimlik isteyen bu arada aracılara başvuran kimse kendi başına bırakılır, Allah kendisine yardım etmez, zorla hakimliğe getirilen kimseye ise Allah; onu doğruya iletecek bir melek indirir. Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis hasen garibtir. İsrail’in, Abdul Â’la’dan rivâyetinden daha sağlamdır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 1325,
      "arabicNumber": 1325,
      "book": 15,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ وَلِيَ الْقَضَاءَ أَوْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَقَدْ رُوِيَ أَيْضًا مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:\"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص کو منصب قضاء پر فائز کیا گیا یا جو لوگوں کا قاضی بنایا گیا، ( گویا ) وہ بغیر چھری کے ذبح کیا گیا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس طریق سے حسن غریب ہے، ۲- اور یہ اس سند کے علاوہ دوسری سند سے بھی ابوہریرہ سے مروی ہے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami], telah menceritakan kepada kami [Al Fudlail bin Sulaiman] dari [Amr bin Abu Amr] dari [Sa'id Al Maqburi] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang diberi jabatan hakim atau diberi kewenangan untuk memutuskan hukum di antara manusia, sungguh ia telah dibunuh tanpa menggunakan pisau.\" Abu Isa berkata; Hadits ini hasan gharib dari jalur ini namun telah diriwayatkan pula dari selain jalur ini dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kim insanlar arasında hakimlik yapmak üzere görevlendirilirse bıçaksız boğazlanmış gibidir.” Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkam Tirmizî: Bu hadis bu şekliyle hasen garibtir. Başka yollarla da yine Ebû Hüreyre’den rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 5
      }
    },
    {
      "hadithNumber": 1326,
      "arabicNumber": 1326,
      "book": 15,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَأَخْطَأَ فَلَهُ أَجْرٌ وَاحِدٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَمْرِو بْنِ الْعَاصِي وَعُقْبَةَ بْنِ عَامِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ لاَ نَعْرِفُهُ مِنْ حَدِيثِ سُفْيَانَ الثَّوْرِيِّ عَنْ يَحْيَى بْنِ سَعِيدٍ إِلاَّ مِنْ حَدِيثِ عَبْدِ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ سُفْيَانَ الثَّوْرِيِّ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:\"When the judge passes a judgement in which he strived and was correct, then he receives two rewards. And when he judges and is mistaken, then he receives one reward",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب حاکم ( قاضی ) خوب سوچ سمجھ کر فیصلہ کرے اور صحیح بات تک پہنچ جائے تو اس کے لیے دہرا اجر ہے ۱؎ اور جب فیصلہ کرے اور غلط ہو جائے تو ( بھی ) اس کے لیے ایک اجر ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- اس باب میں عمرو بن العاص اور عقبہ بن عامر سے بھی احادیث آئی ہیں، ۲- ابوہریرہ کی حدیث اس طریق سے حسن غریب ہے۔ ہم اسے بسند «سفيان الثوري عن يحيى بن سعيد الأنصاري» إلا من حديث «عبدالرزاق عن معمر عن سفيان الثوري» روایت کی ہے۔",
          "id": "Telah menceritakan kepada kami [Al Husain bin Mahdi], telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ma'mar] dari [Sufyan Ats Tsauri] dari [Yahya bin Sa'id] dari [Abu Bakr bin Amr bin Hazm] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hakim menetapkan hukum dalam suatu perkara, lalu berijtihad dan ijtihadnya itu benar, maka ia memperoleh dua pahala, namun jika ia menetapkan hukum suatu perkara dan dalam ijtihadnya ia salah, maka ia mendapatkan satu pahala.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Amr bin Al 'Ash dan Uqbah bin Amir. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan gharib dari jalur ini, kami tidak mengetahuinya dari hadits Sufyan Ats Tsauri dari Yahya bin Sa'id Al Anshari kecuali hadits Abdurrazaq dari Ma'mar dari Sufyan Ats Tsauri",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Hakîm, tüm gücünü sarf ederek hüküm verdiğinde doğruyu bulursa iki mükafat alacaktır. Aynı şekilde hüküm verdiğinde yanılırsa bir mükafat alacaktır.” Diğer tahric: Buhârî, I’tısam; Müslim, Akdiye Tirmizî: Bu konuda Amr b. As ve Ukbe b. Âmir’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hureyre hadisi bu şekliyle hasen garibtir. Bu hadisin Sûfyân es Sevrî’nin, Yahya b. Saîd’den rivâyeti olduğunu sadece Abdurrezzak’ın, Ma’mer yoluyla Sûfyân es Sevrî’den rivâyetiyle bilmekteyiz"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 6
      }
    },
    {
      "hadithNumber": 1327,
      "arabicNumber": 1327,
      "book": 15,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ أَبِي عَوْنٍ الثَّقَفِيِّ، عَنِ الْحَارِثِ بْنِ عَمْرٍو، عَنْ رِجَالٍ، مِنْ أَصْحَابِ مُعَاذٍ عَنْ مُعَاذٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ مُعَاذًا إِلَى الْيَمَنِ فَقَالَ ‏\"‏ كَيْفَ تَقْضِي ‏\"‏ ‏.‏ فَقَالَ أَقْضِي بِمَا فِي كِتَابِ اللَّهِ ‏.‏ قَالَ ‏\"‏ فَإِنْ لَمْ يَكُنْ فِي كِتَابِ اللَّهِ ‏\"‏ ‏.‏ قَالَ فَبِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ فَإِنْ لَمْ يَكُنْ فِي سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏.‏ قَالَ أَجْتَهِدُ رَأْيِي ‏.‏ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏.‏",
        "translations": {
          "en": "Some men who were companions of Mu'adh narrated from Mu'adh that the Messenger of Allah (ﷺ) sent Mu'adh to Yemen, so he (ﷺ) said:\"How will you judge?\" He said: \"I will judge according to what is in Allah's Book.\" He said: \"If it is not in Allah's Book ?\" He said: \"Then with the Sunnah of the Messenger of Allah (ﷺ).\" He said: \"If it is not in the Sunnah of Messenger of Allah (ﷺ)?\" He said: \"I will give in my view.\" He said: \"All praise is due to Allah, the One Who made the messenger of the Messenger of Allah suitable",
          "ur": "معاذ بن جبل رضی الله عنہ کے شاگردوں میں سے کچھ لوگوں سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے معاذ کو ( قاضی بنا کر ) یمن بھیجا، تو آپ نے پوچھا: ”تم کیسے فیصلہ کرو گے؟“، انہوں نے کہا: میں اللہ کی کتاب سے فیصلے کروں گا، آپ نے فرمایا: ”اگر ( اس کا حکم ) اللہ کی کتاب ( قرآن ) میں موجود نہ ہو تو؟“ معاذ نے کہا: تو رسول اللہ صلی اللہ علیہ وسلم کی سنت سے فیصلے کروں گا، آپ نے فرمایا: ”اگر رسول اللہ صلی اللہ علیہ وسلم کی سنت میں بھی ( اس کا حکم ) موجود نہ ہو تو؟“، معاذ نے کہا: ( تب ) میں اپنی رائے سے اجتہاد کروں گا۔ آپ نے فرمایا: ”اللہ کا شکر ہے جس نے اللہ کے رسول کے قاصد کو ( صواب کی ) توفیق بخشی“۔",
          "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Abu 'Aun Ats Tsaqafi] dari [Al Harits bin Amr] dari [seseorang dari kalangan sahabat Mu'adz] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengutus Mu'adz ke Yaman, lalu beliau bertanya: \"Bagaimana engkau memutuskan hukum?\" ia menjawab; Aku memutuskan hukum dari apa yang terdapat di dalam kitabullah. Beliau bertanya lagi: \"Jika tidak ada di dalam kitabullah?\" ia menjawab; Dengan sunnah Rasulullah shallallahu 'alaihi wasallam. Beliau bertanya: \"Jika tidak terdapat di dalam sunnah Rasulullah shallallahu 'alaihi wasallam?\" Ia menjawab; Aku akan berijtihad dengan pendapatku. Beliau mengatakan: \"Segala puji bagi Allah yang telah memberi taufiq kepada utusan Rasulullah shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Abdurrahman bin Mahdi] keduanya berkata; Telah menceritakan kepada kami [Syu'bah] dari [Abu 'Aun] dari [Al Harits bin Amr] keponakan Mughirah bin Syu'bah dari [beberapa orang penduduk Himsh] dari [Mu'adz] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Isa berkata; Hadits ini tidak kami ketahui kecuali dari jalur ini namun menurutku sanadnya tidak bersambung, Abu 'Aun Ats Tsaqafi bernama Muhammad bin Ubaidullah",
          "tr": "Muâz (r.a.)’den rivâyet edilmiştir: “Rasûlullah (s.a.v.), Muâz’ı, Yemen’e kadı (hâkim) olarak gönderdiğinde ona nasıl hüküm vereceksin? Buyurdu. Muâz: Allah’ın kitabındakine göre hüküm veririm, Rasûlullah (s.a.v.): “Allah’ın kitabında bulamaz isen; Muâz Rasûlullah (s.a.v.)’in sünnetine göre… dedi. Rasûlullah (s.a.v.): “Eğer Allah Rasûlünün sünnetinde de yoksa buyurdu.” Muâz: Kendi görüşümle ictihat ederek bir hüküm bulur ve ona göre hüküm veririm dedi. Bunun üzerine Rasûlullah (s.a.v.): “Allah, Rasûlünün elçisini, Allah, Rasûlünün arzusuna uygun hareket etmeye muvaffak kılan Allah’a hamdolsun” buyurdular. Diğer tahric: Ebû Dâvûd: Akdıyye Ali r.a.’in Re’ye dair sözleri Ebu Davud rivayeti için buraya tıklayın Bu haidis’in Ebu Davud rivayeti ve izahat için buraya tıklayın BU HADİS’E TERS DÜŞEN İBN-İ MACE RİVAYETİ VE İZAH İÇİN BURAYA TIKLAYIN"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 7
      }
    },
    {
      "hadithNumber": 1328,
      "arabicNumber": 1328,
      "book": 15,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عَوْنٍ، عَنِ الْحَارِثِ بْنِ عَمْرٍو ابْنُ أَخٍ، لِلْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أُنَاسٍ، مِنْ أَهْلِ حِمْصٍ عَنْ مُعَاذٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ عِنْدِي بِمُتَّصِلٍ ‏.‏ وَأَبُو عَوْنٍ الثَّقَفِيُّ اسْمُهُ مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ ‏.‏",
        "translations": {
          "en": "(Another chain of narrators) from some people from the inhabitants of Hims, from Mu'adh, from the Prophet (ﷺ), with similar",
          "ur": "اس سند سے بھی معاذ سے اسی طرح کی حدیث مرفوعاً مروی ہے۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو ہم صرف اسی طریق سے جانتے ہیں، ۲- اور اس کی سند میرے نزدیک متصل نہیں ہے، ۳- ابو عون ثقفی کا نام محمد بن عبیداللہ ہے۔",
          "tr": "Muhammed b. Beşşâr (r.a.), Muhammed b. Cafer, Abdurrahman b. mehdî vasıtasıyla, Şu’be’den, Ebû Avn’dan, Hâris b. Amr’dan, Şu’be oğlu Muğîre kardeşinin oğlundan ve Hımıs halkından bir kimseden ve Muâz’dan bu (1327.) hadisin bir benzerini bize naklettiler. Tirmizî: Bu hadisi sadece bu şekliyle bilmekteyiz. Bana göre bu hadisin senedi muttasıl değildir. Ebû Avn es Sekafî’nin ismi Muhammed b. Ubeydullah’tır"
        }
      },
      "grades": [
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 8
      }
    },
    {
      "hadithNumber": 1329,
      "arabicNumber": 1329,
      "book": 15,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ الْكُوفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَحَبَّ النَّاسِ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَدْنَاهُمْ مِنْهُ مَجْلِسًا إِمَامٌ عَادِلٌ وَأَبْغَضَ النَّاسِ إِلَى اللَّهِ وَأَبْعَدَهُمْ مِنْهُ مَجْلِسًا إِمَامٌ جَائِرٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏",
        "translations": {
          "en": "Abu Sa'eed narrated that the Messenger of Allah (ﷺ) said:\"Indeed, the most beloved of people to Allah on the Day of Judgement, and the nearest to Him in the status is the just Imam. And the most hated of people to Allah and the furthest from Him in status is the oppressive Imam",
          "ur": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قیامت کے دن اللہ کے نزدیک سب سے زیادہ محبوب اور بیٹھنے میں اس کے سب سے قریب عادل حکمراں ہو گا، اور اللہ کے نزدیک سب سے زیادہ ناپسندیدہ اور اس سے سب سے دور بیٹھنے والا ظالم حکمراں ہو گا“۔ امام ترمذی کہتے ہیں: ۱- ابو سعید خدری رضی الله عنہ کی حدیث حسن غریب ہے، ہم اسے صرف اسی طریق سے جانتے ہیں، ۲- اس باب میں عبداللہ بن ابی اوفی رضی الله عنہ سے بھی روایت ہے۔",
          "id": "Telah menceritakan kepada kami [Ali bin Al Mundzir Al Kufi], telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Fudlail bin Marzuq] dari ['Athiyyah] dari [Abu Sa'id] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya manusia yang paling dicintai oleh Allah dan paling dekat tempat duduknya pada hari kiamat adalah pemimpin yang adil, sedangkan manusia paling dibenci oleh Allah dan paling jauh tempat duduknya adalah pemimpin yang zhalim.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Abu Aufa. Abu Isa berkata; Hadits Abu Sa'id adalah hadits hasan gharib, tidak kami ketahui kecuali dari jalur ini",
          "tr": "Ebû Saîd (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kıyamet günü Allah’a inananların en sevimlisi ve oturum bakımından en yakını adil hükümdardır. Allah’ın en çok kızdığı ve oturum bakımından en uzak olanı ise zâlim hükümdardır.” Tirmizî rivâyet etmiştir. Tirmizî: Bu konuda Abdullah b. ebî Evfâ’dan da hadis rivâyet edilmiştir. Tirmizî: Ebû Saîd hadisi hasen garibtir. Onu sadece bu şekliyle bilmekteyiz"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 1330,
      "arabicNumber": 1330,
      "book": 15,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ أَبُو بَكْرٍ الْعَطَّارُ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا عِمْرَانُ الْقَطَّانُ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ تَخَلَّى عَنْهُ وَلَزِمَهُ الشَّيْطَانُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عِمْرَانَ الْقَطَّانِ ‏.‏",
        "translations": {
          "en": "[Abdullah] Ibn Abi Al-Awfa narrated that the Messenger of Allah (ﷺ) said:\"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan",
          "ur": "عبداللہ بن ابی اوفی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ قاضی کے ساتھ ہوتا ہے ۱؎ جب تک وہ ظلم نہیں کرتا، اور جب وہ ظلم کرتا ہے تو وہ اسے چھوڑ کر الگ ہو جاتا ہے۔ اور اس سے شیطان چمٹ جاتا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، ہم اس کو صرف عمران بن قطان کی روایت سے جانتے ہیں۔",
          "id": "Telah menceritakan kepada kami [Abdul Quddus bin Muhammad Abu Bakr Al 'Athar], telah menceritakan kepada kami [Amru bin 'Ashim] telah menceritakan kepada kami [Imran Al Qaththan] dari [Abu Ishaq Asy Syaibani] dari [Abdullah bin Abu Aufa] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah bersama seorang hakim selama ia tidak berbuat zhalim, namun jika ia berbuat zhalim maka Allah akan menjauhinya dan setan yang akan menyertainya.\" Abu Isa berkata; Hadits ini hasan gharib, tidak kami ketahui kecuali dari hadits Imran Al Qaththan",
          "tr": "Abdullah b. ebî Evfâ (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Allah, haksızlık ve zulmetmediği sürece hakimle beraberdir. Haksızlık yapar ve zulmederse Allah ondan uzaklaşır şeytan onunla beraber olur.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis hasen garibtir. Onu sadece Imrân el Kattan’ın rivâyetiyle bilmekteyiz"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 1331,
      "arabicNumber": 1331,
      "book": 15,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ حَنَشٍ، عَنْ عَلِيٍّ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا تَقَاضَى إِلَيْكَ رَجُلاَنِ فَلاَ تَقْضِ لِلأَوَّلِ حَتَّى تَسْمَعَ كَلاَمَ الآخَرِ فَسَوْفَ تَدْرِي كَيْفَ تَقْضِي ‏\"‏ ‏.‏ قَالَ عَلِيٌّ فَمَا زِلْتُ قَاضِيًا بَعْدُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
        "translations": {
          "en": "Ali narrated:\"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" 'Ali said: \"I did not err since then",
          "ur": "علی رضی الله عنہ کہتے ہیں کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تمہارے پاس دو آدمی فیصلہ کے لیے آئیں تو تم پہلے کے حق میں فیصلہ نہ کرو جب تک کہ دوسرے کی بات نہ سن لو ۱؎ عنقریب تم جان لو گے کہ تم کیسے فیصلہ کرو“۔ علی رضی الله عنہ کہتے ہیں: اس کے بعد میں برابر فیصلے کرتا رہا۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
          "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Husain Al Ju'fi] dari [Za`idah] dari [Simak bin Harb] dari [Hanasy] dari [Ali] ia berkata; Rasulullah shallallahu 'alaihi wasallam mengatakan kepadaku: \"Jika ada dua orang mengajukan suatu perkara kepadamu maka janganlah engkau memutuskan hukum kepada orang pertama hingga engkau mendengar perkataan orang kedua, niscaya engkau akan mengetahui bagaimana engkau memutuskan hukum.\" Ali berkata; Setelah itu aku terus menjadi hakim. Abu Isa berkata; Hadits ini hasan",
          "tr": "Ali (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.), bana şöyle demişti: “İki kişi aralarında hüküm vermen için seni hakem tayin ederlerse birini dinler dinlemez hüküm verme ikincisini de dinledikten sonra nasıl hüküm vereceğini daha iyi anlarsın.” Ali diyor ki: O günden bu yana bu şekilde hüküm vermekteyim. Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkam"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 11
      }
    },
    {
      "hadithNumber": 1332,
      "arabicNumber": 1332,
      "book": 15,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنِي عَلِيُّ بْنُ الْحَكَمِ، حَدَّثَنِي أَبُو الْحَسَنِ، قَالَ قَالَ عَمْرُو بْنُ مُرَّةَ لِمُعَاوِيَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنْ إِمَامٍ يُغْلِقُ بَابَهُ دُونَ ذَوِي الْحَاجَةِ وَالْخَلَّةِ وَالْمَسْكَنَةِ إِلاَّ أَغْلَقَ اللَّهُ أَبْوَابَ السَّمَاءِ دُونَ خَلَّتِهِ وَحَاجَتِهِ وَمَسْكَنَتِهِ ‏\"‏ ‏.‏ فَجَعَلَ مُعَاوِيَةُ رَجُلاً عَلَى حَوَائِجِ النَّاسِ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَمْرِو بْنِ مُرَّةَ حَدِيثٌ غَرِيبٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ ‏.‏ وَعَمْرُو بْنُ مُرَّةَ الْجُهَنِيُّ يُكْنَى أَبَا مَرْيَمَ ‏.‏",
        "translations": {
          "en": "Abul-Hasan narrated that 'Amr bin Murrah said to Mu'awiyah:\"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people",
          "ur": "عمرو بن مرہ رضی الله عنہ سے روایت ہے کہ انہوں نے معاویہ رضی الله عنہ سے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”جو بھی حاکم حاجت مندوں، محتاجوں اور مسکینوں کے لیے اپنے دروازے بند رکھتا ہے تو اللہ تعالیٰ بھی اس کی ضرورت، حاجت اور مسکنت کے لیے اپنے دروازے بند رکھتا ہے“، جب معاویہ رضی الله عنہ نے یہ سنا تو لوگوں کی ضرورت کے لیے ایک آدمی مقرر کر دیا۔ امام ترمذی کہتے ہیں: ۱- عمرو بن مرہ رضی الله عنہ کی حدیث غریب ہے، ۲- یہ حدیث دوسرے طریق سے بھی مروی ہے، ۳- اس باب میں ابن عمر رضی الله عنہما سے بھی احادیث آئی ہیں، ۴- عمرو بن مرہ جہنی کی کنیت ابومریم ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepadaku [Ali bin Al Hakam] telah menceritakan kepadaku [Abu Al Hasan] ia berkata; [Amr bin Murrah] berkata kepada Mu'awiyah; Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang pemimpin yang menutup pintu rumahnya karena tidak mau melayani orang yang memerlukan, fakir miskin, dan sangat membutuhkan, kecuali Allah akan menutup pintu langit karena kefakiran, kesulitan dan kemiskinannya.\" Lalu Mu'awiyah menjadi seorang yang memperhatikan kebutuhan manusia. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ibnu Umar. Abu Isa berkata; Hadits Amr bin Murrah adalah hadits gharib dan hadits ini telah diriwayatkan selain dari jalur ini. Amr bin Murrah Al Juhani dijuluki dengan Abu Maryam. Telah menceritakan kepada kami [Ali bin Ja'far] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Yazid bin Abu Maryam] dari [Al Qasim bin Mukhaimirah] dari [Abu Maryam] seorang sahabat Nabi shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam seperti hadits ini dengan maknanya. Yazid bin Abu Maryam Syami, Buraid bin Abu Maryam Kufi dan Abu Maryam, ia sebenarnya adalah Amr bin Murrah Al Juhani",
          "tr": "Ebûl Hasen (r.a.)’den rivâyete göre, şöyle demiştir: Amr b. Mürre, Muaviye’ye şöyle dedi: Rasûlullah (s.a.v.)’den işittim şöyle buyurmuştur: “Her hangi bir idareci kapısını muhtaç, yoksul ve düşkünlerin yüzüne kaparsa Allah’ta göklerin kapısını onun her türlü ihtiyaçlarına karşı kapatır.” Bunun üzerine Muaviye insanların ihtiyaçlarına bakan bir görevli tayin etmişti. Tirmizî rivâyet etmiştir. Tirmizî: Bu konuda İbn Ömer’den de hadis rivâyet edilmiştir. Tirmizî: Amr b. Mürre hadisi garibtir. Bu hadis başka yollardan da rivâyet edilmiştir. Amr b. Mürre el Cühenî, Ebû Meryem künyesiyle anılır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 12
      }
    },
    {
      "hadithNumber": 1333,
      "arabicNumber": 1333,
      "book": 15,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ يَزِيدَ بْنِ أَبِي مَرْيَمَ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ أَبِي مَرْيَمَ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ هَذَا الْحَدِيثِ بِمَعْنَاهُ ‏.‏ وَيَزِيدُ بْنُ أَبِي مَرْيَمَ شَامِيٌّ وَبُرَيْدُ بْنُ أَبِي مَرْيَمَ كُوفِيٌّ وَأَبُو مَرْيَمَ هُوَ عَمْرُو بْنُ مُرَّةَ الْجُهَنِيُّ ‏.‏",
        "translations": {
          "en": "(Another chain) from Abu Maryam the Companion of the Prophet (ﷺ), from the Prophet (ﷺ)",
          "ur": "ابومریم رضی الله عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی حدیث کی طرح اسی مفہوم کی حدیث روایت کی ہے۔ یزید بن ابی مریم شام کے رہنے والے ہیں اور برید بن ابی مریم کوفہ کے رہنے والے ہیں اور ابومریم کا نام عمرو بن مرہ جہنی ہے۔",
          "tr": "Rasûlullah (s.a.v.)’in arkadaşı Ebû Meryem’den mana olarak bu (1332.) hadisin bir benzerini rivâyet edilmiştir. Tirmizî rivâyet etmiştir. Yezîd b. Ebî Meryem, Şamlıdır. Büreyd b. ebî Meryem ise Küfelidir. Ebû Meryem, Amr b. Mürre el Cühenî lakabıyla anılır"
        }
      },
      "grades": [
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 1334,
      "arabicNumber": 1334,
      "book": 15,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، قَالَ كَتَبَ أَبِي إِلَى عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرَةَ وَهُوَ قَاضٍ أَنْ لاَ، تَحْكُمْ بَيْنَ اثْنَيْنِ وَأَنْتَ غَضْبَانُ ‏.‏ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَحْكُمُ الْحَاكِمُ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو بَكْرَةَ اسْمُهُ نُفَيْعٌ ‏.‏",
        "translations": {
          "en": "Abdur-Rahman bin Abi Bakrah narrated:\"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry",
          "ur": "عبدالرحمٰن بن ابی بکرہ کہتے ہیں کہ میرے باپ نے عبیداللہ بن ابی بکرہ کو جو قاضی تھے خط لکھا کہ تم غصہ کی حالت میں فریقین کے بارے میں فیصلے نہ کرو، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”حاکم غصہ کی حالت میں فریقین کے درمیان فیصلے نہ کرے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابوبکرہ کا نام نفیع ہے۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik bin Umair] dari [Abdurrahman bin Abu Bakrah] ia berkata; [Ayahku] menulis surat kepada Ubaidullah bin Abu Bakr, saat itu ia menjabat sebagai hakim; Hendaklah engkau tidak memutuskan hukum di antara dua orang sedangkan engkau dalam keadaan marah, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang hakim tidak boleh memutuskan hukum di antara dua orang ketika dalam keadaan marah.\" Abu Isa berkata; Hadits ini hasan shahih, Abu Bakrah bernama Nufai",
          "tr": "Abdurrahman b. ebî Bekre (r.a.)’den rivâyete göre, şöyle demiştir: Ubeydullah b. ebî Bekre, hâkim iken babam ona şöyle yazmıştı: Kızgın olduğun anda iki kişi arasında hüküm verme! Zira ben Rasûlullah (s.a.v.)’den, “Hâkim öfkeli olduğu anda iki kişi arasında hüküm vermesin” diye işitmiştim. Diğer tahric: İbn Mâce, Ahkam; Ebû Dâvûd, Akdıyye Tirmizî: Bu hadis hasen sahihtir. Ebû Bekre’nin ismi Nüfey’dir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 14
      }
    },
    {
      "hadithNumber": 1335,
      "arabicNumber": 1335,
      "book": 15,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ دَاوُدَ بْنِ يَزِيدَ الأَوْدِيِّ، عَنِ الْمُغِيرَةِ بْنِ شُبَيْلٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْيَمَنِ فَلَمَّا سِرْتُ أَرْسَلَ فِي أَثَرِي فَرُدِدْتُ فَقَالَ ‏ \"‏ أَتَدْرِي لِمَ بَعَثْتُ إِلَيْكَ لاَ تُصِيبَنَّ شَيْئًا بِغَيْرِ إِذْنِي فَإِنَّهُ غُلُولٌ وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ لِهَذَا دَعَوْتُكَ فَامْضِ لِعَمَلِكَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَدِيِّ بْنِ عَمِيرَةَ وَبُرَيْدَةَ وَالْمُسْتَوْرِدِ بْنِ شَدَّادٍ وَأَبِي حُمَيْدٍ وَابْنِ عُمَرَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ مُعَاذٍ حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي أُسَامَةَ عَنْ دَاوُدَ الأَوْدِيِّ ‏.‏",
        "translations": {
          "en": "Mu'adh bin Jabal narrated:\"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job",
          "ur": "معاذ بن جبل رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ( قاضی بنا کر ) یمن بھیجا، جب میں روانہ ہوا تو آپ نے میرے پیچھے ( مجھے بلانے کے لیے ) ایک آدمی کو بھیجا، میں آپ کے پاس واپس آیا تو آپ نے فرمایا: ”کیا تم جانتے ہو کہ میں نے تمہیں بلانے کے لیے آدمی کیوں بھیجا ہے؟ ( یہ کہنے کے لیے کہ ) تم میری اجازت کے بغیر کوئی چیز نہ لینا، اس لیے کہ وہ خیانت ہے، اور جو شخص خیانت کرے گا قیامت کے دن خیانت کے مال کے ساتھ حاضر ہو گا، یہی بتانے کے لیے میں نے تمہیں بلایا تھا، اب تم اپنے کام پر جاؤ“۔ امام ترمذی کہتے ہیں: ۱- معاذ رضی الله عنہ کی حدیث غریب ہے، ۲- ہم اسے اس طریق سے بروایت ابواسامہ جانتے ہیں جسے انہوں نے داود اودی سے روایت کی ہے، ۳- اس باب میں عدی بن عمیرہ، بریدہ، مستور بن شداد، ابوحمید اور ابن عمر رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abu Usamah] dari [Daud bin Yazid Al Audi] dari [Al Mughirah bin Syubail] dari [Qais bin Abu Hazim] dari [Mu'adz bin Jabal] ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman, tatkala aku sudah berjalan beliau mengutus seseorang di belakangku lalu aku kembali menghadap beliau. Beliau bertanya: \"Tahukah engkau untuk apa aku mengutus seseorang memanggilmu? Janganlah engkau mengambil sesuatu tanpa seizinku karena hal itu merupakan bentuk khianat dalam urusan rampasan perang dan (Barangsiapa yang berkhianat dalam urusan rampasan perang itu, maka pada hari kiamat ia akan datang membawa apa yang dikhianatkannya itu). Karena inilah aku memanggilmu, pergilah untuk melakukan tugasmu.\" Ia berkata; Dalam hal ini ada hadits serupa dari 'Adi bin 'Amirah, Buraidah, Al Mustaurid bin Syaddad, Abu Humaid dan Ibnu Umar. Abu Isa berkata; Hadits Mu'adz adalah hadits gharib, tidak kami ketahui kecuali melalui jalur ini dari hadits Abu Utsamah dari Dawud Al Audi",
          "tr": "Muâz b. Cebel (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) beni Yemen’e vali olarak göndermişti; hareket edeceğim sırada peşimden bir haberci göndererek beni geri çevirdi ve buyurdu ki: “Seni niçin geri çevirdiğimi biliyor musun? Benim iznim olmadan hiçbir şey alma çünkü bu bir hainliktir. Her kim bu dünyada hainlik yaparsa kıyamet günü Allah’ın huzuruna, yaptığı o hainlikle getirilir. İşte bunun için seni çağırmıştım, şimdi vazifene gidebilirsin.” Tirmizî rivâyet etmiştir. Tirmizî: Bu konuda Adıy b. Amîra, Büreyde, Müstevrid b. Şeddâd, Ebû Humeyd ve İbn Ömer’den de hadis rivâyet edilmiştir. Tirmizî: Muâz hadisi garib olup sadece bu şekliyle Ebû Usame’nin, Dâvûd el Evdî rivâyetinden bilmekteyiz"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 15
      }
    },
    {
      "hadithNumber": 1336,
      "arabicNumber": 1336,
      "book": 15,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّاشِي وَالْمُرْتَشِي فِي الْحُكْمِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَعَائِشَةَ وَابْنِ حَدِيدَةَ وَأُمِّ سَلَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُوِيَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلاَ يَصِحُّ ‏.‏ قَالَ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ حَدِيثُ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صلى الله عليه وسلم أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ وَأَصَحُّ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated:\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe for a judgement",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلے میں رشوت دینے والے اور رشوت لینے والے دونوں پر لعنت بھیجی ہے ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- یہ حدیث ابوسلمہ بن عبدالرحمٰن سے بھی مروی ہے انہوں عبداللہ بن عمرو سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۳- اور ابوسلمہ سے ان کے باپ کے واسطے سے بھی مروی ہے انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے لیکن یہ صحیح نہیں ہے، ۴- میں نے عبداللہ بن عبدالرحمٰن دارمی کو کہتے سنا کہ ابوسلمہ ( ابوسلمہ بن عبدالرحمٰن ) کی حدیث جسے انہوں نے عبداللہ بن عمرو سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے اس باب میں سب سے زیادہ اچھی اور سب سے زیادہ صحیح ہے ( جو آگے آ رہی ہے ) ۔ ۵- اس باب میں عبداللہ بن عمرو، عائشہ، ابن حدیدہ اور ام سلمہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Umar bin Abu Salamah] dari [ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknati penyuap dan yang disuap dalam masalah hukum. Ia berkata; Dalam hal ini ada hadits serupa dari Abdullah bin Umar, A`isyah, Ibnu Hadidah dan Ummu Salamah. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih, hadits ini telah diriwayatkan dari [Abu Salamah bin Abdurrahman] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan juga dari Abu Salamah dari ayahnya dari Nabi shallallahu 'alaihi wasallam namun tidak shahih. Ia mengatakan; Serta aku mendengar Abdullah bin Abdurrahman berkata; Hadits Abu Salamah dari Abdullah bin Amru dari Nabi shallallahu 'alaihi wasallam adalah hadits yang lebih hasan dan lebih shahih di dalam bab ini",
          "tr": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), hüküm konusunda rüşvet verene de alana da lanet etmiştir. (Ebû Dâvûd, Akdıyye: 4; İbn Mâce, Ahkâm: 2) Bu konuda Abdullah b. Amr, Âişe, İbn Hadide ve Ümmü Seleme’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahih olup, bu hadis Ebû Seleme b. Abdurrahman yoluyla Abdullah b. Amr’dan da rivâyet edilmiştir. Ebû Seleme’nin babasından da rivâyet edilmiş olup sahih değildir. Abdullah b. Abdurrahman’dan işittim şöyle diyordu: Ebû Seleme’nin Abdullah b. Amr’dan rivâyet ettiği hadis bu konuda en güzel ve en sahih rivâyettir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 16
      }
    },
    {
      "hadithNumber": 1337,
      "arabicNumber": 1337,
      "book": 15,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مُوسَى، مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ خَالِهِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّاشِي وَالْمُرْتَشِي ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Abdullah bin 'Amr narrated:\"The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes a bribe",
          "ur": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے رشوت دینے والے اور رشوت لینے والے دونوں پر لعنت بھیجی ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Abu Musa Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Abu Amir Al 'Aqadi], telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari bibinya [Al Harits bin Abdurrahman] dari [Abu Salamah] dari [Abdullah bin Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknati penyuap dan yang disuap. Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "Abdullah b. Amr’dan rivâyet edildiğine göre, şöyle demiştir: “Rasulullah (Sallallahu aleyhi ve Sellem), rüşvet verene de alana da lanet etmiştir.” Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkam Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 17
      }
    },
    {
      "hadithNumber": 1338,
      "arabicNumber": 1338,
      "book": 15,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو بَكْرٍ، مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ أُهْدِيَ إِلَىَّ كُرَاعٌ لَقَبِلْتُ وَلَوْ دُعِيتُ عَلَيْهِ لأَجَبْتُ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَعَائِشَةَ وَالْمُغِيرَةِ بْنِ شُعْبَةَ وَسَلْمَانَ وَمُعَاوِيَةَ بْنِ حَيْدَةَ وَعَبْدِ الرَّحْمَنِ بْنِ عَلْقَمَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Anas bin Malik narrated that Messenger of Allah (ﷺ) said:\"If trotter (lacking meat) were given to me I would accept it, and if I was invited to (a meal of) it I would accept",
          "ur": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر مجھے کھر بھی ہدیہ کی جائے تو میں قبول کروں گا اور اگر مجھے اس کی دعوت دی جائے تو میں قبول کروں گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- انس کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، عائشہ، مغیرہ بن شعبہ، سلمان، معاویہ بن حیدہ اور عبدالرحمٰن بن علقمہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Abu Bakr Muhammad bin Abdullah bin Bazi'], telah menceritakan kepada kami [Bisyr bin Al Mufadldlal], telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dihadiahkan kepadaku daging berupa bagian paha kambing, niscaya akan aku menerimanya, dan jika aku diundang untuk memakannya, maka aku akan memenuhinya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Ali, A`isyah, Al Mughirah bin Syu'bah, Salman, Mu'awiyah bin Haidah dan Abdurrahman bin 'Alqamah. Abu Isa berkata; Hadits Anas adalah hadits hasan shahih",
          "tr": "Enes b. Mâlik (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Bana bir parça bile hediye edilse kabul ederim. Bir paça yemeğe davet edilsem mutlaka giderdim.” Tirmizî rivâyet etmiştir. Tirmizî: Bu konuda Ali, Âişe, Muğîre b. Şu’be, Selman, Muaviye b. Hayde ve Abdurrahman b. Alkame’den de hadis rivâyet edilmiştir. Tirmizî: Enes hadisi hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 18
      }
    },
    {
      "hadithNumber": 1339,
      "arabicNumber": 1339,
      "book": 15,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ وَإِنَّمَا أَنَا بَشَرٌ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَإِنْ قَضَيْتُ لأَحَدٍ مِنْكُمْ بِشَيْءٍ مِنْ حَقِّ أَخِيهِ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ فَلاَ يَأْخُذْ مِنْهُ شَيْئًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَعَائِشَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أُمِّ سَلَمَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Umm Salamah narrated that the Messenger of Allah (ﷺ) said:\"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it",
          "ur": "ام المؤمنین ام سلمہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ اپنا مقدمہ لے کر میرے پاس آتے ہو میں ایک انسان ہی ہوں، ہو سکتا ہے کہ تم میں سے کوئی آدمی اپنا دعویٰ بیان کرنے میں دوسرے سے زیادہ چرب زبان ہو ۱؎ تو اگر میں کسی کو اس کے مسلمان بھائی کا کوئی حق دلوا دوں تو گویا میں اسے جہنم کا ایک ٹکڑا کاٹ کر دے رہا ہوں، لہٰذا وہ اس میں سے کچھ بھی نہ لے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ام سلمہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ اور عائشہ سے بھی روایت ہے۔",
          "id": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani], telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Hisyam bin Urwah] dari [ayahnya] dari [Zainab binti Ummu Salamah] dari [Ummu Salamah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kalian akan mengadukan perkara kalian kepadaku, padahal aku hanyalah seorang manusia biasa. Bisa jadi sebagian kalian lebih fasih (kuat) dalam mengemukakan argumentasinya. Maka, jika aku memutuskan perkara terhadap salah seorang dari kalian yang mengambil hak saudaranya, sesungguhnya aku mengambilkan potongan untuknya dari potongan api neraka. Maka, janganlah ia mengambil sesuatupun darinya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah dan A`isyah. Abu Isa berkata; Hadits Ummu Salamah adalah hadits hasan shahih",
          "tr": "Ümmü Seleme (r.anha)’dan rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Siz davalarınızı halletmek için bana müracaat ediyorsunuz. Ben de sizin gibi bir insanım delilini ortaya koymada kiminiz kiminizden daha düzgün ifadeli olabilir. Böyle bir durumda ben de o kimsenin lehine hüküm verebilirim. Bu sebeple ben kimin düzgün ifadesine dayanarak kardeşinin hakkından ona bir şey hükmetmiş isem ben ona ateşten bir parça kesmişimdir. Sakın o hükümle kestiğim bu parçayı almasın.” Diğer tahric: Buhârî, Şehâdet; Müslim, Akdıyye Tirmizî: Bu konuda Ebû Hureyre ve Âişe’den de hadis rivâyet edilmiştir. Tirmizî: Ümmü Seleme hadisi hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 19
      }
    },
    {
      "hadithNumber": 1340,
      "arabicNumber": 1340,
      "book": 15,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلِ بْنِ حُجْرٍ، عَنْ أَبِيهِ، قَالَ جَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ وَرَجُلٌ مِنْ كِنْدَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ الْحَضْرَمِيُّ يَا رَسُولَ اللَّهِ إِنَّ هَذَا غَلَبَنِي عَلَى أَرْضٍ لِي ‏.‏ فَقَالَ الْكِنْدِيُّ هِيَ أَرْضِي وَفِي يَدِي لَيْسَ لَهُ فِيهَا حَقٌّ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِلْحَضْرَمِيِّ ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَلَكَ يَمِينُهُ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّ الرَّجُلَ فَاجِرٌ لاَ يُبَالِي عَلَى مَا حَلَفَ عَلَيْهِ وَلَيْسَ يَتَوَرَّعُ مِنْ شَيْءٍ ‏.‏ قَالَ ‏\"‏ لَيْسَ لَكَ مِنْهُ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏ قَالَ فَانْطَلَقَ الرَّجُلُ لِيَحْلِفَ لَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَمَّا أَدْبَرَ ‏\"‏ لَئِنْ حَلَفَ عَلَى مَالِكَ لِيَأْكُلَهُ ظُلْمًا لَيَلْقَيَنَّ اللَّهَ وَهُوَ عَنْهُ مُعْرِضٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُمَرَ وَابْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَالأَشْعَثِ بْنِ قَيْسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ وَائِلِ بْنِ حُجْرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Alqamah bin Wa'il [bin Hujr] narrated from his father who said:\"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him",
          "ur": "وائل بن حجر رضی الله عنہ کہتے ہیں کہ دو آدمی ایک حضر موت سے اور ایک کندہ سے نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے۔ حضرمی نے عرض کیا: اللہ کے رسول! اس ( کندی ) نے میری زمین پر قبضہ کر لیا ہے، اس پر کندی نے کہا: یہ میری زمین ہے اور میرے قبضہ میں ہے، اس پر اس ( حضرمی ) کا کوئی حق نہیں ہے۔ نبی اکرم صلی اللہ علیہ وسلم نے حضرمی سے پوچھا: ”تمہارے پاس کوئی گواہ ہے؟“، اس نے عرض کیا: نہیں، آپ نے فرمایا: ”پھر تو تم اس سے قسم ہی لے سکتے ہو“، اس آدمی نے عرض کیا: اللہ کے رسول! وہ فاجر آدمی ہے اسے اس کی پرواہ نہیں کہ وہ کس بات پر قسم کھا رہا ہے۔ اور نہ وہ کسی چیز سے احتیاط برتتا ہے، آپ نے فرمایا: ”اس سے تم قسم ہی لے سکتے ہو“۔ آدمی قسم کھانے چلا تو رسول اللہ صلی اللہ علیہ وسلم نے جب وہ پیٹھ پھیر کر جانے لگا فرمایا: اگر اس نے ظلماً تمہارا مال کھانے کے لیے قسم کھائی ہے تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اللہ اس سے رخ پھیرے ہو گا۔ امام ترمذی کہتے ہیں: ۱- وائل بن حجر کی حدیث حسن صحیح ہے، ۲- اس باب میں عمر، ابن عباس، عبداللہ بن عمرو، اور اشعث بن قیس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Ahwash] dari [Simak bin Harb] dari ['Alqamah bin Wa`il bin Hujr] dari [ayahnya] ia berkata; Ada seseorang dari Hadlramaut dan seseorang dari Kindah datang menemui Nabi shallallahu 'alaihi wasallam, lalu orang Hadlramaut berkata; Wahai Rasulullah, sesungguhnya tanahku dirampas olehnya, orang Kindah pun berkata; Itu adalah tanahku dan di tanganku, ia tidak memiliki hak sedikit pun. Maka Nabi shallallahu 'alaihi wasallam mengatakan kepada orang Hadlramaut: \"Apakah engkau memiliki bukti?\" Ia menjawab; Tidak. Beliau mengatakan lagi: \"Engkau harus bersumpah.\" Ia menjawab; Wahai Rasulullah, orang ini berlaku curang tidak peduli apa yang telah disumpahkan atasnya serta ia tidak sedikit pun menghindar dari dosa. Beliau bersabda: \"Tidak ada hak bagimu darinya kecuali ini.\" Ia melanjutkan; Lalu orang itu pergi untuk menyumpahinya. Ketika orang itu berpaling, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ia bersumpah terhadap hartamu untuk ia makan dengan cara zhalim, niscaya Allah akan menjumpainya dalam keadaan berpaling darinya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Umar, Ibnu Abbas, Abdullah bin Amr dan Al Asy'ats bin Qais. Abu Isa berkata; Hadits Wa`il bin Ali bin Hujr adalah hadits hasan shahih",
          "tr": "Vâil b. Hucr (r.a.)’in babasından rivâyete göre, şöyle demiştir: Hadramevt bölgesinden bir adamla Kinde’li bir adam Rasûlullah (s.a.v.)’e geldiler. Hadremevtli adam dedi ki: Ey Allah’ın Rasûlü! Bu adam benim toprağımı elimden aldı, bunun üzerine Kindeli dedi ki: O toprak benim mülkümdür, bu toprakta onun hiçbir hakkı yoktur. Bunun üzerine Peygamber (s.a.v.), Hadremevtli adama o toprağın sana ait olduğunu gösterir bir şâhid, bir belge var mıdır? dedi. Adam hayır dedi. O halde davacı olduğun bu kimseye sadece yemin verdirebilirsin başka yapılacak bir şey yok buyurunca; Adam: Bu adam yalancı birisidir neye yemin ettiğine aldırış etmez hiçbirşeyden sakınıp korunmaz dedi. Rasûlullah (s.a.v.)’de bundan başka yapacağım bir şey yoktur buyurdular. Râvî diyor ki: Kindeli adam yemin etmek için minberin yanına doğru giderken arkasını dönünce Rasûlullah (s.a.v.): “Eğer haksız yere senin malını elde etmek için yemin ederse Allah’ın huzuruna, Allah kendisinden yüzçevirmiş olduğu halde varacaktır” buyurdular. Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkâm Tirmizî: Bu konuda Ömer, İbn Abbâs, Abdullah b. Amr ve Eş’as b. Kays’tan da hadis rivâyet edilmiştir. Tirmizî: Vâil b. Hucr hadisi hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 20
      }
    },
    {
      "hadithNumber": 1341,
      "arabicNumber": 1341,
      "book": 15,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَنْبَأَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَغَيْرُهُ، عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي خُطْبَتِهِ ‏ \"‏ الْبَيِّنَةُ عَلَى الْمُدَّعِي وَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ ‏\"‏ ‏.‏ هَذَا حَدِيثٌ فِي إِسْنَادِهِ مَقَالٌ ‏.‏ وَمُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ الْعَرْزَمِيُّ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ ضَعَّفَهُ ابْنُ الْمُبَارَكِ وَغَيْرُهُ ‏.‏",
        "translations": {
          "en": "Amr bin Shu'aib narrated from his father, from his grandfather, that during a Khutbah, the Prophet (ﷺ) said:\"The proof is due from the claimant, and the oath is due from the one the claim is made against",
          "ur": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنے خطبہ میں فرمایا: ”گواہ مدعی کے ذمہ ہے اور قسم مدعی علیہ کے ذمہ ہے“۔ امام ترمذی کہتے ہیں: اس حدیث کی سند میں کلام ہے۔ محمد بن عبیداللہ عرزمی اپنے حفظ کے تعلق سے حدیث میں ضعیف گردانے جاتے ہیں۔ ابن مبارک وغیرہ نے ان کی تضعیف کی ہے۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah memberitakan kepada kami [Ali bin Mushir] dan selainnya dari [Muhammad bin Ubaidullah] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam mengatakan dalam khutbahnya: \"Menghadirkan bukti itu wajib atas orang tertuduh dan mengucapkan sumpah wajib atas orang yang menuntut.\" Hadits ini terdapat cela di dalam sanadnya dan Muhammad bin Ubaidullah didha'ifkan dalam periwayatan hadits dari sisi hafalannya. Ibnu Al Mubarak dan yang lainnya mendha'ifkannya",
          "tr": "Amr b. Şuayb (r.a.)’ın babasından ve dedesinden rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.), bir hutbesinde şöyle demiştir: “İspat edip delil getirmek davacıya yemin etmekte davalıya gerekir.” Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkâm Tirmizî: Bu hadisin senedi hakkında konuşulmuştur. Muhammed b. Ubeydullah el Arzemî’nin hafızası yönünden hadiste zayıf olduğu kaydedilmiştir. İbn’ül Mübarek ve ve başka hadisçiler onun zayıf olduğunu söylemektedirler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 21
      }
    },
    {
      "hadithNumber": 1342,
      "arabicNumber": 1342,
      "book": 15,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَهْلِ بْنِ عَسْكَرٍ الْبَغْدَادِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى أَنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي وَالْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ ‏.‏",
        "translations": {
          "en": "Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against",
          "ur": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ کیا کہ قسم مدعی علیہ پر ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے کہ گواہ مدعی کے ذمہ ہے اور قسم مدعی علیہ پر ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Sahl bin 'Askar Al Baghdadi], telah menceritakan kepada kami [Muhammad bin Yusuf], telah menceritakan kepada kami [Nafi' bin Umar Al Jumahi] dari [Abdullah bin Abu Mulaikah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam menetapkan sumpah atas orang yang menuntut. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama dari kalangan Nabi shallallahu 'alaihi wasallam dan selain mereka, bahwa menghadirkan bukti itu wajib atas orang tertuduh dan mengucapkan sumpah wajib atas orang yang menuntut",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre, Rasûlullah Sallallahu Aleyhi ve Sellem: “Yemin etmek davalıya düşer diye hüküm vermiştir.” Diğer tahric: Buhari, şehadat, rehn, tefsiri sure (Al-i imran); Müslim, akdiye; Ebu Davud, akdiye; Tirmizî: Bu hadis hasen sahih olup Rasûlullah (s.a.v.)’in ashabından ve başkalarından ilim adamlarının uygulaması bu hadise göre olup “İspat edebilmek için delil ve şâhid getirmek davacıya, yemin etmek de davalıya gerekir” derler. BU HADİS’İN EBU DAVUD RİVAYETİ VE İZAH İÇİN BURAYA TIKLAYIN"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 1343,
      "arabicNumber": 1343,
      "book": 15,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْيَمِينِ مَعَ الشَّاهِدِ الْوَاحِدِ ‏.‏ قَالَ رَبِيعَةُ وَأَخْبَرَنِي ابْنٌ لِسَعْدِ بْنِ عُبَادَةَ قَالَ وَجَدْنَا فِي كِتَابِ سَعْدٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَجَابِرٍ وَابْنِ عَبَّاسٍ وَسُرَّقَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ الْوَاحِدِ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated:\"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک گواہ کے ساتھ مدعی کی قسم سے ( مدعی کے حق میں ) فیصلہ دیا۔ ربیعہ کہتے ہیں: مجھے سعد بن عبادہ کے بیٹے نے خبر دی کہ ہم نے سعد رضی الله عنہ کی کتاب میں لکھا پایا کہ نبی اکرم صلی اللہ علیہ وسلم نے ”ایک گواہ اور مدعی کی قسم سے ( مدعی کے حق میں ) فیصلہ دیا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس باب میں علی، جابر، ابن عباس اور سرق رضی الله عنہم سے بھی احادیث آئی ہیں، ۲- ابوہریرہ رضی الله عنہ کی حدیث کہ ”نبی اکرم صلی اللہ علیہ وسلم نے ایک گواہ اور مدعی کی قسم سے ( مدعی کے حق میں ) فیصلہ کیا“ حسن غریب ہے۔",
          "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim Ad Dauraqi], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] ia berkata; Telah menceritakan kepadaku [Rabi'ah bin Abu Abdurrahman] dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam menetapkan sumpah harus disertai satu orang saksi. [Rabi'ah] berkata; Dan telah mengabarkan kepadaku [anak Sa'd bin Ubadah] ia berkata; Kami mendapatkan juga dalam buku milik [Sa'd bin Ubadah] bahwa Nabi shallallahu 'alaihi wasallam menetapkan sumpah harus disertai seorang saksi. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ali, Jabir, Ibnu Abbas dan Surraq. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan gharib",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.), tek şâhidle beraber yemin ettirerek hüküm verdi.” Rabia diyor ki: Sa’d b. Ubâde’nin oğlu bana haber verip dedi ki: Sa’d’ın notları arasında “Rasûlullah (s.a.v.)’in bir şâhidle birlikte yemin ettirerek hüküm verdiğini bulduk.” Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkam Tirmizî: Bu konuda Ali, Câbir, İbn Abbâs ve Sürrak’tan da hadis rivâyet edilmiştir. Tirmizî: Ebû Hureyre’nin “Rasûlullah (s.a.v.), tek şâhidle birlikte yemin verdirerek hüküm verdi” dediği hadis hasen garibtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 23
      }
    },
    {
      "hadithNumber": 1344,
      "arabicNumber": 1344,
      "book": 15,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ أَبَانَ، قَالاَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ ‏.‏",
        "translations": {
          "en": "Jabir narrated:\"The Prophet (ﷺ) passed judgement based on oath along with a witness",
          "ur": "جابر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک گواہ اور مدی کی قسم سے ( مدعی کے حق میں ) فیصلہ دیا۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad bin Aban] keduanya berkata; Telah menceritakan kepada kami [Abdul Wahhab Ats Tsaqafi] dari [Ja'far bin Muhammad] dari [ayahnya] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam menetapkan sumpah harus disertai satu orang saksi",
          "tr": "Câbir (r.a.)’den rivâyete göre: “Rasûlullah (s.a.v.), bir şâhidle beraber yemin ettirerek hüküm vermiştir.” Diğer tahric: İbn Mâce, Ahkam"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 24
      }
    },
    {
      "hadithNumber": 1345,
      "arabicNumber": 1345,
      "book": 15,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ الْوَاحِدِ ‏.‏ قَالَ وَقَضَى بِهَا عَلِيٌّ فِيكُمْ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ وَهَكَذَا رَوَى سُفْيَانُ الثَّوْرِيُّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏.‏ وَرَوَى عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ وَيَحْيَى بْنُ سُلَيْمٍ هَذَا الْحَدِيثَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ رَأَوْا أَنَّ الْيَمِينَ مَعَ الشَّاهِدِ الْوَاحِدِ جَائِزٌ فِي الْحُقُوقِ وَالأَمْوَالِ ‏.‏ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ وَقَالُوا لاَ يُقْضَى بِالْيَمِينِ مَعَ الشَّاهِدِ الْوَاحِدِ إِلاَّ فِي الْحُقُوقِ وَالأَمْوَالِ ‏.‏ وَلَمْ يَرَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَهْلِ الْكُوفَةِ وَغَيْرِهِمْ أَنْ يُقْضَى بِالْيَمِينِ مَعَ الشَّاهِدِ الْوَاحِدِ ‏.‏",
        "translations": {
          "en": "Ja'far bin Muhammad narrated from his father:\"The Prophet (ﷺ) passed judgement based on an oath along with one witness.\" He said: \"And 'Ali judged between you based on it",
          "ur": "ابو جعفر صادق سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک گواہ کے ساتھ مدعی کی قسم سے ( مدعی کے حق میں ) فیصلہ کیا، راوی کہتے ہیں: اور علی نے بھی اسی سے تمہارے درمیان فیصلہ کیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث زیادہ صحیح ہے، ۲- اسی طرح سفیان ثوری نے بھی بطریق: «عن جعفر بن محمد عن أبيه عن النبي صلى الله عليه وسلم» مرسلاً روایت کی ہے۔ اور عبدالعزیز بن ابوسلمہ اور یحییٰ بن سلیم نے اس حدیث کو بطریق: «عن جعفر بن محمد عن أبيه عن علي عن النبي صلى الله عليه وسلم» ( مرفوعاً ) روایت کیا ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے، ان لوگوں کی رائے ہے کہ حقوق اور اموال کے سلسلے میں ایک گواہ کے ساتھ مدعی کی قسم کھلانا جائز ہے۔ مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے۔ یہ لوگ کہتے ہیں کہ ایک گواہ کے ساتھ مدعی کی قسم سے صرف حقوق اور اموال کے سلسلے ہی میں فیصلہ کیا جائے گا۔ ۴- اور اہل کوفہ وغیرہم میں سے بعض اہل علم ایک گواہ کے ساتھ مدعی کی قسم سے فیصلہ کرنے کو جائز نہیں سمجھتے ۱؎۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah mengabarkan kepada kami [Isma'il bin Ja'far] telah menceritakan kepada kami [Ja'far bin Muhammad] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam menetapkan sumpah harus disertai satu orang saksi. Ia melanjutkan; Dan Ali telah melakukannya di antara kalian. Abu Isa berkata; Ini lebih shahih, demikianlah [Sufyan Ats Tsauri] meriwayatkan dari [Ja'far bin Muhammad] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam secara mursal. Dan [Abdul Aziz bin Abu Salamah] dan [Yahya bin Sulaim] meriwayatkan hadits ini dari [Ja'far bin Muhammad] dari [ayahnya] dari [Ali] dari Nabi shallallahu 'alaihi wasallam. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, mereka berpendapat bahwa sumpah dengan menyertai satu orang saksi adalah boleh dalam menuntut hak dan harta sementara sebagian ulama dari penduduk Kufah dan selain mereka tidak berpendapat bahwa sumpah ditetapkan beserta satu orang saksi",
          "tr": "Cafer b. Muhammed (radıyallahü anh)’in babasından rivâyete göre: “Peygamber (sallallahü aleyhi ve sellem), tek şâhidle birlikte yemin verdirerek hüküm verdi.” b. Muhammed: Ali de sizin aranızda buna göre hüküm vermişti. (Ebû Dâvûd, Akdıyye: 21; İbn Mâce, Ahkam: 31) Bu rivâyet daha sağlamdır. Aynı şekilde Sûfyân es Sevrî, Cafer b. Muhammed’den ve babasından mürsel olarak rivâyet etmiştir. Abdulaziz b. ebî Seleme ve Yahya b. Süleym’de bu hadisi Cafer b. Muhammed’den babasından ve Ali’den rivâyet etmişlerdir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göre olup tek şâhidle birlikte yemin verdirmenin mal ve hukukta caiz olduğu görüşündedirler. Mâlik b. enes, Şâfii, Ahmed ve İshâk bunlardan olup şöyle derler: “Sadece hukuk ve mal davalarında tek şâhidle birlikte yemine dayanılarak hüküm verilir. Küfeliler ve daha başkaları ise bu görüşte değillerdir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 25
      }
    },
    {
      "hadithNumber": 1346,
      "arabicNumber": 1346,
      "book": 15,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ نَصِيبًا - أَوْ قَالَ شِقْصًا أَوْ قَالَ شِرْكًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ بِقِيمَةِ الْعَدْلِ فَهُوَ عَتِيقٌ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏\"‏ ‏.‏ قَالَ أَيُّوبُ وَرُبَّمَا قَالَ نَافِعٌ فِي هَذَا الْحَدِيثِ يَعْنِي فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ سَالِمٌ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
        "translations": {
          "en": "Ibn 'Umar narrated that the Prophet (ﷺ) said:\"Whoever frees a portion\" or, he said: \"a part\" or he said: \"a share he owns of a slave, then he can afford the remainder of the price according to the reasonable price, then he will be free. Otherwise he has freed as much as he has freed (only).\" Ayyub (one of the narrators) said: \"Perhaps Nafi said in this Hadith: 'Meaning he has freed as much of him as he has freed",
          "ur": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی مشترک غلام میں سے اپنا حصہ آزاد کیا“، اور اس کے پاس اتنا مال ہو جو غلام کی واجبی قیمت کو پہنچ رہا ہو تو وہ اس مال سے باقی شریکوں کا حصہ ادا کرے گا اور غلام ( پورا ) آزاد ہو جائے گا ورنہ جتنا آزاد ہوا ہے اتنا ہی آزاد ہو گا“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اسے سالم بن عبداللہ نے بھی بطریق: «عن أبيه عن النبي صلى الله عليه وسلم» اسی طرح روایت کیا ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa memerdekakan bagian (nashib), atau beliau bersabda: bagian (siqshan), atau \"bagian dari sekutunya pada seorang budak, jika ia memiliki harta yang mencapai harga budak tersebut (dari jumlah kekurangan yang tersisa) dengan hitungan yang adil (pantas), maka budak itu merdeka, namun jika ia tidak mempunyai (sejumlah harta tersebut), ia hanya memerdekakan bagian yang ia merdekakan.\" Ayyub berkata; Dan seringkali Nafi' berkata tentang hadits ini; Yakni ia telah memerdekakan bagian yang ia merdekakan. Abu Isa berkata; Hadits Ibnu Umar adalah hadits hasan shahih dan [Salim] telah meriwayatkan dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti itu",
          "tr": "İbn Ömer (r.a.)’den rivâyet edildiğine göre Rasûlullah (s.a.v.) şöyle buyurdu: “Her kim bir köledeki hissesini, nasibini veya payını azat ederse ve bu kimsenin kölenin diğer yarı bedelini karşılayacak kadar malı bulunursa o yarısını da normal bir bedelle diğer ortağının hissesini öder ve o köle tamamen azat olmuş olur ve hürriyetine kavuşur, köle tamamen azat eden ortağın diğer yarı bedelini ödeyecek kadar parası yoksa azat edilen kadarı yani yarısı azat edilmiş olur.” Eyyûb diyor ki: Nafi’ bu hadiste “Azat ettiği kadarı azat edilmiş olur” demiş olabilir. Diğer tahric: Buhârî, Itk Tirmizî: İbn Ömer hadisi hasen sahihtir. Sâlim’de babasından bu hadisin bir benzerini rivâyet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 26
      }
    },
    {
      "hadithNumber": 1347,
      "arabicNumber": 1347,
      "book": 15,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا بِذَلِكَ الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ ثَمَنَهُ فَهُوَ عَتِيقٌ مِنْ مَالِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Salim narrated from his father that the Prophet (ﷺ) said:\"Whoever frees a portion of a slave he owns, then he can afford the remainder of the price, then he should free him with his wealth",
          "ur": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے مشترک غلام میں سے اپنا حصہ آزاد کیا اور اس کے پاس اتنا مال ہو جو اس کی قیمت کو پہنچ رہا ہو ( تو وہ باقی شریکوں کا حصہ بھی ادا کرے گا ) اور وہ اس کے مال سے آزاد ہو جائے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan hadits itu kepada kami [Al Hasan bin Ali Al Khallal], telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang memerdekakan bagian dirinya pada seorang budak, maka jika hartanya mencapai harga (tebusan) nya, ia (budak) merdeka karena hartanya.\" Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "Sâlim (r.a.)’in babasından rivâyetine göre, Nebi (s.a.v.) şöyle demiştir: ''Her kim bir köledeki payını azat ederse o kölenin tamamını karşılayacak parası da varsa o köle onun malından azat edilmiş olur.” Diğer tahric: Buhârî, Itk Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 27
      }
    },
    {
      "hadithNumber": 1348,
      "arabicNumber": 1348,
      "book": 15,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ نَصِيبًا - أَوْ قَالَ شِقْصًا فِي مَمْلُوكٍ فَخَلاَصُهُ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ قِيمَةَ عَدْلٍ ثُمَّ يُسْتَسْعَى فِي نَصِيبِ الَّذِي لَمْ يُعْتِقْ غَيْرَ مَشْقُوقٍ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، نَحْوَهُ وَقَالَ ‏\"‏ شَقِيصًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهَكَذَا رَوَى أَبَانُ بْنُ يَزِيدَ، عَنْ قَتَادَةَ، مِثْلَ رِوَايَةِ سَعِيدِ بْنِ أَبِي عَرُوبَةَ ‏.‏ وَرَوَى شُعْبَةُ، هَذَا الْحَدِيثَ عَنْ قَتَادَةَ، وَلَمْ يَذْكُرْ فِيهِ أَمْرَ السِّعَايَةِ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي السِّعَايَةِ فَرَأَى بَعْضُ أَهْلِ الْعِلْمِ السِّعَايَةَ فِي هَذَا ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ وَبِهِ يَقُولُ إِسْحَاقُ ‏.‏ وَقَدْ قَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا كَانَ الْعَبْدُ بَيْنَ الرَّجُلَيْنِ فَأَعْتَقَ أَحَدُهُمَا نَصِيبَهُ فَإِنْ كَانَ لَهُ مَالٌ غَرِمَ نَصِيبَ صَاحِبِهِ وَعَتَقَ الْعَبْدَ مِنْ مَالِهِ وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ عَتَقَ مِنَ الْعَبْدِ مَا عَتَقَ وَلاَ يُسْتَسْعَى ‏.‏ وَقَالُوا بِمَا رُوِيَ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَهَذَا قَوْلُ أَهْلِ الْمَدِينَةِ وَبِهِ يَقُولُ مَالِكُ بْنُ أَنَسٍ وَالشَّافِعِيُّ وَأَحْمَدُ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:\"Whoever frees a portion\" or he said: \"a part of a slave, then he should finish paying his price if he can afford it. If he can not afford to pay reasonable price then he should be allowed to work to earn the amount that will free him without overburdening him.\" (Another chain) similar, and he said: \"a part",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے مشترک غلام میں سے اپنا حصہ آزاد کیا تو باقی حصے کی آزادی بھی اسی کے مال سے ہو گی اگر اس کے پاس مال ہے، اور اگر اس کے پاس مال نہیں ہے تو اس غلام کی واجبی قیمت لگائی جائے گی، پھر غلام کو پریشانی میں ڈالے بغیر اسے موقع دیا جائے گا کہ وہ کمائی کر کے اس شخص کا حصہ ادا کر دے جس نے اپنا حصہ آزاد نہیں کیا ہے“۔ محمد بن بشار سے بھی ایسے ہی روایت ہے اور اس میں «شقصاً» کے بجائے «شقیصا» ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور اسی طرح ابان بن یزید نے قتادہ سے سعید بن ابی عروبہ کی حدیث کے مثل روایت کی ہے، ۳- اور شعبہ نے بھی اس حدیث کو قتادہ سے روایت کیا ہے اور اس میں انہوں نے اس سے آزادی کے لیے کمائی کرانے کا ذکر نہیں کیا ہے، ۴- سعایہ ( کمائی کرانے ) کے سلسلے میں اہل علم کا اختلاف ہے، بعض اہل علم نے اس بارے میں سعایہ کو جائز کہا ہے۔ اور یہی سفیان ثوری اور اہل کوفہ کا بھی قول ہے، اور اسحاق بن راہویہ بھی اسی کے قائل ہیں، ۵- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی روایت ہے، ۶- اور بعض اہل علم نے کہا ہے کہ جب غلام دو آدمیوں میں مشترک ہو اور ان میں سے ایک اپنا حصہ آزاد کر دے تو اگر اس کے پاس مال ہو تو وہ اپنے ساجھی دار کے حصے کا تاوان ادا کرے گا اور غلام اسی کے مال سے آزاد ہو جائے گا، اور اگر اس کے پاس مال نہیں ہے تو غلام کو جتنا آزاد کیا گیا ہے اتنا آزاد ہو گا، اور باقی حصہ کی آزادی کے لیے اس سے کمائی نہیں کرائی جائے گی۔ اور ان لوگوں نے نبی اکرم صلی اللہ علیہ وسلم سے مروی ابن عمر رضی الله عنہما کی حدیث کی رو سے یہ بات کہی ہے، اور یہی اہل مدینہ کا بھی قول ہے۔ اور مالک بن انس، شافعی اور احمد بھی اسی کے قائل ہیں۔",
          "id": "Telah menceritakan kepada kami [Ali bin Khasyram], telah mengabarkan kepada kami [Isa bin Yunus] dari [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memerdekakan bagian.\" Atau beliau bersabda: \"Bagian pada seorang budak, maka sisanya ada pada hartanya jika ia mempunyai harta, namun jika tidak memiliki harta maka ia diberi harga yang adil (pantas), kemudian ia dapat dipekerjakan seharga bagian yang belum dimerdekakan tanpa membebani.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Umar. Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'id bin Abu 'Arubah] seperti itu namun dengan sabda beliau: \"Bagian.\" Abu Isa berkata; Hadits ini hasan shahih, seperi inilah [Aban bin Yazid] meriwayatkan dari [Qatadah] seperti riwayat Sa'id bin Abu 'Arubah sedangkan [Syu'bah] meriwayatkan hadits ini dari [Qatadah] namun tidak menyebutkan urusan usaha budak tersebut di dalamnya. Sementara para ulama berselisih tentang usaha budak tersebut, sebagian ulama berpendapat bahwa harus ada usaha budak tersebut, ini adalah pendapat Sufyan Ats Tsauri dan ulama Kufah serta inilah yang diucapkan oleh Ishaq. Sedangkan sebagian ulama telah berpendapat; Jika budak itu di antara dua orang, maka yang memerdekakan adalah salah satu dari keduanya. Jika ia memiliki harta maka ia membayar hutang bagian temannya dan memerdekakan seorang budak dari hartanya sedangkan jika ia tidak memiliki harta maka ia memerdekakan dari seorang budak apa yang ia merdekakan dan tidak diperkerjakan. Mereka berpendapat dengan apa yang telah diriwayatkan dari Umar dari Nabi shallallahu 'alaihi wasallam, ini juga pendapat ulama Madinah serta Malik, Asy Syafi'i, Ahmad dan Ishaq juga berpendapat seperti itu",
          "tr": "Muhammed b. Beşşâr, Yahya b. Saîd’den, Saîd b. ebî Arûbe’den bu hadisin benzerini bize aktarmıştır ve bu rivâyette Şakîsan (hisseni) demiştir. Bu hadis hasen sahihtir. Ebban b. Yezîd de Katâde’den aynı şekilde Saîd b. ebî Arûbe’nin rivâyeti gibi rivâyet etmiştir. Şu’be bu hadisi Katâde’den rivâyet ederek Siaye (kölenin çalıştırılıp kendi parasını ödemesi) konusunu zikretmedi. Sûfyân es Sevrî, Küfeliler ve İshâk bu şekilde düşünmektedirler. Kimi ilim adamları ise şöyle demektedirler: “Köle iki kişi arasında ortak olup onlardan biri kendi payını azat ettiği vakit şayet malı varsa ortağının hissesini de ödeyerek köleyi kendi malından azat etmiş olur. Eğer malı yoksa köle azat ettiği kadar kısmen azat edilmiş olur ve siaya (çalıştırılıp parasını kendisine ödettirme) yapılmaz. Bazı ilim adamları İbn Ömer’den rivâyet olunan bir hadise dayanarak böyle söylerler. Medînelilerin görüşü de böyledir. Mâlik b. Enes, Şâfii, Ahmed ve İshâk ta aynı kanaattedirler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 1349,
      "arabicNumber": 1349,
      "book": 15,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعُمْرَى جَائِزَةٌ لأَهْلِهَا أَوْ مِيرَاثٌ لأَهْلِهَا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ زَيْدِ بْنِ ثَابِتٍ وَجَابِرٍ وَأَبِي هُرَيْرَةَ وَعَائِشَةَ وَابْنِ الزُّبَيْرِ وَمُعَاوِيَةَ ‏.‏",
        "translations": {
          "en": "Samurah narrated that the Prophet (ﷺ) said:\"The lifelong gift is permitted for its inhabitant\" or:\"is an inheritance for its inhabitant",
          "ur": "سمرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عمریٰ ۱؎ جس کو دیا گیا اس کے گھر والوں کا ہو جاتا ہے“، یا فرمایا: ”عمریٰ جس کو دیا گیا اس کے گھر والوں کی میراث ہے“۔ امام ترمذی کہتے ہیں: اس باب میں زید بن ثابت، جابر، ابوہریرہ، عائشہ، عبداللہ بن زبیر اور معاویہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Nabiyullah shallallahu 'alaihi wasallam bersabda: \"Umra itu boleh diberikan kepada keluarga atau ahli waris keluarganya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Zaid bin Tsabit, Jabir, Abu Hurairah, A`isyah, Ibnu Az Zubair dan Mu'awiyah",
          "tr": "Semure (r.a.)’den rivâyete göre, Nebi (s.a.v.), şöyle buyurmuştur: “Umra (Ömür boyu) denilerek yapılan bağışlar, yapılan kimse için caiz olup bağışı yapan kimsenin ehli için mirastır.” (Yani ömür boyu o kimse o maldan istifade eder o kimse ölünce bağışı yapanın varislerine geçer.) Diğer tahric: Ebû Dâvûd, Ticarat Tirmizî: Bu konuda Zeyd b. Sabit, Câbir, Ebû Hureyre, Âişe, İbnûz Zübeyr ve Muaviye’den de hadis rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 29
      }
    },
    {
      "hadithNumber": 1350,
      "arabicNumber": 1350,
      "book": 15,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَيُّمَا رَجُلٍ أُعْمِرَ عُمْرَى لَهُ وَلِعَقِبِهِ فَإِنَّهَا لِلَّذِي يُعْطَاهَا لاَ تَرْجِعُ إِلَى الَّذِي أَعْطَاهَا لأَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيثُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهَكَذَا رَوَى مَعْمَرٌ وَغَيْرُ وَاحِدٍ عَنِ الزُّهْرِيِّ مِثْلَ رِوَايَةِ مَالِكٍ ‏.‏ وَرَوَى بَعْضُهُمْ عَنِ الزُّهْرِيِّ وَلَمْ يَذْكُرْ فِيهِ ‏\"‏ وَلِعَقِبِهِ ‏\"‏ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ قَالُوا إِذَا قَالَ هِيَ لَكَ حَيَاتَكَ وَلِعَقِبِكَ ‏.‏ فَإِنَّهَا لِمَنْ أُعْمِرَهَا لاَ تَرْجِعُ إِلَى الأَوَّلِ ‏.‏ وَإِذَا لَمْ يَقُلْ لِعَقِبِكَ فَهِيَ رَاجِعَةٌ إِلَى الأَوَّلِ إِذَا مَاتَ الْمُعْمَرُ ‏.‏ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ ‏.‏ وَرُوِيَ مِنْ غَيْرِ وَجْهٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْعُمْرَى جَائِزَةٌ لأَهْلِهَا ‏\"‏ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ قَالُوا إِذَا مَاتَ الْمُعْمَرُ فَهِيَ لِوَرَثَتِهِ وَإِنْ لَمْ تُجْعَلْ لِعَقِبِهِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏",
        "translations": {
          "en": "Jabir narrated that the Prophet (ﷺ) said:\"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance",
          "ur": "جابر رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس آدمی کو عمریٰ دیا گیا وہ اس کا ہے اور اس کے گھر والوں یعنی ورثاء کا ہے کیونکہ وہ اسی کا ہو جاتا ہے جس کو دیا جاتا ہے، عمری دینے والے کی طرف نہیں لوٹتا ہے اس لیے کہ اس نے ایسا عطیہ دیا ہے جس میں میراث ثابت ہو گئی ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور اسی طرح معمر اور دیگر کئی لوگوں نے زہری سے مالک کی روایت ہی کی طرح روایت کی ہے اور بعض نے زہری سے روایت کی ہے، مگر اس نے اس میں «ولعقبه» کا ذکر نہیں کیا ہے، ۳- اور یہ حدیث اس کے علاوہ اور بھی سندوں سے جابر سے مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عمریٰ جس کو دیا جاتا ہے اس کے گھر والوں کا ہو جاتا ہے“ اور اس میں «لعقبه» کا ذکر نہیں ہے۔ یہ حدیث حسن صحیح ہے، ۴- بعض اہل علم کا اسی پر عمل ہے، یہ لوگ کہتے ہیں کہ جب دینے والا یہ کہے کہ یہ تیری عمر تک تیرا ہے اور تیرے بعد تیری اولاد کا ہے تو یہ اسی کا ہو گا جس کو دیا گیا ہے۔ اور دینے والے کے پاس لوٹ کر نہیں جائے گا اور جب وہ یہ نہ کہے کہ ( تیری اولاد ) کا بھی ہے تو جسے دیا گیا ہے اس کے مرنے کے بعد دینے والے کا ہو جائے گا۔ مالک بن انس اور شافعی کا یہی قول ہے ۱؎، ۵- اور دیگر کئی سندوں سے مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عمریٰ جسے دیا گیا ہے اس کے گھر والوں کا ہو جائے گا“، ۶- بعض اہل علم کا اسی پر عمل ہے۔ وہ کہتے ہیں: جس کو گھر دیا گیا ہے اس کے مرنے کے بعد وہ گھر اس کے وارثوں کا ہو جائے گا اگرچہ اس کے وارثوں کو نہ دیا گیا ہو۔ سفیان ثوری، احمد اور اسحاق بن راہویہ کا یہی قول ہے ۲؎۔",
          "id": "Telah menceritakan kepada kami [Al Anshari], telah menceritakan kepada kami [Ma'n] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Salamah] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Siapapun orangnya yang diberi sebidang tanah untuknya dan keturunannya, maka pemberian itu untuk orang yang diberinya tidak kembali kepada orang yang memberikannya, karena ia memberikan suatu pemberian termasuk di dalamnya para ahli warisnya.\" Abu Isa berkata; Hadits ini hasan shahih, seperti inilah yang diriwayatkan oleh [Ma'mar] dan masih banyak lagi dari [Az Zuhri] seperti riwayat [Malik]. Sebagian mereka meriwayatkan dari Az Zuhri namun tidak menyebutkan dalam hadits itu lafazh wa li'aqabihi. Hadits ini diriwayatkan juga dari jalur lain dari Jabir dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Umra itu boleh diberikan kepada keluarga, namun tidak termasuk keturunannya.\" Hadits ini hasan shahih dan menjadi pedoman amal menurut sebagian ulama, mereka berpendapat; Jika pemberi berkata; Pemberian ini untukmu selama hidupmu dan untuk keturunanmu, maka pemberian itu untuk orang yang diberikan dan tidak kembali kepada orang pertama. Namun jika pemberi tidak mengatakan untuk keturunannya maka hal itu kembali kepada orang pertama jika orang yang diberi itu meninggal, ini adalah pendapat Malik bin Anas dan Asy Syafi'i. Dan telah diriwayatkan dari jalur lain dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Umra itu boleh diberikan kepada keluarganya.\" Hadits ini menjadi pedoman amal menurut sebagian ulama, mereka berpendapat; Jika orang yang diberi itu meninggal, maka pemberian itu diberikan kepada ahli warisnya, jika tidak ada maka untuk keturunannya, ini adalah pendapat Sufyan Ats Tsauri, Ahmad dan Ishaq",
          "tr": "Câbir (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her hangi bir kimseye veya çocuklarına ömürlük diyerek bir mülk verilirse o mülk verilen kimsenindir, veren kimseye dönmez çünkü miras geçerli olan bir bağışta bulunmuştur.” (Buhârî, Hibe: 32; Müslim, Hibat: 22) Bir kimsenin bir başkasına ömrü olduğu süre bu mülkü ona bağışladım veya ben sağ oldukça bu mülkü ona bağışladım veya ben sağ olduğum müddetçe bu mülkü ona bağışladım şeklindeki bağış şeklidir bazen ölümünden sonra benimdir, bazen ölümümden sonra varislerimindir şeklinde ilaveler de yapılabilen cahiliye dönemi bağış modellerindendir. Çok değişik hükümleri vardır; detaylı bilgi için fıkıh kitaplarına bakılmalıdır. Bu hadis hasen sahihtir. Ma’mer ve başkaları Zührî’den Mâlik’in rivâyetine benzer şekilde rivâyet etmişlerdir. Bazıları da Zührî’den rivâyet ederek “akıbîhi” (çocuklarına) kelimesini zikretmemişlerdir. bu hadis başka bir şekilde Câbir’den şöyle de rivâyet edilmiştir: “Umra sadece yapılan kimse için caizdir.” Çoluk çocuğuna ve zürriyetine geçmez bu hadis hasen sahihtir. Bazı ilim adamlarının uygulaması bu hadise göre olup şöyle derler: “Umra yapan kimse; hayatta olduğu sürece senin ve çoluk çocuğunun derse o mal o kimseye ait olur ve umrayı yapana geri dönmez. Fakat senin çoluk çocuğunundur demezse umra yapan kimseye umra yapılan ölünce geri döner.” Mâlik b. Enes ve Şâfii bu görüştedir. (sallallahü aleyhi ve sellem)’den başka şekilde “Umra yapılan kimse için caizdir” buyruğu da vardır ki bazı ilim adamları da uygulamalarını bu hadise göre yaparlar ve derler ki: Umra yapılan kimse öldüğünde o mal varislerine denmemiş olsa bile o kimsenin veresesine geçmiş olur. Sûfyân es Sevrî, Ahmed ve İshâk bu görüştedirler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 30
      }
    },
    {
      "hadithNumber": 1351,
      "arabicNumber": 1351,
      "book": 15,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْعُمْرَى جَائِزَةٌ لأَهْلِهَا وَالرُّقْبَى جَائِزَةٌ لأَهْلِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ أَبِي الزُّبَيْرِ بِهَذَا الإِسْنَادِ عَنْ جَابِرٍ مَوْقُوفًا وَلَمْ يَرْفَعْهُ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ أَنَّ الرُّقْبَى جَائِزَةٌ مِثْلَ الْعُمْرَى ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَفَرَّقَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَهْلِ الْكُوفَةِ وَغَيْرِهِمْ بَيْنَ الْعُمْرَى وَالرُّقْبَى فَأَجَازُوا الْعُمْرَى وَلَمْ يُجِيزُوا الرُّقْبَى ‏.‏ قَالَ أَبُو عِيسَى وَتَفْسِيرُ الرُّقْبَى أَنْ يَقُولَ هَذَا الشَّىْءُ لَكَ مَا عِشْتَ فَإِنْ مِتَّ قَبْلِي فَهِيَ رَاجِعَةٌ إِلَىَّ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ الرُّقْبَى مِثْلُ الْعُمْرَى وَهِيَ لِمَنْ أُعْطِيَهَا وَلاَ تَرْجِعُ إِلَى الأَوَّلِ ‏.‏",
        "translations": {
          "en": "Jabir narrated that the Messenger of Allah (ﷺ) said:\"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant",
          "ur": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عمریٰ جس کو دیا گیا اس کے گھر والوں کا ہے اور رقبیٰ ۱؎ بھی جس کو دیا گیا ہے اس کے گھر والوں کا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اور بعض نے اسی سند سے ابوزبیر سے روایت کی ہے کہ انہوں نے اسے جابر سے موقوفاً نقل کیا ہے، اسے نبی اکرم صلی اللہ علیہ وسلم تک مرفوع نہیں کیا ہے، ۳- رقبیٰ کی تفسیر یہ ہے کہ کوئی آدمی کہے کہ یہ چیز جب تک تم زندہ رہو گے تمہاری ہے اور اگر تم مجھ سے پہلے مر گئے تو یہ پھر میری طرف لوٹ آئے گی، ۴- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے کہ عمریٰ کی طرح رقبیٰ بھی جسے دیا گیا ہے اس کے گھر والوں ہی کا ہو گا۔ احمد اور اسحاق بن راہویہ کا یہی قول ہے۔ اور اہل کوفہ وغیرہم میں سے بعض اہل علم نے عمریٰ اور رقبیٰ کے درمیان فرق کیا ہے، ان لوگوں نے عمریٰ کو تو معمر ( جس کے نام چیز دی گئی تھی ) کی موت کے بعد اس کے ورثاء کا حق بتایا ہے اور رقبیٰ کو کہا ہے کہ ورثاء کا حق نہیں ہو گا بلکہ وہ دینے والی کی طرف لوٹ جائے گا۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Husyaim] dari [Dawud bin Abu Hind] dari [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Umra itu boleh diberikan kepada keluarga dan Ruqba juga boleh diberikan kepada keluarga.\" Abu Isa berkata; Hadits ini hasan, dan sebagian mereka meriwayatkan dari Abu Az Zubair dengan sanad ini dari Jabir secara mauquf dan tidak memarfu'kannya. Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, bahwa Ruqba itu sama seperti Umra, ini adalah pendapat Ahmad dan Ishaq namun sebagian ulama dari ulama Kufah dan selain mereka membedakan antara Umra dan Ruqba, mereka membolehkan Umra namun tidak membolehkan Ruqba. Abu Isa berkata; Pengertian Ruqba adalah seseorang mengatakan; Sesuatu ini untukmu selama engkau hidup, jika engkau meninggal sebelumku maka sesuatu itu kembali kepadaku. Ahmad dan Ishaq berkata; Ruqba itu sama seperti Umra yaitu kepada siapa yang diberi dan tidak kembali kepada orang pertama (pemberi)",
          "tr": "Câbir (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Umra yapılan kimse için caiz ve geçerlidir. Rukba da yine yapılan kimse için caiz ve geçerlidir.” Diğer tahric: Ebû Dâvûd, Ticarat Rukba’ya dair bilgi için buraya tıkla Tirmizî: Bu hadis hasendir. Bazıları bu hadisi Ebû’z Zübeyr yoluyla aynı senetle Câbir’den mevkuf olarak rivâyet etmişlerdir. Rasûlullah (s.a.v.)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göre olup: “Rukba da Umra gibi caizdir” derler. Ahmed ve İshâk bunlardandır. Küfelilerden ve başkalarından bazı ilim adamları ise umra ve rukba’yı ayırt ederek umra’yı caiz görüp rukba’yı caiz görmemişlerdir. Tirmizî: “Rukba” kelimesi şu anlamdadır: “Yaşadığın sürece bu mülk senindir. Fakat benden önce ölürsen; o mülk benim olacaktır.” Ahmed ve İshâk’ta şöyle derler: “Rukba da aynen Umra gibidir mal kendisine verilen kişiye aid olup verene geri dönmez.”"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 31
      }
    },
    {
      "hadithNumber": 1352,
      "arabicNumber": 1352,
      "book": 15,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلاَّ صُلْحًا حَرَّمَ حَلاَلاً أَوْ أَحَلَّ حَرَامًا وَالْمُسْلِمُونَ عَلَى شُرُوطِهِمْ إِلاَّ شَرْطًا حَرَّمَ حَلاَلاً أَوْ أَحَلَّ حَرَامًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Kathir bin 'Amr bin 'Awf Al-Muzani narrated from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:\"Reconciliation is allowed among the Muslims, except for reconciliation that makes the lawful unlawful, or the unlawful lawful. And the Muslims will be held to their conditions, except the conditions that make the lawful unlawful, or the unlawful lawful",
          "ur": "عمرو بن عوف مزنی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صلح مسلمان کے درمیان نافذ ہو گی سوائے ایسی صلح کے جو کسی حلال کو حرام کر دے یا کسی حرام کو حلال۔ اور مسلمان اپنی شرطوں کے پابند ہیں۔ سوائے ایسی شرط کے جو کسی حلال کو حرام کر دے یا کسی حرام کو حلال“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal], telah menceritakan kepada kami [Abu Amir Al 'Aqadi], telah menceritakan kepada kami [Katsir bin Abdullah bin Amru bin 'Auf Al Muzani] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perdamaian diperbolehkan di antara kaum muslimin kecuali perdamaian yang mengharamkan yang halal atau menghalalkan yang haram. Dan kaum muslimin boleh menentukan syarat kecuali syarat yang mengharamkan yang halal atau menghalalkan yang haram.\" Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "Amr b. Avf el Müzenî (r.a.)’in babasından ve dedesinden rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Müslümanlar arasında sulh geçerlidir. Ancak helali haram kılan veya haramı helal kılan sulh geçersizdir. Müslümanlar şartlarına bağlıdırlar. Ama helali haram kılan haramı helal kılan şartlar geçersizdir.” Diğer tahric: İbn Mâce, Ahkam Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 32
      }
    },
    {
      "hadithNumber": 1353,
      "arabicNumber": 1353,
      "book": 15,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُهُ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا اسْتَأْذَنَ أَحَدَكُمْ جَارُهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَلاَ يَمْنَعْهُ ‏\"‏ ‏.‏ فَلَمَّا حَدَّثَ أَبُو هُرَيْرَةَ طَأْطَئُوا رُءُوسَهُمْ فَقَالَ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَمُجَمِّعِ بْنِ جَارِيَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ الشَّافِعِيُّ ‏.‏ وَرُوِيَ عَنْ بَعْضِ أَهْلِ الْعِلْمِ مِنْهُمْ مَالِكُ بْنُ أَنَسٍ قَالُوا لَهُ أَنْ يَمْنَعَ جَارَهُ أَنْ يَضَعَ خَشَبَهُ فِي جِدَارِهِ ‏.‏ وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏",
        "translations": {
          "en": "Al-A`raj narrated from Abu Hurairah, saying:“I heard him saying: ‘the Messenger of Allah (ﷺ) said: “When one of you seeks his neighbor’s permission to affix a wooden beam in his wall, then do not prevent him.\"' When Abu Hurairah narrated it, they tilted their heads, so he said: ‘Why do I see that you are averse to it? By Allah! I will continue to narrate it among you",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جب تم میں سے کسی کا پڑوسی اس کی دیوار میں لکڑی گاڑنے کی اس سے اجازت طلب کرے تو وہ اسے نہ روکے“۔ ابوہریرہ رضی الله عنہ نے جب یہ حدیث بیان کی تو لوگوں نے اپنے سر جھکا لیے تو انہوں نے کہا: کیا بات ہے، میں دیکھ رہا ہوں کہ تم لوگ اس سے اعراض کر رہے ہو؟ اللہ کی قسم میں اسے تمہارے شانوں پر مار کر ہی رہوں گا یعنی تم سے اسے بیان کر کے ہی رہوں گا۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس اور مجمع بن جاریہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے۔ شافعی بھی اسی کے قائل ہیں، ۴- بعض اہل علم سے مروی ہے: جن میں مالک بن انس بھی شامل ہیں کہ اس کے لیے درست ہے کہ اپنے پڑوسی کو دیوار میں لکڑی گاڑنے سے منع کر دے، پہلا قول زیادہ صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Al A'raj] dari [Abu Hurairah], ia berkata; Aku mendengarnya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian dimintai izin oleh tetangganya untuk menyandarkan kayunya pada dindingnya, janganlah ia melarangnya.\" Ketika Abu Hurairah menyampaikan hadits itu, mereka mengangguk-anggukkan kepala mereka, ia pun berkata; Aku tidaklah melihat pada diri kalian berpaling darinya, namun demi Allah, sungguh aku akan melemparkan hal itu di antara pundak kalian. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ibnu Abbas dan Mujammi' bin Jariyah. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih dan menjadi pedoman amal menurut sebagian ulama dan ini pula yang dikatakan oleh Asy Syafi'i serta diriwayatkan dari sebagian ulama, di antaranya Malik bin Anas, mereka berpendapat; Boleh baginya melarang tetangganya untuk meletakkan kayunya pada dindingnya, namun pendapat pertama lebih shahih",
          "tr": "Ebû Hureyre (r.a.)’den rivâyet edilmiştir: (A’rec bizzat kendisinden işittim diyor) Rasûlullah (s.a.v.) şöyle buyurmuştur: “Sizden birinizin komşusu sizin duvarınıza bir ağaç başı koymak için izin isterse; bu işe engel olmasın.” Ebû Hureyre bunu söyleyince orada bulunanlar sanki gereksiz bir iş söylemiş gibi başlarını eğdiler. Bunun üzerine Ebû Hureyre şöyle dedi: “Neden sizi bu sünnetten yüz çevirmiş olarak görüyorum, vallahi dikkat edin bu işte umursamaz olursanız bu evin duvarına konulacak ağaç başını sizin omuzlarınız arasına koyarım.” Diğer tahric: Buhari, Mezâlim; İbn Mâce, Ahkâm Tirmizî: Bu konuda İbn Abbâs ve Mücemmil b. Cariye’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hureyre hadisi hasen sahih olup bazı ilim adamlarının uygulaması bu hadise göredir. Şâfii’nin görüşü budur. Aralarında Mâlik b. Enes’in de bulunduğu bazı ilim adamları ise: Komşunun ağaç başını kendi duvarına koymaktan engelleyebilir derler. Birinci görüş daha sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 33
      }
    },
    {
      "hadithNumber": 1354,
      "arabicNumber": 1354,
      "book": 15,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، وَأَحْمَدُ بْنُ مَنِيعٍ، - الْمَعْنَى وَاحِدٌ - قَالاَ حَدَّثَنَا هُشَيْمٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْيَمِينُ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ ‏\"‏ ‏.‏ وَقَالَ قُتَيْبَةُ ‏\"‏ عَلَى مَا صَدَّقَكَ عَلَيْهِ صَاحِبُكَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ هُشَيْمٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي صَالِحٍ ‏.‏ وَعَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ هُوَ أَخُو سُهَيْلِ بْنِ أَبِي صَالِحٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَاقُ ‏.‏ وَرُوِيَ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ أَنَّهُ قَالَ إِذَا كَانَ الْمُسْتَحْلِفُ ظَالِمًا فَالنِّيَّةُ نِيَّةُ الْحَالِفِ وَإِذَا كَانَ الْمُسْتَحْلِفُ مَظْلُومًا فَالنِّيَّةُ نِيَّةُ الَّذِي اسْتَحْلَفَ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:“The oath is based upon what will make your companion believe you.” [Qutaibah (one of the narrators) said: “ What will make you believed by your companion”",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قسم اسی چیز پر واقع ہو گی جس پر تمہارا ساتھی ( فریق مخالف ) قسم لے رہا ہے“ ( توریہ کا اعتبار نہیں ہو گا ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ہم اسے ہشیم ہی کی روایت سے جانتے ہیں جسے انہوں نے عبداللہ بن ابی صالح سے روایت کی ہے۔ اور عبداللہ بن ابی صالح، سہیل بن ابی صالح کے بھائی ہیں، ۳- بعض اہل علم کا اسی پر عمل ہے، احمد اور اسحاق بن راہویہ بھی اسی کے قائل ہیں، ۴- ابراہیم نخعی کہتے ہیں کہ جب قسم لینے والا ظالم ہو تو قسم کھانے والے کی نیت کا اعتبار ہو گا، اور جب قسم لینے والا مظلوم ہو تو قسم لینے والے کی نیت کا اعتبار ہو گا۔",
          "id": "Telah menceritakan kepada kami [Qutaibah] dan [Ahmad bin Mani'] dengan makna satu, keduanya berkata; Telah menceritakan kepada kami [Husyaim] dari [Abdullah bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumpah terhadap sesuatu yang dibenarkan oleh temanmu.\" Sedangkan Qutaibah berkata; Dengan redaksi: \"Terhadap sesuatu yang telah dibenarkan oleh temanmu.\" Abu Isa berkata; Hadits ini hasan gharib tidak kami ketahui kecuali dari hadits Husyaim dari Abdullah bin Abu Shalih dan Abdullah bin Abu Shalih adalah saudara Suhail bin Abu Shalih. Mengamalkan hadits ini menurut sebagian ulama dan ini pula yang dikatakan oleh Ahmad dan Ishaq serta diriwayatkan dari Ibrahim An Nakha'i bahwa ia berkata; Jika orang yang meminta untuk bersumpah itu berbuat zhalim maka niat itu dinilai dari niat orang yang bersumpah sedangkan jika orang yang dimintai bersumpah itu dizhalimi, maka niat yang dinilai adalah niat orang yang meminta bersumpah"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 34
      }
    },
    {
      "hadithNumber": 1355,
      "arabicNumber": 1355,
      "book": 15,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ الضُّبَعِيِّ، عَنْ قَتَادَةَ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اجْعَلُوا الطَّرِيقَ سَبْعَةَ أَذْرُعٍ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:“Make the road seven forearm lengths.”",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”راستہ سات ہاتھ ( چوڑا ) رکھو“۔",
          "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Waki'] dari [Al Mutsanna bin Sa'id Adl Dluba'i] dari [Qatadah] dari [Basyir bin Nahik] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jadikanlah luas jalan sebesar tujuh hasta",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Bahçe ve tarlalar arasında yeni yollar açacağınızda yolun genişliğini yedi zira (arşın) olarak yapınız.” Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkam"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 35
      }
    },
    {
      "hadithNumber": 1356,
      "arabicNumber": 1356,
      "book": 15,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا تَشَاجَرْتُمْ فِي الطَّرِيقِ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ حَدِيثِ وَكِيعٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ عَنْ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى بَعْضُهُمْ هَذَا عَنْ قَتَادَةَ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ ‏.‏ وَهُوَ غَيْرُ مَحْفُوظٍ ‏.‏",
        "translations": {
          "en": "Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:\"When you disagree over the road, then make it seven forearm lengths",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب راستے کے سلسلے میں تم میں اختلاف ہو تو اسے سات ہاتھ ( چوڑا ) رکھو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ ( سابقہ ) وکیع کی حدیث سے زیادہ صحیح ہے، ۲- بشیر بن کعب کی حدیث جسے انہوں نے ابوہریرہ سے روایت کی ہے حسن صحیح ہے، اور بعض نے اسے قتادہ سے اور قتادہ نے بشیر بن نہیک سے اور بشیر نے ابوہریرہ سے روایت کی ہے اور یہ غیر محفوظ ہے، ۳- اس باب میں ابن عباس سے بھی روایت ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Al Mutsanna bin Sa'id] dari [Qatadah] dari [Busyair bin Ka'b Al 'Adawi] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian menanam pepohonan di jalan, maka jadikanlah ia berjarak tujuh hasta.\" Abu Isa berkata; Hadits ini lebih shahih dari hadits Waki'. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ibnu Abbas. Isa berkata; Hadits Busyair bin Ka'b Al 'Adawi dari Abu Hurairah adalah hadits hasan shahih sedangkan [sebagian mereka] meriwayatkan hadits ini dari [Qatadah] dari [Basyir bin Lahik] dari [Abu Hurairah] adalah tidak terjaga",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurdu: “Yol konusunda ihtilafa düşerseniz onun enini yedi arşın olarak yapınız.” Diğer tahric: Ebû Dâvûd, Akdıyye; İbn Mâce, Ahkam Tirmizî: Bu hadis Vekî’in rivâyetinden daha sahihtir. Tirmizî: Bu konuda İbn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: Beşîr b. Ka’b el Adevi’nin, Ebû Hureyre’den rivâyet ettiği hadis hasen sahihtir. Bazıları bu hadisi Katâde’den, Beşîr b. Nehîk’den ve Ebû Hureyre’den rivâyet etmişlerdir ki bu rivâyet pek sağlam değildir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 1357,
      "arabicNumber": 1357,
      "book": 15,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ الثَّعْلَبِيِّ، عَنْ أَبِي مَيْمُونَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَيَّرَ غُلاَمًا بَيْنَ أَبِيهِ وَأُمِّهِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَجَدِّ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو مَيْمُونَةَ اسْمُهُ سُلَيْمٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ قَالُوا يُخَيَّرُ الْغُلاَمُ بَيْنَ أَبَوَيْهِ إِذَا وَقَعَتْ بَيْنَهُمَا الْمُنَازَعَةُ فِي الْوَلَدِ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ وَقَالاَ مَا كَانَ الْوَلَدُ صَغِيرًا فَالأُمُّ أَحَقُّ فَإِذَا بَلَغَ الْغُلاَمُ سَبْعَ سِنِينَ خُيِّرَ بَيْنَ أَبَوَيْهِ ‏.‏ هِلاَلُ بْنُ أَبِي مَيْمُونَةَ هُوَ هِلاَلُ بْنُ عَلِيِّ بْنِ أُسَامَةَ وَهُوَ مَدَنِيٌّ وَقَدْ رَوَى عَنْهُ يَحْيَى بْنُ أَبِي كَثِيرٍ وَمَالِكُ بْنُ أَنَسٍ وَفُلَيْحُ بْنُ سُلَيْمَانَ ‏.‏",
        "translations": {
          "en": "Abu Maimunah narrated from Abu Hurairah who said:\"The Prophet (ﷺ) gave a boy the choice between his father and his mother",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک بچے کو اختیار دیا کہ چاہے وہ اپنے باپ کے ساتھ رہے اور چاہے اپنی ماں کے ساتھ۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو اور عبدالحمید بن جعفر کے دادا رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی حدیث پر عمل ہے، یہ لوگ کہتے ہیں کہ جب ماں باپ کے درمیان بچے کے سلسلے میں اختلاف ہو جائے تو بچے کو اختیار دیا جائے گا چاہے وہ اپنے باپ کے ساتھ رہے اور چاہے وہ اپنی ماں کے ساتھ رہے۔ یہی احمد اور اسحاق بن راہویہ کا قول ہے۔ ان کا کہنا ہے کہ جب بچہ کم سن ہو تو اس کی ماں زیادہ مستحق ہے۔ اور جب وہ سات سال کا ہو جائے تو اس کو اختیار دیا جائے، چاہے تو باپ کے ساتھ رہے یا چاہے تو ماں کے ساتھ رہے۔",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali], telah menceritakan kepada kami [Sufyan] dari [Ziyad bin Sa'd] dari [Hilal bin Abu Maimunah Ats Tsa'labi] dari [Abu Maimunah] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam memberi pilihan kepada seorang anak antara ayah dan ibunya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Amr dan kakeknya Abdul Hamid bin Ja'far. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih. Abu Maimunah bernama Sulaim. Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, mereka berpendapat; Seorang anak harus diberikan pilihan antara kedua orang tuanya, jika terjadi perselisihan terhadap seorang anak, ini adalah pendapat Ahmad dan Ishaq. Keduanya juga berpendapat; Jika seorang anak masih kecil maka ibu lebih berhak atasnya namun jika seorang anak menginjak umur tujuh tahun maka dipilihkan di antara kedua orang tuanya. Hilal bin Abu Maimunah adalah Hilal bin Ali bin Usamah, ia adalah orang Madinah. Dan Yahya bin Abu Katsir, Malik bin Anas dan Fulaih bin Sulaiman telah meriwayatkan darinya",
          "tr": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, Peygamber (sallallahü aleyhi ve sellem): “Boşanan, karı kocanın anlaşamadıkları çocukları konusunda olgun yaşta olan çocuğu anne veya babasını tercih etmekte serbest bırakmıştır.” (Ebû Dâvûd, Talak: 34; İbn Mâce, Ahkam: 22) Bu konuda Abdullah b. Amr ve dedesi Abdulhamid b. Cafer’den de hadis rivâyet edilmiştir. Ebû Hüreyre hadisi hasen sahihtir. Ebû Meymûne’nin ismi Süleym’dir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göre olup şöyle derler: Çocuk hakkında anlaşmazlık olursa çocuk ana ve babayı tercih etmekte serbest bırakılır Ahmed ve İshâk bu görüşte olup şöyle derler: Çocuğun yaşı küçükse anneye verilmesi uygundur. Yedi yaşına girmişse ana babayı seçmekte çocuk serbest bırakılır. Hilâl b. Ebû Meymune; Hilâl b. Ali b. Üsâme’dir. Medînelidir, kendisinden Yahya b. ebî Kesir, Mâlik b. Enes ve Füheyl b. Süleyman hadis rivâyet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 1358,
      "arabicNumber": 1358,
      "book": 15,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَمَّتِهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ وَإِنَّ أَوْلاَدَكُمْ مِنْ كَسْبِكُمْ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى بَعْضُهُمْ هَذَا عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أُمِّهِ عَنْ عَائِشَةَ ‏.‏ وَأَكْثَرُهُمْ قَالُوا عَنْ عَمَّتِهِ عَنْ عَائِشَةَ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ قَالُوا إِنَّ يَدَ الْوَالِدِ مَبْسُوطَةٌ فِي مَالِ وَلَدِهِ يَأْخُذُ مَا شَاءَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ يَأْخُذُ مِنْ مَالِهِ إِلاَّ عِنْدَ الْحَاجَةِ إِلَيْهِ ‏.‏",
        "translations": {
          "en": "Aishah narrated that the Messenger of Allah (ﷺ) said:\"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings",
          "ur": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سب سے پاکیزہ چیز جس کو تم کھاتے ہو تمہاری اپنی کمائی ہے اور تمہاری اولاد بھی تمہاری کمائی میں سے ہے“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- بعض لوگوں نے عمارہ بن عمیر سے اور عمارہ نے اپنی ماں سے اور ان کی ماں نے عائشہ رضی الله عنہا سے روایت کی ہے، لیکن اکثر راویوں نے «عن أمّه» کے بجائے «عن عمته» کہا ہے یعنی عمارہ بن عمیر نے اپنی پھوپھی سے اور انہوں نے عائشہ رضی الله عنہا سے روایت کی ہے، ۳- اس باب میں جابر اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ وہ کہتے ہیں کہ باپ کو بیٹے کے مال میں کلی اختیار ہے وہ جتنا چاہے لے سکتا ہے، ۵- اور بعض کہتے ہیں کہ باپ اپنے بیٹے کے مال سے بوقت ضرورت ہی لے سکتا ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] telah menceritakan kepada kami [Al A'masy] dari [Umarah bin Umair] dari [bibinya] dari [A`isyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sebaik-baik apa yang kalian makan adalah hasil dari usaha kalian, dan sesungguhnya anak-anak kalian adalah hasil dari usaha kalian.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Jabir dan Abdullah bin Amr. Abu Isa berkata; Hadits ini hasan shahih dan [sebagian mereka] telah meriwayatkan hadits ini dari [Umarah bin Umair] dari [ibunya] dari [Aisyah] namun kebanyakan mereka mengatakan; Dari bibinya dari A`isyah. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, mereka berpendapat; Sesungguhnya tangan orang tua meliputi harta anaknya, ia boleh mengambil yang ia kehendaki. Namun sebagian mereka berpendapat; Tidak boleh mengambil dari hartanya kecuali ketika membutuhkannya",
          "tr": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Yediğinizin en helali kendi kazancınızdan olandır, çocuklarınız da sizin kazançlarınızdandır.” (Ebû Dâvûd, Büyü: 77; Nesâî, Büyü; 1) Bu konuda Câbir ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Bazıları bu hadisi Umâra b. Umeyr’den annesinden ve Âişe’den rivâyet ederler. Çoğunluk ise “Halasından ve Âişe’den” diyerek rivâyet etmektedirler. (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göre olup şöyle derler: “Babanın eli çocuğun malında serbest bırakılmıştır dilediğini alır.” Bazı ilim adamları da “Çocuğun malından ancak o mala muhtaç olduğunda alır” derler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 38
      }
    },
    {
      "hadithNumber": 1359,
      "arabicNumber": 1359,
      "book": 15,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَهْدَتْ بَعْضُ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم إِلَى النَّبِيِّ صلى الله عليه وسلم طَعَامًا فِي قَصْعَةٍ فَضَرَبَتْ عَائِشَةُ الْقَصْعَةَ بِيَدِهَا فَأَلْقَتْ مَا فِيهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ طَعَامٌ بِطَعَامٍ وَإِنَاءٌ بِإِنَاءٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Anas narrated:\"One of the wives of the Prophet (ﷺ) gave the Prophet (ﷺ) some food in a bowl. Then 'Aishah broke the bowl with her hand, and discarded what was in it. So the Prophet (ﷺ) said: \"Food for food and vessel for vessel",
          "ur": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی کسی بیوی نے آپ کے پاس پیالے میں کھانے کی کوئی چیز ہدیہ کی، عائشہ رضی الله عنہا نے ( غصے میں ) اپنے ہاتھ سے پیالے کو مار کر اس کے اندر کی چیز گرا دیا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کھانے کے بدلے کھانا اور پیالے کے بدلے پیالہ ہے“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Abu Dawud Al Hafari] dari [Sufyan Ats Tsauri] dari [Humaid] dari [Anas] ia berkata; Sebagian isteri Nabi shallallahu 'alaihi wasallam memberi hadiah kepada Nabi shallallahu 'alaihi wasallam berupa makanan dalam sebuah nampan, lalu Aisyah memukul nampan itu dengan tangannya sehingga tumpah semua isinya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Makanan diganti dengan makanan dan bejana diganti dengan bejana.\" Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "Enes (r.a.)’den rivâyete göre, şöyle demiştir: “Nebi (s.a.v.)’in hanımlarından biri O’na bir tabak yemek göndermişlerdi de Âişe eliyle yemeği dökmüştü.” Bunun üzerine Rasûlullah (s.a.v.): “Yemek yemekle, kap kapla tazmin edilir” buyurdular. Diğer tahric: İbn Mâce, Ahkâm, Ebû Dâvûd, İcara Tirmizî: Bu hadis hasen sahihtir. Mahir: Ebu Davuddaki bu hadis’in Aişe r.anha rivayetinden yemeği gönderen annemizin Safiye r.anha olduğu anlaşılmaktadır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 39
      }
    },
    {
      "hadithNumber": 1360,
      "arabicNumber": 1360,
      "book": 15,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا سُوَيْدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَعَارَ قَصْعَةً فَضَاعَتْ فَضَمِنَهَا لَهُمْ ‏.‏ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ ‏.‏ وَإِنَّمَا أَرَادَ عِنْدِي سُوَيْدٌ الْحَدِيثَ الَّذِي رَوَاهُ الثَّوْرِيُّ وَحَدِيثُ الثَّوْرِيِّ أَصَحُّ ‏.‏ اسْمُ أَبِي دَاوُدَ عُمَرُ بْنُ سَعْدٍ ‏.‏",
        "translations": {
          "en": "Anas narrated that the Messenger of Allah (ﷺ) borrowed a bowl which broke, so he guaranteed (compensated) it for them",
          "ur": "انس رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک پیالہ منگنی لیا وہ ٹوٹ گیا، تو آپ نے جن سے پیالہ لیا تھا انہیں اس کا تاوان ادا کیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث محفوظ نہیں ہے، ۲- سوید نے مجھ سے وہی حدیث بیان کرنی چاہی تھی جسے ثوری نے روایت کی ہے ۱؎، ۳- ثوری کی حدیث زیادہ صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah mengabarkan kepada kami [Suwaid bin Abdul Aziz] dari [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah meminjam sebuah nampan lalu nampan itu hilang, maka beliau menggantiya untuk mereka. Abu Isa berkata; Hadits ini tidak terjaga, sesungguhnya yang aku maksudkan Suwaid adalah hadits darinya yang diriwayatkan oleh Ats Tsauri, sedangkan hadits Ats Tsauri lebih shahih. Nama Abu Dawud adalah Umar bin Sa'd",
          "tr": "Enes (r.a.)’den rivâyet edildiğine göre: “Rasûlullah (s.a.v.) ödünç olarak bir tabak almıştı da tabak kaybolmuştu, o tabağı sahiplerine tazmin etti.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis mahfuz değildir. Bana göre Süveyd, Sûfyân es Sevrî’nin rivâyeti olan hadisi söylemek istemektedir. Sevrî’nin hadisi daha sahihtir. Ebû Dâvûd’un ismi Amr b. Sa’d’tır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Very Daif Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Very Daif Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 40
      }
    },
    {
      "hadithNumber": 1361,
      "arabicNumber": 1361,
      "book": 15,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ عُرِضْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي جَيْشٍ وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ فَلَمْ يَقْبَلْنِي فَعُرِضْتُ عَلَيْهِ مِنْ قَابِلٍ فِي جَيْشٍ وَأَنَا ابْنُ خَمْسَ عَشْرَةَ فَقَبِلَنِي ‏.‏ قَالَ نَافِعٌ وَحَدَّثْتُ بِهَذَا الْحَدِيثِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ فَقَالَ هَذَا حَدُّ مَا بَيْنَ الصَّغِيرِ وَالْكَبِيرِ ‏.‏ ثُمَّ كَتَبَ أَنْ يُفْرَضَ لِمَنْ يَبْلُغُ الْخَمْسَ عَشْرَةَ ‏.‏ حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ هَذَا وَلَمْ يَذْكُرْ فِيهِ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ أَنَّ هَذَا حَدُّ مَا بَيْنَ الصَّغِيرِ وَالْكَبِيرِ ‏.‏ وَذَكَرَ ابْنُ عُيَيْنَةَ فِي حَدِيثِهِ ‏.‏ قَالَ نَافِعٌ فَحَدَّثْنَا بِهِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ فَقَالَ هَذَا حَدُّ مَا بَيْنَ الذُّرِّيَّةِ وَالْمُقَاتِلَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ يَرَوْنَ أَنَّ الْغُلاَمَ إِذَا اسْتَكْمَلَ خَمْسَ عَشْرَةَ سَنَةً فَحُكْمُهُ حُكْمُ الرِّجَالِ وَإِنِ احْتَلَمَ قَبْلَ خَمْسَ عَشْرَةَ فَحُكْمُهُ حُكْمُ الرِّجَالِ ‏.‏ وَقَالَ أَحْمَدُ وَإِسْحَاقُ الْبُلُوغُ ثَلاَثَةُ مَنَازِلَ بُلُوغُ خَمْسَ عَشْرَةَ أَوْ الاِحْتِلاَمُ فَإِنْ لَمْ يُعْرَفْ سِنُّهُ وَلاَ احْتِلاَمُهُ فَالإِنْبَاتُ يَعْنِي الْعَانَةَ ‏.‏",
        "translations": {
          "en": "Narrated Nafi':that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" (Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers",
          "ur": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم کے سامنے ایک لشکر میں پیش کیا گیا، اس وقت میری عمر چودہ سال کی تھی تو آپ نے مجھے ( لشکر میں ) قبول نہیں کیا، پھر آئندہ سال مجھے آپ کے سامنے ایک اور لشکر میں پیش کیا گیا اور اس وقت میری عمر پندرہ سال کی تھی تو آپ نے مجھے ( لشکر میں ) قبول کر لیا۔ نافع کہتے ہیں: میں نے عمر بن عبدالعزیز سے اس حدیث کو بیان کیا تو انہوں نے کہا: بالغ اور نابالغ کے درمیان یہی حد ہے۔ انہوں نے اپنے عاملوں کو لکھا کہ جو پندرہ سال کے ہو جائیں ( مال غنیمت سے ) ان کو حصہ دیا جائے۔ دوسری سند سے عمر نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح کی حدیث روایت کی ہے اور اس میں یہ ذکر نہیں کیا کہ ( عمر بن عبدالعزیز نے اپنے عاملوں کو لکھا کہ نابالغ اور بالغ کی یہی حد ہے ) البتہ سفیان بن عیینہ نے اپنی حدیث میں یہ بیان کیا ہے کہ نافع کہتے ہیں کہ ہم نے اس حدیث کو عمر بن عبدالعزیز سے بیان کیا تو انہوں نے کہا: بچہ اور مقاتل ( جو جنگ میں شرکت کا اہل ہو ) کے درمیان یہی حد ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے، سفیان ثوری، ابن مبارک، شافعی، احمد اور اسحاق بن راہویہ بھی اسی کے قائل ہیں۔ یہ لوگ کہتے ہیں کہ جب بچہ پندرہ سال مکمل کر لے تو اس کا حکم وہی ہو گا جو مردوں کا ہوتا ہے اور اگر پندرہ سال سے پہلے ہی اس کو احتلام آنے لگے تو بھی اس کا حکم مردوں جیسا ہو گا۔ احمد اور اسحاق بن راہویہ کہتے ہیں: بلوغت کی تین علامتیں ہیں: بچہ پندرہ سال کا ہو جائے، یا اس کو احتلام آنے لگے، اور اگر عمر اور احتلام نہ معلوم ہو سکے تو جب اس کے ناف کے نیچے کے بال اگ آئیں تو وہ بالغ ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Wazir Al Wasithi], telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] dari [Sufyan] dari [Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata; Aku dihadapkan kepada Nabi shallallahu 'alaihi wasallam untuk bergabung dalam sebuah pasukan, saat itu aku berumur empat belas tahun, namun beliau tidak menerimaku. Lalu aku dihadapkan kepada beliau pada tahun berikutnya untuk bergabung dalam sebuah pasukan, saat itu aku telah berumur lima belas tahun, maka beliau memerimaku. Nafi' berkata; Dan aku menceritakan hadits ini kepada Umar bin Abdul Aziz lalu ia berkata; Ini adalah batasan antara masih kecil dan sudah besar, kemudian ia menetapkan kepada anak yang telah mencapai umur lima belas tahun untuk melakukan amalan wajib. Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperi hadits ini namun ia tidak menyebutkan di dalamnya bahwa Umar bin Abdul Aziz menetapkan bahwa; Ini adalah batasan antara masih kecil dan sudah besar. Dan Ibnu Uyainah menyebutkan dalam haditsnya; Nafi' berkata; Lalu kami menceritakan hal ini kepada Umar bin Abdul Aziz, maka ia berkata; Ini adalah batasan antara keturunan dan orang yang bisa ikut berperang. Abu Isa berkata; Hadits ini hasan shahih. Hadits ini menjadi pedoman amal menurut para ulama dan dengan ini Sufyan Ats Tsauri, Ibnu Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq berpendapat; Bahwa seorang anak jika telah mencapai umur lima belas tahun maka hukum yang ditetapkan padanya adalah hukum orang dewasa. Dan jika ia bermimpi junub sebelum berumur lima belas tahun maka hukum yang ditetapkan padanya adalah hukum orang dewasa. Ahmad dan Ishaq berpendapat; Baligh itu ada tiga derajat; Balig mencapai umur lima belas atau mimpi junub, jika tidak diketahui umur atau mimpi junubnya maka diketahui dengan tumbuh rambut yakni rambut di sekitar kemaluan",
          "tr": "Berâ (radıyallahü anh)’den rivâyet edildiğine göre, şöyle demiştir: Dayım Ebû Bürde b. Niyâr; elinde bir sancak olduğu halde bana uğramıştı, ben nereye gidiyorsun dedim. O da: “Rasûlüllah (sallallahü aleyhi ve sellem), babasının karısı ile evlenen bir adamın boynunu vurup kendisine başını getirmem için beni görevlendirdi.” Dedi. (Ebû Dâvûd, Hudûd: 26; İbn Mâce, Hudûd: 35) Bu konuda Kurretel, Müzenî’den de hadis rivâyet edilmiştir. Berâ hadisi hasen garibtir. Muhammed b. İshâk bu hadisi Adiyy b. Sabit’den, Abdullah b. Yezîd’den ve Berâ’dan rivâyet etmiştir. Yine aynı şekilde bu hadis Eş’as’dan, Adiyy’den, Yezîd b. el Berâ’dan ve babasından da rivâyet edilmiştir. bu hadis Eş’as’dan, Adiyy’den, Yezîd b. Berâ’dan ve dayısından da rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 41
      },
      "narrator": {
        "en": "Nafi'"
      }
    },
    {
      "hadithNumber": 1362,
      "arabicNumber": 1362,
      "book": 15,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ أَشْعَثَ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنِ الْبَرَاءِ، قَالَ مَرَّ بِي خَالِي أَبُو بُرْدَةَ بْنُ نِيَارٍ وَمَعَهُ لِوَاءٌ فَقُلْتُ أَيْنَ تُرِيدُ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى رَجُلٍ تَزَوَّجَ امْرَأَةَ أَبِيهِ أَنْ آتِيَهُ بِرَأْسِهِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ قُرَّةَ الْمُزَنِيِّ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ الْبَرَاءِ حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَقَدْ رَوَى مُحَمَّدُ بْنُ إِسْحَاقَ هَذَا الْحَدِيثَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنِ الْبَرَاءِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَشْعَثَ عَنْ عَدِيٍّ عَنْ يَزِيدَ بْنِ الْبَرَاءِ عَنْ أَبِيهِ وَرُوِيَ عَنْ أَشْعَثَ عَنْ عَدِيٍّ عَنْ يَزِيدَ بْنِ الْبَرَاءِ عَنْ خَالِهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Narrated Al-Bara':\"My maternal uncle Abu Burdah Ibn Niyar passed by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head",
          "ur": "براء رضی الله عنہ کہتے ہیں کہ میرے ماموں ابوبردہ بن نیار رضی الله عنہ میرے پاس سے گزرے اور ان کے ہاتھ میں ایک جھنڈا تھا، میں نے پوچھا: آپ کہاں کا ارادہ رکھتے ہیں؟ کہا: مجھے رسول اللہ صلی اللہ علیہ وسلم نے ایک ایسے شخص کے پاس بھیجا ہے جس نے اپنے باپ کی ( دوسری ) بیوی سے شادی کر رکھی ہے تاکہ میں اس کا سر لے کر آؤں۔ امام ترمذی کہتے ہیں: ۱- براء کی حدیث حسن غریب ہے، ۲- محمد بن اسحاق نے بھی اس حدیث کو عدی بن ثابت سے اور عدی نے عبداللہ بن یزید سے اور عبداللہ نے براء رضی الله عنہ سے روایت کی ہے، ۳- یہ حدیث اشعث سے بھی مروی ہے انہوں نے عدی سے اور عدی نے یزید بن براء سے اور یزید نے براء رضی الله عنہ سے روایت کی ہے، ۴- نیز یہ اشعث سے مروی ہے انہوں نے عدی سے اور عدی نے یزید بن البراء سے اور یزید نے اپنے ماموں سے اور ان کے ماموں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۵- اس باب میں قرہ مزنی سے بھی روایت ہے۔",
          "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyajj], telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Asy'ats] dari ['Adi bin Tsabit] dari [Al Bara`] ia berkata; Pamanku [Abu Burdah bin Niyar] melewati di depanku dengan membawa sebuah bendera. Maka aku tanyakan; Mau kemana engkau? Ia menjawab; Rasulullah shallallahu 'alaihi wasallam mengutusku kepada seseorang yang menikahi isteri ayahnya untuk mendatangi dan memenggal kepalanya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Qurrah Al Muzani. Abu Isa berkata; Hadits Al Bara` adalah hadits gharib dan [Muhammad bin Ishaq] telah meriwayatkan hadits ini dari ['Adi bin Tsabit] dari [Abdullah bin Yazid] dari [Al Bara`]. Hadits ini juga diriwayatkan dari [Asy'ats] dari ['Adi] dari [Yazid bin Al Bara`] dari [ayahnya]. Serta diriwayatkan juga dari [Asy'ats] dari ['Adi] dari [Yazid bin Al Bara`] dari [pamannya] dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Berâ (r.a.)’den rivâyet edildiğine göre, şöyle demiştir: Dayım Ebû Bürde b. Niyâr; elinde bir sancak olduğu halde bana uğramıştı, ben nereye gidiyorsun dedim. O da: “Rasûlullah (s.a.v.), babasının karısı ile evlenen bir adamın boynunu vurup kendisine başını getirmem için beni görevlendirdi.” Dedi. Diğer tahric: Ebû Dâvûd, Hudûd; İbn Mâce, Hudûd Tirmizî: Bu konuda Kurretel, Müzenî’den de hadis rivâyet edilmiştir. Tirmizî: Berâ hadisi hasen garibtir. Muhammed b. İshâk bu hadisi Adiyy b. Sabit’den, Abdullah b. Yezîd’den ve Berâ’dan rivâyet etmiştir. Yine aynı şekilde bu hadis Eş’as’dan, Adiyy’den, Yezîd b. el Berâ’dan ve babasından da rivâyet edilmiştir. Yine bu hadis Eş’as’dan, Adiyy’den, Yezîd b. Berâ’dan ve dayısından da rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 42
      },
      "narrator": {
        "en": "Al-Bara'"
      }
    },
    {
      "hadithNumber": 1363,
      "arabicNumber": 1363,
      "book": 15,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّهُ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ الزُّبَيْرَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ فَقَالَ الأَنْصَارِيُّ سَرِّحِ الْمَاءَ يَمُرُّ ‏.‏ فَأَبَى عَلَيْهِ فَاخْتَصَمُوا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ ‏\"‏ ‏.‏ فَغَضِبَ الأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا زُبَيْرُ اسْقِ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏ ‏.‏ فَقَالَ الزُّبَيْرُ وَاللَّهِ إِنِّي لأَحْسِبُ نَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ ‏:‏ ‏(‏فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ‏)‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى شُعَيْبُ بْنُ أَبِي حَمْزَةَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنِ الزُّبَيْرِ وَلَمْ يَذْكُرْ فِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ ‏.‏ وَرَوَاهُ عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنِ اللَّيْثِ وَيُونُسَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ نَحْوَ الْحَدِيثِ الأَوَّلِ ‏.‏",
        "translations": {
          "en": "Narrated 'Abdullah bin Az-Zubair:\"A man from the Ansar disputed with Az-Zubair before the Messenger of Allah (ﷺ) about the canals of Harrah which they used to irrigate the date palms. The Ansari said: 'Let the water pass'. But he refused, So they brought their dispute to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said to Az-Zubair: 'O Zubair! Irrigate (your land) then let the water pass to you neighbor.' The Ansari became angry and said:'[O Messenger of Allah!] Is this because he is your aunt's son?' The face of the Messenger of Allah (ﷺ) changed color. Then he said: 'O Zubair! Irrigate (your land) and then withhold the water until it reaches the walls.' Az-Zubair said: 'By Allah! I think that this Ayah was revealed about that: But no, by your Lord, they can have no Faith until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions and accept (them) with full submission",
          "ur": "عبداللہ بن زبیر رضی الله عنہ کہتے ہیں کہ ایک انصاری نے رسول اللہ صلی اللہ علیہ وسلم کے پاس زبیر سے حرہ کی نالیوں کے بارے میں جس سے لوگ اپنے کھجور کے درخت سینچتے تھے جھگڑا کیا، انصاری نے زبیر سے کہا: پانی چھوڑ دو تاکہ بہتا رہے، زبیر نے اس کی بات نہیں مانی، تو دونوں نے رسول اللہ کی خدمت میں اپنا قضیہ پیش کیا۔ رسول اللہ صلی اللہ علیہ وسلم نے زبیر سے فرمایا: ”زبیر! ( تم اپنے کھیت کو ) سیراب کر لو، پھر اپنے پڑوسی کے لیے پانی چھوڑ دو“، ( یہ سن کر ) انصاری غصہ ہو گیا اور کہا: اللہ کے رسول! ( ایسا فیصلہ ) اس وجہ سے کہ وہ آپ کی پھوپھی کا لڑکا ہے؟ ( یہ سنتے ہی ) رسول اللہ صلی اللہ علیہ وسلم کے چہرہ کا رنگ بدل گیا، آپ نے فرمایا: ”زبیر! تم اپنے کھیت سیراب کر لو، پھر پانی کو روکے رکھو یہاں تک کہ وہ منڈیر تک پہنچ جائے“ ۱؎، زبیر کہتے ہیں: اللہ کی قسم، میرا گمان ہے کہ اسی سلسلے میں یہ آیت نازل ہوئی: «فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم» ”آپ کے رب کی قسم، وہ لوگ مومن نہیں ہو سکتے جب تک کہ اپنے جھگڑوں میں ( اے نبی ) وہ آپ کو حکم نہ مان لیں“ ( النساء: ۶۵ ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- شعیب بن ابی حمزہ نے زہری سے اور زہری نے عروہ بن زبیر سے اور عروہ نے زبیر سے روایت کی ہے اور شعیب نے اس میں عبداللہ بن زبیر کے واسطے کا ذکر نہیں کیا ہے۔ اور عبداللہ بن وہب نے اسے پہلی حدیث کی طرح ہی لیث اور یونس سے روایت کیا ہے اور ان دونوں نے زہری سے اور زہری نے عروہ سے اور عروہ نے عبداللہ بن زبیر سے روایت کی ہے۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Urwah] bahwa ia telah menceritakan kepadanya bahwa [Abdullah bin Az Zubair] telah menceritakan kepadanya bahwa ada orang Anshar berselisih dengan Az Zubair di samping Rasulullah shallallahu 'alaihi wasallam tentang masalah aliran air yang datang dari dataran tinggi yang mereka gunakan untuk menyiram pohon kurma. Orang Anshar itu berkata; Kirimkanlah air yang mengalir, namun ia enggan melakukannya. Maka mereka pun berselisih di samping Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam mengatakan kepada Az Zubair: \"Siramlah, wahai Zubair kemudian alirkan air untuk tetanggamu.\" Lalu orang Anshar marah dan berkata; Wahai Rasulullah, apakah karena ia anak bibimu? Maka memerahlah wajah Rasulullah shallallahu 'alaihi wasallam kemudian beliau bersabda: \"Siramlah kemudian tahan airnya hingga ia kembali ke dinding pembatas.\" Lalu Az Zubair berkata; Demi Allah, aku tidak menyangka ayat ini turun berkaitan dengan masalah itu: (Maka demi Rabbmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim terhadap perkara yang mereka perselisihkan, Kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan, dan mereka menerima dengan sepenuhnya). Abu Isa berkata; Hadits ini hasan shahih dan [Syu'aib bin Abu Hamzah] meriwayatkan dari [Az Zuhri] dari [Urwah bin Az Zubair] dari [Az Zubair] namun ia tidak menyebutkan di dalamnya Abdullah bin Az Zubair. Dan [Abdullah bin Wahb] juga meriwayatkan dari [Al Laits] dan [Yunus] dari [Az Zuhri] dari [Urwah] dari [Abdullah bin Az Zubair] seperti redaksi hadits pertama",
          "tr": "Abdullah b. Zübeyr (r.a.)’den rivâyete göre, Ensardan bir adam hurmalıkları suladıkları harre deresi su yolları ve sulama sırası hakkında Zübeyr’den davacı olmuştu. Bu dereden geçen su önce Zübeyr’in hurmalığına uğrar sonra Ensarî’nin hurmalığına geçerdi. Bir seferinde Zübeyr suyu tutup hurmalığını sulayacağı sırada Ensarî dedi ki: “Suyu bırak ta bize gelsin” fakat Zübeyr kendi hurmalığını sulamadan bırakmak ve sulama sırasını komşusuna vermek istemedi. İki taraf Peygamber (s.a.v.) huzurunda muhakeme oldular ve Rasûlullah (s.a.v.), Zübeyr’e: “Ey Zübeyr tarlanı sula sonra suyu komşusuna doğru salıver” buyurdular. Ensarî öfkelendi ve: “Hala oğlu olduğu için mi onu kayırdın? Dedi. Bu saygısızca söz üzerine Rasûlullah (s.a.v.)’in rengi değişti ve şöyle buyurdu: “Ey Zübeyr bahçeni sula ve suyu bırakma, duvardan aşıncaya kadar.” Zübeyr diyor ki: Şu ayetin bu hâdise hakkında indiğini sanıyorum: “Hayır hayır! Rabbine andolsun ki onlar, aralarında anlaşmazlığa düştükleri her konuda sen Peygamber (s.a.v.)’i hakem yapmadıkça ve sonra senin kararına kalplerinde hiçbir sıkıntı duymaksızın tam bir teslimiyetle uymadıkça gerçekten inanmış olmazlar.” (Nisa: 65) Diğer tahric: Buhârî, Müsakat Tirmizî: Bu hadis hasen sahihtir. Şuayb b. ebî Hamza, Zührî’den, Urve b. Zübeyr’den ve Zübeyr’den rivâyet etti ve bu rivâyette “Abdullah b. Zübeyr”den demedi. Yine Abdullah b. Vehb; Leys’den, Yunus’tan, Zührî’den, Urve’den ve Abdullah b. Zübeyr’den birinci rivâyetin bir benzerini bize rivâyet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 43
      },
      "narrator": {
        "en": "'Abdullah bin Az-Zubair"
      }
    },
    {
      "hadithNumber": 1364,
      "arabicNumber": 1364,
      "book": 15,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ أَعْتَقَ سِتَّةَ أَعْبُدٍ لَهُ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ لَهُ قَوْلاً شَدِيدًا ثُمَّ دَعَاهُمْ فَجَزَّأَهُمْ ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عِمْرَانَ بْنِ حُصَيْنٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ يَرَوْنَ اسْتِعْمَالَ الْقُرْعَةِ فِي هَذَا وَفِي غَيْرِهِ ‏.‏ وَأَمَّا بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَهْلِ الْكُوفَةِ وَغَيْرِهِمْ فَلَمْ يَرَوُا الْقُرْعَةَ وَقَالُوا يُعْتَقُ مِنْ كُلِّ عَبْدٍ الثُّلُثُ وَيُسْتَسْعَى فِي ثُلُثَىْ قِيمَتِهِ ‏.‏ وَأَبُو الْمُهَلَّبِ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الْجَرْمِيُّ وَهُوَ غَيْرُ أَبِي قِلاَبَةَ وَيُقَالُ مُعَاوِيَةُ بْنُ عَمْرٍو ‏.‏ وَأَبُو قِلاَبَةَ الْجَرْمِيُّ اسْمُهُ عَبْدُ اللَّهِ بْنُ زَيْدٍ ‏.‏",
        "translations": {
          "en": "Narrated 'Imran bin Husain:\"A Man from the Ansar freed six slaves of his upon his death, and he did not have any wealth aside from them. That was conveyed to the Prophet (ﷺ), and he said some harsh words about him.\" He said: \"Then he called for them and he divided them and had them draw lots. So he freed two of them and left four as slaves",
          "ur": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ ایک انصاری شخص نے مرتے وقت اپنے چھ غلاموں کو آزاد کر دیا جبکہ اس کے پاس ان کے علاوہ کوئی اور مال نہ تھا، نبی اکرم صلی اللہ علیہ وسلم کو یہ خبر ملی تو آپ نے اس آدمی کو سخت بات کہی، پھر ان غلاموں کو بلایا اور دو دو کر کے ان کے تین حصے کئے، پھر ان کے درمیان قرعہ اندازی کی اور جن ( دو غلاموں ) کے نام قرعہ نکلا ان کو آزاد کر دیا اور چار کو غلام ہی رہنے دیا۔ امام ترمذی کہتے ہیں: ۱- عمران بن حصین رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اور یہ اور بھی سندوں سے عمران بن حصین سے مروی ہے، ۳- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے، ۴- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ اور یہی مالک، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔ یہ لوگ یہ اور اس طرح کے دوسرے مواقع پر قرعہ اندازی کو درست کہتے ہیں، ۵- اور اہل کوفہ وغیرہم میں سے بعض اہل علم قرعہ اندازی کو جائز نہیں سمجھتے، اس موقع پر لوگ کہتے ہیں کہ ہر غلام سے ایک تہائی آزاد کیا جائے گا اور دو تہائی قیمت کی آزادی کے لیے کسب ( کمائی ) کرایا جائے گا۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] bahwa ada orang Anshar memerdekakan enam budak miliknya ketika hendak meninggal dunia namun ia tidak memiliki harta selain mereka, maka hal itu disampaikan kepada Nabi shallallahu 'alaihi wasallam, lalu beliau mengatakan perkataan yang keras kemudian memanggil dan memberikan bagian mereka, setelah itu beliau mengundi di antara mereka dan memerdekakan dua orang dan menjadikan budak lagi empat orang. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah. Abu Isa berkata; Hadits Imran bin Hushain adalah hadits hasan shahih dan telah diriwayatkan dari jalur lain dari Imran bin Hushain. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini adalah pendapat Malik, Asy Syafi'i, Ahmad dan Ishaq, mereka membolehkan menggunakan undian dalam masalah ini dan masalah lain. Adapun sebagian ulama dari Kufah dan selain mereka tidak membolehkan undian, mereka berpendapat; Dimerdekakan bagian sepertiga dari setiap budak dan ia diperkerjakan pada sepertiga harganya. Abu Al Muhallab bernama Abdurrahman bin Amr Al Jarmi, ia bukan Abu Qilabah terkadang dipanggil Mu'awiyah bin Amr. Abu Qilabah Al Jarmi bernama Abdullah bin Zaid",
          "tr": "Ukbe b. Mükrem el Ammî el Basrî ve başkaları bize aktararak Muhammed b. Bekir el Bürsanî’den, Hammad b. Seleme’den, Katâde’den,Âsım el Ahvel’den, Hasan’dan ve Semure’den rivâyet ederek şöyle demişlerdir: “her kim evlenmesi haram olan bir kimseyi veya nikahlanamayacağı kan akrabasını köle olarak satın alırsa o köle ve cariye hürdür.” Bu hadiste Âsım el Ahvel’i Muhammed b. Bekir’den başka Hammad b. Seleme’den zikreden kimseyi bilmiyoruz bazı ilim adamları uygulamalarını bu hadise göre yaparlar. Ömer’den “Kim evlenmesi haram olan bir kimseyi veya nikahlanamayacağı kan akrabasını köle olarak satın alırsa o köle ve cariye hürdür” şeklinde de rivâyet edilmiş olup bu rivâyeti Damre b. Rabia, Sevrî’den, Abdullah b. Dinar’dan, İbn Ömer’den rivâyet etmiştir. Bu hadiste Damre’ye uyulmamıştır ve bu hadis, hadisçiler yanında yanlıştır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 44
      },
      "narrator": {
        "en": "'Imran bin Husain"
      }
    },
    {
      "hadithNumber": 1365,
      "arabicNumber": 1365,
      "book": 15,
      "hadithInBook": 45,
      "text": {
        "arabic": "",
        "translations": {
          "ur": "سمرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی محرم رشتہ دار کا مالک ہو جائے تو وہ ( رشتہ دار ) آزاد ہو جائے گا“۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو ہم صرف حماد بن سلمہ ہی کی روایت سے مسنداً ( مرفوعاً ) جانتے ہیں، ۲- اور بعض لوگوں نے اس حدیث کے کچھ حصہ کو قتادہ سے اور قتادہ نے حسن سے اور حسن نے عمر رضی الله عنہ سے ( موقوفاً ) روایت کیا ہے۔ اس سند سے محمد بن بکر برسانی نے بیان کیا انہوں نے حماد بن سلمہ سے اور حماد نے قتادہ اور عاصم احول سے اور قتادہ اور عاصم نے حسن بصری سے اور حسن نے سمرہ سے اور سمرہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے فرمایا: ”جو شخص کسی محرم قرابت دار کا مالک ہو جائے تو وہ آزاد ہو جائے گا“، امام ترمذی کہتے ہیں: ۳- محمد بن بکر کے علاوہ ہم کسی کو نہیں جانتے ہیں جس نے عاصم احول کا ذکر کیا ہو اور انہوں ( عاصم ) نے حماد بن سلمہ سے روایت کی ہو، ۴- بعض اہل علم کا اسی حدیث پر عمل ہے، ۵- ابن عمر رضی الله عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے فرمایا: ”جو شخص کسی محرم قرابت دار کا مالک ہو جائے تو وہ آزاد ہو جائے گا“۔ اسے ضمرہ بن ربیعہ نے ثوری سے روایت کیا ہے، انہوں نے عبداللہ بن دینار سے، اور عبداللہ نے ابن عمر سے اور ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے۔ اس حدیث کی روایت میں لوگوں نے ضمرہ کی متابعت نہیں کی ہے۔ محدثین کے نزدیک یہ حدیث غلط ہے ۱؎۔",
          "tr": "Rafi’ b. Hadîç (radıyallahü anh)’den rivâyet edildiğine göre Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Her kim sahibinden izinsiz bir kimsenin toprağını ekerse ona ekinden bir şey yoktur, sadece yaptığı masraflar kendisine ödenir.” (Ebû Dâvûd, Büyü: 32; İbn Mâce, Rühûn: 13) Bu hadis hasen garibtir. Bu hadisin Ebû İshâk’ın rivâyetinden olduğunu sadece bu şekliyle Şerik b. Abdullah’ın rivâyetiyle bilmekteyiz. Bazı ilim adamlarının uygulaması bu hadise göre olup Ahmed ve İshâk bunlardandır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 45
      }
    },
    {
      "hadithNumber": 1366,
      "arabicNumber": 1366,
      "book": 15,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ النَّخَعِيُّ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَطَاءٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَلَيْسَ لَهُ مِنَ الزَّرْعِ شَيْءٌ وَلَهُ نَفَقَتُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ أَبِي إِسْحَاقَ إِلاَّ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ شَرِيكِ بْنِ عَبْدِ اللَّهِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ عَنْ هَذَا الْحَدِيثِ فَقَالَ هُوَ حَدِيثٌ حَسَنٌ ‏.‏ وَقَالَ لاَ أَعْرِفُهُ مِنْ حَدِيثِ أَبِي إِسْحَاقَ إِلاَّ مِنْ رِوَايَةِ شَرِيكٍ ‏.‏ قَالَ مُحَمَّدٌ حَدَّثَنَا مَعْقِلُ بْنُ مَالِكٍ الْبَصْرِيُّ، حَدَّثَنَا عُقْبَةُ بْنُ الأَصَمِّ، عَنْ عَطَاءٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
        "translations": {
          "en": "Narrated Rafi' bin Khadij:that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him",
          "ur": "رافع بن خدیج رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص دوسرے کی زمین میں ان کی اجازت کے بغیر فصل بوئے، اس کو فصل سے کچھ نہیں ملے گا وہ صرف خرچ لے سکتا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- ہم اسے بروایت ابواسحاق صرف شریک بن عبداللہ ہی کے طریق سے جانتے ہیں، ۳- بعض اہل علم کا اسی حدیث پر عمل ہے اور یہی احمد اور اسحاق بن راہویہ کا بھی قول ہے ۱؎ ۴- میں نے محمد بن اسماعیل بخاری سے اس حدیث کے بارے میں پوچھا تو انہوں نے کہا: یہ حدیث حسن ہے، انہوں نے کہا: میں اسے بروایت ابواسحاق صرف شریک ہی کے طریق سے جانتا ہوں، ۵- محمد بن اسماعیل بخاری کہتے ہیں کہ ہم سے معقل بن مالک بصریٰ نے بسند «عقبة بن الأصم عن عطاء عن رافع بن خديج عن النبي صلى الله عليه وسلم» اسی طرح روایت کی ہے۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Syarik bin Abdullah An Nakha'i] dari [Abu Ishaq] dari ['Atha`] dari [Rafi' bin Khadij] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang bercocol tanam di ladang suatu kaum tanpa izin mereka maka ia tidak berhak atas tanaman itu sedikit pun namun ia berhak atas hasilnya.\" Abu Isa berkata; Hadits ini hasan gharib tidak kami ketahui dari hadits Abu Ishaq kecuali dari jalur ini dari hadits Syarik bin Abdullah. Hadits ini menjadi pedoman amal menurut sebagian ulama dan ini adalah pendapat Ahmad dan Ishaq. Aku bertanya kepada Muhammad bin Isma'il tentang hadits ini, maka ia menjawab; Itu adalah hadits hasan. Dan ia juga berkata; Aku tidak mengetahui dari hadits Abu Ishaq kecuali dari riwayat Syarik. [Muhammad] berkata; Telah menceritakan kepada kami [Ma'qil bin Malik Al Bashri] telah menceritakan kepada kami [Uqbah bin Al Asham] dari ['Atha`] dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam seperti itu",
          "tr": "Muhammed b. İsmail’e bu hadis hakkında sordum, Bu hasen bir hadistir dedi. Bu hadisin Ebû İshâk’ın rivâyetinden olduğunu sadece Şerik’in rivâyetiyle biliyorum dedi ve şöyle devam etti: Ma’kıl b. Mâlik el Basrî, Ukbe b. el Esam vasıtasıyla Atâ’dan, Rafi’ b. Hadîç’den bu hadisin bir benzerini bize rivâyet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 47
      },
      "narrator": {
        "en": "Rafi' bin Khadij"
      }
    },
    {
      "hadithNumber": 1367,
      "arabicNumber": 1367,
      "book": 15,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ الْمَعْنَى الْوَاحِدُ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ مُحَمَّدِ بْنِ النُّعْمَانِ بْنِ بَشِيرٍ، يُحَدِّثَانِ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ أَبَاهُ، نَحَلَ ابْنًا لَهُ غُلاَمًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم يُشْهِدُهُ فَقَالَ ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَهُ مِثْلَ مَا نَحَلْتَ هَذَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْدُدْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ التَّسْوِيَةَ بَيْنَ الْوَلَدِ حَتَّى قَالَ بَعْضُهُمْ يُسَوِّي بَيْنَ وَلَدِهِ حَتَّى فِي الْقُبْلَةِ ‏.‏ وَقَالَ بَعْضُهُمْ يُسَوِّي بَيْنَ وَلَدِهِ فِي النُّحْلِ وَالْعَطِيَّةِ الذَّكَرُ وَالأُنْثَى سَوَاءٌ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ ‏.‏ وَقَالَ بَعْضُهُمُ التَّسْوِيَةُ بَيْنَ الْوَلَدِ أَنْ يُعْطَى الذَّكَرُ مِثْلَ حَظِّ الأُنْثَيَيْنِ مِثْلَ قِسْمَةِ الْمِيرَاثِ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏",
        "translations": {
          "en": "Narrated An-Nu'man bin Bashir:That his father gave a slave to a son of his. So he went to the Prophet (ﷺ) to have him witness it. He (ﷺ) said: 'Have you given a gift similar to this one to all of your sons?' He replied: 'No'. So he said: 'Then take him back",
          "ur": "نعمان بن بشیر رضی الله عنہما سے روایت ہے کہ ان کے باپ ( بشیر ) نے اپنے ایک بیٹے کو ایک غلام دیا، وہ نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں آئے تاکہ آپ کو اس پر گواہ بنائیں، تو آپ نے ان سے پوچھا: کیا تم نے اپنے تمام لڑکوں کو ایسا ہی غلام عطیہ میں دیا ہے ۱؎ جیسا اس کو دیا ہے؟“ کہا: نہیں، آپ نے فرمایا: ”تو اسے واپس لے لو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے۔ ۲- یہ اور بھی سندوں سے نعمان بن بشیر رضی الله عنہما سے مروی ہے۔ ۳- بعض اہل علم کا اسی پر عمل ہے۔ یہ لوگ اولاد کے درمیان ( عطیہ دینے میں ) برابری کو ملحوظ رکھنے کو مستحب سمجھتے ہیں، یہاں تک کہ بعض لوگوں نے تو کہا ہے کہ بوسہ لینے میں بھی اپنی اولاد کے درمیان برابری برقرار رکھے، ۴- اور بعض اہل علم کہتے ہیں: بخشش اور عطیہ میں اپنی اولاد یعنی بیٹا اور بیٹی کے درمیان بھی برابری برقرار رکھے۔ یہی سفیان ثوری کا قول ہے، ۵- اور بعض اہل علم کہتے ہیں: اولاد کے درمیان برابری یہی ہے کہ میراث کی طرح لڑکے کو لڑکی کے دوگنا دیا جائے۔",
          "id": "Telah menceritakan kepada kami [Nashr bin Ali] dan [Sa'id bin Abdurrahman Al Makhzumi] dengan satu makna, keduanya berkata; Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Humaid bin Abdurrahman] dan dari [Muhammad bin An Nu'man bin Basyir]. Keduanya menceritakan dari [An Nu'man bin Basyir] bahwa ayahnya pernah memberikan seorang budak kepada anaknya. Lalu ia menemui Nabi shallallahu 'alaihi wasallam mempersaksikan kepada beliau. Beliau pun bertanya: \"Apakah engkau memberi seluruh anakmu?\" Ia menjawab; Tidak. Belaiu mengatakan: \"Ambillah ia kembali.\" Abu Isa berkata; Hadits ini hasan shahih dan telah diriwayatkan selain jalur ini dari An Nu'man bin Basyir. Hadits ini menjadi pedoman amal menurut sebagian ulama, mereka menyamakan di antara anaknya dalam hal pemberian tidak secara langsung dan pemberian yakni bagian laki-laki dan perempuan adalah sama. Ini adalah pendapat Sufyan Ats Tsauri namun sebagian mereka berpendapat; Penyamaan di antara anak adalah hendaklah laki-laki diberi seperti dua bagian perempuan seperti pembagian dalam warisan, ini adalah pendapat Ahmad dan Ishaq",
          "tr": "Câbir (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Komşu, komşusunun malı satılığa çıktığında öncelikli olarak satın alma hakkına sahiptir. Diğer alıcılar tarafından o komşunun Şüf’a hakkını kullanması beklenir. Aynı yolu kullanacak kadar birbirlerine yakın iseler ve komşuda çok uzak yerlerde ve kayıp olsa bile en fazla o hak sahibidir.” (Ebû Dâvûd, Büyü: 73; İbn Mâce, Şüf’a: 2) Bu hadis garibtir. Bu hadisi Abdulmelik b. ebî Sûfyân’dan başka Atâ’dan ve Câbir’den rivâyet eden bir kimse bilmiyoruz. Şu’be: Abdulmelik b. ebî Süleyman hakkında bu hadisten dolayı söz etmiştir. hadisçilerce güvenilir ve emin bir kimsedir. Buradaki rivâyetinden dolayı Şu’be’den başkasından onun hakkında söz ettiğini bilmiyoruz. Vekî’ bu hadisi, Şu’be yoluyla Abdulmelik b. ebî Süleyman’dan rivâyet etmiştir. Mübarek’in, Sûfyân es Sevrî’den şöyle dediği rivâyet edilmiştir: “Abdulmelik b. ebî Süleyman ilimde mizan yani sağlam bir ölçüdür.” adamlarının uygulaması bu hadise göre olup bir kimse satışa çıkarıldığı anda orada bulunmasa bile komşunun Şüf’asına daha hak sahibidir. Yokluğu uzasa dahi geldiği vakit Şüf’a hakkı onundur"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 48
      },
      "narrator": {
        "en": "An-Nu'man bin Bashir"
      }
    },
    {
      "hadithNumber": 1368,
      "arabicNumber": 1368,
      "book": 15,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ جَارُ الدَّارِ أَحَقُّ بِالدَّارِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنِ الشَّرِيدِ وَأَبِي رَافِعٍ وَأَنَسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَرَوَى عِيسَى بْنُ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏ وَرُوِيَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَالصَّحِيحُ عِنْدَ أَهْلِ الْعِلْمِ حَدِيثُ الْحَسَنِ عَنْ سَمُرَةَ وَلاَ نَعْرِفُ حَدِيثَ قَتَادَةَ عَنْ أَنَسٍ إِلاَّ مِنْ حَدِيثِ عِيسَى بْنِ يُونُسَ ‏.‏ وَحَدِيثُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي هَذَا الْبَابِ هُوَ حَدِيثٌ حَسَنٌ ‏.‏ وَرَوَى إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِي رَافِعٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ سَمِعْتُ مُحَمَّدًا يَقُولُ كِلاَ الْحَدِيثَيْنِ عِنْدِي صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated Samurah:that the Messenger of Allah (ﷺ) said: \"The neighbor of a home has more right to the home",
          "ur": "سمرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گھر کا پڑوسی گھر ( خریدنے ) کا زیادہ حقدار ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- سمرہ کی حدیث حسن صحیح ہے، ۲- اور عیسیٰ بن یونس نے سعید بن ابی عروبہ سے انہوں نے قتادہ سے اور قتادہ نے انس سے اور انس نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مثل روایت کی ہے۔ نیز سعید بن ابی عروبہ سے مروی ہے انہوں نے قتادہ سے انہوں نے حسن بصری سے اور حسن بصری نے سمرہ سے اور سمرہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۳- اس باب میں شرید، ابورافع اور انس سے بھی احادیث آئی ہیں، ۴- اور اہل علم کے نزدیک صحیح حسن کی حدیث ہے جسے انہوں نے سمرہ سے روایت کی ہے۔ اور ہم قتادہ کی حدیث کو جسے انہوں نے انس سے روایت کی ہے، صرف عیسیٰ بن یونس ہی کی روایت سے جانتے ہیں اور عبداللہ بن عبدالرحمٰن الطائفی کی حدیث جسے انہوں نے عمرو بن شرید سے اور عمرو نے اپنے والد سے اور ان کے والد نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، اس باب میں حسن حدیث ہے۔ اور ابراہیم بن میسرہ نے عمرو بن شرید سے اور عمرو نے ابورافع سے اور ابورافع نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔ امام ترمذی کہتے ہیں: میں نے محمد بن اسماعیل بخاری کو کہتے سنا کہ میرے نزدیک دونوں حدیثیں صحیح ہیں۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetangga rumah lebih berhak atas rumah tetangganya (karena adanya hak syuf'ah bagi tetangga).\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Asy Syarid, Abu Rafi' dan Anas. Abu Isa berkata; Hadits Samurah adalah hadits hasan shahih dan [Isa bin Yunus] meriwayatkan dari [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam seperti itu. Dan diriwayatkan juga dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam. Yang shahih menurut para ulama adalah hadits Al Hasan dari Samurah dan tidak kami ketahui hadits Qatadah dari Anas kecuali dari hadits Isa bin Yunus, sedangkan hadits Abdullah bin Abdurrahman Ath Tha`ifi dari Amr bin Asy Syarid dari ayahnya dari Nabi shallallahu 'alaihi wasallam dalam masalah ini adalah hadits hasan, serta Ibrahim bin Maisarah meriwayatkan dari Amr bin Asy Syarid dari Abu Rafi' dari Nabi shallallahu 'alaihi wasallam. Ia berkata; Aku mendengar Muhammad berkata; Menurutku kedua hadits tersebut shahih",
          "tr": "Câbir b. Abdullah (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur: “Şüf’a taksim edilmeyen her şeyde geçerlidir sınırları belirlenip yolları ayrıldığı zaman şüf’a yoktur.” (İbn Mâce, Şuf’a: 3; Ebû Dâvûd, İcara: 73) Bu hadis hasen sahihtir. Bazıları bu hadisi Ebû Seleme vasıtasıyla mürsel olarak ta rivâyet etmişlerdir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından bazı ilim adamlarının uygulaması bu şekilde Ömer b. Hattâb, Osman b. Affân bunlardandır. Bazı tabiin fıkıhçıları da aynı kanaatte olup Ömer b. Abdulaziz ve başkaları da bunlardandır. Medîneli âlimlerde aynı görüştedirler. Yahya b. Saîd el Ensârî, Rabia b. ebî Abdurrahman, Mâlik b. Enes bunlar arasındadır. Şâfii, Ahmed ve İshâk’ta aynı görüşte olup yolu ve sınırları belirlenmeyen mallarda şüf’a hakkının olduğu kanaatindeler. Yol ve sınır olarak birbirine karışmış olmayan komşuya şüf’a hakkı tanımamaktadırlar. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamları ise: “Şüf’a komşu için geçerlidir” demekte ve merfu olarak rivâyet edilen Rasûlüllah (sallallahü aleyhi ve sellem)’in şu hadisini delil göstermektedirler: “Evin komşusu eve daha layıktır” “Komşu bitişiğindekine daha layıktır.” Sevrî, İbn’ül Mübarek ve Küfeliler bu görüştedirler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 49
      },
      "narrator": {
        "en": "Samurah"
      }
    },
    {
      "hadithNumber": 1369,
      "arabicNumber": 1369,
      "book": 15,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْجَارُ أَحَقُّ بِشُفْعَتِهِ يُنْتَظَرُ بِهِ وَإِنْ كَانَ غَائِبًا إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَلاَ نَعْلَمُ أَحَدًا رَوَى هَذَا الْحَدِيثَ غَيْرَ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرٍ ‏.‏ وَقَدْ تَكَلَّمَ شُعْبَةُ فِي عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ مِنْ أَجْلِ هَذَا الْحَدِيثِ وَعَبْدُ الْمَلِكِ هُوَ ثِقَةٌ مَأْمُونٌ عِنْدَ أَهْلِ الْحَدِيثِ لاَ نَعْلَمُ أَحَدًا تَكَلَّمَ فِيهِ غَيْرَ شُعْبَةَ مِنْ أَجْلِ هَذَا الْحَدِيثِ ‏.‏ وَقَدْ رَوَى وَكِيعٌ عَنْ شُعْبَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ هَذَا الْحَدِيثَ ‏.‏ وَرُوِيَ عَنِ ابْنِ الْمُبَارَكِ عَنْ سُفْيَانَ الثَّوْرِيِّ قَالَ عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ مِيزَانٌ ‏.‏ يَعْنِي فِي الْعِلْمِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الرَّجُلَ أَحَقُّ بِشُفْعَتِهِ وَإِنْ كَانَ غَائِبًا فَإِذَا قَدِمَ فَلَهُ الشُّفْعَةُ وَإِنْ تَطَاوَلَ ذَلِكَ ‏.‏",
        "translations": {
          "en": "Narrated Jabir:that the Messenger of Allah (ﷺ) said: \"The neighbor has more right to his preemption. He is to be waited for even if he is absent, when their paths are the same",
          "ur": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پڑوسی اپنے پڑوسی ( ساجھی ) کے شفعہ کا زیادہ حقدار ہے، جب دونوں کا راستہ ایک ہو تو اس کا انتظار کیا جائے گا ۱؎ اگرچہ وہ موجود نہ ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم عبدالملک بن سلیمان کے علاوہ کسی کو نہیں جانتے ہیں جس نے اس حدیث کو عطاء سے اور عطاء نے جابر سے روایت کی ہو، ۲- شعبہ نے عبدالملک بن سلیمان پر اسی حدیث کی وجہ سے کلام کیا ہے۔ محدثین کے نزدیک عبدالملک ثقہ اور مامون ہیں، شعبہ کے علاوہ ہم کسی کو نہیں جانتے ہیں جس نے عبدالملک پر کلام کیا ہو، شعبہ نے بھی صرف اسی حدیث کی وجہ سے کلام کیا ہے۔ اور وکیع نے بھی یہ حدیث شعبہ سے اور شعبہ نے عبدالملک بن ابی سلیمان سے روایت کی ہے۔ اور ابن مبارک نے سفیان ثوری سے روایت کی ہے کہ انہوں نے کہا: عبدالملک بن سفیان میزان ہیں یعنی علم میں، ۲- اہل علم کا اسی حدیث پر عمل ہے کہ آدمی اپنے شفعہ کا زیادہ حقدار ہے اگرچہ وہ غائب ہی کیوں نہ ہو، جب وہ ( سفر وغیرہ ) سے واپس آئے گا تو اس کو شفعہ ملے گا گرچہ اس پر لمبی مدت گزر چکی ہو۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Khalid bin Abdullah Al Wasithi] dari [Abdul Malik bin Abu Sulaiman] dari ['Atha`] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak dengan syuf'ahnya (tetangga dengan tetangga), hal itu tetap ditunggu sekalipun ia tidak ada di tempat jika jalan yang mereka berdua lalui itu satu.\" Abu Isa berkata; Hadits ini gharib dan kami tidak mengetahui seorang pun yang meriwayatkan hadits ini selain Abdul Malik bin Abu Sulaiman dari 'Atha` dari Jabir, sementara Syu'bah telah mengomentari Abdul Malik bin Abu Sulaiman dari sisi hadits ini. Abdul Malik adalah tsiqah lagi terpercaya menurut ulama hadits, namun kami tidak mengetahui seorang pun mengomentarinya selain Syu'bah dari sisi hadits ini. [Waki'] telah meriwayatkan hadits ini dari [Syu'bah] dari [Abdul Malik bin Abu Sulaiman] dan telah diriwayatkan dari Ibnu Al Mubarak dari Sufyan Ats Tsauri ia berkata; Abdul Malik bin Abu Sulaiman adalah seimbang yakni dalam masalah ilmu. Hadits ini menjadi pedoman amal menurut para ulama, bahwa seseorang lebih berhak dengan syuf'ahnya meskipun ia tidak ada di tempat, jika ia datang maka baginya syuf'ah meskipun dalam waktu yang lama",
          "tr": "Câbir (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Komşu, komşusunun malı satılığa çıktığında öncelikli olarak satın alma hakkına sahiptir. Diğer alıcılar tarafından o komşunun Şüf’a hakkını kullanması beklenir. Aynı yolu kullanacak kadar birbirlerine yakın iseler ve komşuda çok uzak yerlerde ve kayıp olsa bile en fazla o hak sahibidir.” Diğer tahric: Ebû Dâvûd, Buyu’; İbn Mâce, Şüf’a Tirmizî: Bu hadis garibtir. Bu hadisi Abdulmelik b. ebî Sûfyân’dan başka Atâ’dan ve Câbir’den rivâyet eden bir kimse bilmiyoruz. Şu’be: Abdulmelik b. ebî Süleyman hakkında bu hadisten dolayı söz etmiştir. Abdulmelik hadisçilerce güvenilir ve emin bir kimsedir. Buradaki rivâyetinden dolayı Şu’be’den başkasından onun hakkında söz ettiğini bilmiyoruz. Vekî’ bu hadisi, Şu’be yoluyla Abdulmelik b. ebî Süleyman’dan rivâyet etmiştir. İbn’ül Mübarek’in, Sûfyân es Sevrî’den şöyle dediği rivâyet edilmiştir: “Abdulmelik b. ebî Süleyman ilimde mizan yani sağlam bir ölçüdür.” İlim adamlarının uygulaması bu hadise göre olup bir kimse satışa çıkarıldığı anda orada bulunmasa bile komşunun Şüf’asına daha hak sahibidir. Yokluğu uzasa dahi geldiği vakit Şüf’a hakkı onundur"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 50
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 1370,
      "arabicNumber": 1370,
      "book": 15,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ بَعْضُهُمْ مُرْسَلاً عَنْ أَبِي سَلَمَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْهُمْ عُمَرُ بْنُ الْخَطَّابِ وَعُثْمَانُ بْنُ عَفَّانَ وَبِهِ يَقُولُ بَعْضُ فُقَهَاءِ التَّابِعِينَ مِثْلُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ وَغَيْرِهِ وَهُوَ قَوْلُ أَهْلِ الْمَدِينَةِ مِنْهُمْ يَحْيَى بْنُ سَعِيدٍ الأَنْصَارِيُّ وَرَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ وَمَالِكُ بْنُ أَنَسٍ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ لاَ يَرَوْنَ الشُّفْعَةَ إِلاَّ لِلْخَلِيطِ وَلاَ يَرَوْنَ لِلْجَارِ شُفْعَةً إِذَا لَمْ يَكُنْ خَلِيطًا ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمُ الشُّفْعَةُ لِلْجَارِ ‏.‏ وَاحْتَجُّوا بِالْحَدِيثِ الْمَرْفُوعِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ جَارُ الدَّارِ أَحَقُّ بِالدَّارِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏ ‏.‏ وَهُوَ قَوْلُ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَأَهْلِ الْكُوفَةِ ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin 'Abdullah:that the Messenger of Allah (ﷺ) said: \"When the boundaries are defined and the streets are fixed, then there is no preemption",
          "ur": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب حد بندی ہو جائے اور راستے الگ الگ کر دیے جائیں تو شفعہ نہیں“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے بعض لوگوں نے ابوسلمہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کیا ہے، ۳- صحابہ کرام میں سے بعض اہل علم کا جن میں عمر بن خطاب اور عثمان بن عفان بھی شامل ہیں اسی پر عمل ہے اور بعض تابعین فقہاء جیسے عمر بن عبدالعزیز وغیرہ بھی اسی کے قائل ہیں۔ اور یہی اہل مدینہ کا بھی قول ہے، جن میں یحییٰ بن سعید انصاری، ربیعہ بن ابوعبدالرحمٰن اور مالک بن انس شامل ہیں، شافعی، احمد اور اسحاق بن راہویہ بھی اسی کے قائل ہیں، یہ لوگ صرف ساجھی دار کے لیے ہی حق شفعہ کے قائل ہیں۔ اور جب پڑوسی ساجھی دار نہ ہو تو اس کے لیے حق شفعہ کے قائل نہیں۔ صحابہ کرام وغیرہم میں سے بعض اہل علم کہتے ہیں کہ پڑوسی کے لیے بھی شفعہ ہے اور ان لوگوں نے مرفوع حدیث سے استدلال کیا ہے جس میں نبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: ”گھر کا پڑوسی گھر کا زیادہ حقدار ہے ۲؎“، نیز فرماتے ہیں: ”پڑوسی اپنے سے لگی ہوئی زمین یا مکان کا زیادہ حقدار ہے اور یہی ثوری، ابن مبارک اور اہل کوفہ کا بھی قول ہے۔",
          "id": "Telah menceritakan kepada kami [Abdu bin Humaid], telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin Abdurrahman] dari [Jabir bin Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika telah terjadi pembatasan dan jalan-jalan telah dirubah, maka tidak hak syuf'ah.\" Abu Isa berkata; Hadits ini hasan shahih dan sebagian mereka telah meriwayatkannya secara mursal dari Abu Salamah dari Nabi shallallahu 'alaihi wasallam. Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, di antara mereka; Umar bin Al Khaththab dan Utsman bin 'Affan serta sebagian fuqaha dari kalangan tabi'in juga mengatakannya seperti; Umar bin Abdul Aziz dan selainnya. Ini adalah pendapat ulama Madinah, di antara mereka; Yahya bin Sa'id Al Anshari, Rabi'ah bin Abu Abdurrahman dan Malik bin Anas serta Asy Syafi'i, Ahmad dan Ishaq juga mengatakannya, mereka tidak membolehkan hak syuf'ah kecuali untuk persekutuan, mereka juga tidak membolehkan hak syuf'ah untuk tetangga jika tidak menjadi sekutu. Sementara sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka berpendapat; Syuf'ah adalah hak tetangga, mereka beralasan dengan hadits marfu' dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tetangga rumah lebih berhak dengan rumah.\" Beliau juga bersabda: \"Tetangga lebih berhak atas tetangga dekatnya.\" Ini adalah pendapat Ats Tsauri, Ibnu Al Mubarak dan ulama Kufah",
          "tr": "Hennâd, Ebû Bekir b. Ayyaş vasıtasıyla Abdulaziz b. Rüfey’den, İbn ebî Müleyke’den mana olarak bu hadisin benzerini rivâyet etmiş bu rivâyette “İbn Abbâs’tan” denmemiştir. Aynı şekilde pek çok kimse Abdulaziz b. Rüfey’den benzeri şekilde rivâyet etmiş olup bu rivâyetlerde de “İbn Abbâs’tan” denmemektedir. Bu rivâyet ise Ebû Hamza’nın rivâyetinden daha sahihtir. Ebû Hamza güvenilir bir kimsedir yapılan hatanın Ebû Hamza dışında başka birisinden olması mümkündür"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 51
      },
      "narrator": {
        "en": "Jabir bin 'Abdullah"
      }
    },
    {
      "hadithNumber": 1371,
      "arabicNumber": 1371,
      "book": 15,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ أَبِي حَمْزَةَ السُّكَّرِيِّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الشَّرِيكُ شَفِيعٌ وَالشُّفْعَةُ فِي كُلِّ شَيْءٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ مِثْلَ هَذَا إِلاَّ مِنْ حَدِيثِ أَبِي حَمْزَةَ السُّكَّرِيِّ ‏.‏ وَقَدْ رَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً وَهَذَا أَصَحُّ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ وَلَيْسَ فِيهِ عَنِ ابْنِ عَبَّاسٍ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ مِثْلَ هَذَا لَيْسَ فِيهِ عَنِ ابْنِ عَبَّاسٍ وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي حَمْزَةَ ‏.‏ وَأَبُو حَمْزَةَ ثِقَةٌ يُمْكِنُ أَنْ يَكُونَ الْخَطَأُ مِنْ غَيْرِ أَبِي حَمْزَةَ ‏.‏ حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ أَبِي بَكْرِ بْنِ عَيَّاشٍ ‏.‏ وَقَالَ أَكْثَرُ أَهْلِ الْعِلْمِ إِنَّمَا تَكُونُ الشُّفْعَةُ فِي الدُّورِ وَالأَرَضِينَ وَلَمْ يَرَوُا الشُّفْعَةَ فِي كُلِّ شَيْءٍ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ الشُّفْعَةُ فِي كُلِّ شَيْءٍ ‏.‏ وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏",
        "translations": {
          "en": "Narrated Ibn Abbas:that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything",
          "ur": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ساجھی دار کو حق شفعہ حاصل ہے اور شفعہ ہر چیز میں ہے“۔ امام ترمذی کہتے ہیں: ۱- ہم اس حدیث کو اس طرح ( مرفوعاً ) صرف ابوحمزہ سکری ہی کی روایت سے جانتے ہیں۔ ۲- اس حدیث کو کئی لوگوں نے عبدالعزیز بن رفیع سے اور عبدالعزیز نے ابن ابی ملیکہ سے اور ابن ابی ملیکہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلا روایت کیا ہے۔ اور یہی زیادہ صحیح ہے۔ اس سند میں ہناد نے ابوبکر بن عیاش سے ابوبکر بن عیاش نے عبدالعزیز بن رفیع سے اور عبدالعزیز نے ابن ابی ملیکہ سے اور ابن ابی ملیکہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح کی حدیث روایت کی ہے، اس میں ابن عباس کا واسطہ نہیں ہے، ۳- اور اسی طرح کئی اور لوگوں نے عبدالعزیز بن رفیع سے اسی کے مثل حدیث روایت کی ہے اور اس میں بھی ابن عباس کا واسطہ نہیں ہے، ۴ – ابوحمزہ ( یہ مرفوع ) کی حدیث سے زیادہ صحیح ہے۔ ابوحمزہ ثقہ ہیں۔ ممکن ہے یہ خطا ابوحمزہ کے علاوہ کسی اور سے ہوئی ہو۔ اس سند میں ھناد نے ابوالاحوص سے اور ابوالاحوص نے عبدالعزیز بن رفیع سے اور عبدالعزیز نے ابن ابی ملیکہ سے اور ابن ابی ملیکہ نے نبی اکرم صلی اللہ علیہ وسلم سے ابوبکر بن عیاش کی حدیث کی طرح روایت کی ہے، ۶ – اکثر اہل علم کہتے ہیں کہ حق شفعہ کا نفاذ صرف گھر اور زمین میں ہو گا۔ ان لوگوں کی رائے میں شفعہ ہر چیز میں نہیں، ۷- اور بعض اہل علم کہتے ہیں: شعفہ ہر چیز میں ہے۔ لیکن پہلا قول زیادہ صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Yusuf bin Isa], telah menceritakan kepada kami [Al Fadlal bin Musa] dari [Abu Hamzah As Sukkari] dari [Abdul Aziz bin Rufai'] dari [Ibnu Abu Mulaikah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekutu adalah teman, dan syuf'ah berlaku pada segala sesuatu.\" Abu Isa; Hadits ini tidak kami ketahui seperti ini kecuali dari hadits Abu Hamzah As Sukkari, dan banyak yang meriwayatkan hadits ini dari Abdul Aziz bin Rufai' dari Ibnu Abu Mulaikah dari Nabi shallallahu 'alaihi wasallam secara mursal namun hadits ini lebih shahih. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari [Abdul Aziz bin Rufai'] dari [Ibnu Abu Mulaikah] dari Nabi shallallahu 'alaihi wasallam seperti itu dengan maknanya, namun tidak terdapat di dalamnya riwayat dari Ibnu Abbas. Dan demikianlah banyak yang meriwayatkan dari Abdul Aziz bin Rufai' seperti ini, tidak terdapat di dalamnya riwayat dari Ibnu Abbas, namun ini lebih shahih dari hadits Abu Hamzah. Abu Hamzah adalah tsiqah kemungkinan yang melakukan kesalahan dari selain Abu Hamzah. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Al Ahwash] dari [Abdul Aziz bin Rufai'] dari [Ibnu Abu Mulaikah] dari Nabi shallallahu 'alaihi wasallam seperti hadits Abu Bakr bin 'Ayyasy. Kebanyakan para ulama berpendapat; Sesungguhnya syuf'ah itu berlaku hanya pada rumah dan tanah, mereka tidak membolehkan syuf'ah berlaku pada segala sesuatu. Sedangkan sebagian ulama berpendapat; Syuf'ah dapat berlaku pada segala sesuatu, pendapat ini lebih shahih",
          "tr": "Hennâd, Ebûl Ahvas yoluyla Abdulaziz b. Rüfey’den, İbn ebî Müleyke’den, Ebû Bekir b. Ayyaş’ın hadisinin bir benzerini bize aktarmıştır. adamlarının çoğunluğu şüf’a ancak evlerde ve arazilerde olur demekte ve her şeyde şüf’a olduğu görüşüne katılmamaktadırlar. Bazı ilim adamları: “Her şeyde şüf’a vardır” görüşünde olup birinci görüş daha sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif Munkar"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 52
      },
      "narrator": {
        "en": "Ibn Abbas"
      }
    },
    {
      "hadithNumber": 1372,
      "arabicNumber": 1372,
      "book": 15,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ عَرِّفْهَا سَنَةً ثُمَّ اعْرِفْ وِكَاءَهَا وَوِعَاءَهَا وَعِفَاصَهَا ثُمَّ اسْتَنْفِقْ بِهَا فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏ ‏.‏ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ فَقَالَ ‏\"‏ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الإِبِلِ قَالَ فَغَضِبَ النَّبِيُّ صلى الله عليه وسلم حَتَّى احْمَرَّتْ وَجْنَتَاهُ أَوِ احْمَرَّ وَجْهُهُ فَقَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا حَتَّى تَلْقَى رَبَّهَا ‏\"‏ ‏.‏ حَدِيثُ زَيْدِ بْنِ خَالِدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَحَدِيثُ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أُبَىِّ بْنِ كَعْبٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَالْجَارُودِ بْنِ الْمُعَلَّى وَعِيَاضِ بْنِ حِمَارٍ وَجَرِيرِ بْنِ عَبْدِ اللَّهِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ وَرَخَّصُوا فِي اللُّقَطَةِ إِذَا عَرَّفَهَا سَنَةً فَلَمْ يَجِدْ مَنْ يَعْرِفُهَا أَنْ يَنْتَفِعَ بِهَا ‏.‏ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ يُعَرِّفُهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ تَصَدَّقَ بِهَا ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ لَمْ يَرَوْا لِصَاحِبِ اللُّقَطَةِ أَنْ يَنْتَفِعَ بِهَا إِذَا كَانَ غَنِيًّا ‏.‏ وَقَالَ الشَّافِعِيُّ يَنْتَفِعُ بِهَا وَإِنْ كَانَ غَنِيًّا لأَنَّ أُبَىَّ بْنَ كَعْبٍ أَصَابَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم صُرَّةً فِيهَا مِائَةُ دِينَارٍ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُعَرِّفَهَا ثُمَّ يَنْتَفِعَ بِهَا وَكَانَ أُبَىٌّ كَثِيرَ الْمَالِ مِنْ مَيَاسِيرِ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَهُ النَّبِيُّ صلى الله عليه وسلم أَنْ يُعَرِّفَهَا فَلَمْ يَجِدْ مَنْ يَعْرِفُهَا فَأَمَرَهُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَأْكُلَهَا فَلَوْ كَانَتِ اللُّقَطَةُ لَمْ تَحِلَّ إِلاَّ لِمَنْ تَحِلُّ لَهُ الصَّدَقَةُ لَمْ تَحِلَّ لِعَلِيِّ بْنِ أَبِي طَالِبٍ لأَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَصَابَ دِينَارًا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَعَرَّفَهُ فَلَمْ يَجِدْ مَنْ يَعْرِفُهُ فَأَمَرَهُ النَّبِيُّ صلى الله عليه وسلم بِأَكْلِهِ وَكَانَ لاَ يَحِلُّ لَهُ الصَّدَقَةُ ‏.‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا كَانَتِ اللُّقَطَةُ يَسِيرَةً أَنْ يَنْتَفِعَ بِهَا وَلاَ يُعَرِّفَهَا ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا كَانَ دُونَ دِينَارٍ يُعَرِّفُهَا قَدْرَ جُمُعَةٍ ‏.‏ وَهُوَ قَوْلُ إِسْحَاقَ بْنِ إِبْرَاهِيمَ ‏.‏",
        "translations": {
          "en": "Narrated Zaid bin Khalid Al-Juhni:\"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner",
          "tr": "Zeyd b. Hâlid el Cühenî (radıyallahü anh)’den rivâyete göre, bir adam buluntu malın durumundan sordu. Rasûlüllah (sallallahü aleyhi ve sellem): “Bir yıl ilan et özelliklerini iyice tanı sonra onu kullan sahibi gelirse kendisine hemen öde. Adam: Ey Allah’ın Rasûlü kaybolmuş koyunun durumu nedir? Deyince Rasûlüllah (sallallahü aleyhi ve sellem): Onu al o ya senin ya mü’min kardeşinin yada kurdundur” buyurdu. Adam: “Ey Allah’ın Rasülû yitik develer ne olacak? Diye sordu. Zeyd b. Hâlid dedi ki: “Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) öfkelendi yanakları veya yüzü kızardı ve buyurdular ki: Ondan sana ne! Onun sağlam ayakları ve yanında su tulumu vardır sahibini buluncaya kadar yeter ona…” (Buhârî, Lukata: 2; İbn Mace, Lukata: 1) b. Hâlid’in hadisi hasen sahihtir. Kendisinden değişik şekillerde de rivâyet edilmiştir. Zeyd b. Hâlid’den, Münbais’in azâdlısı Yezîd’in hadisi de hasen sahihtir. Kendisinden değişik şekillerde de rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 53
      },
      "narrator": {
        "en": "Zaid bin Khalid Al-Juhni"
      }
    },
    {
      "hadithNumber": 1373,
      "arabicNumber": 1373,
      "book": 15,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، أَخْبَرَنَا الضَّحَّاكُ بْنُ عُثْمَانَ، حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ اللُّقَطَةِ فَقَالَ ‏ \"‏ عَرِّفْهَا سَنَةً فَإِنِ اعْتُرِفَتْ فَأَدِّهَا وَإِلاَّ فَاعْرِفْ وِعَاءَهَا وَعِفَاصَهَا وَوِكَاءَهَا وَعَدَدَهَا ثُمَّ كُلْهَا فَإِذَا جَاءَ صَاحِبُهَا فَأَدِّهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ زَيْدِ بْنِ خَالِدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ قَالَ أَحْمَدُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ هَذَا الْحَدِيثُ ‏.‏",
        "translations": {
          "en": "Zaid bin Khalid Al-Juhni narrated that the Messenger of Allah (ﷺ) was asked about the lost item. He said:\"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him",
          "tr": "Zeyd b. Hâlid el Cühenî (r.a.)’den rivâyete göre yitik malın hükmü soruldu bunun üzerine şöyle buyurdu: “Bir yıl ilan et tanıyan çıkarsa onu ona ver. Aksi halde tüm özelliklerini tespit edip öğren ve kullan sonra sahibi gelirse ödersin.” Diğer tahric: Buhârî, Lukata; İbn Mace, Lukata"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 54
      }
    },
    {
      "hadithNumber": 1374,
      "arabicNumber": 1374,
      "book": 15,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَيَزِيدُ بْنُ هَارُونَ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ خَرَجْتُ مَعَ زَيْدِ بْنِ صُوحَانَ وَسَلْمَانَ بْنِ رَبِيعَةَ فَوَجَدْتُ سَوْطًا قَالَ ابْنُ نُمَيْرٍ فِي حَدِيثِهِ فَالْتَقَطْتُ سَوْطًا فَأَخَذْتُهُ قَالاَ دَعْهُ ‏.‏ فَقُلْتُ لاَ أَدَعُهُ تَأْكُلُهُ السِّبَاعُ لآخُذَنَّهُ فَلأَسْتَمْتِعَنَّ بِهِ ‏.‏ فَقَدِمْتُ عَلَى أُبَىِّ بْنِ كَعْبٍ فَسَأَلْتُهُ عَنْ ذَلِكَ وَحَدَّثْتُهُ الْحَدِيثَ فَقَالَ أَحْسَنْتَ أَنَا وَجَدْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم صُرَّةً فِيهَا مِائَةُ دِينَارٍ ‏.‏ قَالَ فَأَتَيْتُهُ بِهَا فَقَالَ لِي ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ فَعَرَّفْتُهَا حَوْلاً فَمَا أَجِدُ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ بِهَا فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً آخَرَ ‏\"‏ ‏.‏ فَعَرَّفْتُهَا ثُمَّ أَتَيْتُهُ بِهَا فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً آخَرَ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ أَحْصِ عِدَّتَهَا وَوِعَاءَهَا وَوِكَاءَهَا فَإِنْ جَاءَ طَالِبُهَا فَأَخْبَرَكَ بِعِدَّتِهَا وَوِعَائِهَا وَوِكَائِهَا فَادْفَعْهَا إِلَيْهِ وَإِلاَّ فَاسْتَمْتِعْ بِهَا ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Suwaid bin Ghafalah said:\"I went out with Zaid bin Suhan and Salman bin Rabi'ah, and found a whip.\" In his narration Ibn Numair (one of the narrators) said: \"I found a lost whip and took it. They said: 'Leave it'. I said: 'I will not leave it to be eaten by predators. I will take it to make use of it.' So I met up with Ubayy bin Ka'b and asked him about that. So he narrated the Hadith, he said: 'That is fine. I found a sack containing one hundred Dinar during the lifetime of the Messenger of Allah (ﷺ)' He said: 'So I brought it to him. He said to me: \"Make a public announcement about it for one year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said to me: \"Make a public announcement about it for another year.\" So I announced it for a year but did not find anyone to claim it. Then I brought it to him. He said: \"Make a public announcement about if for another year.\" And he said: \"Remember its amount, its container and its string. If someone comes seeking it and informs you of its amount and its string, then give it to him, otherwise use it",
          "ur": "سوید بن غفلہ کہتے ہیں کہ میں زید بن صوحان اور سلمان بن ربیعہ کے ساتھ نکلا تو مجھے ( راستے میں ) ایک کوڑا پڑا ملا – ابن نمیر کی روایت میں ہے کہ میں نے پڑا ہوا ایک کوڑا پایا – تو میں نے اسے اٹھا لیا تو ان دونوں نے کہا: اسے رہنے دو، ( نہ اٹھاؤ ) میں نے کہا: میں اسے نہیں چھوڑ سکتا کہ اسے درندے کھا جائیں، میں اسے ضرور اٹھاؤں گا، اور اس سے فائدہ اٹھاؤں گا۔ پھر میں ابی بن کعب کے پاس آیا، اور ان سے اس کے بارے میں پوچھا اور ان سے پوری بات بیان کی تو انہوں نے کہا: تم نے اچھا کیا، رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں، میں نے ایک تھیلی پائی جس میں سو دینار تھے، اسے لے کر میں آپ صلی اللہ علیہ وسلم کے پاس آیا، آپ نے مجھ سے فرمایا: ”ایک سال تک اس کی پہچان کراؤ“، میں نے ایک سال تک اس کی پہچان کرائی لیکن مجھے کوئی نہیں ملا جو اسے پہچانتا، پھر میں اسے لے کر آپ کے پاس آیا۔ آپ نے فرمایا: ”ایک سال تک اور اس کی پہچان کراؤ“، میں نے اس کی پہچان کرائی، پھر اسے لے کر آپ کے پاس آیا۔ تو آپ نے فرمایا: ”ایک سال تک اور اس کی پہچان کراؤ ۱؎“، اور فرمایا: ”اس کی گنتی کر لو، اس کی تھیلی اور اس کے سربند کو خوب اچھی طرح پہچان لو اگر اسے تلاش کرنے والا آئے اور اس کی تعداد، اس کی تھیلی اور اس کے سربند کے بارے میں بتائے تو اسے دے دو ورنہ تم اسے اپنے کام میں لاؤ“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal], telah menceritakan kepada kami [Abdullah bin Numair] dan [Yazid bin Harun] dari [Sufyan Ats Tsauri] dari [Salamah bin Kuhail] dari [Suwaid bin Ghaflah] ia berkata; Aku pernah keluar bersama Zaid bin Shuhan dan Salamah bin Rabi'ah, lalu aku mendapatkan sebuah cambuk. Ibnu Numair berkata dalam haditsnya; Lalu aku menemukan sebuah cambuk dan aku mengambilnya, keduanya berkata; Biarkan ia. Aku berkata; Aku tidak akan membiarkannya karena binatang buas akan memakannya, sungguh aku akan mengambil dan menggunakannya. Lalu aku datang menemui [Ubay bin Ka'b] bertanya kepadanya tentang hal itu dan aku menceritakan kepadanya sebuah hadits. Ia pun menjawab; Bagus, pada masa Rasulullah shallallahu 'alaihi wasallam aku pernah mendapatkan sebuah kantong berisi seratus dinar. Ia melanjutkan; Lalu aku membawanya kepada beliau, beliau pun mengatakan kepadaku: \"Umumkanlah selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun namun tidak ada orang yang mengakuinya, kemudian aku membawanya kembali kepada beliau, beliau pun mengatakan kepadaku: \"Umumkanlah selama satu tahun lagi.\" Aku pun mengumumkannya kemudian aku menemuinya lagi. Beliau pun masih mengatakan kepadaku: \"Umumkanlah selama satu tahun lagi.\" Dan beliau bersabda: \"Hitunglah jumlah, bejana dan tali ikatannya, jika pemiliknya datang memintanya maka kabarkan jumlah, bejana dan tali ikatannya kepadanya, lalu serahkan kepadanya. Namun jika tidak ada yang mengakuinya maka pergunakanlah ia.\" Ia mengatakan; Hadits ini hasan shahih",
          "tr": "Süveyd b. Gafele (r.a.)’den rivâyete göre, şöyle demiştir: “Zeyd b. Sûhan ve Selmân b. Rabia ile birlikte çıkmıştım bir kamçı buldum (İbn Nümeyr rivâyetinde bir kamçı buldum ve onu aldım dedi) Bırak onu dediler, bunun üzerine ben onu yırtıcı hayvanlara yem olarak bırakamam onu alıp kullanacağım dedim. Daha sonra Übey b. Ka’b’e geldiğimde bunun hükmünü sordum durumu kendisine anlattım. Dedi ki: İyi yapmışsın dedi Rasûlullah (s.a.v.) zamanında içerisinde yüz dinar bulunan bir kese bulmuştum onu Rasûlullah (s.a.v.)’e getirdim bir yıl tanıt, ilan et buyurdu. Bir yıl ilan ettim sahibi çıkmadı sonra tekrar Rasûlullah (s.a.v.)’e getirdim. Bir yıl daha tanıt ve ilan et buyurdu. Bir yıl daha ilan ettikten sonra tekrar Rasûlullah (s.a.v.)’e getirdim. Bir yıl daha ilan et tanıt buyurdu. Sonra her türlü özelliklerini tespit et sahibi gelirse keseyi ona ver değilse ondan istifade et” dedi veya buyurdu. Diğer tahric: Buhârî, Lukata; Müslim, Lukata Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 55
      }
    },
    {
      "hadithNumber": 1375,
      "arabicNumber": 1375,
      "book": 15,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَنْبَأَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ فَقَالَ يَا رَسُولَ اللَّهِ أَصَبْتُ مَالاً بِخَيْبَرَ لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ عِنْدِي مِنْهُ فَمَا تَأْمُرُنِي قَالَ ‏ \"‏ إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَا ‏\"‏ ‏.‏ فَتَصَدَّقَ بِهَا عُمَرُ أَنَّهَا لاَ يُبَاعُ أَصْلُهَا وَلاَ يُوهَبُ وَلاَ يُورَثُ تَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَالْقُرْبَى وَفِي الرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ وَالضَّيْفِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ ‏.‏ قَالَ فَذَكَرْتُهُ لِمُحَمَّدِ بْنِ سِيرِينَ فَقَالَ غَيْرَ مُتَأَثِّلٍ مَالاً ‏.‏ قَالَ ابْنُ عَوْنٍ فَحَدَّثَنِي بِهِ رَجُلٌ آخَرُ أَنَّهُ قَرَأَهَا فِي قِطْعَةِ أَدِيمٍ أَحْمَرَ غَيْرَ مُتَأَثِّلٍ مَالاً ‏.‏ قَالَ إِسْمَاعِيلُ وَأَنَا قَرَأْتُهَا عِنْدَ ابْنِ عُبَيْدِ اللَّهِ بْنِ عُمَرَ فَكَانَ فِيهِ غَيْرَ مُتَأَثِّلٍ مَالاً ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ لاَ نَعْلَمُ بَيْنَ الْمُتَقَدِّمِينَ مِنْهُمْ فِي ذَلِكَ اخْتِلاَفًا فِي إِجَازَةِ وَقْفِ الأَرَضِينَ وَغَيْرِ ذَلِكَ ‏.‏",
        "translations": {
          "en": "Narrated Isma'il bin Ibrahim from Ibn 'Awn, from Nafi' that Ibn 'Umar said:\"Umar got some land from Khaibar and said: 'O Messenger of Allah! I got some wealth from Khaibar and I never ever had any wealth as plentiful as it, so what do you order me (to do with it)?' He said: 'If you wish, make it a grant and give charity from it.' So 'Umar gave it in charity: That is not to be sold entirely, nor given away, nor inherited, to be used to produce charity for the needy, those who are near it, for freeing slaves, for the cause of Allah, the wayfarer, the guest, and that there is no harm on its custodian consuming what is customary from it, or eating from its charity, without trying to amass wealth from it",
          "ur": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ عمر رضی الله عنہ کو خیبر میں ( مال غنیمت سے ) کچھ زمین ملی، تو انہوں نے عرض کیا: اللہ کے رسول! خیبر میں مجھے مال ملا ہے اس سے زیادہ عمدہ مال مجھے کبھی نہیں ملا۔ ( اس کے بارے میں ) آپ مجھے کیا حکم فرماتے ہیں؟ آپ نے فرمایا: ”اگر چاہو تو اس کی اصل روک لو اور اسے ( پیداوار کو ) صدقہ کر دو، تو عمر رضی الله عنہ نے اسے اس طرح سے صدقہ کیا کہ اصل زمین نہ بیچی جائے، نہ ہبہ کی جائے، اور نہ کسی کو وراثت میں دی جائے ۱؎، اور اسے فقیروں میں، رشتہ داروں میں، غلام آزاد کرنے میں، اللہ کے راستے ( جہاد ) میں، مسافروں میں اور مہمانوں میں خرچ کیا جائے۔ اور جو اس کا والی ( نگراں ) ہو اس کے لیے اس میں سے معروف طریقے سے کھانے اور دوست کو کھلانے میں کوئی حرج نہیں ہے، جبکہ وہ اس میں سے ذخیرہ اندوزی کرنے والا نہ ہو۔ ابن عون کہتے ہیں: میں نے اسے محمد بن سیرین سے بیان کیا تو انہوں نے «غير متمول فيه» کے بجائے «غير متأثل مالا» کہا۔ ابن عون کہتے ہیں: مجھ سے اسے ایک اور آدمی نے بیان کیا ہے کہ اس نے اس وقف نامے کو پڑھا تھا جو ایک لال چمڑے پر تحریر تھا اور اس میں بھی «غير متأثل مالا» کے الفاظ تھے۔ اسماعیل کہتے ہیں: میں نے اس وقف نامے کو عبیداللہ بن عمر کے بیٹے کے پاس پڑھا، اس میں بھی «غير متأثل مالا» کے الفاظ تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- صحابہ کرام وغیرہم میں سے اہل علم کا اسی پر عمل ہے۔ متقدمین میں سے ہم کسی کو نہیں جانتے ہیں جس نے زمین وغیرہ کو وقف کرنے میں اختلاف کیا ہو۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah memberitakan kepada kami [Isma'il bin Ibrahim] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] ia berkata; Umar pernah mendapatkan sebidang tanah di Khaibar, ia pun bertanya; Wahai Rasulullah, aku mendapatkan harta di khaibar, aku tidak pernah mendapatkan harta yang menyenangkan hatiku sebelumnya seperti ini, maka apa yang engkau perintahkan kepadaku (atas harta ini)? Beliau menjawab, \"Jika kamu berkenan, tahanlah pokoknya dan bersedekahlah dengannya\", maka Umar pun bersedekah dengannya, hartanya itu tidak ia jual, tidak ia hibahkan, dan tidak ia wariskan, dan ia mensedekahkannya dari harta itu kepada para fakir miskin, ahli kerabat baik yang dekat maupun yang jauh, fi sabilillah, ibnu sabil, dan (para) tamu. Tidaklah mengapa (tidak berdosa) bagi yang mengurus harta itu jika mengambil darinya untuk makan dengan cara yang baik (wajar), atau memberi makan kepada teman tanpa menjual (mengambiil keuntugan materi) darinya. Ia (At Tirmidzi) berkata, 'Aku menyebutkannya kepada [Muhammad bin Sirin], maka ia mengatakan 'ghairu muta`atstsil maalan', [Ibnu 'Aun] berkata, Telah bercerita kepadaku atas hadits ini seseorang yang lain bahwa ia membacanya 'fi qith'ati adimin ahmar ghair muta`atstsil maalan', [Ismail] berkata, 'Dan saya membacanya kepada [Ibnu Ubaidullah bin Umar], maka dalam haditsnya 'ghair muta`atstsil maalan'. Abu Isa berkata, 'Hadits ini hasan shahih, dan menjadi landasan amal menurut ahli ilmu dari kalangan shahabat Nabi Shallalahu 'alaihi wa sallam dan juga selain mereka, dan kami tidak menemukan adanya perselisihan di antara ulama terdahulu tentang dibolehkannya wakaf tanah dan juga yang lainnya",
          "tr": "İbn Ömer (r.a.)’den rivâyete göre, şöyle demiştir: Hayber’de, Ömer’in hissesine bir toprak parçası düşmüştü. Ömer: Ey Allah’ın Rasûlü! Hayber’deki bana gelen maldan daha güzel hiçbir mala sahip olmamıştım. Şimdi bu mal hakkında bana ne emredersin? Rasûlullah (s.a.v.) buyurdular ki: Dilersen aslını vakfet mahsulünü sadaka olarak dağıt. Bunun üzerine Ömer onu vakfetti şöyle ki: Aslı yani o arazi parçası satılmayacak, bağışlanmayacak ve miras olarak intikal etmeyecektir. Ömer bu arazinin gelirini fakirlere, yakınlara, köle ve esirleri hürriyetine kavuşturma yolunda, yolda kalmış kimselere ve misafirlere sadaka olarak verdi. O yere mütevelli olan kimsenin o vakfın gelirinden normal şartlarda yemesinde ve bir dostuna yedirmesinde bir günah yoktur. İbn Avn diyor ki: Muhammed b. Sirîn’e bu hadisi hatırlattığımda “Mal toplayıcı olmayarak” dedi. İbn Avn şöyle devam ediyor: Başka bir kimse bu hadisi kırmızı bir deri parçasında “Mal biriktirmemek şartı ile mütevelli olan yiyebilir” şeklinde okumuştur. İsmail diyor ki: ben o hadisi Ubeydullah b. Ömer’in yanında okudum; orada “Sermaye biriktirmemek şartıyla” idi. Diğer tahric: Buhârî, Şurût; Müslim, Vasıyyet Tirmizî: Bu hadis hasen sahihtir. Rasûlullah (s.a.v.)’in ashabından ve başkalarından ilim adamlarının uygulaması bu hadise göredir. Bu vakıf konusunda önceki âlimler arasında toprak veya başka şeyin vakfının caiz olduğu hakkında herhangi bir ihtilaf bilmiyoruz"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 56
      },
      "narrator": {
        "en": "Isma'il bin Ibrahim from Ibn 'Awn, from Nafi' that Ibn 'Umar said"
      }
    },
    {
      "hadithNumber": 1376,
      "arabicNumber": 1376,
      "book": 15,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَمَلُهُ إِلاَّ مِنْ ثَلاَثٍ صَدَقَةٌ جَارِيَةٌ وَعِلْمٌ يُنْتَفَعُ بِهِ وَوَلَدٌ صَالِحٌ يَدْعُو لَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Abu Hurairah, may Allah be pleased with him, narrated that the Messenger of Allah (ﷺ) said:\"When a person dies, his deeds are cut off except for three: Continuing charity, knowledge that others benefited from, and a righteous son who supplicates for him",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب انسان مر جاتا ہے تو اس کے عمل کا سلسلہ بند ہو جاتا ہے سوائے تین چیزوں کے: ایک صدقہ جاریہ ۱؎ ہے، دوسرا ایسا علم ہے ۲؎ جس سے لوگ فائدہ اٹھائیں اور تیسرا نیک و صالح اولاد ہے ۳؎ جو اس کے لیے دعا کرے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah mengabarkan kepada kami [Isma'il bin Ja'far] dari [Al 'Ala` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seseorang meninggal dunia maka terputuslah amalnya kecuali tiga hal; Sedekah jariyah, ilmu yang dimanfaatkan, dan anak shalih yang mendoakannya.\" Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "Ebû Hureyre (r.a.)’den rivâyet edilmiştir: Rasûlullah (s.a.v.) buyurdu ki: “İnsan öldüğü zaman amel defteri kapanır ancak şu üç kişinin defteri kapanmaz, sevap yazılmaya devam eder; sadakayı cariye (vakıf), kendisinden istifade edilen ilim ve kendisine dua eden hayırlı salih bir çocuk.” Diğer tahric: Müslim, Vesaya; Ebû Dâvûd, Vesaya Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 57
      }
    },
    {
      "hadithNumber": 1377,
      "arabicNumber": 1377,
      "book": 15,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْعَجْمَاءُ جُرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏ ‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَعَمْرِو بْنِ عَوْفٍ الْمُزَنِيِّ وَعُبَادَةَ بْنِ الصَّامِتِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ حَدَّثَنَا الأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ قَالَ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ وَتَفْسِيرُ حَدِيثِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ الْعَجْمَاءُ جُرْحُهَا جُبَارٌ ‏\"‏ ‏.‏ يَقُولُ هَدَرٌ لاَ دِيَةَ فِيهِ ‏.‏ قَالَ أَبُو عِيسَى وَمَعْنَى قَوْلِهِ ‏\"‏ الْعَجْمَاءُ جُرْحُهَا جُبَارٌ ‏\"‏ ‏.‏ فَسَّرَ ذَلِكَ بَعْضُ أَهْلِ الْعِلْمِ قَالُوا الْعَجْمَاءُ الدَّابَّةُ الْمُنْفَلِتَةُ مِنْ صَاحِبِهَا فَمَا أَصَابَتْ فِي انْفِلاَتِهَا فَلاَ غُرْمَ عَلَى صَاحِبِهَا ‏.‏ ‏\"‏ وَالْمَعْدِنُ جُبَارٌ ‏\"‏ ‏.‏ يَقُولُ إِذَا احْتَفَرَ الرَّجُلُ مَعْدِنًا فَوَقَعَ فِيهَا إِنْسَانٌ فَلاَ غُرْمَ عَلَيْهِ وَكَذَلِكَ الْبِئْرُ إِذَا احْتَفَرَهَا الرَّجُلُ لِلسَّبِيلِ فَوَقَعَ فِيهَا إِنْسَانٌ فَلاَ غُرْمَ عَلَى صَاحِبِهَا ‏.‏ ‏\"‏ وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏ ‏.‏ وَالرِّكَازُ مَا وُجِدَ فِي دَفْنِ أَهْلِ الْجَاهِلِيَّةِ ‏.‏ فَمَنْ وَجَدَ رِكَازًا أَدَّى مِنْهُ الْخُمُسَ إِلَى السُّلْطَانِ وَمَا بَقِيَ فَهُوَ لَهُ ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurairah:that the Messenger of Allah (ﷺ) said: \"The injuries caused by the animal are without liability, and wells are without liability, and mines are without liability, and the Khumus is due on Rikaz.\" (Another Chain) from Abu Hurairah, from the Prophet (ﷺ) with similar meaning",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بےزبان ( جانور ) کا زخم رائیگاں ہے، کنویں اور کان میں گر کر کوئی مر جائے تو وہ بھی رائیگاں ہے ۱؎، اور جاہلیت کے دفینے میں پانچواں حصہ ہے“۔ مؤلف نے اپنی سند سے بطریق «عن ابن شهاب عن سعيد بن المسيب وأبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم» اسی طرح کی حدیث روایت کی ہے۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں جابر عمرو بن عوف مزنی اور عبادہ بن صامت رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- مالک بن انس کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی حدیث «العجماء جرحها جبار» کی تفسیر یہ ہے کہ چوپایوں سے لگے ہوئے زخم رائیگاں ہیں اس میں کوئی دیت نہیں ہے، ۴- «العجماء جرحها جبار» کی بعض علماء نے یہی تفسیر کی ہے، یہ لوگ کہتے ہیں کہ بےزبان جانور وہ ہیں جو اپنے مالک کے پاس سے بدک کر بھاگ جائیں، اگر ان کے بدک کر بھاگنے کی حالت میں کسی کو ان سے زخم لگے یا چوٹ آ جائے تو جانور والے پر کوئی تاوان نہیں ہو گا، ۵- «والمعدن جبار» کی تفسیر میں مالک کہتے ہیں: جب کوئی شخص کان کھدوائے اور اس میں کوئی گر جائے تو کان کھودوانے والے پر کوئی تاوان نہیں ہے، اسی طرح کنواں ہے جب کوئی مسافروں وغیرہ کے لیے کنواں کھدوائے اور اس میں کوئی شخص گر جائے تو کھدوائے والے پر کوئی تاوان نہیں ہے، ۶- «وفي الركاز الخمس» کی تفسیر میں مالک کہتے ہیں: «رکاز» اہل جاہلیت کا دفینہ ہے اگر کسی کو جاہلیت کا دفینہ ملے تو وہ پانچواں حصہ سلطان کے پاس ( سرکاری خزانہ میں ) جمع کرے گا اور جو باقی بچے گا وہ اس کا ہو گا۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyib] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Kerusakan yang diakibatkan oleh) hewan ternak tidak dijamin (tidak ditanggung), (kecelakanan akibat kerja di lokasi) penggalian sumur tidak dijamin (tidak ditanggung), dan pada harta rikaz (harta temuan) dikeluarkan zakatnya seperlimanya.' Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Laits], dari [Ibnu Syihab], dari [Said bin al-Musayyib] dan [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam hadits yang semisal, ia berkata di dalam bab ini dari Jabir dan Amr bin Auf Al Muzani dan Ubadah bin Ash Shamit. Abu Isa berkata, hadits Abu Hirairah ini hasan shahih. Telah bercerita kepada kami Al Anshari dari Ma'n ia berkata, Telah mengabarkan kepada kami Malik bin Anas dan Tafsir atas hadits Nabi Shallalahu 'Alaihi wa sallam '(kerusakan yang diakibatkan oleh) hewan ternak tidak dijamin (tidak ditanggung) ', ia mengatakan, yakni hilang dengan sia-sia dan tidak ada denda atasnya. Abu Isa berkata, makna sabda Nabi \"(kerusakan yang diakibatkan oleh) hewan ternak tidak dijamin (tidak ditanggung) \" ditafsirkan oleh sebagian ulama, menurut mereka yang dimaksud dengan al-ajma` (hewan ternak) adalah hewan yang hilang (lepas) dari pemiliknya, maka apa yang menimpa (timbulnya kerusakan sebab lepasnya hewan tersebut) tidak ada denda bagi pemiliknya. Sabdanya, '(kecelakanan akibat kerja di lokasi) penggalian sumur tidak dijamin (tidak ditanggung) ' ia berkata, jika seseorang menggali pertambangan lalu ada seseorang yang terjatuh ke dalamnya, maka tidak ada denda atasnya, begitu juga dengan sumur, jika seseorang menggali sumur yang disediakan untuk para musafir yang lewat kemudian ada orang yang terjatuh ke dalamnya, maka tidak ada denda baginya (penggali sumur). Dan sabdanya 'dan pada harta rikaz (harta temuan) dikeluarkan zakatnya seperlimanya', rikaz adalah harta yang ditemukan dari peninggalan orang-orang jahiliyah yang tertimbun di dalam tanah, maka bagi yang menemukan rikaz ia wajib mengeluarkan zakatnya senilai seperlima dari harta rikaz tersebut dan memberikannya kepada penguasa, sedangkan selebihnya menjadi miliknya"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 58
      },
      "narrator": {
        "en": "Abu Hurairah"
      }
    },
    {
      "hadithNumber": 1378,
      "arabicNumber": 1378,
      "book": 15,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، أَخْبَرَنَا أَيُّوبُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحْيَى أَرْضًا مَيِّتَةً فَهِيَ لَهُ وَلَيْسَ لِعِرْقِ ظَالِمٍ حَقٌّ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلاً ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ قَالُوا لَهُ أَنْ يُحْيِيَ الأَرْضَ الْمَوَاتَ بِغَيْرِ إِذْنِ السُّلْطَانِ ‏.‏ وَقَدْ قَالَ بَعْضُهُمْ لَيْسَ لَهُ أَنْ يُحْيِيَهَا إِلاَّ بِإِذْنِ السُّلْطَانِ ‏.‏ وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ جَابِرٍ وَعَمْرِو بْنِ عَوْفٍ الْمُزَنِيِّ جَدِّ كَثِيرٍ وَسَمُرَةَ ‏.‏ حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ سَأَلْتُ أَبَا الْوَلِيدِ الطَّيَالِسِيَّ عَنْ قَوْلِهِ ‏\"‏ وَلَيْسَ لِعِرْقِ ظَالِمٍ حَقٌّ ‏\"‏ ‏.‏ فَقَالَ الْعِرْقُ الظَّالِمُ الْغَاصِبُ الَّذِي يَأْخُذُ مَا لَيْسَ لَهُ ‏.‏ قُلْتُ هُوَ الرَّجُلُ الَّذِي يَغْرِسُ فِي أَرْضِ غَيْرِهِ قَالَ هُوَ ذَاكَ ‏.‏",
        "translations": {
          "en": "Narrated Sa'eed bin Zaid:that the Prophet (ﷺ) said: \"Whoever revives a barren land then it is for him, and there is no right for the unjust root",
          "ur": "سعید بن زید رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کوئی بنجر زمین ( جو کسی کی ملکیت میں نہ ہو ) آباد کی تو وہ اسی کی ہے کسی ظالم شخص کی رگ کا حق نہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- بعض لوگوں نے اسے ہشام بن عروہ سے انہوں نے اپنے والد عروہ سے اور عروہ نے نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً روایت کی ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی حدیث پر عمل ہے اور احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، یہ لوگ کہتے ہیں کہ حاکم کی اجازت کے بغیر غیر آباد زمین کو آباد کرنا جائز ہے، ۴- بعض علماء کہتے ہیں: حاکم کی اجازت کے بغیر غیر آباد زمین کو آباد کرنا جائز نہیں ہے، لیکن پہلا قول زیادہ صحیح ہے، ۵- اس باب میں جابر، کثیر کے دادا عمرو بن عوف مزنی اور سمرہ سے بھی احادیث آئی ہیں، ۶- ہم سے ابوموسیٰ محمد بن مثنی نے بیان کیا، وہ کہتے ہیں کہ میں نے ابوولید طیالسی سے نبی اکرم صلی اللہ علیہ وسلم کے قول «وليس لعرق ظالم حق» کا مطلب پوچھا، انہوں نے کہا: «العرق الظالم» سے مراد وہ غاصب ہے جو دوسروں کی چیز زبردستی لے۔ میں نے کہا: اس سے مراد وہ شخص ہے جو دوسرے کی زمین میں درخت لگائے؟ انہوں نے کہا: وہی شخص مراد ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah mengabarkan kepada kami [Abdul Wahhab Ats Tsaqafi] telah mengabarkan kepada kami [Ayyub] dari [Hisyam bin Urwah] dari [ayahnya] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menghidupkan tanah mati (membuka lahan baru) maka tanah itu menjadi miliknya, dan tidak ada hak bagi orang yang memiliki tanah secara zhalim.\" Abu Isa berkata; Hadits ini hasan gharib dan sebagian mereka telah meriwayatkan dari Hisyam bin Urwah dari ayahnya dari Nabi shallallahu 'alaihi wasallam secara mursal. Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini adalah pendapat Ahmad dan Ishaq. Mereka berpendapat; Ia boleh menghidupkan tanah mati tanpa seizin penguasa sedangkan sebagian ulama berpendapat; Ia tidak boleh menghidupkannya kecuali mendapat izin dari penguasa. Pendapat pertama lebih shahih. Ia mengatakan; Dalam hal ini ada hadits serupa dari Jabir, Amr bin 'Auf Al Muzani kakek Katsir dan Samurah. Telah menceritakan kepada kami Abu Musa Muhammad bin Al Mutsanna ia berkata; Aku bertanya kepada Abu Al Walid Ath Thayalisi tentang sabda beliau: \"Tidak ada hak bagi orang yang memiliki tanah secara zhalim.\" Ia pun menjawab; Orang zhalim yang memiliki adalah orang yang merampas, ia mengambil sesuatu yang bukan miliknya. Aku bertanya; Apakah ia orang yang menanam di tanah orang lain? Ia menjawab; Dialah orangnya"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 59
      },
      "narrator": {
        "en": "Sa'eed bin Zaid"
      }
    },
    {
      "hadithNumber": 1379,
      "arabicNumber": 1379,
      "book": 15,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَحْيَا أَرْضًا مَيِّتَةً فَهِيَ لَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin 'Abdullah:that the Prophet (ﷺ) said: \"Whoever revives a barren land, then it is for him",
          "ur": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص غیر آباد زمین ( جو کسی کی ملکیت میں نہ ہو ) آباد کرے تو وہ اسی کی ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari [Hisyam bin Urwah] dari [Wahb bin Kaisan] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menghidupkan tanah mati (membuka lahan baru), maka tanah itu menjadi miliknya.\" Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "Cabir b. Abdullah (r.a.)’den rivâyete göre, Nebi (s.a.v.) şöyle buyurmuştur: “Kim sahipsiz işlenmeyen ölü bir toprağı ekip dikerek canlandırırsa o toprak parçası onundur.” Diğer tahric: Ebû Dâvûd, Harâc Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 60
      },
      "narrator": {
        "en": "Jabir bin 'Abdullah"
      }
    },
    {
      "hadithNumber": 1380,
      "arabicNumber": 1380,
      "book": 15,
      "hadithInBook": 61,
      "text": {
        "arabic": "قَالَ قُلْتُ لِقُتَيْبَةَ بْنِ سَعِيدٍ حَدَّثَكُمْ مُحَمَّدُ بْنُ يَحْيَى بْنِ قَيْسٍ الْمَأْرِبِيُّ، حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ بْنِ شُرَاحِيلَ، عَنْ سُمَىِّ بْنِ قَيْسٍ، عَنْ شُمَيْرٍ، عَنْ أَبْيَضَ بْنِ حَمَّالٍ، أَنَّهُ وَفَدَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَقْطَعَهُ الْمِلْحَ فَقَطَعَ لَهُ فَلَمَّا أَنْ وَلَّى قَالَ رَجُلٌ مِنَ الْمَجْلِسِ أَتَدْرِي مَا قَطَعْتَ لَهُ إِنَّمَا قَطَعْتَ لَهُ الْمَاءَ الْعِدَّ ‏.‏ قَالَ فَانْتَزَعَهُ مِنْهُ ‏.‏ قَالَ وَسَأَلَهُ عَمَّا يُحْمَى مِنَ الأَرَاكِ قَالَ ‏ \"‏ مَا لَمْ تَنَلْهُ خِفَافُ الإِبِلِ ‏\"‏ ‏.‏ فَأَقَرَّ بِهِ قُتَيْبَةُ وَقَالَ نَعَمْ ‏.‏ حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ قَيْسٍ الْمَأْرِبِيُّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏ الْمَأْرِبُ نَاحِيَةٌ مِنَ الْيَمَنِ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ وَائِلٍ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبْيَضَ بْنِ حَمَّالٍ حَدِيثٌ غَرِيبٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ فِي الْقَطَائِعِ يَرَوْنَ جَائِزًا أَنْ يُقْطِعَ الإِمَامُ لِمَنْ رَأَى ذَلِكَ ‏.‏",
        "translations": {
          "en": "Narrated Shumair:that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\" So I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\". (Another chain) with similar meaning",
          "ur": "ابیض بن حمال رضی الله عنہ کہتے ہیں کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ سے جاگیر میں نمک کی کان مانگی تو آپ نے انہیں دے دی، لیکن جب وہ پیٹھ پھیر کر واپس جانے لگے تو مجلس میں موجود ایک آدمی نے عرض کیا: جانتے ہیں کہ آپ نے جاگیر میں اسے کیا دیا ہے؟ آپ نے اسے جاگیر میں ایسا پانی دیا ہے جو کبھی بند نہیں ہوتا ہے۔ ( اس سے برابر نمک نکلتا رہے گا ) تو آپ نے اس سے اسے واپس لے لیا، اس نے آپ سے پوچھا: پیلو کے درختوں کی کون سی جگہ ( بطور رمنہ ) گھیری جائے؟ آپ نے فرمایا: ”جس زمین تک اونٹوں کے پاؤں نہ پہنچے“ ( جو آبادی اور چراگاہ سے کافی دور ہوں ) ۔ امام ترمذی کہتے ہیں: ۱- ابیض کی حدیث غریب ہے، ۲- میں نے قتیبہ سے پوچھا کیا آپ سے محمد بن یحییٰ بن قیس ماربی نے یہ حدیث بیان کی تو انہوں نے اقرار کیا اور کہا: ہاں –",
          "id": "Ia berkata; Aku bertanya kepada [Qutaibah bin Sa'id]; Telah menceritakan kepada kalian [Muhammad bin Yahya bin Qais Al Ma`ribi] telah menceritakan kepadaku [ayahnya] dari [Tsumamah bin Syarahil] dari [Sumay bin Qais] dari [Sumair] dari [Abyadl bin Hammal] bahwa ia datang kepada Rasulullah shallallahu 'alaihi wasallam meminta untuk menetapkan kepemilikan sebidang tambang garam untuknya lalu beliau menetapkan untuknya. Ketika hendak beranjak pergi seseorang yang berada di majelis berkata; Tahukah engkau apa yang engkau tetapkan untuknya? Sesungguhnya engkau menetapkan tanah yang memiliki air yang diam. Abyadl berkata; Beliau pun membatalkannya. Ia melanjutkan; Ia bertanya; Tanah seperti apa yang boleh untuk dihidupkan? Beliau menjawab: \"Yang tidak diinjak oleh kaki unta.\" Apakah Qutaibah menetapkannya? Ia menjawab; Ya. Telah menceritakan kepada kami [Muhammad bin Yahya bin Abu Umar] telah menceritakan kepada kami [Muhammad bin Yahya bin Qais Al Ma`ribi] dengan sanad ini seperti itu. Al Ma`rib berada di sebelah Yaman. Ia mengatakan; Dalam hal ini ada hadits serupa dari Wa`il dan Asma` bintu Abu Bakr. Abu Isa berkata; Hadits Abyadl adalah hadits gharib dan menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka tentang penetapan tanah. Mereka membolehkan seorang imam menetapkan bagian tanah seseorang",
          "tr": "Ebyâz b. Hammâl (radıyallahü anh)’den rivâyete göre, kendisi Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek tuz madeninin bulunduğu tuzlanın kendisine verilmesini istedi de Rasûlüllah (sallallahü aleyhi ve sellem)’de ona onu bağışladı. Ebyâz dönüp gidince orada bulunanlardan biri; “Ona neyi bağışladığını biliyor musun? Kesintisiz devamlı akan bir su bağışladın” dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem), Tuzlayı ondan geri aldı. Bu sefer Ebyâz, erak ağaçlarının bulunduğu yerlerden toprak bağışında bulunmasını istedi de Rasûlüllah (sallallahü aleyhi ve sellem): “Yaşlı develerin erişemedikleri uzak ve ölü araziler olursa olabilir” buyurdular"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 61
      },
      "narrator": {
        "en": "Shumair"
      }
    },
    {
      "hadithNumber": 1381,
      "arabicNumber": 1381,
      "book": 15,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنْ سِمَاكٍ، قَالَ سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَقْطَعَهُ أَرْضًا بِحَضْرَمَوْتَ ‏.‏ قَالَ مَحْمُودُ وَأَخْبَرَنَا النَّضْرُ، عَنْ شُعْبَةَ، وَزَادَ، فِيهِ وَبَعَثَ مَعَهُ مُعَاوِيَةَ لِيُقْطِعَهَا إِيَّاهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated 'Alqamah bin Wa'il:from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him",
          "ur": "وائل بن حجر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں حضر موت میں ایک زمین بطور جاگیر دی۔ آپ صلی اللہ علیہ وسلم نے معاویہ رضی الله عنہ کو بھیجا تاکہ وہ زمین انہیں بطور جاگیر دے دیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔",
          "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Abu Dawud], telah mengabarkan kepada kami [Syu'bah] dari [Simak] ia berkata; Aku mendengar ['Alqamah bin Wa`il] menceritakan dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam menetapkan kepemilikan sebidang tanah di Hadlramaut. [Mahmud] berkata; Telah mengabarkan kepada kami [An Nadlr] dari [Syu'bah] dan ia menambah di dalamnya; Dan beliau mengutus Mu'awiyah untuk menetapkan kepemilikannya. Abu Isa berkata; Hadits ini hasan",
          "tr": "Alkame b. Vâil’in babasından rivâyete göre, Nebi (s.a.v.) Hadremevt’te bir toprak parçasını kendisine vermişti. Mahmûd dedi ki: Nadr bu hadisi bize Şu’be’den aktararak şu ilaveyi yaptı: “O toprağı kendisine vermesi için Muaviye’yi de onunla birlikte gönderdi.” Diğer tahric: Ebû Dâvûd, Haraç Tirmizî: Bu hadis hasendir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 62
      },
      "narrator": {
        "en": "'Alqamah bin Wa'il"
      }
    },
    {
      "hadithNumber": 1382,
      "arabicNumber": 1382,
      "book": 15,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ إِنْسَانٌ أَوْ طَيْرٌ أَوْ بَهِيمَةٌ إِلاَّ كَانَتْ لَهُ صَدَقَةٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي أَيُّوبَ وَجَابِرٍ وَأُمِّ مُبَشِّرٍ وَزَيْدِ بْنِ خَالِدٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated Anas:that the Prophet (ﷺ) said: \"No Muslim plants a plant or sows a crop, then a person, or a bird, or an animal eats from it, except that it will be charity for him",
          "ur": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو بھی مسلمان کوئی درخت لگاتا ہے یا فصل بوتا ہے اور اس میں سے انسان یا پرند یا چرند کھاتا ہے تو وہ اس کے لیے صدقہ ہوتا ہے“۔ امام ترمذی کہتے ہیں: ۱- انس رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوایوب، جابر، ام مبشر اور زید بن خالد رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah seorang muslim yang menanam tanaman atau menabur benih lalu (hasilnya) dimakan oleh manusia, burung atau binatang ternak melainkan hal tersebut menjadi sedekah baginya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Ayyub, Jabir, Ummu Mubasysyir dan Zaid bin Khalid. Abu Isa berkata; Hadits Anas adalah hadits hasan shahih",
          "tr": "Enes (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurdu: “Bir Müslüman bir ağaç diker veya bir ekin eker de ondan bir insan bir kuş ve hayvan yerse bu yenenler kendisi için sadaka olur.” Diğer tahric: Buhârî, Müzarea; Müslim, Müsakat Tirmizî: Bu konuda Ebû Eyyûb, Câbir, Ümmü Mübeşşir ve Zeyd b. Hâlid’den de hadis rivâyet edilmiştir. Tirmizî: Enes hadisi hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 63
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 1383,
      "arabicNumber": 1383,
      "book": 15,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرٍ أَوْ زَرْعٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَنَسٍ وَابْنِ عَبَّاسٍ وَزَيْدِ بْنِ ثَابِتٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَغَيْرِهِمْ لَمْ يَرَوْا بِالْمُزَارَعَةِ بَأْسًا عَلَى النِّصْفِ وَالثُّلُثِ وَالرُّبُعِ ‏.‏ وَاخْتَارَ بَعْضُهُمْ أَنْ يَكُونَ الْبَذْرُ مِنْ رَبِّ الأَرْضِ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَكَرِهَ بَعْضُ أَهْلِ الْعِلْمِ الْمُزَارَعَةَ بِالثُّلُثِ وَالرُّبُعِ وَلَمْ يَرَوْا بِمُسَاقَاةِ النَّخِيلِ بِالثُّلُثِ وَالرُّبُعِ بَأْسًا ‏.‏ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ ‏.‏ وَلَمْ يَرَ بَعْضُهُمْ أَنْ يَصِحَّ شَيْءٌ مِنَ الْمُزَارَعَةِ إِلاَّ أَنْ يَسْتَأْجِرَ الأَرْضَ بِالذَّهَبِ وَالْفِضَّةِ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Umar:\"The Prophet (ﷺ) made a deal with the people of Khaibar for half of what was produced from it, whether fruits or crops",
          "ur": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے خیبر والوں کے ساتھ خیبر کی زمین سے جو بھی پھل یا غلہ حاصل ہو گا اس کے آدھے پر معاملہ کیا ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں انس، ابن عباس، زید بن ثابت اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی پر عمل ہے۔ یہ لوگ آدھے، تہائی یا چوتھائی کی شرط پر مزارعت کرنے میں کوئی حرج نہیں سمجھتے، ۴- اور بعض اہل علم نے یہ اختیار کیا ہے کہ بیج زمین والا دے گا، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۵- بعض اہل علم نے تہائی یا چوتھائی کی شرط پر مزارعت کو مکروہ سمجھا ہے، لیکن وہ تہائی یا چوتھائی کی شرط پر کھجور کے درختوں کی سینچائی کرانے میں کوئی حرج نہیں سمجھتے ہیں۔ مالک بن انس اور شافعی کا یہی قول ہے، ۶- بعض لوگ مطلقًا مزارعت کو درست نہیں سمجھتے البتہ سونے یا چاندی ( نقدی ) کے عوض کرایہ پر زمین لینے کو درست سمجھتے ہیں۔",
          "id": "Telah menceritakan kepada kami [Ishaq bin Manshur], telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam memberi upah kepada penduduk Khaibar setengah bagian dari hasil panen kurma atau tanaman lain. Ia mengatakan; Dalam hal ini ada hadits serupa dari Anas, Ibnu Abbas, Zaid bin Tsabit dan Jabir. Abu Isa berkata; Hadits ini hasan shahih dan hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka. Mereka membolehkan dalam masalah muzara'ah sebanyak setengah, sepertiga atau seperempat, namun sebagian mereka memilih pendapat yang menetapkan bahwa benih pada pemilik tanah, ini menjadi pendapat Ahmad dan Ishaq. Sedangkan sebagian ulama memakruhkan muzara'ah sebanyak sepertiga atau seperempat, namun mereka membolehkan musaqah pohon kurma sebanyak sepertiga atau seperempat, ini menjadi pendapat Abdul Malik bin Anas dan Asy Syafi'i, sebagian mereka berpendapat tidak sah sedikitpun dari hasil muzara'ah kecuali bumi menghasilkan emas atau perak",
          "tr": "İbn Ömer (radıyallahü anh)’den rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem): “Hayber halkı ile Hayber topraklarında yetişen ürünlerin yarısı kendilerine ait olmak üzere ekincilik anlaşması yaptı.” (Buhârî, Müzarea: 5; Müslim, Müsakat: 1) Bu konuda Enes, İbn Abbâs, Zeyd b. Sabit ve Câbir’den de hadis rivâyet edilmiştir. Bu hadis hasen sahihtir. Rasûlüllah (sallallahü aleyhi ve sellem)’in ashabından ve başkalarından bazı ilim adamlarının uygulaması bu hadise göre olup yarı yarıya üçte bir, dörtte bir nispetinde ziraat ortaklığı yapmakta bir sakınca görmezler. Bazı ilim adamları tohumun toprak sahibinden olmasını tercih etmişlerdir. Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise üçte bir, dörtte bir şeklindeki ziraat ortaklığını hoş karşılamayıp hurmada üçte bir, dörtte bir müsakatta bir sakınca görmüyorlar. Meyvesinin bir kısmını almak şartıyla bir bağın ve hurmalığın asma ve hurmalarının bakımını başkasına vermektir. Mâlik b. Enes ve Şâfii bu görüştedir. Bazı ilim adamları ise ziraat ortaklığının hiçbir şeklinin caiz olmadığını toprağın altın ve gümüş karşılığında kiraya verilebileceğini söylerler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 64
      },
      "narrator": {
        "en": "Ibn 'Umar"
      }
    },
    {
      "hadithNumber": 1384,
      "arabicNumber": 1384,
      "book": 15,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ أَبِي حَصِينٍ، عَنْ مُجَاهِدٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا إِذَا كَانَتْ لأَحَدِنَا أَرْضٌ أَنْ يُعْطِيَهَا بِبَعْضِ خَرَاجِهَا أَوْ بِدَرَاهِمَ وَقَالَ ‏ \"‏ إِذَا كَانَتْ لأَحَدِكُمْ أَرْضٌ فَلْيَمْنَحْهَا أَخَاهُ أَوْ لِيَزْرَعْهَا ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated Rafi' bin Khadij:\"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it",
          "ur": "رافع بن خدیج رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ایک ایسے کام سے منع فرما دیا جو ہمارے لیے مفید تھا، وہ یہ کہ جب ہم میں سے کسی کے پاس زمین ہوتی تو وہ اس کو ( زراعت کے لیے ) کچھ پیداوار یا روپیوں کے عوض دے دیتا۔ آپ نے فرمایا: ”جب تم میں سے کسی کے پاس زمین ہو تو وہ اپنے بھائی کو ( مفت ) دیدے۔ یا خود زراعت کرے ۱؎“۔",
          "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari [Abu Hushain] dari [Mujahid] dari [Rafi' bin Khadij] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang suatu perkara yang bermanfaat bagi kami yaitu jika salah seorang dari kami memiliki sebidang tanah untuk memberikan sebagian hasil atau dengan beberapa dirham. Beliau bersabda: \"Jika salah seorang dari kalian memiliki sebidang tanah, hendaklah memberikan hasilnya kepada saudaranya, atau agar ia menanaminya",
          "tr": "Rafi’ b. Hadîc (r.a.)’den rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.), bizi faydalı olan bir işten yasakladı. Birimizin bir toprağı olduğunda ürünün bir kısmı karşılığında veya para karşılığında toprağı birisine kiraya verirdik; Rasûlullah (s.a.v.), öyle yapmayınız toprağı olan ya kendi eksin veya ekip dikecek bir Müslüman kardeşine bağışlasın.” Diğer tahric: Buhârî, Müzarea; Müslim, Müsakat"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Shadh"
        },
        {
          "name": "Al-Albani",
          "grade": "Shadh"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 65
      },
      "narrator": {
        "en": "Rafi' bin Khadij"
      }
    },
    {
      "hadithNumber": 1385,
      "arabicNumber": 1385,
      "book": 15,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى الشَّيْبَانِيُّ، أَخْبَرَنَا شَرِيكٌ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يُحَرِّمِ الْمُزَارَعَةَ وَلَكِنْ أَمَرَ أَنْ يَرْفُقَ بَعْضُهُمْ بِبَعْضٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَحَدِيثُ رَافِعٍ فِيهِ اضْطِرَابٌ يُرْوَى هَذَا الْحَدِيثُ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ عُمُومَتِهِ وَيُرْوَى عَنْهُ عَنْ ظُهَيْرِ بْنِ رَافِعٍ وَهُوَ أَحَدُ عُمُومَتِهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْهُ عَلَى رِوَايَاتٍ مُخْتَلِفَةٍ ‏.‏ وَفِي الْبَابِ عَنْ زَيْدِ بْنِ ثَابِتٍ وَجَابِرٍ رضى الله عنهما ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:\"The Messenger of Allah (ﷺ) did not prohibit share-cropping. But he ordered that they be helpful with each other",
          "ur": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مزارعت کو حرام نہیں کیا، لیکن آپ نے ایک دوسرے کے ساتھ نرمی کرنے کا حکم دیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- رافع کی حدیث میں ( جو اوپر مذکور ہوئی ) اضطراب ہے۔ کبھی یہ حدیث بواسطہ رافع بن خدیج ان کے چچاؤں سے روایت کی جاتی ہے اور کبھی بواسطہ رافع بن خدیج ظہیر بن رافع سے روایت کی جاتی ہے، یہ بھی ان کے ایک چچا ہیں، ۳- اور ان سے یہ حدیث مختلف طریقے پر روایت کی گئی ہے، ۴- اس باب میں زید بن ثابت اور جابر رضی الله عنہما سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah mengabarkan kepada kami [Al Fadlal bin Musa As Sinani], telah mengabarkan kepada kami [Syarik] dari [Syu'bah] dari [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam tidak mengharamkan muzara'ah namun beliau memerintahkan untuk menjadi teman sebagian mereka dengan sebagian yang lain. Abu Isa berkata; Hadits ini hasan shahih sedangkan hadits Rafi' terdapat kegoncangan di dalamnya. Hadits ini diriwayatkan dari Rafi' bin Khadij dari paman-pamannya dan diriwayatkan darinya juga dari Zhuhair bin Rafi', ia adalah salah seorang pamannya, hadits ini juga diriwayatkan darinya melalui jalur periwayatan yang berbeda. Dalam hal ini ada hadits serupa dari Zaid bin Tsabit dan Jabir radliallahu 'anhuma",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.): “Ziraat ortaklığını haram kılmadı fakat ortakların birbirlerine karşı toleranslı davranmalarını emretti.” Diğer tahric: Buhârî, Müzarea; Müslim, Müsakat Tirmizî: Bu hadis hasen sahihtir. Rafi’in hadisinde karışıklık vardır. Bu hadis, Rafi’ b. Hadîç’in amcalarından rivâyet edildi ve yine onun vasıtasıyla amcalarından biri olan Zuheyr b. Rafi’den de rivâyet edilmiştir. Böylece bu hadis Rafi’den değişik şekillerde rivâyet edilmiştir. Tirmizî: Bu konuda Zeyd b. Sabit ve Câbir’den de hadis rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 15,
        "hadith": 66
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "70KB"
  }
}