{
  "collection": "tirmidhi",
  "book": 16,
  "name": {
    "arabic": "كتاب The Book on Blood Money",
    "transliteration": "the book on blood money",
    "translation": "The Book on Blood Money"
  },
  "totalHadith": 37,
  "hadithNumberRange": {
    "first": 1386,
    "last": 1422
  },
  "content": [
    {
      "hadithNumber": 1386,
      "arabicNumber": 1386,
      "book": 16,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ الْكُوفِيُّ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ الْحَجَّاجِ، عَنْ زَيْدِ بْنِ جُبَيْرٍ، عَنْ خِشْفِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي دِيَةِ الْخَطَإِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ بَنِي مَخَاضٍ ذُكُورًا وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةً ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، وَأَبُو خَالِدٍ الأَحْمَرُ عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ، نَحْوَهُ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مَسْعُودٍ لاَ نَعْرِفُهُ مَرْفُوعًا إِلاَّ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ عَبْدِ اللَّهِ مَوْقُوفًا ‏.‏ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ عَلَى أَنَّ الدِّيَةَ تُؤْخَذُ فِي ثَلاَثِ سِنِينَ فِي كُلِّ سَنَةٍ ثُلُثُ الدِّيَةِ وَرَأَوْا أَنَّ دِيَةَ الْخَطَإِ عَلَى الْعَاقِلَةِ ‏.‏ وَرَأَى بَعْضُهُمْ أَنَّ الْعَاقِلَةَ قَرَابَةُ الرَّجُلِ مِنْ قِبَلِ أَبِيهِ ‏.‏ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ ‏.‏ وَقَالَ بَعْضُهُمْ إِنَّمَا الدِّيَةُ عَلَى الرِّجَالِ دُونَ النِّسَاءِ وَالصِّبْيَانِ مِنَ الْعَصَبَةِ يُحَمَّلُ كُلُّ رَجُلٍ مِنْهُمْ رُبُعَ دِينَارٍ ‏.‏ وَقَدْ قَالَ بَعْضُهُمْ إِلَى نِصْفِ دِينَارٍ فَإِنْ تَمَّتِ الدِّيَةُ وَإِلاَّ نُظِرَ إِلَى أَقْرَبِ الْقَبَائِلِ مِنْهُمْ فَأُلْزِمُوا ذَلِكَ ‏.‏",
        "translations": {
          "en": "Narrated Ibn Mas'ud:\"The Messenger of Allah (ﷺ) judged for the accidental blood-Money: Twenty Bint Makhad, twenty make Ibn Makhad, twenty Bint Labunm twenty Jadha'ah, and twenty Hiqqah. (Another chain) with similar meaning",
          "ur": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم فرمایا: ”قتل خطا ۱؎ کی دیت ۲؎ بیس بنت مخاض ۳؎، بیس ابن مخاض، بیس بنت لبون ۴؎، بیس جذعہ ۵؎ اور بیس حقہ ۶؎ ہے“۔ ہم کو ابوہشام رفاعی نے ابن ابی زائدہ اور ابوخالد احمر سے اور انہوں نے حجاج بن ارطاۃ سے اسی طرح کی حدیث بیان کی۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود رضی الله عنہ کی حدیث کو ہم صرف اسی سند سے مرفوع جانتے ہیں اور عبداللہ بن مسعود سے یہ حدیث موقوف طریقہ سے بھی آئی ہے، ۲- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم کا یہی مسلک ہے، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۴- اہل علم کا اس بات پر اتفاق ہے کہ دیت تین سال میں لی جائے گی، ہر سال دیت کا تہائی حصہ لیا جائے گا، ۵- اور ان کا خیال ہے کہ دیت خطا عصبہ پر ہے، ۶- بعض لوگوں کے نزدیک عصبہ وہ ہیں جو باپ کی جانب سے آدمی کے قرابت دار ہوں، مالک اور شافعی کا یہی قول ہے، ۷- بعض لوگوں کا کہنا ہے کہ عصبہ میں سے جو مرد ہیں انہی پر دیت ہے، عورتوں اور بچوں پر نہیں، ان میں سے ہر آدمی کو چوتھائی دینار کا مکلف بنایا جائے گا، ۸- کچھ لوگ کہتے ہیں: آدھے دینار کا مکلف بنایا جائے گا، ۹- اگر دیت مکمل ہو جائے گی تو ٹھیک ہے ورنہ سب سے قریبی قبیلہ کو دیکھا جائے گا اور ان کو اس کا مکلف بنایا جائے گا۔",
          "id": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi Al Kufi], telah mengabarkan kepada kami [Ibnu Abu Za`idah] dari [Al Hajjaj] dari [Zaid bin Jubair] dari [Khasyf bin Malik] ia berkata; Aku mendengar [Ibnu Mas'ud] berkata; Rasulullah shallallahu 'alaihi wasallam menetapkan hukum diyat bagi orang yang salah sebesar dua puluh unta betina berumur dua tahun, dua puluh unta jantan berumur dua tahun, dua puluh unta betina berumur tiga tahun, dua puluh unta betina berumur lima tahun dan dua puluh unta betina berumur empat tahun. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Amr. Telah mengabarkan kepada kami [Abu Hisyam Ar Rifa'i], telah mengabarkan kepada kami [Ibnu Abu Za`idah] dan [Abu Khalid Al Ahmar] dari [Al Hajjaj bin Arthah] seperti itu. Abu Isa berkata; Hadits Ibnu Mas'ud tidak kami ketahui secara marfu' kecuali dari jalur ini dan telah diriwayatkan dari Abdullah secara mauquf. Sebagian ulama berpendapat seperti itu, ini menjadi pendapat Ahmad dan Ishaq, namun sebagian ulama bersepakat bahwa diyat diambil selama tiga tahun, setiap tahun dibayar sepertiga diyat. Mereka berpendapat bahwa diyat bagi orang yang salah dikenakan terhadap anak yang mencapai masa dewasa, sebagian mereka berpendapat bahwa anak yang mencapai masa dewasa menyamai seorang laki-laki dari jalur ayahnya. Ini menjadi pendapat Malik dan Asy Syafi'i. Sebagian mereka berpendapat; Sesungguhnya diyat hanya dikenakan terhadap orang laki-laki, tidak kepada perempuan dan anak-anak dari keturunan. Setiap orang laki-laki dari mereka dikenakan seperempat dinar. Sebagian mereka berpendapat; Setengah dinar, jika telah sempurna diyatnya kecuali dilihat dari kabilah yang paling dekat dari mereka, maka mereka berhak membayarnya"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 1
      },
      "narrator": {
        "en": "Ibn Mas'ud"
      }
    },
    {
      "hadithNumber": 1387,
      "arabicNumber": 1387,
      "book": 16,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، أَخْبَرَنَا حَبَّانُ، وَهُوَ ابْنُ هِلاَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ، أَخْبَرَنَا سُلَيْمَانُ بْنُ مُوسَى، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا دُفِعَ إِلَى أَوْلِيَاءِ الْمَقْتُولِ فَإِنْ شَاءُوا قَتَلُوا وَإِنْ شَاءُوا أَخَذُوا الدِّيَةَ وَهِيَ ثَلاَثُونَ حِقَّةً وَثَلاَثُونَ جَذَعَةً وَأَرْبَعُونَ خَلِفَةً وَمَا صَالَحُوا عَلَيْهِ فَهُوَ لَهُمْ ‏\"‏ ‏.‏ وَذَلِكَ لِتَشْدِيدِ الْعَقْلِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
        "translations": {
          "en": "Narrated Amr bin Shu'aib:from his father, from his grandfather that the Prophet (ﷺ) said: \"Whoever kills [a believer] deliberately, he is handed over to the guardians of the one killed. If they wish to, they have him killed, and if they wish to, they take the blood-money. That is thirty Hiqqah, thirty Jadha'ahs and forty pregnant camels. Whatever (amount more) they require from him, than that is for them (if they choose).\" THat is because of the severity of blood-money",
          "ur": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی مومن کو جان بوجھ کر قتل کیا اسے مقتول کے وارثوں کے حوالے کیا جائے گا، اگر وہ چاہیں تو اسے قتل کر دیں اور چاہیں تو اس سے دیت لیں، دیت کی مقدار تیس حقہ، تیس جذعہ اور چالیس خلفہ ۱؎ ہے اور جس چیز پر وارث مصالحت کر لیں وہ ان کے لیے ہے اور یہ دیت کے سلسلہ میں سختی کی وجہ سے ہے۔ امام ترمذی کہتے ہیں: عبداللہ بن عمرو کی حدیث حسن غریب ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi], telah mengabarkan kepada kami [Habban], ia adalah Ibnu Hilal telah menceritakan kepada kami [Muhammad bin Rasyid] telah mengabarkan kepada kami [Sulaiman bin Musa] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membunuh seorang mukmin secara sengaja, maka ia diserahkan kepada wali dari orang yang dibunuh, jika mereka mau boleh membunuhnya, dan jika mereka mau boleh mengambil diyatnya sebesar tiga puluh unta betina berumur empat tahun, tiga puluh unta betina berumur lima tahun atau empat puluh unta betina yang bunting, adapun jika mereka berdamai dengannya maka itu hak mereka, hal itu merupakan bentuk diat (hukuman yang berat).\" Abu Isa berkata; Hadits Abdullah bin Amr adalah hadits hasan gharib",
          "tr": "Amr b. Şuayb (r.a.)’ın babasından ve dedesinden rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Bir kimse bir mü’mini bile bile öldürürse; öldürülen kimsenin velilerine bırakılır dilerlerse öldürülmesini isterler dilerlerse diyet alırlar. Diyet ise dört yaşına girmiş otuz dişi deve, beş yaşına girmiş otuz dişi deve, ve kırk hamile deveden oluşur. Anlaştıkları bir miktar varsa o miktar onlara aittir bu hüküm diyeti ağırlaştırmak için böyle verilmiştir.” Diğer tahric: Ebû Dâvûd, Diyât; İbn Mâce, Diyât Tirmizî: Abdullah b. Amr hadisi hasen garibtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 2
      },
      "narrator": {
        "en": "Amr bin Shu'aib"
      }
    },
    {
      "hadithNumber": 1388,
      "arabicNumber": 1388,
      "book": 16,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ جَعَلَ الدِّيَةَ اثْنَىْ عَشَرَ أَلْفًا ‏.‏",
        "translations": {
          "en": "Narrated 'Ikrimah:from Ibn 'Abbas that the Prophet (ﷺ) made the blood-money twelve thousand",
          "ur": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے دیت بارہ ہزار درہم مقرر کی۔",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre: “Rasûlullah (s.a.v.), diyetin para olarak kıymetini oniki bin dirhem olarak kararlaştırdı.” Diğer tahric: Ebû Dâvûd, Diyat; İbn Mâce, Diyat"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 3
      },
      "narrator": {
        "en": "'Ikrimah"
      }
    },
    {
      "hadithNumber": 1389,
      "arabicNumber": 1389,
      "book": 16,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ عَنِ ابْنِ عَبَّاسٍ وَفِي حَدِيثِ ابْنِ عُيَيْنَةَ كَلاَمٌ أَكْثَرُ مِنْ هَذَا ‏.‏ قَالَ أَبُو عِيسَى وَلاَ نَعْلَمُ أَحَدًا يَذْكُرُ فِي هَذَا الْحَدِيثِ عَنِ ابْنِ عَبَّاسٍ غَيْرَ مُحَمَّدِ بْنِ مُسْلِمٍ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَرَأَى بَعْضُ أَهْلِ الْعِلْمِ الدِّيَةَ عَشَرَةَ آلاَفٍ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏ وَقَالَ الشَّافِعِيُّ لاَ أَعْرِفُ الدِّيَةَ إِلاَّ مِنَ الإِبِلِ وَهِيَ مِائَةٌ مِنَ الإِبِلِ أَوْ قِيمَتُهَا ‏.‏",
        "translations": {
          "en": "(Another chain) from 'Ikrimah from the Prophet (ﷺ) and it is similar but he did not mention \"from Ibn 'Abbas\" in it. There is much more criticism than this for (this) narration of Ibn 'Uyainah",
          "ur": "ہم سے سعید بن عبدالرحمٰن المخزومی نے بیان کیا، وہ کہتے ہیں کہ ہم سے سفیان بن عیینہ نے عمرو بن دینار کے واسطے سے بیان کیا، عمرو بن دینار نے عکرمہ سے اور عکرمہ نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کیا ہے، لیکن انہوں نے اس روایت میں ابن عباس کا ذکر نہیں کیا، ابن عیینہ کی روایت میں محمد بن مسلم طائفی کی روایت کی بنسبت کچھ زیادہ باتیں ہیں۔ امام ترمذی کہتے ہیں: ۱- ہمارے علم میں محمد بن مسلم کے علاوہ کسی نے اس حدیث میں ”ابن عباس“ کے واسطہ کا ذکر نہیں کیا ہے، ۲- بعض اہل علم کے نزدیک اسی حدیث پر عمل ہے، احمد اور اسحاق بن راہویہ کا بھی یہی قول ہے، ۳- اور بعض اہل اعلم کے نزدیک دیت دس ہزار ( درہم ) ہے، سفیان ثوری اور اہل کوفہ کا یہی قول ہے، ۴- امام شافعی کہتے ہیں: ہم اصل دیت صرف اونٹ کو سمجھتے ہیں اور وہ سو اونٹ یا اس کی قیمت ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Mu'adz bin Hani`], telah menceritakan kepada kami [Muhammad bin Muslim Ath Tha`ifi] dari [Amr bin Dinar] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau menetapkan diyat sebesar dua belas ribu. Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Ikrimah] dari Nabi shallallahu 'alaihi wasallam seperti itu namun tidak disebutkan di dalamnya dari Ibnu Abbas. Dalam Ibnu Uyainah terdapat komentar lebih banyak dari hadits ini. Abu Isa berkata; Kami tidak mengetahui seorang pun menyebutkan tentang hadits ini dari Ibnu Abbas selain Muhammad bin Muslim. Hadits ini diamalkan oleh sebagian ulama dan juga merupakan pendapat Ahmad dan Ishaq. Sedangkan sebagian ulama berpendapat bahwa diyat sebesar sepuluh ribu dirham, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah. Adapun Asy Syafi'i berkata; Aku tidak mengetahui diyat kecuali dari unta yaitu sebesar seratus ekor unta atau seharga dengannya",
          "tr": "Saîd b. Abdurrahman el Mahzûmî, Sûfyân b. Uyeyne vasıtasıyla Amr b. Dînâr’dan, İkrime’den bu (1388.) hadisin benzerini rivâyet etmiş olup bu rivâyetinde “İbn Abbâs’tan” dememiştir. İbn Uyeyne’nin rivâyeti hakkında pek çok söz söylenmiştir. Tirmizî: Muhammed b. Müslim’den başka bu hadisi İbn Abbâs’tan rivâyet eden kimse bilmiyoruz. Bazı ilim adamlarının uygulaması bu hadise göre olup Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise diyetin on bin dirhem olduğu görüşündedirler. Sûfyân es Sevrî ve Küfeliler bunlardandır. Şâfii diyor ki: Ben diyetin sadece deveden olduğunu biliyorum o da yüz deve veya onun bedelidir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 4
      }
    },
    {
      "hadithNumber": 1390,
      "arabicNumber": 1390,
      "book": 16,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ ‏\"‏ ‏.‏ قال أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ أَنَّ فِي الْمُوضِحَةِ خَمْسًا مِنَ الإِبِلِ ‏.‏",
        "translations": {
          "en": "Narrated 'Amr bin Shu'aib:from his father, from his grandfather that the Prophet (ﷺ) said: \"Regarding the Mawadih; five, five",
          "ur": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” «موضحہ» ( ہڈی کھل جانے والے زخم ) ۱؎ میں پانچ اونٹ ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اور اہل علم کے نزدیک اسی پر عمل ہے، سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ کا قول یہی ہے کہ «موضحہ» ( ہڈی کھل جانے والے زخم ) میں پانچ اونٹ ہیں۔",
          "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah], telah mengabarkan kepada kami [Yazid bin Zurai'] telah mengabarkan kepada kami [Husain Al Mu'allim] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda tentang luka-luka yang menampakkan tulang: \"Diyatnya lima, lima.\" Abu Isa berkata; Hadits ini hasan dan diamalkan oleh para ulama dan merupakan pendapat Sufyan Ats Tsauri, Asy Syafi'i, Ahmad dan Ishaq bahwa untuk luka-luka yang menampakkan tulang adalah sebesar lima ekor unta",
          "tr": "Amr b. Şuayb (r.a.)’ın babasından ve dedesinden rivâyete göre, Nebi Sallallahu Aleyhi ve Sellem: “Kemiğe dayanacak kadar derin yaralamalarda her bir yaralama da beşer deve diyet vardır.” Diğer tahric: İbn Mâce, Diyât; Ebû Dâvûd, Diyât Tirmizî: Bu hadis hasendir. İlim adamlarının uygulaması bu hadise göredir. Sûfyân es Sevrî, Şâfii, Ahmed ve İshâk yaralamalarda beşer deve verilmesi görüşündedirler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 5
      },
      "narrator": {
        "en": "'Amr bin Shu'aib"
      }
    },
    {
      "hadithNumber": 1391,
      "arabicNumber": 1391,
      "book": 16,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو عَمَّارٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ يَزِيدَ بْنِ عَمْرٍو النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دِيَةُ الأَصَابِعِ الْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاءٌ عَشْرٌ مِنَ الإِبِلِ لِكُلِّ أُصْبُعٍ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى وَفِي الْبَابِ عَنْ أَبِي مُوسَى وَعَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ سُفْيَانُ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَاقُ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:that the Messenger of Allah (ﷺ) said: \"The blood-money for the fingers on the hands and (the toes of) the feet is the same: Ten camels for each finger",
          "ur": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے انگلیوں کی دیت کے بارے میں فرمایا: ”دونوں ہاتھ اور دونوں پیر برابر ہیں، ( دیت میں ) ہر انگلی کے بدلے دس اونٹ ہیں“۔ امام ترمذی کہتے ہیں: ۱- اس سند سے ابن عباس کی حدیث حسن صحیح اور غریب ہے، ۲- اہل علم کا عمل اسی پر ہے، سفیان ثوری، شافعی، احمد اور اسحاق بن راہویہ اسی کے قائل ہیں۔",
          "id": "Telah menceritakan kepada kami [Abu Ammar], telah menceritakan kepada kami [Al Fadlal bin Musa] dari [Al Husain bin Waqid] dari [Yazid bin Amr An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda tentang diyat jari-jari kedua tangan dan kaki: \"Diyatnya sama yaitu sebesar sepuluh ekor unta pada setiap jari.\" Abu Isa berkata; Dalam hal ini ada hadits serupa dari Abu Musa dan Abdullah bin Amr. Abu Isa berkata; Hadits Ibnu Abbas adalah hadits hasan shahih gharib dari jalur ini dan diamalkan oleh para ulama dan juga merupakan pendapat Sufyan, Asy Syafi'i, Ahmad dan Ishaq",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “El ve ayak parmaklarının diyeti eşittir. Her parmak için diyet on devedir.” Diğer tahric: Ebû Dâvûd, Diyât; İbn Mâce, Diyât Tirmizî: Bu konuda Ebû Musa ve Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Tirmizî: İbn Abbâs hadisi bu şekliyle hasen sahih garibtir. ilim adamlarının uygulaması bu hadise göredir. Şâfii, Ahmed, İshâk ve Sûfyân es Sevrî bunlardandır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 6
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1392,
      "arabicNumber": 1392,
      "book": 16,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ هَذِهِ وَهَذِهِ سَوَاءٌ ‏\"‏ ‏.‏ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:that the Prophet (ﷺ) said: \"These and these are the same.\" referring to the little finger and thumb",
          "ur": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”دیت میں یہ اور یہ برابر ہیں، یعنی چھنگلیا انگوٹھا“ ۱؎۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] dan [Muhammad bin Ja'far] keduanya berkata; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ini dan ini adalah sama, yakni jari kelingking dan ibu jari.\" Abu Isa berkata; Hadits ini hasan shahih",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre, Nebi (s.a.v.) buyurdu ki: “Şu ve şu yani serçe parmak ile başparmak diyette eşittir.” Diğer tahric: İbn Mâce, Diyât; Ebû Dâvûd, Diyât Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 7
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1393,
      "arabicNumber": 1393,
      "book": 16,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، حَدَّثَنَا أَبُو السَّفَرِ، قَالَ دَقَّ رَجُلٌ مِنْ قُرَيْشٍ سِنَّ رَجُلٍ مِنَ الأَنْصَارِ فَاسْتَعْدَى عَلَيْهِ مُعَاوِيَةَ فَقَالَ لِمُعَاوِيَةَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ هَذَا دَقَّ سِنِّي ‏.‏ قَالَ مُعَاوِيَةُ إِنَّا سَنُرْضِيكَ وَأَلَحَّ الآخَرُ عَلَى مُعَاوِيَةَ فَأَبْرَمَهُ فَلَمْ يُرْضِهِ فَقَالَ لَهُ مُعَاوِيَةُ شَأْنَكَ بِصَاحِبِكَ ‏.‏ وَأَبُو الدَّرْدَاءِ جَالِسٌ عِنْدَهُ قَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَا مِنْ رَجُلٍ يُصَابُ بِشَيْءٍ فِي جَسَدِهِ فَيَتَصَدَّقُ بِهِ إِلاَّ رَفَعَهُ اللَّهُ بِهِ دَرَجَةً وَحَطَّ عَنْهُ بِهِ خَطِيئَةً ‏\"‏ ‏.‏ قَالَ الأَنْصَارِيُّ أَأَنْتَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي ‏.‏ قَالَ فَإِنِّي أَذَرُهَا لَهُ ‏.‏ قَالَ مُعَاوِيَةُ لاَ جَرَمَ لاَ أُخَيِّبُكَ ‏.‏ فَأَمَرَ لَهُ بِمَالٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَلاَ أَعْرِفُ لأَبِي السَّفَرِ سَمَاعًا مِنْ أَبِي الدَّرْدَاءِ وَأَبُو السَّفَرِ اسْمُهُ سَعِيدُ بْنُ أَحْمَدَ وَيُقَالُ ابْنُ يُحْمِدَ الثَّوْرِيُّ ‏.‏",
        "translations": {
          "en": "Narrated Abu As-Safar:\"A man from the Quraish broke a tooth of a man from the Ansar. So he appealed to Mu'awiyah against him. He said to Mu'awiyah: 'O Commander of the Believers! This person broke one of my teeth.' Mu'awiyah said: 'We will try to get satisfaction for you.' And the other person insisted that Mu'awiyah get him to agree [but he was not satisfied]. So Mu'awiyah said him: 'It is up to your companion.' Abu Ad-Darda' was sitting with him, so Abu Ad-Darda said: 'I heard the Messenger of Allah (ﷺ) saying [he said: 'My ears heard and my heart remembered]: \"There is no man who is struck in his body and he forgives for it, except that Allah raises him a level and removes a sin from him.'\" The Ansari said: 'Did you hear that from the Messenger of Allah (ﷺ)?' He said: \"My ears heard it and my heart remembered it.' He said: 'Then I will leave it to him.' Mu'awiyah said: 'Surely you should not suffer.' So he ordered that he be given some wealth",
          "ur": "ابوسفر سعید بن احمد کہتے ہیں کہ ایک قریشی نے ایک انصاری کا دانت توڑ دیا، انصاری نے معاویہ رضی الله عنہ سے فریاد کی، اور ان سے کہا: امیر المؤمنین! اس ( قریشی ) نے میرا دانت توڑ دیا ہے، معاویہ رضی الله عنہ نے کہا: ہم تمہیں ضرور راضی کریں گے، دوسرے ( یعنی قریشی ) نے معاویہ رضی الله عنہ سے بڑا اصرار کیا اور ( یہاں تک منت سماجت کی کہ ) انہیں تنگ کر دیا، معاویہ اس سے مطمئن نہ ہوئے، چنانچہ معاویہ نے اس سے کہا: تمہارا معاملہ تمہارے ساتھی کے ہاتھ میں ہے، ابو الدرداء رضی الله عنہ ان کے پاس بیٹھے ہوئے تھے، ابو الدرداء رضی الله عنہ نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا ہے، میرے کانوں نے اسے سنا ہے اور دل نے اسے محفوظ رکھا ہے، آپ فرما رہے تھے: ”جس آدمی کے بھی جسم میں زخم لگے اور وہ اسے صدقہ کر دے ( یعنی معاف کر دے ) تو اللہ تعالیٰ اسے ایک درجہ بلندی عطا کرتا ہے اور اس کا ایک گناہ معاف فرما دیتا ہے، انصاری نے کہا: رسول اللہ صلی اللہ علیہ وسلم سے آپ نے سنا ہے؟ ابو الدرداء نے کہا: میرے دونوں کانوں نے سنا ہے اور میرے دل نے اسے محفوظ رکھا ہے، اس نے کہا: تو میں اس کی دیت معاف کر دیتا ہوں، معاویہ رضی الله عنہ نے کہا: لیکن میں تمہیں محروم نہیں کروں گا، چنانچہ انہوں نے اسے کچھ مال دینے کا حکم دیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہمیں یہ صرف اسی سند سے معلوم ہے، مجھے نہیں معلوم کہ ابوسفر نے ابو الدرداء سے سنا ہے، ۲- ابوسفر کا نام سعید بن احمد ہے، انہیں ابن یحمد ثوری بھی کہا جاتا ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad], telah menceritakan kepada kami [Abdullah bin Al Mubarak], telah menceritakan kepada kami [Yunus bin Abu Ishaq] telah menceritakan kepada kami [Abu As Safar] ia berkata; Orang Quraisy memukul gigi orang Anshar, lalu ia melaknat dan meminta pertolongan kepada Mu'wiyah. Ia pun berkata kepada Mu'awiyah; Wahai Amirul Mukminin, sesungguhnya orang ini telah memukul gigiku. Mu'awiyah berkata; Sesungguhnya kami meridlaimu. Yang lain mendesak Mu'awiyah dan menyampaikan kepadanya namun ia tidak meridlainya, Mu'awiyah pun berkata kepadanya; Urusanmu dengan temanmu. Saat itu Abu Ad Darda` duduk di sebelahnya, [Abu Ad Darda`] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam, ia melanjutkan; Kedua telingaku mendengar dan hatiku memperhatikan, beliau bersabda: \"Tidaklah seseorang yang terkena sesuatu pada tubuhnya lalu ia bersedekah dengannya (tidak menuntutnya), melainkan Allah akan mengangkatnya beberapa derajat dan menghapuskan kesalahan-kesalahannya.\" Orang Anshar itu bertanya; Benarkah engkau mendengarnya dari Rasulullah shallallahu 'alaihi wasallam? Ia menjawab; Kedua telingaku mendengar dan hatiku memperhatikannya. Ia berkata; Aku memaafkannya. Mu'awiyah berkata; Pasti aku tidak akan mengecewakanmu. Lalu ia menyuruh memberikan harta kepadanya. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini dan aku tidak tahu Abu As Safar memiliki hadits yang didengar dari Abu Ad Darda`. Abu As Safar bernama Sa'id bin Ahmad dan ia dipanggil Ibnu Yuhmida Ats Tsauri",
          "tr": "Ebûs Sefer (r.a.)’den rivâyet edildiğine göre, şöyle demiştir: Kureyş’den bir adam Ensâr’dan bir adamın dişini kırmıştı. Muaviye dişi kıran kimseye arka çıkınca dişi kırılan adam Muaviye’ye: “Ey Mü’minlerin emiri bu adam benim dişimi kırmıştır” dedi. Muaviye de: “Seni razı edeceğiz” dedi. Karşı taraf Muaviye üzerine baskın çıkıp Muaviye’yi bezdirip üstün çıkmaya çalışınca bu işe razı olmadı ve hasmınla ne halin varsa kendin hallediver dedi. Muaviye’nin yanında oturmakta olan Ebû’d Derdâ şöyle dedi: Rasûlullah (s.a.v.)’den işittim şöyle buyurmuştur: İki kulağımın işittiği kalbimin ezberlediği o söz şöyledir: “Bir kimsenin vücuduna bir zarar gelir de onu bağışlarsa Allah bu yaptığı affetmeden dolayı onun derecesini yükseltir ve günahını siler.” Ensârlı adam: “Bunu Rasûlullah (s.a.v.)’den bizzat kendin işittin mi?” diye sordu, Ebû’d Derdâ: “Kulaklarım dinledi kalbim kavradı” dedi. Ensârlı: “O halde o dişi ona bağışlıyorum” dedi. Muaviye: ''Seni mutlaka ödüllendireceğim dedi ve kendisine bir miktar mal verilmesini emretti. Diğer tahric: İbn Mâce, Diyât Tirmizî: Bu hadis garib olup sadece bu şekliyle bilmekteyiz. Ebûs Sefer’in, Ebû’d Derdâ’dan hadis dinlediğine ait bir bilgimiz yoktur. Ebûs Sefer’in adı; Saîd b. Ahmed İbn Muhammed es Sevrî olduğu da söylenmektedir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 8
      },
      "narrator": {
        "en": "Abu As-Safar"
      }
    },
    {
      "hadithNumber": 1394,
      "arabicNumber": 1394,
      "book": 16,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ خَرَجَتْ جَارِيَةٌ عَلَيْهَا أَوْضَاحٌ فَأَخَذَهَا يَهُودِيٌّ فَرَضَخَ رَأْسَهَا بِحَجَرٍ وَأَخَذَ مَا عَلَيْهَا مِنَ الْحُلِيِّ ‏.‏ قَالَ فَأُدْرِكَتْ وَبِهَا رَمَقٌ فَأُتِيَ بِهَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ قَتَلَكِ أَفُلاَنٌ ‏\"‏ ‏.‏ قَالَتْ بِرَأْسِهَا لاَ ‏.‏ قَالَ ‏\"‏ فَفُلاَنٌ ‏\"‏ ‏.‏ حَتَّى سُمِّيَ الْيَهُودِيُّ فَقَالَتْ بِرَأْسِهَا أَىْ نَعَمْ ‏.‏ قَالَ فَأُخِذَ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لاَ قَوَدَ إِلاَّ بِالسَّيْفِ ‏.‏",
        "translations": {
          "en": "Narrated Anas:that a girl went out in Al-Madinah wearing some silver ornaments. A Jew grabbed her and fractured her head with a stone, and he took the jewelry she had on. He said: \"She was found with some spark of life in her, and was brought to the Prophet (ﷺ) and he said: 'Did such and such person strike you?' She nodded 'no' with her head. He said: 'Such and such?' until he named the Jew and she nodded 'yes' with her head.\" He said: \"He was brought and recognized so the Messenger of Allah (ﷺ) ordered that his head be crushed between two stones",
          "ur": "انس رضی الله عنہ کہتے ہیں کہ ایک لڑکی زیور پہنے ہوئے کہیں جانے کے لیے نکلی، ایک یہودی نے اسے پکڑ کر پتھر سے اس کا سر کچل دیا اور اس کے پاس جو زیور تھے وہ اس سے چھین لیا، پھر وہ لڑکی ایسی حالت میں پائی گئی کہ اس میں کچھ جان باقی تھی، چنانچہ اسے نبی اکرم صلی اللہ علیہ وسلم کے پاس لایا گیا، آپ نے اس سے پوچھا: ”تمہیں کس نے مارا ہے، فلاں نے؟“ اس نے سر سے اشارہ کیا: نہیں، آپ نے پوچھا: ”فلاں نے؟“ یہاں تک کہ اس یہودی کا نام لیا گیا ( جس نے اس کا سر کچلا تھا ) تو اس نے اپنے سر سے اشارہ کیا یعنی ہاں! تو یہودی پکڑا گیا، اور اس نے اعتراف جرم کر لیا، پھر رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا، اور اس کا سر دو پتھروں کے درمیان کچل دیا گیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور اہل علم کے نزدیک اسی پر عمل ہے، احمد اور اسحاق بن راہویہ کا یہی قول ہے، بعض اہل علم کہتے ہیں: قصاص صرف تلوار سے لیا جائے گا ۱؎۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] ia berkata; Seorang budak perempuan keluar dengan memakai perhiasan yang terbuat dari perak, lalu perhiasan itu ditarik oleh seorang yahudi sambil memukul kepala perempuan tersebut dengan batu lalu mengambil perhiasannya. Wanita tersebut ditemukan dalam keadaan pingsan, lalu dibawa menghadap kepada Rasulullah shallallahu 'alaihi wasallam, maka Nabi bertanya, apakah kamu dibunuh oleh si fulan? Wanita itu menjawab, Tidak, dengan menggunakan isyarat kepalanya (menggelengkan kepala), Nabi bertanya lagi, apakah si fulan? Hingga disebutkan nama seorang yahudi, lalu wanita itu menjawab, Iya, dengan menggunakan isyarat kepalanya. Lalu, orang yahudi tersebut dipanggil, dan ia pun mengakui atas perbuatannya. Lalu, Nabi memerintahkan untuk mengqishasnya, dengan membenturkan kepalanya di antara dua buah batu. Abu Isa berkata, \"Hadits ini hasan shahih, dan sebagian ulama menjadikannya sebagai landasan amal, ini merupakan pendapat Ahmad dan Ishaq. Ada sebagian ulama yang mengatakan, tidak ada balasan baginya kecuali dengan pedang",
          "tr": "Enes (r.a.)’den rivâyet edildiğine göre, şöyle demiştir: “Üzerinde gümüşten ziynet eşyası olan bir cariye şehrin dışına çıkmıştı. Bir Yahudi onu yakalayıp başını taşla ezerek ziynet eşyalarını almıştı. Son anlarında cariyeye ulaşıldı ve Rasûlullah (s.a.v.)’e getirildi de Rasûlullah (s.a.v.), sordu: Seni kim öldürmek istedi falan mı? Cariye başı ile işaret ederek hayır dedi o halde falan mı? dedi. Sonunda Yahudi’nin adını söyleyince başı ile evet dedi ve Yahudi yakalandı, suçunu da itiraf etti. Bunun üzerine Rasûlullah (s.a.v.) emretti de o Yahudi’nin başı da aynı şekilde iki taş arasında ezildi.” Diğer tahric: Müslim, Kasame; Nesâî, Kasame Tirmizî: Bu hadis hasen sahihtir. bazı ilim adamlarının uygulaması bu hadise göredir. Ahmed ve İshâk bunlardandır. Bazı ilim adamları ise: “Kısasın ancak kılıçla yapılabileceği” görüşündedirler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 9
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 1395,
      "arabicNumber": 1395,
      "book": 16,
      "hadithInBook": 10,
      "text": {
        "arabic": "",
        "translations": {
          "ur": "عبداللہ بن عمرو کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”دنیا کی بربادی اللہ کے نزدیک ایک مسلمان کے قتل ہونے سے کہیں زیادہ کمتر و آسان ہے“۔ امام ترمذی کہتے ہیں: ۱- ہم سے محمد بن بشار نے بسند «محمد بن جعفر حدثنا شعبة عن يعلى بن عطاء عن أبيه عن عبد الله بن عمرو» اسی طرح روایت کی ہے، لیکن انہوں نے اسے مرفوع نہیں کیا ہے، ۲- یہ روایت ابن ابی عدی کی روایت کے بالمقابل زیادہ صحیح ہے ( یعنی موقوف ہونا زیادہ صحیح ہے ) ، ۳- عبداللہ بن عمرو رضی الله عنہما کی حدیث کو ابن ابی عدی نے شعبہ سے، بسند «يعلى بن عطاء عن أبيه عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم» اسی طرح روایت کیا ہے، جب کہ محمد بن جعفر اور ان کے علاوہ دوسروں نے شعبہ سے بسند «يعلى بن عطاء» روایت کیا ہے، لیکن انہوں نے اسے مرفوع نہیں کیا ہے، اسی طرح سفیان ثوری نے یعلیٰ بن عطاء سے موقوفا روایت کی ہے اور یہ ( موقوف روایت ابن ابی عدی کی ) مرفوع حدیث سے زیادہ صحیح ہے، ۴- اس باب میں سعد، ابن عباس، ابوسعید، ابوہریرہ، عقبہ بن عامر، ابن مسعود اور بریدہ رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Abu Salamah Yahya bin Khalaf] dan [Muhammad bin Abdullah bin Bazi'] keduanya berkata; Telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Ya'la bin 'Atha`] dari [ayahnya] dari [Abdullah bin Amr] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh, hancurnya dunia bagi Allah lebih ringan dari pada pembunuhan seorang muslim.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] dari [ayahnya] dari [Abdullah bin Amru] seperti itu namun ia tidak memarfu'kannya. Abu 'Isa berkata; Hadits ini lebih shahih dari Hadits Ibnu Abu 'Adi. Ia mengatakan; Dalam hal ini ada hadits serupa dari Sa'd, Ibnu Abbas, Abu Sa'id Abu Hurairah, Uqbah bin Amir, Ibnu Mas'ud dan Buraidah. Abu 'Isa berkata; Hadits Abdullah bin Amru adalah seperti ini, Ibnu Abu Adi meriwayatkannya dari Syu'bah dari Ya'la bin 'Atha` dari ayahnya dari Abdullah bin Amr dari Nabi shallallahu 'alaihi wasallam. Muhammad bin Ja'far dan lainnya juga meriwayatkan dari Syu'bah dari Ya'la bin 'Atha` namun ia tidak memarfu'kannya. Demikian juga Sufyan Ats Tsauri meriwayatkan dari Ya'la bin 'Atha` secara mauquf dan riwayat ini lebih shahih dari pada hadits yang marfu"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 10
      }
    },
    {
      "hadithNumber": 1396,
      "arabicNumber": 1396,
      "book": 16,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَوَّلَ مَا يُحْكَمُ بَيْنَ الْعِبَادِ فِي الدِّمَاءِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنِ الأَعْمَشِ مَرْفُوعًا وَرَوَى بَعْضُهُمْ عَنِ الأَعْمَشِ وَلَمْ يَرْفَعُوهُ ‏.‏",
        "translations": {
          "en": "Narrated 'Abdullah:that the Messenger of Allah (ﷺ) said: \"Indeed the first cases to be judged between the people are those of bloodshed",
          "ur": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( آخرت میں ) بندوں کے درمیان سب سے پہلے خون کے بارے میں فیصلہ کیا جائے گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عبداللہ کی حدیث حسن صحیح ہے، اسی طرح کئی لوگوں نے اعمش سے مرفوعاً روایت کی ہے، ۲- اور بعض نے اعمش سے روایت کی ہے ان لوگوں نے اسے مرفوع نہیں کہا ہے۔",
          "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang pertama kali akan diputuskan di antara para hamba adalah masalah darah (qishas).\" Abu 'Isa berkata; Hadits Abdullah adalah hadits hasan shahih, demikianlah banyak perawi meriwayatkan dari Al A'masy secara marfu', namun sebagian mereka meriwayatkan dari Al A'masy dan tidak memarfu'kannya",
          "tr": "Abdullah b. Mes’ûd (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kıyamette kullar arasında ilk görülecek dava kan davalarıdır.” Diğer tahric: Buhârî, Rıkaak; Müslim, Kasame Tirmizî: Abdullah hadisi hasen sahihtir. Pek çok kimse bu hadisi A’meş’den bu şekilde merfu olarak rivâyet etmişlerdir. Bazıları da yine Â’meş’ten merfu olmaksızın rivâyet etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 12
      },
      "narrator": {
        "en": "'Abdullah"
      }
    },
    {
      "hadithNumber": 1397,
      "arabicNumber": 1397,
      "book": 16,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَوَّلَ مَا يُقْضَى بَيْنَ الْعِبَادِ فِي الدِّمَاءِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Abdullah narrated that the Messenger of Allah (ﷺ) said:\"Indeed the first cases to be judged between the worshippers are those of bloodshed",
          "ur": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( آخرت میں ) بندوں کے درمیان سب سے پہلے خون کا فیصلہ کیا جائے گا“۔",
          "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang pertama kali akan diputuskan di antara para hamba adalah masalah darah (qishas)",
          "tr": "Yine Abdullah (r.a.)’den rivâyet edildiğine göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kullar arasında hükme bağlanacak ilk dava kan davalarıdır.” Diğer tahric: Buhârî, Rıkaak; Müslim, Kasame"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 13
      }
    },
    {
      "hadithNumber": 1398,
      "arabicNumber": 1398,
      "book": 16,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ يَزِيدَ الرَّقَاشِيِّ، حَدَّثَنَا أَبُو الْحَكَمِ الْبَجَلِيُّ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، وَأَبَا، هُرَيْرَةَ يَذْكُرَانِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ أَنَّ أَهْلَ السَّمَاءِ وَأَهْلَ الأَرْضِ اشْتَرَكُوا فِي دَمِ مُؤْمِنٍ لأَكَبَّهُمُ اللَّهُ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏. ‏وَأَبُو الْحَكَمِ الْبَجَلِيُّ هُوَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي نُعْمٍ الْكُوفِيُّ",
        "translations": {
          "en": "Narrated Abul-Hakam Al-Bajali:\"I heard Abu Sa'eed Al-Khudri and Abu Hurairah mentioning from the Messenger of Allah (ﷺ) that he said: 'If the inhabitants of the heavens and the inhabitants of the earth all took part in shedding the blood of believer, then Allah would cast them (all) in the Fire",
          "ur": "ابو سعید خدری اور ابوہریرہ رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر آسمان اور زمین والے ( سارے کے سارے ) ایک مومن کے خون میں ملوث ہو جائیں تو اللہ ان ( سب ) کو اوندھے منہ جہنم میں ڈال دے گا“۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔",
          "id": "Telah menceritakan kepada kami [Al Husain bin Huraits], telah menceritakan kepada kami [Al Fadlal bin Musa] dari [Al Husain bin Waqid] dari [Yazid Ar Raqasyi], telah menceritakan kepada kami [Abu Al Hakam Al Bajali] ia berkata; Aku mendengar [Abu Sa'id Al Khudri] dan [Abu Hurairah] keduanya menyebutkan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Seandainya penduduk langit dan penduduk bumi bersekutu untuk membunuh seorang mukmin, niscaya Allah akan menjerumuskan mereka ke neraka.\" Abu 'Isa berkata; Hadits ini gharib, Abu Al Hakam Al Bajali adalah Abdurrahman bin Abu Nu'm Al Kufi",
          "tr": "Ebûl Hakem el Becelî’den rivâyete göre, şöyle demiştir: Ebû Saîd el Hudrî ve Ebü Hureyre’den işittim; Rasûlullah (s.a.v.)’in şöyle buyurduğunu hatırlattılar: “Gök ve yeryüzü halkı bir Müslüman’ın kanını akıtmak için birleşseler, Allah onların hepsini yüzüstü Cehenneme yuvarlar.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis garibtir. Ebûl Hakem el Becelî ise Abdurrahman b. Nu’min olup Küfelidir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 14
      },
      "narrator": {
        "en": "Abul-Hakam Al-Bajali"
      }
    },
    {
      "hadithNumber": 1399,
      "arabicNumber": 1399,
      "book": 16,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا الْمُثَنَّى بْنُ الصَّبَّاحِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ، قَالَ حَضَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقِيدُ الأَبَ مِنِ ابْنِهِ وَلاَ يُقِيدُ الاِبْنَ مِنْ أَبِيهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ سُرَاقَةَ إِلاَّ مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِصَحِيحٍ رَوَاهُ إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنِ الْمُثَنَّى بْنِ الصَّبَّاحِ ‏.‏ وَالْمُثَنَّى بْنُ الصَّبَّاحِ يُضَعَّفُ فِي الْحَدِيثِ ‏.‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ أَبُو خَالِدٍ الأَحْمَرُ عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ مُرْسَلاً وَهَذَا حَدِيثٌ فِيهِ اضْطِرَابٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الأَبَ إِذَا قَتَلَ ابْنَهُ لاَ يُقْتَلُ بِهِ وَإِذَا قَذَفَ ابْنَهُ لاَ يُحَدُّ ‏.‏",
        "translations": {
          "en": "Narrated Suraqah bin Malik bin [Ju'shum]:\"The Messenger of Allah (ﷺ) judged that the son is to suffer retaliation for [killing] his father, but the father is not to suffer retaliation for [killing] his son",
          "ur": "سراقہ بن مالک بن جعشم رضی الله عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، ( تو دیکھا ) کہ آپ باپ کو بیٹے سے قصاص دلواتے تھے اور بیٹے کو باپ سے قصاص نہیں دلواتے تھے ۱؎۔ امام ترمذی کہتے ہیں: ۱- سراقہ رضی الله عنہ کی اس حدیث کو ہم صرف اسی سند سے جانتے ہیں۔ اس کی سند صحیح نہیں ہے، اسے اسماعیل بن عیاش نے مثنیٰ بن صباح سے روایت کی ہے اور مثنیٰ بن صباح حدیث میں ضعیف گردانے جاتے ہیں، ۲- اس حدیث کو ابوخالد اُحمر نے بطریق: «عن الحجاج بن أرطاة عن عمرو بن شعيب عن أبيه عن جده عن عمر عن النبي صلى الله عليه وسلم» روایت کیا ہے، ۴- یہ حدیث عمرو بن شعیب سے مرسلاً بھی مروی ہے، اس حدیث میں اضطراب ہے، ۴- اہل علم کا عمل اسی پر ہے کہ باپ جب اپنے بیٹے کو قتل کر دے تو بدلے میں ( قصاصاً ) اسے قتل نہیں کیا جائے گا اور جب باپ اپنے بیٹے پر ( زنا کی ) تہمت لگائے تو اس پر حد قذف نافذ نہیں ہو گی۔",
          "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Isma'il bin 'Ayyasy] telah menceritakan kepada kami [Al Mutsanna bin Ash Shabbah] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari [Suraqah bin Malik bin Ju'syam] ia berkata; Aku menyaksikan Rasulullah shallallahu 'alaihi wasallam menetapkan qishash untuk bapak karena dibunuh anaknya, namun tidak mengqishash untuk anak karena dibunuh bapaknya. Abu 'Isa berkata; Hadits ini tidak kami ketahui dari Suraqah kecuali dari jalur ini dan sanadnya tidak shahih, Isma'il bin 'Ayyasy meriwayatkan dari Al Mutsanna bin Ash Shabbah sedangkan Al Mutsanna bin Ash Shabbah didla'ifkan dalam periwayatan hadits. Dan [Abu Khalid Al Ahmar] telah meriwayatkan hadits ini dari [Al Hajjaj bin Arthah] dari [Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] dari [Umar] dari Nabi shallallahu 'alaihi wasallam. Hadits ini juga telah diriwayatkan dari Amru bin Syu'aib secara mursal dan dalam hadits ini terdapat kegoncangan serta hadits ini menjadi pedoman amal menurut para ulama bahwa seorang bapak jika membunuh anaknya, ia tidak dibunuh dan jika menuduh anaknya berzina, ia tidak dijatuhi hukuman had",
          "tr": "Suraka b. Mâlik b. Cu’şum (r.a.)’dan rivâyete göre, şöyle demiştir: “Rasûlullah (s.a.v.) ile beraber oldum, baba öldürülmesinden dolayı çocuğa kısas yapar, çocuğunu öldürdüğünden dolayı babaya kısas uygulamazdı.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadisi Suraka’nın rivâyetinden olduğunu sadece bu şekliyle bilmekteyiz. Bu hadisin senedi pek sağlam değildir çünkü bu hadisi İsmail b. Abbâs, Müsenna b. Sabbah’tan rivâyet etmiştir. Müsenna b. Sabbah hadiste zayıf görülen bir kimsedir. Yine bu hadis Ebû Hâlid el Ahmer vasıtasıyla Haccac b. Ertae’den, Amr b. Şuayb’den, babasından ve dedesinden de rivâyet edilmiştir. yine bu hadis Amr b. Şuayb’den mürsel olarakta rivâyet edilmiştir. Bu hadiste karışıklık vardır. İlim adamlarının uygulaması bu hadise göre olup; “Bir baba oğlunu öldürdürse onun karşılığında kendisi öldürülmez yine bir baba oğluna zina suçu isnad ettiğinde de kazf cezası tatbik edilmez.”"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Daif"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 15
      },
      "narrator": {
        "en": "Suraqah bin Malik bin [Ju'shum]"
      }
    },
    {
      "hadithNumber": 1400,
      "arabicNumber": 1400,
      "book": 16,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا الأَحْمَرُ، عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يُقَادُ الْوَالِدُ بِالْوَلَدِ ‏\"‏ ‏.‏",
        "translations": {
          "en": "Narrated 'Umar bin Al-Khattab:that the Messenger of Allah (ﷺ) said: \"The father does not suffer retaliation for [killing] the son",
          "ur": "عمر بن خطاب رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”باپ سے بیٹے کا قصاص نہیں لیا جائے گا“ ۱؎۔",
          "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyajj], telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Al Hajjaj bin Arthah] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari [Umar bin Al Khaththab] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang bapak tidak dijatuhi hukuman dengan membunuh anaknya",
          "tr": "Ömer b. Hattâb (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.)’in şöyle buyurduğunu işittim: “Çocuğunu öldürmesi sebebiyle babaya kısas uygulanmaz.” Diğer tahric: İbn Mâce, Diyât"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 16
      },
      "narrator": {
        "en": "'Umar bin Al-Khattab"
      }
    },
    {
      "hadithNumber": 1401,
      "arabicNumber": 1401,
      "book": 16,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ وَلاَ يُقْتَلُ الْوَالِدُ بِالْوَلَدِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ بِهَذَا الإِسْنَادِ مَرْفُوعًا إِلاَّ مِنْ حَدِيثِ إِسْمَاعِيلَ بْنِ مُسْلِمٍ ‏.‏ وَإِسْمَاعِيلُ بْنُ مُسْلِمٍ الْمَكِّيُّ قَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:that the Prophet (ﷺ) said: 'The Hudud are not carried in the Masjid, and the father is not killed for the son",
          "ur": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مسجدوں میں حدود نہیں قائم کی جائیں گی اور بیٹے کے بدلے باپ کو ( قصاص میں ) قتل نہیں کیا جائے گا“۔ امام ترمذی کہتے ہیں: اس سند سے اس حدیث کو ہم صرف اسماعیل بن مسلم کی روایت سے مرفوع جانتے ہیں اور اسماعیل بن مسلم مکی کے حفظ کے سلسلے میں بعض اہل علم نے کلام کیا ہے ۱؎۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Isma'il bin Muslim] dari [Amr bin Dinar] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Hukuman tidak boleh dilaksanakan di dalam masjid, dan seorang bapak tidak boleh dihukum bunuh (qishas) karena membunuh anaknya.\" Abu 'Isa berkata; Hadits ini tidak kami ketahui dengan sanad ini secara marfu' kecuali dari Hadits Isma'il bin Muslim dan Isma'il bin Muslim Al Makki telah dicela oleh sebagian ulama dari segi hafalannya",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Cezalar mescidlerde uygulanmaz! Baba çocuğunu öldürmesi sebebiyle öldürülmez.” Diğer tahric: İbn Mâce, Diyat Tirmizî: Bu hadisi merfu olarak bu senedle sadece İsmail b. Müslim’in rivâyetiyle bilmekteyiz. İsmail b. Müslim; Mekkelidir. Bazı hadisçiler bu kimse hakkında hafızası yönünden söz etmişlerdir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 17
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1402,
      "arabicNumber": 1402,
      "book": 16,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلاَّ بِإِحْدَى ثَلاَثٍ الثَّيِّبُ الزَّانِي وَالنَّفْسُ بِالنَّفْسِ وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عُثْمَانَ وَعَائِشَةَ وَابْنِ عَبَّاسٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated 'Abdullah bin Mas'ud:that the Messenger of Allah (ﷺ) said: \"The blood of a Muslim man, who testifies that none has the right to be worshipped Allah, is not lawful except for one of three cases: The (previously married or) married adulterer, a life for a life, and the one who leaves the religion and parts from the Jama'ah (the community of Muslims)",
          "ur": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی مسلمان شخص کا خون جو اس بات کی گواہی دیتا ہو کہ اللہ کے سوا کوئی معبود برحق نہیں اور میں اللہ کا رسول ہوں، حلال نہیں سوائے تین باتوں میں سے کسی ایک کے: یا تو وہ شادی شدہ زانی ہو، یا جان کو جان کے بدلے مارا جائے، یا وہ اپنا دین چھوڑ کر جماعت مسلمین سے الگ ہو گیا ہو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابن مسعود رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عثمان، عائشہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah bin Mas'ud] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahwa tidak ada sesembahan yang haq selain Allah dan aku adalah utusan Allah kecuali salah satu dari tiga orang; Orang tua yang berzina, jiwa dibalas dengan jiwa (orang yang membunuh orang lain), dan orang yang murtad dari agamanya memisahkan diri dari jama'ah muslimin.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Utsman, A`isyah dan Ibnu Abbas. Abu 'Isa berkata; Hadits Ibnu Mas'ud adalah hadits shahih",
          "tr": "Abdullah b. Mes’ûd (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Allah’tan başka itaat edilecek kimse tanımayan benim de Allah’ın kulu ve elçisi olduğumu kabul ederek Müslüman olan kişinin kanı ancak şu üç şeyden biri ile helal olur; 1- Zina eden evli kimse, 2- Cana karşı can, 3- Dinini terk edip İslam cemaatinden ayrılan kimse.” Diğer tahric: Ebû Dâvûd, Hudud Tirmizî: Bu konuda Osman, Âişe ve İbn Abbâs’tan da hadis rivâyet edilmiştir. Tirmizî: İbn Mes’ûd hadisi hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 18
      },
      "narrator": {
        "en": "'Abdullah bin Mas'ud"
      }
    },
    {
      "hadithNumber": 1403,
      "arabicNumber": 1403,
      "book": 16,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ، هُوَ الْبَصْرِيُّ عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ مَنْ قَتَلَ نَفْسًا مُعَاهِدَةً لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ فَقَدْ أَخْفَرَ بِذِمَّةِ اللَّهِ فَلاَ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ خَرِيفًا ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي بَكْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurairah:that the Prophet (ﷺ) said: \"Indeed, whoever kills a Mu'ahid that has a covenant from Allah and a covenant from His Messenger (ﷺ), then he has violated the covenant with Allah and the covenant of His Messenger, so he shall not smell the fragrance of Paradise; even though its fragrance can be sensed from the distance of seventy autumns",
          "ur": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”خبردار! جس نے کسی ایسے ذمی ۱؎ کو قتل کیا جسے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی پناہ حاصل تھی تو اس نے اللہ کے عہد کو توڑ دیا، لہٰذا وہ جنت کی خوشبو نہیں پا سکے گا، حالانکہ اس کی خوشبو ستر سال کی مسافت ( دوری ) سے آئے گی“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- نبی اکرم صلی اللہ علیہ وسلم سے ابوہریرہ کی حدیث کئی سندوں سے مروی ہے، ۳- اس باب میں ابوبکرہ رضی الله عنہ سے بھی روایت ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Ma'di bin Sulaiman], ia adalah Al Bashri, dari [Ibnu 'Ajlan] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ketahuilah, barangsiapa membunuh seseorang yang terikat janji dengan kaum muslimin dan memiliki jaminan keamanan dari Allah dan RasulNya, maka ia telah melanggar perlindungan Allah dan ia tidak akan mencium bau surga, dan sesungguhnya baunya dapat dicium sejauh perjalanan tujuh puluh masa.\" Abu 'Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih. Dan diriwayatkan juga melalui banyak jalur dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Dikkat edin Allah’ın ve Rasûlünün güvencesi altında bulunan bir kimseyi her kim öldürürse Allah’a verdiği sözü bozmuş olur ve Cennetin kokusunu bile koklayamaz. Oysa Cennetin kokusu yetmiş yıllık mesafeden duyulur.” Diğer tahric: İbn Mâce, Diyât Tirmizî: Bu konuda Ebû Bekre’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hüreyre hadisi hasen sahihtir. Bu hadis Ebû Hüreyre’den değişik şekillerde de rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 19
      },
      "narrator": {
        "en": "Abu Hurairah"
      }
    },
    {
      "hadithNumber": 1404,
      "arabicNumber": 1404,
      "book": 16,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنْ أَبِي سَعْدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَدَى الْعَامِرِيَّيْنِ بِدِيَةِ الْمُسْلِمِينَ وَكَانَ لَهُمَا عَهْدٌ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَأَبُو سَعْدٍ الْبَقَّالُ اسْمُهُ سَعِيدُ بْنُ الْمَرْزُبَانِ ‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Abbas:\"The Prophet (ﷺ) assigned the same blood-money for the two 'Amiris as that of the Muslims, and they had covenant from the Messenger of Allah (ﷺ)",
          "ur": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے قبیلہ عامر کے دو آدمیوں کو مسلمانوں کے برابر دیت دی، ( کیونکہ ) ان دونوں کا رسول اللہ صلی اللہ علیہ وسلم سے عہد و پیمان تھا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، اسے ہم صرف اسی سند سے جانتے ہیں، ۲- حدیث کے راوی ابوسعد بقال کا نام سعید بن مرزبان ہے۔",
          "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Yahya bin Adam] dari [Abu Bakr bin 'Ayyasy] dari [Abu Sa'd] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam membayar diyat dua orang banu Amir sebesar diyat kaum muslimin, ketika itu keduanya terikat perjanjian dari Rasulullah shallallahu 'alaihi wasallam. Abu 'Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini. Abu Sa'id Al Baqqal bernama Sa'id bin Marzuban",
          "tr": "İbn Abbâs (r.a.)’den rivâyete göre: “Nebi (s.a.v.), Âmir kabilesine mensub iki kişinin hata ile öldürülmesi üzerine onların velilerine Müslüman’a ödenecek kadar diyet verdi. Çünkü bu iki kimse Rasûlullah (s.a.v.)’den güvence almışlardı.” Tirmizî rivâyet etmiştir. Tirmizî: Bu hadis garibtir. Sadece bu şekliyle bilmekteyiz. Ebû Sa’d el Bakkal’ın ismi Saîd b. Merzuban’dır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif Isnaad"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Daif"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 20
      },
      "narrator": {
        "en": "Ibn 'Abbas"
      }
    },
    {
      "hadithNumber": 1405,
      "arabicNumber": 1405,
      "book": 16,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، وَيَحْيَى بْنُ مُوسَى، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ لَمَّا فَتَحَ اللَّهُ عَلَى رَسُولِهِ مَكَّةَ قَامَ فِي النَّاسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يَعْفُوَ وَإِمَّا أَنْ يَقْتُلَ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ وَائِلِ بْنِ حُجْرٍ وَأَنَسٍ وَأَبِي شُرَيْحٍ خُوَيْلِدِ بْنِ عَمْرٍو ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurairah:\"When Allah granted His Messenger (ﷺ) victory over Makkah, he stood (to deliver an address) among the people. He thanked and praised Allah, then he said: 'And from whomever (one of his relatives) was killed, then he has two options to choose from: Either to pardon or that he be killed",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ جب اللہ نے اپنے رسول کے لیے مکہ کو فتح کر دیا تو آپ صلی اللہ علیہ وسلم نے لوگوں میں کھڑے ہو کر اللہ کی حمد و ثنا بیان کی، پھر فرمایا: ”جس کا کوئی شخص مارا گیا ہو اسے دو باتوں میں سے کسی ایک کا اختیار ہے: یا تو معاف کر دے یا ( قصاص میں ) اسے قتل کرے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے ( کماسیأتی ) ، ۲- اس باب میں وائل بن حجر، انس، ابوشریح اور خویلد بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں۔",
          "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] dan [Yahya bin Musa] keduanya berkata; Telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah] telah menceritakan kepadaku [Abu Hurairah] ia berkata; Ketika Allah menaklukan Makkah atas RasulNya, beliau berdiri di hadapan manusia lalu beliau memuji Allah dan memujaNya kemudian beliau bersabda: \"Dan barangsiapa yang memiliki keluarga yang terbunuh maka ia memiliki dua pilihan yang baik, boleh ia memaafkan atau membunuh.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Wa`il bin Hujr, Anas, Abu Syuraih Khuwailid bin Amr",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: “Allah fethini Peygamberine nasip edince Allah’a hamd-ü sena ederek bir konuşma yaptı ve şöyle dedi: ''Her kimin bir yakını öldürülmüş ise o kimse iki görüşten birini seçmek durumundadır. Ya affedecek veya kısas yapılmasını isteyecektir.” Diğer tahric: Buhârî, Diyât; İbn Mâce, Diyât Tirmizî: Bu konuda Vâil b. Hucr, Enes, Ebû Şüreyh, Huveylid b. Amr’dan da hadis rivâyet edilmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 21
      },
      "narrator": {
        "en": "Abu Hurairah"
      }
    },
    {
      "hadithNumber": 1406,
      "arabicNumber": 1406,
      "book": 16,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ وَلَمْ يُحَرِّمْهَا النَّاسُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَسْفِكَنَّ فِيهَا دَمًا وَلاَ يَعْضِدَنَّ فِيهَا شَجَرًا فَإِنْ تَرَخَّصَ مُتَرَخِّصٌ فَقَالَ أُحِلَّتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَإِنَّ اللَّهَ أَحَلَّهَا لِي وَلَمْ يُحِلَّهَا لِلنَّاسِ وَإِنَّمَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ ثُمَّ هِيَ حَرَامٌ إِلَى يَوْمِ الْقِيَامَةِ ثُمَّ إِنَّكُمْ مَعْشَرَ خُزَاعَةَ قَتَلْتُمْ هَذَا الرَّجُلَ مِنْ هُذَيْلٍ وَإِنِّي عَاقِلُهُ فَمَنْ قُتِلَ لَهُ قَتِيلٌ بَعْدَ الْيَوْمِ فَأَهْلُهُ بَيْنَ خِيرَتَيْنِ إِمَّا أَنْ يَقْتُلُوا أَوْ يَأْخُذُوا الْعَقْلَ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَرَوَاهُ شَيْبَانُ أَيْضًا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ مِثْلَ هَذَا ‏.‏ - وَرُوِيَ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قُتِلَ لَهُ قَتِيلٌ فَلَهُ أَنْ يَقْتُلَ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الدِّيَةَ ‏\"‏ ‏.‏ وَذَهَبَ إِلَى هَذَا بَعْضُ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏",
        "translations": {
          "en": "Narrated Abu Shuraih Al-Ka'bi:that the Messenger of Allah (ﷺ) said: \"Indeed Allah made Makkah sacred, it was not made sacred by the people. Whoever believes in Allah, and the Last Day, then let them not shed blood in it, nor cut down any of its trees. If one tries to make an excuse by saying: 'It was made lawful for the Messenger of Allah (ﷺ)' then indeed Allah made it lawful for me but He did not make it lawful for the people, and it was only made lawful for me for an hour of a day. Then it is returned to being sacred until the Day of Judgement. Then, to you people of Khuza'ah who killed this man from Hudhail: I am his 'Aqil, so whomever (one of his relatives) is killed after today, then his people have two options; either they have him killed, or they take the blood-money from him",
          "ur": "ابوشریح کعبی رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مکہ کو اللہ نے حرمت والا ( محترم ) بنایا ہے، لوگوں نے اسے نہیں بنایا، پس جو شخص اللہ اور یوم آخرت پر ایمان رکھتا ہو وہ اس میں خونریزی نہ کرے، نہ اس کا درخت کاٹے، ( اب ) اگر کوئی ( خونریزی کے لیے ) اس دلیل سے رخصت نکالے کہ مکہ رسول اللہ صلی اللہ علیہ وسلم کے لیے حلال کیا گیا تھا ( تو اس کا یہ استدلال باطل ہے ) اس لیے کہ اللہ نے اسے میرے لیے حلال کیا تھا لوگوں کے لیے نہیں، اور میرے لیے بھی دن کے ایک خاص وقت میں حلال کیا گیا تھا، پھر وہ تاقیامت حرام ہے؟ اے خزاعہ والو! تم نے ہذیل کے اس آدمی کو قتل کیا ہے، میں اس کی دیت ادا کرنے والا ہوں، ( سن لو ) آج کے بعد جس کا بھی کوئی آدمی مارا جائے گا تو مقتول کے ورثاء کو دو چیزوں میں سے کسی ایک کا اختیار ہو گا: یا تو وہ ( اس کے بدلے ) اسے قتل کر دیں، یا اس سے دیت لے لیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ابوہریرہ رضی الله عنہ کی حدیث بھی حسن صحیح ہے، ۲- اسے شیبان نے بھی یحییٰ بن ابی کثیر سے اسی کے مثل روایت کیا ہے، ۳- اور یہ ( حدیث بنام ابوشریح کعبی کی جگہ بنام ) ابوشریح خزاعی بھی روایت کی گئی ہے۔ ( اور یہ دونوں ایک ہی ہیں ) اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، آپ نے فرمایا: ”جس کا کوئی آدمی مارا جائے تو اسے اختیار ہے یا تو وہ اس کے بدلے اسے قتل کر دے، یا معاف کر دے، یا دیت وصول کرے“، ۴- بعض اہل علم اسی طرف گئے ہیں، احمد اور اسحاق بن راہویہ کا یہی قول ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Ibnu Abu Dzi`b], telah menceritakan kepadaku [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al Ka'bi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah menyucikan Makkah namun manusia tidak menyucikannya. Barangsiapa yang beriman kepada Allah dan hari akhir, maka janganlah ia menumpahkan darah di dalamnya dan tidak menebangi pepohonannya.\" Beliau melanjutkan: \"Telah dihalalkan untuk Rasulullah shallallahu 'alaihi wasallam, karena sesungguhnya Allah telah menghalalkannya untukku, namun tidak dihalalkan untuk manusia. Dan sesungguhnya telah dihalalkan untukku sesaat pada siang hari kemudian hal itu menjadi haram hingga hari kiamat, setelah itu kalian akan dikumpulkan dalam keadaan saling mencela, kalian akan membunuh orang dari Hudzail ini, sedangkan aku yang melaksanakan diyatnya, Barangsiapa yang dibunuh setelah hari ini, maka keluarnya berhak atas pembunuh itu untuk memilih dua pilihan, yakni mereka membunuhnya atau mengambil diyat darinya.\" Abu 'Isa berkata; Hadits ini hasan shahih dan Hadits Abu Hurairah adalah hadits hasan shahih. Syaiban juga meriwayatkannya dari Yahya bin Abu Katsir seperti ini dan telah diriwayatkan dari Abu Syuraih Al Khuza'i dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang dibunuh, maka keluarnya berhak atas pembunuh itu untuk memilih antara membunuh, memaafkan, atau mengambil diyat.\" Dan inilah pendapat ulama, dan termasuk juga pendapat Ahmad dan Ishaq",
          "tr": "Ebû Şureyh el Ka’bî (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.) şöyle buyurmuştur: “Mekke’yi mukaddes kılan insanlar değil! Allah, mukaddes kılmıştır. Allah’a ve ahiret gününe inanan kimse orada asla kan dökmesin ve hiçbir ağacını da kesmesin. Rasûlullah (s.a.v.)’e fetih günü adam öldürmek mübah kılındı diyerek bir kimse öldürmeye ruhsat vermeye kalkışırsa dikkat edin onu muayyen bir zaman bana mübah kılmıştır herkese değil… Kıyamete kadar da haramlığı ve mukaddesliği devam edecektir. Siz ey Huzaa kabilesi insanları! Hüzeyl kabilesinden bu insanı öldürdünüz onun diyetini ben ödeyeceğim bundan sonra her kimin bir yakını öldürülürse onun ailesi iki şey arasında serbesttir. Ya katilin öldürülmesini tercih ederek kısas isterler veya diyet alırlar.” Diğer tahric: Müslim, Hac; Nesâî, Menasik Tirmizî: Bu hadis hasen sahihtir. Şeyban aynı şekilde Yahya b. ebî Kesîr benzerini rivâyet etmiştir. Ebû Şureyh el Huzâî’nin Peygamber (s.a.v.)’den şöyle aktardığı rivâyet edildi: “Her kimin bir yakını öldürülürse o kimse ya katilin kısasını ister veya affeder veya diyet alır.” Bazı ilim adamları bu görüşte olup Ahmed ve İshâk bunlardandır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 22
      },
      "narrator": {
        "en": "Abu Shuraih Al-Ka'bi"
      }
    },
    {
      "hadithNumber": 1407,
      "arabicNumber": 1407,
      "book": 16,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُتِلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدُفِعَ الْقَاتِلُ إِلَى وَلِيِّهِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا فَقَتَلْتَهُ دَخَلْتَ النَّارَ ‏\"‏ ‏.‏ فَخَلَّى عَنْهُ الرَّجُلُ ‏.‏ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ ‏.‏ قَالَ فَخَرَجَ يَجُرُّ نِسْعَتَهُ ‏.‏ قَالَ فَكَانَ يُسَمَّى ذَا النِّسْعَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالنِّسْعَةُ حَبْلٌ ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurairah:\"A man was killed during the time of the Messenger of Allah (ﷺ), so the killer was brought to the man's guardian. The killer said: 'O Messenger of Allah! By Allah! I did not mean to kill him.' So the Messenger of Allah (ﷺ) said: 'Then if what he is saying is true, and you kill him, you would enter the Fire.' So he let the man go.\" He said: \"His hands were bound behind him with a Nis'ah.\" He said: \"So he left, dragging his Nis'ah.\" [He said:] \"So he was called Dhan-Nis'ah",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک آدمی قتل کر دیا گیا، تو قاتل مقتول کے ولی ( وارث ) کے سپرد کر دیا گیا، قاتل نے عرض کیا: اللہ کے رسول! اللہ کی قسم! میں نے اسے قصداً قتل نہیں کیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خبردار! اگر وہ ( قاتل ) اپنے قول میں سچا ہے پھر بھی تم نے اسے قتل کر دیا تو تم جہنم میں جاؤ گے ۱؎“، چنانچہ مقتول کے ولی نے اسے چھوڑ دیا، وہ آدمی رسی سے بندھا ہوا تھا، تو وہ رسی گھسیٹتا ہوا باہر نکلا، اس لیے اس کا نام ذوالنسعہ ( رسی یا تسمے والا ) رکھ دیا گیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اور «نسعہ» : رسی کو کہتے ہیں۔",
          "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Ada seseorang terbunuh pada zaman Nabi shallallahu 'alaihi wasallam lalu pembunuh itu diserahkan kepada wali yang dibunuh. Pembunuh berkata; Wahai Rasulullah, demi Allah, aku tidak bermaksud membunuhnya. Maka Rasulullah shallallahu 'alaihi wasallam mengatakan: \"Jika perkataannya benar lalu engkau membunuhnya, maka engkau akan masuk neraka.\" Lalu walinya melepasnya. Abu Hurairah berkata; Ketika itu tangan si pembunuh terikat ke belakang dengan tali dari kulit, ia melanjutkan; Lalu ia pergi dengan menyeret tali tersebut. Ia berkata; Setelah itu ia dipanggil dengan orang yang memiliki tali kulit. Abu 'Isa berkata; Hadits ini hasan shahih. An Nis'ah artinya tali",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) zamanında bir adam öldürüldü, katil maktulün velisine teslim edildi. Katil: “Ey Allah’ın Rasûlü onu öldürmek istememiştim” dedi. Bunun üzerine Rasûlullah (s.a.v.) maktulün velisine şöyle buyurdu: “Dikkat et o doğru söylüyorsa ve buna rağmen sen de onu öldürürsen cehenneme girersin!” Adam da katili serbest bıraktı. Katilin elleri arkadan bağlı idi bunun üzerine bağlı bulunduğu kayışını sürükleyerek çıkıp gitti de bu adama bundan böyle kayışlı kimse denildi. Diğer tahric: Ebû Dâvûd, Diyât; İbn Mâce, Diyât Tirmizî: Bu hadis hasen sahihtir. “Nis’a” = ip ve urgan demektir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 23
      },
      "narrator": {
        "en": "Abu Hurairah"
      }
    },
    {
      "hadithNumber": 1408,
      "arabicNumber": 1408,
      "book": 16,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا بَعَثَ أَمِيرًا عَلَى جَيْشٍ أَوْصَاهُ فِي خَاصَّةِ نَفْسِهِ بِتَقْوَى اللَّهِ وَمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ خَيْرًا فَقَالَ ‏ \"‏ اغْزُوا بِسْمِ اللَّهِ وَفِي سَبِيلِ اللَّهِ قَاتِلُوا مَنْ كَفَرَ بِاللَّهِ اغْزُوا وَلاَ تَغُلُّوا وَلاَ تَغْدِرُوا وَلاَ تُمَثِّلُوا وَلاَ تَقْتُلُوا وَلِيدًا ‏\"‏ ‏.‏ وَفِي الْحَدِيثِ قِصَّةٌ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَشَدَّادِ بْنِ أَوْسٍ وَعِمْرَانَ بْنِ حُصَيْنٍ وَأَنَسٍ وَسَمُرَةَ وَالْمُغِيرَةِ وَيَعْلَى بْنِ مُرَّةَ وَأَبِي أَيُّوبَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ بُرَيْدَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَكَرِهَ أَهْلُ الْعِلْمِ الْمُثْلَةَ ‏.‏",
        "translations": {
          "en": "Narrated Buraidah:from his father who said: \"Whenever the Messenger of Allah (ﷺ) dispatched a commander of an army he would exhort him personally; that he should have Taqwa of Allah, and regarding those of the Muslims who are with him; that he should be good to them. He would say: 'Fight in the Name of Allah and in Allah's curse. Fight those who disbelieve in Allah and fight, do not be treacherous, nor mutilate, nor kill a child",
          "ur": "بریدہ رضی الله عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کسی لشکر پر امیر مقرر کر کے بھیجتے تو خاص طور سے اسے اپنے بارے میں اللہ سے ڈرنے کی وصیت فرماتے، اور جو مسلمان اس کے ساتھ ہوتے انہیں بھلائی کی وصیت کرتے، چنانچہ آپ نے فرمایا: ”اللہ کے نام سے اس کے راستے میں جہاد کرو، جو کفر کرے اس سے لڑو، جہاد کرو، مگر مال غنیمت میں خیانت نہ کرو، بدعہدی نہ کرو، مثلہ ۱؎ نہ کرو اور نہ کسی بچے کو قتل کرو“، حدیث میں کچھ تفصیل ہے ۲؎۔ امام ترمذی کہتے ہیں: ۱- بریدہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن مسعود، شداد بن اوس، عمران بن حصین، انس، سمرہ، مغیرہ، یعلیٰ بن مرہ اور ابوایوب سے بھی احادیث آئی ہیں، ۳- اہل علم نے مثلہ کو حرام کہا ہے۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari ['Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam jika mengutus pimpinan pasukan, beliau memberi wasiat khusus untuk dirinya untuk bertaqwa kepada Allah dan wasiat kebaikan kepada kaum muslimin yang bersamanya. Beliau bersabda: \"Berperanglah dengan nama Allah dan di Jalan Allah, perangilah orang yang kafir, berperanglah dan janganlah melampaui batas, berkhianat, memutilasi dan janganlah membunuh anak-anak.\" Dalam hadits ini terdapat kisah. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Mas'ud, Syaddad bin Aus, Imran bin Hushain, Anas, Samurah, Al Mughirah, Ya'la bin Murrah dan Abu Ayyub. Abu 'Isa berkata; Hadits Buraidah adalah hadits hasan shahih. Para ulama memakruhkan Al Mutslah",
          "tr": "Büreyde (r.a.)’in babasından rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.), bir orduya komutan göndereceğinde ona şu şekilde tavsiyede bulunurdu: “Allah’a karşı sorumluluk bilincinde olmayı beraberindeki Müslüman askerlere iyi davranmayı söyler şöyle buyurdu: Allah adıyla Allah yolunda savaşın Allah’tan gelen gerçekleri örtbas eden kafirlerle savaşın! Savaşın; fakat hainlik yapmayın öldürdüğünüz kimselerin gözünü oyup kulak ve burunlarını kesmeyin çocukları öldürmeyin…” Bu hadis uzuncadır. Diğer tahric: Ebû Dâvûd, Cihâd Tirmizî: Bu konuda Abdullah b. Mes’ûd’tan, Şeddâd b. Evs’den, Imrân b. Husayn’dan, Enes’den, Semure’den, Muğîre’den, Ya’la b. Mürre’den ve Ebû Eyyûb’den de hadis rivâyet edilmiştir. Tirmizî: Büreyde hadisi hasen sahih olup ilim adamları savaşta düşman askerlerinin gözünü oyup kulak ve burunlarını kesmeyi hoşgörmezler"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 24
      },
      "narrator": {
        "en": "Buraidah"
      }
    },
    {
      "hadithNumber": 1409,
      "arabicNumber": 1409,
      "book": 16,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ شَدَّادِ بْنِ أَوْسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ وَلْيُرِحْ ذَبِيحَتَهُ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ أَبُو الأَشْعَثِ الصَّنْعَانِيُّ اسْمُهُ شُرَحْبِيلُ بْنُ آدَةَ ‏.‏",
        "translations": {
          "en": "Narrated Shaddad bin Aws:that the Prophet (ﷺ) said: \"Indeed Allah has decreed Ihsan in everything. So when you kill, then do the killing well, and when you slaughter, then do the slaughtering well. Let one of you sharpen his blade, and let him comfort his animal (before slaughtering)",
          "ur": "شداد بن اوس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بیشک اللہ نے ہر کام کو اچھے طریقے سے کرنا ضروری قرار دیا ہے، لہٰذا جب تم قتل ۱؎ کرو تو اچھے طریقے سے قتل کرو، اور جب تم ذبح کرو تو اچھے طریقے سے ذبح کرو، تمہارے ہر آدمی کو چاہیئے کہ اپنی چھری تیز کر لے اور اپنے ذبیحہ کو آرام پہنچائے“ ۲؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dari [Abu Al Asy'ats Ash Shan'ani] dari [Syaddad bin Aus] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mewajibkan berbuat baik kepada segala sesuatu, jika kalian membunuh maka bunuhlah secara baik, dan jika kalian menyembelih maka sembelihlah secara baik, dan hendaklah salah seorang dari kalian menajamkan pisaunya serta memberikan kenyamanan (tidak menyiksa) kepada sembelihannya.\" Ia mengatakan; Hadits ini hasan shahih. Abu Al Asy'ats Ash Shan'ani bernama Syarahbil bin Adah",
          "tr": "Şeddâd b. Evs (r.a.)’den rivâyet edildiğine göre, Nebi (s.a.v.) şöyle buyurmuştur: “Allah, her işte iyi davranmayı emretmiştir, öldürdüğünüzde bile en az acı verecek şekilde öldürün hayvan boğazlayacağınızda hayvana fazla ızdırab verecek şekilde değil kolay bir şekilde kesin bıçağınızı bileyin ve hayvana fazla acı vermeyin.” Diğer tahric: Nesâî, Dehaya; Müslim, Sayd Tirmizî: Bu hadis hasen sahihtir. Ebûl Eş’as es San’ani’nin ismi Şurahbil b. Üdde’dir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 25
      },
      "narrator": {
        "en": "Shaddad bin Aws"
      }
    },
    {
      "hadithNumber": 1410,
      "arabicNumber": 1410,
      "book": 16,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ الْكُوفِيُّ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنِينِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ‏.‏ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ أَنُعْطِي مَنْ لاَ شَرِبَ وَلاَ أَكَلَ وَلاَ صَاحَ فَاسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلُّ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ هَذَا لَيَقُولُ بِقَوْلِ شَاعِرٍ بَلْ فِيهِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنْ حَمَلِ بْنِ مَالِكِ بْنِ النَّابِغَةِ وَالْمُغِيرَةِ بْنِ شُعْبَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏ وَقَالَ بَعْضُهُمُ الْغُرَّةُ عَبْدٌ أَوْ أَمَةٌ أَوْ خَمْسُمِائَةِ دِرْهَمٍ ‏.‏ وَقَالَ بَعْضُهُمْ أَوْ فَرَسٌ أَوْ بَغْلٌ ‏.‏",
        "translations": {
          "en": "Narrated Abu Hurairah:\"The Messenger of Allah (ﷺ) judged that a Ghurrah male slave or female slave be given in the case of a fetus. The one of the judgement was made against said: 'Should we give something for one who did not drink, not eat, nor cry out to shed a tear, the likes of which is useless?' So the Prophet (ﷺ) said: 'This is the speech of a poet. Rather it requires a Ghurrah: a male slave or a female slave",
          "ur": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «جنين» ( حمل ) کی دیت میں «غرة» یعنی غلام یا لونڈی ( دینے ) کا فیصلہ کیا، جس کے خلاف فیصلہ کیا گیا تھا وہ کہنے لگا: کیا ایسے کی دیت دی جائے گی، جس نے نہ کچھ کھایا نہ پیا، نہ چیخا، نہ آواز نکالی، اس طرح کا خون تو ضائع اور باطل ہو جاتا ہے، ( یہ سن کر ) نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”یہ شاعروں والی بات کر رہا ہے ۱؎، «جنين» ( حمل گرا دینے ) کی دیت میں «غرة» یعنی غلام یا لونڈی دینا ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں حمل بن مالک بن نابغہ اور مغیرہ بن شعبہ سے احادیث آئی ہیں، ۳- اہل علم کا اسی پر عمل ہے، ۴- غرہ کی تفسیر بعض اہل علم نے، غلام، لونڈی یا پانچ سو درہم سے کی ہے، ۵- اور بعض اہل علم کہتے ہیں: «غرة» سے مراد گھوڑا یا خچر ہے۔",
          "id": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi Al Kufi], telah menceritakan kepada kami [Ibnu Abu Za`idah] dari [Muhammad bin Amr] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memutuskan untuk janin dengan ghurrah yaitu berupa seorang budak laki-laki atau wanita. Lalu orang yang mendapat keputusan itu berkata; Apakah orang yang tidak minum, makan atau menangis serta berteriak dikenakan diyat, hal seperti itu adalah sesuatu yang dibatalkan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang ini mengatakan dengan perkataan penyair, bahkan diyat untuk janin adalah ghurrah berupa seorang budak laki-lai atau wanita.\" Dalam hal ini ada hadits serupa dari Hamal bin Malik bin An Nabighah dan Al Mughirah bin Syu'bah. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih dan menjadi pedoman amal menurut para ulama. Sebagian ulama berpendapat; Al Ghurrah yaitu berupa seorang budak laki-laki atau wanita atau sebesar lima ratus dirham, sebagian lainnya berpendapat; Atau berupa seekor kuda perang atau keledai",
          "tr": "Ebû Hureyre (r.a.)’den rivâyete göre, Rasûlullah (s.a.v.): “Ana karnındaki çocuğun düşürülmesine sebep olan kimseye ceza olarak erkek köle veya cariye verilmesini emretti.” Kendisine bu ceza verilen adam dedi ki: “Yemeyen, içmeyen ses çıkarmayan bir çocuk için diyet mi? Vereceğiz bu tip şeylerde bir şey vermek gerekmez” deyince; Rasûlullah (s.a.v.): ”Bu adam şair gibi konuşuyor. Evet Cenin’de gurre yani bir köle ve cariye vermek gerekir.” Diğer tahric: Nesâî, Kasame; Müslim, Kasame Tirmizî: Bu konuda Hamel İbn Mâlik b. Nabiğa ve Muğîre b. Şu’be’den de hadis rivâyet edilmiştir. Tirmizî: Ebû Hüreyre hadisi hasen sahihtir. ilim adamlarının uygulaması bu hadise göre olup bazıları derler ki: Gurre: Erkek köle veya cariye veya beşyüz dirhem paradır dediler. Kimi ilim adamları da at veya katırdır demişlerdir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 26
      },
      "narrator": {
        "en": "Abu Hurairah"
      }
    },
    {
      "hadithNumber": 1411,
      "arabicNumber": 1411,
      "book": 16,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عُبَيْدِ بْنِ نَضْلَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّ امْرَأَتَيْنِ، كَانَتَا ضَرَّتَيْنِ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ أَوْ عَمُودِ فُسْطَاطٍ فَأَلْقَتْ جَنِينَهَا فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْجَنِينِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ وَجَعَلَهُ عَلَى عَصَبَةِ الْمَرْأَةِ ‏.‏ قَالَ الْحَسَنُ وَأَخْبَرَنَا زَيْدُ بْنُ حُبَابٍ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، بِهَذَا الْحَدِيثِ نَحْوَهُ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated Al-Mughirah bin Shu'bah:\"Two women co-wives, (were fighting), and one of them hit the other with a stone or a tent post, causing her to have a miscarriage. The Messenger of Allah (ﷺ) judged that a Ghurrah male or female slave should be given for fetus, and he required it from the Asabah of the woman.\" (Another Chain) for this Hadith [and it is similar to this]",
          "ur": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ دو عورتیں سوکن تھیں، ان میں سے ایک نے دوسری کو پتھر یا خیمے کی میخ ( گھونٹی ) سے مارا، تو اس کا حمل ساقط ہو گیا، رسول اللہ صلی اللہ علیہ وسلم نے اس حمل کی دیت میں «غرة» یعنی غلام یا لونڈی دینے کا فیصلہ فرمایا اور دیت کی ادائیگی اس عورت کے عصبہ کے ذمہ ٹھہرائی ۱؎۔ حسن بصری کہتے ہیں: زید بن حباب نے سفیان ثوری سے روایت کی، اور سفیان ثوری نے منصور سے اس حدیث کو اسی طرح روایت کی ہے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal], telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Ibrahim] dari [Ubaid bin Nadllah] dari [Al Mughirah bin Syu'bah] bahwa ada dua orang wanita yang dipoligami, salah satunya melempar kepada yang lainnya dengan batu atau tiang tenda lalu ia pun membunuh janinnya. Kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan untuk diyat janin satu ghurrah yaitu berupa seorang budak laki-laki atau wanita dan menjadikan diyatnya sebagai tanggungan 'ashabah wanita yang membunuh. [Al Hasan] berkata; Dan telah mengabarkan kepada kami [Zaid bin Hubab] dari [Sufyan] dari [Manshur] dengan hadis ini seperi itu. Ia mengatakan; Hadits ini hasan shahih",
          "tr": "Muğîre b. Şu’be (r.a.)’den rivâyet edilmiştir. İki kadın bir erkeğin nikahında (kuma) idiler. Biri diğerine taş veya çadır direği atarak karnındaki ceninin düşmesine sebep oldu. Bunun için Rasûlullah (s.a.v.), düşürülen cenin için gurre yani bir köle veya cariye verilmesi hükmünü verdi, ödeme o kadının erkek akrabalarına yüklendi. Diğer tahric: Buhârî, Diyat; Müslim, Kasame Hasan diyor ki: Zeyd b. Hubab, Sûfyân vasıtasıyla Mansur’dan bu hadisin bir benzerini bize aktarmıştır. Tirmizî: Bu hadis hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Muslim"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 27
      },
      "narrator": {
        "en": "Al-Mughirah bin Shu'bah"
      }
    },
    {
      "hadithNumber": 1412,
      "arabicNumber": 1412,
      "book": 16,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا مُطَرِّفٌ، عَنِ الشَّعْبِيِّ، حَدَّثَنَا أَبُو جُحَيْفَةَ، قَالَ قُلْتُ لِعَلِيٍّ يَا أَمِيرَ الْمُؤْمِنِينَ هَلْ عِنْدَكُمْ سَوْدَاءُ فِي بَيْضَاءَ لَيْسَ فِي كِتَابِ اللَّهِ قَالَ لاَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عَلِمْتُهُ إِلاَّ فَهْمًا يُعْطِيهِ اللَّهُ رَجُلاً فِي الْقُرْآنِ وَمَا فِي الصَّحِيفَةِ ‏.‏ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ فِيهَا الْعَقْلُ وَفِكَاكُ الأَسِيرِ وَأَنْ لاَ يُقْتَلَ مُؤْمِنٌ بِكَافِرٍ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَاقَ قَالُوا لاَ يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ يُقْتَلُ الْمُسْلِمُ بِالْمُعَاهِدِ ‏.‏ وَالْقَوْلُ الأَوَّلُ أَصَحُّ ‏.‏",
        "translations": {
          "en": "Abu Juhaifah said:\"I said to 'Ali: O Commander of the Believers! Do you have anything written that is not in Allah's Book?' He said: 'By the One Who splits the seed and creates the soul, I have not learned from it except what understanding of the Qur'an Allah gives to a man, and what is in this sheet of paper.' I said: 'What is in the paper?' He said: 'It is the 'Aql, the (ransom for) release of captives, and the judgement that no believer is killed for a disbeliever",
          "ur": "ابوجحیفہ کہتے ہیں کہ میں نے علی رضی الله عنہ سے پوچھا کیا ۱؎: امیر المؤمنین! کیا آپ کے پاس کاغذ میں لکھی ہوئی کوئی ایسی تحریر ہے جو قرآن میں نہیں ہے؟ انہوں نے کہا: نہیں، اس ذات کی قسم جس نے دانے کو پھاڑا اور جان کو پیدا کیا! میں سوائے اس فہم و بصیرت کے جسے اللہ تعالیٰ قرآن کے سلسلہ میں آدمی کو نوازتا ہے اور اس صحیفہ میں موجود چیز کے کچھ نہیں جانتا، میں نے پوچھا: صحیفہ میں کیا ہے؟ کہا: اس میں دیت، قید یوں کے آزاد کرنے کا ذکر اور آپ کا یہ فرمان ہے: ”مومن کافر کے بدلے قتل نہیں کیا جائے گا“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- علی رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبداللہ بن عمرو رضی الله عنہما سے بھی روایت ہے، ۳- بعض اہل علم کے نزدیک اسی پر عمل ہے، سفیان ثوری، مالک بن انس، شافعی، احمد اور اسحاق بن راہویہ کا یہی قول ہے، یہ لوگ کہتے ہیں: مومن کافر کے بدلے نہیں قتل کیا جائے گا، ۴- اور بعض اہل علم کہتے ہیں: ذمی کے بدلے بطور قصاص مسلمان کو قتل کیا جائے گا، لیکن پہلا قول زیادہ صحیح ہے۔",
          "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Husyaim] telah memberitakan kepada kami [Mutharrif] dari [Asy Sya'bi], telah menceritakan kepada kami [Abu Juhaifah] ia berkata; Aku bertanya kepada [Ali]; Wahai Amirul Mukminin, apakah anda memiliki catatan hitam di atas putih (wahyu) yang tidak ada di dalam kitabullah? Ia menjawab; Tidak, demi Dzat yang menciptakan biji-bijian (menjadi tanaman) dan menciptakan jiwa (semua makhluk hidup pasti bernyawa), aku tidak mengetahuinya kecuali pemahaman yang Allah berikan kepada seseorang di dalam Al Qur`an dan mushaf. Aku bertanya; Apa yang ada di mushaf itu? ia menjawab; Akal. Dan agar orang mukmin tidak dibunuh oleh orang kafir. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Amru. Abu Isa berkata; Hadits Ali adalah haidts hasan shahih dan menjadi pedoman amal menurut sebagian ulama, yaitu pendapat Sufyan Ats Tsauri, Malik bin Anas, Asy Syafi'i, Ahmad dan Ishaq, mereka berpendapat; Orang mukmin tidak dibunuh karena membunuh orang kafir, sedangkan sebagian ulama lain berpendapat; Orang mukmin dibunuh karena membunuh orang kafir yang terikat dengan perjanjian. Pendapat pertama adalah lebih shahih",
          "tr": "Ebû Cuhayfe (r.a.)’den rivâyete göre, şöyle demiştir: Ali’ye, Ey Mü’minlerin lideri dedim: Allah’ın kitabında olmayan fakat senin not ettiklerin arasında bildiğin şeylerden bahseder misin? Dedi ki: Ekinleri ve her türlü tohumları yayarak bitkileri bitiren ve canlıları yaratan hakkı için bildiğim şey: Allah’ın bir kişiyi Kur’ân’da anlayışlı kılmasından ve yazılı kağıtta bulunandan ibarettir. Ben de yazılı kağıtta ne var? Diye sordum. Dedi ki: Onda diyetin hükümleri, esirin kurtarılması kafir karşılığında kısas olarak bir mü’minin öldürülmemesi vardır.” Diğer tahric: Buhârî, Diyât Tirmizî: Bu konuda Abdullah b. Amr’dan da hadis rivâyet edilmiştir. Tirmizî: Ali hadisi hasen sahihtir. Bazı ilim adamlarının uygulaması bu hadise göredir. Sûfyân es Sevrî, Mâlik b. Enes, Şâfii, Ahmed ve İshâk bunlardan olup şöyle derler: “Bir mü’min, kafir karşılığında öldürülmez.” Bazı ilim adamları ise: “İslam devletinin veya bir Müslüman’ın emanında olan kafir bir kimse öldürülürse; öldüren Müslüman o öldürülen kimse karşılığında öldürülür.”"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih Bukhari"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 1413,
      "arabicNumber": 1413,
      "book": 16,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا عِيسَى بْنُ أَحْمَدَ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ ‏\"‏ ‏.‏ وَبِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ دِيَةُ عَقْلِ الْكَافِرِ نِصْفُ دِيَةِ عَقْلِ الْمُؤْمِنِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ ‏.‏ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي دِيَةِ الْيَهُودِيِّ وَالنَّصْرَانِيِّ فَذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ فِي دِيَةِ الْيَهُودِيِّ وَالنَّصْرَانِيِّ إِلَى مَا رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ دِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ نِصْفُ دِيَةِ الْمُسْلِمِ ‏.‏ وَبِهَذَا يَقُولُ أَحْمَدُ بْنُ حَنْبَلٍ وَرُوِيَ عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ دِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ أَرْبَعَةُ آلاَفِ دِرْهَمٍ وَدِيَةُ الْمَجُوسِيِّ ثَمَانُمِائَةِ دِرْهَمٍ ‏.‏ وَبِهَذَا يَقُولُ مَالِكُ بْنُ أَنَسٍ وَالشَّافِعِيُّ وَإِسْحَاقُ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ دِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ مِثْلُ دِيَةِ الْمُسْلِمِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏",
        "translations": {
          "en": "Narrated 'Amr bin Shu'aib:from his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The Muslim is not killed for disbeliever.\" And with this chain, it has been narrated that the Prophet (ﷺ) said: \"The blood-money paid for disbeliever is half of the blood-money paid for a believer",
          "ur": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان کافر کے بدلے قصاص میں قتل نہیں کیا جائے گا“، اور اسی سند سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کافر کی دیت مومن کی دیت کا نصف ہے“۔ امام ترمذی کہتے ہیں: ۱- اس باب میں عبداللہ بن عمرو رضی الله عنہما کی حدیث حسن ہے، ۲- یہودی اور نصرانی کی دیت میں اہل علم کا اختلاف ہے، یہودی اور نصرانی کی دیت کی بابت بعض اہل علم کا مسلک نبی اکرم صلی اللہ علیہ وسلم سے مروی حدیث کے موافق ہے، ۳- عمر بن عبدالعزیز کہتے ہیں: یہودی اور نصرانی کی دیت مسلمان کی دیت کا نصف ہے، احمد بن حنبل اسی کے قائل ہیں۔",
          "id": "Telah menceritakan kepada kami [Isa bin Ahmad], telah menceritakan kepada kami [Ibnu Wahb] dari [Usamah bin Zaid] dari [Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang mukmin tidak dibunuh karena membunuh orang kafir.\" Dengan sanad yang sama juga diriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Diyat orang kafir adalah setengah diyat orang mukmin.\" Abu Isa berkata; Hadits Abdullah bin Amr dalam hal ini adalah hadits hasan, para ulama berselisih pendapat tentang diyat orang yahudi dan nashrani. Sebagian ulama berpendapat tentang diyat orang yahudi dan nashrani kepada apa yang telah diriwayatkan dari Nabi shallallahu 'alaihi wasallam. Umar bin Abdul Aziz berpendapat; Diyat orang yahudi dan nashrani adalah setengah diyat orang muslim. Dan Ahmad bin Hanbal juga berpendapat demikian dan diriwayatkan dari Umar bin Al Khaththab bahwa ia mengatakan; Diyat orang Yahudi dan nashrani adalah empat ribu dirham, sedangkan diyat orang Majusi adalah delapan ratus dirham. Malik bin Anas, Asy Syafi'i dan Ishaq berpendapat dengan pendapat ini sedangkan sebagian ulama berpendapat; Diyat orang Yahudi dan Nashrani adalah seperti diyat orang muslim, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah",
          "tr": "Amr b. Şuayb (radıyallahü anh)’in babasından ve dedesinden rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: “Bir Müslüman, bir kafir karşılığında kısas yapılarak öldürülmez.”"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 29
      },
      "narrator": {
        "en": "'Amr bin Shu'aib"
      }
    },
    {
      "hadithNumber": 1414,
      "arabicNumber": 1414,
      "book": 16,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ مِنَ التَّابِعِينَ مِنْهُمْ إِبْرَاهِيمُ النَّخَعِيُّ إِلَى هَذَا وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْهُمُ الْحَسَنُ الْبَصْرِيُّ وَعَطَاءُ بْنُ أَبِي رَبَاحٍ لَيْسَ بَيْنَ الْحُرِّ وَالْعَبْدِ قِصَاصٌ فِي النَّفْسِ وَلاَ فِيمَا دُونَ النَّفْسِ ‏.‏ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَاقَ ‏.‏ وَقَالَ بَعْضُهُمْ إِذَا قَتَلَ عَبْدَهُ لاَ يُقْتَلُ بِهِ وَإِذَا قَتَلَ عَبْدَ غَيْرِهِ قُتِلَ بِهِ ‏.‏ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ ‏.‏",
        "translations": {
          "en": "Narrated Samurah:that the Messenger of Allah (ﷺ) said: \"Whoever kills his slave, then we will kill him, and whoever maims his slave, then we will maim him",
          "ur": "سمرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو اپنے غلام کو قتل کرے گا ہم بھی اسے قتل کر دیں گے اور جو اپنے غلام کا کان، ناک کاٹے گا ہم بھی اس کا کان، ناک کاٹیں گے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- تابعین میں سے بعض اہل علم کا یہی مسلک ہے، ابراہیم نخعی اسی کے قائل ہیں، ۳- بعض اہل علم مثلاً حسن بصری اور عطا بن ابی رباح وغیرہ کہتے ہیں: آزاد اور غلام کے درمیان قصاص نہیں ہے، ( نہ قتل کرنے میں، نہ ہی قتل سے کم زخم پہنچانے ) میں، احمد اور اسحاق بن راہویہ کا یہی قول ہے، ۴- بعض اہل علم کہتے ہیں: اگر کوئی اپنے غلام کو قتل کر دے تو اس کے بدلے اسے قتل نہیں کیا جائے گا، اور جب دوسرے کے غلام کو قتل کرے گا تو اسے اس کے بدلے میں قتل کیا جائے گا، سفیان ثوری اور اہل کوفہ کا یہی قول ہے۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Al Hasan] dari [Samurah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh budaknya maka kami akan membunuhnya, barangsiapa memotong tubuh budaknya maka kami akan memotongnya.\" Abu Isa berkata; Hadits ini hasan gharib. Sebagian ulama dari kalangan tabi'in seperti Ibrahim An Nakha'i berpendapat seperti ini namun sebagian ulama seperti Al Hasan Al Bashri dan 'Atha` bin Abu Rabah berpendapat; Tidak ada qishash terhadap jiwa antara orang merdeka dan budak, juga tidak pada selain jiwa. Ini menjadi pendapat Ahmad dan Ishaq, sedangkan sebagian dari mereka berpendapat; Jika ia membunuh budaknya maka ia tidak dibunuh karenanya, namun jika ia membunuh budak orang lain maka ia dibunuh karenanya, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah",
          "tr": "Semure (r.a.)’den rivâyete göre, şöyle demiştir: Rasûlullah (s.a.v.) şöyle buyurmuştur: “Kim kölesini öldürürse onu öldürünüz kim de kölesinin organlarını keserse biz de onun organlarını keseriz.” Diğer tahric: Ebû Dâvûd, Diyât; Nesâî, Kasame Tirmizî: Bu hadis hasen garibtir. Tabiinden bazı ilim adamlarının uygulaması bu hadise göre olup İbrahim Nehaî bunlardandır. Bazı ilim adamları ise: Hür ile köle arasında can meselesinde ve organlar meselesinde kısas yoktur.” Hasan Basrî, Ata b. ebî Rebah, Ahmed ve İshak bunlardandır. Bir kısım âlimler de: “Kişi kendi kölesini öldürürse kısas yapılmaz, başkasının kölesini öldürürse kısas yapılır” derler. Sûfyân es Sevrî ve Küfeliler bunlardandır"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Daif"
        },
        {
          "name": "Al-Albani",
          "grade": "Daif"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 30
      },
      "narrator": {
        "en": "Samurah"
      }
    },
    {
      "hadithNumber": 1415,
      "arabicNumber": 1415,
      "book": 16,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، وَأَحْمَدُ بْنُ مَنِيعٍ، وَأَبُو عَمَّارٍ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ، كَانَ يَقُولُ الدِّيَةُ عَلَى الْعَاقِلَةِ وَلاَ تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا شَيْئًا ‏.‏ حَتَّى أَخْبَرَهُ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلاَبِيُّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَيْهِ ‏ \"‏ أَنْ وَرِّثِ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ ‏.‏",
        "translations": {
          "en": "Narrated Sa'eed bin Al-Musayyab:that 'Umar would say: \"The blood-money upon the tribe, and the wife does not inherit any of her husband's blood-money.\" Until Ad-Dahhak bin Sufyan Al-Kulabi informed him that the Messenger of Allah (ﷺ) wrote to me, that Ashaim Ad-Dibabi's wife inherited the blood-money of her husband",
          "ur": "سعید بن مسیب سے روایت ہے کہ عمر رضی الله عنہ کہتے تھے: دیت کی ادائیگی عاقلہ ۱؎ پر ہے، اور بیوی اپنے شوہر کی دیت سے میراث میں کچھ نہیں پائے گی، یہاں تک کہ ان کو ضحاک بن سفیان کلابی نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں ایک فرمان لکھا تھا: ”اشیم ضبابی کی بیوی کو اس کے شوہر کی دیت سے میراث دو“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اہل علم کا اسی پر عمل ہے۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], [Ahmad bin Mani'], [Abu 'Ammar] dan masih banyak lagi, mereka mengatakan; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] bahwa Umar pernah berkata; Diyat itu menjadi hak keluarga (kerabat) orang yang dibunuh, dan seorang isteri tidak mewarisi diyat suaminya sedikitpun, hingga [Adl Dlahhak bin Sufyan Al Kilabi] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepadanya berbunyi: \"Berilah warisan kepada seorang isteri Asyyam Adl Dlababi dari diyat suaminya.\" Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama",
          "tr": "Saîd b. Müseyyeb (r.a.)’den rivâyet edildiğine göre Ömer: “Diyet baba tarafından akrabalar üzerinedir, kadın kocasının diyetinden miras olarak bir şey almaz” derdi. Dahhâk b. Sûfyân el Kılâbî kendisine Rasûlullah (s.a.v.)’in Ûşeym ed-Dababî’nin karısını kocasının diyetinden dolayı mirasçı yap diye yazdığını Ömer’e bildirdi. Diğer tahric: İbn Mâce, Diyât; Ebû Dâvûd, Feraiz Tirmizî: Bu hadis hasen sahihtir. İlim adamlarının uygulaması bu hadise göredir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 31
      },
      "narrator": {
        "en": "Sa'eed bin Al-Musayyab"
      }
    },
    {
      "hadithNumber": 1416,
      "arabicNumber": 1416,
      "book": 16,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى، يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ فَنَزَعَ يَدَهُ فَوَقَعَتْ ثَنِيَّتَاهُ فَاخْتَصَمُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ لاَ دِيَةَ لَكَ ‏\"‏ ‏.‏ فَأَنْزَلَ اللَّهُ ‏(‏وَالْجُرُوحَ قِصَاصٌ ‏)‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ يَعْلَى بْنِ أُمَيَّةَ وَسَلَمَةَ بْنِ أُمَيَّةَ وَهُمَا أَخَوَانِ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عِمْرَانَ بْنِ حُصَيْنٍ حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated 'Imran bin Husain:\"A man bit the hand of another man. The man who was bitten pulled his hand out, causing two of his incisors (teeth) to fall out. They brought their case of the Prophet (ﷺ). So he said: \"One of you bites his brother like the stallion bites? There is no blood-money for you.' So Allah Most High revealed: Wounds, equal for equal",
          "ur": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ ایک آدمی نے ایک آدمی کا ہاتھ کاٹ کھایا، اس نے اپنا ہاتھ کھینچا تو دانت کاٹنے والے کے دونوں اگلے دانت ٹوٹ گئے، وہ دونوں نبی اکرم صلی اللہ علیہ وسلم کے پاس اپنا معاملہ لے گئے تو آپ نے فرمایا: ”تم میں سے کوئی اپنے بھائی کو اونٹ کے کاٹنے کی طرح کاٹ کھاتا ہے، تمہارے لیے کوئی دیت نہیں، پھر اللہ نے یہ آیت نازل کی: «والجروح قصاص» ۱؎۔ امام ترمذی کہتے ہیں: ۱- عمران بن حصین رضی الله عنہ کی حدیث حسن صحیح ہے، ۲ – اس باب میں یعلیٰ بن امیہ اور سلمہ بن امیہ رضی الله عنہما سے بھی احادیث آئی ہیں اور یہ دونوں بھائی ہیں۔",
          "id": "Telah menceritakan kepada kami [Ali bin Khasyram], telah memberitakan kepada kami [Isa bin Yunus] dari [Syu'bah] dari [Qatadah] ia berkata; Aku mendengar [Zurarah bin Aufa] menceritakan dari [Imran bin Hushain] bahwa ada seseorang yang menggigit tangan orang lain, maka orang yang digigit tangannya itu menarik kedua tangannya sehingga tanggallah kedua gigi depan si penggigit tersebut. Maka keduanya saling mengadu kepada Nabi shallallahu 'alaihi wasallam, dan beliau menjawab, \"Salah seorang dari kalian menggigit saudaranya, seperti halnya unta yang menggigit (temannya), maka tidak ada diyat bagimu.\" Kemudian turunlah ayat, \"WAL JURUHA QISHAH\" (dan luka-luka pun ada qishasnya) (QS. Al Maidah: 45) Ia mengatakan; Dalam hal ini ada hadits serupa dari Ya'la bin Umayyah dan Salamah bin Umayyah keduanya bersaudara. Abu 'Isa berkata; Hadits Imran bin Hushain adalah hadits hasan shahih",
          "tr": "Katâde (r.a.)’den rivâyete göre, şöyle demiştir: Zürare b. Evfâ’nın, Imrân b. Husayn’dan şöyle aktardığını işittim: Bir adam bir adamın elini ısırmıştı adam elini çekince diğer adamın iki dişi sökülmüştü. Rasûlullah (s.a.v.)’e hükmetmesi için başvurdular da O’da şöyle buyurdu: “Biriniz kardeşini kuvvetli erkek devenin ısırması gibi ısırır mı? Senin dökülen dişlerin için diyet yoktur.” Bunun üzerine Allah: “… Dişe diş, yaralanmalarda da o yaranın benzeri bir karşılık vardır…” ayetini indirdi.” (Maide: 45) Diğer tahric: Buhârî, Diyât; Nesâî, Kasame Tirmizî: Bu konuda Ya’la b. Ümeyye ve kardeşi olan Seleme b. Ümeyye’den de hadis rivâyet edilmiştir. Tirmizî: Imrân b. Husayn hadisi hasen sahihtir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 32
      },
      "narrator": {
        "en": "'Imran bin Husain"
      }
    },
    {
      "hadithNumber": 1417,
      "arabicNumber": 1417,
      "book": 16,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ بَهْزِ بْنِ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حَبَسَ رَجُلاً فِي تُهْمَةٍ ثُمَّ خَلَّى عَنْهُ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ بَهْزٍ عَنْ أَبِيهِ عَنْ جَدِّهِ حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ بَهْزِ بْنِ حَكِيمٍ هَذَا الْحَدِيثَ أَتَمَّ مِنْ هَذَا وَأَطْوَلَ ‏.‏",
        "translations": {
          "en": "Narrated Bahz bin Hakim:from his father, from his grandfather, that the Prophet (ﷺ) imprisoned a man for an accusation, then he let him go",
          "ur": "معاویہ بن حیدہ قشیری رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک آدمی کو تہمت ۱؎ کی بنا پر قید کیا، پھر ( الزام ثابت نہ ہونے پر ) اس کو رہا کر دیا۔ امام ترمذی کہتے ہیں: ۱- اس باب میں ابوہریرہ رضی الله عنہ سے بھی روایت ہے، ۲- بہز بن حکیم بن معاویہ بن حیدۃ قشیری کی حدیث جسے وہ اپنے باپ سے اور وہ ان کے دادا سے روایت کرتے ہیں، حسن ہے، ۳- اسماعیل بن ابراہیم ابن علیہ نے بہز بن حکیم سے یہ حدیث اس سے زیادہ مکمل اور مطول روایت کی ہے ۲؎۔",
          "id": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi], telah menceritakan kepada kami [Ibnu Al Mubrarak] dari [Ma'mar] dari [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam pernah menahan seseorang karena suatu tuduhan lalu melepasnya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah. Abu Isa berkata; Hadits Bahz dari ayahnya dari kakeknya adalah hadits hasan, [Isma'il bin Ibrahim] telah meriwayatkan hadits ini dari [Bahz bin Hakim] dengan redaksi yang lebih lengkap dan lebih panjang",
          "tr": "Behz b. Hakîm (r.a.)’in babasından ve dedesinden rivâyete göre: “Peygamber (s.a.v.), bir töhmet üzerine bir adamı hapsetti sonra suç'u sabit olmayınca o'nu tahliye etti.” Diğer tahric: Ebû Dâvûd, Akdıyye; Nesâî, Kat-us Sarik Tirmizî: Bu konuda Ebû Hureyre’den de hadis rivâyet edilmiştir. Tirmizî: Behz’in babasından ve dedesinden rivâyet ettiği hadis hasendir. İsmail b. İbrahim bu hadisi Behz b. Hakîm’den daha uzun bir şekilde rivâyet etmiştir"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Hasan"
        },
        {
          "name": "Al-Albani",
          "grade": "Hasan"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Hasan"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 33
      },
      "narrator": {
        "en": "Bahz bin Hakim"
      }
    },
    {
      "hadithNumber": 1418,
      "arabicNumber": 1418,
      "book": 16,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، وَحَاتِمُ بْنُ سِيَاهٍ الْمَرْوَزِيُّ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ سَهْلٍ، عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ سَرَقَ مِنَ الأَرْضِ شِبْرًا طُوِّقَهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏ وَزَادَ حَاتِمُ بْنُ سِيَاهٍ الْمَرْوَزِيُّ فِي هَذَا الْحَدِيثِ قَالَ مَعْمَرٌ بَلَغَنِي عَنِ الزُّهْرِيِّ وَلَمْ أَسْمَعْ مِنْهُ زَادَ فِي هَذَا الْحَدِيثِ ‏\"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏ وَهَكَذَا رَوَى شُعَيْبُ بْنُ أَبِي حَمْزَةَ هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ سَهْلٍ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرَوَى سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ فِيهِ سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ سَهْلٍ ‏.‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "translations": {
          "en": "Narrated Sa'eed bin Zaid bin 'Amr bin Nufail:that the Prophet (ﷺ) said: \"Whoever is killed over his wealth then he is a martyr. [And whoever steals a hand-span of land, he will bear seven earths on the Day of Resurrection]",
          "ur": "سعید بن زید رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے ۱؎ اور جس نے ایک بالشت بھی زمین چرائی قیامت کے دن اسے سات زمینوں کا طوق پہنایا جائے گا“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس حدیث میں حاتم بن سیاہ مروزی نے اضافہ کیا ہے، معمر کہتے ہیں: زہری سے مجھے حدیث پہنچی ہے، لیکن میں نے ان سے نہیں سنا کہ انہوں نے اس حدیث یعنی «من قتل دون ماله فهو شهيد» ”جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے“ میں کچھ اضافہ کیا ہو، اسی طرح شعیب بن ابوحمزہ نے یہ حدیث بطریق: «الزهري عن طلحة بن عبد الله عن عبدالرحمٰن بن عمرو بن سهل عن سعيد بن زيد عن النبي صلى الله عليه وسلم» روایت کی ہے، نیز سفیان بن عیینہ نے بطریق: «الزهري عن طلحة بن عبد الله عن سعيد بن زيد عن النبي صلى الله عليه وسلم» روایت کی ہے، اس میں سفیان نے عبدالرحمٰن بن عمرو بن سہل کا ذکر نہیں کیا۔",
          "id": "Telah menceritakan kepada kami [Salamah bin Syabib] dan [Hatim bin Siyah Al Marwazi] dan yang lainnya, mereka berkata; Telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dari [Thalhah bin Abdullah bin 'Auf] dari [Abdurrahman bin Amru bin Sahl] dari [Sa'id bin Zaid bin Amru bin Nufail] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang terbunuh karena membela hartanya maka ia syahid, dan barangsiapa mencuri sejengkal bumi maka pada hari kiamat ia akan dikalungkan dengan tujuh bumi.\" Hatim bin Siyah Al Marwazi menambah di dalam hadits ini. Ma'mar berkata; Telah sampai berita kepadaku dari Az Zuhri namun aku tidak mendengar darinya bahwa ia menambah dalam hadits ini kalimat: \"Barangsiapa yang terbunuh karena membela hartanya, maka ia syahid.\" Demikianlah [Syu'aib bin Abu Hamzah] meriwayatkan hadits ini dari [Az Zuhri] dari [Thalhah bin Abdullah] dari [Abdurrahman bin Amr bin Sahl] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam dan [Sufyan bin 'Uyainah] meriwayatkan juga dari [Az Zuhri] dari [Thalhah bin Abdullah] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam namun Sufyan tidak menyebutkan dalam sanadnya dari Abdurrahman bin Amr bin Sahl. Hadits ini hasan shahih"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 34
      },
      "narrator": {
        "en": "Sa'eed bin Zaid bin 'Amr bin Nufail"
      }
    },
    {
      "hadithNumber": 1419,
      "arabicNumber": 1419,
      "book": 16,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏ قَالَ وَفِي الْبَابِ عَنْ عَلِيٍّ وَسَعِيدِ بْنِ زَيْدٍ وَأَبِي هُرَيْرَةَ وَابْنِ عُمَرَ وَابْنِ عَبَّاسٍ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ ‏.‏ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ لِلرَّجُلِ أَنْ يُقَاتِلَ عَنْ نَفْسِهِ وَمَالِهِ ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ يُقَاتِلُ عَنْ مَالِهِ وَلَوْ دِرْهَمَيْنِ ‏.‏",
        "translations": {
          "en": "Narrated 'Abdullah bin 'Amr:that the Prophet (ﷺ) said: \"Whoever is killed over his wealth, then he is martyr",
          "ur": "عبداللہ بن عمرو رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے“۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن عمرو رضی الله عنہما کی حدیث حسن ہے، یہ دوسری سندوں سے بھی ان سے مروی ہے ۲- بعض اہل علم نے آدمی کو اپنی جان و مال کی حفاظت کے لیے دفاع کی اجازت دی ہے، ۳- اس باب میں علی، سعید بن زید، ابوہریرہ، ابن عمر، ابن عباس اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- عبداللہ بن مبارک کہتے ہیں: آدمی اپنے مال کی حفاظت کے لیے دفاع کرے خواہ اس کا مال دو درہم ہی کیوں نہ ہو ۱؎۔",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abu Amir Al 'Aqadi] telah menceritakan kepada kami [Abdul Aziz bin Al Muththalib] dari [Abdullah bin Al Hasan] dari [Ibrahim bin Muhammad bin Thalhah] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang terbunuh karena membela hartanya, maka ia syahid.\" Ia mengatakan; Dan dalam hal ini ada hadits serupa dari Ali, Sa'id bin Zaid, Abu Hurairah, Ibnu Umar, Ibnu Abbas dan Jabir. Abu 'Isa berkata; Hadits Abdullah bin Amr adalah hadits hasan dan telah diriwayatkan juga darinya dari jalur lain. Sebagian ulama membolehkan bagi seseorang untuk membunuh karena membela diri dan hartanya, Ibnu Al Mubarak berkata; Boleh membunuh karena membela hartanya walaupun dua dirham"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 35
      },
      "narrator": {
        "en": "'Abdullah bin 'Amr"
      }
    },
    {
      "hadithNumber": 1420,
      "arabicNumber": 1420,
      "book": 16,
      "hadithInBook": 36,
      "text": {
        "arabic": "",
        "translations": {
          "ur": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس آدمی کا مال ناحق چھینا جائے اور وہ اس کی حفاظت کے لیے دفاع کرتا ہوا مارا جائے تو وہ شہید ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ اس سند سے بھی عبداللہ بن عمرو بن العاص رضی الله عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے اسی طرح روایت کی ہے۔",
          "id": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani] ia berkata; Telah menceritakan kepada kami [Muhammad bin Abdul Wahhab Al Kufi] seorang syaikh yang tsiqah, dari [Sufyan Ats Tsauri] dari [Abdullah bin Al Hasan bin Ali bin Abu Thalib] telah menceritakan kepadaku [Ibrahim bin Muhammad bin Thalhah], [Sufyan] berkata; Aku memuji kebaikannya, ia berkata; Aku mendengar [Abdullah bin Amr] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa hartanya dirampas secara tidak haq lalu ia memerangi dan terbunuh maka ia syahid.\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Al Hasan] dari [Ibrahim bin Muhammad bin Thalhah] dari [Abdullah bin Amr] dari Nabi shallallahu 'alaihi wasallam seperti itu"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 36
      }
    },
    {
      "hadithNumber": 1421,
      "arabicNumber": 1421,
      "book": 16,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ أَخْبَرَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دِينِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌ ‏\"‏ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ نَحْوَ هَذَا ‏.‏ وَيَعْقُوبُ هُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ الزُّهْرِيُّ ‏.‏",
        "translations": {
          "en": "Narrated Zaid:that he heard the Messenger of Allah (ﷺ) saying: \"Whoever is killed over his wealth then he is a martyr, and whoever is killed over his religion, then he is a martyr, and whoever is killed over his blood, then he is martyr, and whoever is killed over his family, then he is martyr",
          "ur": "سعید بن زید رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”جو اپنے مال کی حفاظت کرتے ہوئے قتل کیا جائے وہ شہید ہے، جو اپنے دین کی حفاظت کرتے ہوئے قتل کیا جائے وہ شہید ہے، جو اپنی جان کی حفاظت کی خاطر مارا جائے وہ شہید ہے اور جو اپنے اہل و عیال کی حفاظت کرتے ہوئے قتل کیا جائے وہ شہید ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابراہیم بن سعد سے کئی راویوں نے اسی جیسی حدیث روایت کی ہے۔",
          "id": "Telah menceritakan kepada kami [Abdu bin Humaid] ia berkata; Telah mengabarkan kepadaku [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [ayahku] dari [ayahnya] dari [Abu Ubaidah bin Muhammad bin 'Ammar bin Yasir] dari [Thalhah bin Abdullah bin 'Auf] dari [Sa'id bin Zaid] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang terbunuh karena membela hartanya maka ia syahid, barangsiapa yang terbunuh karena membela agamanya maka ia syahid, barangsiapa yang terbunuh karena membela darahnya (jiwanya) maka ia syahid dan barangsiapa yang terbunuh karena membela keluarganya maka ia syahid.\" Ia mengatakan; Hadits ini hasan shahih, demikianlah banyak perawi meriwayatkan dari Ibrahim bin Sa'd seperti hadits ini. Ya'qub adalah Ibnu Ibrahim Sa'd bin Ibrahim bin Abdurrahman bin 'Auf Az Zuhri",
          "tr": "Saîd b. Zeyd (r.a.) şöyle demiştir: Rasûlullah (s.a.v.)’den işittim şöyle diyordu: “Kim malını müdafaa uğrunda öldürülürse şehîdtir, kim dini uğrunda öldürülürse şehîdtir, her kim kanını müdafaa uğrunda öldürülürse şehîdtir, kim çoluk çocuğu uğrunda öldürülürse o da şehîdtir.” Diğer tahric: Buhârî, Mezâlim Tirmizî: Bu hadis hasen sahihtir. Aynı hadisi pek çok kimse İbrahim b. Sa’d’den benzeri şekilde rivâyet etmişlerdir. Yakup, İbrahim b. Sa’d b. Abdurrahman b. Avf ez Zührî’nin oğludur"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Isnaad Sahih"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 38
      },
      "narrator": {
        "en": "Zaid"
      }
    },
    {
      "hadithNumber": 1422,
      "arabicNumber": 1422,
      "book": 16,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ يَحْيَى وَحَسِبْتُ عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُمَا قَالاَ خَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ حَتَّى إِذَا كَانَا بِخَيْبَرَ تَفَرَّقَا فِي بَعْضِ مَا هُنَاكَ ثُمَّ إِنَّ مُحَيِّصَةَ وَجَدَ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلاً قَدْ قُتِلَ فَدَفَنَهُ ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هُوَ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَكَانَ أَصْغَرَ الْقَوْمِ ذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ قَبْلَ صَاحِبَيْهِ قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرِ الْكُبْرَ ‏\"‏ ‏.‏ فَصَمَتَ وَتَكَلَّمَ صَاحِبَاهُ ثُمَّ تَكَلَّمَ مَعَهُمَا فَذَكَرُوا لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَقْتَلَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا فَتَسْتَحِقُّونَ صَاحِبَكُمْ أَوْ قَاتِلَكُمْ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ قَالَ ‏\"‏ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَعْطَى عَقْلَهُ ‏.‏ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، وَرَافِعِ بْنِ خَدِيجٍ، نَحْوَ هَذَا الْحَدِيثِ بِمَعْنَاهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ فِي الْقَسَامَةِ وَقَدْ رَأَى بَعْضُ فُقَهَاءِ الْمَدِينَةِ الْقَوَدَ بِالْقَسَامَةِ ‏.‏ وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَهْلِ الْكُوفَةِ وَغَيْرِهِمْ إِنَّ الْقَسَامَةَ لاَ تُوجِبُ الْقَوَدَ وَإِنَّمَا تُوجِبُ الدِّيَةَ ‏.‏ آخِرُ أَبْوَابِ الدِّيَاتِ وَالْحَمْدُ لِلَّهِ ‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Abi Hatamah:Yahya (one of the narrators) said: And I think it was from Rafi' bin Khadij - that 'Abdullah bin Sahl bin Zaid and Muhaiysah bin Mas'ud bin Zaid went out and when they reached Khaibar they separated while there. Then Muhayyisah found 'Abdullah bin Sahl murdered [so he buried him]. Then he went to the Messenger of Allah (ﷺ) along with Huwayyisah bin Mas'ud and Abdur-Rahman bin Sahl. The youngest of the people, Abdur-Rahman, went to speak ahead of his companions. The Messenger of Allah (ﷺ) said to him: \"Let the eldest of you speak.\" So he was silent and two companions spoke. So he conversed with them and they mentioned to the Messenger of Allah (ﷺ) about the murder of 'Abdullah bin Sahl. He said to them: \"If fifty of you can swear an oath then you will have the right against the murderer.\" They said: \"How can we take an oath when we did not witness it?\" He said: \"Then fifty of Jews can swear to clear the charge with you?\" They said: \"How could we accept the oaths of a disbelieving people?\" So when he saw that, the Messenger of Allah (ﷺ) paid the blood-money.\" (Another Chain) from Sahl bin Abi Hathman and Rafi' bin Khadij, and the meaning is similar to this Hadith",
          "ur": "سہل بن ابو حثمہ اور رافع بن خدیج رضی الله عنہما کہتے ہیں کہ عبداللہ بن سہل بن زید اور محیصہ بن مسعود بن زید رضی الله عنہما کہیں جانے کے لیے گھر سے روانہ ہوئے، جب وہ خیبر پہنچے تو الگ الگ راستوں پر ہو گئے، پھر محیصہ نے عبداللہ بن سہل کو مقتول پایا، کسی نے ان کو قتل کر دیا تھا، آپ نے انہیں دفنا دیا، پھر وہ ( یعنی راوی حدیث ) حویصہ بن مسعود اور عبدالرحمٰن بن سہل رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، عبدالرحمٰن بن سہل ان میں سب سے چھوٹے تھے، وہ اپنے دونوں ساتھیوں سے پہلے ( اس معاملہ میں آپ سے ) گفتگو کرنا چاہتے تھے، رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: ”بڑے کا لحاظ کرو، لہٰذا وہ خاموش ہو گئے اور ان کے دونوں ساتھیوں نے گفتگو کی، پھر وہ بھی ان دونوں کے ساتھ شریک گفتگو ہو گئے، ان لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے عبداللہ بن سہل کے قتل کا واقعہ بیان کیا، آپ نے ان سے فرمایا: ”کیا تم لوگ پچاس قسمیں کھاؤ گے ( کہ فلاں نے اس کو قتل کیا ہے ) تاکہ تم اپنے ساتھی کے خون بہا کے مستحق ہو جاؤ ( یا کہا ) قاتل کے خون کے مستحق ہو جاؤ؟“ ان لوگوں نے عرض کیا: ہم قسم کیسے کھائیں جب کہ ہم حاضر نہیں تھے؟ آپ نے فرمایا: ”تو یہود پچاس قسمیں کھا کر تم سے بری ہو جائیں گے“، ان لوگوں نے کہا: ہم کافر قوم کی قسم کیسے قبول کر لیں؟ پھر رسول اللہ صلی اللہ علیہ وسلم نے جب یہ معاملہ دیکھا تو ان کی دیت ۱؎ خود ادا کر دی۔ اس سند سے بھی سہل بن ابو حثمہ اور رافع بن خدیج سے اسی طرح اسی معنی کی حدیث مروی ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- قسامہ کے سلسلہ میں بعض اہل علم کا اسی حدیث پر عمل ہے، ۳- مدینہ کے بعض فقہاء قسامہ ۲؎ کی بنا پر قصاص درست سمجھتے ہیں، ۴- کوفہ کے بعض اہل علم اور کچھ دوسرے لوگ کہتے ہیں: قسامہ کی بنا پر قصاص واجب نہیں، صرف دیت واجب ہے۔",
          "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah], Yahya berkata; Aku kira dari [Rafi' bin Khadij] di antara keduanya ada yang berkata; Abdullah bin Sahl bin Zaid dan Mukhayyishah bin Mas'ud bin Zaid keluar hingga ketika sampai di Khaibar keduanya berpisah untuk sebagian keperluan mereka di sana, kemudian Mukhayyishah mendapati Abdullah bin Sahl gugur, ia telah dibunuh, setelah menguburnya kemudian ia pun menghadap Rasulullah shallallahu 'alaihi wasallam, ketika itu beliau bersama Khuwaishah bin Mas'ud dan Abdurrahman bin Sahl, ia adalah orang paling muda. Abdurrahman pun maju untuk berbicara sebelum kedua temannya, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Dahulukan orang yang lebih tua.\" Ia pun terdiam dan kedua temannya berbicara kemudian ia berbicara bersama keduanya. Mereka menyebutkan perihal terbunuhnya Abdullah bin Sahl kepada Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda kepada mereka: \"Apakah kalian mau bersumpah lima puluh kali sumpah dan berhak terhadap sahabat atau orang yang membunuh kalian?\" Mereka berkata; Bagaimana kami bersumpah sedangkan kami tidak menyaksikan? Beliau bersabda: \"Apakah kalian mau orang-orang Yahudi terbebas dari segala tuduhan kalian dengan lima puluh kali sumpah?\" Maka mereka bertanya; Bagaimana kami mengambil sumpah orang-orang kafir? Ketika Rasulullah shallallahu 'alaihi wasallam melihat hal itu, beliau pun memberikan diyatnya. Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] dan [Rafi' bin Khadij] seperti hadits ini secara maknanya. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama dalam sumpah lima puluh orang, sebagian fuqaha Madinah berpendapat bahwa qishash adalah dengan sumpah lima puluh orang namun sebagian ulama dari Kufah dan selain mereka berpendapat bahwa sumpah lima puluh orang tidak diwajibkan dalam qishash hanya diwajibkan pada diyat",
          "tr": "Rafi’ b. Hadîç (radıyallahü anh)’den rivâyete göre, şöyle demiştir: “Abdullah b. Sehl b. Zeyd ile Muhayyısa b. Mes’ûd b. Zeyd bir yolculuğa çıktılar, Hayber’e vardıklarında kendi işleri için birbirlerinden ayrıldılar. Bir süre sonra Muhayyısa, Abdullah b. Sehl’i öldürülmüş olarak buldu. Birileri onu öldürmüştü, onu defnetti. Sonra Huveyyısa b. Mes’ûd, Abdurrahman b. Sehl ve Muhayyısa Rasûlüllah (sallallahü aleyhi ve sellem)’e geldiler. Abdurahman bu kimselerin yaşça en küçüğü olmasına rağmen arkadaşlarından önce konuşmaya davrandı. Rasûlüllah (sallallahü aleyhi ve sellem): “Büyüklere karşı saygılı ol” buyurdu. Bunun üzerine Abdurrahman sustu ve o iki arkadaşı konuştu, sonra onlarla beraber gerektiği yerde o da konuştu. Rasûlüllah (sallallahü aleyhi ve sellem)’e Abdullah b. Sehl’in öldürüldüğü yeri anlattılar. Rasûlüllah (sallallahü aleyhi ve sellem): “Ölen arkadaşınıza veya katile karşı hak kazanmak üzere elli sefer yemin eder misiniz? Buyurdu. Öldüreni görmediğimiz halde nasıl yemin edebiliriz dediler. Rasûlüllah (sallallahü aleyhi ve sellem), o halde Yahudiler elli yeminle sizi yemin etmekten kurtarsınlar. Diğerleri ise: Kafir bir toplumun yeminlerini nasıl kabul edebiliriz dediler. Bu durumu görünce; Rasûlüllah (sallallahü aleyhi ve sellem), öldürülen kimsenin diyetini kendisi verdi. (Müslim, Kasame: 1; Nesâî, Kasame:)"
        }
      },
      "grades": [
        {
          "name": "Ahmad Muhammad Shakir",
          "grade": "Sahih"
        },
        {
          "name": "Al-Albani",
          "grade": "Sahih"
        },
        {
          "name": "Bashar Awad Maarouf",
          "grade": "Hasan Sahih"
        },
        {
          "name": "Zubair Ali Zai",
          "grade": "Sahih - Agreed Upon"
        }
      ],
      "reference": {
        "collection": "tirmidhi",
        "book": 16,
        "hadith": 39
      },
      "narrator": {
        "en": "Sahl bin Abi Hatamah"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "37KB"
  }
}