{
  "collection": "bukhari",
  "book": 46,
  "name": {
    "arabic": "كتاب Oppressions",
    "transliteration": "oppressions",
    "translation": "Oppressions"
  },
  "totalHadith": 43,
  "hadithNumberRange": {
    "first": 2440,
    "last": 2482
  },
  "content": [
    {
      "hadithNumber": 2440,
      "arabicNumber": 2440,
      "book": 46,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا خَلَصَ الْمُؤْمِنُونَ مِنَ النَّارِ حُبِسُوا بِقَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيَتَقَاصُّونَ مَظَالِمَ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتَّى إِذَا نُقُّوا وَهُذِّبُوا أُذِنَ لَهُمْ بِدُخُولِ الْجَنَّةِ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ صلى الله عليه وسلم بِيَدِهِ لأَحَدُهُمْ بِمَسْكَنِهِ فِي الْجَنَّةِ أَدَلُّ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ‏\"‏‏.‏ وَقَالَ يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ عَنْ قَتَادَةَ حَدَّثَنَا أَبُو الْمُتَوَكِّلِ‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id Al-Khudri:Allah's Messenger (ﷺ) said, \"When the believers pass safely over (the bridge across) Hell, they will be stopped at a bridge in between Hell and Paradise where they will retaliate upon each other for the injustices done among them in the world, and when they get purified of all their sins, they will be admitted into Paradise. By Him in Whose Hands the life of Muhammad is everybody will recognize his dwelling in Paradise better than he recognizes his dwelling in this world",
          "ur": "ہم سے اسحٰق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ ہم کو معاذ بن ہشام نے خبر دی، انہوں نے کہا کہ ہم سے ان کے باپ نے بیان کیا، ان سے قتادہ نے، ان سے ابوالمتوکل ناجی نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، جب مومنوں کو دوزخ سے نجات مل جائے گی تو انہیں ایک پل پر جو جنت اور دوزخ کے درمیان ہو گا روک لیا جائے گا اور وہیں ان کے مظالم کا بدلہ دے دیا جائے گا۔ جو وہ دنیا میں باہم کرتے تھے۔ پھر جب پاک صاف ہو جائیں گے تو انہیں جنت میں داخلہ کی اجازت دی جائے گی۔ اس ذات کی قسم! جس کے ہاتھ میں محمد کی جان ہے، ان میں سے ہر شخص اپنے جنت کے گھر کو اپنے دنیا کے گھر سے بھی بہتر طور پر پہچانے گا۔ یونس بن محمد نے بیان کیا کہ ہم سے شیبان نے بیان کیا، ان سے قتادہ نے اور ان سے ابوالمتوکل نے بیان کیا۔",
          "fr": "Rapporté par Abu Sa‘id Al-Khudri : Le Messager d’Allah (ﷺ) a dit : « Quand les croyants auront traversé en sécurité (le pont au-dessus) de l’Enfer, ils seront arrêtés sur un pont entre l’Enfer et le Paradis où ils régleront entre eux les injustices subies dans ce monde. Une fois purifiés de tous leurs péchés, ils entreront au Paradis. Par Celui qui détient la vie de Muhammad dans Ses mains, chacun reconnaîtra sa demeure au Paradis mieux qu’il ne reconnaît sa maison dans ce monde. »",
          "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] dari [Qatadah] dari [Abu Al Mutawakkil An-Naajiy] dari [Abu Sa'id Al Khudriy radliallahu 'anhu] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika orang-orang beriman telah melewati neraka, mereka akan ditahan di suatu jembatan yang disebut Qanthorah yang terletak antara surga dan neraka, lalu disana mereka akan diqishas (dibalas) atas kezhalimin yang terjadi sesama mereka di dunia, sehingga apabila telah tidak ada lagi dosa barulah mereka diizinkan untuk memasuki surga. Dan demi Dzat yang jiwaku berada di tangaNya, sungguh seorang dari mereka berada di tempat tinggalnya di surga lebih aku kenal dari pada rumah mereka di dunia\". Dan berkata, [Yunus bin Muhammad] telah menceritakan kepada kami [Syaiban] dari [Qatadah] telah menceritakan kepada kami [Abu Al Mutawakkil]",
          "tr": "Ebu Said el-Hudri r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İnananlar cehennemden kurtulunca cennetle cehennem arasındaki bir köprüde bekletilirler ve dünyada iken birbirine yapmış oldukları haksızlıkları ödeşirler. İyice temizlenip birbirinin hakkından arındırılınca cennete girmelerine izin verilir. Muhammed'in canı elinde olan Allah'a yemin ederim ki sizin cennette kalacağınız yer dünyadaki konumunuzun en iyi göstergesidir. \" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 1
      },
      "narrator": {
        "en": "Abu Sa`id Al-Khudri"
      }
    },
    {
      "hadithNumber": 2441,
      "arabicNumber": 2441,
      "book": 46,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، قَالَ أَخْبَرَنِي قَتَادَةُ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ الْمَازِنِيِّ، قَالَ بَيْنَمَا أَنَا أَمْشِي، مَعَ ابْنِ عُمَرَ ـ رضى الله عنهما ـ آخِذٌ بِيَدِهِ إِذْ عَرَضَ رَجُلٌ، فَقَالَ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي النَّجْوَى فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ يُدْنِي الْمُؤْمِنَ فَيَضَعُ عَلَيْهِ كَنَفَهُ، وَيَسْتُرُهُ فَيَقُولُ أَتَعْرِفُ ذَنْبَ كَذَا أَتَعْرِفُ ذَنْبَ كَذَا فَيَقُولُ نَعَمْ أَىْ رَبِّ‏.‏ حَتَّى إِذَا قَرَّرَهُ بِذُنُوبِهِ وَرَأَى فِي نَفْسِهِ أَنَّهُ هَلَكَ قَالَ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا، وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ‏.‏ فَيُعْطَى كِتَابَ حَسَنَاتِهِ، وَأَمَّا الْكَافِرُ وَالْمُنَافِقُونَ فَيَقُولُ الأَشْهَادُ هَؤُلاَءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ، أَلاَ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Safwan bin Muhriz Al-Mazini:While I was walking with Ibn `Umar holding his hand, a man came in front of us and asked, \"What have you heard from Allah's Messenger (ﷺ) about An-Najwa?\" Ibn `Umar said, \"I heard Allah's Messenger (ﷺ) saying, 'Allah will bring a believer near Him and shelter him with His Screen and ask him: Did you commit such-and-such sins? He will say: Yes, my Lord. Allah will keep on asking him till he will confess all his sins and will think that he is ruined. Allah will say: 'I did screen your sins in the world and I forgive them for you today', and then he will be given the book of his good deeds. Regarding infidels and hypocrites (their evil acts will be exposed publicly) and the witnesses will say: These are the people who lied against their Lord. Behold! The Curse of Allah is upon the wrongdoers",
          "ur": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے ہمام نے بیان کیا، کہا کہ مجھے قتادہ نے خبر دی، ان سے صفوان بن محرزمازنی نے بیان کیا کہ میں عبداللہ بن عمر رضی اللہ عنہما کے ہاتھ میں ہاتھ دیئے جا رہا تھا۔ کہ ایک شخص سامنے آیا اور پوچھا رسول اللہ صلی اللہ علیہ وسلم سے آپ نے ( قیامت میں اللہ اور بندے کے درمیان ہونے والی ) سرگوشی کے بارے میں کیا سنا ہے؟ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اللہ تعالیٰ مومن کو اپنے نزدیک بلا لے گا اور اس پر اپنا پردہ ڈال دے گا اور اسے چھپا لے گا۔ اللہ تعالیٰ اس سے فرمائے گا کیا تجھ کو فلاں گناہ یاد ہے؟ کیا فلاں گناہ تجھ کو یاد ہے؟ وہ مومن کہے گا ہاں، اے میرے پروردگار۔ آخر جب وہ اپنے گناہوں کا اقرار کر لے گا اور اسے یقین آ جائے گا کہ اب وہ ہلاک ہوا تو اللہ تعالیٰ فرمائے گا کہ میں نے دنیا میں تیرے گناہوں پر پردہ ڈالا۔ اور آج بھی میں تیری مغفرت کرتا ہوں، چنانچہ اسے اس کی نیکیوں کی کتاب دے دی جائے گی، لیکن کافر اور منافق کے متعلق ان پر گواہ ( ملائکہ، انبیاء، اور تمام جن و انس سب ) کہیں گے کہ یہی وہ لوگ ہیں جنہوں نے اپنے پروردگار پر جھوٹ باندھا تھا۔ خبردار ہو جاؤ! ظالموں پر اللہ کی پھٹکار ہو گی۔",
          "fr": "Rapporté par Safwan bin Muhriz Al-Mazini : Alors que je marchais avec Ibn ‘Umar en lui tenant la main, un homme est venu devant nous et a demandé : « Qu’as-tu entendu du Messager d’Allah (ﷺ) à propos d’An-Najwa ? » Ibn ‘Umar a dit : « J’ai entendu le Messager d’Allah (ﷺ) dire : ‘Allah rapprochera un croyant de Lui, le couvrira de Sa protection et lui demandera : As-tu commis tel ou tel péché ? Il dira : Oui, mon Seigneur. Allah continuera à l’interroger jusqu’à ce qu’il avoue tous ses péchés et pensera qu’il est perdu. Allah dira : J’ai caché tes péchés dans le monde et aujourd’hui, Je te les pardonne, puis il recevra le livre de ses bonnes actions. Quant aux mécréants et aux hypocrites (leurs mauvaises actions seront exposées publiquement) et les témoins diront : Voilà ceux qui ont menti à propos de leur Seigneur. Attention ! La malédiction d’Allah est sur les injustes.’ »",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammam] berkata, telah menceritakan kepadaku [Qatadah] dari [Shafwan bin Muhriz Al Maziniy] berkata; Ketika aku sedang berjalan bersama [Ibnu'Umar] radliallahu 'anhuma, ada seorang yang memegang tangannya ketika menyodorkannya lalu berkata: \"Bagaimana kamu mendengar Rasulullah shallallahu 'alaihi wasallam berkata tentang An-Najwaa (pembicaraan rahasia antara Allah dengan hambaNya pada hari Qiyamat)?\" Maka dia berkata: \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesunggunnya Allah ketika orang beriman didekatkan lalu bagian sisi badannya diletakkan kemudian ditutup, Allah berfirman: \"Apakah kamu mengenal dosamu yang begini?, apakah kamu mengenal dosamu yang begini?\" Orang beriman itu berkata: \"Ya, Tuhanku\". Hingga ketika sudah diakui dosa-dosanya dan dia melihat bahwa dirinya akan celaka, Allah berfirman: \"Aku telah merahasiakannya bagimu di dunia dan Aku mengampuninya buatmu hari ini\". Maka orang beriman itu diberikan kitab catatan kebaikannya. Adapun orang kafir dan munafiqin, Allah berfirman: Dan para saksi akan berkata: itulah orang-orang yang mendustakan Tuhan mereka. Maka laknat Allah untuk orang-orang yang zhalim",
          "tr": "Safvan İbn Muhriz el-Mazını'den nakledilmiştir: Abdullah İbn Ömer r.a.'in elinden tutmuş, birlikte yürüyordum. Karşımıza biri çıktı ve ''Allah Resulü hiç ikiniz arasında bir şey söyledi mi? (sana hiç sır verdi mi?)’’ diye sordu. İbn Ömer: ''Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: ''Allah, mu'min kulunu kendine yaklaştırır, onu koruması altına alıp örter ve ''Şu günahını biliyor musun? Şu günahını biliyor musun?'' der. O da ''Rabbim! Evet biliyorum\" der. Allah ona teker teker bütün günahlarını itiraf ettirip o, mahvolduğunu düşünmeye başlayınca, ''Dünyada iken senin bu günahlarını örttüm. Bu gün de seni bağışlıyorum\" der. Sonra ona yaptığı iyiliklerin yazılı olduğu defter verilir. Kafir ve münafıklar hakkında ise şahitler \"Bunlar Rableri adına yalan söyleyenlerdir\" derler. İyi biliniz ki Allah'ın la'neti zalimler üzerinedir. ' Tekrar: 4685, 6070, 7514 Not: Tevhıd Bölümü'nde bu hadis’in açıklaması ile ilgili olarak etraflıca bilgi verilecek;(7514. hadis’te) ayrıca Rikak Bölümü'nde de bu konuya işaret edilecektir. İNŞAALLAH"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 2
      },
      "narrator": {
        "en": "Safwan bin Muhriz Al-Mazini"
      }
    },
    {
      "hadithNumber": 2442,
      "arabicNumber": 2442,
      "book": 46,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمًا، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ، لاَ يَظْلِمُهُ وَلاَ يُسْلِمُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ، وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرُبَاتِ يَوْمِ الْقِيَامَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim, so he should not oppress him, nor should he hand him over to an oppressor. Whoever fulfilled the needs of his brother, Allah will fulfill his needs; whoever brought his (Muslim) brother out of a discomfort, Allah will bring him out of the discomforts of the Day of Resurrection, and whoever screened a Muslim, Allah will screen him on the Day of Resurrection",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ ہم سے لیث نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، انہیں سالم نے خبر دی، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک مسلمان دوسرے مسلمان کا بھائی ہے، پس اس پر ظلم نہ کرے اور نہ ظلم ہونے دے۔ جو شخص اپنے بھائی کی ضرورت پوری کرے، اللہ تعالیٰ اس کی ضرورت پوری کرے گا۔ جو شخص کسی مسلمان کی ایک مصیبت کو دور کرے، اللہ تعالیٰ اس کی قیامت کی مصیبتوں میں سے ایک بڑی مصیبت کو دور فرمائے گا۔ اور جو شخص کسی مسلمان کے عیب کو چھپائے اللہ تعالیٰ قیامت میں اس کے عیب چھپائے گا۔",
          "fr": "Rapporté par ‘Abdullah bin ‘Umar : Le Messager d’Allah (ﷺ) a dit : « Un musulman est le frère d’un autre musulman, il ne doit donc pas lui faire de tort ni le livrer à un injuste. Celui qui satisfait les besoins de son frère, Allah satisfera ses besoins ; celui qui soulage son frère musulman d’une difficulté, Allah le soulagera des difficultés du Jour de la Résurrection ; et celui qui couvre un musulman, Allah le couvrira le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] bahwa [Salim] mengabarkannya bahwa ['Abdullah bin 'Umar radliallahu 'anhuma] mengabarkannya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang muslim adalah saudara bagi muslim lainnya, dia tidak menzhaliminya dan tidak membiarkannya untuk disakiti. Siapa yang membantu kebutuhan saudaranya maka Allah akan membantu kebutuhannya. Siapa yang menghilangkan satu kesusahan seorang muslim, maka Allah menghilangkan satu kesusahan baginya dari kesusahan-kesusahan hari qiyamat. Dan siapa yang menutupi (aib) seorang muslim maka Allah akan menutup aibnya pada hari qiyamat",
          "tr": "İbn Şihab, Salim'den, o da Abdullah İbn Ömer r.a.'den nakletmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Müslüman Müslüman'ın kardeşidir; ona haksızlık etmez ve onu ölüme terketmez. Her kim kardeşinin bir ihtiyacını görürse Allah da onun ihtiyacını görür. Her kim bir Müslüman'ın bir sıkıntısını giderirse Allah da kıyamet gününde onun sıkıntılarından bir sıkıntısını giderir. Her kim bir Müslümanın ayıbını örterse Allah da kıyamet gününde onun ayıbını örter. \" Tekrar: 6951 Diğer tahric: Tirmizî, Hudud; Ebu Dâvud, Edeb"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 3
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 2443,
      "arabicNumber": 2443,
      "book": 46,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ، وَحُمَيْدٌ الطَّوِيلُ، سَمِعَا أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one",
          "ur": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا کہ ہم سے ہشیم نے بیان کیا، انہیں عبیداللہ بن ابی بکر بن انس اور حمید طویل نے خبر دی، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اپنے بھائی کی مدد کرو وہ ظالم ہو یا مظلوم۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) a dit : « Aide ton frère, qu’il soit injuste ou victime d’injustice. »",
          "id": "Telah menceritakan kepada kami ['Utsman bin Abi Syaibah] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami ['Ubaidullah bin Abi Bakar bin Anas] dan [Humaid Ath-Thowil] dia mendengar [Anas bin Malik radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tolonglah saudaramu yang berbuat zhalim (aniaya) dan yang dizhalimi",
          "tr": "Enes İbn Malik r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İster haksızlığa uğrasın, ister haksızlık etsin, din kardeşine yardım et\" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 4
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 2444,
      "arabicNumber": 2444,
      "book": 46,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ هَذَا نَنْصُرُهُ مَظْلُومًا، فَكَيْفَ نَنْصُرُهُ ظَالِمًا قَالَ ‏\"‏ تَأْخُذُ فَوْقَ يَدَيْهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas:Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one. People asked, \"O Allah's Messenger (ﷺ)! It is all right to help him if he is oppressed, but how should we help him if he is an oppressor?\" The Prophet (ﷺ) said, \"By preventing him from oppressing others",
          "ur": "ہم سے مسدد نے بیان کیا، کہا ہم سے معتمر نے بیان کیا، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اپنے بھائی کی مدد کرو خواہ وہ ظالم ہو یا مظلوم۔ صحابہ نے عرض کیا، یا رسول اللہ! ہم مظلوم کی تو مدد کر سکتے ہیں۔ لیکن ظالم کی مدد کس طرح کریں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ظلم سے اس کا ہاتھ پکڑ لو ( یہی اس کی مدد ہے ) ۔",
          "fr": "Rapporté par Anas : Le Messager d’Allah (ﷺ) a dit : « Aide ton frère, qu’il soit injuste ou victime d’injustice. » Les gens ont demandé : « Ô Messager d’Allah (ﷺ) ! Il est normal de l’aider s’il est victime, mais comment l’aider s’il est injuste ? » Le Prophète (ﷺ) a dit : « En l’empêchant de commettre l’injustice. »",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Mu'tamir] dari [Humaid] dari [Anas radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tolonglah saudaramu yang berbuat zhalim (aniaya) dan yang dizhalimi\". Mereka bertanya: \"Wahai Rasulullah, jelas kami faham menolong orang yang dizhalimi tapi bagaimana kami harus menolong orang yang berbuat zhalim?\" Beliau bersabda: \"Pegang tangannya (agar tidak berbuat zhalim)",
          "tr": "Enes r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdular: \"İster haksızlığa uğrasın, ister haksızlık etsin, din kardeşinize yardım ediniz\" \"Ey Allah'ın Resulü! Haklı olana yardım etmeyi anlıyoruz da haksız olana nasıl yardım edelim!\" diye sordular. Nebi Sallallahu Aleyhi ve Sellem de \"Ellerini tutarsınız\" buyurdu. Diğer tahric: Ebu Davud, Melahim; Tirmizi Fiten"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 5
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2445,
      "arabicNumber": 2445,
      "book": 46,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدٍ، سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ‏.‏ فَذَكَرَ عِيَادَةَ الْمَرِيضِ، وَاتِّبَاعَ الْجَنَائِزِ، وَتَشْمِيتَ الْعَاطِسِ، وَرَدَّ السَّلاَمِ، وَنَصْرَ الْمَظْلُومِ، وَإِجَابَةَ الدَّاعِي، وَإِبْرَارَ الْمُقْسِمِ‏.‏",
        "translations": {
          "en": "Narrated Muawiya bin Suwaid:I heard Al-Bara' bin `Azib saying, \"The Prophet (ﷺ) ordered us to do seven things and prohibited us from doing seven other things.\" Then Al-Bara' mentioned the following:-- (1) To pay a visit to the sick (inquiring about his health), (2) to follow funeral processions, (3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), (4) to return greetings, (5) to help the oppressed, (6) to accept invitations, (7) to help others to fulfill their oaths. (See Hadith No. 753, Vol)",
          "ur": "ہم سے سعید بن ربیع نے بیان کیا، کہا کہ ہم سے شعبہ نے بیان کیا، کہا کہ ہم سے اشعث بن سلیم نے بیان کیا، کہ میں نے معاویہ بن سوید سے سنا، انہوں نے براء بن عازب رضی اللہ عنہ سے سنا، آپ نے بیان کیا تھا کہ ہمیں نبی کریم صلی اللہ علیہ وسلم نے سات چیزوں کا حکم فرمایا تھا اور سات ہی چیزوں سے منع بھی فرمایا تھا ( جن چیزوں کا حکم فرمایا تھا ان میں ) انہوں نے مریض کی عیادت، جنازے کے پیچھے چلنے، چھینکنے والے کا جواب دینے، سلام کا جواب دینے، مظلوم کی مدد کرنے، دعوت کرنے والے ( کی دعوت ) قبول کرنے، اور قسم پوری کرنے کا ذکر کیا۔",
          "fr": "Rapporté par Muawiya bin Suwaid : J’ai entendu Al-Bara’ bin ‘Azib dire : « Le Prophète (ﷺ) nous a ordonné de faire sept choses et nous a interdit d’en faire sept autres. » Puis Al-Bara’ a mentionné les suivantes : (1) rendre visite aux malades, (2) suivre les cortèges funéraires, (3) dire à celui qui éternue : « Qu’Allah te fasse miséricorde » (s’il dit : « Louange à Allah ! »), (4) rendre les salutations, (5) aider les opprimés, (6) accepter les invitations, (7) aider les autres à tenir leurs serments. (Voir Hadith n°753, vol)",
          "id": "Telah menceritakan kepada kami [Sa'id bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Al Asy'ats bin Sulaim] berkata, aku mendengar [Mu'awiyah bin Suwaid] aku mendengar [Al Bara' bin 'Azib radliallahu 'anhuma] berkata; \"Nabi shallallahu 'alaihi wasallam memerintahkan kami tujuh perkara dan melarang kami dari tujuh perkara pula\". Maka Beliau menyebutkan: \"Menjenguk orang sakit, mengiringi jenazah, mendoakan orang yang bersin, membalas salam, menolong orang yang dizholimi, memunuhi undangan dan berbuat adil dalam pembagian",
          "tr": "Bera İbn Azib r.a.'den nakledilmiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem bize yedi şeyi emretti; yedi şeyden yasakladı. \"Bera, Hz. Nebi'in emrettikleri arasında \"hasta ziyaretini, cenaze uğurlamayı, aksırana dua etmeyi, verilen selamı almayı, haksızlığa uğrayan kişiye yardım etmeyi, seslenene cevap vermeyi ve yemini tutmayı\" saydı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 6
      },
      "narrator": {
        "en": "Muawiya bin Suwaid"
      }
    },
    {
      "hadithNumber": 2446,
      "arabicNumber": 2446,
      "book": 46,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏‏.‏ وَشَبَّكَ بَيْنَ أَصَابِعِهِ‏.‏",
        "translations": {
          "en": "Narrated Abu Musa:The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each other.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced (while saying that)",
          "ur": "ہم سے محمد بن علاء نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا، ان سے برید نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک مومن دوسرے مومن کے ساتھ ایک عمارت کے حکم میں ہے کہ ایک کو دوسرے سے قوت پہنچتی ہے۔ اور آپ صلی اللہ علیہ وسلم نے اپنے ایک ہاتھ کی انگلیوں کو دوسرے ہاتھ کی انگلیوں کے اندر کیا۔",
          "fr": "Rapporté par Abu Musa : Le Prophète (ﷺ) a dit : « Un croyant envers un autre croyant est comme un bâtiment dont les différentes parties se soutiennent les unes les autres. » Le Prophète (ﷺ) a alors joint ses mains en croisant les doigts",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Alaa'] telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Orang beriman terhadap orang beriman lainnya bagaikan satu bangunan yang satu sama lain saling menguatkan\". Dan Beliau mendemontrasikannya dengan cara mengepalkan jari jemari Beliau",
          "tr": "Ebu Musa r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem parmaklarını kenetleyerek \"Mu'minler bir binanın tuğlaları gibidir, birbirine destek olurlar\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 7
      },
      "narrator": {
        "en": "Abu Musa"
      }
    },
    {
      "hadithNumber": 2447,
      "arabicNumber": 2447,
      "book": 46,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الظُّلْمُ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:The Prophet (ﷺ) said, \"Oppression will be a darkness on the Day of Resurrection",
          "ur": "ہم سے احمد بن یونس نے بیان کیا، کہا کہ ہم سے عبدالعزیز ماجشون نے بیان کیا، انہیں عبداللہ بن دینار نے خبر دی، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ظلم قیامت کے دن اندھیرے ہوں گے۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Prophète (ﷺ) a dit : « L’injustice sera une obscurité le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Ahmad binYunus] telah menceritakan kepada kami ['Abdul 'Aziz Al Majisyun] telah mengabarkan kepada kami ['Abdullah bin DInar] dari ['Abdullah bin 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam: \"Kezhaliman adalah mendatangkan kegelapan hari qiyamat",
          "tr": "Abdullah İbn Ömer r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: ''Zulüm, kıyamet gününde kat kat karanlık olacaktır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 8
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 2448,
      "arabicNumber": 2448,
      "book": 46,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ الْمَكِّيُّ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذًا إِلَى الْيَمَنِ، فَقَالَ ‏ \"‏ اتَّقِ دَعْوَةَ الْمَظْلُومِ، فَإِنَّهَا لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ حِجَابٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no screen between his invocation and Allah",
          "ur": "ہم سے یحییٰ بن موسیٰ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، کہا ہم سے زکریا بن اسحاق مکی نے بیان کیا، ان سے یحییٰ بن عبداللہ صیفی نے، ان سے ابن عباس رضی اللہ عنہما کے غلام ابومعبد نے، اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو جب ( عامل بنا کر ) یمن بھیجا، تو آپ صلی اللہ علیہ وسلم نے انہیں ہدایت فرمائی کہ مظلوم کی بددعا سے ڈرتے رہنا کہ اس ( دعا ) کے اور اللہ تعالیٰ کے درمیان کوئی پردہ نہیں ہوتا۔",
          "fr": "Rapporté par Ibn ‘Abbas : Le Prophète (ﷺ) a envoyé Mu‘adh au Yémen et a dit : « Prends garde à l’invocation de l’opprimé, car il n’y a pas de voile entre elle et Allah. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Zakariyya' bin Ishaq Al Makkiy] dari [Yahya bin 'Abdullah bin Shaifiy] dari [Abu Ma'bad, maula Ibnu 'Abbas] dari [Ibnu 'Abbas radliallahu 'anhuma] bahwa Nabi shallallahu 'alaihi wasallam mengutus Mu'adz ke negeri Yaman lalu bersabda: \"Berhati-hatilah kamu terhadap do'anya orang yang dizhalimi karena antara do'anya dan Allah tidak ada penghalangnya",
          "tr": "İbn Abbas r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Muaz'ı Yemen'e gönderdi ve ona \"Mazlumun (haksızlığa uğrayanın) bedduasından sakın. Çünkü onun duası ile Allah arasında perde yoktur\" buyurdu. Not: Zekat bölümünün sonunda bu konu ayrıntılı olarak ele alınmıştır. O AÇIKLAMA İÇİN BURAYA TIKLAYABİLİRSİNİZ"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 9
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 2449,
      "arabicNumber": 2449,
      "book": 46,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَتْ لَهُ مَظْلَمَةٌ لأَحَدٍ مِنْ عِرْضِهِ أَوْ شَىْءٍ فَلْيَتَحَلَّلْهُ مِنْهُ الْيَوْمَ، قَبْلَ أَنْ لاَ يَكُونَ دِينَارٌ وَلاَ دِرْهَمٌ، إِنْ كَانَ لَهُ عَمَلٌ صَالِحٌ أُخِذَ مِنْهُ بِقَدْرِ مَظْلَمَتِهِ، وَإِنْ لَمْ تَكُنْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ سَيِّئَاتِ صَاحِبِهِ فَحُمِلَ عَلَيْهِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ إِنَّمَا سُمِّيَ الْمَقْبُرِيَّ لأَنَّهُ كَانَ نَزَلَ نَاحِيَةَ الْمَقَابِرِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَسَعِيدٌ الْمَقْبُرِيُّ هُوَ مَوْلَى بَنِي لَيْثٍ، وَهُوَ سَعِيدُ بْنُ أَبِي سَعِيدٍ، وَاسْمُ أَبِي سَعِيدٍ كَيْسَانُ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Whoever has oppressed another person concerning his reputation or anything else, he should beg him to forgive him before the Day of Resurrection when there will be no money (to compensate for wrong deeds), but if he has good deeds, those good deeds will be taken from him according to his oppression which he has done, and if he has no good deeds, the sins of the oppressed person will be loaded on him",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا، انہوں نے کہا ہم سے سعید مقبری نے بیان کیا، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اگر کسی شخص کا ظلم کسی دوسرے کی عزت پر ہو یا کسی طریقہ ( سے ظلم کیا ہو ) تو آج ہی، اس دن کے آنے سے پہلے معاف کرا لے جس دن نہ دینار ہوں گے، نہ درہم، بلکہ اگر اس کا کوئی نیک عمل ہو گا تو اس کے ظلم کے بدلے میں وہی لے لیا جائے گا اور اگر کوئی نیک عمل اس کے پاس نہیں ہو گا تو اس کے ( مظلوم ) ساتھی کی برائیاں اس پر ڈال دی جائیں گی۔ ابوعبدللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ اسماعیل بن ابی اویس نے کہا سعید مقبری کا نام مقبری اس لیے ہوا کہ قبرستان کے قریب انہوں نے قیام کیا تھا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ سعید مقبری ہی بنی لیث کے غلام ہیں۔ پورا نام سعید بن ابی سعید ہے اور ( ان کے والد ) ابوسعید کا نام کیسان ہے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d'Allah (ﷺ) a dit : « Celui qui a fait du tort à une autre personne, que ce soit concernant sa réputation ou autre chose, doit lui demander pardon avant le Jour de la Résurrection, car ce jour-là il n’y aura plus d’argent pour compenser les mauvaises actions. Si la personne a de bonnes actions, elles seront prises de lui en fonction du tort qu’il a causé. S’il n’a pas de bonnes actions, les péchés de la victime seront transférés sur lui. »",
          "id": "Telah menceritakan kepada kami [Adam bin Abi Iyas] telah menceritakan kepada kami [Ibnu Abi Dza'bi] telah menceritakan kepada kami [Sa'id Al Maqburiy] dari [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang pernah berbuat aniaya (zhalim) terhadap kehormatan saudaranya atau sesuatu apapun hendaklah dia meminta kehalalannya (maaf) pada hari ini (di dunia) sebelum datang hari yang ketika itu tidak bermanfaat dinar dan dirham. Jika dia tidak lakukan, maka (nanti pada hari qiyamat) bila dia memiliki amal shalih akan diambil darinya sebanyak kezholimannya. Apabila dia tidak memiliki kebaikan lagi maka keburukan saudaranya yang dizholiminya itu akan diambil lalu ditimpakan kepadanya\". Berkata, Abu 'Abdullah Al Bukhariy berkata, Isma'il bin Abi Uwais: \"Sa'id dipangil namanya dengan Al Maqburiy karena dia pernah tinggal di pinggiran maqabir (kuburan). Berkata, Abu 'Abdullah Al Bukhariy: Dan Sa'id Al Maqburiy adalah maula Bani Laits yang nama aslinya adalah Sa'id bin Abi Sa'id sedangkan nama Abu Sa'id adalah Kaisan",
          "tr": "Said el-Makburi kanalıyla Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Biriniz, namus veya herhangi bir konuda kardeşine haksızlık yaptıysa altının ve gümüşün fayda etmeyeceği gün gelmeden önce ondan helallik dilesin. O gün geldiğinde iyiliği varsa yaptığı haksızlık kadar iyilik ondan alınır. İyiliği yoksa haksızlık ettiği kardeşinin kötülüklerinden alınıp ona yüklenir. \" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 10
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2450,
      "arabicNumber": 2450,
      "book": 46,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ قَالَتِ الرَّجُلُ تَكُونُ عِنْدَهُ الْمَرْأَةُ، لَيْسَ بِمُسْتَكْثِرٍ مِنْهَا، يُرِيدُ أَنْ يُفَارِقَهَا، فَتَقُولُ أَجْعَلُكَ مِنْ شَأْنِي فِي حِلٍّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ‏.‏",
        "translations": {
          "en": "Narrated Aisha:Regarding the explanation of the following verse:-- \"If a wife fears Cruelty or desertion On her husband's part.\" (4.128) A man may dislike his wife and intends to divorce her, so she says to him, \"I give up my rights, so do not divorce me.\" The above verse was revealed concerning such a case",
          "ur": "ہم سے محمد نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں ان کے باپ نے، اور ان سے عائشہ رضی اللہ عنہا نے ( قرآن مجید کی آیت ) «وإن امرأة خافت من بعلها نشوزا أو إعراضا‏» ”اگر کوئی عورت اپنے شوہر کی طرف سے نفرت یا اس کے منہ پھیرنے کا خوف رکھتی ہو“ کے بارے میں فرمایا کہ کسی شخص کی بیوی ہے لیکن شوہر اس کے پاس زیادہ آتا جاتا نہیں بلکہ اسے جدا کرنا چاہتا ہے اس پر اس کی بیوی کہتی ہے کہ میں اپنا حق تمہیں معاف کرتی ہوں۔ اسی بارے میں یہ آیت نازل ہوئی۔",
          "fr": "Rapporté par Aisha : À propos de l’explication du verset suivant : « Si une femme craint la cruauté ou l’abandon de la part de son mari » (4.128), il arrive qu’un homme n’aime plus sa femme et veuille divorcer. Alors, elle lui dit : « Je renonce à mes droits, mais ne me divorce pas. » Ce verset a été révélé dans ce genre de situation",
          "id": "Telah menceritakan kepada kami [Muhamamad] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah radliallahu 'anha] tentang ayat ini QS An-Nisaa: 128): (\"Apabila seorang isteri takut suaminya akan berbuat nusyuz (tidak mau menggaulinya) atau berlaku kasar terhadapnya\"), dia ('Aisyah radliallahu 'anha) berkata: \"Yaitu jika seorang suami yang memiliki isteri namun dia tidak lagi mencintai dan menggaulinya serta berkehendak untuk menceraikanya lalu isterinya berkata, \"aku persilakan kamu meninggalkan aku namun jangan ceraikan aku\", maka turunlah ayat ini",
          "tr": "Aişe r.anha'dan nakledilmiştir: Hz. Aişe, \"Eğer bir kadın kocasının geçimsizliğinden veya kendisinden yüz çevirmesinden endişe ederse aralarında bir sulh yapmalarında onlara bir günah yoktur\" (Nisa 128) ayetinin iniş sebebi hakkında şöyle demiştir: Evli bir erkek eşiyle aynı evde oturuyordu. Ancak onunla çokça cinsel ilişkiye girmiyor ve ondan ayrılmak istiyordu. Bunun üzerine eşi \"Sana kendimle ilgili bütün haklarımı helal ediyorum\" demişti. Bunun üzerine bu ayet indi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 11
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 2451,
      "arabicNumber": 2451,
      "book": 46,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ، فَشَرِبَ مِنْهُ وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ، فَقَالَ لِلْغُلاَمِ ‏ \"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏‏.‏ فَقَالَ الْغُلاَمُ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا‏.‏ قَالَ فَتَلَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَدِهِ‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Sa`d As-Sa`idi:A drink (milk mixed with water) was brought to Allah's Messenger (ﷺ) who drank some of it. A boy was sitting to his right, and some old men to his left. Allah's Messenger (ﷺ) said to the boy, \"Do you allow me to give the rest of the drink to these people?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" Allah's Messenger (ﷺ) then handed the bowl (of drink) to the boy. (See Hadith No)",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابوحازم بن دینار نے اور انہیں سہل بن سعد ساعدی رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں دودھ یا پانی پینے کو پیش کیا گیا۔ آپ صلی اللہ علیہ وسلم نے اسے پیا۔ آپ صلی اللہ علیہ وسلم کے دائیں طرف ایک لڑکا تھا اور بائیں طرف بڑی عمر والے تھے۔ لڑکے سے آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم مجھے اس کی اجازت دو گے کہ ان لوگوں کو یہ ( پیالہ ) دے دوں؟ لڑکے نے کہا، نہیں اللہ کی قسم! یا رسول اللہ! آپ کی طرف سے ملنے والے حصے کا ایثار میں کسی پر نہیں کر سکتا۔ راوی نے بیان کیا کہ آخر رسول اللہ صلی اللہ علیہ وسلم نے وہ پیالہ اسی لڑکے کو دے دیا۔",
          "fr": "Rapporté par Sahl bin Sa`d As-Sa`idi : On a apporté une boisson (du lait mélangé avec de l’eau) au Messager d’Allah (ﷺ), qui en a bu un peu. Un garçon était assis à sa droite et des hommes âgés à sa gauche. Le Messager d’Allah (ﷺ) a dit au garçon : « Me permets-tu de donner le reste de la boisson à ces personnes ? » Le garçon a répondu : « Ô Messager d’Allah (ﷺ) ! Je ne laisserai personne passer avant moi pour boire ce qu’il reste après toi. » Le Messager d’Allah (ﷺ) a alors tendu le bol au garçon",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Abu Hazim bin Dinar] dari [Sahal bin Sa'ad As-Sa'idiy radliallahu 'anhu] bahwa kepada Rasulullah shallallahu 'alaihi wasallam disuguhkan minuman, lalu Beliau meminumnya sementara disamping kanan Beliau ada seorang anak kecil sedangkan di sebelah kiri Beliau ada para orang-orang tua. Maka Beliau berkata, kepada anak kecil itu: \"Apakah kamu mengizinkan aku untuk memberi minuman ini kepada mereka?\" Anak kecil itu berkata: \"Demi Allah, tidak wahai Rasulullah, aku tidak akan mendahulukan seorangpun daripadaku selain anda\". Maka Beliau memberikan kepadanya",
          "tr": "Sa'd es-Saidı'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'e bir su getirildi. O da sudan içti. Sağında (suyu getiren) delikanlı; solunda ise yaşlılar vardı. Hz. Nebi delikanlıya: \"Bunlara da su vermeme izin verir misin?\" buyurdu. Delikanlı \"Hayır, Allah'a yemin olsun ki, senden gelecek nasibimi kimseye değişmem\" dedi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem suyu çocuğun eline bıraktı. Not: Başlıkta geçen \"izin verdiğinde\" ifadesi \"hakkını başkasının almasına izin verdiğinde\" anlamındadır. Bu konu Müsakat bölümünde (2366. hadiste) ele alınmıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 12
      },
      "narrator": {
        "en": "Sahl bin Sa`d As-Sa`idi"
      }
    },
    {
      "hadithNumber": 2452,
      "arabicNumber": 2452,
      "book": 46,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي طَلْحَةُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَمْرِو بْنِ سَهْلٍ، أَخْبَرَهُ أَنَّ سَعِيدَ بْنَ زَيْدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ ظَلَمَ مِنَ الأَرْضِ شَيْئًا طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Sa`id bin Zaid:Allah's Messenger (ﷺ) said, \"Whoever usurps the land of somebody unjustly, his neck will be encircled with it down the seven earths (on the Day of Resurrection)",
          "ur": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہوں نے کہا کہ ہم سے زہری نے بیان کیا، ان سے طلحہ بن عبداللہ نے بیان کیا، انہیں عبدالرحمٰن بن عمرو بن سہل نے خبر دی اور ان سے سعید بن زید رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی کی زمین ظلم سے لے لی، اسے قیامت کے دن سات زمینوں کا طوق پہنایا جائے گا۔",
          "fr": "Rapporté par Sa`id bin Zaid : Le Messager d’Allah (ﷺ) a dit : « Celui qui s’approprie injustement la terre de quelqu’un, un collier fait de cette terre l’enserrera jusqu’aux sept terres le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata, telah menceritakan kepadaku [Tholhah bin 'Abdullah] bahwa ['Abdurrahman bin 'Amru bin Sahal] mengabarkan kepadanya bahwa [Sa'id bin Zaid radliallahu 'anhu] berkata, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang pernah berbuat aniaya terhadap sebidang tanah (di muka bumi ini) maka nanti dia akan dibebani (dikalungkan pada lehernya) tanah dari tujuh bumi",
          "tr": "Said İbn Yezıd r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: \"Her kim bir arsaya haksız yere el koyarsa boynuna o tarlanın yedi katı takılır. \" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 13
      },
      "narrator": {
        "en": "Sa`id bin Zaid"
      }
    },
    {
      "hadithNumber": 2453,
      "arabicNumber": 2453,
      "book": 46,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حُسَيْنٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ أَنَّهُ، كَانَتْ بَيْنَهُ وَبَيْنَ أُنَاسٍ خُصُومَةٌ، فَذَكَرَ لِعَائِشَةَ ـ رضى الله عنها ـ فَقَالَتْ يَا أَبَا سَلَمَةَ اجْتَنِبِ الأَرْضَ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ ظَلَمَ قِيدَ شِبْرٍ مِنَ الأَرْضِ طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Salama:That there was a dispute between him and some people (about a piece of land). When he told `Aisha about it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet (ﷺ) said, 'Whoever usurps even one span of the land of somebody, his neck will be encircled with it down the seven earths",
          "ur": "ہم سے ابومعمر نے بیان کیا، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا، ان سے حسین نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے کہ مجھ سے محمد بن ابراہیم نے بیان کیا، ان سے ابوسلمہ نے بیان کیا کہ ان کے اور بعض دوسرے لوگوں کے درمیان ( زمین کا ) جھگڑا تھا۔ اس کا ذکر انہوں نے عائشہ رضی اللہ عنہا سے کیا تو انہوں نے بتلایا، ابوسلمہ! زمین سے پرہیز کر نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اگر کسی شخص نے ایک بالشت بھر زمین بھی کسی دوسرے کی ظلم سے لے لی تو سات زمینوں کا طوق ( قیامت کے دن ) اس کے گردن میں ڈالا جائے گا۔",
          "fr": "Rapporté par Abu Salama : Il y a eu un différend entre moi et d’autres personnes à propos d’un terrain. Quand j’en ai parlé à `Aisha, elle m’a dit : « Ô Abu Salama ! Évite de prendre la terre injustement, car le Prophète (ﷺ) a dit : “Celui qui s’approprie ne serait-ce qu’une poignée de la terre de quelqu’un, un collier fait de cette terre l’enserrera jusqu’aux sept terres.” »",
          "id": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami ['Abdul Warits] telah menceritakan kepada kami [Husain] dari [Yahya bin Abi Katsir] berkata, telah menceritakan kepadaku [Muhammad bin Ibrahim] bahwa [Abu Salamah] menceritakan kepadanya bahwa dia pernah bertengkar dengan seseorang lalu diceritakan hal ini kepada 'Aisyah radliallahu 'anha, maka ['Aisyah radliallahu 'anha] berkata: \"Wahai Abu Salamah hindarkanlah bertengkar dalam urusan tanah karena Nabi shallallahu 'alaihi wasallam pernah bersabda: \"Siapa yang pernah berbuat aniaya sejengkal saja (dalam perkara tanah) maka nanti dia akan dibebani (dikalungkan pada lehernya) tanah dari tujuh petala bumi",
          "tr": "Muhammed b. İbrahim'den rivayet edildiğine göre, Ebu Seleme ona, kendisinin bazı insanlarla arsa yüzünden sorunlarının olduğunu, bunu Hz. Aişe r.anha'ya anlatınca onun şöyle dediğini haber vermiştir: \"Ey Ebu Seleme, o arsadan uzak dur. Çünkü Nebi Sallallahu Aleyhi ve Sellem, \"Her kim, bir karış dahi olsa (gasben başkasının) arazisinin sınırlarına haksız olduğu halde girerse, yedi kat yerin dibine kadar boynuna dolandırılarak cezalandırılır\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 14
      },
      "narrator": {
        "en": "Abu Salama"
      }
    },
    {
      "hadithNumber": 2454,
      "arabicNumber": 2454,
      "book": 46,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَخَذَ مِنَ الأَرْضِ شَيْئًا بِغَيْرِ حَقِّهِ خُسِفَ بِهِ يَوْمَ الْقِيَامَةِ إِلَى سَبْعِ أَرَضِينَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا الْحَدِيثُ لَيْسَ بِخُرَاسَانَ فِي كِتَابِ ابْنِ الْمُبَارَكِ، أَمْلاَهُ عَلَيْهِمْ بِالْبَصْرَةِ‏.‏",
        "translations": {
          "en": "Narrated Salim's father (i.e. `Abdullah):The Prophet (ﷺ) said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven earths on the Day of Resurrection",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے عبداللہ بن مبارک نے بیان کیا، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا سالم سے اور ان سے ان کے والد ( عبداللہ بن عمر رضی اللہ عنہما ) نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، جس شخص نے ناحق کسی زمین کا تھوڑا سا حصہ بھی لے لیا، تو قیامت کے دن اسے سات زمینوں تک دھنسایا جائے گا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ یہ حدیث عبداللہ بن مبارک کی اس کتاب میں نہیں ہے جو خراسان میں تھی۔ بلکہ اس میں تھی جسے انہوں نے بصرہ میں اپنے شاگردوں کو املا کرایا تھا۔",
          "fr": "Rapporté par le père de Salim (c’est-à-dire `Abdullah) : Le Prophète (ﷺ) a dit : « Celui qui prend injustement une parcelle de la terre d’autrui sera englouti jusqu’aux sept terres le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami ['Abdullah bin Al Mubarak] telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Salim] dari [bapaknya] radliallahu 'anhu berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang mengambil sesuatu (sebidang tanah) dari bumi yang bukan haknya maka pada hari qiyamat nanti dia akan dibenamkan sampai tujuh bumi",
          "tr": "Salim kanalıyla babasından r.a. rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem: \"Her kim haksız yere bir tarlaya el koyarsa kıyamet günü yedi kat yerin altına geçirilir\" buyurmuştur. Firebri şöyle der: Ebu Ca'fer İbn Ebu Hatim Ebu Abdullah'ın şöyle dediğini nakletmiştir: \"Bu hadis Horasan'da İbnü'l-Mübarek'in hadis defterlerinde mevcut değildir. Onlara Basra'da yazdırılmıştır.\" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 15
      },
      "narrator": {
        "en": "Salim's father (i.e. `Abdullah)"
      }
    },
    {
      "hadithNumber": 2455,
      "arabicNumber": 2455,
      "book": 46,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ جَبَلَةَ، كُنَّا بِالْمَدِينَةِ فِي بَعْضِ أَهْلِ الْعِرَاقِ، فَأَصَابَنَا سَنَةٌ، فَكَانَ ابْنُ الزُّبَيْرِ يَرْزُقُنَا التَّمْرَ، فَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَمُرُّ بِنَا فَيَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الإِقْرَانِ، إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ مِنْكُمْ أَخَاهُ‏.‏",
        "translations": {
          "en": "Narrated Jabala:\"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az-Zubair used to give us dates. Ibn `Umar used to pass by and say, \"The Prophet (ﷺ) forbade us to eat two dates at a time, unless one takes the permission of one's companions",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے جبلہ نے بیان کیا کہ ہم بعض اہل عراق کے ساتھ مدینہ میں مقیم تھے۔ وہاں ہمیں قحط میں مبتلا ہونا پڑا۔ عبداللہ بن زبیر رضی اللہ عنہما کھانے کے لیے ہمارے پاس کھجور بھجوایا کرتے تھے۔ اور عبداللہ بن عمر رضی اللہ عنہما جب ہماری طرف سے گزرتے تو فرماتے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( دوسرے لوگوں کے ساتھ مل کر کھاتے وقت ) دو کھجور کو ایک ساتھ ملا کر کھانے سے منع فرمایا ہے مگر یہ کہ تم میں سے کوئی شخص اپنے بھائی سے اجازت لے لے۔",
          "fr": "Rapporté par Jabala : Nous étions à Médine avec des gens d’Irak et nous avons souffert de la famine. Ibn Az-Zubair nous donnait des dattes. Ibn `Umar passait et disait : « Le Prophète (ﷺ) nous a interdit de manger deux dattes à la fois, sauf si on a la permission de ses compagnons. »",
          "id": "Telah menceritakan kepada kami [Hafzh bin 'Umar] telah menceritakan kepada kami [Syu'bah] dari [Jabalah]; Kami pernah tinggal di Madinah bersama orang-orang dari penduduk 'Iraq selama setahun yang Ibnu Az Zubair memberi kami rezeki berupa kurma. Suatu hari [Ibnu 'Umar] radliallahu 'anhuma berjalan melewati kami lalu dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang qiran (mengambil dua dua kurma sekaligus ketika memakannya) kecuali bila seseorang dari kalian meminta izin kepada saudaranya",
          "tr": "Cebele'den rivayet edilmiştir: Bazı Iraklılarla birlikte Medine'deydik. Kıtlık oldu. Abdullah İbn Zübeyr bize kuru hurma veriyordu. Abdullah İbn Ömer de yoldan geçerken bize uğruyor ve \"Allah Resulü, kişinin yanındakilerden izin istemeden, hurmaları ikişer ikişer yemeyi yasaklamıştır\" diyordu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 16
      },
      "narrator": {
        "en": "Jabala"
      }
    },
    {
      "hadithNumber": 2456,
      "arabicNumber": 2456,
      "book": 46,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو شُعَيْبٍ كَانَ لَهُ غُلاَمٌ لَحَّامٌ فَقَالَ لَهُ أَبُو شُعَيْبٍ اصْنَعْ لِي طَعَامَ خَمْسَةٍ لَعَلِّي أَدْعُو النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ‏.‏ وَأَبْصَرَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم الْجُوعَ ـ فَدَعَاهُ، فَتَبِعَهُمْ رَجُلٌ لَمْ يُدْعَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ هَذَا قَدِ اتَّبَعَنَا أَتَأْذَنُ لَهُ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏",
        "translations": {
          "en": "Narrated Abu Mas`ud:There was an Ansari man called Abu Shu'aib who had a slave butcher. Abu Shu'aib said to him, \"Prepare a meal sufficient for five persons so that I might invite the Prophet (ﷺ) besides other four persons.\" Abu Shu'aib had seen the signs of hunger on the face of the Prophet (ﷺ) and so he invited him. Another man who was not invited, followed the Prophet. The Prophet (ﷺ) said to Abu Shu'aib, \"This man has followed us. Do you allow him to share the meal?\" Abu Shu'aib said, \"Yes",
          "ur": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے اعمش نے، ان سے ابووائل نے اور ان سے ابومسعود رضی اللہ عنہ نے کہ انصار میں ایک صحابی جنہیں ابوشعیب رضی اللہ عنہ کہا جاتا تھا، کا ایک قصائی غلام تھا۔ ابوشعیب رضی اللہ عنہ نے ان سے کہا کہ میرے لیے پانچ آدمیوں کا کھانا تیار کر دے، کیونکہ میں نبی کریم صلی اللہ علیہ وسلم کو چار دیگر اصحاب کے ساتھ دعوت دوں گا۔ انہوں نے آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر بھوک کے آثار دیکھے تھے۔ چنانچہ آپ صلی اللہ علیہ وسلم کو انہوں نے بتلایا۔ ایک اور شخص آپ صلی اللہ علیہ وسلم کے ساتھ بن بلائے چلا گیا۔ نبی کریم صلی اللہ علیہ وسلم نے صاحب خانہ سے فرمایا یہ آدمی بھی ہمارے ساتھ آ گیا ہے۔ کیا اس کے لیے تمہاری اجازت ہے؟ انہوں نے کہا جی ہاں اجازت ہے۔",
          "fr": "Rapporté par Abu Mas`ud : Il y avait un homme ansar nommé Abu Shu'aib qui avait un esclave boucher. Abu Shu'aib lui a dit : « Prépare un repas pour cinq personnes afin que je puisse inviter le Prophète (ﷺ) et quatre autres personnes. » Abu Shu'aib avait remarqué des signes de faim sur le visage du Prophète (ﷺ), alors il l’a invité. Un autre homme, qui n’était pas invité, a suivi le Prophète. Le Prophète (ﷺ) a dit à Abu Shu'aib : « Cet homme nous a suivis. Est-ce que tu acceptes qu’il partage le repas ? » Abu Shu'aib a répondu : « Oui. »",
          "id": "Telah menceritakan kepada kami [Abu An-Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Abu Wa'il] dari [Abu Mas'ud]: \"Ada seorang Kaum Anshar yang biasa dipanggil dengan Abu Syu'aib memiliki pembantu sebagai tukang potong hewan (jagal). Berkata Abu Syu'aib kepadanya: \"Buatkan aku makanan untuk lima orang, karena aku ingin mengundang Nabi shallallahu 'alaihi wasallam sebagai tamu kelimaku\". Dia melihat rasa lapar dari raut muka Beliau\". Lalu ia mengundang Beliau namun ada seseorang yang tidak diundang ikut bersama mereka, lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang ini mengikuti kami, apakah kamu mengizinkannya?\" Dia menjawab: \"Iya",
          "tr": "Ebu Mes'ud r.a.'dan rivayet edilmiştir: Ensardan Ebu Şuayb adında birinin aşçılık yapan bir kölesi vardı. Ebu Şuayb ona \"Bize beş kişilik bir yemek pişir. Belki beşinci kişi olarak Nebi (Sallallahu aleyhi ve Sellem)'i çağırabilirim\" dedi. -Hz. Nebi'in yüzünde açlık belirtileri görmüştü.- Onu yemeğe davet etti. Onlarla birlikte davet edilmemiş biri daha geldi. Nebi Sallallahu Aleyhi ve Sellem: \"Bu adam, bizim peşimize düşüp geldi. Ona da izin veriyor musun?\" buyurdu. O da \"elbette\" dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 17
      },
      "narrator": {
        "en": "Abu Mas`ud"
      }
    },
    {
      "hadithNumber": 2457,
      "arabicNumber": 2457,
      "book": 46,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Aisha:The Prophet (ﷺ) said, \"The most hated person in the sight of Allah is the most quarrelsome person",
          "ur": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے، ان سے ابن ابی ملیکہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اللہ تعالیٰ کے یہاں سب سے زیادہ ناپسند وہ آدمی ہے جو سخت جھگڑالو ہو۔",
          "fr": "Rapporté par `Aisha : Le Prophète (ﷺ) a dit : « La personne la plus détestée par Allah est celle qui se dispute le plus. »",
          "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Abi Mulaikah] dari ['Aisyah radliallahu 'anha] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang paling dimurkai Allah adalah penantang yang paling keras",
          "tr": "Aişe r.anha'dan nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem: \"Allah'ın en sevmediği kişi düşmanlıkta aşırı gidendir\" buyurmuştur. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 18
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 2458,
      "arabicNumber": 2458,
      "book": 46,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّهَا أُمَّ سَلَمَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سَمِعَ خُصُومَةً بِبَابِ حُجْرَتِهِ، فَخَرَجَ إِلَيْهِمْ، فَقَالَ ‏ \"‏ إِنَّمَا أَنَا بَشَرٌ وَإِنَّهُ يَأْتِينِي الْخَصْمُ، فَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ، فَأَحْسِبُ أَنَّهُ صَدَقَ، فَأَقْضِيَ لَهُ بِذَلِكَ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ، فَلْيَأْخُذْهَا أَوْ فَلْيَتْرُكْهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Um Salama:(the wife of the Prophet) Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling. He came out and said, \"I am only a human being, and opponents come to me (to settle their problems); maybe someone amongst you can present his case more eloquently than the other, whereby I may consider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by mistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day of Resurrection)",
          "ur": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا، ان سے صالح بن کیسان نے اور ان سے ابن شہاب نے کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی، انہیں زینب بنت ام سلمہ رضی اللہ عنہما نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے حجرے کے دروازے کے سامنے جھگڑے کی آواز سنی اور جھگڑا کرنے والوں کے پاس تشریف لائے۔ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ میں بھی ایک انسان ہوں۔ اس لیے جب میرے یہاں کوئی جھگڑا لے کر آتا ہے تو ہو سکتا ہے کہ ( فریقین میں سے ) ایک فریق کی بحث دوسرے فریق سے عمدہ ہو، میں سمجھتا ہوں کہ وہ سچا ہے۔ اور اس طرح میں اس کے حق میں فیصلہ کر دیتا ہوں، لیکن اگر میں اس کو ( اس کے ظاہری بیان پر بھروسہ کر کے ) کسی مسلمان کا حق دلا دوں تو دوزخ کا ایک ٹکڑا اس کو دلا رہا ہوں، وہ لے لے یا چھوڑ دے۔",
          "fr": "Rapporté par Um Salama (l’épouse du Prophète) : Le Messager d’Allah (ﷺ) a entendu des gens se disputer devant la porte de sa maison. Il est sorti et a dit : « Je ne suis qu’un être humain, et des gens viennent à moi pour régler leurs problèmes. Il se peut que l’un d’entre vous présente mieux son cas que l’autre, alors je peux croire qu’il a raison et donner un jugement en sa faveur. Donc, si je donne par erreur le droit d’un musulman à un autre, c’est en réalité une part du Feu (de l’Enfer) qu’il peut choisir de prendre ou de refuser avant le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah] berkata, telah menceritakan kepadaku [Ibrahim bin Sa'ad] dari [Shalih] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku ['Urwah bin Az Zubair] bahwa [Zainab bunti Ummu Salamah] mengabarkan kepadanya bahwa ibunya, [Ummu Salamah radliallahu 'anhah], isteri Nabi shallallahu 'alaihi wasallam mengabarkan kepadanya dari Rasulullah shallallahu 'alaihi wasallam bahwa Beliau mendengar dari balik pintu rumah Beliau ada pertengkaran lalu Beliau keluar menemui mereka kemudian bersabda: \"Aku ini hanyalah manusia biasa dan sesungguhnya pertangkaran seringkali dilaporkan kepadaku. Dan bisa salah seorang diantara kalian lebih pandai bersilat lidah daripada lainnya, lalu aku menganggap dia benar kemudian aku berikan kepadanya sesuai pengakuannya itu. Maka siapa yang aku putuskan menang dengan mencederai hak seorang muslim, berarti itu adalah potongan dari api neraka. Karena itu hendaklah dia ambil atau ditinggalkannya",
          "tr": "Urve bin Zübeyr Ümmü Seleme'nin kızı Zeyneb binti Ümmü Seleme'den o, annesi olan Nebi (s.a.v.)'in eşi Ümmü Seleme r.anha validemizden şöyle nakletmiştir: Nebi Sallallahu Aleyhi ve Sellem odasının kapısında bir çekişme gördü. Onların yanına çıktı ve: \"Hiç kuşkusuz ben de bir insanım. Anlaşamayanlar bana gelir. Sizden kimileri konuşmayı daha iyi becerebilir. Ben de onun doğru söylediğini sanırım ve onun lehine karar veririm. Bir Müslümanın hakkını sizden her kime vermişsem o hak ateşten bir parçadır. Artık ister onu alsın, ister bıraksın .\" buyurdu. Tekrar: 2680, 6967, 7169, 7185 Not: Bu hadis hakkında ayrıntılı açıklama Ahkam bölümünde (7181. hadiste) gelecektir, İNŞAALLAH باب: إذا خاصم فجر. 17. \"ÇEKİŞTİĞİNDE KÖTÜ SÖZ SÖYLER"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 19
      },
      "narrator": {
        "en": "Um Salama"
      }
    },
    {
      "hadithNumber": 2459,
      "arabicNumber": 2459,
      "book": 46,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا، أَوْ كَانَتْ فِيهِ خَصْلَةٌ مِنْ أَرْبَعَةٍ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ، حَتَّى يَدَعَهَا إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا عَاهَدَ غَدَرَ، وَإِذَا خَاصَمَ فَجَرَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Amr:The Prophet (ﷺ) said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has one of the following four characteristics will have one characteristic of hypocrisy until he gives it up. These are: (1 ) Whenever he talks, he tells a lie; (2) whenever he makes a promise, he breaks it; (3) whenever he makes a covenant he proves treacherous; (4) and whenever he quarrels, he behaves impudently in an evil insulting manner.\" (See Hadith No. 33 Vol)",
          "ur": "ہم سے بشر بن خالد نے بیان کیا کہا ہم کو محمد نے خبر دی شعبہ سے، انہیں سلیمان نے، انہیں عبداللہ بن مرہ نے، انہیں مسروق نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا چار خصلتیں ایسی ہیں کہ جس شخص میں بھی وہ ہوں گی، وہ منافق ہو گا۔ یا ان چار میں سے اگر ایک خصلت بھی اس میں ہے تو اس میں نفاق کی ایک خصلت ہے۔ یہاں تک کہ وہ اسے چھوڑ دے۔ جب بولے تو جھوٹ بولے، جب وعدہ کرے تو پورا نہ کرے، جب معاہدہ کرے تو بے وفائی کرے، اور جب جھگڑے تو بد زبانی پر اتر آئے۔",
          "fr": "Rapporté par `Abdullah bin `Amr : Le Prophète (ﷺ) a dit : « Celui qui possède ces quatre caractéristiques sera un hypocrite, et celui qui en a une aura un trait d’hypocrisie jusqu’à ce qu’il l’abandonne : (1) Quand il parle, il ment ; (2) quand il promet, il ne tient pas sa promesse ; (3) quand il fait un engagement, il trahit ; (4) et quand il se dispute, il se comporte de façon grossière et insultante. »",
          "id": "Telah menceritakan kepada kami [Bisyir bin Khalid] telah mengabarkan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Sulaiman] dari [Abdullah bin Murrah] dari [Masruq] dari ['Abdullah bin 'Umar radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Ada empat hal yang bila ada pada seseorang berarti dia adalah munafiq atau siapa yang memiliki empat kebiasaan (tabi'at) berarti itu tabiat munafiq sampai dia meninggalkannya, yaitu jika berbicara dusta, jika berjanji ingkar, jika membuat kesepakatan khiyanat dan jika bertengkar (ada perselisihan) maka dia curang",
          "tr": "Abdullah İbn Amr r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Dört özellik var ki, bu özellikler her kimde bulunursa münafık olur. Bu özelliklerden birisinin bulunduğu kişide ise münafıklık alametlerinden biri bulunur, ta ki bunu terk edinceye kadar: Konuştuğunda yalan söyler; vaad ettiğinde vaadine uymaz; biriyle sözleştiğinde sözleşmeyi bozar ve çekiştiğinde kötü söz söyler.\" Not: Bu hadis ile ilgili açıklama İman bölümünde geçmiştir.(34. hadis)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 20
      },
      "narrator": {
        "en": "`Abdullah bin `Amr"
      }
    },
    {
      "hadithNumber": 2460,
      "arabicNumber": 2460,
      "book": 46,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ هِنْدُ بِنْتُ عُتْبَةَ بْنِ رَبِيعَةَ، فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ عِيَالَنَا فَقَالَ ‏ \"‏ لاَ حَرَجَ عَلَيْكِ أَنْ تُطْعِمِيهِمْ بِالْمَعْرُوفِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Aisha:Hind bint `Utba (Abu Sufyan's wife) came and said, \"O Allah's Messenger (ﷺ)! Abu Sufyan is a miser. Is there any harm if I spend something from his property for our children?\" He said, there is no harm for you if you feed them from it justly and reasonably (with no extravagance)",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، ان سے عروہ نے بیان کیا، اور ان سے عائشہ رضی اللہ عنہا نے کہ عتبہ بن ربیعہ کی بیٹی ہند رضی اللہ عنہا حاضر خدمت ہوئیں اور عرض کیا، یا رسول اللہ! ابوسفیان ( جو ان کے شوہر ہیں وہ ) بخیل ہیں۔ تو کیا اس میں کوئی حرج ہے اگر میں ان کے مال میں سے لے کر اپنے بال بچوں کو کھلایا کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم دستور کے مطابق ان کے مال سے لے کر کھلاؤ تو اس میں کوئی حرج نہیں۔",
          "fr": "Rapporté par Aisha : Hind bint `Utba (l’épouse d’Abu Sufyan) est venue et a dit : « Ô Messager d’Allah (ﷺ) ! Abu Sufyan est avare. Est-ce que je peux prendre de ses biens pour nos enfants ? » Il a répondu : « Il n’y a pas de mal à ce que tu leur donnes à manger de façon juste et raisonnable, sans excès. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] telah menceritakan kepadaku ['Urwah] dari ['Aisyah radliallahu 'anha] berkata; Hindun binti 'Utbah datang menemui Rasulullah shallallahu 'alaihi wasallam lalu berkata: \"Abu Sufyan adalah seorang yang kikir, apakah aku berdosa bila aku ambil dari hartanya untuk memberi makan keluarga kami? '. Maka Beliau bersabda: \"Tidak dosa atasmu jika kamu beri makan mereka dengan cara yang ma'ruf (wajar)",
          "tr": "Urve'den rivayet edilmiştir: Aişe r.anha şöyle demiştir: Hind binti Utbe İbn Rebıa geldi ve \"Ey Allah'ın Resulül Ebu Süfyan çok cimri bir adam. Onun (haberi olmadan) malından çocuklarımıza yedirmemin bir zararı var mıdır?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem de \"Onlara örf’ün gerektirdiği kadar yedirmenin bir zararı yoktur\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 21
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 2461,
      "arabicNumber": 2461,
      "book": 46,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ قُلْنَا لِلنَّبِيِّ صلى الله عليه وسلم إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ لاَ يَقْرُونَا فَمَا تَرَى فِيهِ فَقَالَ لَنَا ‏ \"‏ إِنْ نَزَلْتُمْ بِقَوْمٍ، فَأُمِرَ لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا، فَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Uqba bin 'Amir:We said to the Prophet, \"You send us out and it happens that we have to stay with people who do not entertain us. What do you think about it? He said to us, \"If you stay with some people and they entertain you as they should for a guest, accept their hospitality, but if they don't, take the right of the guest from them",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث نے بیان کیا، کہا کہ مجھ سے یزید نے بیان کیا، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ ہم نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا آپ ہمیں مختلف ملک والوں کے پاس بھیجتے ہیں اور ( بعض دفعہ ) ہمیں ایسے لوگوں کے پاس جانا پڑتا ہے کہ وہ ہماری ضیافت تک نہیں کرتے۔ آپ کی ایسے مواقع پر کیا ہدایت ہے؟ آپ صلی اللہ علیہ وسلم نے ہم سے فرمایا، اگر تمہارا قیام کسی قبیلے میں ہو اور تم سے ایسا برتاؤ کیا جائے جو کسی مہمان کے لیے مناسب ہے تو تم اسے قبول کر لو، لیکن اگر وہ نہ کریں تو تم خود مہمانی کا حق ان سے وصول کر لو۔",
          "fr": "Rapporté par `Uqba bin 'Amir : Nous avons dit au Prophète : « Tu nous envoies parfois chez des gens qui ne nous accueillent pas. Qu’en penses-tu ? » Il nous a répondu : « Si vous séjournez chez des gens et qu’ils vous accueillent comme il se doit, acceptez leur hospitalité. Mais s’ils ne le font pas, prenez ce qui revient de droit à l’invité. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] berkata, telah menceritakan kepadaku [Yazid] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] berkata; Kami bertanya kepada Nabi shallallahu 'alaihi wasallam: Bila anda mengutus kami dalam suatu perjalanan lalu kami singgah di suatu kaum (kampung) namun mereka tidak melayani kami (memberikan hak tamu) apa pendapat anda dalam masalah ini?\" Maka Beliau bersabda: \"Bagi kita, bila kalian singgah di suatu kaum diperintahkan bagi kalian untuk mendapatkan apa yang seharusnya didapat sebagai tamu, maka mintalah kepada mereka. Bila mereka tidak menunaikannya ambillah dari mereka sebatas hak tamu",
          "tr": "Ukbe İbn Amir r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e \"Siz bazen bizi bir yerlere görevli olarak gönderiyorsunuz ve biz de bir kabileye konaklıyoruz. Ama bizi ağırlamıyorlar. Bu konuda ne buyurursunuz?\" dedik. \"Bir kabileye konakladığınız zaman sizi misafir ederlerse onların ikramlarını kabul ediniz. Yok eğer böyle yapmazlarsa o zaman misafirin hakkı ne ise onu alınız\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 22
      },
      "narrator": {
        "en": "`Uqba bin 'Amir"
      }
    },
    {
      "hadithNumber": 2462,
      "arabicNumber": 2462,
      "book": 46,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي مَالِكٌ،‏.‏ وَأَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ حِينَ تَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم إِنَّ الأَنْصَارَ اجْتَمَعُوا فِي سَقِيفَةِ بَنِي سَاعِدَةَ، فَقُلْتُ لأَبِي بَكْرٍ انْطَلِقْ بِنَا‏.‏ فَجِئْنَاهُمْ فِي سَقِيفَةِ بَنِي سَاعِدَةَ‏.‏",
        "translations": {
          "en": "Narrated `Umar:When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani Sa`ida. I said to Abu Bakr, \"Let us go.\" So, we came to them (i.e. to Ansar) at the shed of Bani Sa`ida. (See Hadith No. 19, Vol. 5 for details)",
          "ur": "ہم سے یحییٰ بن سلیمان نے بیان کیا، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا (دوسری سند) اور مجھ کو یونس نے خبر دی کہ ابن شہاب نے کہا، مجھ کو خبر دی عبیداللہ بن عبداللہ بن عتبہ نے، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ عمر رضی اللہ عنہ نے کہا، جب اپنے نبی صلی اللہ علیہ وسلم کو اللہ تعالیٰ نے وفات دے دی تو انصار بنو ساعدہ کے «سقيفة» چوپال میں جمع ہوئے۔ میں نے ابوبکر رضی اللہ عنہ سے کہا کہ آپ ہمیں بھی وہیں لے چلئے۔ چنانچہ ہم انصار کے یہاں سقیفہ بنو ساعدہ میں پہنچے۔",
          "fr": "Rapporté par `Umar : Quand Allah a repris l’âme de Son Prophète à sa mort, les Ansar se sont rassemblés dans la salle de Bani Sa`ida. J’ai dit à Abu Bakr : « Allons-y. » Nous sommes donc allés les voir dans la salle de Bani Sa`ida. (Voir Hadith n°19, vol. 5 pour plus de détails)",
          "id": "Telah menceritakan kepada kami [Yahya bin Sulaiman] berkata, telah menceritakan kepadaku [Ibnu Wahb] berkata, telah menceritakan kepadaku [Malik] telah menceritakan kapadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kapadaku ['Ubaidullah bin 'Abdullah bin 'Utbah] bahwa [Ibnu 'Abbas] mengabarkan kepadanya dari ['Umar] radliallahu 'anhum berkata: \"Ketika Allah subhanahu wata'ala mewafatkan nabiNya shallallahu 'alaihi wasallam, orang-orang Anshar berkumpul di aula pertemuan Bani Sa'idah. Maka aku katakan kepada Abu Bakar; \"Mari kita kesana\". Maka kami pun mendatangi mereka di aula pertemuan Bani Sa'idah itu",
          "tr": "Ubeydullah İbn Abdullah İbn Utbe'den rivayet edilmiştir: Abdullah İbn Abbas r.a. ona Ömer r.a. hakkında şunu anlatmıştır: Allah, Resulü Sallallahu Aleyhi ve Sellem'i vefat ettirince ensar Saide oğullarının gölgeliğinde toplandı. Ben Ebu Bekir'e: \"Haydi, biz de gidelim\" dedim ve biz de Saide oğullarının gölgeliğine, onların yanına geldik. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 23
      },
      "narrator": {
        "en": "`Umar"
      }
    },
    {
      "hadithNumber": 2463,
      "arabicNumber": 2463,
      "book": 46,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمْنَعُ جَارٌ جَارَهُ أَنْ يَغْرِزَ خَشَبَهُ فِي جِدَارِهِ ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ‏.‏",
        "translations": {
          "en": "Narrated Al-Araj:Abu Huraira said, \"Allah's Messenger (ﷺ) said, 'No one should prevent his neighbor from fixing a wooden peg in his wall.\" Abu Huraira said (to his companions), \"Why do I find you averse to it? By Allah, I certainly will narrate it to you",
          "ur": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے امام مالک رحمہ اللہ نے، ان سے ابن شہاب نے، ان سے اعرج نے، اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، کوئی شخص اپنے پڑوسی کو اپنی دیوار میں کھونٹی گاڑنے سے نہ روکے۔ پھر ابوہریرہ رضی اللہ عنہ کہا کرتے تھے، یہ کیا بات ہے کہ میں تمہیں اس سے منہ پھیرنے والا پاتا ہوں۔ قسم اللہ! اس کھونٹی کو تمہارے کندھوں کے درمیان گاڑ دوں گا۔",
          "fr": "Rapporté par Al-Araj : Abu Huraira a dit : Le Messager d’Allah (ﷺ) a dit : « Personne ne doit empêcher son voisin de planter une cheville en bois dans son mur. » Abu Huraira a dit (à ses compagnons) : « Pourquoi êtes-vous réticents à cela ? Par Allah, je vais vous le raconter. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seseorang melarang tetangganya untuk menyandarkan kayunya di dinding rumahnya\". Kemudian Abu Hurairah radliallahu 'anhu berkata: \"Jangan sampai aku lihat kalian menolak ketentuan hukum ini. Demi Allah, kalau sampai terjadi, akan aku lempar kayu-kayu itu menimpa samping kalian",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"Komşu, komşusunun duvarına bir tahta koymasına engel olmasın\" buyurmuştur. Sonra Ebu Hureyre şöyle demiştir: \"Niye sizin bundan yüz çevirdiğinizi görüyorum. Allah'a yemin ederim ki ben bu tahtayı sizin omuzlarınız arasına koyacağım\" demiştir. Tekrar: 5627, 5628 Diğer tahric: Tirmizi Ahkan; İbn Mâce, Ahkâm"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 24
      },
      "narrator": {
        "en": "Al-Araj"
      }
    },
    {
      "hadithNumber": 2464,
      "arabicNumber": 2464,
      "book": 46,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ أَبُو يَحْيَى، أَخْبَرَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ كُنْتُ سَاقِيَ الْقَوْمِ فِي مَنْزِلِ أَبِي طَلْحَةَ، وَكَانَ خَمْرُهُمْ يَوْمَئِذٍ الْفَضِيخَ، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُنَادِيًا يُنَادِي ‏\"‏ أَلاَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ ‏\"‏‏.‏ قَالَ فَقَالَ لِي أَبُو طَلْحَةَ اخْرُجْ فَأَهْرِقْهَا، فَخَرَجْتُ فَهَرَقْتُهَا، فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ فَقَالَ بَعْضُ الْقَوْمِ قَدْ قُتِلَ قَوْمٌ وَهْىَ فِي بُطُونِهِمْ‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا‏}‏ الآيَةَ‏.‏",
        "translations": {
          "en": "Narrated Anas:I was the butler of the people in the house of Abu Talha, and in those days drinks were prepared from dates. Allah's Messenger (ﷺ) ordered somebody to announce that alcoholic drinks had been prohibited. Abu Talha ordered me to go out and spill the wine. I went out and spilled it, and it flowed in the streets of Medina. Some people said, \"Some people were killed and wine was still in their stomachs.\" On that the Divine revelation came:-- \"On those who believe And do good deeds There is no blame For what they ate (in the past)",
          "ur": "ہم سے ابویحییٰ محمد بن عبدالرحیم نے بیان کیا، کہا ہم کو عفان بن مسلم نے خبر دی، کہا ہم سے حماد بن زید نے بیان کیا، کہا ہم سے ثابت نے بیان کیا، اور ان سے انس رضی اللہ عنہ نے کہ میں ابوطلحہ رضی اللہ عنہ کے مکان میں لوگوں کو شراب پلا رہا تھا۔ ان دنوں کھجور ہی کی شراب پیا کرتے تھے۔ ( پھر جونہی شراب کی حرمت پر آیت قرآنی اتری ) تو رسول اللہ صلی اللہ علیہ وسلم نے ایک منادی سے ندا کرائی کہ شراب حرام ہو گئی ہے۔ انہوں نے کہا ( یہ سنتے ہی ) ابوطلحہ رضی اللہ عنہ نے کہا کہ باہر لے جا کر اس شراب کو بہا دے۔ چنانچہ میں نے باہر نکل کر ساری شراب بہا دی۔ شراب مدینہ کی گلیوں میں بہنے لگی، تو بعض لوگوں نے کہا، یوں معلوم ہوتا ہے کہ بہت سے لوگ اس حالت میں قتل کر دیئے گئے ہیں کہ شراب ان کے پیٹ میں موجود تھی۔ پھر اللہ تعالیٰ نے یہ آیت نازل فرمائی «ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا‏» ”وہ لوگ جو ایمان لائے اور عمل صالح کئے، ان پر ان چیزوں کا کوئی گناہ نہیں ہے۔ جو پہلے کھا چکے ہیں ( آخر آیت تک ) ۔",
          "fr": "Rapporté par Anas : J’étais le serviteur des gens dans la maison d’Abu Talha, et à cette époque, on préparait des boissons à base de dattes. Le Messager d’Allah (ﷺ) a ordonné à quelqu’un d’annoncer que les boissons alcoolisées étaient interdites. Abu Talha m’a demandé de sortir et de jeter le vin. Je suis sorti et je l’ai versé, il a coulé dans les rues de Médine. Certaines personnes ont dit : « Certains sont morts alors qu’ils avaient encore du vin dans l’estomac. » À ce sujet, la révélation divine est venue : « Ceux qui croient et font de bonnes œuvres ne seront pas blâmés pour ce qu’ils ont consommé (dans le passé). »",
          "id": "Telah menceritakan kepada kami [Muhammad bin 'Abdur Rahim Abu Yahya] telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Tsabit] dari [Anas radliallahu 'anhu]: \"Aku pernah menjamu suatu kaum dengan minuman di rumah Abu Tholhah. Saat itu khamar (arak, minuman keras) mereka adalah Al Fadhikh (arak terbuat dari buah kurma). Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan seorang penyeru untuk menyerukan bahwa khamar telah diharamkan\". Anas berkata: \"Maka Abu Tholhah berkata, kepadaku: \"Keluar dan tumpahkanlah\". Maka aku keluar lalu aku tumpahkan. Maka khamar mengalirdi jalan-jalan kota Madinah. Kemudian sebagian kaum berkata; \"Telah wafat sebagian orang sedangkan di perut mereka masih ada khamar, maka Allah subhanahu wata'ala menurunkan firmanNya (QS Alu 'Imran ayat 93 yang artinya): (Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan yang saleh karena memakan makanan yang telah mereka makan dahulu…)",
          "tr": "Enes r.a.'den rivayet edilmiştir: Ebu Talha'nın evinde sakilik yapıyordum. O gün onların şarabı, hurma koruğu şarabıydı. Allah Resulü'nün emri üzerine tellal: \"İyi biliniz ki şarap haram kılındı\" diye seslendi. Ebu Talha (bana): \"Çık ve bu şarabı dök\" dedi. Ben de çıkıp döktüm. O gün, Medine sokaklarında şarap selleri aktı. İçimizden bazı kimseler: \"İyi ama kimilerimiz karınlarında şarap dolu iken öldürüldü\" dediler. Bunun üzerine Allah: \"İman eden ve iyi iş yapanlara ... tattıklarından dolayı günah yoktur\"[Maide 93] ayetini indirdi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 25
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2465,
      "arabicNumber": 2465,
      "book": 46,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا أَبُو عُمَرَ، حَفْصُ بْنُ مَيْسَرَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالْجُلُوسَ عَلَى الطُّرُقَاتِ ‏\"‏‏.‏ فَقَالُوا مَا لَنَا بُدٌّ، إِنَّمَا هِيَ مَجَالِسُنَا نَتَحَدَّثُ فِيهَا‏.‏ قَالَ ‏\"‏ فَإِذَا أَبَيْتُمْ إِلاَّ الْمَجَالِسَ فَأَعْطُوا الطَّرِيقَ حَقَّهَا ‏\"‏ قَالُوا وَمَا حَقُّ الطَّرِيقِ قَالَ ‏\"‏ غَضُّ الْبَصَرِ، وَكَفُّ الأَذَى، وَرَدُّ السَّلاَمِ، وَأَمْرٌ بِالْمَعْرُوفِ، وَنَهْىٌ عَنِ الْمُنْكَرِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id Al-Khudri:The Prophet (ﷺ) said, \"Beware! Avoid sitting on the roads (ways).\" The people said, \"There is no way out of it as these are our sitting places where we have talks.\" The Prophet (ﷺ) said, \"If you must sit there, then observe the rights of the way.\" They asked, \"What are the rights of the way?\" He said, \"They are the lowering of your gazes (on seeing what is illegal to look at), refraining from harming people, returning greetings, advocating good and forbidding evil",
          "ur": "ہم سے معاذ بن فضالہ نے بیان کیا، انہوں نے کہا ہم سے ابوعمر حفص بن میسرہ نے بیان کیا، اور ان سے زید بن اسلم نے بیان کیا، ان سے عطاء بن یسار نے بیان کیا، اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا راستوں میں بیٹھنے سے بچو۔ صحابہ نے عرض کیا کہ ہم تو وہاں بیٹھنے پر مجبور ہیں۔ وہی ہمارے بیٹھنے کی جگہ ہوتی ہے کہ جہاں ہم باتیں کرتے ہیں۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر وہاں بیٹھنے کی مجبوری ہی ہے تو راستے کا حق بھی ادا کرو۔ صحابہ نے پوچھا اور راستے کا حق کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا، نگاہ نیچی رکھنا، کسی کو ایذاء دینے سے بچنا، سلام کا جواب دینا، اچھی باتوں کے لیے لوگوں کو حکم کرنا اور بری باتوں سے روکنا۔",
          "fr": "Rapporté par Abu Sa`id Al-Khudri : Le Prophète (ﷺ) a dit : « Attention ! Évitez de vous asseoir sur les routes. » Les gens ont dit : « On ne peut pas faire autrement, ce sont nos lieux de discussion. » Le Prophète (ﷺ) a dit : « Si vous devez vous asseoir là, alors respectez les droits de la route. » Ils ont demandé : « Quels sont ces droits ? » Il a répondu : « Baisser le regard (devant ce qu’il est interdit de regarder), ne pas nuire aux gens, rendre le salut, recommander le bien et interdire le mal. »",
          "id": "Telah menceritakan kepada kami [Mu'adz bin Fadhalah] telah menceritakan kepada kami [Abu 'Umar Hafsh bin Maisarah] dari [Zaid bin Aslam] dari ['Atha' bin Yasar] dari [Abu Sa'id AL Khudriy radliallahu 'anhuma] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian duduk duduk di pinggir jalan\". Mereka bertanya: \"Itu kebiasaan kami yang sudah biasa kami lakukan karena itu menjadi majelis tempat kami bercengkrama\". Beliau bersabda: \"Jika kalian tidak mau meninggalkan majelis seperti itu maka tunaikanlah hak jalan tersebut\". Mereka bertanya: \"Apa hak jalan itu?\" Beliau menjawab: \"Menundukkan pandangan, menyingkirkan halangan, menjawab salam dan amar ma'ruf nahiy munkar",
          "tr": "Ebu Said el-Hudri r.a.'den rivayet edilmiştir: Nebi (Sallallahu Aleyhi ve Sellem): \"Yollarda oturmaktan uzak durunuz\" buyurdu. Bunun üzerine \"Bizim yolda oturmaktan başka çaremiz yoktur. Orada buluşur, sohbet ederiz\" dediler. Buna karşılık Nebi (Sallallahu aleyhi ve Sellem): \"O zaman oturma yerlerine geldiğinizde yolun hakkını verin\" buyurdu. \"Yolun hakkı nedir?\" diye sordular. \"Gözü yere indirmek, insanlara sıkıntı vermemek, selam almak ve iyiliği emredip kötülüğü yasaklamaktır\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 26
      },
      "narrator": {
        "en": "Abu Sa`id Al-Khudri"
      }
    },
    {
      "hadithNumber": 2466,
      "arabicNumber": 2466,
      "book": 46,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا رَجُلٌ بِطَرِيقٍ، اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ، ثُمَّ خَرَجَ، فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ، فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ مِنِّي، فَنَزَلَ الْبِئْرَ، فَمَلأَ خُفَّهُ مَاءً، فَسَقَى الْكَلْبَ، فَشَكَرَ اللَّهُ لَهُ، فَغَفَرَ لَهُ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي الْبَهَائِمِ لأَجْرًا فَقَالَ ‏\"‏ فِي كُلِّ ذَاتِ كَبِدٍ رَطْبَةٍ أَجْرٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"A man felt very thirsty while he was on the way, there he came across a well. He went down the well, quenched his thirst and came out. Meanwhile he saw a dog panting and licking mud because of excessive thirst. He said to himself, \"This dog is suffering from thirst as I did.\" So, he went down the well again and filled his shoe with water and watered it. Allah thanked him for that deed and forgave him. The people said, \"O Allah's Messenger (ﷺ)! Is there a reward for us in serving the animals?\" He replied: \"Yes, there is a reward for serving any animate (living being).\" (See Hadith No)",
          "ur": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، ان سے امام مالک نے، ان سے ابوبکر کے غلام سمی نے، ان سے ابوصالح سمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ایک شخص راستے میں سفر کر رہا تھا کہ اسے پیاس لگی۔ پھر اسے راستے میں ایک کنواں ملا اور وہ اس کے اندر اتر گیا اور پانی پیا۔ جب باہر آیا تو اس کی نظر ایک کتے پر پڑی جو ہانپ رہا تھا اور پیاس کی سختی سے کیچڑ چاٹ رہا تھا۔ اس شخص نے سوچا کہ اس وقت یہ کتا بھی پیاس کی اتنی ہی شدت میں مبتلا ہے جس میں میں تھا۔ چنانچہ وہ پھر کنویں میں اترا اور اپنے جوتے میں پانی بھر کر اس نے کتے کو پلایا۔ اللہ تعالیٰ کے ہاں اس کا یہ عمل مقبول ہوا۔ اور اس کی مغفرت کر دی گئی۔ صحابہ نے پوچھا، یا رسول اللہ کیا جانوروں کے سلسلہ میں بھی ہمیں اجر ملتا ہے؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں، ہر جاندار مخلوق کے سلسلے میں اجر ملتا ہے۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Un homme avait très soif en chemin et il a trouvé un puits. Il y est descendu, a bu et est remonté. Il a alors vu un chien haletant qui léchait la terre à cause de la soif. Il s’est dit : “Ce chien souffre de la soif comme moi.” Il est donc redescendu, a rempli sa chaussure d’eau et a donné à boire au chien. Allah l’a remercié pour cet acte et lui a pardonné. » Les gens ont demandé : « Ô Messager d’Allah (ﷺ) ! Y a-t-il une récompense pour nous si nous aidons les animaux ? » Il a répondu : « Oui, il y a une récompense pour tout être vivant que vous aidez. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Sumayya, maula Abu Bakar] dari [Abu Shalih As-Samman] dari [Abu Hurairah radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Ada seorang laki-laki yang sedang berjalan, lalu dia merasakan kehausan yang sangat. Kemudian dia dapatkan sebuah sumur lalu dia turun ke sumur itu lalu minum dari air sumur tersebut. Kemudian dia keluar ternyata didapatkannya seekor anjing yang sedang menjulurkan lidahnya menjilat-jilat tanah karena kehausan. Orang itu berkata: \"Anjing ini sedang kehausan seperti yang aku alami tadi\". Maka dia (turun kembali ke dalam sumur) dan diisinya sepatunya dengan air dan sambil menggigit sepatunya dengan mulutnya dia naik keatas lalu memberi anjing itu minum. Kemudian dia bersyukur kepada Allah maka Allah mengampuninya\". Mereka bertanya: \"Wahai Rasulullah, apakah kita akan dapat pahala dengan berbuat baik kepada hewan?\" Beliau shallallahu 'alaihi wasallam menjawab: \"Terhadap setiap makhluq bernyawa diberi pahala",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir adam yolda yürüyordu. Çok susamıştı. Bir kuyu buldu. İnip su içti. Kuyudan çıktığında susuzluktan soluyan ve bundan dolayı toprak yiyen bir köpek gördü. Adam: \"Bu köpek aynı benim gibi susamış\" dedi ve kuyuya inip ayakkabısına su doldurdu ve köpeğe su verdi. Allah onun bu yaptığına çok memnun oldu ve onu bağışladı.\" Sahabe: \"Ey Allah'ın Resulü! Biz hayvanlara yaptığımız iyiliklerden dolayı da sevap alıyor muyuz?\" diye sordu. O da (Sallallahu Aleyhi ve Sellem): \"Canı olan her varlığa iyiliğin sevabı vardır\" buyurdu. باب: إماطة الأذى. 24. İNSANLARA SIKINTI VEREN ŞEYLERİ YOL'DAN KALDIRMAK"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 27
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2467,
      "arabicNumber": 2467,
      "book": 46,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ قَالَ أَشْرَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ ثُمَّ قَالَ ‏ \"‏ هَلْ تَرَوْنَ مَا أَرَى إِنِّي أَرَى مَوَاقِعَ الْفِتَنِ خِلاَلَ بُيُوتِكُمْ كَمَوَاقِعِ الْقَطْرِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Usama bin Zaid:Once the Prophet (ﷺ) stood at the top of one of the castles (or higher buildings) of Medina and said, \"Do you see what I see? No doubt I am seeing the spots of afflictions amongst your houses as numerous as the spots where raindrops fall (during a heavy rain). (See Hadith No)",
          "ur": "ہم سے عبداللہ بن محمد نے بیان کیا، انہوں نے کہا ہم سے ابن عیینہ نے بیان کیا، انہوں نے کہا کہ ہم سے زہری نے بیان کیا، ان سے عروہ نے بیان کیا، ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا، کہ نبی کریم صلی اللہ علیہ وسلم مدینہ کے ایک بلند مکان پر چڑھے۔ پھر فرمایا، کیا تم لوگ بھی دیکھ رہے ہو جو میں دیکھ رہا ہوں کہ ( عنقریب ) تمہارے گھروں میں فتنے اس طرح برس رہے ہوں گے جیسے بارش برستی ہے۔",
          "fr": "Rapporté par Usama bin Zaid : Un jour, le Prophète (ﷺ) s’est tenu en haut d’un des châteaux (ou d’un bâtiment élevé) de Médine et a dit : « Voyez-vous ce que je vois ? Je vois des épreuves s’abattre sur vos maisons aussi nombreuses que les gouttes de pluie lors d’une forte averse. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhriy] dari ['Urwah] aku mendengar ['Usamah radliallahu 'anhu] berkata; \"Nabi shallallahu 'alaihi wasallam naik ke atas salah satu dari benteng-benteng Madinah lalu bersabda: \"Apakah kalian melihat sebagaimana aku melihat? Sungguh aku melihat tempat-tempat terjadinya fitnah di sela-sela rumah kalian seperti tempat jatuhnya tetesan (air hujan)",
          "tr": "Usame İbn Zeyd den r.a. rivayet edilmiştir: Hz. Nebi kafasını kaldırdı ve Medine'nin evlerinden yüksek bir eve baktı. Sonra: \"Benim gördüğümü siz de görüyor musunuz? Ben sizin evleriniz arasında yağmurun düştüğü yerler gibi fitnenin yağdığı yerler görüyorum\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 28
      },
      "narrator": {
        "en": "Usama bin Zaid"
      }
    },
    {
      "hadithNumber": 2468,
      "arabicNumber": 2468,
      "book": 46,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمْ أَزَلْ حَرِيصًا عَلَى أَنْ أَسْأَلَ عُمَرَ ـ رضى الله عنه ـ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ لَهُمَا ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ فَحَجَجْتُ مَعَهُ فَعَدَلَ وَعَدَلْتُ مَعَهُ بِالإِدَاوَةِ، فَتَبَرَّزَ حَتَّى جَاءَ، فَسَكَبْتُ عَلَى يَدَيْهِ مِنَ الإِدَاوَةِ، فَتَوَضَّأَ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَانِ قَالَ لَهُمَا ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ‏}‏ فَقَالَ وَاعَجَبِي لَكَ يَا ابْنَ عَبَّاسٍ عَائِشَةُ وَحَفْصَةُ، ثُمَّ اسْتَقْبَلَ عُمَرُ الْحَدِيثَ يَسُوقُهُ، فَقَالَ إِنِّي كُنْتُ وَجَارٌ لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهْىَ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ مِنْ خَبَرِ ذَلِكَ الْيَوْمِ مِنَ الأَمْرِ وَغَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَهُ، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا عَلَى الأَنْصَارِ إِذَا هُمْ قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَطَفِقَ نِسَاؤُنَا يَأْخُذْنَ مِنْ أَدَبِ نِسَاءِ الأَنْصَارِ، فَصِحْتُ عَلَى امْرَأَتِي، فَرَاجَعَتْنِي، فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي، فَقَالَتْ وَلِمَ تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ، وَإِنَّ إِحْدَاهُنَّ لَتَهْجُرُهُ الْيَوْمَ حَتَّى اللَّيْلِ‏.‏ فَأَفْزَعَنِي، فَقُلْتُ خَابَتْ مَنْ فَعَلَ مِنْهُنَّ بِعَظِيمٍ‏.‏ ثُمَّ جَمَعْتُ عَلَىَّ ثِيَابِي، فَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ أَىْ حَفْصَةُ، أَتُغَاضِبُ إِحْدَاكُنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم الْيَوْمَ حَتَّى اللَّيْلِ فَقَالَتْ نَعَمْ‏.‏ فَقُلْتُ خَابَتْ وَخَسِرَتْ، أَفَتَأْمَنُ أَنْ يَغْضَبَ اللَّهُ لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَتَهْلِكِينَ لاَ تَسْتَكْثِرِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ تُرَاجِعِيهِ فِي شَىْءٍ وَلاَ تَهْجُرِيهِ، وَاسْأَلِينِي مَا بَدَا لَكِ، وَلاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْضَأَ مِنْكِ وَأَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ـ يُرِيدُ عَائِشَةَ ـ وَكُنَّا تَحَدَّثْنَا أَنَّ غَسَّانَ تُنْعِلُ النِّعَالَ لِغَزْوِنَا، فَنَزَلَ صَاحِبِي يَوْمَ نَوْبَتِهِ فَرَجَعَ عِشَاءً، فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا، وَقَالَ أَنَائِمٌ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ‏.‏ وَقَالَ حَدَثَ أَمْرٌ عَظِيمٌ‏.‏ قُلْتُ مَا هُوَ أَجَاءَتْ غَسَّانُ قَالَ لاَ، بَلْ أَعْظَمُ مِنْهُ وَأَطْوَلُ، طَلَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ‏.‏ قَالَ قَدْ خَابَتْ حَفْصَةُ وَخَسِرَتْ، كُنْتُ أَظُنُّ أَنَّ هَذَا يُوشِكُ أَنْ يَكُونَ، فَجَمَعْتُ عَلَىَّ ثِيَابِي، فَصَلَّيْتُ صَلاَةَ الْفَجْرِ مَعَ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ مَشْرُبَةً لَهُ فَاعْتَزَلَ فِيهَا، فَدَخَلْتُ عَلَى حَفْصَةَ، فَإِذَا هِيَ تَبْكِي‏.‏ قُلْتُ مَا يُبْكِيكِ أَوَلَمْ أَكُنْ حَذَّرْتُكِ أَطَلَّقَكُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي هُوَ ذَا فِي الْمَشْرُبَةِ‏.‏ فَخَرَجْتُ، فَجِئْتُ الْمِنْبَرَ، فَإِذَا حَوْلَهُ رَهْطٌ يَبْكِي بَعْضُهُمْ، فَجَلَسْتُ مَعَهُمْ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَجِدُ، فَجِئْتُ الْمَشْرُبَةَ الَّتِي هُوَ فِيهَا فَقُلْتُ لِغُلاَمٍ لَهُ أَسْوَدَ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ، فَكَلَّمَ النَّبِيَّ صلى الله عليه وسلم ثُمَّ خَرَجَ، فَقَالَ ذَكَرْتُكَ لَهُ، فَصَمَتَ، فَانْصَرَفْتُ حَتَّى جَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ، فَذَكَرَ مِثْلَهُ، فَجَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ الْغُلاَمَ‏.‏ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَذَكَرَ مِثْلَهُ، فَلَمَّا وَلَّيْتُ مُنْصَرِفًا، فَإِذَا الْغُلاَمُ يَدْعُونِي قَالَ أَذِنَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ فَدَخَلْتُ عَلَيْهِ، فَإِذَا هُوَ مُضْطَجِعٌ عَلَى رِمَالِ حَصِيرٍ لَيْسَ بَيْنَهُ وَبَيْنَهُ فِرَاشٌ، قَدْ أَثَّرَ الرِّمَالُ بِجَنْبِهِ، مُتَّكِئٌ عَلَى وِسَادَةٍ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، فَسَلَّمْتُ عَلَيْهِ، ثُمَّ قُلْتُ وَأَنَا قَائِمٌ طَلَّقْتَ نِسَاءَكَ فَرَفَعَ بَصَرَهُ إِلَىَّ، فَقَالَ ‏\"‏ لاَ ‏\"‏‏.‏ ثُمَّ قُلْتُ ـ وَأَنَا قَائِمٌ أَسْتَأْنِسُ يَا رَسُولَ اللَّهِ، لَوْ رَأَيْتَنِي، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا عَلَى قَوْمٍ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَذَكَرَهُ، فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم، ثُمَّ قُلْتُ لَوْ رَأَيْتَنِي، وَدَخَلْتُ عَلَى حَفْصَةَ، فَقُلْتُ لاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْضَأَ مِنْكِ وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم ـ يُرِيدُ عَائِشَةَ ـ فَتَبَسَّمَ أُخْرَى، فَجَلَسْتُ حِينَ رَأَيْتُهُ تَبَسَّمَ، ثُمَّ رَفَعْتُ بَصَرِي فِي بَيْتِهِ، فَوَاللَّهِ مَا رَأَيْتُ فِيهِ شَيْئًا يَرُدُّ الْبَصَرَ غَيْرَ أَهَبَةٍ ثَلاَثَةٍ‏.‏ فَقُلْتُ ادْعُ اللَّهَ فَلْيُوَسِّعْ عَلَى أُمَّتِكَ، فَإِنَّ فَارِسَ وَالرُّومَ وُسِّعَ عَلَيْهِمْ وَأُعْطُوا الدُّنْيَا، وَهُمْ لاَ يَعْبُدُونَ اللَّهَ، وَكَانَ مُتَّكِئًا‏.‏ فَقَالَ ‏\"‏ أَوَفِي شَكٍّ أَنْتَ يَا ابْنَ الْخَطَّابِ أُولَئِكَ قَوْمٌ عُجِّلَتْ لَهُمْ طَيِّبَاتُهُمْ فِي الْحَيَاةِ الدُّنْيَا ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي‏.‏ فَاعْتَزَلَ النَّبِيُّ صلى الله عليه وسلم مِنْ أَجْلِ ذَلِكَ الْحَدِيثِ حِينَ أَفْشَتْهُ حَفْصَةُ إِلَى عَائِشَةَ، وَكَانَ قَدْ قَالَ ‏\"‏ مَا أَنَا بِدَاخِلٍ عَلَيْهِنَّ شَهْرًا ‏\"‏‏.‏ مِنْ شِدَّةِ مَوْجَدَتِهِ عَلَيْهِنَّ حِينَ عَاتَبَهُ اللَّهُ‏.‏ فَلَمَّا مَضَتْ تِسْعٌ وَعِشْرُونَ دَخَلَ عَلَى عَائِشَةَ فَبَدَأَ بِهَا، فَقَالَتْ لَهُ عَائِشَةُ إِنَّكَ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا، وَإِنَّا أَصْبَحْنَا لِتِسْعٍ وَعِشْرِينَ لَيْلَةً، أَعُدُّهَا عَدًّا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏ وَكَانَ ذَلِكَ الشَّهْرُ تِسْعٌ وَعِشْرُونَ‏.‏ قَالَتْ عَائِشَةُ فَأُنْزِلَتْ آيَةُ التَّخْيِيرِ فَبَدَأَ بِي أَوَّلَ امْرَأَةٍ، فَقَالَ ‏\"‏ إِنِّي ذَاكِرٌ لَكِ أَمْرًا، وَلاَ عَلَيْكِ أَنْ لاَ تَعْجَلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ ‏\"‏‏.‏ قَالَتْ قَدْ أَعْلَمُ أَنَّ أَبَوَىَّ لَمْ يَكُونَا يَأْمُرَانِي بِفِرَاقِكَ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ قَالَ ‏{‏يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ‏}‏ إِلَى قَوْلِهِ ‏{‏ عَظِيمًا‏}‏ ‏\"‏‏.‏ قُلْتُ أَفِي هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ‏.‏ ثُمَّ خَيَّرَ نِسَاءَهُ، فَقُلْنَ مِثْلَ مَا قَالَتْ عَائِشَةُ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Abbas:I had been eager to ask `Umar about the two ladies from among the wives of the Prophet (ﷺ) regarding whom Allah said (in the Qur'an saying): If you two (wives of the Prophet (ﷺ) namely Aisha and Hafsa) turn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes) (66.4), till performed the Hajj along with `Umar (and on our way back from Hajj) he went aside (to answer the call of nature) and I also went aside along with him carrying a tumbler of water. When he had answered the call of nature and returned. I poured water on his hands from the tumbler and he performed ablution. I said, \"O Chief of the believers! ' Who were the two ladies from among the wives of the Prophet (ﷺ) to whom Allah said: 'If you two return in repentance (66.4)? He said, \"I am astonished at your question, O Ibn `Abbas. They were Aisha and Hafsa.\" Then `Umar went on relating the narration and said. \"I and an Ansari neighbor of mine from Bani Umaiya bin Zaid who used to live in `Awali Al-Medina, used to visit the Prophet (ﷺ) in turns. He used to go one day, and I another day. When I went I would bring him the news of what had happened that day regarding the instructions and orders and when he went, he used to do the same for me. We, the people of Quraish, used to have authority over women, but when we came to live with the Ansar, we noticed that the Ansari women had the upper hand over their men, so our women started acquiring the habits of the Ansari women. Once I shouted at my wife and she paid me back in my coin and I disliked that she should answer me back. She said, 'Why do you take it ill that I retort upon you? By Allah, the wives of the Prophet (ﷺ) retort upon him, and some of them may not speak with him for the whole day till night.' What she said scared me and I said to her, 'Whoever amongst them does so, will be a great loser.' Then I dressed myself and went to Hafsa and asked her, 'Does any of you keep Allah's Messenger (ﷺ) angry all the day long till night?' She replied in the affirmative. I said, 'She is a ruined losing person (and will never have success)! Doesn't she fear that Allah may get angry for the anger of Allah's Messenger (ﷺ) and thus she will be ruined? Don't ask Allah's Messenger (ﷺ) too many things, and don't retort upon him in any case, and don't desert him. Demand from me whatever you like, and don't be tempted to imitate your neighbor (i.e. `Aisha) in her behavior towards the Prophet), for she (i.e. Aisha) is more beautiful than you, and more beloved to Allah's Messenger (ﷺ). In those days it was rumored that Ghassan, (a tribe living in Sham) was getting prepared their horses to invade us. My companion went (to the Prophet (ﷺ) on the day of his turn, went and returned to us at night and knocked at my door violently, asking whether I was sleeping. I was scared (by the hard knocking) and came out to him. He said that a great thing had happened. I asked him: What is it? Have Ghassan come? He replied that it was worse and more serious than that, and added that Allah's Apostle had divorced all his wives. I said, Hafsa is a ruined loser! I expected that would happen some day.' So I dressed myself and offered the Fajr prayer with the Prophet. Then the Prophet (ﷺ) entered an upper room and stayed there alone. I went to Hafsa and found her weeping. I asked her, 'Why are you weeping? Didn't I warn you? Has Allah's Messenger (ﷺ) divorced you all?' She replied, 'I don't know. He is there in the upper room.' I then went out and came to the pulpit and found a group of people around it and some of them were weeping. Then I sat with them for some time, but could not endure the situation. So I went to the upper room where the Prophet (ﷺ) was and requested to a black slave of his: \"Will you get the permission of (Allah's Apostle) for `Umar (to enter)? The slave went in, talked to the Prophet (ﷺ) about it and came out saying, 'I mentioned you to him but he did not reply.' So, I went and sat with the people who were sitting by the pulpit, but I could not bear the situation, so I went to the slave again and said: \"Will you get he permission for `Umar? He went in and brought the same reply as before. When I was leaving, behold, the slave called me saying, \"Allah's Messenger (ﷺ) has granted you permission.\" So, I entered upon the Prophet and saw him lying on a mat without bedding on it, and the mat had left its mark on the body of the Prophet, and he was leaning on a leather pillow stuffed with palm fibres. I greeted him and while still standing, I said: \"Have you divorced your wives?' He raised his eyes to me and replied in the negative. And then while still standing, I said chatting: \"Will you heed what I say, 'O Allah's Messenger (ﷺ)! We, the people of Quraish used to have the upper hand over our women (wives), and when we came to the people whose women had the upper hand over them...\" `Umar told the whole story (about his wife). \"On that the Prophet (ﷺ) smiled.\" `Umar further said, \"I then said, 'I went to Hafsa and said to her: Do not be tempted to imitate your companion (`Aisha) for she is more beautiful than you and more beloved to the Prophet.' The Prophet (ﷺ) smiled again. When I saw him smiling, I sat down and cast a glance at the room, and by Allah, I couldn't see anything of importance but three hides. I said (to Allah's Messenger (ﷺ)) \"Invoke Allah to make your followers prosperous for the Persians and the Byzantines have been made prosperous and given worldly luxuries, though they do not worship Allah?' The Prophet (ﷺ) was leaning then (and on hearing my speech he sat straight) and said, 'O Ibn Al-Khattab! Do you have any doubt (that the Hereafter is better than this world)? These people have been given rewards of their good deeds in this world only.' I asked the Prophet (ﷺ) . 'Please ask Allah's forgiveness for me. The Prophet (ﷺ) did not go to his wives because of the secret which Hafsa had disclosed to `Aisha, and he said that he would not go to his wives for one month as he was angry with them when Allah admonished him (for his oath that he would not approach Maria). When twenty-nine days had passed, the Prophet (ﷺ) went to Aisha first of all. She said to him, 'You took an oath that you would not come to us for one month, and today only twenty-nine days have passed, as I have been counting them day by day.' The Prophet (ﷺ) said, 'The month is also of twenty-nine days.' That month consisted of twenty-nine days. `Aisha said, 'When the Divine revelation of Choice was revealed, the Prophet (ﷺ) started with me, saying to me, 'I am telling you something, but you need not hurry to give the reply till you can consult your parents.\" `Aisha knew that her parents would not advise her to part with the Prophet (ﷺ) . The Prophet (ﷺ) said that Allah had said: 'O Prophet! Say To your wives; If you desire The life of this world And its glitter, ... then come! I will make a provision for you and set you free In a handsome manner. But if you seek Allah And His Apostle, and The Home of the Hereafter, then Verily, Allah has prepared For the good-doers amongst you A great reward.' (33.28) `Aisha said, 'Am I to consult my parents about this? I indeed prefer Allah, His Apostle, and the Home of the Hereafter.' After that the Prophet (ﷺ) gave the choice to his other wives and they also gave the same reply as `Aisha did",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے عقیل نے اور ان سے ابن شہاب نے کہ مجھے عبیداللہ بن عبداللہ بن ابی ثور نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ میں ہمیشہ اس بات کا آروز مند رہتا تھا کہ عمر رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کی ان دو بیویوں کے نام پوچھوں جن کے بارے میں اللہ تعالیٰ نے ( سورۃ التحریم میں ) فرمایا ہے «إن تتوبا إلى الله فقد صغت قلوبكما‏» ”اگر تم دونوں اللہ کے سامنے توبہ کرو ( تو بہتر ہے ) کہ تمہارے دل بگڑ گئے ہیں۔“ پھر میں ان کے ساتھ حج کو گیا۔ عمر رضی اللہ عنہ راستے سے قضائے حاجت کے لیے ہٹے تو میں بھی ان کے ساتھ ( پانی کا ایک ) چھاگل لے کر گیا۔ پھر وہ قضائے حاجت کے لیے چلے گئے۔ اور جب واپس آئے تو میں نے ان کے دونوں ہاتھوں پر چھاگل سے پانی ڈالا۔ اور انہوں نے وضو کیا، پھر میں نے پوچھا، یا امیرالمؤمنین! نبی کریم صلی اللہ علیہ وسلم کی بیویوں میں وہ دو خواتین کون سی ہیں جن کے متعلق اللہ تعالیٰ نے یہ فرمایا کہ «إن تتوبا إلى الله‏» ”تم دونوں اللہ کے سامنے توبہ کرو“ انہوں نے فرمایا، ابن عباس! تم پر حیرت ہے۔ وہ تو عائشہ اور حفصہ ( رضی اللہ عنہا ) ہیں۔ پھر عمر رضی اللہ عنہ میری طرف متوجہ ہو کر پورا واقعہ بیان کرنے لگے۔ آپ نے بتلایا کہ بنوامیہ بن زید کے قبیلے میں جو مدینہ سے ملا ہوا تھا۔ میں اپنے ایک انصاری پڑوسی کے ساتھ رہتا تھا۔ ہم دونوں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضری کی باری مقرر کر رکھی تھی۔ ایک دن وہ حاضر ہوتے اور ایک دن میں۔ جب میں حاضری دیتا تو اس دن کی تمام خبریں وغیرہ لاتا۔ ( اور ان کو سناتا ) اور جب وہ حاضر ہوتے تو وہ بھی اسی طرح کرتے۔ ہم قریش کے لوگ ( مکہ میں ) اپنی عورتوں پر غالب رہا کرتے تھے۔ لیکن جب ہم ( ہجرت کر کے ) انصار کے یہاں آئے تو انہیں دیکھا کہ ان کی عورتیں خود ان پر غالب تھیں۔ ہماری عورتوں نے بھی ان کا طریقہ اختیار کرنا شروع کر دیا۔ میں نے ایک دن اپنی بیوی کو ڈانٹا تو انہوں نے بھی اس کا جواب دیا۔ ان کا یہ جواب مجھے ناگوار معلوم ہوا۔ لیکن انہوں نے کہا کہ میں اگر جواب دیتی ہوں تو تمہیں ناگواری کیوں ہوتی ہے۔ قسم اللہ کی! نبی کریم صلی اللہ علیہ وسلم کی ازواج تک آپ کو جواب دے دیتی ہیں اور بعض بیویاں تو آپ سے پورے دن اور پوری رات خفا رہتی ہیں۔ اس بات سے میں بہت گھبرایا اور میں نے کہا کہ ان میں سے جس نے بھی ایسا کیا ہو گا وہ بہت بڑے نقصان اور خسارے میں ہے۔ اس کے بعد میں نے کپڑے پہنے اور حفصہ رضی اللہ عنہا ( عمر رضی اللہ عنہ کی صاحبزادی اور ام المؤمنین ) کے پاس پہنچا اور کہا اے حفصہ! کیا تم میں سے کوئی نبی کریم صلی اللہ علیہ وسلم سے پورے دن رات تک ناراض رہتی ہیں۔ انہوں نے کہا کہ ہاں! میں بول اٹھا کہ پھر تو وہ تباہی اور نقصان میں رہیں۔ کیا تمہیں اس سے امن ہے کہ اللہ تعالیٰ اپنے رسول صلی اللہ علیہ وسلم کی خفگی کی وجہ سے ( تم پر ) غصہ ہو جائے اور تم ہلاک ہو جاؤ۔ رسول اللہ صلی اللہ علیہ وسلم سے زیادہ چیزوں کا مطالبہ ہرگز نہ کیا کرو، نہ کسی معاملہ میں آپ صلی اللہ علیہ وسلم کی کسی بات کا جواب دو اور نہ آپ پر خفگی کا اظہار ہونے دو، البتہ جس چیز کی تمہیں ضرورت ہو، وہ مجھ سے مانگ لیا کرو، کسی خود فریبی میں مبتلا نہ رہنا، تمہاری یہ پڑوسن تم سے زیادہ جمیل اور نظیف ہیں اور رسول اللہ صلی اللہ علیہ وسلم کو زیادہ پیاری بھی ہیں۔ آپ کی مراد عائشہ رضی اللہ عنہا سے تھی۔ عمر رضی اللہ عنہ نے کہا، ان دنوں یہ چرچا ہو رہا تھا کہ غسان کے فوجی ہم سے لڑنے کے لیے گھوڑوں کو سم لگا رہے ہیں۔ میرے پڑوسی ایک دن اپنی باری پر مدینہ گئے ہوئے تھے۔ پھر عشاء کے وقت واپس لوٹے۔ آ کر میرا دروازہ انہوں نے بڑی زور سے کھٹکھٹایا، اور کہا کیا آپ سو گئے ہیں؟ میں بہت گھبرایا ہوا باہر آیا انہوں نے کہا کہ ایک بہت بڑا حادثہ پیش آ گیا ہے۔ میں نے پوچھا کیا ہوا؟ کیا غسان کا لشکر آ گیا؟ انہوں نے کہا بلکہ اس سے بھی بڑا اور سنگین حادثہ، وہ یہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کو طلاق دے دی۔ یہ سن کر عمر رضی اللہ عنہ نے فرمایا، حفصہ تو تباہ و برباد ہو گئی۔ مجھے تو پہلے ہی کھٹکا تھا کہ کہیں ایسا نہ ہو جائے ( عمر رضی اللہ عنہ نے کہا ) پھر میں نے کپڑے پہنے۔ صبح کی نماز رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھی ( نماز پڑھتے ہی ) آپ صلی اللہ علیہ وسلم اپنے بالا خانہ میں تشریف لے گئے اور وہیں تنہائی اختیار کر لی۔ میں حفصہ کے یہاں گیا، دیکھا تو وہ رو رہی تھیں، میں نے کہا، رو کیوں رہی ہو؟ کیا پہلے ہی میں نے تمہیں نہیں کہہ دیا تھا؟ کیا رسول اللہ صلی اللہ علیہ وسلم نے تم سب کو طلاق دے دی ہے؟ انہوں نے کہا کہ مجھے کچھ معلوم نہیں۔ آپ صلی اللہ علیہ وسلم بالاخانہ میں تشریف رکھتے ہیں۔ پھر میں باہر نکلا اور منبر کے پاس آیا۔ وہاں کچھ لوگ موجود تھے اور بعض رو بھی رہے تھے۔ تھوڑی دیر تو میں ان کے ساتھ بیٹھا رہا۔ لیکن مجھ پر رنج کا غلبہ ہوا، اور میں بالاخانے کے پاس پہنچا، جس میں آپ صلی اللہ علیہ وسلم تشریف رکھتے تھے۔ میں نے آپ صلی اللہ علیہ وسلم کے ایک سیاہ غلام سے کہا، ( کہ نبی کریم صلی اللہ علیہ وسلم سے کہو ) کہ عمر اجازت چاہتا ہے۔ وہ غلام اندر گیا اور آپ صلی اللہ علیہ وسلم سے گفتگو کر کے واپس آیا اور کہا کہ میں نے آپ کی بات پہنچا دی تھی، لیکن آپ صلی اللہ علیہ وسلم خاموش ہو گئے، چنانچہ میں واپس آ کر انہیں لوگوں کے ساتھ بیٹھ گیا جو منبر کے پاس موجود تھے۔ پھر مجھ پر رنج غالب آیا اور میں دوبارہ آیا۔ لیکن اس دفعہ بھی وہی ہوا۔ پھر آ کر انہیں لوگوں میں بیٹھ گیا جو منبر کے پاس تھے۔ لیکن اس مرتبہ پھر مجھ سے نہیں رہا گیا اور میں نے غلام سے آ کر کہا، کہ عمر کے لیے اجازت چاہو۔ لیکن بات جوں کی توں رہی۔ جب میں واپس ہو رہا تھا کہ غلام نے مجھ کو پکارا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے آپ کو اجازت دے دی ہے۔ میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم کھجور کی چٹائی پر لیٹے ہوئے تھے۔ جس پر کوئی بستر بھی نہیں تھا۔ اس لیے چٹائی کے ابھرے ہوئے حصوں کا نشان آپ صلی اللہ علیہ وسلم کے پہلو میں پڑ گیا تھا۔ آپ صلی اللہ علیہ وسلم اس وقت ایک ایسے تکیے پر ٹیک لگائے ہوئے تھے جس کے اندر کھجور کی چھال بھری گئی تھی۔ میں نے آپ صلی اللہ علیہ وسلم کو سلام کیا اور کھڑے ہی کھڑے عرض کی، کہ کیا آپ نے اپنی بیویوں کو طلاق دے دی ہے؟ آپ صلی اللہ علیہ وسلم نے نگاہ میری طرف کر کے فرمایا کہ نہیں۔ میں نے آپ کے غم کو ہلکا کرنے کی کوشش کی اور کہنے لگا…. اب بھی میں کھڑا ہی تھا…. یا رسول اللہ! آپ جانتے ہی ہیں کہ ہم قریش کے لوگ اپنی بیویوں پر غالب رہتے تھے، لیکن جب ہم ایک ایسی قوم میں آ گئے جن کی عورتیں ان پر غالب تھیں، پھر عمر رضی اللہ عنہ نے تفصیل ذکر کی۔ اس بات پر رسول اللہ صلی اللہ علیہ وسلم مسکرا دیئے۔ پھر میں نے کہا میں حفصہ کے یہاں بھی گیا تھا اور اس سے کہہ آیا تھا کہ کہیں کسی خود فریبی میں نہ مبتلا رہنا۔ یہ تمہاری پڑوسن تم سے زیادہ خوبصورت اور پاک ہیں اور رسول اللہ صلی اللہ علیہ وسلم کو زیادہ محبوب بھی ہیں۔ آپ عائشہ رضی اللہ عنہا کی طرف اشارہ کر رہے تھے۔ اس بات پر آپ صلی اللہ علیہ وسلم دوبارہ مسکرا دیئے۔ جب میں نے آپ صلی اللہ علیہ وسلم کو مسکراتے دیکھا، تو ( آپ صلی اللہ علیہ وسلم کے پاس ) بیٹھ گیا۔ اور آپ کے گھر میں چاروں طرف دیکھنے لگا۔ بخدا! سوائے تین کھالوں کے اور کوئی چیز وہاں نظر نہ آئی۔ میں نے کہا۔ یا رسول اللہ! آپ اللہ تعالیٰ سے دعا فرمائیے کہ وہ آپ کی امت کو کشادگی عطا فرما دے۔ فارس اور روم کے لوگ تو پوری فراخی کے ساتھ رہتے ہیں۔ دنیا انہیں خوب ملی ہوئی ہے۔ حالانکہ وہ اللہ تعالیٰ کی عبادت بھی نہیں کرتے۔ آپ صلی اللہ علیہ وسلم ٹیک لگائے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، اے خطاب کے بیٹے! کیا تمہیں ابھی کچھ شبہ ہے؟ ( تو دنیا کی دولت کو اچھی سمجھتا ہے ) یہ تو ایسے لوگ ہیں کہ ان کے اچھے اعمال ( جو وہ معاملات کی حد تک کرتے ہیں ان کی جزا ) اسی دنیا میں ان کو دے دی گئی ہے۔ ( یہ سن کر ) میں بول اٹھا۔ یا رسول اللہ! میرے لیے اللہ سے مغفرت کی دعا کیجئے۔ تو نبی کریم صلی اللہ علیہ وسلم نے ( اپنی ازواج سے ) اس بات پر علیحدگی اختیار کر لی تھی کہ عائشہ رضی اللہ عنہا سے حفصہ رضی اللہ عنہ نے پوشیدہ بات کہہ دی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے اس انتہائی خفگی کی وجہ سے جو آپ صلی اللہ علیہ وسلم کو ہوئی تھی، فرمایا تھا کہ میں اب ان کے پاس ایک مہینے تک نہیں جاؤں گا۔ اور یہی موقعہ ہے جس پر اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو متنبہ کیا تھا۔ پھر جب انتیس دن گزر گئے تو آپ عائشہ رضی اللہ عنہا کے گھر تشریف لے گئے اور انہیں کے یہاں سے آپ صلی اللہ علیہ وسلم نے ابتداء کی۔ عائشہ رضی اللہ عنہا نے کہا کہ آپ نے تو عہد کیا تھا کہ ہمارے یہاں ایک مہینے تک نہیں تشریف لائیں گے۔ اور آج ابھی انتیسویں کی صبح ہے۔ میں تو دن گن رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، یہ مہینہ انتیس دن کا ہے اور وہ مہینہ انتیس ہی دن کا تھا۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر وہ آیت نازل ہوئی جس میں ( ازواج النبی کو ) اختیار دیا گیا تھا۔ اس کی بھی ابتداء آپ صلی اللہ علیہ وسلم نے مجھ ہی سے کی اور فرمایا کہ میں تم سے ایک بات کہتا ہوں، اور یہ ضروری نہیں کہ جواب فوراً دو، بلکہ اپنے والدین سے بھی مشورہ کر لو۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ آپ کو یہ معلوم تھا کہ میرے ماں باپ کبھی آپ سے جدائی کا مشورہ نہیں دے سکتے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے فرمایا ہے کہ ”اے نبی! اپنی بیویوں سے کہہ دو“ اللہ تعالیٰ کے قول عظیما تک۔ میں نے عرض کیا کیا اب اس معاملے میں بھی میں اپنے والدین سے مشورہ کرنے جاؤں گی! اس میں تو کسی شبہ کی گنجائش ہی نہیں ہے۔ کہ میں اللہ اور اس کے رسول اور دار آخرت کو پسند کرتی ہوں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے اپنی دوسری بیویوں کو بھی اختیار دیا اور انہوں نے بھی وہی جواب دیا جو عائشہ رضی اللہ عنہا نے دیا تھا۔",
          "fr": "Rapporté par `Abdullah bin `Abbas : J’avais très envie d’interroger `Umar au sujet des deux femmes parmi les épouses du Prophète (ﷺ) à propos desquelles Allah a dit dans le Coran : « Si vous deux (épouses du Prophète, à savoir Aisha et Hafsa) revenez à Allah en repentir, vos cœurs se sont inclinés (à l’opposé de ce que le Prophète (ﷺ) aime) » (66:4). J’ai donc fait le Hajj avec `Umar et, sur le chemin du retour, il s’est écarté pour faire ses besoins et je l’ai suivi avec un récipient d’eau. Après qu’il ait terminé, je lui ai versé de l’eau sur les mains pour qu’il fasse ses ablutions. Je lui ai dit : « Ô chef des croyants ! Qui sont les deux femmes parmi les épouses du Prophète (ﷺ) à qui Allah a dit : “Si vous deux revenez en repentir” (66:4) ? » Il a répondu : « Je suis étonné de ta question, ô Ibn `Abbas. Il s’agissait de Aisha et Hafsa. » Puis `Umar a continué son récit : « Moi et un voisin ansar du clan Bani Umaiya bin Zaid, qui vivait à `Awali Al-Medina, nous rendions visite au Prophète (ﷺ) à tour de rôle. J’y allais un jour, et lui le lendemain. Quand j’y allais, je lui rapportais les nouvelles et les instructions du jour, et quand c’était son tour, il faisait de même pour moi. Nous, les gens de Quraish, avions l’habitude d’avoir de l’autorité sur nos femmes, mais en venant vivre avec les Ansar, nous avons remarqué que leurs femmes dominaient leurs maris, alors nos femmes ont commencé à prendre les habitudes des femmes ansar. Un jour, j’ai crié sur ma femme et elle m’a répondu de la même manière, ce que je n’aimais pas. Elle m’a dit : “Pourquoi t’énerves-tu si je te réponds ? Par Allah, les femmes du Prophète (ﷺ) lui répondent aussi, et certaines ne lui parlent pas de toute la journée jusqu’au soir.” Cela m’a inquiété et j’ai dit : “Celle qui fait cela sera perdante.” Je me suis alors habillé et je suis allé voir Hafsa pour lui demander : “Est-ce que l’une d’entre vous met le Messager d’Allah (ﷺ) en colère toute la journée jusqu’au soir ?” Elle a répondu oui. J’ai dit : “Elle est vraiment perdante ! Ne crains-tu pas qu’Allah se mette en colère à cause de la colère du Messager d’Allah (ﷺ) et qu’elle soit perdue ? Ne posez pas trop de questions au Messager d’Allah (ﷺ), ne lui répondez pas, et ne le délaissez pas. Demandez-moi ce que vous voulez, mais ne sois pas tentée d’imiter ta voisine (Aisha) dans son comportement envers le Prophète, car elle est plus belle que toi et plus aimée du Messager d’Allah (ﷺ).” À cette époque, on disait que la tribu de Ghassan (en Syrie) préparait ses chevaux pour nous attaquer. Mon voisin est allé voir le Prophète (ﷺ) le jour de son tour, puis il est revenu le soir et a frappé violemment à ma porte, me demandant si je dormais. J’ai eu peur et je suis sorti. Il m’a dit qu’un grand événement était arrivé. J’ai demandé : “Quoi ? Les Ghassan sont-ils arrivés ?” Il a répondu que c’était pire : le Messager d’Allah avait divorcé de toutes ses femmes. J’ai dit : “Hafsa est perdue ! Je m’y attendais.” Je me suis habillé et j’ai prié la prière de l’aube avec le Prophète. Ensuite, le Prophète (ﷺ) est monté dans une pièce à l’étage et y est resté seul. Je suis allé voir Hafsa et je l’ai trouvée en train de pleurer. Je lui ai demandé : “Pourquoi pleures-tu ? Ne t’ai-je pas prévenue ? Le Messager d’Allah (ﷺ) vous a-t-il toutes divorcées ?” Elle a répondu : “Je ne sais pas. Il est là-haut.” Je suis sorti et je suis allé près de la chaire où des gens étaient rassemblés, certains pleuraient. Je suis resté un moment avec eux, puis je n’ai pas pu supporter la situation. Je suis donc retourné à la pièce où était le Prophète (ﷺ) et j’ai demandé à un de ses esclaves noirs : “Peux-tu demander la permission au Messager d’Allah pour que j’entre ?” L’esclave est entré, a parlé au Prophète (ﷺ) et est revenu en disant : “Je t’ai mentionné, mais il n’a pas répondu.” Je suis retourné m’asseoir avec les gens, mais je n’ai pas pu rester, alors je suis retourné voir l’esclave et j’ai répété ma demande. Il est entré et a ramené la même réponse. Quand je partais, l’esclave m’a appelé : “Le Messager d’Allah (ﷺ) t’a donné la permission.” Je suis donc entré et j’ai vu le Prophète allongé sur un tapis sans matelas, et le tapis avait laissé des marques sur son corps. Il était appuyé sur un oreiller en cuir rempli de fibres de palmier. Je l’ai salué et, debout, j’ai dit : “As-tu divorcé de tes femmes ?” Il a levé les yeux vers moi et a répondu non. Puis, toujours debout, j’ai continué : “Veux-tu écouter ce que je vais dire, ô Messager d’Allah (ﷺ) ? Nous, les Quraish, avions l’autorité sur nos femmes, mais en venant chez un peuple dont les femmes dominaient leurs maris...” `Umar a raconté toute l’histoire (concernant sa femme). À ce moment, le Prophète (ﷺ) a souri. `Umar a ajouté : “J’ai alors dit à Hafsa : Ne sois pas tentée d’imiter ta compagne (Aisha), car elle est plus belle que toi et plus aimée du Prophète.” Le Prophète (ﷺ) a encore souri. Quand je l’ai vu sourire, je me suis assis et j’ai regardé autour de la pièce, et par Allah, je n’y ai vu que trois peaux. J’ai dit (au Messager d’Allah (ﷺ)) : “Invoque Allah pour qu’Il accorde la prospérité à tes compagnons, car les Perses et les Byzantins ont reçu la prospérité et les biens de ce monde, alors qu’ils n’adorent pas Allah.” Le Prophète (ﷺ) était appuyé, mais en entendant mes paroles, il s’est redressé et a dit : “Ô Ibn Al-Khattab ! As-tu un doute (que l’au-delà est meilleur que ce monde) ? Ces gens ont reçu la récompense de leurs bonnes actions dans ce monde seulement.” J’ai demandé au Prophète (ﷺ) : “Demande pardon à Allah pour moi.” Le Prophète (ﷺ) s’était éloigné de ses femmes à cause du secret que Hafsa avait révélé à Aisha, et il avait dit qu’il ne les verrait pas pendant un mois, car il était en colère contre elles quand Allah l’a réprimandé (pour avoir juré de ne plus approcher Maria). Après vingt-neuf jours, le Prophète (ﷺ) est allé voir Aisha en premier. Elle lui a dit : “Tu avais juré de ne pas venir nous voir pendant un mois, et il ne s’est écoulé que vingt-neuf jours, je les ai comptés.” Le Prophète (ﷺ) a répondu : “Le mois peut aussi être de vingt-neuf jours.” Ce mois-là comptait vingt-neuf jours. Aisha a dit : “Quand la révélation du choix est descendue, le Prophète (ﷺ) a commencé par moi et m’a dit : ‘Je vais te dire quelque chose, mais tu n’as pas besoin de répondre tout de suite, tu peux consulter tes parents.’” Aisha savait que ses parents ne lui conseilleraient pas de se séparer du Prophète (ﷺ). Le Prophète (ﷺ) a dit qu’Allah avait révélé : “Ô Prophète ! Dis à tes épouses : Si vous désirez la vie de ce monde et ses plaisirs, alors venez ! Je vous donnerai une compensation et je vous libérerai d’une belle manière. Mais si vous cherchez Allah, Son Messager et la demeure de l’au-delà, alors Allah a préparé pour les bienfaisantes parmi vous une grande récompense.” (33:28) Aisha a dit : “Dois-je consulter mes parents à ce sujet ? Je choisis Allah, Son Messager et la demeure de l’au-delà.” Ensuite, le Prophète (ﷺ) a donné le choix à ses autres épouses et elles ont toutes répondu comme Aisha",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku ['Ubaidullah bin 'Abdullah bin Abu Tsaur] dari ['Abdullah bin 'Abbas radliallahu 'anhuma] berkata: \"Aku selalu antusias untuk bertanya kepada ['Umar] tentang dua wanita diantara isteri-isteri Nabi shallallahu 'alaihi wasallam yang Allah berfirman kepada keduanya: (\"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan) …QS At-Tahrim 4). Maka aku kunjungi dia namun dia menghindar dan aku susul dia dengan membawa kantong terbuat dari kulit berisi air hingga dia datang, lalu aku tuangkan air dari kantong air tadi keatas kedua tangannya hingga dia berwudhu' lalu aku tanya: \"Wahai amirul mu'minin, siapakah dua wanita dari isteri Nabi shallallahu 'alaihi wasallam yang Allah berfirman kepadanya (\"Jika kamu berdua bertaubat kepada Allah, maka sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan) …), maka dia menjawab: \"Aku heran kepadamu wahai Ibnu 'Abbas!, dia adalah 'Aisyah dan Hafshah\". Kemudian 'Umar menyebutkan hadits, katanya: \"Aku dan tetanggaku dari Anshar berada di desa Banu Umayyah bin Zaid, termasuk suku kepercayaan di Madinah dan kami saling bergantian menemui Rasul shallallahu 'alaihi wasallam. Sehari aku yang menemui Beliau shallallahu 'alaihi wasallam, hari lain dia yang menemui Beliau shallallahu 'alaihi wasallam. Jika giliranku menemui Beliau, aku menanyakan seputar wahyu yang turun hari itu dan perkara lainnya. Dan jika giliran tetangguku itu, ia pun melakukan hal sama. Kami adalah kaum Quraisy yang bisa menundukkan para isteri, hingga ketika kami mendatangi Kaum Anshar, ternyata mereka adalah sebuah kaum yang ditundukkan oleh isteri-isteri mereka. Lalu isteri-isteri kami segera saja meniru kebiasaan wanita Anshar tersebut. Suatu hari aku nasehati isteriku tapi dia membantahku dan aku larang dia membantahku tapi dia berkata: \"Kenapa kamu melarang aku membantahmu? Demi Allah, sesungguhnya hari ini isteri-isteri Nabi Shallallahu 'alaihiwasallam telah membantah Beliau bahkan seorang dari mereka tidak berbicara kepada Beliau hingga malam hari\". Aku kaget mendengar itu lalu aku katakan: \"Sangat celakalah diantara kalian orang yang berbuat hal seperti ini\". Kemudian aku bergegas untuk menemui Hafshah lalu aku bertanya: \"Wahai Hafshah, apakah salah seorang dari kalian hari ini telah membantah Rasulullah shallallahu 'alaihi wasallam hingga malam hari?\" Dia menjawab: \"Iya\". Aku katakan: \"Celaka dan rugilah. Apakah kalian merasa aman dari murka Allah disebabkan RasulNya shallallahu 'alaihi wasallam marah lalu kalian menjadi binasa? Janganlah kalian menuntut terlalu banyak kepada Rasulullah shallallahu 'alaihi wasallam dan jangan kalian membantahnya tentang suatu apapun dan jangan pula kalian menghindar untuk berbicara dengan Beliau. Mintalah kepadaku apa yang menjadi keperluanmu dan jangan kamu cemburu bila ada (isteri Nabi shallallahu 'alaihi wasallam), madu kamu, yang lebih cantik dan lebih dicintai oleh Rasulullah shallallahu 'alaihi wasallam \". Yang dimaksudkannya adalah 'Aisyah radliallahu 'anha. Suatu hari kami membicarakan suku Ghossan sebagai tukang sepatu yang biasanya menyiapkan sepatu kami untuk perang. Maka sahabatku pergi (menemui Rasulullah shallallahu 'alaihi wasallam) pada hari gilirannya lalu dia kembali pada waktu 'Isya dengan mengetuk rumahku dengan sangat keras seraya berkata: \"Apakah dia sudah tidur?\" Aku kaget lalu keluar menemuinya. Dia berkata: \"Telah terjadi masalah besar\". Aku bertanya: \"Masalah apa itu? Apakah suku Ghassan sudah datang?\" Dia menjawab: \"Bukan, bahkan urusannya lebih penting dan lebih panjang dari masalah itu. Rasulullah shallallahu 'alaihi wasallam telah menceraikan isteri-isteri Beliau. 'Umar berkata: \"Sungguh celaka dan rugilah Hafshah. Aku mengira hal ini tidak akan terjadi. Maka aku lipat pakaianku kemudian aku shalat Shubuh bersama Nabi shallallahu 'alaihi wasallam lalu Beliau memasuki bilik yang tinggi dan mengasingkan diri disana. Maka aku menemui Hafshah yang ternyata sedang menangis lalu aku bertanya: \"Apa yang membuatmu menangis, bukankah aku sudah peringatkan kamu? Apakah Rasulullah shallallahu 'alaihi wasallam telah menceraikan kalian?\" Dia menjawab: \"Aku tidak tahu, sekarang Beliau berada di tempat pengasingannya\". Maka aku keluar lalu mendatangi mimbar ternyata di sekelilingnya ada sejumlah orang (kurang dari sepuluh) yang sedang berkumpul diantaranya ada yang menangis. Maka aku duduk bersama mereka sebentar lalu aku sangat ingin mendatangi tempat pengasingan tempat Beliau berdiam disana. Aku katakan kepada Aswad, anak kecil pembantu Beliau: \"Mintakanlah izin untuk 'Umar?\" Maka dia masuk dan berbicara dengan Nabi shallallahu 'alaihi wasallam lalu keluar dan berkata: \"Aku sudah sampaikan tentang maksudmu namun Beliau diam saja\". Maka kemudian aku kembali dan berkumpul bersama orang-orang yang berada dekat mimbar. Sesaat kemudian timbul lagi keinginanku maka aku temui anak kecil itu lalu aku sampaikan maksudku seperti tadi dan diapun menjawab seperti tadi pula. Maka aku kembali duduk bersama orang-orang yang berada dekat mimbar. Ternyata timbul lagi keinginanku, maka aku datangi lagi anak kecil itu dan aku katakan: \"Mintakanlah izin untuk 'Umar?\" Maka dia menjawab seperti tadi pula. Ketika aku hendak kembali, anak kecil itu memanggilku dan berkata: \"Rasulullah shallallahu 'alaihi wasallam mengizinkan kamu masuk\". Maka aku masuk menemui Beliau yang ketika itu Beliau sedang berbaring diatas pasir sebagai kasurnya, dan tidak ada kasur yang menengahi antara pasir dan beliau sehingga pasir itu membekas pada sisi badan Beliau, Beliau bersandar diatas bantal yang terbuat dari kulit yang isinya sabut. Aku memberi salam kepada Beliau lalu aku berkata dalam posisi tetap berdiri: \"Apakah anda telah menceraikan isteri-isteri anda\". Maka Beliau memandang ke arahku lalu berkata: \"Tidak\". Kemudian aku katakan: \"Apakah anda merasa tidak enak karena melihat aku?\" Kami ini adalah orang Quraisy yang biasa menundukkan isteri-isteri. Ketika kami datang disini bertemu dengan Kaum yang mereka ditundukkan oleh isteri-isteri mereka\". Maka 'Umar menceritakan. Lalu Nabi shallallahu 'alaihi wasallam tersenyum. Kemudian aku katakan: \"Bagaimana seandainya anda melihatku menemui Hafshah dan aku katakan kepadanya: \"Jangan kamu cemburu bila ada (isteri Nabi shallallahu 'alaihi wasallam), madu kamu, yang lebih cantik dan lebih dicintai oleh Rasulullah shallallahu 'alaihi wasallam \". Yang dimaksudkan Umar adalah 'Aisyah radliallahu 'anha. Maka Beliau tersenyum lagi. Lalu aku duduk ketika melihat Beliau tersenyum lalu aku memandang ke rumah Beliau. Demi Allah, aku tidak melihat apapun disana, karena mataku bolak balik melihat tidak kurang dari tiga kali. Lalu aku katakan: \"Mintalah kepada Allah agar melapangkan dunia buat ummat anda karena bangsa Persia dan Ramawi saja dilapangkan dan diberikan dunia padahal mereka tidak menyembah Allah\". Saat itu Beliau sedang berbaring lalu berkata: \"Apakah kamu ragu wahai Ibnu Al Khaththob? Mereka itulah kaum yang telah disegerakan kebaikan mereka dalam kehidupan dunia ini\". Aku katakan: \"Wahai Rasulullah, mohonkanlah ampun buatku\". Ternyata disebabkan kalimatku seperti tadilah Rasulullah shallallahu 'alaihi wasallam mengasingkan diri ketika Hafshah menyampaikannya kepada 'Aisyah radliallahu 'anha. Sebelumnya Beliau telah berkata: Aku tidak akan tinggal bersama mereka selama satu bulan karena disebabkan kesalnya Beliau terhadap mereka setelah Allah menegur Beliau. Ketika telah berlalu masa selama dua puluh sembilan hari, yang pertama kali Beliau datangi adalah 'Aisyah. Maka 'Aisyah berkata, kepada Beliau: \"Anda sudah bersumpah untuk tidak mendatangi kami selama satu bulan, sedangkan hari ini kita baru melewati malam kedua puluh sembilan, aku sudah menghitungnya\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"Bulan ini berjumlah dua puluh sembilan hari\". Pada bulan itu memang berjumlah dua puluh sembilan hari. Kemudian 'Aisyah radliallahu 'anha berkata: \"Maka turunlah ayat takhyiir (pilihan). Maka Beliau memulainya dari aku sebagai yang pertama dari isteri-isteri Beliau. Beliau berkata: \"Sesungguhnya aku mengingatkan kamu pada suatu urusan yaitu janganlah kamu tergesa-gesa hingga kamu meminta pendapat kedua orangtuamu\". 'Aisyah radliallahu 'anha berkata: \"Aku sudah mengetahui bahwa kedua orangtuaku tidaklah menyuruh aku untuk bercerai dari anda\" Kemudian Beliau berkata: \"Sesungguhnya Allah telah berfirman: (\"Wahai Nabi, katakanlah kepada isteri-isterimu … hingga sampai pada firmanNya … pahala yang besar) QS Al Ahzab: 28 -29). Aisyah radliallahu 'anha berkata: \"Apakah begitu kedua orangtuaku memerintahkannya? Sungguh aku lebih memilih Allah, RasulNya dan kehidupan akhirat\". Kemudian para isteri Beliau memilih hal yang sama lalu mereka berkata, seperti yang diucapkan 'Aisyah radliallahu 'anha",
          "tr": "Abdullah İbn Abbas r.a.'den rivayet edilmiştir: Allah'ın, haklarında \"Çünkü kalpleriniz sapmıştı\" [Tahrim 4] buyurduğu Hz. Nebi'in iki hanımının hangileri olduğunu Ömer'e sormayı eskiden beri çok arzuluyordum. Onunla birlikte hacca gittim. Yolda bir yöne saptı, ben de ibriği alıp onun tarafına saptım. İhtiyaç giderdi ve geldi. Suyunu döktüm ve abdest aldı. \"Ey mu'minlerim emiri! Allah'ın, haklarında \"Çünkü kalpleriniz sapmıştı\" buyurduğu Hz. Nebi'in iki hanımı hangileriydi?\" diye sordum. \"Abbas'ın oğlu! Sana şaşıyorum. Aişe ve Hafsa'ydı dedi. Sonra Ömer olayı anlatmaya başladı: Ben, ensardan bir komşum la birlikte Ümeyye İbn Zeyd oğullarının mahallesinde oturuyordum. Orası Medine'nin yüksek bir yerindeydi. Nöbetleşe Hz. Nebi'in yanına gidiyorduk. Bir gün o, bir gün ben gidiyordum. Ben indiğimde o gün Hz. Nebi'in buyurduğu emirleri vb. olayları haber veriyordum. O da indiğinde öyle yapıyordu. Biz Kureyşliler kadınlara sözü geçen bir topluluktuk. Medine'ye geldiğimizde onların kadınlarının onlara sözünün geçtiğini gördük. Bizim kadınlarımız da zamanla Medine kadınlarının bu özelliğini almaya başladılar. Bir ara ben hanıma kızdım; bana karşılık verdi. Bu yaptığını yadırgadığımı belli ettim. \"Sana karşılık vermemi niye yadırgıyorsun? Hz. Nebi'in hanımları da ona karşılık veriyorlar. Hatta onlardan biri var ki, bugün Hz. Nebi'in geceye kadar yanına uğramayacak\" dedi. Bu söylediği beni ürküttü ve \"Onlardan hangisi bunu yapacaksa o kendine çok yazık eder\" dedim. Sonra elbisemi giyinip Hafsa'nın yanına giderek: \"İçinizden biri bugün geceye kadar Hz. Nebi'in yanına gitmeyecek mi?\" dedim. O da \"evet\" diye cevap verdi. \"O kendine yazık etmiş, ziyan etmiş. Resulü'nü kızdırdığı için Allah'ın ona kızacağından ve helak olacağından güvencesi var mı? Allah Resulü'ne çok üsteleme ve o sana kızdığında sözüne karşılık verme. Onu yatağında yalnız bırakma ve istediğin şeyi benden iste. Ortağının (yani Aişe'nin) Hz. Nebi'in en çok sevdiği ve onun en gözde hanımı olması sakın ha seni kıskançlıktan dolayı yanlışlığa sürüklemesin\" dedim. Gassan kabilesinin bizimle savaşmak için hazırlık yaptığını konuşuyorduk. Komşum kendi sırası gelince aşağıya indi ve yatsı vakti döndü. Sert bir şekilde kapımı çaldı ve \"kimse yok mu?\" dedi. Telaşla hemen yanına çıktım. \"Çok büyük bir hadise oldu\" dedi. \"Ne oldu? Gassan kabilesi mi geldi?\" dedim. \"Yok\" dedi \"çok daha önemli bir şey. Allah Resulü, hanımlarını boşadı.\" \"Hafsa kendine yazık etti, kötü oldu\" dedim. Bunun olmasını zaten bekliyordum. Hemen üzerimi giyindim ve gidip Nebi (Sallallahu aleyhi ve Sellem) ile birlikte sabah namazını kıldım. Hz. Nebi küçük odasına girip yalnız kaldı. Hafsa yanıma geldi, ağlıyordu. \"Niye ağlıyorsun? Seni uyarmamış mıydım Allah Resulü sizi boşadı mı?\" dedim. \"Bilmiyorum. O şimdi odasında\" dedi. Çıkıp minbere geldim. Minberin çevresinde bir grup insan vardı. Ağlıyorlardı. Onlarla kısa bir süre oturdum. Sonra içimdeki duygu baskın geldi ve Hz. Nebi'in bulunduğu odaya geldim. Hz. Nebi'in siyah! kölesine \"Ömer'in içeri girmesi için izin iste\" dedim. Içeri girdi, Hz. Nebi'le konuştu. Sonra çıkıp \"Senin geldiğini söyledim, ama sustu\" dedi. Ben de oradan ayrıldım ve minberin yanındaki grupla birlikte oturdum. Sonra duygularım yine ağır bastı ve O'nun odasına gittim. Köle yine aynı şeyi söyledi. Ben de minberin yanındaki grupla birlikte oturdum. Sonra yine duygularım ağır bastı ve gelip \"Ömer için izin iste\" dedim. Yine aynı şeyi söyledi. Tam dönmüş ayrılıyordum ki köle arkamdan çağırdı:\"Allah Resulü içeri girmen için izin verdi.\" Yanına girdim. Bir hasır üzerine uzanmış yatıyordu. Altında döşek yoktu. Hasırın yüzeyinin izi vücuduna çıkmıştı. Başında içi hurma yaprağı ile doldurulmuş deri bir yastık vardı. Selam verdim. Sonra oturmadan \"Hanımlarını boşadın mı?\" dedim. Başını bana doğru kaldırdı ve \"hayır\" dedi. Sonra yine oturmadan Hz. Nebi'e (onun kendini nasıl hissettiğini anlayabilmek için) latife yollu \"Ey Allah'ın Resulü! Hatırlar mısın biz Kureyşliler kadınlara sözümüzü geçirirdik. Hanımlarının sözünün geçtiği bir topluluğa gelince (onların sözü geçer oldu)\" dedim. Bu sözüm üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem güıümsedi. Sonra şöyle devam ettim \"Haberin olsun ki ben Hafsa'nın yanına gittim ve ona \"Senin ortağının (Aişe'nin) Hz. Nebi'in en sevdiği ve onun en gözde hanımı olması sakın ha seni kıskançlıktan dolayı yanlışlığa sürüklemesin\" dedim.\" Hz. Nebi bir daha gülümsedi. Onun gülümsediğini görünce oturdum. Sonra odasına şöyle bir göz attım. Allah'a yemin ederim ki odasında üç tane deri’den başka bir şey görmedim. 'Allah'a dua etsen de ümmetinin rızkını artırsa. İranlılar ve Rumlar Allah'a ibadet etmedi~ri halde onların rızkı artırılmış, dünyanın hepsi onlara verilmiş\" dedim. Yaslanmıştı. \"Hattab'ın oğlu! Bir şüphen mi var yoksa? Onlar, nasipleri kendilerine dünya hayatında peşin verilenlerdir\" buyurdu. \"Ey Allah'ın Resulü! Allah'tan benim bağışlanmamı dilesen\" dedim. Hz. Nebi Hafsa'nın Aişe'ye haber verdiği o sözünden dolayı odasına çekilmişti. Hanımlarına kızdığı için \"Bir ay onların yanına girmeyeceğim\" demişti. Bunun üzerine Allah onu azarladı. Aradan 29 gün geçince Aişe'nin yanına girdi, ilk ondan başlamıştı. Aişe ona \"Sen bizim yanımıza bir ay girmemek için yemin etmiştin. Biz tam 29 gün geçirdik. Ben günleri teker teker sayıyorum\" dedi. Hz. Nebi \"Ay yirmi dokuz gündür\" dedi. O ay yirmi dokuz gün çekiyordu. Aişe şöyle demiştir: \"Bu olay üzerine tahyır ayeti (Hz. Nebi'in hanımlarını muhayyer bırakan ayet) indi. Hz. Nebi ilk benden başlamıştı. Bana \"Sana bir şey hatırlatacağım. Ana babana danışmadan acele karar vermen gerekmiyor\" buyurdu. Aişe \"Ben biliyorum ki annem babam bana senden ayrılmamı buyuracak değiller\" dedi. Sonra Hz. Nebi Sallallahu Aleyhi ve Sellem \"Allah (c.c.) \"Ey Nebi! Eşlerine söyle: Eğer dünya dirliğini, süsünü (refahını) istiyorsanız, gelin size boşanma bedellerinizi vereyim de, sizi güzellikle salıvereyim. Eğer Allah'!, Nebi'ini ve ahiret yurdunu diliyorsanız, bilin ki, Allah, içinizden güzel davrananlar için büyük bir mükafat hazırlamıştır\" [el-Ahzab 28,29] buyuruyor\" dedi. Ben \"Ben bu konuda mı anne babama danışacağım. Elbette ki ben Allah'ı, Resulü'nü ve ahiret yurdunu tercih ediyorum\" dedim. Sonra Hz. Nebi diğer hanımlarını muhayyer bıraktı. Onlar da aynen Hz. Aişe'nin söylediğini söylediler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 29
      },
      "narrator": {
        "en": "`Abdullah bin `Abbas"
      }
    },
    {
      "hadithNumber": 2469,
      "arabicNumber": 2469,
      "book": 46,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، حَدَّثَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ شَهْرًا، وَكَانَتِ انْفَكَّتْ قَدَمُهُ فَجَلَسَ فِي عِلِّيَّةٍ لَهُ، فَجَاءَ عُمَرُ، فَقَالَ أَطَلَّقْتَ نِسَاءَكَ قَالَ ‏ \"‏ لاَ، وَلَكِنِّي آلَيْتُ مِنْهُنَّ شَهْرًا ‏\"‏‏.‏ فَمَكُثَ تِسْعًا وَعِشْرِينَ، ثُمَّ نَزَلَ، فَدَخَلَ عَلَى نِسَائِهِ‏.‏",
        "translations": {
          "en": "Narrated Anas:Allah's Messenger (ﷺ) took an oath that he would not go to his wives for one month as his foot had been sprained. He stayed in an upper room when `Umar went to him and said, \"Have you divorced your wives?\" He said, \"No, but I have taken an oath that I would not go to them for one month.\" The Prophet stayed there for twenty-nine days, and then came down and went to his wives",
          "ur": "ہم سے محمد بن سلام بیکندی نے بیان کیا، کہا ہم سے مروان بن معاویہ فزاری نے بیان کیا، ان سے حمید طویل نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج کے پاس ایک مہینہ تک نہ جانے کی قسم کھائی تھی، اور ( ایلاء کے واقعہ سے پہلے 5 ھ میں ) آپ صلی اللہ علیہ وسلم کے قدم مبارک میں موچ آ گئی تھی۔ اور آپ صلی اللہ علیہ وسلم اپنے بالا خانہ میں قیام پذیر ہوئے تھے۔ ( ایلاء کے موقع پر ) عمر رضی اللہ عنہ آئے اور عرض کیا، یا رسول اللہ! کیا آپ نے اپنی بیویوں کو طلاق دے دی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ البتہ ایک مہینے کے لیے ان کے پاس نہ جانے کی قسم کھا لی ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم انتیس دن تک بیویوں کے پاس نہیں گئے ( اور انتیس تاریخ کو ہی چاند ہو گیا تھا ) اس لیے آپ صلی اللہ علیہ وسلم بالاخانے سے اترے اور بیویوں کے پاس گئے۔",
          "fr": "Rapporté par Anas : Le Messager d'Allah (ﷺ) fit le serment de ne pas aller voir ses épouses pendant un mois car il s’était foulé le pied. Il resta dans une chambre à l’étage, et ‘Umar alla le voir et lui demanda : « As-tu divorcé de tes femmes ? » Il répondit : « Non, mais j’ai juré de ne pas aller les voir pendant un mois. » Le Prophète y resta vingt-neuf jours, puis il descendit et alla voir ses épouses",
          "id": "Telah menceritakan kepada kami [Ibnu Salam] telah menceritakan kepada kami [Al Fazariy] dari [Humaid Ath Thawil] dari [Anas radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam meninggalkan isteri-isteri Beliau selama satu bulan dan melepaskan kedua kaki Beliau (tidak turun) lalu tinggal di ruangan khusu Beliau (tempat pengasingan). Lalu datang 'Umar seraya berkata: \"Apakah anda telah menceraikan isteri-isri anda?\" Beliau menjawab: \"Tidak, tetapi aku berpaling dari mereka selama satu bulan\". Beliau berdiam disana selama dua puluh sembilah hari kemudian turun dan menemui isteri-isteri Beliau",
          "tr": "Enes r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem hanımlarına bir ay yaklaşmamak için lla yemini etmiş ve ayağını onların evinden çekmişti. Bir çardakta oturmuştu. Ömer geldi ve \"Hanımlarını boşadın mı?\" diye sordu. \"Hayır ama onlara bir ay yaklaşmamak için yemin ettim\" buyurdu. Yirmi dokuz gün orada kaldı. Sonra indi ve hanımlarının yanına girdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 30
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2470,
      "arabicNumber": 2470,
      "book": 46,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا أَبُو عَقِيلٍ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، قَالَ أَتَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم الْمَسْجِدَ، فَدَخَلْتُ إِلَيْهِ، وَعَقَلْتُ الْجَمَلَ فِي نَاحِيَةِ الْبَلاَطِ فَقُلْتُ هَذَا جَمَلُكَ‏.‏ فَخَرَجَ فَجَعَلَ يُطِيفُ بِالْجَمَلِ قَالَ ‏ \"‏ الثَّمَنُ وَالْجَمَلُ لَكَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Jabir:The Prophet (ﷺ) entered the Mosque, and I too went there after tying the camel at the pavement of the Mosque. I said (to the Prophet (ﷺ) ), \"This is your camel.\" He came out and started examining the camel and said, \"Both the camel and its price are for you",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ابوعقیل نے بیان کیا، ان سے ابوالمتوکل ناجی نے بیان کیا کہ میں جابر بن عبداللہ رضی اللہ عنہما کی خدمت میں حاضر ہوا تو انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف رکھتے تھے۔ اس لیے میں بھی مسجد کے اندر چلا گیا۔ البتہ اونٹ بلاط کے ایک کنارے پر باندھ دیا۔ آپ صلی اللہ علیہ وسلم سے میں نے عرض کیا کہ یا رسول اللہ! آپ کا اونٹ حاضر ہے۔ آپ صلی اللہ علیہ وسلم باہر تشریف لائے اور اونٹ کے چاروں طرف ٹہلنے لگے۔ پھر فرمایا کہ قیمت بھی لے اور اونٹ بھی لے جا۔",
          "fr": "Rapporté par Jabir : Le Prophète (ﷺ) entra dans la mosquée, et j’y suis allé aussi après avoir attaché le chameau sur le trottoir de la mosquée. J’ai dit au Prophète (ﷺ) : « Voici ton chameau. » Il sortit, examina le chameau et dit : « Le chameau et son prix sont pour toi. »",
          "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Abu 'Aqil] telah menceritakan kepada kami [Abu Al Mutawakkil An-Najiy] berkata; Aku menemui [Jabir bin 'Abdullah radliallahu 'anhuma] yang berkata: \"Nabi shallallahu 'alaihi wasallam memasuki masjid lalu aku ikut masuk menemui Beliau sementara unta aku ikat pada batu di depan masjid lalu aku katakan: \"Ini unta anda\". Maka Beliau keluar lalu mendekati unta kemudian bersabda: 'Unta dan uang jualnya buat kamu",
          "tr": "Ebu'l-Mütevekkil en-Naci rivayet etmiştir: Cabir İbn Abdullah r.a.'ın yanına gittim. Şöyle anlattı: Nebi Sallallahu Aleyhi ve Sellem mescide girdi. Ben de devemi mescidin döşeme taşlarına bağlayarak onunla birlikte mescide girdim ve \"Bu senin devendir\" dedim. Dışarı çıktı, deveye yaklaşıp çevresinde şöyle bir döndükten sonra: \"Deve de, para da senindir\" buyurdu. Not: Bu hadis Şurut bölümünde ayrıntılı olarak ele alınacaktır.(2718. hadis) باب: الوقوف والبول عند سباطة قوم. 27. ÇÖPLÜKTE DURMAK VE ORAYA İDRARINI BIRAKMAK"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 31
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 2471,
      "arabicNumber": 2471,
      "book": 46,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم، أَوْ قَالَ لَقَدْ أَتَى النَّبِيُّ صلى الله عليه وسلم سُبَاطَةَ قَوْمٍ فَبَالَ قَائِمًا‏.‏",
        "translations": {
          "en": "Narrated Hudhaifa:I saw Allah's Messenger (ﷺ) coming (or the Prophet (ﷺ) came) to the dumps of some people and urinated there while standing",
          "ur": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے، ان سے منصور نے، ان سے ابووائل نے اور ان سے حذیفہ رضی اللہ عنہ نے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا، یا یہ کہا کہ نبی کریم صلی اللہ علیہ وسلم ایک قوم کی کوڑی پر تشریف لائے، اور آپ صلی اللہ علیہ وسلم نے وہاں کھڑے ہو کر پیشاب کیا۔",
          "fr": "Rapporté par Hudhaifa : J’ai vu le Messager d’Allah (ﷺ) venir (ou le Prophète (ﷺ) est venu) à un endroit où l’on jetait les déchets de certaines personnes et il a uriné là en étant debout",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dari [Syu'bah] dari [Manshur] dari [Abu Wa'il] dari [Hudzaifah radliallahu 'anhu] berkata: \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam \" atau katanya \"Sungguh aku pernah melihat Nabi shallallahu 'alaihi wasallam kencing di tempat pembuangan kotoran sambil berdiri",
          "tr": "Huzeyfe r.a.'den şöyle rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'i gördüm. Çöplüğe gitti ve ayakta bevletti. Not: Bu hadis, Taharet bölümünde ayrıntılı olarak ele alınmıştır.(224. hadiste) باب: من أخذ الغصن، وما يؤذي الناس في الطريق فرمى به. 28. YOLDAKİ DALI VEYA İNSANLARA SIKINTI VEREN BİR ŞEY'İ ALIP ATAN KİŞİ"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 32
      },
      "narrator": {
        "en": "Hudhaifa"
      }
    },
    {
      "hadithNumber": 2472,
      "arabicNumber": 2472,
      "book": 46,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ، وَجَدَ غُصْنَ شَوْكٍ فَأَخَذَهُ، فَشَكَرَ اللَّهُ لَهُ، فَغَفَرَ لَهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"While a man was on the way, he found a thorny branch of a tree there on the way and removed it. Allah thanked him for that deed and forgave him",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں سمی نے، انہیں ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، ایک شخص راستے پر چل رہا تھا کہ اس نے وہاں کانٹے دار ڈالی دیکھی۔ اس نے اسے اٹھا لیا تو اللہ تعالیٰ نے اس کا یہ عمل قبول کیا اور اس کی مغفرت کر دی۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Un homme marchait sur la route, il trouva une branche d’arbre épineuse sur le chemin et l’enleva. Allah l’a remercié pour cet acte et lui a pardonné. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Sumayya] dari [Abu Shalih] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada seorang laki-laki yang sedang berjalan lalu menemuklan potongan duri di jalan lalu diambilnya. Kemudian dia bersyukur kepada Allah maka Allah mengampuninya",
          "tr": "Ebu Hureyre r.a.'den nakledilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir adam yolda yürürken bir diken dalı bulmuştu. Onu aldı ve Allah onun bu davranışına memnun olup onu bağışladı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 33
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2473,
      "arabicNumber": 2473,
      "book": 46,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنِ الزُّبَيْرِ بْنِ خِرِّيتٍ، عَنْ عِكْرِمَةَ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَضَى النَّبِيُّ صلى الله عليه وسلم إِذَا تَشَاجَرُوا فِي الطَّرِيقِ بِسَبْعَةِ أَذْرُعٍ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) judged that seven cubits should be left as a public way when there was a dispute about the land",
          "ur": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے جریر بن حازم نے بیان کیا، ان سے زبیر بن خریت نے اور ان سے عکرمہ نے کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ کیا تھا جب کہ راستے ( کی زمین ) کے بارے میں جھگڑا ہو تو سات ہاتھ راستہ چھوڑ دینا چاہئے۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a jugé qu’il fallait laisser sept coudées de largeur pour un passage public lorsqu’il y avait un litige concernant un terrain",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Jarir bin Hazim] dari [Az Zubair bin Khirrit] dari ['Ikrimah] aku mendengar [Abu Hurairah radliallahu 'anhu] berkata: \"Nabi shallallahu 'alaihi wasallam telah menetapkan jika kalian berselisih tentang jalan supaya membaginya sepanjang tujuh hasta",
          "tr": "İkrime'den rivayet edilmiştir: Ebu Hureyre'nin şöyle dediğini işittim: \"Hz. Nebi Sallallahu Aleyhi ve Sellem bir grup, yol genişliğinde anlaşmazlığa düştüklerinde yolun genişliğinin yedi arşın olmasına hükmetti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 34
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2474,
      "arabicNumber": 2474,
      "book": 46,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَدِيُّ بْنُ ثَابِتٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الأَنْصَارِيّ َ ـ وَهُوَ جَدُّهُ أَبُو أُمِّهِ ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ النُّهْبَى وَالْمُثْلَةِ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin Yazid Al-Ansari:The Prophet (ﷺ) forbade robbery (taking away what belongs to others without their permission), and also forbade mutilation (or maiming) of bodies",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے عدی بن ثابت نے بیان کیا، کہا کہ میں نے عبداللہ بن یزید انصاری رضی اللہ عنہ سے سنا، جو عدی بن ثابت کے نانا تھے۔ کہ نبی کریم صلی اللہ علیہ وسلم نے لوٹ مار کرنے اور مثلہ کرنے سے منع فرمایا تھا۔",
          "fr": "Rapporté par `Abdullah bin Yazid Al-Ansari : Le Prophète (ﷺ) a interdit le vol (prendre ce qui appartient à autrui sans sa permission) et a aussi interdit de mutiler les corps",
          "id": "Telah menceritakan kepada kami [Adam bin Abi Iyas] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami ['Adiy bin Tsabit] aku mendengar ['Abdullah bin Yazid AL Anshariy] dan 'Abdullah ini adalah kakeknya 'Adiy dari pihak ibunya, berkata: \"Nabi shallallahu 'alaihi wasallam telah melarang merampas harta orang dan membuat gambar",
          "tr": "Adi İbn Sabit'ten rivayet edilmiştir: Abdullah İbn Yezıd el-Ensari'nin şöyle dediğini işittim: -Abdullah İbn Yezid, Adi'nin anne tarafından dedesiydi- Nebi Sallallahu Aleyhi ve Sellem yağmalamayı ve musle (organ kesme)yi yasaklamıştır. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 35
      },
      "narrator": {
        "en": "`Abdullah bin Yazid Al-Ansari"
      }
    },
    {
      "hadithNumber": 2475,
      "arabicNumber": 2475,
      "book": 46,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، حَدَّثَنَا عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُ وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَنْتَهِبُ نُهْبَةً يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ حِينَ يَنْتَهِبُهَا وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ وَعَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ إِلاَّ النُّهْبَةَ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time, he is doing it, and when a drinker of an alcoholic liquor drinks it, then he is not a believer at the time of drinking it, and when a thief steals, then he is not a believer at the time of stealing, and when a robber robs, and the people look at him, then he is not a believer at the time of doing robbery",
          "ur": "ہم سے سعید بن عفیر نے بیان کیا، انہوں نے کہا کہ مجھ سے لیث نے بیان، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے، ان سے ابوبکر بن عبدالرحمٰن نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، زانی مومن رہتے ہوئے زنا نہیں کر سکتا۔ شراب خوار مومن رہتے ہوئے شراب نہیں پی سکتا۔ چور مومن رہتے ہوئے چوری نہیں کر سکتا۔ اور کوئی شخص مومن رہتے ہوئے لوٹ اور غارت گری نہیں کر سکتا کہ لوگوں کی نظریں اس کی طرف اٹھی ہوئی ہوں اور وہ لوٹ رہا ہو، سعید اور ابوسلمہ کی بھی ابوہریرہ رضی اللہ عنہ سے بحوالہ نبی کریم صلی اللہ علیہ وسلم اسی طرح روایت ہے۔ البتہ ان کی روایت میں لوٹ کا تذکرہ نہیں ہے۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Quand un adultère commet une relation interdite, il n’est pas croyant au moment où il le fait. Quand quelqu’un boit de l’alcool, il n’est pas croyant au moment où il le boit. Quand un voleur vole, il n’est pas croyant au moment où il vole. Et quand un brigand attaque alors que les gens le voient, il n’est pas croyant au moment où il commet ce vol. »",
          "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] berkata, telah menceritakan kepadaku [Al Laits] telah menceritakan kepada kami ['Uqail] dari [Ibnu Syihab] dari [Abu Bakar bin 'Abdurrahman] dari [Abu Hurairah radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Seorang pezina tidak sempurna imannya ketika sedang berzina, dan seorang peminum khamar tidak sempurna imannya ketika sedang minum-minum dan seorang pencuri idak sempurna imannya ketika sedang mencuri dan seorang yang merampas hak orang agar pandangan manusia tertuju kepadanya tidak sempurna imannya ketika dia merampasnya\". Dan dari [Sa'id] dan [Abu Salamah] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini juga kecuali tentang An-Nublah (merampas hak orang)",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kişi zina ettiği sırada mu'min olarak zina etmez; içki içtiği sırada mu'min olarak içmez; hırsızlık ettiği sırada mu'min olarak hırsızlık etmez; insanların kendisine baka baka yağma yaptığı sırada mu'min olarak yağma yapmaz.\" Said'den ve Ebu Seleme’den Ebu Hureyre r.a. kanalıyla Hz. Nebi'in aynen böyle buyurduğu nakledilmiştir. Ancak o rivayette \"yağma\" maddesi yoktur. Firebri şöyle demiştir: Ebu Cafer'in hattıyla şunu gördüm: Ebu Abdullah şöyle demiştir: \"Bunun tefsiri, kişi bunları yaptığı sırada imanının ondan çekilip alınmasıdır. \" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 36
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2476,
      "arabicNumber": 2476,
      "book": 46,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَنْزِلَ فِيكُمُ ابْنُ مَرْيَمَ حَكَمًا مُقْسِطًا، فَيَكْسِرَ الصَّلِيبَ، وَيَقْتُلَ الْخِنْزِيرَ، وَيَضَعَ الْجِزْيَةَ، وَيَفِيضَ الْمَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The Hour will not be established until the son of Mary (i.e. Jesus) descends amongst you as a just ruler, he will break the cross, kill the pigs, and abolish the Jizya tax. Money will be in abundance so that nobody will accept it (as charitable gifts)",
          "ur": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے زہری نے بیان کیا، کہا کہ مجھے سعید بن مسیب نے خبر دی، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، قیامت اس وقت تک قائم نہ ہو گی جب تک ابن مریم کا نزول ایک عادل حکمران کی حیثیت سے تم میں نہ ہو جائے۔ وہ صلیب کو توڑ دیں گے، سوروں کو قتل کر دیں گے اور جزیہ قبول نہیں کریں گے۔ ( اس دور میں ) مال و دولت کی اتنی کثرت ہو جائے گی کہ کوئی قبول نہیں کرے گا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « L’Heure n’arrivera pas avant que le fils de Marie (c’est-à-dire Jésus) ne descende parmi vous comme un dirigeant juste. Il brisera la croix, tuera les porcs et supprimera la taxe Jizya. L’argent sera si abondant que plus personne n’en voudra comme aumône. »",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhriy] berkata, telah menceritakan kepadaku [Sa'id bin Al Musayyab] dia mendengar [Abu Hurairah radliallahu 'anhu] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan terjadi qiyamat hingga Isa bin Maryam turun sebagai hakim yang adil yang dia menghancurkan salib, membunuh babi, membebaskan jizyah dan harta melimpa ruah sampai tidak ada seorang pun yang mau menerimanya",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir. Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Meryem'in oğlu aranıza adaleti sağlayan bir hakem olarak indirilip haç'ı kırıncaya, domuzu öldürünceye, cizyeyi kaldırıncaya ve mal, hiç kimse kabul etmeyecek derecede çoğalıncaya dek kıyamet kopmaz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 37
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2477,
      "arabicNumber": 2477,
      "book": 46,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى نِيرَانًا تُوقَدُ يَوْمَ خَيْبَرَ‏.‏ قَالَ ‏\"‏ عَلَى مَا تُوقَدُ هَذِهِ النِّيرَانُ ‏\"‏‏.‏ قَالُوا عَلَى الْحُمُرِ الإِنْسِيَّةِ‏.‏ قَالَ ‏\"‏ اكْسِرُوهَا، وَأَهْرِقُوهَا ‏\"‏‏.‏ قَالُوا أَلاَ نُهْرِيقُهَا وَنَغْسِلُهَا قَالَ ‏\"‏ اغْسِلُوا ‏\"‏‏.‏ قَالَ أَبُو عَبْد اللَّهِ كَانَ ابْنُ أَبِي أُوَيْسٍ يَقُولُ الْحُمُرِ الْأَنْسِيَّةِ بِنَصْبِ الْأَلِفِ وَالنُّونِ",
        "translations": {
          "en": "Narrated Salama bin Al-Akwa`:On the day of Khaibar the Prophet (ﷺ) saw fires being lighted. He asked, \"Why are these fires being lighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and throw away their contents.\" The people said, \"Shall we throw away their contents and wash the pots (rather than break them)?\" He said, \"Wash them",
          "ur": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا، کہا ہم سے یزید بن ابی عبید نے اور ان سے سلمہ بن اکوع رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے غزوہ خیبر کے موقع پر دیکھا کہ آگ جلائی جا رہی ہے، آپ صلی اللہ علیہ وسلم نے پوچھا یہ آگ کس لیے جلائی جا رہی ہے؟ صحابہ رضی اللہ عنہم نے عرض کیا کہ گدھے ( کا گوشت پکانے ) کے لیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ برتن ( جس میں گدھے کا گوشت ہو ) توڑ دو اور گوشت پھینک دو۔ اس پر صحابہ بولے ایسا کیوں نہ کر لیں کہ گوشت تو پھینک دیں اور برتن دھو لیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ برتن دھو لو۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) کہتے ہیں ابن ابی اویس «الحمر الأنسية» کو الف اور نون کو نصب کے ساتھ کہا کرتے تھے۔",
          "fr": "Rapporté par Salama bin Al-Akwa` : Le jour de Khaybar, le Prophète (ﷺ) vit des feux allumés. Il demanda : « Pourquoi ces feux sont-ils allumés ? » Les gens répondirent qu’ils faisaient cuire de la viande d’ânes. Il dit : « Cassez les marmites et jetez-en le contenu. » Les gens dirent : « Devons-nous jeter le contenu et laver les marmites (au lieu de les casser) ? » Il répondit : « Lavez-les. »",
          "id": "Telah menceritakan kepada kami [Abu 'Ashim Adh-Dhohhak bin Makhlad] dari [Yazid bin Abu 'Ubaid] dari [Salamah bin Al Akwa' radliallahu 'anhuma] bahwa Nabi shallallahu 'alaihi wasallam melihat api yang dinyalakan pada perang Khaibar. Beliau bertanya: \"Untuk apa api itu dinyalakan?\" Mereka menjawab: \"Untuk daging keledai piaraan manusia\". Beliau berkata: \"Hancurkan dan bakarlah\". Mereka bertanya: \"Apakah kita bakar lalu kita cuci (bersihkan)?\" Beliau berkata: \"Bersihkanlah\". Berkata, Abu 'Abdullah Al Bukhariy: Ibnu Abu Uwais berkata, Al Humur Al Insiyah dengan huruf alif dan nun manshub",
          "tr": "Seleme İbn Ekva r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Hayber savaşında yakılmış ateşler gördü. \"Bu ateşlerde ne pişiriliyor\" buyurdu. \"Evcil eşekler pişiriliyor\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Kapları kırın ve içindekini dökün\" buyurdu. \"İçindekini döküp kapları yıkasak olmaz mı?\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Yıkayabilirsiniz\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 38
      },
      "narrator": {
        "en": "Salama bin Al-Akwa`"
      }
    },
    {
      "hadithNumber": 2478,
      "arabicNumber": 2478,
      "book": 46,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ، وَحَوْلَ الْكَعْبَةِ ثَلاَثُمِائَةٍ وَسِتُّونَ نُصُبًا فَجَعَلَ يَطْعَنُهَا بِعُودٍ فِي يَدِهِ وَجَعَلَ يَقُولُ ‏{‏جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ‏}‏ الآيَةَ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin Mas`ud:The Prophet (ﷺ) entered Mecca and (at that time) there were three hundred-and-sixty idols around the Ka`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has come and Falsehood (disbelief) has vanished",
          "ur": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، انہوں نے کہا ہم سے ابن ابی نجیح نے بیان کیا، ان سے مجاہد نے بیان کیا، ان سے ابومعمر نے بیان کیا، اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم ( فتح مکہ دن جب ) مکہ میں داخل ہوئے تو خانہ کعبہ کے چاروں طرف تین سو ساٹھ بت تھے۔ آپ صلی اللہ علیہ وسلم کے ہاتھ میں ایک چھڑی تھی جس سے آپ صلی اللہ علیہ وسلم ان بتوں پر مارنے لگے اور فرمانے لگے کہ «جاء الحق وزهق الباطل‏» ”حق آ گیا اور باطل مٹ گیا“۔",
          "fr": "Rapporté par `Abdullah bin Mas`ud : Le Prophète (ﷺ) entra à La Mecque alors qu’il y avait trois cent soixante idoles autour de la Ka`ba. Il se mit à frapper les idoles avec un bâton qu’il tenait à la main et récitait : « La vérité (l’islam) est venue et le mensonge (l’incroyance) a disparu. »",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Ibnu Abi Najih] dari [Mujahid] dari [Abu Ma'mar] dari ['Abdullah bin Mas'ud radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam masuk ke Ka'bah saat yang ketika itu berisi tiga ratus enam puluh patung, lalu Beliau menusuk dan menghancurkannya dengan menggunakan tongkat yang ada di tangan Beliau seraya berkata: \"Telah datang kebenaran dan sirnalah kebathilan\", QS Al Isra' ayat",
          "tr": "Abdullah İbn Mes'ud r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Mekke'ye girdiğinde Kabe'nin etrafında tam 360 put vardı.Elindeki bir sopayla putları devirip devirip yıktı. Yıktığı sırada da: \"Hak geldi, batıl yıkılıp gitti\" [İsra 81] ayetini okuyordu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 39
      },
      "narrator": {
        "en": "`Abdullah bin Mas`ud"
      }
    },
    {
      "hadithNumber": 2479,
      "arabicNumber": 2479,
      "book": 46,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتِ اتَّخَذَتْ عَلَى سَهْوَةٍ لَهَا سِتْرًا فِيهِ تَمَاثِيلُ، فَهَتَكَهُ النَّبِيُّ صلى الله عليه وسلم، فَاتَّخَذَتْ مِنْهُ نُمْرُقَتَيْنِ، فَكَانَتَا فِي الْبَيْتِ يَجْلِسُ عَلَيْهِمَا‏.‏",
        "translations": {
          "en": "Narrated Al-Qasim:Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet (ﷺ) tore that curtain and she turned it into two cushions which remained in the house for the Prophet (ﷺ) to sit on",
          "ur": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا ہم سے انس بن عیاض نے بیان کیا، ان سے عبیداللہ عمری نے، ان سے عبدالرحمٰن بن قاسم نے، ان سے ان کے والد قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ انہوں نے اپنے حجرے کے سائبان پر ایک پردہ لٹکا دیا جس میں تصویریں بنی ہوئی تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے ( جب دیکھا تو ) اسے اتار کر پھاڑ ڈالا۔ ( عائشہ رضی اللہ عنہا نے بیان کیا کہ ) پھر میں نے اس پردے سے دو گدے بنا ڈالے۔ وہ دونوں گدے گھر میں رہتے تھے اور نبی کریم صلی اللہ علیہ وسلم ان پر بیٹھا کرتے تھے۔",
          "fr": "Rapporté par Al-Qasim : Aisha رضي الله عنها a dit qu’elle avait accroché un rideau décoré avec des images (d’animaux) sur une armoire. Le Prophète (ﷺ) a déchiré ce rideau et elle en a fait deux coussins qui sont restés dans la maison pour que le Prophète (ﷺ) puisse s’asseoir dessus",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] telah menceritakan kepada kami [Anas bin 'Iyadh] dari ['Ubaidullah bin 'Umar] dari ['Abdurrahman bin Al Qasim] dari [bapaknya, Al Qasim] dari ['Aisyah radliallahu 'anha] bahwa dia tanpa sengaja memiliki tabir yang padanya ada gambar. Maka Nabi shallallahu 'alaihi wasallam merobeknya. Kemudian dia ('Aisyah) mengambil dan membuatnya menjadi dua bantal yang dipakai dirumah sebagai alas duduk Beliau",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: Aişe, odasındaki bir raf'a resimli bir perde takmıştı. Hz. Nebi onu yırttı. Bunun üzerine Aişe onun kumaşından iki minder yaptı. O minderler odada dururdu ve Hz. Nebi üzerinde otururdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 40
      },
      "narrator": {
        "en": "Al-Qasim"
      }
    },
    {
      "hadithNumber": 2480,
      "arabicNumber": 2480,
      "book": 46,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا سَعِيدٌ ـ هُوَ ابْنُ أَبِي أَيُّوبَ ـ قَالَ حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عِكْرِمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Amr bin Al-`As:I heard the Prophet (ﷺ) saying, \"Whoever is killed while protecting his property then he is a martyr",
          "ur": "ہم سے عبداللہ بن یزید نے بیان کیا، انہوں نے کہا ہم سے سعید بن ابی ایوب نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوالاسود نے بیان کیا، ان سے عکرمہ نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اپنے مال کی حفاظت کرتے ہوئے قتل کر دیا گیا وہ شہید ہے۔",
          "fr": "Rapporté par `Abdullah bin `Amr bin Al-`As : J’ai entendu le Prophète (ﷺ) dire : « Celui qui est tué en défendant ses biens est un martyr. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id, dia adalah anak dari Abu Ayyub] berkata, telah menceritakan kepadaku [Abu Al Aswad] dari ['Ikrimah] dari ['Abdullah bin 'Amru radliallahu 'anhuma] berkata, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang terbunuh karena membela hartanya maka dia syahid",
          "tr": "Abdullah İbn Amr r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle buyururken işittim: \"Her kim malı uğruna savaşırsa şehit olur.\" Diğer tahric: Tirmizî, Diyat; Müslim, Müsakât"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 41
      },
      "narrator": {
        "en": "`Abdullah bin `Amr bin Al-`As"
      }
    },
    {
      "hadithNumber": 2481,
      "arabicNumber": 2481,
      "book": 46,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ عِنْدَ بَعْضِ نِسَائِهِ، فَأَرْسَلَتْ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ مَعَ خَادِمٍ بِقَصْعَةٍ فِيهَا طَعَامٌ فَضَرَبَتْ بِيَدِهَا، فَكَسَرَتِ الْقَصْعَةَ، فَضَمَّهَا، وَجَعَلَ فِيهَا الطَّعَامَ وَقَالَ ‏ \"‏ كُلُوا ‏\"‏‏.‏ وَحَبَسَ الرَّسُولَ وَالْقَصْعَةَ حَتَّى فَرَغُوا، فَدَفَعَ الْقَصْعَةَ الصَّحِيحَةَ وَحَبَسَ الْمَكْسُورَةَ‏.‏ وَقَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا حُمَيْدٌ، حَدَّثَنَا أَنَسٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Anas:While the Prophet (ﷺ) was with one of his wives, one of the mothers of the believers (i.e. one of his wives) sent a wooden bowl containing food with a servant. The wife (in whose house he was sitting) stroke the bowl with her hand and broke it. The Prophet (ﷺ) collected the shattered pieces and put the food back in it and said, \"Eat.\" He kept the servant and the bowl till he had eaten the food. Then the Prophet gave another unbroken. bowl to the servant and kept the broken one",
          "ur": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم ازواج مطہرات میں سے کسی ایک کے یہاں تشریف رکھتے تھے۔ امہات المؤمنین میں سے ایک نے وہیں آپ صلی اللہ علیہ وسلم کے لیے خادم کے ہاتھ ایک پیالے میں کچھ کھانے کی چیز بھجوائی۔ انہوں نے ایک ہاتھ اس پیالے پر مارا، اور پیالہ ( گر کر ) ٹوٹ گیا۔ آپ صلی اللہ علیہ وسلم نے پیالے کو جوڑا اور جو کھانے کی چیز تھی اس میں دوبارہ رکھ کر صحابہ سے فرمایا کہ کھاؤ۔ آپ صلی اللہ علیہ وسلم نے پیالہ لانے والے ( خادم ) کو روک لیا اور پیالہ بھی نہیں بھیجا۔ بلکہ جب ( کھانے سے ) سب فارغ ہو گئے تو دوسرا اچھا پیالہ بھجوا دیا اور جو ٹوٹ گیا تھا اسے نہیں بھجوایا۔ ابن ابی مریم نے بیان کیا کہ ہمیں یحییٰ بن ایوب نے خبر دی، ان سے حمید نے بیان کیا، ان سے انس رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے۔",
          "fr": "Rapporté par Anas : Pendant que le Prophète (ﷺ) était avec l’une de ses épouses, l’une des mères des croyants (c’est-à-dire une de ses femmes) envoya un bol en bois contenant de la nourriture avec un serviteur. L’épouse chez qui il se trouvait frappa le bol avec sa main et le cassa. Le Prophète (ﷺ) ramassa les morceaux et remit la nourriture dedans, puis il dit : « Mangez. » Il garda le serviteur et le bol jusqu’à ce qu’il ait mangé la nourriture. Ensuite, le Prophète donna un autre bol intact au serviteur et garda le bol cassé",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Humaid] dari [Anas radliallahu 'anhu] bahwa ketika Nabi shallallahu 'alaihi wasallam sedang bersama sebagian isteri-isteri Beliau datang salah seorang Ummahatul Mu'minin bersama seorang pembantu membawa nampan besar berisi makanan lalu nampan itu dipukul oleh saorang isteri Beliau tersebut hingga pecah. Maka Beliau membereskan nampan pecah tersebut lalu meletakkan kembali makanan tersebut kedalam nampan kemudian berkata: \"Makanlah\". Lalu Beliau membiarkan pembantu dan nampan itu hingga mereka selesai makan kemudian datng mengganti nampan dengan nampan yang baru lalu membawa masuk nampan yang pecah\". Dan [Ibnu Abi Maryam] berkata, telah mengabarkan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Humaid] telah menceritakan kepada kami [Anas] dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Enes r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem hanımlarından birinin yanında bulunuyordu. mu'minlerin annelerinden biri, onun bulunduğu odaya içinde yemek olan bir tencere gönderdi. Hz. Nebi'in odasında bulunduğu hanımı, tencereye eliyle vurarak kırdı. Nebi Sallallahu Aleyhi ve Sellem hemen tencereyi birleştirdi, dökülen yemeği içine koydu ve: \"yeyin\" buyurdu. Yemeği bitirinceye kadar, yemek getiren kişiyi ve kırık tencereyi yanında bekletti. Sonra yemeği getiren kişiye sağlam bir tencere verdi ve kırılanı göndermedi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 42
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2482,
      "arabicNumber": 2482,
      "book": 46,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَانَ رَجُلٌ فِي بَنِي إِسْرَائِيلَ، يُقَالُ لَهُ جُرَيْجٌ، يُصَلِّي، فَجَاءَتْهُ أُمُّهُ فَدَعَتْهُ، فَأَبَى أَنْ يُجِيبَهَا، فَقَالَ أُجِيبُهَا أَوْ أُصَلِّي ثُمَّ أَتَتْهُ، فَقَالَتِ اللَّهُمَّ لاَ تُمِتْهُ حَتَّى تُرِيَهُ الْمُومِسَاتِ‏.‏ وَكَانَ جُرَيْجٌ فِي صَوْمَعَتِهِ، فَقَالَتِ امْرَأَةٌ لأَفْتِنَنَّ جُرَيْجًا‏.‏ فَتَعَرَّضَتْ لَهُ فَكَلَّمَتْهُ فَأَبَى، فَأَتَتْ رَاعِيًا، فَأَمْكَنَتْهُ مِنْ نَفْسِهَا فَوَلَدَتْ غُلاَمًا، فَقَالَتْ هُوَ مِنْ جُرَيْجٍ‏.‏ فَأَتَوْهُ، وَكَسَرُوا صَوْمَعَتَهُ فَأَنْزَلُوهُ وَسَبُّوهُ، فَتَوَضَّأَ وَصَلَّى ثُمَّ أَتَى الْغُلاَمَ، فَقَالَ مَنْ أَبُوكَ يَا غُلاَمُ قَالَ الرَّاعِي‏.‏ قَالُوا نَبْنِي صَوْمَعَتَكَ مِنْ ذَهَبٍ‏.‏ قَالَ لاَ إِلاَّ مِنْ طِينٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"There was an Israeli man called Juraij, while he was praying, his mother came and called him, but he did not respond to her call. He said (to himself) whether he should continue the prayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do not let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said that she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. She then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and later she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and broke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the prayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby replied that his father was the shepherd. The people said that they would build for him a hermitage of gold but Juraij asked them to make it of mud only",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے جریر بن حازم نے بیان کیا، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، بنی اسرائیل میں ایک صاحب تھے، جن کا نام جریج تھا۔ وہ نماز پڑھ رہے تھے کہ ان کی والدہ آئیں اور انہیں پکارا۔ انہوں نے جواب نہیں دیا۔ سوچتے رہے کہ جواب دوں یا نماز پڑھوں۔ پھر وہ دوبارہ آئیں اور ( غصے میں ) بددعا کر گئیں، اے اللہ! اسے موت نہ آئے جب تک کسی بدکار عورت کا منہ نہ دیکھ لے۔ جریج اپنے عبادت خانے میں رہتے تھے۔ ایک عورت نے ( جو جریج کے عبادت خانے کے پاس اپنی مویشی چرایا کرتی تھی اور فاحشہ تھی ) کہا کہ جریج کو فتنہ میں ڈالے بغیر نہ رہوں گی۔ چنانچہ وہ ان کے سامنے آئی اور گفتگو کرنی چاہی، لیکن انہوں نے منہ پھیر لیا۔ پھر وہ ایک چرواہے کے پاس گئی اور اپنے جسم کو اس کے قابو میں دے دیا۔ آخر لڑکا پیدا ہوا۔ اور اس عورت نے الزام لگایا کہ یہ جریج کا لڑکا ہے۔ قوم کے لوگ جریج کے یہاں آئے اور ان کا عبادت خانہ توڑ دیا۔ انہیں باہر نکالا اور گالیاں دیں۔ لیکن جریج نے وضو کیا اور نماز پڑھ کر اس لڑکے کے پاس آئے۔ انہوں نے اس سے پوچھا۔ بچے! تمہار باپ کون ہے؟ بچہ ( اللہ کے حکم سے ) بول پڑا کہ چرواہا! ( قوم خوش ہو گئی اور ) کہا کہ ہم آپ کے لیے سونے کا عبادت خانہ بنوا دیں۔ جریج نے کہا کہ میرا گھر تو مٹی ہی سے بنے گا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Il y avait un homme israélite appelé Juraij. Alors qu’il priait, sa mère est venue l’appeler, mais il n’a pas répondu. Il s’est demandé s’il devait continuer sa prière ou répondre à sa mère. Elle revint une deuxième fois, l’appela et dit : “Ô Allah ! Ne le fais pas mourir avant qu’il ne voie le visage des prostituées.” Juraij vivait dans un ermitage. Une femme dit qu’elle allait le séduire, alors elle alla le voir et se présenta à lui (pour une mauvaise action), mais il refusa. Elle alla alors voir un berger, eut une relation interdite avec lui et donna ensuite naissance à un garçon. Elle accusa Juraij d’être le père. Les gens allèrent voir Juraij, détruisirent son ermitage, le sortirent et l’insultèrent. Il fit ses ablutions, pria, puis alla voir le bébé et lui demanda : “Petit, qui est ton père ?” Le bébé répondit que son père était le berger. Les gens dirent qu’ils allaient lui reconstruire un ermitage en or, mais Juraij leur demanda de le faire en terre seulement. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Jarir bin HAzim] dari [Muhammad bin Sirin] dari [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada seorang laki-laki Bani Isra'il, yang dipanggil dengan nama Juraij, sedang melaksanakan shalat lalu ibunya datang memanggilnya, namun laki-laki itu enggan menjawabnya. Dia berkata: \"Apakah aku penuhi panggilannya atau aku teruskan shalat?\". Akhirnya ibunya itu mendekatinya seraya berkata: \"Ya Allah, janganlah Engkau matikan dia kecuali setelah dia memperoleh ujian\". Suatu hari Juraij sedang berada di biaranya lalu ada seorang wanita berkata,: \"Aku akan goda si Juraij\". Lalu wanita ini menawarkan dirinya tapi Juraij menolakmya. Kemudian wanita ini mendatangi seorang pengembala lalu wanita ini tinggal bersamanya hingga melahirkan seorang bayi. Lalu wanita itu berkata: \"Ini anaknya Juraij\". Maka orang-orang mendatangi Juraij dan menghancurkan biaranya dan memaksanya keluar lalu memaki-makinya. Juraij berwudhu' lalu shalat. Kemudian dia mendatangi bayi lalu bertanya: \"Siapakah bapakmu wahai anak?\". Bayi itu menjawab: \"Seorang pengembala\". Orang-orang berkata: \"Kami akan bangun biaramu terbuat dari emas\". Juraij berkata: \"Tidak, dari tanah saja",
          "tr": "Ebu Hureyre r.a.'den rivayet edildiğine göre Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İsrail oğullarında Cüreyc adında bir adam vardı. Namaz kılarken annesi onu çağırdı. (Namazını bozup) ona cevap vermek istemeyerek \"anneme cevap mı vereyim, yoksa namaz mı kılayım\" dedi. Sonra annesi gelerek: \"Allahım' Fahişelerin yüzünü göstermeden onun canını alma\" diye beddua etti. Bir ara Cüreyc manastırında ibadet ediyordu. Kadının biri \"Cüreyc'in başına bir fitne açayım\" dedi. Onun karşısına dikilip ona laf attı. Cüreyc hiç oralı olmadı. Bunun üzerine kadın bir çobanın yanına giderek onunla ilişkiye girdi. Bir erkek çocuğu doğurdu ve \"Bu Cüreyc'in çocuğu\" dedi. Bunun üzerine kavmi, gidip Cüreyc'in manastırını yıktılar, onu aşağı indirdiler ve kötü sözler söylediler. Bunun üzerine Cüreyc gidip abdest aldı, namaz kıldı, sonra gelip çocuğa \"Küçük! Senin baban kim\" diye sordu. Çocuk ''falanca çobandır\" dedi. Bunun üzerine kavmi, \"sana altından bir manastır yapalım\" dediler. \"Hayır, balçıktan yapın yeter\" dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 46,
        "hadith": 43
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "32KB"
  }
}