{
  "collection": "bukhari",
  "book": 11,
  "name": {
    "arabic": "كتاب Friday Prayer",
    "transliteration": "friday prayer",
    "translation": "Friday Prayer"
  },
  "totalHadith": 65,
  "hadithNumberRange": {
    "first": 876,
    "last": 941
  },
  "content": [
    {
      "hadithNumber": 876,
      "arabicNumber": 876,
      "book": 11,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الأَعْرَجَ، مَوْلَى رَبِيعَةَ بْنِ الْحَارِثِ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ، بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا، ثُمَّ هَذَا يَوْمُهُمُ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ، فَهَدَانَا اللَّهُ، فَالنَّاسُ لَنَا فِيهِ تَبَعٌ، الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:I heard Allah's Messenger (ﷺ) saying, \"We (Muslims) are the last (to come) but (will be) the foremost on the Day of Resurrection though the former nations were given the Holy Scriptures before us. And this was their day (Friday) the celebration of which was made compulsory for them but they differed about it. So Allah gave us the guidance for it (Friday) and all the other people are behind us in this respect: the Jews' (holy day is) tomorrow (i.e. Saturday) and the Christians' (is) the day after tomorrow (i.e. Sunday)",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، کہا کہ ہم سے ابوالزناد نے بیان کیا، ان سے ربیعہ بن حارث کے غلام عبدالرحمٰن بن ہرمز اعرج نے بیان کیا کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا اور آپ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ نے فرمایا کہ ہم دنیا میں تمام امتوں کے بعد ہونے کے باوجود قیامت میں سب سے آگے رہیں گے فرق صرف یہ ہے کہ کتاب انہیں ہم سے پہلے دی گئی تھی۔ یہی ( جمعہ ) ان کا بھی دن تھا جو تم پر فرض ہوا ہے۔ لیکن ان کا اس کے بارے میں اختلاف ہوا اور اللہ تعالیٰ نے ہمیں یہ دن بتا دیا اس لیے لوگ اس میں ہمارے تابع ہوں گے۔ یہود دوسرے دن ہوں گے اور نصاریٰ تیسرے دن۔",
          "fr": "Rapporté par Abu Huraira : J’ai entendu le Messager d’Allah (ﷺ) dire : « Nous (les musulmans) sommes les derniers (à venir) mais (nous serons) les premiers au Jour de la Résurrection, même si les nations précédentes ont reçu les Écritures Saintes avant nous. Et c’était leur jour (le vendredi), dont la célébration leur avait été rendue obligatoire, mais ils ont divergé à ce sujet. Alors Allah nous a guidés vers ce jour (le vendredi) et tous les autres peuples sont derrière nous à ce sujet : le jour sacré des Juifs est demain (c’est-à-dire samedi) et celui des Chrétiens est après-demain (c’est-à-dire dimanche). »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] berkata, telah menceritakan kepada kami [Abu Az Zinad] banwa ['Abdurrahman bin Hurmuz Al A'raj] mantan budak Rabi'ah bin Al Harits, menceritakan kepadanya bahwasanya dia mendengar [Abu Hurairah] radliallahu 'anhu, bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita datang terakhir dan pertama pada hari kiamat, meskipun mereka diberi Kitab sebelum kita. Dan ini adalah hari dimana mereka mendapat kewajiban, namun kemudian mereka berselisih di dalamnya. Allah lalu memberi hidayah kepada kita, maka semua manusia akan mengikuti kita (hari ini), besok hari untuk Yahudi dan Nashrani hari setelahnya lagi",
          "tr": "Ebu Hureyre (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işitmiştîr: \"Bizler en son gelenleriz, fakat kıyamet gününde herkesin önünde bulunan ilkler olacağız. Hem de bizim dışımızdaki ümmetlere biz'den daha önce kitap verildiği halde... Aslında şu içinde bulunduğumuz Cum'a gününü Allah onlara farz kılmıştı (onlar için kutsal gün olarak belirlemişti), fakat onlar bu konuda görüş ayrılığına düştüler. Allah bizlere bu gün'ü (mübarek gün olarak) lütfetti. Dolayısıyla diğer ümmetler (kendileri için kutsal olan gün itibariyle) bize tabidirler. Şöyle ki; Yahudilerin (kutsal günü olan Cumartesi) yarındır, Hıristiyanların (kutsal günü olan Pazar ise) yarından sonraki gündür"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 1
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 877,
      "arabicNumber": 877,
      "book": 11,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) said, \"Anyone of you attending the Friday (prayers) should take a bath",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی اور ان کو عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے جب کوئی شخص جمعہ کی نماز کے لیے آنا چا ہے تو اسے غسل کر لینا چاہیے۔",
          "fr": "Rapporté par `Abdullah bin `Umar : Le Messager d’Allah (ﷺ) a dit : « Celui d’entre vous qui assiste à la prière du vendredi doit prendre un bain. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorangii kalian mendatangi shalat jum'at hendaklah ia mandi",
          "tr": "Abdullah İbn Ömer (Radiyallahu Anh) Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: İçinizden kim Cum'a namazına gelirse boy abdesti alsınl. Tekrar; 894 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 2
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 878,
      "arabicNumber": 878,
      "book": 11,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ أَخْبَرَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَيْنَمَا هُوَ قَائِمٌ فِي الْخُطْبَةِ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ مِنَ الْمُهَاجِرِينَ الأَوَّلِينَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ قَالَ إِنِّي شُغِلْتُ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ التَّأْذِينَ، فَلَمْ أَزِدْ أَنْ تَوَضَّأْتُ‏.‏ فَقَالَ وَالْوُضُوءُ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِالْغُسْلِ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:While `Umar bin Al-Khattab was standing and delivering the sermon on a Friday, one of the companions of the Prophet, who was one of the foremost Muhajirs (emigrants) came. `Umar said to him, \"What is the time now?\" He replied, \"I was busy and could not go back to my house till I heard the Adhan. I did not perform more than the ablution.\" Thereupon `Umar said to him, \"Did you perform only the ablution although you know that Allah's Messenger (ﷺ) used to order us to take a bath (on Fridays)?",
          "ur": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا، انہوں نے کہا کہ ہم سے جویریہ بن اسماء نے امام مالک سے بیان کیا، ان سے زہری نے، ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے ان سے ابن عمر رضی اللہ عنہما نے کہ عمر بن خطاب رضی اللہ عنہ جمعہ کے دن کھڑے خطبہ دے رہے تھے کہ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے اگلے صحابہ مہاجرین میں سے ایک بزرگ تشریف لائے ( یعنی عثمان رضی اللہ عنہ ) عمر رضی اللہ عنہ نے ان سے کہا بھلا یہ کون سا وقت ہے انہوں نے فرمایا کہ میں مشغول ہو گیا تھا اور گھر واپس آتے ہی اذان سنی، اس لیے میں وضو سے زیادہ اور کچھ ( غسل ) نہ کر سکا۔ عمر رضی اللہ عنہ نے فرمایا کہ وضو بھی اچھا ہے۔ حالانکہ آپ کو معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم غسل کے لیے فرماتے تھے۔",
          "fr": "Rapporté par Ibn `Umar : Alors que `Umar ibn Al-Khattab était debout et prononçait le sermon un vendredi, l’un des compagnons du Prophète, qui faisait partie des premiers Mouhajiroun (émigrés), arriva. `Umar lui demanda : « Quelle heure est-il maintenant ? » Il répondit : « J’étais occupé et je n’ai pas pu rentrer chez moi avant d’entendre l’Adhan. Je n’ai fait que les ablutions. » `Umar lui dit alors : « Tu n’as fait que les ablutions alors que tu sais que le Messager d’Allah (ﷺ) nous ordonnait de prendre un bain (le vendredi) ? »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad bin Asma'] berkata, telah mengabarkan kepada kami [Juwairiyah bin Asma'] dari [Malik] dari [Az Zuhri] dari [Salim bin 'Abdullah bin 'Umar] dari [Ibnu Umar] radliallahu 'anhuma, bahwa ketika ['Umar bin Al Khaththab] berdiri khuthbah pada hari Jum'at, tiba-tiba ada seorang laki-laki Muhajirin Al Awwalin (generasi pertama), sahabat Nabi shallallahu 'alaihi wasallam, masuk (ke dalam Masjid). Maka 'Umar pun bertanya, \"Jam berapakah ini?\" Sahabat tersebut menjawab, \"Aku sibuk, dan aku belum sempat pulang ke rumah hingga akhirnya aku mendengar adzan dan aku hanya bisa berwudlu.\" Umar berkata, \"Hanya berwudlu' saja! Sungguh kamu sudah mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mandi (di hari Jum'at)",
          "tr": "Abdullah İbn Ömer (Radiyallahu Anh)'den nakledilen bir rivayet şöyledir: \"Ömer bir Cum'a günü ayakta hutbe îrad ederken ilk olarak hicret edenlerden bir sahabî mescid'e girmişti. Bunun üzerine Ömer ona seslenerek: Hiç vakitten haberin var mı senin?!' demişti. O sahabî: 'Bazı işlerim vardı, daha evime varmadan ezan'ın okunduğunu işittim ve hatta bu telaş içinde sadece abdest alarak mescid'e gelmek durumunda kaldım' deyince Ömer (r.a.) ona şöyle mukabelede bulundu; (Namaz'a geç kaldığın yetmiyormuş gibi) bir de sadece abdest almakla yetindin öyle mi! Halbuki Resulullah Sallallahu Aleyhi ve Sellem'in Cum'a günü boy abdesti almayı emrettiğini biliyorsun"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 3
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 879,
      "arabicNumber": 879,
      "book": 11,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id Al-Khudri:Allah's Messenger (ﷺ) said, \"The taking of a bath on Friday is compulsory for every male (Muslim) who has attained the age of puberty",
          "ur": "ہم سے عبداللہ بن یوسف نے حدیث بیان کی، انہوں نے کہا کہ ہمیں مالک نے صفوان بن سلیم کے واسطہ سے خبر دی، انہیں عطاء بن یسار نے، انہیں ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر بالغ کے لیے غسل ضروری ہے۔",
          "fr": "Rapporté par Abu Sa`id Al-Khudri : Le Messager d’Allah (ﷺ) a dit : « Prendre un bain le vendredi est obligatoire pour tout homme (musulman) ayant atteint la puberté. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Shafwan bin Sulaim] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudri] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi setiap orang yang sudah baligh",
          "tr": "Ebu Saîd el-Hudrî (Radiyallahu Anh) Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü boy abdesti (ğusül) almak ihtilam olan (ergenlik çağına giren) herkese vaciptir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 4
      },
      "narrator": {
        "en": "Abu Sa`id Al-Khudri"
      }
    },
    {
      "hadithNumber": 880,
      "arabicNumber": 880,
      "book": 11,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيٌّ، قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، قَالَ حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ الأَنْصَارِيُّ، قَالَ أَشْهَدُ عَلَى أَبِي سَعِيدٍ قَالَ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ، وَأَنْ يَسْتَنَّ وَأَنْ يَمَسَّ طِيبًا إِنْ وَجَدَ ‏\"‏‏.‏ قَالَ عَمْرٌو أَمَّا الْغُسْلُ فَأَشْهَدُ أَنَّهُ وَاجِبٌ، وَأَمَّا الاِسْتِنَانُ وَالطِّيبُ فَاللَّهُ أَعْلَمُ أَوَاجِبٌ هُوَ أَمْ لاَ، وَلَكِنْ هَكَذَا فِي الْحَدِيثِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هُوَ أَخُو مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَلَمْ يُسَمَّ أَبُو بَكْرٍ هَذَا‏.‏ رَوَاهُ عَنْهُ بُكَيْرُ بْنُ الأَشَجِّ وَسَعِيدُ بْنُ أَبِي هِلاَلٍ وَعِدَّةٌ‏.‏ وَكَانَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ يُكْنَى بِأَبِي بَكْرٍ وَأَبِي عَبْدِ اللَّهِ‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id:I testify that Allah's Messenger (ﷺ) said, \"The taking of a bath on Friday is compulsory for every male Muslim who has attained the age of puberty and (also) the cleaning of his teeth with Siwak, and the using of perfume if it is available.\" `Amr (a sub-narrator) said, \"I confirm that the taking of a bath is compulsory, but as for the Siwak and the using of perfume, Allah knows better whether it is obligatory or not, but according to the Hadith it is as above",
          "ur": "ہم سے علی بن مدینی نے بیان کیا، انہوں نے کہا کہ ہمیں حرمی بن عمارہ نے خبر دی انہوں نے کہا کہ ہم سے شعبہ بن حجاج نے ابوبکر بن منکدر سے بیان کیا، انہوں نے کہا کہ مجھ سے عمرو بن سلیم انصاری نے بیان کیا، انہوں نے کہا کہ میں گواہ ہوں کہ ابو سعید خدری رضی اللہ عنہ نے فرمایا تھا کہ میں گواہ ہوں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر جوان پر غسل، مسواک اور خوشبو لگانا اگر میسر ہو، ضروری ہے۔ عمرو بن سلیم نے کہا کہ غسل کے متعلق تو میں گواہی دیتا ہوں کہ وہ واجب ہے لیکن مسواک اور خوشبو کا علم اللہ تعالیٰ کو زیادہ ہے کہ وہ بھی واجب ہیں یا نہیں۔ لیکن حدیث میں اسی طرح ہے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے فرمایا کہ ابوبکر بن منکدر محمد بن منکدر کے بھائی تھے اور ان کا نام معلوم نہیں ( ابوبکر ان کی کنیت تھی ) بکیر بن اشج۔ سعید بن ابی ہلال اور بہت سے لوگ ان سے روایت کرتے ہیں۔ اور محمد بن منکدر ان کے بھائی کی کنیت ابوبکر اور ابوعبداللہ بھی تھی۔",
          "fr": "Rapporté par Abu Sa`id : Je témoigne que le Messager d’Allah (ﷺ) a dit : « Prendre un bain le vendredi est obligatoire pour tout homme musulman ayant atteint la puberté, ainsi que se nettoyer les dents avec le siwak, et utiliser du parfum si on en a. » `Amr (un sous-rappoteur) a dit : « Je confirme que le bain est obligatoire, mais pour le siwak et le parfum, Allah sait mieux si c’est obligatoire ou non, mais selon le hadith, c’est comme cela. »",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah bin Ja'far] berkata, telah menceritakan kepada kami [Harami bin 'Umarah] berkata, telah menceritakan kepadaku [Syu'bah] dari [Abu Bakar bin Al Munkadir] berkata, telah menceritakan kepadaku ['Amru bin Sulaim Al Anshari] berkata, \"Aku bersaksi atas [Abu Sa'id Al Khudri] ia berkata, \"Aku bersaksi atas Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Mandi pada hari Jum'at merupakan kewajiban bagi orang yang sudah bermimpi (baligh), dan agar bersiwak (menggosok gigi) dan memakai wewangian bila memilikinya.\" 'Amru berkata, \"Adapun mandi, aku bersaksi bahwa itu adalah wajib. Sedangkan bersiwak dan memakai wewangian -dan Allah yang lebih tahu- aku tidak tahu ia wajib atau tidak, tapi begitulah yang ada dalam hadits.\" Abu 'Abdullah -yaitu saudara Muhammad bin Al Munkadir, dan tidak disbeut dengan nama Abu Bakar- berkata, 'Hadits ini diriwayatkan darinya oleh [Bukair bin Al Asyaj] dan [Sa'id bin Abu Hilal] dan masih banyak lagi.' Dan Muhammad bin Al Munkadir punya nama panggilan Abu Bakar dan 'Abdullah",
          "tr": "Amr İbn Süleym'den nakledilmiştir: \"Şehadet ederim ki Ebu Saîd el-Hudrî (r.a.) şöyle dedi: Şehadet ederim ki Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Cum'a günü boy abdesti almak ergenlik çağına giren herkese vaciptir.. Dişleri misvaklamak ve eğer bulunabilirse güzel koku sürünmek gereklidir,\" Bu hadisin ravilerinden Amr İbn Süleym şöyle demiştir: \"Yeminle söylüyorum ki, boy abdesti almak vaciptir. Fakat dişleri misvaklamak ve güzel koku sürünmek konusunda kesin bir şey söyleyemem; vacip olup olmadığını Allah daha iyi bilir. Fakat hadîs-i şerîf böyle nakledilmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 5
      },
      "narrator": {
        "en": "Abu Sa`id"
      }
    },
    {
      "hadithNumber": 881,
      "arabicNumber": 881,
      "book": 11,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ، وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Any person who takes a bath on Friday like the bath of Janaba and then goes for the prayer (in the first hour i.e. early), it is as if he had sacrificed a camel (in Allah's cause); and whoever goes in the second hour it is as if he had sacrificed a cow; and whoever goes in the third hour, then it is as if he had sacrificed a horned ram; and if one goes in the fourth hour, then it is as if he had sacrificed a hen; and whoever goes in the fifth hour then it is as if he had offered an egg. When the Imam comes out (i.e. starts delivering the Khutba), the angels present themselves to listen to the Khutba",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا کہ ہمیں امام مالک نے ابوبکر بن عبدالرحمٰن کے غلام سمی سے خبر دی، جنہیں ابوصالح سمان نے، انہیں ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص جمعہ کے دن غسل جنابت کر کے نماز پڑھنے جائے تو گویا اس نے ایک اونٹ کی قربانی دی ( اگر اول وقت مسجد میں پہنچا ) اور اگر بعد میں گیا تو گویا ایک گائے کی قربانی دی اور جو تیسرے نمبر پر گیا تو گویا اس نے ایک سینگ والے مینڈھے کی قربانی دی۔ اور جو کوئی چوتھے نمبر پر گیا تو اس نے گویا ایک مرغی کی قربانی دی اور جو کوئی پانچویں نمبر پر گیا اس نے گویا انڈا اللہ کی راہ میں دیا۔ لیکن جب امام خطبہ کے لیے باہر آ جاتا ہے تو فرشتے خطبہ سننے میں مشغول ہو جاتے ہیں۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Celui qui prend un bain le vendredi comme pour la grande purification, puis va à la prière (dans la première heure, c’est-à-dire tôt), c’est comme s’il avait offert un chameau en sacrifice pour Allah ; celui qui y va dans la deuxième heure, c’est comme s’il avait sacrifié une vache ; dans la troisième heure, comme s’il avait sacrifié un bélier à cornes ; dans la quatrième heure, comme s’il avait sacrifié une poule ; et dans la cinquième heure, comme s’il avait offert un œuf. Quand l’imam arrive (c’est-à-dire commence le sermon), les anges se présentent pour écouter le sermon. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Sumayya] mantan budak Abu Bakar bin 'Abdurrahman, dari [Abu Shalih As Saman] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi pada hari Jum'at sebagaimana mandi janabah, lalu berangkat menuju Masjid, maka dia seolah berkurban seekor unta. Dan barangiapa datang pada kesempatan (saat) kedua maka dia seolah berkurban seekor sapi. Dan barangiapa datang pada kesempatan (saat) ketiga maka dia seolah berkurban seekor kambing yang bertanduk. Dan barangiapa datang pada kesempatan (saat) keempat maka dia seolah berkurban seekor ayam. Dan barangiapa datang pada kesempatan (saat) kelima maka dia seolah berkurban sebutir telur. Dan apabila imam sudah keluar (untuk memberi khuthbah), maka para Malaikat hadir mendengarkan dzikir (khuthbah tersebut)",
          "tr": "Ebu Hureyre (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Cum'a günü cünüp olduğu için boy abdesti alan ve (herkes'ten önce) namaz'a gelen kimseler sanki bir deveyi Allah yolunda tasadduk etmiş gibi sevap alırlar. Onlardan sonra gelenler bir sığırı, daha sonra gelenler boynuzlu bir koçu, ardından gelenler bir tavuğu ve en sona gelenler bir yumurtayı Allah yolunda tasadduk etmiş gibi sevap alırlar, İmam (hutbe için) çıktığında melekler okunan zikri dinlemek üzere oraya toplanırlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 6
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 882,
      "arabicNumber": 882,
      "book": 11,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ عُمَرَ ـ رضى الله عنه ـ بَيْنَمَا هُوَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ فَقَالَ عُمَرُ لِمَ تَحْتَبِسُونَ عَنِ الصَّلاَةِ فَقَالَ الرَّجُلُ مَا هُوَ إِلاَّ سَمِعْتُ النِّدَاءَ تَوَضَّأْتُ‏.‏ فَقَالَ أَلَمْ تَسْمَعُوا النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:While `Umar (bin Al-Khattab) was delivering the Khutba on a Friday, a man entered (the mosque). `Umar asked him, \"What has detained you from the prayer?\" The man said, \"It was only that when I heard the Adhan I performed ablution (for the prayer).\" On that `Umar said, \"Did you not hear the Prophet saying: 'Anyone of you going out for the Jumua prayer should take a bath'?",
          "ur": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر سے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے کہ عمر بن خطاب رضی اللہ عنہ جمعہ کے دن خطبہ دے رہے تھے کہ ایک بزرگ ( عثمان رضی اللہ عنہ ) داخل ہوئے۔ عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ آپ لوگ نماز کے لیے آنے میں کیوں دیر کرتے ہیں۔ ( اول وقت کیوں نہیں آتے ) آنے والے بزرگ نے فرمایا کہ دیر صرف اتنی ہوئی کہ اذان سنتے ہی میں نے وضو کیا ( اور پھر حاضر ہوا ) آپ نے فرمایا کہ کیا آپ لوگوں نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث نہیں سنی ہے کہ جب کوئی جمعہ کے لیے جائے تو غسل کر لینا چاہیے۔",
          "fr": "Rapporté par Abu Huraira : Pendant que `Umar (ibn Al-Khattab) prononçait le sermon un vendredi, un homme entra (dans la mosquée). `Umar lui demanda : « Qu’est-ce qui t’a retenu de la prière ? » L’homme répondit : « C’est seulement quand j’ai entendu l’Adhan que j’ai fait les ablutions pour la prière. » `Umar lui dit alors : « N’as-tu pas entendu le Prophète dire : “Celui d’entre vous qui sort pour la prière du vendredi doit prendre un bain” ? »",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Syaiban] dari [Yahya] -yaitu Ibnu Abu Katsir- dari [Abu Salamah] dari [Abu Hurairah] bahwa ['Umar] radliallahu 'anhu ketika berdiri memberikah khuthbah pada hari Jum'at, tiba-tiba ada seorang laki-laki masuk (Masjid). 'Umar lalu bertanya, \"Kenapa anda terlambat shalat?\" Laki-laki itu menjawab: \"Aku tidak tahu hingga aku mendengar adzan, maka aku pun hanya berwudlu.\" Maka \"Umar berkata, \"Bukankah kamu sudah mendengar bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'Jika salah seorang dari kalian berangkat shalat jum'at hendaklah mandi",
          "tr": "Ebu Hureyre'den nakledilmiştir: \"Bir Cum'a günü Ömer hutbe okurken mescid'e birisi girdi. Ömer (Radiyallahu Anh): Sizler niçin Cum'a namazına böyle geç kalırsınız? deyince adam şöyle bir cevap verdi: 'Ben ezanı duyar duymaz abdest aldım ve hemen namaz'a geldim. (Bu cevap Ömer'in pek hoşuna gitmedi) ve: \"Siz Resulullah Sallallahu Aleyhi ve Sellem'in: İçinizden birisi Cum'a namazına gelecek olursa boy abdesti alsın, diye buyurduğunu hiç duymadınız mı?\" dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 7
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 883,
      "arabicNumber": 883,
      "book": 11,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، قَالَ أَخْبَرَنِي أَبِي، عَنِ ابْنِ وَدِيعَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَغْتَسِلُ رَجُلٌ يَوْمَ الْجُمُعَةِ، وَيَتَطَهَّرُ مَا اسْتَطَاعَ مِنْ طُهْرٍ، وَيَدَّهِنُ مِنْ دُهْنِهِ، أَوْ يَمَسُّ مِنْ طِيبِ بَيْتِهِ ثُمَّ يَخْرُجُ، فَلاَ يُفَرِّقُ بَيْنَ اثْنَيْنِ، ثُمَّ يُصَلِّي مَا كُتِبَ لَهُ، ثُمَّ يُنْصِتُ إِذَا تَكَلَّمَ الإِمَامُ، إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Salman-Al-Farsi:The Prophet (ﷺ) said, \"Whoever takes a bath on Friday, purifies himself as much as he can, then uses his (hair) oil or perfumes himself with the scent of his house, then proceeds (for the Jumua prayer) and does not separate two persons sitting together (in the mosque), then prays as much as (Allah has) written for him and then remains silent while the Imam is delivering the Khutba, his sins in-between the present and the last Friday would be forgiven",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے ابن ابی ذئب نے سعید مقبری سے بیان کیا، کہا کہ مجھے میرے باپ ابوسعید مقبری نے عبداللہ بن ودیعہ سے خبر دی، ان سے سلمان فارسی رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص جمعہ کے دن غسل کرے اور خوب اچھی طرح سے پاکی حاصل کرے اور تیل استعمال کرے یا گھر میں جو خوشبو میسر ہو استعمال کرے پھر نماز جمعہ کے لیے نکلے اور مسجد میں پہنچ کر دو آدمیوں کے درمیان نہ گھسے، پھر جتنی ہو سکے نفل نماز پڑھے اور جب امام خطبہ شروع کرے تو خاموش سنتا رہے تو اس کے اس جمعہ سے لے کر دوسرے جمعہ تک سارے گناہ معاف کر دیئے جاتے ہیں۔",
          "fr": "Rapporté par Salman Al-Farsi : Le Prophète (ﷺ) a dit : « Celui qui prend un bain le vendredi, se purifie du mieux qu’il peut, puis utilise de l’huile pour ses cheveux ou se parfume avec le parfum de sa maison, puis se rend à la prière du vendredi sans séparer deux personnes assises ensemble (dans la mosquée), puis prie autant qu’Allah lui a permis, et reste silencieux pendant que l’imam prononce le sermon, ses péchés entre ce vendredi et le précédent seront pardonnés. »",
          "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] berkata, telah mengabarkan kepadaku [Bapakku] dari [Ibnu Wadi'ah] dari [Salman Al Farsi] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki mandi pada hari Jum'at lalu bersuci semaksimal mungkin, memakai wewangian miliknya atau minyak wangi keluarganya, lalu keluar rumah menuju Masjid, ia tidak memisahkan dua orang pada tempat duduknya lalu dia shalat yang dianjurkan baginya dan diam mendengarkan khutbah Imam, kecuali dia akan diampuni dosa-dosanya yang ada antara Jum'atnya itu dan Jum'at yang lainnya",
          "tr": "Selmân-ı Fârisî (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü boy abdesti alıp mümkün olduğu kadar vücudunu iyice temizlemeye çalışan, ardından saçlarını yağlayan veya evinde bulunan güzel kokudan vücuduna süren ve daha sonra evinden çıkıp mescid'e gelerek safları yarmadan kendisine takdir edilen namazı kılan ve imam'ın okuduğu hutbeyi hiç sesini çıkarmadan kimseyle konuşmadan can kulağı ile dinleyen herkesin bu Cum'a ile diğer Cuma arasındaki günahları bağışlanır. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 8
      },
      "narrator": {
        "en": "Salman-Al-Farsi"
      }
    },
    {
      "hadithNumber": 884,
      "arabicNumber": 884,
      "book": 11,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ طَاوُسٌ قُلْتُ لاِبْنِ عَبَّاسٍ ذَكَرُوا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ اغْتَسِلُوا يَوْمَ الْجُمُعَةِ وَاغْسِلُوا رُءُوسَكُمْ وَإِنْ لَمْ تَكُونُوا جُنُبًا، وَأَصِيبُوا مِنَ الطِّيبِ ‏\"‏‏.‏ قَالَ ابْنُ عَبَّاسٍ أَمَّا الْغُسْلُ فَنَعَمْ، وَأَمَّا الطِّيبُ فَلاَ أَدْرِي‏.‏",
        "translations": {
          "en": "Narrated Tawus:I said to Ibn `Abbas, \"The people are narrating that the Prophet (ﷺ) said, 'Take a bath on Friday and wash your heads (i.e. take a thorough bath) even though you were not Junub and use perfume'.\" On that Ibn `Abbas replied, \"I know about the bath, (i.e. it is essential) but I do not know about the perfume (i.e. whether it is essential or not)",
          "ur": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی کہ طاؤس بن کیسان نے بیان کیا کہ میں نے عبداللہ بن عباس رضی اللہ عنہما سے پوچھا کہ لوگ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ جمعہ کے دن اگرچہ جنابت نہ ہو لیکن غسل کرو اور اپنے سر دھویا کرو اور خوشبو لگایا کرو۔ ابن عباس رضی اللہ عنہما نے کہا کہ غسل کا حکم تو ٹھیک ہے لیکن خوشبو کے متعلق مجھے علم نہیں۔",
          "fr": "Rapporté par Tawus : J’ai dit à Ibn `Abbas : « Les gens rapportent que le Prophète (ﷺ) a dit : “Prenez un bain le vendredi et lavez-vous bien la tête (c’est-à-dire prenez un bain complet) même si vous n’êtes pas en état d’impureté majeure, et utilisez du parfum.” » Ibn `Abbas répondit : « Je sais que le bain est essentiel, mais je ne sais pas si le parfum l’est aussi. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri], [Thawus] berkata, Aku berkata kepada [Ibnu 'Abbas], \"Orang-orang menyebutkan bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Mandilah pada hari Jum'at dan basuhlah kepala kalian sekalipun tidak sedang junub, dan pakailah wewangian.\" Ibnu 'Abbas berkata, \"Adapun mandi, memang benar bahwa itu adalah wajib, sedangkan memakai wewangian aku tidak tahu",
          "tr": "Bir defasında Tavus Abdullah İbn Abbâs'a: \"Bazıları Resûlullah Sallallahu Aleyhi ve Sellem'in Cum'a günleri cünüp olmasanız bile boy abdesti alın ve başlarınızı yıkayın. Ayrıca vücudunuza güzel koku da sürün, diye buyurduğunu söylüyorlar. Bu rivayet doğru mudur?\" diye sormuş ve ondan şu cevabı almıştır: \"Boy abdesti konusunda Resûlullah Sallallahu Aleyhi ve Sellem gerçekten de böyle bu­yurmuştur, fakat güzel kokuyla ilgili olarak bir şey söylediğini bilmiyorum"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 9
      },
      "narrator": {
        "en": "Tawus"
      }
    },
    {
      "hadithNumber": 885,
      "arabicNumber": 885,
      "book": 11,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ ذَكَرَ قَوْلَ النَّبِيِّ صلى الله عليه وسلم فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ فَقُلْتُ لاِبْنِ عَبَّاسٍ أَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ فَقَالَ لاَ أَعْلَمُهُ‏.‏",
        "translations": {
          "en": "Narrated Tawus:Ibn `Abbas mentioned the statement of the Prophet (ﷺ) regarding the taking of a bath on Friday and then I asked him whether the Prophet (ﷺ) had ordered perfume or (hair) oil to be used if they could be found in one's house. He (Ibn `Abbas) replied that he did not know about it",
          "ur": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، انہوں نے کہا کہ ہمیں ہشام بن یوسف نے خبر دی، کہ انہیں ابن جریج نے خبر دی انہوں نے کہا کہ مجھے ابراہیم بن میسرہ نے طاؤس سے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے، آپ نے جمعہ کے دن غسل کے بارے میں نبی کریم صلی اللہ علیہ وسلم کی حدیث کا ذکر کیا تو میں نے کہا کہ کیا تیل اور خوشبو کا استعمال بھی ضروری ہے؟ آپ نے فرمایا کہ مجھے معلوم نہیں۔",
          "fr": "Rapporté par Tawus : Ibn `Abbas a mentionné la parole du Prophète (ﷺ) concernant le bain du vendredi, puis je lui ai demandé si le Prophète (ﷺ) avait ordonné d’utiliser du parfum ou de l’huile pour les cheveux si on en avait chez soi. Il (Ibn `Abbas) répondit qu’il n’en savait rien",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] berkata, telah mengabarkan kepada kami [Hisyam] bahwa [Ibnu Juraij] telah mengabarkan kepada mereka, ia katakan; telah mengabarkan kepadaku [Ibrahim bin Maisarah] dari [Thawus] dari [Ibnu 'Abbas] radliallahu 'anhuma, bahwa dia menyebutkan sabda Nabi shallallahu 'alaihi wasallam perihal mandi pada hari Jum'at. Maka aku pun bertanya kepada Ibnu 'Abbas, 'Apakah beliau memakai wewangian ketika berada bersama keluarga Beliau? ' ia menjawab, 'Aku tidak tahu",
          "tr": "Tavus'tan nakledilmiştir: \"İbn Abbâs (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in Cum'a günü boy abdesti alınmasıyla ilgili sözünü zikredince kendisine; 'Peki o gün eğer varsa eşine ait güzel koku veya yağı sürünmesi gerekir mi?' diye sordum. Buna şöyle cevap verdi: \"Bu konuyu bilmiyorum"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 10
      },
      "narrator": {
        "en": "Tawus"
      }
    },
    {
      "hadithNumber": 886,
      "arabicNumber": 886,
      "book": 11,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَأَى حُلَّةَ سِيَرَاءَ عِنْدَ باب الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ، لَوِ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ ثُمَّ جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْهَا حُلَلٌ، فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ، كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏‏.‏ فَكَسَاهَا عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ أَخًا لَهُ بِمَكَّةَ مُشْرِكًا‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:`Umar bin Al-Khattab saw a silken cloak (being sold) at the gate of the Mosque and said to Allah's Apostle, \"I wish you would buy this to wear on Fridays and also on occasions of the arrivals of the delegations.\" Allah's Messenger (ﷺ) replied, \"This will be worn by a person who will have no share (reward) in the Hereafter.\" Later on similar cloaks were given to Allah's Messenger (ﷺ) and he gave one of them to `Umar bin Al-Khattab. On that `Umar said, \"O Allah's Messenger (ﷺ)! You have given me this cloak although on the cloak of Atarid (a cloak merchant who was selling that silken cloak at the gate of the mosque) you passed such and such a remark.\" Allah's Messenger (ﷺ) replied, \"I have not given you this to wear\". And so `Umar bin Al-Khattab gave it to his pagan brother in Mecca to wear",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ عمر بن خطاب رضی اللہ عنہ نے ( ریشم کا ) دھاری دار جوڑا مسجد نبوی کے دروازے پر بکتا دیکھا تو کہنے لگے یا رسول اللہ! بہتر ہو اگر آپ اسے خرید لیں اور جمعہ کے دن اور وفود جب آپ صلی اللہ علیہ وسلم کے پاس آئیں تو ان کی ملاقات کے لیے آپ اسے پہنا کریں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے تو وہی پہن سکتا ہے جس کا آخرت میں کوئی حصہ نہ ہو۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس اسی طرح کے کچھ جوڑے آئے تو اس میں سے ایک جوڑا آپ نے عمر بن خطاب رضی اللہ عنہ کو عطا فرمایا۔ انہوں نے عرض کیا: یا رسول اللہ! آپ مجھے یہ جوڑا پہنا رہے ہیں حالانکہ اس سے پہلے عطارد کے جوڑے کے بارے میں آپ نے کچھ ایسا فرمایا تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں خود پہننے کے لیے نہیں دیا ہے، چنانچہ عمر رضی اللہ عنہ نے اسے اپنے ایک مشرک بھائی کو پہنا دیا جو مکے میں رہتا تھا۔",
          "fr": "Rapporté par `Abdullah bin `Umar : `Umar ibn Al-Khattab vit un manteau de soie (en vente) à la porte de la mosquée et dit au Messager d’Allah : « J’aimerais que tu achètes ceci pour le porter le vendredi et aussi lors de l’arrivée des délégations. » Le Messager d’Allah (ﷺ) répondit : « Cela sera porté par quelqu’un qui n’aura aucune part (de récompense) dans l’au-delà. » Plus tard, des manteaux similaires furent donnés au Messager d’Allah (ﷺ) et il en donna un à `Umar ibn Al-Khattab. `Umar dit alors : « Ô Messager d’Allah (ﷺ) ! Tu m’as donné ce manteau alors que tu avais fait telle remarque à propos du manteau d’Atarid (un marchand qui vendait ce manteau de soie à la porte de la mosquée). » Le Messager d’Allah (ﷺ) répondit : « Je ne t’ai pas donné ceci pour que tu le portes. » Alors `Umar ibn Al-Khattab l’a donné à son frère polythéiste à La Mecque pour qu’il le porte",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar], bahwa 'Umar bin Al Khaththab melihat pakaian sutera di depan pintu masjid, maka ia pun berkata, \"Wahai Rasulullah, seandainya tuan beli pakaian ini lalu tuan kenakan pada hari Jum'at atau saat menyambut utusan (delegasi) bila datang menghadap tuan.\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Sesungguhnya orang yang memakai pakaian seperti ini tidak akan mendapat bagian di akhirat.\" Kemudian datang hadiah untuk Rasulullah shallallahu 'alaihi wasallam yang diantaranya ada pakain sutera. Beliau lalu memberikan pakaian sutera tersebut kepada 'Umar bin Al Khaththab? radliallahu 'anhu, maka berkatalah 'Umar, \"Wahai Rasulullah, tuan telah memberikan pakaian ini untukku, padahal tuan telah menjelaskan konsekwensi orang yang memakainya!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku memberikannya kepadamu bukan untuk kamu pakai.\" Maka 'Umar bin Al Khaththab memberikan pakaian sutera tersebut kepada saudaranya yang musyrik di kota Makkah",
          "tr": "Abdullah İbn Ömer (Radiyallahu Anh)'den nakledilmiştir: \"Bir gün Ömer (Radiyallahu Anh) mescid'in kapısında (Utârid İbn Hâcib tarafından) satılığa çıkarılmış ipek bir elbise gördü ve Resûlullah Sallallahu Aleyhi ve Sellem'e: Ey Allah'ın Resulü keşke şu ipek elbiseyi satın alsanız ve Cum'a günleri ile heyetleri kabul ettiğiniz günlerde giyseniz!\" dedi. Bunun üzerine Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bu elbiseyi ancak âhirette bundan hiçbir nasibi olmayan kimseler giyer.\" Daha sonraki günlerde Resûlullah Sallallahu Aleyhi ve Sellem'e ipek elbiseler getirildi ve Resûlullah Sallallahu Aleyhi ve Sellem bunlardan birini Ömer'e verdi. Hz. Ömer: \"Ey Allah'ın Resulü, Utarid'in sattığı ipek hakkında o sözü sarf etmiştiniz ama bana giymem için bu ipeği veriyorsunuz\" deyince Nebi Sallallahu Aleyhi ve Sellem şöyle bu­yurdu: \"Ben bu ipeği sana giyesin diye vermiyorum ki... Bunun üzerine Ömer, elbiseyi Mekke'de bulunan ve henüz Müslüman olmayan müşrik bir kardeşine hediye etti. Tekrar: 948, 2104, 2612, 2619, 3054, 5841, 5981 ve 6081 Diğer Tahric: Müslim libas; Ebû Dâvûd. Salat, Libas; Nesaî, iydeyn, zîne; Ahmed b. Hanbel I 46-49, II 20. 24, 39, 49 51, 68, 289, 329,337,111. 103. 114. 127., 146 V45, VI 288. dede var"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 11
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 887,
      "arabicNumber": 887,
      "book": 11,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي ـ أَوْ عَلَى النَّاسِ ـ لأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلاَةٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"If I had not found it hard for my followers or the people, I would have ordered them to clean their teeth with Siwak for every prayer",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابوالزناد سے خبر دی، ان سے اعرج نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے اپنی امت یا لوگوں کی تکلیف کا خیال نہ ہوتا تو میں ہر نماز کے لیے ان کو مسواک کا حکم دے دیتا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Si cela n’avait pas été difficile pour mes fidèles ou pour les gens, je leur aurais ordonné de se nettoyer les dents avec le siwak avant chaque prière. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya tidak memberatkan ummatku atau manusia, niscaya aku akan perintahkan kepada mereka untuk bersiwak (menggosok gigi) pada setiap kali hendak shalat",
          "tr": "Ebu Hureyre (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Ümmetime veya insanlara sıkıntı verme endişesi taşımasaydım onlara her namaz öncesinde dişlerini misvakla temizlemelerini emrederdim. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 12
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 888,
      "arabicNumber": 888,
      "book": 11,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ، حَدَّثَنَا أَنَسٌ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَكْثَرْتُ عَلَيْكُمْ فِي السِّوَاكِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas:Allah's Messenger (ﷺ) said, \"I have told you repeatedly to use the Siwak. (The Prophet (ﷺ) put emphasis on the use of the Siwak",
          "ur": "ہم سے ابومعمر عبداللہ نے بیان کیا، کہا کہ ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے شعیب بن حبحاب نے بیان کیا، کہا کہ ہم سے انس رضی اللہ عنہ نے بیان کیا، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں تم سے مسواک کے بارے میں بہت کچھ کہہ چکا ہوں۔",
          "fr": "Rapporté par Anas : Le Messager d’Allah (ﷺ) a dit : « Je vous ai répété à plusieurs reprises d’utiliser le siwak. » (Le Prophète (ﷺ) insistait sur l’utilisation du siwak",
          "id": "Telah menceritakan kepada kami [Abu Ma'mar] berkata, telah menceritakan kepada kami ['Abdul Warits] berkata, telah menceritakan kepada kami [Syu'aib bn Al Habhab] telah menceritakan kepada kami [Anas] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku telah terlalu sering memperingatkan kalian untuk selalu bersiwak",
          "tr": "Enes İbn Mâlik (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Misvak kullanmanız gerektiğini size o kadar çok söyledim ki"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 13
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 889,
      "arabicNumber": 889,
      "book": 11,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَحُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ‏.‏",
        "translations": {
          "en": "Narrated Hudhaifa:When the Prophet (ﷺ) got up at night (for the night prayer), he used to clean his mouth",
          "ur": "ہم سے محمد بن کثیر نے بیان کیا، کہ ہمیں سفیان ثوری نے منصور بن معمر اور حصین بن عبدالرحمٰن سے خبر دی، انہیں ابووائل نے، انہیں حذیفہ بن یمان رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم جب رات کو اٹھتے تو منہ کو مسواک سے خوب صاف کرتے۔",
          "fr": "Rapporté par Hudhaifa : Quand le Prophète (ﷺ) se levait la nuit (pour la prière nocturne), il avait l’habitude de se nettoyer la bouche",
          "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Sufyan] dari [Manshur] dan [Hushain] dari [Abu Wa'il] dari [Hudzifah] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam bangun untuk shalat malam, beliau menggosok mulutnya",
          "tr": "Huzeyfe şöyle demiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem geceleri namaza kalktığında ağzını misvak ile temizlerdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 14
      },
      "narrator": {
        "en": "Hudhaifa"
      }
    },
    {
      "hadithNumber": 890,
      "arabicNumber": 890,
      "book": 11,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ، وَمَعَهُ سِوَاكٌ يَسْتَنُّ بِهِ، فَنَظَرَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ أَعْطِنِي هَذَا السِّوَاكَ يَا عَبْدَ الرَّحْمَنِ‏.‏ فَأَعْطَانِيهِ فَقَصَمْتُهُ ثُمَّ مَضَغْتُهُ، فَأَعْطَيْتُهُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَنَّ بِهِ وَهْوَ مُسْتَسْنِدٌ إِلَى صَدْرِي‏.‏",
        "translations": {
          "en": "Narrated `Aisha:`Abdur-Rahman bin Abi Bakr came holding a Siwak with which he was cleaning his teeth. Allah's Apostle looked at him. I requested `Abdur-Rahman to give the Siwak to me and after he gave it to me I divided it, chewed it and gave it to Allah's Messenger (ﷺ). Then he cleaned his teeth with it and (at that time) he was resting against my chest",
          "ur": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ ہم سے سلیمان بن ہلال نے بیان کیا کہ ہشام بن عروہ نے کہا کہ مجھے میرے باپ عروہ بن زبیر نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے خبر دی، انہوں نے کہا کہ عبدالرحمٰن بن ابی بکر ( ایک مرتبہ ) آئے۔ ان کے ہاتھ میں مسواک تھی جسے وہ استعمال کیا کرتے تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے بیماری کی حالت میں ان سے کہا عبدالرحمٰن یہ مسواک مجھے دیدے۔ انہوں نے دے دی۔ میں نے اس کے سرے کو پہلے توڑا یعنی اتنی لکڑی نکال دی جو عبدالرحمٰن اپنے منہ سے لگایا کرتے تھے، پھر اسے چبا کر رسول اللہ صلی اللہ علیہ وسلم کو دے دیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس سے دانت صاف کئے اور آپ صلی اللہ علیہ وسلم اس وقت میرے سینے پر ٹیک لگائے ہوئے تھے۔",
          "fr": "Rapporté par `Aisha : `Abdur-Rahman ibn Abi Bakr est venu en tenant un siwak avec lequel il se nettoyait les dents. Le Messager d’Allah le regarda. J’ai demandé à `Abdur-Rahman de me donner le siwak et, après qu’il me l’a donné, je l’ai coupé, mâché, puis je l’ai donné au Messager d’Allah (ﷺ). Il s’est alors nettoyé les dents avec, tout en étant appuyé contre ma poitrine",
          "id": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada saya [Sulaiman bin Bilal] berkata, [Hisyam bin 'Urwah] berkata, telah mengabarkan kepadaku [Bapakku] dari ['Aisyah] radliallahu 'anha, ia berkata, \"'Abdurrahman bin Abu Bakar datang dengan membawa siwak yang dia gunakan untuk membersihkan giginya, Rasulullah shallallahu 'alaihi wasallam lalu memandang ke arahnya. Maka aku pun berkata kepadanya, \"Wahai 'Abdurrahman, berikanlah siwak itu kepadaku.\" 'Abdurrahman kemudian memberikannya kepadaku, kemudian aku pecahkan dengan gigiku dan mengunyahnya (hingga lembut). Setelah itu siwak tersebut aku berikan kepada Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah menggosok giginya dengan menyandar pada dadaku",
          "tr": "Aişe (Radiyallahu Anha)'dan rivayet edilmiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem hasta iken Abdurrahmân İbn Ebi Bekir zi­arete gelmişti, içeriye giren Abdurrahmân'in elinde dişlerini temizlediği bir misvak vardı. Resûlullah Sallallahu Aleyhi ve Sellem onun elindeki misvak'a bakakaldı. Ben bunu fark edince Abdurrahman'dan misvağı bana vermesini istedim. Abdurrahman'dan aldığım misvağı kırıp ucunu dişlerimle ezerek yumuşattıktan sonra Resûlullah Sallallahu Aleyhi ve Sellem'e verdim. Resûl-i Ekrem (Sallallahu aleyhi ve Sellem) de göğsüme yaslanmış iken dişlerini bu misvakla temizlemeye koyuldu. Tekrar: 1389, 3100, 3774, 4438, 4449, 4450, 4451, 5217 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 15
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 891,
      "arabicNumber": 891,
      "book": 11,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ ـ هُوَ ابْنُ هُرْمُزَ ـ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الْجُمُعَةِ فِي صَلاَةِ الْفَجْرِ ‏{‏الم * تَنْزِيلُ‏}‏ السَّجْدَةَ وَ‏{‏هَلْ أَتَى عَلَى الإِنْسَانِ‏}‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) used to recite the following in the Fajr prayer of Friday, \"Alif, Lam, Mim, Tanzil\" (Suratas- Sajda #32) and \"Hal-ata-ala-l-Insani\" (i.e. Surah-Ad-Dahr)",
          "ur": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا کہ ہم سے سفیان ثوری نے سعد بن ابراہیم کے واسطے سے بیان کیا، ان سے عبدالرحمٰن بن ہرمز نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم تنزيل‏» اور «هل أتى على الإنسان‏» پڑھا کرتے تھے۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) récitait les sourates suivantes lors de la prière du Fajr du vendredi : « Alif, Lam, Mim, Tanzil » (Sourate As-Sajda, n°32) et « Hal ata ‘ala-l-Insani » (c’est-à-dire Sourate Ad-Dahr)",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Sufyan] dari [Sa'd bin Ibrahim] dari ['Abdurrahman] -yaitu Ibnu Hurmuz Al A'raj dari [Abu Hurairah] radliallahu 'anhu berkata, \"Nabi shallallahu 'alaihi wasallam dalam shalat Fajar membaca: \"ALIF LAAM MIIM TANZIIL (Surah As Sajadah), dan 'HAL ATAA 'ALAL INSAANI HIINUM MINAD DAHRI (Surah Al Insaan)",
          "tr": "Ebu Hureyre r.a. dediki: Resulullah (Sallallahu aleyhi ve Sellem) (Efendimiz) cum`a günü sabah namaz(ının ilk rek`at) ında آلم تنزيل (Secde) (ikinci rek`atinde de) هل أتى على الإنسان (insan suresini) okurlardı. Diğer tahric: Tirmizi kitabu’l-Cum’a"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 16
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 892,
      "arabicNumber": 892,
      "book": 11,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ إِنَّ أَوَّلَ جُمُعَةٍ جُمِّعَتْ بَعْدَ جُمُعَةٍ فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَسْجِدِ عَبْدِ الْقَيْسِ بِجُوَاثَى مِنَ الْبَحْرَيْنِ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The first Jumua prayer which was offered after a Jumua prayer offered at the mosque of Allah's Apostle took place in the mosque of the tribe of `Abdul Qais at Jawathi in Bahrain",
          "ur": "ہم سے محمد بن مثنی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوعامر عقدی نے بیان کیا، انہوں نے کہا کہ ہم سے ابراہیم بن طہمان نے بیان کیا، ان سے ابوجمرہ نضر بن عبدالرحمٰن ضبعی نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے، آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کی مسجد کے بعد سب سے پہلا جمعہ بنو عبدالقیس کی مسجد میں ہوا جو بحرین کے ملک جواثی میں تھی۔",
          "fr": "Rapporté par Ibn `Abbas : La première prière du vendredi qui a été accomplie après celle faite à la mosquée du Messager d’Allah a eu lieu dans la mosquée de la tribu de `Abdul Qais à Jawathi, au Bahreïn",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] berkata, telah menceritakan kepada kami [Abu 'Amir Al 'Aqadi] berkata, telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Abu Jamrah Adl Dluba'i] dari [Ibnu 'Abbas] bahwa dia berkata, \"Sesungguhnya (shalat) Jum'at yang pertama kali dilaksanakan setelah (shalat) Jum'at) di Masjid Rasulullah shallallahu 'alaihi wasallam adalah di Masjid 'Abdul Qais di kampung Juwatsa, negeri Bahrain",
          "tr": "İbn Abbâs (Radiyallahu anh)'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem'in mescidinden sonra Cum'a namazı ilk olarak Bahreyn'in Cuvâsâ köyündeki Abdü'l-kays mescidinde kılınmıştır. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 17
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 893,
      "arabicNumber": 893,
      "book": 11,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ ‏\"‏‏.‏ وَزَادَ اللَّيْثُ قَالَ يُونُسُ كَتَبَ رُزَيْقُ بْنُ حُكَيْمٍ إِلَى ابْنِ شِهَابٍ ـ وَأَنَا مَعَهُ يَوْمَئِذٍ بِوَادِي الْقُرَى ـ هَلْ تَرَى أَنْ أُجَمِّعَ‏.‏ وَرُزَيْقٌ عَامِلٌ عَلَى أَرْضٍ يَعْمَلُهَا، وَفِيهَا جَمَاعَةٌ مِنَ السُّودَانِ وَغَيْرِهِمْ، وَرُزَيْقٌ يَوْمَئِذٍ عَلَى أَيْلَةَ، فَكَتَبَ ابْنُ شِهَابٍ ـ وَأَنَا أَسْمَعُ ـ يَأْمُرُهُ أَنْ يُجَمِّعَ، يُخْبِرُهُ أَنَّ سَالِمًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، الإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ رَاعِيَةٌ فِي بَيْتِ زَوْجِهَا وَمَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ رَاعٍ فِي مَالِ سَيِّدِهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ـ قَالَ وَحَسِبْتُ أَنْ قَدْ قَالَ ـ وَالرَّجُلُ رَاعٍ فِي مَالِ أَبِيهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ وَكُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:I heard Allah's Messenger (ﷺ) saying, \"All of you are Guardians.\" Yunus said: Ruzaiq bin Hukaim wrote to Ibn Shihab while I was with him at Wadi-al-Qura saying, \"Shall I lead the Jumua prayer?\" Ruzaiq was working on the land (i.e. farming) and there was a group of Sudanese people and some others with him; Ruzaiq was then the Governor of Aila. Ibn Shihab wrote (to Ruzaiq) ordering him to lead the Jumua prayer and telling him that Salim told him that `Abdullah bin `Umar had said, \"I heard Allah's Apostle saying, 'All of you are guardians and responsible for your wards and the things under your care. The Imam (i.e. ruler) is the guardian of his subjects and is responsible for them and a man is the guardian of his family and is responsible for them. A woman is the guardian of her husband's house and is responsible for it. A servant is the guardian of his master's belongings and is responsible for them.' I thought that he also said, 'A man is the guardian of his father's property and is responsible for it. All of you are guardians and responsible for your wards and the things under your care",
          "ur": "ہم سے بشر بن محمد مروزی نے بیان کیا، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں یونس بن یزید نے زہری سے خبر دی، انہیں سالم بن عبداللہ نے ابن عمر سے خبر دی، انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا کہ تم میں سے ہر شخص نگہبان ہے اور لیث نے اس میں یہ زیادتی کی کہ یونس نے بیان کیا کہ رزیق بن حکیم نے ابن شہاب کو لکھا، ان دنوں میں بھی وادی القریٰ میں ابن شہاب کے پاس ہی تھا کہ کیا میں جمعہ پڑھا سکتا ہوں۔ رزیق ( ایلہ کے اطراف میں ) ایک زمین کاشت کروا رہے تھے۔ وہاں حبشہ وغیرہ کے کچھ لوگ موجود تھے۔ اس زمانہ میں رزیق ایلہ میں ( عمر بن عبدالعزیز کی طرف سے ) حاکم تھے۔ ابن شہاب رحمہ اللہ نے انہیں لکھوایا، میں وہیں سن رہا تھا کہ رزیق جمعہ پڑھائیں۔ ابن شہاب رزیق کو یہ خبر دے رہے تھے کہ سالم نے ان سے حدیث بیان کی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ آپ نے فرمایا کہ تم میں سے ہر ایک نگراں ہے اور اس کے ماتحتوں کے متعلق اس سے سوال ہو گا۔ امام نگراں ہے اور اس سے سوال اس کی رعایا کے بارے میں ہو گا۔ انسان اپنے گھر کا نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ عورت اپنے شوہر کے گھر کی نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ خادم اپنے آقا کے مال کا نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا۔ ابن عمر رضی اللہ عنہما نے فرمایا کہ میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ انسان اپنے باپ کے مال کا نگراں ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا اور تم میں سے ہر شخص نگراں ہے اور سب سے اس کی رعیت کے بارے میں سوال ہو گا۔",
          "fr": "Rapporté par Ibn `Umar : J’ai entendu le Messager d’Allah (ﷺ) dire : « Vous êtes tous des responsables. » Yunis a dit : Ruzaiq bin Hukaim a écrit à Ibn Shihab alors que j’étais avec lui à Wadi-al-Qura pour demander : « Puis-je diriger la prière du vendredi ? » Ruzaiq travaillait la terre (c’est-à-dire qu’il était agriculteur) et il y avait avec lui un groupe de Soudanais et d’autres personnes ; Ruzaiq était alors gouverneur d’Aila. Ibn Shihab lui écrivit pour lui ordonner de diriger la prière du vendredi et lui dire que Salim lui avait rapporté qu’`Abdullah bin `Umar avait dit : « J’ai entendu le Messager d’Allah dire : “Vous êtes tous des responsables et vous serez interrogés sur ceux qui sont sous votre responsabilité. L’imam (c’est-à-dire le dirigeant) est responsable de ses sujets et il sera interrogé sur eux, et l’homme est responsable de sa famille et il sera interrogé sur elle. La femme est responsable de la maison de son mari et elle sera interrogée sur cela. Le serviteur est responsable des biens de son maître et il sera interrogé sur eux.” Je crois qu’il a aussi dit : “L’homme est responsable des biens de son père et il sera interrogé sur cela. Vous êtes tous des responsables et vous serez interrogés sur ceux qui sont sous votre responsabilité.” »",
          "id": "Telah menceritakan kepada kami [Bisyr bin Muhammad Al Marwazi] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] berkata, telah mengabarkan kepada kami [Salim bin 'Abdullah] dari [Ibnu 'Umar] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap kalian adalah pemimpin.\" [Al Laits] menambahkan; [Yunus] berkata; Ruzaiq bin Hukaim menulis surat kepada [Ibnu Syihab], dan pada saat itu aku bersamanya di Wadi Qura (pinggiran kota), \"Apa pendapatmu jika aku mengumpulkan orang untuk shalat Jum'at?\" -Saat itu Ruzaiq bertugas di suatu tempat dimana banyak jama'ah dari negeri Sudan dan yang lainnya, yaitu di negeri Ailah-. Maka Ibnu Syihab membalasnya dan aku mendengar dia memerintahkan (Ruzaiq) untuk mendirikan shalat Jum'at. Lalu mengabarkan bahwa [Salim] telah menceritakan kepadanya, bahwa ['Abdullah bin 'Umar] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap kalian adalah pemimpin, dan setiap pemimpin akan dimintai pertanggung jawaban atas yang dipimpinnya. Imam adalah pemimpin yang akan diminta pertanggung jawaban atas rakyatnya. Seorang suami adalah pemimpin dan akan dimintai pertanggung jawaban atas keluarganya. Seorang isteri adalah pemimpin di dalam urusan rumah tangga suaminya, dan akan dimintai pertanggung jawaban atas urusan rumah tangga tersebut. Seorang pembantu adalah pemimpin dalam urusan harta tuannya, dan akan dimintai pertanggung jawaban atas urusan tanggung jawabnya tersebut.\" Aku menduga Ibnu 'Umar menyebutkan: \"Dan seorang laki-laki adalah pemimpin atas harta bapaknya, dan akan dimintai pertanggung jawaban atasnya. Setiap kalian adalah pemimpin dan setiap pemimpin akan dimintai pertanggung jawaban atas yang dipimpinnya",
          "tr": "İbn Ömer (r.a.)'den nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem Hepiniz çobansınız, buyurdu.\" Leys İbn Sa'd şöyle bir ek bilgi vermiştir: \"Yûnus İbn Yezîd şöyle dedi: Rüzeyk İbnü'I-Hukeym İbn Şihâb'a - ki o sırada ben de onunla birlikte idim - bir mektup yazarak, Cum'a namazını işi dolayısıyla bulunduğu Vadi'l kura'da kıldırmasının caiz olup olmadığını sormuştu. Rüzeyk orada arazilerin ekip biçilmesi için görevlendirilmişti ve maiyetindekilerle birlikte çalışıyordu. Rüzeyk o günlerde Eyle'de (Kızıl Denizin kuzeyinde bir köy) görevli bir memurdu. İbn Şihâb cevabî mektubu yazarken ben yine oradaydım ve yazdıklarını duydum. Mektupta İbn Şihâb, Rüzeyk'e Cum'a namazını kıldırmasını emrediyordu. Hatta delil olarak şu rivayeti zikretmişti: \"Salim bana Abdullah İbn Ömer'in şöyle dediğini haber verdi: Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: Hepiniz yükümlülükleri olan birer çobansınız. Her biriniz himayeniz altında bulunan ve bakmakla yükümlü olduğunuz kişilerden ve işlerden sorumlusunuz; Devlet başkanı yönetici bir çobandır ve tebasmdan sorumludur, erkekler birer çobandır ve eşlerinden sorumlu­dur, kadınlar birer çobandır ve ailesindekilerden sorumludur, hizmetçiler efendilerinin mallarını korumakla yükümlü birer çobandır ve korumakla yükümlü oldukları mallardan sorumludur.\" Hadisin ravilerinden Salim İbn Abdullah şöyle demiştir: \"Sanırım Resûlullah Sallallahu Aleyhi ve Sellem şunları da söyledi: \"Kişi babasının malını koruyup gözetmekle yükümlüdür ve bunlardan sorumludur. Hepiniz yükümlülükleri olan birer ço­bansınız ve bakmakla yükümlü olduğunuz kişilerden ve işlerden sorumlusunuz. Tekrar: 2409, 2554, 2558, 2751, 5188, 5200 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 18
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 894,
      "arabicNumber": 894,
      "book": 11,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ جَاءَ مِنْكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:I heard Allah's Messenger (ﷺ) saying, \"Anyone of you coming for the Jumua prayer should take a bath",
          "ur": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھ سے سالم بن عبداللہ نے بیان کیا، انہوں نے (اپنے والد) عبداللہ بن عمر رضی اللہ عنہما سے سنا وہ فرماتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ تم میں سے جو شخص جمعہ پڑھنے آئے تو غسل کرے۔",
          "fr": "Rapporté par `Abdullah bin `Umar : J’ai entendu le Messager d’Allah (ﷺ) dire : « Celui d’entre vous qui vient pour la prière du vendredi doit prendre un bain. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah menceritakan kepadaku [Salim bin 'Abdullah] bahwa dia mendengar ['Abdullah bin 'Umar] radliallahu 'anhuma berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa di antara kalian yang mendatangi shalat Jum'at, maka hendaklah dia mandi?",
          "tr": "Abdullah İbn Ömer (r.a.) dedi ki: Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"içinizden her kim Cum'a namazına gelirse boy abdesti alsın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 19
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 895,
      "arabicNumber": 895,
      "book": 11,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id Al-Khudri:Allah's Messenger (ﷺ) said, \"The taking of a bath on Friday is compulsory for every Muslim who has attained the age of puberty",
          "ur": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے صفوان بن سلیم نے، ان سے عطاء بن یسار نے، ان سے ابو سعید خدری رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہر بالغ کے اوپر جمعہ کے دن غسل واجب ہے۔",
          "fr": "Rapporté par Abu Sa`id Al-Khudri : Le Messager d’Allah (ﷺ) a dit : « Prendre un bain le vendredi est obligatoire pour tout musulman ayant atteint la puberté. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Shafwan bin Sulaim] dari ['Atha' bin Yaar] dari [Abu Sa'id Al Khudri], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi setiap orang yang sudah baligh",
          "tr": "Ebu Saîd el-Hudrî (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü boy abdesti (ğusül) almak ihtilam olan herkese vaciptir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 20
      },
      "narrator": {
        "en": "Abu Sa`id Al-Khudri"
      }
    },
    {
      "hadithNumber": 897,
      "arabicNumber": 897,
      "book": 11,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ، أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا، وَأُوتِينَاهُ مِنْ بَعْدِهِمْ، فَهَذَا الْيَوْمُ الَّذِي اخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ، فَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى ‏\"‏‏.‏ فَسَكَتَ‏.‏ ثُمَّ قَالَ ‏\"‏ حَقٌّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا يَغْسِلُ فِيهِ رَأْسَهُ وَجَسَدَهُ ‏\"‏‏.‏\tثُمَّ قَالَ ‏\"‏ حَقٌّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا يَغْسِلُ فِيهِ رَأْسَهُ وَجَسَدَهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said \"We are the last (to come amongst the nations) but (will be) the foremost on the Day of Resurrection. They were given the Holy Scripture before us and we were given the Quran after them. And this was the day (Friday) about which they differed and Allah gave us the guidance (for that). So tomorrow (i.e. Saturday) is the Jews' (day), and the day after tomorrow (i.e. Sunday) is the Christians'.\" The Prophet (ﷺ) remained silent (for a while) and then said, \"It is obligatory for every Muslim that he should take a bath once in seven days, when he should wash his head and body",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا کہ ہم سے وہیب بن خالد نے بیان کیا، کہا کہ ہم سے عبداللہ بن طاؤس نے بیان کیا، ان سے ان کے باپ طاؤس نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہم ( دنیا میں ) تو بعد میں آئے لیکن قیامت کے دن سب سے آگے ہوں گے، فرق صرف یہ ہے کہ یہود و نصاریٰ کو کتاب ہم سے پہلے دی گئی اور ہمیں بعد میں۔ تو یہ دن ( جمعہ ) وہ ہے جس کے بارے میں اہل کتاب نے اختلاف کیا، اللہ تعالیٰ نے ہمیں یہ دن بتلا دیا ( اس کے بعد ) دوسرا دن ( ہفتہ ) یہود کا دن ہے اور تیسرا دن ( اتوار ) نصاریٰ کا۔ آپ پھر خاموش ہو گئے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Nous sommes les derniers (à venir parmi les nations) mais (nous serons) les premiers au Jour de la Résurrection. Ils ont reçu l’Écriture Sainte avant nous et nous avons reçu le Coran après eux. Et c’est ce jour (le vendredi) au sujet duquel ils ont divergé et Allah nous a guidés (vers lui). Ainsi, demain (c’est-à-dire le samedi) est le jour des Juifs, et le surlendemain (c’est-à-dire le dimanche) est le jour des Chrétiens. » Le Prophète (ﷺ) resta silencieux un moment puis dit : « Il est obligatoire pour chaque musulman de prendre un bain au moins une fois tous les sept jours, en se lavant la tête et le corps. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Ibnu Thawus] dari [Bapaknya] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita datang terakhir dan akan pertama pada hari kiamat. Mereka diberi Kitab sebelum kita dan kita diberi sesudah mereka. Inilah hari (Jum'at) dimana mereka berselisih tentangnya namun Allah memberi petunjuk kepada kita. Maka esok hari untuk Yahudi dan lusa untuk Nashrani.\" Beliau lalu diam, setelah itu beliau bersabda lagi: \"Sudah menjadi kewajiban bagi setiap Muslim untuk mandi pada satu hari dari setiap tujuh hari, pada hari itu dia basuh kepala dan tubuhnya.\" Diriwayatkan oleh [Aban bin Shalih] dari [Mujahid] dari [Thawus] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagi setiap Muslim sudah menjadi kewajiban karena Allah Ta'ala untuk mandi pada satu hari dari setiap tujuh hari",
          "tr": "Ebu Hureyre (radiyallahu anh)'den nakledilmiştir: Resûlullah Sallallahu Aleyhi ve Sellem Bizler en son gelenleriz, fakat kıyamet gününde herkesin önünde bulunan ilkler olacağız. Hem de bizim dışımızdaki ümmetlere bizden daha Önce kitap verilmiş, bize ise onlardan sonra. Haddizatında şu içinde bulunduğumuz Cuma günü konusunda onlar görüş ayrılığına düştüler; Allah da bu günü bize lütfetti. Yahudilerin (kutsal günü olan Cumartesi) yarındır, Hıristiyanların (kutsal günü olan Pazar İse) yarından sonraki gündür\" buyurdu ve sustu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 21
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 898,
      "arabicNumber": 898,
      "book": 11,
      "hadithInBook": 22,
      "text": {
        "arabic": "رَوَاهُ أَبَانُ بْنُ صَالِحٍ عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لِلَّهِ تَعَالَى عَلَى كُلِّ مُسْلِمٍ حَقٌّ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira through different narrators that the Prophet (ﷺ) said, \"It is Allah's right on every Muslim that he should take a bath (at least) once in seven days",
          "ur": "اس حدیث کی روایت ابان بن صالح نے مجاہد سے کی ہے، ان سے طاؤس نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کا ہر مسلمان پر حق ہے کہ ہر سات دن میں ایک دن ( جمعہ ) غسل کرے۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « C’est un droit d’Allah sur chaque musulman de prendre un bain (au moins) une fois tous les sept jours. »",
          "tr": "Ebu Hureyre (r.a.) (yukarıdaki hadisi’e ek olarak) Sonra da şöyle dedi: \"Her Müslümanın her haftada bir gün boy abdesti alması gereklidir; o gün başını ve vücudunu iyice yıkar. Tekrar: 898 vs 3487 [-898-] Ebu Hureyre'den nakledilmiştir: Resûlullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Her müslümanm her haftada bir gün boy abdesti alması Allah'ın onlar üzerindeki bir hakkıdır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 22
      }
    },
    {
      "hadithNumber": 899,
      "arabicNumber": 899,
      "book": 11,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ائْذَنُوا لِلنِّسَاءِ بِاللَّيْلِ إِلَى الْمَسَاجِدِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:The Prophet (ﷺ) said, \"Allow women to go to the Mosques at night",
          "ur": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا کہ ہم سے شبابہ نے بیان کیا، کہا کہ ہم سے ورقاء بن عمرو نے بیان کیا، ان سے عمرو بن دینار نے، ان سے مجاہد نے، ان سے ابن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں کو رات کے وقت مسجدوں میں آنے کی اجازت دے دیا کرو۔",
          "fr": "Rapporté par Ibn `Umar : Le Prophète (ﷺ) a dit : « Laissez les femmes aller à la mosquée la nuit. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Syababah] telah menceritakan kepada kami [Warqa'] dari ['Amru bin Dinar] dari [Mujahid] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Izinkanlah para wanita (bila minta izin) pergi ke masjid di malam hari",
          "tr": "Abdullah Ibn Ömer (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Kadınların geceleri mescidlere gelmelerine müsaade ediniz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 23
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 900,
      "arabicNumber": 900,
      "book": 11,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَتِ امْرَأَةٌ لِعُمَرَ تَشْهَدُ صَلاَةَ الصُّبْحِ وَالْعِشَاءِ فِي الْجَمَاعَةِ فِي الْمَسْجِدِ، فَقِيلَ لَهَا لِمَ تَخْرُجِينَ وَقَدْ تَعْلَمِينَ أَنَّ عُمَرَ يَكْرَهُ ذَلِكَ وَيَغَارُ قَالَتْ وَمَا يَمْنَعُهُ أَنْ يَنْهَانِي قَالَ يَمْنَعُهُ قَوْلُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:One of the wives of `Umar (bin Al-Khattab) used to offer the Fajr and the `Isha' prayer in congregation in the Mosque. She was asked why she had come out for the prayer as she knew that `Umar disliked it, and he has great ghaira (self-respect). She replied, \"What prevents him from stopping me from this act?\" The other replied, \"The statement of Allah's Messenger (ﷺ) : 'Do not stop Allah's women-slaves from going to Allah's Mosques' prevents him",
          "ur": "ہم سے یوسف بن موسیٰ نے بیان کیا، کہا کہ ہم سے ابواسامہ نے بیان کیا کہا کہ ہم سے عبیداللہ ابن عمر نے بیان کیا، ان سے نافع نے، ان سے عبداللہ بن عمر رضی اللہ عنہما نے، انہوں نے کہا کہ عمر رضی اللہ عنہ کی ایک بیوی تھیں جو صبح اور عشاء کی نماز جماعت سے پڑھنے کے لیے مسجد میں آیا کرتی تھیں۔ ان سے کہا گیا کہ باوجود اس علم کے کہ عمر رضی اللہ عنہ اس بات کو مکروہ جانتے ہیں اور وہ غیرت محسوس کرتے ہیں پھر آپ مسجد میں کیوں جاتی ہیں۔ اس پر انہوں نے جواب دیا کہ پھر وہ مجھے منع کیوں نہیں کر دیتے۔ لوگوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کی اس حدیث کی وجہ سے کہ اللہ کی بندیوں کو اللہ کی مسجدوں میں آنے سے مت روکو۔",
          "fr": "Rapporté par Ibn `Umar : L’une des épouses de `Umar (bin Al-Khattab) avait l’habitude de prier le Fajr et l’Isha en groupe à la mosquée. On lui a demandé pourquoi elle sortait pour la prière alors qu’elle savait que `Umar n’aimait pas cela et qu’il était très jaloux. Elle a répondu : « Qu’est-ce qui l’empêche de m’en empêcher ? » L’autre a répondu : « C’est la parole du Messager d’Allah (ﷺ) : ‘Ne privez pas les servantes d’Allah d’aller dans les mosquées d’Allah’ qui l’en empêche. »",
          "id": "Telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami ['Ubaidullah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar]: \"Isteri Umar ikut menghadiri shalat Shubuh dan 'Isya berjama'ah di masjid.\" Lalu dikatakan kepadanya, \"Kenapa kamu pergi ke masjid padahal kamu telah mengetahui bahwa 'Umar tidak menyukainya?\" Wanita itu berkata, \"Apa yang menghalangi dia untuk melarangku?\" Penanya itu berkata, \"Yang mencegahnya adalah sabda Rasulullah shallallahu 'alaihi wasallam: 'Janganlah kalian larang para wanita mendatangi masjid-masjid Allah",
          "tr": "İbni Ömer (r.a.) şöyle demiştir: Ömer (r.a.)'in eşi sabah ve yatsı namazlarını cemaatle kılmak üzere mescide gelirdi. Birisi kendisine: Ömer'in hoşuna gitmediği ve kıskanç bir erkek olduğunu bildiğin halde niçin mescide gelmek üzere dışarı çıkıyorsun? diye sorduğunda ona şöyle mukabelede bulundu: \"Ömer niçin benim mescide gelmeme engel olmuyor?\" Cevap bekleyen bu soruya bizzat o adam'ın kendisi şu cevab'ı verdi: \"Onu engelleyen Resûl-i Ekrem (Sallallahu aleyhi ve Sellem)'in şu sözüdür: Allah'ın cariyelerinin (kadın kullarının) mescitlere gelmelerine engel olmayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 24
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 901,
      "arabicNumber": 901,
      "book": 11,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ أَخْبَرَنِي عَبْدُ الْحَمِيدِ، صَاحِبُ الزِّيَادِيِّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ ابْنُ عَمِّ، مُحَمَّدِ بْنِ سِيرِينَ قَالَ ابْنُ عَبَّاسٍ لِمُؤَذِّنِهِ فِي يَوْمٍ مَطِيرٍ إِذَا قُلْتَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَلاَ تَقُلْ حَىَّ عَلَى الصَّلاَةِ‏.‏ قُلْ صَلُّوا فِي بُيُوتِكُمْ‏.‏ فَكَأَنَّ النَّاسَ اسْتَنْكَرُوا، قَالَ فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي، إِنَّ الْجُمُعَةَ عَزْمَةٌ، وَإِنِّي كَرِهْتُ أَنْ أُخْرِجَكُمْ، فَتَمْشُونَ فِي الطِّينِ وَالدَّحْضِ‏.‏",
        "translations": {
          "en": "Narrated Muhammad bin Seereen:On a rainy day Ibn `Abbas said to his Mu'adh-dhin, \"After saying, 'Ash-hadu anna Muhammadan Rasulullah' (I testify that Muhammad is Allah's Messenger (ﷺ)), do not say 'Haiya 'Alas-Salat' (come for the prayer) but say 'Pray in your houses'.\" (The man did so). But the people disliked it. Ibn `Abbas said, \"It was done by one who was much better than I (i.e. the Prophet (ﷺ) ). No doubt, the Jumua prayer is compulsory but I dislike to put you to task by bringing you out walking in mud and slush",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا۔ انہوں نے کہا کہ ہم سے اسماعیل بن علیہ بیان کیا، انہوں نے کہا کہ ہمیں صاحب الزیادی عبدالحمید نے خبر دی، کہا کہ ہم سے محمد بن سیرین کے چچازاد بھائی عبداللہ بن حارث نے بیان کیا کہ عبداللہ بن عباس رضی اللہ عنہما نے اپنے مؤذن سے ایک دفعہ بارش کے دن کہا کہ «أشهد أن محمدا رسول الله‏» کے بعد «حى على الصلاة‏» ( نماز کی طرف آؤ ) نہ کہنا بلکہ یہ کہنا کہ «صلوا في بيوتكم‏» ( اپنے گھروں میں نماز پڑھ لو ) لوگوں نے اس بات پر تعجب کیا تو آپ نے فرمایا کہ اسی طرح مجھ سے بہتر انسان ( رسول اللہ صلی اللہ علیہ وسلم ) نے کیا تھا۔ بیشک جمعہ فرض ہے اور میں مکروہ جانتا ہوں کہ تمہیں گھروں سے باہر نکال کر مٹی اور کیچڑ پھسلوان میں چلاؤں۔",
          "fr": "Rapporté par Muhammad bin Seereen : Un jour de pluie, Ibn `Abbas a dit à son muezzin : « Après avoir dit : ‘Ash-hadu anna Muhammadan Rasulullah’ (J’atteste que Muhammad est le Messager d’Allah (ﷺ)), ne dis pas ‘Hayya ‘ala-s-Salat’ (Venez à la prière), mais dis : ‘Priez chez vous’. » (L’homme l’a fait.) Mais les gens n’ont pas aimé cela. Ibn `Abbas a dit : « Cela a été fait par quelqu’un de bien meilleur que moi (c’est-à-dire le Prophète (ﷺ)). Il ne fait aucun doute que la prière du vendredi est obligatoire, mais je n’aime pas vous mettre en difficulté en vous faisant sortir marcher dans la boue et la gadoue. »",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah mengabarkan kepadaku ['Abdul Hamid] sahabatnya Az Ziyadi, berkata; telah menceritakan kepada kami ['Abdullah bin Al Harits] anak pamannya Muhammad bin Sirin, [Ibnu 'Abbas] berkata kepada Mu'adzinnya saat hari turun hujan, \"Jika kamu sudah mengucapkan 'ASYHADU ANNA MUHAMMADAR RASULULLAH', janganlah kamu sambung dengan HAYYA 'ALASHSHALAAH (Marilah mendirikan shalat) '. Tapi serukanlah, 'SHALLUU FII BUYUUTIKUM (Shalatlah di tempat tinggal masing-masing) '.\" Lalu orang-orang seakan mengingkarinya. Maka Ibnu 'Abbas pun berkata, \"Sesungguhnya hal yang demikian ini pernah dilakukan oleh orang yang lebih baik dariku. Sesungguhnya shalat Jum'at adalah kewajiban dan aku tidak suka untuk mengeluarkan kalian, sehingga kalian berjalan di tanah yang penuh dengan air dan lumpur",
          "tr": "Çok yağmurlu bir günde İbn Abbâs müezzinine şu talimatı verdi: Sen (Eşhedu enne Muhammeden Resulullah) dedikten sonra (Hayya ale's-selah) deme. Bunun yerine (Namazlarınızı evlerinizde kılın) de. Cemaatten bir kısmı bu durumu garipseyip birbirine bakışınca İbn Abâs şöyle dedi; \"Galiba bu söylediklerimi beğenmediniz. Fakat bunun aynısını - Resûlullah Sallallahu Aleyhi ve Sellem'i kasdederek- benden daha hayırlı olan bir zat yapmıştı. Şüphesiz Cuma namazının kılınması kesin bir emirdir (azimet). Fakat ben sizi sıkıntıya sokmak istemedim. Eğer namaza gelmenizi emredecek olsaydım bu çamurların içinde bata çıka yürümek zorunda kalacak­tınız"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 25
      },
      "narrator": {
        "en": "Muhammad bin Seereen"
      }
    },
    {
      "hadithNumber": 902,
      "arabicNumber": 902,
      "book": 11,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ، حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ النَّاسُ يَنْتَابُونَ يَوْمَ الْجُمُعَةِ مِنْ مَنَازِلِهِمْ وَالْعَوَالِي، فَيَأْتُونَ فِي الْغُبَارِ، يُصِيبُهُمُ الْغُبَارُ وَالْعَرَقُ، فَيَخْرُجُ مِنْهُمُ الْعَرَقُ، فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم إِنْسَانٌ مِنْهُمْ وَهْوَ عِنْدِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Aisha:(the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Messenger (ﷺ) who was in my house. The Prophet (ﷺ) said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath)",
          "ur": "ہم سے احمد بن صالح نے بیان کیا، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا کہ مجھے عمرو بن حارث نے خبر دی، ان سے عبیداللہ بن ابی جعفر نے کہ محمد بن جعفر بن زبیر نے ان سے بیان کیا، ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ نے، آپ نے کہا کہ لوگ جمعہ کی نماز پڑھنے اپنے گھروں سے اور اطراف مدینہ گاؤں سے ( مسجد نبوی میں ) باری باری آیا کرتے تھے۔ لوگ گردوغبار میں چلے آتے، گرد میں اٹے ہوئے اور پسینہ میں شرابور۔ اس قدر پسینہ ہوتا کہ تھمتا ( رکتا ) نہیں تھا۔ اسی حالت میں ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ اس دن ( جمعہ میں ) غسل کر لیا کرتے تو بہتر ہوتا۔",
          "fr": "Rapporté par Aisha (l’épouse du Prophète) : Les gens venaient de leurs maisons et d’Al-`Awali (c’est-à-dire des environs de Médine, jusqu’à quatre kilomètres ou plus). Ils traversaient la poussière, étaient trempés de sueur et couverts de poussière ; la sueur coulait sur eux. L’un d’eux est venu voir le Messager d’Allah (ﷺ) qui était chez moi. Le Prophète (ﷺ) lui a dit : « J’aimerais que tu te nettoies ce jour-là (c’est-à-dire que tu prennes un bain). »",
          "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami ['Abdullah bin Wahab] berkata, telah mengabarkan kepadaku ['Amru bin Al Harits] dari ['Ubaidullah bin Abu Ja'far] bahwa [Muhammad bin Ja'far bin Az Zubair] menceritakan kepadanya dari ['Urwah bin Az Zubair] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Orang-orang datang berbondong-bondong pada hari Jum'at dari tempat tinggal mereka dan pinggiran kota yang jauh, mereka datang melewati padang pasir yang berdebu sehingga mereka pun berdebu dan berkeringat. Lalu seorang dari mereka mendatangi Rasulullah shallallahu 'alaihi wasallam yang saat itu beliau sedang bersamaku, beliau lantas bersabda: \"Seandainya kalian mandi dahulu",
          "tr": "Aişe (r.anha)'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem zamanında insanlar gerek evlerinden gerekse Medine'ye dört mil mesafedeki veya daha uzak bölgelerdeki yerleşim birimlerinden (avali) nöbet usulüyle Cum'a namazına gelirlerdi. Bunlar namaza üstleri başları toz içinde gelirlerdi. Terledikleri için toz toprak vücutlarına iyice yapışırdı ve bedenlerinden ter kokusu yayılırdı. Bir defasında bunlardan birisi Resûl-i Ekrem Sallallahu Aleyhi ve Sellem'in yanına geldi. Ben de orada bulunuyordum. Nebi Sallallahu Aleyhi ve Sellem şahsa şöyle buyurdu: \"Bari bu gün için iyice temizlenseniz, ne kadar iyi olur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 26
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 903,
      "arabicNumber": 903,
      "book": 11,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، أَنَّهُ سَأَلَ عَمْرَةَ عَنِ الْغُسْلِ، يَوْمَ الْجُمُعَةِ فَقَالَتْ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ كَانَ النَّاسُ مَهَنَةَ أَنْفُسِهِمْ، وَكَانُوا إِذَا رَاحُوا إِلَى الْجُمُعَةِ رَاحُوا فِي هَيْئَتِهِمْ فَقِيلَ لَهُمْ لَوِ اغْتَسَلْتُمْ‏.‏",
        "translations": {
          "en": "Narrated Yahya bin Sa`id:I asked `Amra about taking a bath on Fridays. She replied, \" Aisha said, 'The people used to work (for their livelihood) and whenever they went for the Jumua prayer, they used to go to the mosque in the same shape as they had been in work. So they were asked to take a bath on Friday",
          "ur": "ہم سے عبدان عبداللہ بن عثمان نے بیان کیا، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں یحیٰی بن سعید نے خبر دی کہ انہوں نے عمرہ بنت عبدالرحمٰن سے جمعہ کے دن غسل کے بارے میں پوچھا۔ انہوں نے بیان کیا کہ عائشہ رضی اللہ عنہا فرماتی تھیں کہ لوگ اپنے کاموں میں مشغول رہتے اور جمعہ کے لیے اسی حالت ( میل کچیل ) میں چلے آتے، اس لیے ان سے کہا گیا کہ کاش تم لوگ ( کبھی ) غسل کر لیا کرتے۔",
          "fr": "Rapporté par Yahya bin Sa`id : J’ai demandé à `Amra à propos du bain du vendredi. Elle a répondu : « Aisha a dit : ‘Les gens travaillaient pour gagner leur vie et, quand ils allaient à la prière du vendredi, ils allaient à la mosquée dans l’état où ils étaient après le travail. Alors on leur a demandé de prendre un bain le vendredi.’ »",
          "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yahya bin Sa'id] bahwa dia bertanya kepada ['Amrah] tentang mandi pada hari Jum'at. Maka dia menjawab, \"' [Aisyah? radliallahu 'anha] berkata, \"Orang-orang bekerja untuk memenuhi kebutuhan diri mereka masing-masing, ketika menghadiri shalat Jum'at, mereka tetap dalam keadaan mereka masing-masing (dengan pakaian kerjanya), maka dikatakan kepada mereka, \"Seandainya kalian mandi terlebih dahulu",
          "tr": "Aişe (Radiyallahu Anha) şöyle demiştir: \"Asr-ı saadette insanlar kendi işlerini kendileri görürdü. Cum'a namazına da (üstlerini başlarını değiştirmeden) işlerini bırakıp aynı halde gelirlerdi Bu yüzden kendilerine: \"Keşke boy abdesti alsanız, yıkansanız\" denildi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 27
      },
      "narrator": {
        "en": "Yahya bin Sa`id"
      }
    },
    {
      "hadithNumber": 904,
      "arabicNumber": 904,
      "book": 11,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي الْجُمُعَةَ حِينَ تَمِيلُ الشَّمْسُ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:The Prophet (ﷺ) used to offer the Jumua prayer immediately after midday",
          "ur": "ہم سے سریج بن نعمان نے بیان کیا، انہوں نے کہا کہ ہم سے فلیح بن سلیمان نے بیان کیا، ان سے عثمان بن عبدالرحمٰن بن عثمان تیمی نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کی نماز اس وقت پڑھتے جب سورج ڈھل جاتا۔",
          "fr": "Rapporté par Anas bin Malik : Le Prophète (ﷺ) faisait la prière du vendredi juste après midi",
          "id": "Telah menceritakan kepada kami [Suraij bin An Nu'man] berkata, telah menceritakan kepada kami [Fulaih bin Sulaiman] dari ['Utsman bin 'Abdurrahman bin 'Utsman At Taimi] dari [Anas bin Malik] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam melaksanakan shalat Jum'at ketika matahari sudah tergelincir",
          "tr": "Enes İbn Mâlik (r.a.)'den nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Cum'a namazını güneş tepe noktasını geçip batıya doğru kayınca kıldırırdı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 28
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 905,
      "arabicNumber": 905,
      "book": 11,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ كُنَّا نُبَكِّرُ بِالْجُمُعَةِ، وَنَقِيلُ بَعْدَ الْجُمُعَةِ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:We used to offer the Jumua prayer early and then have an afternoon nap",
          "ur": "ہم سے عبدان نے بیان کیا، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، کہا کہ ہمیں حمید طویل نے انس بن مالک رضی اللہ عنہ سے خبر دی۔ آپ نے فرمایا کہ ہم جمعہ سویرے پڑھ لیا کرتے اور جمعہ کے بعد آرام کرتے تھے۔",
          "fr": "Rapporté par Anas bin Malik : Nous faisions la prière du vendredi tôt puis nous faisions une sieste l’après-midi",
          "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Humaid] dari [Anas bin Malik] berkata, \"Kami bersegera (berpagi-pagi dan awal wwaktu) dalam mengerjakan shalat Jum'at, dan tidur siang setelahnya",
          "tr": "Enes İbn Mâlik (r.a.) şöyle demiştir: \"Biz Cum'a namazını biraz erken kılar ve daha sonra kaylule (öğleden sonraki gündüz) uykusuna yatardık. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 29
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 906,
      "arabicNumber": 906,
      "book": 11,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا أَبُو خَلْدَةَ ـ هُوَ خَالِدُ بْنُ دِينَارٍ ـ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اشْتَدَّ الْبَرْدُ بَكَّرَ بِالصَّلاَةِ، وَإِذَا اشْتَدَّ الْحَرُّ أَبْرَدَ بِالصَّلاَةِ، يَعْنِي الْجُمُعَةَ‏.‏ قَالَ يُونُسُ بْنُ بُكَيْرٍ أَخْبَرَنَا أَبُو خَلْدَةَ فَقَالَ بِالصَّلاَةِ، وَلَمْ يَذْكُرِ الْجُمُعَةَ‏.‏ وَقَالَ بِشْرُ بْنُ ثَابِتٍ حَدَّثَنَا أَبُو خَلْدَةَ قَالَ صَلَّى بِنَا أَمِيرٌ الْجُمُعَةَ ثُمَّ قَالَ لأَنَسٍ ـ رضى الله عنه ـ كَيْفَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ",
        "translations": {
          "en": "Narrated Anas bin Malik:The Prophet (ﷺ) used to offer the prayer earlier if it was very cold; and if it was very hot he used to delay the prayer, i.e. the Jumua prayer",
          "ur": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا، انہوں نے کہا کہ ہم سے حرمی بن عمارہ نے بیان کیا، انہوں نے کہا کہ ہم سے ابوخلدہ جن کا نام خالد بن دینار ہے، نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا، آپ نے فرمایا کہ اگر سردی زیادہ پڑتی تو نبی کریم صلی اللہ علیہ وسلم نماز سویرے پڑھ لیتے۔ لیکن جب گرمی زیادہ ہوتی تو ٹھنڈے وقت نماز پڑھتے۔ آپ کی مراد جمعہ کی نماز سے تھی۔ یونس بن بکیر نے کہا کہ ہمیں ابوخلدہ نے خبر دی۔ انہوں نے صرف نماز کہا۔ جمعہ کا ذکر نہیں کیا اور بشر بن ثابت نے کہا کہ ہم سے ابوخلدہ نے بیان کیا کہ امیر نے ہمیں جمعہ کی نماز پڑھائی۔ پھر انس رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز کس وقت پڑھتے تھے؟",
          "fr": "Rapporté par Anas bin Malik : Le Prophète (ﷺ) faisait la prière plus tôt quand il faisait très froid ; et quand il faisait très chaud, il retardait la prière, c’est-à-dire la prière du vendredi",
          "id": "Telah menceritakan kepada kami [Muhammad bin Abu Bakar Al Muqaddami] berkata, telah menceritakan kepada kami [Harami bin 'Umarah] berkata, telah menceritakan kepada kami [Abu Khaldah] -yaitu Khalid bin Dinar- berkata, Aku mendengar [Anas bin Malik] berkata, \"Jika hari terasa sejuk Nabi shallallahu 'alaihi wasallam menyegerakan pelaksanaan shalat, dan bila udara panas beliau mengakhirkannya, yakni shalat Jum'at.\" [Yunus bin Bukair] berkata; telah mengabarkan kepada kami [Abu Khaldah] menyebutkan dengan lafadz 'shalat' saja dan tidak menyebutkan kata 'jum'at'. [Bisyr bin Tsabit] berkata; telah menceritakan kepada kami [Abu Khaldah] ia berkata, \"Ada seorang amir (pemimpin) shalat bersama kami kemudian bertanya kepada Anas? radliallahu 'anhu, \"Bagaimana cara Nabi shallallahu 'alaihi wasallam shalat Zhuhur?",
          "tr": "Enes İbn Mâlik (r.a.), Cum'a namazını kasdederek şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem hava çok soğuk olursa namaz'ı vakit girer girmez kılardı. Havanın aşırı sıcak olması durumunda ise namazı kılmak için hararetin geçip serinliğin düşmesini beklerdi.\" Yunus İbn Bükeyr dedi: Ebu Halde bize bu rivayeti mutlak olarak nakledip Cum'a namazı kaydını zikretmedi: Bişr İbn Sabit dedi: Ebu Halde bize anlattı: \"Bir defasında Cum'a İmamı bize namazı kıldırmış ve sonra Enes İbn Mâlik (r.a.)'e, Resulullah Sallallahu Aleyhi ve Sellem'in öğle namazını nasıl kıldırdığını sormuştu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 30
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 907,
      "arabicNumber": 907,
      "book": 11,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا عَبَايَةُ بْنُ رِفَاعَةَ، قَالَ أَدْرَكَنِي أَبُو عَبْسٍ وَأَنَا أَذْهَبُ، إِلَى الْجُمُعَةِ فَقَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ حَرَّمَهُ اللَّهُ عَلَى النَّارِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu `Abs:I heard the Prophet (ﷺ) saying, \"Anyone whose feet are covered with dust in Allah's cause, shall be saved by Allah from the Hell-Fire",
          "ur": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا کہ ہم سے ولید بن مسلم نے بیان کیا، کہا کہ ہم سے یزید بن ابی مریم نے بیان کیا، کہا کہ ہم سے عبایہ بن رفاعہ بن رافع بن خدیج نے بیان کیا، انہوں نے بیان کیا کہ میں جمعہ کے لیے جا رہا تھا۔ راستے میں ابوعبس رضی اللہ عنہ سے میری ملاقات ہوئی، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ جس کے قدم اللہ کی راہ میں غبار آلود ہو گئے اللہ تعالیٰ اسے دوزخ پر حرام کر دے گا۔",
          "fr": "Rapporté par Abu `Abs : J’ai entendu le Prophète (ﷺ) dire : « Celui dont les pieds sont couverts de poussière dans la cause d’Allah, Allah le sauvera du Feu de l’Enfer. »",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Yazid bin Abu Maryam Al Anshari] berkata, telah menceritakan kepada kami ['Abayah bin Rifa'ah] berkata, \" [Abu 'Abas] berjumpa denganku saat aku sedang berangkat untuk shalat Jum'at, lalu ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang kedua kakinya berdebu di jalan Allah, maka Allah mengharamkan orang itu untuk masuk neraka",
          "tr": "Ubâde İbn Rufâa'dan nakledilmiştir: \"Bir defasında ben Cum'a namazına giderken Ebu Abs arkamdan yetişti ve şunları söyledi: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in: \"Kimin ayakları Allah yolunda tozlanırsa Allah (c.c.) o kişiyi cehenneme haram kılar. buyurduğunu işittim. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 31
      },
      "narrator": {
        "en": "Abu `Abs"
      }
    },
    {
      "hadithNumber": 908,
      "arabicNumber": 908,
      "book": 11,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ الزُّهْرِيُّ عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ تَأْتُوهَا تَسْعَوْنَ، وَأْتُوهَا تَمْشُونَ عَلَيْكُمُ السَّكِينَةُ، فَمَا أَدْرَكْتُمْ فَصَلُّوا، وَمَا فَاتَكُمْ فَأَتِمُّوا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:heard Allah's Messenger (ﷺ) saying, \"If the prayer is started do not run for it but just walk for it calmly and pray whatever you get, and complete whatever is missed",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا، کہا کہ ہم سے زہری نے سعید اور ابوسلمہ سے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے (دوسری سند سے بیان کیا) امام بخاری رحمہ اللہ نے کہا اور ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے خبر دی، انہیں زہری نے اور انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے تھے کہ آپ نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا کہ جب نماز کے لیے تکبیر کہی جائے تو دوڑتے ہوئے مت آؤ بلکہ ( اپنی معمولی رفتار سے ) آؤ پورے اطمینان کے ساتھ پھر نماز کا جو حصہ ( امام کے ساتھ ) پالو اسے پڑھ لو اور جو رہ جائے تو اسے بعد میں پورا کرو۔",
          "fr": "Rapporté par Abu Huraira : J’ai entendu le Messager d’Allah (ﷺ) dire : « Si la prière commence, ne courez pas pour y aller mais marchez calmement, priez ce que vous pouvez et complétez ce que vous avez manqué. »",
          "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b], [Az Zuhri] berkata dari [Sa'id] dan [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Dan telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman] bahwa [Abu Hurairah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika shalat sudak ditegakkan (iqamatnya) janganlah kalian mendatnginya dengan tergesa-gesa. Datangilah dengan berjalan tenang. Maka apa yang kalian dapatkan shalatlah, dan mana yang ketinggalan sempurnakanlah",
          "tr": "Ebu Hureyre (r.a.)'den nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"Namaz için kamet getirildiğinde namaz'a aceleyle koşarak gelmeyin. Tam bir vakar ve sükunet içinde yürüyerek gelin; yetişebildiğiniz kadarını kılın, yetişemediğiniz kısmı ise daha sonra tamamlayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 32
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 909,
      "arabicNumber": 909,
      "book": 11,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنِي أَبُو قُتَيْبَةَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ ـ لاَ أَعْلَمُهُ إِلاَّ عَنْ أَبِيهِ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَقُومُوا حَتَّى تَرَوْنِي، وَعَلَيْكُمُ السَّكِينَةُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin Abi Qatada on the authority of his father:The Prophet (ﷺ) said, \"Do not stand up (for prayer) unless you see me, and observe calmness and solemnity",
          "ur": "ہم سے عمرو بن علی فلاس نے بیان کیا، کہا کہ ہم سے ابو قتیبہ بن قتیبہ نے بیان کیا، کہا کہ ہم سے علی بن مبارک نے یحییٰ بن ابی کثیر سے بیان کیا، ان سے عبداللہ بن ابی قتادہ نے (امام بخاری رحمہ اللہ کہتے ہیں کہ مجھے یقین ہے کہ) عبداللہ نے اپنے باپ ابوقتادہ سے روایت کی ہے، وہ نبی کریم صلی اللہ علیہ وسلم سے راوی ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا جب تک مجھے دیکھ نہ لو صف بندی کے لیے کھڑے نہ ہوا کرو اور آہستگی سے چلنا لازم کر لو۔",
          "fr": "Rapporté par `Abdullah bin Abi Qatada d’après son père : Le Prophète (ﷺ) a dit : « Ne vous levez pas (pour la prière) tant que vous ne me voyez pas, et gardez le calme et la dignité. »",
          "id": "Telah menceritakan kepada kami ['Amru bin 'Ali] berkata, telah menceritakan kepadaku [Abu Qutaibah] berkata, telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Yahya bin Abu Katsir] dari ['Abdullah bin Abu Qatadah] yang aku tidak mengetahuinya kecuali dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian berdiri hingga kalian melihat aku. Dan wajib bagi kalian (mengerjakannya dengan) tenang",
          "tr": "Ebu Katâde (r.a.), Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Beni görünceye kadar ayağa kalkmayın ve üzerinizde tam bir vakar ve sükunet olsun"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 33
      },
      "narrator": {
        "en": "`Abdullah bin Abi Qatada on the authority of his father"
      }
    },
    {
      "hadithNumber": 910,
      "arabicNumber": 910,
      "book": 11,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ وَدِيعَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ، وَتَطَهَّرَ بِمَا اسْتَطَاعَ مِنْ طُهْرٍ، ثُمَّ ادَّهَنَ أَوْ مَسَّ مِنْ طِيبٍ، ثُمَّ رَاحَ فَلَمْ يُفَرِّقْ بَيْنَ اثْنَيْنِ، فَصَلَّى مَا كُتِبَ لَهُ، ثُمَّ إِذَا خَرَجَ الإِمَامُ أَنْصَتَ، غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Salman Al-Farsi:Allah's Messenger (ﷺ) said, \"Anyone who takes a bath on Friday and cleans himself as much as he can and puts oil (on his hair) or scents himself; and then proceeds for the prayer and does not force his way between two persons (assembled in the mosque for the Friday prayer), and prays as much as is written for him and remains quiet when the Imam delivers the Khutba, all his sins in between the present and the last Friday will be forgiven",
          "ur": "ہم سے عبدان نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی انہوں نے کہا کہ ہمیں ابن ابی ذئب نے خبر دی، انہیں سعید مقبری نے، انہیں ان کے باپ ابوسعید نے، انہیں عبداللہ بن ودیعہ نے، انہیں سلمان فارسی رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے جمعہ کے دن غسل کیا اور خوب پاکی حاصل کی اور تیل یا خوشبو استعمال کی، پھر جمعہ کے لیے چلا اور دو آدمیوں کے بیچ میں نہ گھسا اور جتنی اس کی قسمت میں تھی، نماز پڑھی، پھر جب امام باہر آیا اور خطبہ شروع کیا تو خاموش ہو گیا، اس کے اس جمعہ سے دوسرے جمعہ تک کے تمام گناہ بخش دیئے جائیں گے۔",
          "fr": "Rapporté par Salman Al-Farsi : Le Messager d’Allah (ﷺ) a dit : « Celui qui prend un bain le vendredi, se nettoie du mieux qu’il peut, met de l’huile (dans ses cheveux) ou se parfume, puis part pour la prière sans forcer le passage entre deux personnes déjà assises, prie autant qu’il le souhaite et reste silencieux pendant que l’imam fait le sermon, tous ses péchés entre ce vendredi et le précédent seront pardonnés. »",
          "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id Al Maqburi] dari [Bapaknya] dari [Ibnu Wadi'ah] telah menceritakan kepada kami [Salman Al Farsi] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi pada hari Jum'at lalu bersuci semaksimal mungkin, lalu memakai minyak atau wewangian lalu keluar rumah menuju masjid, ia tidak memisahkan antara dua orang pada tempat duduknya, kemudian ia mengerjakan shalat yang dianjurkan baginya, lalu bila imam sudah datang dia berdiam mendengarkan, maka dia akan diampuni dosa-dosanya yang ada antara Jum'atnya itu dan Jum'at yang lainnya",
          "tr": "Selmân-ı Fârisî (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Cum'a günü boy abdesti alıp mümkün olduğu kadar vücudunu iyice temizlemeye çalışan, ardından saçlarını yağlayan veya evinde bulunan güzel kokudan vücuduna süren ve daha sonra mescide gelerek saf olan cemaat'ten iki kişinin arasına girmeden kendisine takdir edilen namazı kılan ve imam'ın okuduğu hutbeyi hiç sesini çıkarmadan can kulağı ile dinleyen herkesin bu Cuma ile diğer Cuma arasındaki günahları bağışlanır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 34
      },
      "narrator": {
        "en": "Salman Al-Farsi"
      }
    },
    {
      "hadithNumber": 911,
      "arabicNumber": 911,
      "book": 11,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ نَافِعًا، يَقُولُ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُقِيمَ الرَّجُلُ أَخَاهُ مِنْ مَقْعَدِهِ وَيَجْلِسَ فِيهِ‏.‏ قُلْتُ لِنَافِعٍ الْجُمُعَةَ قَالَ الْجُمُعَةَ وَغَيْرَهَا‏.‏",
        "translations": {
          "en": "Narrated Ibn Juraij:I heard Nafi' saying, \"Ibn `Umar, said, 'The Prophet (ﷺ) forbade that a man should make another man to get up to sit in his place' \". I said to Nafi`, 'Is it for Jumua prayer only?' He replied, \"For Jumua prayer and any other (prayer)",
          "ur": "ہم سے محمد بن سلام بیکندی رحمہ اللہ نے بیان کیا، کہا کہ ہمیں مخلد بن یزید نے خبر دی، کہا کہ ہمیں ابن جریج نے خبر دی، کہا کہ میں نے نافع سے سنا، انہوں نے کہا میں نے عبداللہ بن عمر سے سنا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ کوئی شخص اپنے مسلمان بھائی کو اٹھا کر اس کی جگہ خود بیٹھ جائے۔ میں نے نافع سے پوچھا کہ کیا یہ جمعہ کے لیے ہے تو انہوں نے جواب دیا کہ جمعہ اور غیر جمعہ سب کے لیے یہی حکم ہے۔",
          "fr": "Rapporté par Ibn Juraij : J’ai entendu Nafi’ dire : « Ibn `Umar a dit : ‘Le Prophète (ﷺ) a interdit qu’un homme fasse lever un autre homme pour prendre sa place.’ » J’ai demandé à Nafi’ : « Est-ce seulement pour la prière du vendredi ? » Il a répondu : « Pour la prière du vendredi et pour toute autre prière. »",
          "id": "Telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Salam- berkata, telah mengabarkan kepada kami [Makhlad bin Yazid] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, Aku mendengar [Nafi'] berkata, Aku mendengar [Ibnu 'Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melarang seseorang meminta kawannya berdiri dari tempat duduknya lalu dia menempati tempat duduk tersebut.\" Aku bertanya kepada Nafi', \"Apakah ini berlaku pada saat shalat Jum'at?\" Dia menjawab, \"Untuk shalat Jum'at dan yang lainnya",
          "tr": "İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem bir kimsenin kardeşini kaldırarak onun yerine oturmasını yasaklamıştır.\" Bu rivayeti nakledenlerden İbn Cüreyc, İbn Ömer'den nakilde bulunan Nâfi'e: \"Cuma namazında mı?\" diye sorunca ondan: \"Hem Cuma namazında hem de diğer namazlarda’’ cevabını almıştır. Tekrar: 6269 ve 6270. Diğer tahric: Tirmizi, edeb; Müslim: selam"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 35
      },
      "narrator": {
        "en": "Ibn Juraij"
      }
    },
    {
      "hadithNumber": 912,
      "arabicNumber": 912,
      "book": 11,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كَانَ النِّدَاءُ يَوْمَ الْجُمُعَةِ أَوَّلُهُ إِذَا جَلَسَ الإِمَامُ عَلَى الْمِنْبَرِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَلَمَّا كَانَ عُثْمَانُ ـ رضى الله عنه ـ وَكَثُرَ النَّاسُ زَادَ النِّدَاءَ الثَّالِثَ عَلَى الزَّوْرَاءِ‏.‏",
        "translations": {
          "en": "Narrated As-Saib bin Yazid:In the lifetime of the Prophet, Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced when the Imam sat on the pulpit. But during the Caliphate of `Uthman when the Muslims increased in number, a third Adhan at Az-Zaura' was added. Abu `Abdullah said, \"Az-Zaura' is a place in the market of Medina",
          "ur": "ہم سے آدم نے بیان کیا، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے زہری کے واسطے سے بیان کیا، ان سے سائب بن یزید نے کہ نبی کریم صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما کے زمانے میں جمعہ کی پہلی اذان اس وقت دی جاتی تھی جب امام منبر پر خطبہ کے لیے بیٹھتے لیکن عثمان رضی اللہ عنہ کے زمانہ میں جب مسلمانوں کی کثرت ہو گئی تو وہ مقام زوراء سے ایک اور اذان دلوانے لگے۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) فرماتے ہیں کہ زوراء مدینہ کے بازار میں ایک جگہ ہے۔",
          "fr": "Rapporté par As-Saib bin Yazid : Du temps du Prophète, d’Abu Bakr et de `Umar, l’appel à la prière du vendredi était fait quand l’imam s’asseyait sur la chaire. Mais sous le califat de `Uthman, quand le nombre de musulmans a augmenté, un troisième appel à la prière a été ajouté à Az-Zaura’. Abu `Abdullah a dit : « Az-Zaura’ est un endroit dans le marché de Médine. »",
          "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [As Sa'ib bin Yazid] berkata, \"Adzan panggilan shalat Jum'at pada mulanya dilakukan ketika imam sudah duduk di atas mimbar. Hal ini dipraktekkan sejak zaman Nabi shallallahu 'alaihi wasallam, Abu Bakar dan 'Umar? radliallahu 'anhuma. Ketika masa 'Utsman? radliallahu 'anhu dan manusia sudah semakin banyak, maka dia menambah adzan ketiga di Az Zaura'.\" Abu 'Abdullah berkata, \"Az Zaura' adalah bangunan yang ada di pasar di Kota Madinah",
          "tr": "Saib İbn Yezîd (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Ebu Bekir ve Ömer (r.a.) dönemlerinde Cum'a ezanı imam minbere çıkıp oturduğunda okunurdu. Fakat Osman (r.a.) halife olduğunda Medine'de İnsanlar çoğalıp nüfus arttığı için Zevrâ denen yerde üçüncü ezanın ek olarak okunmasını kararlaştırdı. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 36
      },
      "narrator": {
        "en": "As-Saib bin Yazid"
      }
    },
    {
      "hadithNumber": 913,
      "arabicNumber": 913,
      "book": 11,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ الَّذِي، زَادَ التَّأْذِينَ الثَّالِثَ يَوْمَ الْجُمُعَةِ عُثْمَانُ بْنُ عَفَّانَ ـ رضى الله عنه ـ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ، وَلَمْ يَكُنْ لِلنَّبِيِّ صلى الله عليه وسلم مُؤَذِّنٌ غَيْرَ وَاحِدٍ، وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ، يَعْنِي عَلَى الْمِنْبَرِ‏.‏",
        "translations": {
          "en": "Narrated As-Saib bin Yazid:The person who increased the number of Adhans for the Jumua prayers to three was `Uthman bin `Affan and it was when the number of the (Muslim) people of Medina had increased. In the lifetime of the Prophet (ﷺ) there was only one Mu'adh-dhin and the Adhan used to be pronounced only after the Imam had taken his seat (i.e. on the pulpit)",
          "ur": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، انہوں نے کہا کہ ہم سے عبد العزیز بن ابوسلمہ ماجشون نے بیان کیا، انہوں نے کہا ہم سے زہری نے بیان کیا، ان سے سائب بن یزید نے کہ جمعہ میں تیسری اذان عثمان بن عفان رضی اللہ عنہ نے بڑھائی جبکہ مدینہ میں لوگ زیادہ ہو گئے تھے جب کہ نبی کریم صلی اللہ علیہ وسلم کے ایک ہی مؤذن تھے۔ ( آپ صلی اللہ علیہ وسلم کے دور میں ) جمعہ کی اذان اس وقت دی جاتی جب امام منبر پر بیٹھتا۔",
          "fr": "Rapporté par As-Saib bin Yazid : Celui qui a augmenté le nombre d’appels à la prière du vendredi à trois est `Uthman bin `Affan, et c’était quand le nombre de musulmans à Médine avait augmenté. Du temps du Prophète (ﷺ), il n’y avait qu’un seul muezzin et l’appel à la prière était fait seulement après que l’imam se soit assis (sur la chaire)",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Salamah Al Majisyun] dari [Az Zuhri] dari [As Sa'ib bin Yazid], \"Sesungguhnya orang yang menambah adzan ketiga pada shalat Jum'at adalah 'Utsman bin 'Affan? radliallahu 'anhu, ketika penduduk Madinah semakin banyak. Dan tidak ada mu'adzin bagi Nabi shallallahu 'alaihi wasallam kecuali satu. Dan adzan shalat Jum'at dilaksanakan ketika Imam sudah duduk, yakni duduk di atas mimbar",
          "tr": "Saib Ibn Yezîd'in şöyle dediği nakledilmiştir: \"Cum'a günü ek olarak üçüncü, ezan okunması uygulamasını başlatan Osman'dır. O dönemde Medine'de nüfus arttığı için Osman (Radiyallahu Anh) böyle bir uygulamayı başlatmak zorunda kalmıştı. Daha önceleri Resûlullah Sallallahu Aleyhi ve Sellem'in sadece bir müezzini vardı ve Cuma ezanı imam minbere çıkıp oturunca okunurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 37
      },
      "narrator": {
        "en": "As-Saib bin Yazid"
      }
    },
    {
      "hadithNumber": 914,
      "arabicNumber": 914,
      "book": 11,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ،، وَهُوَ جَالِسٌ عَلَى الْمِنْبَرِ، أَذَّنَ الْمُؤَذِّنُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ‏.‏ قَالَ مُعَاوِيَةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ‏.‏ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَقَالَ مُعَاوِيَةُ وَأَنَا‏.‏ فَقَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَقَالَ مُعَاوِيَةُ وَأَنَا‏.‏ فَلَمَّا أَنْ قَضَى التَّأْذِينَ قَالَ يَا أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى هَذَا الْمَجْلِسِ حِينَ أَذَّنَ الْمُؤَذِّنُ يَقُولُ مَا سَمِعْتُمْ مِنِّي مِنْ مَقَالَتِي‏.‏",
        "translations": {
          "en": "Narrated Abu Umama bin Sahl bin Hunaif:I heard Muawiya bin Abi Sufyan (repeating the statements of the Adhan) while he was sitting on the pulpit. When the Mu'adh-dhin pronounced the Adhan saying, \"Allahu-Akbar, Allahu Akbar\", Muawiya said: \"Allah Akbar, Allahu Akbar.\" And when the Mu'adh-dhin said, \"Ash-hadu an la ilaha illal-lah (I testify that none has the right to be worshipped but Allah)\", Muawiya said, \"And (so do) I\". When he said, \"Ash-hadu anna Muhammadan Rasulullah\" (I testify that Muhammad is Allah's Apostle), Muawiya said, \"And (so do) I\". When the Adhan was finished, Muawiya said, \"O people, when the Mu'adh-dhin pronounced the Adhan I heard Allah's Messenger (ﷺ) on this very pulpit saying what you have just heard me saying",
          "ur": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہمیں ابوبکر بن عثمان بن سہل بن حنیف نے خبر دی، انہیں ابوامامہ بن سہل بن حنیف نے، انہوں نے کہا میں نے معاویہ بن ابی سفیان رضی اللہ عنہما کو دیکھا آپ منبر پر بیٹھے، مؤذن نے اذان دی «الله أكبر الله أكبر‏» معاویہ رضی اللہ عنہ نے جواب دیا «الله أكبر الله أكبر‏» مؤذن نے کہا «أشهد أن لا إله إلا الله‏» معاویہ نے جواب دیا «وأنا‏» اور میں بھی توحید کی گواہی دیتا ہوں مؤذن نے کہا «أشهد أن محمدا رسول الله‏» معاویہ نے جواب دیا «وأنا‏» اور میں بھی محمد صلی اللہ علیہ وسلم کی رسالت کی گواہی دیتا ہوں جب مؤذن اذان کہہ چکا تو آپ نے کہا حاضرین! میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا اسی جگہ یعنی منبر پر آپ بیٹھے تھے مؤذن نے اذان دی تو آپ یہی فرما رہے تھے جو تم نے مجھ کو کہتے سنا۔",
          "fr": "Rapporté par Abu Umama bin Sahl bin Hunaif : J’ai entendu Muawiya bin Abi Sufyan (répéter les paroles de l’appel à la prière) alors qu’il était assis sur la chaire. Quand le muezzin a dit : « Allahu Akbar, Allahu Akbar », Muawiya a dit : « Allahu Akbar, Allahu Akbar. » Et quand le muezzin a dit : « Ash-hadu an la ilaha illallah (J’atteste qu’il n’y a de divinité digne d’adoration qu’Allah) », Muawiya a dit : « Et moi aussi. » Quand il a dit : « Ash-hadu anna Muhammadan Rasulullah (J’atteste que Muhammad est le Messager d’Allah) », Muawiya a dit : « Et moi aussi. » Quand l’appel à la prière a été terminé, Muawiya a dit : « Ô gens, quand le muezzin faisait l’appel, j’ai entendu le Messager d’Allah (ﷺ) sur cette même chaire dire ce que vous venez de m’entendre dire. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Abu Bakar bin 'Utsman bin Sahl bin Hunaif] dari [Abu Umamah bin Sahl bin Hunaif] berkata, Aku mendengar [Mu'awiyyah bin Abu Suyan] ketika dia sedang duduk di atas mimbar dan mu'adzan sedang mengumandangkan adzan: 'Allahu Akbar Allahu Akbar', Mu'awiyyah mengucapkan, 'Allahu Akbar Allahu Akbar'. Ketika mu'adzin membaca 'Asyhadu anlaa ilaaha illallah', Mu'awiyyah dan aku mengucapkan seperti yang diucapkan mu'adzin. Dan ketika mu'adzin membaca 'Asyhadu anna Muhammadar rasulullah, ' Mu'awiyyah dan aku mengucapkan seperti yang diucapkan mu'adzin. Ketika adzan sudah selesai Mu'awiyyah berkata, \"Wahai manusia, sungguh ketika adzan dikumandangkan aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam mengatakan dari tempat ini seperti yang kalian dengar dari (bacaan) ucapanku tadi",
          "tr": "Ebu Ümâme İbn Sehl İbn Hanîfin şöyle dediği nakledilmiştir: \"Muâviye İbn Ebu Süfyân (r.a.)'ın minberde iken okunan ezana mukabelede bulunduğunu işittim. Müezzin, Allahu Ekber, Allahu Ekber dediğinde Muâviye de, Allahu Ekber Allahu Ekber diyordu. Müezzin, Eşhedu en la ilahe İllallah, dediğinde Muâviye, ben de, diyordu. Müezzin, Eşhedu enne Muhammeden Resulullah, dediğinde Muâviye aynı şekilde, ben de, diye mukabele ediyordu. Müezzin ezanı bitirince Muâviye cemaat'e şöyle hitap etmişti: \"Ey insanlar, ben Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in işte bu minberde iken ezan okunduğunda şu anda benden işitmiş olduğunuz ifadeleri aynen tekrar ettiğini kesinlikle duydum"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 38
      },
      "narrator": {
        "en": "Abu Umama bin Sahl bin Hunaif"
      }
    },
    {
      "hadithNumber": 915,
      "arabicNumber": 915,
      "book": 11,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّ التَّأْذِينَ الثَّانِيَ يَوْمَ الْجُمُعَةِ أَمَرَ بِهِ عُثْمَانُ حِينَ كَثُرَ أَهْلُ الْمَسْجِدِ، وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ‏.‏",
        "translations": {
          "en": "Narrated As-Sa'ib bin Yazid:`Uthman bin `Affan introduced the second Adhan on Fridays when the number of the people in the mosque increased. Previously the Adhan on Fridays used to be pronounced only after the Imam had taken his seat (on the pulpit)",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا کہ ہم سے لیث بن سعد نے عقیل کے واسطے سے بیان کیا، ان سے ابن شہاب نے کہ سائب بن یزید نے انہیں خبر دی کہ جمعہ کی دوسری اذان کا حکم عثمان بن عفان رضی اللہ عنہ نے اس وقت دیا جب نمازی بہت زیادہ ہو گئے تھے اور جمعہ کے دن اذان اس وقت ہوتی جب امام منبر پر بیٹھا کرتا تھا۔",
          "fr": "Rapporté par As-Sa'ib bin Yazid : `Uthman bin `Affan a introduit le deuxième appel à la prière le vendredi quand le nombre de personnes à la mosquée a augmenté. Avant cela, l’appel à la prière du vendredi était fait seulement après que l’imam se soit assis (sur la chaire)",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] bahwa [As Sa'ib bin Yazid] mengabarkan kepadanya, bahwa adzan yang kedua pada hari Jum'at diperintahkan oleh 'Utsman bin 'Affan? radliallahu 'anhu ketika penduduk Madinah semakin banyak. Adapun sebelumnya, adzan hari Jum'at dikumandangkan ketika Imam sudah duduk",
          "tr": "İbn Şihâb, Saib İbn Yezîd'in kendisine şu bilgiyi haber verdiğini nakletmiştir: \"Medine'de mescide gelenlerin sayısı artınca Cum'a günü ikinci ezan okunması talimatını Osman vermişti. Halbuki daha önce Cum'a ezanı imam minbere çıkıp oturunca okunurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 39
      },
      "narrator": {
        "en": "As-Sa'ib bin Yazid"
      }
    },
    {
      "hadithNumber": 916,
      "arabicNumber": 916,
      "book": 11,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ إِنَّ الأَذَانَ يَوْمَ الْجُمُعَةِ كَانَ أَوَّلُهُ حِينَ يَجْلِسُ الإِمَامُ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَلَمَّا كَانَ فِي خِلاَفَةِ عُثْمَانَ ـ رضى الله عنه ـ وَكَثُرُوا، أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالأَذَانِ الثَّالِثِ، فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ، فَثَبَتَ الأَمْرُ عَلَى ذَلِكَ‏.‏",
        "translations": {
          "en": "Narrated Az-Zuhri:I heard As-Saib bin Yazid, saying, \"In the lifetime of Allah's Messenger (ﷺ), and Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced after the Imam had taken his seat on the pulpit. But when the people increased in number during the caliphate of `Uthman, he introduced a third Adhan (on Friday for the Jumua prayer) and it was pronounced at Az-Zaura' and that new state of affairs remained so in the succeeding years",
          "ur": "ہم سے محمد بن مقاتل نے بیان کیا انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا کہ ہم کو یونس بن یزید نے زہری سے خبر دی، انہوں نے کہا کہ میں نے سائب بن یزید رضی اللہ عنہ سے یہ سنا تھا کہ جمعہ کی پہلی اذان رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما کے زمانے میں اس وقت دی جاتی تھی جب امام منبر پر بیٹھتا۔ جب عثمان بن عفان رضی اللہ عنہ کا دور آیا اور نمازیوں کی تعداد بڑھ گئی تو آپ نے جمعہ کے دن ایک تیسری اذان کا حکم دیا، یہ اذان مقام زوراء پر دی گئی اور بعد میں یہی دستور قائم رہا۔",
          "fr": "Rapporté par Az-Zuhri : J’ai entendu As-Saib bin Yazid dire : « Du temps du Messager d’Allah (ﷺ), d’Abu Bakr et de `Umar, l’appel à la prière du vendredi était fait après que l’imam se soit assis sur la chaire. Mais quand les gens ont été plus nombreux sous le califat de `Uthman, il a introduit un troisième appel à la prière (le vendredi) et il était fait à Az-Zaura’, et cela a continué par la suite. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] berkata, Aku mendengar [As Sa'ib bin Yazid] berkata, \"Pada mulanya adzan pada hari Jum'at dikumandangkan ketika Imam sudah duduk di atas mimbar. Yaitu apa yang biasa dipraktekkan sejak zaman Nabi shallallahu 'alaihi wasallam, Abu Bakar dan 'Umar? radliallahu 'anhu. Pada masa Khilafah 'Utsman bin 'Affan? radliallahu 'anhu ketika manusia sudah semakin banyak, maka pada hari Jum'at dia mememerintahkan adzan yang ketiga. Sehingga dikumandangkanlah adzan (ketiga) tersebut di Az Zaura'. Kemudian berlakulah urusan tersebut menjadi ketetapan",
          "tr": "Saib İbn Yezîd (r.a.) şöyle demiştir: \"Cum'a günleri ezan'ın okunma vakti Nebi Sallallahu Aleyhi ve Sellem Ebu Bekir ve Ömer dönemlerinde imam'ın hutbe için minbere çıkıp oturduğu an idi. Daha sonra Osman halife olunca insanlar çoğaldığı için üçüncü ezan'ın okunması talimatını verdi. Bu ezan da Zevrâ denen yerde okunuyordu. İşte onun bu talimatı daha sonra yerleşik bir uygulama haline geldi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 40
      },
      "narrator": {
        "en": "Az-Zuhri"
      }
    },
    {
      "hadithNumber": 917,
      "arabicNumber": 917,
      "book": 11,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيُّ الْقُرَشِيُّ الإِسْكَنْدَرَانِيُّ، قَالَ حَدَّثَنَا أَبُو حَازِمِ بْنُ دِينَارٍ، أَنَّ رِجَالاً، أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، وَقَدِ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لأَعْرِفُ مِمَّا هُوَ، وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ، وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى فُلاَنَةَ ـ امْرَأَةٍ قَدْ سَمَّاهَا سَهْلٌ ـ ‏\"‏ مُرِي غُلاَمَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ ‏\"‏‏.‏ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا، فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهَا فَوُضِعَتْ هَا هُنَا، ثُمَّ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَيْهَا، وَكَبَّرَ وَهْوَ عَلَيْهَا، ثُمَّ رَكَعَ وَهْوَ عَلَيْهَا، ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا وَلِتَعَلَّمُوا صَلاَتِي ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Hazim bin Dinar:Some people went to Sahl bin Sa`d As-Sa`idi and told him that they had different opinions regarding the wood of the pulpit. They asked him about it and he said, \"By Allah, I know of what wood the pulpit was made, and no doubt I saw it on the very first day when Allah's Messenger (ﷺ) took his seat on it. Allah's Messenger (ﷺ) sent for such and such an Ansari woman (and Sahl mentioned her name) and said to her, 'Order your slave-carpenter to prepare for me some pieces of wood (i.e. pulpit) on which I may sit at the time of addressing the people.' So she ordered her slave-carpenter and he made it from the tamarisk of the forest and brought it (to the woman). The woman sent that (pulpit) to Allah's Messenger (ﷺ) who ordered it to be placed here. Then I saw Allah's Messenger (ﷺ) praying on it and then bowed on it. Then he stepped back, got down and prostrated on the ground near the foot of the pulpit and again ascended the pulpit. After finishing the prayer he faced the people and said, 'I have done this so that you may follow me and learn the way I pray",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے یعقوب بن عبدالرحمٰن بن محمد بن عبداللہ بن عبد القاری قرشی اسکندرانی نے بیان کیا، انہوں نے کہا کہ ہم سے ابوحازم بن دینار نے بیان کیا کہ کچھ لوگ سہل بن سعد ساعدی رضی اللہ عنہ کے پاس آئے۔ ان کا آپس میں اس پر اختلاف تھا کہ منبرنبوی علی صاحبہا الصلوۃ والسلام کی لکڑی کس درخت کی تھی۔ اس لیے سعد رضی اللہ عنہ سے اس کے متعلق دریافت کیا گیا آپ نے فرمایا اللہ گواہ ہے میں جانتا ہوں کہ منبرنبوی کس لکڑی کا تھا۔ پہلے دن جب وہ رکھا گیا اور سب سے پہلے جب اس پر رسول اللہ صلی اللہ علیہ وسلم بیٹھے تو میں اس کو بھی جانتا ہوں۔ رسول اللہ صلی اللہ علیہ وسلم نے انصار کی فلاں عورت کے پاس جن کا سعد رضی اللہ عنہ نے نام بھی بتایا تھا۔ آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے میرے لیے لکڑی جوڑ دینے کے لیے کہیں۔ تاکہ جب مجھے لوگوں سے کچھ کہنا ہو تو اس پر بیٹھا کروں چنانچہ انہوں نے اپنے غلام سے کہا اور وہ غابہ کے جھاؤ کی لکڑی سے اسے بنا کر لایا۔ انصاری خاتون نے اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیج دیا۔ نبی کریم صلی اللہ علیہ وسلم نے اسے یہاں رکھوایا میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے اسی پر ( کھڑے ہو کر ) نماز پڑھائی۔ اسی پر کھڑے کھڑے تکبیر کہی۔ اسی پر رکوع کیا۔ پھر الٹے پاؤں لوٹے اور منبر کی جڑ میں سجدہ کیا اور پھر دوبارہ اسی طرح کیا جب آپ نماز سے فارغ ہوئے تو لوگوں کو خطاب فرمایا۔ لوگو! میں نے یہ اس لیے کیا کہ تم میری پیروی کرو اور میری طرح نماز پڑھنی سیکھ لو۔",
          "fr": "Rapporté par Abu Hazim bin Dinar : Des gens sont allés voir Sahl bin Sa`d As-Sa`idi et lui ont dit qu’ils avaient des avis différents sur le bois de la chaire. Ils l’ont interrogé à ce sujet et il a dit : « Par Allah, je sais de quel bois la chaire était faite, et j’ai vu, sans aucun doute, le tout premier jour où le Messager d’Allah (ﷺ) s’est assis dessus. Le Messager d’Allah (ﷺ) a envoyé chercher une femme Ansari (et Sahl a mentionné son nom) et lui a dit : ‘Demande à ton esclave-charpentier de me préparer quelques morceaux de bois (c’est-à-dire une chaire) sur lesquels je pourrai m’asseoir pour m’adresser aux gens.’ Elle a donc demandé à son esclave-charpentier, qui l’a fabriquée avec du bois de tamaris de la forêt et l’a apportée à la femme. La femme a envoyé cette chaire au Messager d’Allah (ﷺ) qui a ordonné de la placer ici. Ensuite, j’ai vu le Messager d’Allah (ﷺ) prier dessus puis s’incliner dessus. Ensuite, il a reculé, est descendu et s’est prosterné sur le sol près du pied de la chaire, puis il est remonté sur la chaire. Après avoir terminé la prière, il s’est tourné vers les gens et a dit : ‘J’ai fait cela pour que vous me suiviez et que vous appreniez la façon dont je prie.’ »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Ya'qub bin 'Abdurrahman bin Muhammad bin 'Abdullah bin 'Abdul Qari Al Qurasyi Al Iskandarani] berkata, telah menceritakan kepada kami [Abu Hazim bin Dinar] bahwa ada orang-orang mendatangi [Sahl bin Sa'd As Sa'idi] yang berdebat tentang mimbar dan bahan membuatnya? Mereka menanyakan hal itu kepadanya. Sahl lalu berkata, \"Demi Allah, akulah orang yang paling mengerti tentang masalah ini. Sungguh aku telah melihat hari pertama mimbar tersebut dipasang dan hari saat Rasulullah shallallahu 'alaihi wasallam duduk di atasnya. Rasulullah shallallahu 'alaihi wasallam mengutus orang untuk menemui seorang wanita Anshar, yang namanya sudah disebutkan oleh Sahl, Sahl lalu berkata, \"Perintahkanlah budak lelakimu yang tukang kayu itu untuk membuat mimbar bertangga, sehingga saat berbicara dengan orang banyak aku bisa duduk di atasnya.\" Maka kemudian wanita itu memerintahkan budak lelakinya membuat mimbar yang terbuat dari batang kayu hutan. Setelah diberikan kepada wanita itu, lalu itu mengirimnya untuk Rasulullah shallallahu 'alaihi wasallam. Maka Beliau memerintahkan orang untuk meletakkan mimbar tersebut di sini. Lalu aku melihat Rasulullah shallallahu 'alaihi wasallam shalat diatasnya. Beliau bertakbir dalam posisi di atas mimbar lalu rukuk dalam posisi masih di atas mimbar. Kemudian Beliau turun dengan mundur ke belakang, lalu sujud di dasar mimbar, kemudian Beliau mengulangi lagi (hingga shalat selesai). Setelah selesai, beliau menghadap kepada orang banyak lalu bersabda: \"Wahai sekalian manusia, sesungguhnya aku berbuat seperti tadi agar kalian mengikuti dan agar kalian dapat mengambil pelajaran tentang tata cara shalatku",
          "tr": "Ebu Hazim İbn Dinar'dan nakledilmiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem'in minberinin hangi ağaç'tan yapıldığı konusunda görüş ayrılığına düşen bir kesim Sehl İbn Sa'd es-Sâidî'ye gelerek minber'in neden yapıldığını sordular. Sehl onlara şu cevabı verdi: \"Allah'a yemin ederim ki, ben bu minber'in hangi ağaç'tan yapıldığını, mescid'e konduğu ilk günü ve Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in üzerine oturduğu ilk günü çok iyi biliyorum. Nebi Sallallahu Aleyhi ve Sellem kölesi marangozlukla meşgul olan bir kadın'a -Sehl bu kadının kim oldu­ğunu söylemişti- haberci göndererek, 'Kölene söyle insanlara hitap ettiğim zaman üzerine oturacağım bir minber yapsın' diye emir buyurmuştu. Kadın da kendisine söylendiği gibi kölesine bu minberi yaptırdı. Köle Resûlullah Sallallahu Aleyhi ve Sellem'in istediği minberi orman'dan temin ettiği ılgın ağacından yapmış ve getirmişti. Kadın bu minberi daha sonra Resûlullah Sallallahu Aleyhi ve Sellem'e gönderdi ve minber Nebi Sallallahu Aleyhi ve Sellem'in istediği yere kondu, işte ben Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in bu minber üzerinde namaz kıldığını ve yine minber'in üzerinde iken tekbir getirdiğini gördüm. Sonra minber'den inmeden rükû etmişti ve ardından geri geri çekilerek minber'den inmişti. Bu şekilde geriye çekildikten sonra minber'in ilk basamağının dibine secde etmiş ve ardından aynı uygulamayı tekrar etmişti. Resûlullah Sallallahu Aleyhi ve Sellem namaz'ı bitirince insanlara dönerek şöyle buyurdu: \"Ey insanlar, ben bu şekilde namaz kıldım ki bana uyasınız ve benim namazımın nasıl olduğunu öğrenesiniz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 41
      },
      "narrator": {
        "en": "Abu Hazim bin Dinar"
      }
    },
    {
      "hadithNumber": 918,
      "arabicNumber": 918,
      "book": 11,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَنَسٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كَانَ جِذْعٌ يَقُومُ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا وُضِعَ لَهُ الْمِنْبَرُ سَمِعْنَا لِلْجِذْعِ مِثْلَ أَصْوَاتِ الْعِشَارِ حَتَّى نَزَلَ النَّبِيُّ صلى الله عليه وسلم فَوَضَعَ يَدَهُ عَلَيْهِ‏.‏ قَالَ سُلَيْمَانُ عَنْ يَحْيَى أَخْبَرَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ أَنَّهُ سَمِعَ جَابِرًا‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) used to stand by a stem of a date-palm tree (while delivering a sermon). When the pulpit was placed for him we heard that stem crying like a pregnant she-camel till the Prophet (ﷺ) got down from the pulpit and placed his hand over it",
          "ur": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا کہ ہم سے محمد بن جعفر بن ابی کثیر نے بیان کیا، کہا کہ مجھے یحییٰ بن سعید نے خبر دی، کہا کہ مجھے حفص بن عبداللہ بن انس نے خبر دی، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا کہ ایک کھجور کا تنا تھا جس پر نبی کریم صلی اللہ علیہ وسلم ٹیک لگا کر کھڑے ہوا کرتے تھے۔ جب آپ صلی اللہ علیہ وسلم کے لیے منبر بن گیا ( آپ صلی اللہ علیہ وسلم نے اس تنے پر ٹیک نہیں لگایا ) تو ہم نے اس سے رونے کی آواز سنی جیسے دس مہینے کی گابھن اونٹنی آواز کرتی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے منبر سے اتر کر اپنا ہاتھ اس پر رکھا ( تب وہ آواز موقوف ہوئی ) اور سلیمان نے یحییٰ سے یوں حدیث بیان کی کہ مجھے حفص بن عبیداللہ بن انس نے خبر دی اور انہوں نے جابر سے سنا۔",
          "fr": "Rapporté par Jabir bin `Abdullah : Le Prophète (ﷺ) se tenait près d’un tronc de palmier pour faire son sermon. Quand on lui a installé une chaire, nous avons entendu ce tronc pleurer comme une chamelle pleine jusqu’à ce que le Prophète (ﷺ) descende de la chaire et pose sa main dessus",
          "id": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah mengabarkan kepadaku [Yahya bin Sa'id] berkata, telah mengabarkan kepada kami [Ibnu Anas] bahwa dia mendengar [Jabir bin 'Abdullah] berkata, \"Pada mulanya Nabi shallallahu 'alaihi wasallam menggunakan batang kayu sebagai tongkat yang biasa beliau gunakan untuk bersandar. Ketika sudah dibuatkan mimbar untuk Beliau, kami mendengar sesuatu dari batang kayu tersebut seperti suara unta hendak beranak, hingga akhirnya Nabi shallallahu 'alaihi wasallam turun lalu meletakkan tangan Beliau pada kayu tersebut.\" [Sulaiman] berkata, dari [Yahya] berkata, telah mengabarkan kepadaku [Hafsh bin 'Ubaidullah bin Anas] bahwa dia mendengar dari [Jabir bin 'Abdullah]",
          "tr": "İbn Enes, Câbir Ibn Abdullah'ın şöyle dediğini bizzat işittiğini anlatmıştır: \"Resûlullah Sallallahu Aleyhi ve Sellem'in hutbe sırasında üzerinde durduğu bir hurma kütüğü vardı. Fakat Resûl-i Ekrem Sallallahu Aleyhi ve Sellem için bir minber kurulup artık kütüğe ihtiyaç kalmayınca kütük'ten gebe develerin doğum anındaki iniltilerine benzer sesler duyduk. Nebi Sallallahu Aleyhi ve Sellem minber'den inip kütüğün üzerine elini koyunca iniltiler kesildi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 42
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 919,
      "arabicNumber": 919,
      "book": 11,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ فَقَالَ ‏ \"‏ مَنْ جَاءَ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Salim:My father said , \"I heard the Prophet (ﷺ) delivering the Khutba on the pulpit and he said, 'Whoever comes for the Jumua prayer should take a bath (before coming)",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے بیان کیا، ان سے زہری نے، ان سے سالم نے، ان سے ان کے باپ (ابن عمر رضی اللہ عنہما) نے فرمایا کہ میں نے نبی کریم صلی الہ علیہ وسلم سے سنا۔ آپ صلی اللہ علیہ وسلم نے منبر پر خطبہ دیتے ہوئے فرمایا کہ جو جمعہ کے لیے آئے وہ پہلے غسل کر لیا کرے۔",
          "fr": "Rapporté par Salim : Mon père a dit : « J’ai entendu le Prophète (ﷺ) faire le sermon sur la chaire et il a dit : Celui qui vient pour la prière du vendredi doit prendre un bain avant de venir. »",
          "id": "Telah menceritakan kepada kami [Adam bin Abu Iyas] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Salim] dari [Bapaknya] berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda saat sedang berkhuthbah di atas mimbar: \"Siapa yang mendatangi shalat Jum'at, hendaklah dia mandi",
          "tr": "Salim'den gelen bilgiye göre babasının, Resûlullah Sallallahu Aleyhi ve Sellem'in üzerinde hutbe îrad ederken: \"Kim Cum'a namazına gelirse boy abdesti alsın da öyle gelsin!\" diye buyurduğunu işitmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 43
      },
      "narrator": {
        "en": "Salim"
      }
    },
    {
      "hadithNumber": 920,
      "arabicNumber": 920,
      "book": 11,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ ثُمَّ يَقُومُ، كَمَا تَفْعَلُونَ الآنَ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:The Prophet (ﷺ) used to deliver the Khutba while standing and then he would sit, then stand again as you do now-a-days",
          "ur": "ہم سے عبیداللہ بن عمر قواریری نے بیان کیا، انہوں نے کہا کہ ہم سے خالد بن حارث نے بیان کیا، انہوں نے کہا کہ ہم سے عبیداللہ بن عمر نے نافع سے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہو کر خطبہ دیتے تھے۔ پھر بیٹھ جاتے اور پھر کھڑے ہوتے جیسے تم لوگ بھی آج کل کرتے ہو۔",
          "fr": "Rapporté par Ibn `Umar : Le Prophète (ﷺ) faisait le sermon debout, puis il s’asseyait, puis il se relevait, comme vous le faites aujourd’hui",
          "id": "Telah menceritakan kepada kami ['Ubaidullah bin 'Umar Al Qawariri] berkata, telah menceritakan kepada kami [Khalid bin Al Harits] berkata, telah menceritakan kepada kami ['Ubaidullah bin 'Umar] dari [Nafi'] dari [Ibnu 'Umar] radliallahu 'anhuma, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhuthbah sambil berdiri, kemudian duduk lalu berdiri kembali seperti yang kalian lakukan di zaman sekarang ini",
          "tr": "İbn Ömer'in şöyle dediği nakledilmiştir: \"Sizin tıpkı bugün yaptığınız gibi Resulullah Sallallahu Aleyhi ve Sellem ayakta olduğu halde hutbe îrad ederdi. Sonra biraz oturur ve ardından geri kalkardı. Tekrar: 928. Diğer tahric: Tirmizi Cum’a; Nesaî, Cuma"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 44
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 921,
      "arabicNumber": 921,
      "book": 11,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، حَدَّثَنَا عَطَاءُ بْنُ يَسَارٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم جَلَسَ ذَاتَ يَوْمٍ عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id Al-Khudri:One day the Prophet (ﷺ) sat on the pulpit and we sat around him",
          "ur": "ہم سے معاذ بن فضالہ نے بیان کیا، کہا کہ ہم سے ہشام دستوائی نے یحیی بن ابی کثیر سے بیان کیا، ان سے ہلال بن ابی میمونہ نے، انہوں نے کہا ہم سے عطاء بن یسار نے بیان کیا، انہوں نے ابو سعید خدری رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم ایک دن منبر پر تشریف فرما ہوئے اور ہم سب آپ صلی اللہ علیہ وسلم کے ارد گرد بیٹھ گئے۔",
          "fr": "Rapporté par Abu Sa`id Al-Khudri : Un jour, le Prophète (ﷺ) s’est assis sur la chaire et nous nous sommes assis autour de lui",
          "id": "Telah menceritakan kepada kami [Mu'adz bin Fadlalah] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Hilal bin Abu Maimunah] telah menceritakan kepada kami ['Atha' bin Yasar] bahwasanya dia mendengar [Abu Sa'id Al Khudri] radliallahu 'anhu berkata, \"Pada suatu hari Nabi shallallahu 'alaihi wasallam duduk di atas mimbar dan kami duduk di sekitarnya",
          "tr": "Ebu Saîd el-Hudrî (r.a.)'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem bir gün minber'in üzerine oturdu ve biz de onun çevresine toplanıp oturduk. Tekrar: 1465, 2842 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 45
      },
      "narrator": {
        "en": "Abu Sa`id Al-Khudri"
      }
    },
    {
      "hadithNumber": 922,
      "arabicNumber": 922,
      "book": 11,
      "hadithInBook": 46,
      "text": {
        "arabic": "وَقَالَ مَحْمُودٌ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَالنَّاسُ يُصَلُّونَ قُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا أَىْ نَعَمْ‏.‏ قَالَتْ فَأَطَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم جِدًّا حَتَّى تَجَلاَّنِي الْغَشْىُ وَإِلَى جَنْبِي قِرْبَةٌ فِيهَا مَاءٌ فَفَتَحْتُهَا فَجَعَلْتُ أَصُبُّ مِنْهَا عَلَى رَأْسِي، فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، وَحَمِدَ اللَّهَ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ قَالَتْ وَلَغِطَ نِسْوَةٌ مِنَ الأَنْصَارِ، فَانْكَفَأْتُ إِلَيْهِنَّ لأُسَكِّتَهُنَّ فَقُلْتُ لِعَائِشَةَ مَا قَالَ قَالَتْ قَالَ ‏\"‏ مَا مِنْ شَىْءٍ لَمْ أَكُنْ أُرِيتُهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ، وَإِنَّهُ قَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ ـ أَوْ قَرِيبَ مِنْ ـ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، يُؤْتَى أَحَدُكُمْ، فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوْ قَالَ الْمُوقِنُ شَكَّ هِشَامٌ ـ فَيَقُولُ هُوَ رَسُولُ اللَّهِ، هُوَ مُحَمَّدٌ صلى الله عليه وسلم جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى فَآمَنَّا وَأَجَبْنَا وَاتَّبَعْنَا وَصَدَّقْنَا‏.‏ فَيُقَالُ لَهُ نَمْ صَالِحًا، قَدْ كُنَّا نَعْلَمُ إِنْ كُنْتَ لَتُؤْمِنُ بِهِ‏.‏ وَأَمَّا الْمُنَافِقُ ـ أَوْ قَالَ الْمُرْتَابُ شَكَّ هِشَامٌ ـ فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏ قَالَ هِشَامٌ فَلَقَدْ قَالَتْ لِي فَاطِمَةُ فَأَوْعَيْتُهُ، غَيْرَ أَنَّهَا ذَكَرَتْ مَا يُغَلِّظُ عَلَيْهِ‏.‏",
        "translations": {
          "en": "Narrated Fatima bint Al-Mundhir:Asma' bint Abi Bakr As-Siddiq said, \"I went to 'Aishah and the people were offering Salat. I asked her, 'What is wrong with the people ?' She pointed towards the sky with her head. I asked her, 'Is there a sign ?' 'Aishah nodded with her head meaning 'Yes'.\" Asma' added, \"Allah's Messenger (ﷺ) prolonged the Salat to such an extent that I fainted. There was a waterskin by my side and I opened it and poured some water on my head. When Allah's Messenger (ﷺ) finished Salat, and the solar eclipse had cleared, the Prophet (ﷺ) addressed the people and praised Allah as He deserves and said, 'Amma ba'du'.\" Asma' further said, \"Some Ansari women started talking, so I turned to them in order to make them quiet. I asked 'Aishah what the Prophet (ﷺ) had said. 'Aishah said: 'He said, 'I have seen things at this place of mine which were never shown to me before; (I have seen) even Paradise and Hell. And, no doubt it has been revealed to me that you (people) will be put in trial in your graves like or nearly like the trial of Masih Ad-Dajjal. (The angels) will come to everyone of you and ask him, 'What do you know about this man (Prophet Muhammad (ﷺ)) ?\" The faithful believer or firm believer (Hisham was in doubt which word the Prophet (ﷺ) used), will say, 'He is Allah's Messenger (ﷺ) and he is Muhammad (ﷺ) who came to us with clear evidences and guidance. So we believed him, accepted his teachings and followed and trusted his teaching.' Then the angels will tell him to sleep (in peace) as they have come to know that he was a believer. But the hypocrite or a doubtful person (Hisham is not sure as to which word the Prophet (ﷺ) used), will be asked what he knew about this man (Prophet Muhammed (ﷺ)). He will say, 'I do not know but I heard the people saying something (about him) so I said the same' \" Hisham added, \"Fatima told me that she remembered that narration completely by heart except that she said about the hypocrite or a doubtful person that he will be punished severely",
          "ur": "اور محمود بن غیلان (امام بخاری رحمہ اللہ کے استاذ) نے کہا کہ ہم سے ابواسامہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا، کہ مجھے فاطمہ بنت منذر نے خبر دی، ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے، انہوں نے کہا کہ میں عائشہ رضی اللہ عنہا کے پاس گئی۔ لوگ نماز پڑھ رہے تھے۔ میں نے ( اس بے وقت نماز پر تعجب سے پوچھا کہ ) یہ کیا ہے؟ عائشہ رضی اللہ عنہا نے سر سے آسمان کی طرف اشارہ کیا۔ میں نے پوچھا کیا کوئی نشانی ہے؟ انہوں نے سر کے اشارہ سے ہاں کہا ( کیونکہ سورج گہن ہو گیا تھا ) اسماء رضی اللہ عنہا نے کہا کہ نبی کریم صلی اللہ علیہ وسلم دیر تک نماز پڑھتے رہے۔ یہاں تک کہ مجھ کو غشی آنے لگی۔ قریب ہی ایک مشک میں پانی بھرا رکھا تھا۔ میں اسے کھول کر اپنے سر پر پانی ڈالنے لگی۔ پھر جب سورج صاف ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے نماز ختم کر دی۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ دیا۔ پہلے اللہ تعالیٰ کی اس کی شان کے مناسب تعریف بیان کی۔ اس کے بعد فرمایا «امابعد» ! اتنا فرمانا تھا کہ کچھ انصاری عورتیں شور کرنے لگیں۔ اس لیے میں ان کی طرف بڑھی کہ انہیں چپ کراؤں ( تاکہ رسول اللہ صلی اللہ علیہ وسلم کی بات اچھی طرح سن سکوں مگر میں آپ کا کلام نہ سن سکی ) تو پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا؟ انہوں نے بتایا کہ آپ نے فرمایا کہ بہت سی چیزیں جو میں نے اس سے پہلے نہیں دیکھی تھیں، آج اپنی اس جگہ سے میں نے انہیں دیکھ لیا۔ یہاں تک کہ جنت اور دوزخ تک میں نے آج دیکھی۔ مجھے وحی کے ذریعہ یہ بھی بتایا گیا کہ قبروں میں تمہاری ایسی آزمائش ہو گی جیسے کانے دجال کے سامنے یا اس کے قریب قریب۔ تم میں سے ہر ایک کے پاس فرشتہ آئے گا اور پوچھے گا کہ تو اس شخص کے بارے میں کیا اعتقاد رکھتا تھا؟ مومن یا یہ کہا کہ یقین والا ( ہشام کو شک تھا ) کہے گا کہ وہ محمد رسول اللہ صلی اللہ علیہ وسلم ہیں، ہمارے پاس ہدایت اور واضح دلائل لے کر آئے، اس لیے ہم ان پر ایمان لائے، ان کی دعوت قبول کی، ان کی اتباع کی اور ان کی تصدیق کی۔ اب اس سے کہا جائے گا کہ تو تو صالح ہے، آرام سے سو جا۔ ہم پہلے ہی جانتے تھے کہ تیرا ان پر ایمان ہے۔ ہشام نے شک کے اظہار کے ساتھ کہا کہ رہا منافق یا شک کرنے والا تو جب اس سے پوچھا جائے گا کہ تو اس شخص کے بارے میں کیا کہتا ہے تو وہ جواب دے گا کہ مجھے نہیں معلوم میں نے لوگوں کو ایک بات کہتے سنا اسی کے مطابق میں نے بھی کہا۔ ہشام نے بیان کیا کہ فاطمہ بنت منذر نے جو کچھ کہا تھا۔ میں نے وہ سب یاد رکھا۔ لیکن انہوں نے قبر میں منافقوں پر سخت عذاب کے بارے میں جو کچھ کہا وہ مجھے یاد نہیں رہا۔",
          "fr": "Rapporté par Fatima bint Al-Mundhir : Asma' bint Abi Bakr As-Siddiq a dit : « Je suis allée chez 'Aisha et les gens faisaient la prière. Je lui ai demandé : “Qu’est-ce qui se passe ?” Elle a fait un signe vers le ciel avec la tête. Je lui ai demandé : “Y a-t-il un signe ?” 'Aisha a hoché la tête pour dire “oui”. » Asma' a ajouté : « Le Messager d’Allah (ﷺ) a tellement prolongé la prière que je me suis évanouie. Il y avait une outre d’eau à côté de moi, je l’ai ouverte et j’ai versé de l’eau sur ma tête. Quand le Messager d’Allah (ﷺ) a terminé la prière et que l’éclipse solaire était finie, le Prophète (ﷺ) a parlé aux gens, a loué Allah comme il le mérite et a dit : “Amma ba'du.” » Asma' a continué : « Quelques femmes des Ansar ont commencé à parler, alors je me suis tournée vers elles pour leur demander de se taire. J’ai demandé à 'Aisha ce que le Prophète (ﷺ) avait dit. 'Aisha a répondu : “Il a dit : J’ai vu ici des choses qui ne m’avaient jamais été montrées auparavant ; j’ai même vu le Paradis et l’Enfer. Et il m’a été révélé que vous serez interrogés dans vos tombes, comme ou presque comme l’épreuve du Messie menteur (Masih Ad-Dajjal). Les anges viendront à chacun de vous et lui demanderont : ‘Que sais-tu de cet homme (le Prophète Muhammad (ﷺ)) ?’ Le croyant sincère dira : ‘C’est le Messager d’Allah (ﷺ), c’est Muhammad (ﷺ) qui nous a apporté des preuves claires et la bonne direction. Nous avons cru en lui, accepté ses enseignements et suivi sa voie.’ Alors les anges lui diront de dormir en paix, car ils savent qu’il était croyant. Mais l’hypocrite ou celui qui doute, sera interrogé sur cet homme (le Prophète Muhammad (ﷺ)) et il dira : ‘Je ne sais pas, j’ai seulement répété ce que les gens disaient.’” » Hisham a ajouté : « Fatima m’a dit qu’elle se souvenait de tout ce récit sauf qu’elle a précisé que l’hypocrite ou celui qui doute sera sévèrement puni. »",
          "tr": "Esma binti Ebu Bekir şöyle demiştir: \"Bir gün Aişe'nin yanına gitmiştim. O sırada ashâb-ı kiram namaz kılıyordu. Ben, niçin bu vakitte namaz kıl­dıklarını Aişe'ye sorunca başıyla göğe işaret etti. Ben, Olağanüstü bir olay mı var, diye tekrar sorunca evet anlamında başını salladı. Resulullah Sallallahu Aleyhi ve Sellem o kadar uzun bir süre bekledi ki neredeyse bayılacaktım. Yanıbaşımda bir kırba dolusu su vardı. Kırbayı açıp serinlemek maksadıyla başıma biraz su döktüm. Resul-i Ekrem Sallallahu Aleyhi ve Sellem namaz'ı bitirdiğinde güneş iyice açılmıştı. Nebi Sallallahu Aleyhi ve Sellem daha sonra cemaat'e dönüp Allah Teâlâ'ya layık olduğu vechile hamd etti ve ardından: \"Emma ba'du (Şimdi asıl konuya gelelim)\" dedi. Ben bu sırada gürültü çıkaran ensardan bir kadın'ı susturmakla meşgul olduğum için Resulullah Sallallahu Aleyhi ve Sellem'in neler söylediğini kaçırmıştım. Bu yüzden Aişe'ye gidip Resul-i Ekrem Sallallahu Aleyhi ve Sellem ne söyledi diye sordum. Bana Resulullah Sallallahu Aleyhi ve Sellem'in. şöyle buyurduğunu söyledi: 'Daha önce bana hiç gösterilmeyen ne varsa hepsini işte şu bulunduğum yerde gördüm. Hatta cennet ve cehennemi bile. Bana, sizlerin kabirlerde Mesih-Deccal’in fitnesi (imtihan vesilesi) gibi - veya bu fitneye yakın bir fitneyle karşılaşacağınız vahyedildi. Siz kabirdeyken yanınıza gelecekler ve beni kasdederek: \"Şu zât hakkında bildiğiniz şeyler nelerdir?\" diye soracaklar. Mu'minler - hadisin ravilerinden Hişâm bunu veya yakın (kesin inanç) sahipleri ifadesiyle de nakletmiştir hemen: \"O Allah'ın Resulüdür, O Muhammed'dir. O bize apaçık delilleri (beyyinât) ve hidayeti getirdi. Biz de ona iman ettik, kendi­sine karşı çıkmadan icabet ettik. Biz ona uyduk ve kendisini tasdik ettik\" diye­cekler. Bunun üzerine onlara: \"Haydi, yaptıklarınızın karşılığını hakkıyla almak üzere huzur içinde uyuyun bakalım! Biz sizin ona iman ettiğinizi zaten biliyorduk \" denecek. Buna karşılık münafıklar hadisin ravilerinden Hişâm bunu veya şüphe eden kimseler ifadesiyle de nakletmiştir kendilerine yöneltilen bu soruya şöyle cevap vereceklerdir: \"Ne bilelim bizi Bir takım insanlar bir şeyler söylüyorlardı ve biz de aynısını söyledik İşte.\" Bu hadisin ravilerinden Hişâm İbn Urve şunları söylemiştir: \"Hadisi kendi­sinden naklettiğim Fâtıma Bİntü'l-Münzir bana bu rivayeti çok sağlam bir şekilde ezberlediğini ve bu hadiste münafıklara çok can yakıcı sert ifadelerle cevap ve-rildiğini de söylemişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 46
      },
      "narrator": {
        "en": "Fatima bint Al-Mundhir"
      }
    },
    {
      "hadithNumber": 923,
      "arabicNumber": 923,
      "book": 11,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ جَرِيرِ بْنِ حَازِمٍ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِمَالٍ أَوْ سَبْىٍ فَقَسَمَهُ، فَأَعْطَى رِجَالاً وَتَرَكَ رِجَالاً فَبَلَغَهُ أَنَّ الَّذِينَ تَرَكَ عَتَبُوا، فَحَمِدَ اللَّهَ ثُمَّ أَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ، فَوَاللَّهِ إِنِّي لأُعْطِي الرَّجُلَ، وَأَدَعُ الرَّجُلَ، وَالَّذِي أَدَعُ أَحَبُّ إِلَىَّ مِنَ الَّذِي أُعْطِي وَلَكِنْ أُعْطِي أَقْوَامًا لِمَا أَرَى فِي قُلُوبِهِمْ مِنَ الْجَزَعِ وَالْهَلَعِ، وَأَكِلُ أَقْوَامًا إِلَى مَا جَعَلَ اللَّهُ فِي قُلُوبِهِمْ مِنَ الْغِنَى وَالْخَيْرِ، فِيهِمْ عَمْرُو بْنُ تَغْلِبَ ‏\"‏‏.‏ فَوَاللَّهِ مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم حُمْرَ النَّعَمِ‏.‏ تَابَعَهُ يُونُسُ‏.‏",
        "translations": {
          "en": "Narrated `Amr bin Taghlib:Some property or something was brought to Allah's Messenger (ﷺ) and he distributed it. He gave to some men and ignored the others. Later he got the news of his being admonished by those whom he had ignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and ignore another, although the one whom I ignore is more beloved to me than the one whom I give. But I give to some people as I feel that they have no patience and no contentment in their hearts and I leave those who are patient and self-content with the goodness and wealth which Allah has put into their hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's Apostle are more beloved to me than the best red camels",
          "ur": "ہم سے محمد بن معمر نے بیان کیا، کہا کہ ہم سے ابوعاصم نے جریر بن حازم سے بیان کیا، انہوں نے کہا کہ میں نے امام حسن بصری سے سنا، انہوں نے بیان کیا کہ ہم نے عمرو بن تغلب رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ مال آیا یا کوئی چیز آئی۔ آپ نے بعض صحابہ کو اس میں سے عطا کیا اور بعض کو کچھ نہیں دیا۔ پھر آپ کو معلوم ہوا کہ جن لوگوں کو آپ نے نہیں دیا تھا انہیں اس کا رنج ہوا، اس لیے آپ نے اللہ کی حمد و تعریف کی پھر فرمایا «امابعد» ! اللہ کی قسم! میں بعض لوگوں کو دیتا ہوں اور بعض کو نہیں دیتا لیکن میں جس کو نہیں دیتا وہ میرے نزدیک ان سے زیادہ محبوب ہیں جن کو میں دیتا ہوں۔ میں تو ان لوگوں کو دیتا ہوں جن کے دلوں میں بے صبری اور لالچ پاتا ہوں لیکن جن کے دل اللہ تعالیٰ نے خیر اور بےنیاز بنائے ہیں، میں ان پر بھروسہ کرتا ہوں۔ عمرو بن تغلب بھی ان ہی لوگوں میں سے ہیں۔ اللہ کی قسم! میرے لیے رسول اللہ صلی اللہ علیہ وسلم کا یہ ایک کلمہ سرخ اونٹوں سے زیادہ محبوب ہے۔",
          "fr": "Rapporté par `Amr bin Taghlib : On a apporté des biens ou quelque chose au Messager d’Allah (ﷺ) et il les a distribués. Il en a donné à certains hommes et ignoré d’autres. Plus tard, il a appris que ceux qu’il avait ignorés l’avaient critiqué. Alors il a glorifié et loué Allah et a dit : « Amma ba'du. Par Allah, il m’arrive de donner à un homme et d’en ignorer un autre, même si celui que j’ignore m’est plus cher que celui à qui je donne. Mais je donne à certains parce que je sens qu’ils n’ont pas de patience ni de satisfaction dans leur cœur, et je laisse ceux qui sont patients et satisfaits du bien et de la richesse qu’Allah a mis dans leur cœur, et `Amr bin Taghlib est l’un d’eux. » `Amr a ajouté : Par Allah ! Ces paroles du Messager d’Allah me sont plus chères que les plus beaux chameaux rouges",
          "id": "Telah menceritakan kepada kami [Muhammad bin Ma'mar] berkata, telah menceritakan kepada kami [Abu 'Ashim] dari [Jarir bin Hazim] berkata, aku mendengar [Al Hasan] berkata, telah menceritakan kepada kami ['Amru bin Taghlib], bahwa Rasulullah shallallahu 'alaihi wasallam pernah diberi hadiah berupa harta atau tawanan wanita, beliau lalu membagi-bagikannya. Ada orang yang diberi dan ada yang tidak. Kemudian sampai berita kepada beliau bahwa orang-orang yang tidak diberi, mereka mencela (beliau). Maka mengucapkan puja dan puji kepada Allah lalu bersabda: \"Amma ba'du. Demi Allah, memang aku telah memberi seseorang dan tidak kepada yang lain. Orang yang tidak aku beri sesungguhnya lebih aku cintai daripada orang yang aku beri. Namun aku memberi sekelompok kaum karena aku melihat hati-hati mereka masih sangat bersedih dan punya rasa takut. Dan aku biarkan sekelompok orang karena Allah telah menjadikan hati-hati mereka penuh dengan perasaan cukup dan penuh kebaikan. Di antara mereka adalah 'Amru bin Taghlib.\" 'Amru bin Taghlib berkata, \"Demi Allah, tidak ada yang lebih aku sukai dari unta yang paling baik dibandingkan ucapan Rasulullah shallallahu 'alaihi wasallam kepadaku tadi.\" Hadits ini dikuatkan oleh [Yunus]",
          "tr": "Amr İbn Tağlib (r.a.)'den nakledilmiştir: \"Bir defasında Resûlullah (Sallallahu Aleyhi ve Sellem)'e Bahreyn'den bir miktar mal getirilmişti. Resûl-i Ekrem s.a.v. bu malları insanlara dağıtmış, fakat bazılarına hiçbir şey vermemişti. Daha sonra kendilerine pay vermediği kimselerin ileri geri konuştuklarından haberdar olunca onlara hitap etme ihtiyacı duydu ve Allah'a hamd ve sena ettikten sonra şöyle dedi: \"Şimdi asıl konuya gelelim, Allah'a yeminle söylüyorum ki ben bazen birilerine böyle mal veririm, fakat herhangi bir bağışta bulunmadığım ve kendisine mal vermediğim kişileri onlardan daha çok severim. İşte ben bazı insanlara çok sabırsız bir yaratılışta olduklarını ve herhangi bir lütuf olmadığında hemen feryadı bastıklarını bildiğim için böyle ikramda bulunuyorum. Buna karşılık Allah Teâlâ'nm kalplerini hayırla doldurduğu ve gönüllerinde mala karşı tutku bırakmadığı (Allah'tan başka hiç kimseye muhtaç olmama duygusu var ettiği) kimseleri bu özelliklerine ısmarlıyorum. İşte Amr İbn Tağlib bunlar arasındadır.\" Amr İbn Tağlib şöyle demiştir: \"Allah'a yemin ederim ki, Resûlullah Sallallahu Aleyhi ve Sellem'in bu sözünü kızıl deve sürülerine sahip olmaya (dünyalara) değişmem. Tekrar: 3145 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 47
      },
      "narrator": {
        "en": "`Amr bin Taghlib"
      }
    },
    {
      "hadithNumber": 924,
      "arabicNumber": 924,
      "book": 11,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ ذَاتَ لَيْلَةٍ مِنْ جَوْفِ اللَّيْلِ، فَصَلَّى فِي الْمَسْجِدِ، فَصَلَّى رِجَالٌ بِصَلاَتِهِ فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ فَصَلَّوْا مَعَهُ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنَ اللَّيْلَةِ الثَّالِثَةِ، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّوْا بِصَلاَتِهِ، فَلَمَّا كَانَتِ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ حَتَّى خَرَجَ لِصَلاَةِ الصُّبْحِ، فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ، فَتَشَهَّدَ ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ فَإِنَّهُ لَمْ يَخْفَ عَلَىَّ مَكَانُكُمْ، لَكِنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ فَتَعْجِزُوا عَنْهَا ‏\"‏‏.‏ تَابَعَهُ يُونُسُ‏.‏",
        "translations": {
          "en": "Narrated Aisha:Once in the middle of the night Allah's Messenger (ﷺ) went out and prayed in the mosque and some men prayed with him. The next morning the people spoke about it and so more people gathered and prayed with him (in the second night). They circulated the news in the morning, and so, on the third night the number of people increased greatly. Allah's Messenger (ﷺ) came out and they prayed behind him. On the fourth night the mosque was overwhelmed by the people till it could not accommodate them. Allah's Messenger (ﷺ) came out only for the Fajr prayer and when he finished the prayer, he faced the people and recited \"Tashah-hud\" (I testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle), and then said, \"Amma ba'du. Verily your presence (in the mosque at night) was not hidden from me, but I was afraid that this prayer (Prayer of Tahajjud) might be made compulsory and you might not be able to carry it out",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ ہم سے لیث نے عقیل سے بیان کیا، ان سے ابن شہاب نے، انہوں نے کہا کہ مجھے عروہ نے خبر دی کہ عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے رات کے وقت اٹھ کر مسجد میں نماز پڑھی اور چند صحابہ بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھنے کھڑے ہو گئے۔ صبح کو ان صحابہ ( رضوان اللہ علیہم اجمعین ) نے دوسرے لوگوں سے اس کا ذکر کیا چنانچہ ( دوسرے دن ) اس سے بھی زیادہ جمع ہو گئے اور آپ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی۔ دوسری صبح کو اس کا چرچا اور زیادہ ہوا پھر کیا تھا تیسری رات بڑی تعداد میں لوگ جمع ہو گئے اور جب رسول اللہ صلی اللہ علیہ وسلم اٹھے تو صحابہ رضی اللہ عنہم نے آپ صلی اللہ علیہ وسلم کے پیچھے نماز شروع کر دی۔ چوتھی رات جو آئی تو مسجد میں نمازیوں کی کثرت سے تل رکھنے کی بھی جگہ نہیں تھی۔ لیکن آج رات نبی کریم صلی اللہ علیہ وسلم نے یہ نماز نہ پڑھائی اور فجر کی نماز کے بعد لوگوں سے فرمایا، پہلے آپ نے کلمہ شہادت پڑھا پھر فرمایا۔ «امابعد» ! مجھے تمہاری اس حاضری سے کوئی ڈر نہیں لیکن میں اس بات سے ڈرا کہ کہیں یہ نماز تم پر فرض نہ کر دی جائے، پھر تم سے یہ ادا نہ ہو سکے۔ اس روایت کی متابعت یونس نے کی ہے۔",
          "fr": "Rapporté par Aisha : Une nuit, au milieu de la nuit, le Messager d’Allah (ﷺ) est sorti et a prié dans la mosquée, et quelques hommes ont prié avec lui. Le lendemain matin, les gens en ont parlé, alors plus de personnes se sont rassemblées et ont prié avec lui la deuxième nuit. La nouvelle s’est répandue le matin, et la troisième nuit, il y avait encore plus de monde. Le Messager d’Allah (ﷺ) est sorti et ils ont prié derrière lui. La quatrième nuit, la mosquée était tellement pleine qu’elle ne pouvait plus contenir tout le monde. Le Messager d’Allah (ﷺ) n’est sorti que pour la prière du Fajr, et quand il a terminé, il s’est tourné vers les gens et a récité le “Tashah-hud” (J’atteste qu’il n’y a de dieu qu’Allah et que Muhammad est Son Messager), puis il a dit : « Amma ba'du. Votre présence (dans la mosquée la nuit) ne m’a pas échappé, mais j’ai eu peur que cette prière (la prière de Tahajjud) ne devienne obligatoire et que vous ne puissiez pas l’accomplir. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah mengabarkan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku ['Urwah] bahwa ['Aisyah] radliallahu 'anha mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam pada suatu malam keluar di tengah malam untuk melaksanakan shalat di masjid, orang-orang kemudian mengikuti beliau dan shalat dibelakangnya. Pada waktu paginya orang-orang membicarakan kejadian tersebut. Kemudian pada malam berikutnya orang-orang yang berkumpul bertambah banyak lalu ikut shalat dengan Beliau. Dan pada waktu paginya orang-orang kembali membicarakan kejadian tersebut. Kemudian pada malam yang ketiga orang-orang yang hadir di masjid semakin bertambah banyak lagi, lalu Rasulullah shallallahu 'alaihi wasallam keluar untuk shalat dan mereka shalat bersama beliau. Kemudian pada malam yang keempat, masjid sudah penuh dengan jama'ah hingga akhirnya beliau keluar hanya untuk shalat Shubuh. Setelah beliau selesai shalat Fajar, beliau menghadap kepada orang banyak membaca syahadat lalu bersabda: \"Amma ba'du, sesungguhnya aku bukannya tidak tahu keberadaan kalian (semalam). Akan tetapi aku takut shalat tersebut akan diwajibkan atas kalian, sementara kalian tidak mampu.\" Abu 'Abdullah Al Bukhari berkata, \"Hadits ini dikuatkan oleh [Yunus]",
          "tr": "Urve İbn Zübeyr'den nakledildiğine göre Aişe (Radiyallahu Anha) şöyle demiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem bir gece yarısı mescide çıkıp namaz kılmaya başladı ve ashab'dan bir kısmı da ona uyarak namaz kıldı. Sabah olduğunda namaz kılan sahâbîler gece olup bitenleri arkadaşlarına anlattılar ve o gece daha fazla kişi mescide toplanıp Resûlullah Sallallahu Aleyhi ve Sellem ile birlikte namaz kıldı. O gecenin sabahında olup bitenleri öğrenen diğer sahâbîler de mescide gelince üçüncü gecede epey cemaat birikmiş oldu. Nebi Sallallahu Aleyhi ve Sellem yine çıkıp aynı şekilde namazını kılmaya koyuldu. Dördüncü gecede artık mescid tıklım tıklım olduğu için ashabın bir kısmı dışarıda kalmıştı. Bu yüzden Resûlullah (Sallallahu aleyhi ve Sellem) ancak sabah namazı için mescide çıkabildi. Sabah namazını bitirince cemaate döndü ve şehadet getirdikten sonra şöyle buyurdu: Esas konuya gelince, sizin bu istek ve arzunuzun bana gizli kaldığını sanmayın. Ancak ben böyle devam ederseniz bu namazın size farz kıhnabileceğinden ve ondan sonra sizin bu namazı kılmakta gevşeklik göstereceğinizden endişe ediyorum"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 48
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 925,
      "arabicNumber": 925,
      "book": 11,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَشِيَّةً بَعْدَ الصَّلاَةِ، فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ أَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ الْعَدَنِيُّ عَنْ سُفْيَانَ فِي أَمَّا بَعْدُ‏.‏",
        "translations": {
          "en": "Narrated Abu Hummaid As-Sa`idi:One night Allah's Messenger (ﷺ) stood up after the prayer and recited \"Tashah-hud\" and then praised Allah as He deserved and said, \"Amma ba'du",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہمیں شعیب نے زہری سے خبر دی، انہوں نے کہا کہ مجھے عروہ نے ابو حمید ساعدی رضی اللہ عنہ سے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نماز عشاء کے بعد کھڑے ہوئے۔ پہلے آپ نے کلمہ شہادت پڑھا، پھر اللہ تعالیٰ کے لائق اس کی تعریف کی، پھر فرمایا «امابعد» ! زہری کے ساتھ اس روایت کی متابعت ابومعاویہ اور ابواسامہ نے ہشام سے کی، انہوں نے اپنے والد عروہ سے اس کی روایت کی، انہوں نے ابوحمید سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا «امابعد» ! اور ابوالیمان کے ساتھ اس حدیث کو محمد بن یحییٰ نے بھی سفیان سے روایت کیا۔ اس میں صرف «امابعد» ہے۔",
          "fr": "Rapporté par Abu Hummaid As-Sa`idi : Une nuit, le Messager d’Allah (ﷺ) s’est levé après la prière, a récité le “Tashah-hud”, puis a loué Allah comme il le mérite et a dit : « Amma ba'du. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Urwah] dari [Abu Humaid As Sa'idi] bahwasanya dia mengabarkan kepadanya, bahwa setelah melaksanakan shalat di awal malam (Isya) Rasulullah shallallahu 'alaihi wasallam berdiri, lalu membaca syahadah dan puja pujnya kepada Allah dengan pujian yang layak (bagi Allah), beliau lalu mengucapkan: \"Amma ba'du.\" Hadits ini dikuatkan oleh [Abu Mu'awiyyah] dan [Abu Usamah] dari [Hisyam] dari [Bapaknya] dari [Abu Humaid As Sa'idi] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Amma ba'du.\" Dikuatkan juga oleh [Al 'Adani] dari [Sufyan] tentang ucapan 'Amma ba'du",
          "tr": "Urve, Ebû Humeyd es-Sâidî'nin kendisine şu bilgiyi haber verdiğini söylemiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem Öğleden sonra bir namazın ardında ayağa kalktı ve şehadet getirip Allah Teâlâ'ya hamd ve sena ettikten sonra şöyl dedi: Emma ba'du.. (bunlardan sonra...-Esas konuya gelince-). Tekrar: 1500, 2597, 6636, 6979, 7174 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 49
      },
      "narrator": {
        "en": "Abu Hummaid As-Sa`idi"
      }
    },
    {
      "hadithNumber": 926,
      "arabicNumber": 926,
      "book": 11,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَمِعْتُهُ حِينَ تَشَهَّدَ يَقُولُ ‏ \"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ‏.‏",
        "translations": {
          "en": "Narrated Al-Miswar bin Makhrama:Once Allah's Messenger (ﷺ) got up for delivering the Khutba and I heard him after \"Tashah-hud\" saying \"Amma ba'du",
          "ur": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی، کہا کہ مجھ سے علی بن حسین نے مسور بن مخرمہ رضی اللہ عنہما سے حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم کھڑے ہوئے۔ میں نے سنا کہ کلمہ شہادت کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا «امابعد» ! شعیب کے ساتھ اس روایت کی متابعت محمد بن ولید زبیدی نے زہری سے کی ہے۔",
          "fr": "Rapporté par Al-Miswar bin Makhrama : Un jour, le Messager d’Allah (ﷺ) s’est levé pour faire le sermon et je l’ai entendu, après le “Tashah-hud”, dire : « Amma ba'du. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Ali bin Husain] dari [Al Miswar bin Makhramah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri, lalu ketika beliau mengucapkan syahadat, aku mendengar beliau mengucapkan: 'Amma ba'du'.\" Hadits ini dikuatkan oleh [Az Zubaidi] dari [Az Zuhri]",
          "tr": "Misver İbn Mahreme şöyle demiştir: \"Resûl-i Ekrem Sallallahu Aleyhi ve Sellem ayağa kalkmıştı ve ben onun şehadet getirdikten sonra: \" Emma ba'du (bunlardan sonra...-Esas konuya gelince-). dediğini işitmiştim. Tekrar: 3110, 3714, 3729, 3767, 5230 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 50
      },
      "narrator": {
        "en": "Al-Miswar bin Makhrama"
      }
    },
    {
      "hadithNumber": 927,
      "arabicNumber": 927,
      "book": 11,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، قَالَ حَدَّثَنَا ابْنُ الْغَسِيلِ، قَالَ حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ صَعِدَ النَّبِيُّ صلى الله عليه وسلم الْمِنْبَرَ وَكَانَ آخِرَ مَجْلِسٍ جَلَسَهُ مُتَعَطِّفًا مِلْحَفَةً عَلَى مَنْكِبَيْهِ، قَدْ عَصَبَ رَأْسَهُ بِعِصَابَةٍ دَسِمَةٍ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَيُّهَا النَّاسُ إِلَىَّ ‏\"‏‏.‏ فَثَابُوا إِلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّ هَذَا الْحَىَّ مِنَ الأَنْصَارِ يَقِلُّونَ، وَيَكْثُرُ النَّاسُ، فَمَنْ وَلِيَ شَيْئًا مِنْ أُمَّةِ مُحَمَّدٍ صلى الله عليه وسلم فَاسْتَطَاعَ أَنْ يَضُرَّ فِيهِ أَحَدًا أَوْ يَنْفَعَ فِيهِ أَحَدًا، فَلْيَقْبَلْ مِنْ مُحْسِنِهِمْ، وَيَتَجَاوَزْ عَنْ مُسِيِّهِمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:Once the Prophet (ﷺ) ascended the pulpit and it was the last gathering in which he took part. He was covering his shoulder with a big cloak and binding his head with an oily bandage. He glorified and praised Allah and said, \"O people! Come to me.\" So the people came and gathered around him and he then said, \"Amma ba'du.\" \"From now onward the Ansar will decrease and other people will increase. So anybody who becomes a ruler of the followers of Muhammad and has the power to harm or benefit people then he should accept the good from the benevolent amongst them (Ansar) and overlook the faults of their wrong-doers",
          "ur": "ہم سے اسماعیل بن ابان نے بیان کیا، انہوں نے کہا کہ ہم سے ابن غسیل عبدالرحمٰن بن سلیمان نے بیان کیا، انہوں نے کہا کہ ہم سے عکرمہ نے ابن عباس رضی اللہ عنہما کے واسطے سے بیان کیا، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم منبر پر تشریف لائے۔ منبر پر یہ آپ کی آخری بیٹھک تھی۔ آپ دونوں شانوں سے چادر لپیٹے ہوئے تھے اور سر مبارک پر ایک پٹی باندھ رکھی تھی۔ آپ نے حمد و ثنا کے بعد فرمایا لوگو! میری بات سنو۔ چنانچہ لوگ آپ کی طرف کلام مبارک سننے کے لیے متوجہ ہو گئے۔ پھر آپ نے فرمایا «امابعد» ! یہ قبیلہ انصار کے لوگ ( آنے والے دور میں ) تعداد میں بہت کم ہو جائیں گے پس محمد صلی اللہ علیہ وسلم کی امت کا جو شخص بھی حاکم ہو اور اسے نفع و نقصان پہنچانے کی طاقت ہو تو انصار کے نیک لوگوں کی نیکی قبول کرے اور ان کے برے کی برائی سے درگزر کرے۔",
          "fr": "Rapporté par Ibn `Abbas : Un jour, le Prophète (ﷺ) est monté sur la chaire, c’était la dernière assemblée à laquelle il a participé. Il portait un grand manteau sur l’épaule et avait la tête bandée. Il a glorifié et loué Allah et a dit : « Ô gens ! Venez vers moi. » Les gens sont venus et se sont rassemblés autour de lui, puis il a dit : « Amma ba'du. À partir de maintenant, les Ansar vont diminuer et les autres augmenter. Donc, toute personne qui devient chef parmi les musulmans et a le pouvoir de faire du bien ou du mal, qu’il accepte le bien des bienfaisants parmi les Ansar et qu’il pardonne les erreurs de ceux qui se trompent parmi eux. »",
          "id": "Telah menceritakan kepada kami [Isma'il bin Aban] berkata, telah menceritakan kepada kami [Ibnu Al Ghasil] berkata, telah menceritakan kepada kami ['Ikrimah] dari [Ibnu 'Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam menaiki mimbar -yang merupakan kali terakhir beliau duduk di situ- dalam keadaan berselimut yang diletakkannya di atas kedua pundaknya dan mengikat kepalanya dengan ikat kepala berwarna hitam. Setelah memuji Allah dan mensucikan-Nya, beliau bersabda: \"Amma ba'du, wahai sekalian manusia berkumpullah di hadapanku.\" Maka orang-orang berkumpul mengelilingi beliau. Kemudian beliau melanjutkan: \"Amma ba'du, sesungguhnya orang yang masih hidup dari kalangan Anshar semakin sedikit, sedangkan orang-orang lain (selain Anshar) terus bertambah banyak. Maka barangsiapa mengurus sesuatu dari urusan ummat Muhammad lalu dia mampu mendatangkan madlarat kepada seseorang atau memberi manfaat kepada seseorang, maka terimalah orang-orang baik mereka (kaum Anshar) dan maafkanlah orang yang keliru dari kalangan mereka",
          "tr": "İbn Abbas (r.a.) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem bir gün minbere çıkmıştı. Onu minberde gördüğümüz son gün de o gün olmuştu. Sır­tında omuzlarını örten bir rida (hırka) vardı ve büyükçe bir izar kuşanmıştı. Başına da boz bir sarık sarmıştı. Minberin üzerinde Allah Teâlâ'ya hamd ve sena ettikten sonra \"Ey insanlar bana iyice yaklaşın!\" dedi. Ashâb Nebi Sallallahu Aleyhi ve Sellem'e yaklaşınca onlara şu tavsiyelerde bulundu: \"emma ba’du (Esas konuya gelelim), işte ensârdan olan şu grup gün gelecek iyice azalacak ve diğerlerinin nüfusu artacak. Kim Muhammed ümmetinin herhangi bir işini üstlenir ve insanlara faydası veya zararı dokunabilecek bir konumda olursa iyi insanların güzelliklerini kabul edip taltifte (bulunsun), kötüleri de affetsin. Tekrar: 3627 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 51
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 928,
      "arabicNumber": 928,
      "book": 11,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ خُطْبَتَيْنِ يَقْعُدُ بَيْنَهُمَا‏.‏",
        "translations": {
          "en": "Narrated `Abdullah Ibn `Umar:The Prophet (ﷺ) used to deliver two Khutbas and sit in between them",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے بشر بن مفضل نے بیان کیا، کہا کہ ہم سے عبیداللہ عمری نے نافع سے بیان کیا، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم ( جمعہ میں ) دو خطبے دیتے اور دونوں کے بیچ میں بیٹھتے تھے۔ ( خطبہ جمعہ کے بیچ میں یہ بیٹھنا بھی مسنون طریقہ ہے ) ۔",
          "fr": "Rapporté par `Abdullah Ibn `Umar : Le Prophète (ﷺ) faisait deux sermons et s’asseyait entre les deux",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Bisyir bin Al Mufadldlal] berkata, telah menceritakan kepada kami ['Ubaidullah bin 'Umar] dari [Nafi'] dari ['Abdullah bin 'Umar] radliallahu 'anhuma, ia berkata, \"Nabi shallallahu 'alaihi wasallam berkhuthbah dengan dua kali khuthbah dan duduk di antara keduanya",
          "tr": "Abdullah İbn Mes'ud (Radiyallahu Anh) şöyle demiştir: \"Resûlullah Sallallahu Aleyhi ve Sellem hutbe okurdu ve bunların arasında bir süre otururdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 52
      },
      "narrator": {
        "en": "`Abdullah Ibn `Umar"
      }
    },
    {
      "hadithNumber": 929,
      "arabicNumber": 929,
      "book": 11,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ، وَقَفَتِ الْمَلاَئِكَةُ عَلَى باب الْمَسْجِدِ يَكْتُبُونَ الأَوَّلَ فَالأَوَّلَ، وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِي يُهْدِي بَدَنَةً، ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً، ثُمَّ كَبْشًا، ثُمَّ دَجَاجَةً، ثُمَّ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ طَوَوْا صُحُفَهُمْ، وَيَسْتَمِعُونَ الذِّكْرَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"When it is a Friday, the angels stand at the gate of the mosque and keep on writing the names of the persons coming to the mosque in succession according to their arrivals. The example of the one who enters the mosque in the earliest hour is that of one offering a camel (in sacrifice). The one coming next is like one offering a cow and then a ram and then a chicken and then an egg respectively. When the Imam comes out (for Jumua prayer) they (i.e. angels) fold their papers and listen to the Khutba",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا کہ ہم سے محمد بن عبدالرحمٰن بن ابی ذئب نے بیان کیا، ان سے زہری نے، ان سے ابوعبداللہ سلیمان اغر نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب جمعہ کا دن آتا ہے تو فرشتے جامع مسجد کے دروازے پر آنے والوں کے نام لکھتے ہیں، سب سے پہلے آنے والا اونٹ کی قربانی دینے والے کی طرح لکھا جاتا ہے۔ اس کے بعد آنے والا گائے کی قربانی دینے والے کی طرح پھر مینڈھے کی قربانی کا ثواب رہتا ہے۔ اس کے بعد مرغی کا، اس کے بعد انڈے کا۔ لیکن جب امام ( خطبہ دینے کے لیے ) باہر آ جاتا ہے تو یہ فرشتے اپنے دفاتر بند کر دیتے ہیں اور خطبہ سننے میں مشغول ہو جاتے ہیں۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Le vendredi, les anges se tiennent à la porte de la mosquée et inscrivent les noms des personnes qui arrivent, selon leur ordre d’arrivée. Celui qui entre le plus tôt est comme s’il offrait un chameau en sacrifice. Le suivant est comme s’il offrait une vache, puis un bélier, puis une poule, puis un œuf. Quand l’imam sort pour la prière du vendredi, ils (les anges) ferment leurs registres et écoutent le sermon. »",
          "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Abu 'Abdullah Al Aghar] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Pada hari Jum'at para Malaikat hadir di pintu Masjid mencatat siapa orang yang datang paling awal dan seterusnya. Orang yang paling awal datang ke Masjid seperti orang yang berkurban dengan seekor unta, kemudian seperti orang yang berkurban dengan seekor sapi, kemudian seperti orang yang berkurban seekor kambing yang bertanduk, kemudian seperti orang yang berkurban seekor ayam, kemudian seperti orang yang berkurban sebutir telur. Dan apabila Imam sudah keluar (untuk memberi khutbah), maka para Malaikat menutup buku catatan mereka kemudian mendengarkan dzikir (khutbah)",
          "tr": "Ebu Hureyre (Radiyallahu Anh), Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmİştir: \"Cum'a günü olduğunda melekler mescidin kapısına dizilir ve ilk olarak gelenlerden itibaren sırayla gelen cemaati yazarlar. Namaza erken gelen kimseler sanki bir deveyi Allah yolunda kurban etmiş gibi sevap alırlar. Onlardan sonra gelenler bir sığırı, daha sonra gelenler bir koçu, ardından gelenler bir tavuğu ve en sona gelenler bir yumurtayı Allah yolunda tasadduk etmiş gibi sevap alırlar. İmam (hutbe için) çıktığında melekler kayıtları tuttukları defterleri kaldınrlar ve okunan zikri dinlemeye başlarlar. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 53
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 930,
      "arabicNumber": 930,
      "book": 11,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ جَاءَ رَجُلٌ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏\"‏ أَصَلَّيْتَ يَا فُلاَنُ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ قُمْ فَارْكَعْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:A person entered the mosque while the Prophet (ﷺ) was delivering the Khutba on a Friday. The Prophet (ﷺ) said to him, \"Have you prayed?\" The man replied in the negative. The Prophet (ﷺ) said, \"Get up and pray two rak`at",
          "ur": "ہم سے ابوالنعمان نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے عمرو بن دینار نے، ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ایک شخص آیا نبی کریم صلی اللہ علیہ وسلم جمعہ کا خطبہ دے رہے تھے۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ اے فلاں! کیا تم نے ( تحیۃ المسجد کی ) نماز پڑھ لی۔ اس نے کہا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا اچھا اٹھ اور دو رکعت نماز پڑھ لے۔",
          "fr": "Rapporté par Jabir bin `Abdullah : Un homme est entré dans la mosquée pendant que le Prophète (ﷺ) faisait le sermon un vendredi. Le Prophète (ﷺ) lui a dit : « As-tu prié ? » L’homme a répondu non. Le Prophète (ﷺ) lui a dit : « Lève-toi et prie deux rak`at. »",
          "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru bin Dinar] dari [Jabir bin 'Abdullah] berkata, \"Seorang laki-laki datang saat Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah di hadapan orang banyak pada hari Jum'at. Beliau lalu bertanya: \"Wahai fulan, apakah kamu sudah shalat?\" Orang itu menjawab, \"Belum.\" Maka beliau bersabda: \"Bangun dan shalatlah dua rakaat",
          "tr": "Cabir bin Abdullah r.a. dediki: Nebi Sallallahu Aleyhi ve Sellem cum`a günü hutbe îrad buyururken biri mescide geldi: (Resûlullâh sallallahu aleyhi ve sellem:) \"Filan, sen namaz kıldın mı?\" diye sordu. O da \"Hayır\" dedi. (Bunun üzerine:) \"(Öyle ise) kalk da namaz kıl\" buyurdu. Tekrar: 931 ve 1166. Diğer tahric: Nesaî, Cum’a; Tirmizi, Cuma"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 54
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 931,
      "arabicNumber": 931,
      "book": 11,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، قَالَ دَخَلَ رَجُلٌ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ أَصَلَّيْتَ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَصَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Jabir:A man entered the Mosque while the Prophet (ﷺ) was delivering the Khutba. The Prophet (ﷺ) said to him, \"Have you prayed?\" The man replied in the negative. The Prophet (ﷺ) said, \"Pray two rak`at",
          "ur": "ہم سے علی بن عبداللہ نے بیان کیا، کہا کہ ہم سے سفیان بن عیینہ نے عمرو سے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے سنا کہ ایک شخص جمعہ کے دن مسجد میں آیا۔ نبی کریم صلی اللہ علیہ وسلم خطبہ پڑھ رہے تھے۔ آپ صلی اللہ علیہ وسلم نے اس سے پوچھا کہ کیا تم نے ( تحیۃ المسجد کی ) نماز پڑھ لی ہے؟ آنے والے نے جواب دیا کہ نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اٹھو اور دو رکعت نماز ( تحیۃ المسجد ) پڑھ لو۔",
          "fr": "Rapporté par Jabir : Un homme est entré dans la mosquée pendant que le Prophète (ﷺ) faisait le sermon. Le Prophète (ﷺ) lui a dit : « As-tu prié ? » L’homme a répondu non. Le Prophète (ﷺ) lui a dit : « Prie deux rak`at. »",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] berkata, telah menceritakan kepada kami [Sufyan] dari ['Amru] bahwa dia telah mendengar [Jabir] berkata, \"Pada hari Jum'at seorang laki-laki datang ketika Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah. Beliau lalu bertanya: \"Apakah kamu sudah shalat?\" Orang itu menjawab, \"Belum.\" Maka beliau pun bersabda: \"Bangun dan shalatlah dua rakaat",
          "tr": "Amr, Câbir İbn Abdullah (r.a.)'ın şöyle dediğini nakletmektedir: \"Bir Cuma günü Resûl-i Ekrem Sallallahu Aleyhi ve Sellem hutbe okurken ashaptan bîViSi mescide girdi. Nebi Sallallahu Aleyhi ve Sellem ona; \"Namaz kıldın mı?\" diye sordu. Adam kılmadığını söyleyince Resûlullah Sallallahu Aleyhi ve Sellem ona: \"Haydi kalk ve iki rekat namaz kıl\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 55
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 932,
      "arabicNumber": 932,
      "book": 11,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ،‏.‏ وَعَنْ يُونُسَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ، هَلَكَ الْكُرَاعُ، وَهَلَكَ الشَّاءُ، فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا‏.‏ فَمَدَّ يَدَيْهِ وَدَعَا‏.‏",
        "translations": {
          "en": "Narrated Anas:While the Prophet (ﷺ) was delivering the Khutba on a Friday, a man stood up and said, \"O, Allah's Apostle! The livestock and the sheep are dying, so pray to Allah for rain.\" So he (the Prophet) raised both his hands and invoked Allah (for it)",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا، ان سے عبد العزیز بن انس نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے (دوسری سند) اور حماد بن یونس سے بھی روایت کی عبدالعزیز اور یونس دونوں نے ثابت سے، انہوں نے انس رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم جمعہ کا خطبہ دے رہے تھے کہ ایک شخص کھڑا ہو گیا اور عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم مویشی اور بکریاں ہلاک ہو گئیں ( بارش نہ ہونے کی وجہ سے ) آپ دعا فرمائیں کہ اللہ تعالیٰ بارش برسائے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے دونوں ہاتھ پھیلائے اور دعا کی۔",
          "fr": "Rapporté par Anas : Pendant que le Prophète (ﷺ) faisait le sermon un vendredi, un homme s’est levé et a dit : « Ô Messager d’Allah ! Les troupeaux et les moutons meurent, alors prie Allah pour la pluie. » Le Prophète (ﷺ) a alors levé les deux mains et a invoqué Allah",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari ['Abdul 'Aziz bin Shuhaib] dari [Anas] dan dari [Yunus] dari [Tsabit] dari [Anas] berkata, \"Ketika Nabi shallallahu 'alaihi wasallam sedang menyampaikan khutbah pada hari Jum'at, tiba-tiba ada seorang laki-laki berdiri dan berkata, \"Wahai Rasulullah, telah binasa binatang ternak (unta) dan telah binasa kehidupan (telah menjadi sulit), maka berdo'alah kepada Allah agar menurunkan air untuk kami.\" Rasulullah lalu menengadahkan kedua telapak tangan dan berdo'a",
          "tr": "Enes İbn Mâlik (r.a.) şöyle dedi: \"Resûlullah Sallallahu Aleyhi ve Sellem bîr Cum'a günü hutbe okurken bir adam kalkıp şunları söyledi: \"Ey Allah'ın Resulü, at sürüleri mahvoldu, davarlar susuzluktan kırıldı; Allah'a dua et de bize yağmur göndersin\". Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem, ellerini açıp dua etti. Tekrar: 933, 1013-1019, 1021, 1029, 1030, 3582, 6093 ve 6342 باب: الاستسقاء في الخطبة يوم الجمعة. 35. Cuma Günü Hutbede İken Yağmur Duası Etmek"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 56
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 933,
      "arabicNumber": 933,
      "book": 11,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا أَبُو عَمْرٍو، قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَصَابَتِ النَّاسَ سَنَةٌ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَبَيْنَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فِي يَوْمِ جُمُعَةٍ قَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ، فَادْعُ اللَّهَ لَنَا‏.‏ فَرَفَعَ يَدَيْهِ، وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً، فَوَالَّذِي نَفْسِي بِيَدِهِ مَا وَضَعَهَا حَتَّى ثَارَ السَّحَابُ أَمْثَالَ الْجِبَالِ، ثُمَّ لَمْ يَنْزِلْ عَنْ مِنْبَرِهِ حَتَّى رَأَيْتُ الْمَطَرَ يَتَحَادَرُ عَلَى لِحْيَتِهِ صلى الله عليه وسلم فَمُطِرْنَا يَوْمَنَا ذَلِكَ، وَمِنَ الْغَدِ، وَبَعْدَ الْغَدِ وَالَّذِي يَلِيهِ، حَتَّى الْجُمُعَةِ الأُخْرَى، وَقَامَ ذَلِكَ الأَعْرَابِيُّ ـ أَوْ قَالَ غَيْرُهُ ـ فَقَالَ يَا رَسُولَ اللَّهِ، تَهَدَّمَ الْبِنَاءُ وَغَرِقَ الْمَالُ، فَادْعُ اللَّهَ لَنَا‏.‏ فَرَفَعَ يَدَيْهِ، فَقَالَ ‏ \"‏ اللَّهُمَّ حَوَالَيْنَا، وَلاَ عَلَيْنَا ‏\"‏‏.‏ فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ مِنَ السَّحَابِ إِلاَّ انْفَرَجَتْ، وَصَارَتِ الْمَدِينَةُ مِثْلَ الْجَوْبَةِ، وَسَالَ الْوَادِي قَنَاةُ شَهْرًا، وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلاَّ حَدَّثَ بِالْجَوْدِ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:Once in the lifetime of the Prophet (ﷺ) the people were afflicted with drought (famine). While the Prophet (ﷺ) was delivering the Khutba on a Friday, a Bedouin stood up and said, \"O, Allah's Messenger (ﷺ)! Our possessions are being destroyed and the children are hungry; Please invoke Allah (for rain)\". So the Prophet (ﷺ) raised his hands. At that time there was not a trace of cloud in the sky. By Him in Whose Hands my soul is as soon as he lowered his hands, clouds gathered like mountains, and before he got down from the pulpit, I saw the rain falling on the beard of the Prophet. It rained that day, the next day, the third day, the fourth day till the next Friday. The same Bedouin or another man stood up and said, \"O Allah's Messenger (ﷺ)! The houses have collapsed, our possessions and livestock have been drowned; Please invoke Allah (to protect us)\". So the Prophet (ﷺ) raised both his hands and said, \"O Allah! Round about us and not on us\". So, in whatever direction he pointed with his hands, the clouds dispersed and cleared away, and Medina's (sky) became clear as a hole in between the clouds. The valley of Qanat remained flooded, for one month, none came from outside but talked about the abundant rain",
          "ur": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا کہ ہم سے ولید بن مسلم نے بیان کیا، انہوں نے کہا کہ ہم سے امام ابوعمرو اوزاعی نے بیان کیا، انہوں نے کہا کہ مجھ سے اسحاق بن عبداللہ بن ابی طلحہ رضی اللہ عنہ نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے کہ ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کے زمانے میں قحط پڑا، آپ صلی اللہ علیہ وسلم خطبہ دے رہے تھے کہ ایک دیہاتی نے کہا یا رسول اللہ! جانور مر گئے اور اہل و عیال دانوں کو ترس گئے۔ آپ ہمارے لیے اللہ تعالیٰ سے دعا فرمائیں۔ آپ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھائے، اس وقت بادل کا ایک ٹکڑا بھی آسمان پر نظر نہیں آ رہا تھا۔ اس ذات کی قسم جس کے ہاتھ میری جان ہے ابھی آپ صلی اللہ علیہ وسلم نے ہاتھوں کو نیچے بھی نہیں کیا تھا کہ پہاڑوں کی طرح گھٹا امڈ آئی اور آپ صلی اللہ علیہ وسلم ابھی منبر سے اترے بھی نہیں تھے کہ میں نے دیکھا کہ بارش کا پانی آپ صلی اللہ علیہ وسلم کے ریش مبارک سے ٹپک رہا تھا۔ اس دن اس کے بعد اور متواتر اگلے جمعہ تک بارش ہوتی رہی۔ ( دوسرے جمعہ کو ) یہی دیہاتی پھر کھڑا ہوا یا کہا کہ کوئی دوسرا شخص کھڑا ہوا اور عرض کی کہ یا رسول اللہ! عمارتیں منہدم ہو گئیں اور جانور ڈوب گئے۔ آپ ہمارے لیے اللہ سے دعا کیجئے۔ آپ صلی اللہ علیہ وسلم نے دونوں ہاتھ اٹھائے اور دعا کی کہ اے اللہ! اب دوسری طرف بارش برسا اور ہم سے روک دے۔ آپ ہاتھ سے بادل کے لیے جس طرف بھی اشارہ کرتے، ادھر مطلع صاف ہو جاتا۔ سارا مدینہ تالاب کی طرح بن گیا تھا اور قناۃ کا نالا مہینہ بھر بہتا رہا اور اردگرد سے آنے والے بھی اپنے یہاں بھرپور بارش کی خبر دیتے رہے۔",
          "fr": "Rapporté par Anas bin Malik : Une fois, du vivant du Prophète (ﷺ), les gens ont souffert de la sécheresse. Pendant que le Prophète (ﷺ) faisait le sermon un vendredi, un bédouin s’est levé et a dit : « Ô Messager d’Allah (ﷺ) ! Nos biens sont détruits et les enfants ont faim ; prie Allah pour la pluie. » Le Prophète (ﷺ) a alors levé les mains. À ce moment-là, il n’y avait pas un nuage dans le ciel. Par Celui qui détient mon âme, à peine avait-il baissé les mains que les nuages se sont formés comme des montagnes, et avant qu’il ne descende de la chaire, j’ai vu la pluie couler sur la barbe du Prophète. Il a plu ce jour-là, le lendemain, le surlendemain, le quatrième jour, jusqu’au vendredi suivant. Le même bédouin ou un autre homme s’est levé et a dit : « Ô Messager d’Allah (ﷺ) ! Les maisons se sont effondrées, nos biens et nos troupeaux sont noyés ; prie Allah pour qu’Il nous protège. » Le Prophète (ﷺ) a alors levé les deux mains et a dit : « Ô Allah ! Autour de nous et non sur nous. » Dans chaque direction où il montrait ses mains, les nuages se sont dispersés, et le ciel de Médine est devenu clair comme un trou entre les nuages. La vallée de Qanat est restée inondée, et pendant un mois, tous ceux qui venaient de l’extérieur parlaient de l’abondance de la pluie",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Abu 'Amru Al Auza'i] berkata, telah menceritakan kepadaku [Ishaq bin 'Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata, \"Pasa masa Nabi shallallahu 'alaihi wasallam manusia tertimpa paceklik. Ketika Nabi shallallahu 'alaihi wasallam sedang memberikan khutbah pada hari Jum'at, tiba-tiba ada seorang Arab badui berdiri dan berkata, \"Wahai Rasulullah, harta benda telah binasa dan telah terjadi kelaparan, maka berdo'alah kepada Allah untuk kami.\" Beliau lalu mengangkat kedua telapak tangan berdoa, dan saat itu kami tidak melihat sedikitpun ada awan di langit. Namun demi Dzat yang jiwaku berada di tangan-Nya, sungguh beliau tidak menurunkan kedua tangannya kecuali gumpalan awan telah datang membumbung tinggi laksana pegunungan. Dan beliau belum turun dari mimbar hingga akhirnya aku melihat hujan turun membasahi jenggot beliau shallallahu 'alaihi wasallam. Maka pada hari itu, keesokan harinya dan lusa kami terus-terusan mendapatkan guyuran hujan dan hari-hari berikutnya hingga hari Jum'at berikutnya. Pada Jum'at berikut itulah orang Arab badui tersebut, atau orang yang lain berdiri seraya berkata, \"Wahai Rasulullah, banyak bangunan yang roboh, harta benda tenggelam dan hanyut, maka berdo'alah kepada Allah untuk kami.\" Beliau lalu mengangkat kedua telapak tangannya dan berdoa: 'ALLAHUMMA HAWAALAINAA WA LAA 'ALAINAA (Ya Allah, turunkanlah hujan di sekeliling kami dan jangan sampai menimbulkan kerusakan kepada kami) '. Belum lagi beliau memberikan isyarat dengan tangannya kepada gumpalan awan, melainkan awan tersebut hilang seketika. Saat itu kota Madinah menjadi seperti danau dan aliran-aliran air, Madinah juga tidak mendapatkan sinar matahari selama satu bulan. Dan tidak seorang pun yang datang dari segala pelosok kota kecuali akan menceritakan tentang terjadinya hujan yang lebat tersebut",
          "tr": "Enes İbn Mâlik (r.a.) şöyle demiştir: Resul-i Ekrem Sallallahu Aleyhi ve Sellem zamanında insanları sıkıntıya sokan bir kıtlık baş göstermişti. İşte o günlerde Nebi Sallallahu Aleyhi ve Sellem bir Cum'a günü hutbe okurken bir bedevi ayağa kalkıp şöyle seslendi: \"Ey Allah'ın Resulü, mallar helak oldu, çoluk çocuk açlıktan perişan bir halde... Allah'a dua et de bizi bu sıkıntılardan kurtarsın.\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ellerini kaldırdı. O sırada gökyüzünde tek bir bulut bile görünmüyordu. Canımı elinde bulunduran Allah'a yemin ederim ki, Resûlullah Sallallahu Aleyhi ve Sellem gökyüzünde heybetli dağlar gibi bulutlar ortaya çıkana kadar ellerini indirmedi ve kendisi de yağmur yağana kadar minberden aşağı inmedi. Hatta ben mübarek sakallarından yağmur damlalarının süzüldüğünü gördüm. Resûl-İ Ekrem Sallallahu Aleyhi ve Sellem'in bu duası hürmetine hem o gün hem de daha sonra gelen günler boyunca ta diğer Cuma'ya kadar yağmur yağdı. Sonraki Cuma'da daha önce Resûiullah Sallallahu Aleyhi ve Sellem'den dua isteyen o bedevi şöyle dedi: \"Ey Allah'ın Resulü, binalar yıkıldı, mallarımız sular altında kaldı. Bizim için Allah'a dua et!\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ellerini kaldırıp şöyle dua etti: \"Allah'ım, çevremize yağdır, üzerimize değil.\" Resûlullah Sallallahu Aleyhi ve Sellem bu şekilde dua edip eliyle gökyüzündeki bulutlara işaret etti ve onun işaret buyurduğu bulutlar hemen açılıverdi; Medine adeta ışıkla aydınlatılmış, üstü açık bir alan gibi oldu. Bu yağmur dolayısıyla bir ay boyunca vadiler sel olup aktı ve civar bölgelerden gelen herkes bolca yağan yağmurun bereketler getirdiğini söyledi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 57
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 934,
      "arabicNumber": 934,
      "book": 11,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قُلْتَ لِصَاحِبِكَ يَوْمَ الْجُمُعَةِ أَنْصِتْ‏.‏ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"When the Imam is delivering the Khutba, and you ask your companion to keep quiet and listen, then no doubt you have done an evil act",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا کہ ہم سے لیث بن سعد نے عقیل سے بیان کیا، ان سے ابن شہاب نے، انہوں نے کہا کہ مجھے سعید بن مسیب نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب امام جمعہ کا خطبہ دے رہا ہو اور تو اپنے پاس بیٹھے ہوئے آدمی سے کہے کہ ”چپ رہ“ تو تو نے خود ایک لغو حرکت کی۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Quand l’imam fait le sermon et que tu demandes à ton voisin de se taire et d’écouter, tu as alors commis une mauvaise action. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu berkata kepada temanmu pada hari Jum'at 'diamlah', padahal Imam sedang memberikan khutbah maka sungguh kamu sudah berbuat sia-sia (tidak mendapat pahala)",
          "tr": "Ebu Hureyre (Radiyallahu Anh) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Cum'a günü imam hutbe okurken yanı başında bulunan kimselere 'Susun!' desen bile boş söz söylemiş olursun"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 58
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 935,
      "arabicNumber": 935,
      "book": 11,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏ \"‏ فِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ، وَهْوَ قَائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ تَعَالَى شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏‏.‏ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) talked about Friday and said, \"There is an hour (opportune time) on Friday and if a Muslim gets it while praying and asks something from Allah, then Allah will definitely meet his demand.\" And he (the Prophet) pointed out the shortness of that time with his hands",
          "ur": "ہم سے عبداللہ بن مسلمہ قعنبی نے امام مالک رحمہ اللہ سے بیان کیا، ان سے ابوالزناد نے، ان سے عبدالرحمٰن اعرج نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعہ کے ذکر میں ایک دفعہ فرمایا کہ اس دن ایک ایسی گھڑی آتی ہے جس میں اگر کوئی مسلمان بندہ کھڑا نماز پڑھ رہا ہو اور کوئی چیز اللہ پاک سے مانگے تو اللہ پاک اسے وہ چیز ضرور دیتا ہے۔ ہاتھ کے اشارے سے آپ نے بتلایا کہ وہ ساعت بہت تھوڑی سی ہے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a parlé du vendredi et a dit : « Il y a une heure (un moment propice) le vendredi, et si un musulman la saisit pendant qu’il prie et demande quelque chose à Allah, alors Allah lui accordera sûrement ce qu’il demande. » Et il a montré avec ses mains que ce moment est très court",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam membicarakan perihal hari Jum'at. Beliau mengatakan: \"Pada hari Jum'at itu ada satu saat, tidaklah seorang hamba Muslim mengerjakan shalat lalu dia berdo'a tepat pada saat tersebut melainkan Allah akan mengabulkan do'anya tersebut.\" Kemudian beliau memberi isyarat dengan tangannya yang menunjukkan sedikitnya saat tersebut",
          "tr": "Ebu Hureyre (r.a.) Resulullah Sallallahu Aleyhi ve Sellem'in Cum'a gününü kasdederek şöyle buyurduğunu nakletmiştir: \"İşte bu günde kısacık bir an vardır ki, Müslüman bir kul o an'a rast gelecek şekilde namaz kılmaya ve dua etmeye muvaffak olur da Allah'tan bir şey dilerse Allah o'na dilediği her şeyi bahşeder.\" Resul-i Ekrem Sallallahu Aleyhi ve Sellem bu zaman'ın çok kısa olduğunu ifade etmek üzere eliyle işaret buyurmuştu. Tekrar: 5294 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 59
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 936,
      "arabicNumber": 936,
      "book": 11,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ حُصَيْنٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، قَالَ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَتْ عِيرٌ تَحْمِلُ طَعَامًا، فَالْتَفَتُوا إِلَيْهَا حَتَّى مَا بَقِيَ مَعَ النَّبِيِّ صلى الله عليه وسلم إِلاَّ اثْنَا عَشَرَ رَجُلاً، فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا‏}‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:While we were praying (Jumua Khutba & prayer) with the Prophet (ﷺ), some camels loaded with food, arrived (from Sham). The people diverted their attention towards the camels (and left the mosque), and only twelve persons remained with the Prophet. So this verse was revealed: \"But when they see Some bargain or some amusement, They disperse headlong to it, And leave you standing",
          "ur": "ہم سے معاویہ بن عمرو نے بیان کیا، کہا کہ ہم سے زائدہ نے حصین سے بیان کیا، ان سے سالم بن ابی جعد نے، انہوں نے کہا کہ ہم سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ رہے تھے، اتنے میں غلہ لادے ہوئے ایک تجارتی قافلہ ادھر سے گزرا۔ لوگ خطبہ چھوڑ کر ادھر چل دیئے۔ نبی کریم صلی اللہ علیہ وسلم کے ساتھ کل بارہ آدمی رہ گئے۔ اس وقت سورۃ الجمعہ کی یہ آیت اتری «وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏» ”اور جب یہ لوگ تجارت اور کھیل دیکھتے ہیں تو اس کی طرف دوڑ پڑتے ہیں اور آپ کو کھڑا چھوڑ دیتے ہیں۔“",
          "fr": "Rapporté par Jabir bin `Abdullah : Pendant que nous faisions la prière du vendredi avec le Prophète (ﷺ), des chameaux chargés de nourriture sont arrivés (de Syrie). Les gens se sont détournés vers les chameaux (et ont quitté la mosquée), et seuls douze personnes sont restées avec le Prophète. Alors ce verset a été révélé : « Mais quand ils voient un commerce ou un divertissement, ils s’y précipitent et te laissent debout. »",
          "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amru] berkata, telah menceritakan kepada kami [Za'idah] dari [Hushain] dari [Salim bin Abu Al Ja'd] berkata, telah menceritakan kepada kami [Jabir bin 'Abdullah] berkata, \"Ketika kami sedang shalat bersama Nabi shallallahu 'alaihi wasallam tiba-tiba datang rombongan dagang yang membawa makanan. Orang-orang pun melirik (dan berhamburan pergi) mendatangi rombongan tersebut, hingga tidak ada orang yang tersisa bersama Nabi shallallahu 'alaihi wasallam kecuali hanya dua belas orang. Maka turunlah ayat ini: '(Dan apabila mereka melihat perdagangan atau permainan, maka mereka bubar untuk menuju kepadanya dan mereka meninggalkan kamu ketika kamu sedang berdiri menyampaikan berkhutbah) ' (Qs. Al Jumu'ah:)",
          "tr": "Câbir İbn Abdullah (r.a.)'ın şöyle dediği nakledilmiştir: \"Biz Resûl-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte namaz kılarken gıda maddesi getiren bir kervan getirildi. Bunun üzerine cemaat (namazı terk edip) kervan'a doğru gitti. O gün geriye Resûlullah Sallallahu Aleyhi ve Sellem ile birlikte sadece on iki kişi kalmıştı. Bunun üzerine \"Onlar bir ticaret veya eğlence gördükleri zaman hemen dağılıp ona doğru giderler ve seni ayakta bırakırlar [Cuma, 11] ayeti indi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 60
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 937,
      "arabicNumber": 937,
      "book": 11,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ، وَبَعْدَهَا رَكْعَتَيْنِ، وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ، وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّي رَكْعَتَيْنِ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) used to pray two rak`at before the Zuhr prayer and two rak`at after it. He also used to pray two rak`at after the Maghrib prayer in his house, and two rak`at after the `Isha' prayer. He never prayed after Jumua prayer till he departed (from the Mosque), and then he would pray two rak`at at home",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے نافع سے خبر دی، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم ظہر سے پہلے دو رکعت، اس کے بعد دو رکعت اور مغرب کے بعد دو رکعت اپنے گھر میں پڑھتے اور عشاء کے بعد دو رکعتیں پڑھتے اور جمعہ کے بعد دو رکعتیں جب گھر واپس ہوتے تب پڑھا کرتے تھے۔",
          "fr": "Rapporté par `Abdullah bin `Umar : Le Messager d’Allah (ﷺ) priait deux rak`at avant la prière du Zuhr et deux rak`at après. Il priait aussi deux rak`at après la prière du Maghrib chez lui, et deux rak`at après la prière de ‘Isha. Il ne priait pas après la prière du vendredi tant qu’il n’était pas rentré chez lui, puis il priait deux rak`at à la maison",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar], bahwa Rasulullah shallallahu 'alaihi wasallam biasa melaksanakan dua rakaat sebelum zhuhur dan dua rakaat sesudahnya, dua rakaat setelag Maghrib di rumahnya, dan dua rakaat sesudah Isya. Dan beliau tidak mengerjakan shalat setelah Jum'at hingga beliau pulang, lalu shalat dua rakaat",
          "tr": "Abdullah İbn Ömer (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem öğle namazından önce ve sonra ikişer rek'at namaz kılardı, akşam namazından sonra ise evinde iki rekat namaz kılardı. Resul-i Ekrem Sallallahu Aleyhi ve Sellem Cum'a namazından çıktıktan sonra mescidde değil evinde iki rek'at namaz kılardı. Tekrar: 1165, 1172 ve 1180 (Cuma suresi 10’a işaret)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 61
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 938,
      "arabicNumber": 938,
      "book": 11,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ كَانَتْ فِينَا امْرَأَةٌ تَجْعَلُ عَلَى أَرْبِعَاءَ فِي مَزْرَعَةٍ لَهَا سِلْقًا، فَكَانَتْ إِذَا كَانَ يَوْمُ جُمُعَةٍ تَنْزِعُ أُصُولَ السِّلْقِ فَتَجْعَلُهُ فِي قِدْرٍ، ثُمَّ تَجْعَلُ عَلَيْهِ قَبْضَةً مِنْ شَعِيرٍ تَطْحَنُهَا، فَتَكُونُ أُصُولُ السِّلْقِ عَرْقَهُ، وَكُنَّا نَنْصَرِفُ مِنْ صَلاَةِ الْجُمُعَةِ فَنُسَلِّمُ عَلَيْهَا، فَتُقَرِّبُ ذَلِكَ الطَّعَامَ إِلَيْنَا فَنَلْعَقُهُ، وَكُنَّا نَتَمَنَّى يَوْمَ الْجُمُعَةِ لِطَعَامِهَا ذَلِكَ‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Sa`d:There was a woman amongst us who had a farm and she used to sow Silq (a kind of vegetable) on the edges of streams in her farm. On Fridays she used to pull out the Silq from its roots and put the roots in a utensil. Then she would put a handful of powdered barley over it and cook it. The roots of the Silq were a substitute for meat. After finishing the Jumua prayer we used to greet her and she would give us that food which we would eat with our hands, and because of that meal, we used to look forward to Friday",
          "ur": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا کہ ہم سے ابوغسان محمد بن مطر مدنی نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے سہل بن سعد کے واسطے سے بیان کیا، انہوں نے بیان کیا کہ ہمارے یہاں ایک عورت تھی جو نالوں پر اپنے ایک کھیت میں چقندر بوتی۔ جمعہ کا دن آتا تو وہ چقندر اکھاڑ لاتیں اور اسے ایک ہانڈی میں پکاتیں پھر اوپر سے ایک مٹھی جو کا آٹا چھڑک دیتیں۔ اس طرح یہ چقندر گوشت کی طرح ہو جاتے۔ جمعہ سے واپسی میں ہم انہیں سلام کرنے کے لیے حاضر ہوتے تو یہی پکوان ہمارے آگے کر دیتیں اور ہم اسے چاٹ جاتے۔ ہم لوگ ہر جمعہ کو ان کے اس کھانے کے آرزومند رہا کرتے تھے۔",
          "fr": "Rapporté par Sahl bin Sa`d : Il y avait une femme parmi nous qui avait un champ et elle cultivait du silq (un type de légume) sur les bords des ruisseaux de son champ. Le vendredi, elle arrachait le silq avec ses racines, mettait les racines dans un récipient, puis ajoutait une poignée d’orge en poudre et faisait cuire le tout. Les racines du silq remplaçaient la viande. Après la prière du vendredi, nous allions la saluer et elle nous donnait ce plat que nous mangions avec nos mains, et grâce à ce repas, nous attendions le vendredi avec impatience",
          "id": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Abu Ghassan] berkata, telah menceritakan kepadaku [Abu Hazim] dari [Sahl bin Sa'd] berkata, \"Di tempat kami ada seorang wanita yang menanam ubi di sela-sela selokan kebunnya. Jika hari Jum'at tiba, dia mencabut pohon ubinya lalu direbusnya dalam periuk yang dicampur dengan segenggam gandum. Rebusan ubi dijadikan sebagai makanan pengganti sepotong daging. Setelah kami selesai melaksanakan shalat Jum'at, kami datang ke rumah wanita itu. Kami masuk mengucapkan salam lalu dia menyuguhkan makanan ubinya itu kepada kami, maka kami pun memakannya. Kami selalu mengharapkan kehadiran hari Jum'at karena ada makanan yang disuguhkannya itu",
          "tr": "Sehl bin Sa'd şöyle demiştir: \"Bizim aramızda bir kadın vardı. Küçük bir dere kenarında ziraatle meşgul olur ve pazı yetiştirirdi. Cuma günleri olduğunda pazıları ayıklar ve saplarını yapraklarından ayırarak bir tencereye atardı. Sonra üzerine bir tutam arpa atıp pişirirdi. Dilim dilim yaparak yemeğe kattığı saplar bize yemeğin eti gibi gelirdi. İşte biz Cum'a namazını kıldıktan sonra ona gider ve selam verirdik. O da hazırlamış olduğu yemeği bize ikram ederdi. Biz, keşke Cuma günü gelse de onun yemeğini yesek, diye temenni ederdik. Tekrarr: 939, 941, 2349, 5403, 6248 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 62
      },
      "narrator": {
        "en": "Sahl bin Sa`d"
      }
    },
    {
      "hadithNumber": 939,
      "arabicNumber": 939,
      "book": 11,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، بِهَذَا وَقَالَ مَا كُنَّا نَقِيلُ وَلاَ نَتَغَدَّى إِلاَّ بَعْدَ الْجُمُعَةِ‏.‏",
        "translations": {
          "en": "Narrated Sahl:As above with the addition: We never had an afternoon nap nor meals except after offering the Jumua prayer",
          "ur": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا کہ ہم سے عبد العزیز بن ابی حازم نے بیان کیا اپنے باپ سے اور ان سے سہل بن سعد نے یہی بیان کیا اور فرمایا کہ دوپہر کا سونا اور دوپہر کا کھانا جمعہ کی نماز کے بعد رکھتے تھے۔",
          "fr": "Rapporté par Sahl : Comme précédemment, avec cette précision : Nous ne faisions jamais la sieste ni ne mangions avant d’avoir accompli la prière du vendredi",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] berkata, telah menceritakan kepada kami [Ibnu Abu Hazim] dari [Bapaknya] dari [Sahl] dengan riwayat seperti di atas, lalu dia berkata, \"Kami tidaklah beristirahat siang maupun makan siang kecuali setelah shalat Jum'at",
          "tr": "Sehl (r.a.) şöyle demiştir: \"Biz Cum'a namazını kılmadıkça öğle uykusuna (kaylûle) yatmadığımız gibi yemek de yemezdik"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 63
      },
      "narrator": {
        "en": "Sahl"
      }
    },
    {
      "hadithNumber": 940,
      "arabicNumber": 940,
      "book": 11,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُقْبَةَ الشَّيْبَانِيُّ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كُنَّا نُبَكِّرُ إِلَى الْجُمُعَةِ ثُمَّ نَقِيلُ‏.‏",
        "translations": {
          "en": "Narrated Anas:We used to offer the Jumua prayer early and then have the afternoon nap",
          "ur": "ہم سے محمد بن عقبہ شیبانی نے بیان کیا، کہا کہ ہم سے ابواسحاق فزاری ابراہیم بن محمد نے بیان کیا، ان سے حمید طویل نے، انہوں نے انس رضی اللہ عنہ سے سنا۔ آپ فرماتے تھے کہ ہم جمعہ سویرے پڑھتے، اس کے بعد دوپہر کی نیند لیتے تھے۔",
          "fr": "Rapporté par Anas : Nous faisions la prière du vendredi tôt, puis nous faisions la sieste de l’après-midi",
          "id": "Telah menceritakan kepada kami [Muhammad bin 'Uqbah 'Asy Syaibani Al Kufi] berkata, telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Humaid] berkata, Aku mendengar [Anas] berkata, \"Kami lebih awal mendatangi shalat Jum'at lalu beristirahat siang (qailulah) setelahnya",
          "tr": "Humeyd, Enes'in şöyle dediğini işittiğini anlatır: \"Biz Cum'a namazını ilk vaktinde kılardık ve daha sonra öğle uykusuna (kaylûle) yatardık"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 64
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 941,
      "arabicNumber": 941,
      "book": 11,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْجُمُعَةَ ثُمَّ تَكُونُ الْقَائِلَةُ‏.‏",
        "translations": {
          "en": "Narrated Sahl:We used to offer the Jumua prayer with the Prophet (ﷺ) and then take the afternoon nap",
          "ur": "ہم سے سعید بن ابی مریم نے بیان کیا، کہا کہ ہم سے ابوغسان نے بیان کیا، کہا کہ مجھ سے ابوحازم نے سہل بن سعد رضی اللہ عنہ سے بیان کیا، انہوں نے بتلایا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے، پھر دوپہر کی نیند لیا کرتے تھے۔",
          "fr": "Rapporté par Sahl : Nous faisions la prière du vendredi avec le Prophète (ﷺ), puis nous faisions la sieste de l’après-midi",
          "id": "Telah menceritakan kepada kami [Sa'id bin Abu Maryam] berkata, telah menceritakan kepada kami [Abu Ghassan] berkata, telah menceritakan kepadaku [Abu Hazim] dari [Sahl bin Sa'd] berkata, \"Kami shalat Jum'at bersama Nabi shallallahu 'alaihi wasallam kemudian kami beristirahat siang (qailulah) setelahnya",
          "tr": "Sehl (Radiyallahu Anh) şöyle demiştir: \"Biz Resûl-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte Cum'a namazını kılardık ve daha sonra öğle uykusuna yatardık.\" CUMA BÖLÜMÜ BİTTİ. KORKU NAMAZI BÖLÜMLERİ BİR SONRAKİ (510.) SAYFA’DA"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 11,
        "hadith": 65
      },
      "narrator": {
        "en": "Sahl"
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "42KB"
  }
}