{
  "collection": "bukhari",
  "book": 58,
  "name": {
    "arabic": "كتاب Jizyah and Mawaada'ah",
    "transliteration": "jizyah and mawaada'ah",
    "translation": "Jizyah and Mawaada'ah"
  },
  "totalHadith": 30,
  "hadithNumberRange": {
    "first": 3157,
    "last": 3189
  },
  "content": [
    {
      "hadithNumber": 3157,
      "arabicNumber": 3157,
      "book": 58,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَمْرًا، قَالَ كُنْتُ جَالِسًا مَعَ جَابِرِ بْنِ زَيْدٍ وَعَمْرِو بْنِ أَوْسٍ، فَحَدَّثَهُمَا بَجَالَةُ، سَنَةَ سَبْعِينَ ـ عَامَ حَجَّ مُصْعَبُ بْنُ الزُّبَيْرِ بِأَهْلِ الْبَصْرَةِ ـ عِنْدَ دَرَجِ زَمْزَمَ قَالَ كُنْتُ كَاتِبًا لِجَزْءِ بْنِ مُعَاوِيَةَ عَمِّ الأَحْنَفِ، فَأَتَانَا كِتَابُ عُمَرَ بْنِ الْخَطَّابِ قَبْلَ مَوْتِهِ بِسَنَةٍ فَرِّقُوا بَيْنَ كُلِّ ذِي مَحْرَمٍ مِنَ الْمَجُوسِ‏.‏ وَلَمْ يَكُنْ عُمَرُ أَخَذَ الْجِزْيَةَ مِنَ الْمَجُوسِ‏.‏ حَتَّى شَهِدَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَخَذَهَا مِنْ مَجُوسِ هَجَرٍ‏.‏",
        "translations": {
          "en": "Narrated `Amr bin Dinar:I was sitting with Jabir bin Zaid and `Amr bin Aus, and Bajala was narrating to them in 70 A.H. the year when Mus`ab bin Az-Zubair was the leader of the pilgrims of Basra. We were sitting at the steps of Zamzam well and Bajala said, \"I was the clerk of Juz bin Muawiya, Al-Ahnaf's paternal uncle. A letter came from `Umar bin Al-Khattab one year before his death; and it was read:-- \"Cancel every marriage contracted among the Magians between relatives of close kinship (marriages that are regarded illegal in Islam: a relative of this sort being called Dhu-Mahram.)\" `Umar did not take the Jizya from the Magian infidels till `Abdur-Rahman bin `Auf testified that Allah's Messenger (ﷺ) had taken the Jizya from the Magians of Hajar",
          "fr": "Rapporté par `Amr bin Dinar : J’étais assis avec Jabir bin Zaid et `Amr bin Aus, et Bajala leur racontait, en l’an 70 de l’Hégire, l’année où Mus`ab bin Az-Zubair était le chef des pèlerins de Bassora. Nous étions assis près des marches du puits de Zamzam et Bajala a dit : « J’étais le secrétaire de Juz bin Muawiya, l’oncle paternel d’Al-Ahnaf. Une lettre est arrivée de `Umar ibn Al-Khattab un an avant sa mort, et on y lisait : ‘Annulez tout mariage contracté chez les mages entre proches parents (c’est-à-dire des mariages considérés comme interdits en Islam, un tel parent étant appelé Dhu-Mahram).’ `Umar ne prélevait pas la jizya sur les mages infidèles jusqu’à ce qu’Abdur-Rahman bin `Auf témoigne que le Messager d’Allah (ﷺ) avait pris la jizya des mages de Hajar. »",
          "id": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] berkata aku mendengar ['Amar] berkata; \"Aku pernah duduk bersama Jabir bin Zaid dan 'Amru bin Aus, lalu [Bajalah] bercerita kepada keduanya suatu peristiwa pada tahun tujuh puluh saat Mush'ab bin Az Zubair menunaikan ibadah hajji bersama dengan penduduk Bashrah. Ketika berada di sisi air zamzam, dia (Bajalah) berkata; \"Aku adalah juru tulis Jaz'i bin Mu'awiyah, paman Al Ahnaf\". Kemudian datang surat perintah dari ['Umar bin Al Khaththab] sebelum kematiannya yang berisi; \"Pisahkanlah setiap orang yang memiliki mahram dari orang Majusi\". Dan 'Umar belum pernah mengambil jizyah (upeti) dari Kaum Majusi hingga kemudian datang 'Abdur Rahman bin 'Auf bersaksi bahwa Rasulullah Shallallahu'alaihiwasallam pernah mengambil jizyah orang Majusi Hajar",
          "tr": "Amr İbn Dinar'ın şöyle dediği nakledilmiştir: \"Cabir İbn Zeyd ve Amr İbn Evs ile birlikte zemzem kuyusunun basamaklarında oturuyordum. Becale İbn Abede gelip onlarla konuşmaya başladı ve Mus'ab İbnü'z-Zübeyr'in Basralılara hac yaptırdığı yetmiş senesinden bahsederek şunları söyledi: \"Ben, Cez' İbn Muaviye'nin - bu zat Ahnef İbn Kays'ın amcasıdır - katibi idim . .Bize Ömer İbnü'I-Hattab'ın talimatlarını içeren bir yazı geldi. Ömer'in ölümünden bir yıl önce gelen bu yazıda: \"Mecusilerden (İslam'a göre birbiriyle evlenmeleri haram olan) yakın akrabalarla evli olanları birbirinden ayırın!\" deniyordu. [-3157-] Abdurrahman İbn Avf, Resulullah Sallallahu Aleyhi ve Sellem'in Hecer Mecusilerinden cizye aldığına dair şehadette bulunana kadar Hz. Ömer Mecusılerden cizye almadı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 1
      },
      "narrator": {
        "en": "`Amr bin Dinar"
      }
    },
    {
      "hadithNumber": 3158,
      "arabicNumber": 3158,
      "book": 58,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّهُ أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ الأَنْصَارِيَّ وَهْوَ حَلِيفٌ لِبَنِي عَامِرِ بْنِ لُؤَىٍّ وَكَانَ شَهِدَ بَدْرًا أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ إِلَى الْبَحْرَيْنِ يَأْتِي بِجِزْيَتِهَا، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ صَالَحَ أَهْلَ الْبَحْرَيْنِ وَأَمَّرَ عَلَيْهِمُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، فَقَدِمَ أَبُو عُبَيْدَةَ بِمَالٍ مِنَ الْبَحْرَيْنِ، فَسَمِعَتِ الأَنْصَارُ بِقُدُومِ أَبِي عُبَيْدَةَ فَوَافَتْ صَلاَةَ الصُّبْحِ مَعَ النَّبِيِّ صلى الله عليه وسلم، فَلَمَّا صَلَّى بِهِمِ الْفَجْرَ انْصَرَفَ، فَتَعَرَّضُوا لَهُ، فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ رَآهُمْ وَقَالَ ‏\"‏ أَظُنُّكُمْ قَدْ سَمِعْتُمْ أَنَّ أَبَا عُبَيْدَةَ قَدْ جَاءَ بِشَىْءٍ ‏\"‏‏.‏ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ، فَوَاللَّهِ لاَ الْفَقْرَ أَخْشَى عَلَيْكُمْ، وَلَكِنْ أَخْشَى عَلَيْكُمْ أَنْ تُبْسَطَ عَلَيْكُمُ الدُّنْيَا كَمَا بُسِطَتْ عَلَى مَنْ كَانَ قَبْلَكُمْ، فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا وَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Amr bin `Auf Al-Ansari:(who was an ally of Bani `Amr bin Lu'ai and one of those who had taken part in (the Ghazwa of) Badr): Allah's Messenger (ﷺ) sent Abu 'Ubaida bin Al-Jarreh to Bahrain to collect the Jizya. Allah's Messenger (ﷺ) had established peace with the people of Bahrain and appointed Al-`Ala' bin Al-Hadrami as their governor. When Abu 'Ubaida came from Bahrain with the money, the Ansar heard of Abu 'Ubaida's arrival which coincided with the time of the morning prayer with the Prophet. When Allah's Messenger (ﷺ) led them in the morning prayer and finished, the Ansar approached him, and he looked at them and smiled on seeing them and said, \"I feel that you have heard that Abu. 'Ubaida has brought something?\" They said, \"Yes, O Allah's Messenger (ﷺ)' He said, \"Rejoice and hope for what will please you! By Allah, I am not afraid of your poverty but I am afraid that you will lead a life of luxury as past nations did, whereupon you will compete with each other for it, as they competed for it, and it will destroy you as it destroyed them",
          "ur": "ہم سے ابوالیمان نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، انہیں زہری نے کہا کہ مجھ سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا، ان سے مسور بن مخرمہ رضی اللہ عنہما نے اور انہیں عمرو بن عوف رضی اللہ عنہ نے خبر دی وہ بنی عامر بن لوی کے حلیف تھے اور جنگ بدر میں شریک تھے۔ انہوں نے ان کو خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوعبیدہ بن جراح رضی اللہ عنہ کو بحرین جزیہ وصول کرنے کے لیے بھیجا تھا۔ آپ صلی اللہ علیہ وسلم نے بحرین کے لوگوں سے صلح کی تھی اور ان پر علاء بن حضرمی رضی اللہ عنہ کو حاکم بنایا تھا۔ جب ابوعبیدہ رضی اللہ عنہ بحرین کا مال لے کر آئے تو انصار کو معلوم ہو گیا کہ ابوعبیدہ رضی اللہ عنہ آ گئے ہیں۔ چنانچہ فجر کی نماز سب لوگوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھی۔ جب آپ صلی اللہ علیہ وسلم نماز پڑھا چکے تو لوگ آپ صلی اللہ علیہ وسلم کے سامنے آئے۔ آپ صلی اللہ علیہ وسلم انہیں دیکھ کر مسکرائے اور فرمایا کہ میرا خیال ہے کہ تم نے سن لیا ہے کہ ابوعبیدہ کچھ لے کر آئے ہیں؟ انصار رضی اللہ عنہم نے عرض کیا جی ہاں، یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا، تمہیں خوشخبری ہو، اور اس چیز کے لیے تم پرامید رہو۔ جس سے تمہیں خوشی ہو گی، لیکن اللہ کی قسم! میں تمہارے بارے میں محتاجی اور فقر سے نہیں ڈرتا۔ مجھے اگر خوف ہے تو اس بات کا کچھ دنیا کے دروازے تم پر اس طرح کھول دئیے جائیں گے جیسے تم سے پہلے لوگوں پر کھول دئیے گئے تھے، تو ایسا نہ ہو کہ تم بھی ان کی طرح ایک دوسرے سے جلنے لگو اور یہ جلنا تم کو بھی اسی طرح تباہ کر دے جیسا کہ پہلے لوگوں کو کیا تھا۔",
          "fr": "Rapporté par `Amr bin `Auf Al-Ansari : (qui était un allié de Banû `Amr bin Lu'ai et l’un de ceux qui ont participé à la bataille de Badr) : Le Messager d’Allah (ﷺ) a envoyé Abu `Ubaida bin Al-Jarrah à Bahreïn pour collecter la jizya. Le Messager d’Allah (ﷺ) avait conclu un accord de paix avec les habitants de Bahreïn et avait nommé Al-`Ala’ bin Al-Hadrami comme gouverneur. Quand Abu `Ubaida est revenu de Bahreïn avec l’argent, les Ansar ont appris son arrivée, qui a coïncidé avec la prière du matin avec le Prophète. Après la prière, les Ansar se sont approchés de lui, et il les a vus et leur a souri, puis il a dit : « Je sens que vous avez entendu qu’Abu `Ubaida a rapporté quelque chose ? » Ils ont répondu : « Oui, ô Messager d’Allah (ﷺ). » Il a dit : « Réjouissez-vous et espérez ce qui vous fera plaisir ! Par Allah, je ne crains pas la pauvreté pour vous, mais je crains que vous ne meniez une vie de luxe comme l’ont fait les peuples d’avant vous, que vous rivalisiez entre vous pour cela, comme ils l’ont fait, et que cela vous détruise comme cela les a détruits. »",
          "id": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata telah bercerita kepadaku ['Urwah bin Az Zubair] dari [Al Miswar bin Makhramah], dia mengabarkan kepadanya bahwa ['Amru bin 'Auf Al Anshariy], dia adalah cucu dari Bani 'Amir bin Lu'ay yang turut serta dalam perang Badar, mengabarkan kepadanya bahwa Rasulullah Shallallahu'alaihiwasallam mengutus Abu 'Ubaidah bin Al Jarrah ke negeri Bahrain untuk mengambil jizyah. Sebelumnya Rasulullah Shallallahu'alaihiwasallam telah membuat perjanjian dengan penduduk Bahrain dan menjadikan Al 'Alaa' bin Al Hadlramiy sebagai pemimpin mereka. Maka Abu 'Ubaidah datang dengan membawa harta dari negeri Bahrain. Kedatangan Abu 'Ubaidah ini didengar oleh Kaum Anshar bertepatan dengan saat shalat Shubuh bersama Rasulullah Shallallahu'alaihiwasallam. Setelah shalat selesai, Beliau segera pergi namun mereka berkerumun menghampiri Beliau. Maka Rasulullah Shallallahu'alaihiwasallam tersenyum ketika melihat mereka seraya berkata: \"Aku kira kalian telah mendengar bahwa Abu 'Ubaidah telah tiba dengan membawa sesuatu\". Mereka berkata; \"Benar sekali wahai Rasulullah\". Maka Beliau bersabda: \"Bergenbiralah dan bercita-citalah dengan apa yang dapat membuat kalian berbahagia. Sungguh demi Allah, bukanlah kefakiran yang aku khawatirkan dari kalian. Akan tetapi yang aku khawatirkan atas kalian adalah bila kalian telah dibukakan (harta) dunia sebagaimana telah dibukakan kepada orang-orang sebelum kalian lalu kalian berlomba-loba untuk memperebutkannya sebagaimana mereka berlomba-lomba memperebutkannya sehingga harta dunia itu membinasakan kalian sebagaimana telah membinasakan mereka",
          "tr": "Amr İbn Avf'ın -Amir İbn Luey oğullarının müttefikidir ve Amr Bedir savaşına katılmıştır - şöyle dediği nakledilmektedir: «Resulullah Sallallahu Aleyhi ve Sellem, Ebu Ubeyde İbnü'l-Cerrah'ı cizyeleri toplayıp getirmesi için Bahreyn'e göndermişti. O sırada Nebi Sallallahu Aleyhi ve Sellem'in Bahreyn halkı ile anlaşması bulunuyordu. Resul-i Ekrem Sallallahu Aleyhi ve Sellem Bahreyn yöneticisi (emir) olarak Ala İbnü'l-Hadramı'yi atamıştı. Ebu Ubeyde Bahreyn'den topladığı mallarla sabah namazı vaktinde Medine'ye döndü. Onun döndüğünü ensar da duymuş ve sabah namazı için mescide gelmişti. Resul-i Ekrem Sallallahu Aleyhi ve Sellem cemaate sabah namazını kıldırdıktan sonra döndü gidiyordu. Orada bulunanlar hemen O'na s.a.v. doğru koşuşturup önünde durdular. Resulullah Sallallahu Aleyhi ve Sellem da onları görünce tebessüm etti ve şöyle dedi: \"Sanırım, Ebu Ubeyde'nin bir şeyler getirdiğini duydunuz!\" Onlar da: \"Evet, ey Allah'ın Resulü\" diye cevap verdiler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Müjdeler olsun size, bundan böyle sizi sevindirecek şeyleri de umabilirsiniz. Vallahi, sizin hakkınızda beni endişeye sevk eden fakirlik değildir. Ancak dünyanın sizden öncekilere olduğu gibi size de olanca genişliği ile açılmasından, onların bu dünyalığı elde etmek için birbirleriyle kıran kırana yarıştıkları gibi sizin de yarışmanızdan ve dünyanın onları helak ettiği gibi sizi de helak etmesinden korkuyorum\" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 2
      },
      "narrator": {
        "en": "`Amr bin `Auf Al-Ansari"
      }
    },
    {
      "hadithNumber": 3160,
      "arabicNumber": 3160,
      "book": 58,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ الثَّقَفِيُّ، حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللَّهِ الْمُزَنِيُّ، وَزِيَادُ بْنُ جُبَيْرٍ، عَنْ جُبَيْرِ بْنِ حَيَّةَ، قَالَ بَعَثَ عُمَرُ النَّاسَ فِي أَفْنَاءِ الأَمْصَارِ يُقَاتِلُونَ الْمُشْرِكِينَ، فَأَسْلَمَ الْهُرْمُزَانُ فَقَالَ إِنِّي مُسْتَشِيرُكَ فِي مَغَازِيَّ هَذِهِ‏.‏ قَالَ نَعَمْ، مَثَلُهَا وَمَثَلُ مَنْ فِيهَا مِنَ النَّاسِ مِنْ عَدُوِّ الْمُسْلِمِينَ مَثَلُ طَائِرٍ لَهُ رَأْسٌ وَلَهُ جَنَاحَانِ وَلَهُ رِجْلاَنِ، فَإِنْ كُسِرَ أَحَدُ الْجَنَاحَيْنِ نَهَضَتِ الرِّجْلاَنِ بِجَنَاحٍ وَالرَّأْسُ، فَإِنْ كُسِرَ الْجَنَاحُ الآخَرُ نَهَضَتِ الرِّجْلاَنِ وَالرَّأْسُ، وَإِنْ شُدِخَ الرَّأْسُ ذَهَبَتِ الرِّجْلاَنِ وَالْجَنَاحَانِ وَالرَّأْسُ، فَالرَّأْسُ كِسْرَى، وَالْجَنَاحُ قَيْصَرُ، وَالْجَنَاحُ الآخَرُ فَارِسُ، فَمُرِ الْمُسْلِمِينَ فَلْيَنْفِرُوا إِلَى كِسْرَى‏.‏ وَقَالَ بَكْرٌ وَزِيَادٌ جَمِيعًا عَنْ جُبَيْرِ بْنِ حَيَّةَ قَالَ فَنَدَبَنَا عُمَرُ وَاسْتَعْمَلَ عَلَيْنَا النُّعْمَانَ بْنَ مُقَرِّنٍ، حَتَّى إِذَا كُنَّا بِأَرْضِ الْعَدُوِّ، وَخَرَجَ عَلَيْنَا عَامِلُ كِسْرَى فِي أَرْبَعِينَ أَلْفًا، فَقَامَ تُرْجُمَانٌ فَقَالَ لِيُكَلِّمْنِي رَجُلٌ مِنْكُمْ‏.‏ فَقَالَ الْمُغِيرَةُ سَلْ عَمَّا شِئْتَ‏.‏ قَالَ مَا أَنْتُمْ قَالَ نَحْنُ أُنَاسٌ مِنَ الْعَرَبِ كُنَّا فِي شَقَاءٍ شَدِيدٍ وَبَلاَءٍ شَدِيدٍ، نَمَصُّ الْجِلْدَ وَالنَّوَى مِنَ الْجُوعِ، وَنَلْبَسُ الْوَبَرَ وَالشَّعَرَ، وَنَعْبُدُ الشَّجَرَ وَالْحَجَرَ، فَبَيْنَا نَحْنُ كَذَلِكَ، إِذْ بَعَثَ رَبُّ السَّمَوَاتِ وَرَبُّ الأَرَضِينَ تَعَالَى ذِكْرُهُ وَجَلَّتْ عَظَمَتُهُ إِلَيْنَا نَبِيًّا مِنْ أَنْفُسِنَا، نَعْرِفُ أَبَاهُ وَأُمَّهُ، فَأَمَرَنَا نَبِيُّنَا رَسُولُ رَبِّنَا صلى الله عليه وسلم أَنْ نَقَاتِلَكُمْ حَتَّى تَعْبُدُوا اللَّهَ وَحْدَهُ أَوْ تُؤَدُّوا الْجِزْيَةَ، وَأَخْبَرَنَا نَبِيُّنَا صلى الله عليه وسلم عَنْ رِسَالَةِ رَبِّنَا أَنَّهُ مَنْ قُتِلَ مِنَّا صَارَ إِلَى الْجَنَّةِ فِي نَعِيمٍ لَمْ يَرَ مِثْلَهَا قَطُّ، وَمَنْ بَقِيَ مِنَّا مَلَكَ رِقَابَكُمْ‏.‏ فَقَالَ النُّعْمَانُ رُبَّمَا أَشْهَدَكَ اللَّهُ مِثْلَهَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَلَمْ يُنَدِّمْكَ وَلَمْ يُخْزِكَ، وَلَكِنِّي شَهِدْتُ الْقِتَالَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا لَمْ يُقَاتِلْ فِي أَوَّلِ النَّهَارِ انْتَظَرَ حَتَّى تَهُبَّ الأَرْوَاحُ وَتَحْضُرَ الصَّلَوَاتُ‏.‏",
        "translations": {
          "en": "Narrated Jubair bin Haiya:`Umar sent the Muslims to the great countries to fight the pagans. When Al-Hurmuzan embraced Islam, `Umar said to him. \"I would like to consult you regarding these countries which I intend to invade.\" Al-Hurmuzan said, \"Yes, the example of these countries and their inhabitants who are the enemies. of the Muslims, is like a bird with a head, two wings and two legs; If one of its wings got broken, it would get up over its two legs, with one wing and the head; and if the other wing got broken, it would get up with two legs and a head, but if its head got destroyed, then the two legs, two wings and the head would become useless. The head stands for Khosrau, and one wing stands for Caesar and the other wing stands for Faris. So, order the Muslims to go towards Khosrau.\" So, `Umar sent us (to Khosrau) appointing An-Nu`man bin Muqrin as our commander. When we reached the land of the enemy, the representative of Khosrau came out with forty-thousand warriors, and an interpreter got up saying, \"Let one of you talk to me!\" Al-Mughira replied, \"Ask whatever you wish.\" The other asked, \"Who are you?\" Al-Mughira replied, \"We are some people from the Arabs; we led a hard, miserable, disastrous life: we used to suck the hides and the date stones from hunger; we used to wear clothes made up of fur of camels and hair of goats, and to worship trees and stones. While we were in this state, the Lord of the Heavens and the Earths, Elevated is His Remembrance and Majestic is His Highness, sent to us from among ourselves a Prophet whose father and mother are known to us. Our Prophet, the Messenger of our Lord, has ordered us to fight you till you worship Allah Alone or give Jizya (i.e. tribute); and our Prophet has informed us that our Lord says:-- \"Whoever amongst us is killed (i.e. martyred), shall go to Paradise to lead such a luxurious life as he has never seen, and whoever amongst us remains alive, shall become your master.\" (Al-Mughira, then blamed An-Nu`man for delaying the attack and) An-Nu' man said to Al-Mughira, \"If you had participated in a similar battle, in the company of Allah's Messenger (ﷺ) he would not have blamed you for waiting, nor would he have disgraced you. But I accompanied Allah's Apostle in many battles and it was his custom that if he did not fight early by daytime, he would wait till the wind had started blowing and the time for the prayer was due (i.e. after midday)",
          "fr": "Rapporté par Jubair bin Haiya : `Umar a envoyé les musulmans dans les grands pays pour combattre les polythéistes. Quand Al-Hurmuzan s’est converti à l’islam, `Umar lui a dit : « Je voudrais te consulter au sujet de ces pays que j’envisage d’attaquer. » Al-Hurmuzan a répondu : « Oui, l’exemple de ces pays et de leurs habitants, qui sont les ennemis des musulmans, est comme un oiseau avec une tête, deux ailes et deux pattes ; si une de ses ailes est brisée, il se relève sur ses deux pattes, avec une aile et la tête ; si l’autre aile est brisée, il se relève avec ses deux pattes et la tête, mais si la tête est détruite, alors les deux pattes, les deux ailes et la tête ne servent plus à rien. La tête représente Khosrau, une aile représente César et l’autre aile représente Faris. Donc, ordonne aux musulmans d’aller vers Khosrau. » Ainsi, `Umar nous a envoyés (vers Khosrau) en nommant An-Nu`man bin Muqrin comme notre chef. Quand nous sommes arrivés sur la terre ennemie, le représentant de Khosrau est sorti avec quarante mille soldats, et un interprète s’est levé en disant : « Que l’un d’entre vous me parle ! » Al-Mughira a répondu : « Demande ce que tu veux. » L’autre a demandé : « Qui êtes-vous ? » Al-Mughira a répondu : « Nous sommes des Arabes ; nous avons mené une vie dure, misérable et difficile : nous mâchions des peaux et des noyaux de dattes à cause de la faim ; nous portions des vêtements faits de poils de chameau et de chèvre, et nous adorions des arbres et des pierres. Pendant que nous étions dans cet état, le Seigneur des cieux et de la terre, Exalté soit Son souvenir et Majestueuse Sa grandeur, nous a envoyé un Prophète issu de nous-mêmes, dont le père et la mère nous sont connus. Notre Prophète, le Messager de notre Seigneur, nous a ordonné de vous combattre jusqu’à ce que vous adoriez Allah seul ou que vous payiez la jizya (c’est-à-dire un tribut) ; et notre Prophète nous a informés que notre Seigneur dit : « Quiconque parmi nous est tué (c’est-à-dire devient martyr) ira au Paradis pour y mener une vie luxueuse qu’il n’a jamais connue, et quiconque parmi nous reste en vie deviendra votre maître. » (Al-Mughira a alors reproché à An-Nu`man d’avoir tardé à attaquer et) An-Nu`man a dit à Al-Mughira : « Si tu avais participé à une bataille similaire en compagnie du Messager d’Allah (ﷺ), il ne t’aurait pas reproché d’attendre, ni ne t’aurait fait honte. Mais j’ai accompagné le Messager d’Allah dans de nombreuses batailles, et il avait l’habitude, s’il ne combattait pas tôt dans la journée, d’attendre que le vent commence à souffler et que l’heure de la prière soit arrivée (c’est-à-dire après midi). »",
          "id": "Telah bercerita kepada kami [Al Fadlal bin Ya'qub] telah bercerita kepada kami ['Abdullah bin Ja'far ar-Raqqiy] telah bercerita kepada kami [Al Mu'tamir bin Sulaiman] telah bercerita kepada kami [Sa'id bin 'Ubaidullah Ats-Tsaqafiy] telah bercerita kepada kami [Bakr bin 'Abdullah Al Muzaniy] dan [Ziyad bin Jubair] dari [Jubair bin Hayyah] berkata; \"'Umar mengutus banyak orang ke berbagai negeri untuk memerangi orang-orang musyrik. Kemudian ketika Al Humuzan telah masuk Islam, 'Umar berkata; \"Aku minta pendapatmu tentang peperangan ini\". Al Hurmuzan berkata' \"Baiklah. Perumpamaan perang ini dan orang-orang yang terlibat di dalamnya dari kalangan musuh kaum Muslimin seperti seekor burung yang memiliki satu kepala, dua sayap dan dua kaki. Apabila salah satu sayapnya patah maka dia akan tegak berdiri dengan dua kaki, satu sayap dan satu kepala dan apabila sayap yang satunya lagi patah maka dia akan tegak dengan dua kaki dan satu kepala. Namun jika kepalanya dipecahkan maka lumpuhlah kedua kaki dan kedua sayap sekaligus kepala. Perumpamaan kepala adalah Kisra (raja Persia) dan sayap yang satu umpama Qaishar (raja Romawi) sedangkan sayap yang satunya lagi adalah orang-orang Persia. Maka itu perintahkanlah kaum Muslimin agar berangkat untuk memerangi Kisra\". Dan Bakr dan Ziyad keduanya berkata dari Jubair bin Hayyah yang berkata; \"Maka 'Umar mengirim kami dan mengangkat an-Nu'man bin Muqarrin sebagai pemimpin kami hingga ketika kami tiba di negeri musuh keluarlah seorang antek Kisra bersama empat puluh ribu pasukan menghadang kami lalu seorang perterjemah berdiri seraya berkata; \"Hendaklah salah seorang dari kalian berbicara kepadaku\". Maka Al Mughirah berkata; \"Bertanyalah apa yang kalian inginkan!\". Dia berkata; \"Siapa kalian ini?\". [Al Mughirah] menjawab; \"Kami adalah orang-orang dari bangsa Arab yang sebelumnya kami hidup dalam kesengsaraan dan ujian yang berat, kami menghisap kulit dan biji-bijian karena lapar, kami memakai pakaian bulu dan rambut dan kami menyembah pohon dan batu. Dalam kondisi seperti itu, Rabb langit dan bumi Yang Maha Tinggi dan Besar Keagungan-Nya mengutus kepada kami Nabi kami dari kalangan kami sendiri yang kami kenal bapak dan ibunya, lalu Nabi utusan Rabb shallallahu 'alaihi wasallam kami itu memerintahkan kami untuk memerangi kalian hinga kalian menyembah Allah saja atau kalian membayar jizyah. Dan Nabi kami shallallahu 'alaihi wasallam mengabarkan kepada kami tentang risalah ajaran Rabb kami bahwa siapa saja orang dari kami yang terbunuh maka dia akan masuk surga dengan kenikmatan yang belum pernah dia lihat sekalipun, dan siapa yang tetap hidup diantara kami maka dia akan menguasai kalian\". Kemudian [an-Nu'man] berkata; \"Seringkali Allah menyertakan kamu dalam peperangan bersama Nabi shallallahu 'alaihi wasallam semacam itu, yang tidak akan membuat kamu menyesal dan terhina. Dan aku juga pernah ikut berperang bersama Rasulullah shallallahu 'alaihi wasallam, apabila Beliau belum memulainya di awal siang, Beliau menunggu hingga angin bertiup dan waktu-waktu shalat telah masuk",
          "tr": "Cübeyr İbn Hayye'nin şöyle dediği nakledilmiştir: \"Hz. Ömer, çeşitli ülkelerdeki müşriklerle savaşmaları için büyük şehirlere ordular göndermişti. Bu savaşlar sonunda Hürmüzan Müslüman oldu. Hz. Ömer ona: \"Ben seninle düşmanlarımız ile yapacağımız savaş konusunda görüş alışverişinde bulunmak istiyorum\" dedi ve o da: \"Hay hay, Sizin düşmanınız olan bu ülkeler ile orada yaşayan ve Müslümanların düşmanı olan halk tek başlı, çift kanatlı ve çift ayaklı bir kuşa benzer. Bu kanatlardan birisi koparılsa bile kuşun iki ayağı, tek kanadı ve başı hayatını sürdürmesine yeter. Diğer kanadı da koparılacak olursa iki ayağı ve başı ile yaşamaya devam eder. Fakat kuşun kafasını gövdesinden ayırırsanız iki ayağı, iki kanadı ve kafayı işlevsiz hale getirirsiniz. Bu kuşun kafası Kisra, kanatlardan biri Kayser diğeri de pers / Fars hükümdarıdır. Sen Müslümanlara emret, Kisra'nın üzerine yürüsünler!\" diye cevap verdi.\" Bekir ve Ziyad, her ikisi de Cübeyr İbn Hayye'nin şöyle dediğini nakletmişlerdir: \"Hz. Ömer bir ordu kurup bizi bu ordu da görevlendirdi. Başımıza da komutan olarak Nu'man İbn Mukarrin'i atadı. Biz sefere çıkıp düşman topraklarına girince Kisra'nın komutanlarından birisi kırk bin kişilik bir ordu ile bizi karşıladı. Bir tercüman kalkıp: \"İçinizden biri bizimle konuşsun!\" dedi. Bunun üzerine Muğıre: \"İstediğini sor bakalım!\" dedi. Tercüman da: \"Siz kimsiniz, burada ne işiniz var?\" dedi. Muğire ona şöyle cevap verdi: \"Bizler Araplarız. Daha önce hiç düşünemeyeceğiniz kadar bedbaht, sıkıntılı ve çaresiz bir durumda idik. Açlıktan (nefesimiz kokuyordu) deriyi ve hurma çekirdeklerini gevip emerdik. Sırtımıza giydiğimiz hayvan postları idi. Üstelik ağaçlara ve taşlara tapan bir topluluktuk. Biz bu durumda iken göklerin ve yerlerin Rabbi - O'nun şanı pek yücedir, azametinin ululuğuna sınır yoktur - bize kendi içimizden, anasını ve babasını bildiğimiz bir Nebi gönderdi. Nebiimiz, Rabbimizin elçisi bize siz sadece Allah'a ibadet eden kullar oluncaya veya kendi ellerinizle cizye verinceye kadar sizinle savaşmamızı emretti. Nebiimiz bize Rabbimizden aldığı vahiy ile, bizden kim öldürülürse onun cennete gideceğini, orada eşi benzeri görülmemiş nimetler içinde olacağını ve sağ kalanların da sizin üzerinize hükümran olacaklarını, söyledi.\" [-3160-] Nu'man Muğire'ye şöyle demiştir: \"Belki de Allah seni Resul-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte bunun gibi sıkıntılı durumlara da şahit kılmış, O'nunla s.a.v. birlikte katlandığın bu sıkıntılara karşı sana bir yılgınlık / pişmanlık vermemiş ve seni mahrum da bırakmamıştır. Ben de Resulullah Sallallahu Aleyhi ve Sellem ile beraber savaşa çıktım. O s.a.v. günün başında savaşa girişmemişse rüzgarlar esene ve namaz vakitleri girene kadar beklerdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 3
      },
      "narrator": {
        "en": "Jubair bin Haiya"
      }
    },
    {
      "hadithNumber": 3161,
      "arabicNumber": 3161,
      "book": 58,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ عَبَّاسٍ السَّاعِدِيِّ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ غَزَوْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم تَبُوكَ، وَأَهْدَى مَلِكُ أَيْلَةَ لِلنَّبِيِّ صلى الله عليه وسلم بَغْلَةً بَيْضَاءَ، وَكَسَاهُ بُرْدًا، وَكَتَبَ لَهُ بِبَحْرِهِمْ‏.‏",
        "translations": {
          "en": "Narrated Abu Humaid As-Saidi:We accompanied the Prophet (ﷺ) in the Ghazwa of Tabuk and the king of 'Aila presented a white mule and a cloak as a gift to the Prophet. And the Prophet (ﷺ) wrote to him a peace treaty allowing him to keep authority over his country",
          "ur": "ہم سے سہل بن بکار نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ان سے عمرو بن یحییٰ نے، ان سے عباس ساعدی نے اور ان سے ابو حمید ساعدی رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہم غزوہ تبوک میں شریک تھے۔ ایلہ کے حاکم ( یوحنا بن روبہ ) نے نبی کریم صلی اللہ علیہ وسلم کو ایک سفید خچر بھیجا اور آپ صلی اللہ علیہ وسلم نے اسے ایک چادر بطور خلعت کے اور ایک تحریر کے ذریعہ اس کے ملک پر اسے ہی حاکم باقی رکھا۔",
          "fr": "Rapporté par Abu Humaid As-Saidi : Nous avons accompagné le Prophète (ﷺ) lors de la bataille de Tabuk et le roi d’Aïla lui a offert une mule blanche et un manteau en cadeau. Le Prophète (ﷺ) lui a alors écrit un traité de paix lui permettant de garder le contrôle de son pays",
          "id": "Telah bercerita kepada kami [Sahal bin Bakkar] telah bercerita kepada kami [Wuhaib] dari ['Amru bin Yahya] dari ['Abbas as-Sa'idiy] dari [Abu Humaid as-Sa'idiy] berkata; \"Kami ikut perang Tabuk bersama Nabi shallallahu 'alaihi wasallam lalu raja Aylah memberi hadiah seekor baghal berwarna putih kepada Nabi shallallahu 'alaihi wasallam dan Beliau (membalas) dengan memakaikan burdah kepada raja itu dan menetapkan baginya untuk tetap berkuasa atas negerinya",
          "tr": "Ebu Humeyd es-Saidi r.a.'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem ile birlikte Tebuk savaşına katılmıştık. Eyle hükümdarı Resul-i Ekrem Sallallahu Aleyhi ve Sellem'e beyaz bir katır hediye etti ve (Yemen yapımı) bir hırka giydirdi. Nebi Sallallahu Aleyhi ve Sellem de ona bu cömertliğine karşı hükümdarı bulunduğu Eyle'nin güvende olduğunu bildirir bir belge (emanname) yazdı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 4
      },
      "narrator": {
        "en": "Abu Humaid As-Saidi"
      }
    },
    {
      "hadithNumber": 3162,
      "arabicNumber": 3162,
      "book": 58,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو جَمْرَةَ، قَالَ سَمِعْتُ جُوَيْرِيَةَ بْنَ قُدَامَةَ التَّمِيمِيَّ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قُلْنَا أَوْصِنَا يَا أَمِيرَ الْمُؤْمِنِينَ‏.‏ قَالَ أُوصِيكُمْ بِذِمَّةِ اللَّهِ، فَإِنَّهُ ذِمَّةُ نَبِيِّكُمْ، وَرِزْقُ عِيَالِكُمْ‏.‏",
        "translations": {
          "en": "Narrated Juwairiya bin Qudama at-Tamimi:We said to `Umar bin Al-Khattab, \"O Chief of the believers! Advise us.\" He said, \"I advise you to fulfill Allah's Covenant (made with the Dhimmis) as it is the convention of your Prophet and the source of the livelihood of your dependents (i.e. the taxes from the Dhimmis)",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے ابوجمرہ نے بیان کیا، کہا کہ میں نے جویریہ بن قدامہ تمیمی سے سنا، انہوں نے بیان کیا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا تھا، ( جب وہ زخمی ہوئے ) آپ سے ہم نے عرض کیا تھا کہ ہمیں کوئی وصیت کیجئے! تو آپ نے فرمایا کہ میں تمہیں اللہ تعالیٰ کے عہد کی ( جو تم نے ذمیوں سے کیا ہے ) وصیت کرتا ہوں ( کہ اس کی حفاظت میں کوتاہی نہ کرنا ) کیونکہ وہ تمہارے نبی کا ذمہ ہے اور تمہارے گھر والوں کی روزی ہے ( کہ جزیہ کے روپیہ سے تمہارے بال بچوں کی گزران ہوتی ہے ) ۔",
          "fr": "Rapporté par Juwairiya bin Qudama at-Tamimi : Nous avons dit à `Umar ibn Al-Khattab : « Ô chef des croyants ! Donne-nous un conseil. » Il a répondu : « Je vous conseille de respecter le pacte d’Allah (fait avec les Dhimmis), car c’est le pacte de votre Prophète et la source de subsistance de vos familles (c’est-à-dire les impôts des Dhimmis). »",
          "id": "Telah bercerita kepada kami [Adam bin Abu Iyas] telah bercerita kepada kami [Syu'bah] telah bercerita kepada kami [Abu Jamrah] berkata aku mendengar [Juwairiyah bin Qudamah at-Tamimiy] berkata aku mendengar ['Umar bin Al Khoththob radliallahu 'anhu] ketika kami berkata kepadanya; \"Berilah kami washiat wahai Amirul Mu'minin\", dia berkata: \"Aku washiatkan kepada kalian tentang perlindungan Allah (terhadap ahlu dzimmah, orangkafir yang dilindungi) karena dia merupakan perlindungan Nabi kalian sekaligus sebagai sumber rezeki bagi orang-orang miskin kalian",
          "tr": "Cüveyriye İbn Kudame et-Temımi'nin şöyle dediği nakledilmiştir: \"Hz. Ömer'i işittim. Biz Hz. Ömer'e: \"Ey mu'minlerin emiri, bize tavsiyede bulun\" dedik. O da: \"Ben size Allah'ın zimmetine / ahdine bağlı kalmanızı tavsiye ederim. Çünkü bu ahit, Nebiinizin verdiği bir sözdür ve siz bu sayede ailelerinizin geçimini sağlıyorsunuz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 5
      },
      "narrator": {
        "en": "Juwairiya bin Qudama at-Tamimi"
      }
    },
    {
      "hadithNumber": 3163,
      "arabicNumber": 3163,
      "book": 58,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم الأَنْصَارَ لِيَكْتُبَ لَهُمْ بِالْبَحْرَيْنِ فَقَالُوا لاَ وَاللَّهِ حَتَّى تَكْتُبَ لإِخْوَانِنَا مِنْ قُرَيْشٍ بِمِثْلِهَا‏.‏ فَقَالَ ذَاكَ لَهُمْ مَا شَاءَ اللَّهُ عَلَى ذَلِكَ يَقُولُونَ لَهُ قَالَ ‏ \"‏ فَإِنَّكُمْ سَتَرَوْنَ بَعْدِي أُثْرَةً، فَاصْبِرُوا حَتَّى تَلْقَوْنِي ‏عَلَى الْحَوْضِ\"‏‏.‏",
        "translations": {
          "en": "Narrated Yahya bin Sa`id:Once the Prophet (ﷺ) called the Ansar in order to grant them part of the land of Bahrain. On that they said, \"No! By Allah, we will not accept it unless you grant a similar thing to our Quraishi brothers as well.\" He said, \"That will be their's if Allah wishes.\" But when the Ansar persisted in their request, he said, \"After me you will see others given preference over you in this respect (in which case) you should be patient till you meet me at the Tank (of Al-Kauthar)",
          "ur": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، ان سے یحییٰ بن سعید انصاری نے بیان کیا کہ میں نے انس رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے انصار کو بلایا، تاکہ بحرین میں ان کے لیے کچھ زمین لکھ دیں۔ لیکن انہوں نے عرض کیا کہ نہیں! اللہ کی قسم! ( ہمیں اسی وقت وہاں زمین عنایت فرمائیے ) جب اتنی زمین ہمارے بھائی قریش ( مہاجرین ) کے لیے بھی آپ لکھیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جب تک اللہ کو منظور ہے یہ معاش ان کو بھی ( یعنی قریش والوں کو ) ملتی رہے گی۔“ لیکن انصار یہی اصرار کرتے رہے کہ قریش والوں کے لیے بھی سندیں لکھ دیجئیے۔ جب آپ صلی اللہ علیہ وسلم نے انصار سے فرمایا کہ میرے بعد تم یہ دیکھو گے کہ دوسروں کو تم پر ترجیح دی جائے گی، لیکن تم صبر سے کام لینا، تاآنکہ تم آخر میں مجھ سے آ کر ملو ( جنگ اور فساد نہ کرنا ) ۔",
          "fr": "Rapporté par Yahya bin Sa`id : Une fois, le Prophète (ﷺ) a appelé les Ansar pour leur accorder une partie des terres de Bahreïn. Ils ont répondu : « Non ! Par Allah, nous n’accepterons que si tu donnes la même chose à nos frères des Quraysh. » Il a dit : « Ce sera à eux si Allah le veut. » Mais comme les Ansar insistaient, il a dit : « Après moi, vous verrez d’autres personnes privilégiées par rapport à vous dans ce domaine ; dans ce cas, soyez patients jusqu’à ce que vous me retrouviez au bassin (d’Al-Kawthar). »",
          "id": "Telah bercerita kepada kami [Ahmad bin Yunus] telah bercerita kepada kami [Zuhair] dari [Yahya bin Sa'id] be aku mendengar [Anas radliallahu 'anhu] berkata: Nabi shallallahu 'alaihi wasallam memanggil Kaum Anshar untuk menetapkan bagian mereka (harta fa'i) negeri Bahrain, maka mereka berkata; \"Tidak, demi Allah, hingga Tuan menetapkan juga (bagian yang sama) buat saudara-saudara kami dari Quraisy\". Maka Beliau jawab ucapan mereka sekehendak Allah. Selanjutnya Beliau bersabda: \"Kelak kalian akan melihat setelahku sikap-sikap egoism, maka bersabarlah hingga kalian berjumpa denganku di telaga al-Haudl",
          "tr": "Enes İbn Malik r.a.'in şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem, Bahreyn arazilerini onlara dağıtıp bunu yazılı olarak belgelemek üzere Ensarı çağırdı. Onlar da: \"Vallahi, aynı şekilde Kureyş'li muhacir kardeşlerimize de yazmadıkça bunu kabul etmeyiz\" dediler. Enes dedi ki: Bu Ensar Allah'ın dilediği kadar tekrarladı. Bunun üzerine Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Siz benden sonra çok aşırı derecede bencillikler ve sıkıntılar göreceksiniz. Siz bu durumda benimle havzin başında karşılaşıncaya kadar sabredin"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 6
      },
      "narrator": {
        "en": "Yahya bin Sa`id"
      }
    },
    {
      "hadithNumber": 3165,
      "arabicNumber": 3165,
      "book": 58,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنِي رَوْحُ بْنُ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِي ‏\"‏ لَوْ قَدْ جَاءَنَا مَالُ الْبَحْرَيْنِ قَدْ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ فَلَمَّا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَاءَ مَالُ الْبَحْرَيْنِ قَالَ أَبُو بَكْرٍ مَنْ كَانَتْ لَهُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم عِدَةٌ فَلْيَأْتِنِي‏.‏ فَأَتَيْتُهُ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ كَانَ قَالَ لِي ‏\"‏ لَوْ قَدْ جَاءَنَا مَالُ الْبَحْرَيْنِ لأَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ فَقَالَ لِي احْثُهْ‏.‏ فَحَثَوْتُ حَثْيَةً فَقَالَ لِي عُدَّهَا‏.‏ فَعَدَدْتُهَا فَإِذَا هِيَ خَمْسُمِائَةٍ، فَأَعْطَانِي أَلْفًا وَخَمْسَمِائَةٍ‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِمَالٍ مِنَ الْبَحْرَيْنِ فَقَالَ ‏\"‏ انْثُرُوهُ فِي الْمَسْجِدِ ‏\"‏ فَكَانَ أَكْثَرَ مَالٍ أُتِيَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ الْعَبَّاسُ فَقَالَ يَا رَسُولَ اللَّهِ، أَعْطِنِي إِنِّي فَادَيْتُ نَفْسِي وَفَادَيْتُ عَقِيلاً‏.‏ قَالَ ‏\"‏ خُذْ ‏\"‏‏.‏ فَحَثَا فِي ثَوْبِهِ، ثُمَّ ذَهَبَ يُقِلُّهُ، فَلَمْ يَسْتَطِعْ‏.‏ فَقَالَ أْمُرْ بَعْضَهُمْ يَرْفَعْهُ إِلَىَّ‏.‏ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَارْفَعْهُ أَنْتَ عَلَىَّ‏.‏ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَنَثَرَ مِنْهُ، ثُمَّ ذَهَبَ يُقِلُّهُ فَلَمْ يَرْفَعْهُ‏.‏ فَقَالَ أْمُرْ بَعْضَهُمْ يَرْفَعْهُ عَلَىَّ‏.‏ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَارْفَعْهُ أَنْتَ عَلَىَّ‏.‏ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَنَثَرَ ثُمَّ احْتَمَلَهُ عَلَى كَاهِلِهِ ثُمَّ انْطَلَقَ، فَمَا زَالَ يُتْبِعُهُ بَصَرَهُ حَتَّى خَفِيَ عَلَيْنَا عَجَبًا مِنْ حِرْصِهِ، فَمَا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَمَّ مِنْهَا دِرْهَمٌ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:Allah's Messenger (ﷺ) once said to me, \"If the revenue of Bahrain came, I would give you this much and this much.\" When Allah's Messenger (ﷺ) had died, the revenue of Bahrain came, and Abu Bakr announced, \" Let whoever was promised something by Allah's Messenger (ﷺ) come to me.\" So, I went to Abu Bakr and said, \"Allah's Messenger (ﷺ) said to me, 'If the revenue of Bahrain came, I would give you this much and this. much.\" On that Abu Bakr said to me, \"Scoop (money) with both your hands.\" I scooped money with both my hands and Abu Bakr asked me to count it. I counted it and it was five-hundred (gold pieces). The total amount he gave me was one thousand and five hundred (gold pieces.) Narrated Anas: Money from Bahrain was brought to the Prophet (ﷺ) . He said, \"Spread it in the Mosque.\" It was the biggest amount that had ever been brought to Allah's Messenger (ﷺ) . In the meantime Al-`Abbas came to him and said, \"O Allah's Messenger (ﷺ)! Give me, for I gave the ransom of myself and `Aqil.\" The Prophet said (to him), \"Take.\" He scooped money with both hands and poured it in his garment and tried to lift it, but he could not and appealed to the Prophet, \"Will you order someone to help me in lifting it?\" The Prophet (ﷺ) said, \"No.\" Then Al-`Abbas said, \"Then will you yourself help me carry it?\" The Prophet (ﷺ) said, \"No.\" Then Al `Abbas threw away some of the money, but even then he was not able to lift it, and so he again requested the Prophet (ﷺ) \"Will you order someone to help me carry it?\" The Prophet said, \"No.\" Then Al-`Abbas said, \"Then will you yourself yelp me carry it?\" The Prophet (ﷺ) said, 'No.\" So, Al-`Abbas threw away some more money and lifted it on his shoulder and went away. The Prophet (ﷺ) kept on looking at him with astonishment at his greediness till he went out of our sight. Allah's Messenger (ﷺ) did not get up from there till not a single Dirham remained from that money",
          "ur": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا، انہوں نے کہا کہ مجھے روح بن قاسم نے خبر دی، انہیں محمد بن منکدر نے بیان کیا کہ جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا کہ اگر ہمارے پاس بحرین سے روپیہ آیا، تو میں تمہیں اتنا، اتنا، اتنا ( تین لپ ) دوں گا۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی اور اس کے بعد بحرین کا روپیہ آیا تو ابوبکر رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے اگر کسی سے کوئی دینے کا وعدہ کیا ہو تو وہ ہمارے پاس آئے۔ چنانچہ میں حاضر ہوا اور عرض کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا کہ اگر بحرین کا روپیہ ہمارے یہاں آیا تو میں تمہیں اتنا، اتنا اور اتنا دوں گا۔ اس پر انہوں نے فرمایا کہ اچھا ایک لپ بھرو، میں نے ایک لپ بھری، تو انہوں نے فرمایا کہ اسے شمار کرو، میں نے شمار کیا تو پانچ سو تھا، پھر انہوں نے مجھے ڈیڑھ ہزار عنایت فرمایا۔",
          "fr": "Rapporté par Jabir bin `Abdullah : Le Messager d’Allah (ﷺ) m’a dit un jour : « Si les revenus de Bahreïn arrivent, je te donnerai ceci et cela. » Quand le Messager d’Allah (ﷺ) est décédé, les revenus de Bahreïn sont arrivés, et Abu Bakr a annoncé : « Que celui à qui le Messager d’Allah (ﷺ) avait promis quelque chose vienne me voir. » Je suis donc allé voir Abu Bakr et j’ai dit : « Le Messager d’Allah (ﷺ) m’a dit : ‘Si les revenus de Bahreïn arrivent, je te donnerai ceci et cela.’ » Alors Abu Bakr m’a dit : « Prends-en avec tes deux mains. » J’ai pris de l’argent avec mes deux mains et Abu Bakr m’a demandé de compter. J’ai compté et il y en avait cinq cents (pièces d’or). Au total, il m’a donné mille cinq cents (pièces d’or). Rapporté par Anas : De l’argent de Bahreïn a été apporté au Prophète (ﷺ). Il a dit : « Étalez-le dans la mosquée. » C’était la plus grande somme jamais apportée au Messager d’Allah (ﷺ). À ce moment-là, Al-`Abbas est venu et a dit : « Ô Messager d’Allah (ﷺ) ! Donne-moi, car j’ai payé la rançon pour moi-même et pour `Aqil. » Le Prophète lui a dit : « Prends. » Il a pris de l’argent avec ses deux mains, l’a versé dans son vêtement et a essayé de le soulever, mais il n’a pas pu et a demandé au Prophète : « Peux-tu demander à quelqu’un de m’aider à le porter ? » Le Prophète (ﷺ) a dit : « Non. » Puis Al-`Abbas a dit : « Alors, veux-tu m’aider toi-même à le porter ? » Le Prophète (ﷺ) a dit : « Non. » Alors Al-`Abbas a laissé tomber une partie de l’argent, mais il n’a toujours pas pu le soulever, et il a de nouveau demandé au Prophète (ﷺ) : « Peux-tu demander à quelqu’un de m’aider à le porter ? » Le Prophète a dit : « Non. » Puis Al-`Abbas a dit : « Alors, veux-tu m’aider toi-même à le porter ? » Le Prophète (ﷺ) a dit : « Non. » Alors Al-`Abbas a encore laissé tomber un peu d’argent, l’a mis sur son épaule et est parti. Le Prophète (ﷺ) l’a regardé avec étonnement à cause de sa cupidité jusqu’à ce qu’il disparaisse de notre vue. Le Messager d’Allah (ﷺ) n’est pas parti de là tant qu’il ne restait plus un seul dirham de cet argent",
          "id": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Isma'il bin Ibrahim] berkata telah mengabarkan kepadaku [Rauh bin Al Qasim] dari [Muhammad bin Al Munkadir] dari [Jabir bin 'Abdullah radliallahu 'anhu] berkata; \"Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Seandainya tiba kepada kita harta dari negeri Bahrain, aku pasti memberimu sekian, sekian dan sekian\". Ketika Rasulullah shallallahu 'alaihi wasallam telah meninggal dunia, dan datang harta dari negeri Bahrain, Abu bakr berkata; \"Siapa yang telah dijanjikan sesuatu oleh Rasulullah shallallahu 'alaihi wasallam hendaklah menemui aku\". Maka aku menemuinya lalu kukatakan; \"Rasulullah shallallahu 'alaihi wasallam pernah berkata kepadaku; \"Seandainya tiba kepada kita harta dari negeri Bahrain aku pasti memberikan kepadamu sekian, sekian dan sekian\". Dia berkata kepadaku; \"Ulurkan tanganmu\". Lalu aku mengulurkan kedua belah telapak tanganku\". Lalu dia berkata kepadaku; \"Hitunglah\". Aku menghitungnya, ternyata jumlahnya lima ratus sehingga keseluruhannya dia memberiku seribu lima ratus\". Dan berkata [Ibrahim bin Thaman] dari ['Abdul 'Aziz bin Shuhaib] dari [Anas]; Nabi shallallahu 'alaihi wasallam dikirimi harta dari Bahrain lalu Beliau berkata: \"Lertakkanlah di masjid\". Terrnyata itu merupalkan harta yang paling banyak yang pernah diterima oleh Rasulullah shallallahu 'alaihi wasallam. Ketika Al 'Abbas mendatangi Beliau, dia berkata; \"Wahai Rasulullah, berilah aku. Akan kugunakan untuk menebus diriku dan menebus 'Aqil\". Beliau berkata: \"Ambillah\". Maka dia mengambilnya dengan menggunakan bajunya lalu dia pergi dengan memanggulnya namun tidak kuat. Dia berkata; \"Perintahkanlah sebagian mereka untuk membantuku mengangkatnya\". Beliau berkata: \"Tidak\". Dia malah berkata: \"Kalau begitu kamu yang membantuku mengangkatnya\". Beliau berkata: \"Tidak\". Maka Al 'Abbas menumpahkan sebagiannya lalu mencoba untuk mengangkatnya kembali namun tetap tidak kuat. Maka dia berkata lagi; \"Perintahkanlah sebagian mereka untuk membantuku mengangkatnya\". Beliau berkata: \"Tidak\". Dia berkata lagi: \"Kalau begitu kamu yang membantuku mengangkatnya\". Beliau berkata: \"Tidak\". Lalu Al 'Abbas menumpahkan lagi sebagiannya kemudian memanggulnya di atas pundaknya lalu pergi. Beliau terus saja memperhatikan Al 'Abbas hingga menghilang dari pandangan kami karena kagum dengan semangatnya dan Rasulullah shallallahu 'alaihi wasallam tidaklah beranjak dari posisinya dan terus mengumpulkan dirham",
          "tr": "Cabir İbn Abdullah r.a.'ın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in bana: \"Bahreyn'in cizye vergileri gelse sana çokça (şu kadar, şu kadar, şu kadar) mal veririm\" dedi. Nebi Sallallahu Aleyhi ve Sellem vefat ettikten sonra bu mallar gelince Hz. Ebu Bekir şöyle bir duyuru yaptırdı: \"Resulullah Sallallahu Aleyhi ve Sellem kime bir söz (vaad) vermişse yanıma gelsin.\" Ben de onun yanına vardım ve: \"Resulullah Sallallahu Aleyhi ve Sellem bana \"Bahreyn'in cizye vergileri gelse sana çokça (şu kadar, şu kadar, şu kadar) mal veririm\" demişti\" diyerek durumu arz ettim. O da bana: \"Avuçla!\" dedi. Ben bir avuç alınca: \"Say bakalım kaç adet para var?!\" dedi. Saydım beş yüz vardı. Ebu Bekir bana toplam bin beş yüz verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 7
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 3166,
      "arabicNumber": 3166,
      "book": 58,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو، حَدَّثَنَا مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَتَلَ مُعَاهَدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ، وَإِنَّ رِيحَهَا تُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Amr:The Prophet (ﷺ) said, \"Whoever killed a person having a treaty with the Muslims, shall not smell the smell of Paradise though its smell is perceived from a distance of forty years",
          "ur": "ہم سے قیس بن حفص نے بیان کیا، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا، انہوں نے کہا ہم سے حسن بن عمرو نے بیان کیا، انہوں نے کہا کہ ہم سے مجاہد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس نے کسی ذمی کو ( ناحق ) قتل کیا وہ جنت کی خوشبو بھی نہ پا سکے گا۔ حالانکہ جنت کی خوشبو چالیس سال کی راہ سے سونگھی جا سکتی ہے۔“",
          "fr": "Rapporté par `Abdullah bin `Amr : Le Prophète (ﷺ) a dit : « Celui qui tue une personne ayant un pacte avec les musulmans ne sentira pas l’odeur du Paradis, bien que son odeur puisse être perçue à une distance de quarante ans. »",
          "id": "Telah bercerita kepada kami [Qais bin Hafsh] telah bercerita kepada kami ['Abdul Wahid] telah bercerita kepada kami [Al Hasan bin 'Amru] telah bercerita kepada kami [Mujahid] dari ['Abdullah bin 'Amru radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang membunuh mu'ahad (orang kafir yang terikat perjanjian) maka dia tidak akan mencium bau surga padahal sesungguhnya bau surga itu dapat dirasakan dari jarak empat puluh tahun perjalanan",
          "tr": "Abdullah İbn Amr Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Anlaşmalı bir gayri müslimi öldüren bir kimse cennetin kokusunu alamaz. Halbuki cennetin kokusu kırk yıllık mesafeden bile duyulur.\" 6. YAHUDİLERİN ARAP YARIMADASINDAN ÇiKARILMASI"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 8
      },
      "narrator": {
        "en": "`Abdullah bin `Amr"
      }
    },
    {
      "hadithNumber": 3167,
      "arabicNumber": 3167,
      "book": 58,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَمَا نَحْنُ فِي الْمَسْجِدِ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْطَلِقُوا إِلَى يَهُودَ ‏\"‏‏.‏ فَخَرَجْنَا حَتَّى جِئْنَا بَيْتَ الْمِدْرَاسِ فَقَالَ ‏\"‏ أَسْلِمُوا تَسْلَمُوا، وَاعْلَمُوا أَنَّ الأَرْضَ لِلَّهِ وَرَسُولِهِ، وَإِنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ مِنْ هَذِهِ الأَرْضِ، فَمَنْ يَجِدْ مِنْكُمْ بِمَالِهِ شَيْئًا فَلْيَبِعْهُ، وَإِلاَّ فَاعْلَمُوا أَنَّ الأَرْضَ لِلَّهِ وَرَسُولِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:While we were in the Mosque, the Prophet (ﷺ) came out and said, \"Let us go to the Jews\" We went out till we reached Bait-ul-Midras. He said to them, \"If you embrace Islam, you will be safe. You should know that the earth belongs to Allah and His Apostle, and I want to expel you from this land. So, if anyone amongst you owns some property, he is permitted to sell it, otherwise you should know that the Earth belongs to Allah and His Apostle",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے سعد مقبری نے بیان کیا، ان سے ان کے والد (ابوسعید) نے کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا ہم ابھی مسجد نبوی میں موجود تھے کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے، اور فرمایا کہ یہودیوں کی طرف چلو۔ چنانچہ ہم روانہ ہوئے اور جب بیت المدراس ( یہودیوں کا مدرسہ ) پہنچے تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسلام لاؤ تو سلامتی کے ساتھ رہو گے اور سمجھ لو کہ زمین اللہ اور اور اس کے رسول کی ہے۔ اور میرا ارادہ ہے کہ تمہیں اس ملک سے نکال دوں، پھر تم میں سے اگر کسی کی جائیداد کی قیمت آئے تو اسے بیچ ڈالے۔ اگر تم اس پر تیار نہیں ہو، تو تمہیں معلوم ہونا چاہئے کہ زمین اللہ اور اس کے رسول ہی کی ہے۔",
          "fr": "Rapporté par Abu Huraira : Alors que nous étions dans la mosquée, le Prophète (ﷺ) est sorti et a dit : « Allons chez les Juifs. » Nous sommes sortis jusqu’à arriver à Bayt-ul-Midras. Il leur a dit : « Si vous acceptez l’islam, vous serez en sécurité. Sachez que la terre appartient à Allah et à Son Messager, et je veux vous expulser de cette terre. Donc, si l’un d’entre vous possède un bien, il lui est permis de le vendre, sinon sachez que la terre appartient à Allah et à Son Messager. »",
          "id": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah bercerita kepada kami [Al LAits] berkata telah bercerita kepadaku [Sa'id Al Maqbariy] dari [bapakmya] dari [Abu Hurairah radliallahu 'anhu] berkata; \"Ketika kami sedang berada di masjid, Nabi shallallahu 'alaihi wasallam keluar seraya berkata: \"Berangkatlah kalian menemui orang-orang Yahudi\". Maka kami keluar hingga ketika sampai di rumah Al Midras, Beliau bersabda: \"Masuklah kedalam Islam maka kalian akan selamat, dan ketahuilah bahwa bumi ini milik Allah dan Rasul-Nya dan aku hendak mengusir kalian dari daerah ini, Maka barangsiapa dari kalian yang memiliki harta hendaklah dia menjualnya. Jika tidak mau, ketahuilah bahwa bumi ini milik Allah dan Rasul-Nya",
          "tr": "Ebu Hureyre r.a.'in şöyle dediği nakledilmiştir: \"Birgün biz mescidde iken Resulullah Sallallahu Aleyhi ve Sellem: \"Haydi Yahudilerin üzerine yürüyün!\" dedi. Biz de hemen çıkıp Beytü'l-midras'a gittik. Resul-i Ekrem Sallallahu Aleyhi ve Sellem onlara: \"Müslüman olun ve kurtulun! İyi bilin ki yeryüzü / bu topraklar Allah'ın ve Resulünündür! Benim amacım sizi bu topraklardan sürmektir. İçinizden kim malına karşılık bir şey bulabiliyorsa onu satsın! Aksi halde iyi bilin ki, yeryüzü Allah'a ve Resulü'ne aittir\" dedi. Tekrar: 6944, 7348. Ayrıntılı açıklama için bkz. Kitabü'l-meğazl, Bab"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 9
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 3168,
      "arabicNumber": 3168,
      "book": 58,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ سُلَيْمَانَ الأَحْوَلِ، سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ يَوْمُ الْخَمِيسِ، وَمَا يَوْمُ الْخَمِيسِ ثُمَّ بَكَى حَتَّى بَلَّ دَمْعُهُ الْحَصَى‏.‏ قُلْتُ يَا أَبَا عَبَّاسٍ، مَا يَوْمُ الْخَمِيسِ قَالَ اشْتَدَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعُهُ فَقَالَ ‏\"‏ ائْتُونِي بِكَتِفٍ أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ أَبَدًا ‏\"‏‏.‏ فَتَنَازَعُوا وَلاَ يَنْبَغِي عِنْدَ نَبِيٍّ تَنَازُعٌ فَقَالُوا مَا لَهُ أَهَجَرَ اسْتَفْهِمُوهُ‏.‏ فَقَالَ ‏\"‏ ذَرُونِي، فَالَّذِي أَنَا فِيهِ خَيْرٌ مِمَّا تَدْعُونِي إِلَيْهِ ـ فَأَمَرَهُمْ بِثَلاَثٍ قَالَ ـ أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ، وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ ‏\"‏‏.‏ وَالثَّالِثَةُ خَيْرٌ، إِمَّا أَنْ سَكَتَ عَنْهَا، وَإِمَّا أَنْ قَالَهَا فَنَسِيتُهَا‏.‏ قَالَ سُفْيَانُ هَذَا مِنْ قَوْلِ سُلَيْمَانَ‏.‏",
        "translations": {
          "en": "Narrated Sa`id bin Jubair:that he heard Ibn `Abbas saying, \"Thursday! And you know not what Thursday is? After that Ibn `Abbas wept till the stones on the ground were soaked with his tears. On that I asked Ibn `Abbas, \"What is (about) Thursday?\" He said, \"When the condition (i.e. health) of Allah's Messenger (ﷺ) deteriorated, he said, 'Bring me a bone of scapula, so that I may write something for you after which you will never go astray.'The people differed in their opinions although it was improper to differ in front of a prophet, They said, 'What is wrong with him? Do you think he is delirious? Ask him (to understand). The Prophet (ﷺ) replied, 'Leave me as I am in a better state than what you are asking me to do.' Then the Prophet (ﷺ) ordered them to do three things saying, 'Turn out all the pagans from the Arabian Peninsula, show respect to all foreign delegates by giving them gifts as I used to do.' \" The sub-narrator added, \"The third order was something beneficial which either Ibn `Abbas did not mention or he mentioned but I forgot",
          "ur": "ہم سے محمد بن سلام نے بیان کیا، ان سے سفیان بن عیینہ نے بیان کیا، ان سے سلیمان احول نے، انہوں نے سعید بن جبیر سے سنا اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا آپ نے جمعرات کے دن کا ذکر کرتے ہوئے کہا، تمہیں معلوم ہے کہ جمعرات کا دن، ہائے! یہ کون سا دن ہے؟ اس کے بعد وہ اتنا روئے کہ ان کے آنسووں سے کنکریاں تر ہو گئیں۔ سعید نے کہا میں نے عرض کیا، یا ابوعباس! جمعرات کے دن سے کیا مطلب ہے؟ انہوں نے کہا کہ اسی دن رسول اللہ صلی اللہ علیہ وسلم کی تکلیف ( مرض الموت ) میں شدت پیدا ہوئی تھی اور آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ مجھے ( لکھنے کا ) ایک کاغذ دے دو تاکہ میں تمہارے لیے ایک ایسی کتاب لکھ جاؤں، جس کے بعد تم کبھی گمراہ نہ ہو۔ اس پر لوگوں کا اختلاف ہو گیا۔ پھر آپ صلی اللہ علیہ وسلم نے خود ہی فرمایا کہ نبی کی موجودگی میں جھگڑنا غیر مناسب ہے، دوسرے لوگ کہنے لگے، بھلا کیا آپ صلی اللہ علیہ وسلم بےکار باتیں فرمائیں گے اچھا، پھر پوچھ لو، یہ سن کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے میری حالت پر چھوڑ دو، کیونکہ اس وقت میں جس عالم میں ہوں، وہ اس سے بہتر ہے جس کی طرف تم مجھے بلا رہے ہو۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے تین باتوں کا حکم فرمایا، کہ مشرکوں کو جزیرہ عرب سے نکال دینا اور وفود کے ساتھ اسی طرح خاطر تواضع کا معاملہ کرنا، جس طرح میں کیا کرتا تھا۔ تیسری بات کچھ بھلی سی تھی، یا تو سعید نے اس کو بیان نہ کیا، یا میں بھول گیا۔ سفیان نے کہا یہ جملہ ( تیسری بات کچھ بھلی سی تھی ) سلیمان احول کا کلام ہے۔",
          "fr": "Rapporté par Sa`id bin Jubair : Il a entendu Ibn `Abbas dire : « Jeudi ! Et vous ne savez pas ce qu’est jeudi ? » Après cela, Ibn `Abbas a pleuré jusqu’à ce que les pierres au sol soient mouillées de ses larmes. Je lui ai alors demandé : « Qu’y a-t-il à propos de jeudi ? » Il a répondu : « Quand l’état de santé du Messager d’Allah (ﷺ) s’est aggravé, il a dit : ‘Apportez-moi une omoplate, afin que j’écrive quelque chose pour vous après quoi vous ne vous égarerez jamais.’ Les gens ont alors eu des avis différents, bien qu’il ne convenait pas de discuter devant un prophète. Ils ont dit : ‘Qu’a-t-il ? Pensez-vous qu’il délire ? Demandez-lui.’ Le Prophète (ﷺ) a répondu : ‘Laissez-moi, je suis dans un meilleur état que ce que vous me demandez de faire.’ Puis le Prophète (ﷺ) leur a ordonné de faire trois choses, disant : ‘Chassez tous les polythéistes de la péninsule arabique, traitez bien tous les délégués étrangers en leur offrant des cadeaux comme je le faisais.’ » Le sous-narrateur a ajouté : « Le troisième ordre était quelque chose de bénéfique qu’Ibn `Abbas n’a pas mentionné ou qu’il a oublié. »",
          "id": "Telah bercerita kepada kami [Muhammad] telah bercerita kepada kami [Ibnu 'Uyainah] dari [Sulaiman bin Abu Muslim Al Ahwal] dia mendengar [Sa'id bin Jubair] mendengar [Ibnu 'Abbas radliallahu 'anhu] berkata; \"Hari Kamis, apakah hari Kamis?\". Kemudian dia menangis hingga air matanya membasahi pasir. Aku bertanya kepadanya Dia berkata; \"Wahai 'Abbas, ada apa dengan hari Kamis?\". Dia berkata; \"Rasulullah Shallallahu'alaihiwasallam bertambah parah sakitnya pada hari Kamis lalu Beliau berkata: \"Berikan aku buku karena aku akan menuliskan untuk kalian suatu ketetapan yang kalian tidak akan sesat setelahnya selama-lamanya\". Kemudian orang-orang bertengkar padahal tidak sepatutnya mereka bertengkar di hadapan Nabi Shallallahu'alaihiwasallam. Mereka ada yang berkata; \"Apakah Beliau terdiam?\". Mereka mencari tahu tentang Beliau Maka Beliau berkata: \"Tinggalkanlah aku. Sungguh aku sedang menghadapi perkara yang lebih baik dari apa yang kalian ajak aku kepadanya\". Lalu Beliau berwasiat dengan tiga hal; \"Usirlah orang-orang musyrikin dari jazirah 'Arab, berilah hadiah kepada tamu (utusan) seperti yang aku pernah berikan kepada mereka\". Dan yang ketiga adalah perkara yang lebih baik, namun apakah Beliau terdiam atau telah mengatakannya namun aku telah lupa\". Sufyan berkata; \"Yang terakhir ini dari perkataan Sulaiman",
          "tr": "İbn Abbas r.a.'in: \"Perşembe günü! Ah Perşembe günü nedir siz nereden bilirisiniz ki?!\" deyip ağladığı, gözyaşlarının yerleri ıslattığı ve daha sonra şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in hastalıktan duyduğu ızdırabı Perşembe günü iyice artmıştı. Bize şöyle buyurdu: \"Bana yazı malzemeleri getirin de size bundan sonra ebediyyen sapıklığa düşmenize engelolacak öğütler yazayım!\" Bunun üzerine orada bulunanlar istenen malzemenin getirilip getirilmemesi konusunda görüş ayrılığına düştüler. Halbuki hiçbir Nebiin huzurunda böylesi bir tartışma yakışık almaz. Sonra• oradakiler: \"Resulullah Sallallahu Aleyhi ve Sellem'in nesi var, Sayıklıyor mu yoksa? Haydi bunu sorup öğrenmeye çalışın! \" dediler. Nebi Sallallahu Aleyhi ve Sellem de: \"Beni rahat bırakın! Benim şu anda içinde bulunduğum durum kesinlikle sizin benden istediğiniz şeylerden daha hayırlıdır!\" buyurdu ve oradakilere şu üç şeyi emretti: \"Müşrikleri Arap yarımadasından çıkarın! Tıpkı benim verdiğim gibi gelen heyetlere hediyeler verin!\" Üçüncü emrini ise ya söylerken sustu ya da söyledi fakat ne dediğini ben unuttum"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 10
      },
      "narrator": {
        "en": "Sa`id bin Jubair"
      }
    },
    {
      "hadithNumber": 3169,
      "arabicNumber": 3169,
      "book": 58,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لَمَّا فُتِحَتْ خَيْبَرُ أُهْدِيَتْ لِلنَّبِيِّ صلى الله عليه وسلم شَاةٌ فِيهَا سُمٌّ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اجْمَعُوا إِلَىَّ مَنْ كَانَ هَا هُنَا مِنْ يَهُودَ ‏\"‏‏.‏ فَجُمِعُوا لَهُ فَقَالَ ‏\"‏ إِنِّي سَائِلُكُمْ عَنْ شَىْءٍ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْهُ ‏\"‏‏.‏ فَقَالُوا نَعَمْ‏.‏ قَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ أَبُوكُمْ ‏\"‏‏.‏ قَالُوا فُلاَنٌ‏.‏ فَقَالَ ‏\"‏ كَذَبْتُمْ، بَلْ أَبُوكُمْ فُلاَنٌ ‏\"‏‏.‏ قَالُوا صَدَقْتَ‏.‏ قَالَ ‏\"‏ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَىْءٍ إِنْ سَأَلْتُ عَنْهُ ‏\"‏ فَقَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ، وَإِنْ كَذَبْنَا عَرَفْتَ كَذِبَنَا كَمَا عَرَفْتَهُ فِي أَبِينَا‏.‏ فَقَالَ لَهُمْ ‏\"‏ مَنْ أَهْلُ النَّارِ ‏\"‏‏.‏ قَالُوا نَكُونُ فِيهَا يَسِيرًا ثُمَّ تَخْلُفُونَا فِيهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اخْسَئُوا فِيهَا، وَاللَّهِ لاَ نَخْلُفُكُمْ فِيهَا أَبَدًا ـ ثُمَّ قَالَ ـ هَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَىْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ ‏\"‏‏.‏ فَقَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ‏.‏ قَالَ ‏\"‏ هَلْ جَعَلْتُمْ فِي هَذِهِ الشَّاةِ سُمًّا ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ مَا حَمَلَكُمْ عَلَى ذَلِكَ ‏\"‏‏.‏ قَالُوا أَرَدْنَا إِنْ كُنْتَ كَاذِبًا نَسْتَرِيحُ، وَإِنْ كُنْتَ نَبِيًّا لَمْ يَضُرَّكَ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:When Khaibar was conquered, a roasted poisoned sheep was presented to the Prophet (ﷺ) as a gift (by the Jews). The Prophet (ﷺ) ordered, \"Let all the Jews who have been here, be assembled before me.\" The Jews were collected and the Prophet (ﷺ) said (to them), \"I am going to ask you a question. Will you tell the truth?\" They said, \"Yes.\" The Prophet (ﷺ) asked, \"Who is your father?\" They replied, \"So-and-so.\" He said, \"You have told a lie; your father is so-and-so.\" They said, \"You are right.\" He said, \"Will you now tell me the truth, if I ask you about something?\" They replied, \"Yes, O Abu Al-Qasim; and if we should tell a lie, you can realize our lie as you have done regarding our father.\" On that he asked, \"Who are the people of the (Hell) Fire?\" They said, \"We shall remain in the (Hell) Fire for a short period, and after that you will replace us.\" The Prophet (ﷺ) said, \"You may be cursed and humiliated in it! By Allah, we shall never replace you in it.\" Then he asked, \"Will you now tell me the truth if I ask you a question?\" They said, \"Yes, O Abu Al-Qasim.\" He asked, \"Have you poisoned this sheep?\" They said, \"Yes.\" He asked, \"What made you do so?\" They said, \"We wanted to know if you were a liar in which case we would get rid of you, and if you are a prophet then the poison would not harm you",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے سعید مقبری نے بیان کیا، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ جب خیبر فتح ہوا تو ( یہودیوں کی طرف سے ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بکری کا یا ایسے گوشت کا ہدیہ پیش کیا گیا جس میں زہر تھا۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جتنے یہودی یہاں موجود ہیں انہیں میرے پاس جمع کرو، چنانچہ وہ سب آ گئے۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دیکھو، میں تم سے ایک بات پوچھوں گا۔ کیا تم لوگ صحیح صحیح جواب دو گے؟ سب نے کہا جی ہاں، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، تمہارے باپ کون تھے؟ انہوں نے کہا کہ فلاں! آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم جھوٹ بولتے ہو، تمہارے باپ تو فلاں تھے۔ سب نے کہا کہ آپ سچ فرماتے ہیں۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا، اگر میں تم سے ایک اور بات پوچھوں تو تم صحیح واقعہ بیان کر دو گے؟ سب نے کہا جی ہاں، اے ابوالقاسم! اور اگر ہم جھوٹ بھی بولیں گے تو آپ ہماری جھوٹ کو اسی طرح پکڑ لیں گے جس طرح آپ نے ابھی ہمارے باپ کے بارے میں ہمارے جھوٹ کو پکڑ لیا، آپ صلی اللہ علیہ وسلم نے اس کے بعد دریافت فرمایا کہ دوزخ میں جانے والے کون لوگ ہوں گے؟ انہوں نے کہا کہ کچھ دنوں کے لیے تو ہم اس میں داخل ہو جائیں گے لیکن پھر آپ لوگ ہماری جگہ داخل کر دئیے جائیں گے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم اس میں برباد رہو، اللہ گواہ ہے کہ ہم تمہاری جگہ اس میں کبھی داخل نہیں کئے جائیں گے۔ پھر آپ نے دریافت فرمایا کہ اگر میں تم سے کوئی بات پوچھوں تو کیا تم مجھ سے صحیح واقعہ بتا دو گے؟ اس مرتبہ بھی انہوں نے یہی کہا کہ ہاں! اے ابوالقاسم! آپ صلی اللہ علیہ وسلم نے دریافت کیا کہ کیا تم نے اس بکری کے گوشت میں زہر ملایا ہے؟ انہوں نے کہا جی ہاں، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تم نے ایسا کیوں کیا؟ انہوں نے کہا کہ ہمارا مقصد یہ تھا کہ اگر آپ جھوٹے ہیں ( نبوت میں ) تو ہمیں آرام مل جائے گا اور اگر آپ واقعی نبی ہیں تو یہ زہر آپ کو کوئی نقصان نہ پہنچا سکے گا۔",
          "fr": "Rapporté par Abu Huraira : Quand Khaybar a été conquise, un mouton rôti empoisonné a été offert au Prophète (ﷺ) comme cadeau (par les Juifs). Le Prophète (ﷺ) a ordonné : « Que tous les Juifs présents ici soient rassemblés devant moi. » Les Juifs ont été rassemblés et le Prophète (ﷺ) leur a dit : « Je vais vous poser une question. Direz-vous la vérité ? » Ils ont répondu : « Oui. » Le Prophète (ﷺ) a demandé : « Qui est votre père ? » Ils ont répondu : « Un tel. » Il a dit : « Vous avez menti ; votre père est un tel. » Ils ont dit : « Tu as raison. » Il a dit : « Direz-vous maintenant la vérité si je vous interroge sur quelque chose ? » Ils ont répondu : « Oui, ô Abu Al-Qasim ; et si nous mentons, tu le sauras comme tu l’as fait pour notre père. » Il a alors demandé : « Qui sont les gens du Feu (de l’Enfer) ? » Ils ont répondu : « Nous resterons dans le Feu (de l’Enfer) pour une courte période, puis vous nous remplacerez. » Le Prophète (ﷺ) a dit : « Vous pouvez être maudits et humiliés dedans ! Par Allah, nous ne vous remplacerons jamais dedans. » Puis il a demandé : « Direz-vous maintenant la vérité si je vous pose une question ? » Ils ont dit : « Oui, ô Abu Al-Qasim. » Il a demandé : « Avez-vous empoisonné ce mouton ? » Ils ont dit : « Oui. » Il a demandé : « Pourquoi avez-vous fait cela ? » Ils ont répondu : « Nous voulions savoir si tu étais un menteur, auquel cas nous nous débarrasserions de toi, et si tu étais un prophète, alors le poison ne te ferait pas de mal. »",
          "id": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah bercerita kepada kami [Al Laits] berkata telah bercerita kepadaku [Sa'id bin Abu Sa'id Al Maqbariy] dari [Abu Hurairah radliallahu 'anhu] berkata; \"Ketika Khaibar ditaklukan, Nabi shallallahu 'alaihi wasallam diberi hadiah seekor kambing yang didalamnya ditaruh racun. Maka Nabi shallallahu 'alaihi wasallam berkata: \"Kumpulkan di hadapanku orang-orang yang ada disini dari kalangan Yahudi\". Maka mereka berkumpul di hadapan Beliau lalu Beliau berkata: \"Aku bertanya satu hal kepada kalian, apakah kalian akan membenarkan aku tentang suatu masalah?\". Mereka menjawab; \"Ya\". Nabi shallallahu 'alaihi wasallam bertanya kepada mereka: \"Siapa orang tua kalian\". Mereka menjawab; \"Si fulan\". Beliau berkata: \"Kalian berdusta. Yang sebenarnya orang tua kalian adalah si anu\". Mereka berkata; \"Anda benar\". Lalu Beliau bertanya lagi: \"Apakah kalian akan membenarkan aku tentang suatu masalah yang akan aku tanyakan?\". Mereka menjawab; \"Ya, wahai Abu Al Qasim. Seandainya kami berdusta, Anda pasti mengetahui kedustaan kami sebagaimana Anda mengetahui orangtua kami\". Beliau bertanya: \"Siapakah yang menjadi penduduk neraka?\". Mereka menjawab; \"Kami akan berada di dalamnya sebentar lalu kalian (kaum Muslimin) akan mengiringi masuk ke dalamnya\". Nabi shallallahu 'alaihi wasallam berkata: \"Tinggallah kalian dengan hina di dalamnya. Demi Allah, sungguh kami tidak akan mengikuti kalian ke dalamnya selama-lamanya\". Kemudian Beliau bertanya lagi: \"Apakah kalian akan membenarkan aku tentang suatu masalah yang akan aku tanyakan?\". Mereka menjawab; \"Ya, wahai Abu Al Qasim\". Beliau bertanya: \"Apakah kalian telah memasukkan racun ke dalam kambing ini?\". Mereka menjawab; \"Ya\". Beliau bertanya lagi: \"Apa yang mendorong lkalian berbuat begitu?\". Mereka menjawab; \"Kami hanya ingin menguji Seandainya anda berdusta (mengaku sebagai Nabi) kami dapat beristirahat dari anda. Dan seandainya anda benar seorang Nabi maka racun itu tidak akan dapat mendatangkan bahaya buat anda",
          "tr": "Ebu Hureyre r.a.'in şöyle dediği nakledilmiştir: \"Hayber fethedilince Resulullah Sallallahu Aleyhi ve Sellem'e zehirli koyun eti ikram edilmişti. Bunun üzerine Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Burada bulunan bütün Yahudileri toplayıp yanıma getirin!\" dedi. Yahudiler getirilince Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ben size bir soru soracağım. Bana karşı dürüst olup doğru cevap verecek misiniz?\" Onlar: \"Evet\" deyince Resulullah Sallallahu Aleyhi ve Sellem: \"Sizin babanız / atanız kimdir?\" diye sordu. Orada bulunan Yahudiler: \"Falancadır\" dediler. Fakat Nebi Sallallahu Aleyhi ve Sellem: \"Yalan söylediniz, sizin atanız falandır!\" dedi. Onlar da Resulullah Sallallahu Aleyhi ve Sellem'i tasdik edip yalan söylediklerini kabul ettiler. Resulullah Sallallahu Aleyhi ve Sellem tekrar: \"Size bir soru daha soracak olursam bana karşı dürüst davranıp doğru cevap verir misiniz?\" buyurdu. Onlar da: \"Evet, ey Ebe'l-Kasım. Eğer biz yalan söyleyecek olursak zaten biraz önce atamız hakkında söylediğimiz yalanı bildiğin gibi bunu da bilirsin\" dediler. Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Cehennemlik olanlar kimlerdir?\" diye sordu. Onlar da: \"Biz cehennemde çok kısa bir süre kalacağız. Sonra da bizim yerimizi siz alacaksınız\" dediler. Resulullah Sallallahu Aleyhi ve Sellem: \"Orada ebediyen kalacaksınız! Siz cehennemde hor ve hakir bir şekilde kalacaksınız! Biz de asla cehennemde sizin yerinizi almayacağız!\" buyurdu ve tekrar: \"Size bir soru daha soracak olursam bana karşı dürüst davranıp doğru cevap verir misiniz?\" diye sordu. Onlar: \"Evet, ey Ebu'l-Kasım\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Siz bu koyun etine zehir kattınız mı?\" dedi. Onlar zehir kattıklarını kabul edince Resulullah Sallallahu Aleyhi ve Sellem: \"Sizin bunu yapmaktan maksadınız neydi?\" diyerek niçin bunu yaptıklarını sordu. Onlar da şu cevabı verdiler: \"Nebilik iddianda yalancı olduğunu anladığımızda artık rahat edecektik. Fakat eğer bir Nebisen bu zehirli et sana zarar vermeyecekti\" Tekrar: 4249, 5777 Ayrıntılı açıklama için bkz. Kitabü'l-meğazi, Bab, 41. BU ZEHRİN NEBİ S.A.V.’İN VEFATINA SEBEP OLDUĞUNA DAİR HADİS İÇİM TIKLA 8. DEVLET BAŞKANININ (İMAM) SÖZÜNDE DURMAYANLARA BEDDUA ETMESİ"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 11
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 3170,
      "arabicNumber": 3170,
      "book": 58,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ، قَالَ سَأَلْتُ أَنَسًا ـ رضى الله عنه ـ عَنِ الْقُنُوتِ‏.‏ قَالَ قَبْلَ الرُّكُوعِ‏.‏ فَقُلْتُ إِنَّ فُلاَنًا يَزْعُمُ أَنَّكَ قُلْتَ بَعْدَ الرُّكُوعِ، فَقَالَ كَذَبَ‏.‏ ثُمَّ حَدَّثَنَا عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَنَتَ شَهْرًا بَعْدَ الرُّكُوعِ يَدْعُو عَلَى أَحْيَاءٍ مِنْ بَنِي سُلَيْمٍ ـ قَالَ ـ بَعَثَ أَرْبَعِينَ أَوْ سَبْعِينَ ـ يَشُكُّ فِيهِ ـ مِنَ الْقُرَّاءِ إِلَى أُنَاسٍ مِنَ الْمُشْرِكِينَ، فَعَرَضَ لَهُمْ هَؤُلاَءِ فَقَتَلُوهُمْ، وَكَانَ بَيْنَهُمْ وَبَيْنَ النَّبِيِّ صلى الله عليه وسلم عَهْدٌ، فَمَا رَأَيْتُهُ وَجَدَ عَلَى أَحَدٍ مَا وَجَدَ عَلَيْهِمْ‏.‏",
        "translations": {
          "en": "Narrated `Asim:I asked Anas about the Qunut (i.e. invocation in the prayer). Anas said, \"It should be recited before bowing.\" I said, \"So-and-so claims that you say that it should be recited after bowing.\" He replied, \"He is mistaken.\" Then Anas narrated to us that the Prophet (ﷺ) invoked evil on the tribe of Bani-Sulaim for one month after bowing. ' Anas Further said, \"The Prophet (ﷺ) had sent 40 or 70 Qaris (i.e. men well versed in the knowledge of the Qur'an) to some pagans, but the latter struggled with them and martyred them, although there was a peace pact between them and the Prophet (ﷺ) I had never seen the Prophet so sorry and worried about anybody as he was about them (i.e. the Qaris)",
          "ur": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے ثابت بن یزید نے بیان کیا، ہم سے عاصم احول نے، کہا کہ میں نے انس رضی اللہ عنہ سے دعا قنوت کے بارے میں پوچھا تو آپ نے فرمایا کہ رکوع سے پہلے ہونی چاہئے، میں نے عرض کیا کہ فلاں صاحب ( محمد بن سیرین ) تو کہتے ہیں کہ آپ نے کہا تھا کہ رکوع کے بعد ہوتی ہے، انس رضی اللہ عنہ نے اس پر کہا تھا کہ انہوں نے غلط کہا ہے۔ پھر انہوں نے ہم سے یہ حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم نے ایک مہینے تک رکوع کے بعد دعا قنوت کی تھی۔ اور آپ نے اس میں بنو سلیم کے قبیلوں کے حق میں بددعا کی تھی۔ انہوں نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے چالیس یا ستر قرآن کے عالم صحابہ کی ایک جماعت، راوی کو شک تھا، مشرکین کے پاس بھیجی تھی، لیکن بنو سلیم کے لوگ ( جن کا سردار عامر بن طفیل تھا ) ان کے آڑے آئے اور ان کو مار ڈالا۔ حالانکہ نبی کریم صلی اللہ علیہ وسلم سے ان کا معاہدہ تھا۔ ( لیکن انہوں نے دغا دی ) آپ صلی اللہ علیہ وسلم کو کسی معاملہ پر اتنا رنجیدہ اور غمگین نہیں دیکھا جتنا ان صحابہ کی شہادت پر آپ رنجیدہ تھے۔",
          "fr": "Rapporté par `Asim : J’ai demandé à Anas à propos du Qunut (c’est-à-dire l’invocation dans la prière). Anas a dit : « Elle doit être récitée avant l’inclinaison. » J’ai dit : « Un tel prétend que tu dis qu’elle doit être récitée après l’inclinaison. » Il a répondu : « Il se trompe. » Puis Anas nous a raconté que le Prophète (ﷺ) a invoqué contre la tribu de Bani-Sulaim pendant un mois après l’inclinaison. » Anas a ajouté : « Le Prophète (ﷺ) avait envoyé 40 ou 70 Qaris (c’est-à-dire des hommes très instruits dans la connaissance du Coran) chez des polythéistes, mais ces derniers les ont combattus et tués, alors qu’il y avait un pacte de paix entre eux et le Prophète (ﷺ). Je n’ai jamais vu le Prophète aussi triste et préoccupé pour quelqu’un que pour eux (c’est-à-dire les Qaris). »",
          "id": "Telah bercerita kepada kami [Abu an-Nu'man] telah bercerita kepada kami [Tsabit bin Azid] telah bercerita kepada kami ['Ashim] berkata aku bertanya kepada [Anas radliallahu 'anhu] tentang (membaca do'a) qunut sebelum ruku'. Aku katakan; \"Seseorang berpendapat bahwa anda mengatakan qunut setelah ruku'?\". Maka dia menjawab; \"Orang itu berdusta\". Kemudian dia bercerita kepada kami dari Nabi shallallahu 'alaihi wasallam bahwa Beliau pernah membaca do'a qunut setelah ruku' untuk memohon kebinasaan orang-orang yang masih hidup dari Bani Sulaim\". Dia berkata; \"Beliau mengutus empat puluh atau tujuh puluh, (dia ragu jumlah pastinya), para penghapal al-Qur'an kepada beberapa orang musyrikin lalu Beliau menawarkan para penghafal al-Qur'an itu kepada mereka namun mereka membantainya. Saat itu antara mereka dan Nabi shallallahu 'alaihi wasallam sudah ada perjanjian. Aku belum pernah melihat Beliau marah seperti marahnya Beliau terhadap para pembantai itu",
          "tr": "Asım anlatıyor: \"Enes İbn Malik r.a.'e kunut duasını sordum ve aramızda şöyle bir konuşma geçti: - Kunut rüku'dan önce okunur. - Fakat falanca kişi bana senin Kunut rükudan sonra okunur dediğini nakletti. - Yalan söylemiş / yanılmış. Enes İbn Malik r.a. daha sonra Resulullah Sallallahu Aleyhi ve Sellem'in rüku'dan sonra bir ay boyunca Kunut okuyarak Süleym oğullarının bazı kollarına beddua ettiğini söyledi ve buna sebep olan olayı anlattı: Resul-i Ekrem Sallallahu Aleyhi ve Sellem ashabının önde gelenlerinden Kur'an bilgileri üst düzeyde (kurra) kırk veya yetmiş kişiyi müşrikleri eğitmeleri için göndermişti. Fakat onlar ihanet edip bu sahabıleri şehit ettiler. Halbuki bu müşriklerle Resulullah Sallallahu Aleyhi ve Sellem arasında anlaşma da vardı. Ben Resulullah Sallallahu Aleyhi ve Sellem'in bu şehitlere üzüldüğü kadar başka birisine üzüldüğünü görmedim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 12
      },
      "narrator": {
        "en": "`Asim"
      }
    },
    {
      "hadithNumber": 3171,
      "arabicNumber": 3171,
      "book": 58,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَبَا مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ ابْنَةِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ ابْنَةَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ، وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ، فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ فَقُلْتُ أَنَا أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ‏.‏ فَقَالَ ‏\"‏ مَرْحَبًا بِأُمِّ هَانِئٍ ‏\"‏‏.‏ فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ، فَصَلَّى ثَمَانَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ، فَقُلْتُ يَا رَسُولَ اللَّهِ، زَعَمَ ابْنُ أُمِّي عَلِيٌّ أَنَّهُ قَاتِلٌ رَجُلاً قَدْ أَجَرْتُهُ فُلاَنُ بْنُ هُبَيْرَةَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ ‏\"‏‏.‏ قَالَتْ أُمُّ هَانِئٍ وَذَلِكَ ضُحًى‏.‏",
        "translations": {
          "en": "Narrated Um Hani:the daughter of Abu Talib: I went to Allah's Messenger (ﷺ) on the day of the conquest of Mecca and found him taking a bath, and his daughter Fatima was screening him. I greeted him and he asked, \"Who is that?\" I said, \"I, Um Hani bint Abi Talib.\" He said, \"Welcome, O Um Hani.\" When he had finished his bath, he stood up and offered eight rak`at while dressed in one garment. I said, \"O Allah's Messenger (ﷺ)! My brother `Ali has declared that he will kill a man to whom I have granted asylum. The man is so and-so bin Hubaira.\" Allah's Messenger (ﷺ) said, \"O Um Hani! We will grant asylum to the one whom you have granted asylum.\" (Um Hani said, \"That (visit) took place in the Duha (i.e. forenoon)",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں عمرو بن عبداللہ کے غلام ابوالنضر نے، انہیں ام ہانی بنت ابی طالب کے غلام ابومرہ نے خبر دی، انہوں نے ام ہانی بنت ابی طالب رضی اللہ عنہا سے سنا، آپ بیان کرتی تھیں کہ فتح مکہ کے موقع پر میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ( مکہ میں ) میں نے دیکھا کہ آپ غسل کر رہے تھے اور فاطمہ رضی اللہ عنہا آپ کی صاحبزادی پردہ کئے ہوئے تھیں۔ میں نے آپ کو سلام کیا، تو آپ نے دریافت فرمایا کہ کون صاحبہ ہیں؟ میں نے عرض کیا کہ میں ام ہانی بنت ابی طالب ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا، آؤ اچھی آئیں، ام ہانی! پھر جب آپ صلی اللہ علیہ وسلم غسل سے فارغ ہوئے تو آپ نے کھڑے ہو کر آٹھ رکعت چاشت کی نماز پڑھی۔ آپ صلی اللہ علیہ وسلم صرف ایک کپڑا جسم اطہر پر لپیٹے ہوئے تھے۔ میں نے عرض کیا: یا رسول اللہ! میری ماں کے بیٹے علی رضی اللہ عنہ کہتے ہیں کہ وہ ایک شخص کو جسے میں پناہ دے چکی ہوں، قتل کئے بغیر نہیں رہیں گے۔ یہ شخص ہبیرہ کا فلاں لڑکا ( جعدہ ) ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، ام ہانی! جسے تم نے پناہ دی، اسے ہماری طرف سے بھی پناہ ہے۔ ام ہانی رضی اللہ عنہا نے بیان کیا کہ یہ وقت چاشت کا تھا۔",
          "fr": "Rapporté par Um Hani, la fille d’Abu Talib : Je suis allée voir le Messager d’Allah (ﷺ) le jour de la conquête de La Mecque et je l’ai trouvé en train de prendre un bain, et sa fille Fatima le cachait avec un tissu. Je l’ai salué et il a demandé : « Qui est là ? » J’ai répondu : « C’est moi, Um Hani bint Abi Talib. » Il a dit : « Bienvenue, ô Um Hani. » Quand il a fini son bain, il s’est levé et a prié huit unités de prière vêtu d’un seul vêtement. J’ai dit : « Ô Messager d’Allah (ﷺ) ! Mon frère `Ali a déclaré qu’il allait tuer un homme à qui j’ai accordé l’asile. Cet homme est un tel, fils de Hubaira. » Le Messager d’Allah (ﷺ) a dit : « Ô Um Hani ! Nous accorderons l’asile à celui à qui tu l’as accordé. » (Um Hani a dit : « Cette visite a eu lieu dans la matinée. »)",
          "id": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu An Nadlar, maula 'Umar bin 'Ubaidullah] bahwa [Abu Murrah, maula Ummu Hani' binti Abu Thalib] mengabarkan kepadanya bahwa dia mendengar [Ummu Hani' binti AbuThalib] berkata; \"Aku pergi menemui Rasulullah shallallahu 'alaihi wasallam pada hari pembebasan Makkah ternyata Beliau sedang mandi, dan Fathimah, putri Beliau menutupinya dengan tabir. Aku memberi salam kepada Beliau lalu Beliau bertanya: \"Siapa ini?\". Aku jawab; \"Aku Ummu Hani' binti Abu Thalib\". Beliau berkata: \"Marhaban (selamat datang) Ummu Hani'\". Setelah selesai mandi, Beliau shalat delapan raka'at dengan berselimut pada satu baju. Aku berkata: \"Wahai Rasulullah, anak ibuku ('Ali bin Abu Thalib radliallahu 'anhu) mengatakan dia telah membunuh seseorang yang telah kulindungi, yakni Fulan bin Hubairah\". Maka Rasulullah Shallallahu'alaihiwasallam bersabda: \" Kami melindungi seseorang yang kau lindungi wahai Ummu Hani'\". Ummu Hani' berkata: \"Saat itu adalah waktu dhuha",
          "tr": "Ebu Talib'in kızı Ümmü Hani' anlatıyor: \"Mekke'nin fethedildiği yıl idi. Resulullah Sallallahu Aleyhi ve Sellem'in yanına gittim. O sırada yıkanıyordu / boy abdesti alıyordu. Kızı Fatıma da görünmemesi için etrafında bir örtü tutuyordu. İçeri girip Resul-i Ekrem Sallallahu Aleyhi ve Sellem'e selam verdim. \"Bu gelen kadın kimdir?\" diye sordu. Ben de: \"Ebu Talib'in kızı Ümmü Hani\" deyince \"Hoş geldin Ümmü Hani, merhaba sana!\" dedi. Boy abdesti alınca kalktı ve tek parça bir elbiseye bürünerek sekiz rekat namaz kıldı. Ben: \"Ey Allah'ın Resulü, anamın oğlu Ali İbn Ebi Talib, benim eman verip korumam altına aldığım Hübeyre'nin oğlu falancayı öldüreceğini söylüyor!\" dedim. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Senin eman verip koruman altına aldığın kimse bizim de korumamız altındadır.\" Resulullah Sallallahu Aleyhi ve Sellem'e yaptığım bu ziyaret bir kuşluk vaktinde olmuştu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 13
      },
      "narrator": {
        "en": "Um Hani"
      }
    },
    {
      "hadithNumber": 3172,
      "arabicNumber": 3172,
      "book": 58,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ خَطَبَنَا عَلِيٌّ فَقَالَ مَا عِنْدَنَا كِتَابٌ نَقْرَؤُهُ إِلاَّ كِتَابُ اللَّهِ، وَمَا فِي هَذِهِ الصَّحِيفَةِ فَقَالَ فِيهَا الْجِرَاحَاتُ وَأَسْنَانُ الإِبِلِ، وَالْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى كَذَا، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا أَوْ آوَى فِيهَا مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ تَوَلَّى غَيْرَ مَوَالِيهِ فَعَلَيْهِ مِثْلُ ذَلِكَ، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ مِثْلُ ذَلِكَ‏.‏",
        "translations": {
          "en": "Narrated Ibrahim at-Tamimi's father:`Ali delivered a sermon saying, \"We have no book to read except the Book of Allah and what is written in this paper which contains verdicts regarding (retaliation for) wounds, the ages of the camels (given as Zakat or as blood money) and the fact that Medina is a sanctuary in between Air mountain to so-and-so (mountain). So, whoever innovates in it an heresy or commits a sin or gives shelter in it, to such an innovator will incur the Curse of Allah, the angels and all the people, and none of his compulsory or optional good deeds of worship will be accepted. And whoever (freed slave) takes as his master (i.e. befriends) other than his real masters will incur the same (Curse). And the asylum granted by any Muslim is to be secured by all the other Muslims, and whoever betrays a Muslim in this respect will incur the same (Curse)",
          "ur": "مجھ سے محمد بن سلام نے بیان کیا، کہا ہم کو وکیع نے خبر دی، انہیں اعمش نے، انہیں ابراہیم تیمی نے، ان سے ان کے باپ (یزید بن شریک تیمی) نے بیان کیا کہ علی رضی اللہ عنہ نے ہمارے سامنے خطبہ دیا، جس میں فرمایا کہ کتاب اللہ اور اس ورق میں جو کچھ ہے، اس کے سوا اور کوئی کتاب ( احکام شریعت کی ) ایسی ہمارے پاس نہیں جسے ہم پڑھتے ہوں، پھر آپ نے فرمایا کہ اس میں زخموں کے قصاص کے احکام ہیں اور دیت میں دئیے جانے والے کی عمر کے احکام ہیں اور یہ کہ مدینہ حرم ہے عیر پہاڑی سے فلاں ( احد پہاڑی ) تک۔ اس لیے جس شخص نے کوئی نئی بات ( شریعت کے اندر داخل کی ) یا کسی ایسے شخص کو پناہ دی تو اس پر اللہ، ملائکہ اور انسان سب کی لعنت ہے، نہ اس کی کوئی فرض عبادت قبول ہو گی اور نہ نفل۔ اور یہ بیان ہے جو لونڈی غلام اپنے مالک کے سوا کسی دوسرے کو مالک بنائے اس پر بھی اس طرح ( لعنت ) ہے۔ اور مسلمان مسلمان سب برابر ہیں ہر ایک کا ذمہ یکساں ہے۔ پس جس شخص نے کسی مسلمان کی پناہ میں ( جو کسی کافر کو دی گئی ہو ) دخل اندازی کی تو اس پر بھی اسی طرح لعنت ہے۔",
          "fr": "Rapporté par le père d'Ibrahim at-Tamimi : `Ali prononça un sermon et dit : « Nous n’avons d’autre livre à lire que le Livre d’Allah et ce qui est écrit sur ce feuillet, où sont notés des jugements concernant les blessures (et les représailles), l’âge des chameaux (donnés en Zakat ou comme prix du sang), et le fait que Médine est un sanctuaire entre la montagne d’Air et telle ou telle montagne. Donc, celui qui y introduit une innovation ou commet un péché, ou accorde refuge à un innovateur, subira la malédiction d’Allah, des anges et de tous les gens, et aucune de ses bonnes actions obligatoires ou surérogatoires ne sera acceptée. Et quiconque (un esclave affranchi) prend comme maître quelqu’un d’autre que ses véritables maîtres subira la même malédiction. L’asile accordé par un musulman doit être respecté par tous les musulmans, et celui qui trahit un musulman à ce sujet subira la même malédiction. »",
          "id": "Telah bercerita kepada kami [Muhammad] telah mengabarkan kepada kami [Waki'] dari [Al A'masy] dari [Ibrahim at-Taymiy] dari [bapaknya] berkata; \" ['Ali] menyampaikan khathbah kepada kami, katanya; \"Tidak ada kitab yang kita baca selain Kitab Allah Ta'ala ini dan apa yang ada pada ash-shahifah (lembaran-lembaran hadits) ini\", yang Beliau Shallallahu'alaihiwasallam bersabda, isinya: \"Disana disebutkan penjelasan hukum luka-luka sekaligus masa berlakunya dan Madinah adalah tanah suci yang wilayahnya antara sumber air hingga wilayah anu. Maka barangsiapa yang berbuat kemungkaran (bid'ah) yang dilarang agama didalamnya atau membantu orang berbuat bid'ah maka orang itu akan mendapat laknat dari Allah, para malaikat dan seluruh manusia dan tidak akan diterima darinya amalan 'ibadah wajib dan sunnahnya\" (atau taubat dan tebusannya). Dan siappaun budak yang berwala' bukan kepada majikannya, maka dia akan mendapat hukuman seperti itu juga, dan perlindungan Kaum Muslimin adalah satu, maka barangsiapa melepas ikatan perjanjian dengan seorang muslim maka orang itu akan mendapat hukuman seperti itu juga",
          "tr": "İbrahim et-Teymi babasının şöyle dediğini nakletmiştir: \"Hz. Ali bir gün bize hutbe irad ederek şunları söyledi: \"Bizim elimizde Allah'ın kitabından ve işte şu yazılı sahifeden başka bir şey yoktur. Bu belgede ise yaralama suçlarına verilecek ceza, zekat alınacak develerin yaşları ve Ayir (Air) Dağı ile şurası arasında kadar Medine'nin haram bölge olduğu kayıtlıdır. Kim bu konuda aslı olmayan yeni bir şey türetirse veya asılsız yenilikler türetenlere baş vurursa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun. Böyle bir kimsenin ne tevbesi ne de fidyesi kabul edilir. Efendisinden başka birisine ait olduğunu / kendisini azat eden kişinin başka birisi olduğunu iddia eden köle de aynı lanete uğrasın! Müslümanların verdiği koruma güvencesi ve eman tektir; bu bakımdan en alt derecede bulunan bir Müslümanın verdiği koruma güvencesi herkesi bağlar. Kim bir Müslümana verdiği söze ihanet edip ahdini bozarsa o da aynı lanete uğrasın!\" Ayrıntılı açıklama için bkz. Kitabü fedaili'l-Medıne, Bab, 1; Kitabü'l-feraiz, Bab"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 14
      },
      "narrator": {
        "en": "Ibrahim at-Tamimi's father"
      }
    },
    {
      "hadithNumber": 3173,
      "arabicNumber": 3173,
      "book": 58,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ ـ هُوَ ابْنُ الْمُفَضَّلِ ـ حَدَّثَنَا يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، قَالَ انْطَلَقَ عَبْدُ اللَّهِ بْنُ سَهْلٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ إِلَى خَيْبَرَ، وَهْىَ يَوْمَئِذٍ صُلْحٌ، فَتَفَرَّقَا، فَأَتَى مُحَيِّصَةُ إِلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ وَهْوَ يَتَشَحَّطُ فِي دَمٍ قَتِيلاً، فَدَفَنَهُ ثُمَّ قَدِمَ الْمَدِينَةَ، فَانْطَلَقَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَمُحَيِّصَةُ وَحُوَيِّصَةُ ابْنَا مَسْعُودٍ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ فَقَالَ ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏‏.‏ وَهْوَ أَحْدَثُ الْقَوْمِ، فَسَكَتَ فَتَكَلَّمَا فَقَالَ ‏\"‏ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ قَاتِلَكُمْ أَوْ صَاحِبَكُمْ ‏\"‏‏.‏ قَالُوا وَكَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ وَلَمْ نَرَ قَالَ ‏\"‏ فَتُبْرِيكُمْ يَهُودُ بِخَمْسِينَ ‏\"‏‏.‏ فَقَالُوا كَيْفَ نَأْخُذُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَعَقَلَهُ النَّبِيُّ صلى الله عليه وسلم مِنْ عِنْدِهِ‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Abi Hathma:`Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid set out to Khaibar, the inhabitants of which had a peace treaty with the Muslims at that time. They parted and later on Muhaiyisa came upon `Abdullah bin Sahl and found him murdered agitating in his blood. He buried him and returned to Medina. `Abdur Rahman bin Sahl, Muhaiyisa and Huwaiyisa, the sons of Mas`ud came to the Prophet (ﷺ) and `Abdur Rahman intended to talk, but the Prophet (ﷺ) said (to him), \"Let the eldest of you speak.\" as `Abdur-Rahman was the youngest:. `Abdur-Rahman kept silent and the other two spoke. The Prophet (ﷺ) said, \"If you swear as to who has committed the murder, you will have the right to take your right from the murderer.\" They said, \"How should we swear if we did not witness the murder or see the murderer?\" The Prophet (ﷺ) said, \"Then the Jews can clear themselves from the charge by taking Alaska (an oath taken by men that it was not they who committed the murder).\" The!y said, \"How should we believe in the oaths of infidels?\" So, the Prophet (ﷺ) himself paid the blood money (of `Abdullah). (See Hadith No. 36 Vol)",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے بشر بن مفضل نے، کہا ہم سے یحییٰ بن سعید انصاری نے، ان سے بشیر بن یسار نے اور ان سے سہل بن ابی حثمہ نے بیان کیا کہ عبداللہ بن سہل اور محیصہ بن مسعود بن زید رضی اللہ عنہما خیبر گئے۔ ان دنوں ( خیبر کے یہودیوں سے مسلمانوں کی ) صلح تھی۔ پھر دونوں حضرات ( خیبر پہنچ کر اپنے اپنے کام کے لیے ) جدا ہو گئے۔ اس کے بعد محیصہ رضی اللہ عنہ عبداللہ بن سہل رضی اللہ عنہ کے پاس آئے تو کیا دیکھتے ہیں کہ وہ خون میں لوٹ رہے ہیں۔ کسی نے ان کو قتل کر ڈالا، خیر محیصہ رضی اللہ عنہ نے عبداللہ رضی اللہ عنہ کو دفن کر دیا۔ پھر مدینہ آئے، اس کے بعد عبدالرحمٰن بن سہل ( عبداللہ رضی اللہ عنہ کے بھائی ) اور مسعود کے دونوں صاحبزادے محیصہ اور حویصہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، گفتگو عبدالرحمٰن رضی اللہ عنہ نے شروع کی، تو آپ صلی اللہ علیہ وسلم نے فرمایا، کہ جو تم لوگوں میں عمر میں بڑے ہوں وہ بات کریں۔ عبدالرحمٰن سب سے کم عمر تھے، وہ چپ ہو گئے۔ اور محیصہ اور حویصہ نے بات شروع کی۔ آپ نے دریافت کیا، کیا تم لوگ اس پر قسم کھا سکتے ہو، کہ جس شخص کو تم قاتل کہہ رہے ہو اس پر تمہارا حق ثابت ہو سکے۔ ان لوگوں نے عرض کیا کہ ہم ایک ایسے معاملے میں کس طرح قسم کھا سکتے ہیں جس کو ہم نے خود اپنی آنکھوں سے نہ دیکھا ہو۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کیا یہود تمہارے دعوے سے اپنی برات اپنی طرف سے پچاس قسمیں کھا کر کے کر دیں؟ ان لوگوں نے عرض کیا کہ کفار کی قسموں کا ہم کس طرح اعتبار کر سکتے ہیں۔ چنانچہ آپ صلی اللہ علیہ وسلم نے خود اپنے پاس سے ان کو دیت ادا کر دی۔",
          "fr": "Rapporté par Sahl bin Abi Hathma : `Abdullah bin Sahl et Muhaiyisa bin Mas`ud bin Zaid partirent à Khaybar, dont les habitants avaient un traité de paix avec les musulmans à ce moment-là. Ils se séparèrent, puis Muhaiyisa trouva `Abdullah bin Sahl tué, baignant dans son sang. Il l’enterra et retourna à Médine. `Abdur Rahman bin Sahl, Muhaiyisa et Huwaiuisa, les fils de Mas`ud, vinrent voir le Prophète (ﷺ). `Abdur Rahman voulut parler, mais le Prophète (ﷺ) lui dit : « Que le plus âgé d’entre vous parle. » Comme `Abdur Rahman était le plus jeune, il se tut et les deux autres parlèrent. Le Prophète (ﷺ) dit : « Si vous jurez sur l’identité du meurtrier, vous aurez le droit de réclamer justice. » Ils dirent : « Comment pourrions-nous jurer alors que nous n’avons pas vu le meurtre ni le meurtrier ? » Le Prophète (ﷺ) dit : « Alors, les Juifs peuvent se disculper en prêtant le serment (Al-Qasama) qu’ils ne sont pas les auteurs du meurtre. » Ils dirent : « Comment pourrions-nous croire au serment d’incroyants ? » Alors, le Prophète (ﷺ) paya lui-même le prix du sang de `Abdullah",
          "id": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Bisyir, dia adalah anak Al Mufadlal] telah bercerita kepada kami [Yahya] dari [Busyair bin Yasar] dari [Sahal binAbi Hatsmah] berkata; \"'Abdullah bin Sahal dan Muhayyishah bin Mas'ud bin Zaid berangkat menuju Khaibar yang saat itu Khaibar terikat dengan perjanjian damai lalu keduanya terpisah. Kemudian Muhayyishah mendapatkan 'Abdullah bin Sahal dalam keadaan gugur bersimbah darah lalu dia menguburkannya. Kemudian dia kembali ke Madinah. Lalu 'Abdur Rahman bin Sahal, Muhayyishah dan Huwayyishah, keduanya anak Mas'ud, menemui Nabi shallallahu 'alaihi wasallam. 'Abdur Rahman bin Sahal memulai berbicara Namun Beliau Shallallahu'alaihiwasallam berkata; \"Tolong yang bicara yang lebih tua, tolong yang bicara yang lebih tua\". Dia ('Abdur Rahman) memang yang paling muda usia diantara kaum yang hadir, lalu dia pun diam. Maka keduanya (anak Mas'ud) berbicara\". Beliau Shallallahu'alaihiwasallam bertanya; \"Hendaknya kalian bersumpah sehingga bisa menuntut pembunuhnya atau kalian tuntut darah saudara kalian\". Mereka berkata; \"Bagaimana kami dapat bersumpah padahal kami tidak menyaksikan dan tidak melihat kejadiannya\". Beliau berkata: \"Kalau begitu kaum Yahudi bisa menyatakan ketidakterlibatannya dengan lima puluh sumpah\". Mereka bertanya; \"Bagaimana mungkin kami terima sumpah kaum kafir?\". Akhirnya Nabi shallallahu 'alaihi wasallam membayar diyatnya dari harta Beliau sendiri",
          "tr": "Sehl İbn Ebi Hasme'nin şöyle dediği nakledilmiştir: \"Abdullah İbn Sehl ile Muhayyısa İbn Mes'ud İbn Zeyd Hayber'e gittiler. Onların Hayber'e gittikleri gün düşman tarafı ile barış anlaşması yapılan bir gündü. Hayber'e varınca bunlar birbirlerinden ayrıldılar. Bir süre sonra Muhayyısa, Abdullah İbn Sehl'in yanına vardı. Abdullah, kanlar içinde can çekişiyordu. Muhayyısa ölen Abdullah'ı defnetti ve Medine'ye döndü. Dönünce Abdurrahman İbn Sehl ve Mes'ud'un oğulları Muhayyısa ile Huveyyısa Resulullah Sallallahu Aleyhi ve Sellem'in yanına geldiler. Abdurrahman huzurda konuşmaya başlayınca Resulullah Sallallahu Aleyhi ve Sellem: \"Bırak önce büyükler konuşsun, müsaade et önce büyükler konuşsun!\" buyurdu. Zira Abdurrahman gelenler içinde yaşça en küçük olanı idi. O da bunun üzerine sustu ve diğerleri Abdullah'ın öldürülmesi ile ilgili konuşmalar yaptılar. ResuluIlah Sallallahu Aleyhi ve Sellem: \"Onu falan kişi öldürmüştür diye yemin eder misiniz? Eğer bu şekilde yemin ederseniz o kişi üzerindeki hakkınız sabit olur\" buyurdu. Onlar: \"Nasıl yemin edebiliriz ki!? Biz ne olaya şahit olduk ne de öldüreni gördük!\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Bu durumda Yahudilerden elli kişi cinayeti işlemediklerine yemin ederse size karşı sorumluluktan kurtulurlar.\" Onlar: \"Biz kafirlerin yeminlerini nasıl kabul edebiliriz ki!?\" dediler. Bunun üzerine Resul-i Ekrem Sallallahu Aleyhi ve Sellem maktulün diyetini kendisi ödedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 15
      },
      "narrator": {
        "en": "Sahl bin Abi Hathma"
      }
    },
    {
      "hadithNumber": 3174,
      "arabicNumber": 3174,
      "book": 58,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي رَكْبٍ مِنْ قُرَيْشٍ كَانُوا تِجَارًا بِالشَّأْمِ فِي الْمُدَّةِ الَّتِي مَادَّ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا سُفْيَانَ فِي كُفَّارِ قُرَيْشٍ‏.‏",
        "translations": {
          "en": "Narrated ' `Abdullah bin `Abbas:That Abu Sufyan bin Harb Informed him that Heraclius called him and the members of a caravan from Quraish who had gone to Sham as traders, during the truce which Allah's Messenger (ﷺ) had concluded with Abu Sufyan and the Quraish infidels",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یونس نے، ان سے ابن شہاب نے، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی، اور انہیں ابوسفیان بن حرب رضی اللہ عنہ نے خبر دی کہ ہرقل ( فرمانروائے روم ) نے انہیں قریش کے قافلے کے ساتھ بلا بھیجا ( یہ لوگ شام اس زمانے میں تجارت کی غرض سے گئے ہوئے تھے۔ ) جب رسول اللہ صلی اللہ علیہ وسلم نے ابوسفیان سے ( صلح حدیبیہ میں ) قریش کے کافروں کے مقدمہ میں صلح کی تھی۔",
          "fr": "Rapporté par `Abdullah bin `Abbas : Abou Soufyan bin Harb l’informa qu’Héraclius l’avait convoqué, lui et les membres d’une caravane de Qouraïchites partis commercer au Sham, pendant la trêve conclue entre le Messager d’Allah (ﷺ), Abou Soufyan et les polythéistes de Qouraïch",
          "id": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] dari [Yunus] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah bin 'Utbah] mengabarkan kepadanya bahwa ['Abdullah bin 'Abbas] mengabarkan kepadanya bahwa [Abu Sufyan bin Harb bin Umayyah] mengabarkan kepadanya bahwa, Raja Heraklius pernah mengutus utusan kepadanya saat dia bersama rombongan pedagang Quraisy sedang berkunjung ke negeri Syam, tepatnya pada masa ada perjanjian damai (gencatan senjata) yang dibuat antara Rasulullah shallallahu 'alaihi wasallam dan Abu Sufyan tentang orang-orang Kafir Quraisy",
          "tr": "Abdullah İbn Abbas, Ebu Süfyan'ın kendisine anlattığı kıssayı şöyle nakletmiştir: \" Mekkeli Müşriklerin Resulullah Sallallahu Aleyhi ve Sellem ile barış anlaşması yaptıkları dönemde Ebu Süfyan, Kureyş'li bazı ticaret erbabıyla birlikte Şam'da bulunuyordu. Herakleios bir elçi göndererek Ebu Süfyan ve arkadaşlarını yanına çağırttı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 16
      },
      "narrator": {
        "en": "' `Abdullah bin `Abbas"
      }
    },
    {
      "hadithNumber": 3175,
      "arabicNumber": 3175,
      "book": 58,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُحِرَ حَتَّى كَانَ يُخَيَّلُ إِلَيْهِ أَنَّهُ صَنَعَ شَيْئًا وَلَمْ يَصْنَعْهُ‏.‏",
        "translations": {
          "en": "Narrated Aisha:Once the Prophet (ﷺ) was bewitched so that he began to imagine that he had done a thing which in fact he had not done",
          "ur": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، کہا کہ مجھ سے میرے باپ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم پر جادو کر دیا گیا تھا۔ تو بعض دفعہ ایسا ہوتا کہ آپ سمجھتے کہ میں نے فلاں کام کر لیا ہے۔ حالانکہ آپ نے وہ کام نہ کیا ہوتا۔",
          "fr": "Rapporté par Aisha : Un jour, le Prophète (ﷺ) fut ensorcelé au point d’imaginer avoir fait quelque chose alors qu’il ne l’avait pas fait",
          "id": "Telah bercerita kepada kami [Muhammad bin Al Mutsannaa] telah bercerita kepada kami [Yahya] telah bercerita kepada kami [Hisyam] berkata telah bercerita kepadaku [bapakku] dari ['Aisyah radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam pernah disihir sehingga terbayang oleh beliau melakukan sesuatu padahal tidak",
          "tr": "Hz. Aişe'nin naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem'e büyü yapılmıştı. Hatta bu yüzden aslında hiç yapmadığı bazı şeyleri yaptığını zannediyordu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 17
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 3176,
      "arabicNumber": 3176,
      "book": 58,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ بْنِ زَبْرٍ، قَالَ سَمِعْتُ بُسْرَ بْنَ عُبَيْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا إِدْرِيسَ، قَالَ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ، وَهْوَ فِي قُبَّةٍ مِنْ أَدَمٍ فَقَالَ ‏ \"‏ اعْدُدْ سِتًّا بَيْنَ يَدَىِ السَّاعَةِ، مَوْتِي، ثُمَّ فَتْحُ بَيْتِ الْمَقْدِسِ، ثُمَّ مُوتَانٌ يَأْخُذُ فِيكُمْ كَقُعَاصِ الْغَنَمِ، ثُمَّ اسْتِفَاضَةُ الْمَالِ حَتَّى يُعْطَى الرَّجُلُ مِائَةَ دِينَارٍ فَيَظَلُّ سَاخِطًا، ثُمَّ فِتْنَةٌ لاَ يَبْقَى بَيْتٌ مِنَ الْعَرَبِ إِلاَّ دَخَلَتْهُ، ثُمَّ هُدْنَةٌ تَكُونُ بَيْنَكُمْ وَبَيْنَ بَنِي الأَصْفَرِ فَيَغْدِرُونَ، فَيَأْتُونَكُمْ تَحْتَ ثَمَانِينَ غَايَةً، تَحْتَ كُلِّ غَايَةٍ اثْنَا عَشَرَ أَلْفًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Auf bin Malik:I went to the Prophet (ﷺ) during the Ghazwa of Tabuk while he was sitting in a leather tent. He said, \"Count six signs that indicate the approach of the Hour: my death, the conquest of Jerusalem, a plague that will afflict you (and kill you in great numbers) as the plague that afflicts sheep, the increase of wealth to such an extent that even if one is given one hundred Dinars, he will not be satisfied; then an affliction which no Arab house will escape, and then a truce between you and Bani Al-Asfar (i.e. the Byzantines) who will betray you and attack you under eighty flags. Under each flag will be twelve thousand soldiers",
          "ur": "مجھ سے حمیدی نے بیان کیا، کہا ہم سے ولید بن مسلم نے بیان کیا، کہا ہم سے عبداللہ بن علاء بن زبیر نے بیان کیا، انہوں نے بیان کیا کہ میں نے بسر بن عبیداللہ سے سنا، انہوں نے ابوادریس سے سنا، کہا کہ میں نے عوف بن مالک رضی اللہ عنہ سے سنا، آپ نے بیان کیا کہ میں غزوہ تبوک کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، آپ اس وقت چمڑے کے ایک خیمے میں تشریف فرما تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، کہ قیامت کی چھ نشانیاں شمار کر لو، میری موت، پھر بیت المقدس کی فتح، پھر ایک وبا جو تم میں شدت سے پھیلے گی جیسے بکریوں میں طاعون پھیل جاتا ہے۔ پھر مال کی کثرت اس درجہ میں ہو گی کہ ایک شخص سو دینار بھی اگر کسی کو دے گا تو اس پر بھی وہ ناراض ہو گا۔ پھر فتنہ اتنا تباہ کن عام ہو گا کہ عرب کا کوئی گھر باقی نہ رہے گا جو اس کی لپیٹ میں نہ آ گیا ہو گا۔ پھر صلح جو تمہارے اور بنی الاصفر ( نصارائے روم ) کے درمیان ہو گی، لیکن وہ دغا کریں گے اور ایک عظیم لشکر کے ساتھ تم پر چڑھائی کریں گے۔ اس میں اسی جھنڈے ہوں گے اور ہر جھنڈے کے ماتحت بارہ ہزار فوج ہو گی ( یعنی نو لاکھ ساٹھ ہزار فوج سے وہ تم پر حملہ آور ہوں گے ) ۔",
          "fr": "Rapporté par `Auf bin Malik : Je me rendis auprès du Prophète (ﷺ) lors de l’expédition de Tabouk alors qu’il était assis dans une tente en cuir. Il dit : « Comptez six signes annonçant l’approche de l’Heure : ma mort, la conquête de Jérusalem, une épidémie qui vous touchera (et fera de nombreuses victimes) comme la peste chez les moutons, l’abondance de richesses à tel point que même si l’on donne cent dinars à quelqu’un, il ne sera pas satisfait ; ensuite, une épreuve qui n’épargnera aucune maison arabe, puis une trêve entre vous et les Bani Al-Asfar (les Byzantins) qui vous trahiront et vous attaqueront sous quatre-vingts étendards, chaque étendard étant porté par douze mille soldats. »",
          "id": "Telah bercerita kepada kami [Al Humaidiy] telah bercerita kepada kami [Al Walid bin Muslim] telah bercerita kepada kami ['Abdullah bin Al 'Alaa' bin Zabr] berkata aku mendengar [Busr bin 'Ubaidullah] bahwa dia mendengar [Abu Idris] berkata aku mendengar ['Auf bin Malik] berkata; \"Aku menemui Nabi shallallahu 'alaihi wasallam ketika terjadi perang Tabuk saat Beliau sedang berada di tenda terbuat dari kulit yang disamak. Beliau bersabda: \"Hitunglah enam perkara yang akan timbul menjelang hari qiyamat. Kematianku, dibebaskannya Baitul Maqdis, kematian yang menyerang kalian bagaikan penyakit yang menyerang kambing sehingga mati seketika, melimpahnya harta hingga ada seseorang yang diberi seratus dinar namun masih marah (merasa kurang), timbulnya fitnah sehingga tidak ada satupun rumah orang Arab melainkan akan dimasukinya dan perjanjian antara kalian dan bangsa Bani Al Ashfar (Eropa) lalu mereka mengkhiyanati perjanjian kemudian mereka mengepung kalian dibawah delapan bendera (panji-panji) perang yang pada setiap bendera terdiri dari dua belas ribu personil",
          "tr": "Avf İbn Malik r.a.'in şöyle dediği nakledilmiştir: \"Tebuk savaşı sırasında Resulullah Sallallahu Aleyhi ve Sellem'in yanına gitmiştim. Deriden yapılmış bir çadırda oturuyordu. Şöyle buyurdu: \"Kıyamet kopmadan önce meydana gelecek olan şu altı alameti say: (1) Benim ölümüm, (2) sonra Kudüs'ün (Beytü'l-makdis) fethi, (3) ardından koyunları kırıp geçiren bir salgın hastalık gibi sizi yakalayacak olan Mutan (taun / veba) hastalığının aranızda yaygınlaşması. (4) Sonra zenginlik / mal o kadar artacak ki, kendisine yüz dinar verildiği halde bunun azlığından şikayetle öfkeye kapılanlar olacak. (5) Bunun ardından fitneler ortaya çıkacak ve Araplara ait olup da girmediği tek bir ev bile kalmayacak. (6) Daha sonra Rumlarla barış anlaşması yapacağınız bir dönem gelecek. Ancak onlar sözlerinde durmayıp ihanet edecekler ve her bir sancağın altında on iki bin askerin toplandığı seksen sancak taşıyan büyük bir ordu ile sizin üstünüze yürüyecekler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 18
      },
      "narrator": {
        "en": "`Auf bin Malik"
      }
    },
    {
      "hadithNumber": 3177,
      "arabicNumber": 3177,
      "book": 58,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَعَثَنِي أَبُو بَكْرٍ ـ رضى الله عنه ـ فِيمَنْ يُؤَذِّنُ يَوْمَ النَّحْرِ بِمِنًى لاَ يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ‏.‏ وَيَوْمُ الْحَجِّ الأَكْبَرِ يَوْمُ النَّحْرِ، وَإِنَّمَا قِيلَ الأَكْبَرُ مِنْ أَجْلِ قَوْلِ النَّاسِ الْحَجُّ الأَصْغَرُ‏.‏ فَنَبَذَ أَبُو بَكْرٍ إِلَى النَّاسِ فِي ذَلِكَ الْعَامِ، فَلَمْ يَحُجَّ عَامَ حَجَّةِ الْوَدَاعِ الَّذِي حَجَّ فِيهِ النَّبِيُّ صلى الله عليه وسلم مُشْرِكٌ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Abu Bakr, on the day of Nahr (i.e. slaughtering of animals for sacrifice), sent me in the company of others to make this announcement: \"After this year, no pagan will be allowed to perform the Hajj, and none will be allowed to perform the Tawaf of the Ka`ba undressed.\" And the day of Al-Hajj-ul-Akbar is the day of Nahr, and its called Al-Akbar because the people call the `Umra Al-Hajj-ul-Asghar (i.e. the minor Hajj). Abu Bakr threw back the pagans' covenant that year, and therefore, no pagan performed the Hajj in the year of Hajj-ul-Wada` of the Prophets",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، انہیں حمید بن عبدالرحمٰن نے کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نے ( حجۃ الوداع سے پہلے والے حج کے موقع پر ) دسویں ذی الحجہ کے دن بعض دوسرے لوگوں کے ساتھ مجھے بھی منیٰ میں یہ اعلان کرنے بھیجا تھا کہ اس سال کے بعد کوئی مشرک حج کرنے نہ آئے اور کوئی شخص بیت اللہ کا طواف ننگے ہو کر نہ کرے اور حج اکبر کا دن دسویں تاریخ ذی الحجہ کا دن ہے۔ اسے حج اکبر اس لیے کہا گیا کہ لوگ ( عمرہ کو ) حج اصغر کہنے لگے تھے، تو ابوبکر رضی اللہ عنہ نے اس سال مشرکوں سے جو عہد لیا تھا اسے واپس کر دیا، اور دوسرے سال حجۃ الوداع میں جب نبی کریم صلی اللہ علیہ وسلم نے حج کیا تو کوئی مشرک شریک نہیں ہوا۔",
          "fr": "Rapporté par Abu Huraira : Le jour du Nahr (sacrifice), Abou Bakr m’envoya avec d’autres pour faire cette annonce : « Après cette année, aucun polythéiste ne sera autorisé à accomplir le Hajj, et personne ne pourra faire le Tawaf de la Ka`ba nu. » Le jour d’Al-Hajj-ul-Akbar est le jour du Nahr, et il est appelé Al-Akbar parce que les gens appellent la `Umra le Hajj mineur (Al-Hajj-ul-Asghar). Cette année-là, Abou Bakr rendit le pacte des polythéistes, et ainsi, aucun polythéiste ne fit le Hajj lors du pèlerinage d’adieu du Prophète (ﷺ)",
          "id": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] telah mengabarkan kepada kami [Humaid bin 'Abdur Rahman] bahwa [Abu Hurairah radliallahu 'anhu] berkata; \"Abu Bakr mengutusku sebagai orang diantara orang-orang yang menyampaikan pengumuman pada hari Nahar (tanggal sepuluh Dzul Hijjah) di Mina, yang isinya; \"Tidak boleh bagi orang musyrik melaksanakan hajji setelah tahun ini, tidak boleh mereka melakukan thawaf di Baitullah dalam keadaan telanjang dan hajji akbar adalah hari Nahar\". Dan sesungguhnya disebut haji akbar karena adanya pernyataan orang-orang tentang hajji ashghar (kecil) maka Abu Bakr mengumumkan kepada manusia pada musim hajji tahun itu bahwa (hajji akbar) adalah saat orang-orang musyrik tidak berhaji pada haji wada' yang ketika itu Nabi shallallahu 'alaihi wasallam melaksanakannya",
          "tr": "Ebu Hureyre r.a.'nin şöyle dediği nakledilmiştir: \"Hz. Ebu Bekir kurban kesme gününde (nahr günü Mina'da şu duyuruyu yapmak üzere beni de görevlendirmişti: \"Bu seneden sonra hiçbir müşrik haccedemeyecek, çıplak bir şekilde hiç kimse Kabe'yi tavaf edemeyecek. Hacc-ı ekber günü, nahr günüdür. Hz. Ebu Bekir işte bu senede onlarla yapılan anlaşmayı bozduğunu bildirmişti. Nebi Sallallahu Aleyhi ve Sellem veda haccını yaptığı yıl hiçbir müşrik haccetmemişti)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 19
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 3178,
      "arabicNumber": 3178,
      "book": 58,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَرْبَعُ خِلاَلٍ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا مَنْ إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا عَاهَدَ غَدَرَ وَإِذَا خَاصَمَ فَجَرَ، وَمَنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Amr:Allah's Messenger (ﷺ) said, \"Whoever has (the following) four characteristics will be a pure hypocrite: \"If he speaks, he tells a lie; if he gives a promise, he breaks it, if he makes a covenant he proves treacherous; and if he quarrels, he behaves in a very imprudent evil insulting manner (unjust). And whoever has one of these characteristics, has one characteristic of a hypocrite, unless he gives it up",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے عبداللہ بن مرہ نے، ان سے مسروق نے، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، چار عادتیں ایسی ہیں کہ اگر یہ چاروں کسی ایک شخص میں جمع ہو جائیں تو وہ پکا منافق ہے۔ وہ شخص جو بات کرے تو جھوٹ بولے، اور جب وعدہ کرے، تو وعدہ خلافی کرے، اور جب معاہدہ کرے تو اسے پورا نہ کرے۔ اور جب کسی سے لڑے تو گالی گلوچ پر اتر آئے اور اگر کسی شخص کے اندر ان چاروں عادتوں میں سے ایک ہی عادت ہے، تو اس کے اندر نفاق کی ایک عادت ہے جب تک کہ وہ اسے چھوڑ نہ دے۔",
          "fr": "Rapporté par `Abdullah bin `Amr : Le Messager d’Allah (ﷺ) a dit : « Celui qui possède ces quatre caractéristiques est un hypocrite pur : s’il parle, il ment ; s’il promet, il ne tient pas sa promesse ; s’il conclut un pacte, il trahit ; et s’il se dispute, il se comporte de façon injuste et insultante. Et celui qui possède l’une de ces caractéristiques a en lui un trait d’hypocrisie, à moins qu’il ne l’abandonne. »",
          "id": "Telah bercerita kepada kami [َQutaibah bin Sa'id] telah bercerita kepada kami [Jarir] dari [Al A'masy] dari ['Abdullah bin Murrah] dari [Masruq] dari ['Abdullah bin 'Amru radliallahu 'anhu] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Empat hal bila ada pada seseorang maka dia adalah seorang munafiq tulen yaitu orang yang jika berbicara dusta, jika berjanji mengingkari, jika diberi amanat dia khiyanat dan jika berseteru dia curang dan barangsiapa yang ada padanya salah satu sifat itu, dia punya sifat nifaq hingga dia meninggalkannya",
          "tr": "Abdullah İbn Amr'ın naklettiğine göre Resul-i Ekrem Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Şu dört özellik kimde bulunursa o kimse katıksız münafıktır: Konuşunca yalan söylemek, verilen sözde durmamak / söz verip caymak, yapılan anlaşmaya bağlı kalmayıp ihanet etmek ve hasım / düşman olunca aşırı davranmak (...). Kimde bu özelliklerden birisi bulunursa, onu terk edene kadar kendisinde münafıklara yaraşır bir özellik var demektir. \" Ayrıntılı açıklama için bkz. Kitabü'l-iman, Bab"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 20
      },
      "narrator": {
        "en": "`Abdullah bin `Amr"
      }
    },
    {
      "hadithNumber": 3179,
      "arabicNumber": 3179,
      "book": 58,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ مَا كَتَبْنَا عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ الْقُرْآنَ، وَمَا فِي هَذِهِ الصَّحِيفَةِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْمَدِينَةُ حَرَامٌ مَا بَيْنَ عَائِرٍ إِلَى كَذَا، فَمَنْ أَحْدَثَ حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ عَدْلٌ وَلاَ صَرْفٌ، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ‏.‏ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Ali:We did not, write anything from the Prophet (ﷺ) except the Qur'an and what is written in this paper, (wherein) the Prophet (ﷺ) said, \"Medina is a sanctuary from (the mountain of) Air to so and-so, therefore, whoever innovates (in it) an heresy or commits a sin, or gives shelter to such an innovator, will incur the Curse of Allah. the angels and all the people; and none of his compulsory or optional good deeds of worship will be accepted And the asylum granted by any Muslim Is to be secured by all the Muslims even if it is granted by one of the lowest social status among them. And whoever betrays a Muslim in this respect will incur the Curse of Allah, the angels and all the people, and his compulsory and optional good deeds of worship will not be accepted. And any freed slave who will take as masters (befriends) people other than his own real masters who freed him without taking the permission of the latter, will incur the Curse of Allah, the angels and all the people, and his compulsory and optional good deeds of worship will not be accepted",
          "ur": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں اعمش نے، انہیں ابراہیم تیمی نے، انہیں ان کے باپ (یزید بن شریک تیمی) نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ ہم نے نبی کریم صلی اللہ علیہ وسلم سے بس یہی قرآن مجید لکھا اور جو کچھ اس ورق میں ہے، نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ مدینہ عائر پہاڑی اور فلاں ( کدیٰ ) پہاڑی کے درمیان تک حرم ہے۔ پس جس نے یہاں ( دین میں ) کوئی نئی چیز داخل کی یا کسی ایسے شخص کو اس کے حدود میں پناہ دی تو اس پر اللہ تعالیٰ، ملائکہ اور انسان سب کی لعنت ہو گی۔ نہ اس کا کوئی فرض قبول اور نہ نفل قبول ہو گا۔ اور مسلمان پناہ دینے میں سب برابر ہیں۔ معمولی سے معمولی مسلمان ( عورت یا غلام ) کسی کافر کو پناہ دے سکتے ہیں۔ اور جو کوئی کسی مسلمان کا کیا ہوا عہد توڑ ڈالے اس پر اللہ اور ملائکہ اور انسان سب کی لعنت ہو گی، نہ اس کی کوئی فرض عبادت قبول ہو گی اور نہ نفل! اور جس غلام یا لونڈی نے اپنے آقا اپنے مالک کی اجازت کے بغیر کسی دوسرے کو اپنا مالک بنا لیا، تو اس پر اللہ اور ملائکہ اور انسان سب کی لعنت ہو گی، نہ اس کی کوئی فرض عبادت قبول ہو گی اور نہ نفل",
          "fr": "Rapporté par `Ali : Nous n’écrivions rien du Prophète (ﷺ) sauf le Coran et ce qui est écrit sur ce feuillet, où le Prophète (ﷺ) a dit : « Médine est un sanctuaire depuis (la montagne de) Air jusqu’à telle ou telle limite. Celui qui y introduit une innovation ou commet un péché, ou accorde refuge à un innovateur, subira la malédiction d’Allah, des anges et de tous les gens ; aucune de ses bonnes actions obligatoires ou surérogatoires ne sera acceptée. L’asile accordé par un musulman doit être respecté par tous les musulmans, même s’il est accordé par la personne la plus humble. Celui qui trahit un musulman à ce sujet subira la malédiction d’Allah, des anges et de tous les gens, et aucune de ses bonnes actions obligatoires ou surérogatoires ne sera acceptée. Et tout esclave affranchi qui prend comme maîtres des gens autres que ses véritables maîtres sans leur permission subira la malédiction d’Allah, des anges et de tous les gens, et aucune de ses bonnes actions obligatoires ou surérogatoires ne sera acceptée. »",
          "id": "Telah bercerita kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim at-Taymiy] dari [bapaknya] dari ['Ali radliallahu 'anhu] berkata; \"Tidak ada yang kami tulis dari Nabi shallallahu 'alaihi wasallam kecuali Al Qur'an dan apa yang ada pada ash-shahifah (lembaran-lembaran hadits) ini\", dimana Nabi shallallahu 'alaihi wasallam bersabda: \"Madinah adalah tanah suci yang wilayahnya antara gunung ini hingga wilayah anu. Maka barangsiapa yang berbuat kemungkaran (bid'ah) yang dilarang agama didalamnya atau membantu orang berbuat bid'ah maka orang itu akan mendapat laknat dari Allah, para malaikat dan seluruh manusia, dan tidak akan diterima darinya amalan 'ibadah wajib dan sunnahnya\" (atau taubat dan tebusannya). Dan perlindungan Kaum Muslimin adalah sama, maksudnya orang yang paling rendahpun bisa menggunakan hak perlindungannya. Maka barangsiapa melanggar ikatan perjanjian seorang muslim maka orang itu akan mendapat laknat dari Allah, para malaikat dan seluruh manusia dan tidak akan diterima darinya amalan 'ibadah wajib dan sunnahnya\". Dan siapapun budak yang berwala' bukan kepada majikannya, maka ia mendapat laknat dari Allah, para malaikat dan seluruh manusia dan tidak akan diterima darinya amalan 'ibadah wajib dan sunnahnya\". Berkata Abu Musa telah bercerita kepada kami Hasyim bin Al Qasim telah bercerita kepada kami Ishaq bin Sa'id dari bapaknya dari Abu Hurairah radliallahu 'anhu berkata; \"Bagaimana yang kalian lakukan jika kalian tidak bisa lagi mengambil dinar dan juga dirham (jizyah)?\". Ditanyakan kepadanya; \"Bagaimana kamu melihatnya hal itu dapat terjadi, wahai Abu Hurairah?\". Dia menjawab; \"Bagiku, demi Dzat yang jiwa Abu Hurairah berada di tangan-Nya, aku mengambilnya seorang yang jujur (muhammad) dan berita yang dibawanya adalah benar. Mereka tanyakan \"Apakah itu?\". Dia berkata; \"Itu karena perjanjian Allah dan Rasul-Nya telah dilanggar, sehingga Allah mengeraskan hati-hati orang ahlu dzimmah lalu mereka enggan mengeluarkan harta yang ada ditangan mereka",
          "tr": "Hz. Ali'nin şöyle dediği nakledilmiştir: \"Biz Resul-i Ekrem Sallallahu Aleyhi ve Sellem'den sadece Kur'an'ı ve işte şu sahifede bulunanları yazdık. Burada Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ayir (Air) dağı ile şura arasına kadar Medine haram bölgedir. Kim (aslı olmayan) bir yenilik (bid'at) çıkarırsa veya böyle bid'at çıkaran birisine sığınıp destekçi olursa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun. Böyle bir kimsenin ne tevbesi ne de fidyesi kabul edilir. Müslümanların verdiği güvence ve eman tektir; bu bakımdan en alt derecede bulunan bir Müslümanın verdiği güvence herkesi bağlar. Kim bir Müslümana verdiği söze ihanet edip ahdini bozarsa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun! Böyle bir kimsenin ne tevbesi ne de fidyesi kabul edilir. Efendilerinin izni olmadan başkaları ile müvalat akdi yapanlar da Allah'ın, meleklerin ve bütün insanların lanetine uğrasın! Böyle bir kimsenin ne tevbesi ne de fidyesi kabul edilir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 21
      },
      "narrator": {
        "en": "`Ali"
      }
    },
    {
      "hadithNumber": 3180,
      "arabicNumber": 3180,
      "book": 58,
      "hadithInBook": 22,
      "text": {
        "arabic": "قَالَ أَبُو مُوسَى حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَيْفَ أَنْتُمْ إِذَا لَمْ تَجْتَبُوا دِينَارًا وَلاَ دِرْهَمًا فَقِيلَ لَهُ وَكَيْفَ تَرَى ذَلِكَ كَائِنًا يَا أَبَا هُرَيْرَةَ قَالَ إِيْ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ عَنْ قَوْلِ الصَّادِقِ الْمَصْدُوقِ‏.‏ قَالُوا عَمَّ ذَاكَ قَالَ تُنْتَهَكُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ صلى الله عليه وسلم، فَيَشُدُّ اللَّهُ عَزَّ وَجَلَّ قُلُوبَ أَهْلِ الذِّمَّةِ، فَيَمْنَعُونَ مَا فِي أَيْدِيهِمْ‏.‏",
        "translations": {
          "en": "Narrated Sa`id:Abu Huraira once said (to the people), \"What will your state be when you can get no Dinar or Dirham (i.e. taxes from the Dhimmis)?\" on that someone asked him, \"What makes you know that this state will take place, O Abu Huraira?\" He said, \"By Him in Whose Hands Abu Huraira's life is, I know it through the statement of the true and truly inspired one (i.e. the Prophet).\" The people asked, \"What does the Statement say?\" He replied, \"Allah and His Apostle's asylum granted to Dhimmis, i.e. non-Muslims living in a Muslim territory) will be outraged, and so Allah will make the hearts of these Dhimmis so daring that they will refuse to pay the Jizya they will be supposed to pay",
          "ur": "ابوموسیٰ (محمد بن مثنیٰ) نے بیان کیا کہ ہم سے ہاشم بن قاسم نے بیان کیا، ان سے اسحاق بن سعید نے بیان کیا، ان سے ان کے والد سعید بن عمرو نے، ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ اس وقت تمہارا کیا حال ہو گا جب ( جزیہ اور خراج میں سے ) نہ تمہیں درہم ملے گا اور نہ دینار! اس پر کسی نے کہا۔ کہ جناب ابوہریرہ رضی اللہ عنہ آپ کیسے سمجھتے ہیں کہ ایسا ہو گا؟ ابوہریرہ رضی اللہ عنہ نے کہا ہاں اس ذات کی قسم! جس کے ہاتھ میں ابوہریرہ کی جان ہے۔ یہ صادق و مصدوق صلی اللہ علیہ وسلم کا فرمان ہے۔ لوگوں نے پوچھا تھا کہ یہ کیسے ہو جائے گا؟ تو آپ نے فرمایا، جب کہ اللہ اور اس کے رسول کا عہد ( اسلامی حکومت غیر مسلموں سے ان کی جان و مال کی حفاظت کے بارے میں ) توڑا جانے لگے، تو اللہ تعالیٰ بھی ذمیوں کے دلوں کو سخت کر دے گا۔ اور وہ جزیہ دینا بند کر دیں گے ( بلکہ لڑنے کو مستعد ہوں گے ) ۔",
          "fr": "Rapporté par Sa`id : Un jour, Abu Huraira a dit aux gens : « Que ferez-vous quand vous ne recevrez plus ni dinar ni dirham (c’est-à-dire les taxes des dhimmis) ? » Quelqu’un lui demanda : « Comment sais-tu que cela arrivera, ô Abu Huraira ? » Il répondit : « Par Celui qui tient la vie d’Abu Huraira dans Sa main, je le sais grâce à la parole du véridique et digne de confiance (le Prophète). » Les gens demandèrent : « Quelle est cette parole ? » Il répondit : « L’asile accordé par Allah et Son Messager aux dhimmis (non-musulmans vivant en terre musulmane) sera bafoué, et Allah rendra alors les cœurs de ces dhimmis si audacieux qu’ils refuseront de payer la jizya qu’ils devraient verser. »",
          "tr": "Ebu Hureyre r.a. bir defasında etrafındakilere: \"Anlaşma yaptığınız gayri müslimlerden cizye ve haraç olarak dinar ve dirhem toplayamazsanız ne hale geleceğinizi hiç düşündünüz mü?\" diye sordu. Onlar: \"Ey Ebu Hureyre, bunun nasıl olacağı hakkında bildiğin bir şey var mı?\" diye karşılık verdiler. O da: 'Tabi ki biliyorum. Ebu Hureyre'nin canını elinde tutan Allah'a yemin ederim ki bu konuda doğru söyleyen ve doğruluğu tasdik edilmiş olan (Resulullah)'ın sözünü biliyorum\" dedi. Onlar: \"Peki bu bilgi neyle ilgili?\" diye sorunca Ebu Hureyre şöyle cevap verdi: \"Allah'ın ve Resulü'nün verdiği güvenceye (zimmet) riayet edilmeyecek. Bunun üzerine Allah Teala kendileriyle anlaştığınız gayri müslimerin kalplerindeki güven duygusunu sarsacak. Onlar da artık size itimat etmedikleri için ellerinde bulunan malları vermeyecekler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 22
      },
      "narrator": {
        "en": "Sa`id"
      }
    },
    {
      "hadithNumber": 3181,
      "arabicNumber": 3181,
      "book": 58,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا أَبُو حَمْزَةَ، قَالَ سَمِعْتُ الأَعْمَشَ، قَالَ سَأَلْتُ أَبَا وَائِلٍ شَهِدْتَ صِفِّينَ قَالَ نَعَمْ، فَسَمِعْتُ سَهْلَ بْنَ حُنَيْفٍ، يَقُولُ اتَّهِمُوا رَأْيَكُمْ، رَأَيْتُنِي يَوْمَ أَبِي جَنْدَلٍ وَلَوْ أَسْتَطِيعُ أَنْ أَرُدَّ، أَمْرَ النَّبِيِّ صلى الله عليه وسلم لَرَدَدْتُهُ، وَمَا وَضَعْنَا أَسْيَافَنَا عَلَى عَوَاتِقِنَا لأَمْرٍ يُفْظِعُنَا إِلاَّ أَسْهَلْنَ بِنَا إِلَى أَمْرٍ، نَعْرِفُهُ غَيْرِ أَمْرِنَا هَذَا‏.‏",
        "translations": {
          "en": "Narrated Al-A`mash:I asked Abu Wail, \"Did you take part in the battle of Siffin?\" He said, 'Yes, and I heard Sahl bin Hunaif (when he was blamed for lack of zeal for fighting) saying, \"You'd better blame your wrong opinions. I wish you had seen me on the day of Abu Jandal. If I had the courage to disobey the Prophet's orders, I would have done so. We had kept out swords on our necks and shoulders, for a thing which frightened us. And we did so, we found it easier for us, except in the case of the above battle (of ours)",
          "ur": "ہم سے عبدان نے بیان کیا، کہا ہم کو ابوحمزہ نے خبر دی، کہا کہ میں نے اعمش سے سنا، انہوں نے بیان کیا کہ میں نے ابووائل سے پوچھا، کیا آپ صفین کی جنگ میں موجود تھے؟ انہوں نے بیان کیا کہ ہاں ( میں تھا ) اور میں نے سہل بن حنیف رضی اللہ عنہ کو یہ کہتے سنا تھا کہ تم لوگ خود اپنی رائے کو غلط سمجھو، جو آپس میں لڑتے مرتے ہو۔ میں نے اپنے تئیں دیکھا جس دن ابوجندل آیا ( یعنی حدیبیہ کے دن ) اگر میں نبی کریم صلی اللہ علیہ وسلم کا حکم پھیر دیتا اور ہم نے جب کسی مصیبت میں ڈر کر تلواریں اپنے کندھوں پر رکھیں تو وہ مصیبت آسان ہو گئی۔ ہم کو اس کا انجام معلوم ہو گیا۔ مگر یہی ایک لڑائی ہے ( جو سخت مشکل ہے اس کا انجام بہتر نہیں معلوم ہوتا ) ۔",
          "fr": "Rapporté par Al-A`mash : J’ai demandé à Abu Wail : « As-tu participé à la bataille de Siffin ? » Il répondit : « Oui, et j’ai entendu Sahl bin Hunaif (quand on lui reprochait son manque d’ardeur au combat) dire : ‘Vous feriez mieux de blâmer vos propres opinions. J’aurais voulu que vous m’ayez vu le jour d’Abu Jandal. Si j’avais eu le courage de désobéir aux ordres du Prophète, je l’aurais fait. Nous avions nos épées sur nos cous et nos épaules, à cause de quelque chose qui nous effrayait. Et nous l’avons fait, cela nous a semblé plus facile, sauf dans le cas de la bataille dont il est question.’ »",
          "id": "Bab. Telah bercerita kepada kami ['Abdan] telah mengabarkan kepada kami [Abu Hamzah] berkata aku mendengar [Al A'masy] berkata; aku bertanya kepada [Abu Wa'il]; \"Apakah kamu terlibat dalam perang Shiffin?\". Dia menjawab; \"Ya, dan saat itu aku mendengar [Sahal bin Hunaif] berseru; \"Berhati-hatilah kalian dengan pendapat kalian. Sungguh aku pernah melihat diriku sendiri pada peristiwa Abu Jandal (Perjanjian Hudaibiyah), seandainya aku sanggup menolak perintah (keputusan) Nabi shallallahu 'alaihi wasallam tentu aku sudah menolaknya saat itu, tidaklah kami letakkan pedang diatas pundak kami karena tragedi yang memilukan itu selain memudahkan kami mencermati permasalahan yang kami sadari, ada masalah lain dalam tragedi itu",
          "tr": "El-A'meş'in şöyle dediği nakledilmiştir: \"Ebu Vail'e: \"Sıffin savaşına katıldın mı?\" diye sorduğumda bana şöyle cevap verdi: \"Evet katıldım. Sehl İbn Huneyf'in o sırada şöyle dediğini duydum: \"Kusuru kendi görüşlerinizde arayın! Ben Ebu Cendel olayının yaşandığı zaman oradaydım. Eğer Resulullah Sallallahu Aleyhi ve Sellem'in emrine karşı çıkmam mümkün olsaydı kesinlikle karşı çıkardım. Biz zor günlerimizde ne zaman kılıçlarımızı kuşanıp savaşa çıksak muhakkak önümüz açılır, rahata kavuşurduk. Fakat bu olayda durum tamamen değişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 23
      },
      "narrator": {
        "en": "Al-A`mash"
      }
    },
    {
      "hadithNumber": 3182,
      "arabicNumber": 3182,
      "book": 58,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ أَبِيهِ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، قَالَ حَدَّثَنِي أَبُو وَائِلٍ، قَالَ كُنَّا بِصِفِّينَ فَقَامَ سَهْلُ بْنُ حُنَيْفٍ فَقَالَ أَيُّهَا النَّاسُ اتَّهِمُوا أَنْفُسَكُمْ فَإِنَّا كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ، وَلَوْ نَرَى قِتَالاً لَقَاتَلْنَا، فَجَاءَ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ يَا رَسُولَ اللَّهِ، أَلَسْنَا عَلَى الْحَقِّ وَهُمْ عَلَى الْبَاطِلِ فَقَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ فَقَالَ أَلَيْسَ قَتْلاَنَا فِي الْجَنَّةِ وَقَتْلاَهُمْ فِي النَّارِ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ قَالَ فَعَلَى مَا نُعْطِي الدَّنِيَّةَ فِي دِينِنَا أَنَرْجِعُ وَلَمَّا يَحْكُمِ اللَّهُ بَيْنَنَا وَبَيْنَهُمْ فَقَالَ ‏\"‏ ابْنَ الْخَطَّابِ، إِنِّي رَسُولُ اللَّهِ، وَلَنْ يُضَيِّعَنِي اللَّهُ أَبَدًا ‏\"‏‏.‏ فَانْطَلَقَ عُمَرُ إِلَى أَبِي بَكْرٍ فَقَالَ لَهُ مِثْلَ مَا قَالَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّهُ رَسُولُ اللَّهِ، وَلَنْ يُضَيِّعَهُ اللَّهُ أَبَدًا‏.‏ فَنَزَلَتْ سُورَةُ الْفَتْحِ، فَقَرَأَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عُمَرَ إِلَى آخِرِهَا‏.‏ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ، أَوَفَتْحٌ هُوَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Wail:We were in Siffin and Sahl bin Hunaif got up and said, \"O people! Blame yourselves! We were with the Prophet (ﷺ) on the day of Hudaibiya, and if we had been called to fight, we would have fought. But `Umar bin Al-Khattab came and said, 'O Allah's Messenger (ﷺ)! Aren't we in the right and our opponents in the wrong?' Allah's Messenger (ﷺ) said, 'Yes.' `Umar said, 'Aren't our killed persons in Paradise and their's in Hell?' He said, 'Yes.' `Umar said, 'Then why should we accept hard terms in matters concerning our religion? Shall we return before Allah judges between us and them?' Allah's Messenger (ﷺ) said, 'O Ibn Al- Khattab! I am the Messenger of Allah and Allah will never degrade me. Then `Umar went to Abu Bakr and told him the same as he had told the Prophet. On that Abu Bakr said (to `Umar). 'He is the Messenger of Allah and Allah will never degrade him.' Then Surat-al-Fath (i.e. Victory) was revealed and Allah's Messenger (ﷺ) recited it to the end in front of `Umar. On that `Umar asked, 'O Allah's Messenger (ﷺ)! Was it (i.e. the Hudaibiya Treaty) a victory?' Allah's Messenger (ﷺ) said, \"Yes",
          "ur": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے، ان سے یزید بن عبدالعزیز نے، ان سے ان کے باپ عبدالعزیز بن سیاہ نے، ان سے حبیب بن ابی ثابت نے بیان کیا، کہا کہ مجھ سے ابووائل نے بیان کیا کہ ہم مقام صفین میں ڈیرے ڈالے ہوئے تھے۔ پھر سہل بن حنیف رضی اللہ عنہ کھڑے ہوئے اور فرمایا اے لوگو! تم خود اپنی رائے کو غلط سمجھو۔ ہم صلح حدیبیہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، اگر ہمیں لڑنا ہوتا تو اس وقت ضرور لڑتے۔ عمر رضی اللہ عنہ اس موقع پر آئے ( یعنی حدیبیہ میں ) اور عرض کیا، یا رسول اللہ! کیا ہم حق پر اور وہ باطل پر نہیں ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیوں نہیں! عمر رضی اللہ عنہ نے کہا کیا ہمارے مقتول جنت میں اور ان کے مقتول جہنم میں نہیں جائیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، کہ کیوں نہیں! پھر عمر رضی اللہ عنہ نے کہا کہ پھر ہم اپنے دین کے معاملے میں کیوں دبیں؟ کیا ہم ( مدینہ ) واپس چلے جائیں گے، اور ہمارے اور ان کے درمیان اللہ کوئی فیصلہ نہیں کرے گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ابن خطاب! میں اللہ کا رسول ہوں اور اللہ مجھے کبھی برباد نہیں کرے گا۔“ اس کے بعد عمر رضی اللہ عنہ ابوبکر رضی اللہ عنہ کے پاس گئے اور ان سے وہی سوالات کئے، جو نبی کریم صلی اللہ علیہ وسلم سے ابھی کر چکے تھے۔ انہوں نے بھی یہی کہا کہ آپ صلی اللہ علیہ وسلم اللہ کے رسول ہیں، اور اللہ انہیں کبھی برباد نہیں ہونے دے گا۔ پھر سورۃ فتح نازل ہوئی اور آپ صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ کو اسے آخر تک پڑھ کر سنایا، تو عمر رضی اللہ عنہ نے عرض کیا کیا یہی فتح ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں! بلا شک یہی فتح ہے۔",
          "fr": "Rapporté par Abu Wail : Nous étions à Siffin et Sahl bin Hunaif se leva et dit : « Ô gens ! Blâmez-vous vous-mêmes ! Nous étions avec le Prophète (ﷺ) le jour de Hudaibiya, et si on nous avait appelés à combattre, nous l’aurions fait. Mais `Umar bin Al-Khattab est venu et a dit : ‘Ô Messager d’Allah (ﷺ) ! Ne sommes-nous pas dans le vrai et nos adversaires dans l’erreur ?’ Le Messager d’Allah (ﷺ) répondit : ‘Oui.’ `Umar dit : ‘Nos morts ne sont-ils pas au Paradis et les leurs en Enfer ?’ Il répondit : ‘Oui.’ `Umar demanda : ‘Alors pourquoi accepter des conditions difficiles concernant notre religion ? Devons-nous revenir avant qu’Allah ne juge entre nous et eux ?’ Le Messager d’Allah (ﷺ) répondit : ‘Ô Ibn Al-Khattab ! Je suis le Messager d’Allah et Allah ne m’humiliera jamais.’ `Umar alla alors voir Abu Bakr et lui répéta la même chose. Abu Bakr lui dit : ‘Il est le Messager d’Allah et Allah ne l’humiliera jamais.’ Ensuite, la sourate Al-Fath (la Victoire) fut révélée et le Messager d’Allah (ﷺ) la récita jusqu’à la fin devant `Umar. `Umar demanda alors : ‘Ô Messager d’Allah (ﷺ) ! Était-ce (le traité de Hudaibiya) une victoire ?’ Le Messager d’Allah (ﷺ) répondit : ‘Oui.’ »",
          "id": "Telah bercerita kepada kami ['Abdullah bin Muhammad] telah bercerita kepada kami [Yahya bin Adam] telah bercerita kepada kami [Yazid bin 'Abdul 'Aziz] dari [bapaknya] telah bercerita kepada kami [Habib bin Abu Tsabit] berkata telah bercerita kepadaku [Abu Wa'il] berkata; Kami terlibat dalam perang Shiffiin lalu [Sahal bin Hunaif] berkata; \"Wahai sekalian manusia, berhati-hatilah kalian dengan diri kalian. Sungguh kami pernah bersama Rasulullah shallallahu 'alaihi wasallam pada hari Perjanjian Hudaibiyah. Seandainya saat itu kami berpendapat untuk perang pasti kami sudah berperang hingga datang 'Umar bin Al Khaththab seraya berkata; \"Wahai Rasulullah, bukankah kita berada di atas kebenaran sedangkan mereka di atas kebathilan?\". Beliau Shallallahu'alaihiwasallam menjawab: \"Ya, benar\". Lalu dia bertanya lagi; \"Bukankah siapa yang gugur diantara kita akan masuk surga sedang orang yang tewas dari mereka akan masuk neraka?\". Beliau Shallallahu'alaihiwasallam menjawab: \"Ya, benar\". 'Umar bertanya; \"Lalu atas dasar alasan apa kita menimpakan kehinaan dalam agama kita ini, apakah kita akan pulang sedangkan Allah belum memutuskan perkara antara kita dan mereka?\". Maka Beliau menjawab: \"Wahai putra Al Khaththab, aku ini Rasulullah dan Allah sekali-kali tidak akan menyia-nyiakan aku selamanya\". Kemudian 'Umar mendatangi Abu Bakr lalu mengatakan seperti yang dia katakan kepada Nabi shallallahu 'alaihi wasallam. Maka Abu Bakr berkata; \"Beliau itu Rasulullah dan Allah sekali-kali tidak akan menyia-nyiakan Beliau selamanya\". Maka kemudian turunlah surah al-Fath lalu Rasulullah shallallahu 'alaihi wasallam membacakannya kepada 'Umar hingga akhir surat. Lalu 'Umar bertanya; \"Wahai Rasulullah, apakah (keputusan) ini tanda kemenangan?\". Beliau menjawab: \"Ya",
          "tr": "Ebu Vail'in şöyle dediği nakledilmiştir: \"Biz Sıffin'de idik. Bu sırada Sehl İbn Huneyf kalkıp şunları söyledi: \"Ey insanlar, kusuru kendinizde arayın! Biz Hudeybiye barışı yapılırken Resulullah Sallallahu Aleyhi ve Sellem ile birlikte idik. O gün bir savaş olsaydı hiç geri durmaz savaşırdık. Barış sonrası Hz. Ömer gelip Resulullah Sallallahu Aleyhi ve Sellem'e: \"Ey Allah'ın Resulü, biz hak üzereyiz onlar ise batıl üzereler, değil mi?\" diye sordu. Nebi Sallallahu Aleyhi ve Sellem de: \"Evet, öyle\" buyurdu. Hz. Ömer: \"Bizden ölenler cennete, onlardan ölenler ise cehenneme gidecek, öyle değil mi?\" diyerek sorusuna devam etti. Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Evet, öyle\" buyurdu. Hz. Ömer: \"Peki öyleyse biz neye karşılık dinimize göre kıyaslandığında çok değersiz ve aşağılık olan bu inanca böylesine tavizler veriyoruz? Şimdi biz, Allah onlarla bizim aramızdaki hükmünü daha vermeden çekip gidecek miyiz?\" diye tepkisini ifade edince Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ey Hattab'ın oğlu, ben Allah'ın Resulüyüm. Allah beni asla yarı yolda bırakmayacaktır.\" Bu cevap üzerine Hz. Ömer, Hz. Ebu Bekir'in yanına gelerek ona da aynı şeyleri söyledi. Hz. Ebu Bekir de ona şöyle karşılık verdi: \"O Allah'ın Resulüdür. Allah onu asla yarı yolda bırakmayacaktır.\" Bu olayın ardından Fetih suresi vahyedildi. Resulullah Sallallahu Aleyhi ve Sellem de inen bu sureyi sonuna kadar Hz. Ömer'e okudu. Hz. Ömer: \"Ey Allah'ın Resulü, bu bir fetih mi yani?\" diye sorunca Nebi Sallallahu Aleyhi ve Sellem: \"Evet\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 24
      },
      "narrator": {
        "en": "Abu Wail"
      }
    },
    {
      "hadithNumber": 3183,
      "arabicNumber": 3183,
      "book": 58,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ ابْنَةِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ قَدِمَتْ عَلَىَّ أُمِّي وَهْىَ مُشْرِكَةٌ فِي عَهْدِ قُرَيْشٍ، إِذْ عَاهَدُوا رَسُولَ اللَّهِ صلى الله عليه وسلم وَمُدَّتِهِمْ، مَعَ أَبِيهَا، فَاسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ أُمِّي قَدِمَتْ عَلَىَّ، وَهْىَ رَاغِبَةٌ، أَفَأَصِلُهَا قَالَ ‏ \"‏ نَعَمْ، صِلِيهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Asma 'bint Abi Bakr:During the period of the peace treaty of Quraish with Allah's Messenger (ﷺ), my mother, accompanied by her father, came to visit me, and she was a pagan. I consulted Allah's Messenger (ﷺ), \"O Allah's Messenger (ﷺ)! My mother has come to me and she desires to receive a reward from me, shall I keep good relation with her?\" He said, \"Yes, keep good relation with her",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے حاتم نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے باپ نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے بیان کیا کہ قریش سے جس زمانہ میں رسول اللہ صلی اللہ علیہ وسلم نے ( حدیبیہ کی ) صلح کی تھی، اسی مدت میں میری والدہ ( قتیلہ ) اپنے باپ ( حارث بن مدرک ) کو ساتھ لے کر میرے پاس آئیں، وہ اسلام میں داخل نہیں ہوئی تھیں۔ ( عروہ نے بیان کیا کہ ) اسماء رضی اللہ عنہا نے اس بارے میں آپ صلی اللہ علیہ وسلم سے پوچھا کہ یا رسول اللہ! میری والدہ آئی ہوئی ہیں اور مجھ سے رغبت کے ساتھ ملنا چاہتی ہیں، تو کیا میں ان کے ساتھ صلہ رحمی کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں! ان کے ساتھ صلہ رحمی کر۔",
          "fr": "Rapporté par Asma bint Abi Bakr : Pendant la période du traité de paix entre Qouraïch et le Messager d’Allah (ﷺ), ma mère, accompagnée de son père, est venue me rendre visite alors qu’elle était polythéiste. J’ai consulté le Messager d’Allah (ﷺ) : « Ô Messager d’Allah (ﷺ) ! Ma mère est venue me voir et souhaite recevoir quelque chose de moi. Dois-je garder de bonnes relations avec elle ? » Il répondit : « Oui, garde de bonnes relations avec elle. »",
          "id": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Hatim bin Isma'il] dari [Hisyam bin 'Urwah] dari [bapaknya] dari [Asma' binti bau Bakr radliallahu 'anhuma] berkata; Ibuku menemuiku saat itu dia masih musyrik ketika quraisy muslimin mengikat perjanjian dengan Rasulullah shallallahu 'alaihi wasallam dan ayahnya, lalu aku meminta pendapat kepada Rasulullah shallallahu 'alaihi wasallam. Aku katakan; \"Wahai Rasulullah, Ibuku datang kepadaku dan dia sangat ingin (aku berbuat baik padanya), apakah aku harus tetap menjalin hubungan dengan ibuku?\". Beliau menjawab: \"Ya, sambunglah silaturrahim dengannya",
          "tr": "Esma' binti Ebi Bekir'in şöyle dediği nakledilmiştir: \"Kureyş müşriklerinin Resulullah Sallallahu Aleyhi ve Sellem ile anlaşma yaptığı barış döneminde müşrik olan annem beni görmeye gelmişti. Ben de Resul-i Ekrem Sallallahu Aleyhi ve Sellem'e giderek: \"Ey Allah'ın Resulü, annem beni görme arzusuyla buralara kadar gelmiş. Onu ziyaret edebilir miyim?\" diye sordum. O (Sallallahu aleyhi ve Sellem) de: \"Evet, onu ziyaret et!\" buyurdu.\" 19. ÜÇ GÜN VEYA BELİRLİ BİR SÜRE GEÇERLİ OLMAK ÜZERE BARIŞ ANLAŞMASI YAPMAK"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 25
      },
      "narrator": {
        "en": "Asma 'bint Abi Bakr"
      }
    },
    {
      "hadithNumber": 3184,
      "arabicNumber": 3184,
      "book": 58,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ بْنِ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي الْبَرَاءُ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا أَرَادَ أَنْ يَعْتَمِرَ أَرْسَلَ إِلَى أَهْلِ مَكَّةَ يَسْتَأْذِنُهُمْ لِيَدْخُلَ مَكَّةَ، فَاشْتَرَطُوا عَلَيْهِ أَنْ لاَ يُقِيمَ بِهَا إِلاَّ ثَلاَثَ لَيَالٍ، وَلاَ يَدْخُلَهَا إِلاَّ بِجُلُبَّانِ السِّلاَحِ، وَلاَ يَدْعُوَ مِنْهُمْ أَحَدًا، قَالَ فَأَخَذَ يَكْتُبُ الشَّرْطَ بَيْنَهُمْ عَلِيُّ بْنُ أَبِي طَالِبٍ، فَكَتَبَ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ فَقَالُوا لَوْ عَلِمْنَا أَنَّكَ رَسُولُ اللَّهِ لَمْ نَمْنَعْكَ وَلَبَايَعْنَاكَ، وَلَكِنِ اكْتُبْ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ‏.‏ فَقَالَ ‏\"‏ أَنَا وَاللَّهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ وَأَنَا وَاللَّهِ رَسُولُ اللَّهِ ‏\"‏‏.‏ قَالَ وَكَانَ لاَ يَكْتُبُ قَالَ فَقَالَ لِعَلِيٍّ ‏\"‏ امْحُ رَسُولَ اللَّهِ ‏\"‏‏.‏ فَقَالَ عَلِيٌّ وَاللَّهِ لاَ أَمْحَاهُ أَبَدًا‏.‏ قَالَ ‏\"‏ فَأَرِنِيهِ ‏\"‏‏.‏ قَالَ فَأَرَاهُ إِيَّاهُ، فَمَحَاهُ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ، فَلَمَّا دَخَلَ وَمَضَى الأَيَّامُ أَتَوْا عَلِيًّا فَقَالُوا مُرْ صَاحِبَكَ فَلْيَرْتَحِلْ‏.‏ فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ثُمَّ ارْتَحَلَ‏.‏",
        "translations": {
          "en": "Narrated Al-Bara:When the Prophet (ﷺ) intended to perform the `Umra he sent a person to the people of Mecca asking their permission to enter Mecca. They stipulated that he would not stay for more than three days and would not enter it except with sheathed arms and would not preach (Islam) to any of them. So `Ali bin Abi- Talib started writing the treaty between them. He wrote, \"This is what Muhammad, Apostle of Allah has agreed to.\" The (Meccans) said, \"If we knew that you (Muhammad) are the Messenger of Allah, then we would not have prevented you and would have followed you. But write, 'This is what Muhammad bin `Abdullah has agreed to..' \" On that Allah's Messenger (ﷺ) said, \"By Allah, I am Muhammad bin `Abdullah, and, by Allah, I am Apostle of 'Allah.\" Allah's Messenger (ﷺ) used not to write; so he asked `Ali to erase the expression of Apostle of Allah. On that `Ali said, \"By Allah I will never erase it.\" Allah's Apostle said (to `Ali), \"Let me see the paper.\" When `Ali showed him the paper, the Prophet (ﷺ) erased the expression with his own hand. When Allah's Messenger (ﷺ) had entered Mecca and three days had elapsed, the Meccans came to `Ali and said, \"Let your friend (i.e. the Prophet) quit Mecca.\" `Ali informed Allah's Messenger (ﷺ) about it and Allah's Messenger (ﷺ) said, \"Yes,\" and then he departed",
          "ur": "ہم سے احمد بن عثمان بن حکیم نے بیان کیا، کہا ہم سے شریح بن مسلمہ نے بیان کیا، کہا ہم سے ابراہیم بن یوسف بن ابی اسحاق نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے ابواسحاق نے بیان کیا، کہا کہ مجھ سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے جب عمرہ کرنا چاہا تو آپ نے مکہ میں داخلہ کے لیے مکہ کے لوگوں سے اجازت لینے کے لیے آدمی بھیجا۔ انہوں نے اس شرط کے ساتھ ( اجازت دی ) کہ مکہ میں تین دن سے زیادہ قیام نہ کریں۔ ہتھیار نیام میں رکھے بغیر داخل نہ ہوں اور ( مکہ کے ) کسی آدمی کو اپنے ساتھ ( مدینہ ) نہ لے جائیں ( اگرچہ وہ جانا چاہے ) انہوں نے بیان کیا کہ پھر ان شرائط کو علی بن ابی طالب رضی اللہ عنہ نے لکھنا شروع کیا اور اس طرح ”یہ محمد اللہ کے رسول کے صلح نامہ کی تحریر ہے۔“ مکہ والوں نے کہا کہ اگر ہم جان لیتے کہ آپ اللہ کے رسول ہیں تو پھر آپ کو روکتے ہی نہیں بلکہ آپ پر ایمان لاتے، اس لیے تمہیں یوں لکھنا چاہئے، ”یہ محمد بن عبداللہ کی صلح نامہ کی تحریر ہے“۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا، اللہ گواہ ہے کہ میں محمد بن عبداللہ ہوں اور اللہ گواہ ہے کہ میں اللہ کا رسول بھی ہوں۔ آپ صلی اللہ علیہ وسلم لکھنا نہیں جانتے تھے۔ راوی نے بیان کیا کہ آپ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے فرمایا کہ رسول اللہ کا لفظ مٹا دے۔ علی رضی اللہ عنہ نے عرض کیا کہ اللہ کی قسم! یہ لفظ تو میں کبھی نہ مٹاؤں گا، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر مجھے دکھلاؤ، راوی نے بیان کیا کہ علی رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کو وہ لفظ دکھایا۔ اور آپ صلی اللہ علیہ وسلم نے خود اپنے ہاتھ سے اسے مٹا دیا۔ پھر جب آپ صلی اللہ علیہ وسلم مکہ تشریف لے گئے اور ( تین ) دن گزر گئے تو قریش علی رضی اللہ عنہ کے پاس آئے اور کہا کہ اب اپنے ساتھی سے کہو کہ اب یہاں سے چلے جائیں ( علی رضی اللہ عنہ نے بیان کیا کہ ) میں نے اس کا ذکر آپ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ ہاں، چنانچہ آپ وہاں سے روانہ ہو گئے۔",
          "fr": "Rapporté par Al-Bara : Lorsque le Prophète (ﷺ) voulut accomplir la `Umra, il envoya quelqu’un demander aux gens de La Mecque la permission d’entrer dans la ville. Ils posèrent comme conditions qu’il ne reste pas plus de trois jours, qu’il n’entre qu’avec des armes rangées et qu’il ne prêche pas l’islam à aucun d’entre eux. `Ali bin Abi Talib commença alors à rédiger le traité entre eux. Il écrivit : « Ceci est ce sur quoi Muhammad, Messager d’Allah, s’est mis d’accord. » Les Mecquois dirent : « Si nous savions que tu es le Messager d’Allah, nous ne t’aurions pas empêché et nous t’aurions suivi. Mais écris plutôt : ‘Ceci est ce sur quoi Muhammad bin `Abdullah s’est mis d’accord.’ » Le Messager d’Allah (ﷺ) dit alors : « Par Allah, je suis Muhammad bin `Abdullah, et par Allah, je suis le Messager d’Allah. » Le Messager d’Allah (ﷺ) n’écrivait pas lui-même, alors il demanda à `Ali d’effacer l’expression ‘Messager d’Allah’. `Ali répondit : « Par Allah, je ne l’effacerai jamais. » Le Prophète (ﷺ) dit alors à `Ali : « Montre-moi le document. » Quand `Ali le lui montra, le Prophète (ﷺ) effaça lui-même l’expression de sa propre main. Quand le Prophète (ﷺ) entra à La Mecque et que les trois jours furent passés, les Mecquois vinrent voir `Ali et dirent : « Que ton ami (le Prophète) quitte La Mecque. » `Ali en informa le Prophète (ﷺ), qui répondit : « Oui, » puis il quitta la ville",
          "id": "Telah bercerita kepada kami [Ahmad bin 'Utsman bin Hakim] telah bercerita kepada kami [Syuraih bin Malsmah] telah bercerita kepada kami [Ibrahim bin Yusuf bin Abu Ishaq] berkata telah bercerita kepadaku [bapakku] dari [Abu Ishaq] berkata telah bercerita kepadaku [Al Bara' radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam ketika hendak menunaikan 'umrah Beliau mengutus utusan kepada penduduk Makkah untuk meminta mereka mengijinkan Beliau memasuki Makkah. Maka mereka mengajukan syarat kepada Beliau yaitu, Beliau tidak boleh tinggal di Makkah kecuali hanya tiga malam, Beliau tidak boleh masuk kota Makkah kecuali dalam keadaan senjata disarungkan dan Beliau tidak diperkenankan menda'wahi seorangpun. Lalu 'Ali bin Abu Thalib menuliskan syarat yang mereka ajukan. Dia menulis; \"Inilah ketetapan yang dibuat oleh Muhammad Rasulullah\". Maka mereka spontan berkata; \"Kalau kami ketahui bahwa kamu Rasulullah, tentu kami tidak akan menghalangi kamu dan pasti kami sudah berbai'at kepadamu. Akan tetapi tulislah; \"Inilah ketetapan yang dibuat oleh Muhammad bin 'Abdullah\". Maka Beliau berkata: \"Demi Alah, aku ini Muhammad bin 'Abdullah dan demi Allah aku ini benar Rasulullah\". Perawi (Al Bara') berkata; \"Saat itu 'Ali tidak mau menulisnya\". Perawi berkata; \"Maka Beliau berkata kepada 'Ali: \"Hapuslah kalimat Rasulullah\". 'Ali berkata: \"Demi Allah, sekali-kali aku tidak akan menghapusnya\". Beliau berkata: \"Tunjukkan kepadaku tulisan kalimat itu\". Perawi berkata; \"Maka 'Ali menunjukkannya lalu Nabi shallallahu 'alaihi wasallam menghapusnya dengan tangan Beliau. Ketika akhirnya Beliau masuk Makkah dan telah berlalu masa yang disyaratkan, mereka mendatangi 'Ali dan berkata; \"Perintahkan temanmu itu agar segera meninggalkan (Makkah) \". Kemudian 'Ali menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam maka Beliau berkata: \"Ya\". Lalu Beliau berangkat meninggalkan (Makkah)",
          "tr": "(El-Bera' bin Azib r.a.'den nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem umre yapmak isteyince Müşriklere bir elçi göndererek Mekke'ye girmek için izin istedi. Onlar da şu şartlarla Mekke'ye girmesine izin verdiler: 1) Üç geceden fazla Mekke'de kalınmayacak. 2) Mekke'ye silahsız olarak girilecek. 3) Mekkelilerden hiç kimse dine davet edilmeyecek. Mekkelilerle yapılan bu anlaşmanın metnini Ali İbn Ebi Talib yazmaya başladı. Ali: \"Bu, Allah'ın Resulü Muhammed'in üzerinde anlaşmaya vardığı hususlardır\" diye yazmıştı. Bunun üzerine Mekkeli müşrikler itiraz ettiler: \"Biz senin Allah'ın Resulü olduğunu bilip kabul etseydik zaten sana engel olmazdık ve kesinlikle sana tabi olurduk. Bu yüzden anlaşma metnine \"Bu, Abdullah'ın oğlu Muhammed'in üzerinde anlaşmaya vardığı hususlardır\" diye yazmalısın!\" Resulullah Sallallahu Aleyhi ve Sellem onların bu itirazına: \"Ben, Allah'a yemin ederim ki, Abdullah'ın oğlu Muhammedim ve ben, yine Allah'a yemin ederim ki Allah'ın Resulüyüm!\" diye cevap verdi ve bu ifadeyi yazmamakta direnen Hz. Aliiye dönerek: \"Metindeki Allah'ın Resulü ifadesini sil!\" dedi. Hz. Ali ise: \"Allah'a yemin ederim ki, bu ifadeyi asla silmeyeceğim!\" dedi. Bunun üzerine Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Bu ifadenin yerini bana göster!\" buyurdu. Hz. Ali gösterince de Nebi Sallallahu Aleyhi ve Sellem kendi eliyle Allah'ın Resulü ifadesini sildi. Resulullah Sallallahu Aleyhi ve Sellem anlaşmanın ardından Mekke'ye girip anlaşma süresini doldurunca Mekkeliler Hz. Ali'nin yanına gelerek: \"Adamına söyle, süre doldu. Artık burayı terk edip gitsin!\" dediler. Hz. Ali de bu durumu Resul-i Ekrem Sallallahu Aleyhi ve Sellem'e anlattı. Resulullah Sallallahu Aleyhi ve Sellem da: \"Tamam, olur!\" dedi ve Mekke'den ayrıldı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 26
      },
      "narrator": {
        "en": "Al-Bara"
      }
    },
    {
      "hadithNumber": 3185,
      "arabicNumber": 3185,
      "book": 58,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ بْنُ عُثْمَانَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم سَاجِدٌ وَحَوْلَهُ نَاسٌ مِنْ قُرَيْشٍ مِنَ الْمُشْرِكِينَ إِذْ جَاءَ عُقْبَةُ بْنُ أَبِي مُعَيْطٍ بِسَلَى جَزُورٍ، فَقَذَفَهُ عَلَى ظَهْرِ النَّبِيِّ صلى الله عليه وسلم فَلَمْ يَرْفَعْ رَأْسَهُ حَتَّى جَاءَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ فَأَخَذَتْ مِنْ ظَهْرِهِ، وَدَعَتْ عَلَى مَنْ صَنَعَ ذَلِكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ عَلَيْكَ الْمَلأَ مِنْ قُرَيْشٍ، اللَّهُمَّ عَلَيْكَ أَبَا جَهْلِ بْنَ هِشَامٍ، وَعُتْبَةَ بْنَ رَبِيعَةَ، وَشَيْبَةَ بْنَ رَبِيعَةَ، وَعُقْبَةَ بْنَ أَبِي مُعَيْطٍ، وَأُمَيَّةَ بْنَ خَلَفٍ ـ أَوْ أُبَىَّ بْنَ خَلَفٍ ‏\"‏‏.‏ فَلَقَدْ رَأَيْتُهُمْ قُتِلُوا يَوْمَ بَدْرٍ، فَأُلْقُوا فِي بِئْرٍ، غَيْرَ أُمَيَّةَ أَوْ أُبَىٍّ، فَإِنَّهُ كَانَ رَجُلاً ضَخْمًا، فَلَمَّا جَرُّوهُ تَقَطَّعَتْ أَوْصَالُهُ قَبْلَ أَنْ يُلْقَى فِي الْبِئْرِ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah:While the Prophet (ﷺ) was in the state of prostration, surrounded by a group of people from Quraish pagans. `Uqba bin Abi Mu'ait came and brought the intestines of a camel and threw them on the back of the Prophet (ﷺ) . The Prophet (ﷺ) did not raise his head from prostration till Fatima (i.e. his daughter) came and removed those intestines from his back, and invoked evil on whoever had done (the evil deed). The Prophet (ﷺ) said, \"O Allah! Destroy the chiefs of Quraish, O Allah! Destroy Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, `Uqba bin Abi Mu'ait, Umaiya bin Khalaf (or Ubai bin Khalaf).\" Later on I saw all of them killed during the battle of Badr and their bodies were thrown into a well except the body of Umaiya or Ubai, because he was a fat person, and when he was pulled, the parts of his body got separated before he was thrown into the well",
          "ur": "ہم سے عبدان بن عثمان نے بیان کیا، انہوں نے کہا کہ مجھے میرے باپ نے خبر دی، انہیں شعبہ نے، انہیں ابواسحاق نے، انہیں عمرو بن میمون نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ مکہ میں ( شروع اسلام کے زمانہ میں رسول اللہ صلی اللہ علیہ وسلم سجدہ کی حالت میں تھے اور قریب ہی قریش کے کچھ لوگ بیٹھے ہوئے تھے۔ پھر عقبہ بن ابی معیط اونٹ کی اوجھڑی لایا اور نبی کریم صلی اللہ علیہ وسلم کی پیٹھ پر اسے ڈال دیا۔ نبی کریم صلی اللہ علیہ وسلم سجدہ سے اپنا سر نہ اٹھا سکے۔ آخر فاطمہ رضی اللہ عنہا آئیں اور آپ صلی اللہ علیہ وسلم کی پیٹھ پر سے اس اوجھڑی کو ہٹایا اور جس نے یہ حرکت کی تھی اسے برا بھلا کہا، نبی کریم صلی اللہ علیہ وسلم نے بھی بددعا کی کہ اے اللہ! قریش کی اس جماعت کو پکڑ۔ اے اللہ! ابوجہل بن ہشام، عتبہ بن ربیعہ، شیبہ بن ربیعہ، عقبہ بن ابی معیط، امیہ بن خلف یا ابی بن خلف کو برباد کر۔ پھر میں نے دیکھا کہ یہ سب بدر کی لڑائی میں قتل کر دئیے گئے۔ اور ایک کنویں میں انہیں ڈال دیا گیا تھا۔ سوا امیہ یا ابی کے کہ یہ شخص بہت بھاری بھر کم تھا۔ جب اسے صحابہ نے کھینچا تو کنویں میں ڈالنے سے پہلے ہی اس کے جوڑ جوڑ الگ ہو گئے۔)",
          "fr": "Rapporté par `Abdullah : Pendant que le Prophète (ﷺ) était en prosternation, entouré par un groupe de polythéistes de Qouraïch, `Uqba bin Abi Mu’ait vint avec les entrailles d’un chameau et les jeta sur le dos du Prophète (ﷺ). Le Prophète (ﷺ) ne releva pas la tête de sa prosternation jusqu’à ce que Fatima (sa fille) vienne et enlève ces entrailles de son dos, puis elle invoqua le mal contre ceux qui avaient fait cela. Le Prophète (ﷺ) dit : « Ô Allah ! Détruis les chefs de Qouraïch, ô Allah ! Détruis Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, `Uqba bin Abi Mu’ait, Umaiya bin Khalaf (ou Ubai bin Khalaf). » Plus tard, je les ai tous vus tués lors de la bataille de Badr, leurs corps jetés dans un puits, sauf celui d’Umaiya ou d’Ubai, car il était corpulent et, quand on le tira, son corps se déchira avant d’être jeté dans le puits",
          "id": "Telah bercerita kepada kami ['Abdan bin 'Utsman] berkata telah mengabarkan kepadaku [bapakku] dari [Syu'bah] dari [Abu Ishaq] dari ['Amru bin Maimun] dari ['Abdullah radliallahu 'anhu] berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang sujud di sekeliling Beliau, ada orang-orang Musyrikin Quraisy lalu datang 'Uqbah bin Mu'ayth datang dengan membawa jeroan (isi perut) hewan sembelihan lalu meletakkannya pada punggung Nabi shallallahu 'alaihi wasallam dan Beliau tidak mengangkat kepala Beliau hingga akhirnya datang Fathimah Alaihissalam membuangnya dari punggung Beliau dan berseru memanggil orang yang telah melakukan perbuatan itu. Kemudian Beliau berdo'a: \"ALLOOHUMMA 'ALAIKA ABA JAHL BIN HISYAM, WA'UTBAH BIN RABI'AH, WASYAIBAH BIN RABI'AH, WA'UQBAH BIN ABI MU'ITH, WA UMAYYAH BIN KHALAF, Ya Allah, aku serahkan (urusan) para pembesar Quraisy kepadaMu. Ya Allah aku serahkan (urusan) Abu Jahal bin Hisyam, 'Utbah bin Rabi'ah, Syaibah bin Rabi'ah, 'Uqbah bin Abu Mu'aith, Umayyah bin Khalaf atau Ubay bin Khalaf kepadaMu\". Dan sungguh aku melihat mereka terbantai dalam perang Badar. Lalu mereka dilempar di sumur kecuali Umayyah atau Ubay karena dia adalah seorang yang berbadan besar dan ketika para shahabat hendak menyeretnya, anggota badannya terputus-putus sebelum dilempar kedalam sumur",
          "tr": "Abdullah r.a.'ın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem Kabe'de ibadet ederken secdeye varmıştı. Bu sırada Kureyş müşriklerinden bir grup O'nun (Sallallahu aleyhi ve Sellem) etrafına toplanmıştı. Ukbe İbn Ebi Muayt bir deve işkembesini getirip secdede bulunan Nebi Sallallahu Aleyhi ve Sellem'in sırtına bıraktı. Nebi Sallallahu Aleyhi ve Sellem de Hz. Fatıma gelene kadar başını kaldıramadı. Hz. Fatıma gelince işkembeyi Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in sırtından kaldırıp attı ve bunu yapana beddua etti. Resulullah Sallallahu Aleyhi ve Sellem de şöyle dedi: \"Allahım, Kureyş'ten olan bu azgın topluluğu sana havale ediyorum! Allahım, özellikle Ebu Cehil İbn Hişam'ı, Utbe İbn Rebia'yı, Şeybe İbn Rebia'yı, Ukbe İbn Ebi Muayt'ı ve Ümeyye İbn Halef'i - veya Übeyy İbn Halef'i - sana havale ediyorum!\" (Abdullah ibn-i Mes'ud r.a. diyorki:) Ben bunların hepsinin sonunu gördüm. Bedir savaşında hepsi gebertilmiş ve bir kuyuya atılmıştı. Sadece Ümeyye'yi - veya Ubeyy'i - kuyuya atamamışlardı. Çünkü bu adam öylesine şişman ve iri idi ki kuyuya atılmak üzere sürüklenirken kolları / eklemleri kopmuştu. Bu yüzden kuyuya götürülememişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 27
      },
      "narrator": {
        "en": "`Abdullah"
      }
    },
    {
      "hadithNumber": 3186,
      "arabicNumber": 3186,
      "book": 58,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ‏.‏وَعَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ ـ قَالَ أَحَدُهُمَا يُنْصَبُ وَقَالَ الآخَرُ ـ يُرَى يَوْمَ الْقِيَامَةِ يُعْرَفُ بِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas:The Prophet (ﷺ) said, ''Every betrayer will have a flag on the Day of Resurrection\" One of the two subnarrators said that the flag would be fixed, and the other said that it would be shown on the Day of Resurrection, so that the betrayer might be recognized by it",
          "fr": "Rapporté par Anas : Le Prophète (ﷺ) a dit : « Chaque traître aura un drapeau le Jour de la Résurrection. » L’un des deux rapporteurs a précisé que le drapeau serait planté, l’autre a dit qu’il serait montré le Jour de la Résurrection afin que le traître soit reconnu par ce signe",
          "id": "Telah bercerita kepada kami [Abu Al Walid] telah bercerita kepada kami [Syu'bah] dari [Sulaiman Al A'masy] dari [Abu Wa'il] dari ['Abdullah] dan dari [Tsabit] dari [Anas] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Bagi setiap pengkhiyanat akan diberikan bendera pada hari qiyamat\". Salah seorang dari perawi tersebut berkata; \"Bendera itu ditegakkan\". Yang lainnya berkata; \"Bendera itu terlihat pada hari qiyamat sehingga dapat dikenali",
          "tr": "Enes İbn Malik r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Verdiği sözde durmayıp hainlik eden herkesin kıyamet gününde bir sancağı olacaktır. Bu sancak kıyamet günü dikilecek - başka bir rivayete göre \"oradakiler tarafından görülecek\" - ve onun tanınmasını sağlayacaktır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 28
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 3188,
      "arabicNumber": 3188,
      "book": 58,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لِكُلِّ غَادِرٍ لِوَاءٌ يُنْصَبُ لِغَدْرَتِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:The Prophet (ﷺ) said, \"Every betrayer will have a flag which will be fixed on the Day of Resurrection, and the flag's prominence will be made in order to show the betrayal he committed",
          "ur": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد نے بیان کیا، ان سے ایوب نے، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم نے فرمایا ”ہر دغا باز کے لیے قیامت کے دن ایک جھنڈا ہو گا جو اس کی دغا بازی کی علامت کے طور پر ( اس کے پیچھے ) گاڑ دیا جائے گا۔“",
          "fr": "Rapporté par Ibn `Umar : Le Prophète (ﷺ) a dit : « Chaque traître aura un drapeau qui sera planté le Jour de la Résurrection, et ce drapeau sera mis en évidence pour montrer la trahison qu’il a commise. »",
          "id": "Telah bercerita kepada kami [Sulaiman bin Harb] telah bercerita kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Bagi setiap pengkhiyanat akan diberikan bendera pada hari qiyamat yang ditegakkan sesuai kadar pengkhiyanatannya",
          "tr": "Abdullah İbn Ömer r.a. şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu işittim: \"Sözünde durmayıp hıyanet eden herkes için kıyamet gününde hıyaneti ölçüsünde sancak dikilecektir.\" Tekrar: 6177,6178,6966 ve"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 29
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 3189,
      "arabicNumber": 3189,
      "book": 58,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ ‏\"‏ لاَ هِجْرَةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ، وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا ‏\"‏‏.‏ وَقَالَ يَوْمَ فَتْحِ مَكَّةَ ‏\"‏ إِنَّ هَذَا الْبَلَدَ حَرَّمَهُ اللَّهُ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، فَهْوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ، وَإِنَّهُ لَمْ يَحِلَّ الْقِتَالُ فِيهِ لأَحَدٍ قَبْلِي، وَلَمْ يَحِلَّ لِي إِلاَّ سَاعَةً مِنْ نَهَارٍ، فَهْوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ، لاَ يُعْضَدُ شَوْكُهُ، وَلاَ يُنَفَّرُ صَيْدُهُ، وَلاَ يَلْتَقِطُ لُقَطَتَهُ إِلاَّ مَنْ عَرَّفَهَا، وَلاَ يُخْتَلَى خَلاَهُ ‏\"‏‏.‏ فَقَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ إِلاَّ الإِذْخِرَ، فَإِنَّهُ لِقَيْنِهِمْ وَلِبُيُوتِهِمْ‏.‏ قَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:Allah's Messenger (ﷺ) said on the day of the conquest of Mecca, \"There is no migration now, but there is Jihad (i.e.. holy battle) and good intentions. And when you are called for Jihad, you should come out at once\" Allah's Messenger (ﷺ) also said, on the day of the conquest of Mecca, \"Allah has made this town a sanctuary since the day He created the Heavens and the Earth. So, it is a sanctuary by Allah's Decree till the Day of Resurrection. Fighting in it was not legal for anyone before me, and it was made legal for me only for an hour by daytime. So, it (i.e. Mecca) is a sanctuary by Allah's Decree till the Day of Resurrection. Its thorny bushes should not be cut, and its game should not be chased, its fallen property (i.e. Luqata) should not be picked up except by one who will announce it publicly; and its grass should not be uprooted,\" On that Al-`Abbas said, \"O Allah's Messenger (ﷺ)! Except the Idhkhir, because it is used by the goldsmiths and by the people for their houses.\" On that the Prophet (ﷺ) said, \"Except the Idhkhir",
          "ur": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے مجاہد نے، ان سے طاؤس نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دن فرمایا تھا، اب ( مکہ سے ) ہجرت فرض نہیں رہی۔ البتہ جہاد کی نیت اور جہاد کا حکم باقی ہے۔ اس لیے جب تمہیں جہاد کے لیے نکالا جائے تو فوراً نکل جاؤ اور آپ صلی اللہ علیہ وسلم نے فتح مکہ کے دن یہ بھی فرمایا تھا کہ جس دن اللہ تعالیٰ نے آسمان اور زمین پیدا کئے، اسی دن اس شہر ( مکہ ) کو حرم قرار دے دیا۔ پس یہ شہر اللہ کی حرمت کے ساتھ قیامت تک کے لیے حرام ہی رہے گا، اور مجھ سے پہلے یہاں کسی کے لیے لڑنا جائز نہیں ہوا۔ اور میرے لیے بھی دن کی صرف ایک گھڑی کے لیے جائز کیا گیا۔ پس اب یہ مبارک شہر اللہ تعالیٰ کی حرمت کے ساتھ قیامت تک کے لیے حرام ہے، اس کی حدود میں نہ ( کسی درخت کا ) کانٹا توڑا جائے، نہ یہاں کے شکار کو ستایا جائے، اور کوئی یہاں کی گری ہوئی چیز نہ اٹھائے سوا اس شخص کے جو ( مالک تک چیز کو پہنچانے کے لیے ) اعلان کرے اور نہ یہاں کی ہری گھاس کاٹی جائے۔ اس پر عباس رضی اللہ عنہ نے کہا، یا رسول اللہ! اذخر کی اجازت دے دیجئیے۔ کیونکہ یہ یہاں کے سناروں اور گھروں کی چھتوں پر ڈالنے کے کام آتی ہے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اذخر کی اجازت ہے۔",
          "fr": "Rapporté par Ibn `Abbas : Le Messager d’Allah (ﷺ) a dit le jour de la conquête de La Mecque : « Il n’y a plus de migration maintenant, mais il y a le Jihad (combat dans la voie d’Allah) et de bonnes intentions. Et quand on vous appelle pour le Jihad, partez immédiatement. » Le Messager d’Allah (ﷺ) a aussi dit, le jour de la conquête de La Mecque : « Allah a fait de cette ville un sanctuaire depuis le jour où Il a créé les cieux et la terre. Elle est donc un sanctuaire par décret d’Allah jusqu’au Jour de la Résurrection. Il n’était permis à personne d’y combattre avant moi, et il ne m’a été permis d’y combattre que pendant une heure du jour. Donc, elle (La Mecque) reste un sanctuaire par décret d’Allah jusqu’au Jour de la Résurrection. Ses buissons épineux ne doivent pas être coupés, son gibier ne doit pas être chassé, ses objets trouvés (luqata) ne doivent pas être ramassés sauf par celui qui les annoncera publiquement, et son herbe ne doit pas être arrachée. » Sur ce, Al-`Abbas dit : « Ô Messager d’Allah (ﷺ) ! Sauf l’idhkhir, car il est utilisé par les orfèvres et les gens pour leurs maisons. » Le Prophète (ﷺ) répondit : « Sauf l’idhkhir. »",
          "id": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Jarir] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu 'Abbas radliallahu 'anhu] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda pada hari Pembebasan Makkah: \"Tidak ada lagi hijrah akan tetapi yang tetap ada adalah jihad dan niat. Maka jika kalian diperintahkan untuk berangkat berperang, berangkatlah\". Dan Beliau juga bersabda pada hari Pembebasan Makkah: \"Sesungguhnya negeri ini telah Allah haramkan (sucikan) sejak hari penciptaan langit dan bumi, maka dia akan tetap suci dengan pensucian dari Allah itu hingga hari qiyamat, dan sesungguhnya tidaklah dihalalkan untuk berperang di dalamnya bagi seorangpun sebelumku, dan juga tidak dihalalkan bagiku kecuali sesaat saja dalam suatu hari, maka dia suci dengan pensucian Allah itu hingga hari qiyamat, tidak boleh ditebang pepohonannya, tidak boleh diburu hewan buruannya dan tidak ditemukan satupun barang temuan kecuali harus dikembalikan kepada yang mengenalnya (pemiliknya) dan tidak boleh ditebang pepohonnya\". Maka Al 'Abbas radliallahu 'anhu berkata: \"Wahai Rasulullah, kecuali pohon idzkhir yang berguna untuk wewangian tukang besi mereka (penduduk Makkah) dan rumah-rumah mereka\". Beliau bersabda: \"Ya, kecuali pohon idzkhir",
          "tr": "Abdullah İbn Abbas r.a.'ın naklettiğine göre Nebi Sallallahu Aleyhi ve Sellem Mekke'nin fethedildiği gün şöyle buyurmuştur: \"Artık hicret yoktur. Ancak cihad ve niyet vardır. Siz eğer savaş için çağırılacak olursanız derhal bu çağrıya uyun!\" Resul-i Ekrem Sallallahu Aleyhi ve Sellem aynı gün yine şöyle buyurdu: \"Allah Teala işte bu beldeyi, gökleri ve yeri yarattığı günden beri haram kılmıştır ve burası yine Allah’ın haram kılması ile kıyamet gününe kadar haram olmaya devam edecektir. Burada savaşmak için benden önce hiç kimseye musaade edilmediği gibi bana da müsaade edilmemiştir. Burada savaşmak sadece bir günün kısa bir süresi için helal kılınmıştır. Burası Allah'ın haram kılması ile kıyamet gününe kadar haram olmaya devam edecektir. Buranın otu koparılmaz, avları ürkütülmez, buluntu malları sadece özellikleri belirtilip sahibine iade edilmek üzere alınabilir.\" Bu sırada Abbas şöyle dedi: \"Ey Allah'ın Resulü, izhir otunun toplanmasını bundan istisna edelim. Çünkü onlar bunu evleri için kullanırlar.\" Abbas bunu söyleyince Nebi Sallallahu Aleyhi ve Sellem de: \"izhir hariç\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 58,
        "hadith": 30
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "28KB"
  }
}