{
  "collection": "bukhari",
  "book": 51,
  "name": {
    "arabic": "كتاب Gifts",
    "transliteration": "gifts",
    "translation": "Gifts"
  },
  "totalHadith": 68,
  "hadithNumberRange": {
    "first": 2566,
    "last": 2636
  },
  "content": [
    {
      "hadithNumber": 2566,
      "arabicNumber": 2566,
      "book": 51,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، ‏{‏عَنْ أَبِيهِ،‏}‏ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَا نِسَاءَ الْمُسْلِمَاتِ لاَ تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا، وَلَوْ فِرْسِنَ شَاةٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"O Muslim women! None of you should look down upon the gift sent by her female neighbor even if it were the trotters of the sheep (fleshless part of legs)",
          "ur": "ہم سے عاصم بن علی ابوالحسین نے بیان کیا، کہا ہم سے ابن ابی ذئب نے بیان کیا، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اے مسلمان عورتو! ہرگز کوئی پڑوسن اپنی دوسری پڑوسن کے لیے ( معمولی ہدیہ کو بھی ) حقیر نہ سمجھے، خواہ بکری کے کھر کا ہی کیوں نہ ہو۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Ô femmes musulmanes ! Aucune d’entre vous ne doit mépriser le cadeau offert par sa voisine, même s’il ne s’agit que des pieds d’un mouton (la partie sans chair des pattes). »",
          "id": "Telah menceritakan kepada kami ['Ashim bin 'Ali] telah menceritakan kepada kami [Ibnu Abi Dza'bi] dari [Al Maqburiy] dari [bapaknya] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai wanita-wanita muslim, janganlah seorang budak wanita menganggap remeh memberi hadiah budak wanita lainnya sekalipun hanya sebesar kubangan karena diinjak kambing",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ey müslüman kadınlar! Komşunuza bir koyun paçası bile olsa (hediye vermeyi) önemsiz sanmayın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 1
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2567,
      "arabicNumber": 2567,
      "book": 51,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ لِعُرْوَةَ ابْنَ أُخْتِي، إِنْ كُنَّا لَنَنْظُرُ إِلَى الْهِلاَلِ ثُمَّ الْهِلاَلِ، ثَلاَثَةَ أَهِلَّةٍ فِي شَهْرَيْنِ، وَمَا أُوقِدَتْ فِي أَبْيَاتِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَارٌ‏.‏ فَقُلْتُ يَا خَالَةُ مَا كَانَ يُعِيشُكُمْ قَالَتِ الأَسْوَدَانِ التَّمْرُ وَالْمَاءُ، إِلاَّ أَنَّهُ قَدْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم جِيرَانٌ مِنَ الأَنْصَارِ كَانَتْ لَهُمْ مَنَائِحُ، وَكَانُوا يَمْنَحُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ أَلْبَانِهِمْ، فَيَسْقِينَا‏.‏",
        "translations": {
          "en": "Narrated `Urwa:Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the crescent in this way we saw three crescents in two months and no fire (for cooking) used to be made in the houses of Allah's Messenger (ﷺ). I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The two black things: dates and water, our neighbors from Ansar had some Manaih and they used to present Allah's Messenger (ﷺ) some of their milk and he used to make us drink",
          "ur": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا، کہا ہم سے ابن ابی حازم نے بیان کیا، ان سے ان کے والد نے یزید بن رومان سے، وہ عروہ سے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ آپ نے عروہ سے کہا، میرے بھانجے! رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ( یہ حال تھا کہ ) ہم ایک چاند دیکھتے، پھر دوسرا دیکھتے، پھر تیسرا دیکھتے، اسی طرح دو دو مہینے گزر جاتے اور رسول اللہ صلی اللہ علیہ وسلم کے گھروں میں ( کھانا پکانے کے لیے ) آگ نہ جلتی تھی۔ میں نے پوچھا۔ خالہ اماں! پھر آپ لوگ زندہ کس طرح رہتی تھیں؟ آپ نے فرمایا کہ صرف دو کالی چیزوں کھجور اور پانی پر۔ البتہ رسول اللہ صلی اللہ علیہ وسلم کے چند انصاری پڑوسی تھے۔ جن کے پاس دودھ دینے والی بکریاں تھیں اور وہ رسول اللہ صلی اللہ علیہ وسلم کے یہاں بھی ان کا دودھ تحفہ کے طور پر پہنچا جایا کرتے تھے۔ آپ صلی اللہ علیہ وسلم اسے ہمیں بھی پلا دیا کرتے تھے۔",
          "fr": "Rapporté par `Urwa : Aisha m’a dit : « Ô mon neveu ! Nous voyions le croissant de lune, puis un autre, puis encore un autre, ainsi nous voyions trois croissants en deux mois, et aucun feu (pour cuisiner) n’était allumé dans les maisons du Messager d’Allah (ﷺ). » J’ai dit : « Ô ma tante ! Qu’est-ce qui vous faisait vivre alors ? » Aisha a dit : « Les deux choses noires : les dattes et l’eau. Nos voisins parmi les Ansar avaient des troupeaux et ils offraient au Messager d’Allah (ﷺ) un peu de leur lait, et il nous en faisait boire. »",
          "id": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah Al Awaisiy] telah menceritakan kepada kami [Ibnu Abi HAzim] dari [bapaknya] dari [YAzid bin Ruman] dari ['Urwah] dari ['Aisyah radliallahu 'anha] bahwa dia berkata, kepada 'Urwah anak dari saudara perempuannya: \"Sesungguhnya kami memperhatikan hilal kemudian hilal untuk ketiga kalinya dalam satu bulan dan tidak ada api yang dinyalakan di rumah-rumah Rasulullah shallallahu 'alaihi wasallam. Aku berkata: \"Wahai bibi, apa yang dapat menjadikan kalian bertahan hidup?\". Dia berkata: \"Dua hal yang hitam, kurma dan air. Selain itu Rasulullah shallallahu 'alaihi wasallam mempunyai dua tetangga dari kalangan Anshar, yang mereka memiliki anak unta yang dapat diambil air susunya untuk Rasulullah shallallahu 'alaihi wasallam, lalu kedua tetangga itu memberi kami minum",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: Urve'ye \"Yeğenim! Biz hilal'i gözlerdik, ikinci hilali gözlerdik. İki ayda üç hilal görürdük de Allah Resulü'nün evlerinde (yemek pişirilmek için) ateş yanmadığı olurdu\" dedi. Urve: \"Teyze! Durum bu iken siz nasıl yaşıyordunuz!\" diye sordu. Aişe \"Hurma ve suyumuz vardı. Tabi bir de ensardan bazı komşulardan ikramlar gelirdi. Allah Resulü’ne süt ikram ederlerdi. O da bize onu içirirdi\" dedi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 2
      },
      "narrator": {
        "en": "`Urwa"
      }
    },
    {
      "hadithNumber": 2568,
      "arabicNumber": 2568,
      "book": 51,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ دُعِيتُ إِلَى ذِرَاعٍ أَوْ كُرَاعٍ لأَجَبْتُ، وَلَوْ أُهْدِيَ إِلَىَّ ذِرَاعٌ أَوْ كُرَاعٌ لَقَبِلْتُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"I shall accept the invitation even if I were invited to a meal of a sheep's trotter, and I shall accept the gift even if it were an arm or a trotter of a sheep",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن ابی عدی نے بیان کیا شعبہ سے، وہ سلیمان سے، وہ ابوحازم سے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اگر مجھے بازو اور پائے ( کے گوشت ) پر بھی دعوت دی جائے تو میں قبول کر لوں گا اور مجھے بازو یا پائے ( کے گوشت ) کا تحفہ بھیجا جائے تو اسے بھی قبول کر لوں گا۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « J’accepterai une invitation même si c’est pour un repas fait avec les pieds d’un mouton, et j’accepterai un cadeau même s’il s’agit d’un bras ou d’un pied de mouton. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Ibnu Abi 'Abdiy] dari [Syu'bah] dari [Sulaiman] dari [Abu HAzim] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Seandainya aku diundang untuk jamuan makan sebesar satu paha depan (kambing) atau satu paha belakangnya, pasti aku penuhi dan seandainya aku diberi hadiah makanan satu paha depan (kambing) atau satu paha belakang pasti aku terima",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: \"Paça yemeye bile davet edilsem giderim; paça da hediye edilse kabul ederim.\" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 3
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2569,
      "arabicNumber": 2569,
      "book": 51,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَرْسَلَ إِلَى امْرَأَةٍ مِنَ الْمُهَاجِرِينَ، وَكَانَ لَهَا غُلاَمٌ نَجَّارٌ قَالَ لَهَا ‏\"‏ مُرِي عَبْدَكِ فَلْيَعْمَلْ لَنَا أَعْوَادَ الْمِنْبَرِ ‏\"‏‏.‏ فَأَمَرَتْ عَبْدَهَا، فَذَهَبَ فَقَطَعَ مِنَ الطَّرْفَاءِ، فَصَنَعَ لَهُ مِنْبَرًا، فَلَمَّا قَضَاهُ أَرْسَلَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَدْ قَضَاهُ، قَالَ صلى الله عليه وسلم ‏\"‏ أَرْسِلِي بِهِ إِلَىَّ ‏\"‏‏.‏ فَجَاءُوا بِهِ فَاحْتَمَلَهُ النَّبِيُّ صلى الله عليه وسلم فَوَضَعَهُ حَيْثُ تَرَوْنَ‏.‏",
        "translations": {
          "en": "Narrated Sahl:The Prophet (ﷺ) sent for a woman from the emigrants and she had a slave who was a carpenter. The Prophet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her slave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he finished the pulpit, the woman informed the Prophet (ﷺ) that it had been finished. The Prophet (ﷺ) asked her to send that pulpit to him, so they brought it. The Prophet (ﷺ) lifted it and placed it at the place in which you see now",
          "ur": "ہم سے سعید بن ابی مریم نے بیان، کہا ہم سے ابوغسان محمد بن مطرف نے بیان کیا، کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا سہل بن سعد ساعدی رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک مہاجرہ عورت کے پاس ( اپنا آدمی ) بھیجا۔ ان کا ایک غلام بڑھئی تھا۔ ان سے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے غلام سے ہمارے لیے لکڑیوں کا ایک منبر بنانے کے لیے کہیں۔ چنانچہ انہوں نے اپنے غلام سے کہا۔ وہ غابہ سے جا کر جھاؤ کاٹ لایا اور اسی کا ایک منبر بنا دیا۔ جب وہ منبر بنا چکے تو اس عورت نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں کہلا بھیجا کہ منبر بن کر تیار ہے۔ آپ صلی اللہ علیہ وسلم نے کہلوایا کہ اسے میرے پاس بھجوا دیں۔ جب لوگ اسے لائے تو آپ صلی اللہ علیہ وسلم نے خود اسے اٹھایا اور جہاں تم اب دیکھ رہے ہو۔ وہیں آپ صلی اللہ علیہ وسلم نے اسے رکھا۔",
          "fr": "Rapporté par Sahl : Le Prophète (ﷺ) fit venir une femme parmi les émigrants, qui avait un esclave charpentier. Le Prophète lui dit : « Demande à ton esclave de préparer le bois pour la chaire. » Elle donna donc l’ordre à son esclave, qui alla couper du bois de tamaris et fabriqua la chaire pour le Prophète. Quand il eut terminé, la femme informa le Prophète (ﷺ) que la chaire était prête. Le Prophète (ﷺ) lui demanda de la lui envoyer, et ils la lui apportèrent. Le Prophète (ﷺ) la souleva et la plaça à l’endroit où vous la voyez maintenant",
          "id": "Telah menceritakan kepada kami [Ibnu Abi Maryam] telah menceritakan kepada kami [Abu Ghossan] berkata, telah menceritakan kepadaku [Abu HAzim] dari [Sahal radliallahu 'anhu] bahwa Nabi shallallahu 'alaihi wasallam mengutus seorang wanita Muhajirin yang wanita ini memiliki ghulam yang pandai olah mengolah kayu. Beliau berkata kepadanya; \"Perintahkanlah sahayamu agar membuatkan mimbar untuk kami\". Maka wanita itu memerintahkan ghulamnya. Maka ghulam itu pergi mencari kayu di hutan lalu dia membuat mimbar untuk Beliau. Ketika dia telah menyelesaikan pekerjaannya wanita itu mengirim mimbar tersebut kepada Nabi shallallahu 'alaihi wasallam. Beliau shallallahu 'alaihi wasallam berkata: \"Bawalah mimbar itu kepadaku\". Lalu orang-orang datang dengan membawa mimbar tersebut kemudian Nabi shallallahu 'alaihi wasallam menempatkan mimbar tersebut pada tempat yang sekarang kalian lihat",
          "tr": "Sehl r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem muhacirlerden marangoz kölesi olan bir kadına haber göndererek \"Kölene söyle de bize minberin basamak ve direklerini yapsın\" buyurdu. Kadının emri üzerine kölesi gitti ve ılgın ağacından minber yaptı. Bitirince kadın Hz. Nebi'e birini göndererek kölesinin işini bitirdiğini haber verdi. Nebi Sallallahu Aleyhi ve Sellem minberi göndermesi için ona haber yolladı. Minberi getirdiler. Hz. Nebi onu kendi eliyle yerine koydu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 4
      },
      "narrator": {
        "en": "Sahl"
      }
    },
    {
      "hadithNumber": 2570,
      "arabicNumber": 2570,
      "book": 51,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ السَّلَمِيِّ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كُنْتُ يَوْمًا جَالِسًا مَعَ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي مَنْزِلٍ فِي طَرِيقِ مَكَّةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَازِلٌ أَمَامَنَا وَالْقَوْمُ مُحْرِمُونَ، وَأَنَا غَيْرُ مُحْرِمٍ، فَأَبْصَرُوا حِمَارًا وَحْشِيًّا، وَأَنَا مَشْغُولٌ أَخْصِفُ نَعْلِي، فَلَمْ يُؤْذِنُونِي بِهِ، وَأَحَبُّوا لَوْ أَنِّي أَبْصَرْتُهُ، وَالْتَفَتُّ فَأَبْصَرْتُهُ، فَقُمْتُ إِلَى الْفَرَسِ فَأَسْرَجْتُهُ ثُمَّ رَكِبْتُ وَنَسِيتُ السَّوْطَ وَالرُّمْحَ فَقُلْتُ لَهُمْ نَاوِلُونِي السَّوْطَ وَالرُّمْحَ‏.‏ فَقَالُوا لاَ وَاللَّهِ، لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ‏.‏ فَغَضِبْتُ فَنَزَلْتُ فَأَخَذْتُهُمَا، ثُمَّ رَكِبْتُ، فَشَدَدْتُ عَلَى الْحِمَارِ فَعَقَرْتُهُ، ثُمَّ جِئْتُ بِهِ وَقَدْ مَاتَ، فَوَقَعُوا فِيهِ يَأْكُلُونَهُ، ثُمَّ إِنَّهُمْ شَكُّوا فِي أَكْلِهِمْ إِيَّاهُ، وَهُمْ حُرُمٌ، فَرُحْنَا وَخَبَأْتُ الْعَضُدَ مَعِي، فَأَدْرَكْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏ \"‏ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَنَاوَلْتُهُ الْعَضُدَ فَأَكَلَهَا، حَتَّى نَفَّدَهَا وَهْوَ مُحْرِمٌ‏.‏ فَحَدَّثَنِي بِهِ زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ ‏عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.‏",
        "translations": {
          "en": "Narrated `Abdullah bin Abu Qatada Al-Aslami:That his father said, \"One day I was sitting with some of the Prophet's companions on the way to Mecca. Allah's Messenger (ﷺ) was ahead of us. All of my companions were in the state of Ihram while I was a non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about it but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it and rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me the whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became angry and got down from the horse, picked up both the things and rode the horse again. I attacked the onager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and started eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the state of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Messenger (ﷺ) and asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the affirmative and gave him that fleshy foreleg which he ate completely while he was in the state of Ihram",
          "ur": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا کہ مجھ سے محمد بن جعفر نے بیان کیا ابوحازم سے، وہ عبداللہ بن ابی قتادہ سلمی سے اور ان سے ان کے باپ نے بیان کیا کہ مکہ کے راستے میں ایک جگہ میں رسول اللہ صلی اللہ علیہ وسلم کے چند ساتھیوں کے ساتھ بیٹھا ہوا تھا۔ رسول اللہ صلی اللہ علیہ وسلم ہم سے آگے قیام فرما تھے۔ ( حجۃ الوداع کے موقع پر ) اور لوگ تو احرام باندھے ہوئے تھے لیکن میرا احرام نہیں تھا۔ میرے ساتھیوں نے ایک گورخر دیکھا۔ میں اس وقت اپنی جوتی گانٹھنے میں مشغول تھا۔ ان لوگوں نے مجھ کو کچھ خبر نہیں دی۔ لیکن ان کی خواہش یہی تھی کہ کسی طرح میں گورخر کو دیکھ لوں۔ چنانچہ میں نے جو نظر اٹھائی تو گورخر دکھائی دیا۔ میں فوراً گھوڑے کے پاس گیا اور اس پر زین کس کر سوار ہو گیا، مگر اتفاق سے ( جلدی میں ) کوڑا اور نیزہ دونوں بھول گیا۔ اس لیے میں نے اپنے ساتھیوں سے کہا کہ وہ مجھے کوڑا اور نیزہ اٹھا دیں۔ انہوں نے کہا ہرگز نہیں قسم اللہ کی، ہم تمہارے ( شکار میں ) کسی قسم کی مدد نہیں کر سکتے۔ ( کیونکہ ہم سب لوگ حالت احرام میں ہیں ) مجھے اس پر غصہ آیا اور میں نے خود ہی اتر کر دونوں چیزیں لے لیں۔ پھر سوار ہو کر گورخر پر حملہ کیا اور اس کو شکار کر لایا۔ وہ مر بھی چکا تھا۔ اب لوگوں نے کہا کہ اسے کھانا چاہئے۔ لیکن پھر احرام کی حالت میں اسے کھانے ( کے جواز ) پر شبہ ہوا۔ ( لیکن بعض لوگوں نے شبہ نہیں کیا اور گوشت کھایا ) پھر ہم آگے بڑھے اور میں نے اس گورخر کا ایک بازو چھپا رکھا تھا۔ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے تو اس کے متعلق آپ سے سوال کیا، ( آپ صلی اللہ علیہ وسلم نے محرم کے لیے شکار کے گوشت کھانے کا فتویٰ دیا ) اور دریافت فرمایا کہ اس میں سے کچھ بچا ہوا گوشت تمہارے پاس موجود بھی ہے؟ میں نے کہا کہ جی ہاں! اور وہی بازو آپ صلی اللہ علیہ وسلم کی خدمت میں پیش کیا۔ آپ صلی اللہ علیہ وسلم نے اسے تناول فرمایا۔ یہاں تک کہ وہ ختم ہو گیا۔ آپ صلی اللہ علیہ وسلم بھی اس وقت احرام سے تھے ( ابوحازم نے کہا کہ ) مجھ سے یہی حدیث زید بن اسلم نے بیان کی، ان سے عطاء بن یسار نے اور ان سے ابوقتادہ رضی اللہ عنہ نے۔",
          "fr": "Rapporté par `Abdullah bin Abu Qatada Al-Aslami : Son père a dit : « Un jour, j’étais assis avec certains compagnons du Prophète sur la route de La Mecque. Le Messager d’Allah (ﷺ) était devant nous. Tous mes compagnons étaient en état d’Ihram, sauf moi. Ils ont vu un âne sauvage pendant que je réparais mes sandales, alors ils ne m’en ont pas parlé mais auraient aimé que je le voie. Par hasard, j’ai levé la tête et je l’ai vu. J’ai donc préparé mon cheval, l’ai sellé et suis monté dessus, oubliant de prendre la lance et le fouet. J’ai demandé à mes compagnons de me les passer, mais ils ont dit : “Non, par Allah, nous ne t’aiderons pas pour cela.” Je me suis fâché, je suis descendu du cheval, j’ai pris la lance et le fouet, puis je suis remonté. J’ai attaqué l’âne sauvage, je l’ai abattu et je l’ai ramené. Ils l’ont pris, en ont cuisiné une partie et ont commencé à en manger, mais ils doutaient d’avoir le droit de le faire car ils étaient en état d’Ihram. Nous avons continué notre route, et j’ai caché un de ses avant-bras avec moi. Quand nous avons rencontré le Messager d’Allah (ﷺ) et lui avons demandé à ce sujet, il a demandé : “Avez-vous une part de cette viande avec vous ?” J’ai répondu oui et je lui ai donné l’avant-bras charnu, qu’il a mangé entièrement alors qu’il était en état d’Ihram. »",
          "id": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah] berkata, telah menceritakan kepadaku [Muhammad bin Ja'far] dari [Abu HAzim] dari ['Abdullah bin Abu Qatadah as-Salamiy] dari [bapaknya radliallahu 'anhu] berkata: \"Pada suatu hari aku pernah duduk-duduk bermajelis dengan para sahabat Nabi shallallahu 'alaihi wasallam di suatu rumah yang terletak di jalan menuju Makkah. Saat itu Rasulullah shallallahu 'alaihi wasallam singgah di depan kami sementara orang-orang sedang berihram sedangkan aku tidak. Tiba-tiba mereka melihat seekor keledai liar sementara aku sedang sibuk memperbaiki sandalku dan mereka tidak mau mengganggu aku dengan kehadiran keledai itu padahal mereka sangat ingin agar aku juga melihatnya. Maka sejenak kemudian aku melihat keledai itu lalu aku bangkit menuju kuda dan memasang pelananya kemudian aku menunggang kuda tersebut namun aku lupa cambuk dan tombak. Maka aku katakan kepada mereka: \"Berikan cambuk dan tombak itu kepadaku\". Mereka menjawab: \"Tidak, kami tidak akan membantu kamu dalam mengejar keledai tersebut\". Maka aku marah lalu aku turun dan mengambil cambuk dan tombak tersebut kemudian aku kembali menunggang kuda dan aku kejar keledai tersebut hingga aku dapat melukainya. Kemudian aku datang membawa keledai itu dalam keadaan sudah mati. Akhirnya mereka menerima bahkan memakan dagingnya. Kemudian mereka menjadi ragu dalam memakannya karena mereka sedang berihram. Kemudian kami berangkat dan aku menyembunyikan satu potong paha depan yang ada di tanganku hingga kami bertemu dengan Rasulullah shallallahu 'alaihi wasallam. Maka kami menanyakan kejadian tadi kepada Beliau. Maka Beliau bertanya: \"Apakah masih ada yang tersisa darinya?\". Aku jawab: \"Ya masih\". Maka aku sodorkan paha depan keledai tersebut lalu Beliau memakannya hingga habis sedang Beliau dalam keadaan berihram\". Dan [Zaid bin Aslam] telah menceritakan kepadaku dari ['Atha' bin Yasar] dari [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Abdullah b. Ebu Katade es-Sülemi'den nakledilmiştir: Babası Ebu Katade şöyle anlatmıştır: Bir gün Mekke'ye giderken bir konaklama yerinde Hz. Nebi'in ashabından bir grup ile birlikte oturduk. Allah Resulü Sallallahu Aleyhi ve Sellem bizim biraz ilerimizde konaklamıştı. Orada bulunan herkes ihramlı idi, ben ise değildim. Bu sırada yabani bir eşek (zebra) gördüler. Ben ayakkabımı onarmakla meşguldüm. Bana yabani eşek gördüklerini sezdirmediler ama görmemi arzulamışlardı. O tarafa doğru yöneldim ve zebrayı gördüm. Hemen atıma koşup onu eyerleyip sırtına atladım, kırbacımı ve mızrağımı yerde unutmuştum. \"Bana kırbacımı ve mızrağımı uzatsanız\" dedim. \"Hayır, sana kesinlikle yardım edemeyiz\" dediler. (Zira ihramlıydılar) Öfkelendim, inip kendim aldım ve tekrar bindim. Sonra zebranın üzerine yürüdüm ve onu avladım. Alıp getirdiğimde ölmüştü. Hemen yemeye üşüştüler. Sonra ihramlı iken bunu yiyip yiyemeyecekleri konusunda kuşkulandılar. Hz. Nebi'e yöneldik. Ben avımm bir budunu yanıma alıp saklamıştım. Hz. Nebi'e yolda yetiştik ve bunun hükmünü sorduk. Hz. Nebi (Sallallahu aleyhi ve Sellem): \"Yanınızda ondan hiçbir şey kaldı mı?\" diye sordu. Ben de elimdeki budu kendisine uzattım. İhramlı iken onu yiyip bitirdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 5
      },
      "narrator": {
        "en": "`Abdullah bin Abu Qatada Al-Aslami"
      }
    },
    {
      "hadithNumber": 2571,
      "arabicNumber": 2571,
      "book": 51,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنِي أَبُو طَوَالَةَ ـ اسْمُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ ـ قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي دَارِنَا هَذِهِ، فَاسْتَسْقَى، فَحَلَبْنَا لَهُ شَاةً لَنَا، ثُمَّ شُبْتُهُ مِنْ مَاءِ بِئْرِنَا هَذِهِ، فَأَعْطَيْتُهُ وَأَبُو بَكْرٍ عَنْ يَسَارِهِ، وَعُمَرُ تُجَاهَهُ وَأَعْرَابِيٌّ عَنْ يَمِينِهِ فَلَمَّا فَرَغَ قَالَ عُمَرُ هَذَا أَبُو بَكْرٍ‏.‏ فَأَعْطَى الأَعْرَابِيَّ، ثُمَّ قَالَ ‏ \"‏ الأَيْمَنُونَ، الأَيْمَنُونَ، أَلاَ فَيَمِّنُوا ‏\"‏‏.‏ قَالَ أَنَسٌ فَهْىَ سُنَّةٌ فَهْىَ سُنَّةٌ‏.‏ ثَلاَثَ مَرَّاتٍ‏.‏",
        "translations": {
          "en": "Narrated Anas:Once Allah's Messenger (ﷺ) visited us in this house of ours and asked for something to drink. We milked one of our sheep and mixed it with water from this well of ours and gave it to him. Abu Bakr was sitting on his left side and `Umar in front of him and a bedouin on his right side. When Allah's Messenger (ﷺ) finished, `Umar said to Allah's Messenger (ﷺ) \"Here is Abu Bakr.\" But Allah's Messenger (ﷺ) gave the remaining milk to the bedouin and said twice, \"The (persons on the) right side! So, start from the right side.\" Anas added, \"It is a Sunna (the Prophet's traditions)\" and repeated it thrice",
          "ur": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے، کہا کہ مجھ سے ابوطوالہ نے جن کا نام عبداللہ بن عبدالرحمٰن تھا کہ میں نے انس رضی اللہ عنہ سے سنا، وہ کہتے تھے کہ ( ایک مرتبہ ) رسول اللہ صلی اللہ علیہ وسلم ہمارے اسی گھر میں تشریف لائے اور پانی طلب فرمایا۔ ہمارے پاس ایک بکری تھی، اسے ہم نے دوہا۔ پھر میں نے اسی کنویں کا پانی ملا کر آپ صلی اللہ علیہ وسلم کی خدمت میں ( لسی بنا کر ) پیش کیا، ابوبکر رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی بائیں طرف بیٹھے ہوئے تھے اور عمر رضی اللہ عنہ سامنے تھے اور ایک دیہاتی آپ صلی اللہ علیہ وسلم کے دائیں طرف تھا۔ جب آپ صلی اللہ علیہ وسلم پی کر فارغ ہوئے تو ( پیالے میں کچھ دودھ بچ گیا تھا اس لیے ) عمر رضی اللہ عنہ نے عرض کیا کہ یہ ابوبکر رضی اللہ عنہ ہیں۔ لیکن آپ صلی اللہ علیہ وسلم نے اسے دیہاتی کو عطا فرمایا۔ ( کیونکہ وہ دائیں طرف تھا ) پھر آپ صلی اللہ علیہ وسلم نے فرمایا، دائیں طرف بیٹھنے والے، دائیں طرف بیٹھنے والے ہی حق رکھتے ہیں۔ پس خبردار دائیں طرف ہی سے شروع کیا کرو۔ انس رضی اللہ عنہ نے کہا کہ یہی سنت ہے، یہی سنت ہے، تین مرتبہ ( آپ نے اس بات کو دہرایا ) ۔",
          "fr": "Rapporté par Anas : Un jour, le Messager d’Allah (ﷺ) nous a rendu visite chez nous et a demandé à boire. Nous avons trait une de nos brebis, mélangé le lait avec de l’eau de notre puits, puis nous le lui avons donné. Abou Bakr était assis à sa gauche, `Umar en face de lui et un bédouin à sa droite. Quand le Messager d’Allah (ﷺ) eut fini, `Umar dit au Prophète (ﷺ) : « Voici Abou Bakr. » Mais le Messager d’Allah (ﷺ) donna le reste du lait au bédouin et dit deux fois : « À droite ! Commencez par la droite. » Anas ajouta : « C’est une Sunna (une tradition du Prophète) », et il le répéta trois fois",
          "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepadaku [Sulaiman bin Bilal] berkata, telah menceritakan kepadaku [Abu Thuwailah], yang namana adalah 'Abdullah bin 'Abdurrahman berkata; Aku mendengar [Anas radliallahu 'anhu] berkata: \"Rasulullah shallallahu 'alaihi wasallam datang bertamu di rumah kami ini dan Beliau meminta minum. Maka kami siapkan susu dari hasil perasan kambing kami yang kami campur dengan air dari sumur kami ini lalu kami sugukan kepada Beliau. Saat itu Abu Bakar duduk di samping kiri Beliau sedangkan 'Umar di hadapan Beliau sementara ada seorang 'Arab Baduy di sebelah kanan Beliau. Ketika Beliau sudah selesai minum, 'Umar berkata: \"Ini ada Abu Bakar, (berikanlah kepadanya). Namun Beliau memberikan susu itu kepada orang Baduy tadi karena yang berhak atas gilirannya, seraya beliau sabdakan: \"Ke sebelah kanan dan ke kanan, ketahuilah dahulukanlah yang kanan\". Anas berkata: \"Ini adalah sunnah, ini adalah sunnah\". Diucapkannya tiga kali",
          "tr": "Ebu Tuvale'den -ki asıl adı Abdullah b. Abdurrahman'dır- rivayet edilmiştir: Enes'i şu olayı anlatırken dinlemiştim: Allah Resulü Sallallahu Aleyhi ve Sellem evimize geldi ve su istedi. Bunun üzerine koyunumuzu sağdık. Sonra süt'ü şu kuyunun suyuyla karıştırdım ve kendisine verdim. Solunda Ebu Bekir, karşısında Ömer ve sağında da bir bedevi vardı. Hz. Nebi (Sallallahu aleyhi ve Sellem) içmeyi bitirince Hz. Omer Ebu Bekir'i gösterdi. Fakat Hz. Nebi Sallallahu Aleyhi ve Sellem kalan süt'ü bedeviye verdi. Sonra: \"Sağdaki, sonra onun sağındaki ... Sağdan başlayınız\" buyurdu. Enes bu olayı anlattıktan sonra üç defa \"Bu sünnettir\" demişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 6
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2572,
      "arabicNumber": 2572,
      "book": 51,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ، فَسَعَى الْقَوْمُ فَلَغَبُوا، فَأَدْرَكْتُهَا فَأَخَذْتُهَا، فَأَتَيْتُ بِهَا أَبَا طَلْحَةَ فَذَبَحَهَا، وَبَعَثَ بِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِوَرِكِهَا ـ أَوْ فَخِذَيْهَا قَالَ فَخِذَيْهَا لاَ شَكَّ فِيهِ ـ فَقَبِلَهُ‏.‏ قُلْتُ وَأَكَلَ مِنْهُ قَالَ وَأَكَلَ مِنْهُ‏.‏ ثُمَّ قَالَ بَعْدُ قَبِلَهُ‏.‏",
        "translations": {
          "en": "Narrated Anas:We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered and caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's Apostle. (The narrator confirms that he sent two thighs). The Prophet (ﷺ) accepted that. (The sub-narrator asked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it)",
          "ur": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ہشام بن زید بن انس بن مالک نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ مرالظہران نامی جگہ میں ہم نے ایک خرگوش کا پیچھا کیا۔ لوگ ( اس کے پیچھے ) دوڑے اور اسے تھکا دیا اور میں نے قریب پہنچ کر اسے پکڑ لیا۔ پھر ابوطلحہ رضی اللہ عنہ کے ہاں لایا۔ انہوں نے اسے ذبح کیا اور اس کے پیچھے کا یا دونوں رانوں کا گوشت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھیجا۔ ( شعبہ نے بعد میں یقین کے ساتھ ) کہا کہ دونوں رانیں انہوں نے بھیجی تھیں، اس میں کوئی شک نہیں۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے قبول فرمایا تھا میں نے پوچھا اور اس میں سے آپ صلی اللہ علیہ وسلم نے کچھ تناول بھی فرمایا؟ انہوں نے بیان کیا کہ ہاں! کچھ تناول فرمایا تھا۔ اس کے بعد پھر انہوں نے کہا کہ آپ نے وہ ہدیہ قبول فرما لیا تھا۔",
          "fr": "Rapporté par Anas : Nous avons poursuivi un lapin à Mar-al-Zahran et les gens ont couru après lui mais se sont fatigués. Je l’ai attrapé et l’ai donné à Abou Talha, qui l’a égorgé et a envoyé sa hanche ou ses deux cuisses au Messager d’Allah. (Le narrateur confirme qu’il a envoyé les deux cuisses.) Le Prophète (ﷺ) a accepté ce cadeau. (Le sous-narrateur demanda à Anas : « Le Prophète en a-t-il mangé ? » Anas répondit : « Oui, il en a mangé. »)",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Zaid bin Anas bin Malik] dari [Anas radliallahu 'anhu] berkata: \"Kami pernah disibukkan untuk menangkap kelinci di lembah Marru Azh-Zhohran, orang-orang berusaha menangkapnya hingga mereka keletihan. Kemudian aku bisa menangkapnya lalu aku bawa menghadap Abu Tholhah. Maka dia menyembelihnya kemudian dikirim daging paha depannya atau paha belakangnya kepada Rasulullah shallallahu 'alaihi wasallam. Dia (Anas) berkata: \"Daging pahanya dan tidak diragukan lagi. Lalu Beliau menerimanya\". Aku bertanya: \"Apakah Beliau memakannya?\". Dia berkata: \"Ya Beliau memakannya\". Kemudian dia sambung: \"Setelah menerimanya",
          "tr": "Enes r.a.'den rivayet edilmiştir: Marru'z-Zahran'da bir tavşam ürkütüp kaçırmıştık. Arkadaşlar peşinden koştular ama yoruldular. Ben yetişip yakaladım. Getirip Ebu Talha'ya verdim. O da tavşanın budunu Allah Resulü'ne götürdü ve Hz. Nebi onu kabul etti. Hadisin ravisi Enes'e \"Onu yedi mi?\" diye sormuş ve Enes \"evet, yedi\" diye cevap vermiştir. Not: Bu hadis Av ve Kesilen Hayvanlar bölümünde açıklanacaktır. (1825. hadiste) Diğer tahric: Tirmizî, et’ime; Ebû Dâvûd, Et’ıme; Müslim, Sayd باب: قبول الهدية. 6. HEDİYE'Yİ KABUL ETMEK"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 7
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2573,
      "arabicNumber": 2573,
      "book": 51,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ ـ رضى الله عنهم ـ أَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم حِمَارًا وَحْشِيًّا وَهْوَ بِالأَبْوَاءِ أَوْ بِوَدَّانَ فَرَدَّ عَلَيْهِ، فَلَمَّا رَأَى مَا فِي وَجْهِهِ قَالَ ‏ \"‏ أَمَا إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلاَّ أَنَّا حُرُمٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated As-Sa'b bin Jath-thama:An onager was presented to Allah's Messenger (ﷺ) at the place called Al-Abwa' or Waddan, but Allah's Apostle rejected it. When the Prophet (ﷺ) noticed the signs of sorrow on the giver's face he said, \"We have not rejected your gift, but we are in the state of Ihram.\" (i.e. if we were not in a state of Ihram we would have accepted your gift, Fath-ul-Bari page 130, Vol)",
          "ur": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا ابن شہاب سے، وہ عبیداللہ بن عبداللہ بن عتبہ بن مسعود سے، وہ عبداللہ بن عباس رضی اللہ عنہما سے اور اور وہ صعب بن جثامہ رضی اللہ عنہ سے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں گورخر کا تحفہ پیش کیا تھا۔ آپ صلی اللہ علیہ وسلم اس وقت مقام ابواء یا مقام ودان میں تھے ( راوی کو شبہ ہے ) آپ صلی اللہ علیہ وسلم نے ان کا تحفہ واپس کر دیا۔ پھر ان کے چہرے پر ( رنج کے آثار ) دیکھ کر فرمایا کہ میں نے یہ تحفہ صرف اس لیے واپس کیا ہے کہ ہم احرام باندھے ہوئے ہیں۔",
          "fr": "Rapporté par As-Sa'b bin Jath-thama : Un âne sauvage fut offert au Messager d’Allah (ﷺ) à l’endroit appelé Al-Abwa’ ou Waddan, mais le Prophète le refusa. Quand il vit la tristesse sur le visage de celui qui offrait, il dit : « Nous n’avons pas refusé ton cadeau, mais nous sommes en état d’Ihram. » (C’est-à-dire que s’ils n’avaient pas été en état d’Ihram, ils l’auraient accepté)",
          "id": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud] dari ['Abdullah bin 'Abbas] dari [As Sha'bi bin Jatstsamah] radliallahu 'anhum bahwa dia menghadiahkan Rasulullah shallallahu 'alaihi wasallam seekor keledai liar di Abwa; atau di Waddan namun Beliau menolaknya. Ketika Beliau melihat raut mukanya, Beliau berkata: \"Kami tidak bermaksud menolak keledai tersebut, tapi kami menolaknya karena kami sedang ihram",
          "tr": "Abdullah b. Abbas r.a., Sa'b b. Cessame r.a.'den rivayet etmiştir: Sa'b, Allah Resulüne Sallallahu Aleyhi ve Sellem Ebva'da veya Veddan'da bulunduğu sırada bir yabani eşek (zebra) hediye etmişti. Nebi Sallallahu Aleyhi ve Sellem onun hediyesini geri çevirdi. Sonra bozulduğunu fark edince: \"Hediyeni ihram/ı olduğumuz için geri çevirdik\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 8
      },
      "narrator": {
        "en": "As-Sa'b bin Jath-thama"
      }
    },
    {
      "hadithNumber": 2574,
      "arabicNumber": 2574,
      "book": 51,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّاسَ، كَانُوا يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ، يَبْتَغُونَ بِهَا ـ أَوْ يَبْتَغُونَ بِذَلِكَ ـ مَرْضَاةَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Aisha:The people used to look forward for the days of my (`Aisha's) turn to send gifts to Allah's Messenger (ﷺ) in order to please him",
          "ur": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم سے عبدہ بن سلیمان نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ لوگ ( رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ) تحائف بھیجنے کے لیے عائشہ رضی اللہ عنہا کی باری کا انتظار کیا کرتے تھے۔ اپنے ہدایا سے، یا اس خاص دن کے انتظار سے ( راوی کو شک ہے ) لوگ رسول اللہ صلی اللہ علیہ وسلم کی خوشی حاصل کرنا چاہتے تھے۔",
          "fr": "Rapporté par Aisha رضي الله عنها : Les gens attendaient avec impatience le jour où c’était mon tour pour envoyer des cadeaux au Messager d’Allah (ﷺ) afin de lui faire plaisir",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami ['Abdah] telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari ['Aisyah radliallahu 'anha] bahwa orang-orang memilih barang yang terbaik sebagai hadiah dari mereka untuk hari pernikahan 'Aisyah dengan tujuan mengharap ridha Rasulullah shallallahu 'alaihi wasallam",
          "tr": "Aişe (r.anha)'den rivayet edilmiştir: İnsanlar, Nebi Sallallahu Aleyhi ve Sellem'e hediye vererek O'nun hoşnutluğunu kazanmak için Aişe'nin evinde bulunacağı günü gözlerlerdi. Tekrar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 9
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 2575,
      "arabicNumber": 2575,
      "book": 51,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَعْفَرُ بْنُ إِيَاسٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَهْدَتْ أُمُّ حُفَيْدٍ خَالَةُ ابْنِ عَبَّاسٍ إِلَى النَّبِيِّ صلى الله عليه وسلم أَقِطًا وَسَمْنًا وَأَضُبًّا، فَأَكَلَ النَّبِيُّ صلى الله عليه وسلم مِنَ الأَقِطِ وَالسَّمْنِ، وَتَرَكَ الضَّبَّ تَقَذُّرًا‏.‏ قَالَ ابْنُ عَبَّاسٍ فَأُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Sa`id bin Jubair:Ibn `Abbas said: Um Hufaid, Ibn `Abbas's aunt sent some dried yogurt (butter free), ghee (butter) and a mastigar to the Prophet (ﷺ) as a gift. The Prophet (ﷺ) ate the dried yogurt and butter but left the mastigar because he disliked it. Ibn `Abbas said, \"The mastigar was eaten at the table of Allah's Messenger (ﷺ) and if it had been illegal to eat, it could not have been eaten at the table of Allah's Messenger (ﷺ)",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے جعفر بن ایاس نے بیان کیا، کہا کہ میں نے سعید بن جبیر سے سنا کہ ابن عباس رضی اللہ عنہما نے بیان کیا کہ ان کی خالہ ام حفید رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پنیر، گھی اور گوہ ( ساہنہ ) کے تحائف بھیجے۔ نبی کریم صلی اللہ علیہ وسلم نے پنیر اور گھی میں سے تو تناول فرمایا لیکن گوہ پسند نہ ہونے کی وجہ سے چھوڑ دی۔ ابن عباس رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے ( اسی ) دستر خوان پر گوہ ( ساہنہ ) کو بھی کھایا گیا اور اگر وہ حرام ہوتی تو آپ صلی اللہ علیہ وسلم کے دستر خوان پر کیوں کھائی جاتی۔",
          "fr": "Rapporté par Sa`id bin Jubair : Ibn `Abbas a dit : Ma tante Um Hufaid a envoyé au Prophète (ﷺ) du yaourt séché (sans beurre), du beurre et un mastigar en cadeau. Le Prophète (ﷺ) a mangé le yaourt séché et le beurre mais a laissé le mastigar car il ne l’aimait pas. Ibn `Abbas a dit : « Le mastigar a été mangé à la table du Messager d’Allah (ﷺ) et si cela avait été interdit, il n’aurait pas été mangé à sa table. »",
          "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Ja'far bin Iyas] berkata, aku mendengar [Sa'id bin Jubair] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata: \"Ummu Hufaid, bibi dari Ibnu 'Abbas menghadiahkan kepada Nabi shallallahu 'alaihi wasallam keju, minyak samin dan daging biawak. Maka Nabi shallallahu 'alaihi wasallam memakan keju dan minyak samin tapi membiarkan daging biawak karena tidak menyukainya\". Ibnu 'Abbas berkata: \"Semua itu dihidangkan pada makanan Rasulullah shallallahu 'alaihi wasallam, seandainya diharamkan tentu tidak akan dihidangkan pada makanan Rasulullah shallallahu 'alaihi wasallam",
          "tr": "İbn Abbas r.a.'dan rivayet edilmiştir: İbn Abbas'ın teyzesi Ümmü Hufeyd, Nebi Sallallahu Aleyhi ve Sellem'e keş, tereyağı ve birkaç keler hediye etmişti. Nebi Sallallahu Aleyhi ve Sellem keş'i ve tereyağını yedi; kelerleri ise tiksindiğinden dolayı yemedi. İbn Abbas r.a. dedi ki: \"Kelerler Hz. Nebi'in sofrasında yeniidi. Haram olsaydı Allah Resulü'nün sofrasında yenilmezdi.\" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 10
      },
      "narrator": {
        "en": "Sa`id bin Jubair"
      }
    },
    {
      "hadithNumber": 2576,
      "arabicNumber": 2576,
      "book": 51,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏إِذَا أُتِيَ بِطَعَامٍ سَأَلَ عَنْهُ أَهَدِيَّةٌ أَمْ صَدَقَةٌ فَإِنْ قِيلَ صَدَقَةٌ‏.‏ قَالَ لأَصْحَابِهِ كُلُوا‏.‏ وَلَمْ يَأْكُلْ، وَإِنْ قِيلَ هَدِيَّةٌ‏.‏ ضَرَبَ بِيَدِهِ صلى الله عليه وسلم فَأَكَلَ مَعَهُمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Whenever a meal was brought to Allah's Messenger (ﷺ), he would ask whether it was a gift or Sadaqa (something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, but if it was a gift, he would hurry to share it with them",
          "ur": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا ہم سے معن بن عیسیٰ نے بیان کیا، انہوں نے کہا کہ مجھ سے ابراہیم بن طہمان نے بیان کیا انہوں نے محمد بن زیاد سے اور وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں جب کوئی کھانے کی چیز لائی جاتی تو آپ صلی اللہ علیہ وسلم دریافت فرماتے یہ تحفہ ہے یا صدقہ؟ اگر کہا جاتا کہ صدقہ ہے تو آپ صلی اللہ علیہ وسلم اپنے اصحاب سے فرماتے کہ کھاؤ، آپ صلی اللہ علیہ وسلم خود نہ کھاتے اور اگر کہا جاتا کہ تحفہ ہے تو آپ صلی اللہ علیہ وسلم خود بھی ہاتھ بڑھاتے اور صحابہ کے ساتھ اسے کھاتے۔",
          "fr": "Rapporté par Abu Huraira : Chaque fois qu’on apportait un repas au Messager d’Allah (ﷺ), il demandait si c’était un cadeau ou une aumône (Sadaqa). Si on lui disait que c’était une aumône, il disait à ses compagnons de la manger, mais si c’était un cadeau, il se dépêchait de le partager avec eux",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] telah menceritakan kepada kami [Ma'an] berkata, telah menceritakan kepadaku [Ibrahim bin Thohman] dari [Muhammad bin Ziyad] dari [Abu Hurairah radliallahu 'anhu] berkata: \"Adalah Rasulullah shallallahu 'alaihi wasallam apabila diberikan makanan, Beliau bertanya tentangnya, apakah ini sebagai hadiah atau shadaqah?\". Jika dijawab shadaqah maka Beliau berkata kepada para sahabat Beliau; \"Makanlah\". Dan Beliau tidak ikut makan\". Namun bila dikatakan hadiah, maka Beliau mengulurkan tangan Beliau lalu makan bersama mereka",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi (Sallallahu aleyhi ve Sellem)'e bir yiyecek getirildiğinde bunun hediye mi, yoksa sadaka mı olduğunu sorardı. Sadaka olduğu söylenirse ashabına \"yiyin\" derdi, ama kendisi yemezdi. Hediye olduğu söylenirse eliyle yemeğe buyur eder ve kendisi de onlarla birlikte yerdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 11
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2577,
      "arabicNumber": 2577,
      "book": 51,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِلَحْمٍ فَقِيلَ تُصُدِّقَ عَلَى بَرِيرَةَ قَالَ ‏ \"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:Some meat was brought to the Prophet (ﷺ) and it was said that the meat had been given in charity to Barirah. He said, \"It was Sadaqa for Barirah but a gift for us",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک مرتبہ گوشت پیش کیا گیا اور یہ بتایا گیا کہ یہ بریرہ رضی اللہ عنہا کو کسی نے بطور صدقہ کے دیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ان کے لیے یہ صدقہ ہے اور ہمارے لیے ( جب ان کے یہاں سے پہنچا تو ) ہدیہ ہے۔“",
          "fr": "Rapporté par Anas bin Malik : On a apporté de la viande au Prophète (ﷺ) et on lui a dit que cette viande avait été donnée en aumône à Barirah. Il a dit : « C’était une Sadaqa pour Barirah, mais un cadeau pour nous. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas bin Malik radliallahu 'anhu] berkata: \"Nabi shallallahu 'alaihi wasallam pernah diberikan daging lalu dikatakan bahwa daging itu adalah shadaqah yang diterima Barirah. Maka Beliau berkata: \"Daging ini baginya shadaqah (zakat) dan bagi kita ini sebagai hadiah",
          "tr": "Enes r.a.'den rivayet edilmiştir: Hz. Nebi'e et getirilmiş ve \"Bu Berire'ye sadaka olarak verildi\" denilmişti. Nebi Sallallahu Aleyhi ve Sellem: \"Bu, ona sadaka; bize ise hediyedir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 12
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 2578,
      "arabicNumber": 2578,
      "book": 51,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، قَالَ سَمِعْتُهُ مِنْهُ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ، وَأَنَّهُمُ اشْتَرَطُوا وَلاَءَهَا، فَذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا فَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُهْدِيَ لَهَا لَحْمٌ، فَقِيلَ لِلنَّبِيِّ صلى الله عليه وسلم هَذَا تُصُدِّقَ عَلَى بَرِيرَةَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏ وَخُيِّرَتْ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ زَوْجُهَا حُرٌّ أَوْ عَبْدٌ قَالَ شُعْبَةُ سَأَلْتُ عَبْدَ الرَّحْمَنِ عَنْ زَوْجِهَا‏.‏ قَالَ لاَ أَدْرِي أَحُرٌّ أَمْ عَبْدٌ",
        "translations": {
          "en": "Narrated `Aisha:I intended to buy Barirah but her masters stipulated that her Wala should be for them. When the Prophet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" Once Barirah was given some meat, and the Prophet (ﷺ) asked, \"What is this?\" I said, \"It has been given to Barirah in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Barirah was given the option (to stay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her husband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether her husband was a slave or a free man. He replied that he did not know whether he was a slave or a free man",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا عبدالرحمٰن بن قاسم سے، شعبہ نے کہا کہ میں نے یہ حدیث عبدالرحمٰن سے سنی تھی اور انہوں نے قاسم سے روایت کی، انہوں نے عائشہ رضی اللہ عنہا سے کہ انہوں نے بریرہ رضی اللہ عنہا کو ( آزاد کرنے کے لیے ) خریدنا چاہا۔ لیکن ان کے مالکوں نے ولاء کی شرط اپنے لیے لگائی۔ جب اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا، تو انہیں خرید کر آزاد کر دے، ولاء تو اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے۔ اور بریرہ رضی اللہ عنہا کے یہاں ( صدقہ کا ) گوشت آیا تھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اچھا یہ وہی ہے جو بریرہ کو صدقہ میں ملا ہے۔ یہ ان کے لیے تو صدقہ ہے لیکن ہمارے لیے ( چونکہ ان کے گھر سے بطور ہدیہ ملا ہے ) ہدیہ ہے اور ( آزادی کے بعد بریرہ کو ) اختیار دیا گیا تھا ( کہ اگر چاہیں تو اپنے نکاح کو فسخ کر سکتی ہیں ) عبدالرحمٰن نے پوچھا بریرہ رضی اللہ عنہ کے خاوند ( مغیث رضی اللہ عنہ ) غلام تھے یا آزاد؟ شعبہ نے بیان کیا کہ میں نے عبدالرحمٰن سے ان کے خاوند کے متعلق پوچھا تو انہوں نے کہا کہ مجھے معلوم نہیں وہ غلام تھے یا آزاد۔",
          "fr": "Rapporté par `Aisha رضي الله عنها : Je voulais acheter Barirah mais ses maîtres ont exigé que son Wala leur revienne. Quand le Prophète en a été informé, il m’a dit : « Achète-la et libère-la, car le Wala’ revient à celui qui libère. » Un jour, Barirah a reçu de la viande, et le Prophète (ﷺ) a demandé : « Qu’est-ce que c’est ? » J’ai répondu : « C’est une aumône donnée à Barirah. » Il a dit : « C’est une Sadaqa pour elle, mais un cadeau pour nous. » Barirah a eu le choix (de rester avec son mari ou de le quitter). `Abdur-Rahman (un sous-narrateur) s’est demandé : « Son mari était-il esclave ou homme libre ? » Shu`ba (un autre sous-narrateur) a dit : « J’ai demandé à `Abdur-Rahman si son mari était esclave ou libre. Il a répondu qu’il ne savait pas. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari ['Abdur Rahman bin Al Qasim] berkata, aku mendengar cerita ini dari [Al Qasim] dari ['Aisyah radliallahu 'anha] bahwa dia berkehendak untuk membeli Barirah sementara mereka (tuannya) memberi persyaratan bahwa wala' tetap ada pada mereka. Kemudian hal diceritakan kepada Nabi shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam berkata: \"Belilah kemudian bebaskanlah, karena hak perwalian bagi orang yang membebaskannya\". Kemudian Barirah diberi zakat berupa daging lalu dikatakan kepada Nabi shallallahu 'alaihi wasallam: 'Ini shadaqah yang diterima Barirah\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Daging ini baginya shadaqah (zakat) dan bagi kita ini sebagai hadiah\". Maka Barirah memilih untuk dirinya. 'AbdurRahman berkata: \"Suaminya orang merdeka atau budak sahaya?\" Syu'bah berkata: \"Aku bertanya kepada 'Abdurrahman tentang suaminya, maka dia menjawab: \"Aku tidak tahu apakah suaminya orang merdeka atau budak sahaya",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: Aişe, Berire'yi satın almak istemişti. Ama sahipleri vela hakkının kendilerinde kalmasını şart koştular. Durum Hz. Nebi'e iletiidi. Bunun üzerine: \"Sen satın a/ ve azat et. Vefa hakkı azat edene aittir\" buyurdu. Sonra Hz. Nebi'e et getirildi ve: \"Bu, Berire'ye sadaka olarak verildi\" denildi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Bu, Berire'ye sadaka; bize ise hediyedir\" buyurdu. Sonra Berire evliliğe devam etmek ve sona erdirmek konusunda muhayyer bırakıldı. Abdurrahman \"Kocası hür müydü, yoksa köle mi?\" dedi. Şu'be diyor ki: Abdurrahman'a kocasının medeni durumunu sormuştum. \"Hür müydü, kölemi, bilmiyorum\" dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 13
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 2579,
      "arabicNumber": 2579,
      "book": 51,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَقَالَ ‏\"‏ عِنْدَكُمْ شَىْءٌ ‏\"‏‏.‏ قَالَتْ لاَ، إِلاَّ شَىْءٌ بَعَثَتْ بِهِ أُمُّ عَطِيَّةَ مِنَ الشَّاةِ الَّتِي بُعِثَ إِلَيْهَا مِنَ الصَّدَقَةِ‏.‏ قَالَ ‏\"‏ إِنَّهَا قَدْ بَلَغَتْ مَحِلَّهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Um 'Atiyya:Once the Prophet (ﷺ) went to `Aisha and asked her whether she had something (to eat). She said that she had nothing except the mutton which Um 'Atiyya had sent to (Barirah) in charity. The Prophet (ﷺ) said that it had reached its destination (i.e. it is no longer an object of charity)",
          "ur": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا، انہوں نے کہا ہم کو خالد بن عبداللہ نے خبر دی، انہیں خالد حذاء نے حفصہ بنت سیرین سے کہ ام عطیہ رضی اللہ عنہا نے کہا کہ نبی کریم صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے یہاں تشریف لے گئے اور دریافت فرمایا، کیا کوئی چیز ( کھانے کی ) تمہارے پاس ہے؟ انہوں نے کہا کہ ام عطیہ رضی اللہ عنہا کے یہاں جو آپ نے صدقہ کی بکری بھیجی تھی، اس کا گوشت انہوں نے بھیجا ہے۔ اس کے سوا اور کچھ نہیں ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ اپنی جگہ پہنچ چکی۔",
          "fr": "Rapporté par Um 'Atiyya : Un jour, le Prophète (ﷺ) est allé chez `Aisha et lui a demandé si elle avait quelque chose à manger. Elle a répondu qu’elle n’avait rien, sauf du mouton qu’Um 'Atiyya avait envoyé (à Barirah) en aumône. Le Prophète (ﷺ) a dit que cela avait atteint sa destination (c’est-à-dire que ce n’est plus une aumône)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil Abu Al Hasan] telah mengabarkan kepada kami [Khalid bin 'Abdullah] dari [Khalid Al Hadzdza'] dari [Hafshah binti Sirin] dari [Ummu 'Athiyyah] berkata: \"Nabi shallallahu 'alaihi wasallam datang menemui 'Aisyah radliallahu 'anha seraya berkata: \"Apakah kalian masih memilliki sesuatu (untuk dimakan)?\". 'Aisyah berkata: \"Tidak, kecuali sesuatu yang dikirim oleh Ummu 'Athiyyah dari daging kambing yang engkau kirim kepadanya sebagai shadaqah\". Beliau bersabda: \"Shadaqah itu berarti sudah sampai pada tempatnya",
          "tr": "Ümmü Atiyye r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Aişe'nin odasına girerek: \"Yanınızda (yiyecek) bir şey var mı?\" diye sordu. Aişe r.anha: \"Hayır, Ümmü Atiyye'ye sadakadan gönderdiğin ve onun da bize getirdiği koyundan başka bir şey yok\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"O sadaka yerini buldu\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 14
      },
      "narrator": {
        "en": "Um 'Atiyya"
      }
    },
    {
      "hadithNumber": 2580,
      "arabicNumber": 2580,
      "book": 51,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمُ يَوْمِي‏.‏ وَقَالَتْ أُمُّ سَلَمَةَ إِنَّ صَوَاحِبِي اجْتَمَعْنَ‏.‏ فَذَكَرَتْ لَهُ، فَأَعْرَضَ عَنْهَا‏.‏",
        "translations": {
          "en": "Narrated `Aisha:The people used to send gifts to the Prophet (ﷺ) on the day of my turn. Um Salama said: \"My companions (the wives of the Prophet (ﷺ) Other than Aisha) gathered and they complained about it. So I informed the Prophet about it on their behalf, but he remained silent",
          "ur": "ہم سے سلیمان بن حرب نے بیان کیا، کہا کہ ہم سے حماد بن زید نے بیان کیا ہشام سے، ان سے ان کے والد نے، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ لوگ تحائف بھیجنے کے لیے میری باری کا انتظار کیا کرتے تھے۔ اور ام سلمہ رضی اللہ عنہا نے کہا میری سوکنیں ( امہات المؤمنین رضوان اللہ علیہن ) جمع تھیں اس وقت انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ( بطور شکایت لوگوں کی اس روش کا ) ذکر کیا۔ تو آپ صلی اللہ علیہ وسلم نے انہیں کوئی جواب نہیں دیا۔",
          "fr": "Rapporté par `Aisha رضي الله عنها : Les gens avaient l’habitude d’envoyer des cadeaux au Prophète (ﷺ) le jour où c’était mon tour. Um Salama a dit : « Mes compagnes (les autres épouses du Prophète ﷺ, sauf Aisha) se sont réunies et s’en sont plaintes. Je l’ai donc dit au Prophète de leur part, mais il est resté silencieux. »",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah radliallahu 'anha] berkata: \"Orang-orang memilih barang yang terbaik sebagai hadiah dari mereka untuk hari pernikahanku\". Dan Ummu Salamah berkata: \"Kemudian para shahaabiyah (isteri-isteri Beliau) berkumpul lalu dia ingin menceritakan hal itu kepada Beliau, namun Beliau menolaknya",
          "tr": "Aişe (r.anha)'dan rivayet edilmiştir: İnsanlar Nebi (Sallallahu aleyhi ve Sellem)'e hediye vermek için benim günümü kollarlardı. Ümmü Seleme r.anha şöyle demiştir: \"Nebi Sallallahu aleyhi ve Sellem'in diğer hanımları ile bir araya geldik. (Bana \"Hz. Nebi'e haber versen de insanlara söylese: Hediye vermek için özel bir zaman seçmeseler\" dedileL) Ben de onların bu isteklerini Nebi Sallallahu aleyhi ve Sellem'e ilettim. Ama hiç aldırış etmedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 15
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 2581,
      "arabicNumber": 2581,
      "book": 51,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ نِسَاءَ، رَسُولِ اللَّهِ صلى الله عليه وسلم كُنَّ حِزْبَيْنِ فَحِزْبٌ فِيهِ عَائِشَةُ وَحَفْصَةُ وَصَفِيَّةُ وَسَوْدَةُ، وَالْحِزْبُ الآخَرُ أُمُّ سَلَمَةَ وَسَائِرُ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَكَانَ الْمُسْلِمُونَ قَدْ عَلِمُوا حُبَّ رَسُولِ اللَّهِ صلى الله عليه وسلم عَائِشَةَ، فَإِذَا كَانَتْ عِنْدَ أَحَدِهِمْ هَدِيَّةٌ يُرِيدُ أَنْ يُهْدِيَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَخَّرَهَا، حَتَّى إِذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِ عَائِشَةَ بَعَثَ صَاحِبُ الْهَدِيَّةِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَيْتِ عَائِشَةَ، فَكَلَّمَ حِزْبُ أُمِّ سَلَمَةَ، فَقُلْنَ لَهَا كَلِّمِي رَسُولَ اللَّهِ صلى الله عليه وسلم يُكَلِّمُ النَّاسَ، فَيَقُولُ مَنْ أَرَادَ أَنْ يُهْدِيَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هَدِيَّةً فَلْيُهْدِهِ إِلَيْهِ حَيْثُ كَانَ مِنْ بُيُوتِ نِسَائِهِ، فَكَلَّمَتْهُ أُمُّ سَلَمَةَ بِمَا قُلْنَ، فَلَمْ يَقُلْ لَهَا شَيْئًا، فَسَأَلْنَهَا‏.‏ فَقَالَتْ مَا قَالَ لِي شَيْئًا‏.‏ فَقُلْنَ لَهَا فَكَلِّمِيهِ‏.‏ قَالَتْ فَكَلَّمَتْهُ حِينَ دَارَ إِلَيْهَا أَيْضًا، فَلَمْ يَقُلْ لَهَا شَيْئًا، فَسَأَلْنَهَا‏.‏ فَقَالَتْ مَا قَالَ لِي شَيْئًا‏.‏ فَقُلْنَ لَهَا كَلِّمِيهِ حَتَّى يُكَلِّمَكِ‏.‏ فَدَارَ إِلَيْهَا فَكَلَّمَتْهُ‏.‏ فَقَالَ لَهَا ‏\"‏ لاَ تُؤْذِينِي فِي عَائِشَةَ، فَإِنَّ الْوَحْىَ لَمْ يَأْتِنِي، وَأَنَا فِي ثَوْبِ امْرَأَةٍ إِلاَّ عَائِشَةَ ‏\"‏‏.‏ قَالَتْ فَقَالَتْ أَتُوبُ إِلَى اللَّهِ مِنْ أَذَاكَ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ إِنَّهُنَّ دَعَوْنَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَرْسَلْنَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم تَقُولُ إِنَّ نِسَاءَكَ يَنْشُدْنَكَ اللَّهَ الْعَدْلَ فِي بِنْتِ أَبِي بَكْرٍ‏.‏ فَكَلَّمَتْهُ‏.‏ فَقَالَ ‏\"‏ يَا بُنَيَّةُ، أَلاَ تُحِبِّينَ مَا أُحِبُّ ‏\"‏‏.‏ قَالَتْ بَلَى‏.‏ فَرَجَعَتْ إِلَيْهِنَّ، فَأَخْبَرَتْهُنَّ‏.‏ فَقُلْنَ ارْجِعِي إِلَيْهِ‏.‏ فَأَبَتْ أَنْ تَرْجِعَ، فَأَرْسَلْنَ زَيْنَبَ بِنْتَ جَحْشٍ، فَأَتَتْهُ فَأَغْلَظَتْ، وَقَالَتْ إِنَّ نِسَاءَكَ يَنْشُدْنَكَ اللَّهَ الْعَدْلَ فِي بِنْتِ ابْنِ أَبِي قُحَافَةَ‏.‏ فَرَفَعَتْ صَوْتَهَا، حَتَّى تَنَاوَلَتْ عَائِشَةَ‏.‏ وَهْىَ قَاعِدَةٌ، فَسَبَّتْهَا حَتَّى إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَيَنْظُرُ إِلَى عَائِشَةَ هَلْ تَكَلَّمُ قَالَ فَتَكَلَّمَتْ عَائِشَةُ تَرُدُّ عَلَى زَيْنَبَ، حَتَّى أَسْكَتَتْهَا‏.‏ قَالَتْ فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَى عَائِشَةَ، وَقَالَ ‏\"‏ إِنَّهَا بِنْتُ أَبِي بَكْرٍ ‏\"‏‏.‏ قَالَ الْبُخَارِيُّ الْكَلاَمُ الأَخِيرُ قِصَّةُ فَاطِمَةَ يُذْكَرُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ رَجُلٍ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ‏.‏ وَقَالَ أَبُو مَرْوَانَ عَنْ هِشَامٍ عَنْ عُرْوَةَ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ‏.‏ وَعَنْ هِشَامٍ عَنْ رَجُلٍ مِنْ قُرَيْشٍ، وَرَجُلٍ مِنَ الْمَوَالِي، عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ قَالَتْ عَائِشَةُ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَاسْتَأْذَنَتْ فَاطِمَةُ‏.‏",
        "translations": {
          "en": "Narrated `Urwa from `Aisha:The wives of Allah's Messenger (ﷺ) were in two groups. One group consisted of `Aisha, Hafsa, Safiyya and Sauda; and the other group consisted of Um Salama and the other wives of Allah's Messenger (ﷺ). The Muslims knew that Allah's Messenger (ﷺ) loved `Aisha, so if any of them had a gift and wished to give to Allah's Messenger (ﷺ), he would delay it, till Allah's Messenger (ﷺ) had come to `Aisha's home and then he would send his gift to Allah's Messenger (ﷺ) in her home. The group of Um Salama discussed the matter together and decided that Um Salama should request Allah's Messenger (ﷺ) to tell the people to send their gifts to him in whatever wife's house he was. Um Salama told Allah's Messenger (ﷺ) of what they had said, but he did not reply. Then they (those wives) asked Um Salama about it. She said, \"He did not say anything to me.\" They asked her to talk to him again. She talked to him again when she met him on her day, but he gave no reply. When they asked her, she replied that he had given no reply. They said to her, \"Talk to him till he gives you a reply.\" When it was her turn, she talked to him again. He then said to her, \"Do not hurt me regarding Aisha, as the Divine Inspirations do not come to me on any of the beds except that of Aisha.\" On that Um Salama said, \"I repent to Allah for hurting you.\" Then the group of Um Salama called Fatima, the daughter of Allah's Messenger (ﷺ) and sent her to Allah's Messenger (ﷺ) to say to him, \"Your wives request to treat them and the daughter of Abu Bakr on equal terms.\" Then Fatima conveyed the message to him. The Prophet (ﷺ) said, \"O my daughter! Don't you love whom I love?\" She replied in the affirmative and returned and told them of the situation. They requested her to go to him again but she refused. They then sent Zainab bint Jahsh who went to him and used harsh words saying, \"Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal terms.\" On that she raised her voice and abused `Aisha to her face so much so that Allah's Messenger (ﷺ) looked at `Aisha to see whether she would retort. `Aisha started replying to Zainab till she silenced her. The Prophet (ﷺ) then looked at `Aisha and said, \"She is really the daughter of Abu Bakr",
          "ur": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے میرے بھائی عبدالحمید بن ابی اویس نے، ان سے سلیمان نے ہشام بن عروہ سے، ان سے ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم کی ازواج دو گروہ میں تھیں۔ ایک میں عائشہ، حفصہ، صفیہ اور سودہ رضوان اللہ علیہن اور دوسری میں ام سلمہ اور بقیہ تمام ازواج مطہرات رضوان اللہ علیہن تھیں۔ مسلمانوں کو رسول اللہ صلی اللہ علیہ وسلم کی عائشہ رضی اللہ عنہا کے ساتھ محبت کا علم تھا اس لیے جب کسی کے پاس کوئی تحفہ ہوتا اور وہ اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پیش کرنا چاہتا تو انتظار کرتا۔ جب رسول اللہ صلی اللہ علیہ وسلم کی عائشہ رضی اللہ عنہا کے گھر کی باری ہوتی تو تحفہ دینے والے صاحب اپنا تحفہ آپ صلی اللہ علیہ وسلم کی خدمت میں بھیجتے۔ اس پر ام سلمہ رضی اللہ عنہا کی جماعت کی ازواج مطہرات نے آپس میں مشورہ کیا اور ام سلمہ رضی اللہ عنہا سے کہا کہ وہ رسول اللہ صلی اللہ علیہ وسلم سے بات کریں تاکہ آپ صلی اللہ علیہ وسلم لوگوں سے فرما دیں کہ جسے آپ کے یہاں تحفہ بھیجنا ہو وہ جہاں بھی آپ صلی اللہ علیہ وسلم ہوں وہیں بھیجا کرے۔ چنانچہ ان ازواج کے مشورہ کے مطابق انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا لیکن آپ صلی اللہ علیہ وسلم نے انہیں کوئی جواب نہیں دیا۔ پھر ان خواتین نے پوچھا تو انہوں نے بتا دیا کہ مجھے آپ صلی اللہ علیہ وسلم نے کوئی جواب نہیں دیا۔ ازواج مطہرات نے کہا کہ پھر ایک مرتبہ کہو۔ انہوں نے بیان کیا پھر جب آپ کی باری آئی تو دوبارہ انہوں نے آپ صلی اللہ علیہ وسلم سے عرض کیا۔ اس مرتبہ بھی آپ صلی اللہ علیہ وسلم نے مجھے اس کا کوئی جواب ہی نہیں دیا۔ ازواج نے اس مرتبہ ان سے کہا کہ آپ صلی اللہ علیہ وسلم کو اس مسئلہ پر بلواؤ تو سہی۔ جب ان کی باری آئی تو انہوں نے پھر کہا۔ آپ صلی اللہ علیہ وسلم نے اس مرتبہ فرمایا۔ عائشہ کے بارے میں مجھے تکلیف نہ دو۔ عائشہ کے سوا اپنی بیویوں میں سے کسی کے کپڑے میں بھی مجھ پر وحی نازل نہیں ہوتی ہے۔ عائشہ رضی اللہ عنہا نے کہا کہ آپ صلی اللہ علیہ وسلم کے اس ارشاد پر انہوں نے عرض کیا، آپ کو ایذا پہنچانے کی وجہ سے میں اللہ کے حضور میں توبہ کرتی ہوں۔ پھر ان ازواج مطہرات نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی فاطمہ رضی اللہ عنہا کو بلایا اور ان کے ذریعہ آپ صلی اللہ علیہ وسلم کی خدمت میں یہ کہلوایا کہ آپ کی ازواج ابوبکر رضی اللہ عنہ کی بیٹی کے بارے میں اللہ کے لیے آپ سے انصاف چاہتی ہیں۔ چنانچہ انہوں نے بھی آپ صلی اللہ علیہ وسلم سے بات چیت کی۔ آپ صلی اللہ علیہ وسلم نے فرمایا، میری بیٹی! کیا تم وہ پسند نہیں کرتی جو میں پسند کروں؟ انہوں نے جواب دیا کہ کیوں نہیں، اس کے بعد وہ واپس آ گئیں اور ازواج کو اطلاع دی۔ انہوں نے ان سے پھر دوبارہ خدمت نبوی میں جانے کے لیے کہا۔ لیکن آپ نے دوبارہ جانے سے انکار کیا تو انہوں نے زینب بنت جحش رضی اللہ عنہا کو بھیجا۔ وہ خدمت نبوی میں حاضر ہوئیں تو انہوں نے سخت گفتگو کی اور کہا کہ آپ کی ازواج ابوقحافہ کی بیٹی کے بارے میں آپ سے اللہ کے لیے انصاف مانگتی ہیں اور ان کی آواز اونچی ہو گئی۔ عائشہ رضی اللہ عنہا وہیں بیٹھی ہوئی تھیں۔ انہوں نے ( ان کے منہ پر ) انہیں بھی برا بھلا کہا۔ رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کی طرف دیکھنے لگے کہ وہ کچھ بولتی ہیں یا نہیں۔ راوی نے بیان کیا کہ عائشہ رضی اللہ عنہا بھی بول پڑیں اور زینب رضی اللہ عنہا کی باتوں کا جواب دینے لگیں اور آخر انہیں خاموش کر دیا۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا کی طرف دیکھ کر فرمایا کہ یہ ابوبکر کی بیٹی ہے۔ امام بخاری رحمہ اللہ نے کہا کہ آخر کلام فاطمہ رضی اللہ عنہا کے واقعہ سے متعلق ہشام بن عروہ نے ایک اور شخص سے بیان کیا ہے۔ انہوں نے زہری سے روایت کی اور انہوں نے محمد بن عبدالرحمٰن سے اور ابومروان نے بیان کیا کہ ہشام سے اور انہوں نے عروہ سے کہ لوگ تحائف بھیجنے کے لیے عائشہ رضی اللہ عنہا کی باری کا انتظار کیا کرتے تھے اور ہشام کی ایک روایت قریش کے ایک صاحب اور ایک دوسرے صاحب سے جو غلاموں میں سے تھے، بھی ہے۔ وہ زہری سے نقل کرتے ہیں اور وہ محمد بن عبدالرحمٰن بن حارث بن ہشام سے کہ عائشہ رضی اللہ عنہا نے کہا جب فاطمہ رضی اللہ عنہا نے ( اندر آنے کی ) اجازت چاہی تو میں اس وقت آپ صلی اللہ علیہ وسلم ہی کی خدمت میں موجود تھی۔",
          "fr": "Rapporté par `Urwa d’après `Aisha رضي الله عنها : Les femmes du Messager d’Allah (ﷺ) étaient en deux groupes. Un groupe comprenait `Aisha, Hafsa, Safiyya et Sauda ; l’autre groupe comprenait Um Salama et les autres épouses du Prophète (ﷺ). Les musulmans savaient que le Messager d’Allah (ﷺ) aimait `Aisha, donc s’ils avaient un cadeau à offrir, ils attendaient qu’il soit chez `Aisha pour le lui envoyer. Le groupe d’Um Salama en a discuté et a décidé qu’Um Salama demanderait au Prophète de dire aux gens d’envoyer leurs cadeaux chez l’épouse où il se trouvait. Um Salama en a parlé au Prophète (ﷺ), mais il n’a pas répondu. Elles lui ont demandé ce qu’il avait dit, elle a répondu qu’il n’avait rien dit. Elles lui ont demandé d’insister. Elle lui a reparlé lors de son tour, mais il n’a pas répondu. Elles lui ont encore demandé, elle a dit qu’il n’avait rien dit. Elles lui ont dit : « Parle-lui jusqu’à ce qu’il te réponde. » Lors de son tour, elle lui a reparlé. Il lui a alors dit : « Ne me fais pas de peine au sujet de `Aisha, car la Révélation ne me vient que dans la maison de `Aisha. » Um Salama a alors dit : « Je demande pardon à Allah de t’avoir peiné. » Ensuite, le groupe d’Um Salama a appelé Fatima, la fille du Prophète (ﷺ), et l’a envoyée lui dire : « Tes épouses te demandent de les traiter, elles et la fille d’Abou Bakr, de la même façon. » Fatima a transmis le message. Le Prophète (ﷺ) a dit : « Ma fille, n’aimes-tu pas celle que j’aime ? » Elle a répondu oui, puis est repartie leur raconter. Elles lui ont demandé d’y retourner, mais elle a refusé. Elles ont alors envoyé Zainab bint Jahsh, qui est allée le voir et lui a parlé durement : « Tes épouses te demandent de les traiter, elles et la fille d’Ibn Abou Quhafa, de la même façon. » Elle a élevé la voix et insulté `Aisha devant elle, au point que le Messager d’Allah (ﷺ) a regardé `Aisha pour voir si elle allait répondre. `Aisha a répondu à Zainab jusqu’à la faire taire. Le Prophète (ﷺ) a alors regardé `Aisha et a dit : « Elle est vraiment la fille d’Abou Bakr. »",
          "id": "Telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepadaku [saudaraku] dari [Sulaiman] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah radliallahu 'anha] bahwa isteri-isteri Rasulullah shallallahu 'alaihi wasallam terbagi menjadi dua kubu. Kubu pertama adalah terdiri 'Aisyah, Hafshah, Shafiyyah, Sawdah. Dan kelompok kedua diikutsertai oleh Ummu Salamah dan isri-isteri Rasulullah shallallahu 'alaihi wasallam yang lain. Saat itu Kaum Muslimun mengetahui kalau Rasulullah shallallahu 'alaihi wasallam sangat mencintai 'Aisyah. Apabila salah seorang dari mereka memiliki hadiah yang akan dihadiahkan untuk Rasulullah shallallahu 'alaihi wasallam, dia menangguhkannya. Ketika Rasulullah shallallahu 'alaihi wasallam sudah berada di rumah 'Aisyah, barulah pemilik hadiah mengirim hadiahnya kepada Rasulullah shallallahu 'alaihi wasallam di rumah 'Aisyah radliallahu 'anha. Kebiasaan ini menbuat kelompok 'Ummu Salamah memperbincangkannya. Mereka berkata, kepada Ummu Salamah; \"Coba kamu bicara kepada Rasulullah shallallahu 'alaihi wasallam agar beliau menyampaikan kepada orang banyak bahwa siapa yang hendak memberi hadiah kepada Rasulullah shallallahu 'alaihi wasallam hendaklah hadiah itu diberikan kepada beliau dimana saja saat beliau berada di rumah-rumah isteri beliau\". Maka Ummu Salamah menyampaikan apa yang dikatakan oleh mereka kepada beliau namun beliau tidak berkomentar sepatah katapun kepadanya. Kemudian kami tanyakan kepadanya, maka dia berkata,; \"Beliau tidak berkata, sepatah kata pun kepadaku\". Lalu mereka kembali berkata,; \"Coba berbicaralah kembali dengan beliau\". Maka Ummu Salamah kembali mengajak beliau berbicara saat giliran beliau di rumahnya namun beliau tetap tidak berkata sepatah katapun kepadanya. Kemudian kami tanyakan kepadanya, maka dia berkata,; \"Beliau tidak berbicara sepatah kata pun kepadaku\". Lalu mereka kembali berkata,; \"Berbicaralah dengan beliau hingga beliau mau berbicara denganmu?\". Kemudian ketika giliran beliau di rumahnya, Ummu Salamah mengajak bicara beliau, maka beliau shallallahu 'alaihi wasallam berkata kepadanya: \"Jangan kamu sakiti aku dalam masalah 'Aisyah, karena tidak satu wahyu pun yang turun kepadaku saat aku berada dalam pakaian seorang isteri kecuali 'Aisyah\". 'Aisyah berkata,; \"Maka Ummu Salamah berkata,; Aku bertobat kepada Allah karena telah menyakitimu wahai Rasulullah?\". Kemudian isteri-isteri Beliau memanggil Fathimah, putri Rasulullah shallallahu 'alaihi wasallam untuk mengutusnya menemui Rasulullah shallallahu 'alaihi wasallam dan mereka berpesan; \"Katakanlah kepada beliau, sesungguhnya isteri-isteri ayahanda mencari keadilan Allah kepada ayahanda dalam perkara putri Abu Bakar\". Maka Fathimah menyampaikannya. Lalu beliau berkata,: \"Wahai ananda, apakah kamu menyukai sesuatu yang aku sukai?\". Fathimah menjawab; \"Ya tentu\". Maka Fathimah menemui mereka seraya mengabarkan kepada mereka. Maka mereka berkata,; 'Kembalilah menemui beliau\". Namun Fathimah enggan untuk kembali. Akhirnya mereka mengutus Zainab binti Jahsyi. Maka Zainab menemui beliau dengan perkataan yang keras, katanya: \"Sesungguhnya isteri-isteri anda mencari keadilan Allah kepada anda dalam perkara putri Ibnu Abi Quhafah\". Dia mengeraskan suaranya hingga sampai kepada 'Aisyah yang saat itu dia sedang duduk lalu dia mencelanya hingga Rasulullah shallallahu 'alaihi wasallam memandang 'Aisyah apakah 'Aisyah akan membalasnya. Maka 'Aisyah membalas apa yang ducapkan Zainab hingga membuatnya berhenti. Dia (Fathimah) berkata,; \"Maka Nabi shallallahu 'alaihi wasallam memandang kepada 'Aisyah dan berkata: \"Dia ini adalah putri dari Abu Bakar\". Al Bukhari berkata,; \"Kalimat terakhir ini adalah kisah Fathimah yang diceritakan oleh [Hisyam bin 'Urwah] dari [seseorang] dari [Az Zuhriy] dari [Muhammad bin 'Abdurrahman]. Dan berkata, [Abu Marwan] dari [Hisyam] dari ['Urwah]; \"Bahwa orang-orang memilih barang yang terbaik sebagai hadiah dari mereka untuk hari pernikahan 'Aisyah\". Dan dari [Hisyam] dari [seseorang kalangan Quraisy] dari [seorang dari suku Al Mawaliy] dari [Az Zuhriy] dari [Muhammad bin 'Abdurrahman bin Al Harits bin Hisyam]; ['Aisyah radliallahu 'anha] berkata,; 'Aku sedang bersama Nabi shallallahu 'alaihi wasallam lalu datang Fathimah meminta izin masuk",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'in hanımları iki grup idi. Aişe, Hafsa, Safiye ve Sevde birinci grupta yer alıyordu. Ümmü Seleme ve diğer hanımları ise ikinci grupta yer alıyordu. Müslümanlar, Allah Resulü Sallallahu Aleyhi ve Sellem'in Aişe'yi sevdiğini bilirlerdi. Allah Resulü'ne bir şeyarmağan etmek istediklerinde Hz. Aişe'nin odasında geceleyeceği gün gelinceye kadar geciktirirlerdi. O gün gelince armağanlarını Aişe'nin odasına gönderirlerdi. Ümmü Seleme grubu, Ümmü Seleme'ye \"Allah Resulü ile konuşsan da insanlara 'Bana hediye vermek isteyenler ben hangi eşimin odasında bulunuyorsam orada versin' dese\" dediler. Ümmü Seleme Hz. Nebi'e onların bu isteğini iletti ama Hz. Nebi hiçbir şey söylemedi. Sonra hanımları Ümmü Seleme'ye sordular. O da \"Bana hiçbir şey söylemedi\" dedi. Tekrar sordular, yine \"Bana hiçbir şey söylemedi\" dedi. Bunun üzerine \"Onunla konuş da sana bir cevap versin\" dediler. Ümmü Seleme gitti ve konuştu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Aişe konusunda beni üzme. Çünkü Aişe dışında hiçbir kadınla aynı yatakta yatarken bana vahiy gelmedi\" buyurdu. Bunun üzerine Ümmü Seleme, \"Ey Allah'ın Resulü' Seni üzdüğüm için Allah'a tövbe ediyorum\" dedi. Sonra hanımları, Allah Resulü'nün kızı Fatıma'yı çağırdılar ve Allah Resulü'ne giderek \"Hanımların Ebu Bekir'in kızı konusunda senden adalet istiyorlar\" demesini istediler. O da onların bu isteklerini yerine getirdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Kızım' Benim sevdiğimi sen de sevmez misin?\" buyurdu. Fatima r.anha. \"Ne demek! Elbette severim\" dedi. Sonra geri dönüp konuşmayı onlara aktardı. Tekrar gitmesini istediler. Ama Fatıma r.a. gitmedi. Bunun üzerine Zeyneb binti Cahş'ı gönderdiler. O da Hz. Nebi'in yanına geldi ve ölçüsüzce ve bağırarak: \"Hanımların Ebu Kuhafe'nin oğlunun kızı konusunda adaletli olmanı istiyorlar\" dedi. Sonra oturmakta olan Aişe'ye yönelerek ağır sözler söyledi. Allah Resulü \"bir karşılık verecek mi acaba'\" diye Aişe'ye baktı. Aişe, Zeyneb'e karşılık vererek onu susturdu. Dedi ki: \"Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem Aişe'ye bakarak: \"Bu, EbU Bekir'in kızı!\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 16
      },
      "narrator": {
        "en": "`Urwa from `Aisha"
      }
    },
    {
      "hadithNumber": 2582,
      "arabicNumber": 2582,
      "book": 51,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَيْهِ فَنَاوَلَنِي طِيبًا، قَالَ كَانَ أَنَسٌ ـ رضى الله عنه ـ لاَ يَرُدُّ الطِّيبَ‏.‏ قَالَ وَزَعَمَ أَنَسٌ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَرُدُّ الطِّيبَ‏.‏",
        "translations": {
          "en": "Narrated 'Azra bin Thabit Al-Ansari:When I went to Thumama bin `Abdullah, he gave me some perfume and said that Anas would not reject the gifts of perfume. Anas said: The Prophet (ﷺ) used not to reject the gifts of perfume",
          "ur": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ان سے عزرہ بن ثابت انصاری نے بیان کیا، کہا کہ مجھ سے ثمامہ بن عبداللہ نے بیان کیا، عزرہ نے کہا کہ میں ثمامہ بن عبداللہ کی خدمت میں حاضر ہوا تو انہوں نے مجھے خوشبو عنایت فرمائی اور بیان کیا کہ انس رضی اللہ عنہ خوشبو کو واپس نہیں کرتے تھے۔ ثمامہ نے کہا کہ انس رضی اللہ عنہ کا گمان تھا کہ نبی کریم صلی اللہ علیہ وسلم خوشبو کو واپس نہیں فرمایا کرتے تھے۔",
          "fr": "Rapporté par 'Azra bin Thabit Al-Ansari : Quand je suis allé voir Thumama bin `Abdullah, il m’a offert du parfum et a dit qu’Anas n’a jamais refusé les cadeaux de parfum. Anas a dit : Le Prophète (ﷺ) n’a jamais refusé les cadeaux de parfum",
          "id": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami ['Abdul Warits] telah menceritakan kepada kami ['Azrah bin Tsabit Al Anshariy] berkata, telah menceritakan kepadaku [Tsumamah bin 'Abdullah] berkata; \"Aku menemuinya lalu ia menyodorkan minyak wangi kepadaku seraya berkata; Anas radliallahu 'anhu tidak menolak minyak wangi\". Dia berkata; \"Dan [Anas] yakin bahwa Nabi shallallahu 'alaihi wasallam tidak menolak jika ditawarkan minyak wangi",
          "tr": "Sümame b. Abdullah'ın yanına girdim. Bana güzel koku uzattı. Ben \"daha yeni koku sürünmüştüm\" dedim. Bunun üzerine \"Enes r.a. güzel kokuyu hiç reddetmezdi\" dedi ve Hz. Enes'in \"Nebi Sallallahu Aleyhi ve Sellem güzel kokuyu hiç reddetmezdi\" buyurduğunu nakletti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 17
      },
      "narrator": {
        "en": "'Azra bin Thabit Al-Ansari"
      }
    },
    {
      "hadithNumber": 2583,
      "arabicNumber": 2583,
      "book": 51,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ ذَكَرَ عُرْوَةُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ، رضى الله عنهما وَمَرْوَانَ أَخْبَرَاهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم حِينَ جَاءَهُ وَفْدُ هَوَازِنَ قَامَ فِي النَّاسِ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ، فَإِنَّ إِخْوَانَكُمْ جَاءُونَا تَائِبِينَ، وَإِنِّي رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا ‏\"‏‏.‏ فَقَالَ النَّاسُ طَيَّبْنَا لَكَ‏.‏",
        "translations": {
          "en": "Narrated Al-Miswar bin Makhrama and Marwan:When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) he stood up amongst the people, Glorified and Praised Allah as He deserved, and said, \"Then after: Your brethren have come to you with repentance and I see it logical to return to them their captives; so whoever amongst you likes to do that as a favor, then he can do it, and whoever of you like to stick to his share till we give him his right from the very first Fai (war booty) (1) which Allah will bestow on us, then (he can do so).\" The people replied, \"We do that (to return the captives) willingly as a favor for your sake",
          "fr": "Rapporté par Al-Miswar bin Makhrama et Marwan : Quand les délégués de la tribu de Hawazin sont venus voir le Prophète (ﷺ), il s’est levé devant les gens, a glorifié et loué Allah comme il se doit, puis a dit : « Ensuite : Vos frères sont venus vers vous repentants et je trouve juste de leur rendre leurs prisonniers ; donc, si l’un d’entre vous veut le faire par bonté, qu’il le fasse, et si l’un d’entre vous préfère garder sa part jusqu’à ce que nous lui donnions son droit lors du premier butin (Fai) qu’Allah nous accordera, qu’il le fasse aussi. » Les gens ont répondu : « Nous le faisons volontiers, par bonté pour toi. »",
          "id": "Telah menceritakan kepada kami [Sa'id bin Abi Maryam] telah menceritakan kepada kami [Al Laits] berkata, telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] berkata, bahwa ['Urwah] menyebutkan bahwa [Al Miswar bin Makhramah radliallahu 'anhu] dan [Marwan] keduanya mengabarkan bahwa Nabi shallallahu 'alaihi wasallam ketika datang kepada Beliau utusan suku HawAzin, Beliau berdiri di hadapan manusia lalu memuji Allah Dzat yang paling berhak dipuji kemudian bersabda: \"Kemudian dari pada itu, bahwa saudara-saudara kalian telah datang dengan bertobat dan aku berpikir untuk mengembalikan tawanan mereka. Maka itu siapa diantara kalian yang suka berbuat baik (untuk membebaskannya) maka lakukanlah dan siapa yang ingin mendapatkan haknya maka kami akan berikan haknya kepadanya dari sejak awal harta fa'i yang Allah karuniakan kepada kita\". Maka orang-orang berkata: \"Kami memilih berbuat kebaikan untuk anda",
          "tr": "Urve, Misver b. Mahrame ile Mervan'ın kendisine şöyle haber verdiklerini nakletmiştir: Hevazin heyeti Hz. Nebi'in huzuruna gelmişlerdi. Hz. Nebi insanlar içinde ayağa kalktı, Allah'a layık olduğu biçimde hamdetti. Sonra: \"Konuya gelelim. Kardeşleriniz tövbe etmiş ve bize gelmişler; ben esirlerini kendilerine geri vermeyi uygun görüyorum. Hakkından vazgeçecek kimler varsa bunu yapsın. Hakkını almak isteyenlerin hakkını ise ilk ganimetlerden verelim\" buyurdu. Bunun üzerine insanlar: \"Biz hakkımızdan vazgeçiyoruz\" dediler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 18
      },
      "narrator": {
        "en": "Al-Miswar bin Makhrama and Marwan"
      }
    },
    {
      "hadithNumber": 2585,
      "arabicNumber": 2585,
      "book": 51,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْبَلُ الْهَدِيَّةَ وَيُثِيبُ عَلَيْهَا‏.‏ لَمْ يَذْكُرْ وَكِيعٌ وَمُحَاضِرٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Allah's Messenger (ﷺ) used to accept gifts and used to give something in return",
          "ur": "ہم سے مسدد نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم سے مسدد نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، کہا ہم سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
          "fr": "Rapporté par `Aisha رضي الله عنها : Le Messager d’Allah (ﷺ) acceptait les cadeaux et offrait quelque chose en retour",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['Isa bin Yunus] dari [Hisyam] dari [bapaknya] dari ['Aisyah radliallahu 'anha] berkata: \"Adalah Rasulullah shallallahu 'alaihi wasallam menerima pemberiah hadiah dan membalasnya\". [Waki'] dan [Muhadhir] tidak menebutkan dari [Hisyam] dari [bapaknya] dari ['Aisyah radliallahu 'anha]",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem hediyeyi kabul eder ve ona karşılık bir şey verirdi. Diğer tahric: Tirmizi Birr; Ebu Dâvûd, Buyu’"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 19
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 2586,
      "arabicNumber": 2586,
      "book": 51,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، وَمُحَمَّدِ بْنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّهُمَا حَدَّثَاهُ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، أَنَّ أَبَاهُ، أَتَى بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي نَحَلْتُ ابْنِي هَذَا غُلاَمًا‏.‏ فَقَالَ ‏\"‏ أَكُلَّ وَلَدِكَ نَحَلْتَ مِثْلَهُ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَارْجِعْهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated An-Nu`man bin Bashir:that his father took him to Allah's Messenger (ﷺ) and said, \"I have given this son of mine a slave.\" The Prophet asked, \"Have you given all your sons the like?\" He replied in the negative. The Prophet (ﷺ) said, \"Take back your gift then",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو امام مالک نے خبر دی ابن شہاب سے، وہ حمید بن عبدالرحمٰن اور محمد بن نعمان بن بشیر سے اور ان سے نعمان بن بشیر رضی اللہ عنہما نے کہا ان کے والد انہیں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لائے اور عرض کیا کہ میں نے اپنے اس بیٹے کو ایک غلام بطور ہبہ دیا ہے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا، کیا ایسا ہی غلام اپنے دوسرے لڑکوں کو بھی دیا ہے؟ انہوں نے کہا نہیں، تو آپ نے فرمایا کہ پھر ( ان سے بھی ) واپس لے لے۔",
          "fr": "Rapporté par An-Nu`man bin Bashir : Son père l’a emmené voir le Messager d’Allah (ﷺ) et a dit : « J’ai donné à ce fils un esclave. » Le Prophète a demandé : « As-tu donné la même chose à tous tes fils ? » Il a répondu non. Le Prophète (ﷺ) a dit : « Reprends alors ton cadeau. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] dan [Muhammad bin An Nu'man bin Basyir] bahwa keduanya menceritakan kepada [An Nu'man bin Basyir] bahwa bapaknya datang bersamanya menemui Rasulullah shallallahu 'alaihi wasallam lalu berkata; \"Aku hadiahkan anakku ini sebagai ghulam (pembantu) \". Maka Beliau bertanya: \"Apakah semua anakmu kamu hadiahkan seperti ini?\". Dia menjawab: \"Tidak\". Maka Beliau bersabda: \"Kalau begitu, lebih baik kamu bawa pulang kembali",
          "tr": "Nu'man b. Beşir r.a.'den rivayet edilmiştir: Babası onu Allah Resulülne Sallallahu Aleyhi ve Sellem getirerek: \"Ben bu oğluma bir köle bağışladım\" demişti. Nebi Sallallahu Aleyhi ve Sellem: \"Bütün çocuklarına bunun gibi bir köle bağışlamış mıydın?\" buyurdu. Babam \"Hayır\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"O zaman bu bağıştan vazgeç\" buyurdu. Tekrar: 2587, 2650 باب: الإشهاد في الهبة. 12. HİBEYE ŞAHİT TUTMAK"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 20
      },
      "narrator": {
        "en": "An-Nu`man bin Bashir"
      }
    },
    {
      "hadithNumber": 2587,
      "arabicNumber": 2587,
      "book": 51,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ عَامِرٍ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنهما ـ وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ أَعْطَانِي أَبِي عَطِيَّةً، فَقَالَتْ عَمْرَةُ بِنْتُ رَوَاحَةَ لاَ أَرْضَى حَتَّى تُشْهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أَعْطَيْتُ ابْنِي مِنْ عَمْرَةَ بِنْتِ رَوَاحَةَ عَطِيَّةً، فَأَمَرَتْنِي أَنْ أُشْهِدَكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَعْطَيْتَ سَائِرَ وَلَدِكَ مِثْلَ هَذَا ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَاتَّقُوا اللَّهَ، وَاعْدِلُوا بَيْنَ أَوْلاَدِكُمْ ‏\"‏‏.‏ قَالَ فَرَجَعَ فَرَدَّ عَطِيَّتَهُ‏.‏",
        "translations": {
          "en": "Narrated 'Amir:I heard An-Nu`man bin Bashir on the pulpit saying, \"My father gave me a gift but `Amra bint Rawaha (my mother) said that she would not agree to it unless he made Allah's Messenger (ﷺ) as a witness to it. So, my father went to Allah's Messenger (ﷺ) and said, 'I have given a gift to my son from `Amra bint Rawaha, but she ordered me to make you as a witness to it, O Allah's Messenger (ﷺ)!' Allah's Messenger (ﷺ) asked, 'Have you given (the like of it) to everyone of your sons?' He replied in the negative. Allah's Messenger (ﷺ) said, 'Be afraid of Allah, and be just to your children.' My father then returned and took back his gift",
          "ur": "ہم سے حامد بن عمر نے بیان کیا، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا حصین سے، وہ عامر سے کہ میں نے نعمان بن بشیر رضی اللہ عنہما سے سنا وہ منبر پر بیان کر رہے تھے کہ میرے باپ نے مجھے ایک عطیہ دیا، تو عمرہ بنت رواحہ رضی اللہ عنہا ( نعمان کی والدہ ) نے کہا کہ جب تک آپ رسول اللہ صلی اللہ علیہ وسلم کو اس پر گواہ نہ بنائیں میں راضی نہیں ہو سکتی۔ چنانچہ ( حاضر خدمت ہو کر ) انہوں نے عرض کیا کہ عمرہ بنت رواحہ سے اپنے بیٹے کو میں نے ایک عطیہ دیا تو انہوں نے کہا کہ پہلے میں آپ کو اس پر گواہ بنا لوں، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اسی جیسا عطیہ تم نے اپنی تمام اولاد کو دیا ہے؟ انہوں نے جواب دیا کہ نہیں، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ سے ڈرو اور اپنی اولاد کے درمیان انصاف کو قائم رکھو۔ چنانچہ وہ واپس ہوئے اور ہدیہ واپس لے لیا۔",
          "fr": "Rapporté par 'Amir : J’ai entendu An-Nu`man bin Bashir dire sur la chaire : « Mon père m’a offert un cadeau, mais `Amra bint Rawaha (ma mère) a dit qu’elle n’accepterait que si le Messager d’Allah (ﷺ) en était témoin. Mon père est donc allé voir le Messager d’Allah (ﷺ) et a dit : ‘J’ai offert un cadeau à mon fils de la part de `Amra bint Rawaha, mais elle m’a demandé de te prendre comme témoin, ô Messager d’Allah (ﷺ) !’ Le Messager d’Allah (ﷺ) a demandé : ‘As-tu donné la même chose à chacun de tes enfants ?’ Il a répondu non. Le Messager d’Allah (ﷺ) a dit : ‘Crains Allah et sois juste envers tes enfants.’ Mon père est alors revenu et a repris son cadeau. »",
          "id": "Telah menceritakan kepada kami [Hamid bin 'Umar] telah menceritakan kepada kami [Abu 'Awanah] dari [Hushain] dari ['Amir] berkata; aku mendengar [An Nu'man bin Basyir radliallahu 'anhuma] berkhutbah diatas mimbar, katanya: \"Bapakku memberiku sebuah hadiah (pemberian tanpa imbalan). Maka 'Amrah binti Rawahah berkata; \"Aku tidak rela sampai kamu mempersaksikannya kepada Rasulullah shallallahu 'alaihi wasallam.\" Maka bapakku menemui Rasulullah shallallahu 'alaihi wasallam dan berkata: \"Aku memberi anakku sebuah hadiah yang berasal dari 'Amrah binti Rawahah, namun dia memerintahkan aku agar aku mempersaksikannya kepada anda, wahai Rasulullah\". Beliau bertanya: \"Apakah semua anakmu kamu beri hadiah seperti ini?\". Dia menjawab: \"Tidak\". Beliau bersabda: \"Bertaqwalah kalian kepada Allah dan berbuat adillah diantara anak-anak kalian\". An-Nu'man berkata: \"Maka dia kembali dan Beliau menolak pemberian bapakku",
          "tr": "Amir'den rivayet edilmiştir: Nu'man b. Beşir'i, minberde şöyle derken işittim: Babam bana bir bağışta bulunmuştu. Amra binti Revaha, \"Allah Resulü'nü şahit tutmadığın sürece bu bağışı kabul etmiyorum\" dedi. Bunun üzerine babam Allah Resulü'ne giderek: \"Ey Allah'ın Resulü! Ben, Amra binti Revaha’dan olan oğluma bir bağışta bulundum. Seni buna şahit tutmamı istedi\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Diğer oğullarına da buna denk bir bağışta bu/undun mu?\" diye sordu. \"Hayır\" dedi. Bunun üzerine \"Allah'tan korkun ve çocuklarınız arasında adaleti gözetin\" buyurdu. Bunun üzerine babam geldi, bağışladığı şeyi geri aldı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 21
      },
      "narrator": {
        "en": "'Amir"
      }
    },
    {
      "hadithNumber": 2588,
      "arabicNumber": 2588,
      "book": 51,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ لَمَّا ثَقُلَ النَّبِيُّ صلى الله عليه وسلم فَاشْتَدَّ وَجَعُهُ اسْتَأْذَنَ أَزْوَاجَهُ أَنْ يُمَرَّضَ فِي بَيْتِي، فَأَذِنَّ لَهُ، فَخَرَجَ بَيْنَ رَجُلَيْنِ، تَخُطُّ رِجْلاَهُ الأَرْضَ، وَكَانَ بَيْنَ الْعَبَّاسِ، وَبَيْنَ رَجُلٍ آخَرَ‏.‏ فَقَالَ عُبَيْدُ اللَّهِ فَذَكَرْتُ لاِبْنِ عَبَّاسٍ مَا قَالَتْ عَائِشَةُ، فَقَالَ لِي وَهَلْ تَدْرِي مَنِ الرَّجُلُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ قُلْتُ لاَ‏.‏ قَالَ هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ‏.‏",
        "translations": {
          "en": "Narrated Az-Zuhri:Ubaidullah bin `Abdullah told me that `Aisha had said, \"When the Prophet (ﷺ) became sick and his condition became serious, he requested his wives to allow him to be treated in my house, and they allowed him. He came out leaning on two men while his feet were dragging on the ground. He was walking between Al-`Abbas and another man.\" 'Ubaidullah said, \"When I informed Ibn `Abbas of what `Aisha had said, he asked me whether I knew who was the second man whom `Aisha had not named. I replied in the negative. He said, 'He was `Ali bin Abi Talib",
          "ur": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام نے خبر دی، انہیں معمر نے، انہیں زہری نے، کہا کہ مجھے عبیداللہ بن عبداللہ نے خبر دی کہ عائشہ رضی اللہ عنہا نے بیان کیا، جب رسول اللہ صلی اللہ علیہ وسلم کی بیماری بڑھی اور تکلیف شدید ہو گئی تو آپ صلی اللہ علیہ وسلم نے اپنی بیویوں سے میرے گھر میں ایام مرض گزارنے کی اجازت چاہی اور آپ صلی اللہ علیہ وسلم کو بیویوں نے اجازت دے دی تو آپ اس طرح تشریف لائے کہ دونوں قدم زمین پر رگڑ کھا رہے تھے۔ آپ اس وقت عباس رضی اللہ عنہ اور ایک اور صاحب کے درمیان تھے۔ عبیداللہ نے بیان کیا کہ پھر میں نے عائشہ رضی اللہ عنہا کی اس حدیث کا ذکر ابن عباس رضی اللہ عنہما سے کیا۔ تو انہوں نے مجھ سے پوچھا، عائشہ رضی اللہ عنہا نے جن کا نام نہیں لیا، جانتے ہو وہ کون تھے؟ میں نے کہا کہ نہیں؟ آپ نے فرمایا کہ وہ علی بن ابی طالب رضی اللہ عنہ تھے۔",
          "fr": "Rapporté par Az-Zuhri : Ubaidullah bin `Abdullah m’a raconté que `Aisha رضي الله عنها avait dit : « Quand le Prophète (ﷺ) est tombé malade et que sa maladie s’est aggravée, il a demandé à ses épouses la permission d’être soigné chez moi, et elles ont accepté. Il est sorti en s’appuyant sur deux hommes, ses pieds traînant sur le sol. Il marchait entre Al-`Abbas et un autre homme. » Ubaidullah a dit : « Quand j’ai raconté à Ibn `Abbas ce que `Aisha avait dit, il m’a demandé si je savais qui était le second homme qu’`Aisha n’avait pas nommé. J’ai répondu non. Il a dit : ‘C’était `Ali bin Abi Talib.’ »",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] dari [Ma'mar] dari [Az Zuhriy] berkata, telah menceritakan kepadaku ['Ubaidullah bin 'Abdullah]; ['Aisyah radliallahu 'anha] berkata; \"Ketika Nabi shallallahu 'alaihi wasallam menderita sakit dan terasa bertambah berat, Beliau meminta izin kepada isteri-isteri Beliau agar Beliau dirawat di rumahku lalu Beliau diijinkan. Beliau keluar dengan berjalan tertatih, dan kedua kaki Beliau diseret di atas tanah. Saat itu Beliau dibantu oleh Al 'Abbas dan seseorang yang lain\". ['Ubaidullah] berkata: \"Aku menceritakan kepada [Ibnu 'Abbas] apa yang diceritakan oleh 'Aisyah. Maka dia berkata, kepadaku: \"Tahukah kamu siapa orang yang lain itu, yang tidak disebut namannya oleh 'Aisyah?\". Aku katakan: \"Aku tidak tahu\". Dia berkata: \"Orang itu adalah 'Ali bin Abi Tholib",
          "tr": "Ubeydullah b. Abdullah'tan rivayet edilmiştir: Aişe r.anha şöyle demiştir: Allah Resulü Sallallahu Aleyhi ve Sellem ağırlaşıp, ağrıları artınca eşlerinden bakımının benim odamda yapılması için izin istedi. Onlar da izin verdiler. İki kişi arasında kaldığı odadan çıktı, ayaklarını yerde sürüyordu. Abbas'la başka bir kişi arasındaydı. Ubeydullah şöyle demiştir: İbn Abbas'a, Aişe'nin bu sözünü söyledim. Bana \"Aişe'nin adını vermediği kişinin kim olduğunu biliyor musun?\" diye sordu. Ben \"Hayır\" dedim. \"Ali b. Ebu Talib'di\" dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 22
      },
      "narrator": {
        "en": "Az-Zuhri"
      }
    },
    {
      "hadithNumber": 2589,
      "arabicNumber": 2589,
      "book": 51,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ، ثُمَّ يَعُودُ فِي قَيْئِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"One who takes back his gift (which he has already given) is like a dog that swallows its vomit",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے ابن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اپنا ہبہ واپس لینے والا اس کتے کی طرح ہے جو قے کر کے پھر چاٹ جاتا ہے۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a dit : « Celui qui reprend un cadeau qu’il a déjà offert est comme un chien qui avale son vomi. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [bapaknya] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang meminta kembali apa yang telah dihibahkannya bagaikan anjing yang muntah lalu menelan kembali apa yang dimuntahkannya ke dalam mulutnya",
          "tr": "Abdullah b. Abbas r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem, \"Yaptığı bağıştan dönen kişi, kustuktan sonra kusmuğuna geri dönüp yiyen köpeğe benzer\" buyurdu. Tekrar: 2621, 2622, 6975 nolu hadisler. Diğer tahric: Tirmzi, Buyu; Müslim, Hibât"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 23
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 2590,
      "arabicNumber": 2590,
      "book": 51,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ، عَنْ أَسْمَاءَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ مَا لِي مَالٌ إِلاَّ مَا أَدْخَلَ عَلَىَّ الزُّبَيْرُ فَأَتَصَدَّقُ‏.‏ قَالَ ‏ \"‏ تَصَدَّقِي، وَلاَ تُوعِي فَيُوعَى عَلَيْكِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Asma:Once I said, \"O Allah's Messenger (ﷺ)! I have no property except what has been given to me by Az-Zubair (i.e. her husband). May I give in charity?\" The Prophet (ﷺ) said, \"Give in charity and do not withhold it; otherwise Allah will withhold it back from you",
          "ur": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا، ان سے ابن جریج نے، ان سے ابن ابی ملیکہ نے، ان سے عباد بن عبداللہ نے اور ان سے اسماء رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا یا رسول اللہ! میرے پاس صرف وہی مال ہے جو ( میرے شوہر ) زبیر نے میرے پاس رکھا ہوا ہے تو کیا میں اس میں سے صدقہ کر سکتی ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”صدقہ کرو، جوڑ کے نہ رکھو، کہیں تم سے بھی۔ ( اللہ کی طرف سے نہ ) روک لیا جائے۔“",
          "fr": "Rapporté par Asma : Un jour, j’ai dit : « Ô Messager d’Allah (ﷺ) ! Je n’ai rien d’autre comme bien que ce que m’a donné Az-Zubair (c’est-à-dire mon mari). Puis-je donner cela en aumône ? » Le Prophète (ﷺ) a dit : « Donne en aumône et ne retiens pas, sinon Allah le retiendra aussi pour toi. »",
          "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Abi Mulaikah] dari ['Abbad bin 'Abdullah] dari [Asma' radliallahu 'anhu] berkata; Aku berkata: \"Wahai Rasulullah, aku tidak memiliki harta kecuali apa yang diberikan oleh Az Zubair Apakah aku boleh bershadaqah dengannya?\" Beliau menjawab: \"Bershadaqalah dan jangan kamu tutup rapat guci tempat menyimpan makanan itu, karena nanti Allah menutup rezekimu",
          "tr": "Esma r.anha'dan rivayet edilmiştir: \"Ey Allah'ın Resulü! Benim, Zübeyr'in bana verdiklerinden başka malım yoktur. Ben bunlardan sadaka verebilir miyim?\" diye sordum. Hz. Nebi \"Tabii ki sadaka verebilirsin. Sakın çömlekte para saklama, sonra Allah da senden saklar\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 24
      },
      "narrator": {
        "en": "Asma"
      }
    },
    {
      "hadithNumber": 2591,
      "arabicNumber": 2591,
      "book": 51,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَنْفِقِي وَلاَ تُحْصِي فَيُحْصِيَ اللَّهُ عَلَيْكِ، وَلاَ تُوعِي فَيُوعِيَ اللَّهُ عَلَيْكِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Asma:Allah's Messenger (ﷺ) said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a limited amount; and do not withhold your money lest Allah should withhold it from you",
          "ur": "ہم سے عبیداللہ بن سعید نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے فاطمہ بنت منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”خرچ کیا کر، گنا نہ کر، تاکہ تمہیں بھی گن کے نہ ملے اور جوڑ کے نہ رکھو، تاکہ تم سے بھی اللہ تعالیٰ ( اپنی نعمتوں کو ) نہ چھپا لے۔“",
          "fr": "Rapporté par Asma : Le Messager d’Allah (ﷺ) a dit : « Donnez (en aumône) et ne soyez pas avares, sinon Allah vous donnera en quantité limitée ; et ne gardez pas votre argent pour vous, sinon Allah le retiendra aussi pour vous. »",
          "id": "Telah menceritakan kepada kami ['Ubaidullah bin Sa'id] telah menceritakan kepada kami ['Abdullah bin Numair] telah menceritakan kepada kami [Hisyam bin \"Urwah] dari [Fathimah] dari [Asma'] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berinfaqlah dan jangan kamu hitung-hitung (pelit) karena nanti Allah akan berhitung kepadamu dan jangan kamu tutup rapat guci tempat menyimpan makanan itu karena nanti Allah akan menutup rezekimu",
          "tr": "Esma r.anha'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"İnfak et ve hesabını tutma ki Allah da sana verdiği nimetlerini tutar, çömlekte para saklama, sonra Allah da senden saklar\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 25
      },
      "narrator": {
        "en": "Asma"
      }
    },
    {
      "hadithNumber": 2592,
      "arabicNumber": 2592,
      "book": 51,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ يَزِيدَ، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ مَيْمُونَةَ بِنْتَ الْحَارِثِ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّهَا، أَعْتَقَتْ وَلِيدَةً وَلَمْ تَسْتَأْذِنِ النَّبِيَّ صلى الله عليه وسلم، فَلَمَّا كَانَ يَوْمُهَا الَّذِي يَدُورُ عَلَيْهَا فِيهِ قَالَتْ أَشَعَرْتَ يَا رَسُولَ اللَّهِ أَنِّي أَعْتَقْتُ وَلِيدَتِي قَالَ ‏\"‏ أَوَفَعَلْتِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ أَمَا إِنَّكِ لَوْ أَعْطَيْتِيهَا أَخْوَالَكِ كَانَ أَعْظَمَ لأَجْرِكِ ‏\"‏‏.‏ وَقَالَ بَكْرُ بْنُ مُضَرَ عَنْ عَمْرٍو عَنْ بُكَيْرٍ عَنْ كُرَيْبٍ إِنَّ مَيْمُونَةَ أَعْتَقَتْ",
        "translations": {
          "en": "Narrated Kuraib:the freed slave of Ibn `Abbas, that Maimuna bint Al-Harith told him that she manumitted a slave-girl without taking the permission of the Prophet. On the day when it was her turn to be with the Prophet, she said, \"Do you know, O Allah's Messenger (ﷺ), that I have manumitted my slave-girl?\" He said, \"Have you really?\" She replied in the affirmative. He said, \"You would have got more reward if you had given her (i.e. the slave-girl) to one of your maternal uncles",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، ان سے لیث نے، ان سے یزید بن ابی حبیب نے، ان سے بکیر نے، ان سے ابن عباس کے غلام کریب نے اور انہیں (ام المؤمنین) میمونہ بنت حارث رضی اللہ عنہا نے خبر دی کہ انہوں نے ایک لونڈی نبی کریم صلی اللہ علیہ وسلم سے اجازت لیے بغیر آزاد کر دی۔ پھر جس دن نبی کریم صلی اللہ علیہ وسلم کی باری آپ کے گھر آنے کی تھی، انہوں نے خدمت نبوی میں عرض کیا، یا رسول اللہ صلی اللہ علیہ وسلم ! آپ کو معلوم بھی ہوا، میں نے ایک لونڈی آزاد کر دی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا، اچھا تم نے آزاد کر دیا؟ انہوں نے عرض کیا کہ ہاں! فرمایا کہ اگر اس کے بجائے تم نے اپنے ننھیال والوں کو دی ہوتی تو تمہیں اس سے بھی زیادہ ثواب ملتا۔ اس حدیث کو بکیر بن مضر نے عمرو بن حارث سے، انہوں نے بکیر سے، انہوں نے کریب سے روایت کیا کہ میمونہ رضی اللہ عنہا نے اپنی لونڈی آزاد کر دی۔ اخیر تک۔",
          "fr": "Rapporté par Kuraib, l’esclave affranchi d’Ibn `Abbas : Maimouna bint Al-Harith lui a raconté qu’elle avait affranchi une esclave sans demander la permission du Prophète. Le jour où c’était son tour d’être avec le Prophète, elle lui a dit : « Sais-tu, ô Messager d’Allah (ﷺ), que j’ai affranchi mon esclave ? » Il a dit : « Tu l’as vraiment fait ? » Elle a répondu oui. Il a dit : « Tu aurais eu plus de récompense si tu l’avais donnée à un de tes oncles maternels. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] dari [Al Laits] dari [Yazid] dari [Bukair] dari [Kuraib, maula Iabnu 'Abbas] bahwa [Maimunah binti Al Harits radliallahu 'anha] mengabarkan kepadanya bahwa dia telah membebaskan budak wanitanya namun dia tidak meminta izin terlebih dahulu kepada Nabi shallallahu 'alaihi wasallam. Ketika hari giliran Beliau di rumahnya, Maimunah berkata: \"Apakah kakanda telah mengetahui bahwa saya telah membebaskan budak wanita saya, wahai Rasulullah\". Beliau bertanya: \"Apakah kamu sudah melakukannya?\" Dia menjawab: \"Ya, sudah\". Beliau bersabda: \"Jika seandainya kamu hibahkan budak itu kepada bibi-bibi kamu tentu kamu akan mendapatkan pahala yang besar\". Dan berkata, [Bakar bin Mudhor] dari ['Amru] dari [Bukair] dari [Kuraib] bahwa [Maimunah] telah membebaskan (budaknya)",
          "tr": "İbn Abbas'ın azatlı kölesi Kureyb'den rivayet edilmiştir: Meymune bintü'l-Haris, İbn Abbas'a şöyle anlatmıştır: Hz. Nebi'den izin almadan cariyemi azat etmiştim. Hz. Nebi'in benim odamda geceleyeceği gün gelince: \"Ey Allah'ın Resulü! Fark ettin mi cariyemi azat ettim\" dedim. Hz. Nebi: \"Öyle mi yaptın/\" buyurdu. \"Evet\" dedim. \"(Azat edeceğine) dayılarına verseydin mükafatın daha bol olurdu\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 26
      },
      "narrator": {
        "en": "Kuraib"
      }
    },
    {
      "hadithNumber": 2593,
      "arabicNumber": 2593,
      "book": 51,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ، فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ، وَكَانَ يَقْسِمُ لِكُلِّ امْرَأَةٍ مِنْهُنَّ يَوْمَهَا وَلَيْلَتَهَا، غَيْرَ أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا وَلَيْلَتَهَا، لِعَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم تَبْتَغِي بِذَلِكَ رِضَا رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Aisha:Whenever Allah's Messenger (ﷺ) wanted to go on a journey, he would draw lots as to which of his wives would accompany him. He would take her whose name came out. He used to fix for each of them a day and a night. But Sauda bint Zam`a gave up her (turn) day and night to `Aisha, the wife of the Prophet in order to seek the pleasure of Allah's Messenger (ﷺ) (by that action)",
          "ur": "ہم سے حبان بن موسیٰ نے بیان کیا، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے خبر دی زہری سے، وہ عروہ سے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم جب سفر کا ارادہ کرتے تو اپنی ازواج کے لیے قرعہ اندازی کرتے اور جن کا قرعہ نکل آتا انہیں کو اپنے ساتھ لے جاتے۔ آپ صلی اللہ علیہ وسلم کا یہ بھی طریقہ تھا کہ اپنی تمام ازواج کے لیے ایک ایک دن اور رات کی باری مقرر کر دی تھی، البتہ ( آخر میں ) سودہ بنت زمعہ رضی اللہ عنہا نے اپنی باری عائشہ رضی اللہ عنہا کو دے دی تھی، اس سے ان کا مقصد رسول اللہ صلی اللہ علیہ وسلم کی رضا حاصل کرنی تھی۔",
          "fr": "Rapporté par Aisha : Chaque fois que le Messager d’Allah (ﷺ) voulait partir en voyage, il tirait au sort pour savoir laquelle de ses femmes l’accompagnerait. Il emmenait celle dont le nom était tiré. Il fixait pour chacune un jour et une nuit. Mais Sauda bint Zam`a a donné son jour et sa nuit à `Aisha, l’épouse du Prophète, pour faire plaisir au Messager d’Allah (ﷺ) par cette action",
          "id": "Telah menceritakan kepada kami [Hibban bin Musa] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhriy] dari ['Urwah] dari ['Aisyah radliallahu 'anha] berkata: \"Adalah Rasulullah shallallahu 'alaihi wasallam apabila hendak mengadakan suatu perjalanan, Beliau melakukan undian siapa diantara isteri-isteri Beliau yang keluar namanya untuk turut serta bersama Beliau. Dan juga Beliau selalu menggilir isteri-isteri Beliau untuk setiap hari dan malamnya kecuali Saudah binti Zam'ah yang dia telah menghibahkan jatah giliran hari dan malamnya kepada 'Aisyah isteri Nabi shallallahu 'alaihi wasallam, dengan tujuan mencari ridho Rasulullah shallallahu 'alaihi wasallam",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem yolculuğa çıkacağı zaman eşleri arasında kura çekerdi. Kura kime çıkarsa onu beraberinde götürürdü. Her bir eşine bir gece ve gündüzünü paylaştırmıştı. Ancak Sevde binti Zem'a, Allah Resulü'nün rızasını umarak gününü ve gecesini Hz. Nebi'in eşi Aişe'ye bağışlamıştı. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 27
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 2594,
      "arabicNumber": 2594,
      "book": 51,
      "hadithInBook": 28,
      "text": {
        "arabic": "وَقَالَ بَكْرٌ عَنْ عَمْرٍو، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ إِنَّ مَيْمُونَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَعْتَقَتْ وَلِيدَةً لَهَا فَقَالَ لَهَا ‏ \"‏ وَلَوْ وَصَلْتِ بَعْضَ أَخْوَالِكِ كَانَ أَعْظَمَ لأَجْرِكِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Maimuna, the wife of the Prophet (ﷺ) that she manumitted her slave-girl and the Prophet (ﷺ) said to her, \"You would have got more reward if you had given the slave-girl to one of your maternal uncles",
          "ur": "اور بکر بن مضر نے عمرو بن حارث سے، انہوں نے بکیر سے، انہوں نے ابن عباس رضی اللہ عنہما کے غلام کریب سے ( بیان کیا کہ ) نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ میمونہ رضی اللہ عنہا نے اپنی ایک لونڈی آزاد کی تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا ”اگر وہ تمہارے ننھیال والوں کو دی جاتی تو تمہیں زیادہ ثواب ملتا۔“",
          "fr": "Rapporté par Maimouna, l’épouse du Prophète (ﷺ), qu’elle a affranchi son esclave et le Prophète (ﷺ) lui a dit : « Tu aurais eu plus de récompense si tu avais donné l’esclave à un de tes oncles maternels. »",
          "tr": "Abdullah b. Abbas'ın azatlısı Kureyb'den nakledilmiştir: Nebi (Sallallahu aleyhi ve Sellem)'in eşi Meymune, cariyesini azad etmişti. Nebi Sallallahu Aleyhi ve Sellem ona \"Onu dayılarından birine verseydin mükafatın daha çok olurdu\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 28
      }
    },
    {
      "hadithNumber": 2595,
      "arabicNumber": 2595,
      "book": 51,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ ـ رَجُلٍ مِنْ بَنِي تَيْمِ بْنِ مُرَّةَ ـ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ لِي جَارَيْنِ فَإِلَى أَيِّهِمَا أُهْدِي قَالَ ‏ \"‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Aisha:I said, \"O Allah's Messenger (ﷺ)! I have two neighbors; which of them should I give a gift to?\" The Prophet (ﷺ) said, \"(Give) to the one whose door is nearer to you",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ابوعمران جونی سے، ان سے بنو تیم بن مرہ کے ایک صاحب طلحہ بن عبداللہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا، یا رسول اللہ! میری دو پڑوسی ہیں، تو مجھے کس کے گھر ہدیہ بھیجنا چاہئے؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”جس کا دروازہ تم سے قریب ہو۔“",
          "fr": "Rapporté par Aisha : J’ai dit : « Ô Messager d’Allah (ﷺ) ! J’ai deux voisins ; lequel des deux dois-je privilégier pour un cadeau ? » Le Prophète (ﷺ) a dit : « (Donne) à celui dont la porte est la plus proche de toi. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu 'Imran AlJawniy] dari [Thalhah bin 'Abdullah, seorang dari suku Bani Tamim bin Murrah] dari ['Aisyah radliallahu 'anha] berkata; Aku bertanya: \"Wahai Rasulullah, aku mempunyai dua tetangga. Kepada yang manakah dari keduanya bila aku memberikan hadiah?\" Beliau menjawab: \"Kepada yang terdekat pintu rumahnya denganmu diantara keduanya",
          "tr": "Aişe r.anha'dan rivayet edilmiştir: \"Ey Allah'ın Resulü! Benim iki komşum var. Hangisine hediye vereyim buyurursun\" diye sordum. \"Hangisinin kapısı sana daha yakınsa ona\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 29
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 2596,
      "arabicNumber": 2596,
      "book": 51,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، سَمِعَ الصَّعْبَ بْنَ جَثَّامَةَ اللَّيْثِيَّ،، وَكَانَ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم يُخْبِرُ أَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم حِمَارَ وَحْشٍ وَهْوَ بِالأَبْوَاءِ ـ أَوْ بِوَدَّانَ ـ وَهْوَ مُحْرِمٌ فَرَدَّهُ، قَالَ صَعْبٌ فَلَمَّا عَرَفَ فِي وَجْهِي رَدَّهُ هَدِيَّتِي قَالَ ‏ \"‏ لَيْسَ بِنَا رَدٌّ عَلَيْكَ، وَلَكِنَّا حُرُمٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Abbas:That he heard As-Sa'b bin Jath-thama Al-Laithi, who was one of the companions of the Prophet, saying that he gave the meat of an onager to Allah's Messenger (ﷺ) while he was at a place called Al-Abwa' or Waddan, and was in a state of Ihram. The Prophet (ﷺ) did not accept it. When the Prophet (ﷺ) saw the signs of sorrow on As-Sa'b's face because of not accepting his present, he said (to him), \"We are not returning your present, but we are in the state of Ihram.\" (See Hadith No)",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ انہوں نے صعب بن جثامہ لیثی رضی اللہ عنہ سے سنا، وہ اصحاب رسول اللہ صلی اللہ علیہ وسلم میں سے تھے۔ ان کا بیان تھا کہ انہوں نے آپ صلی اللہ علیہ وسلم کی خدمت میں ایک گورخر ہدیہ کیا تھا۔ آپ صلی اللہ علیہ وسلم اس وقت مقام ابواء یا مقام ودان میں تھے اور محرم تھے۔ آپ نے وہ گورخر واپس کر دیا۔ صعب رضی اللہ عنہ نے کہا کہ اس کے بعد جب آپ صلی اللہ علیہ وسلم نے میرے چہرے پر ( ناراضی کا اثر ) ہدیہ کی واپسی کی وجہ سے دیکھا، تو فرمایا ”ہدیہ واپس کرنا مناسب تو نہ تھا لیکن بات یہ ہے کہ ہم احرام باندھے ہوئے ہیں۔“",
          "fr": "Rapporté par `Abdullah bin `Abbas : Il a entendu As-Sa'b bin Jath-thama Al-Laithi, un des compagnons du Prophète, dire qu’il avait offert de la viande d’onagre au Messager d’Allah (ﷺ) alors qu’il se trouvait à un endroit appelé Al-Abwa’ ou Waddan, et qu’il était en état d’Ihram. Le Prophète (ﷺ) ne l’a pas acceptée. Quand il a vu la tristesse sur le visage d’As-Sa'b parce qu’il n’avait pas accepté son cadeau, il lui a dit : « Nous ne refusons pas ton cadeau, mais nous sommes en état d’Ihram. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhriy] berkata, telah menceritakan kepadaku ['Ubaidullah bin 'Abdullah bin 'Utbah] bahwa ['Abdullah bin 'Abbas radliallahu 'anhu] mengabarkannya bahwa dia mendengar [Ash Sha'bah bin Jatstsamah Al Laitsiy] seorang sahabat Nabi shallallahu 'alaihi wasallam mengabarkan bahwa dia memberi hadiah kepada Rasulullah shallallahu 'alaihi wasallam seekor keledai liar saat Beliau sedang berada di Abwa' atau Waddan dalam keadaan berihram lalu Beliau menolaklnya\". Sha'bu berkata: \"Ketika Beliau mengetahui raut wajahku karena hadiahku ditolak, Beliau berkata: \"Kami tidak bermaksud menolak hadiahmu namun kami sedang dalam keadaan berihram",
          "tr": "Ubeydullah b. Abdullah b. Utbe'den rivayet edilmiştir: Abdullah b. Abbas ona sahabeden olan Sa'b b. Cessame el-Leysi'den şöyle duyduğunu bildirmiştir: Sa'b, Ebva'da -veya Veddan'da- Allah Resulü Sallallahu Aleyhi ve Sellem ihramlı iken O'na bir yabani eşek (zebra) hediye etmişti. Hz. Nebi onu kabul etmedi. Sa 'b diyor ki: \"Hediyemi reddetmesine bozulduğumu görünce bana: \"Biz senin hediyeni reddetmezdik ama ihramlıyız (yanlış anlama)\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 30
      },
      "narrator": {
        "en": "`Abdullah bin `Abbas"
      }
    },
    {
      "hadithNumber": 2597,
      "arabicNumber": 2597,
      "book": 51,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ قَالَ اسْتَعْمَلَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً مِنَ الأَزْدِ يُقَالُ لَهُ ابْنُ اللُّتْبِيَّةِ عَلَى الصَّدَقَةِ، فَلَمَّا قَدِمَ قَالَ هَذَا لَكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ قَالَ ‏ \"‏ فَهَلاَّ جَلَسَ فِي بَيْتِ أَبِيهِ أَوْ بَيْتِ أُمِّهِ، فَيَنْظُرَ يُهْدَى لَهُ أَمْ لاَ وَالَّذِي نَفْسِي بِيَدِهِ لاَ يَأْخُذُ أَحَدٌ مِنْهُ شَيْئًا إِلاَّ جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى رَقَبَتِهِ، إِنْ كَانَ بَعِيرًا لَهُ رُغَاءٌ أَوْ بَقَرَةً لَهَا خُوَارٌ أَوْ شَاةً تَيْعَرُ ـ ثُمَّ رَفَعَ بِيَدِهِ، حَتَّى رَأَيْنَا عُفْرَةَ إِبْطَيْهِ ـ اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَلْ بَلَّغْتُ ثَلاَثًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Humaid Al-Sa`idi:The Prophet (ﷺ) appointed a man from the tribe of Al-Azd, called Ibn 'Utbiyya for collecting the Zakat. When he returned he said, \"This (i.e. the Zakat) is for you and this has been given to me as a present.\" The Prophet (ﷺ) said, \"Why hadn't he stayed in his father's or mother's house to see whether he would be given presents or not? By Him in Whose Hands my life is, whoever takes something from the resources of the Zakat (unlawfully) will be carrying it on his neck on the Day of Resurrection; if it be a camel, it will be grunting; if a cow, it will be mooing; and if a sheep, it will be bleating.\" The Prophet then raised his hands till we saw the whiteness of his armpits, and he said thrice, \"O Allah! Haven't I conveyed Your Message (to them)?",
          "ur": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، زہری سے، وہ عروہ بن زبیر سے، وہ ابو حمید ساعدی رضی اللہ عنہ سے کہ قبیلہ ازد کے ایک صحابی کو جنہیں ابن اتبیہ کہتے تھے، رسول اللہ صلی اللہ علیہ وسلم نے صدقہ وصول کرنے کے لیے عامل بنایا۔ پھر جب وہ واپس آئے تو کہا کہ یہ تم لوگوں کا ہے ( یعنی بیت المال کا ) اور یہ مجھے ہدیہ میں ملا ہے۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وہ اپنے والد یا اپنی والدہ کے گھر میں کیوں نہ بیٹھا رہا۔ دیکھتا وہاں بھی انہیں ہدیہ ملتا ہے یا نہیں۔ اس ذات کی قسم! جس کے ہاتھ میں میری جان ہے۔ اس ( مال زکوٰۃ ) میں سے اگر کوئی شخص کچھ بھی ( ناجائز ) لے لے گا تو قیامت کے دن اسے وہ اپنی گردن پر اٹھائے ہوئے آئے گا۔ اگر اونٹ ہے تو وہ اپنی آواز نکالتا ہوا آئے گا، گائے ہے تو وہ اپنی اور اگر بکری ہے تو وہ اپنی آواز نکالتی ہو گی۔ پھر آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ اٹھائے یہاں تک کہ ہم نے آپ صلی اللہ علیہ وسلم کی بغل مبارک کی سفیدی بھی دیکھ لی ( اور فرمایا ) اے اللہ! کیا میں نے تیرا حکم پہنچا دیا۔ اے اللہ! کیا میں نے تیرا حکم پہنچا دیا۔ تین مرتبہ ( آپ صلی اللہ علیہ وسلم نے یہی فرمایا ) ۔",
          "fr": "Rapporté par Abu Humaid Al-Sa`idi : Le Prophète (ﷺ) a nommé un homme de la tribu d’Al-Azd, appelé Ibn 'Utbiyya, pour collecter la Zakat. À son retour, il a dit : « Ceci (la Zakat) est pour vous et ceci m’a été donné comme cadeau. » Le Prophète (ﷺ) a dit : « Pourquoi n’est-il pas resté dans la maison de son père ou de sa mère pour voir s’il aurait reçu des cadeaux ou non ? Par Celui qui détient ma vie, quiconque prend quelque chose des biens de la Zakat (de façon illégale) le portera autour du cou le Jour de la Résurrection ; si c’est un chameau, il grognera ; si c’est une vache, elle mugira ; et si c’est une brebis, elle bêlera. » Le Prophète a alors levé les mains jusqu’à ce que nous voyions la blancheur de ses aisselles, et il a dit trois fois : « Ô Allah ! N’ai-je pas transmis Ton message (à eux) ? »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Sufyan] dari [Az Zuhriy] dari ['Urwah bin Az Zubair] dari [Abu Humaid as-Sa'idiy radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam memperkerjakan seorang laki-laki dari suku Al azdiy sebagai pemungut zakat. Ketika datang dari tugasnya, dia berkata: \"Ini untuk kalian sebagai zakat dan ini dihadiahkan untukku\". Beliau berkata: \"Biarkanlah dia tinggal di rumah ayahnya atau ibunya lalu dia lihat apakah benar itu dihadiahkan untuknya atau tidak. Dan demi Dzat yag jiwaku di tangan-Nya, tidak seoragpun yang mengambil sesuatu dari zakt kecuali dia akan datang pada hari qiyamat dengan dipikulkan di atas lehernya berupa unta yang berteriak, atau sapi yang melembuh atau kambing yang mengembik\". Kemudia Beliau mengangkat tangan Beliau sehingga terlihatt oleh kami ketiak Beliau yang putih dan (berkata,): \"Ya Allah bukankah aku sudah sampaikan, bukankah aku sudah sampaikan\"…. sebanyak tiga kali",
          "tr": "Ebu Humeyd es-Sa'idi r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Ezd kabilesinden İbnü'l-lütbiyye diye anılan birisini zekat memuru olarak görevlendirmişti. Zekatları toplayıp Medine'ye gelince: \"Bu size ait, bunlarsa hediye edildiği için bana ait\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Babasının evinde -veya anasının evinde- otursaydı o hediyeler ona verilir miydi, verilmez miydi? O zaman görürdü. Canım elinde olan (Allah)'a yemin ederim ki siz (haksız yere) bir şeyi alırsanız kıyamet günü onu boynunuzda taşıyarak gelirsiniz, ister böğüren bir deve veya inek olsun, ister meleyen bir koyun. -sonra Hz. Nebi kollarını o kadar kaldırdı ki koltuğunun altını gördük- Allah'ım tebliğ ettim mi? Allah’ım tebliğ ettim mi? Allah'ım tebliğ ettim mi?\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 31
      },
      "narrator": {
        "en": "Abu Humaid Al-Sa`idi"
      }
    },
    {
      "hadithNumber": 2598,
      "arabicNumber": 2598,
      "book": 51,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ جَاءَ مَالُ الْبَحْرَيْنِ أَعْطَيْتُكَ هَكَذَا ثَلاَثًا ‏\"‏‏.‏ فَلَمْ يَقْدَمْ حَتَّى تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم، فَأَمَرَ أَبُو بَكْرٍ مُنَادِيًا فَنَادَى مَنْ كَانَ لَهُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم عِدَةٌ أَوْ دَيْنٌ فَلْيَأْتِنَا‏.‏ فَأَتَيْتُهُ فَقُلْتُ إِنَّ النَّبِيَّ صلى الله عليه وسلم وَعَدَنِي‏.‏ فَحَثَى لِي ثَلاَثًا‏.‏",
        "translations": {
          "en": "Narrated Jabir:The Prophet (ﷺ) said to me, \"I will give you so much (the Prophet (ﷺ) pointed thrice with his hands) when funds of Bahrain will come to me.\" But the Prophet (ﷺ) died before the money reached him. (When it came) Abu Bakr ordered an announcer to announce that whoever had a money claim on the Prophet (ﷺ) or was promised to be given something, should come to Abu Bakr. I went to Abu Bakr and told him that the Prophet (ﷺ) had promised to give me so much. On that Abu Bakr gave me three handfuls (of money)",
          "ur": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے محمد بن المنکدر نے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے سنا۔ آپ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے وعدہ فرمایا، اگر بحرین کا مال ( جزیہ کا ) آیا تو میں تمہیں اتنا اتنا تین لپ مال دوں گا۔ لیکن بحرین سے مال آنے سے پہلے ہی آپ صلی اللہ علیہ وسلم وفات فرما گئے اور ابوبکر رضی اللہ عنہ نے ایک منادی سے یہ اعلان کرنے کے لیے کہا کہ جس سے نبی کریم صلی اللہ علیہ وسلم کا کوئی وعدہ ہو یا آپ صلی اللہ علیہ وسلم پر اس کا کوئی قرض ہو تو وہ ہمارے پاس آئے۔ چنانچہ میں آپ صلی اللہ علیہ وسلم کے یہاں گیا اور کہا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے وعدہ کیا تھا۔ تو انہوں نے تین لپ بھر کر مجھے دئیے۔",
          "fr": "Rapporté par Jabir : Le Prophète (ﷺ) m’a dit : « Je te donnerai autant (le Prophète (ﷺ) a montré trois fois avec ses mains) quand les fonds de Bahreïn arriveront à moi. » Mais le Prophète (ﷺ) est décédé avant que l’argent n’arrive. (Quand il est arrivé) Abu Bakr a ordonné qu’on annonce que quiconque avait une créance sur le Prophète (ﷺ) ou à qui il avait promis quelque chose devait venir voir Abu Bakr. Je suis allé voir Abu Bakr et je lui ai dit que le Prophète (ﷺ) m’avait promis de me donner autant. Abu Bakr m’a alors donné trois poignées (d’argent)",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Al Munkadir] dia mendengar [Jabir radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam berkata, kepadaku: \"Seandainya tiba kepada kita harta dari negeri Bahrain aku pasti memberikan kepadamu sekian\". Beliau mengucapkannya tiga kali. Dan harta Bahrain itu belum juga datang hingga Nabi shallallahu 'alaihi wasallam keburu wafat. Kemudian (Setelah harta datang) Abu Bakar memanggil penyeru lalu berkata: \"Siapa yang kepadanya Nabi shallallahu 'alaihi wasallam pernah berjanji atau mempunyai hutang hendaklah datang kepada kami\". Maka aku datangi dia dan aku katakana; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam pernah menjanjikan aku\". Maka Abu Bakar memberiku sebanyak tiga tangkup (ukuran dua belah telapak tangan)",
          "tr": "Cabir b. Abdullah r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem bana iki avucunu üç defa göstererek \"Bahreyn malı gelirse sana şu kadar (dünyalık mal) vereceğim\" buyurdu. Nebi Sallallahu Aleyhi ve Sellem vefat edinceye kadar Bahreyn malı gelmedi. Mal gelince Ebu Bekir tellala duyuru yaptırdı ve \"Hz. Nebi kime ne söz vermiş veya kime borcu varsa gelsin\" dedi. Ebu Bekir'in yanına geldim ve \"Hz. Nebi bana söz vermişti\" dedim. Bunun üzerine bana üç avuç dolusu mal verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 32
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 2599,
      "arabicNumber": 2599,
      "book": 51,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ ـ رضى الله عنهما ـ قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَقْبِيَةً، وَلَمْ يُعْطِ مَخْرَمَةَ مِنْهَا شَيْئًا، فَقَالَ مَخْرَمَةُ يَا بُنَىَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَانْطَلَقْتُ مَعَهُ، فَقَالَ ادْخُلْ فَادْعُهُ لِي‏.‏ قَالَ فَدَعَوْتُهُ لَهُ فَخَرَجَ إِلَيْهِ، وَعَلَيْهِ قَبَاءٌ مِنْهَا، فَقَالَ ‏ \"‏ خَبَأْنَا هَذَا لَكَ ‏\"‏‏.‏ قَالَ فَنَظَرَ إِلَيْهِ، فَقَالَ رَضِيَ مَخْرَمَةُ‏.‏",
        "translations": {
          "en": "Narrated Al-Miswar bin Makhrama:Allah's Messenger (ﷺ) distributed some cloaks but did not give anything thereof to Makhrama. Makhrama said (to me), \"O son! accompany me to Allah's Messenger (ﷺ).\" When I went with him, he said, \"Call him to me.\" I called him (i.e. the Prophet (ﷺ) ) for my father. He came out wearing one of those cloaks and said, \"We kept this (cloak) for you, (Makhrama).\" Makhrama looked at the cloak and said, \"Makhrama is pleased,\" (or the Prophet (ﷺ) said), \"Is Makhrama pleased?",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا ابن ابی ملیکہ سے اور وہ مسور بن مخرمہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے چند قبائیں تقسیم کیں اور مخرمہ رضی اللہ عنہ کو اس میں سے ایک بھی نہیں دی۔ انہوں نے ( مجھ سے ) کہا، بیٹے چلو، رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں چلیں۔ میں ان کے ساتھ چلا۔ پھر انہوں نے کہا کہ اندر جاؤ اور نبی کریم صلی اللہ علیہ وسلم سے عرض کرو کہ میں آپ کا منتظر کھڑا ہوا ہوں، چنانچہ میں اندر گیا اور نبی کریم صلی اللہ علیہ وسلم کو بلا لایا۔ آپ صلی اللہ علیہ وسلم اس وقت انہیں قباؤں میں سے ایک قباء پہنے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے یہ تمہارے لیے چھپا رکھی تھی، لو اب یہ تمہاری ہے۔ مسور نے بیان کیا کہ ( میرے والد ) مخرمہ رضی اللہ عنہ نے قباء کی طرف دیکھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”مخرمہ! خوش ہو یا نہیں؟“",
          "fr": "Rapporté par Al-Miswar bin Makhrama : Le Messager d’Allah (ﷺ) a distribué des manteaux mais n’en a pas donné à Makhrama. Makhrama m’a dit : « Ô mon fils ! Accompagne-moi chez le Messager d’Allah (ﷺ). » J’y suis allé avec lui, il a dit : « Appelle-le pour moi. » Je l’ai appelé (le Prophète (ﷺ)) pour mon père. Il est sorti en portant un de ces manteaux et a dit : « Nous avons gardé celui-ci (le manteau) pour toi, (Makhrama). » Makhrama a regardé le manteau et a dit : « Makhrama est content, » (ou le Prophète (ﷺ) a dit) : « Makhrama est-il content ? »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Abi Mulaikah] dari [Al Miswar bin Makhramah radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam membagi-bagikan pakaian (rida') namun Beliau tidak memberi satupun kepada Makhramah. Maka Makhramah berkata: \"Wahai anakku marilah kita menemui Rasulullah shallallahu 'alaihi wasallam\". Maka aku berangkat bersamanya lalu dia berkata: \"Masuk dan mintakanlah untukku\". Dia berkata: \"Maka aku pintakan untuknya lalu Beliau keluar menemuinya dengan membawa rida' lalu berkata: \"Kami sengaja menyimpan ini untukmu\". Dia (Al Miswar) berkata: \"Bapakku memandangnya lalu berkata, Makhramah telah ridho'?",
          "tr": "Misver b. Mahreme r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem birkaç kaftan dağıtmıştı ama Mahreme'ye bir şey vermemişti. Mahreme \"Oğlum! Hadi Allah Resulü'nün yanına gidelim\" dedi. Birlikte gittik. \"İçeri gir de, Hz. Nebi'e dışarı çıkmasını arz et\" dedi. Ben de Hz. Nebi'i babamın yanına çağırdım. Nebi Sallallahu Aleyhi ve Sellem üzerinde bir kaftanla dışarı çıkarak: \"Bunu senin için sakladık\" buyurdu. Mahreme kaftana baktı. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Mahreme memnun oldu mu?\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 33
      },
      "narrator": {
        "en": "Al-Miswar bin Makhrama"
      }
    },
    {
      "hadithNumber": 2600,
      "arabicNumber": 2600,
      "book": 51,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ هَلَكْتُ‏.‏ فَقَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالَ وَقَعْتُ بِأَهْلِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ تَجِدُ رَقَبَةً ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَتَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ بِعَرَقٍ ـ وَالْعَرَقُ الْمِكْتَلُ ـ فِيهِ تَمْرٌ فَقَالَ ‏\"‏ اذْهَبْ بِهَذَا فَتَصَدَّقْ بِهِ ‏\"‏‏.‏ قَالَ عَلَى أَحْوَجَ مِنَّا يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ مِنَّا‏.‏ قَالَ ‏\"‏ اذْهَبْ فَأَطْعِمْهُ أَهْلَكَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:A man came to Allah's Messenger (ﷺ) and said, \"I am ruined.\" The Prophet (ﷺ) asked, \"What do you mean?\" He said, \"I had a sexual intercourse with my wife during Ramadan (while fasting).\" The Prophet (ﷺ) asked him, \"Can you manumit a slave?\" He replied in the negative. He then asked him, \"Can you fast for two successive months continuously\" He replied in the negative. The Prophet (ﷺ) then asked him, \"Can you feed sixty poor persons?\" He replied in the negative. In the meantime an Ansari came with a basket full of dates. The Prophet (ﷺ) said to the man, \"Take it and give it in charity (as an expiation of your sin).\" The man said \"Should I give it to some people who are poorer than we O Allah's Messenger (ﷺ)? By Him Who has sent you with the Truth, there is no family between Medina's two mountains poorer than we.\" Allah's Messenger (ﷺ) told him to take it and provide his family with it",
          "ur": "ہم سے محمد بن محبوب نے بیان کیا، کہا ہم سے عبدالواحد بن زیادہ نے بیان کیا، کہا ہم سے معمر نے بیان کیا زہری سے، وہ حمید بن عبدالرحمٰن سے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ایک دیہاتی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہنے لگا کہ میں تو ہلاک ہو گیا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”کیا بات ہوئی؟“ عرض کیا کہ رمضان میں میں نے اپنی بیوی سے ہمبستری کر لی ہے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”تمہارے پاس کوئی غلام ہے؟“ کہا کہ نہیں۔ پھر دریافت فرمایا ”کیا دو مہینے پے در پے روزے رکھ سکتے ہو؟“ کہا کہ نہیں۔ پھر دریافت فرمایا ”کیا ساٹھ مسکینوں کو کھانا دے سکتے ہو؟“ اس پر بھی جواب تھا کہ نہیں۔ بیان کیا کہ اتنے میں ایک انصاری عرق لائے۔ ( عرق کھجور کے پتوں کا بنا ہوا ایک ٹوکرا ہوتا تھا جس میں کھجور رکھی جاتی تھی ) آپ صلی اللہ علیہ وسلم نے اس سے فرمایا ”اسے لے جا اور صدقہ کر دے“ انہوں نے عرض کیا، یا رسول اللہ! کیا اپنے سے زیادہ ضرورت مند پر صدقہ کر دوں؟ اور اس ذات کی قسم! جس نے آپ کو حق کے ساتھ بھیجا ہے کہ سارے مدینے میں ہم سے زیادہ محتاج اور کوئی گھرانہ نہیں ہو گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”پھر جا، اپنے ہی گھر والوں کو کھلا دے۔“",
          "fr": "Rapporté par Abu Huraira : Un homme est venu voir le Messager d’Allah (ﷺ) et a dit : « Je suis perdu. » Le Prophète (ﷺ) lui a demandé : « Que veux-tu dire ? » Il a répondu : « J’ai eu un rapport avec ma femme pendant le Ramadan (en jeûnant). » Le Prophète (ﷺ) lui a demandé : « Peux-tu affranchir un esclave ? » Il a répondu non. Il lui a alors demandé : « Peux-tu jeûner deux mois d’affilée ? » Il a répondu non. Le Prophète (ﷺ) lui a alors demandé : « Peux-tu nourrir soixante pauvres ? » Il a répondu non. À ce moment-là, un Ansari est venu avec un panier rempli de dattes. Le Prophète (ﷺ) a dit à l’homme : « Prends-le et donne-le en aumône (pour expier ton péché). » L’homme a dit : « Dois-je le donner à des gens plus pauvres que nous, ô Messager d’Allah (ﷺ) ? Par Celui qui t’a envoyé avec la Vérité, il n’y a pas de famille entre les deux montagnes de Médine plus pauvre que la nôtre. » Le Messager d’Allah (ﷺ) lui a dit de le prendre et d’en nourrir sa famille",
          "id": "Telah menceritakan kepada kami [Muhammad bin Mahbub] telah menceritakan kepada kami ['Abdul Wahid] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhriy] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah radliallahu 'anhu] berkata: Ada seorang laki-laki datang kepada Sahabat dan berkata: \"Celaka aku\". Maka Beliau bertanya: \"Kenapa?\" Orang itu menjawab: \"Aku berhubungan dengan isteriku di bulan Ramadhan\". Beliau bertanya: \"Apakah kamu punya budak?\" Orang itu menjawab: \"Tidak\". Beliau bertaya lagi: \"Apakah kamu sanggup berpuasa dua bulan berturut-turut?\" Orang itu menjawab: \"Tidak\". Beliau bertaya lagi: \"Apakah kamu sanggup memberi makan enam puluh orang miskin?\" Orang itu menjawab: \"Tidak\". Abu Hurairah radliallahu 'anhu berkata: \"Lalu datang seseorang dari kalangan Anshar dengan membawa karung besar yang penuh berisi kurma, lalu Beliau berkata: \"Pegilah dengan kurma ini dan shadaqahkanlah\". Orang itu berkata: \"Untuk orang yang lebih membutuhkan dari pada kami wahai Rasulullah?. Demi Dzat Yang mengutus anda dengan haq, tidak ada diantara penduduk yang keluarganya lebih membutuhkan dibandingkan kami\". Maka Beliau berkata: \"Pulanglah kamu dan berilah untuk makan keluargamu",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Birisi Allah Resulü Sallallahu Aleyhi ve Sellem'e gelerek: \"Ben mahvoldum\" dedi.Nebi Sallallahu Aleyhi ve Sellem: \"Hayırdır! Nevardı?\" buyurdu. \"Ramazan ayında eşimle cinsel ilişkiye girdim\" dedi. Nebi (Sallallahu aleyhi ve Sellem): \"Azad edebileceğin bir kölen var mı?\" diye sordu. Adam \"Hayır\" dedi. \"İki ay aralıksız oruç tutabilir misin?\" diye sordu. Adam \"Hayır\" dedi. \"Peki altmışfakiri doyurabilir misin?\" diye sordu. Adam \"Hayır\" dedi. Bu sırada ensardan biri bir sepet hurma getirdi. Nebi Sallallahu Aleyhi ve Sellem \"Bari bunu al götür birine sadaka ver\" buyurdu. Adam: \"Bizden daha muhtaç birine mi, Ey Allah'ın Resulü! Seni Hak Nebi olarak gönderene yemin ederim ki, şu Medine'de bizden daha fakir bir aile yoktur\" buyurdu. Bunun üzerine Hz. Nebi (Sallallahu aleyhi ve Sellem) \"Bari bunu götür de ailene yedir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 34
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2601,
      "arabicNumber": 2601,
      "book": 51,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ أَبَاهُ قُتِلَ يَوْمَ أُحُدٍ شَهِيدًا، فَاشْتَدَّ الْغُرَمَاءُ فِي حُقُوقِهِمْ، فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَلَّمْتُهُ، فَسَأَلَهُمْ أَنْ يَقْبَلُوا ثَمَرَ حَائِطِي، وَيُحَلِّلُوا أَبِي، فَأَبَوْا، فَلَمْ يُعْطِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم حَائِطِي، وَلَمْ يَكْسِرْهُ لَهُمْ، وَلَكِنْ قَالَ ‏\"‏ سَأَغْدُو عَلَيْكَ ‏\"‏‏.‏ فَغَدَا عَلَيْنَا حَتَّى أَصْبَحَ، فَطَافَ فِي النَّخْلِ، وَدَعَا فِي ثَمَرِهِ بِالْبَرَكَةِ، فَجَدَدْتُهَا، فَقَضَيْتُهُمْ حُقُوقَهُمْ، وَبَقِيَ لَنَا مِنْ ثَمَرِهَا بَقِيَّةٌ، ثُمَّ جِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ جَالِسٌ، فَأَخْبَرْتُهُ بِذَلِكَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعُمَرَ ‏\"‏ اسْمَعْ ـ وَهْوَ جَالِسٌ ـ يَا عُمَرُ ‏\"‏‏.‏ فَقَالَ أَلاَّ يَكُونُ قَدْ عَلِمْنَا أَنَّكَ رَسُولُ اللَّهِ، وَاللَّهِ إِنَّكَ لَرَسُولُ اللَّهِ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:My father was martyred on the day (of the battle) of Uhud and his creditors demanded the debt back in a harsh manner. So I went to Allah's Messenger (ﷺ) and informed him of that, he asked them to accept the fruits of my garden and excuse my father, but they refused. So, Allah's Messenger (ﷺ) did not give them the fruits, nor did he cut them and distribute them among them, but said, \"I will come to you tomorrow morning.\" So, he came to us the next morning and walked about in between the date-palms and invoked Allah to bless their fruits. I plucked the fruits and gave back all the rights of the creditors in full, and a lot of fruits were left for us. Then I went to Allah's Messenger (ﷺ), who was sitting, and informed him about what happened. Allah's Messenger (ﷺ) told `Umar, who was sitting there, to listen to the story. `Umar said, \"Don't we know that you are Allah's Messenger (ﷺ)? By Allah! you are Allah's Messenger (ﷺ)",
          "ur": "ہم سے عبدان نے بیان کیا، کہا کہ ہم کو عبداللہ نے خبر دی، انہیں یونس نے خبر دی اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ابن شہاب سے، وہ ابن کعب بن مالک سے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ احد کی لڑائی میں ان کے باپ شہید ہو گئے ( اور قرض چھوڑ گئے ) قرض خواہوں نے تقاضے میں بڑی شدت کی، تو میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے اس سلسلے میں گفتگو کی، آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ وہ میرے باغ کی کھجور لے لیں ( جو بھی ہوں ) اور میرے والد کو ( جو باقی رہ جائے وہ قرض ) معاف کر دیں۔ لیکن انہوں نے انکار کیا۔ پھر آپ صلی اللہ علیہ وسلم نے میرا باغ انہیں نہیں دیا اور نہ ان کے لیے پھل تڑوائے۔ بلکہ فرمایا کہ کل صبح میں تمہارے یہاں آؤں گا۔ صبح کے وقت آپ صلی اللہ علیہ وسلم تشریف لائے اور کھجور کے درختوں میں ٹہلتے رہے اور برکت کی دعا فرماتے رہے پھر میں نے پھل توڑ کر قرض خواہوں کے سارے قرض ادا کر دئیے اور میرے پاس کھجور بچ بھی گئی۔ اس کے بعد میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے۔ میں نے آپ صلی اللہ علیہ وسلم کو واقعہ کی اطلاع دی۔ عمر رضی اللہ عنہ بھی وہیں بیٹھے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا، عمر! سن رہے ہو؟ عمر رضی اللہ عنہ نے عرض کیا، ہمیں تو پہلے سے معلوم ہے کہ آپ اللہ کے سچے رسول ہیں۔ قسم اللہ کی! اس میں کسی شک و شبہ کی گنجائش ہی نہیں کہ آپ اللہ کے سچے رسول ہیں۔",
          "fr": "Rapporté par Jabir bin `Abdullah : Mon père a été tué le jour (de la bataille) d’Uhud et ses créanciers ont réclamé leur dû de façon dure. Je suis donc allé voir le Messager d’Allah (ﷺ) et je l’en ai informé. Il leur a demandé d’accepter les fruits de mon verger et d’excuser mon père, mais ils ont refusé. Le Messager d’Allah (ﷺ) ne leur a donc pas donné les fruits, ni coupé et distribué ceux-ci, mais a dit : « Je viendrai vous voir demain matin. » Il est donc venu le lendemain matin, a marché entre les palmiers et a invoqué Allah pour qu’Il bénisse leurs fruits. J’ai cueilli les fruits et j’ai remboursé toutes les dettes des créanciers, et il nous en est resté beaucoup. Puis je suis allé voir le Messager d’Allah (ﷺ), qui était assis, et je lui ai raconté ce qui s’était passé. Le Messager d’Allah (ﷺ) a dit à `Umar, qui était là, d’écouter l’histoire. `Umar a dit : « Ne savons-nous pas que tu es le Messager d’Allah (ﷺ) ? Par Allah ! Tu es le Messager d’Allah (ﷺ). »",
          "id": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Yunus] dan berkata, [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] berkata, telah menceritakan kepadaku [Ibnu Ka'ab bin Malik] bahwa [Jabir bin 'Abdullah radliallahu 'anhuma] mengabarkan kepadanya bahwa bapaknya terbunuh sebagai syahid dalam perang Uhud lalu orang-orang yang mempunyai piutang datang, mereka mendesak meminta pelunasan hak-hak mereka, maka aku menemui Rasulullah shallallahu 'alaihi wasallam lalu aku berbicara dengan Beliau, lalu Beliau meminta kepada mereka untuk mau menerima buah-buahan dari kebunku dan agar mereka membebaskan beban hutang bapakku namun mereka tidak mau dan Rasulullah shallallahu 'alaihi wasallam tidak memberikan kebunku dan juga tidak membagi-bagikannya kepada mereka seraya berkata: \"Aku akan datang besok pagi kepadamu\". Maka Beliau datang kepada kami pagi-pagi lalu Beliau mengelilingi pepohonan kurma lalu berdo'a untuk keberkahan buah-buahnya. Maka aku memetik buah-buah kurma tersebut, aku lunasi hak-hak mereka dan masih ada tersisa untuk kami buah-buah kurma tersebut, lalu aku temui Rasulullah shallallahu 'alaihi wasallam ketika Beliau sedang duduk, lalu aku beritahukan kejadian tadi maka Rasulullah shallallahu 'alaihi wasallam berkata kepada 'Umar: \"Dengan wahai 'Umar\", sementara 'Umar dalam keadaan duduk. Maka 'Umar berkata: \"Peristiwa ini membuktikan bahwa kami mengetahui bahwa anda adalah Rasululoh. Demi Allah, anda adalah Rasulullah",
          "tr": "Cabir b. Abdullah r.a.'dan rivayet edilmiştir: Babam Uhud savaşında şehit edilmişti. Alacaklılar alacaklarını almak için kapıma dayandılar. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem'e giderek durumu arzettim. Hz. Nebi onlardan bahçemdeki ürünümü almalarını ve haklarını helal etmelerini istedi. Ama alacaklarını almak konusunda direttiler. Bunun üzerine Nebi (Sallallahu aleyhi ve Sellem) onlara bir şey vermedi ve bahçemden hiçbir ürünü kesmedi. Fakat bana: \"Yarın senin yanına geleceğim inşallah\" buyurdu. Ertesi sabah evimize geldi. Hurmalıkta dolaştı ve ürünün artması için dua buyurdu. Bunun üzerine ben ürünü topladım. Bu üründen herkesin alacağını ödediğim gibi, bize de bir miktar ürün kaldı. Sonra Hz. Nebi'in huzuruna gittim, oturuyordu. Durumu ona bildirdim. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem Ömer'e \"Ömer! Bunu duy!\" buyurdu. Ömer de: \"Biz senin Allah'ın Resulü olduğunu zaten bilmiyor muyduk? Allah'a yemin ederim ki sen Allah'ın Resulüsün\" dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 35
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 2602,
      "arabicNumber": 2602,
      "book": 51,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ فَشَرِبَ، وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ فَقَالَ لِلْغُلاَمِ ‏ \"‏ إِنْ أَذِنْتَ لِي أَعْطَيْتُ هَؤُلاَءِ ‏\"‏‏.‏ فَقَالَ مَا كُنْتُ لأُوثِرَ بِنَصِيبِي مِنْكَ يَا رَسُولَ اللَّهِ أَحَدًا‏.‏ فَتَلَّهُ فِي يَدِهِ‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Sa`d:A drink (milk mixed with water) was brought to the Prophet (ﷺ) who drank some of it while a boy was sitting on his right and old men on his left. The Prophet (ﷺ) said to the boy, \"If you permit me, I'll give (the rest of the drink to) these old men first.\" The boy said, \"I will not give preference to any one over me as regards my share from you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) then put that container in the boy's hand. (See Hadith No)",
          "ur": "ہم سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے امام مالک نے، وہ ابوحازم سے، وہ سہل بن سعد رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پینے کو کچھ لایا، ( دودھ یا پانی ) آپ صلی اللہ علیہ وسلم نے اسے نوش فرمایا، آپ صلی اللہ علیہ وسلم کے دائیں طرف ایک بچہ بیٹھا تھا اور بڑے بوڑھے لوگ بائیں طرف بیٹھے ہوئے تھے، آپ صلی اللہ علیہ وسلم نے اس بچے سے فرمایا کہ اگر تو اجازت دے ( تو بچا ہوا پانی ) میں ان بڑے لوگوں کو دے دوں؟ لیکن اس نے کہا۔ یا رسول اللہ! آپ کے جوٹھے میں سے ملنے والے کسی حصہ کا میں ایثار نہیں کر سکتا۔ آپ صلی اللہ علیہ وسلم نے پیالہ جھٹکے کے ساتھ اسی کی طرف بڑھا دیا۔",
          "fr": "Rapporté par Sahl bin Sa`d : On a apporté une boisson (lait mélangé à de l’eau) au Prophète (ﷺ) qui en a bu un peu alors qu’un garçon était assis à sa droite et des personnes âgées à sa gauche. Le Prophète (ﷺ) a dit au garçon : « Si tu me permets, je donnerai (le reste de la boisson à) ces personnes âgées en premier. » Le garçon a dit : « Je ne donnerai la priorité à personne sur ma part venant de toi, ô Messager d’Allah (ﷺ) ! » Le Prophète (ﷺ) a alors mis le récipient dans la main du garçon",
          "id": "Telah menceritakan kepadaku [Yahya bin Qaza'ah] telah menceritakan kepada kami [Malik] dari [Abu Hazim] dari [Sahal bin Sa'ad radliallahu 'anhu] bahwa, Nabi shallallahu 'alaihi wasallam diberi suguhan minuman, Beliau meminumnya sementara disamping kanan Beliau ada seorang anak kecil sedangkan di sebelah kiri Beliau ada orang-orang tua. Beliau berkata kepada anak kecil itu: \"Jika kamu izinkan, aku akan berikan kepada mereka\". Anak kecil itu berkata: \"Aku tidak lebih mementingkan seorangpun selain anda\". Maka Beliau memberikan apa yang di tangan Beliau kepadanya",
          "tr": "Sehl b. Sa'd r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e bir içecek getirildi ve onu içti. Sağında bir delikanlı, solunda da yaşlı başlı kimseler vardı. Delikanlıya: \"Müsaade edersen önce yaşlılara vereyim\" buyurdu. Delikanlı \"Ey Allah'ın Resulü! Ben senden gelecek nasibimin kimseye gitmesini istemem\" deyince Hz. Nebi içeceği çocuğun eline verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 36
      },
      "narrator": {
        "en": "Sahl bin Sa`d"
      }
    },
    {
      "hadithNumber": 2603,
      "arabicNumber": 2603,
      "book": 51,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا ثَابِتٌ حَدَّثَنَا مِسْعَرٌ عَنْ مُحَارِبٍ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَقَضَانِي وَزَادَنِي",
        "translations": {
          "en": "Jabir (ra) said, \"I went to the Prophet (ﷺ) in the mosque and he paid me my right and gave me more than he owed me",
          "ur": "اور ثابت بن محمد نے بیان کیا کہ ہم سے مسعر نے بیان کیا، ان سے محارب نے اور ان سے جابر رضی اللہ عنہ نے کہ اور ثابت بن محمد نے بیان کیا کہ ہم سے مسعر نے بیان کیا، ان سے محارب نے اور ان سے جابر رضی اللہ عنہ نے کہ",
          "fr": "Rapporté par Jabir (ra) : « Je suis allé voir le Prophète (ﷺ) à la mosquée, il m’a rendu ce qu’il me devait et m’a donné plus que ce qu’il me devait. »",
          "id": "Telah menceritakan kepada kami [Tsabit] telah menceritakan kepada kami [Mis'ar] dari [Muharib] dari [Jabir radliallahu 'anhu] berkata: \"Aku menemui Nabi shallallahu 'alaihi wasallam saat Beliau berada di masjid, lalu Beliau membayar hutangnya kepadaku dan memberi lebih kepadaku",
          "tr": "Cabir r.a.'den rivayet edilmiştir: Mescidde iken Hz. Nebi'in yanına gelmiştim. Bana alacağımı fazlasıyla ödedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 37
      }
    },
    {
      "hadithNumber": 2604,
      "arabicNumber": 2604,
      "book": 51,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ بِعْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم بَعِيرًا فِي سَفَرٍ، فَلَمَّا أَتَيْنَا الْمَدِينَةَ قَالَ ‏ \"‏ ائْتِ الْمَسْجِدَ فَصَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏ فَوَزَنَ ـ قَالَ شُعْبَةُ أُرَاهُ فَوَزَنَ لِي فَأَرْجَحَ، فَمَا زَالَ مِنْهَا شَىْءٌ حَتَّى أَصَابَهَا أَهْلُ الشَّأْمِ يَوْمَ الْحَرَّةِ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:I sold a camel to the Prophet (ﷺ) on one of the journeys. When we reached Medina, he ordered me to go to the Mosque and offer two rak`at. Then he weighed for me (the price of the camel in gold) and gave an extra amount over it. A part of it remained with me till it was taken by the army of Sham on the day of Harra",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا محارب بن دثار سے اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، آپ فرماتے تھے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو سفر میں ایک اونٹ بیچا تھا۔ جب ہم مدینہ پہنچے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مسجد میں جا کر دو رکعت نماز پڑھ، پھر آپ صلی اللہ علیہ وسلم نے وزن کیا۔ شعبہ نے بیان کیا، میرا خیال ہے کہ ( جابر رضی اللہ عنہ نے کہا ) میرے لیے وزن کیا ( آپ صلی اللہ علیہ وسلم کے حکم سے بلال رضی اللہ عنہ نے ) اور ( اس پلڑے کو جس میں سکہ تھا ) جھکا دیا۔ ( تاکہ مجھے زیادہ ملے ) اس میں سے کچھ تھوڑا سا میرے پاس جب سے محفوظ تھا۔ لیکن شام والے ( اموی لشکر ) یوم حرہ کے موقع پر مجھ سے چھین کر لے گئے۔",
          "fr": "Rapporté par Jabir bin `Abdullah : J’ai vendu un chameau au Prophète (ﷺ) lors d’un de ses voyages. Quand nous sommes arrivés à Médine, il m’a ordonné d’aller à la mosquée et d’y prier deux rak`at. Ensuite, il m’a pesé (le prix du chameau en or) et m’a donné un supplément. Une partie de cet argent est restée avec moi jusqu’à ce qu’il soit pris par l’armée du Sham le jour de Harra",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Muharib] aku medengar [Jabir bin 'Abdullah radliallahu 'anhuma] berkata: \"Aku menjual seekor unta kepada Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan. Ketika kami sudah sampai di Madinah, Beliau berkata; \"Datanglah ke masjid dan shalatlah dua raka'at\". Lalu Beliau menimbang\". Syu'bah berkata: \"Aku kira dia berkata; Lalu Beliau menimbang untukku\". Maka Beliau memberi lebih untukku sehingga masih terus ada kelebihan itu hingga kmai menghadapi bangsa Romawi dalam perang sulit di musim panas",
          "tr": "Cabir r.a.'den rivayet edilmiştir: Bir yolculukta Hz. Nebi (Sallallahu aleyhi ve Sellem)'e bir deve satmıştım. Medine'ye vardığımızda Hz. Nebi Sallallahu Aleyhi ve Sellem bana \"Mescide gir de iki rekat namaz kıl\" buyurdu ve o sırada tarttı. Şu'be şöyle demiştir: \"Benim için tarttı ve ağdırdı. O dirhemler, Şam halkı Hane savaşında onları elde edinceye kadar bende kaldı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 38
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 2605,
      "arabicNumber": 2605,
      "book": 51,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ، وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ أَشْيَاخٌ، فَقَالَ لِلْغُلاَمِ ‏ \"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏‏.‏ فَقَالَ الْغُلاَمُ لاَ، وَاللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا‏.‏ فَتَلَّهُ فِي يَدِهِ‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Sa`d:A drink (of milk and water) was brought to Allah's Messenger (ﷺ) while a boy was sitting on his right side and old men were sitting on his left side. He asked the boy, \"Will you allow me to give it to these (people)?\" The boy said, \"No, by Allah, I will not allow anyone to take my right from you.\" Then the Prophet put the bowl in the boy's hand",
          "ur": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے امام مالک نے ابوحازم سے، وہ سہل بن سعد رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں کچھ پینے کو لایا گیا۔ آپ صلی اللہ علیہ وسلم کی دائیں طرف ایک بچہ تھا اور قوم کے بڑے لوگ بائیں طرف تھے۔ آپ صلی اللہ علیہ وسلم نے بچے سے فرمایا کہ کیا تمہاری طرف سے اس کی اجازت ہے کہ میں بچا ہوا پانی ان بزرگوں کو دے دوں؟ تو اس بچے نے کہا کہ نہیں قسم اللہ کی! میں آپ سے ملنے والے اپنے حصہ کا ہرگز ایثار نہیں کر سکتا۔ پھر آپ صلی اللہ علیہ وسلم نے مشروب ان کی طرف جھٹکے کے ساتھ بڑھا دیا۔",
          "fr": "Rapporté par Sahl bin Sa`d : On a apporté une boisson (lait et eau) au Messager d’Allah (ﷺ) alors qu’un garçon était assis à sa droite et des personnes âgées à sa gauche. Il a demandé au garçon : « Me permets-tu de la donner à ces personnes ? » Le garçon a dit : « Non, par Allah, je ne laisserai personne prendre mon droit venant de toi. » Alors le Prophète a mis le bol dans la main du garçon",
          "id": "Telah menceritakan kepada kami [Qutaibah] dari [Malik] dari [Abu Hazim] dari [Sahal bin Sa'ad radliallahu 'anhu] bahwa, Rasulullah shallallahu 'alaihi wasallam diberi suguhan minuman sementara disamping kanan Beliau ada seorang anak kecil sedangkan di sebelah kiri Beliau ada para orang-orang tua. Maka Beliau berkata kepada anak kecil itu: \"Apakah kamu mengizinkan aku untuk aku berikan minuman ini kepada mereka?\". Anak kecil itu berkata: \"Tidak wahai Rasulullah, Aku tidak lebih mementingkan terhadap seorangpun selain anda\". Maka Beliau memberikan apa yang di tangan Beliau kepadanya",
          "tr": "Sehl b. Sa'd'dan rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem'e bir içecek getirilmişti. Sağında bir genç, solunda birkaç yaşlı oturuyordu. Nebi Sallallahu Aleyhi ve Sellem gence: \"İçeceği önce bunlara vermeme izin verir misin?\" buyurdu. Genç \"Vallahi, hayır. Senden gelen nasibimi kimseyle değişmem\" deyince Hz. Nebi içeceği çocuğun eline verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 39
      },
      "narrator": {
        "en": "Sahl bin Sa`d"
      }
    },
    {
      "hadithNumber": 2606,
      "arabicNumber": 2606,
      "book": 51,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ جَبَلَةَ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ لِرَجُلٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم دَيْنٌ فَهَمَّ بِهِ أَصْحَابُهُ، فَقَالَ ‏\"‏ دَعُوهُ فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً‏.‏ وَقَالَ اشْتَرُوا لَهُ سِنًّا فَأَعْطُوهَا إِيَّاهُ ‏\"‏‏.‏ فَقَالُوا إِنَّا لاَ نَجِدُ سِنًّا إِلاَّ سِنًّا هِيَ أَفْضَلُ مِنْ سِنِّهِ‏.‏ قَالَ ‏\"‏ فَاشْتَرُوهَا فَأَعْطُوهَا إِيَّاهُ، فَإِنَّ مِنْ خَيْرِكُمْ أَحْسَنَكُمْ قَضَاءً ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) owed a man some debt (and that man demanded it very harshly). The companions of the Prophet (ﷺ) wanted to harm him, but the Prophet (ﷺ) said to them, \"Leave him, as the creditor has the right to speak harshly.\" He then added, \"Buy (a camel) of the same age and give it to him.\" They said, \"We cannot get except a camel of an older age than that of his.\" He said, \"Buy it and give it to him, as the best amongst you is he who pays back his debt in the most handsome way",
          "ur": "ہم سے عبداللہ بن عثمان بن جبلہ نے بیان کیا، انہوں نے کہا کہ مجھے میرے باپ نے خبر دی شعبہ سے، ان سے سلمہ نے بیان کیا کہ میں نے ابوسلمہ سے سنا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ ایک شخص کا رسول اللہ صلی اللہ علیہ وسلم پر قرض تھا ( اس نے سختی کے ساتھ تقاضا کیا ) تو صحابہ اس کی طرف بڑھے۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا اسے چھوڑ دو، حق والے کو کچھ نہ کچھ کہنے کی گنجائش ہوتی ہی ہے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے لیے ایک اونٹ اسی کے اونٹ کی عمر کا خرید کر اسے دے دو۔ صحابہ نے عرض کیا کہ اس سے اچھی عمر کا ہی اونٹ مل رہا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسی کو خرید کر دے دو کہ تم میں سب سے اچھا آدمی وہ ہے جو قرض کے ادا کرنے میں سب سے اچھا ہو۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) devait de l’argent à un homme (et cet homme le lui a réclamé très durement). Les compagnons du Prophète (ﷺ) ont voulu le repousser, mais le Prophète (ﷺ) leur a dit : « Laissez-le, car le créancier a le droit de parler durement. » Il a ajouté : « Achetez (un chameau) du même âge et donnez-le-lui. » Ils ont dit : « Nous ne trouvons qu’un chameau plus âgé que le sien. » Il a dit : « Achetez-le et donnez-le-lui, car le meilleur d’entre vous est celui qui rembourse ses dettes de la meilleure façon. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin 'Utsman bin Jabalah] berkata, telah menceritakan kepadaku [bapakku] dari [Syu'bah] dari [Salamah] berkata, aku mendengar [Abu Salamah] dari [Abu Hurairah radliallahu 'anhu] berkata; Ada seorang laki-laki yang kepadanya Rasulullah shallallahu 'alaihi wasallam mempunyai hutang lalu para sahabat ingin (memberina pelajaran) namun Beliau berkata: \"Biarkanlah dia, karena bagi pemegang kebenaran berhak menyatakan kebenarannya\". Lalu Beliau berkata: \"Belilah satu ekor anak unta lalu berikanlah kepadanya\". Orang-orang berkata: \"Kami tidak mendapatkan anak unta yang dimaksud melainkan ada seekor anak unta yang umurnya lebih\". Beliau berkata: \"Beli dan berikanlah kepadanya karena sesungguhnya yang terbaik diantara kalian adalah siapa yang paling baik menunaikan janji",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Birinin Allah Resulü Sallallahu Aleyhi ve Sellem'de bir (deve) alacağı vardı. (Gelip alacağını kaba bir üslupla istedi). Bunun üzerine sahabe onu dövmeye yeltendi. Nebi Sallallahu Aleyhi ve Sellem: \"Onu bırakın. Alacaklının söz söyleme hakkı vardır. (Alacağı ile yaşıt) bir deve satın alıp ona verin\" buyurdu. Sahabe \"Ancak onun devesinden daha yaşlı (ve dolayısıyla değerli) deve bulabiliyoruz\" dediler. Hz. Nebi (Sallallahu aleyhi ve Sellem): \"Tamam onu satın alıp ona verin. Çünkü sizin en hayırlınız borcunu fazlasıyla ve en güzel şekilde ödeyeninizdir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 40
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2607,
      "arabicNumber": 2607,
      "book": 51,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ فَقَالَ لَهُمْ ‏\"‏ مَعِي مَنْ تَرَوْنَ، وَأَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ، فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا السَّبْىَ وَإِمَّا الْمَالَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ ‏\"‏‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم انْتَظَرَهُمْ بِضْعَ عَشْرَةَ لَيْلَةً حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ فِي الْمُسْلِمِينَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَإِنَّ إِخْوَانَكُمْ هَؤُلاَءِ جَاءُونَا تَائِبِينَ، وَإِنِّي رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ طَيَّبْنَا يَا رَسُولَ اللَّهِ لَهُمْ‏.‏ فَقَالَ لَهُمْ ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ فِيهِ مِمَّنْ لَمْ يَأْذَنْ، فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، ثُمَّ رَجَعُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ طَيَّبُوا وَأَذِنُوا‏.‏ وَهَذَا الَّذِي بَلَغَنَا مِنْ سَبْىِ هَوَازِنَ هَذَا آخِرُ قَوْلِ الزُّهْرِيِّ، يَعْنِي فَهَذَا الَّذِي بَلَغَنَا‏.‏",
        "translations": {
          "en": "Narrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama:When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) they requested him to return their property and their captives. He said to them, \"This concerns also other people along with me as you see, and the best statement to me is the true one, so you may choose one of two alternatives; either the captives or the property and (I have not distributed the booty for) I have been waiting for you.\" When the Prophet (ﷺ) had returned from Ta'if, he waited for them for more than ten nights. When they came to know that the Prophet (ﷺ) would not return except one of the two, they chose their captives. The Prophet then stood up amongst the Muslims, Glorified and Praised Allah as He deserved, and then said, \"Then after: These brothers of yours have come to you with repentance and I see it proper to return their captives, so whoever amongst you likes to do that as a favor, then he can do it, and whoever of you wants to stick to his share till we pay him from the very first Fai (i.e. war booty) which Allah will give us, then he can do so.\" The people said, \"We return (the captives) to them willingly as a favor, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"I do not know who of you has given his consent and who has not; so go back and your leaders may present your decision to me.\" The people went away, and their leaders discussed the matter with them, and then came to the Prophet (ﷺ) to tell him that all of them had given their consent (to return the captives) willingly. (Az-Zuhri, the sub-narrator said, \"This is what we know about the captives of Hawazin)",
          "fr": "Rapporté par Marwan bin Al-Hakam et Al-Miswar bin Makhrama : Quand les délégués de la tribu de Hawazin sont venus voir le Prophète (ﷺ), ils lui ont demandé de leur rendre leurs biens et leurs prisonniers. Il leur a dit : « Cela concerne aussi d’autres personnes avec moi, comme vous le voyez, et la meilleure parole pour moi est la vérité. Vous pouvez donc choisir l’une des deux options : soit les prisonniers, soit les biens (et je n’ai pas encore distribué le butin car je vous attendais). » Quand le Prophète (ﷺ) est revenu de Ta’if, il les a attendus plus de dix nuits. Quand ils ont compris que le Prophète (ﷺ) ne rendrait qu’une seule des deux choses, ils ont choisi leurs prisonniers. Le Prophète s’est alors levé parmi les musulmans, a glorifié et loué Allah comme Il le mérite, puis a dit : « Ensuite : Ces frères à vous sont venus vers vous avec repentir et je pense qu’il est juste de leur rendre leurs prisonniers. Donc, celui d’entre vous qui veut le faire par générosité, qu’il le fasse, et celui qui veut garder sa part jusqu’à ce que nous le remboursions avec le premier butin que nous donnera Allah, qu’il le fasse aussi. » Les gens ont dit : « Nous leur rendons (les prisonniers) de bon cœur, ô Messager d’Allah (ﷺ) ! » Le Prophète (ﷺ) a dit : « Je ne sais pas qui d’entre vous a donné son accord et qui ne l’a pas fait ; alors retournez et que vos chefs me présentent votre décision. » Les gens sont partis, leurs chefs ont discuté avec eux, puis sont revenus dire au Prophète (ﷺ) qu’ils étaient tous d’accord pour rendre les prisonniers de bon cœur. (Az-Zuhn, le sous-narrateur, a dit : « Voilà ce que nous savons sur les prisonniers de Hawazin. »)",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['Urwah] bahwa [Marwan bin Al Hakam] dan [Al Miswar bin Makhramah] keduanya mengabarkan kepadanya, Nabi shallallahu 'alaihi wasallam didatangi oleh utusan suku Hawazin yang telah memeluk Islam lalu mereka meminta kepada Beliau agar mengembalikan harta dan para tawanan mereka. Maka Beliau berkata kepada mereka: \"Bersamaku sekarang ada orang-orang sebagaimana kalian lihat dan ucapan yang paling aku sukai adalah yang paling benar. Maka pilihlah salah satu dari dua hal, apakah tawanan atau harta dan sungguh aku akan memberi kesempatan terhadap mereka\". Nabi shallallahu 'alaihi wasallam menanti mereka sekitar sepuluh malam ketika mereka kembali dari Tha'if. Setelah jelas bagi mereka bahwa Rasulullah shallallahu 'alaihi wasallam tidak akan mengembalikan kepada mereka kecuali salah satu dari dua pilihan, mereka berkata; \"Kami memilih tawanan\". Beliau berdiri di hadapan Kaum Muslimin kemudian memuji Allah yang memang Dia paling berhak untuk dipuji lalu bersabda: \"Kemudian dari pada itu, saudara-saudara kalian ini datang kepada kita dengan bertobat dan sungguh aku berpikir akan mengembalikan para tawanan. Maka siapa diantara kalian yang suka berbuat baik (dengan membebaskan tawanan) dalam masalah ini maka lakukanlah, dan siapa diantara kalian yang ingin tetap menjadikannya sebagai haknya maka kami akan berikan kepadanya harta fa'i yang sejak awal Allah mengaruniakannya kepada kita, lakukanlah\". Maka orang-orang berkata: \"Kami memilih berbuat baik (menyerahkan mereka wahai Rasulullah\". Lalu Beliau berkata, kepada mereka: \"Kami tidak tahu siapa diantara kalian yang berhak memberi izin dan siapa yang bukan, maka itu kembalilah hingga kalian bawa para pimpinan yang mengurusi urusan kalian\". Akhirnya mereka pulang dan berbicara dengan para pimpinan mereka lalu kembali menghadap Rasulullah shallallahu 'alaihi wasallam dan mereka mengabarkan bahwa mereka telah menyetujui dan memberi izin\". Inilah kisah yang sampai kepada kami tentang para tawanan suku Hawazin\". Kalimat terakhir (inilah kisah…) adalah ucapan Az Zuhriy",
          "tr": "Urve'den rivayet edilmiştir: Ona Mervan b. Hakem ve Misver b. Mahreme haber vermişlerdir: Hevazin halkı Müslüman olup Hz. Nebi'e gelerek mallarını ve esirlerini kendilerine geri vermesini isteyince Nebi Sallallahu Aleyhi ve Sellem: \"Benim yanımda gördüğünüz kimseler vardır. Ben sözün en doğrusunu severim. Bu iki gruptan birini seçin: ya esirler, ya mallar. Ben zaten sizi bekliyordum\" buyurdu. -Hz. Nebi Sallallahu Aleyhi ve Sellem Taif seferinden dönüşünde onları on gece kadar beklemişti.- Hevazinliler: \"Biz esirlerimizi seçiyoruz\" dediler. Bunun üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem Müslümanların arasında doğrularak Allah'a layık olduğu biçimde sena etti. Sonra şöyle buyurdu: \"Kardeşleriniz tövbe edip bize gelmişler. Ben esirlerini kendilerine geri vermeyi uygun görüyorum. Bunu gönül hoşluğu ile yapacak olanlar yapsınlar. Her kim de payını almak isterse ona Allah'ın bize ganimet olarak vereceği ilk mallardan hakkını verelim\" buyurdu. Ashab: \"Ey Allah'ın Resulü! Biz gönül hoşluğu ile teklifini kabul ediyoruz\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Biz içinizden kimlerin izin verdiğini, kimlerin vermediğini bilemeyiz. Varın gidin de kararınızı bize sözcüleriniz bildirsin\" buyurdu. Sonra Hz. Nebi'in yanına geri geldiler ve gönül hoşluğu ile esirlerin serbest bırakılmasına izin verdiklerini haber verdiler. Hevazin esirleri hakkında bize ulaşan bilgi budur. Bu (yani Hevazin esirleri hakkında bize ulaşan bilgi budur) sözü, Zührı'nin söylediği son sözdür"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 41
      },
      "narrator": {
        "en": "Marwan bin Al-Hakam and Al-Miswar bin Makhrama"
      }
    },
    {
      "hadithNumber": 2609,
      "arabicNumber": 2609,
      "book": 51,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَخَذَ سِنًّا فَجَاءَ صَاحِبُهُ يَتَقَاضَاهُ فَقَالَ ‏\"‏ إِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً ‏\"‏‏.‏ ثُمَّ قَضَاهُ أَفْضَلَ مِنْ سِنِّهِ وَقَالَ ‏\"‏ أَفْضَلُكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) took a camel of special age from somebody on credit. Its owner came and demanded it back (harshly). The Prophet (ﷺ) said, \"No doubt, he who has a right, can demand it.\" Then the Prophet (ﷺ) gave him an older camel than his camel and said, \"The best amongst you is he who repays his debts in the most handsome way",
          "ur": "ہم سے ابن مقاتل نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی شعبہ سے، انہیں ابوسلمہ بن کہیل نے، انہیں ابوسلمہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک اونٹ بطور قرض لیا، قرض خواہ تقاضا کرنے آیا ( اور نازیبا گفتگو کی ) تو آپ صلی اللہ علیہ وسلم نے فرمایا ”حق والے کو کہنے کا حق ہوتا ہے۔“ پھر آپ صلی اللہ علیہ وسلم نے اس سے اچھی عمر کا اونٹ اسے دلا دیا اور فرمایا ”تم میں افضل وہ ہے جو ادا کرنے میں سب سے بہتر ہو۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) avait pris un chameau d’un certain âge à crédit auprès de quelqu’un. Son propriétaire est venu le réclamer avec insistance. Le Prophète (ﷺ) a dit : « Il est certain que celui qui a un droit peut le réclamer. » Puis le Prophète (ﷺ) lui a donné un chameau plus âgé que celui qu’il devait et a dit : « Le meilleur d’entre vous est celui qui rembourse ses dettes de la plus belle manière. »",
          "id": "Telah menceritakan kepada kami [Ibnu Muqatil] telah mengabarkan kepada kami ['Abdullah] telah mengabarkan kepada kami [Syu'bah] dari [Salamah Kuhail] dari [Abu Salamah] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam, bahwa pernah Beliau mengambil seekor anak unta lalu datang pemiliknya menagih. Orang-orang pun memberi komentar yang negatif terhadap orang yang menagih itu. Lalu beliau bersabda: \"Sesungguhnya bagi pemilik kebenaran boleh menyatakan terus terang keinginannya\". Lalu Beliau membayar dengan anak unta yang umurnya lebih tua daripada unta orang itu lalu bersabda: \"Sesungguhnya yang terbaik diantara kalian adalah yang paling baik menunaikan janji",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem (borç olarak) yaşını doldurmuş bir deve almıştı. Devenin sahibi alacağını istemek için geldi. Sahabe, onun bu davranışını eleştirdi. Bunun üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem: \"Hak sahibinin söz söyleme hakkı vardır\" buyurduktan sonra ona aldığı deveden daha yaşlı (ve dolayısıyla değerli) bir deve verdi ve \"Sizin en üstününüz borcunu en güzel şekilde ödeyeninizdir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 42
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2610,
      "arabicNumber": 2610,
      "book": 51,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَكَانَ عَلَى بَكْرٍ لِعُمَرَ صَعْبٍ، فَكَانَ يَتَقَدَّمُ النَّبِيَّ صلى الله عليه وسلم فَيَقُولُ أَبُوهُ يَا عَبْدَ اللَّهِ لاَ يَتَقَدَّمِ النَّبِيَّ صلى الله عليه وسلم أَحَدٌ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِعْنِيهِ ‏\"‏‏.‏ فَقَالَ عُمَرُ هُوَ لَكَ‏.‏ فَاشْتَرَاهُ ثُمَّ قَالَ ‏\"‏ هُوَ لَكَ يَا عَبْدَ اللَّهِ، فَاصْنَعْ بِهِ مَا شِئْتَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:That he was in the company of the Prophet (ﷺ) on a journey, riding a troublesome camel belonging to `Umar. The camel used to go ahead of the Prophet, so Ibn `Umar's father would say, \"O `Abdullah! No one should go ahead of the Prophet.\" The Prophet (ﷺ) said to him, \"Sell it to me.\" `Umar said to the Prophet \"It is for you.\" So, he bought it and said, \"O `Abdullah! It is for you, and you can do with it what you like",
          "ur": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا عمرو سے اور ان سے ابن عمر رضی اللہ عنہما نے کہ وہ سفر میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے اور عمر رضی اللہ عنہ کے ایک سرکش اونٹ پر سوار تھے۔ وہ اونٹ آپ صلی اللہ علیہ وسلم سے بھی آگے بڑھ جایا کرتا تھا۔ اس لیے ان کے والد ( عمر رضی اللہ عنہ ) کو تنبیہ کرنی پڑتی تھی کہ اے عبداللہ! نبی کریم صلی اللہ علیہ وسلم سے آگے کسی کو نہ ہونا چاہئے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا! کہ عمر! اسے مجھے بیچ دے۔ عمر رضی اللہ عنہ نے عرض کیا یہ تو آپ ہی کا ہے۔ آپ صلی اللہ علیہ وسلم نے اسے خرید لیا۔ پھر فرمایا، عبداللہ یہ اب تیرا ہے۔ جس طرح تو چاہے استعمال کر۔",
          "fr": "Rapporté par Ibn `Umar : Il était en voyage avec le Prophète (ﷺ), montant un chameau difficile appartenant à `Umar. Ce chameau dépassait souvent le Prophète, alors le père d’Ibn `Umar disait : « Ô `Abdullah ! Personne ne doit dépasser le Prophète. » Le Prophète (ﷺ) lui a dit : « Vends-le-moi. » `Umar a répondu au Prophète : « Il est à toi. » Le Prophète (ﷺ) l’a donc acheté et a dit : « Ô `Abdullah ! Il est à toi, tu peux en faire ce que tu veux. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Ibnu 'Uyainah] dari ['Amru] dari [Ibnu'Umar radliallahu 'anhuma] bahwa dia pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan dengan menunggang unta yang masih muda milik 'Umar. Saat itu dia mendahului laju Nabi shallallahu 'alaihi wasallam maka bapaknya berkata: \"Wahai 'Abdullah, janganlah seseorang mendahului Nabi shallallahu 'alaihi wasallam\". Maka Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Juallah unta itu kepadaku\". Maka 'Umar berkata: \"Unta ini untuk baginda\". Maka Beliau membelinya kemudian berkata: \"Unta ini untukmu wahai 'Abdullah dan pergunakanlah sesukamu",
          "tr": "Abdullah b. Ömer r.a.'den rivayet edilmiştir: Abdullah b. Ömer r.a. Nebi Sallallahu Aleyhi ve Sellem'ile birlikte bir yolculuktaydı ve Hz. Ömer'e ait genç ve serkeş bir deve sırtındaydı. Deve Hz. Nebi'in önüne geçiyordu ve babası \"Abdullah! Hiç kimse Hz. Nebi'in önüne geçmez\" diyordu. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Ömer! Sen bu deveyi bana sat\" buyurdu. O da \"O senindir\" dedi. Nebi Sallallahu Aleyhi ve Sellem onu satın aldıktan sonra \"Abdullah! Bu deve artık senindir. İstediğini yapabilirsin\" buyurdu. باب: إذا وهب بعيرا لرجل وهو راكبه فهو جائز. 25. BİRİNE BİNDİĞİ DEVEYİ BAĞIŞLAMAK CAİZDİR"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 43
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 2611,
      "arabicNumber": 2611,
      "book": 51,
      "hadithInBook": 44,
      "text": {
        "arabic": "وَقَالَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، وَكُنْتُ عَلَى بَكْرٍ صَعْبٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِعُمَرَ ‏\"‏ بِعْنِيهِ ‏\"‏‏.‏ فَابْتَاعَهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدَ اللَّهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn 'Umar (ra):We were in the company of the Prophet (ﷺ) on a journey, and I was riding a troublesome camel. The Prophet (ﷺ) asked 'Umar to sell that camel to him. So, 'Umar sold it to him. The Prophet (ﷺ) then said, \"O 'Abdullah! The camel is for you",
          "ur": "اور حمیدی نے بیان کیا کہ ہم سے سفیان نے بیان کیا کہ ہم سے عمرو نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے اور میں ایک سرکش اونٹ پر سوار تھا۔ نبی کریم صلی اللہ علیہ وسلم نے عمر رضی اللہ عنہ سے فرمایا کہ یہ اونٹ مجھے بیچ دے چنانچہ آپ صلی اللہ علیہ وسلم نے اسے خرید لیا اور پھر فرمایا عبداللہ! تو یہ اونٹ لے جا ( میں نے یہ تجھ کو بخش دیا ) ۔",
          "fr": "Rapporté par Ibn 'Umar (ra) : Nous étions en voyage avec le Prophète (ﷺ) et je montais un chameau difficile. Le Prophète (ﷺ) a demandé à 'Umar de lui vendre ce chameau. 'Umar le lui a donc vendu. Le Prophète (ﷺ) a alors dit : « Ô 'Abdullah ! Le chameau est à toi. »",
          "tr": "Abdullah b. Ömer'den rivayet edilmiştir: Allah Resulü ile beraber bir yolculuktaydık. Ben genç ve serkeş bir deveye binmiştim. Nebi Sallallahu Aleyhi ve Sellem Ömer'e: \"Bunu bana sat\" diyerek deveyi ondan satın aldı ve \"Abdullah! Bu deve artık senindir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 44
      },
      "narrator": {
        "en": "Ibn 'Umar (ra)"
      }
    },
    {
      "hadithNumber": 2612,
      "arabicNumber": 2612,
      "book": 51,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَى عُمَرُ بْنُ الْخَطَّابِ حُلَّةً سِيَرَاءَ عِنْدَ باب الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ اشْتَرَيْتَهَا فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ قَالَ ‏\"‏ إِنَّمَا يَلْبَسُهَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ ثُمَّ جَاءَتْ حُلَلٌ فَأَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم عُمَرَ مِنْهَا حُلَّةً، وَقَالَ أَكَسَوْتَنِيهَا وَقُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ‏.‏ فَقَالَ ‏\"‏ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏‏.‏ فَكَسَا عُمَرُ أَخًا لَهُ بِمَكَّةَ مُشْرِكًا‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:`Umar bin Al-Khattab saw a silken dress (cloak) being sold at the gate of the Mosque and said, \"O Allah's Messenger (ﷺ)! Would that you buy it and wear it on Fridays and when the delegates come to you!\" Allah's Messenger (ﷺ) said, \"This is worn by the one who will have no share in the Hereafter.\" Later on some silk dresses were brought and Allah's Messenger (ﷺ) sent one of them to `Umar. `Umar said, \"How do you give me this to wear while you said what you said about the dress of 'Utarid?\" Allah's Messenger (ﷺ) said, \"I have not given it to you to wear.\" So, `Umar gave it to a pagan brother of his in Mecca",
          "ur": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے امام مالک نے نافع سے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ عمر رضی اللہ عنہ نے دیکھا کہ مسجد کے دروازے پر ایک ریشمی حلہ ( فروخت ہو رہا ) ہے۔ آپ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا، کہ کیا اچھا ہوتا اگر آپ اسے خرید لیتے اور جمعہ کے دن اور وفود کی ملاقات کے موقع پر اسے زیب تن فرما لیا کرتے۔ آپ صلی اللہ علیہ وسلم نے اس کا جواب یہ دیا کہ اسے وہی لوگ پہنتے ہیں جن کا آخرت میں کوئی حصہ نہیں ہو گا۔ کچھ دنوں بعد آپ صلی اللہ علیہ وسلم کے یہاں بہت سے ( ریشمی ) حلے آئے اور آپ صلی اللہ علیہ وسلم نے ایک حلہ ان میں سے عمر رضی اللہ عنہ کو بھی عنایت فرمایا۔ عمر رضی اللہ عنہ نے اس پر عرض کیا کہ آپ یہ مجھے پہننے کے لیے عنایت فرما رہے ہیں۔ حالانکہ آپ خود عطارد کے حلوں کے بارے میں جو کچھ فرمانا تھا فرما چکے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں پہننے کے لیے نہیں دیا ہے۔ چنانچہ عمر رضی اللہ عنہ نے اسے اپنے ایک مشرک بھائی کو دے دیا، جو مکے میں رہتا تھا۔",
          "fr": "Rapporté par `Abdullah bin `Umar : `Umar bin Al-Khattab a vu un vêtement de soie en vente à la porte de la mosquée et a dit : « Ô Messager d’Allah (ﷺ) ! Si seulement tu l’achetais pour le porter le vendredi et quand des délégations viennent te voir ! » Le Messager d’Allah (ﷺ) a dit : « Ceci est porté par celui qui n’aura aucune part dans l’au-delà. » Plus tard, des vêtements de soie sont arrivés et le Messager d’Allah (ﷺ) en a envoyé un à `Umar. `Umar a dit : « Comment peux-tu me donner cela à porter alors que tu as dit ce que tu as dit à propos du vêtement d’Utarid ? » Le Messager d’Allah (ﷺ) a répondu : « Je ne te l’ai pas donné pour que tu le portes. » `Umar l’a donc donné à un de ses frères polythéistes à La Mecque",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] berkata, 'Umar bin Al Khaththob melihat pakaian terbuat dari sutera di depan pintu masjid, lalu dia berkata: \"Wahai Rasulullah, alangkah baiknya seandainya anda beli pakaian ini lalu Baginda kenakan pada hari Jum'at atau saat menyambut utusan (delegasi) \". Maka Rasulullah shallallahu 'alaihi wasallam berkata: \"Sesungguhnya orang yang memakai pakaian seperti ini tidak akan mendapat bagian di akhirat\". Kemudian datang (hadiah diantaranya ada pakain) sutera. Lalu Rasulullah shallallahu 'alaihi wasallam memberikan pakaian sutera tersebut kepada 'Umar bin Al Khaththob radliallahu 'anhu. Umar berkata: \"Baginda menyuruh aku mengenakannya sedang Baginda sendiri dahulu pernah berkomentar pakaian ini tak layak dipakai\". Maka Beliau shallallahu 'alaihi wasallam berkata, \"Aku memberikannya kepadamu bukan untuk kamu pakai\". Lalu 'Umar memberikan pakaian sutera tersebut kepada saudaranya yang musyrik di kota Makkah",
          "tr": "Abdullah b. Ömer r.a.'den rivayet edilmiştir: Ömer İbnü'l-Hattab r.a., mescidin kapısında sergide çizgili bir elbise görmüştü. \"Ey Allah'ın Resulü! Bunu satın alsan da Cuma günlerinde ve gelen heyetleri karşılayacağın zamanlarda giyinsen\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Bunu ancak ahirette nasibi olmayanlar giyer\" buyurdu. Sonra birkaç elbise getirildi. Allah Resulü onlardan birini Ömer'e verdi. Ömer r.a. \"Utarid elbisesi hakkında söylediğin o sözden sonra bunu bana mı giydiriyorsun?\" dedi. Bunun üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem \"Sana bunu giyinesin diye vermiyorum\" buyurdu. Bunun üzerine Ömer r.a., onu Mekke'de oturan müşrik kardeşine giydirdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 45
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 2613,
      "arabicNumber": 2613,
      "book": 51,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَبُو جَعْفَرٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم بَيْتَ فَاطِمَةَ فَلَمْ يَدْخُلْ عَلَيْهَا، وَجَاءَ عَلِيٌّ فَذَكَرَتْ لَهُ ذَلِكَ فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنِّي رَأَيْتُ عَلَى بَابِهَا سِتْرًا مَوْشِيًّا ‏\"‏‏.‏ فَقَالَ ‏\"‏ مَا لِي وَلِلدُّنْيَا ‏\"‏‏.‏ فَأَتَاهَا عَلِيٌّ فَذَكَرَ ذَلِكَ لَهَا فَقَالَتْ لِيَأْمُرْنِي فِيهِ بِمَا شَاءَ‏.‏ قَالَ تُرْسِلُ بِهِ إِلَى فُلاَنٍ‏.‏ أَهْلِ بَيْتٍ بِهِمْ حَاجَةٌ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:Once the Prophet (ﷺ) went to the house of Fatima but did not enter it. `Ali came and she told him about that. When 'Ali asked the Prophet (ﷺ) about it, he said, \"I saw a (multicolored) decorated curtain on her door. I am not interested in worldly things.\" `Ali went to Fatima and told her about it. Fatima said, \"I am ready to dispense with it in the way he suggests.\" The Prophet (ﷺ) ordered her to send it to such-andsuch needy people",
          "ur": "ہم سے ابوجعفر محمد بن جعفر نے بیان کیا، کہا ہم سے ابن فضیل نے بیان کیا، ان سے ان کے والد نے نافع سے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم فاطمہ رضی اللہ عنہا کے گھر تشریف لے گئے، لیکن اندر نہیں گئے۔ اس کے بعد علی رضی اللہ عنہ گھر آئے تو فاطمہ رضی اللہ عنہا نے ذکر کیا ( کہ آپ صلی اللہ علیہ وسلم گھر میں تشریف نہیں لائے ) علی رضی اللہ عنہ نے اس کا ذکر جب آپ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اس کے دروازے پر دھاری دار پردہ لٹکا دیکھا تھا ( اس لیے واپس چلا آیا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے دنیا ( کی آرائش و زیبائش ) سے کیا سروکار۔ علی رضی اللہ عنہ نے آ کر ان سے آپ صلی اللہ علیہ وسلم کی گفتگو کا ذکر کیا تو انہوں نے کہا کہ آپ مجھے جس طرح کا چاہیں اس سلسلے میں حکم فرمائیں۔ ( آپ صلی اللہ علیہ وسلم کو جب یہ بات پہنچی تو ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ فلاں گھر میں اسے بھجوا دیں۔ انہیں اس کی ضرورت ہے۔",
          "fr": "Rapporté par Ibn `Umar : Un jour, le Prophète (ﷺ) est allé à la maison de Fatima mais n’y est pas entré. `Ali est venu et elle lui a raconté cela. Quand 'Ali a demandé au Prophète (ﷺ) la raison, il a dit : « J’ai vu un rideau décoré et coloré à sa porte. Je ne m’intéresse pas aux choses de ce monde. » `Ali est allé voir Fatima et lui a rapporté cela. Fatima a dit : « Je suis prête à m’en séparer comme il le souhaite. » Le Prophète (ﷺ) lui a alors demandé de l’envoyer à des personnes dans le besoin",
          "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Ibnu Fudhoil] dari [bapaknya] dari [Nafi'] dari [Ibnu'Umar radliallahu 'anhuma] berkata, Nabi shallallahu 'alaihi wasallam mendatangi rumah Fathimah namun Beliau tidak segera masuk. Kemudian 'Ali datang, dan Fathimah ceritakan peristiwa ini kepadanya. Kemudian 'Ali menceritakan kepada Nabi shallallahu 'alaihi wasallam, maka Beliau berkata: \"Aku melihat di pintu ada tabir yang ada lukisannya\". Maka 'Ali berkata: \"Aku tidak punya kepentingan dengan dunia\". Lalu 'Ali menemui Fathimah dan menceritakan, maka Fathimah berkata: \"Silakan Beliau memerintahkanaku apa saja sesuka Beliau\". 'Ali berkata: \"Sebaiknya kamu kirimkan saja tabir itu untuk si fulan yang barangkali keluarga mereka membutuhkannya",
          "tr": "Abdullah b. Ömer r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem Fatima'nın odasının kapısına kadar gelmiş ama içeri girmemişti. Hz. Fatıma, bunu Hz. Ali r.a.'e anlattı. Hz. Ali de Hz. Nebi'e bunun sebebini sordu. Nebi Sallallahu Aleyhi ve Sellem: \"Onun kapısında süslü bir örtü gördüm. Dünya ile benim ne işim olabilir\" buyurdu. Bunun üzerine Hz. Ali, Hz. Fatıma'nın yanına giderek durumu ona bildirdi. Hz. Fatıma: \"Bana dilediği şeyi emretsin de öyle yapayım\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Bunu falancanın evine gönder. Onların buna ihtiyacı var\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 46
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 2614,
      "arabicNumber": 2614,
      "book": 51,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ أَهْدَى إِلَىَّ النَّبِيُّ صلى الله عليه وسلم حُلَّةً سِيَرَاءَ فَلَبِسْتُهَا، فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ، فَشَقَقْتُهَا بَيْنَ نِسَائِي‏.‏",
        "translations": {
          "en": "Narrated `Ali:The Prophet (ﷺ) gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I cut it into pieces and distributed it among my wives",
          "ur": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا کہ مجھے عبدالمالک بن میسرہ نے خبر دی، کہا کہ میں نے زید بن وہب سے سنا کہ علی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے ایک ریشمی حلہ ہدیہ میں دیا تو میں نے اسے پہن لیا۔ لیکن جب غصے کے آثار روئے مبارک پر دیکھے تو اسے اپنی عورتوں میں پھاڑ کر تقسیم کر دیا۔",
          "fr": "Rapporté par `Ali : Le Prophète (ﷺ) m’a offert un vêtement en soie et je l’ai porté. Quand j’ai vu des signes de colère sur son visage, je l’ai découpé en morceaux et je l’ai distribué à mes épouses",
          "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku ['Abdul Malik bin Maisarah] berkata, aku mendengar [Zaid bin Wahb] dari ['Ali radliallahu 'anhu] berkata: \"Aku diberi hadiah kain bermotif garis dari sutera oleh Nabi shallallahu 'alaihi wasallam lalu aku kenakan, maka nampak aku lihat kemarahan dari raut wajah Beliau. Kemudian aku bagikan untuk isteri-isteriku",
          "tr": "Ali r.a.'in şöyle dediği rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem bana çizgili ve ipekli bir elbise hediye etti. Ben de onu giyindim. Sonra yüzünde bir kızgınlık belirtisi gördüm. Bunun üzerine elbiseyi ailemin kadınları arasında paylaştırdım. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 47
      },
      "narrator": {
        "en": "`Ali"
      }
    },
    {
      "hadithNumber": 2616,
      "arabicNumber": 2616,
      "book": 51,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ قَالَ أُهْدِيَ لِلنَّبِيِّ صلى الله عليه وسلم جُبَّةُ سُنْدُسٍ، وَكَانَ يَنْهَى عَنِ الْحَرِيرِ، فَعَجِبَ النَّاسُ مِنْهَا فَقَالَ ‏ \"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَمَنَادِيلُ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ أَحْسَنُ مِنْ هَذَا ‏\"‏‏.‏ وَقَالَ سَعِيدٌ عَنْ قَتَادَةَ، عَنْ أَنَسٍ، إِنَّ أُكَيْدِرَ دُومَةَ أَهْدَى إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Anas:A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet (ﷺ) used to forbid people to wear silk. So, the people were pleased to see it. The Prophet (ﷺ) said, \"By Him in Whose Hands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" Anas added, \"The present was sent to the Prophet (ﷺ) by Ukaidir (a Christian) from Dauma",
          "ur": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے یونس بن محمد نے بیان کیا، ان سے شیبان نے بیان کیا قتادہ سے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں دبیز قسم کے ریشم کا ایک جبہ ہدیہ کے طور پر پیش کیا گیا۔ آپ صلی اللہ علیہ وسلم اس کے استعمال سے ( مردوں کو ) منع فرماتے تھے۔ صحابہ کو بڑی حیرت ہوئی ( کہ کتنا عمدہ ریشم ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا ( تمہیں اس پر حیرت ہے ) اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے، جنت میں سعد بن معاذ رضی اللہ عنہ کے رومال اس سے بھی زیادہ خوبصورت ہیں۔",
          "fr": "Rapporté par Anas : Un manteau (jubba) fait d’un tissu de soie épais a été offert au Prophète. Le Prophète (ﷺ) interdisait aux gens de porter de la soie. Pourtant, les gens étaient contents de le voir. Le Prophète (ﷺ) a dit : « Par Celui qui détient l’âme de Muhammad dans Sa main, les mouchoirs de Sa`d bin Mu`adh au Paradis sont meilleurs que cela. » Anas a ajouté : « Ce cadeau a été envoyé au Prophète (ﷺ) par Ukaidir (un chrétien) de Dauma. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Syaiban] dari [Qatadah] telah menceritakan kepada kami [Anas radliallahu 'anhu] berkata; Nabi shallallahu 'alaihi wasallam dihadiahi baju jubah terbuat dari sutera tipis dan sebelumnya Beliau telah melarang memakai sutera lalu orang-orang menjadi heran karenanya. Maka Beliau bersabda: \"Demi Dzat Yang jiwa Muhammad di tangan-Nya, sungguh sapu tangan Sa'ad bin 'Ubadah di surga lebih baik dari ini\". Dan berkata, [Sa'id] dari [Qatadah] dari [Anas]; Bahwa Ukaidar Dumah yang menghadiahkan kepada Nabi shallallahu 'alaihi wasallam",
          "tr": "Enes r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e saf ipekten bir cübbe hediye edilmişti. Kendisi ipek giyilmesini yasaklardı. Bu cübbe insanların çok hoşuna gitti. Bunun üzerine \"Muhammed'in canı elinde olana yemin ederim ki! Cennette Sa'd b. Muaz'ın mendilleri bile bundan daha güzeldir\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 48
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2617,
      "arabicNumber": 2617,
      "book": 51,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ يَهُودِيَّةً، أَتَتِ النَّبِيَّ صلى الله عليه وسلم بِشَاةٍ مَسْمُومَةٍ، فَأَكَلَ مِنْهَا فَجِيءَ بِهَا فَقِيلَ أَلاَ نَقْتُلُهَا‏.‏ قَالَ ‏ \"‏ لاَ ‏\"‏‏.‏ فَمَا زِلْتُ أَعْرِفُهَا فِي لَهَوَاتِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:A Jewess brought a poisoned (cooked) sheep for the Prophet (ﷺ) who ate from it. She was brought to the Prophet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the poison on the palate of the mouth of Allah's Messenger (ﷺ)",
          "ur": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا ہم سے خالد بن حارث نے بیان کیا، ان سے شعبہ نے، ان سے ہشام بن زید نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ ایک یہودی عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں زہر ملا ہوا بکری کا گوشت لائی، آپ صلی اللہ علیہ وسلم نے اس میں سے کچھ کھایا ( لیکن فوراً ہی فرمایا کہ اس میں زہر پڑا ہوا ہے ) پھر جب اسے لایا گیا ( اور اس نے زہر ڈالنے کا اقرار بھی کر لیا ) تو کہا گیا کہ کیوں نہ اسے قتل کر دیا جائے۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ اس زہر کا اثر میں نے ہمیشہ نبی کریم صلی اللہ علیہ وسلم کے تالو میں محسوس کیا۔",
          "fr": "Rapporté par Anas bin Malik : Une femme juive a apporté un mouton empoisonné (cuit) au Prophète (ﷺ) qui en a mangé. Elle a été amenée devant le Prophète et on lui a demandé : « Devons-nous la tuer ? » Il a répondu : « Non. » J’ai continué à voir les effets du poison sur le palais du Messager d’Allah (ﷺ)",
          "id": "Telah menceritakan kepada kami ['Abdullah bin 'Abdul Wahhab] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Su'bah] dari [Hisyam bin Zaid] dari [Anas bin Malik radliallahu 'anhu] bahwa, ada seorang wanita Yahudi yang datang menemui Nabi shallallahu 'alaihi wasallam dengan membawa seekor kambing yang telah diracun lalu Beliau memakannya. Kemudian wanita itu diringkus dengan bukti daging tersebut dan dikatakan; \"Tidak sebaiknyakah kita bunuh saja?\" Beliau menjawab: \"Jangan\". Sejak itu aku senantiasa aku melihat bekas racun tersebut pada anak lidah Rasulullah shallallahu 'alaihi wasallam",
          "tr": "Enes r.a.'den rivayet edilmiştir: Dume kralı Nebi Sallallahu Aleyhi ve Sellem'e hediye vermişti. [-2617-] Enes b. Malik r.a.'den rivayet edilmiştir: Yahudi bir kadın Nebi Sallallahu Aleyhi ve Sellem'e zehirli bir koyun getirmiş ve Nebi Sallallahu Aleyhi ve Sellem ondan bir parça yemişti. \"Onu öldürelim mi?\" dediler. \"Hayır\" buyurdu. Ben o zehirin etkisini halen Hz. Nebi'in dudaklarında görürüm"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 49
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 2618,
      "arabicNumber": 2618,
      "book": 51,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم ثَلاَثِينَ وَمِائَةً فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَ أَحَدٍ مِنْكُمْ طَعَامٌ ‏\"‏‏.‏ فَإِذَا مَعَ رَجُلٍ صَاعٌ مِنْ طَعَامٍ أَوْ نَحْوُهُ، فَعُجِنَ ثُمَّ جَاءَ رَجُلٌ مُشْرِكٌ مُشْعَانٌّ طَوِيلٌ بِغَنَمٍ يَسُوقُهَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَيْعًا أَمْ عَطِيَّةً ـ أَوْ قَالَ ـ أَمْ هِبَةً ‏\"‏‏.‏ قَالَ لاَ، بَلْ بَيْعٌ‏.‏ فَاشْتَرَى مِنْهُ شَاةً، فَصُنِعَتْ وَأَمَرَ النَّبِيُّ صلى الله عليه وسلم بِسَوَادِ الْبَطْنِ أَنْ يُشْوَى، وَايْمُ اللَّهِ مَا فِي الثَّلاَثِينَ وَالْمِائَةِ إِلاَّ قَدْ حَزَّ النَّبِيُّ صلى الله عليه وسلم لَهُ حُزَّةً مِنْ سَوَادِ بَطْنِهَا، إِنْ كَانَ شَاهِدًا أَعْطَاهَا إِيَّاهُ، وَإِنْ كَانَ غَائِبًا خَبَأَ لَهُ، فَجَعَلَ مِنْهَا قَصْعَتَيْنِ، فَأَكَلُوا أَجْمَعُونَ، وَشَبِعْنَا، فَفَضَلَتِ الْقَصْعَتَانِ، فَحَمَلْنَاهُ عَلَى الْبَعِيرِ‏.‏ أَوْ كَمَا قَالَ‏.‏",
        "translations": {
          "en": "Narrated `Abdur-Rahman bin Abu Bakr:We were one-hundred and thirty persons accompanying the Prophet (ﷺ) who asked us whether anyone of us had food. There was a man who had about a Sa of wheat which was mixed with water then. A very tall pagan came driving sheep. The Prophet (ﷺ) asked him, \"Will you sell us (a sheep) or give it as a present?\" He said, \"I will sell you (a sheep).\" The Prophet (ﷺ) bought a sheep and it was slaughtered. The Prophet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet (ﷺ) gave every person of the one-hundred-and-thirty a piece of that; he gave all those of them who were present; and kept the shares of those who were absent. The Prophet (ﷺ) then put its meat in two huge basins and all of them ate to their fill, and even then more food was left in the two basins which were carried on the camel (or said something like it)",
          "ur": "ہم سے ابوالنعمان نے بیان کیا، انہوں نے کہا ہم سے معتمر بن سلیمان نے بیان کیا، ان سے ان کے باپ نے بیان کیا، ان سے ابوعثمان نے بیان کیا اور ان سے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ ہم ایک سو تیس آدمی رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( ایک سفر میں ) تھے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کیا کسی کے ساتھ کھانے کی بھی کوئی چیز ہے؟ ایک صحابی کے ساتھ تقریباً ایک صاع کھانا ( آٹا ) تھا۔ وہ آٹا گوندھا گیا۔ پھر ایک لمبا تڑنگا مشرک پریشان حال بکریاں ہانکتا ہوا آیا۔ تو نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا یہ بیچنے کے لیے ہیں۔ یا کسی کا عطیہ ہے یا آپ نے ( عطیہ کی بجائے ) ہبہ فرمایا۔ اس نے کہا کہ نہیں بیچنے کے لیے ہیں۔ آپ صلی اللہ علیہ وسلم نے اس سے ایک بکری خریدی پھر وہ ذبح کی گئی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اس کی کلیجی بھوننے کے لیے کہا۔ قسم اللہ کی ایک سو تیس اصحاب میں سے ہر ایک کو اس کلیجی میں سے کاٹ کے دیا۔ جو موجود تھے انہیں تو آپ صلی اللہ علیہ وسلم نے فوراً ہی دے دیا اور جو اس وقت موجود نہیں تھے ان کا حصہ محفوظ رکھ لیا۔ پھر بکری کے گوشت کو دو بڑی قابوں میں رکھا گیا اور سب نے خوب سیر ہو کر کھایا۔ جو کچھ قابوں میں بچ گیا تھا اسے اونٹ پر رکھ کر ہم واپس لائے۔ او کما قال۔",
          "fr": "Rapporté par `Abdur-Rahman bin Abu Bakr : Nous étions cent trente personnes accompagnant le Prophète (ﷺ) qui nous a demandé si l’un de nous avait de la nourriture. Un homme avait environ un Sa de blé mélangé avec de l’eau. Un païen très grand est arrivé en conduisant des moutons. Le Prophète (ﷺ) lui a demandé : « Veux-tu nous vendre (un mouton) ou nous l’offrir ? » Il a répondu : « Je vous le vends. » Le Prophète (ﷺ) a acheté un mouton qui a été abattu. Le Prophète a demandé que son foie et d’autres abats soient rôtis. Par Allah, le Prophète (ﷺ) a donné à chacun des cent trente une part de cela ; il a donné à tous ceux qui étaient présents et a gardé la part de ceux qui étaient absents. Ensuite, le Prophète (ﷺ) a mis la viande dans deux grands plats et tout le monde a mangé à sa faim, et il en restait encore dans les deux plats qui ont été portés sur le chameau (ou quelque chose de similaire)",
          "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] dari [bapaknya] dari [Abu 'Utsman] dari ['Abdurrahman bin Abu Bakar radliallahu 'anhuma] berkata; \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam (dalam perjalanan) berjumlah seratus tiga puluh orang lalu Beliau berkata: \"Apakah diantara kalian yang memiliki makanan?\" Maka jika ada sebanyak satu sha'makanan atau sejenisnya, dibuatlah adonan. Kemudian datang seorang musyrik yang berambut panjang namun agak semrawut membawa kambing yang digiringnya. Nabi shallallahu 'alaihi wasallam berkata: \"Apakah kambing ini untuk dijual atau untuk dihadiahkan?\" atau Beliau berkata dengan redaksi: \"Atau dihibahkan?\" Orang itu menjawab: \"Tidak, tapi untuk dijual\". Maka Beliau membeli seekor darinya\". Lalu kambing itu dimasak dan Nabi shallallahu 'alaihi wasallam memerintahkan agar hatinya dibagi-bagikan. Demi Allah, tidak ada dari kami yang berjumlah seratus tiga puluh orang melainkan telah diberikan oleh Nabi shallallahu 'alaihi wasallam potongan jantung dari isi perut kambing tersebut. Jika ada yang hadir disitu, musti diberi, dan jika sedang tidak ada, disisakan baginya. Maka dibuat dalam dua kuali, lalu mereka makan semuanya dan kami merasa kenyang dan masih tersisa dua kuali lalu kami bawa diatas unta, atau sebagaimana dikatakannya",
          "tr": "Abdurrahman b. Ebu Bekir r.a.'den rivayet edilmiştir: Yüz otuz kişi, Nebi Sallallahu Aleyhi ve Sellem ile birlikteydik. Nebi Sallallahu Aleyhi ve Sellem \"Yanında yiyecek olan var mı?\" buyurdu. Birinin yanında bir sa' kadar buğday çıktı ve hamur yapıldı. Sonra uzun boylu müşrik birisi koyun sürüsü ile geldi. Nebi Sallallahu Aleyhi ve Sellem: \"Satıyor musun, bağışlıyor musun?\" buyurdu. Adam: \"Hayır, satıyorum\" dedi. Hz. Nebi ondan bir koyun satın aldı ve yemek pişirildi. Nebi Sallallahu Aleyhi ve Sellem etin kızartılmasını (kebap yapılmasını) emretti. Allah'a yemin ederim ki! Nebi Sallallahu Aleyhi ve Sellem ondan orada bulunan yüz otuz kişinin her birine bir pay ayırdı. Orada bulunanların payını verdi; bulunmayanların payını ayırdı. Sonra kalan eti iki ayrı kaba koydu. Hepimiz doyuncaya kadar ondan yedik. İki kap et de arttı. Artan bu eti de deveye yükledik"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 50
      },
      "narrator": {
        "en": "`Abdur-Rahman bin Abu Bakr"
      }
    },
    {
      "hadithNumber": 2619,
      "arabicNumber": 2619,
      "book": 51,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَى عُمَرُ حُلَّةً عَلَى رَجُلٍ تُبَاعُ فَقَالَ لِلنَّبِيِّ صلى الله عليه وسلم ابْتَعْ هَذِهِ الْحُلَّةَ تَلْبَسْهَا يَوْمَ الْجُمُعَةِ وَإِذَا جَاءَكَ الْوَفْدُ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا يَلْبَسُ هَذَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْهَا بِحُلَلٍ فَأَرْسَلَ إِلَى عُمَرَ مِنْهَا بِحُلَّةٍ‏.‏ فَقَالَ عُمَرُ كَيْفَ أَلْبَسُهَا وَقَدْ قُلْتَ فِيهَا مَا قُلْتَ قَالَ ‏\"‏ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا، تَبِيعُهَا أَوْ تَكْسُوهَا ‏\"‏‏.‏ فَأَرْسَلَ بِهَا عُمَرُ إِلَى أَخٍ لَهُ مِنْ أَهْلِ مَكَّةَ قَبْلَ أَنْ يُسْلِمَ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:`Umar saw a silken cloak over a man for sale and requested the Prophet (ﷺ) to buy it in order to wear it on Fridays and while meeting delegates. The Prophet (ﷺ) said, \"This is worn by the one who will have no share in the Hereafter.\" Later on Allah's Messenger (ﷺ) got some silken cloaks similar to that one, and he sent one to `Umar. `Umar said to the Prophet (ﷺ) \"How can I wear it, while you said about it what you said?\" The Prophet (ﷺ) said, \"I have not given it to you to wear, but to sell or to give to someone else.\" So, `Umar sent it to his brother at Mecca before he embraced Islam",
          "ur": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا کہ مجھ سے عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر نے کہ عمر رضی اللہ عنہ نے دیکھا کہ ایک شخص کے یہاں ایک ریشمی جوڑا فروخت ہو رہا ہے۔ تو آپ نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ آپ یہ جوڑا خرید لیجئیے تاکہ جمعہ کے دن اور جب کوئی وفد آئے تو آپ اسے پہنا کریں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے تو وہ لوگ پہنتے ہیں جن کا آخرت میں کوئی حصہ نہیں ہوتا۔ پھر نبی کریم صلی اللہ علیہ وسلم کے پاس بہت سے ریشمی جوڑے آئے اور آپ صلی اللہ علیہ وسلم نے ان میں سے ایک جوڑا عمر رضی اللہ عنہ کو بھیجا۔ عمر رضی اللہ عنہ نے کہا کہ میں اسے کس طرح پہن سکتا ہوں جب کہ آپ خود ہی اس کے متعلق جو کچھ ارشاد فرمانا تھا، فرما چکے ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہیں پہننے کے لیے نہیں دیا بلکہ اس لیے دیا کہ تم اسے بیچ دو یا کسی ( غیر مسلم ) کو پہنا دو۔ چنانچہ عمر رضی اللہ عنہ نے اسے مکے میں اپنے ایک بھائی کے گھر بھیج دیا جو ابھی اسلام نہیں لایا تھا۔",
          "fr": "Rapporté par Ibn `Umar : `Umar a vu un manteau de soie sur un homme à vendre et a demandé au Prophète (ﷺ) de l’acheter pour le porter le vendredi et lors des rencontres avec des délégations. Le Prophète (ﷺ) a dit : « Ceci est porté par celui qui n’aura aucune part dans l’au-delà. » Plus tard, le Messager d’Allah (ﷺ) a reçu des manteaux de soie similaires et il en a envoyé un à `Umar. `Umar a dit au Prophète (ﷺ) : « Comment puis-je le porter alors que tu as dit ce que tu as dit à son sujet ? » Le Prophète (ﷺ) a répondu : « Je ne te l’ai pas donné pour que tu le portes, mais pour que tu le vendes ou que tu l’offres à quelqu’un d’autre. » `Umar l’a donc envoyé à son frère à La Mecque avant qu’il n’embrasse l’islam",
          "id": "Telah menceritakan kepada kami [Kholid bin Makhlad] telah menceritakan kepada kami [Sulaiman bin Bilal] berkata, telah menceritakan kepadaku ['Abdullah bin Dinar] dari [Ibnu'Umar radliallahu 'anhuma] berkata; 'Umar melihat pakaian terbuat dari sutera dijajakan oleh seseorang lalu dia berkata kepada Nabi shallallahu 'alaihi wasallam: \"Belilah pakaian ini untuk Baginda kenakan pada hari Jum'at dan saat menyambut utusan (delegasi) \". Maka Beliau bersabda: \"Sesungguhnya orang yang memakai pakaian seperti ini adalah orang yang tidak akan mendapat bagian di akhirat\". Kemudian Rasulullah shallallahu 'alaihi wasallam diberikan pakaian diantaranya ada yang terbuat dari sutera lalu Beliau berikan diantaranya kepada 'Umar. Maka 'Umar berkata: \"Baginda menyuruh aku mengenakannya sedang Baginda telah berkomentar negatif tentangnya!\". Beliau berkata, \"Aku memberikannya kepadamu bukan untuk kamu pakai, tapi juallah atau hadiahkan\". Lalu 'Umar memberikan pakaian sutera tersebut kepada saudaranya yang tinggal di kota Makkah sebelum masuk Islam",
          "tr": "Abdullah b. Ömer r.a.'den rivayet edilmiştir: Ömer, birinde satılık bir elbise gördü. Nebi Sallallahu Aleyhi ve Sellem'e: \"Bunu satın alsan. Cuma günlerinde ve gelen heyetleri karşıladığın zamanlarda giyersin\" dedi. Nebi Sallallahu Aleyhi ve Sellem:: \"Bunu, ahirette nasibi olmayanlar giyer\" buyurdu. Nebi s.a.v.'e bu elbiselerden birkaç tane verildi. O da onlardan birini Ömer'e gönderdi. Ömer: \"Sen bu elbise hakkında o sözü söyledikten sonra ben bunu nasıl giyerim!\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Ben bunu sana giyinesin diye vermedim. Satarsın veya birine giydirirsin\" buyurdu. Bunun üzerine Ömer, onu Mekke halkından henüz Müslüman olmamış bir kardeşine gönderdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 51
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 2620,
      "arabicNumber": 2620,
      "book": 51,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ قَدِمَتْ عَلَىَّ أُمِّي وَهْىَ مُشْرِكَةٌ، فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَاسْتَفْتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْتُ ‏{‏إِنَّ أُمِّي قَدِمَتْ‏}‏ وَهْىَ رَاغِبَةٌ، أَفَأَصِلُ أُمِّي قَالَ ‏ \"‏ نَعَمْ صِلِي أُمَّكِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Asma' bint Abu Bakr:My mother came to me during the lifetime of Allah's Messenger (ﷺ) and she was a pagan. I said to Allah's Apostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from me, shall I keep good relations with her?\" The Prophet (ﷺ) said, \"Yes, keep good relation with her",
          "ur": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا ہشام سے، ان سے ان کے باپ نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں میری والدہ ( قتیلہ بنت عبدالعزیٰ ) جو مشرکہ تھیں، میرے یہاں آئیں۔ میں نے آپ صلی اللہ علیہ وسلم سے پوچھا، میں نے یہ بھی کہا کہ وہ ( مجھ سے ملاقات کی ) بہت خواہشمند ہیں، تو کیا میں اپنی والدہ کے ساتھ صلہ رحمی کر سکتی ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اپنی والدہ کے ساتھ صلہ رحمی کر۔",
          "fr": "Rapporté par Asma' bint Abu Bakr : Ma mère est venue me voir du vivant du Messager d’Allah (ﷺ) alors qu’elle était polythéiste. J’ai demandé au Messager d’Allah (ﷺ), cherchant son avis : « Ma mère est venue me voir et elle aimerait que je lui fasse du bien, dois-je garder de bonnes relations avec elle ? » Le Prophète (ﷺ) a dit : « Oui, garde de bonnes relations avec elle. »",
          "id": "Telah menceritakan kepada kami ['Ubaid bin Isma'il] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [Bapaknya] dari [Asma' binti Abi Bakr radliallahu 'anhuma] berkata; Ibuku menemuiku saat itu dia masih musyrik pada zaman Rasulullah shallallahu 'alaihi wasallam lalu aku meminta pendapat kepada Rasulullah shallallahu 'alaihi wasallam. Aku katakan; \"Ibuku sangat ingin (aku berbuat baik padanya), apakah aku harus menjalin hubungan dengan ibuku?\" Beliau menjawab: \"Ya, sambunglah silaturrahim dengan ibumu",
          "tr": "Esma binti Ebi Bekir'den rivayet edilmiştir: Allah Resulü döneminde, annem müşrik olarak (henüz Müslüman değilken) yanıma geldi. Ben de Hz. Nebi'e: \"Annem geldi, benim kendisine iyi davranmamı umuyor (kendisine sırt dönüp onu ortada bırakmamdan korkuyor). Ona iyilik edeyim mi?\" diye danıştım. Nebi Sallallahu Aleyhi ve Sellem: \"Evet, annene iyilik et\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 52
      },
      "narrator": {
        "en": "Asma' bint Abu Bakr"
      }
    },
    {
      "hadithNumber": 2621,
      "arabicNumber": 2621,
      "book": 51,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، وَشُعْبَةُ، قَالاَ حَدَّثَنَا قَتَادَةُ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"He who takes back his present is like him who swallows his vomit",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام اور شعبہ نے بیان کیا، انہوں نے کہا کہ ہم سے قتادہ نے بیان کیا سعید بن مسیب سے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اپنا دیا ہوا ہدیہ واپس لینے والا ایسا ہے جیسے اپنی کی ہوئی قے کو چاٹنے والا۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a dit : « Celui qui reprend son cadeau ressemble à celui qui avale son vomi. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dan [Syu'bah] keduanya berkata, telah menceritakan kepada kami [Qatadah] dari [Sa'id bin Al Musayyab] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang meminta kembali apa yang telah dihibahkannya bagaikan orang yang menelan kembali muntahnya",
          "tr": "Abdullah b. Abbas r.a.'tan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Yaptığı bağıştan dönen kişi, kustuğunu yiyen gibidir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 53
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 2622,
      "arabicNumber": 2622,
      "book": 51,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَيْسَ لَنَا مَثَلُ السَّوْءِ، الَّذِي يَعُودُ فِي هِبَتِهِ كَالْكَلْبِ يَرْجِعُ فِي قَيْئِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"The bad example is not for us. He who takes back his present is like a dog that swallows back its vomit",
          "ur": "ہم سے عبدالرحمٰن بن مبارک نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا کہ ہم سے ایوب نے بیان کیا عکرمہ سے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہم مسلمانوں کو بری مثال نہ اختیار کرنی چاہئے۔ اس شخص کی سی جو اپنا دیا ہوا ہدیہ واپس لے لے، وہ اس کتے کی طرح ہے جو اپنی قے خود چاٹتا ہے۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a dit : « Le mauvais exemple n’est pas pour nous. Celui qui reprend son cadeau est comme un chien qui ravale son vomi. »",
          "id": "Telah menceritakan kepada kami ['Abdurrahman bin Al Mubarak] telah menceritakan kepada kami ['Abdul Warits] telah menceritakan kepada kami [Ayyub] dari ['Ikrimah] dari [Ibnu 'Abbas radliallahu 'anhuma] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak patut bagi kita (orang beriman) sengaja membuat perumpamaan yang buruk. Orang yang meminta kembali apa yang telah dihibahkannya bagaikan anjing yang menelan kembali apa yang dimuntahkannya",
          "tr": "Abdullah b. Abbas r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem buyurduki: \"Bizim kötü sıfatımız olmaz. Yaptığı bağıştan dönen kişi, kustuğunu yiyen köpek gibidir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 54
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 2623,
      "arabicNumber": 2623,
      "book": 51,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ، فَأَضَاعَهُ الَّذِي كَانَ عِنْدَهُ، فَأَرَدْتُ أَنْ أَشْتَرِيَهُ مِنْهُ، وَظَنَنْتُ أَنَّهُ بَائِعُهُ بِرُخْصٍ، فَسَأَلْتُ عَنْ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تَشْتَرِهِ، وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ وَاحِدٍ، فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Umar bin Al-Khattab:I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to buy it from him, thinking that he would sell it cheap. When I asked the Prophet (ﷺ) he said, \"Don't buy it, even if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is like a dog that swallows back its vomit",
          "ur": "ہم سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا زید بن اسلم سے، ان سے ان کے باپ نے کہ انہوں نے عمر بن خطاب رضی اللہ عنہ سے سنا۔ آپ نے فرمایا کہ میں نے ایک گھوڑا اللہ کے راستے میں جہاد کے لیے ( ایک شخص کو ) دیا ) ۔ جسے میں نے وہ گھوڑا دیا تھا، اس نے اسے دبلا کر دیا۔ اس لیے میرا ارادہ ہوا کہ اس سے اپنا وہ گھوڑا خرید لوں، میرا یہ بھی خیال تھا کہ وہ شخص وہ گھوڑا سستے داموں پر بیچ دے گا۔ لیکن جب میں نے اس کے بارے میں نبی کریم صلی اللہ علیہ وسلم سے پوچھا تو آپ نے فرمایا کہ تم اسے نہ خریدو، خواہ تمہیں وہ ایک ہی درہم میں کیوں نہ دے۔ کیونکہ اپنے صدقہ کو واپس لینے والا شخص اس کتے کی طرح ہے جو اپنی ہی قے خود چاٹتا ہے۔",
          "fr": "Rapporté par `Umar bin Al-Khattab : J’ai donné un cheval dans la voie d’Allah. La personne à qui je l’ai donné ne s’en est pas occupée. J’ai voulu le lui racheter, pensant qu’il me le vendrait à bas prix. Quand j’ai demandé au Prophète (ﷺ), il a dit : « Ne le rachète pas, même s’il te le donne pour un dirham, car celui qui reprend ce qu’il a donné en aumône est comme un chien qui ravale son vomi. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari [bapaknya] aku mendengar ['Umar bin Al Khaththob radliallahu 'anhu] berkata: \"Aku memberi (seseorang) kuda yang untuk tujuan digunakan berperang di jalan Allah lalu orang itu tidak memanfaatkan sebagaimana mestinya. Kemudian aku berniat membelinya kembali darinya karena aku menganggap membelinya lagi adalah suatu hal yang (diringankan) dibolehkan. Lalu aku tanyakan hal ini kepada Nabi shallallahu 'alaihi wasallam, maka Beliau bersabda: \"Jangan kamu membelinya sekalipun orang itu menjualnya dengan harga satu dirham, karena orang yang mengambil kembali shadaqahnya seperti anjing yang menjilat kembali ludahnya",
          "tr": "Zeyd b. Eslem'den rivayet edilmiştir: Babası, Ömer İbnü'l-Hattab'ı şöyle derken işittiğini nakletmiştir: Birine, Allah yolunda cihad etmesi için bir at vermiştim. Ama o, verdiğim ata yazık etti. Ben de bana ucuz fiyata satar diye düşünerek onu tekrar satın almak istedim. Gidip Nebi (Sallallahu aleyhi ve Sellem)'e danıştım. Nebi Sallallahu Aleyhi ve Sellem buyurduki: \"Bir dirheme de satacak olsa onu satın alma. Çünkü sadakasından dönen kişi, kustuğunu yiyen köpek gibidir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 55
      },
      "narrator": {
        "en": "`Umar bin Al-Khattab"
      }
    },
    {
      "hadithNumber": 2624,
      "arabicNumber": 2624,
      "book": 51,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، أَنَّ بَنِي صُهَيْبٍ، مَوْلَى ابْنِ جُدْعَانَ ادَّعَوْا بَيْتَيْنِ وَحُجْرَةً، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْطَى ذَلِكَ صُهَيْبًا، فَقَالَ مَرْوَانُ مَنْ يَشْهَدُ لَكُمَا عَلَى ذَلِكَ قَالُوا ابْنُ عُمَرَ‏.‏ فَدَعَاهُ فَشَهِدَ لأَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم صُهَيْبًا بَيْتَيْنِ وَحُجْرَةً‏.‏ فَقَضَى مَرْوَانُ بِشَهَادَتِهِ لَهُمْ‏.‏",
        "translations": {
          "en": "Narrated Asma' bint Abu Bakr (ra):My mother came to me during the lifetime of Allah's Messenger (ﷺ) and she was a Mushrikah (polytheist, idolatress, pagan). I said to Allah's Messenger (ﷺ) (seeking his verdict), \"My mother has come to and she desires to recieve a reward from me, shall I keep good relations with her ?\" The Prophet (ﷺ) said, \"Yes, keep good relation with her",
          "ur": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے عبداللہ بن عبیداللہ بن ابی ملیکہ نے خبر دی کہ ابن جدعان کے غلام بنوصہیب نے دعویٰ کیا کہ دو مکان اور ایک حجرہ نبی کریم صلی اللہ علیہ وسلم نے صہیب رضی اللہ عنہ کو عنایت فرمایا تھا ( جو وراثت میں انہیں ملنا چاہئے ) خلیفہ مروان بن حکم نے پوچھا کہ تمہارے حق میں اس دعویٰ پر گواہ کون ہے؟ انہوں نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما۔ مروان نے آپ کو بلایا تو آپ نے گواہی دی کہ واقعی رسول اللہ صلی اللہ علیہ وسلم نے صہیب رضی اللہ عنہ کو دو مکان اور ایک حجرہ دیا تھا۔ مروان نے آپ کی گواہی پر فیصلہ ان کے حق میں کر دیا۔",
          "fr": "Rapporté par Asma' bint Abu Bakr (ra) : Ma mère est venue me voir du vivant du Messager d’Allah (ﷺ) alors qu’elle était polythéiste. J’ai demandé au Messager d’Allah (ﷺ), cherchant son avis : « Ma mère est venue me voir et elle aimerait que je lui fasse du bien, dois-je garder de bonnes relations avec elle ? » Le Prophète (ﷺ) a dit : « Oui, garde de bonnes relations avec elle. »",
          "id": "Bab. Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam bin Yusuf] bahwa [Ibnu Juraij] mengabarkan mereka berkata, telah menceritakan kepadaku ['Abdullah bin 'Ubaidullah bin Abi Mulaikah] bahwa anak-anak Shuhaib maula Ibnu Jud'an mereka mengklaim dua rumah dan sebuah kamar yang diberi Rasulullah shallallahu 'alaihi wasallam kepada Shuhaib. Maka Marwan berkata: \"Siapa yang menjadi saksi atas kalian berdua dalam perkara ini?\" Mereka menjawab: \" [Ibnu 'Umar] \". Lalu Marwan memanggilnya dan ia bersaksi bahwa Rasulullah shallallahu 'alaihi wasallam memang telah memberi Shuhaib dua rumah dengan satu kamar. Kemudian Marwan memutuskan untuk mereka dengan persaksiannya",
          "tr": "Abdullah b. Ubeydullah b. Ebu Müleyke r.a.'den rivayet edilmiştir: İbn Cud'an'ın azatlıs! Suheyb'in oğulları Allah Resulü'nün iki evi ve bir odayı Suheyb'e verdiğini iddia ettiler. Mervan: \"Bu konuda sizin lehinize kim şahitlik eder?\" diye sordu. \"Abdullah b. Ömer\" dediler. Bunun üzerine Mervan, Abdullah b. Ömer'i çağırttı. O da \"Allah Resulü Sallallahu Aleyhi ve Sellem iki evi ve bir odayı Suheyb'e vermişti\" diye şahitlik etti. Bunun üzerine Mervan onun şahitliği doğrultusunda karar verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 56
      },
      "narrator": {
        "en": "Asma' bint Abu Bakr (ra)"
      }
    },
    {
      "hadithNumber": 2625,
      "arabicNumber": 2625,
      "book": 51,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ قَضَى النَّبِيُّ صلى الله عليه وسلم بِالْعُمْرَى أَنَّهَا لِمَنْ وُهِبَتْ لَهُ‏.‏",
        "translations": {
          "en": "Narrated Jabir:The Prophet (ﷺ) gave the verdict that `Umra is for the one to whom it is presented",
          "ur": "ہم سے ابونعیم نے بیان کیا، ان سے شیبان نے بیان کیا، ان سے یحییٰ نے، ان سے ابوسلمہ نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے عمریٰ کے متعلق فیصلہ کیا تھا کہ وہ اس کا ہو جاتا ہے جسے ہبہ کیا گیا ہو۔",
          "fr": "Rapporté par Jabir : Le Prophète (ﷺ) a jugé que l’`Umra appartient à celui à qui elle est offerte",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] dari [Jabir radliallahu 'anhu] berkata: \"Nabi shallallahu 'alaihi wasallam menetapkan bahwa 'umra adalah milik orang yang diberi hibah",
          "tr": "Cabir r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem umra'nın, ömür boyu kullanmak üzere kendisine bağış yapılan kişiye ait olduğuna hükmetti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 57
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 2626,
      "arabicNumber": 2626,
      "book": 51,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ حَدَّثَنِي النَّضْرُ بْنُ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعُمْرَى جَائِزَةٌ ‏\"‏‏.‏ وَقَالَ عَطَاءٌ حَدَّثَنِي جَابِرٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Umra is permissible.\" Ata said, \"Jabir narrated the same to me from the Prophet",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے ہمام نے بیان کیا، ان سے قتادہ نے بیان کیا، ان سے نضر بن انس نے بیان کیا، ان سے بشیر بن نہیک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”عمریٰ جائز ہے۔“ اور عطاء نے کہا کہ مجھ سے جابر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح بیان کیا۔",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « L’`Umra est permise. » Ata a dit : « Jabir m’a rapporté la même chose du Prophète. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin 'Umar] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] berkata, telah menceritakan kepadaku [An Nadhor bun Anas] dari [Basyir bin Nahik] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"'Umra adalah hibah yang diperbolehkan\". Dan berkata, ['Atho'] telah menceritakan kepadaku [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti ini juga",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem \"Umra caizdir\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 58
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2627,
      "arabicNumber": 2627,
      "book": 51,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ فَزَعٌ بِالْمَدِينَةِ فَاسْتَعَارَ النَّبِيُّ صلى الله عليه وسلم فَرَسًا مِنْ أَبِي طَلْحَةَ يُقَالُ لَهُ الْمَنْدُوبُ، فَرَكِبَ فَلَمَّا رَجَعَ قَالَ ‏ \"‏ مَا رَأَيْنَا مِنْ شَىْءٍ، وَإِنْ وَجَدْنَاهُ لَبَحْرًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas:Once the people of Medina were frightened, so the Prophet (ﷺ) borrowed a horse from Abu Talha called Al-Mandub, and rode it. When he came back he said, \"We have not seen anything (to be afraid of), but the horse was very fast (having an energy as inexhaustible as the water of the sea)",
          "ur": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا قتادہ سے کہ میں نے انس رضی اللہ عنہ سے سنا۔ آپ نے بیان کیا کہ مدینے پر ( دشمن کے حملے کا ) خوف تھا۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے ابوطلحہ رضی اللہ عنہ سے ایک گھوڑا جس کا نام مندوب تھا مستعار لیا، پھر آپ صلی اللہ علیہ وسلم اس پر سوار ہوئے ( صحابہ بھی ساتھ تھے ) پھر جب واپس ہوئے تو فرمایا، ہمیں تو کوئی خطرہ کی چیز نظر نہ آئی، البتہ یہ گھوڑا سمندر کی طرح ( تیز دوڑتا ) پایا۔",
          "fr": "Rapporté par Anas : Un jour, les habitants de Médine ont eu peur, alors le Prophète (ﷺ) a emprunté un cheval à Abu Talha appelé Al-Mandub et l’a monté. À son retour, il a dit : « Nous n’avons rien vu d’inquiétant, mais le cheval était très rapide, aussi infatigable que l’eau de la mer. »",
          "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] berkata, aku mendengar [Anas] berkata: \"Di Madinah terjadi kegaduhan, lalu Nabi shallallahu 'alaihi wasallam meminjam kuda milik Abu Thalhah yang bernama Al Mandub, lalu Beliau pacu kudanya menuju suara itu. Kemudian beliau kembali dan berkata: \"Kami tidak melihat sesuatupun, dan sungguh aku dapatkan kuda ini sedemikian cepat larinya, bagaikan ombak menggulung lautan",
          "tr": "Katade'den rivayet edilmiştir: Enes b. Malik'i şöyle derken işittim: Medine'de bir düşman korkusu olmuştu. Nebi Sallallahu Aleyhi ve Sellem Ebu Talha'nın atını ödünç aldı. Bu atın adı \"Mendub\" idi. (Etrafı kontrol edip) dönünce \"Korkacak bir şey görmedik, bu atı da deniz (gibi iyi koşar) bulduk\" buyurdu. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 59
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 2628,
      "arabicNumber": 2628,
      "book": 51,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي أَبِي قَالَ، دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَعَلَيْهَا دِرْعُ قِطْرٍ ثَمَنُ خَمْسَةِ دَرَاهِمَ، فَقَالَتِ ارْفَعْ بَصَرَكَ إِلَى جَارِيَتِي، انْظُرْ إِلَيْهَا فَإِنَّهَا تُزْهَى أَنْ تَلْبَسَهُ فِي الْبَيْتِ، وَقَدْ كَانَ لِي مِنْهُنَّ دِرْعٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَمَا كَانَتِ امْرَأَةٌ تُقَيَّنُ بِالْمَدِينَةِ إِلاَّ أَرْسَلَتْ إِلَىَّ تَسْتَعِيرُهُ‏.‏",
        "translations": {
          "en": "Narrated Aiman:I went to `Aisha and she was wearing a coarse dress costing five Dirhams. `Aisha said, \"Look up and see my slave-girl who refuses to wear it in the house though during the lifetime of Allah's Messenger (ﷺ) I had a similar dress which no woman desiring to appear elegant (before her husband) failed to borrow from me",
          "ur": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے عبدالواحد بن ایمن نے بیان کیا، کہا کہ مجھ سے میرے باپ نے بیان کیا، انہوں نے کہا کہ میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو آپ قطر ( یمن کا ایک دبیز کھردرا کپڑا ) کی قمیص قیمتی پانچ درہم کی پہنے ہوئے تھیں۔ آپ نے ( مجھ سے ) فرمایا۔ ذرا نظر اٹھا کر میری اس لونڈی کو تو دیکھ۔ اسے گھر میں بھی یہ کپڑے پہننے سے انکار ہے۔ حالانکہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں میرے پاس اسی کی ایک قمیص تھی۔ جب کوئی لڑکی دلہن بنائی جاتی تو میرے یہاں آدمی بھیج کر وہ قمیص عاریتاً منگا لیتی تھی۔",
          "fr": "Rapporté par Aiman : Je suis allé voir `Aisha et elle portait une robe grossière qui coûtait cinq dirhams. `Aisha a dit : « Regarde ma servante qui refuse de la porter à la maison, alors que du vivant du Messager d’Allah (ﷺ), j’avais une robe similaire que toutes les femmes qui voulaient paraître élégantes devant leur mari me demandaient d’emprunter. »",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Abdul Wahid bin Aiman] berkata, telah menceritakan kepadaku [bapakku] berkata; Aku menemui ['Aisyah radliallahu 'anha] yang mengenakan kain yang tebal dengan harga lima dirham, ia berkata: \"Tolong sorotkan pandanganmu kearah budakku, lihatlah padanya bahwa ia menyombongkan diri dengan memakainya di rumah, dan aku dulu memiliki pakaian pada masa Rasulullah shallallahu 'alaihi wasallam yang tidak ada seorang wanitapun di Madinah yang berhias diri kecuali mereka diberi saran menemuiku untuk meminjamnya",
          "tr": "Abdulvahid b. Eymen'den rivayet edilmiştir: Babam bana şöyle anlattı: Aişe r.anha'nın yanına girdim. Üzerinde beş dirhem değerinde, kalın bir gömlek vardı. Dedi ki: \"Gözünü kaldır da cariyeme bak. O, bu elbiseyi ev içinde giymekten utanır. Allah Resulü hayatta iken benim böyle bir gömleğim vardı. Medine'de (zifaf için) süslenen bütün kadınlar haber gönderip bu gömleğimi ödünç isterdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 60
      },
      "narrator": {
        "en": "Aiman"
      }
    },
    {
      "hadithNumber": 2629,
      "arabicNumber": 2629,
      "book": 51,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ نِعْمَ الْمَنِيحَةُ اللِّقْحَةُ الصَّفِيُّ مِنْحَةً، وَالشَّاةُ الصَّفِيُّ تَغْدُو بِإِنَاءٍ وَتَرُوحُ بِإِنَاءٍ ‏\"‏‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ وَإِسْمَاعِيلُ عَنْ مَالِكٍ قَالَ نِعْمَ الصَّدَقَةُ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"What a good Maniha (the she-camel which has recently given birth and which gives profuse milk) is, and (what a good Maniha) (the sheep which gives profuse milk, a bowl in the morning and another in the evening) is!\" Narrated Malik: Maniha is a good deed of charity",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے امام مالک نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، کیا ہی عمدہ ہے ہدیہ اس دودھ دینے والی اونٹنی کا جس نے ابھی حال ہی میں بچہ جنا ہو اور دودھ دینے والی بکری کا جو صبح و شام اپنے دودھ سے برتن بھر دیتی ہے۔ ہم سے عبداللہ بن یوسف اور اسماعیل نے بیان کیا، ان سے امام مالک نے بیان کیا کہ ( دودھ دینے والی اونٹنی کا ) صدقہ کیا ہی عمدہ ہے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d'Allah (ﷺ) a dit : « Quelle belle Maniha (la chamelle qui vient de mettre bas et qui donne beaucoup de lait) ! Et (quelle belle Maniha) (la brebis qui donne beaucoup de lait, un bol le matin et un autre le soir) ! » Rapporté par Malik : La Maniha est une bonne action de charité",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Malik] dari [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baiknya pemberian adalah unta yang baru melahirkan yang banyak susunya, yang didapatkan dari ghanimah yang belum dibagi sebagai anugerah dari Allah, dan kambing yang didapatkan dari harta ghanimah yang belum dibagi, ia berangkat pagi hari dengan kantung kosong, namun pulang dengan kantung yang penuh berisi\". Telah menceritakan kepada kami ['Abdullah bin Yusuf] dan [Isma'il] dari [Malik] berkata: \"Sebaik-baik shadaqah",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdular: \"Sütlü deve ve koyunu sütünden faydalanmak üzere ariyet olarak birine vermek ne güzeldir. Sabah bir kova, akşam bir kova süt verir.\" Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 61
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2630,
      "arabicNumber": 2630,
      "book": 51,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا قَدِمَ الْمُهَاجِرُونَ الْمَدِينَةَ مِنْ مَكَّةَ وَلَيْسَ بِأَيْدِيهِمْ ـ يَعْنِي شَيْئًا ـ وَكَانَتِ الأَنْصَارُ أَهْلَ الأَرْضِ وَالْعَقَارِ، فَقَاسَمَهُمُ الأَنْصَارُ عَلَى أَنْ يُعْطُوهُمْ ثِمَارَ أَمْوَالِهِمْ كُلَّ عَامٍ وَيَكْفُوهُمُ الْعَمَلَ وَالْمَئُونَةَ، وَكَانَتْ أُمُّهُ أُمُّ أَنَسٍ أُمُّ سُلَيْمٍ كَانَتْ أُمَّ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، فَكَانَتْ أَعْطَتْ أُمُّ أَنَسٍ رَسُولَ اللَّهِ صلى الله عليه وسلم عِذَاقًا فَأَعْطَاهُنَّ النَّبِيُّ صلى الله عليه وسلم أُمَّ أَيْمَنَ مَوْلاَتَهُ أُمَّ أُسَامَةَ بْنِ زَيْدِ‏.‏ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا فَرَغَ مِنْ قَتْلِ أَهْلِ خَيْبَرَ فَانْصَرَفَ إِلَى الْمَدِينَةِ، رَدَّ الْمُهَاجِرُونَ إِلَى الأَنْصَارِ مَنَائِحَهُمُ الَّتِي كَانُوا مَنَحُوهُمْ مِنْ ثِمَارِهِمْ فَرَدَّ النَّبِيُّ صلى الله عليه وسلم إِلَى أُمِّهِ عِذَاقَهَا، وَأَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم أُمَّ أَيْمَنَ مَكَانَهُنَّ مِنْ حَائِطِهِ‏.‏ وَقَالَ أَحْمَدُ بْنُ شَبِيبٍ أَخْبَرَنَا أَبِي عَنْ يُونُسَ بِهَذَا، وَقَالَ مَكَانَهُنَّ مِنْ خَالِصِهِ‏.‏",
        "translations": {
          "en": "Narrated Ibn Shihab Az-Zuhri:Anas bin Malik said, \"When the emigrants came to Medina, they had nothing whereas the Ansar had land and property. The Ansar gave them their land on condition that the emigrants would give them half the yearly yield and work on the land and provide the necessaries for cultivation.\" His (i.e. Anas's mother who was also the mother of `Abdullah bin Abu Talha, gave some date-palms to Allah's Apostle who gave them to his freed slave-girl (Um Aiman) who was also the mother of Usama bin Zaid. When the Prophet (ﷺ) finished from the fighting against the people of Khaibar and returned to Medina, the emigrants returned to the Ansar the fruit gifts which the Ansar had given them. The Prophet (ﷺ) also returned to Anas's mother the date-palms. Allah's Messenger (ﷺ) gave Um Aiman other trees from his garden in lieu of the old gift",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم کو ابن وہب نے خبر دی یونس سے، انہوں نے ابن شہاب سے، وہ انس بن مالک رضی اللہ عنہ سے کہ جب مہاجرین مکہ سے مدینہ آئے تو ان کے ساتھ کوئی بھی سامان نہ تھا۔ انصار زمین اور جائیداد والے تھے۔ انصار نے مہاجرین سے یہ معاملہ کر لیا کہ وہ اپنے باغات میں سے انہیں ہر سال پھل دیا کریں گے اور اس کے بدلے مہاجرین ان کے باغات میں کام کیا کریں۔ انس رضی اللہ عنہ کی والدہ ام سلیم جو عبداللہ بن ابی طلحہ رضی اللہ عنہما کی بھی والدہ تھیں، انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو کھجور کا ایک باغ ہدیہ دے دیا تھا لیکن آپ صلی اللہ علیہ وسلم نے وہ باغ اپنی لونڈی ام ایمن رضی اللہ عنہا جو اسامہ بن زید رضی اللہ عنہما کی والدہ تھیں، عنایت فرما دیا۔ ابن شہاب نے بیان کیا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم جب خیبر کے یہودیوں کی جنگ سے فارغ ہوئے اور مدینہ تشریف لائے تو مہاجرین نے انصار کو ان کے تحائف واپس کر دئیے جو انہوں نے پھلوں کی صورت میں دے رکھے تھے۔ آپ صلی اللہ علیہ وسلم نے انس رضی اللہ عنہ کی والدہ کا باغ بھی واپس کر دیا اور ام ایمن رضی اللہ عنہا کو اس کے بجائے اپنے باغ میں سے ( کچھ درخت ) عنایت فرما دئیے۔ احمد بن شبیب نے بیان کیا، انہیں ان کے والد نے خبر دی اور انہیں یونس نے اسی طرح البتہ اپنی روایت میں بجائے «مكانهن من حائطه‏.‏» کے «مكانهن من خالصه‏.‏» مکانہن من خالصہ بیان کیا۔",
          "fr": "Rapporté par Ibn Shihab Az-Zuhri : Anas bin Malik a dit : « Quand les émigrants sont arrivés à Médine, ils n’avaient rien alors que les Ansar avaient des terres et des biens. Les Ansar leur ont donné leurs terres à condition que les émigrants leur donnent la moitié de la récolte annuelle, travaillent la terre et fournissent ce qu’il faut pour la culture. La mère d’Anas (qui était aussi la mère de `Abdullah bin Abu Talha) a donné des palmiers au Prophète d’Allah (ﷺ), qui les a offerts à sa servante affranchie (Um Aiman), la mère d’Usama bin Zaid. Quand le Prophète (ﷺ) est revenu à Médine après la bataille de Khaybar, les émigrants ont rendu aux Ansar les fruits qu’ils avaient reçus. Le Prophète (ﷺ) a aussi rendu à la mère d’Anas ses palmiers. Le Messager d’Allah (ﷺ) a donné à Um Aiman d’autres arbres de son jardin en échange de ce don. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] dari [Anas bin Malik radliallahu 'anhu] berkata; Ketika orang-orang Muhajirin sampai di Madinah dari Makkah tanpa bekal sesuatupun ditangan mereka, sedangkan orang-orang Anshar adalah pemilik tanah dan perabotan, maka orang-orang Anshar berjanji kepada mereka untuk memberi buah dari harta mereka itu setiap tahun dan mencukupi mereka dengan pekerjaan dan keamanan. Adalah ibunya yakni ibunya Anas, bernama Ummu Sulaim, yang juga adalah ibunya 'Abdullah bin Abi Thalhah, Ibu Anas pernah memberi Rasulullah shallallahu 'alaihi wasallam buah kurma, lalu Nabi shallallahu 'alaihi wasallam memberikannya kepada ummu Aiman, maula ummu Usamah bin Zaid. Ibnu Syihab berkata, maka Anas bin Malik mengabariku bahwasanya ketika Nabi shallallahu 'alaihi wasallam selesai dari perang Khaibar, Beliau kembali ke Madinah dan orang-orang muhajirin mengembalikan apa yang diberikan orang-orang Anshar kepada mereka berupa buah-buahan. Kemudian Nabi shallallahu 'alaihi wasallam mengembalikan kepada ibunya (Anas) buah kurmanya dan Rasulullah shallallahu 'alaihi wasallam memberi ummu Aiman pengganti dari kebunnya. Dan [Ahmad bin Syabib] berkata, telah mengabarkan kepada kami [bapakku] dari [Yunus] dengan hadits ini, dan berkata: \"menggantinya dari harta miliknya sendiri",
          "tr": "Enes b. Malik r.a.'den rivayet edilmiştir: Muhacirler Mekke'den Medine'ye gelmişlerdi ve ellerinde hiç malları yoktu. Ensarın ise tarlaları ve gayrimenkulleri vardı. Ensar, muhacirlerle tarlalarını paylaştılar. Muhacirler tarlaların bakımını yapacak, ensar da çıkan ürünü onlarla paylaşacaktı. Enes'in annesi Ümmü Süleym -ki Abdullah b. Ebu Talha'nın da annesiydi- Allah Resulü Sallallahu Aleyhi ve Sellem'e birkaç hurma ağacı vermişti. Hz. Nebi Sallallahu Aleyhi ve Sellem de onları azatlı cariyesi ve Üsame b. Zeyd'in annesi olan Üm mü Eymen'e vermişti. İbn Şihab şöyle demiştir: Enes b. Malik bana şöyle anlatmıştı: Nebi Sallallahu Aleyhi ve Sellem Hayber halkı ile savaş sona erip de Medine'ye dönünce muhacirlerin meyvesinden faydalandıkları ağaçları ensara geri verdiler. Hz. Nebi de hurma ağaçlarını Enes'in annesine geri verdi ve bu ağaçlar yerine Ümmü Eymen'e kendi bahçesinin bir bölümünü verdi. Tekrar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 62
      },
      "narrator": {
        "en": "Ibn Shihab Az-Zuhri"
      }
    },
    {
      "hadithNumber": 2631,
      "arabicNumber": 2631,
      "book": 51,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ حَسَّانَ بْنِ عَطِيَّةَ، عَنْ أَبِي كَبْشَةَ السَّلُولِيِّ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَرْبَعُونَ خَصْلَةً أَعْلاَهُنَّ مَنِيحَةُ الْعَنْزِ، مَا مِنْ عَامِلٍ يَعْمَلُ بِخَصْلَةٍ مِنْهَا رَجَاءَ ثَوَابِهَا وَتَصْدِيقَ مَوْعُودِهَا إِلاَّ أَدْخَلَهُ اللَّهُ بِهَا الْجَنَّةَ ‏\"‏‏.‏ قَالَ حَسَّانُ فَعَدَدْنَا مَا دُونَ مَنِيحَةِ الْعَنْزِ مِنْ رَدِّ السَّلاَمِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِمَاطَةِ الأَذَى عَنِ الطَّرِيقِ وَنَحْوِهِ، فَمَا اسْتَطَعْنَا أَنْ نَبْلُغَ خَمْسَ عَشْرَةَ خَصْلَةً‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Amr:That Allah's Messenger (ﷺ) said, \"There are forty virtuous deeds and the best of them is the Maniha of a she-goat, and anyone who does one of these virtuous deeds hoping for Allah's reward with firm confidence that he will get it, then Allah will make him enter Paradise because of it. Hassan (a subnarrator) said, \"We tried to count those good deeds below the Maniha; we mentioned replying to the sneezer, removing harmful things from the road, etc., but we failed to count even fifteen",
          "ur": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے عیسیٰ بن یونس نے بیان کیا، انہوں نے کہا ہم سے اوزاعی نے بیان کیا حسان بن عطیہ سے، ان سے ابوکبشہ سلولی نے اور انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے سنا، آپ بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، چالیس خصلتیں جن میں سب سے اعلیٰ و ارفع۔ دودھ دینے والی بکری کا ہدیہ کرنا ہے۔ ایسی ہیں کہ جو شخص ان میں سے ایک خصلت پر بھی عامل ہو گا ثواب کی نیت سے اور اللہ کے وعدے کو سچا سمجھتے ہوئے تو اللہ تعالیٰ اس کی وجہ سے اسے جنت میں داخل کرے گا۔ حسان نے کہا کہ دودھ دینے والی بکری کے ہدیہ کو چھوڑ کر ہم نے سلام کا جواب دینا، چھینکنے والے کا جواب دینا اور تکلیف دینے والی چیز کو راستے سے ہٹا دینے وغیرہ کا شمار کیا، تو سب پندرہ خصلتیں بھی ہم شمار نہ کر سکے۔",
          "fr": "Rapporté par `Abdullah bin `Amr : Le Messager d’Allah (ﷺ) a dit : « Il y a quarante bonnes actions, et la meilleure d’entre elles est d’offrir une chèvre en Maniha. Celui qui fait l’une de ces bonnes actions en espérant la récompense d’Allah, avec la certitude de l’obtenir, Allah le fera entrer au Paradis grâce à cela. » Hassan (un sous-narrateur) a dit : « Nous avons essayé de compter ces bonnes actions en dessous de la Maniha ; nous avons mentionné répondre à quelqu’un qui éternue, enlever quelque chose de gênant du chemin, etc., mais nous n’avons même pas réussi à en compter quinze. »",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami ['Isa bin Yunus] telah menceritakan kepada kami [Al Awza'iy] dari [Hassan bin 'Athiyyah] dari [Abu Kabsyah] (Kabsyah tabi'in, tak jumpa Sahabat) -Saluliy aku mendengar ['Abdullah bin 'Amru radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada empat puluh kebiasaan baik, yang tertingginya adalah memberi seekor kambing. Tidaklah seseorang beramal dari perbuatan-perbuatan kebaikan tersebut dengan harapan dia mengharap pahala darinya dan membenarkan apa yang dijanjikan padanya, melainkan Allah memasukkannya dengan amalnya ke dalam surga\". Hassan berkata: \"Maka kami menghitung kebiasaan baik itu setelah pemberian kambing mulai dari menjawab salam, menjawab orang yang bersin, menyingkirkan halangan dari jalan dan yang semisalnya namun kami tidak sanggup untuk sampai pada lima belas kebiasaan baik tersebut",
          "tr": "Ebu Kebşe es-Seluli'den rivayet edilmiştir: Abdullah b. Amr r.a.'ın şöyle dediğini işittim: Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kırk iyilik vardır ki bunların en üstünü, birine sütünden faydalanması için verilen keçidir. Her kim sevabını umarak ve vaad edileni tasdik ederek bu iyiliklerden birini yaparsa Allah bu iyiliği sebebiyle onu Cennet'e sokar.\" Hassan şöyle demiştir: Biz sütünden faydalanılması için verilen keçi dışında, verilen selamı almak, aksırana dua etmek ve yoldan insanlara sıkıntı veren bir şeyi kaldırmak gibi iyilikleri saydık ama on beş iyiliğe ulaşamadık"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 63
      },
      "narrator": {
        "en": "`Abdullah bin `Amr"
      }
    },
    {
      "hadithNumber": 2632,
      "arabicNumber": 2632,
      "book": 51,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي عَطَاءٌ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ كَانَتْ لِرِجَالٍ مِنَّا فُضُولُ أَرَضِينَ فَقَالُوا نُؤَاجِرُهَا بِالثُّلُثِ وَالرُّبُعِ وَالنِّصْفِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ، فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Jabir:Some men had superfluous land and they said that they would give it to others to cultivate on the condition that they would get one-third or one-fourth or one half of its yield. The Prophet (ﷺ) said, \"Whoever has land should cultivate it himself or give it to his brother or keep it uncultivated",
          "ur": "ہم سے محمد بن یوسف نے بیان کیا، کہا ہم سے اوزاعی نے بیان کیا، کہا کہ مجھ سے عطاء نے بیان کیا، ان سے جابر رضی اللہ عنہ نے بیان کیا کہ ہم میں سے بہت سے اصحاب کے پاس فالتو زمین بھی تھی، انہوں نے کہا تھا کہ تہائی یا چوتھائی یا نصف کی بٹائی پر ہم کیوں نہ اسے دے دیا کریں۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس کے پاس زمین ہو تو اسے خود بونی چاہئے یا پھر کسی اپنے بھائی کو ہدیہ کر دینی چاہئے اور اگر ایسا نہیں کرتا تو پھر زمین اپنے پاس رکھے رہے۔“",
          "fr": "Rapporté par Jabir : Certains hommes avaient des terres en surplus et disaient qu’ils les donneraient à d’autres pour les cultiver à condition d’en recevoir un tiers, un quart ou la moitié de la récolte. Le Prophète (ﷺ) a dit : « Celui qui a une terre doit la cultiver lui-même, la donner à son frère ou la laisser en friche. »",
          "tr": "Cabir r.a.'den rivayet edilmiştir: İçimizde bazılarının ihtiyaçlarından fazla toprakları vardı. \"Üçte bir, dörtte bir ve yarı karşılığında bu topraklarımızı kiraya verelim\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem -\"Her kimin toprağı varsa onu kendisi ekip diksin veya din kardeşine bağışlasın. Böyle yapmak istemezse toprağını elinde tutsun\" buyurdu:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 64
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 2633,
      "arabicNumber": 2633,
      "book": 51,
      "hadithInBook": 65,
      "text": {
        "arabic": "وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي الزُّهْرِيُّ، حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ، حَدَّثَنِي أَبُو سَعِيدٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهُ عَنِ الْهِجْرَةِ، فَقَالَ ‏\"‏ وَيْحَكَ إِنَّ الْهِجْرَةَ شَأْنُهَا شَدِيدٌ فَهَلْ لَكَ مِنْ إِبِلٍ ‏\"‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَتُعْطِي صَدَقَتَهَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَهَلْ تَمْنَحُ مِنْهَا شَيْئًا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَتَحْلُبُهَا يَوْمَ وِرْدِهَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاعْمَلْ مِنْ وَرَاءِ الْبِحَارِ، فَإِنَّ اللَّهَ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id:A bedouin came to the Prophet (ﷺ) and asked him about emigration. The Prophet (ﷺ) said to him, \"May Allah be merciful to you. The matter of emigration is difficult. Have you got some camels?\" He replied in the affirmative. The Prophet (ﷺ) asked him, \"Do you pay their Zakat?\" He replied in the affirmative. He asked, \"Do you lend them so that their milk may be utilized by others?\" The bedouin said, \"Yes.\" The Prophet (ﷺ) asked, \"Do you milk them on the day of watering them?\" He replied, \"Yes.\" The Prophet (ﷺ) said, \"Do good deeds beyond the merchants (or the sea) and Allah will never disregard any of your deeds.\" (See Hadith No. 260, Vol)",
          "ur": "اور محمد بن یوسف نے بیان کیا، ان سے اوزاعی نے بیان کیا، ان سے زہری نے بیان کیا، ان سے عطاء بن یزید نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ ایک دیہاتی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے ہجرت کے لیے پوچھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ”اللہ تم پر رحم کرے۔ ہجرت کا تو بڑا ہی دشوار معاملہ ہے۔ تمہارے پاس اونٹ بھی ہے؟“ انہوں نے کہا جی ہاں! آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”اور اس کا صدقہ ( زکوٰۃ ) بھی ادا کرتے ہو؟“ انہوں نے کہا جی ہاں! آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”اس میں سے کچھ ہدیہ بھی دیتے ہو؟“ انہوں نے کہا جی ہاں! آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”تو تم اسے پانی پلانے کے لیے گھاٹ پر لے جانے والے دن دوہتے ہو گے؟“ انہوں نے کہا جی ہاں! پھر آپ صلی اللہ علیہ وسلم نے فرمایا ”سمندروں کے پار بھی اگر تم عمل کرو گے تو اللہ تعالیٰ تمہارے عمل میں سے کوئی چیز کم نہیں کرے گا۔“",
          "fr": "Rapporté par Abu Sa`id : Un bédouin est venu voir le Prophète (ﷺ) et lui a demandé au sujet de l’émigration. Le Prophète (ﷺ) lui a dit : « Qu’Allah te fasse miséricorde. L’émigration est une chose difficile. As-tu des chameaux ? » Il a répondu oui. Le Prophète (ﷺ) lui a demandé : « Paies-tu leur Zakat ? » Il a répondu oui. Il a demandé : « Les prêtes-tu pour que d’autres profitent de leur lait ? » Le bédouin a dit oui. Le Prophète (ﷺ) a demandé : « Les traites-tu le jour où tu ne les abreuves pas ? » Il a répondu oui. Le Prophète (ﷺ) a dit : « Fais de bonnes actions, même au-delà des marchands (ou de la mer), et Allah ne négligera jamais aucune de tes actions. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Al Awza'iy] berkata, telah menceritakan kepadaku ['Atho'] dari [Jabir radliallahu 'anhu] berkata; Ada orang-orang dari kami yang memiliki banyak lahan tanah. Mereka berkata: \"Kami akan sewakan dengan pembagian sepertiga, seperempat dan atau setengah\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang memiliki lahan hendaklah dia tanami atau dia berikan kepada saudaranya untuk digarap. Jika dia tidak mau, hendaklah dia biarkan tanahnya\". Dan Mujahid bin Yusuf berkata, telah menceritakan kepada kami Al Awza'iy telah menceritakan kepadaku Az Zuhriy telah menceritakan kapadaku 'Atho' bin Yazid telah menceritakan kapadaku Abu Sa'id berkata: \"Datang seorang Baduy kepada Nabi shallallahu 'alaihi wasallam lalu bertanya tentang hijrah. Maka Beliau menjawab: \"Bagaimana kamu ini, sesungguhnya hijrah adalah perkara yang berat. Apakah kamu ada memiliki unta?\" Dia menjawab: \"Ya punya\". Lalu Beliau bertanya: \"Apakah kamu mengeluarkan zakatnya?\" Dia menjawab: \"Ya\". Beliau bertanya lagi: \"Apakah ada darinya yang kamu berikan (hadiahkan)?\" Dia menjawab: \"Ya\". Beliau bertanya lagi: \"Apakah kamu memberinya susu saat kehausan?\" Dia menjawab: \"Ya\". Maka Beliau bersabda: \"Beramallah kamu dari seberang lautan karena Allah tidak akan mengurangi sedikitpun dari amalan kamu",
          "tr": "Ebu Said r.a.'den rivayet edilmiştir: Bir bedevi Nebi Sallallahu Aleyhi ve Sellem'e gelerek hicreti sordu. Nebi Sallallahu Aleyhi ve Sellem: \"Hey gidi hey! Hicret zor iştir. Senin deven var mı?\" buyurdu. Bedevi \"evet\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Peki onun sadakasını veriyor musun?\" diye sordu. Bedevi \"evet\" dedi. Hz. Nebi (Sallallahu aleyhi ve Sellem): \"Sütünden bir kısmını hediye ediyor musun?\" diye sordu. Bedevi \"evet\" dedi. Hz. Nebi: \"Sulama gününde sütünü sağıyor musun (orada bulunan fakirlere bir miktar süt veriyor musun?)\" diye sordu. Bedevi \"evet\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"İstersen denizlerin ötesinde çalış. Allah senin yaptıklarından hiçbirini zayi etmeyecektir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 65
      },
      "narrator": {
        "en": "Abu Sa`id"
      }
    },
    {
      "hadithNumber": 2634,
      "arabicNumber": 2634,
      "book": 51,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، قَالَ حَدَّثَنِي أَعْلَمُهُمْ، بِذَاكَ ـ يَعْنِي ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى أَرْضٍ تَهْتَزُّ زَرْعًا فَقَالَ ‏\"‏ لِمَنْ هَذِهِ ‏\"‏‏.‏ فَقَالُوا اكْتَرَاهَا فُلاَنٌ‏.‏ فَقَالَ ‏\"‏ أَمَا إِنَّهُ لَوْ مَنَحَهَا إِيَّاهُ كَانَ خَيْرًا لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا أَجْرًا مَعْلُومًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Tawus:That he was told by the most learned one amongst them (i.e. Ibn `Abbas) that the Prophet (ﷺ) went towards some land which was flourishing with vegetation and asked to whom it belonged. He was told that such and such a person took it on rent. The Prophet (ﷺ) said, \"It would have been better (for the owner) if he had given it to him gratis rather than charging him a fixed rent",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، کہا ہم سے ایوب نے بیان کیا، ان سے عمرو نے، ان سے طاؤس نے بیان کیا کہ مجھ سے ان میں سب سے زیادہ اس (مخابرہ) کے جاننے والے نے بیان کیا، ان کی مراد ابن عباس رضی اللہ عنہما سے تھی کہ نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ ایسے کھیت کی طرف تشریف لے گئے جس کی کھیتی لہلہا رہی تھی، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ”یہ کس کا ہے؟“ صحابہ رضی اللہ عنہم نے بتلایا کہ فلاں نے اسے کرایہ پر لیا ہے۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا ”اگر وہ ہدیتاً دے دیتا تو اس سے بہتر تھا کہ اس پر ایک مقررہ اجرت وصول کرتا۔“",
          "fr": "Rapporté par Tawus : Il a été informé par le plus savant d’entre eux (c’est-à-dire Ibn `Abbas) que le Prophète (ﷺ) s’est dirigé vers une terre verdoyante et a demandé à qui elle appartenait. On lui a répondu qu’un tel l’avait louée. Le Prophète (ﷺ) a dit : « Il aurait été mieux (pour le propriétaire) de la donner gratuitement plutôt que de demander un loyer fixe. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami ['Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari ['Amru] dari [Thawus] berkata, telah menceritakan kepadaku orang yang paling mengerti diantara mereka yakni [Ibnu 'Abbas radliallahu 'anhuma] bahwa Nabi shallallahu 'alaihi wasallam keluar menuju suatu lahan tanah yang ditumbuhi tanaman lalu Beliau berkata: \"Milik siapakah ini?\" Mereka berkata: \"Si fulan menyewakannya\". Maka Beliau berkata: \"Seandainya dia menghadiahkannya kepadanya itu, kebih baik baginya dari pada dia mengambil upah tertentu",
          "tr": "Abdullah b. Abbas r.a.'dan rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem ekini bol olan bir tarlaya rastladı ve \"Burası kime aittir?\" diye sordu. \"Burasını falanca kişi kiraladı\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"İyi bilin ki tarlanın sahibi, burasını bu kişiye karşılıksız vermiş olsaydı (alacağı sevap) onun için belirli bir ücret almaktan çok daha iyi olurdu\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 66
      },
      "narrator": {
        "en": "Tawus"
      }
    },
    {
      "hadithNumber": 2635,
      "arabicNumber": 2635,
      "book": 51,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ هَاجَرَ إِبْرَاهِيمُ بِسَارَةَ، فَأَعْطَوْهَا آجَرَ، فَرَجَعَتْ فَقَالَتْ أَشَعَرْتَ أَنَّ اللَّهَ كَبَتَ الْكَافِرَ وَأَخْدَمَ وَلِيدَةً ‏\"‏‏.‏ وَقَالَ ابْنُ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ فَأَخْدَمَهَا هَاجَرَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"The Prophet Abraham (ﷺ) migrated with Sarah. The people (of the town where they migrated) gave her Ajar (i.e. Hajar). Sarah returned and said to Abraham, \"Do you know that Allah has humiliated that pagan and he has given a slave-girl for my service?",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا کہ ہم کو شعیب نے خبر دی، ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”ابراہیم علیہ السلام نے سارہ علیہا السلام کے ساتھ ہجرت کی تو انہیں بادشاہ نے آجر کو ( یعنی ہاجرہ علیہا السلام کو ) عطیہ میں دے دیا۔ پھر وہ واپس ہوئیں اور ابراہیم علیہ السلام سے کہا، دیکھا آپ نے اللہ تعالیٰ نے کافر کو کس طرح ذلیل کیا اور ایک لڑکی خدمت کے لیے بھی دے دی۔ ابن سیرین نے کہا، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا کہ بادشاہ نے ہاجرہ کو ان کی خدمت کے لیے دے دیا تھا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Le Prophète (ﷺ) Abraham a émigré avec Sarah. Les gens de la ville où ils sont arrivés ont donné à Sarah Ajar (c’est-à-dire Hajar). Sarah est revenue et a dit à Abraham : “Sais-tu qu’Allah a humilié ce païen et m’a donné une esclave pour me servir ?” »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Nabi Ibrahim Alaihissalam berhijrah bersama Sarah lalu diberi Ajara (Siti Hajar), lalu Sarah kembali dan berkata: \"Apakah kamu mengerti bahwa Allah telah mengenyahkan orang kafir dan menghadiahi seorang hamba sahaya?\" Dan berkata [Ibnu Sirin] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam: \"Menghadiahkan Hajar sebagai pelayan",
          "tr": "Ebu Hureyre r.a.'den rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem buyurduki: \"İbrahim Sare ile hicret etmişti. Ona bir hizmetçi (Acer - Hacer) vermişlerdi. İbrahim'in yanına döndüğünde İbrahim (A.S.) \"Gördün mü Allah kafirin elini boşa çıkardı ve cariyeyi hizmetimize verdi\" dedi.\" İbn Sirin Ebu Hureyre'den Nebi'in Sallallahu Aleyhi ve Sellem \"Hacer'i onun hizmetine verdi\" buyurduğunu nakletmiştir. (Buhari burada hadisi muhtasar olarak zikretmiştir. Tam metin 2217 nolu hadistir)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 67
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2636,
      "arabicNumber": 2636,
      "book": 51,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، أَخْبَرَنَا سُفْيَانُ، قَالَ سَمِعْتُ مَالِكًا، يَسْأَلُ زَيْدَ بْنَ أَسْلَمَ قَالَ سَمِعْتُ أَبِي يَقُولُ، قَالَ عُمَرُ ـ رضى الله عنه ـ حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ، فَرَأَيْتُهُ يُبَاعُ، فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تَشْتَرِ، وَلاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Umar bin Al-Khattab:Once I gave a horse (for riding) in Allah's Cause. Later I saw it being sold. I asked Allah's Messenger (ﷺ) (whether I could buy it). He said, \"Don't buy it, for you should not get back what you have given in charity",
          "ur": "ہم سے حمیدی نے بیان کیا، کہا ہم کو سفیان نے خبر دی، کہا کہ میں نے مالک سے سنا، انہوں نے زید بن اسلم سے پوچھا تھا تو انہوں نے بیان کیا کہ میں نے اپنے باپ سے سنا وہ بیان کرتے تھے کہ عمر رضی اللہ عنہ نے کہا میں نے ایک گھوڑا اللہ کے راستے میں جہاد کے لیے ایک شخص کو دے دیا تھا، پھر میں نے دیکھا کہ وہ اسے بیچ رہا ہے۔ اس لیے میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ اسے واپس میں ہی خرید لوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا ”اس گھوڑے کو نہ خرید۔ اپنا دیا ہوا صدقہ واپس نہ لو۔“",
          "fr": "Rapporté par `Umar bin Al-Khattab : Une fois, j’ai donné un cheval (pour la cause d’Allah). Plus tard, je l’ai vu en vente. J’ai demandé au Messager d’Allah (ﷺ) si je pouvais l’acheter. Il a dit : « Ne l’achète pas, car tu ne dois pas reprendre ce que tu as donné en aumône. »",
          "id": "Telah menceritakan kepada kami [Al Humaidiy] telah mengabarkan kepada kami [Sufyan] berkata, aku mendengar Malik bertanya kepada [Zaid bin Aslam] berkata, aku mendengar [Bapakku] berkata; ['Umar radliallahu 'anhu] berkata: \"Aku membawa (menghibahkan) kuda di jalan Allah kemudian aku melihat kuda itu dijual. Aku tanyakan hal ini kepada Rasulullah shallallahu 'alaihi wasallam maka Beliau bersabda: \"Jangan kamu beli dan jangan pula kamu minta kembali shadaqahmu",
          "tr": "Zeyd b. Eslem'den rivayet edilmiştir: Babamı şöyle derken işittim: Ömer r.a. şöyle dedi: Birini Allah yolunda at'a bindirmiştim. (Cihadda kullansın diye ona bir at bağışlamıştım). Atın (pazarda) satılığa çıkartıldığını gördüm. Hemen Allah Resulülne giderek atı satın almak konusunda kendisine danıştım. Nebi Sallallahu Aleyhi ve Sellem: \"Onu satın alma, sadakandan dönme\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 51,
        "hadith": 68
      },
      "narrator": {
        "en": "`Umar bin Al-Khattab"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "48KB"
  }
}