{
  "collection": "bukhari",
  "book": 85,
  "name": {
    "arabic": "كتاب Laws of Inheritance (Al-Faraa'id)",
    "transliteration": "laws of inheritance (al-faraa'id)",
    "translation": "Laws of Inheritance (Al-Faraa'id)"
  },
  "totalHadith": 47,
  "hadithNumberRange": {
    "first": 6723,
    "last": 6771
  },
  "content": [
    {
      "hadithNumber": 6723,
      "arabicNumber": 6723,
      "book": 85,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ مَرِضْتُ فَعَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَأَتَانِي وَقَدْ أُغْمِيَ عَلَىَّ فَتَوَضَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَبَّ عَلَىَّ وَضُوءَهُ فَأَفَقْتُ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِي مَالِي، كَيْفَ أَقْضِي فِي مَالِي فَلَمْ يُجِبْنِي بِشَىْءٍ حَتَّى نَزَلَتْ آيَةُ الْمَوَارِيثِ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:I became sick so Allah's Messenger (ﷺ) and Abu Bakr came on foot to pay me a visit. When they came, I was unconscious. Allah's Messenger (ﷺ) performed ablution and he poured over me the water (of his ablution) and I came to my senses and said, \"O Allah's Messenger (ﷺ)! What shall I do regarding my property? How shall I distribute it?\" The Prophet (ﷺ) did not reply till the Divine Verses of inheritance were revealed",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے محمد بن منکدر نے، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ میں بیمار پڑا تو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ میری عیادت کے لیے تشریف لائے، دونوں حضرات پیدل چل کر آئے تھے۔ دونوں حضرات جب آئے تو مجھ پر غشی طاری تھی، نبی کریم صلی اللہ علیہ وسلم نے وضو کیا اور وضو کا پانی میرے اوپر چھڑکا مجھے ہوش ہوا تو میں نے عرض کیا: یا رسول اللہ! اپنے مال کی ( تقسیم ) کس طرح کروں؟ یا اپنے مال کا کس طرح فیصلہ کروں؟ نبی کریم صلی اللہ علیہ وسلم نے مجھے کوئی جواب نہیں دیا، یہاں تک کہ میراث کی آیتیں نازل ہوئیں۔",
          "fr": "Rapporté par Jabir bin `Abdullah : Je suis tombé malade, alors le Messager d’Allah (ﷺ) et Abu Bakr sont venus me rendre visite à pied. Quand ils sont arrivés, j’étais inconscient. Le Messager d’Allah (ﷺ) a fait ses ablutions puis il a versé l’eau de ses ablutions sur moi et j’ai repris connaissance. J’ai dit : « Ô Messager d’Allah (ﷺ) ! Que dois-je faire de mes biens ? Comment dois-je les distribuer ? » Le Prophète (ﷺ) n’a pas répondu jusqu’à ce que les versets divins sur l’héritage soient révélés",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir], ia mendengar [Jabir bin Abdullah] radliallahu 'anhuma mengatakan; aku pernah sakit, Rasulullah Shallallahu'alaihiwasallam dan Abu Bakar menjengukku dengan berjalan kaki. Keduanya mendatangiku ketika aku sedang pingsan, maka Rasulullah Shallallahu'alaihi wa sallam berwudhu', dan sisa wudhunya beliau guyurkan kepadaku sehingga aku siuman (sadar). Maka aku bertanya; 'Bagaimana yang harus aku lakukan terhadap hartaku?, bagaimana yang ahrus aku putuskan terhadap hartaku? ' Rasulullah Shallallahu'alaihiwasallam sama sekali tidak menjawab sepatah kata pun hingga turun ayat waris",
          "tr": "Cabir b. Abdullah şöyle anlatmıştır: Ben hastalandım. Resulullah Sallallahu Aleyhi ve Sellem ile Ebu Bekir yürüyerek beni ziyarete geldiler. Bana geldiklerinde bayılmışım. Nebi Sallallahu Aleyhi ve Sellem abdest alıp abdest suyundan benim üzerime serpmiş. Sonra ayıldım. Kendisine \"Ya Resulallah! Ben malım hususunda nasıl davranayım? Malım hususunda nasıl hükmedeyim?\" diye sordum. Resulullah Sallallahu Aleyhi ve Sellem bana hiçbir cevap vermedi. Nihayet miras payları ayeti indi. Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı başlıktaki \"feraiz\" kelimesi \"farıza\"nın çoğuludur. Tıpkı \"hadaik\" kelimesinin \"hadıka\"nın çoğulu olduğu gibi. \"Farıza\" \"kesmek\" anfamına olan \"farz\" kökünden alınma olup, \"faııe\" kalıbında ve ayrılmış paylar anlamınadır. Ragıb şöyle der: Arapça'da \"el-farz\" sert olan bir şeyi kesmek ve ona tesir etmek anlamına gelir. Miras olarak bırakılan mallara \"feraiz\" ismi, ayetteki \"nasiben mafrCıdan\" ifadesinden alınmıştır. MafrCıd, takdir edilmiş veya malum ya da başkalarından kesilip ayrılmış anlamına gelir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 1
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 6724,
      "arabicNumber": 6724,
      "book": 85,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَحَسَّسُوا، وَلاَ تَجَسَّسُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, 'Beware of suspicion, for it is the worst of false tales and don't look for the other's faults and don't spy and don't hate each other, and don't desert (cut your relations with) one another O Allah's slaves, be brothers!\" (See Hadith No)",
          "ur": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ بن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”بدگمانی سے بچتے رہو، کیونکہ گمان ( بدظنی ) سب سے جھوٹی بات ہے۔ آپس میں ایک دوسرے کی برائی کی تلاش میں نہ لگے رہو نہ ایک دوسرے سے بغض رکھو اور نہ پیٹھ پیچھے کسی کی برائی کرو، بلکہ اللہ کے بندے بھائی بھائی بن کر رہو۔“",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Méfiez-vous des soupçons, car c’est la pire des fausses histoires. Ne cherchez pas les défauts des autres, ne vous espionnez pas, ne vous détestez pas et ne coupez pas vos liens les uns avec les autres. Ô serviteurs d’Allah, soyez frères ! »",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Abu Hurairah] mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jauhilah prasangka sebab prasangka adalah ucapan yang paling dusta, janganlah kalian mencari-cari kesalahan, janganlah kalian saling memata-matai, janganlah kalian saling marah, janganlah kalian saling membelakangi, dan jadilah hamba-hamba Allah yang bersaudara",
          "tr": "Ebu Hureyre r.a.'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zandan sakının! Çünkü zan, sözlerin en yalanıdır. Birbirinizin özel hayatını işitmeye çalışmayın, birbirinizin mahrem hayatını araştırmayın. Birbirinize karşılıklı kin beslemeyin, birbirinize arka dönüp yüz çevirmeyin. Ey Allah'ın kulları! Birbirinize kardeşler olun.\" Fethu'l-Bari Açıklaması: Ukbe b. Amir'in \"Zanna dayanarak konuşanlardan önce\" şeklindeki ifadesi, o zamanın insanlarının nassın çizgisinden ayrılmadıklarına, onu aşmadıklarına ve bazılarından görüşe dayanarak nakledilen fetvanın nispeten az olduğuna işa- . ret etmektedir. Bu ifadede ayrıca reye dayanarak hüküm veren birçok kişinin sebep olduğu şeylere uyarı vardır. Bazıları Ukbe'nin maksadı, feraiz ilminin yok olmasından ve ilme dayanmaksızın sırf zannına göre konuşan kimselerin ortaya çıkmasından öncesine dikkat çekmektir• demişlerdir. İbnü'l-Müneyyir şöyle demiştir: İmam Buharl'nin, Ukb.e'nin feraize dair ifadesini başlık olarak kullanmasının sebebi, bu ilmin diğerlerine nazaran daha kapsamlı olmasındandır. Çünkü feraiz ilminde ağır basan taraf, taabbudllik, reye yer olmaması ve zanna göre konuşma!!ın sınırlarının tespit edilebilir qlmamasıdır. Diğer ilim dalları ise bunun aksinedir. Çünkü o dallarda reye yer vardır ve genellikle reye dayanarak sınırlarını tespit etmek mümkündür. Bu açıklamadan yukarıdaki merfu hadisin başlık için hangi münasebetle seçildiği ortaya çıkmaktadır. Bazılarına göre hadisin başlığa uygunluğu, zanna göre amelin yasaklanmasının, i1me göre ameli teşvik içermesine işaret etmesinden dolayıdır. Bu da feraiz ilminin öğrenilmesinin bir yan koludur. Feraiz ilmi genellikle daha önce açıklandığı üzere ilim yoluyla öğrenilir. İmam Buhari bundan sonra Ebu Hureyre'nin rivayet ettiği \"Zandan kaçınınız\" hadisine yer vermektedir. Bu hadis bir başka açıdan edep bölümünün baş taraflarında \"Karşılıklı Kıskanmanın Yasaklığı\" başlığı altında geçmişti. Orada hadis yeteri kadar açıklanmıştı. Hadiste buradaki zandan maksadın ne olduğu da açıklanmakta ve bunun herhangi bir esasa dayanmayan şeyolduğu vurgu lanmaktadır. Bir Müslüman hakkında kötü zan beslemek de buna dahildir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 2
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6726,
      "arabicNumber": 6726,
      "book": 85,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ ـ عَلَيْهِمَا السَّلاَمُ ـ أَتَيَا أَبَا بَكْرٍ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَيْهِمَا مِنْ فَدَكَ، وَسَهْمَهُمَا مِنْ خَيْبَرَ‏.‏ فَقَالَ لَهُمَا أَبُو بَكْرٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ نُورَثُ، مَا تَرَكْنَا صَدَقَةٌ، إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ مِنْ هَذَا الْمَالِ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ وَاللَّهِ لاَ أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُهُ فِيهِ إِلاَّ صَنَعْتُهُ‏.‏ قَالَ فَهَجَرَتْهُ فَاطِمَةُ، فَلَمْ تُكَلِّمْهُ حَتَّى مَاتَتْ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Fatima and Al `Abbas came to Abu Bakr, seeking their share from the property of Allah's Messenger (ﷺ) and at that time, they were asking for their land at Fadak and their share from Khaibar. Abu Bakr said to them, \" I have heard from Allah's Messenger (ﷺ) saying, 'Our property cannot be inherited, and whatever we leave is to be spent in charity, but the family of Muhammad may take their provisions from this property.\" Abu Bakr added, \"By Allah, I will not leave the procedure I saw Allah's Messenger (ﷺ) following during his lifetime concerning this property.\" Therefore Fatima left Abu Bakr and did not speak to him till she died",
          "fr": "Rapporté par `Aisha : Fatima et Al `Abbas sont venus voir Abu Bakr pour demander leur part des biens du Messager d’Allah (ﷺ). À ce moment-là, ils réclamaient leur terre à Fadak et leur part de Khaibar. Abu Bakr leur a dit : « J’ai entendu le Messager d’Allah (ﷺ) dire : “Nos biens ne peuvent pas être hérités, et tout ce que nous laissons doit être dépensé en aumône, mais la famille de Muhammad peut prendre sa subsistance sur ces biens.” » Abu Bakr ajouta : « Par Allah, je ne changerai pas la manière dont j’ai vu le Messager d’Allah (ﷺ) gérer ces biens de son vivant. » À cause de cela, Fatima quitta Abu Bakr et ne lui parla plus jusqu’à sa mort",
          "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] bahwasanya Fathimah dan Abbas alaihimassalam mendatangi [Abu Bakar] untuk memperoleh warisan keduanya dari Rasulullah Shallallahu'alaihiwasallam, ketika itu keduanya meminta tanah bagiannya di Fadak, dan bagiannya di Khaibar. Maka Abu Bakar menjawab; 'Aku pernah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Kami tidak diwarisi dan semua yang kami tinggalkan adalah sedekah, dan hanyasanya keluarga Muhammad dari harta ini.\" Lanjut Abu Bakar; 'Demi Allah, tidaklah aku tinggalkan sebuah urusan yang kulihat Rsulullah Shallallahu'alaihiwasallam melaksanakannya, selain aku juga melaksanakan seperti yang dilaksanakannya.' Kata 'Urwah, semenjak itu Fathimah terus menjauhi Abu Bakar dan tidak pernah mengajaknya bicara hingga ia menjemput ajalnya. Telah menceritakan kepada kami [Isma'il bin Abban] telah menceritakan kepada kami [Ibnul Mubarak] dari [Yunus] dari [Az Zuhri] dari [Urwah] dari [Aisyah] bahwasanya Nabi shallallahu 'alaihi wasallam bersabda: \"kami tidak di warisi dan harta yang kami tinggalkan sebagai sedekah",
          "tr": "Aişe r.anha'nın nakline göre Hz. Fatıma ile Abbas, Ebu Bekir r.a.'e gelerek Fedek ve Hayber topraklarından hisselerini istediler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 3
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 6727,
      "arabicNumber": 6727,
      "book": 85,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Aisha:The Prophet (ﷺ) said, \"Our (Apostles') property should not be inherited, and whatever we leave, is to be spent in charity",
          "ur": "ہم سے اسماعیل بن ابان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے، انہیں زہری نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ہماری وراثت نہیں ہوتی ہم جو کچھ بھی چھوڑیں وہ صدقہ ہے۔“",
          "fr": "Rapporté par `Aisha : Le Prophète (ﷺ) a dit : « Nos biens (des Prophètes) ne doivent pas être hérités, et tout ce que nous laissons doit être dépensé en aumône. »",
          "tr": "Aişe r.anhs.'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Biz Nebiler topluluğuna mirasçı olunmaz. Geriye bıraktığımız her mal sadakadır\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 4
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 6728,
      "arabicNumber": 6728,
      "book": 85,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ،، وَكَانَ، مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ ذَكَرَ لِي مِنْ حَدِيثِهِ ذَلِكَ، فَانْطَلَقْتُ حَتَّى دَخَلْتُ عَلَيْهِ فَسَأَلْتُهُ فَقَالَ انْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى عُمَرَ فَأَتَاهُ حَاجِبُهُ يَرْفَأُ فَقَالَ هَلْ لَكَ فِي عُثْمَانَ وَعَبْدِ الرَّحْمَنِ وَالزُّبَيْرِ وَسَعْدٍ قَالَ نَعَمْ‏.‏ فَأَذِنَ لَهُمْ، ثُمَّ قَالَ هَلْ لَكَ فِي عَلِيٍّ وَعَبَّاسٍ قَالَ نَعَمْ‏.‏ قَالَ عَبَّاسٌ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا‏.‏ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ هَلْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏ يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم نَفْسَهُ‏.‏ فَقَالَ الرَّهْطُ قَدْ قَالَ ذَلِكَ‏.‏ فَأَقْبَلَ عَلَى عَلِيٍّ وَعَبَّاسٍ فَقَالَ هَلْ تَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ذَلِكَ قَالاَ قَدْ قَالَ ذَلِكَ‏.‏ قَالَ عُمَرُ فَإِنِّي أُحَدِّثُكُمْ عَنْ هَذَا الأَمْرِ، إِنَّ اللَّهَ قَدْ كَانَ خَصَّ رَسُولَهُ صلى الله عليه وسلم فِي هَذَا الْفَىْءِ بِشَىْءٍ لَمْ يُعْطِهِ أَحَدًا غَيْرَهُ، فَقَالَ عَزَّ وَجَلَّ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدِيرٌ‏}‏ فَكَانَتْ خَالِصَةً لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ، وَلاَ اسْتَأْثَرَ بِهَا عَلَيْكُمْ، لَقَدْ أَعْطَاكُمُوهُ وَبَثَّهَا فِيكُمْ، حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ، فَكَانَ النَّبِيُّ صلى الله عليه وسلم يُنْفِقُ عَلَى أَهْلِهِ مِنْ هَذَا الْمَالِ نَفَقَةَ سَنَتِهِ، ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ، فَعَمِلَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيَاتَهُ، أَنْشُدُكُمْ بِاللَّهِ هَلْ تَعْلَمُونَ ذَلِكَ قَالُوا نَعَمْ‏.‏ ثُمَّ قَالَ لِعَلِيٍّ وَعَبَّاسٍ أَنْشُدُكُمَا بِاللَّهِ هَلْ تَعْلَمَانِ ذَلِكَ قَالاَ نَعَمْ‏.‏ فَتَوَفَّى اللَّهُ نَبِيَّهُ صلى الله عليه وسلم فَقَالَ أَبُو بَكْرٍ أَنَا وَلِيُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضَهَا فَعَمِلَ بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ تَوَفَّى اللَّهُ أَبَا بَكْرٍ فَقُلْتُ أَنَا وَلِيُّ وَلِيِّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَضْتُهَا سَنَتَيْنِ أَعْمَلُ فِيهَا مَا عَمِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ، ثُمَّ جِئْتُمَانِي وَكَلِمَتُكُمَا وَاحِدَةٌ، وَأَمْرُكُمَا جَمِيعٌ، جِئْتَنِي تَسْأَلُنِي نَصِيبَكَ مِنِ ابْنِ أَخِيكَ، وَأَتَانِي هَذَا يَسْأَلُنِي نَصِيبَ امْرَأَتِهِ مِنْ أَبِيهَا فَقُلْتُ إِنْ شِئْتُمَا دَفَعْتُهَا إِلَيْكُمَا بِذَلِكَ، فَتَلْتَمِسَانِ مِنِّي قَضَاءً غَيْرَ ذَلِكَ، فَوَاللَّهِ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَاءُ وَالأَرْضُ، لاَ أَقْضِي فِيهَا قَضَاءً غَيْرَ ذَلِكَ حَتَّى تَقُومَ السَّاعَةُ، فَإِنْ عَجَزْتُمَا فَادْفَعَاهَا إِلَىَّ، فَأَنَا أَكْفِيكُمَاهَا‏.‏",
        "translations": {
          "en": "Narrated Malik bin Aus:'I went and entered upon `Umar, his doorman, Yarfa came saying `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d are asking your permission (to see you). May I admit them? `Umar said, 'Yes.' So he admitted them Then he came again and said, 'May I admit `Ali and `Abbas?' He said, 'Yes.' `Abbas said, 'O, chief of the believers! Judge between me and this man (Ali ). `Umar said, 'I beseech you by Allah by Whose permission both the heaven and the earth exist, do you know that Allah's Messenger (ﷺ) said, 'Our (the Apostles') property will not be inherited, and whatever we leave (after our death) is to be spent in charity?' And by that Allah's Messenger (ﷺ) meant himself.' The group said, '(No doubt), he said so.' `Umar then faced `Ali and `Abbas and said, 'Do you both know that Allah's Messenger (ﷺ) said that?' They replied, '(No doubt), he said so.' `Umar said, 'So let me talk to you about this matter. Allah favored His Apostle with something of this Fai' (i.e. booty won by the Muslims at war without fighting) which He did not give to anybody else; Allah said:-- 'And what Allah gave to His Apostle ( Fai' Booty) .........to do all things....(59.6) And so that property was only for Allah's Messenger (ﷺ) . Yet, by Allah, he neither gathered that property for himself nor withheld it from you, but he gave its income to you, and distributed it among you till there remained the present property out of which the Prophet (ﷺ) used to spend the yearly maintenance for his family, and whatever used to remain, he used to spend it where Allah's property is spent (i.e. in charity etc.). Allah's Messenger (ﷺ) followed that throughout his life. Now I beseech you by Allah, do you know all that?' They said, 'Yes.' `Umar then said to `Ali and `Abbas, 'I beseech you by Allah, do you know that?' Both of them said, 'Yes.' `Umar added, 'And when the Prophet (ﷺ) died, Abu Bakr said, ' I am the successor of Allah's Messenger (ﷺ), and took charge of that property and managed it in the same way as Allah's Messenger (ﷺ) did. Then I took charge of this property for two years during which I managed it as Allah's Messenger (ﷺ) and Abu Bakr did. Then you both (`Ali and `Abbas) came to talk to me, bearing the same claim and presenting the same case. (O `Abbas!) You came to me asking for your share from the property of your nephew, and this man (Ali) came to me, asking for the share of h is wife from the property of her father. I said, 'If you both wish, I will give that to you on that condition (i.e. that you would follow the way of the Prophet (ﷺ) and Abu Bakr and as I (`Umar) have done in man aging it).' Now both of you seek of me a verdict other than that? Lo! By Allah, by Whose permission both the heaven and the earth exist, I will not give any verdict other than that till the Hour is established. If you are unable to manage it, then return it to me, and I will be sufficient to manage it on your behalf",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے بیان کیا کہ مجھے مالک بن اوس بن حدثان نے خبر دی کہ محمد بن جبیر بن مطعم نے مجھ سے مالک بن اوس کی اس حدیث کا ایک حصہ ذکر کیا تھا۔ پھر میں خود مالک بن اوس کے پاس گیا اور ان سے یہ حدیث پوچھی تو انہوں نے بیان کیا کہ میں عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا پھر ان کے حاجب یرفاء نے جا کر ان سے کہا کہ عثمان، عبدالرحمٰن بن زبیر اور سعد آپ کے پاس آنا چاہتے ہیں؟ انہوں نے کہا کہ اچھا آنے دو۔ چنانچہ انہیں اندر آنے کی اجازت دے دی۔ پھر کہا، کیا آپ علی و عباس رضی اللہ عنہما کو بھی آنے کی اجازت دیں گے؟ کہا کہ ہاں آنے دو۔ چنانچہ عباس رضی اللہ عنہ نے کہا کہ امیرالمؤمنین میرے اور علی رضی اللہ عنہ کے درمیان فیصلہ کر دیجئیے۔ عمر رضی اللہ عنہ نے کہا میں تمہیں اللہ کی قسم دیتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں کیا تمہیں معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ہماری وراثت تقسیم نہیں ہوتی جو کچھ ہم چھوڑیں وہ سب راہ اللہ صدقہ ہے؟ اس سے مراد نبی کریم صلی اللہ علیہ وسلم کی خود اپنی ہی ذات تھی۔ جملہ حاضرین بولے کہ جی ہاں، نبی کریم صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا۔ پھر عمر، علی اور عباس رضی اللہ عنہما کی طرف متوجہ ہوئے اور پوچھا، کیا تمہیں معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم نے یہ فرمایا تھا؟ انہوں نے بھی تصدیق کی کہ نبی کریم صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا۔ عمر رضی اللہ عنہ نے فرمایا پھر میں اب آپ لوگوں سے اس معاملہ میں گفتگو کروں گا۔ اللہ تعالیٰ نے اس فے کے معاملہ میں نبی کریم صلی اللہ علیہ وسلم کے لیے کچھ حصے مخصوص کر دئیے جو آپ کے سوا کسی اور کو نہیں ملتا تھا۔ چنانچہ اللہ تعالیٰ نے فرمایا تھا «ما أفاء الله على رسوله‏» سے ارشاد «قدير‏» تک۔ یہ تو خاص نبی کریم صلی اللہ علیہ وسلم کا حصہ تھا۔ اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم نے اسے تمہارے لیے ہی مخصوص کیا تھا اور تمہارے سوا کسی کو اس پر ترجیح نہیں دی تھی، تمہیں کو اس میں سے دیتے تھے اور تقسیم کرتے تھے۔ آخر اس میں سے یہ مال باقی رہ گیا اور نبی کریم صلی اللہ علیہ وسلم اس میں سے اپنے گھر والوں کے لیے سال بھر کا خرچہ لیتے تھے، اس کے بعد جو کچھ باقی بچتا اسے ان مصارف میں خرچ کرتے جو اللہ کے مقرر کردہ ہیں۔ نبی کریم صلی اللہ علیہ وسلم کا یہ طرز عمل آپ کی زندگی بھر رہا۔ میں آپ کو اللہ کی قسم دے کر کہتا ہوں، کیا آپ لوگوں کو معلوم ہے؟ لوگوں نے کہا کہ جی ہاں۔ پھر آپ نے علی اور عباس رضی اللہ عنہما سے پوچھا، میں اللہ کی قسم دے کر پوچھتا ہوں کیا آپ لوگوں کو یہ معلوم ہے؟ انہوں نے بھی کہا کہ جی ہاں۔ پھر نبی کریم صلی اللہ علیہ وسلم کی وفات ہو گئی اور ابوبکر رضی اللہ عنہ نے کہا کہ اب میں نبی کریم صلی اللہ علیہ وسلم کا نائب ہوں چنانچہ انہوں نے اس پر قبضہ میں رکھ کر اس طرز عمل کو جاری رکھا جو نبی کریم صلی اللہ علیہ وسلم کا اس میں تھا۔ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو بھی وفات دی تو میں نے کہا کہ میں نبی کریم صلی اللہ علیہ وسلم کے نائب کا نائب ہوں۔ میں بھی دو سال سے اس پر قابض ہوں اور اس مال میں وہی کرتا ہوں جو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے کیا۔ پھر آپ دونوں میرے پاس آئے ہو۔ آپ دونوں کی بات ایک ہے اور معاملہ بھی ایک ہی ہے۔ آپ ( عباس رضی اللہ عنہ ) میرے پاس اپنے بھتیجے کی میراث سے اپنا حصہ لینے آئے ہو اور آپ ( علی رضی اللہ عنہ ) اپنی بیوی کا حصہ لینے آئے ہو جو ان کے والد کی طرف سے انہیں ملتا۔ میں کہتا ہوں کہ اگر آپ دونوں چاہتے ہیں تو میں اسے آپ کو دے سکتا ہوں لیکن آپ لوگ اس کے سوا کوئی اور فیصلہ چاہتے ہیں تو اس ذات کی قسم جس کے حکم سے آسمان و زمین قائم ہیں، میں اس مال میں اس کے سوا اور کوئی فیصلہ نہیں کر سکتا، قیامت تک، اگر آپ اس کے مطابق عمل نہیں کر سکتے تو وہ جائیداد مجھے واپس کر دیجئیے میں اس کا بھی بندوبست کر لوں گا۔",
          "fr": "Rapporté par Malik bin Aus : Je suis allé voir `Umar, et son portier, Yarfa, est venu dire : « `Uthman, `Abdur-Rahman, Az-Zubair et Sa`d demandent la permission d’entrer. Puis-je les faire entrer ? » `Umar a dit : « Oui. » Il les a donc fait entrer. Ensuite, il est revenu et a dit : « Puis-je faire entrer `Ali et `Abbas ? » Il a dit : « Oui. » `Abbas a dit : « Ô chef des croyants ! Juge entre moi et cet homme (`Ali). » `Umar a dit : « Je vous demande, par Allah, par qui le ciel et la terre existent, savez-vous que le Messager d’Allah (ﷺ) a dit : “Nos biens (des Prophètes) ne seront pas hérités, et tout ce que nous laissons après notre mort doit être dépensé en aumône” ? Et par cela, le Messager d’Allah (ﷺ) parlait de lui-même. » Le groupe a répondu : « (Sans aucun doute), il l’a dit. » `Umar s’est alors tourné vers `Ali et `Abbas et a dit : « Savez-vous tous les deux qu’il a dit cela ? » Ils ont répondu : « (Sans aucun doute), il l’a dit. » `Umar a dit : « Laissez-moi vous expliquer cette affaire. Allah a accordé à Son Messager une part de ce Fai’ (butin obtenu sans combat) qu’Il n’a donnée à personne d’autre ; Allah a dit : “Et ce qu’Allah a donné à Son Messager (le butin Fai’)… (59.6)” Ainsi, ces biens étaient réservés au Messager d’Allah (ﷺ). Pourtant, par Allah, il n’a rien gardé pour lui-même ni rien retenu de vous, mais il en donnait les revenus et les distribuait parmi vous, jusqu’à ce qu’il ne reste que les biens actuels dont le Prophète (ﷺ) utilisait une partie pour l’entretien annuel de sa famille, et ce qui restait, il le dépensait là où l’on dépense les biens d’Allah (c’est-à-dire en aumône, etc.). Le Messager d’Allah (ﷺ) a agi ainsi toute sa vie. Maintenant, je vous demande par Allah, savez-vous tout cela ? » Ils ont répondu : « Oui. » `Umar s’est alors adressé à `Ali et `Abbas : « Je vous demande par Allah, le savez-vous ? » Tous deux ont dit : « Oui. » `Umar ajouta : « Et quand le Prophète (ﷺ) est mort, Abu Bakr a dit : “Je suis le successeur du Messager d’Allah (ﷺ),” et il a pris en charge ces biens et les a gérés comme le faisait le Messager d’Allah (ﷺ). Ensuite, j’ai pris en charge ces biens pendant deux ans, et je les ai gérés comme le faisaient le Messager d’Allah (ﷺ) et Abu Bakr. Puis vous deux (`Ali et `Abbas) êtes venus me voir, avec la même demande et la même affaire. (`Abbas !) Tu es venu me demander ta part des biens de ton neveu, et cet homme (`Ali) est venu me demander la part de sa femme des biens de son père. J’ai dit : “Si vous le souhaitez, je vous les donnerai à condition que vous suiviez la voie du Prophète (ﷺ) et d’Abu Bakr, et que je continue à les gérer comme je l’ai fait.” Maintenant, vous me demandez un jugement différent ? Par Allah, par qui le ciel et la terre existent, je ne donnerai pas d’autre jugement jusqu’à la fin des temps. Si vous n’arrivez pas à les gérer, rendez-les-moi et je m’en occuperai pour vous. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab] mengatakan, telah mengabarkan kepadaku [Malik bin Aus bin Al Hadatsan] dan [Muhammad bin Jubair bin Muth'im] menyebutkan kepadaku diantara haditsnya; 'maka aku berangkat hingga menemuinya dan bertanya kepadanya, dia menjawab; 'Aku berangkat hingga aku menemui [Umar]. Umar lantas ditemui oleh pengawal rumahnya dan mengucapkan selamat datang, kemudian ia bertanya; 'Apakah anda berkenan memberi izin untuk [Utsman], [Abdurrahman], [Zubai] r, dan [Sa'dari] ' 'Tentu' jawabnya. Penjaga itu pun mengizinkan mereka. kemudian dia bertanya lagi; 'apakah anda memberi izin kepada [Ali] dan [Abbas] ' 'ya' Jawab Umar. Abbas kemudian berkata; 'Wahai amirul mukminin, putuskanlah antara aku dan orang ini! ' Umar menjawab; 'Saya bersumpah kepada kalian dengan nama Allah yang karena- izin-Nya langit dan bumi tegak, bukankah kalian telah tahu bahwa Rasulullah Shallallahu'alaihi wa sallam telah bersabda: \"Kami tidak diwarisian, dan apa yang kami tinggalkan adalah sedekah!\" yang Rasulullah maksudkan adalah beliau sendiri.' Sekumpulan sahabat berkata; 'Nabi pernah mengatakan yang demikian.' Umar kemudian menemui Ali dan Abbas dan bertanya; 'bukankah kalian berdua tahu bahwa Rasulullah Shallallahu'alaihiwasallam telah menyabdakan yang demikian? ' Keduanya menjawab; 'Betul, Beliau telah bersabda sedemikian itu.' Umar berkata; 'sekarang saya akan menceritakan kepada kalian tentang persoalan ini, sesungguhnya Allah telah memberi pemberian special kepada Rasul-Nya Shallallahu'alaihiwasallam tentang harta fai` ini, dengan sesuatu yang tidak diberikan-Nya kepada seorang pun selainnya. Allah berfirman: 'Apa saja yang Allah berikan kepada Rasul-Nya…hingga firman-Nya Sesungguhnya Allah Maha Berkuasa. (QS. Alhasyr 1). Karenanya harta fai` tersebut adalah murni untuk Rasulullah Shallallahu'alaihiwasallam, demi Allah beliau tidak memberikannya secara special untuk kalian dan tidak pula mengutamakannya untuk kalian, sesungguhnya beliau juga telah memberikan harta itu kepada kalian dan meratakannya kepada kalian hingga tersisa dari harta ini, selanjutnya Nabi pergunakan harta itu untuk menafkahi keluarganya selama setahun, beliau mengambil harta sisanya dan beliau salurkan untuk harta Allah. Begitulah Rasulullah Shallallahu'alaihiwasallam memperlakukan harta itu semasa hidupnya. Saya bersumpah kepada kalian atas nama Allah, Bukankah kalian tahu terhadap itu semua? ' Mereka menjawab; 'Iya'. Kemudian Umar mengatakan secara khusus kepada Ali dan Abbas; 'Saya bersumpah kepada kalian berdua atas nama Allah, bukankah kalian berdua tahu itu semua? ' Keduanya menjawab; 'Benar'. Umar melanjutkan; 'Kemudian Allah mewafatkan Nabi-NYA Shallallahu'alaihiwasallam, lantas Abu Bakar berkata; 'Aku adalah wali Rasulullah Shallallahu'alaihiwasallam, ' dan dia memegang harta itu kemudian mengelola sebagaimana Rasulullah Shallallahu'alaihiwasallam mengelola, kemudian Allah mewafatkan Abu Bakar, sehingga aku katakan; 'Aku adalah wali dari walinya Rasulullah Shallallahu'alaihiwasallam, sehingga aku pegang harta itu selama dua tahun dan aku kelola sebagaimana Rasulullah Shallallahu'alaihiwasallam dan Abu Bakar mengelolanya, kemudian kalian berdua mendatangiku sedang ucapan kalian satu, dan perkara kalian berdua sepakat persis, kalian mendatangiku dengan harapan memintaku bagianmu lewat lajur keponakanmu, sedang orang ini memintaku bagian isterinya lewat lajur ayahnya, maka kutegaskan; Jika kalian berkenan, tanah itu akan kuserahkan kepada kalian berdua, sehingga kalian berdua memperoleh keputusan selain itu dariku, demi Allah yang atas seizin-Nya bumi dan langit menjadi tegak, Saya tak akan menetapkan keputusan selain itu hingga kiamat tiba, kalaulah kalian berdua merasa tidak mampu, serahkan padaku, saya akan mengelola harta itu sebagai ganti kalian",
          "tr": "Malik b. Evs b. el-Hadesan şöyle demiştir: -Hadisi Malik b. Evs'ten nakleden İbn Şihab şöyle dedi: Muhammed b. Cubeyr b. Mut'im bana Malik b. Evs'in hadisinden bir kısmını nakletmişti. Ben bu hadisi bizzat Malik b. Evs'ten işitmek için gidip huzuruna girdim ve kendisine bu hadisi sordum. O da şöyle anlattı: Ben Ömer r.a.'in huzuruna gittim. Bu sırada halife Ömer'in kapıcısı Yerfe içeriye girdi ve \"Ey mu'minlerin emiri! Osman, Abdurrahman b. Avf, ZUbeyr b. el-Avvam, Sa'd b. Ebi Vakkas'ın girmelerine müsaade eder misiniz?\" Hz. Ömer \"evet\" dedi. (Adı geçenler içeri girdiler, selam verip oturdular.) Biraz sonra Yerfe yine geldi ve \"Ali'yle, Abbas da geldiler, izin verir misin?\" dedi. Hz. Ömer \"evet\" dedi. (Bunlar da içeri girdiler. Selamdan sonra) Abbas \"Ey müminlerin emiri! Benimle şu Ali arasında hükmeti\" dedi. Hz. Ömer orada bulunanlara \"Gök ve yerin izniyle ayakta durmakta olduğu Allah hakkı için soruyorum. Sizler ResuluIlah Sallallahu Aleyhi ve Sellem'in 'Biz Nebiler topluluğuna mirasçı olunmaz.Geriye bıraktığımız her mal sadakadır' buyurduğunu ve bu sözüyle kendini kastetmekte olduğunu biliyorsunuz değil mi?\" dedi. Hz. Osman ve arkadaşları \"Evet, Resulullah Sallallahu Aleyhi ve Sellem böyle buyurdu\" dediler. Bunun üzerine Hz. Ömer, Ali ve Abbas'a dönüp \"Resulullah Sallallahu Aleyhi ve Sellem'in kendisini kastederek böyle buyurduğunu siz de biliyorsunuz değil mi?\" dedi. Ali ve Abbas \"Evet Resulullah Sallallahu Aleyhi ve Sellem böyle buyurdu\" dediler .. Hz. Ömer şöyle devam etti: \"Şimdi ben size bu malın hukuki durumunu bildireyim. Allahu Teala bu ganimette (fey) tasarrufu Resulüne tahsis etti. Ondan başka kimseye bu hakkı vermedi. Allahu Tealaşöyle buyurdu: \"Allah'ın onlardan {mallarından} Nebiine verdiği ganimetler için siz at ve deve koşturmuş değilsiniz. Fakat Allah, Nebilerini dilediği kimselere karşı üstün kılar, Allah her şeye kadirdir. \"(Haşr 6) Bu mal özelolarak Nebi Sallallahu Aleyhi ve Sellem' e mahsustu. Sonra valiahi o bu malı sizi bir yana bırakıp da kendi mülküne katmadı, sizi dışlayıp da kendine özel de kılmadı. Resulullah Sallallahu Aleyhi ve Sellem bu fey malını size verdi ve aranızda taksim etti. Nihayet o feyden bu mal kaldı. Nebi Sallallahu Aleyhi ve Sellem ailesinin bir senelik nafakasını bu maldan ayırır, sonra kalanını alır, onu da Allah'ın malının sarfedileceği yerlere harcardı. ResuluIlah Sallallahu Aleyhi ve Sellem bu malı kendi hayatında böyle kullandı. Ey topluluk! Sizlere Allah adına soruyorum. Sizler bunun böyle olduğunu biliyorsunuz değil mi? dedi. Onlar da \"Evet, böyledir!\" diye tasdik ettiler. Sonra Hz. Ömer, Ali ile Abbas'a hitaben \"Sizin ikinize de Allah adına soruyorum! Sizler de bunun böyle olduğunu biliyorsunuz değil mi?\" dedi. Onlar da \"evet\" deyip, tasdik ettiler. Hz. Ömer şÖyle devam etti: Sonra Allah Nebiini vefat ettirdi. Ebu Bekir \"Ben Allah'ın Resulünün velisiyim\" dedi ve o mallara el koydu, Resulullah Sallallahu Aleyhi ve Sellem'in kullandığı gibi kullandı. Sonra Allah Ebu Bekir'i de vefat ettirdi. Ben de Resulullah Sallallahu Aleyhi ve Sellem'in velisiyim dedim ve onları iki sene önce teslim alc;lım. Onları Resulullah Sallallahu Aleyhi ve Sellem ve Ebu Bekir' in kullandığı gibi kullanmaktayım. Sonra ikiniz bana geldiniz. Sözünüz bir, işiniz dedi toplu idi. Ey Abbas! Sen bana geldin, bEmden kardeşinin oğlundan payına düşen hisseni istiyordun. Ali de banageldi, hanımının babasından payına düşen hissesini istiyordu. Ben isterseniz bu hurmalıkları size bu şartla geri vereyim dedim. Şimdi siz benden bundan başka bir hüküm mü istiyorsunuz? Gök ve yer izni ile ayakta duran Allah'a yemin ederim ki ben kıyamet kopuncaya kadar bu mallar hakkında bundan başka bir hüküm vermem. Eğer siz bu malları idareden acizseniz onları bana geri verin. Ben onları sizin hesabınıza yeterlilikle idare ederim dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 5
      },
      "narrator": {
        "en": "Malik bin Aus"
      }
    },
    {
      "hadithNumber": 6729,
      "arabicNumber": 6729,
      "book": 85,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَقْتَسِمُ وَرَثَتِي دِينَارًا، مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمُؤْنَةِ عَامِلِي فَهْوَ صَدَقَةٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Not even a single Dinar of my property should be distributed (after my deaths to my inheritors, but whatever I leave excluding the provision for my wives and my servants, should be spent in charity)",
          "ur": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میرا ورثہ دینار کی شکل میں تقسیم نہیں ہو گا۔ میں نے اپنی بیویوں کے خرچہ اور اپنے عاملوں کی اجرت کے بعد جو کچھ چھوڑا ہے وہ سب صدقہ ہے۔“",
          "fr": "Rapporté par Abu Huraira : Le Messager d'Allah (ﷺ) a dit : « Aucun Dinar de mes biens ne doit être partagé entre mes héritiers après ma mort. Tout ce que je laisse, à part ce qui est prévu pour mes épouses et mes serviteurs, doit être donné en aumône. »",
          "id": "Telah menceritakan kepada kami [Isma'il] mengatakan, telah menceritakan kepadaku [Malik] dari [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah], bahwasanya Rasulullah Shallallahu'alaihiwasallam bersabda: \"warisanku tak boleh dibagi-bagi dengan diuangkan dinar, apa yang kutinggalkan terkemudian sebagai nafkah isteriku dan untuk mencukupi pegawaiku, itu semua adalah sedekah",
          "tr": "Ebu Hureyre r.a.'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"(Vefatımda) benim mirasçılarım dinar paylaşmazlar. Eşlerimin nafakalanndan ve işçimin ücretinden geri kalanlar sadakadır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 6
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6730,
      "arabicNumber": 6730,
      "book": 85,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ أَزْوَاجَ، النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرَدْنَ أَنْ يَبْعَثْنَ عُثْمَانَ إِلَى أَبِي بَكْرٍ يَسْأَلْنَهُ مِيرَاثَهُنَّ‏.‏ فَقَالَتْ عَائِشَةُ أَلَيْسَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ نُورَثُ مَا تَرَكْنَا صَدَقَةٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Urwa:`Aisha said, \"When Allah's Messenger (ﷺ) died, his wives intended to send `Uthman to Abu Bakr asking him for their share of the inheritance.\" Then `Aisha said to them, \"Didn't Allah's Messenger (ﷺ) say, 'Our (Apostles') property is not to be inherited, and whatever we leave is to be spent in charity?",
          "ur": "ہم سے عبداللہ بن مسلمہ قعبنی نے بیان کیا، ان سے امام مالک نے، ان سے ابن شہاب نے، ان سے عائشہ رضی اللہ عنہا نے کہ جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی بیویوں نے چاہا کہ عثمان رضی اللہ عنہ کو ابوبکر رضی اللہ عنہ کے پاس بھیجیں، اپنی میراث طلب کرنے کے لیے۔ پھر عائشہ رضی اللہ عنہا نے یاد دلایا۔ کیا نبی کریم صلی اللہ علیہ وسلم نے نہیں فرمایا تھا کہ ہماری وراثت تقسیم نہیں ہوتی، ہم جو کچھ چھوڑ جائیں وہ سب صدقہ ہے؟",
          "fr": "Rapporté par `Urwa : `Aisha a dit : « Quand le Messager d'Allah (ﷺ) est décédé, ses épouses ont voulu envoyer `Uthman voir Abu Bakr pour lui demander leur part d'héritage. » Puis `Aisha leur a dit : « Le Messager d'Allah (ﷺ) n’a-t-il pas dit : ‘Nos biens (à nous, les Prophètes) ne sont pas hérités, et tout ce que nous laissons doit être donné en aumône ?’ »",
          "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Urwah] dari [Aisyah] radliallahu 'anha, bahwasanya isteri-isteri Nabi shallallahu 'alaihi wasallam ketika Rasulullah Shallallahu'alaihiwasallam meninggal, mereka ingin mengutus Utsman untuk menemui Abu Bakar meminta warisan mereka, maka Aisyah mengatakan; Bukankah Rasulullah Shallallahu'alaihi wa sallam bersabda: \"Kami tidak diwarisi, dan semua yang kami tinggalkan adalah sedekah?",
          "tr": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem vefat ettiğinde eşleri Osman'ı mirastan paylarını istemek üzere Ebu Bekir'e gönderdiler. Aişe r.anha onlara \"Resulullah Sallallahu Aleyhi ve Sellem 'Bize mirasçı olunmaz. Geriye bıraktığımız her mal sadakadır' buyurmamış mıdır?\" dedi. Fethu'l-Bari Açıklaması: \"Bize mirasçı olunmaz. Geriye bıraktığımız her mal sadakadır.\" Bunun anlamı geride bıkaktığımı.i mallar sadakadır demektir. İmam Buhari bu konuda dört hadise yer vermiştir. Bunlardan birisi Hz. Ebu Bekir'le Fatıma arasındaki olayı aktaran hadistir. Bu hadis Humus bölümünde açıklamasıyla birlikte daha önce geçmişti. \"(Vefatımda) eşlerimin nafakalanndan ve işçimin ücretinden sonra geri kalan sadakadır.\" İbn Battal ve başka bilginler şöyle demiştir: Bu hadisin -Allahu Teala daha iyi bilir- başlığa uygunluğu şu açıdandır: Allah Teala Nebileri kendi mesajını tebliğ eden elçiler olarak gönderdi ve onlara bu görevlerinin karşılığında herhangi bir ücret almamalarını emretti. Nitekim Allahu Teala şöyle buyurur: \"Deki: Ben buna karşılık sizden akrabalık sevgisinden başka bir ücret istemiyorum.''(Şura 23) Hz. Nuh, Hud ve başka Nebiler de buna benzer şekilde konuşmuşlardır. Nebilerin miras bırakmamalarındaki hikmet, onların mirasçıları için mal biriktirdikleri zannı uyanmasın diyedir. İbn Battal şöyle devam etti: Müfessirler \"Süleyman, Davud'a varis oldu\"(Neml 16) ayetini \"ilim ve hikmette varis oldu\" şeklinde tevil etmişlerdir. Hz. Zekeriya'nın \"Tarafından bana bir veli (oğul) ver ki o bana varis olsun\"(Meryem 5-6) ifadesi de aynı manayadır. İbn Abdilberr alimlerin bu konuda iki görüşe ayrıldıklarını ve çoğunluğun Nebilerin miras bırakmayacakları kanaatini taşıdıklarını belirtir. \"Allah size çocuklarınız hakkında (miras vermenizi) emreder\" ayetindeki genelliğe gelince, buna şöyle cevap verilmiştir: Bu ayet, malik olduğu bir şeyleri miras bırakan kimseler hakkında geneldir. Bir kimsenin ölmeden önce malını vakfettiği ve miras olarak alınacak herhangi bir şey bırakmadığı sabit olduğu takdirde bu kişiye mirasçı olunmaz. Malik olduğu şeylerden geriye bir şey bırakması takdirinde Nebi Sallallahu Aleyhi ve Sellem'in bu ayetin genelliğine dahil oluşu tahsise uygundur. Çünkü onun kendine mahsus birçok özelliği olduğu bilinmektedir. Nebi s.a.v.'e mirasçı olunamayacağı hükmü meşhurdur. Netice olarak bu hükmü n herkese değil, sadece ona mahsus olduğu ortaya çıkar. Bazı bilginlere göre Nebi Sallallahu Aleyhi ve Sellem'in miras bırakmamasındaki hikmet, varisin mirasa konma arzusuyla miras bırakanın ölmesini temenni etmesini ortadan kaldırmaktır. Bazı bilginlere göre ise bunun hikmeti, Nebi Sallallahu Aleyhi ve Sellem'in ümmetinin babası mesabesinde olmasındandır. Dolayısıyla onun bırakacağı miras, herkesin olur. Genel sadakanın niteliği budur. İbnü'lMüneyyir Haşiye'sinde şöyle der: Bu hadisten şöyle bir hüküm daha çıkmaktadır: Bir kimse, \"Evim sadakadır, kimseye miras olarak kalamaz\" dediği takdirde -vakfedildiğine• veya mülkiyetinin durdurulduğuna dair açık bir ifadeye ihtiyaç olmaksızın- o ev vakfedilmiş olur. Bu yaklaşım güzeldir, fakat acaba bu sarih bir vakfetme ifadesi midir yoksa niyet gereken kinayeli bir ifade midir? Ebu Hureyre hadisi menkul malların vakfedilmesinin sahih olduğunu ve vakfın sadece gayr-ı menkullere mahsus olmadığını göstermektedir. Çünkü \"eşlerimin nafakalarından sonra geri kalan\" ifadesi geneldir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 7
      },
      "narrator": {
        "en": "`Urwa"
      }
    },
    {
      "hadithNumber": 6731,
      "arabicNumber": 6731,
      "book": 85,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَنَا أَوْلَى، بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَعَلَيْهِ دَيْنٌ، وَلَمْ يَتْرُكْ وَفَاءً، فَعَلَيْنَا قَضَاؤُهُ، وَمَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"I am more closer to the believers than their own selves, so whoever (of them) dies while being in debt and leaves nothing for its repayment, then we are to pay his debts on his behalf and whoever (among the believers) dies leaving some property, then that property is for his heirs",
          "ur": "ہم سے عبدان نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو یونس بن یزید ایلی نے خبر دی، انہیں ابن شہاب نے، کہا مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میں مومنوں کا خود ان سے زیادہ حقدار ہوں۔ پس ان میں سے جو کوئی قرض دار مرے گا اور ادائیگی کے لیے کچھ نہ چھوڑے گا تو ہم پر اس کی ادائیگی کی ذمہ داری ہے اور جس نے کوئی مال چھوڑا ہو گا وہ اس کے وارثوں کا حصہ ہے۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Je suis plus proche des croyants qu’eux-mêmes. Donc, si l’un d’eux meurt en ayant des dettes et qu’il n’a rien pour les rembourser, alors c’est à nous de payer ses dettes. Mais si l’un des croyants meurt en laissant des biens, ces biens reviennent à ses héritiers. »",
          "id": "Telah menceritakan kepada kami [Abdan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Salamah] dari [Abu Hurairah] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Saya lebih utama menjamin orang-orang mukmin daripada diri mereka sendiri, maka barangsiapa meninggal sedang ia mempunyai hutang dan tidak meninggalkan harta untuk melunasinya, kewajiban kamilah untuk melunasinya, dan barangsiapa meninggalkan harta, maka itu bagi ahli warisnya",
          "tr": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben mu'minlere kendi öz nefislerinden daha yakımmdır. Her kim üzerinde borç olduğu halde ölür ve o borcu ödeyecek bir şey bırakmazsa onu ödemek bize aittir. Her kim de bir mal bırakırsa o da kendi mirasçılarına aittir.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Devlet başkanı o kişinin borcunu beytü'l-malden ödemeyecek olursa, cennete girmesine engel olunmaz. Çünkü o kişi, beytü'lmaldeki paradan borcu kadar miktara hak sahibidir. Yeter ki borcu beytü'lmaldeki hakkından daha fazla olmasın. Bizim kanaatimiz ise şudur: Anlaşılan bu karşılıklı ödeşmeye girer. Borçlu olan kişi alacağı ve borcu olan şahıs gibidir. Daha önce ifade ettik ki onlar sırattan geçince cennetle cehennem arasında kurulu bir köprüde durdurulup, yaptıkları haksızlık dolayısıyla birbirleriyle ödeşirier. Karşılıklı olarak arınıp, borçlarını ödediklerinde cennete girmelerine izin verilir. İbn Battal'ın \"Cennete girmesine engel olunmaz\" şeklindeki ifadesi, mesela azap görerek durdurulmaz demektir. Doğruyu en iyi Allah Teala bilir. \"Her kim de bir mal bırakırsa, o da kendi mirasçılarına aittir.\" Yani bıraktığı mal varislerine aittir. Abdurrahman b. Ebu Umre'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Her kim de bir mal bırakırsa, mevcut olan asabeleri ona mirasçı olur\" buyurmuştur. Müslim'de el-A'rac vasıtasıyla Ebu Hureyre'nin nakline göre ise \"Bıraktığı ma/ mevcut o/an asabesine aittir\" buyurmuştur (Müslim, Feraiz). Davudi' şöyle demiştir: Hadiste geçen \"asabe\" den maksat feraiz ilminde asabe yoluyla mirasçı olanlar değil, normal varislerdir. Çünkü feraiz ilminde bir terim olarak asabe, mirasçı oldukları ittifakla kabul edilenlerden belli bir hisseye sahip olan varislerdir. Bunlar tek başına kaldıklarında bütün mala mirasçı olurlar ve ashab-ı feraiz hisselerini aldıktan sonra geriye artan malı asabe yoluyla alırlar. Bazı bilginlere göre \"asabe\"den maksad, erkeğin akrabalarıdır. Bunlar ölüye bir babayla -baba, babanın babası, babanın babasının babası... şeklinde de olabilir- bağlanan kişilerdir. Kirmani\"nin görüşüne göre \"asabe\"den maksat, ashab-ı feraiz'den sonra miras alan akrabalardır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 8
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6732,
      "arabicNumber": 6732,
      "book": 85,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to those who are entitled to receive it. Then whatever remains, should be given to the closest male relative of the deceased",
          "ur": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ ابن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میراث اس کے حق داروں تک پہنچا دو اور جو کچھ باقی بچے وہ سب سے زیادہ قریبی مرد عزیز کا حصہ ہے۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a dit : « Donnez les parts d’héritage prescrites dans le Coran à ceux qui y ont droit. Ensuite, ce qui reste doit être donné au parent masculin le plus proche du défunt. »",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu 'Abbas] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya)",
          "tr": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Miras pay/arını sahip/erine veriniz. Bu pay/ardan geri kalan her hangi bir şey de baba tarafından en yakın olan erkek kişiye aittir.\" Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlıkta geçn \"el-veled\" kelimesi genelolup erkek ve kız çocukları ifade eder. Bir kimsenin kendi sulbünden olan oğluna veled denilebileceği gibi, ne kadar aşağıya doğru giderse gitsin oğlunun oğluna da denilir. İbn Abdilberr şöyle der: İmam Malik, Şafii, Hicazlılar ve feraiz konusunda onlara katılan bilginlerin esas aldıkları görüş, Zeyd b. Sabit' in görüşüdür. Iraklılarla, onlara katılan bilginlerin esas aldıkları ise Hz. Ali'nin görüşüdür. Her iki grup, önemsiz ve nadir durumlar hariç birbirinden farklı şeyler söylemezler. Bu da, itibar etmek gereken özel bir delil bulunduğunda sözkonusu olur. İbn Battal, Zeyd b. Sabit'in \"Kızların yanında erkek de bulunduğunda\" şeklindeki ifadesini şöyle açıklamıştır: Zeyd b. Sabit bu sözü ile kızlarla birlikte onların babalarından olan erkek kardeş bulunduğunda ve bunlarla birlikte -mesela baba gibi- Kur'an'da belirlenmiş hissesi bulunan bir başka varis bulunduğunda demektir. Bu yüzden Zeyd b. Sabit \"o kızlarla birlikte bulunan\" yerine \"erkeklerle birlikte bulunan\" tabirini kullanmıştır. Buna göre mesela önce babaya hissesi verilir ve geri kalan miras, bir erkeğe iki kız hissesi şeklinde oğlanla kızlara taksim edilir. Zeyd b. Sabit şöyle der: \"Miras pay/arını sahip/erine veriniz\" hadisinin açıklaması budur. \"Miras pay/arını sahip/erine veriniz\" hadisinde geçen \"el-feraiz\" kelimesinden maksat, Kur'an-ı Kerim'de takdir edilmiş olan hisselerdir. Bunlar yarım (1/2), yarımın yarısı (1/4), yarımın yarısının yarısı (1/8), üçte iki (2/3), bunun yarısı (1/3), ve bunun yarısının yarısı (1/6)'dır. Hadiste yer alan \"ehil\"den maksat, Kur'an'ın ifadesi ile mirasa hak sahibi olan kimselerdir. Ravh b. el-Kasım' ın Tavlıs'tan nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Ma/ı mirastan pay sahip/erine Allah 'ın kitabına göre taksim ediniz\" buyurmuştur. Bundan maksat Allahu Teala'ın kitabında indirdiğine göre demektir. Zeyd bin Sabit'in \" W fema bakiye = geriye kalan miras ise\" şeklindeki ifadesi, bir başka rivayette \" ..... fe ma turiket= geriye bırakılan\" şeklindedir. \"En yakın olan erkek kişi ... \" cümlesinde kastedilen, bu paylardan geri kalan, miras bırakana nesepçe en yakın kişinin hakkıdır demektir. Yoksa maksat \"daha layık\" anlamına değildir. Hattabi şu açıklamayı yapmıştır: Bunun manası asabe içinden ölüye en yakın kişi demektir. İbn Battal'a göre maksat şudur: Ashab-ı feraizden sonra asabe erkekler arasında ölüye daha yakın olan erkek, mirasın kalanına hak sahibi olurken, daha uzak olan böyle değildir. Bunlar aynı seviyede olduklarında ise mirasın kalanını ortaklaşa böıüşürler. İbn Battal şöyle devam eder: Bu hadiste söylenmek istenen -mesela- ölüye baba veya anne vasıtasıyla bağlanan mirasçılar değildir. Çünkü onlar aynı derecede olduklarında aralarında mirasa diğerlerinden daha öncelikli olan yoktur. İbnü'l-münzir'in kanaati de bu yöndedir. İbnü't-Tın ise şöyle demiştir: Bundan maksat, amcayla birlikte hala, erkek kardeşin kızıyla birlikte onun oğlu, amca kızıyla birlikte amca oğludur. Bu . durumda öz erkek ve kız kardeş veya baba bir erkek ve kız kardeş hüküm dışı olmaktadır. Çünkü onlar \"Eğer erkekli kadın/ı daha fazla kardeş mevcut ise erkeğin hakkı, iki kadının payı kadardır\"(Nisa 176) ayeti gereğince mirasçı olurlar. Bu hükümden -ölünün baba bir erkek kardeşinin kızıyla veya öz kız kardeşiyle birlikte bulunması örneğinde olduğu üzere- hacba uğrayanlar müstesnadır. Aynı şekilde anne bir erkek ve kız kardeş de \"Bir erkek yahut bir kız kardeşi varsa her birine aItıda bir düşer\"(Nisa 12) ayeti gereğince bu hükmü n dışındadırlar. Ayetten maksadın anne bir kardeşler olduğu noktasında bilginler arasında görüş birliği olduğu nakledilmiştir. Bu konuda \"Biri ana bir kardeş, diğeri koca olan iki mirasçı amcaoğlu\" bölümünde daha fazla açıklama gelecektir. \"En yakın olan erkek kişi\" ifadesi hakkında Fakih İbnü'l-Arabı şöyle demiştir: \"Erkek kişi\" nitelemesi, mirasın tamamını kızların değil, erkeklerin alacağını ifade eder. Buna \"Kız da malın tamamını alıyor\" diye itiraz edilemez. Çünkü kız, malın tamamını birbirinden farklı iki sebeb e dayanarak almaktadır. İhata şeklindeki alma ise bir tek sebebe dayanmaktadır ki bu da, \"erkek olmak\"tan başka bir şey değildir. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem erkek olmayı zikrederek bu noktaya dikkat çekti.\" İbnü'l-Arabı \"Bu inceliği her iddia sahibi fark edemez\" demiştir. Bazılarına göre hadisteki \"erkeklik\", her iki yerde de hünsayı hüküm dışına çıkarmak içindir. Zekatta da buna benzer bir hüküm söz konusudur, çünkü hünsa zekat develerinden zekat alamaz. Hünsa da mirasta tek mirasçı olarak kaldığında malın tamamını (asebe olarak) alamaz. Nevevi şöyle demiştir: Bilginler ashab-ı feraiz hissesini aldıktan sonra geri kalanı asabenin alacağında ittifak etmişlerdir. Ölüye daha yakın asabe, daha uzak olandan önceliklidir. Bundan dolayı yakın asabe varken, uzak asabe mirasçı olamaz. Asabe, ölüyle bağlantısı herhangi bir kadınla değil, bizzat kendisi tarafından olan bütün erkek akrabalardır. Asabeler tek mirasçı olarak kaldıklarında malın tamamını alırlar. Alacakları paylar, hisselerin tamamını kuşatmayan ashab-ı feraizle birlikte bulunduklarında onlardan artakalan malı alırlar. Eğer herhangi bir şey artmazsa bir şeyalamazlar. Kurtubi şöyle der: Fıkıh bilginlerinin kız kardeşle, kıza \"asabe\" ismini vermeleri mecazendir. Çünkü bu meselede kız kardeş, ölünün kızından artanı aldığı için asabeye benzemiş olmaktadır. İleride geleceği üzere Buhari böyle bir başlık kullanmıştır. Tahavı şöyle demiştir: İbn Abbas ve ona tabi olanlar, İbn Abbas hadisine dayanarak şu hükmü vermiştir: Bir kimse ölüp, geriye kızı, anababa bir erkek ve kız kardeşi kalsa kızı, mirasın yarısını alır. Arta kalanı erkek kardeşinindir. Kız kardeşi ise ana-baba bir kardeş olduğu halde herhangi bir şey alamaz. İbn Abbas ve onun görüşünü benimseyenler, bL;! hükmü şu meselede geçerli bir kuralolarak kabul etmişlerdir: Ana-baba bir kız kardeşle birlikte asabe de bulunsaydı, ölünün kızının yanında kız kardeşine hiçbir şey düşmeyecekti. Tam tersine kızdan arta kalan miras -ne kadar uzak olurlarsa olsunlar- asabelerin olacaktı. Bunlar görüşlerini bir de \"Eğer çocuğu olmayan bir kimse ölür de onun bir kız kardeşi bulunursa, bıraktığının yarısı bunundur\"(Nisa 176) ayetine dayanmışlardır. Bu görüşün savunucuları şöyle derler: Ölünün kızıyla birlikte kız kardeşine mirastan pay verenler, Kur' an' ın zahirine muhalif düşerler. Tahavı şöyle devam eder: İbn Abbas ve onun görüşünü benimseyenlere karşı ittifakla kabul edilen şu yaklaşım ileri sürülmüştür: Bir kimse ölüp, geriye kızı ve oğlunun oğluyla, oğlunun kızı kalsa kızı mirasın yarısını alırken, geriye kalan oğlunun oğluyla, oğlunun kızı arasında paylaştırılır. Bu bilginler oğlunun oğluna erkek olduğu için mirasın kalanını tahsis etmemişler, tam tersine onun yanında kız kardeşini de -dişi olduğu halde- mirastan pay sahibi kılmışlardır. Tahavı şöyle devam eder: Buradan anlaşılıyor ki İbn Abbas hadisi ifadesindeki genellik üzere değildir. Tam tersine o şöyle bir özel durumla ilgilidir: Bir kimse ölse geriye kızı, amcası ve halası kalsa kıza mirasın yarısı verilir. Geriye kalanı bilginlerin ittifakıyla halanın değil, amcanındır. Tahavı der ki: Akıl erkek kardeşle kız kardeşin amca ve hala gibi değil, oğlan ve kız gibi değerle ndirilmesinin tercih edilmesini gerektirmektedir. Çünkü ölünün geriye sadece öz erkek ve kız kardeşi kalsa mal aralarında ikili birli taksim edilir. Ölünün oğlunun oğlu ve oğlunun kızı kaldığı takdirde de hüküm böyledir. Buna karşılık ölünün amcası ve halası mirasçı kaldığında bilginlerin ittifakıyla malın tamamı halaya değil, amcaya verilir. Tahavı şöyle der: Delilolarak dayandıkları ayetten başlayacak olursak, bu görüşü savunanlar bir kimse ölür, geriye kızı ve baba bir erkek kardeşi kalırsa kızın mirasın yarısını alacağı ve geriye kalanın erkek kardeşe verileceği noktasında ittifak etmişlerdir. Onların anlayışına göre \"çocuğu olmayan\" ayetinden maksat, malın tamamını almayan değil, alan çocuktur. Asabelerin ölüye en yakın olanları oğulları, sonra aşağıya doğru oğlunun oğullarıdır. Bunların ardından babası, sonra -birlikte olmamak kaydıyla- dedesi ve erkek kardeşi gelir. Dedeyle erkek kardeşin birlikte bulunmasının hükmü ileride gelecektir. Daha sonra erkek kardeşin oğulları, sonra aşağıya doğru onların oğulları, ardından amcalar, sonra aşağıya doğru amcaoğulları gelir. Ölüye ana ve baba ile bağlanan akrabalar, baba ile bağlanandan önceliklidir. Fakat baba bir erkek kardeş, ana baba bir erkek kardeşin oğlundan önceliklidir. Baba bir erkek kardeşin oğlu, ana baba bir amcadan önceliklidir. Baba bir amca, ana baba bir amcaoğlundan önceliklidir. İmam Buhari bu hadise dayanarak ölünün oğlunun oğlunun kendisinden daha aşağı derecede oğlan yoksa malın tamamını alacağı, dedesinin kendisinden daha alt derecede dede yoksa malın tamamına mirasçı olacağı ve ana bir erkek kardeşin ölünün amcaoğlu olmadığı takdirde hem ashab-ı feraizden ve hem de asabeden olmak kaydıyla mirasçı olacağını söylemiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 9
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6733,
      "arabicNumber": 6733,
      "book": 85,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، قَالَ مَرِضْتُ بِمَكَّةَ مَرَضًا، فَأَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً كَثِيرًا، وَلَيْسَ يَرِثُنِي إِلاَّ ابْنَتِي، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ قُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَبِيرٌ إِنَّكَ إِنْ تَرَكْتَ وَلَدَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَتْرُكَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً إِلاَّ أُجِرْتَ عَلَيْهَا، حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَأُخَلَّفُ عَنْ هِجْرَتِي فَقَالَ ‏\"‏ لَنْ تُخَلَّفَ بَعْدِي فَتَعْمَلَ عَمَلاً تُرِيدُ بِهِ وَجْهَ اللَّهِ، إِلاَّ ازْدَدْتَ بِهِ رِفْعَةً وَدَرَجَةً، وَلَعَلَّ أَنْ تُخَلَّفَ بَعْدِي حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَسَعْدُ بْنُ خَوْلَةَ رَجُلٌ مِنْ بَنِي عَامِرِ بْنِ لُؤَىٍّ‏.‏",
        "translations": {
          "en": "Narrated Sa`d bin Abi Waqqas:I was stricken by an ailment that led me to the verge of death. The Prophet (ﷺ) came to pay me a visit. I said, \"O Allah's Messenger (ﷺ)! I have much property and no heir except my single daughter. Shall I give two-thirds of my property in charity?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"Onethird of it?\" He said, \"You may do so) though one-third is also to a much, for it is better for you to leave your off-spring wealthy than to leave them poor, asking others for help. And whatever you spend (for Allah's sake) you will be rewarded for it, even for a morsel of food which you may put in the mouth of your wife.\" I said, \"O Allah's Messenger (ﷺ)! Will I remain behind and fail to complete my emigration?\" The Prophet (ﷺ) said, \"If you are left behind after me, whatever good deeds you will do for Allah's sake, that will upgrade you and raise you high. May be you will have long life so that some people may benefit by you and others (the enemies) be harmed by you.\" But Allah's Messenger (ﷺ) felt sorry for Sa`d bin Khaula as he died in Mecca. (Sufyan, a sub-narrator said that Sa`d bin Khaula was a man from the tribe of Bani 'Amir bin Lu'ai)",
          "ur": "ہم سے امام حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے زہری نے بیان کیا، کہا مجھے عامر بن سعد بن ابی وقاص نے خبر دی اور ان سے ان کے والد نے بیان کیا کہ میں مکہ مکرمہ میں ( حجۃ الوداع میں ) بیمار پڑ گیا اور موت کے قریب پہنچ گیا۔ پھر نبی کریم صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لائے تو میں نے عرض کیا: یا رسول اللہ! میرے پاس بہت زیادہ مال ہے اور ایک لڑکی کے سوا اس کا کوئی وارث نہیں تو کیا مجھے اپنے مال کے دو تہائی حصہ کا صدقہ کر دینا چاہئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ بیان کیا کہ میں نے عرض کیا پھر آدھے کا کر دوں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ میں نے عرض کیا ایک تہائی کا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں۔ گو تہائی بھی بہت ہے، اگر تم اپنے بچوں کو مالدار چھوڑو تو یہ اس سے بہتر ہے کہ انہیں تنگدست چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں اور تم جو بھی خرچ کرو گے اس پر تمہیں ثواب ملے گا یہاں تک کہ اس لقمہ پر بھی ثواب ملے گا جو تم اپنی بیوی کے منہ میں رکھو گے۔ پھر میں نے عرض کیا: یا رسول اللہ! کیا میں اپنی ہجرت میں پیچھے رہ جاؤں گا؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر میرے بعد تم پیچھے رہ بھی گئے تب بھی جو عمل تم کرو گے اور اس سے اللہ کی خوشنودی مقصود ہو گی تو اس کے ذریعہ درجہ و مرتبہ بلند ہو گا اور غالباً تم میرے بعد زندہ رہو گے اور تم سے بہت سے لوگوں کو فائدہ ہو گا اور بہتوں کو نقصان پہنچے گا۔ قابل افسوس تو سعد ابن خولہ ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے ان کے بارے میں اس لیے افسوس کا اظہار کیا کہ ( ہجرت کے بعد اتفاق سے ) ان کی وفات مکہ مکرمہ میں ہی ہو گئی۔ سفیان نے بیان کیا کہ سعد ابن خولہ رضی اللہ عنہ بنی عامر بن لوی کے ایک آدمی تھے۔",
          "fr": "Rapporté par Sa`d bin Abi Waqqas : J’ai été frappé par une maladie qui m’a presque fait mourir. Le Prophète (ﷺ) est venu me rendre visite. J’ai dit : « Ô Messager d’Allah (ﷺ) ! J’ai beaucoup de biens et je n’ai qu’une fille comme héritière. Puis-je donner les deux tiers de mes biens en aumône ? » Il a dit : « Non. » J’ai dit : « La moitié ? » Il a dit : « Non. » J’ai dit : « Le tiers ? » Il a dit : « Tu peux, mais le tiers, c’est déjà beaucoup. Il vaut mieux laisser tes enfants riches que de les laisser pauvres à demander de l’aide. Et tout ce que tu dépenses pour Allah, tu en seras récompensé, même pour une bouchée de nourriture que tu mets dans la bouche de ta femme. » J’ai dit : « Ô Messager d’Allah (ﷺ) ! Vais-je rester après ton départ et ne pas finir mon émigration ? » Le Prophète (ﷺ) a dit : « Si tu restes après moi, tout bien que tu feras pour Allah t’élèvera et t’apportera des récompenses. Peut-être vivras-tu longtemps, et certains profiteront de toi tandis que d’autres (tes ennemis) seront touchés par toi. » Mais le Messager d’Allah (ﷺ) a eu de la peine pour Sa`d bin Khaula car il est mort à La Mecque. (Sufyan, un des rapporteurs, a précisé que Sa`d bin Khaula était un homme de la tribu de Bani 'Amir bin Lu'ai)",
          "id": "Telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan] Telah menceritakan kepada kami [Az Zuhri] mengatakan; telah mengabarkan kepadaku [Amir bin Sa'd bin Abi Waqqash] dari [ayahnya] mengatakan; Aku pernah sakit parah di Makkah hingga rasanya berada di ujung kematian. Kemudian Rasulullah Shallallahu'alaihiwasallam menjengukku. Maka Saya bertanya; 'Wahai Rasulullah, saya mempunyai harta yang melimpah ruah, dan tak ada yang mewarisiku selain anak perempuanku bagimana kalau aku sedekahkan dua pertiganya? ' Nabi menjawab: \"jangan\". Saya bertanya lagi; 'Bagaimana kalau separoh? ' Nabi menjawab: \"jangan\". Saya tanyakan lagi; 'Bagaimana kalau sepertiganya? ' Nabi menjawab: \"Sepertiga itu banyak, Sesunguhnya jika engkau tinggalkan anakmu dalam keadaan berkecukupan, itu lebih baik bagimu daripada kamu tinggalkan mereka dengan kondisi papa sehingga meminta-minta kepada orang lain, dan sekali-kali tidaklah engkau memberi nafkah, melainkan kamu diberi pahala sampai berupa suapan yang engkau angkat kedalam mulut isterimu.\" Maka saya berkata; 'Wahai Rasulullah, apakah aku tetap tinggal (di Makkah dan meninggalkan) hijrahku? ' Nabi menjawab: \"Sekali-kali kamu tidak akan tertinggal setelahku kemudian kamu beramal shalih dengan mengharap wajah Allah kecuali akan menambah bagimu ketinggian dan derajat, Bisa jadi dengan kamu tetap tinggal (di Makkah) setelahku akan mendatangkan manfaat bagi suatu kaum dan mencelakakan yang lainnya.\" tetapi nasib tragis menimpa Sa'ad bin Khaulah yang menemui ajalnya di Makkah. Rasulullah Shalla Allahu 'alaihi wa sallam sempat memintakan rahmat dan ampunan untuknya. Sufyan mengatakan ' Sa'd bin Khaulah adalah laki-laki dari bani Amir bin Lu`ai",
          "tr": "Sa'd b. Ebi Vakkas şöyle anlatmıştır: Ben Mekke'de öyle bir hastalığa yakalandım ki neredeyse ölecektim. Bu sırada Resulullah Sallallahu Aleyhi ve Sellem beni ziyarete geldi. Ona \"Ya Resulallah! Benim çok malım vardır. Bana kızımdan başka varis olacak kimse de yoktur. Bu durumda malımın üçte ikisini tasadduk edebilir miyim?\" diye sordum. Nebi Sallallahu Aleyhi ve Sellem \"Hayır\" dedi. Ben \"Yarısını tasadduk edebilir miyim?\" dedim. ResuIuIlah Sallallahu Aleyhi ve Sellem \"Hayır\" dedi. Bunun üzerine \"Ya üçte birini?\" diye sordum. Bana şöyIe cevap verdi: \"Üçte bir bile fazladır. Çocuklarını zengin kişiler olarak bırakman, muhtaç ve insanlara el açar bir halde bırakıp gitmenden daha hayırlıdır. Şüphesiz sen eşinin ağzına kaldırıp vereceği n lokmaya varıncaya kadar infak edeceği n her bir nafakadan muhakkak sevaba ereceksin.\" Ben yine \"Ya ResuIaIlah! Hicretimden geriye mi kalacağım?\" dedim. ResuIuIlah Sallallahu Aleyhi ve Sellem şöyIe cevap verdi: \"Hayır, sen benim ardımda asla geri kalmayacaksın. (Şayet burada kalır da) Allah rızasını isteyerek herhangi bir amel yaparsan elbette onunla merteben yükselecek, derecen artacaktır. Öyle ümit ediyorum ki sen benim ardımdan uzun zaman yaşayacaksın. Hatta senden birtakım kavimler faydalanacaktır,diğer bir takımları da zarar göreceklerdir. Lakin en çaresiz olan Sad b. Havledir.\" Ravi \" Nebi Sallallahu Aleyhi ve Sellem Sa' db. HavIe Mekke' de öIdüğü için ona acır, üzüIürdü\" demiştir. Ravinin ifadesine göre Sa'd b. HavIe, Amir b. Luey oğullarından bir kişi idi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 10
      },
      "narrator": {
        "en": "Sa`d bin Abi Waqqas"
      }
    },
    {
      "hadithNumber": 6734,
      "arabicNumber": 6734,
      "book": 85,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، شَيْبَانُ عَنْ أَشْعَثَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ أَتَانَا مُعَاذُ بْنُ جَبَلٍ بِالْيَمَنِ مُعَلِّمًا وَأَمِيرًا، فَسَأَلْنَاهُ عَنْ رَجُلٍ، تُوُفِّيَ وَتَرَكَ ابْنَتَهُ وَأُخْتَهُ، فَأَعْطَى الاِبْنَةَ النِّصْفَ وَالأُخْتَ النِّصْفَ‏.‏",
        "translations": {
          "en": "Narrated Al-Aswad bin Yazid:Mu`adh bin Jabal came to us in Yemen as a tutor and a ruler, and we (the people of Yemen) asked him about (the distribution of the property of ) a man who had died leaving a daughter and a sister. Mu`adh gave the daughter one-half of the property and gave the sister the other half",
          "ur": "مجھ سے محمود بن غیلان نے بیان کیا، کہا ہم سے ابوالنضر نے بیان کیا، کہا ہم سے ابومعاویہ شیبان نے بیان کیا، ان سے اشعث بن ابی الشعثاء نے، ان سے اسود بن یزید نے بیان کیا کہ معاذ بن جبل رضی اللہ عنہ ہمارے یہاں یمن میں معلم و امیر بن کر تشریف لائے۔ ہم نے ان سے ایک ایسے شخص کے ترکہ کے بارے میں پوچھا جس کی وفات ہوئی ہو اور اس نے ایک بیٹی اور ایک بہن چھوڑی ہو اور اس نے اپنی بیٹی کو آدھا اور بہن کو بھی آدھا دیا ہو۔",
          "fr": "Rapporté par Al-Aswad bin Yazid : Mu`adh bin Jabal est venu chez nous au Yémen en tant qu’enseignant et gouverneur, et nous (les gens du Yémen) lui avons demandé comment répartir les biens d’un homme décédé qui laissait une fille et une sœur. Mu`adh a donné la moitié des biens à la fille et l’autre moitié à la sœur",
          "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu An Nadhr] telah menceritakan kepada kami [Abu Mu'awiyah Syaiban] dari [Asy'ats] dari [Al Aswad bin Yazid] mengatakan; [Muadz bin Jabal] datang kepada kami di Yaman sebagai pengajar dan pemimpin, kemudian kami bertanya kepadanya mengenai seseorang yang wafat dan meninggalkan anak perempuan dan saudara perempuannya. maka dia memberi anak perempuannya separoh dan saudara perempuannya separoh",
          "tr": "Esved b. Yezid şöyIe demiştir: \"Muaz b. CebeI bize Yemen'e bir eğitici / öğretici ve emir oIarak geIdi. Kendisine vefat edip, geride bir kızıyIa kız kardeşi kaIan kimsenin mirasının nasıI payIaştmIacağını sordu k. Muaz mirasın yarısını kıza, yarısını da kız kardeşe verdi.\" Fethu'l-Bari Açıklaması: Kız çocukIarının mirası konusundaki temeI dayanak, Feraiz böIümünün baş tarafında geçtiği üzere \"Allah size çocuklarınız hakkında erkeğe, kadının payının iki misli (miras vermenizi) emreder\"(Nisa 11) ayet-i kerimesidir. KızIarın mirasına, ayetin nüzuI sebebine ve cahiliye haIkının kızIara miras vermedikIerine daha önce işaret edilmişti. \"(Çocuklar) ikiden fazla kadın iseler\"(Nisa 11) ayet-i kerimesi hakkında o meşhur soruya cevap veren bilginIer de aynı sebebi esas aImışIardır. Çünkü bu ayet inince şöyIe denilmişti: Ayette iki kızın tek başIarına değil, öIenin,oğIuyIa birlikte bulunma durumundaki hükmü ile her iki halde tek kızın ve iki kızdan daha fazlasının durumu zikredilmektedir. İbn Abbas, iki kızın hükmünün bir kız gibi olduğu görüşünde tek kalmıştır. Çoğunluk bu görüşü benimsememiştir. Bilginlerin bu konudaki esas aldıkları delil hakkında ihtilaf edilmiştir. Bazı bilginler, iki kızın hükmünün üç ve daha fazla kızın hükmü gibi olduğunu söylemiştir. Bunların delili sünnetteki açıklamalardır. Çünkü ayet ihtimale açık olunca sünnet, iki kızın hükmünün ikiden daha fazla kızın hükmü gibi olduğunu açıklamıştır. Bu, nüzul sebebi konusunda açık ve nettir. Zira amca iki kızın mirastan payalmasına engel olunca ve kızların anneleri bunu şüpheyle karşılayınca Nebi Sallallahu Aleyhi ve Sellem ona \"Allah bu konuda hükmünü verecektir\" buyurmuş, bunun üzerine miras ayeti inmiştir. Resulullah Sallallahu Aleyhi ve Sellem amcaya haber göndermiş ve \"Sa'd'ın iki kızına mirasın üçte ikisini ver\" buyurmuştur. Bu durum Kitabın (Kur'an) sünnetle nesh edilmesi sonucunu doğurur gibi bir itiraza mahal yoktur. Çünkü yapılan nesh değil, açıklamadır. Bazıları ise şöyle demiştir: İki kızın hükmü, iki kız kardeşe kıyas edilerek bulunmuştur. Çünkü kızlar daha önceliklidir. Zira onlar, ölüye kızkardeşine nazaran daha şefkatli olmak gibi bir özellik taşırlar, Dolayısıyla onlar, kızkardeşlerden daha aşağı mertebede olamazlar"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 11
      },
      "narrator": {
        "en": "Al-Aswad bin Yazid"
      }
    },
    {
      "hadithNumber": 6735,
      "arabicNumber": 6735,
      "book": 85,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:Allah's Messenger (ﷺ) said, \"Give the Fara'id (shares prescribed in the Qur'an) to those who are entitled to receive it; and whatever remains, should be given to the closest male relative of the deceased",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، کہا ہم سے عبداللہ ابن طاؤس نے بیان کیا، ان سے ان کے والد نے اور ان سے ابن عباس نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”پہلے میراث ان کے وارثوں تک پہنچا دو اور جو باقی رہ جائے وہ اس کو ملے گا جو مرد میت کا بہت نزدیکی رشتہ دار ہو۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Messager d’Allah (ﷺ) a dit : « Donnez les parts prescrites dans le Coran à ceux qui y ont droit ; et ce qu’il reste doit être donné au parent masculin le plus proche du défunt. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu 'Abbas] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya)",
          "tr": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Miras pay/arını sahip/erine veriniz. Bu pay/ardan geri ka/an herhangi bir şey de baba tarafından en yakın o/an erkek kişiye aittir. \" Fethu'l-Bari Açıklaması: İmam Buhari'nin attığı bu başlıktan maksadı, ölen kişinin kendi sulbünden oğlu hayatta olmadığı takdirde demektir ki ölenin oğlu, oğlun oğlunun ister babası olsun, isterse amcası olsun farketmez. İbn Battal şöyle demiştir: Fıkıh bilginlerinin çoğunluğuna göre bir kimse ölür, geride eşi, babası, kızı ve oğlunun oğluyla, oğlunun kızı kalırsa, ashab-ı feraiz'den eş, 114, baba 116 ve kız 112 alır. Geriye kalan ise bir erkeğe iki dişi hissesi olmak şartıyla oğlun oğluyla kızına kalır. Geride kalan kız, oğlandan daha alt derecede ise oğlan mirasın kalanını alırken, kız bir şeyalamaz. Bazı alimlere göre ise geri kalan hisse mutlak olarak oğlana verilir. Çünkü Nebi Sallallahu Aleyhi ve Sellem \"Bu pay/ardan geri ka/an herhangi bir şey de baba tarafından en yakın o/an erkek kişiye aittir\" buyurmaktadır. Zeyd b. Sabit ve çoğunluk ise \"Allah size çocuk/arın ız hakkında erkeğe, kadının payının iki mis/i (miras vermenizi) emreder\"(Nisa 11) ayetini esas almışlardır. Onlar, gerek erkek, gerek kız oğlanın çocuklarının ölünün oğlu hayatta olmadığı takdirde aynı derecede olmaları kaydıyla oğullar gibi olduğu noktasında icma etmişlerdir. Buna göre oğlun oğluyla, oğlun kızının birlikte mirastan payalmaları \"en yakın o/an erkek kişiye aittir\" ifadesinin genelliğini tahsis etmektedir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 12
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6736,
      "arabicNumber": 6736,
      "book": 85,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو قَيْسٍ، سَمِعْتُ هُزَيْلَ بْنَ شُرَحْبِيلَ، قَالَ سُئِلَ أَبُو مُوسَى عَنِ ابْنَةٍ وَابْنَةِ ابْنٍ وَأُخْتٍ، فَقَالَ لِلاِبْنَةِ النِّصْفُ وَلِلأُخْتِ النِّصْفُ، وَأْتِ ابْنَ مَسْعُودٍ فَسَيُتَابِعُنِي‏.‏ فَسُئِلَ ابْنُ مَسْعُودٍ وَأُخْبِرَ بِقَوْلِ أَبِي مُوسَى، فَقَالَ لَقَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنَ الْمُهْتَدِينَ،، أَقْضِي فِيهَا بِمَا قَضَى النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ ابْنٍ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ، وَمَا بَقِيَ فَلِلأُخْتِ ‏\"‏‏.‏ فَأَتَيْنَا أَبَا مُوسَى فَأَخْبَرْنَاهُ بِقَوْلِ ابْنِ مَسْعُودٍ، فَقَالَ لاَ تَسْأَلُونِي مَا دَامَ هَذَا الْحَبْرُ فِيكُمْ‏.‏",
        "translations": {
          "en": "Narrated Huzail bin Shirahbil:Abu Musa was asked regarding (the inheritance of) a daughter, a son's daughter, and a sister. He said, \"The daughter will take one-half and the sister will take one-half. If you go to Ibn Mas`ud, he will tell you the same.\" Ibn Mas`ud was asked and was told of Abu Musa's verdict. Ibn Mas`ud then said, \"If I give the same verdict, I would stray and would not be of the rightly-guided. The verdict I will give in this case, will be the same as the Prophet (ﷺ) did, i.e. one-half is for daughter, and one-sixth for the son's daughter, i.e. both shares make two-thirds of the total property; and the rest is for the sister.\" Afterwards we cams to Abu Musa and informed him of Ibn Mas`ud's verdict, whereupon he said, \"So, do not ask me for verdicts, as long as this learned man is among you",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے، کہا ہم سے ابوقیس عبدالرحمٰن بن ثروان نے، انہوں نے ہزیل بن شرحبیل سے سنا، بیان کیا کہ ابوموسیٰ رضی اللہ عنہ سے بیٹی، پوتی اور بہن کی میراث کے بارے میں پوچھا گیا تو انہوں نے کہا کہ بیٹی کو آدھا ملے گا اور بہن کو آدھا ملے گا اور تو ابن مسعود رضی اللہ عنہ کے یہاں جا، شاید وہ بھی یہی بتائیں گے۔ پھر ابن مسعود رضی اللہ عنہ سے پوچھا گیا اور ابوموسیٰ رضی اللہ عنہ کی بات بھی پہنچائی گئی تو انہوں نے کہا کہ میں اگر ایسا فتویٰ دوں تو گمراہ ہو چکا اور ٹھیک راستے سے بھٹک گیا۔ میں تو اس میں وہی فیصلہ کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا کہ بیٹی کو آدھا ملے گا، پوتی کو چھٹا حصہ ملے گا، اس طرح دو تہائی پوری ہو جائے گی اور پھر جو باقی بچے گا وہ بہن کو ملے گا۔ پھر ابوموسیٰ رضی اللہ عنہ کے پاس آئے اور ابن مسعود رضی اللہ عنہ کی بات ان تک پہنچائی تو انہوں نے کہا کہ جب تک یہ عالم تم میں موجود ہیں مجھ سے مسائل نہ پوچھا کرو۔",
          "fr": "Rapporté par Huzail bin Shirahbil : On a demandé à Abu Musa au sujet de l’héritage d’une fille, d’une petite-fille (fille du fils) et d’une sœur. Il a dit : « La fille recevra la moitié et la sœur recevra l’autre moitié. Si vous allez voir Ibn Mas`ud, il vous dira la même chose. » Ibn Mas`ud a été interrogé et on lui a rapporté la décision d’Abu Musa. Ibn Mas`ud a alors dit : « Si je donnais la même réponse, je m’égarerais et je ne ferais pas partie des bien-guidés. Le jugement que je donnerai dans ce cas est celui du Prophète (ﷺ) : la moitié pour la fille, un sixième pour la petite-fille, ce qui fait deux tiers au total ; le reste revient à la sœur. » Ensuite, nous sommes allés voir Abu Musa pour l’informer de l’avis d’Ibn Mas`ud, et il a dit : « Alors, ne me demandez plus de jugements tant que cet homme savant est parmi vous. »",
          "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abu Qais] aku mendengar [Huzail bin Syurahbil] mengatakan, [Abu Musa] pernah ditanya tentang anak perempuan, cucu perempuan dari anak laki-laki dan saudara perempuan, maka dia menjawaB; 'Anak perempuan mendapat separoh, saudara perempuan mendapat separoh, dan datanglah kepada Ibnu Mas'ud, niscaya dia akan sepakat denganku.' Ibnu mas'ud kemudian ditanya dan diberi kabar dengan ucapan Abu Musa, maka ia berujar; 'kalau begitu aku telah sesat dan tidak termasuk orang-orang yang mendapat petunjuk, saya akan memutuskan masalah itu dengan ketetapan yang diputuskan oleh Nabi shallallahu 'alaihi wasallam, anak perempuan mendapat separoh, cucu perempuan dari anak laki-laki mendapat seperenam sebagai pelengkap dari dua pertiga, dan sisanya bagi saudara perempuan.' Maka kami datang kepada Abu Musa dan kami mengabarkan kepadanya dengan ucapan Ibnu mas'ud, maka ia berkata; 'Janganlah kalian bertanya kepadaku selama orang alim ditengah-tengah kalian",
          "tr": "Huzeyl b. Şurahbil şöyle demiştir: Ebu Musa el-fş'ari'ye ölenin kızı, oğlunun kızı ve kız kardeşi birlikte bulunduklarında miras payları soruldu. Ebu Musa şöyle cevap verdi: \"Miras malın yarısı ölen kişinin kızına, bir yarısı da kız kardeşine aittir.\" Ebu Musa soruyu soran kişiye \"Abdullah b. Mesud'a git (bu meseleyi ona da sor). Zannediyorum o da benim görüşüm e uygun cevap verecektir\" dedi. Mesele İbn Mesud'a sorulup, Ebu Musa'nın cevabı ve onun tarafından gönderildiği haber verilince Abdullah b. Mesud şöyle dedi: \"Eğer oğlun kızını mirastan mahrum edersem elbette dalalete düşmüş kimselerden olurum. Hidayete erenlerden olamam. Bu meselede ben Nebi Sallallahu Aleyhi ve Sellem'in hükmettiği gibi hükmederim (ki o da şudur): Ölünün kızı mirasın yarısını alır, oğlununkızı da üçte ikiyi tamamlamak üzere ltıda bir alır. Geri kalan (üçte bir) de kız kardeşin payı olur\" dedi. Hüzeyl şöyle dedi: Biz Ebu Musa'ya gelip, İbn Mesud'un fetvasını kendisine haber verdik. Bize \"Aranızda bu habr (büyük alim) bulunduğu sürece bana bir şey sormayınız\" dedi. Fethu'l-Bari Açıklaması: Ebu Ubeyd el-Herevı, \"habr\" kelimesinin sözü yazıp telif etme, güzelleştirme kökünden türeme \"alim\" anlamına olduğunu söylemiştir. İbn Battal şöyle der: Bu hadisten şöyle bir sonuç çıkmaktadır: Bir alim herhangi bir meselede nass olmadığını düşündüğü takdirde içtihad eder ve o meseleyi araştırmadıkça cevap vermeye kalkışmaz. Hadis bize herhangi bir ihtilaf halinde Nebi s.a.v.'in sünnetinin delil olduğunu göstermektedir. Dolayısıyla böyle bir durumda hadisi esas almak gerekir. Hadisten o dönemin bilginlerinin in saf sahibi kişiler olduklarını, hakkı kabul edip, ona döndüklerini, birbirlerinin alim ve fazilet sahibi kimseler olduğuna şehadet ettiklerini, İbn MfZsud'un sünneti iyi bildiğini, Ebu Musa'nın fetva verirken araştırdığını ve kencljsinden daha alim olduğunu düşündüğü kimseyi gösterdiğini görüyoruz.\" . İbn Battal şöyle devam eder: --İbn Mesud'un rivayeti konusunda bilginler arasında herhangi bir ihtilaf yoktur. Ebu Musa'nın cevabı onun kendi görüşünden döndüğünü göstermektedir. Tahavı, İbn Mesud hadisine dayanarak İbn Abbas'ın rivayet ettiği \"Bu paylardan geri kalan herhangi bir şey de baba tarafından en yakın olan erkek kişiye aittir\" hadisinden maksadın, ölüye asabelerin en yakını olduğunu söylemiştir. Buna göre ölüye en yakın asabe kadın bile olsa ashab-ı feraizden arta kalan malı o alır. Hadisin bu hükme delaleti şöyledir: Nebi Sallallahu Aleyhi ve Sellem baba tarafından olan kızkardeşleri kızlarla birlikte asabe yapmıştır. Dolayısıyla onlar kızlarla birlikte bulunduklarında miras açısından erkek hükmünde olmuşlardır. İbnü'l-Arabı şöyle der: Ebu Musa ve İbn Mesud olayından herhangi bir konuda haber olduğu öğrenilmeden önce kıyasa göre amel etmenin caiz olduğu, öğrendikten sonra haberin hükmüne dönmek gerektiği ve nassa aykırı olan hükmü almamak gerektiği anlaşılmaktadır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 13
      },
      "narrator": {
        "en": "Huzail bin Shirahbil"
      }
    },
    {
      "hadithNumber": 6737,
      "arabicNumber": 6737,
      "book": 85,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"Give the Fara'id, (the shares prescribed in the Qur'an) to those who are entitled to receive it, and then whatever remains, should be given to the closest male relative of the deceased",
          "ur": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ان سے ابن طاؤس نے، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میراث اس کے حقدار تک پہنچا دو اور جو باقی رہ جائے وہ سب سے قریب والے مرد کو دے دو۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a dit : « Donnez les parts prescrites dans le Coran à ceux qui y ont droit, puis ce qu’il reste doit être donné au parent masculin le plus proche du défunt. »",
          "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Wuhaib] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu 'Abbas] radliallahu 'anhuma, dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya)",
          "tr": "İbn Abbas'ın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Miras paylarını sahiplerine veriniz. Bu paylardan geri kalan herhangi bir şey de baba tarafından en yakın olan erkek kişiye aittir\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 14
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6738,
      "arabicNumber": 6738,
      "book": 85,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ، وَلَكِنْ خُلَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ خَيْرٌ ‏\"‏‏.‏ فَإِنَّهُ أَنْزَلَهُ أَبًا‏.‏ أَوْ قَالَ قَضَاهُ أَبًا‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The person about whom Allah's Messenger (ﷺ) said, \"If I were to take a Khalil from this nation (my followers), then I would have taken him (i.e., Abu Bakr), but the Islamic Brotherhood is better (or said: good),\" regarded a grandfather as the father himself (in inheritance)",
          "ur": "ہم سے ابومعمر نے بیان کیا، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا، انہوں نے کہا ہم سے ایوب نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے جو یہ فرمایا ہے کہ اگر میں اس امت کے کسی آدمی کو خلیل بناتا تو ان کو ( ابوبکر رضی اللہ عنہ کو ) کو خلیل بناتا، لیکن اسلام کا تعلق ہی سب سے بہتر ہے تو اس میں نبی کریم صلی اللہ علیہ وسلم نے دادا کو باپ کے درجہ میں رکھا ہے۔",
          "fr": "Rapporté par Ibn `Abbas : La personne à propos de qui le Messager d’Allah (ﷺ) a dit : « Si je devais prendre un ami intime parmi cette communauté (mes compagnons), j’aurais choisi lui (c’est-à-dire Abu Bakr), mais la fraternité islamique est meilleure (ou il a dit : bonne) », considérait le grand-père comme le père lui-même (pour l’héritage)",
          "id": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu 'Abbas] mengatakan; yang disabdakan Rasulullah Shallallahu'alaihiwasallam ialah; \"kalaulah aku mengambil seseorang dari umat ini untuk menjadi kekasih niscaya aku mengambilnya, namun persaudaraan Islam lebih utama -atau beliau bersabda: - lebih baik, \" kemudian beliau menempatkannya sebagai ayah atau memutuskannya sebagai ayah",
          "tr": "İbn Abbas şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in \"Bu ümmetten bir dost edinseydim muhakkak onu (EbU Bekir'i) edinirdim, fakat İslam dostluğu her şeyden daha üstündür -yahut- daha hayırlıdır\" buyurmasına gelince şüphesiz o dedeyi (mirasta) baba derecesine indirmiştir veya dedenin baba gibi olduğuna hükmetmiştir. Fethu'l-Bari Açıklaması: Bu konuda \"dede\"den maksat, baba tarafından olan dededir. Erkek kardeşlerden maksat ise ana-baba bir erkek kardeşlerle, baba bir erkek kardeşlerdir. Ölünün babası varken, dedesinin miras alamayacağı noktasında icma meydana gelmiştir. Oede gerçekten babadır. Fakat ölüye yakınlığı ve uzaklığı itibariyle mertebeleri farklıdır. Bazı alimlere göre bu sözün manası şudur: Oede evlenme haramlığı ve çeşitli iyiliklerin yapılması açısından baba mesabesindedir. Ancak bu iki görüşten meşhur olanı birincisidir. Sıddık olan Hz. Ebu Bekir'in sözüne gelince, Darimi' Müslim'in şartını taşıyan bir senetle bu ifadeyi Ebu Said el-Hudrl'den mevsul olarak \"Ebu Bekir es-Sıddik dedeyi baba (gibi) mütalaa etti\" şeklinde nakletmiştir. Aynı haber Ebu Musa rivayeti ile de sahih olarak nakledilmiştir. Yine Hz. Osman'a dayanan sahih bir isnadla Hz. Ebu Bekir'in dedeyi baba (gibi) mütalaa ettiği rivayet edilmiştir. Hz. Osman'a ait bir ifadede Ebu Bekir'in dedeyi ölenin babası hayatta değilse baba gibi değerlendirdiği nakledilmiştir. İbn Abbas'a dayanan senedi sahih bir rivayete göre Hz. Ebu Bekir dedeyi baba gibi kabul etmiştir. \"Nebi Sallallahu Aleyhi ve Sellem'in sahabileri çok olduğu halde Ebu Bekir'in bu hükmüne muhalefet eden hiçbir kimse olmadığı ile ilgili bir bilgi nakledilmemiştir\" cümlesiyle İbn Abbas zikredilen görüşün delilini güçlendirmek ister gibidir. Çünkü sükuti iemanın delil değeri vardır ve bu konuda sükuti icma meydana gelmiştir. Ölenin babası hayatta değilse, dedenin babanın aldığı mirası alacağını açıkça belirten kişiler arasında müellifin saydıklarından başka Muaz, Ebü'd-Oerda, Ebu Musa, Ubey b. K'ab, Hz. Aişe ve Ebu Hureyre'nin adı zikredilir. İleride geleceği üzere bu görüş, ayrıca -ayrıntıda ihtilaf olmakla birlikte- Hz. Ömer, Osman, Ali ve İbn Mesud'dan rivayet edilmiştir. Tabiundan Ata, Tavus, Ubeydullah b. Abdullah b. Utbe, Ebü'ş-Şa'sa, Şureyh ve Şa'bi'den de bu dOğrultuda görüş nakledilmiştir. Belli başlı beldelere dağılmış fıkıh bilginlerinden (Fukahau'l-emsar) Osman et-Teymi, İmam Ebu Hanife, İshak b. Rahuye, Oavud, Ebu Sevr, el-Müzeni, İbnü's-Süreyc de bu görüşü benimsemişlerdir. Hz. Ömer, Ali, Zeyd b. Sabit, İbn Mesud dede bulunurken erkek kardeşlerin mirasçı olabilecekleri kanaatine varmışlardır. Fakat onlar, ilerde açıklanacağı üzere bunun nasılolacağı noktasında ihtilaf etmişlerdir. İbn Abbas; \"Oğlumun oğlu dururken erkek kardeşlerim bana mirasçı olamazlar. Ben oğlumun oğluna mirasçı olurum\" demiştir. İbn Abdilberr'in ifadesine göre İbn Abbas'ın yaklaşımı şöyledir: Oğlun oğlu oğulolmayınca oğul gibi olduğundan babanın babası da babanın hayatta olmaması halinde baba gibidir . Darimi'nin nakline göre Şa'bi şöyle demiştir: \"Hz. Ömer, de de ye ölünün bir veya iki erkek kardeşi ile birlikte mirastan pay veriyordu. Kardeşler ikiden çok olduklarında onlara mirasın üçte birini paylaştırıyordu. O, ölünün oğlu hayatta olduğunda dedeye mirasın altıda bir veriyordu.\"(Darimi, feraiz) Beyhaki'nin sahih bir senedie nakline göre \"Hz. Ömer, ölenin dedesinin -alacağı miras üçte birden daha çok olacaksa- ana-baba bir erkek ve baba bir erkek kardeşleri ile mirası paylaşacağına hükmetmişti. O, kardeşler çok olduğunda dedeye mirasın üçte birini verirdi. \"(Beyhaki, es-Sünen, VI, 248) Hz. Ali'ye gelince, İbn Ebi Şeybe ve Muhammed b. Nasr'ın sahih bir is na dıa nakillerine göre Şa'bi şöyle demiştir: İbn Abbas, Hz. Ali'ye bir kimse ölüp, geriye mirasçı olarak altı erkek kardeşi ve dedesi kaldığında nasıl hareket edileceğini sordu. Hz. Ali ona \"Oedeyi o kardeşlerden biri gibi kabul edip, mirası yediye böl ve mektubumu at gitsin\" diye cevap verdi. Darimi'nin güçlü bir senetle nakline göre Şa'bi şöyle demiştir: İbn Abbas Basra'da iken Hz. Ali'ye \"Bir dede ve altı kardeşin mirasçı olduğu bir durumla karşılaştım. Ne yapayım?\" diye yazdı. Hz. Ali ona şöyle cevap verdi: \"Dedeye mirasın yedide birini ver. Ondan sonrakilere verme\"(Darimi, Feraiz) Darimi'nin sahih bir senedIe Abdullah b. Seleme'den nakline göre Hz. Ali dedeyi erkek kardeş gibi kabul ediyor ve altıncı mirasçı kılıyordu. Abdullah b. Mesud'a gelince, Darimi'nin sahih bir senetle nakline göre Ebu İshak es-Sebi'i şöyle demiştir: Şureyh'in huzuruna girdim. Yanında Şa'bi, Abdurrahman b. Abdullah b. Mesud bulunuyordu. eı-Aliye adında bizden bir kadının mirasını paylaştırıyarlardı. Kadının kocası, annesi, baba bir erkek kardeşi ve dedesi kalmıştı. Ebu İshak bu olayın devamını şöyle nakletmektedir: Ubeyde b. Amr'ın yanına geldim. -Kufe'de feraizi Ubeyde ve el-Haris el-Aver'den daha iyi bilen kimse yoktur deniyordu.- Ona bu meseleyi sordum. Bana şöyle dedi: \"Eğer istiyorsanız size bu konuda Abdullah b. Mesud'un hükmünü bildireyim. O, (mirası altıya bölüp) kocaya üç hisse yani mirasın yarısını, anneye geriye kalanın üçte birini yani mirasın altıda birini, erkek kardeşe altıda bir ve dedeye altıda bir verdi.(Darimı, Feraiz) Said b. Mansur ve Ebu Bekir b. Ebi Şeybe'nin sahih olan aynı isnadla nakillerine göre Ubeyd b. Nadla şöyle demiştir: Hz. Ömer ve İbn Mesud, erkek kardeşlerle birlikte bulunan dedeye mirastan pay verirlerken altıda birle, kardeşlerle eşit olarak bölüşmekten hangisi lehine ise ona göre hareket ediyorlardı. Aynı haberi Muhammed b. Nasr bu şekilde nakletmiş ve şu ilave de bulunmuştur: Hz. Ömer, Abdullah'a \"Dedeyi mağdur ettiğimizi düşünmekteyim. Bu mektubum sana ulaştığında dedeye erkek kardeşlerle birlikte bulunduğunda mirastan pay ver. Üçte biri ile mirası kardeşlerle eşit bölüşmekten hangisi lehine ise onu ver \"(İbn Ebi Şeybe, el-Musannef, VI, 259) diye yazdı. Sahih bir isnadla Muhammed b. Nasr'ın nakline göre Ubeyde b. Amr şöyle demiştir: Erkek kardeşlerle birlikte bulunduğundadedeye mirasın üçte biri veriliyordu. Hz. Ömer dedeye mirasın altıda birini veriyordu. Sonra Abdullah'a şöyle yazdı: Biz bu dede yüzünden helak olacağımızdan korkuyoruz. Ona mirasın üçte birini ver. Sonra Hz. Ali buraya yani Kufe'ye geldi ve dedeye mirasın altıda birini verdi. Ubeyde şöyle dedi: Hz. Ali ile Ömer'in birlikte verdikleri hüküm, bana ayrı ayrı verdikleri hükümden daha sevimlidir. Zeyd b. Sabit' e gelince, Darimi'nin nakline göre Hasan-ı Basri şöyle demiştir: Zeyd, erkek kardeşlerle birlikte bulunan dedeye mirasın üçte birini veriyordu. (Darimı, Feraiz) İbn Abdilberr şöyle demiştir: Sahabe arasında Zeyd b. Sabit dedenin baba bir erkek kardeşlerle, ana-baba bir erkek kardeşlere denk olduğu görüşünde tek kalmıştır. Birçok fıkıh bilgini bu konuda ona muhalif olmuştur. Çünkü baba bir erkek kardeşler, ana-baba bir erkek kardeşlerle birlikte bulunduklarında mirastan payalamazlar. Dolayısıyla onları öz kardeşlerle bir tutmanın herhangi bir anlamı yoktur. Zira dedenin miras bölüşme durumunda alacağı mirasın azalacağından korkulur. İbn Abbas, Zeyd b. Sabit'e bu durumu sorunca, Zeyd şöyle demiştir: Sen bu konuda nasıl kendi görüşünü söylüyorsan, ben de kendi görüşümü söylüyorum. Tahav! şöyle demiştir: İmam Malik, Şafil ve Ebu Yusuf, beraberinde ana-baba bir erkek kardeşler bulunduğunda dedeye miras verme noktasında Zeyd b. Sabit'in görüşüne katılmışlardır. Onlara göre dedenin kardeşlerle birlikte mirastan ortaklaşa payalması, alacağı üçte birden daha fazla olduğu takdirde onlarla ortaklaşa böıüşür. Eğer üçte bir onun için daha uygunsa onu alır ve baba bir erkek kardeşler dedeyle birlikte bulunduklarında hiçbir şeyalamayacakları gibi, erkek kardeşlerin oğulları da -öz kardeş bile olsalar- mirastan payalamazlar. Dede ve erkek kardeşlerle birlikte ashab-ı feraizden bir kişi bulunduğunda önce onların hissesi verilir, sonra dedeye mirasçılarla birlikte eşit bölüşmek, kalanın üçte birini almak ve mirasın altıda birini almak seçeneklerinde lehine en uygun olanı verilir. Dedenin hissesi Ekderiyye hariç altıda birden eksik olmaz. Tahav! şöyle demiştir: Hişam'ın nakline göre Muhammed b. el-Hasen dede konusunda hüküm vermemiştir. Ebu Yusuf, İbn Ebu Leyla dede konusunda Hz. Ali'nin görüşünü esas alırlardı. Ahmed b. Hanbel'in yaklaşımı ise dedenin (miras açısından) erkek kardeşlerden birisi gibi olduğudur. Mirasın üçte biri dedenin daha çok lehine olduğunda onu alır. Ashab-ı feraizle birlikte bulunduğunda ise onlar hisselerini aldıktan sonra kardeş gibi bölüşme, mirasın kalanının üçte birini alma ya da tümünün altıda birini alma seçeneklerinden lehine en uygun olanı alır. Yukarıda işaret edilen Ekderiyye'ye merbaatü'l-cemaa da denilir. Çünkü onlar mirasçıların dört kişi oldukları noktasında icma etmişler, ancak hisseleri açısından ihtilaf etmişlerdir. Söz konusu mirasçılar, koca, anne, kız kardeş ve dededir. Bu durumda koca mirasın yarısını alırken, anne üçte birini, dede altıda birini, kız kardeş ise yarısını alır. Burada meselenin paydası genişletilerek miras 27 hisse üzerinden bölüştürülür. Buna göre 27 nin 9'unu koca, 6'sını anne, 4'ünü kız kardeş ve 8'ini dede alır. Bazıları bu meseleyi şu şekilde şiir dizelerine dökmüşlerdir. Bilir misin dört kişinin mirastan hissesini? Hesapla her birinin bu mirastan hissesini! Birisi alır tüm serveti n üçte birini (eş), İkincisine verirler geri kalanın üçte birini (anne) Üçüncü de bundan sonra alır kalanın üçte birini (kız kardeş) Nedir hissesi dördüncünün? Yokla bakalım bilgini! (dede)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 15
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6739,
      "arabicNumber": 6739,
      "book": 85,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ وَرْقَاءَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْمَالُ لِلْوَلَدِ، وَكَانَتِ الْوَصِيَّةُ لِلْوَالِدَيْنِ، فَنَسَخَ اللَّهُ مِنْ ذَلِكَ مَا أَحَبَّ، فَجَعَلَ لِلذَّكَرِ مِثْلَ حَظِّ الأُنْثَيَيْنِ، وَجَعَلَ لِلأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ، وَجَعَلَ لِلْمَرْأَةِ الثُّمُنَ وَالرُّبُعَ، وَلِلزَّوْجِ الشَّطْرَ وَالرُّبُعَ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:(During the early days of Islam), the inheritance used to be given to one's offspring and legacy used to be bequeathed to the parents, then Allah cancelled what He wished from that order and decreed that the male should be given the equivalent of the portion of two females, and for the parents one-sixth for each of them, and for one's wife one-eighth (if the deceased has children) and one-fourth (if he has no children), for one's husband one-half (if the deceased has no children) and one-fourth (if she has children)",
          "ur": "ہم سے محمد بن یوسف نے بیان کیا، ان سے ورقاء نے بیان کیا، ان سے ابن ابی نجیح نے بیان کیا، ان سے عطاء نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ پہلے مال کی اولاد مستحق تھی اور والدین کو وصیت کا حق تھا۔ پھر اللہ تعالیٰ نے اس میں سے جو چاہا منسوخ کر دیا اور لڑکوں کو لڑکیوں کے دگنا حق دیا اور والدین کو اور ان میں سے ہر ایک کو چھٹے حصہ کا مستحق قرار دیا اور بیوی کو آٹھویں اور چوتھے حصہ کا حق دار قرار دیا اور شوہر کو آدھے یا چوتھائی کا حقدار قرار دیا۔",
          "fr": "Rapporté par Ibn `Abbas : (Au début de l’Islam), l’héritage était donné aux enfants et le legs allait aux parents. Ensuite, Allah a annulé ce qu’Il a voulu de cet ordre et a décrété que le garçon reçoive une part équivalente à celle de deux filles, que chaque parent ait un sixième, que l’épouse ait un huitième (si le défunt a des enfants) ou un quart (s’il n’a pas d’enfants), et que le mari ait la moitié (si la défunte n’a pas d’enfants) ou un quart (si elle a des enfants)",
          "id": "Telah menceritakan kepada kami [Muhamad bin Yusuf] dari [Warqo'] dari [Ibnu Abi Najih] ari ['Atho`] dari [Ibnu Abbas] radliallahu 'anhuma mengatakan; 'dahulu harta untuk anak dan washiyat untuk kedua orang tua, kemudian Allah menghapus hal itu sekehendak-Nya, dan menjadikan bagi anak laki-laki seperti dua bagian anak perempuan, untuk kedua orangtua masing-masing seperenam, dan isteri seperdelapan dan seperempat, dan suami separoh dan seperempat",
          "tr": "İbn Abbas şöyle demiştir: \"Miras olarak kalan mal, çocuklara aitti. Vasiyet de (ilk zamanlar) ana baba için yapılıyordu. Allahu Teala bundan dilediği kısmı nesh etti ve erkeğe iki dişinin payı hisse tahsis etti. Ölen kişinin anne ve babasından her birine altıda bir, hanımına (çocuğu olauğu takdirde) sekizde bir, (bulunmadığında) dörtte bir ayırdı. Kocaya (ölenin çocuğu bulunmadığında) yarısını ve (çocuğu bulunduğunda) dörtte birini verdi.\" Fethu'l-Bari Açıklaması: Koca, hiçbir durumda mirastan mahrum olmaz. Ancak ölen eşin çocuğu bulunduğunda hissesi yandan dörtte bire iner. İmam Buhari bu konuda \"Miras olarak kalan mal, çocuklara aitti. Vasiyet de (ilk zamanlar) ana baba için yapılıyordu ... \" hadisini zikretmiştir. Bu hadis daha önce Vasaya bölümünde geçmişti ve biz orada bu hadisin gerek senet ve gerekse metin yönünden uzun uzun açıklamasını yapmıştık. İbnü'I-Müneyyir şöyle demiştir: İmam Buharl'nin ayet delili konuya gayet açık olarak işaret ettiği halde İbn Abbas hadisini delilolarak göstermesi, ayetin nüzul sebebini belirtmek ve onun tevil edilmeksizin ve nesih de sozkonusu olmaksızın zahiri üzere olduğuna işaret etmek içindir. Süheylı anne ve babadan her birine mirasın altıda birinin tahsis edilmesindeki hikmeti şu şekilde açıklamıştır: Anne ve babaya mirastan eşit şekilde pay verilmesi, hisselerinin bu miktarın altına düşmemesi ve mesela çocuklar çok olduğu takdirde mağdur olmamaları amacına yöneliktir. Ölenin çocukları veya erkek kardeşleri varken anne ve babanın mirastan eşit olarak payalmaları, her birinin ölen çocuklarını yetiştirme ve benzeri fedakarlıklarına karşılıktır. Ölenin çocuğu ve erkek kardeşleri bulunmadığı takdirde baba, anneye nazaran daha fazla payalır. Çünkü onun harcamada bulunma, yardım etme ve benzeri ayrıcalıkları vardır. Annenin bu durumu ise çocuğun hayatta iken ona iyilik açısından babasına üstün tutulması isteği ile telafi edilir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 16
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6740,
      "arabicNumber": 6740,
      "book": 85,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لَحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ‏.‏ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ، فَقَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا، وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) gave the judgment that a male or female slave should be given in Qisas for an abortion case of a woman from the tribe of Bani Lihyan (as blood money for the fetus) but the lady on whom the penalty had been imposed died, so the Prophets ordered that her property be inherited by her offspring and her husband and that the penalty be paid by her Asaba",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے، ان سے ابن شہاب نے، ان سے ابن المسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے بنی لحیان کی ایک عورت ملیا بنت عویمر کے بچے کے بارے میں جو ایک عورت کی مار سے مردہ پیدا ہوا تھا کہ مارنے والی عورت کو خون بہا کے طور پر ایک غلام یا لونڈی ادا کرنے کا حکم فرمایا تھا۔ پھر وہ عورت بچہ گرانے والی جس کے متعلق نبی کریم صلی اللہ علیہ وسلم نے فیصلہ دیا تھا مر گئی تو نبی کریم صلی اللہ علیہ وسلم نے فیصلہ کیا کہ اس کی میراث اس کے لڑکوں اور شوہر کو دے دی جائے اور یہ دیت ادا کرنے کا حکم اس کے کنبہ والوں کو دیا تھا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a jugé qu’un esclave homme ou femme devait être donné en Qisas dans une affaire d’avortement concernant une femme de la tribu de Bani Lihyan (comme prix du sang pour le fœtus). Mais la femme sur qui la peine avait été imposée est décédée, alors le Prophète (ﷺ) a ordonné que ses biens soient hérités par ses enfants et son mari, et que la peine soit payée par ses Asaba",
          "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Ibnul Musayyab] dari [Abu Hurairah] bahwasanya ia mengatakan; Rasulullah Shallallahu'alaihiwasallam menetapkan tentang janin wanita dari Bani lahyan yang keguguran dengan ghurrah (pembayaran diyat dengan satu budak atau budak perempuan), kemudian wanita yang beliau putuskan membayar ghurrah meninggal, maka Rasulullah Shallallahu'alaihiwasallam memutuskan bahwa warisannya untuk anak laki-lakinya dan suaminya, sedang diyatnya bagi 'ashobahnya",
          "tr": "Ebu Hureyre r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem, Lihyan oğullarından bir kadının ölü olarak düşen ce nın i için gurre yani bir köle veya bir cariye verilmesine hükmetti. Sonra hakkında.gurre ile hükmettiği kadın vefat edince Nebi Sallallahu Aleyhi ve Sellem O kadının mirasının oğullarına ve kocasına ait olduğuna ve ödeyeceği diyeti asabesinin ödemekle yükümlü olduğuna hükmetti. Fethu'l-Bari Açıklaması: Karı-kocadan hiçbirinin herhangi bir şekilde miras hakları sakıt olmaz. Aksine çocuk kocanın miras payını yarıdan dörtte bire, kadınınkini ise dörtte birden sekizde bire düşürür. İmam Buhari bu konuda bir başka kadına vurup, çocuğunun düşmesine sebep olan kadın hakkında verilen hükmü Ebu Hureyre'den nakletti. Bu olayda vuran kadın daha sonra ölür. Nebi s.a.v. cenin hakkında gurre ile hükmeder ve bunu katil olan kadının asabesinin ödemek zorunda olduğunu ve kendi mirasının ise çocuklarına ve kocasına kalacağını belirtir. Bu hadisin geniş bir açıklaması ileride inşaallah Diyat bölümünde gelecektir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 17
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6741,
      "arabicNumber": 6741,
      "book": 85,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ قَضَى فِينَا مُعَاذُ بْنُ جَبَلٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم النِّصْفُ لِلاِبْنَةِ وَالنِّصْفُ لِلأُخْتِ‏.‏ ثُمَّ قَالَ سُلَيْمَانُ قَضَى فِينَا‏.‏ وَلَمْ يَذْكُرْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Al-Aswad:Mu`adh bin Jabal gave this verdict for us in the lifetime of Allah's Messenger (ﷺ). One-half of the inheritance is to be given to the daughter and the other half to the sister. Sulaiman said: Mu`adh gave a verdict for us, but he did not mention that it was so in the lifetime of Allah's Messenger (ﷺ)",
          "ur": "ہم سے بشر بن خالد نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، ان سے شعبہ بن حجاج نے، ان سے سلیمان اعمش نے، ان سے ابراہیم نخعی نے اور ان سے اسود بن یزید نے بیان کیا کہ معاذ بن جبل رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ہمارے درمیان یہ فیصلہ کیا تھا کہ آدھا بیٹی کو ملے گا اور آدھا بہن کو۔ پھر سلیمان نے جو اس حدیث کو روایت کیا تو اتنا ہی کہا کہ معاذ نے ہم کنبہ والوں کو یہ حکم دیا تھا یہ نہیں کہا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں۔",
          "fr": "Rapporté par Al-Aswad : Mu`adh bin Jabal a donné ce verdict pour nous du vivant du Messager d’Allah (ﷺ) : la moitié de l’héritage revient à la fille et l’autre moitié à la sœur. Sulaiman a dit : Mu`adh a donné ce verdict pour nous, mais il n’a pas précisé que c’était du vivant du Messager d’Allah (ﷺ)",
          "id": "Telah menceritakan kepada kami [Bisyr bin Khalid] telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Sulaiman] dari [Ibrahim] dari [Al Aswad] mengatakan; ' [Mu'adz bin Jabal] memutuskan bagi kami dimasa Rasulullah Shallallahu'alaihiwasallam untuk anak perempuan mendapat separoh, saudara perempuan mendapat separoh, ' kemudian Sulaiman mengatakan; 'ia memutuskan ditengah-tengah kami' tanpa menyebut di masa Rasulullah Shallallahu'alaihiwasallam",
          "tr": "Esved şöyle demiştir: Muaz b. Cebel, Nebi Sallallahu Aleyhi ve Sellem'in zamanında bizim aramızda kız için yarım, kız kardeş için de yarım paya hükmetti. Hadisi nakleden ravilerden Süleyman b. Mihran \"Bizim aramızda hükmetti\" derken, \"Resulullah Sallallahu Aleyhi ve Sellem zamanında\" cümlesini zikretmemiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 18
      },
      "narrator": {
        "en": "Al-Aswad"
      }
    },
    {
      "hadithNumber": 6742,
      "arabicNumber": 6742,
      "book": 85,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، قَالَ قَالَ عَبْدُ اللَّهِ لأَقْضِيَنَّ فِيهَا بِقَضَاءِ النَّبِيِّ صلى الله عليه وسلم لِلاِبْنَةِ النِّصْفُ، وَلاِبْنَةِ الاِبْنِ السُّدُسُ، وَمَا بَقِيَ فَلِلأُخْتِ‏.‏",
        "translations": {
          "en": "Narrated Huzail:`Abdullah said, \"The judgment I will give in this matter will be like the judgment of the Prophet, i.e. one-half is for the daughter and one-sixth for the son's daughter and the rest of the inheritance for the sister",
          "ur": "ہم سے عمرو بن عباس نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے ابوقیس (عبدالرحمٰن بن عزوان) نے، ان سے ہزیل بن شرحبیل نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کے فیصلہ کے مطابق اس کا فیصلہ کروں گا، لڑکی کو آدھا، پوتی کو چھٹا اور جو باقی بچے بہن کا حصہ ہے۔",
          "fr": "Rapporté par Huzail : `Abdullah a dit : « Le jugement que je vais donner dans cette affaire sera comme celui du Prophète : la moitié pour la fille, un sixième pour la petite-fille (fille du fils), et le reste de l’héritage pour la sœur. »",
          "id": "Telah menceritakan kepada kami [Amru bin 'Abbas] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Abu Qais] dari [Huzail] mengatakan, [Abdullah] mengatakan; 'Sungguh aku putuskan perkara ini dengan keputusan Nabi shallallahu 'alaihi wasallam, ' atau ia mengatakan; Nabi shallallahu 'alaihi wasallam bersabda: \"anak perempuan mendapat separoh dan cucu perempuan dari anak laki-laki mendapat seperenam dan sisanya untuk saudara perempuan",
          "tr": "Huzeyl b. Şurahbil, (Kız, oğlun kızı ve kız kardeş mirası) konusunda elbette Nebi Sallallahu Aleyhi ve Sellem'in hükmettiği gibi hüküm vereceğim -veya Nebi Sallallahu Aleyhi ve Sellem buyurdu ki- diyerek söze başlamış ve kız için yarım, oğlun kızı için altıda bir ve kızkardeş için de asabe yoluyla geri kalan üçte bir verileceğini söylemiştir. Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Bilginler, kız kardeşlerin ölünün kızlarıyla birlikte bulunduklarında asabe oldukları konusunda icma etmişlerdir. Buna göre kız kardeşler, kızlardan arta kalan mirası alırlar. Bir kimsenin geriye sadece kızı ve kız kardeşi kalsa Muaz'ın rivayet ettiği hadise göre kızı yarısını, kız kardeşi de kalan yarısını alır. Buna karşılık iki kız ve bir kız kardeşi kalacak olsa, kızlar mirasın üçte ikisini alırken kız kardeş kalan üçte birini alır. Bir kimsenin öldükten sonra geriye kızı, kız kardeşi, oğlunun kızı kalsa İbn Mesud hadisine göre kızı mirasın yarısını alırken, oğlunun kızı, bu payı 2/3'e çıkaracak hisseyi alırken, kız kardeşi de geriye kalanı alır. Çünkü kızlar 2/3'ten daha fazlasına mirasçı olamazlar. Bu konuda İbn Mesud'a, İbn Abbas'tan başka muhalif olan olmamıştır. Çünkü İbn Abbas şöyle diyordu: Kız, mirasın yarısını alırken, kalanı asabenindir. Kız kardeş ise hiçbir şeyalamaz. Aynı şekilde ölenin kızıyla, oğlunun kızı mirasın 2/3'ünü alırken, kalanı asabenindir. Ölünün asabesi olmadığında ise kalan kısım kıza veya kızlara iade edilir. Bu konudaki hüküm daha önce geçmişti. İbn Battal şöyle devam eder: Zahiriler hariç bu konuda İbn Abbas'a katılan olmamıştır. İbn Battal şöyle devam eder: Çoğunluğun delili akli açıdan şöyledir: Allahu Teala'ın \"Eğer çocuğu olmayan bir kimse ölür de onun bir kız kardeşi bulunursa ... \"(Nisa 176) ayet-i kerimesinde \"çocuğun olmaması\", kız kardeşin mutlak olarak mirastan payalmasının değil, diğer varislerle bölüştüğü payını almasının şartı kılınmıştır. Şart bulunmadığında hisse sakıt olur. Bu onun başka bir manada mirasçı olmasına engel değildir. Tıpkı erkek kardeşin kız kardeşine mirasçı olmasının onun çocuğunun bulunmaması şartına bağlanması gibi. Erkek kardeş, kız kardeşine -onu!) çocuğu olmadığı takdirde- mirasçı olur. Bilginler, erkek kardeşin kız kardeşine onun kızı ile birlikte mirasçı olabileceği noktasında icma etmişlerdir. Bu mesele kocanın mirasın yarısını alabilmesi için ölenin çocuğunun olmamasının şart olmasına benzemektedir. Bu, kocanın ölenin kızıyla birlikte bulunduğunda mirasın yarısını almasına man i değildir. Koca yarının yarısını hissesi olarak, kalan yarıyı da -mesela ölen kadının amcaoğlu ise- asabe olarak alır. Kız kardeş de açıklamasını yaptığımız durumda aynen böyledir. Doğruyu en iyi Allah Teala bilir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 19
      },
      "narrator": {
        "en": "Huzail"
      }
    },
    {
      "hadithNumber": 6743,
      "arabicNumber": 6743,
      "book": 85,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ، فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ، ثُمَّ نَضَحَ عَلَىَّ مِنْ وَضُوئِهِ فَأَفَقْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا لِي أَخَوَاتٌ‏.‏ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏",
        "translations": {
          "en": "Narrated Jabir:While I was sick, the Prophet (ﷺ) entered upon me and asked for some water to perform ablution, and after he had finished his ablution, he sprinkled some water of his ablution over me, whereupon I became conscious and said, \"O Allah's Messenger (ﷺ)! I have sisters.\" Then the Divine Verses regarding the laws of inheritance were revealed",
          "ur": "ہم سے عبداللہ بن عثمان نے بیان کیا، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو شعبہ بن حجاج نے خبر دی، ان سے محمد بن منکدر نے بیان کیا، انہوں نے جابر رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم میرے گھر تشریف لائے اور میں بیمار تھا۔ نبی کریم صلی اللہ علیہ وسلم نے پانی منگوایا اور وضو کیا، پھر اپنے وضو کے پانی سے مجھ پر چھینٹا ڈالا تو مجھے ہوش آ گیا۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا: یا رسول اللہ! میری بہنیں ہیں؟ اس پر میراث کی آیت نازل ہوئی۔",
          "fr": "Rapporté par Jabir : Alors que j’étais malade, le Prophète (ﷺ) est venu me voir et a demandé de l’eau pour faire ses ablutions. Après avoir terminé, il a aspergé un peu de cette eau sur moi, ce qui m’a fait reprendre conscience. J’ai alors dit : « Ô Messager d’Allah (ﷺ) ! J’ai des sœurs. » Ensuite, les versets divins concernant les lois de l’héritage ont été révélés",
          "id": "Telah menceritakan kepada kami [Abdullah bin Utsman] Telah mengabarkan kepada kami [Abdullah] Telah mengabarkan kepada kami [Syu'bah] dari [Muhammad bin Al Munkadir] mengatakan; aku mendengar [Jabir radhiyallhu'anhu] mengatakan; Nabi shallallahu 'alaihi wasallam mendatangiku ketika saya sedang sakit, kemudian beliau meminta diambilkan air dan berwudhu, kemudian beliau memerciki saya dengan bekas air wudhunya sehingga saya siuman, maka kutanyakan; 'Wahai Rasulullah, saya mempunyai beberapa saudara perempuan! ' maka turunlah ayat faraidh",
          "tr": "Cabir r.a. şöyle demiştir: Ben hasta iken Resulullah Sallallahu Aleyhi ve Sellem yanıma geldi. Abdest suyu istemiş ve abdest almış. Sonra abdest suyundan benim üzerime serpmiş. Bunun üzerine baygınlıktan ayıldım ve \"Ya Resu:allah! Benim (mirasçı olarak) ancak kız kardeşlerim vardır\" dedim. Bunun üzerine feraiz ayet i indi. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Feraiz bölümünün en başında yer alan Cabir hadisini zikretmiştir. Hadise burada da yer verilmesinin amacı Cabir'in \"Benim (mirasçı olarak) ancak kız kardeşlerim vardır\" şeklindeki ifadesidir. Çünkü bu ifade onun çocuğunun olmadığını kesin olarak belirtmektedir. Müellif buradan erkek kardeşlerin mirastan evleviyetle payalacakları sonucunu çıkarmıştır. Imam Buharl'nin önce kız kardeşlerden söz etmesi, hadis-i şerifte onların açık olarak ifade edilmelerindendir. İbn Battal şöyle demiştir: Bilginler, ana-baba bir erkek kardeşlerle baba bir kardeşlerin, ölenin oğluyla (oğlunun oğlu, oğlunun oğlunun oğlu ... da aynıdır) birlikte bulunduklarında ona mirasçı olacakları, babayla birlikte bulunduklarında olamayacakları noktasında görüş birliği etmilerdir. Fıkıh bilginleri daha önce işaret edildiği üzere sözü geçen varislerin öleı.:n dedesiyle birlikte bulunmaları durumunda mirastan pay alıp alama'acakları noktasında ihtilaf etmişlerdir. Bunun dışında kız kardeşlerden birisi hissenin yarısını alırken, iki kız ve daha fazlası üçte ikisini alırlar. Erkek kardeş ise tamamını alır. Bundan daha fazla mirasçı bulunduğunda mirası ortaklaşa böıüşürler. Mirasçılar erkek ve kız kardeşler şeklinde iseler Kur'an-ı Kerim'in açıkça belirttiği üzere erkek, iki dişi hissesi alır. Bu konuda fıkıh bilginleri arasında herhangi bir ihtilaf yoktur. Ancak bir kadının geriye kocası, annesi ve ana bir iki kız kardeşiyle, ana-baba bir erkek kardeşi kaldığı takdirde çoğunluğu oluşturan bilginler, bunların tümü mirastan payalır derlerken, Hz. Ali, Ubey, Ebu Musa ana-baba bir bile olsalar erkek kardeşlerin ana bir erkek kardeşlerle birlikte bulunduklarında mirasçı olamayacaklarını söylemişlerdir. Çünkü onlar asabedirler. Oysa ashab-ı feraiz mirasın tamamını almış bulunmaktadır. KCıfelilerden bir grup da aynı görüşü ileri sürmüşlerdir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 20
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 6744,
      "arabicNumber": 6744,
      "book": 85,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ آخِرُ آيَةٍ نَزَلَتْ خَاتِمَةُ سُورَةِ النِّسَاءِ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏",
        "translations": {
          "en": "Narrated Al-Bara:The last Qur'anic Verse that was revealed (to the Prophet) was the final Verse of Surat-an-Nisa, i.e., 'They ask you for a legal verdict Say: Allah directs (thus) About those who leave No descendants or ascendants as heirs",
          "ur": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، ان سے اسرائیل نے، ان سے ابواسحاق نے، ان سے براء رضی اللہ عنہ نے بیان کیا کہ آخری آیت ( میراث کی ) سورۃ نساء کے آخر کی آیتیں نازل ہوئیں «يستفتونك قل الله يفتيكم في الكلالة‏» کہ ”آپ سے فتویٰ پوچھتے ہیں، کہہ دیجئیے کہ اللہ تعالیٰ تمہیں کلالہ کے بارے میں فتویٰ دیتا ہے۔“",
          "fr": "Rapporté par Al-Bara : Le dernier verset du Coran qui a été révélé (au Prophète) était le dernier verset de la sourate An-Nisa, c’est-à-dire : « Ils te demandent un avis juridique : Dis : Allah donne Son avis à propos de ceux qui n’ont ni descendants ni ascendants comme héritiers. »",
          "id": "Telah menceritakan kepada kami [Ubaidullah bin Musa] dari [Israil] dari [Abu Ishaq] dari [Al Barra`] radliallahu 'anhu mengatakan; 'akhir ayat yang diturunkan adalah penutupan surat An Naisa`; 'Mereka memintamu fatwa tentang kalalah, katakanlah bahwa Allah memfatwakan kepada kalian….(QS. Annisa)",
          "tr": "Bera’ şöyle demiştir: En son inen ayet Nisa suresinin sonundaki \"Senden fetva isterler. Deki: Allah; babası ve çocuğu olmayan kimsenin mirası hakkındaki hükmü şöyle açıklıyor\" ayetidir. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Bera hadisine yer vermiştir. Ebu Davud'un elMerasil'inde nakline göre Ebu Seleme b. Abdurrahman şöyle anlatmıştır: Adamın biri Nebi s.a.v.'e gelerek \"Ya Resulallah! Kelale nedir?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Babası ve çocuğu olmayan bir kimsenin varisleri kelaledir\" buyurdu. Müslim'in Sahih'inde nakline göre Hz. Ömer bir Cuma hutbesinde şöyle demiştir: \"Benden sonraya kanaatimce kelaleden daha önemli bir şey bırakmıyorum. Nebi s.a.v.'e kelale hakkında_başvurduğum kadar, başka bir konuda başvurmuş değilim. Sonunda Resulullah s.a.v. parmağı ile göğsümü dürterek şöyle dedi: \"Nisa suresinin sonundaki yazın inen ayet sana yetmiyor mu?\" Kelalenin açıklaması konusunda bilginler ihtilaf etmişlerdir. Çoğunluğa göre kelale, çocuğu ve babası olmayan kişidir. Fıkıh bilginleri, ölünün kızıyla birlikte mirasçı olarak kalan kız kardeşin onunla birlikte mirastan payalıp alamayacağı noktasında ihtilaf etmişlerdir. Bilginler aynı şekilde dedenin baba gibi kabul edilip, onun mirasçı olarak bulunması durumunda kardeşlerin mirastan payalıp alamayacağı noktasında da ihtilafa düşmüşlerdir. İbnü'l-Müneyyir şöyle der: Kelale ayetine dayanarak kız. kardeşlerin asabe olacakları sonucunu çıkarmak son derece hoştur. Feraiz ayetlerinde yerleşen usul şöyledir: Kız kardeşler hakkında zikri geçen şart, mirasçı olup olmadıkları ile ilgili değil, onların alacakları hissenin miktarı ile ilgilidir. Buradan anlaşılan şudur: Miras miktarının değişmesi için şart bulunmadığı takdirde bu sözkonusu usuldendir. Ana-babanın miras paylarını düzenleyen ayette mirasın miktarı değişirken, mirasçı olmak durumu değişmemektedir. Aynı durum koca ve karı için de geçerlidir .. Buna kıyas ederek kız kardeş hakkında şöyle bir kural çıkarılabilir: Ölenin çocuğu olmadığı takdirde kız kardeş mirasın yarısını alır. çocuğu olduğu takdirde miktarı değişir ama mirasçı olma durumu değişmez. Bu konuda asabe olmaktan başka değişikliğin sözkonusu olan bir başka miktar yoktur. Bundan kız kardeşin ölen kişinin oğluyla birlikte bulunması durumunda mirastan payalacağı sonucu çıkarılmamalıdır. Çünkü o bilginlerin İcmaı ile istisnadır. Dolayısıyla onun dış ındakiler aslı üzere kalırlar. Doğruyu en iyi Allahu Teala bilir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 21
      },
      "narrator": {
        "en": "Al-Bara"
      }
    },
    {
      "hadithNumber": 6745,
      "arabicNumber": 6745,
      "book": 85,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ، فَمَنْ مَاتَ وَتَرَكَ مَالاً فَمَالُهُ لِمَوَالِي الْعَصَبَةِ، وَمَنْ تَرَكَ كَلاًّ أَوْ ضَيَاعًا، فَأَنَا وَلِيُّهُ فَلأُدْعَى لَهُ ‏\"‏‏.‏ لكل: العيال",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"I am more closer to the believers than their ownselves, so whoever (among them) dies leaving some inheritance, his inheritance will be given to his 'Asaba, and whoever dies leaving a debt or dependants or destitute children, then I am their supporter",
          "ur": "ہم سے محمود نے بیان کیا، انہوں نے کہا ہم کو اسرائیل نے خبر دی، انہیں ابوحصین نے، انہیں ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”میں مسلمانوں کا خود ان کی ذات سے بھی زیادہ ولی ہوں۔ پس جو شخص مر جائے اور مال چھوڑ جائے تو وہ اس کے وارثوں کا حق ہے اور جس نے بیوی بچے چھوڑے ہوں یا قرض ہو، تو میں ان کا ولی ہوں، ان کے لیے مجھ سے مانگا جائے۔“",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Je suis plus proche des croyants qu’eux-mêmes. Donc, si l’un d’eux meurt en laissant un héritage, cet héritage reviendra à ses ‘Asaba. Et si quelqu’un meurt en laissant des dettes, des personnes à charge ou des enfants démunis, alors je serai leur soutien. »",
          "id": "Telah menceritakan kepada kami [Mahmud] telah mengabarkan kepada kami [Ubaidullah] dari [Israil] dari [Abu Hushain] dari [Abu Shalih] dari [Abu Hurairah] radliallahu 'anhu mengatakan; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Saya lebih berhak menanggung urusan orang-orang mukmin daripada mereka sendiri, maka siapa mati dan meninggalkanharta maka hartanya untuk ahliwarisnya yang ashabah, dan barangsiapa meninggalkan hutang atau anak yang terlantar, saya walinya, maka hendaknya memanggil saya untuk menanggung hutangnya dan anak-anaknya",
          "tr": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben mu'minlere kendi öz nefislerinden daha yakınımdır. Her kim ölür de arkasında bir mal bırakırsa, malı mirasçılarına, asabesine aittir. Her kim de arkasında borç veya kendi ihtiyaçlarını göremeyen aciz kimseler bırakırsa ben onun velisiyim. Ben o kimse için çağrıImm"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 22
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6746,
      "arabicNumber": 6746,
      "book": 85,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ رَوْحٍ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا تَرَكَتِ الْفَرَائِضُ فَلأَوْلَى رَجُلٍ ذَكَرٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to those who are entitled to receive it; and whatever is left should be given to the closest male relative of the deceased",
          "ur": "ہم سے امیہ بن بسطام نے بیان کیا، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا، ان سے روح نے بیان کیا، ان سے عبداللہ بن طاؤس نے، ان سے ان کے والد نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میراث اس کے وارثوں تک پہنچا دو اور جو کچھ اس میں سے بچ رہے وہ قریبی عزیز مرد کا حق ہے۔“",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a dit : « Donnez les parts d’héritage prescrites dans le Coran à ceux qui y ont droit ; et ce qui reste doit être donné au parent masculin le plus proche du défunt. »",
          "id": "Telah menceritakan kepada kami [Umayyah bin Bistham] telah menceritakan kepada kami [Yazid bin Zurai'] dari [Rauh] dari [Abdullah bin Thawus] dari [ayahnya] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berikanlah bagian fara`idh (warisan yang telah ditetapkan) kepada yang berhak, maka bagian yang tersisa bagi pewaris lelaki yang paling dekat (nasabnya)",
          "tr": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Miras paylarını sahiplerine veriniz. Bu paylardan geri kalan herhangi bir şey de baba tarafından en yakın olan erkek kişiye aittir.\" Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı başlığı şu şekilde açıklamak mümkündür: Bir adam bir kadınla evlenir. Kadın ondan bir erkek çocuk dünyaya getirir. Sonra aynı adam, başka bir kadınla evlenir. O kadın da bundan bir erkek çocuk doğurur. Sonra adam ikinci kadından ayrılır. O ikinci kadınla bu kişinin erkek kardeşi evlenir. Kadın ondan da bir kız doğurur. Bu kız, ikinci oğlanın ana bir kız kardeşi ve amcasının kızıdır. Sonra bu kız da amcaoğlu olan birinci oğlanla evlenir. Sonra bu kadın ölür, geriye birisi ana bir erkek kardeş, diğeri de kocası olan iki amcaoğlu bırakmış olur. Hz. Ali'nin yaptığı taksime göre koca mirasın yarısını alır. Ana bir erkek kardeş altıda birini alırken, geriye kalan aralarında ortaklaşa bölünür. Kısacası erkeğe kadının kocası olduğu için mirasın yarısı verilirken, diğerine ana bir erkek kardeşi olduğu için altıda biri verilir. Geriye mirasın üçte biri kalır. Bu da asabe olma hasebiyle aralarında böıüştürüıür. Böylece koca mirastan kocalık hissesi ve asabe olması hasebiyle üçte ikisini alırken, diğeri miras hissesi ve asabe olarak üçte birini alır. İbn Battal şöyle demiştir: Zeyd b. Sabit ve çoğunluğu oluşturan fıkıh bilginleri bu konuda Hz. Ali'ye katılmışlardır. Hz. Ömer ve İbn Abbas ise şöyle demişlerdir: Kocanın hissesinden arta kalan malın tamamı, iki akrabalığı kendisinde bulundurana verilir. O kişi altıda birini normal hissesi olarak alırken, kalan üçte birini asabe olarak alır. Hasan-ı Basrı, Ubey, Sevr, Zahirilerin görüşü bu doğrultudadır. Bu görüşü savunanlar birisi ana baba bir, diğeri baba bir olan iki erkek kardeş hakkında var olan icmaı delil .olarak göstermişlerdir. İcmaa göre bu durumda ana baba bir erkek kardeş annesi hasebiyle daha yakın olduğu için malın tamamını alır. Çoğunluğu oluşturanların delilleri ise Buharl'nin Ebu Hureyre hadisinde işaret ettiği husustur. \"Her kim ölür de arkasında bir mal bırakırsa onun malı mirasçılarına, asabesine aittir\" hadisinde \"mevali'l-asabe\" amcaoğullarıdır. Hadiste Nebi Sallallahu Aleyhi ve Sellem amcaoğullarını eşit tutmuş, birini diğerine üstün tutmamıştır. \"Ben o kimse için çağrı lı rı m \" cümlesini İbn Battal şöyle açıklamıştır: Borcunu ödemek ve geride bıraktığı ihtiyaçlarını göremeyen acizlerin ihtiyaçlarını gidermek için beni çağırın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 23
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6747,
      "arabicNumber": 6747,
      "book": 85,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ إِدْرِيسُ، حَدَّثَنَا طَلْحَةُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏وَلِكُلٍّ جَعَلْنَا مَوَالِيَ‏}‏ ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏ قَالَ كَانَ الْمُهَاجِرُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَرِثُ الأَنْصَارِيُّ الْمُهَاجِرِيَّ دُونَ ذَوِي رَحِمِهِ لِلأُخُوَّةِ الَّتِي آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمْ فَلَمَّا نَزَلَتْ ‏{‏جَعَلْنَا مَوَالِيَ‏}‏ قَالَ نَسَخَتْهَا ‏{‏وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ‏}‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:Regarding the Holy Verse:--'And to everyone, We have appointed heirs..' And:-- (4.33) 'To those also to Whom your right hands have pledged.' (4.33) When the emigrants came to Medina, the Ansar used to be the heir of the emigrants (and vice versa) instead of their own kindred by blood (Dhawl-l-arham), and that was because of the bond of brotherhood which the Prophet (ﷺ) had established between them, i.e. the Ansar and the emigrants. But when the Divine Verse:-- 'And to everyone We have appointed heirs,' (4.33) was revealed, it cancelled the other, order i.e. 'To those also, to whom Your right hands have pledged",
          "ur": "مجھ سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے کہا کہ میں نے ابواسامہ سے پوچھا کیا آپ سے ادریس نے بیان کیا تھا، ان سے طلحہ نے بیان کیا، ان سے سعید بن جبیر نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے «ولكل جعلنا موالي‏» اور «والذين عقدت أيمانكم‏» کے متعلق بتلایا کہ مہاجرین جب مدینہ آئے تو ذوی الارحام کے علاوہ انصار و مہاجرین بھی ایک دوسرے کی وراثت پاتے تھے۔ اس بھائی چارگی کی وجہ سے جو نبی کریم صلی اللہ علیہ وسلم نے ان کے درمیان کرائی تھی، پھر جب آیت «جعلنا موالي‏» نازل ہوئی تو فرمایا کہ اس نے «والذين عقدت أيمانكم‏» کو منسوخ کر دیا۔",
          "fr": "Rapporté par Ibn `Abbas : À propos du verset sacré : « À chacun, Nous avons désigné des héritiers… » et : « À ceux aussi à qui vos mains droites se sont engagées. » (4.33) Quand les émigrants sont arrivés à Médine, les Ansar héritaient des émigrants (et inversement) à la place de leurs propres proches par le sang, à cause du lien de fraternité que le Prophète (ﷺ) avait établi entre eux, c’est-à-dire entre les Ansar et les émigrants. Mais lorsque le verset divin : « À chacun, Nous avons désigné des héritiers » (4.33) a été révélé, il a annulé l’autre règle, c’est-à-dire : « À ceux aussi à qui vos mains droites se sont engagées. »",
          "id": "telah menceritakan kepadaku [Ishaq bin Ibrahim] mengatakan, aku berkata kepada [Abu Usamah], telah menceritakan kepadamu [Idris], telah menceritakan kepada kami [Thalhah] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas], mengenai ayat: \"WALIKULLIN JA'ALNAA MAWAALIYA (bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, Kami jadikan pewaris-pewarisnya\" (QS. ANnisa'; 33) \"WALLADZIINA 'AAQADAT AIMAANAKUM (Dan jika ada orang-orang yang kamu telah bersumpah setia dengan mereka, maka berilah kepada mereka bagiannya\" (QS. ANnisa; 33) dia berkata; 'Dahulu orang-orang muhajirin ketika datang ke Madinah, orang anshar mewarisi orang muhajirin yang bukan kerabatnya, dengan pertimbangan ukhuwah yang dibangun oleh Nabi shallallahu 'alaihi wasallam diantara mereka, maka tatkala turun ayat: \"WALIKULLIN JA'ALNAA MAWAALIYA (bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, Kami jadikan pewaris-pewarisnya\" (QS. Annisa'; 33), Allah menghapusnya dengan ayat: \"WALLADZIINA 'AAQADAT AIMAANAKUM (Dan jika ada orang-orang yang kamu telah bersumpah setia dengan mereka\" (QS. ANnisa;)",
          "tr": "İbn Abbas \"(Erkek ve kadından) her biri için, ana, baba ve akrabanın bıraktığından (hisselerini alacak olan) varisler kıldık. \"(Nisa 33) ayetini okumuş ve şöyle demiştir: Muhacirler Medine'ye geldikleri zaman Ensara -Nebi Sallallahu Aleyhi ve Sellem'in aralarında kurmuş olduğu kardeşlik sebebiyle- kendi hısımları değil, bunlar mirasçı olurlardı. Nihayet \"(Erkek ve kadından) her biri için, ana, baba ve akrabanın bıraktığından (hisselerini alacak olan) varisler kıldık\" ayeti,devamındaki \"yeminlerinizin bağladığı kimselere de paylarını verin\" ayetini nesh etmiştir. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlığı atmaktaki geyesi, zevi'l-erham'ın mirastan pay alıp, alamayacaklarını açıklamaktır. Zevi'l-erham on sınıf olup şunlardır: Dayı, teyze, ananın babası, kızın oğlu, kız kardeş oğlu, erkek kardeşin kızı, amca kızı, hala, ana bir amca, ana bir erkek kardeşin oğlu ve ölene bu bunlardan herhangi biriyle bağlanan kimse. Zevi'l-erham'ın mirastan payalacağını söyleyen bilginler, bunların içerisinde en öncelikli olanın kızın oğuııarı, sonra kız kardeş oğuııarı, sonra erkek kardeş kızları, sonra sırasıyla amca, hala, dayı ve teyze olduklarını söylemişlerdir. Zevi'l-erham'dan iki kişi birbiriyle eşit olduğunda ashab-ı feraiz veya asabeye daha yakın olana öncelik verilir. Burada hadise yer verilmesinin sebebi \"(Erkek ve kadından her biri için, ana, baba ve akrabanın bıraktığından (hisselerini alacak olan) varis kıldık\" ayetinin \"yeminlerinizin bağladığı kimselere de paylarını verin\" ifadesini nesh etmiş olduğunu vurgulamaktır. İbn Battal şöyle demiştir: Müfessirlerin çoğunluğuna göre \"(Erkek ve kadından) her biri için ... \" ayetini nesh eden, Enfal suresindeki \"Allah'ın kitabına göre yakın akrabalar birbirlerine (varis olmağa) daha uygundur\"(Enfal 75) ayet-i kerimesidiL Ebu Ubeyd, enNasih ve'l-Mensuh'ta bunu kesin bir dille ifade etmektedir. Biz de şunu ekleyelim: Ebu Davud hasen bir isnadla İbn Abbas'tan bu hadisi rivayet etmitir. İbn Battal şöyle demiştir: Fıkıh bilginleri zevi'!-erham'ın mirastan payalıp, almayacağı noktasında farklı görüşler ortaya koymuşlardır. Zevi'l-erham ayette kendilerine hisse takdir edilmemiş ve asabe de olmayan kimselerdir. Hicaz ve Şam bilginleri, onların mirastan pay alamayacakları kanaatine varmışlardır. KCıfe fıkıh bilginleriyle Ahmed b. Hanbel ve İshak ise, miras alacakları hükmünü benimsemiştir. Bunlar, görüşlerini \"Allah 'ın kitabına göre yakın akrabalar birbirlerine (varis olmağa) daha uygundur\" ayetine dayandırmışlardır. Diğerleri ise şöyle demişlerdir: Bu.ndan maksat, Allah'ın kitabında kendilerine herhangi bir hisse ayrılan kimselerdir. Çünkü Enfal ayeti mücmeldir. Miras ayeti ise onu tefsir etmektedir. Bu bilginlerin hadisten delilleri ise \"Her kim ölür de arkasında bir mal bırakırsa, o asabesine aittir.\" Bu bilginler ifadeyi zahiri üzere bırakma noktasında görüş birliği etmişler ve azad edilen kölenin öldüğünde geride bıraktığı malın mevlalarına (onu azad edenlere) değil, asabelerine miras kalacağını, asabeleri olmadığı takdirde zevi'l-erhamına• değil, mevlalarına intikal edeceğini ifade etmişlerdir ve zevi'l-erham'ın mirastan payalıp almayacağı noktasında ihtilaf etmişlerdir. Ebu Ubeyd şöyle demiştir: Irak bilginlerine göre ashab-ı feraiz hissesini aldıktan sonra ölenin asabesi olmadığı takdirde kalan miras ashab-ı feraize reddedilir. Asabe olduğu takdirde ise hem ashab-ı feraize ve h.em de asabeye red yapılır. Bunlarolmadığı takdirde miras zevi'l-erhama verilir. ıbn Mesud zevi'l-erhamdan her birini, ölüye kimin vasıtası ile mirasçı oluyorsa onun yerine ko'yardı. Sahih bir isnadla nakledilen bir habere göre İbn Mesud halayı baba, teyzeyi anne gibi kabul eder ve mirası aralarında ikili birli taksim ederdi. Hz. Ali'nin anne dururken kıza mirası reddetmediği nakledilir. Bu grup bilginlerin delillerinden birisi de \"Dayı varisi olmayanın varisidir\"(Tirmizi, Feraiz) hadisidir. Bu hadis hasen olup, Tirmizi ve başkaları tarafından nakledilmiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 24
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 6748,
      "arabicNumber": 6748,
      "book": 85,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم وَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:A man and his wife had a case of Lian (or Mula'ana) during the lifetime of the Prophet (ﷺ) and the man denied the paternity of her child. The Prophet (ﷺ) gave his verdict for their separation (divorce) and then the child was regarded as belonging to the wife only",
          "ur": "مجھ سے یحییٰ بن قزعہ نے بیان کیا، کہا ہم سے مالک نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ ایک شخص نے اپنی بیوی سے نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں لعان کیا اور اس کے بچہ کو اپنا بچہ ماننے سے انکار کر دیا تو نبی کریم صلی اللہ علیہ وسلم نے دونوں کے درمیان جدائی کرا دی اور بچہ عورت کو دے دیا۔",
          "fr": "Rapporté par Ibn `Umar : Un homme et sa femme ont eu un cas de Lian (ou Mula'ana) du vivant du Prophète (ﷺ), et l’homme a nié la paternité de l’enfant. Le Prophète (ﷺ) a décidé leur séparation (divorce), et l’enfant a alors été considéré comme appartenant uniquement à la femme",
          "id": "Telah menceritakan kepadaku [Yahya bin Qoza'ah] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu 'Umar] radliallahu 'anhuma; ada seorang lelaki meli'an isterinya di zaman Rasulullah Shallallahu'alaihiwasallam dan tidak mengakui anaknya, maka Nabi Shallallahu'alaihiwasallam memisah keduanya dan memasrahkan anak kepada si wanita (ibu bayi)",
          "tr": "İbn Ömer r.a.'in nakline göre adamın biri Nebi Sallallahu Aleyhi ve Sellem'in zamanında hanımıyla mülaane yaptı ve kadının çocuğunu (n kendinden olduğunu) kabul etmedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem aralarını ayırdı, boşanmalarına hükmetti, çocuğa da kadının nesebini verdi. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlığı kullanmaktan maksadı kadının kocasıyla mülaanesine konu olan çocuğa mirasçı olup olmayacağıdır. İmam Buhari burada İbn Ömer' in mülaane konusundaki muhtasar hadisine yer vermiştir. Bu hadisin açıklaması lian bölümünde daha önce geçmişti. Burada hadise yer verilmesinin amacı \"çocuğa da kadının nesebini verdi\" cümlesidir. Selef bilginleri bir kimsenin nesebini kabul etmediği çocukla arasında miras cereyan etmeyeceği noktasında ittifak etmekle birlikte, onun nesebinin annesine verilmesinin ne anlama geldiği meselesinde ihtilaf etmişlerdir. Hz. Ali ve İbn Mesud kocasıyla mülaane yapmış kadının oğlu hakkında şöyle demişlerdir: \"Bu çocuğun asabesi annesinin asabesidir.Çocuk onlara, onlar da çocuğa mirasçı olurlar.\" Bu haberi İbn Ebi Şeybe rivayet etmiştir. İbrahim en-Nehaı ve Şa'bl'nin görüşü de bu doğrultudadır. Hz. Ali ve İbn Mesud'un sadece çocuğun annesini asabe kabul ettikleri ve malın tamamının ona verileceğini söyledikleri, naklediimiştir. Anne, çocuktan önce öldüğü takdirde çocuğun malı annenin asabesine aittir. Aralarında Hasan-ı Basrl, İbn Sırın, Mekhul, Sevrı, -bir rivayete göre- Ahmed b. Hanbel'in de bulunduğu bir topluluk bu doğrultuda hüküm vermişlerdir. Hz. Ali'den nakledilen bir rivayete göre mülaane yapmış olan kadın çocuğuna mirasçı olur. Anneden olan erkek kardeşleri de anneye mirasçı olur. Mirastan herhangi bir şeyarttığında o kısım da beytü'l-male intikal eder. Zeyd b. Sabit, bilginlerin çoğunluğu ve belli başlı büyük şehirlerdeki fıkıh bilginlerinin (fukahu'l-emsar) ekseriyeti bu görüştedir. İmam Malik şöyle demiştir: Ben ilim ehli bilginleri bu yaklaşımı benimser gördüm. Şa'bl'nin şöyle dediği naklediImiştir: KufeIiler, Hz. Osman zamanında Hicaz' a birisini göndererek mülaane yapmış kadının' oğlunun miras hükmünü sordular. Hicazlılar onlara çocuğun mirasının annesine ve annesinin asabesine kalacağını haber verdiler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 25
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 6749,
      "arabicNumber": 6749,
      "book": 85,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ عُتْبَةُ عَهِدَ إِلَى أَخِيهِ سَعْدٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي، فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامَ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:`Utba (bin Abi Waqqas) said to his brother Sa`d, \"The son of the slave girl of Zam`a is my son, so be his custodian.\" So when it was the year of the Conquest of Mecca, Sa`d took that child and said, \"He is my nephew, and my brother told me to be his custodian.\" On that, 'Abu bin Zam`a got up and said, 'but the child is my brother, and the son of my father's slave girl as he was born on his bed.\" So they both went to the Prophet. Sa`d said, \"O Allah's Messenger (ﷺ)! (This is) the son of my brother and he told me to be his custodian.\" Then 'Abu bin Zam`a said, \"(But he is) my brother and the son of the slave girl of my father, born on his bed.\" The Prophet (ﷺ) said, \"This child is for you. O 'Abu bin Zam`a, as the child is for the owner of the bed, and the adulterer receives the stones.\" He then ordered (his wife) Sauda bint Zam`a to cover herself before that boy as he noticed the boy's resemblance to `Utba. Since then the boy had never seen Sauda till he died",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ابن شہاب نے، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ عتبہ اپنے بھائی سعد رضی اللہ عنہ کو وصیت کر گیا تھا کہ زمعہ کی کنیز کا لڑکا میرا ہے اور اسے اپنی پرورش میں لے لینا۔ فتح مکہ کے سال سعد رضی اللہ عنہ نے اسے لینا چاہا اور کہا کہ میرے بھائی کا لڑکا ہے اور اس نے مجھے اس کے بارے میں وصیت کی تھی۔ اس پر عبد بن زمعہ رضی اللہ عنہ کھڑے ہوئے اور کہا کہ یہ میرا بھائی ہے اور میرے باپ کی لونڈی کا لڑکا ہے، اس کے بستر پر پیدا ہوا ہے۔ آخر یہ دونوں یہ معاملہ رسول اللہ صلی اللہ علیہ وسلم کے پاس لے گئے تو سعد رضی اللہ عنہ نے کہا: یا رسول اللہ!، یہ میرے بھائی کا لڑکا ہے اس نے اس کے بارے میں مجھے وصیت کی تھی۔ عبد بن زمعہ نے کہا کہ یہ میرا بھائی ہے، میرے باپ کی باندی کا لڑکا اور باپ کے بستر پر پیدا ہوا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، عبد بن زمعہ! یہ تمہارے پاس رہے گا، لڑکا بستر کا حق ہے اور زانی کے حصہ میں پتھر ہیں۔ پھر سودہ بنت زمعہ رضی اللہ عنہا سے کہا کہ اس لڑکے سے پردہ کیا کر کیونکہ عتبہ کے ساتھ اس کی شباہت آپ صلی اللہ علیہ وسلم نے دیکھ لی تھی۔ چنانچہ پھر اس لڑکے نے ام المؤمنین کو اپنی وفات تک نہیں دیکھا۔",
          "fr": "Rapporté par `Aisha : `Utba (bin Abi Waqqas) a dit à son frère Sa`d : « Le fils de l’esclave de Zam`a est mon fils, alors prends soin de lui. » Lors de la conquête de La Mecque, Sa`d a pris cet enfant et a dit : « C’est mon neveu, et mon frère m’a demandé d’être son tuteur. » À ce moment-là, 'Abu bin Zam`a s’est levé et a dit : « Mais cet enfant est mon frère, le fils de l’esclave de mon père, car il est né sur le lit de mon père. » Ils sont donc allés voir le Prophète (ﷺ). Sa`d a dit : « Ô Messager d’Allah (ﷺ) ! C’est le fils de mon frère, et il m’a demandé d’être son tuteur. » Ensuite, 'Abu bin Zam`a a dit : « Mais il est mon frère et le fils de l’esclave de mon père, né sur son lit. » Le Prophète (ﷺ) a dit : « Cet enfant est pour toi, ô 'Abu bin Zam`a, car l’enfant appartient au propriétaire du lit, et l’adultère n’a que les pierres. » Il a ensuite ordonné à (sa femme) Sauda bint Zam`a de se couvrir devant ce garçon, car il avait remarqué sa ressemblance avec `Utba. Depuis ce jour, le garçon n’a plus jamais vu Sauda jusqu’à sa mort",
          "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Urwah] dari [Aisyah] radliallahu 'anha mengatakan; 'Utbah berpesan kepada saudaranya Sa'd, bahwa 'putra dari hamba sahaya Zam'ah adalah dariku, maka ambilah dia.' Di hari penaklukan Makkah, Sa'd mengambilnya dengan mengatakan; 'Ini adalah putra saudaraku, ia berpesan kepadaku tentangnya.' Maka berdirilah Abd bin Zam'ah seraya mengatakan; '(dia) saudaraku, dan putra dari hamba sahaya ayahku, dilahirkan diatas ranjangnya.' Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Dia bagimu wahai Abd bin Zam'ah, anak bagi pemilik ranjang dan bagi pezinah adalah batu (rajam).\" Kemudian Nabi bersabda kepada Saudah binti Zam'ah: \"hendaklah engkau berhijab darinya, \" beliau melihat kemiripannya dengan 'Utbah, sehingga anak laki-laki itu tak pernah lagi melihat Saudah hingga ia meninggal",
          "tr": "Aişe r.anha şöyle demiştir: Utbe b. Ebi Vakkas, kardeşi Sa'd b. Ebi Vakkas'a \"Zem'an'ın cariyesinin oğlu Abdurrahman bendendir. Bu çocuğu almalısın\" diye vasiyet etmişti. Mekke'nin fethi yılı olunca Sa'd b. Ebi Vakkas çocuğu yakaladı ve \"Bu kardeşim Utbe'nin oğludur. Bunun nesebinin kendisine verilmesini bana vasiyet etmiştir\" dedi. Bunun üzerine Abd b. Zem'a ayaklanıp \"Bu, benim kardeşimdir; babamın cariyesinin oğludur. Babamın yatağında doğmuştur\" dedi. Her iki taraf anlaşmazlığı çözmek üzere Nebi Sallallahu Aleyhi ve Sellem'e gittiler. Sa'd b. EbiVakkas \"Ya Resulallah! Bu çocuk, kardeşim Utbe'nin oğuludur. Nesebinin kendisine verilmesine dair bana vasiyeti vardır\" dedi. Abd b. Zem'a da \"Bu, benim kardeşimdir ve babamın cariyesi doğurmuştur; babamın yatağında dünyaya gelmiştir\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Ey Abd b.Zem'a! Çocuk sana aittir. Çünkü çocuk kimin yatağında dünyaya ge/mişse onundur. Zina eden için de mahrumiyet vardır\" buyurdu. Hz. Nebi saııallahu aleyhi ve sellem (çocuğun sima itibariyle Utbe'ye benzediğini görerek) eşi Sevde binti Zem'a'ya dönerek \"Ey Sevde! Bundan sonra Abdurrahman'ın karşısında tesettürde bu/un\" buyurdu. Bundan sonra Abdurrahman, Sevde vefat edip, Allahu Teala'ya kavuşuncaya kadar bir daha onu görmedi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 26
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 6750,
      "arabicNumber": 6750,
      "book": 85,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْوَلَدُ لِصَاحِبِ الْفِرَاشِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"The boy is for the owner of the bed",
          "ur": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے، ان سے شعبہ نے بیان کیا، ان سے محمد بن زیاد نے بیان کیا، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”لڑکا بستر والے کا حق ہوتا ہے۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « L’enfant appartient au propriétaire du lit. »",
          "id": "Telah menceritakan kepada kami [Musaddad] dari [Yahya] dari [Syu'bah] dari [Muhamad bin Ziyad] bahwasanya ia mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Anak adalah bagi pemilik ranjang",
          "tr": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Çocuk kimin yatağında dünyaya ge/mişse onundur\" buyurmuştur. Fethu'l-Bari Açıklaması: Hattabi ve ona uyarak lyaz, Kurtubi ve başka bilginler şöyle demişlerdir: Cahiliye dönemi insanları cariye alırlar ve onları her gün kendilerine belli bir bedeli ödemekle yükümlü tutarlardı. Bundan dolayı cariyeler fuhuş yoluyla para kazanırlardı. Cahiliye dönemi insanları -nikah bölümünde değindiğimiz üzerezina eden kimseler, çocuğun nesebinin kendilerine ait olduğunu iddia ettikleri takdirde o nesebi iddia edene verirlerdi. Yukarıdaki hadiste adı geçen Zem'an'ın bir cariyesi vardı. Zem'a arasıra bunun yanına gelip gidiyordu. Derken hamile olduğu anlaşıldı. Utbe b. Ebi Vakkas çocuğun kendinden olduğunu iddia ederek kardeşi Sa'd'a onun nesebinin kendisine verilmesini vasiyet etti. Sa'd b. Ebi Vakkas bu çocuk hakkında Abd b. Zem'a ile anlaşmazlığa düştü. Sa'd, Abd'e \"Cahiliye döneminde geçerli kurallaragöre o çocuk kardeşimin oğludur\" dedi. Abd ise \"İslam' da yerleşik kaideye göre o benim kardeşimdir\" cevabını verdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem cahiliye hükmünü ortadan kaldırıp, çocuğun Zem'a'ya ait olduğu hükmünü verdi. lyaz, Hattabl'nin \"çocuğun nesebinin kendilerine ait olduğunu iddia ettikleri takdirde\" cümlesini \"anne bunu itiraf ettiğinde\" şeklinde değiştirmiştir. Kurtubi ise görüşünü her iki yaklaşıma dayandırarak şöyle demiştir: çocuğun nesebi cahiliye döneminde Utbe'ye verilmemişti. Bu ya Utbe'nin çocuğun nesebinin keı;ı.dine ait olduğunu iddia etmediğinden ya da annenin çocuğun Utbe'ye ait olduğunu kabul etmemesinden kaynaklanıyordu. Biz de şunu belirtelim: Nikah bölümünde Hz. Aişe radıyallilhu anhil'dan naklen bir hadis yer almıştı. O hadis cahiliye insanlarının bir olayda annenin babaya nesep vermesini kabul ettiklerini teyid ederken, bir başka olayda kaiflerin nesep verdiklerini gösteriyordu. Sözkonusu rivayet \"Cahiliye döneminde nikah dört çeşitti\" şeklinde başlırdu. Bu hadiste konumuzia ilgili olarak şu ifadeler yer almaktaydı: \"Sayıları onu bulmayan bir topluluk bir araya gelir ve kadının yanına girerek her biri onunla ilişkide bulunurdu. Kadın hamile kalıp, çocuğunu doğurduğunda ve birkaç gece geçtiğinde onlara haber gönderirdi ve erkeklerin tümü kadının yanında bir araya gelirlerdi. Kadın 'çocuğu dünyaya getirdim ey filanca o senin oğlundur' der ve kadının çocuğunun nesebi o erkeğe verilirdi. Erkek bunu reddedemezdi.\" Aynı rivayette şu ifadeler de yer almaktadır: \"Nikah çeşitlerinden birisi de facir ve fahişelerin nikahı idi. Bu tip kadınlar kapıları üzerine bir bez asarlardı. Onları arzulayan erkekler odalarına girerdi. Bu kadınlardan herhangi biri hamile kalıp çocuğunu doğurduğunda kaif1er oraya toplanır, sonra kadının çocuğunun nesebini kaifin uygun gördüğü bir erkeğe verirlerdi. Erkek bunu reddedemezdi.\" Zem'a'nın cariyesi olayına uygun düşen bu son rivayettir. Yukarıda anlatılan kıssadan çocuğa neseb verilmesinin sadece babaya mahsus olmadığı, tam tersine erkek kardeşin baba adına nesep kabul edebileceği sonucu çıkarılmıştır. Şafiilerin ve bir grup fıkıh bilgininin görüşü bu doğrultudadır. Ançak erkek kardeşin mirastan payalıyor olması veya diğer vereselerin bunu kabul etmeleri, çocuğun adı geçen erkekten dünyaya gelmesinin imkan dahilinde olması, çocuğun akıl (akıl sağlığı yerinde) ve ergenlik çağına gelmişse bunu kabul etmesi ve çocuğun babasının bilinmemesi şarttır. Ancak bu görüş, Zem'a'nın Abd'dan başka da mirasçısı olduğu ileri sürülerek tenkit edilmiştir. Bu itiraza Zem'a'nın, Sevde hariç oğlu Abd'dan başka varisi yoktu şeklinde cevap verilmiştir. Zem'a kafir olarak ölseydi kendisine Abd'dan başkası var is olamazdı. Onun Müslüman olması takdirinde ise kendisine kızı Sevde varis olacaktı. Sevde'nin bu konuda erkek kardeşini ve kil etmiş olması veya onun da çocuğu kabul etmiş bulunması ihtimali vardır. İmam Malik ve bir grup fıkıh bilgini nesep kabul etmenin sadece babaya aitolduğu görüşünü benimsemişler ve nesep vermenin sadece Abd b. Zem'a'nın nesebinin verilmesiyle sınırlı olmadığı şeklinde cevap vermişlerdir. Çünkü Nebi Sallallahu Aleyhi ve Sellem'in buna -Zem'a'nın o kadınla ilişkiye girdiğini itiraf etmesi gibi- herhangi bir şekilde muttali olmuş bulunma ihtimali vardır. Nebi Sallallahu Aleyhi ve Sellem çocuğun dünyaya geldiği yatağın sahibine ait olduğu hükmünü vermiştir. Çünkü o \"Çocuk sana aittir\" dedikten sonra \"Çocuk kimin döşeğinde dünyaya gelmişse onundur\" buyurmuştur. Zira dinimiz bu çocuğun zina eden erkeğe verilmesini yasaklayınca, geriye yatak sahibinden başkası kalmamıştır. Bu görüşe vasinin vasiyet edenin çocuğunun nesebini -bunu kendisine vasiyet ettiği takdirde- onun adına almasının caiz olduğu hükmünü delil olarak göstermişlerdir. Bu durumda kendisine vasiyet edilen kişi, vasiyet denin bu konudaki vekili gibi olur. Eşhas bölümünde bu konuda bir başlık geçmişti. Yine bu hükümden cariyenin ilişki sebebiyle döşek olacağı hükmü çıkarılmıştır. Efendi cariyesiyle ilişkide bulunduğunu itiraf ettiğinde veya bu herhangi bir yolla sabit olduğunda cariye ilişkiden sonra çocuk doğuracak bir sürenin ardından doğum yaptığında -tıpkı nikahlı eşte olduğu gibi- çocuğun nesebinin kendine ait olduğunu kabul etmesine gerek kalmaksızın nesep kendiliğinden babaya ait olur. Fakat eş, sırf nikah akdiyle döşk haline gelir. Dolayısıyla nesebin babaya verilmesi için hamileliğin grektirdiği makul bir sürenin geçmesi hariç başka bir şart aranmaz. Çünkü eş cinsel ilişkide bulunmak için nikahlanılır. Dolayısıyla nikah akdi onunla ilişki gibi kabul edilir. Cariye ise böyle değildir. Çünkü cariye başka amaçlarla da edinilir. Onun açısından cinsel ilişki şarttır. Bundan dolayı iki kız kardeşle ilişki caiz değilken, onları cariye olarak mülkiyette bulundurmak caiz görülmüştür. Çoğunluğu oluşturan fıkıh bilginlerinin görüşü bu doğrultudadır. Hanefilerden bir görüşe göre bir cariye efendisinden çocuk doğurup, nesebi kendisine verilmedikçe doğurduğu çocuk onun yatağında doğmuş kabul edileme? Bundan sonra cariyenin doğurduğu her çocuğun nesebi, baba inkar etmedikçe kendisine aittir. Hanefilerden nakledilen bir görüşe göre bir kimse cariyesi ile ilişkide bulunduğunu itiraf etse ve cariyesi hamile kalıp doğurması mümkün olan bir süre geçtikten sonra çocuk doğursa bu çocuk o kişiye aittir. Cari ye bu kişiden önce çocuk doğursa ve sonra efendi çocuğun nesebini kabul etse Hanbelilerde tercih edilen görüşe göre daha sonraki çocuCıun nesebi yeni bir ikrar olmadıkça babaya verilmez. Birinci görüşün tercih e degr olduğu gayet açıktır. Çünkü Zem'a'nın bu cariyeden başka bir çocuğunun daha olduğu nakledilmemiştir. Bütün fıkıh bilginleri cariyenin ancak ilişkiyle yatak ortağı haline geleceği noktasında görüş birliği etmişlerdir. Hadiste geçen \"tesaveka\" fiili, Sa'd b. Ebi' Vakkas Abd b. Zem'a birlikte Hz. Nebi Sallallahu Aleyhi ve Sellem'e gittiler. Her ikisi de adeta diğerini Efendimiz'e doğru iter gibiydi. İbn Abdilberr şöyle demiştir: Hicaz bilginlerine göre cariyenin efendisi onun yanına girip çıktığını ikrar ettiğinde müstefreşe olur. Irak bilginlerine göre ise efendi cariyeden dünyaya gelen çocuğu kabul ettiğinde cariye müstefreşe haline gelir ve dOğuracağı çocuk müşterek yatakta doğmuş kabul edilir. Mazeri' şöyle demiştir: Bu hadisten erkek kardeşin kardeşi adına nesep kabul edebileceği anlaşılmaktadır. Bu, ölenin o kardeşten başka mirasçısı olmadığı takdirde geçerlidir. Zina edene mahrumiyet vardır demek, onun için kaybetme ve mahrumiyet söz konusudur demektir. Çünkü hadiste geçen \"el-aher\" zina demektir. Burada \"y haybet\" kelimesi kişinin nesebinin kendisine ait olduğunu iddia ettiği çocuktan mahrum olması anlamına gelir. Araplar bu duruma düşen kişiye \"lehu'lhacer\" ve \" fihi']-hacer ve't-turab\" veya buna benzer şeyler söylerlerdi. Bazıları hadiste geçen \"i el-hacer\" kelimesinden maksadın recm edilmek olduğunu söylemişlerdir. Nevevi' şöyle demiştir: Bu yaklaşım zayıftır. Çünkü recm muhsan olan kişilere uygulanır. Sonra bir kimsenin recmedilmesi çocuğun nesebinin ondan alınmasını gerektirmez. Burada hadis çocuğun nesebinin iddia eden kişiden alınması konusunda zikredilmiştir. Hanemer \"Bundan sonra Abdurrahman, Sevde vefat edip Allah'a kavuşuncaya kadar onu görmedi\" cümlesine dayanarak Nebi Sallallahu Aleyhi ve Sellem'in çocuğun nesebini Zem'a'ya vermediği sonucunu çıkarmışlardır. Çünkü eğer çocuğun nesebini Zem'a'ya vermiş olsaydı, çocuk Sevde'nin erkek kardeşi olacaktı. Bir kız kardeşe erkek kardeşinin karşısında tesettürde bulunması emredilmez. Çoğunluğu oluşturan fıkıh bilginleri ise Hanemerin bu yaklaşımına şöyle cevap vermişlerdir: Burada tesettür emri ihtiyattan dolayıdır. Çünkü Nebi Sallallahu Aleyhi ve Sellem -sahih rivayet yollarıyla nakledildiği üzere- \"Ey Abd! O senin kardeşindir\" diyerek onun kardeşi olduğuna hükmetmiştir. Çocuk Abd'ın baba bir kardeşi olduğuna göre Sevde'nin de baba bir kardeşi olmaktadır. Fakat Nebi Sallallahu Aleyhi ve Sellem çocukla Utbe arasındaki apaçık benzerliği görünce Sevde'ye ihtiyaten onun karşısında tesettürde bulunmasını emretmiştir. Hattabi' bu hükmün mu'minlerin annelerine ait bir özellik olduğuna işaret etmiştir. Çünkü onlar bu konuda başka kadınlar gibi değillerdir. Hattabi' şöyle demiştir: Benzerlik bazı yerlerde geçerli kabul edilir, ancak ondan daha güçlü bir emare bulunduğunda benzerliğe dayanılarak hüküm verilmez. Fıkıh bilginleri, kız alma yoluyla meydana gelen haramlık (sıhriyyet) doğurması açısından zina ilişkisinin helal yoldan yapılan ilişki hükmü doğuracağı sonucunu çıkarmışlardır. Çoğunluğun görüşü bu doğrultudadır. Rivayetin bu hükme delaleti şöyle olmaktadır: Nebi Sallallahu Aleyhi ve Sellem çocuğun Sevde'nin erkek kardeşi olduğuna hükmettikten sonra onun zina edene benzerliğinden do.layı eşine tesettürde bulunmasını emretmiştir. Kendisinden nakledilen meşhur rivayete göre İmam Malik ve Şafii şöyle demişlerdir: Zina ilişkisinin herhangi bir hukuki sonucu yoktur. Tam tersine zina eden erkek zina ettiği kadının annesiyle ve başka kocadan olan kızıyla evlenebilir. İmam Şafil bu hükme şöyle bir hüküm daha eklemiştir ki İbn Macişun da bu görüşünde kendisine katılmaktadır: Zina eden erkek, zina ettiği kadının doğurduğu kızla -kadın bu kızın o erkekten olduğunu bilse bile- evlenebilir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 27
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6751,
      "arabicNumber": 6751,
      "book": 85,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُهْدِيَ لَهَا شَاةٌ فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏ قَالَ الْحَكَمُ وَكَانَ زَوْجُهَا حُرًّا، وَقَوْلُ الْحَكَمِ مُرْسَلٌ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏",
        "translations": {
          "en": "Narrated `Aisha:I bought Barira (a female slave). The Prophet (ﷺ) said (to me), \"Buy her as the Wala' is for the manumitted.\" Once she was given a sheep (in charity). The Prophet (ﷺ) said, \"It (the sheep) is a charitable gift for her (Barira) and a gift for us.\" Al-Hakam said, \"Barira's husband was a free man.\" Ibn `Abbas said, 'When I saw him, he was a slave",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے حکم نے، ان سے ابراہیم نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے بریرہ رضی اللہ عنہ کو خریدنا چاہا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں خرید لے، ولاء تو اس کے ساتھ قائم ہوتی ہے جو آزاد کر دے اور بریرہ رضی اللہ عنہ کو ایک بکری ملی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ ان کے لیے صدقہ تھی لیکن ہمارے لیے ہدیہ ہے۔ حکم نے بیان کیا کہ ان کے شوہر آزاد تھے۔ حکم کا قول مرسل منقول ہے۔ ابن عباس رضی اللہ عنہما نے کہا کہ میں نے انہیں غلام دیکھا تھا۔",
          "fr": "Rapporté par `Aisha : J’ai acheté Barira (une esclave). Le Prophète (ﷺ) m’a dit : « Achète-la, car le Wala’ revient à celui qui affranchit. » Un jour, on lui a donné un mouton en aumône. Le Prophète (ﷺ) a dit : « Ce mouton est une aumône pour elle (Barira) et un cadeau pour nous. » Al-Hakam a dit : « Le mari de Barira était un homme libre. » Ibn `Abbas a dit : « Quand je l’ai vu, il était esclave. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] mengatakan; aku membeli Barirah, Nabi shallallahu 'alaihi wasallam bersabda: \"belilah ia, dan wala` milik orang yang memerdekakannya.\" kemudian Barirah diberi hadiah seekor kambing, dan Nabi bersabda: \"Kambing itu baginya sedekah dan bagi kita sebagai hadiah.\" Al Hakam mengatakan; 'Ketika itu suami Barirah orang merdeka.' Ucapan Al Hakam ini mursal, dan Ibnu Abbas mengatakan; 'setahu saya dia budak",
          "tr": "Aişe r.anha şöyle demiştir: Ben Berire'yi satın aldım. Nebi Sallallahu Aleyhi ve Sellem bana \"Berfre'yi satın al. Çünkü vefa hakkı ancak azad edene aittir\" buyurdu. Berire'ye bir koyun hediye edilmişti. Nebi Sallallahu Aleyhi ve Sellem Efendimiz Sallallahu Aleyhi ve Sellem \"O koyun Berfre için sadakadır. Bizim için hediyedir\" buyurdu. el-Hakem \"Berire'nin kocası hür idi\" demiştir. elHakem'in bu sözü mürseldir. İbn Abbas ise \"Ben onu (Berire'nin kocasını) köle olarak gördüm\" demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 28
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 6752,
      "arabicNumber": 6752,
      "book": 85,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:The Prophet (ﷺ) said, \"The Wala' is for the manumitted (of the slave)",
          "ur": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے مالک نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ولاء اسی کے ساتھ قائم ہوتی ہے جو آزاد کر دے۔“",
          "fr": "Rapporté par Ibn `Umar : Le Prophète (ﷺ) a dit : « Le Wala’ revient à celui qui affranchit l’esclave. »",
          "id": "Telah menceritakan kepada kami [Isma'il bin Abdullah] mengatakan; telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Wala' menjadi milik orang yang memerdekakan",
          "tr": "İbn Ömer'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Vela hakkı ancak azad edene aittir\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'nin attığı bu başlık, buluntu çocuğun mirası ile ilgilidir. İmam Buhari böylece çoğunluğu oluşturan fıkıh bilginlerinin görüşünü tercih ettiğine işaret etmektedir. Bu bilginleregöre buluntu çocuk, hürdür ve onun velası beytü'lmala aittir. İmam Buhari bir de İbrahim en-NehaI' den buluntu çocuğun velasının onu bulana ait olduğu şeklinde nakledilen görüşün tercih e değer olduğuna işaret etmektedir. O bu görüşüne Hz•. Ömer'in Ebu Cemile'ye bulduğu çocuk hakkında söylediği \"Git, o hürdür, nafakası bize aittir, velası sana aittir\" şeklindeki ifadesini delilolarak göstermektedir. Bu haber Şehadet bölümünün baş taraflarında tam olarak muallak birşekilde nakledilmişti. Orada bu yaklaşıma cevc:p vermiş ve Hz. Ömer'in \"Velası sana aittir\" şeklindeki ifadesinin manasının, onu yetiştirecek ve bakımını yapacak olan sensin. Bu aza d etme velayeti değil, İslam velayetidir, şeklinde olduğunu belirtmiştik. Bu yaklaşımın delili merfu olarak rivayet edilen \"Vela hakkı ancak azad edene aittir\" hadisinin açık ifadesidir. Bu hadis köleyi azad etmeyenin vela hakkının olmayacağını gerekli kılmaktadır. Çünkü köle azad etmek azaddan önce onun üzerinde mülkiyet olmasını gerektirir. Daru'l-İslam'da bir çocuğu bulan ona malik olamaz. Çünkü insanlarda temel kuralonların özgür olarak dünyaya geldikleridir. Zira yolun kenarına bırakılmış olan çocuğun hür bir kimsenin çocuğu olması ihtimal dışı değildir. Dolayısıyla bu çocuk çalınamaz ya da böyle bir buluntu çocuk bir topluluğun cariyesinin çocuğu olabilir. Dolayısıyla onun mirası o topluluğa aittir. Çocuğun babası bilinmediğine göre o beytü'lmale teslim edilir ve kendisini bulan kimse onun efendisi olamaz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 29
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 6753,
      "arabicNumber": 6753,
      "book": 85,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي قَيْسٍ، عَنْ هُزَيْلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ إِنَّ أَهْلَ الإِسْلاَمِ لا يُسَيِّبُونَ، وَإِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُسَيِّبُونَ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah:The Muslims did not free slaves as Sa'iba, but the People of the Pre-Islamic Period of Ignorance used to do so",
          "ur": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ابوقیس نے، ان سے ہزیل نے انہوں نے عبداللہ سے نقل کیا، انہوں نے فرمایا کہ عبداللہ رضی اللہ عنہ نے فرمایا مسلمان سائبہ نہیں بناتے اور دور جاہلیت میں مشرکین سائبہ بناتے تھے۔",
          "fr": "Rapporté par `Abdullah : Les musulmans n’affranchissaient pas les esclaves en tant que Sa’iba, mais les gens de la période préislamique le faisaient",
          "id": "Telah menceritakan kepada kami [Qabishah bin 'Uqbah] telah menceritakan kepada kami [Sufyan] dari [Abu Qais] dari [Huzail] dari [Abdullah] mengatakan; 'Pemeluk Islam tidak sepantasnya melakukan saibah, karena pemeluk jahiliyah melakukan saibah",
          "tr": "Abdullah b. Mes'ud şöyle demiştir: \"Müslümanlar (köleleri) başıboş, velayet hakkı olmaksızın salıvermezlerdi. Cahiliye dönemi insanları ise onları başıboş salıverir, saibe yaparlardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 30
      },
      "narrator": {
        "en": "`Abdullah"
      }
    },
    {
      "hadithNumber": 6754,
      "arabicNumber": 6754,
      "book": 85,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ اشْتَرَتْ بَرِيرَةَ، لِتُعْتِقَهَا، وَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي اشْتَرَيْتُ بَرِيرَةَ لأُعْتِقَهَا، وَإِنَّ أَهْلَهَا يَشْتَرِطُونَ وَلاَءَهَا‏.‏ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَعْطَى الثَّمَنَ ‏\"‏‏.‏ قَالَ فَاشْتَرَتْهَا فَأَعْتَقَتْهَا‏.‏ قَالَ وَخُيِّرَتْ فَاخْتَارَتْ نَفْسَهَا وَقَالَتْ لَوْ أُعْطِيتُ كَذَا وَكَذَا مَا كُنْتُ مَعَهُ‏.‏ قَالَ الأَسْوَدُ وَكَانَ زَوْجُهَا حُرًّا‏.‏ قَوْلُ الأَسْوَدِ مُنْقَطِعٌ، وَقَوْلُ ابْنِ عَبَّاسٍ رَأَيْتُهُ عَبْدًا‏.‏ أَصَحُّ‏.‏",
        "translations": {
          "en": "Narrated Al-Aswad:`Aisha bought Barira in order to manumit her, but her masters stipulated that her Wala' (after her death) would be for them. `Aisha said, \"O Allah's Messenger (ﷺ)! I have bought Barira in order to manumit her, but her masters stipulated that her Wala' will be for them.\" The Prophet (ﷺ) said, \"Manumit her as the Wala is for the one who manumits (the slave),\" or said, \"The one who pays her price.\" Then `Aisha bought and manumitted her. After that, Barira was given the choice (by the Prophet) (to stay with her husband or leave him). She said, \"If he gave me so much and so much (money) I would not stay with him.\" (Al-Aswad added: Her husband was a free man.) The sub-narrator added: The series of the narrators of Al-Aswad's statement is incomplete. The statement of Ibn `Abbas, i.e., when I saw him he was a slave, is more authentic",
          "ur": "ہم سے موسیٰ نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے منصور نے، ان سے ابراہیم نے، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے کہ بریرہ کو انہوں نے آزاد کرنے کے لیے خریدنا چاہا لیکن ان کے نائکوں نے اپنے ولاء کی شرط لگا دی عائشہ رضی اللہ عنہا نے کہا یا رسول اللہ! میں نے آزاد کرنے کے لیے بریرہ کو خریدنا چاہا لیکن ان کے مالکوں نے اپنے لیے ان کی ولاء کی شرط لگا دی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں آزاد کر دے، ولاء تو آزاد کرنے والے کے ساتھ قائم ہوتی ہے۔ بیان کیا کہ پھر میں نے انہیں خریدا اور آزاد کر دیا اور میں نے بریرہ کو اختیار دیا ( کہ چاہیں تو شوہر کے ساتھ رہ سکتی ہیں ورنہ علیحدہ بھی ہو سکتی ہیں ) تو انہوں نے شوہر سے علیحدگی کو پسند کیا اور کہا کہ مجھے اتنا اتنا مال بھی دیا جائے تو میں پہلے شوہر کے ساتھ نہیں رہوں گی۔ اسود نے بیان کیا کہ ان کے شوہر آزاد تھے۔ اسود کا قول منقطع ہے اور ابن عباس رضی اللہ عنہما کا قول صحیح ہے کہ میں نے انہیں غلام دیکھا۔",
          "fr": "Rapporté par Al-Aswad : Aïcha a acheté Barira pour l’affranchir, mais ses maîtres ont posé comme condition que son Wala’ (droit de succession) leur revienne après sa mort. Aïcha a dit : « Ô Messager d’Allah ﷺ ! J’ai acheté Barira pour l’affranchir, mais ses maîtres veulent garder son Wala’. » Le Prophète ﷺ a dit : « Affranchis-la, car le Wala’ revient à celui qui affranchit (l’esclave) », ou il a dit : « à celui qui paie son prix. » Alors Aïcha l’a achetée et affranchie. Ensuite, le Prophète a donné à Barira le choix (de rester avec son mari ou de le quitter). Elle a dit : « Même s’il me donnait beaucoup d’argent, je ne resterais pas avec lui. » (Al-Aswad a ajouté : Son mari était un homme libre.) Le sous-narrateur a précisé : La chaîne de transmission de l’affirmation d’Al-Aswad est incomplète. L’affirmation d’Ibn `Abbas, c’est-à-dire « quand je l’ai vu, il était esclave », est plus authentique",
          "id": "Telah menceritakan kepada kami [Musa] telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari [Ibrahim] dari [Al Aswad] bahwasanya ['Aisyah] radliallahu 'anha membeli Barirah untuk ia merdekakan, namun pemiliknya memberi syarat bahwa wala`nya tetap milik mereka. Maka Aisyah berkata; 'Wahai Rasulullah, saya ingin membeli Barirah untuk saya merdekakan, namun pemiliknya memberi syarat wala`nya tetap milik mereka! ' Maka Nabi bersabda: \"Merdekakanlah dia, sesungguhnya wala` milik orang yang memerdekakan!\" atau beliau bersabda dengan redaksi: \"bagi orang yang membayar harganya.\" Selanjutnya Aisyah membelinya dan memerdekakannya. Kata Aswad; 'Barirah disuruh memilih untuk tetap bersama suaminya atau bercerai, dan ia memilih merdeka dan berkata; 'Kalaulah aku diberi begini-begini, saya tidak ingin tetap bersamanya! ' Al Aswad mengatakan; 'suaminya merdeka.' Ucapan Al Aswad terputus, dan Ucapan Ibnu Abbas; 'menurut saya suaminya budak' adalah lebih sahih",
          "tr": "Esved'in nakline göre Aişe r.anha Berire'yi azad etmek için sahiplerinden satın almak istedi. Sahipleri de vela hakkının kendilerine ait olması şartını ileri sürdüler, Aişe r.anha \"Ya Resulallah! Ben Berıre'yi hürriye tine kavuşturmak için satın almak istedim. Sahipleri onun velasının kendilerine ait olmasını şart koşuyorlar!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Sen onu aza d et! VelCi hakkı ancak azad edene aittir -veya- sen bedelini ver\" buyurdu. Ravi şöyle devam eder: Bunun üzerine Aişe r.anha Berıre'yi satın alıp, azad etti. Berıre hür olunca (köle bulunan kocasıyla nikahını fesh etme veya devam. hususunda) muhayyer kılındı. O da kendi nefsini(yani nikahının feshini) tercih etti ve \"Bana şu kadar mal verilse bile artık onunla birlikte olmam\" dedi. Esved \"Berıre'nin kocası hür idi\" demiştir. Ancak Esved'in sözü munkatıdır. İbn Abbas'ın \"Ben onu bir köle olarak gördüm\" sözü daha sahihtir. Fethu'l-Bari Açıklaması: İmam Buhari'nin attığı bu başlıktan maksat efendinin \"Senin üzerinde kimsenin velası olmasın\" veya \"sen başıboş ol\" dediği köledir. Efendi bu sözüyle onu azad etmek istemekte ve kimsenin üzerinde velahakkının bulunmasını arzu etmemektedir. Efendi bazen kölesine \"Seni başıboş olarak azad ettim\" veya \"Sen başıboş olarak hürsün\" de diyebilir. İlk iki cümlede efendinin köleyi aza d etme niyeti taşıması gerekirken, son ikisinde köle kendiliğinden hür olur. Yukarıda nakledilen hadis, el-İsmaili'nin tamamını Abdurrahman b. Mehdi, Süfyan vasıtasıyla Hüzeyl' e ulaştırdığı bir isnadla rivayet ettiği hadisin başlangıç kısmıdır. Bu hadis şöyledir: Adamın biri Abdullah'a gelerek \"Ben kendime ait bir köleyi başıboş olarak azad ettim. Bu köle öldü ve geriye mal bıraktı. Hiçbir varisi de yoktur\" dedi. \"Bunun üzerine Abdullah b. Mesud dedi ki ... \" Ravi bundan sonra yukarıdaki hadisi zikretti. Ancak farklı olarak şöyle bir rivayette bulundu: \"Sen o kölenin velinimetisin. Mirası sana aittir. Eğer bu konuda günahtan kaçınmak ister veya sıkıntı duyarsan onu biz kabul eder ve beytü'l-male koyarız.\" Sa ibe hakkında Hasen-i Basri, İbn Sirin, İmam Şafii'nin görüşleri bu doğ rultudadır. Abdurrezzak'ın (Abdurrezzak, Musannef, IX, 28) sahih bir senedie İbn Sirin'den nakline göre meşhur sahabi Ebu Huzeyfe'nin mevlası Salim' i Ensardan bir kadın saibe olarak azad etmiş ve kendisine \"Dilediğin kimse ile vela anlaşmasını yap\" demişti. Bumin üzerine Salim, Ebu Huzeyfe ile ve la anlaşması yapmıştı. Salim, Yemame savaşında şehit düşünce, mirası Ensardan kendini aza d eden o kadına veya onun oğluna verildi. İbnü'l-münzir'in Bekr b. Abdullah el-Müzeni'den nakline göre İbn Ömer'e ölmüş olan azadlısının (mevla) malı getirildi. İbn Ömer \"Biz onu saibe olarak azad etmiştik\" dedi ve o malın bedeli ile köle alınıp azad edilmesini emretti.\" İbn Ömer'in bunu vücuben veya mendub olarak yapma ihtimali bulunmaktadır. Bu haberin zahirini Ata esas almış ve şöyle demiştir: \"Saibe olan köle geriye bir varis bırakmadığında onu azad eden çağrılır. Azad eden kişi onun malını kabul ederse ne ala! Aksi takdirde bu malla köle satın alınıp, azad edilir.\" Bu konuda bir başka görüş daha vardır. Buna göre saibenin velası Müslümanlara aittir ve malına onlar mirasçı olurlar, yanlışlıkla bir cinayet işlediğinde bedelini Müslümanlar öderler. Ömer b. Abdulaziz ve Zühri'nin görüşü bu doğrultudadır. İmam Malik de aynı görüştedir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 31
      },
      "narrator": {
        "en": "Al-Aswad"
      }
    },
    {
      "hadithNumber": 6755,
      "arabicNumber": 6755,
      "book": 85,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ عَلِيٌّ ـ رضى الله عنه مَا عِنْدَنَا كِتَابٌ نَقْرَؤُهُ إِلاَّ كِتَابُ اللَّهِ، غَيْرَ هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ فَأَخْرَجَهَا فَإِذَا فِيهَا أَشْيَاءُ مِنَ الْجِرَاحَاتِ وَأَسْنَانِ الإِبِلِ‏.‏ قَالَ وَفِيهَا الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ، فَمَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ، وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، يَسْعَى بِهَا أَدْنَاهُمْ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفٌ وَلاَ عَدْلٌ‏.‏",
        "translations": {
          "en": "Narrated `Ali:We have no Book to recite except the Book of Allah (Qur'an) and this paper. Then `Ali took out the paper, and behold ! There was written in it, legal verdicts about the retaliation for wounds, the ages of the camels (to be paid as Zakat or as blood money). In it was also written: 'Medina is a sanctuary from Air (mountain) to Thaur (mountain). So whoever innovates in it an heresy (something new in religion) or commits a crime in it or gives shelter to such an innovator, will incur the curse of Allah, the angels and all the people, and none of his compulsory or optional good deeds will be accepted on the Day of Resurrection. And whoever (a freed slave) takes as his master (i.e. be-friends) some people other than hi real masters without the permission of his real masters, will incur the curse of Allah, the angels and all the people, and none of his compulsory, or optional good deeds will be accepted on the Day of Resurrection. And the asylum granted by any Muslim is to be secured by all the Muslims, even if it is granted by one of the lowest social status among them; and whoever betrays a Muslim, in this respect will incur the curse of Allah, the angels, and all the people, and none of his Compulsory or optional good deeds will be accepted on the Day of Resurrection",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے ابراہیم تیمی نے، ان سے ان کے والد نے بیان کیا کہ علی رضی اللہ عنہ نے بتلایا کہ ہمارے پاس کوئی کتاب نہیں ہے جسے ہم پڑھیں، سوا اللہ کی کتاب قرآن کے اور اس کے علاوہ یہ صحیفہ بھی ہے۔ بیان کیا کہ پھر وہ صحیفہ نکالا تو اس میں زخموں ( کے قصاص ) اور اونٹوں کی زکوٰۃ کے مسائل تھے۔ راوی نے بیان کیا کہ اس میں یہ بھی تھا کے عیر سے ثور تک مدینہ حرم ہے جس نے اس دین میں کوئی نئی بات پیدا کی یا نئی بات کرنے والے کو پناہ دی تو اس پر اللہ اور فرشتوں اور انسانوں سب کی لعنت ہے اور قیامت کے دن اس کا کوئی نیک عمل مقبول نہ ہو گا اور جس نے اپنے مالکوں کی اجازت کے بغیر دوسرے لوگوں سے مولات قائم کر لی تو اس پر فرشتوں اور انسانوں سب کی لعنت ہے، قیامت کے دن اس کا کوئی نیک عمل مقبول نہ ہو گا اور مسلمانوں کا ذمہ ( قول و قرار، کسی کو پناہ دینا وغیرہ ) ایک ہے۔ ایک ادنی مسلمان کے پناہ دینے کو بھی قائم رکھنے کی کوشش کی جائے گی۔ پس جس نے کسی مسلمان کی دی ہوئی پناہ کو توڑا، اس پر اللہ کی، فرشتوں اور انسانوں سب کی لعنت ہے قیامت کے دن اس کا کوئی نیک عمل قبول نہیں کیا جائے گا۔",
          "fr": "Rapporté par `Ali : Nous n’avons pas d’autre livre à réciter que le Livre d’Allah (le Coran) et ce document. Puis `Ali a sorti le document, et il y était écrit des règles concernant les représailles pour les blessures, l’âge des chameaux (à donner comme Zakat ou comme compensation). Il y était aussi écrit : « Médine est un sanctuaire depuis la montagne Air jusqu’à la montagne Thaur. Celui qui y introduit une innovation (dans la religion) ou y commet un crime, ou protège un innovateur, subira la malédiction d’Allah, des anges et de tous les gens, et aucune de ses bonnes actions obligatoires ou volontaires ne sera acceptée le Jour de la Résurrection. Et quiconque (un esclave affranchi) prend comme maître d’autres personnes que ses véritables maîtres, sans leur permission, subira la malédiction d’Allah, des anges et de tous les gens, et aucune de ses bonnes actions obligatoires ou volontaires ne sera acceptée le Jour de la Résurrection. Et la protection accordée par n’importe quel musulman doit être respectée par tous les musulmans, même si elle est donnée par la personne la plus modeste parmi eux ; et celui qui trahit un musulman à ce sujet subira la malédiction d’Allah, des anges et de tous les gens, et aucune de ses bonnes actions obligatoires ou volontaires ne sera acceptée le Jour de la Résurrection. »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim At Taimi] dari [ayahnya] mengatakan, [Ali] radliallahu 'anhu menuturkan; 'Kami tidak mempunyai kitab yang kami baca kecuali kitabullah dan lembaran ini.' ayah At Taimi menerangkan; kemudian Ali mengeluarkannya, yang isinya adalah beberapa benda dari batuan dan gigi unta, yang tertulis: \"Kota Madinah adalah haram (suci), yakni daerah antara 'Air dan Tsaur. Maka barangsiapa yang berbuat kejahatan di dalamnya, atau berniat hendak melakukan kejahatan di dalamnya, niscaya laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa kepadanya. Allah tidak akan menerima darinya pada hari kiamat amalan wajib atau pun amalan sunnahnya. Dan barangisapa yang berwali kepada tanpa izin walinya, maka laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa kepadanya, tidak akan diterima darinya pada hari kiamat amalan wajib atau pun amalan sunnahnya. Dzimmah kaum muslimin adalah satu, yang mana dzimmah tersebut berlaku bagi orang yang paling rendah diantara mereka. Barangsiapa merusak janji seorang muslim, maka laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa kepadanya, tidak akan diterima darinya pada hari kiamat amalan wajib atau pun amalan sunnahnya",
          "tr": "İbrahim et-Teymi'nin babasından nakline göre Ali r.a. şöyle demiştir: \"Bizim yanımızda -şu sahife hariç- okumakta olduğumuz Allah'ın kitabından başka yazılı bir kitap yoktur.\" İbrahim'in babası şöyle devam etti: Hz. Ali bundan sonra sözünü ettiği sahifeyi çıkardı. İçinde yaralamalara, diyet ve zekat develerinin yaşlarına dair birtakım hükümler yazılıydı. Bir de şunlar yazılmıştı: \"Medine'nin Air dağı ile Sevr dağı arasında bulunan sahası haremdir. Kim Medine'nin bu haremi içinde (kitap ve sünnete aykırı) bir iş yapar yahut bid'atçiyi barındırırsa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun! Ondan kıyamet günü hiçbir nafile ve farz kabul olunmaz. Her kim de kendi efendilerinin izni olmadan başka bir kavmi veli edinirse Allah'ın, meleklerin ve bütün insanların Ianeti onun üzerine olsun! Ondan kıyamet günü hiçbir nafile ve farz kabul olunmaz. Müslümanların emanı birdir. Onların (statü itibariyle) en aşağı olanları dahi bir harbıye eman verdiğinde o eman bütün Müslümanlarca geçerli olur. Kim bir Müslümanın verdiği ahdi bozarsa Allah'ın, meleklerin ve bütün insanların laneti onun üzerine olsun. Kıyamet günü ondan ne bir nafile, ne de bir farz kabul olunmaz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 32
      },
      "narrator": {
        "en": "`Ali"
      }
    },
    {
      "hadithNumber": 6756,
      "arabicNumber": 6756,
      "book": 85,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:The Prophet (ﷺ) forbade the selling of the Wala' (of slaves) or giving it as a present",
          "ur": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ولاء کے تعلق کو بیچنے، اس کو ہبہ کرنے سے منع فرمایا ہے۔",
          "fr": "Rapporté par Ibn `Umar : Le Prophète ﷺ a interdit de vendre le Wala’ (droit de succession des esclaves) ou de l’offrir en cadeau",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] radliallahu 'anhuma mengatakan; Nabi shallallahu 'alaihi wasallam melarang jual beli wala` dan juga menghibahkannya",
          "tr": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem vela hakkının satılmasını ve hibe edilmesini yasaklamıştır. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlık, Ahmed b. Hanbel ve Taberanl'nin, Sehl b. Muaz b. Enes vasıtasıyla babası Enes'ten naklettikleri şu hadisin ifadesidir. Buna göre Nebi s.a.v. şöyle buyurmuştur: \"Allah'ın öyle kulları vardır ki Allahu Teala onlarla konuşmaz ... \"(Ahmed b. Hanbel, III, 440; Taberani, Mu'cemu'l-kebir, XX, 195) Bu hadiste şöyle bir ifade yer almaktadır: \"Bunlardan birisi bir kavimden iyilik gördükten sonra onların iyiliğini inkar edip, kendilerinden olmadığını iddia eden kimsedir.\" Yukarıdaki başlıkta yer alan hadis, daha önce Fadailu'l-Medine ve el-Cizye bölümlerinde geçmişti. Aynı hadis Diyat bölümünde tekrar gelecektir. Hz. Ali'nin yukarıdaki naklettiği hadisle aynı manada merfu olarak Aişe r.anha'dan şöyle bir rivayet nakledilmiştir: \"Her kim efendilerinden başkalarını mevla edinirse, cehennemdeki yerine hazırlansın.\" İbn Hibban bu hadisin sahih olduğunu belirtmiştir.(İbn Hibban, Sahih, X, 170) Hz. Ali'nin sözünü ettiği sahifede yer alan hadiste dört şeyden söz edilmektedir: Bunlardan birisi yaralamalar ve zekat develerinin yaşlarıdır. Bu hadisin açıklaması Diyat bölümünde gelecektir. Orada bu develerin haraç veya zekat devesi olduğu ya da bundan daha geniş bir kapsamda ele alınacaktır. Sözkonusu sahifedeki ikinci hüküm Medine'nin harem olduğudur .. Bunun açıklaması geniş bir şekilde Hac bölümünün sonlarında Medine'nin fazileti bölümünde geçmişti. Hz. Ali'nin elindeki sayfada yer alan üçüncü hüküm \"Her kim başka bir kavmi veli edinirse\" ifadesidir. Burada konumuzia ilgili olan kısım, bu cümledir. Hadisteki \"Efendilerinin izni olmadan\" şeklindeki ifadeye gelecek olursak; hadiste en alt tabakadan bir azadiının, en üst tabakaya mensup bir başka efendinin azadlısı olduğunu iddia etmesi haramdır. Çünkü bu tavır, nimete nankörlük, vela ve akile sebebiyle doğan miras hakkını zayi etme ve bunun dışında başka sakıncalara yol açar. İbn Vehb'in nakline göre İmam Malik, Muvatta'ında bu hadisi delilolarak almıştır. Sözkonusu eserde yer alan rivayet şöyledir: İmam Malik' e velasının dilediği kişiye ait olması şartıyla kendisini efı;mdisine satan k?lenin durumu sorulunca o bunun caiz olmadığını söylemiş ve ıbn ümer hadisini bu görüşüne delilolarak göstermiştir. Sonra şöyle demiştir: Yasaklanan hibe işte budur.(Muvatta, itk ve'vela) Ata b. Ebu Rebah bu hadisin mefhum-u muhalifini almak suretiyle kaide dışı davranmıştır. Abdurrezzak'ın nakline göre İbn Cüreyc şöyle demiştir: Bir kimsenin kölesine velasını dilediği kimseye vermesine müsaade etmesi caizdir. Ata bu hükmü verdikten sonra sözkonusu hadisi delil olarak göstermiştir. İbn Battal ve bir grup fıkıh bilgini, Ata'nın dediğinin aksi görüşü savunmuş ve şöyle demişlerdir: Hz. Ali'nin rivayet ettiği hadis, \"Geçim endişesiyle çocuklarınızın canına kıymayın\"(İsra 31) ayetinde olduğu gibi genel uygulamaya uygun olarak ifade edilmiştir. Zira bilginler, ister geçim endişesiyle, ister başka bir gerekçeyle bir kimsenin çocuğunu öldürmesinin haram olduğu konusunda görşü birliği etmişlerdir. Yukarıda ifade edilen hadis, velanın satış ve bağışlanmasını yasaklayan hadisle mensuhtur. İbn Battal şöyle demiştir: Hadisten azad edilmiş bir kölenin filan oğlu filanca yazıp, adını ve kendisini azad eden efendisini yazmasının caiz olmadığı hükmü anlaşılmaktadır. Buna karşılık, filancanın mevlası filanca yazmalıdır. Fakat aza d edilen kişinin Kureyşli ve buna benzer başka bir yere mensup olduğunu yazabilir. İbn Battal şöyle devam eder. En uygunu azad edilen kişinin bunu da açıkça belirtip, ve!a itibariyle Kureyşli veya onların azadlısı gibi bir ifade kullanmasıdır. Hadisten Müslüman bile olsalar fasıklara genellikle lanet okumanın caizliği anlaşılmaktadır. Hz. Ali'nin sözünü ettiği sahifede yer alan dördüncü hüküm ise \"Müslümanların zimmetinin bir olup, statü itibariyle en düşük olan bir ferdinin eman verebileceğidir.\" İbn Battal şöyle der: Bilginler nesebi bir kimseden bir başkasına çevirmenin caiz olmadığı noktasında görüş birliği etmişlerdir. Velanın hükmü, nesebin hükmüyle aynı olduğuna ve nesep bir kişiden bir başkasına intikal edemediğine göre vela da geçemez. Cahiliye döneminde insanlar ve layı satış yoluyla veya başka bir yolla nakledebiliyorlardı. Dinimiz bunu yasaklamıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 33
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 6757,
      "arabicNumber": 6757,
      "book": 85,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، أَرَادَتْ أَنْ تَشْتَرِيَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ فَذَكَرَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:That Aisha, the mother of the Believers, intended to buy a slave girl in order to manumit her. The slave girl's master said, \"We are ready to sell her to you on the condition that her Wala should be for us.\" Aisha mentioned that to Allah's Messenger (ﷺ) who said, \"This (condition) should not prevent you from buying her, for the Wala is for the one who manumits (the slave)",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے امام مالک رحمہ اللہ نے بیان کیا، ان سے نافع نے، ان سے ابن عمر رضی اللہ عنہما نے کہ ام المؤمنین عائشہ رضی اللہ عنہا نے ایک کنیز کو آزاد کرنے کے لیے خریدنا چاہا تو کنیز کے مالکوں نے کہا کہ ہم بیچ سکتے ہیں لیکن ولاء ہمارے ساتھ ہو گی۔ ام المؤمنین نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شرط کو مانع نہ بننے دو، ولاء ہمیشہ اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے۔",
          "fr": "Rapporté par Ibn `Umar : Aïcha, la mère des croyants, voulait acheter une esclave pour l’affranchir. Le maître de l’esclave a dit : « Nous sommes prêts à te la vendre à condition que son Wala’ soit pour nous. » Aïcha en a parlé au Messager d’Allah ﷺ, qui a dit : « Cette condition ne doit pas t’empêcher de l’acheter, car le Wala’ revient à celui qui affranchit (l’esclave). »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Ibnu Umar] bahwasanya Aisyah ummul mukminin ingin membeli hamba sahaya untuk dimerdekakan, namun pemiliknya berkata; 'kami menjualnya kepadamu asalkan wala` tetap pada kami\", Maka Aisyah melaporkan kasus ini kepada Rasulullah Shallallahu'alaihi wa sallam dan beliau bersabda: \"Syarat seperti itu tidak menghalangimu, sebab wala' bagi orang yang memerdekakan",
          "tr": "İbn Ömer'in nakline göre mu'minlerin annesi Aişe r.anha azad etmek üzere bir cariye satın almak istedi. Cariyenin sahipleri \"Onu sana velası bize ait olmak şartıyla satarız\" dediler. Aişe r.anha bu teklifi Resuluilah Sallallahu Aleyhi ve Sellem'e aktarınca Nebiimiz Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bu şart satın almana mani olmasın! Çünkü vela hakkı ancak azad edene aittir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 34
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 6758,
      "arabicNumber": 6758,
      "book": 85,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَيْتُ بَرِيرَةَ فَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَذَكَرَتْ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْطَى الْوَرِقَ ‏\"‏‏.‏ قَالَتْ فَأَعْتَقْتُهَا ـ قَالَتْ ـ فَدَعَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَيَّرَهَا مِنْ زَوْجِهَا فَقَالَتْ لَوْ أَعْطَانِي كَذَا وَكَذَا مَا بِتُّ عِنْدَهُ‏.‏ فَاخْتَارَتْ نَفْسَهَا‏.‏",
        "translations": {
          "en": "Narrated Al-Aswad:Aisha said, \"I bought Barira and her masters stipulated that the Wala would be for them.\" Aisha mentioned that to the Prophet (ﷺ) and he said, \"Manumit her, as the Wala is for the one who gives the silver (i.e. pays the price for freeing the slave).\" Aisha added, \"So I manumitted her. After that, the Prophet caller her (Barira) and gave her the choice to go back to her husband or not. She said, \"If he gave me so much and so much (money) I would not stay with him.\" So she selected her ownself (i.e. refused to go back to her husband)",
          "ur": "ہم سے محمد نے بیان کیا، کہا ہم کو جریر نے خبر دی، انہیں منصور نے، انہیں ابراہیم نے، انہیں اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے بریرہ کو خریدنا چاہا تو ان کے مالکوں نے شرط لگائی کہ ولاء ان کے ساتھ قائم ہو گی۔ میں نے اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں آزاد کر دو، ولاء قیمت ادا کرنے والے ہی کے ساتھ قائم ہوتی ہے۔ بیان کیا کہ پھر میں نے آزاد کر دیا۔ پھر انہیں نبی کریم صلی اللہ علیہ وسلم نے بلایا اور ان کے شوہر کے معاملہ میں اختیار دیا۔ انہوں نے کہا کہ اگر مجھے یہ یہ چیزیں بھی وہ دیدے تو میں اس کے ساتھ رات گزارنے کے لیے تیار نہیں۔ چنانچہ اس نے شوہر سے علیحدگی کو پسند کیا۔",
          "fr": "Rapporté par Al-Aswad : Aïcha a dit : « J’ai acheté Barira et ses maîtres ont posé comme condition que le Wala’ soit pour eux. » Aïcha en a parlé au Prophète ﷺ, qui a dit : « Affranchis-la, car le Wala’ revient à celui qui donne l’argent (c’est-à-dire paie le prix pour affranchir l’esclave). » Aïcha a ajouté : « Je l’ai donc affranchie. Ensuite, le Prophète a appelé Barira et lui a donné le choix de retourner ou non auprès de son mari. Elle a dit : « Même s’il me donnait beaucoup d’argent, je ne resterais pas avec lui. » Elle a donc choisi de ne pas retourner avec son mari",
          "id": "Telah menceritakan kepada kami [Muhammad] telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] radliallahu 'anha mengatakan; 'Aku membeli Barirah namun pemiliknya memberi syarat wala`nya tetap dimiliki mereka. Maka hal ini kusampaikan kepada Nabi shallallahu 'alaihi wasallam dan beliau bersabda: \"Merdekakanlah ia, sebab wala` bagi yang menyerahkan perak.\" Kata Aisyah; lalu aku memerdekakannya, kemudian Rasulullah Shallallahu'alaihi wa sallam memanggilnya dan memberinya pilihan untuk tetap bersama suaminya (ataukah tidak). Maka Barirah menjawab: 'Kalaulah suamiku memberiku itu dan itu, aku tidak mau bermalam dengannya, ' dan ia memilih untuk berpisah. Kata Aswa; 'kondisi suaminya merdeka",
          "tr": "Aişe r.anha şöyle anlatmıştır: Ben Berire'yi satın almak istedim. Sahipleri onun velasının kendilerine ait olmasını şart koştular. Bunu Nebi Sallallahu Aleyhi ve Sellem'e açınca bana şöyle dedi: \"Onu azad et! Çünkü vela hakkı gümüş parayıveren kimseye aittir.\" Aişe r.anha şöyle devam etti: Ben onu aza d ettim. Sonra Resulullah Sallallahu Aleyhi ve Sellem Berire'yi çağırdı ve kocasının nikahında kalıp kalmamak hususunda onu muhayyer kıldı. Berire \"O bana şu kadar mal verse bile onUn yanında bir gece bile kalmam\" dedi ve ondan ayrılmayı tercih etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 35
      },
      "narrator": {
        "en": "Al-Aswad"
      }
    },
    {
      "hadithNumber": 6759,
      "arabicNumber": 6759,
      "book": 85,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَ بَرِيرَةَ فَقَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّهُمْ يَشْتَرِطُونَ الْوَلاَءَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اشْتَرِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:When Aisha intended to buy Barira, she said to the Prophet, \"Barira's masters stipulated that they will have the Wala.\" The Prophet (ﷺ) said (to Aisha), \"Buy her, as the Wala is for the one who manumits",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، انہوں نے کہا ہم سے ہمام نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ عائشہ رضی اللہ عنہا نے بریرہ رضی اللہ عنہا کو خریدنا چاہا اور رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یہ لوگ ولاء کی شرط لگاتے ہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ خرید لو، ولاء تو اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے ( آزاد کرائے ) ۔",
          "fr": "Rapporté par Ibn `Umar : Quand Aisha a voulu acheter Barira, elle a dit au Prophète : « Les maîtres de Barira ont posé comme condition qu'ils garderaient le Wala. » Le Prophète (ﷺ) a dit à Aisha : « Achète-la, car le Wala revient à celui qui affranchit. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Hammam] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma mengatakan; Aisyah ingin membeli Barirah, kemudian dia berkata kepada Nabi shallallahu 'alaihi wasallam; 'Mereka memberi syarat wala`nya tetap milik mereka'. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Belilah ia, hanyasanya wala' bagi yang memerdekakannya",
          "tr": "İbn Ömer şöyle demiştir: Aişe, Berire'yi satın almak istedi ve Resulullah Sallallahu Aleyhi ve Sellem'e \"Onun sahipleri velanın kendilerine ait olmasını şart koşuyorlar\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Vela hakkı ancak azad edene aittir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 36
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 6760,
      "arabicNumber": 6760,
      "book": 85,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْوَلاَءُ لِمَنْ أَعْطَى الْوَرِقَ، وَوَلِيَ النِّعْمَةَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Aisha:Allah's Messenger (ﷺ) said, \"The wala is for the one who gives the silver (pays the price) and does the favor (of manumission after paying the price)",
          "ur": "ہم سے ابن سلام نے بیان کیا، کہا ہم کو وکیع نے خبر دی، انہیں سفیان نے، انہیں منصور نے، انہیں ابراہیم نے، انہیں اسود نے، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ولاء اس کے ساتھ قائم ہو گی جو قیمت دے اور احسان کرے ( آزاد کر کے)",
          "fr": "Rapporté par Aisha : Le Messager d'Allah (ﷺ) a dit : « Le Wala revient à celui qui donne l'argent (paie le prix) et rend service (en affranchissant après avoir payé le prix). »",
          "id": "Telah menceritakan kepada kami [Ibnu Salam] telah mengabarkan kepada kami [Waki'] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Wala` bagi yang menyerahkan perak (pembeli) dan menjamin kesenangan (mengurus hidupnya)",
          "tr": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Vela hakkı, kölenin bedeli olan gümüş paraları veren ve hürriyet nimetini vermeyi üzerine alan kimseye aittir\" buyurmuştur. Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Bu hadis gerek erkek, gerek kadın köleyi hürriyetine kavuşturan herkesin olduğunu gerekli kılmaktadır ki bu, bilginlerin üzerinde ittifak ettikleri görüştür. Vela hakkının bir varisten diğerine geçme meselesine gelince, Ebheri şöyle demiştir: Fıkıh bilginlerinin ittifakla belirttiklerine göre kadınlar ancak köleyi hürriyetine kavuşturduklarında veya böyle bir kadının evladı olduklarında vela hakkı kazanırlar. Ancak Mesruk'un şöyle dediği rivayet edilmiştir: Vela hakkını babalarından miras olarak elde etme sadece erkeklere mahsus değildir. Tam aksine bu konuda -tıpkı mirasta olduğu gibi- erkekler ve kadınlar eşittir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 37
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 6761,
      "arabicNumber": 6761,
      "book": 85,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ، وَقَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏ أَوْ كَمَا قَالَ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:The Prophet (ﷺ) said, \"The freed slave belongs to the people who have freed him,\" or said something similar",
          "ur": "ہم سے آدم نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے معاویہ بن قرہ اور قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی گھرانے کا غلام اسی کا ایک فرد ہوتا ہے“ «أو كما قال‏.‏» ۔",
          "fr": "Rapporté par Anas bin Malik : Le Prophète (ﷺ) a dit : « L'esclave affranchi appartient aux gens qui l'ont affranchi, » ou il a dit quelque chose de similaire",
          "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Mu'awiyah bin Qurrah] dan [Qatadah] dari [Anas bin Malik] radliallahu 'anhu, dari Nabi Shallallahu'alaihi wa sallam bersabda: \"Maula suatu kaum adalah bagian diri mereka.\" atau sebagaimana beliau sabdakan",
          "tr": "Enes b. Malik'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Bir topluluğun azadlı kölesi, kendilerindendir\" buyurmuştur ya da buna benzer bir ifade kullanmıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 38
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 6762,
      "arabicNumber": 6762,
      "book": 85,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏‏.‏ أَوْ ‏\"‏ مِنْ أَنْفُسِهِمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:The Prophet (ﷺ) said, \"The son of the sister of some people is from them or from their own selves",
          "ur": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی گھرانے کا بھانجا اس کا ایک فرد ہے۔“ ( «منهم‏ ‏‏.‏» یا «من أنفسهم» کے الفاظ فرمائے ) ۔",
          "fr": "Rapporté par Anas bin Malik : Le Prophète (ﷺ) a dit : « Le fils de la sœur de certaines personnes fait partie d'eux ou est comme l'un des leurs. »",
          "id": "Telah menceritakan kepada kami [Abul Walid] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam bersabda: \"anak saudari suatu kaum adalah bagian mereka\" atau \"dari kalangan mereka",
          "tr": "Enes'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Bir topluluğun kız kardeşinin oğlu da onlardandır\" ya da \"kendilerindendir.\" Fethu'l-Bari Açıklaması: \"Bir topluluğun azadlı köleSi, kendilerindendir\", bir topluiuğun hürriyetine kavuşturdu kı arı kimse kendilerinş' nispet edilir ve o topluluk sözkonusu köleye mirasçı olur demektir. \"Bir topluluğun kız kardeşinin oğlu da onlardandır.\" Yani o çocuk o topluluktan bir kişiye mensuptur ki o da çocuğun annesidir. İbn Ebu Cemre şöyle demiştir: Kız kardeş çocuğundan söz edilmesinin hikmeti, cahiliye döneminde Arapların kız kardeşin -çocukları• şöyle dursun- kızlarının çocuklarına bile iltifat etmeme şeklindeki anlayışlarını yıkmaktır. Cahiliye Araplarından şairin biri şöyle der: Oğullarımız, oğullarımızın oğulları bunlardır nesiimiz, Kızlarımızın oğulları ise değil bizim neslimiz! Şair bu ifadesiyle akrabalar arasında kaynaşmayı teşvik etmektedir. Biz de şunu ekleyelim: Azadlılar hakkındaki söze gelince, buradaki hikmet daha önce belirtildiği üzere bir kölnin efendisine evladı lafzı kullanılmaksızın nispet edileceğidir. Zira yakında babasından başkasına intisab eden kimseye yönelik tehdit ve kölenin \"nispet\" lafzıyla efendisine nispetinin caizliği gelecektir. Bu açıklamayla deliller birbiriyle uzlaşmış olmaktadır. Başarı Allahu Teala'tandır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 39
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 6763,
      "arabicNumber": 6763,
      "book": 85,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ مَالاً فَلِوَرَثَتِهِ، وَمَنْ تَرَكَ كَلاًّ فَإِلَيْنَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \" If somebody dies (among the Muslims) leaving some property, the property will go to his heirs; and if he leaves a debt or dependants, we will take care of them",
          "ur": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عدی نے، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جس نے مال چھوڑا ( اپنی موت کے بعد ) وہ اس کے وارثوں کا ہے اور جس نے قرض چھوڑا ہے وہ ہمارے ذمہ ہے۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Si quelqu'un meurt parmi les musulmans en laissant des biens, ces biens iront à ses héritiers ; et s'il laisse des dettes ou des personnes à charge, nous nous en occuperons. »",
          "id": "Telah menceritakan kepada kami [Abul Walid] telah menceritakan kepada kami [Syu'bah] dari ['Adi] dari [Abu Hazim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam Shallallahu'alaihiwasallam bersabda: \"Barangsiapa meninggalkan harta, maka bagi ahli warisnya, dan barangsiapa meninggalkan tanggungan, maka kami yang menjaminnya",
          "tr": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kim mal bırakırsa o mal kendi mirasçılarına aittir. Her kim de borç bırakırsa bize aittir\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'ninkullandığı bu başlık, esirin nerede ve ne durumda olduğu ister bilinsin, ister bilinmesin kendisine kalan miras hakkında yapılacak işlemle ilgilidir. İbn Battal şöyle demiştir: Çoğunluğu oluşturan fıkıh bilginleri, bir esire miras düştüğünde o payın kendisi adına bekletileceği kanaatine varmışlardır. Said b. el-Müseyyeb' in düşman elindeki esire mirastan pay verilemeyeceği kanaatinde olduğu nakledilmiştir. İbn Battal şöyle der: Çoğunluğu oluşturan fıkıh bilginlerinin görüşleri daha uygundur. Çünkü o kişi Müslümansa \"Her kim mal bırakırsa o mal kendi mirasçılarına aittir\" ifadesinin genelliğine girer. İmam Buhari, Ebu Hureyre hadisine yer vererek bu hükme işaret etmektedir. Öte yandan düşman elindeki esir Müslümandır. Dolayısıyla ona Müslümanların ahkamı uygulanır. O kişiye elde bir delilolmadıkça Müslümanların ahkamından farklı bir şey uygulanmaz. Nitekim Ömer b. Abdulaziz de buna işaret etmektedir. Esirin dinden dönmüş olması -bunu kendi isteğiyle yaptığı sabit olmadıkça- yeterli değildir. Netice olarak esir hiçbir kimsenin baskısı altında kalmaksızın kendi gönlüyle dinden döndüğü sabit olmadıkça malının elinden çıktığına hükmedilmez"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 40
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6764,
      "arabicNumber": 6764,
      "book": 85,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ، وَلاَ الْكَافِرُ الْمُسْلِمَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Usama bin Zaid:the Prophet (ﷺ) said, \"A Muslim cannot be the heir of a disbeliever, nor can a disbeliever be the heir of a Muslim",
          "ur": "ہم سے ابوعاصم نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے علی بن حسین نے بیان کیا، ان سے عمر بن عثمان نے بیان کیا اور ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”مسلمان باپ کافر بیٹے کا وارث نہیں ہوتا اور نہ کافر بیٹا مسلمان باپ کا۔“",
          "fr": "Rapporté par Usama bin Zaid : Le Prophète (ﷺ) a dit : « Un musulman ne peut pas hériter d’un non-croyant, et un non-croyant ne peut pas hériter d’un musulman. »",
          "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Syihab] dari [Ali bin Husain] dari [Amru bin Utsman] dari [Usamah bin Zaid] radliallahu 'anhuma, Nabi shallallahu 'alaihi wasallam bersabda: \"Orang muslim tidak mewarisi orang kafir, dan orang Kafir tidak mewarisi orang muslim",
          "tr": "Usame b. Zeyd'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Müslüman kafire, kafir de Müslümana mirasçı olamaz\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buhari hadisin ifadesini başlık olarak kullanmış ve sonra da \"Kafir miras taksim olunmadan önce İslama girerse onun için miras yoktur\" demiştir. İmam Buhari bu ifadesiyle hadisin genelliğinin bu hükmü içerdiğine işaret etmiştir. Mirasın intikal etmemesini mirasın taksimiyle kayıtlayan, bunun delilini getirmek zorundadır. Çoğunluğu oluşturan fıkıh bilginlerinin delili ise şudur: Mirasın cereyan etmesi için ölümün meydana gelmiş olması gerekir. Kişinin ölüm sebebiyle mülkü kendisinden varislerine intikal ettiğine göre o mal ölünün taksimini beklemiyar demektir. Çünkü ölüden intikal eden mal, taksim edilmemiş bile olsa hak edilmiştir. İbnü'l-Müneyyir'e göre bir Müslüman ölse ve geriye -mesela- biri Müslüman, diğeri kafir iki oğlu kalsa ve malın taksim edilmesinden önce kafir olan çocuk da Müslüman olsa bu konuya örnek teşkil ederler. İbnü'l-Münzir şöyle der: Çoğunluk fıkıh bilginleri, burada yer verilen Usame hadisinin genelliğinin gösterdiği üzere o çocuğun da mirastan payalacağı kanaatine varmışlardır. Ancak Muaz'ın şöyle dediği nakledilmiştir: Müslüman, kafire mirasçı olurken, kafir Müslümana olamaz. Muaz bu görüşüne delil olarak Nebi Sallallahu Aleyhi ve Sellem'in \"İslam artar, eksilmez\" hadisini delil olarak göstermiştir. Bu hadisi Ebu Davud ve Hakim rivayet etmişler, Hakim sahih olduğunu belirtmiştir. (Ebu Davud, Feraiz; Hakim,el-Müstedrek, LV, 383) \"Müslüman kafire, kafir Müslümana mirasçı olamaz.\" Bu hadisi Nesal, Huşeym vasıtasıyla Zührl'den \"İki ayrı din'den olanlar birbirine mirasçı atamazlar\" şeklinde rivayet etmiştir. (Nesai, es-Sünenu'l-Kübra, IV, 82) Bir dine mensup kafir, bir başka dine mensup olan kafire mirasçı olamaz diyen bilginler, bu hadisi delil olarak göstermişlerdir. Çoğunluğu oluşturan fıkıh bilginleri ise \"İki ayrı dinden\" ifadesini İslam ve küfür şeklinde yorumlamışlardır. Bu takdirde hadis başlıkta nakledilen hadisin lafzıyla aynı olmuş olur. Bu, rivayeti genelliğinin zahirine yorumlamaktan daha evladır. Hadis genelliğine göre yorumlandığı takdirde mesela bir Yahudi, bir Hıristiyana mirasçı olamaz. ŞaH mezhebinde en sahih olan görüşe göre bir kafir, bir başka kafire mirasçı olur. Hanefılerin ve çoğunluğu oluşturan bilginlerin görüşü de bu doğrultudadır. Bunun karşıtı ise İmam Malik ve Ahmed b. Hanbel'in görüşüdür. Ahmed b. Hanbel'den gelen bir rivayete göre bir zimmı ile harbi arasında fark vardır. Şam mezhebinde de hüküm böyledir. İmam Ebu Hanife'den gelen bir rivayete göre bir harbi, zimmiye mirasçı olamaz. Bunların ikisi de harbi oldukları takdirde aynı ülkeye mensup olmaları şarttır. Şafiilere göre ise bunların aynı ülkeye mensup olup olmamaları arasında hiçbir fark yoktur. Şafiilere ait bir başka görüş ise Hanefiler gibidir. Sevri, Rebi'a ve bir grup bilgine göre kafirler üç çeşittir. Bunlar Yahudiler, Hıristiyanlar ve başkalarıdır. Bu üç grupta bir dinin mensubu diğer iki din mensubuna mirasçı olamaz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 41
      },
      "narrator": {
        "en": "Usama bin Zaid"
      }
    },
    {
      "hadithNumber": 6765,
      "arabicNumber": 6765,
      "book": 85,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِي غُلاَمٍ فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِي عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ، انْظُرْ إِلَى شَبَهِهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ هَذَا أَخِي يَا رَسُولَ اللَّهِ، وُلِدَ عَلَى فِرَاشِ أَبِي مِنْ وَلِيدَتِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَبَهِهِ فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ ‏ \"‏ هُوَ لَكَ يَا عَبْدُ، الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ‏\"‏‏.‏ قَالَتْ فَلَمْ يَرَ سَوْدَةَ قَطُّ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Sa`d bin Abi Waqqas and 'Abu bin Zam`a had a dispute over a boy. Sa`d said, \"O Allah's Messenger (ﷺ)! This (boy) is the son of my brother, `Utba bin Abi Waqqas who told me to be his custodian as he was his son. Please notice to whom he bears affinity.\" And 'Abu bin Zam`a said, \"This is my brother, O Allah's Messenger (ﷺ)! He was born on my father's bed by his slave girl.\" Then the Prophet (ﷺ) looked at the boy and noticed evident resemblance between him and `Utba, so he said, \"He (the toy) is for you, O 'Abu bin Zam`a, for the boy is for the owner of the bed, and the stone is for the adulterer. Screen yourself before the boy, O Sauda bint Zam`a.\" `Aisha added: Since then he had never seen Sauda",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے لیث نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہا کا ایک لڑکے کے بارے میں جھگڑا ہوا۔ سعد رضی اللہ عنہ نے کہا کہ یا رسول اللہ! یہ میرے بھائی عتبہ بن ابی وقاص کا لڑکا ہے، اس نے مجھے وصیت کی تھی کہ یہ اس کا لڑکا ہے آپ اس کی مشابہت اس میں دیکھئیے اور عبد بن زمعہ نے کہا کہ میرا بھائی ہے یا رسول اللہ! میرے والد کے بستر پر ان کی لونڈی سے پیدا ہوا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے لڑکے کی صورت دیکھی تو اس کی عتبہ کے ساتھ صاف مشابہت واضح تھی، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا، عبد! لڑکا بستر والے کا ہوتا ہے اور زانی کے حصہ میں پتھر ہیں اور اے سودہ بنت زمعہ! ( ام المؤمنین رضی اللہ عنہا ) اس لڑکے سے پردہ کیا کر چنانچہ پھر اس لڑکے نے ام المؤمنین کو نہیں دیکھا۔",
          "fr": "Rapporté par `Aisha : Sa`d bin Abi Waqqas et 'Abu bin Zam`a se disputaient au sujet d’un garçon. Sa`d a dit : « Ô Messager d’Allah (ﷺ) ! Ce garçon est le fils de mon frère, `Utba bin Abi Waqqas, qui m’a demandé d’être son tuteur car il disait que c’était son fils. Regarde à qui il ressemble. » Et 'Abu bin Zam`a a dit : « C’est mon frère, ô Messager d’Allah (ﷺ) ! Il est né sur le lit de mon père, de sa servante. » Le Prophète (ﷺ) a alors regardé le garçon et a remarqué qu’il ressemblait clairement à `Utba, puis il a dit : « Il est pour toi, ô 'Abu bin Zam`a, car l’enfant appartient au propriétaire du lit, et la pierre est pour l’adultère. Cache-toi devant le garçon, ô Sauda bint Zam`a. » `Aisha a ajouté : Depuis ce jour, Sauda ne l’a plus jamais vu",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Urwah] dari ['Aisyah] radliallahu 'anha mengatakan; Sa'd bin Abu Waqqash bersengketa dengan Abd bin Zam'ah tentang anak laki-laki. Sa'd mengatakan; 'Ya Rasulullah, (dia adalah) anak saudaraku 'Utbah bin Abi Waqash, dia berpesan kepadaku bahwa dia adalah anaknya, lihatlah kemiripannya! ' Sedang 'Abd bin Zam'ah berkata; 'anak ini adalah saudaraku Wahai Rasulullah, ia dilahirkan di atas kasur ayahku dari hamba sahayanya! ' Rasulullah Shallallahu'alaihi wa sallam mencermati kemiripannya dan melihat kemiripan yang terang dengan 'Utbah, namun beliau kemudian bersabda: \"Anak laki-laki ini untukmu ya Abd bin Zam'ah, anak bagi pemilik ranjang dan bagi pezinah adalah batu, dan berhijablah engkau dari dia wahai Saudah binti Zam'ah.\" 'Aisyah berkata; maka anak laki-laki itu tak pernah melihat Saudah selama-lamanya",
          "tr": "Aişe r.anha şöyle demiştir: Sa'd b. Ebi Vakkas ile Utbe b. Zem'a bir oğlan çocuğu hakkında anlaşmazlığa düştüler ve Sa'd b. Ebi Vakkas \"Ya Resulallah! Kardeşimin oğlu Utbe b. Ebi Vakkas bana bu çocuğun kendi oğlu olduğunu bildirip, bu çocuğun kendi nesebine bağlanmasını vasiyet etti. Şu çocuğun ona benzeyişine bak!\" dedi. Abd b. Zem'a da \"Ya Resulallah! bu çocuk benim kardeşimdir. Babamın cariyesinden babamın yatağı üzerinde doğdu\" dedi. Resulullah Sallallahu Aleyhi ve Sellem çocuğun simasına baktı ve onda Utbe'ye açık bir benzerlik gördü. Sonra \"Ey Abd b. Zem'a! Çocuk sana aittir. Çünkü çocuk kimin yatağında dünyaya gelmişse onundur. Zina eden için de mahrumiyet vardır\" dedi. Aişe şöyle dedi: \"Artık o çocuk Sevde'yi bir daha hiç görmedi.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: İmam Buhari 27 numaralı başlığın altına herhangi bir hadis koymamıştır. Fıkıh bilginlerinin görüşü Hıristiyan köle öldüğünde malı kölelik sebebiyle efendisinindir. Çünkü kölenin herhangi bir mala sahip olması geçerli olmadığı gibi yerleşmiş bir kural da değildir. Dolayısıyla o mal efendinindir. Efendi o malı miras yoluyla hak etmiş değildir. Miras yoluyla ancak miras bırakanın istikrarlı mülkü hak edilir. İbn Sırın'in bu durumdaki kölenin malının beytü'l-inale ait olduğunu, aradaki din farkından dolayı efendinin hiçbir şey alamayacağını söylediği nakledilmiştir. Mükatebe gelince eğer o anlaşma bedelini ödemeden ölmüşse geriye bıraktığı mal, anlaşma bedelinin kalanını kapatmaya yettiği takdirde anlaşma bedeli oradan alınır. Geriye artan ise beytü'l-male kalır. Biz de şunu ekleyelim: Mükateb meselesinde bilginler arasında ihtilaf vardır. Bu ihtilaf, anlaşma bedelinin bir kısmını ödeyen kölenin ödediği miktar kadar hürriyetine kavuşur mu, yoksa üzerinde borç kaldığı sürece köle olmaya devam eder mi şeklindeki ihtilaftan kaynaklanmaktadır. !tk bölümünde bu konuyla ilgili açıklama geçmişti. İmam Buhari çocuğunun nesebini inkar edenin günahı konusunda Sa'd b. Ebi Vakkas'la, Abd b. Zem'a arasındaki anlaşmazlığın sözkonusu edildiği Hz. Aişe radıyallahu an ha hadisine yer vermiştir. Bu hadisin açıklaması \"Çocuk kimin döşeğinde dünyaya gelmişse onundur\" başlığı altında geçmişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 42
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 6767,
      "arabicNumber": 6767,
      "book": 85,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ ـ هُوَ ابْنُ عَبْدِ اللَّهِ ـ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ، وَهْوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ، فَالْجَنَّةُ عَلَيْهِ حَرَامٌ ‏\"‏‏.‏ فَذَكَرْتُهُ لأَبِي بَكْرَةَ فَقَالَ وَأَنَا سَمِعَتْهُ أُذُنَاىَ، وَوَعَاهُ، قَلْبِي مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Sa`d:I heard the Prophet (ﷺ) saying, \"Whoever claims to be the son of a person other than his father, and he knows that person is not his father, then Paradise will be forbidden for him.\" I mentioned that to Abu Bakra, and he said, \"My ears heard that and my heart memorized it from Allah's Messenger (ﷺ)",
          "fr": "Rapporté par Sa`d : J’ai entendu le Prophète (ﷺ) dire : « Celui qui prétend être le fils d’un autre homme que son père, en sachant que ce n’est pas son père, le Paradis lui sera interdit. » J’en ai parlé à Abu Bakra, et il a dit : « Mes oreilles ont entendu cela et mon cœur l’a retenu du Messager d’Allah (ﷺ). »",
          "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Khalid] yaitu Ibnu Abdullah, telah menceritakan kepada kami [Khalid] dari [Abu Utsman] dari [Sa'd] radliallahu 'anhu mengatakan, aku menengar Nabi Shallallahu'alaihiwasallam bersabda; \"Barangsiapa menasabkan diri kepada selain ayahnya padahal ia tahu bukan ayahnya maka surga haram baginya.\" Maka aku sampaikan hadits ini kepada [Abu Bakrah] dan ia berkata; 'Aku mendengarnya dengan kedua telingaku ini dan hatiku juga mencermati betul dari Rasulullah Shallallahu'alaihiwasallam",
          "tr": "Sa'd şöyle demiştir: Ben Nebi Sallallahu Aleyhi ve Sellem'in \"Her kim babasından başkasının -onun kendi babası olmadığını bile bile- çocuğu olduğunu iddia ederse, bu kişiye cennet haramdır\" dediğini işittim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 43
      },
      "narrator": {
        "en": "Sa`d"
      }
    },
    {
      "hadithNumber": 6768,
      "arabicNumber": 6768,
      "book": 85,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَرْغَبُوا عَنْ آبَائِكُمْ، فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"Do not deny your fathers (i.e. claim to be the sons of persons other than your fathers), and whoever denies his father, is charged with disbelief",
          "ur": "ہم سے اصبغ بن الفرج نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ کو عمرو نے خبر دی، انہیں جعفر بن ربیعہ نے، انہیں عراک نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اپنے باپ کا کوئی انکار نہ کرے کیونکہ جو اپنے باپ سے منہ موڑتا ہے ( اور اپنے کو دوسرے کا بیٹا ظاہر کرتا ہے تو ) یہ کفر ہے۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Ne reniez pas vos pères (c’est-à-dire ne prétendez pas être les fils d’autres hommes que vos pères), et celui qui renie son père est considéré comme incroyant. »",
          "id": "Telah menceritakan kepada kami [Ashbagh bin Al Faraj] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru] dari [Ja'far bin Rabi'ah] dari [Irak] dari [Abu Hurairah] radliallahu 'anhu, dari Nabi Shallallahu'alaihiwasallam bersabda; \"Janganlah kalian membenci ayah-ayah kalian, sebab siapa saja yang membenci ayahnya adalah kekufuran",
          "tr": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Sakın babalarınızdan yüz çevirip uzaklaşmayınız! Her kim babasından yüz çevirip onu terk ederse nankörlük etmiş olur\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlıktan maksadı, daha önceki başlıkta açıkça belirtildiği üzere babasından başkasının çocuğu olduğunu iddia edenin günahını vurgulamaktır. Ya da bu başlığın \"günah\" kelimesine yer verilmeksizin mutlak olarak söylenmesi, içerisinde nankörlük ve cennetin haram olması gibi kelimeler dolayısıyla tehdit bulunmasından dolayıdır. Dolayısıyla bu mana, hadisi açıklamaya çalışan kimselerin düşünce ve görüşlerine bırakılmıştır. Müslim'de, Hüşeym'in Halid el-Hazza' dan naklettiği bir rivayet şöyledir: \"Ziyad'ın nesebi kabul edilince, Ebu Bekre ile karşılaştım. Ona \"Bu yaptığınız nedir? Ben Sa'd b. Ebu Vakkas' i her kim babasından başkasının -onun kendi babası olmadığını bile bile- çocuğu olduğunu iddia ederse bu kişiye cennet haramdır\"(Müslim, İman) derken işittim. Ebu Bekre şöyle demiştir: Ben de bu hadisi Resulullah Sallallahu Aleyhi ve Sellemiden duydum. Burada adı geçen Ziyad, Ziyad b. Sümeyye'dir ki Sümeyye annesi olup, el-Haris b. Kelede'nin cariyesi idi. Haris onu azadlısı Ubeyd'le evlendirmişti. Bu cariye Ziyad'ı Ubeyd'in döşeğinde dünyaya getirdi. Onlar o vakitler Taif'te bulunuyorlardı ve Taifliler henüz Müslüman olmamışlardı. Hz. Ömer'in halifelik döneminde Ebu Süfyan b. Harb, Ömer'in yanında Ziyad'ın konuşmasını işitti. Ziyad çok belagatlı idi. Muaviye onu beğendi ve şöyle dedi: \"Ben onun annesinden dolayı durumunu biliyorum. İstesem adını söylerdim, fakat Ömer' den korkuyorum.\" Muaviye halifeliğe gelince, Ziyad Hz. Ali tarafından Fars diyarına tayin edilmiş bulunuyordu. Muaviye onunla iyi geçinmek istedi ve onda Ebu Süfyan'ın nesebini alma isteğini uyandırdı. Ziyad buna boyun eğdi ve bu konuda birtakım talihsizlikler ve terslikler meydana geldi. Sonunda Muaviye onun babasının oğlu olduğunu iddia etti ve kendisini önce Basra, sonra Kufe'ye vali tayin etti ve ona değer verdi. Ziyad meşhur yaşantısına ve siyasetine devam etti. Sahabe ve tabiundan birçok kişi Muaviye'nin bu yaptığına \"Çocuk kimin yatağında dünyaya gelmişse onundur\" hadisini delil göstererek tepki gösterdi. Biraz önce bu konuda bir şeyler söylemiştik. Ebu Osman'ın tepkisini açığa vurmak için Ebu Bekre'yi seçmesi, Ziyad'ınonun ana bir erkek kardeşi olmasından dolayıdır. Ebu Bekre'nin, Ziyad'la yaşadığı bir olay vardır ki buna daha önce Şehadat bölümünde işaret edilmişti. Bu hadis Huneyn gazvesinden söz edilirken geçmişti. \"Sakın babalarınızdan yüz çevirip uzaklaşmayınız!\" hadisindeki \"......\" cümlesi, Küşmihenl' de \".......\" şeklinde yer almaktadır. Bazı hadis şarihleri şöyle demişlerdir: Burada \"küfür\" kelimesine yer verilmesi, o kişinin Allahu Teala'a iftira atar duruma düşmesindendir. Çünkü o adeta \"Allah beni filancanın sperminden yarattı\" demiş olmaktadır. Oysa gerçek böyle değildir. Çünkü onu Allahu Teala bir başka babadan yaratmıştır. Yakında geçen \"Bir topluluğun kız kardeşinin oğlu da onlardandır\" ve \"Bir topluluğun azadlı köleSi, kendilerindendir\" hadislerinin genelliği üzere olmadığı bu hadise dayanılarak ifade edilmiştir. Zira hadisler genelliği üzere olsaydı, bir kimsenin mesela dayısının oğlu olduğunu söylemesi caiz olurdu. O iki hadis genelliği üzere olsaydı, o zaman bunu yapan kimseye yönelik şiddetli tehdit içeren başlıktaki hadisle çelişirdi. Buradan o hadisin kapsamının dar olduğu (haas) anlaşılmaktadır. Bundan maksat kız kardeş çocuğunun şefkat, iyilik, yardımlaşma ve benzeri konularda onlardan olduğudur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 44
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6769,
      "arabicNumber": 6769,
      "book": 85,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا، جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ لِصَاحِبَتِهَا إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ فَتَحَاكَمَتَا إِلَى دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ فَقَضَى بِهِ لِلْكُبْرَى، فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ ـ عَلَيْهِمَا السَّلاَمُ ـ فَأَخْبَرَتَاهُ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَهُمَا‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَفْعَلْ يَرْحَمُكَ اللَّهُ‏.‏ هُوَ ابْنُهَا‏.‏ فَقَضَى بِهِ لِلصُّغْرَى ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنْ سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلاَّ يَوْمَئِذٍ، وَمَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةَ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"There were two women with whom there were their two sons. A wolf came and took away the son of one of them. That lady said to her companion, 'The wolf has taken your son.' The other said, 'But it has taken your son.' So both of them sought the judgment of (the Prophet) David who judged that the boy should be given to the older lady. Then both of them went to (the Prophet) Solomon, son of David and informed him of the case. Solomon said, 'Give me a knife so that I may cut the child into two portions and give one half to each of you.' The younger lady said, 'Do not do so; may Allah bless you ! He is her child.' On that, he gave the child to the younger lady.\" Abu Huraira added: By Allah! I had never heard the word 'Sakkin' as meaning knife, except on that day, for we used to call it \"Mudya",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، کہا کہ ہم سے ابوالزناد نے بیان کیا، ان سے عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”دو عورتیں تھیں اور ان کے ساتھ ان کے دو بچے بھی تھے، پھر بھیڑیا آیا اور ایک بچے کو اٹھا کر لے گیا اس نے اپنی ساتھی عورت سے کہا کہ بھیڑیا تیرے بچے کو لے گیا ہے، دوسری عورت نے کہا کہ وہ تو تیرا بچہ لے گیا ہے۔ وہ دونوں عورتیں اپنا مقدمہ داؤد علیہ السلام کے پاس لائیں تو آپ نے فیصلہ بڑی کے حق میں کر دیا۔ وہ دونوں نکل کر سلیمان بن داؤد علیہما السلام کے پاس گئیں اور انہیں واقعہ کی اطلاع دی۔ سلیمان علیہ السلام نے کہا کہ چھری لاؤ میں لڑکے کے دو ٹکڑے کر کے دونوں کو ایک ایک دوں گا۔ اس پر چھوٹی عورت بول اٹھی کہ ایسا نہ کیجئے آپ پر اللہ رحم کرے، یہ بڑی ہی کا لڑکا ہے لیکن آپ علیہ السلام نے فیصلہ چھوٹی عورت کے حق میں کیا۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ واللہ! میں نے «سكين» چھری کا لفظ سب سے پہلی مرتبہ ( نبی کریم صلی اللہ علیہ وسلم کی زبان سے ) اس دن سنا تھا اور ہم اس کے لیے ( اپنے قبیلہ میں ) «مدية‏.‏» کا لفظ بولتے تھے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Deux femmes étaient ensemble avec leurs deux fils. Un loup est venu et a emporté le fils de l’une d’elles. Cette femme a dit à sa compagne : “Le loup a pris ton fils.” L’autre a répondu : “Non, c’est ton fils qu’il a pris.” Elles ont donc demandé le jugement du Prophète David, qui a décidé que l’enfant devait être donné à la femme la plus âgée. Ensuite, elles sont allées voir le Prophète Salomon, fils de David, et lui ont expliqué la situation. Salomon a dit : “Apportez-moi un couteau pour que je coupe l’enfant en deux et que j’en donne une moitié à chacune.” La plus jeune a dit : “Ne fais pas cela, qu’Allah te bénisse ! C’est son enfant.” Alors il a donné l’enfant à la plus jeune. » Abu Huraira a ajouté : Par Allah ! Je n’avais jamais entendu le mot « Sakkin » pour dire couteau, sauf ce jour-là, car nous l’appelions « Mudya »",
          "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] mengatakan; telah menceritakan kepada kami [Abu Az Zanad] dari [Abdurrahman] dari [Abu Hurairah] radliallahu 'anhu, bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dahulu ada dua wanita bersama kedua anaknya. Seekor serigala datang dan memangsa salah satu dari kedua anak tersebut. Wanita pertama mengatakan; 'Serigala itu memangsa anakmu'. Wanita kedua mengatakan; 'Justeru serigala itu memangsa anakmu, bukan anakku.' Kedua wanita itu terus mengadukan perkaranya kepada Dawud 'alaihissalam, dan Dawud memutuskan bahwa bayi yang masih adalah milik wanita yang tua. Kemudian keduanya menemui Sulaiman alaihissalam dan menceritakan kisahnya. Sulaiman mengatakan; 'beri aku pisau, bayi ini akan kubelah menjadi dua, satu untukmu dan satu untukmu! ' Wanita yang muda berkata; 'jangan kau lakukan, kiranya Allah merahmatimu, bayi ini miliknya.' Maka Sulaiman memberikan bayi itu kepada wanita yang muda.\" Abu Hurairah mengatakan; 'Demi Allah, saya tak pernah mendengar istilah pisau sama sekali selain hari itu, sebab istilah yang sering kami pakai adalah 'golok",
          "tr": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"İki kadın ve kadınların beraberinde iki oğlan çocukları vardı. Bir kurt geldi ve bunlardan birisinin oğlunu kapıp götürdü. Bunun üzerine kadın diğer kadına \"Kurt senin çocuğunu götürdü\" dedi. Diğeri de \"Hayır, kurt senin çocuğunu götürdü\" dedi. Nihayet bu iki kadın davalarını Hz. Dauud Nebie arzettiler. O da aralarında büyük kadının lehine hükmetti. Bu iki kadın çıkıp Davud'un oğlu Süleyman Nebi Sallallahu Aleyhi ve Sellem'e gittiler ve davalarına yeniden baktırmak için meseleyi ona haber verdiler. Süleyman Nebi a.s.: \"Bana bir bıçak getirin, çocuğu iki kadın arasında yarıp paylaştırayım\" dedi. Bunun üzerine küçük kadın 'Aman öyle yapma! Allah sana merhamet etsin! Çocuk bu kadının oğludur\" deyince, Süleyman da çocuğun küçük kadına ait olduğuna hükmetti. Ebu Hureyre \"VAllahi ben o güne kadar 'sikkiyn' kelimesini asla duymamıştım. Ancak o gün işittim. Bizler sadece \"müdye\" kelimesini kullanırdık\" demiştir. Fethu'l-Bari Açıklaması: İmam Buhari, her biri bir oğlana sahip olup, bunlardan birini kurt kapınca, onun hangisi olduğu yolunda ihtilaf eden, sonra anlaşmazlıklarını Davud Nebi s.a.v.'e arz edip, ardından Süleyman Nebi s.a.v.'in hüküm verdiği bu iki kadının kıssasına yer vermiştir. Bu hadisin açıklaması Enbiya bölümünde Süleyman'ın aleyhisselam hayatı verilirken genişçe geçmişti. İbn Battal şöyle demiştir: Fıkıh bilginleri, kadının çocuğunun nesebini onu inkar eden kocasına veremeyeceği noktasında görüş birliği etmişlerdir. Kadın bu konuda herhangi bir beyyine getirebilirse bu kabul edilir. Çünkü kadın o erkeğin nikahı altındadır. Buna karşılık evli değilse ve babasının kim olduğu bilinmeyen bir çocuk için \"Bu benim oğlumdur\" deyip, bu konuda kendisiyle hiç kimse çekişmeye girmezse kadının ifadesine göre hareket edilir. Kadın o çocuğa, çocuk da ona mirasçı olur. Ayrıca o çocuğun ana bir kardeşleri de kendisine mirasçı olur. Ancak İbnü't-Tın, İbn Battal'a itiraz etmiş ve İbnü'l-Kasım'dan bir kadın buluntu çocuğun nesebinin kendine ait olduğunu iddia ettiğinde, sözünün kabuledilemeyeceğine dair bir görüş nakletmiştir. Nesai, es-Sünenü'l-Kübra'da bu hadisten çok nefis sonuçlar çıkarmış ve şöyle bir başlık atmıştır: \"Hakimin kendisi gibi veya kendisinden daha yüksek mertebede bir başkasının verdiği hükmü -durum bunu gerektirdiğinde- bozması"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 45
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 6770,
      "arabicNumber": 6770,
      "book": 85,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَىَّ مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ فَقَالَ ‏ \"‏ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ بْنِ زَيْدٍ، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Allah's Messenger (ﷺ) once entered upon me in a very happy mood, with his features glittering with joy, and said, \"O `Aisha! won't you see that Mujazziz (a Qa'if) looked just now at Zaid bin Haritha and Usama bin Zaid and said, 'These feet (of Usama and his father) belong to each other.\" (See Hadith No. 755, Vol)",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم میرے یہاں ایک مرتبہ بہت خوش خوش تشریف لائے۔ آپ صلی اللہ علیہ وسلم کا چہرہ چمک رہا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم نے نہیں دیکھا، مجزز ( ایک قیافہ شناس ) نے ابھی ابھی زید بن حارثہ اور اسامہ بن زید رضی اللہ عنہما کے ( صرف پاؤں دیکھے ) اور کہا کہ یہ پاؤں ایک دوسرے سے تعلق رکھتے ہیں۔“",
          "fr": "Rapporté par `Aisha : Un jour, le Messager d’Allah (ﷺ) est entré chez moi, très joyeux, son visage rayonnant de bonheur, et il a dit : « Ô `Aisha ! Sais-tu que Mujazziz (un Qa’if) vient de regarder Zaid bin Haritha et Usama bin Zaid, et il a dit : “Ces pieds (d’Usama et de son père) se ressemblent.” »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] radliallahu 'anha mengatakan; Rasulullah Shallallahu'alaihiwasallam menemui kami dengan keceriaan wajahnya yang bersinar, lantas beliau bersabda: \"Tidakkah tadi engkau lihat, bahwa Mujazzaz memandang Zaid bin haritsah dan Usamah bin Zaid?\" beliau bersabda: \"Sesungguhnya telapak kaki-telapak kaki ini merupakan bagian satu dengan yang lainnya",
          "tr": "Aişe r.anha şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem sevinmiş olarak ve yüz çizgileri parlar bir halde yanıma geldi ve bana şöyle dedi: \"Görmedin mi biraz önce (kaif) Mücezziz, Zeyd b. Harise ile Usame b. Zeyd'e baktı da 'muhakkak bu ayaklar birbirinden olmadır' dedi.\" :"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 46
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 6771,
      "arabicNumber": 6771,
      "book": 85,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَهْوَ مَسْرُورٌ فَقَالَ ‏ \"‏ يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ فَرَأَى أُسَامَةَ وَزَيْدًا وَعَلَيْهِمَا قَطِيفَةٌ، قَدْ غَطَّيَا رُءُوسَهُمَا وَبَدَتْ أَقْدَامُهُمَا، فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Once Allah's Messenger (ﷺ) entered upon me and he was in a very happy mood and said, \"O `Aisha: Don't you know that Mujazziz Al-Mudliji entered and saw Usama and Zaid with a velvet covering on them and their heads were covered while their feet were uncovered. He said, 'These feet belong to each other",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے زہری نے بیان کیا، ان سے عروہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے، آپ صلی اللہ علیہ وسلم بہت خوش تھے اور فرمایا ”عائشہ! تم نے دیکھا نہیں، مجزز مدلجی آیا اور اس نے اسامہ اور زید ( رضی اللہ عنہما ) کو دیکھا، دونوں کے جسم پر ایک چادر تھی، جس نے دونوں کے سروں کو ڈھک لیا تھا اور ان کے صرف پاؤں کھلے ہوئے تھے تو اس نے کہا کہ یہ پاؤں ایک دوسرے سے تعلق رکھتے ہیں۔“",
          "fr": "Rapporté par `Aisha : Un jour, le Messager d’Allah (ﷺ) est entré chez moi, très heureux, et il a dit : « Ô `Aisha : Sais-tu que Mujazziz Al-Mudliji est entré et a vu Usama et Zaid couverts d’un tissu de velours, la tête cachée mais les pieds découverts ? Il a dit : “Ces pieds se ressemblent.” »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Urwah] dari [Aisyah] mengatakan; Rasulullah Shallallahu'alaihi wa sallam suatu hari menemui kami dengan ceria, lantas beliau berujar: \"Wahai Aisyah, tidakkah engkau lihat Mujazzaz Al Madlaji menemuiku lantas ia memandang Usamah bin Zaid dan Zaid yang sedang berselimut, tertutup kedua kepalanya, dan terlihat telapak kaki keduanya?\" Lantas beliau bersabda: \"sesungguhnya telapak kaki-telapak kaki merupakan bagian satu dengan yang lainnya",
          "tr": "Aişe r.anha şöyle demiştir: Bir gün Resulullah Sallallahu Aleyhi ve Sellem sevinçli olarak adama girdi ve şöyle buyurdu: \"Ya Aişe! Görmedin mi? (kaif) Müdlic kabilesinden olan Mücezziz yanıma geldi de Usame ile oğlu Zeyd'i gördü. Onların üzerinde bir kadife vardı. Kadife ile başlarını örtmüşlerdi de ayaklan açıkta idi. Mücezziz 'şüphe yok ki bu ayaklar birbirinden olmadır' dedi.\" Fethu'l-Bari Açıklaması: \"Kaif\", benzerliği anlayan ve izleri birbirinden ayıran kimsedir. Ona kaif denmesi birtakım belirtileri ve izleri araştırmasındandır. Kelime \"el-kafi\" kelimesinden çevrilmiş gibidir. Müslim'de, Ma'mer ve İbn Cüreye'in nakillerine göre Zühri \"Müeezziz kaifti\" demişti. Müeezziz'in künyesi İbnü'l-A'ver b. Ca'de el-Müdlici olup, Müdlie b. Murre b. Abd Menaf b. Kinane'ye mensuptur. Kaifler, Kinane ve Esed oğullarına mensuptu. Araplar onların bu mesleklerini kabul ediyorlardı. Sahih olan görüşe göre kaiflik sadece onlara mahsus değildi. Hadiste geçen \"l4'{rl2;\" cümlesi, az önce veya çok kısa bir zaman önce baktı demektir. Hadisten çıkan sonuçlar: 1. Yüzü örtülü bir kadının aleyhine şahitlik etmek caizdir ve yüzünü görmeksizin onu tanımış olmak yeterlidir. 2.Bir erkek aynı örtü altında oğluyla birlikte yatabilir. 3. Şaibe olmadığı takdirde şahitliğine başvurulmadan önce bir kimsenin şahitliği kabul edilebilir. 4. Bir hakimin heva ve heves sözkonusu olmaksızın davalı veya davacı lehine gerçeğin ortaya çıkmış olmasından dolayı sevinmesi caizdir. (Bir uyan:) Bu hadisin Feraiz kitabına alınması kaifin görüşüne itibar yoktur iddiasında bulunanlara bir red içindir. Çünkü kaifin görüşüne itibar edip, gereğine göre amel eden kimse, nesep verilen çocukla, nesebine katılan baba arasında miras cereyan edeceğini kabul etmek zorundadır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 85,
        "hadith": 47
      },
      "narrator": {
        "en": "`Aisha"
      }
    }
  ],
  "metadata": {
    "averageLength": "medium",
    "size": "29KB"
  }
}