{
  "collection": "bukhari",
  "book": 9,
  "name": {
    "arabic": "كتاب Times of the Prayers",
    "transliteration": "times of the salah",
    "translation": "Times of the Prayers"
  },
  "totalHadith": 77,
  "hadithNumberRange": {
    "first": 522,
    "last": 602
  },
  "content": [
    {
      "hadithNumber": 522,
      "arabicNumber": 522,
      "book": 9,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا، فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ، فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهْوَ بِالْعِرَاقِ، فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏ \"‏ بِهَذَا أُمِرْتُ ‏\"‏‏.‏ فَقَالَ عُمَرُ لِعُرْوَةَ اعْلَمْ مَا تُحَدِّثُ أَوَإِنَّ جِبْرِيلَ هُوَ أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ‏.‏ قَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ يُحَدِّثُ عَنْ أَبِيهِ‏.‏ قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ، وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ‏.‏",
        "translations": {
          "en": "Narrated Ibn Shihab:Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair went to him and said, \"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him and said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer (Fajr prayer) and Allah's Messenger (ﷺ) prayed too, then he prayed again (Zuhr prayer) and so did Allah's Apostle and again he prayed (`Asr prayers and Allah's Messenger (ﷺ) did the same; again he prayed (Maghrib-prayer) and so did Allah's Messenger (ﷺ) and again prayed (`Isha prayer) and so did Allah's Apostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" `Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Messenger (ﷺ) at the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud narrated like this on the authority of his father.\" `Urwa added, \"Aisha told me that Allah's Messenger (ﷺ) used to pray `Asr prayer when the sunshine was still inside her residence (during the early time of `Asr)",
          "fr": "Rapporté par Ibn Shihab : Un jour, `Umar bin `Abdul `Aziz a retardé la prière et `Urwa bin Az-Zubair est allé le voir et lui a dit : « Un jour en Irak, Al-Mughira bin Shu`ba avait aussi retardé ses prières, et Abi Mas`ud Al-Ansari est allé le voir et lui a dit : Ô Mughira ! Qu’est-ce que c’est ? Ne sais-tu pas qu’un jour, Gabriel est venu et a fait la prière (Fajr), et Allah's Messager (ﷺ) a prié aussi, puis il a prié de nouveau (Zuhr) et Allah's Messager (ﷺ) a fait de même, puis encore (`Asr) et Allah's Messager (ﷺ) a fait pareil ; encore (Maghrib) et Allah's Messager (ﷺ) a fait pareil, puis encore (`Isha) et Allah's Messager (ﷺ) a fait pareil, et (Gabriel) a dit : J’ai reçu l’ordre de faire ainsi (pour vous montrer les prières prescrites). » `Umar (bin `Abdul `Aziz) a dit à `Urwa : « Sois sûr de ce que tu dis. Est-ce que Gabriel a dirigé la prière pour Allah's Messager (ﷺ) aux heures précises ? » `Urwa a répondu : « Bashir bin Abi Mas`ud a rapporté cela de la part de son père. » `Urwa a ajouté : « Aïcha m’a dit qu’Allah's Messager (ﷺ) faisait la prière de `Asr alors que le soleil éclairait encore sa maison (c’est-à-dire au début de l’heure de `Asr). »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] berkata; Aku membacakannya di hadapan [Malik] dari [Ibnu Syihab] bahwa 'Umar bin 'Abdul 'Aziz pada suatu hari mengakhirkan pelaksanaan shalat. Kemudian ['Urwah bin Az Zubair] datang menemuinya dan mengabarkan kepadanya bahwa Al Mughirah bin Syu'bah pada suatu hari juga pernah mengakhirkan shalat, dan saat itu dia tinggal di 'Irak. Kemudian [Abu Mas'ud Al Anshari] datang menemuinya seraya berkata, \"Apa yang kamu lakukan ini wahai Al Mughirah? Bukankah kamu telah mengetahui bahwa Malaikat Jibril shallallahu 'alaihi wasallam pernah turun kemudian melaksanakan shalat, kemudian Rasulullah shallallahu 'alaihi wasallam juga ikut melaksanakan shalat? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril berkata, \"Inilah waktu-waktu yang diperintahkan kepadaku (agar engkau melaksanakannya).\" 'Umar lalu berkata kepada 'Urwah, \"Ketahuilah apa yang kamu ceritakan! Sesungguhnya Jibril datang untuk menjelaskan kepada Rasulullah shallallahu 'alaihi wasallam tentang waktu-waktu shalat.\" 'Urwah berkata, \"Begitulah adanya. bahwasanya [Basyir bin Abu Mas'ud] menceritakan dari [Bapaknya]. Urwah berkata, \" [Aisyah] menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan shalat 'Ashar, sementara cahaya matahari yang ada dalam kamarnya belum nampak",
          "tr": "İbn Şihâb'dan şöyle nakledilmiştir: Bir gün Ömer bin Abdülaziz, namazı geç vakte bıraktı. Bu esnada Urve İbn Zubeyr yanına geldi ve ona şu olayı haber verdi: Muğire bin Şu'be Irak'ta iken bir defasında namazı geciktirdi. Derken Ebu Mes'ud el-Ensârî yanına geldi ve ona şöyle çıkıştı: \"Ey Muğire bu yaptığın da ne! Bilmiyor musun ki, Cebrail indi ve namaz kıldı. Peşi sıra Allah Resulü Sallallahu Aleyhi ve Sellem namaz kıldı. Cebrail bir kez daha namaz kıldı, peşi sıra Allah Resulü de namaz kıldı. Cebrail yine namaz kıldı, peşi sıra Allah Resulü de namaz kıldı. Cebrail bir daha namaz kıldı, peşi sıra Allah Resulü de, namaz kıldı. Cebrail bir defa daha namaz kıldı, peşi sıra Allah Resulü de, namaz kıldı. Sonra melek Nebi Sallallahu Aleyhi ve Sellem'e: Sana bu şekilde namaz kıldırmakla emrolundum dedi. Ömer bin Abdülaziz Urveye, 'Anlattığının ne manaya geldiğini bil! Rasulullah'a namaz vakitlerini bizzat Cebrail mi öğretmiş?\" dedi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 1
      },
      "narrator": {
        "en": "Ibn Shihab"
      }
    },
    {
      "hadithNumber": 523,
      "arabicNumber": 523,
      "book": 9,
      "hadithInBook": 2,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبَّادٌ ـ هُوَ ابْنُ عَبَّادٍ ـ عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا إِنَّا مِنْ هَذَا الْحَىِّ مِنْ رَبِيعَةَ، وَلَسْنَا نَصِلُ إِلَيْكَ إِلاَّ فِي الشَّهْرِ الْحَرَامِ، فَمُرْنَا بِشَىْءٍ نَأْخُذْهُ عَنْكَ، وَنَدْعُو إِلَيْهِ مَنْ وَرَاءَنَا‏.‏ فَقَالَ ‏ \"‏ آمُرُكُمْ بِأَرْبَعٍ، وَأَنْهَاكُمْ عَنْ أَرْبَعٍ الإِيمَانِ بِاللَّهِ ـ ثُمَّ فَسَّرَهَا لَهُمْ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنِّي رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَأَنْ تُؤَدُّوا إِلَىَّ خُمُسَ مَا غَنِمْتُمْ، وَأَنْهَى عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُقَيَّرِ وَالنَّقِيرِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:\"Once a delegation of `Abdul Qais came to Allah's Messenger (ﷺ) and said, \"We belong to such and such branch of the tribe of Rabi'ah and we can only come to you in the sacred months. Order us to do something good so that we may take it from you and also invite to it those whom we have left behind (at home).\" So he said, \"I order you to do four things and forbid you from four things: To believe in Allah\" - and then he explained it to them \"to testify that none has the right to be worshipped but Allah and that I am Allah's Messenger (ﷺ), to establish the prayers (at the stated times), to pay the Zakat (obligatory charity), to hand me the Khumus (fifth) if you acquire spoils of war. And I forbid from (using) Dubba, Hantam, Muqaiyyar, and Naqir (all these were utensils used for the preparation of alcoholic drinks)",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عباد بن عباد بصریٰ نے، اور یہ عباد کے لڑکے ہیں، ابوجمرہ (نصر بن عمران) کے ذریعہ سے، انہوں نے ابن عباس رضی اللہ عنہما سے، انہوں نے کہا کہ عبدالقیس کا وفد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا کہ ہم اس ربیعہ قبیلہ سے ہیں اور ہم آپ صلی اللہ علیہ وسلم کی خدمت میں صرف حرمت والے مہینوں ہی میں حاضر ہو سکتے ہیں، اس لیے آپ صلی اللہ علیہ وسلم کسی ایسی بات کا ہمیں حکم دیجیئے، جسے ہم آپ صلی اللہ علیہ وسلم سے سیکھ لیں اور اپنے پیچھے رہنے والے دوسرے لوگوں کو بھی اس کی دعوت دے سکیں، آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں چار چیزوں کا حکم دیتا ہوں اور چار چیزوں سے روکتا ہوں، پہلے اللہ پر ایمان لانے کا، پھر آپ صلی اللہ علیہ وسلم نے اس کی تفصیل بیان فرمائی کہ اس بات کی شہادت دینا کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ میں اللہ کا رسول ہوں، اور دوسرے نماز قائم کرنے کا، تیسرے زکوٰۃ دینے کا، اور چوتھے جو مال تمہیں غنیمت میں ملے، اس میں سے پانچواں حصہ ادا کرنے کا اور تمہیں میں تونبڑی حنتم، قسار اور نقیر کے استعمال سے روکتا ہوں۔ ( نوٹ: یہ تمام برتن شراب بنانے کے لیے استعمال ہوتے تھے ) ۔",
          "fr": "Rapporté par Ibn `Abbas : Un jour, une délégation de `Abdul Qais est venue voir Allah's Messager (ﷺ) et a dit : « Nous appartenons à telle branche de la tribu de Rabi'ah et nous ne pouvons venir te voir que pendant les mois sacrés. Ordonne-nous quelque chose de bien afin que nous puissions l’apprendre de toi et inviter aussi ceux que nous avons laissés chez nous. » Il a dit : « Je vous ordonne quatre choses et je vous en interdis quatre autres : Croire en Allah » – puis il leur a expliqué – « témoigner qu’il n’y a de divinité digne d’adoration qu’Allah et que je suis le Messager d’Allah (ﷺ), accomplir la prière aux heures prescrites, donner la Zakat (aumône obligatoire), et me remettre le Khumus (cinquième) si vous obtenez un butin de guerre. Et je vous interdis (d’utiliser) Dubba, Hantam, Muqaiyyar et Naqir (qui étaient tous des récipients utilisés pour préparer des boissons alcoolisées). »",
          "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami ['Abbad] -yaitu Ibnu 'Abbad- dari [Abu Hamzah] dari [Ibnu 'Abbas] berkata, \"Utusan 'Abdul Qais datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Sesungguhnya kami dari suku Rabi'ah, dan kami tidak dapat mengunjungi tuan kecuali pada bulan haram. Maka perintahlah kepada kami dengan sesuatu yang kami ambil dari tuan dan dapat kami sampaikan kepada penduduk kami. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Aku perintahkan kalian dengan empat perkara dan aku larang dari empat perkara; Iman kepada Allah. Lalu Nabi shallallahu 'alaihi wasallam menjelaskan kepada mereka; yaitu persaksian bahwa tidak ada Tuhan yang berhak disembah selain Allah dan Muhammad adalah utusan Allah, menegakkan shalat, menunaikan zakat, pusa Ramadan dan kalian kelurakan seperlima dari harta rampasan perang. Dan aku larang kalian dari Ad Duba`, Al Hantam, Al Muqayyar dan An Naqir",
          "tr": "(Ebu Cemre İbn Abbâs'tan şöyle nakletmiştir: \"Abdulkaysoğullarının heyeti, Allah Rasûlü'ne gelip: 'Biz Rabîa' kabilesinin bir koluyuz. Buraya ancak haram aylarda gelebiliriz. O halde bize öyle şeyler emret ki, onlara tutunalım ve buraya gelmeyen kabilemiz mensubu kimseleri buna davet edelim' dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Size şu dört şeyi emrediyorum: a) Allah'a iman. (Allah Resulü bunu şöylece açtklamıştır:) Yani, Allah'tan başka ilâh olmadığına ve benim Allah'ın elçisi olduğuma şehadet etmek. b) Namaz kılmak. c) Zekat vermek. d) Ganimet olarak elde ettiklerinizin beşte birini bana vermek. Şu dört şeyi de size yasaklıyorum: a) Dübâ: Su kabağı b) Hantem: Sırlı küp c) Mukayyar ziftli kap. d) Nakîr: Hurma ağacı kütüğünden oyularak yapılan kap"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 2
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 524,
      "arabicNumber": 524,
      "book": 9,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا قَيْسٌ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
        "translations": {
          "en": "Narrated Jarir bin `Abdullah:I gave the pledge of allegiance to Allah's Messenger (ﷺ) for to offer prayers perfectly, to pay Zakat regularly, and to give good advice to every Muslim",
          "ur": "ہم سے محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے کہا کہ ہم سے اسماعیل بن ابی خالد نے بیان کیا، انہوں نے کہا کہ ہم سے قیس بن ابی حازم نے جریر بن عبداللہ رضی اللہ عنہ کی روایت سے بیان کیا کہ جریر بن عبداللہ بجلی رضی اللہ عنہ نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے دست مبارک پر نماز قائم کرنے، زکوٰۃ دینے، اور ہر مسلمان کے ساتھ خیر خواہی کرنے پر بیعت کی۔",
          "fr": "Rapporté par Jarir bin `Abdullah : J’ai prêté serment d’allégeance à Allah's Messager (ﷺ) pour accomplir parfaitement la prière, donner régulièrement la Zakat, et donner de bons conseils à chaque musulman",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] berkata, telah menceritakan kepada kami [Yahya] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada kami [Qais] dari [Jarir bin 'Abdullah] berkata, \"Aku membai'at Rasulullah shallallahu 'alaihi wasallam untuk menegakkan shalat, menunaikan zakat dan untuk setia kepada setiap Muslim",
          "tr": "Cerîr bin Abdullah (r.a.)'ın şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'e namazı kılmak, zekatı vermek ve her müslümana nasihat etmek üzere biat ettim. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 3
      },
      "narrator": {
        "en": "Jarir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 525,
      "arabicNumber": 525,
      "book": 9,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ سَمِعْتُ حُذَيْفَةَ، قَالَ كُنَّا جُلُوسًا عِنْدَ عُمَرَ ـ رضى الله عنه ـ فَقَالَ أَيُّكُمْ يَحْفَظُ قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْفِتْنَةِ قُلْتُ أَنَا، كَمَا قَالَهُ‏.‏ قَالَ إِنَّكَ عَلَيْهِ ـ أَوْ عَلَيْهَا ـ لَجَرِيءٌ‏.‏ قُلْتُ ‏ \"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَوَلَدِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصَّوْمُ وَالصَّدَقَةُ وَالأَمْرُ وَالنَّهْىُ ‏\"‏‏.‏ قَالَ لَيْسَ هَذَا أُرِيدُ، وَلَكِنِ الْفِتْنَةُ الَّتِي تَمُوجُ كَمَا يَمُوجُ الْبَحْرُ‏.‏ قَالَ لَيْسَ عَلَيْكَ مِنْهَا بَأْسٌ يَا أَمِيرَ الْمُؤْمِنِينَ، إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا‏.‏ قَالَ أَيُكْسَرُ أَمْ يُفْتَحُ قَالَ يُكْسَرُ‏.‏ قَالَ إِذًا لاَ يُغْلَقَ أَبَدًا‏.‏ قُلْنَا أَكَانَ عُمَرُ يَعْلَمُ الْبَابَ قَالَ نَعَمْ، كَمَا أَنَّ دُونَ الْغَدِ اللَّيْلَةَ، إِنِّي حَدَّثْتُهُ بِحَدِيثٍ لَيْسَ بِالأَغَالِيطِ‏.‏ فَهِبْنَا أَنْ نَسْأَلَ حُذَيْفَةَ، فَأَمَرْنَا مَسْرُوقًا فَسَأَلَهُ فَقَالَ الْبَابُ عُمَرُ‏.‏",
        "translations": {
          "en": "Narrated Shaqiq:that he had heard Hudhaifa saying, \"Once I was sitting with `Umar and he said, 'Who amongst you remembers the statement of Allah's Messenger (ﷺ) about the afflictions?' I said, 'I know it as the Prophet (ﷺ) had said it.' `Umar said, 'No doubt you are bold.' I said, 'The afflictions caused for a man by his wife, money, children and neighbor are expiated by his prayers, fasting, charity and by enjoining (what is good) and forbidding (what is evil).' `Umar said, 'I did not mean that but I asked about that affliction which will spread like the waves of the sea.' I (Hudhaifa) said, 'O leader of the faithful believers! You need not be afraid of it as there is a closed door between you and it.' `Umar asked, Will the door be broken or opened?' I replied, 'It will be broken.' `Umar said, 'Then it will never be closed again.' I was asked whether `Umar knew that door. I replied that he knew it as one knows that there will be night before the tomorrow morning. I narrated a Hadith that was free from any misstatement\" The subnarrator added that they deputized Masruq to ask Hudhaifa (about the door). Hudhaifa said, \"The door was `Umar himself",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے اعمش کی روایت سے بیان کیا، اعمش (سلیمان بن مہران) نے کہا کہ مجھ سے شقیق بن مسلمہ نے بیان کیا، شقیق نے کہا کہ میں نے حذیفہ بن یمان رضی اللہ عنہ سے سنا۔ حذیفہ رضی اللہ عنہ نے فرمایا کہ ہم عمر رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے کہ آپ نے پوچھا کہ فتنہ سے متعلق رسول اللہ صلی اللہ علیہ وسلم کی کوئی حدیث تم میں سے کسی کو یاد ہے؟ میں بولا، میں نے اسے ( اسی طرح یاد رکھا ہے ) جیسے نبی کریم صلی اللہ علیہ وسلم نے اس حدیث کو بیان فرمایا تھا۔ عمر رضی اللہ عنہ بولے، کہ تم رسول اللہ صلی اللہ علیہ وسلم سے فتن کو معلوم کرنے میں بہت بےباک تھے۔ میں نے کہا کہ انسان کے گھر والے، مال اولاد اور پڑوسی سب فتنہ ( کی چیز ) ہیں۔ اور نماز، روزہ، صدقہ، اچھی بات کے لیے لوگوں کو حکم کرنا اور بری باتوں سے روکنا ان فتنوں کا کفارہ ہیں۔ عمر رضی اللہ عنہ نے فرمایا کہ میں تم سے اس کے متعلق نہیں پوچھتا، مجھے تم اس فتنہ کے بارے میں بتلاؤ جو سمندر کی موج کی طرح ٹھاٹھیں مارتا ہوا بڑھے گا۔ اس پر میں نے کہا کہ یا امیرالمؤمنین! آپ اس سے خوف نہ کھائیے۔ آپ کے اور فتنہ کے درمیان ایک بند دروازہ ہے۔ پوچھا کیا وہ دروازہ توڑ دیا جائے گا یا ( صرف ) کھولا جائے گا۔ میں نے کہا کہ توڑ دیا جائے گا۔ عمر رضی اللہ عنہ بول اٹھے، کہ پھر تو وہ کبھی بند نہیں ہو سکے گا۔ شقیق نے کہا کہ ہم نے حذیفہ رضی اللہ عنہ سے پوچھا، کیا عمر رضی اللہ عنہ اس دروازہ کے متعلق کچھ علم رکھتے تھے تو انہوں نے کہا کہ ہاں! بالکل اسی طرح جیسے دن کے بعد رات کے آنے کا۔ میں نے تم سے ایک ایسی حدیث بیان کی ہے جو قطعاً غلط نہیں ہے۔ ہمیں اس کے متعلق حذیفہ رضی اللہ عنہ سے پوچھنے میں ڈر ہوتا تھا ( کہ دروازہ سے کیا مراد ہے ) اس لیے ہم نے مسروق سے کہا ( کہ وہ پوچھیں ) انہوں نے دریافت کیا تو آپ نے بتایا کہ وہ دروازہ خود عمر رضی اللہ عنہ ہی تھے۔",
          "fr": "Rapporté par Shaqiq : Il a entendu Hudhaifa dire : Un jour, j’étais assis avec `Umar et il a dit : « Qui parmi vous se souvient de la parole d’Allah's Messager (ﷺ) à propos des épreuves ? » J’ai dit : « Je la connais comme le Prophète (ﷺ) l’a dite. » `Umar a dit : « Tu es vraiment audacieux. » J’ai dit : « Les épreuves causées à un homme par sa femme, son argent, ses enfants et son voisin sont effacées par ses prières, son jeûne, ses aumônes et le fait d’ordonner le bien et d’interdire le mal. » `Umar a dit : « Ce n’est pas de cela que je parlais, mais de cette épreuve qui se répandra comme les vagues de la mer. » J’ai dit : « Ô chef des croyants ! Tu n’as pas à en avoir peur, car il y a une porte fermée entre toi et elle. » `Umar a demandé : « Cette porte sera-t-elle brisée ou ouverte ? » J’ai répondu : « Elle sera brisée. » `Umar a dit : « Alors elle ne sera jamais refermée. » On m’a demandé si `Umar savait ce qu’était cette porte. J’ai répondu qu’il le savait aussi sûrement que l’on sait qu’il y aura la nuit avant le matin. J’ai rapporté un hadith sans aucune erreur. » Le sous-narrateur a ajouté qu’ils ont chargé Masruq de demander à Hudhaifa ce qu’était la porte. Hudhaifa a dit : « La porte, c’était `Umar lui-même. »",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Al A'masy] berkata, telah menceritakan kepadaku [Syaqiq] berkata, Aku pernah mendengar [Hudzaifah] berkata, \"Kami pernah bermajelis bersama 'Umar, lalu ia berkata, \"Siapa di antara kalian yang masih ingat sabda Rasulullah shallallahu 'alaihi wasallam tentang masalah fitnah? ' Aku lalu menjawab, 'Aku masih ingat seperti yang beliau sabdakan! ' 'Umar bertanya, \"Kamu dengar dari beliau atau kamu mendengar perkataan itu dari orang lain?\" Aku menjawab, 'Yaitu fitnah seseorang dalam keluarganya, harta, anak dan tetangganya. Dan fitnah itu akan terhapus oleh amalan shalat, puasa, sedekah, amar ma'ruf dan nahi munkar.\" 'Umar berkata, \"Bukan itu yang aku mau. Tapi fitnah yang dahsyat seperti dahsyatnya air laut.\" Hudzaifah berkata, \"Wahai Amirul Mukminin, sesungguhnya fitnah itu tidak akan membahayakan engkau! antara engkau dengannya terhalang oleh pintu yang tertutup.\" 'Umar bertanya; \"Pintu yang rusak atau terbuka?\" Hudzaifah menjawab, \"Rusak.\" 'Umar pun berkata, \"Kalau begitu tidak akan bisa ditutup selamanya! ' Kami (perawi) bertanya, \"Apakah 'Umar mengerti pintu yang dimaksud?\" Hudzaifah menjawab, \"Ya. Sebagaimana mengertinya dia bahwa setelah pagi adalah malam hari. Aku telah menceritakan kepadanya suatu hadits yang tidak ada kerancuannya.\" Namun kami takut untuk bertanya kepada Hudzaifah, lalu aku suruh Masruq untuk, lalu ia pun menanyakannya kepadanya. Hudzaifah lalu menjawab, \"Pintu itu adalah Umar",
          "tr": "A'meş, Şakîk kanalıyla Huzeyfe'nin şöyle dediğini nakletmiştir: \"Ömer (r.a.)'in yanında oturuyorduk. Bize: 'Hanginiz Rasulullah Sallallahu Aleyhi ve Sellem'in fitne hakkında söylediğini hafızasında tutuyor?' diye sordu. 'Ben. Hem de nasıl buyurmuşsa öylece aklımda tutuyorum' diye atıldım. Bu konuda çok cesursun' dedi. Fitne hakkındaki Kişi'nin ailesi, malı, çocuğu ve komşusu hakkında bulaşacağı fitneye (günaha) kıldığı namaz, tuttuğu oruç, verdiği zekat ve yaptığı emri bi'l-ma'ruf nehy ani'l-münker keffâret olur.' Hadisini söyledim. Ömer (r.a.): 'Bunu kasdetmemiştim. Denizin dalgalanması gibi kabaracak fitneyi kast etmiştim' dedi. Ben de: 'O fitne, sana zarar vermeyecek. Seninle onun arasında kapalı bir kapı var\" diye cevap verdim. Ömer (r.a.),: 'O kapı açılacak mı, yoksa kırılacak mı?' diye sordu. Ben de: 'Kırılacak' dedim. Bu defa: 'O zaman bir daha asla kapanmayacak' dedi. Biz, 'Ömer kapıyı biliyor muydu?' diye sorduk. Huzeyfe, 'Evet, tıpkı önceki gün, bu geceyi bildiği gibi biliyordu. O'na söylediklerimde hiç yalan yoktu' diye cevap verdi. Kapının kim olduğunu Huzeyfe'ye sormaktan çekindik. Bu yüzden Mesrûk'a gidip sormasını emrettik. O da sordu. Huzeyfe şöyle cevap verdi: Kapı Ömer'dir. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 4
      },
      "narrator": {
        "en": "Shaqiq"
      }
    },
    {
      "hadithNumber": 526,
      "arabicNumber": 526,
      "book": 9,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَجُلاً، أَصَابَ مِنَ امْرَأَةٍ قُبْلَةً، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ، فَأَنْزَلَ اللَّهُ ‏{‏أَقِمِ الصَّلاَةَ طَرَفَىِ النَّهَارِ وَزُلَفًا مِنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ‏}‏‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ أَلِي هَذَا قَالَ ‏\"‏ لِجَمِيعِ أُمَّتِي كُلِّهِمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn Mas`ud:A man kissed a woman (unlawfully) and then went to the Prophet (ﷺ) and informed him. Allah revealed: And offer prayers perfectly At the two ends of the day And in some hours of the night (i.e. the five compulsory prayers). Verily! good deeds remove (annul) the evil deeds (small sins) (11.114). The man asked Allah's Messenger (ﷺ), \"Is it for me?\" He said, \"It is for all my followers",
          "ur": "ہم سے قتیبہ نے بیان کیا، کہا کہ ہم سے یزید بن زریع نے بیان کیا، سلیمان تیمی کے واسطہ سے، انہوں نے ابوعثمان نہدی سے، انہوں نے ابن مسعود رضی اللہ عنہ سے کہ ایک شخص نے کسی غیر عورت کا بوسہ لے لیا۔ اور پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور آپ کو اس حرکت کی خبر دے دی۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی، کہ نماز دن کے دونوں حصوں میں قائم کرو اور کچھ رات گئے بھی، اور بلاشبہ نیکیاں برائیوں کو مٹا دیتی ہیں۔ اس شخص نے کہا کہ یا رسول اللہ! کیا یہ صرف میرے لیے ہے۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ میری تمام امت کے لیے یہی حکم ہے۔",
          "fr": "Rapporté par Ibn Mas`ud : Un homme a embrassé une femme (de façon interdite), puis il est allé voir le Prophète (ﷺ) et l’a informé. Allah a révélé : « Accomplis la prière aux deux extrémités du jour et à certaines heures de la nuit (c’est-à-dire les cinq prières obligatoires). En vérité, les bonnes actions effacent les mauvaises (petits péchés) » (11.114). L’homme a demandé à Allah's Messager (ﷺ) : « Est-ce que c’est pour moi ? » Il a dit : « C’est pour tous mes fidèles. »",
          "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Sulaiman At Taimi] dari [Abu 'Utsman An Nahdi] dari [Ibnu Mas'ud], bahwa ada seorang laki-laki mencium seorang wanita, ia lalu mendatangi Nabi shallallahu 'alaihi wasallam dan mengabarkan kepada beliau. Maka turunlah firman Allah: '(Dan dirikanlah shalat pada kedua tepi siang (pagi dan petang) dan pada bahagian permulaan daripada malam. Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatan-perbuatan yang buruk).' (Qs. Huud: 114). Laki-laki itu lalu bertanya, \"Wahai Rasulullah, apakah ini khusus buatku?\" beliau menjawab: \"Untuk semua umatku",
          "tr": "İbn Mes'ud'dan şöyle nakledilmiştir: \"Adam'ın biri, bir kadın'ı öpmüş. Sonra Rasulullah Sallallahu Aleyhi ve Sellem'e gelip bunu haber vermişti. Bunun üzerine, 'Gündüzün iki ucunda, gecenin de ilk saatlerinde namaz kıl. Çünkü iyilikler kötülükleri (günahları) giderir [Hud 114] âyeti nazil oldu. Adam, 'Ya Resulallah! Bu benim için mi geçerli ?' diye sordu. Nebi Sallallahu Aleyhi ve Sellem de: Bütün ümmetim için geçerlidir' buyurarak cevap verdi. Tekrar: 4687. Diğer tahric: Müslim, Tevbe; Tirmizi Tefsir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 5
      },
      "narrator": {
        "en": "Ibn Mas`ud"
      }
    },
    {
      "hadithNumber": 527,
      "arabicNumber": 527,
      "book": 9,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ الْوَلِيدُ بْنُ الْعَيْزَارِ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا عَمْرٍو الشَّيْبَانِيَّ، يَقُولُ حَدَّثَنَا صَاحِبُ، هَذِهِ الدَّارِ وَأَشَارَ إِلَى دَارِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَىُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ قَالَ ‏\"‏ الصَّلاَةُ عَلَى وَقْتِهَا ‏\"‏‏.‏ قَالَ ثُمَّ أَىُّ قَالَ ‏\"‏ ثُمَّ بِرُّ الْوَالِدَيْنِ ‏\"‏‏.‏ قَالَ ثُمَّ أَىُّ قَالَ ‏\"‏ الْجِهَادُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قَالَ حَدَّثَنِي بِهِنَّ وَلَوِ اسْتَزَدْتُهُ لَزَادَنِي‏.‏",
        "translations": {
          "en": "Narrated `Abdullah:I asked the Prophet (ﷺ) \"Which deed is the dearest to Allah?\" He replied, \"To offer the prayers at their early stated fixed times.\" I asked, \"What is the next (in goodness)?\" He replied, \"To be good and dutiful to your parents\" I again asked, \"What is the next (in goodness)?\" He replied, 'To participate in Jihad (religious fighting) in Allah's cause.\" `Abdullah added, \"I asked only that much and if I had asked more, the Prophet (ﷺ) would have told me more",
          "ur": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا، کہا ہم سے شعبہ نے، انہوں نے کہا کہ مجھے ولید بن عیزار کوفی نے خبر دی، کہا کہ میں نے ابوعمر و شیبانی سے سنا، وہ کہتے تھے کہ میں نے اس گھر کے مالک سے سنا، (آپ عبداللہ بن مسعود رضی اللہ عنہ کے گھر کی طرف اشارہ کر رہے تھے) انہوں نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ اللہ تعالیٰ کی بارگاہ میں کون سا عمل زیادہ محبوب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے وقت پر نماز پڑھنا، پھر پوچھا، اس کے بعد، فرمایا والدین کے ساتھ نیک معاملہ رکھنا۔ پوچھا اس کے بعد، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی راہ میں جہاد کرنا۔ ابن مسعود رضی اللہ عنہ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے یہ تفصیل بتائی اور اگر میں اور سوالات کرتا تو آپ صلی اللہ علیہ وسلم اور زیادہ بھی بتلاتے۔ ( لیکن میں نے بطور ادب خاموشی اختیار کی ) ۔",
          "fr": "Rapporté par `Abdullah : J’ai demandé au Prophète (ﷺ) : « Quelle action est la plus aimée d’Allah ? » Il a répondu : « Accomplir la prière à l’heure fixée dès le début. » J’ai demandé : « Et ensuite ? » Il a répondu : « Être bon et respectueux envers ses parents. » J’ai encore demandé : « Et ensuite ? » Il a répondu : « Participer au Jihad dans la voie d’Allah. » `Abdullah a ajouté : « Je n’ai posé que ces questions, mais si j’en avais posé plus, le Prophète (ﷺ) m’aurait répondu. »",
          "id": "Telah menceritakan kepada kami [Abu Al Walid Hisyam bin 'Abdul Malik] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah mengabarkan kepadaku [Al Walid bin Al 'Aizar] berkata, Aku mendengar [Abu 'Amru Asy Syaibani] berkata, \"Pemilik rumah ini menceritakan kepada kami -seraya menunjuk rumah ['Abdullah] - ia berkata, \"Aku pernah bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Amal apakah yang paling dicintai oleh Allah?\" Beliau menjawab: \"Shalat pada waktunya.\" 'Abdullah bertanya lagi, \"Kemudian apa kagi?\" Beliau menjawab: \"Kemudian berbakti kepada kedua orangtua.\" 'Abdullah bertanya lagi, \"Kemudian apa kagi?\" Beliau menjawab: \"Jihad fi sabilillah.\" 'Abdullah berkata, \"Beliau sampaikan semua itu, sekiranya aku minta tambah, niscaya beliau akan menambahkannya untukku",
          "tr": "Abdullah'tan şöyle nakledilmiştir: Allah Resûlü Sallallahu Aleyhi ve Sellem'e, amellerin hangisinin Allah'a daha sevimli olduğunu sordum. O da, Vaktinde kılınan namaz' diye cevap verdi. 'Sonra hangisi?' diye sordum. Bu defa: 'Ana-baba'ya iyilik etmek' diye cevap verdi. 'Bundan sonra hangisi?' diye sordum. Bu kez, Allah yolunda cihad etmek' diye cevap verdi. Bana bunları anlattı. Eğer daha fazla soru sorsaydım, elbette cevabını verirdi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 6
      },
      "narrator": {
        "en": "`Abdullah"
      }
    },
    {
      "hadithNumber": 528,
      "arabicNumber": 528,
      "book": 9,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَرَأَيْتُمْ لَوْ أَنَّ نَهَرًا بِبَابِ أَحَدِكُمْ، يَغْتَسِلُ فِيهِ كُلَّ يَوْمٍ خَمْسًا، مَا تَقُولُ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ ‏\"‏‏.‏ قَالُوا لاَ يُبْقِي مِنْ دَرَنِهِ شَيْئًا‏.‏ قَالَ ‏\"‏ فَذَلِكَ مِثْلُ الصَّلَوَاتِ الْخَمْسِ، يَمْحُو اللَّهُ بِهَا الْخَطَايَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:I heard Allah's Messenger (ﷺ) saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet (ﷺ) added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds",
          "ur": "ہم سے ابراہیم بن حمزہ نے بیان کیا، کہا ہم سے عبدالعزیز بن ابی حازم اور عبدالعزیز بن محمد دراوردی نے یزید بن عبداللہ کی روایت سے، انہوں نے محمد بن ابراہیم تیمی سے، انہوں نے ابوسلمہ بن عبدالرحمٰن بن عوف رضی اللہ عنہ سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اگر کسی شخص کے دروازے پر نہر جاری ہو اور وہ روزانہ اس میں پانچ پانچ دفعہ نہائے تو تمہارا کیا گمان ہے۔ کیا اس کے بدن پر کچھ بھی میل باقی رہ سکتا ہے؟ صحابہ نے عرض کی کہ نہیں یا رسول اللہ! ہرگز نہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہی حال پانچوں وقت کی نمازوں کا ہے کہ اللہ پاک ان کے ذریعہ سے گناہوں کو مٹا دیتا ہے۔",
          "fr": "Rapporté par Abu Huraira : J’ai entendu Allah's Messager (ﷺ) dire : « Si l’un de vous avait une rivière devant sa porte et s’y baignait cinq fois par jour, resterait-il la moindre trace de saleté sur lui ? » Ils ont répondu : « Il ne resterait aucune trace de saleté. » Le Prophète (ﷺ) a ajouté : « C’est l’exemple des cinq prières, par lesquelles Allah efface les mauvaises actions. »",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Hamzah] berkata, telah menceritakan kepadaku [Ibnu Abu Hazim] dan [Ad Darawardi] dari [Yazid] -yakni Ibnu 'abdullah bin Al Hadi- dari [Muhammad bin Ibrahim] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah], bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana pendapat kalian seandainya ada sungai di depan pintu rumah salah seorang dari kalian, lalu dia mandi lima kali setiap hari? Apakah kalian menganggap masih akan ada kotoran (daki) yang tersisa padanya?\" Para sahabat menjawab, \"Tidak akan ada yang tersisa sedikitpun kotoran padanya.\" Lalu beliau bersabda: \"Seperti itu pula dengan shalat lima waktu, dengannya Allah akan menghapus semua kesalahan",
          "tr": "Ebu Hureyre r.a.'den şöyle nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem: Siz'den birinizin kapısının önünden günde beş kez yıkandığı bir nehir aksa, ne dersiniz bu yıkanma onun üzerinde bir kir bırakır mı?\" diye sordu. Ashâb-ı kiram, \"Kir'den eser bırakmaz\" diye cevap verdi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Beş vakit namaz da böyledir. Onlar sayesinde Allah, günahları siler.\" Diğer tahric: Tirmizi Emsal; Müslim, Mesacid"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 7
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 529,
      "arabicNumber": 529,
      "book": 9,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا مَهْدِيٌّ، عَنْ غَيْلاَنَ، عَنْ أَنَسٍ، قَالَ مَا أَعْرِفُ شَيْئًا مِمَّا كَانَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قِيلَ الصَّلاَةُ‏.‏ قَالَ أَلَيْسَ ضَيَّعْتُمْ مَا ضَيَّعْتُمْ فِيهَا‏.‏",
        "translations": {
          "en": "Narrated Ghailan: Anas said, \"I do not find (now-a-days) things as they were (practiced) at the time of the Prophet.\" Somebody said \"The prayer (is as it was.)\" Anas said, \"Have you not done in the prayer what you have done?",
          "ur": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے مہدی بن میمون نے غیلان بن جریر کے واسطہ سے، انہوں نے انس رضی اللہ عنہ سے، آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے عہد کی کوئی بات اس زمانہ میں نہیں پاتا۔ لوگوں نے کہا، نماز تو ہے۔ فرمایا اس کے اندر بھی تم نے کر رکھا ہے جو کر رکھا ہے۔",
          "fr": "Rapporté par Ghailan : Anas a dit : « Je ne retrouve plus (de nos jours) les choses telles qu’elles étaient au temps du Prophète. » Quelqu’un a dit : « La prière (est comme avant). » Anas a répondu : « N’avez-vous pas changé la façon de prier ? »",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Mahdi] dari [Ghailan] dari [Anas] berkata, \"Aku tidak pernah mengenal sasuatupun di zaman Rasulullah shallallahu 'alaihi wasallam seperti apa yang terjadi sekarang.\" Dikatakan kepadanya, \"Apakah yang kau maksud shalat?\" Anas berkata, \"Bukankah memang benar kalian telah melalaikannya?",
          "tr": "Enes İbn Mâlik (r.a.): \"Nebi Sallallahu Aleyhi ve Sellem. döneminde yapılan uygulamaların hiç biri kalmadı\" demiştir. Etrafındakiler \"Ya namaz?\" diye sorunca şöyle cevap vermiştir: \"Namazla da oynamadınız mı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 8
      },
      "narrator": {
        "en": "Ghailan"
      }
    },
    {
      "hadithNumber": 530,
      "arabicNumber": 530,
      "book": 9,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ أَبُو عُبَيْدَةَ الْحَدَّادُ، عَنْ عُثْمَانَ بْنِ أَبِي رَوَّادٍ، أَخِي عَبْدِ الْعَزِيزِ قَالَ سَمِعْتُ الزُّهْرِيَّ، يَقُولُ دَخَلْتُ عَلَى أَنَسِ بْنِ مَالِكٍ بِدِمَشْقَ وَهُوَ يَبْكِي فَقُلْتُ مَا يُبْكِيكَ فَقَالَ لاَ أَعْرِفُ شَيْئًا مِمَّا أَدْرَكْتُ إِلاَّ هَذِهِ الصَّلاَةَ، وَهَذِهِ الصَّلاَةُ قَدْ ضُيِّعَتْ‏.‏ وَقَالَ بَكْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَخْبَرَنَا عُثْمَانُ بْنُ أَبِي رَوَّادٍ نَحْوَهُ‏.‏",
        "translations": {
          "en": "Narrated Az-Zuhri that he visited Anas bin Malik at Damascus and found him weeping and asked him why he was weeping. He replied, \"I do not know anything which I used to know during the life-time of Allah's Apostle except this prayer which is being lost (not offered as it should be)",
          "ur": "ہم سے عمرو بن زرارہ نے بیان کیا، انہوں نے کہا ہمیں عبدالواحد بن واصل ابوعبیدہ حداد نے خبر دی، انہوں نے عبدالعزیز کے بھائی عثمان بن ابی رواد کے واسطہ سے بیان کیا، انہوں نے کہا کہ میں نے زہری سے سنا کہ میں دمشق میں انس بن مالک رضی اللہ عنہ کی خدمت میں گیا۔ آپ اس وقت رو رہے تھے۔ میں نے عرض کیا کہ آپ کیوں رو رہے ہیں؟ انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے عہد کی کوئی چیز اس نماز کے علاوہ اب میں نہیں پاتا اور اب اس کو بھی ضائع کر دیا گیا ہے۔ اور بکر بن خلف نے کہا کہ ہم سے محمد بن بکر برسانی نے بیان کیا کہ ہم سے عثمان بن ابی رواد نے یہی حدیث بیان کی۔",
          "fr": "Rapporté par Az-Zuhri : Il a rendu visite à Anas bin Malik à Damas et l’a trouvé en train de pleurer. Il lui a demandé pourquoi il pleurait. Il a répondu : « Je ne reconnais plus rien de ce que je connaissais du temps du Messager d’Allah, sauf cette prière qui est en train de se perdre (car elle n’est plus accomplie comme il faut). »",
          "id": "Telah menceritakan kepada kami ['Amru bin Zurarah] berkata, telah mengabarkan kepada kami ['Abdul Wahid bin Washil Abu 'Ubaidah Al Haddad] dari ['Utsman bin Abu Rawwad] saudara Al 'Aziz bin Abu Rawwad, ia berkata, aku mendengar [Az Zuhri] berkata, \"Aku pernah menemui [Anas bin Malik] di Damaskus, sementara saat itu ia sedang menangis. Aku lalu bertanya, 'Apa yang membuatmu menangis? Anas lalu menjawab, \"Aku tidak pernah mengenal sasuatupun di zaman Rasulullah shallallahu 'alaihi wasallam seperti apa yang aku temui sekarang selain masalah shalat. Shalat sekarang ini sudah dilalaikan.\" [Bakar bin Khalaf] berkata, telah menceritakan kepada kami [Muhammad bin Bakar Al Barsani] telah mengabarkan kepada kami ['Utsman bin Abu Rawwad] dengan hadits seperti ini",
          "tr": "Abdulaziz'in kardeşi Osman İbn Ebî Ravvad'dan şöyle nakledilmiştir: \"Zührî'nin şöyle dediğini işittim: Şam'da bulunduğu bir sırada Enes İbn Mâlik'in yanına gittim. O esnada ağlıyordu. 'Neden ağlıyorsun?' diye sordum. O da şöyle cevap verdi: Benim yetiştiğim dönemde şu namaz dışında bir şey kalmamıştı. Şimdi bakıyorum o da yozlaştırıldı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 9
      }
    },
    {
      "hadithNumber": 531,
      "arabicNumber": 531,
      "book": 9,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ أَحَدَكُمْ إِذَا صَلَّى يُنَاجِي رَبَّهُ فَلاَ يَتْفِلَنَّ عَنْ يَمِينِهِ، وَلَكِنْ تَحْتَ قَدَمِهِ الْيُسْرَى ‏\"‏‏.‏ وَقَالَ سَعِيدٌ عَنْ قَتَادَةَ لاَ يَتْفِلُ قُدَّامَهُ أَوْ بَيْنَ يَدَيْهِ، وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمَيْهِ‏.‏ وَقَالَ شُعْبَةُ لاَ يَبْزُقُ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ‏.‏ وَقَالَ حُمَيْدٌ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ يَبْزُقْ فِي الْقِبْلَةِ وَلاَ عَنْ يَمِينِهِ، وَلَكِنْ عَنْ يَسَارِهِ أَوْ تَحْتَ قَدَمِهِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas:The Prophet (ﷺ) said, \"Whenever anyone of you offers his prayer he is speaking in private to his Lord. So he should not spit to his right but under his left foot.\" Qatada said, \"He should not spit in front of him but to his left or under his feet.\" And Shu`ba said, \"He should not spit in front of him, nor to his right but to his left or under his foot.\" Anas said: The Prophet (ﷺ) said, \"He should neither spit in the direction of his Qibla nor to his right but to his left or under his foot",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام بن عبداللہ دستوائی نے قتادہ ابن دعامہ کے واسطے سے، انہوں نے انس رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کوئی نماز میں ہوتا ہے تو وہ اپنے رب سے سرگوشی کرتا رہتا ہے اس لیے اپنی داہنی جانب نہ تھوکنا چاہیے لیکن بائیں پاؤں کے نیچے تھوک سکتا ہے۔",
          "fr": "Rapporté par Anas : Le Prophète (ﷺ) a dit : « Quand l’un de vous fait sa prière, il parle en privé avec son Seigneur. Il ne doit donc pas cracher à sa droite mais sous son pied gauche. » Qatada a dit : « Il ne doit pas cracher devant lui, mais à sa gauche ou sous ses pieds. » Et Shu`ba a dit : « Il ne doit ni cracher devant lui, ni à sa droite, mais à sa gauche ou sous son pied. » Anas a dit : Le Prophète (ﷺ) a dit : « Il ne doit ni cracher en direction de la Qibla, ni à sa droite, mais à sa gauche ou sous son pied. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian shalat bermunajat kepada Rabbnya, maka janganlah dia meludah ke sebelah kanannya, tetapi henklah ke sebelah kiri atau bawah kaki kirinya.\" [Sa'id] menyebutkan dari [Qatadah], \"Janganlah dia meludah ke arah depannya, tetapi ke sebelah kiri atau di bawah kedua kakinya.\" [Syu'bah] menyebutkan: \"Janganlah ia meludah ke arah depan atau sebelah kanannya, tetapi hendaklah ke sebelah kiri atau di bawah kaki kirinya.\" Dan [Humaid] menyebutkan dari [Anas] dari Nabi shallallahu 'alaihi wasallam: \"Janganlah ia meludah ke arah kiblat atau sebelah kanannya, tetapi hendaklah ke sebelah kiri atau di bawah kakinya",
          "tr": "Enes İbn Malik Nebi (Sallallahu aleyhi ve Sellem)’in şöyle buyurduğunu nakletmiştir: \"Sizden biri namaz kıldığı zaman, Rabbine münacatta bulunur.'O anda O'na en yakın bir durumdadır. O halde bu kişi sağ tarafına tükürmesin. Ancak sol ayağının altına tükürebilir.\" Saîd, Katâde'den şöyle nakletmiştir: \"İleriye doğru ve ön tarafına tükürmesin. Ancak sol tarafına veya ayaklarının altına tükürebilir.\" Şu'be şöyle demiştir: \"Namaz kılan ne ön tarafına ne de sağ tarafına tükürür. Sol tarafına veya ayağının altına tükürür.\" Humeyd Enes kanalıyla Nebi s.a.v.'in şöyle buyurduğunu nakletmiştir: \"Ne önüne ne de sağına tükürür. Anca soluna veya ayağının altına tükürebilir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 10
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 532,
      "arabicNumber": 532,
      "book": 9,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اعْتَدِلُوا فِي السُّجُودِ، وَلاَ يَبْسُطْ ذِرَاعَيْهِ كَالْكَلْبِ، وَإِذَا بَزَقَ فَلاَ يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ، فَإِنَّهُ يُنَاجِي رَبَّهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas:The Prophet (ﷺ) said, \"Do the prostration properly and do not put your forearms flat with elbows touching the ground like a dog. And if you want to spit, do not spit in front, nor to the right for the person in prayer is speaking in private to his Lord",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے یزید بن ابراہیم نے، انہوں نے کہا کہ ہم سے قتادہ نے انس بن مالک رضی اللہ عنہ سے بیان کیا، آپ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ سجدہ کرنے میں اعتدال رکھو ( سیدھی طرح پر کرو ) اور کوئی شخص تم میں سے اپنے بازوؤں کو کتے کی طرح نہ پھیلائے۔ جب کسی کو تھوکنا ہی ہو تو سامنے یا داہنی طرف نہ تھوکے، کیونکہ وہ نماز میں اپنے رب سے پوشیدہ باتیں کرتا رہتا ہے اور سعید نے قتادہ رضی اللہ عنہ سے روایت کر کے بیان کیا ہے کہ آگے یا سامنے نہ تھوکے البتہ بائیں طرف پاؤں کے نیچے تھوک سکتا ہے اور شعبہ نے کہا کہ اپنے سامنے اور دائیں جانب نہ تھوکے، بلکہ بائیں طرف یا پاؤں کے نیچے تھوک سکتا ہے۔ اور حمید نے انس بن مالک رضی اللہ عنہ سے وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ قبلہ کی طرف نہ تھوکے اور نہ دائیں طرف البتہ بائیں طرف یا پاؤں کے نیچے تھوک سکتا ہے۔",
          "fr": "Rapporté par Anas : Le Prophète (ﷺ) a dit : « Faites bien la prosternation et ne posez pas vos avant-bras à plat avec les coudes touchant le sol comme le fait un chien. Et si vous devez cracher, ne crachez ni devant vous, ni à droite, car la personne en prière parle en privé avec son Seigneur. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin 'Umar] berkata, telah menceritakan kepada kami [Yazid bin Ibrahim] berkata, telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seimbanglah dalam sujud dan janganlah seseorang meletakkan tangannya seperti anjing. Dan jika meludah, maka jangan sekali-kali ia meludah ke arah depan atau ke sebelah kanannya. Karena dia sedang berhadapan dengan Rabbnya",
          "tr": "Enes İbn Malik Nebi (Sallallahu aleyhi ve Sellem)’in şöyle dediğini nakletmiştir: \"Secdeye gittiğiniz zaman itidalli olunuz. Secdeye giden kişi, köpek gibi kollarını yaymasın. Eğer biri tükürmek zorunda kalırsa, önüne ve sağ tarafına tükürmesin. Çünkü o, Rabbine münacat ediyordur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 11
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 534,
      "arabicNumber": 534,
      "book": 9,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ سُلَيْمَانَ، قَالَ صَالِحُ بْنُ كَيْسَانَ حَدَّثَنَا الأَعْرَجُ عَبْدُ الرَّحْمَنِ، وَغَيْرُهُ، عَنْ أَبِي هُرَيْرَةَ‏.‏وَنَافِعٌ مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُمَا حَدَّثَاهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira and `Abdullah bin `Umar:Allah's Messenger (ﷺ) said, \"If it is very hot, then pray the Zuhr prayer when it becomes (a bit) cooler, as the severity of the heat is from the raging of the Hell-fire",
          "fr": "Rapporté par Abu Huraira et `Abdullah bin `Umar : Allah's Messager (ﷺ) a dit : « S’il fait très chaud, faites la prière de Zuhr quand il fait un peu plus frais, car la chaleur intense vient de la fournaise de l’Enfer. »",
          "id": "Telah menceritakan kepada kami [Ayyub bin Sulaiman bin Bilal] berkata, telah menceritakan kepada kami [Abu Bakar] dari [Sulaiman] berkata, [Shalih bin Kaisan] telah menceritakan kepada kami [Al A'raj 'Abdurrahman], dan selainnya dari [Abu Hurairah] dan [Nafi'] mantan budak 'Abdullah bin 'Umar, dari ['Abdullah bin 'Umar] bahwa keduanya menceritakan kepadanya dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Jika udara sangat panas menyengat maka tundalah shalat, karena panas yang sangat menyengat itu berasal dari hembusan api neraka jahannam",
          "tr": "Ebu Hureyre ile Abdullah İbn Ömer'in kölesi Nâfi', İbn Ömer'e Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini nakletmişlerdir: \"Aşırı derecede sıcak olunca, (öğle namazını) serinlikte kılın. Çünkü havanın aşırı derecede sıcak olması, cehennemin kaynamasından ileri gelir. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 12
      },
      "narrator": {
        "en": "Abu Huraira and `Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 535,
      "arabicNumber": 535,
      "book": 9,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْمُهَاجِرِ أَبِي الْحَسَنِ، سَمِعَ زَيْدَ بْنَ وَهْبٍ، عَنْ أَبِي ذَرٍّ، قَالَ أَذَّنَ مُؤَذِّنُ النَّبِيِّ صلى الله عليه وسلم الظُّهْرَ فَقَالَ ‏\"‏ أَبْرِدْ أَبْرِدْ ـ أَوْ قَالَ ـ انْتَظِرِ انْتَظِرْ ‏\"‏‏.‏ وَقَالَ ‏\"‏ شِدَّةُ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ، فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ ‏\"‏‏.‏ حَتَّى رَأَيْنَا فَىْءَ التُّلُولِ‏.‏",
        "translations": {
          "en": "Narrated Abu Dhar:The Mu'adh-dhin (call-maker) of the Prophet (ﷺ) pronounced the Adhan (call) for the Zuhr prayer but the Prophet said, \"Let it be cooler, let it be cooler.\" Or said, 'Wait, wait, because the severity of heat is from the raging of the Hell-fire. In severe hot weather, pray when it becomes (a bit) cooler and the shadows of hillocks appear",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر محمد بن جعفر نے بیان کیا، ان سے شعبہ بن حجاج نے مہاجر ابوالحسن کی روایت سے بیان کیا، انہوں نے زید بن وہب ہمدانی سے سنا۔ انہوں نے ابوذر رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم کے مؤذن ( بلال ) نے ظہر کی اذان دی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھنڈا کر، ٹھنڈا کر، یا یہ فرمایا کہ انتظار کر، انتظار کر، اور فرمایا کہ گرمی کی تیزی جہنم کی آگ کی بھاپ سے ہے۔ اس لیے جب گرمی سخت ہو جائے تو نماز ٹھنڈے وقت میں پڑھا کرو، پھر ظہر کی اذان اس وقت کہی گئی جب ہم نے ٹیلوں کے سائے دیکھ لیے۔",
          "fr": "Rapporté par Abu Dhar : Le muezzin du Prophète (ﷺ) a appelé à la prière de Zuhr, mais le Prophète a dit : « Attendez qu’il fasse plus frais, attendez qu’il fasse plus frais. » Ou il a dit : « Attendez, attendez, car la chaleur intense vient de la fournaise de l’Enfer. Par temps très chaud, priez quand il fait plus frais et que les ombres des collines apparaissent. »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Ghundar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Al Muhajir Abu Al Hasan] bahwa ia mendengar [Zaid bin Wahb] dari [Abu Dzar] berkata, \"Seorang mu'adzin Nabi shallallahu 'alaihi wasallam mengumandangkan adzan Zhuhur. Kemudian beliau bersabda: \"Tundalah, tundalah.\" Atau beliau katakan: \"Tunggulah, tunggulah.\" Beliau kemudian melanjutkan:: \"Panas yang menyengat ini berasal dari hembusan api jahannam. Jika udara sangat panas menyengat maka tundalah shalat hingga kita melihat bayangan suatu benda",
          "tr": "Ebu Zer' (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in müezzini öğle ezanını okumaya başladı. Resulullah Sallallahu Aleyhi ve Sellem: 'Serin vakte bırak! Serin vakte bırak!1 veya Bekle!, bekle!' diye seslendi. Sonra da şöyle buyurdu: \"Havanın aşırı derecede sıcak olması, cehennem ateşinin kaynamasından ileri gelir. O halde, hava aşırı derecede sıcak olunca, namaz'ı serin vakte erteleyin! Ebu Zer şöyle demiştir: Tepelerin gölgesini görünceye kadar namazı ertelerdik. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 13
      },
      "narrator": {
        "en": "Abu Dhar"
      }
    },
    {
      "hadithNumber": 537,
      "arabicNumber": 537,
      "book": 9,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنَ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا بِالصَّلاَةِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏ ‏\"‏ وَاشْتَكَتِ النَّارُ إِلَى رَبِّهَا فَقَالَتْ يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا‏.‏ فَأَذِنَ لَهَا بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ، وَنَفَسٍ فِي الصَّيْفِ، فَهُوَ أَشَدُّ مَا تَجِدُونَ مِنَ الْحَرِّ، وَأَشَدُّ مَا تَجِدُونَ مِنَ الزَّمْهَرِيرِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"In very hot weather delay the Zuhr prayer till it becomes (a bit) cooler because the severity of heat is from the raging of the Hell-fire. The Hell-fire of Hell complained to its Lord saying: O Lord! My parts are eating (destroying) one another. So Allah allowed it to take two breaths, one in the winter and the other in the summer. The breath in the summer is at the time when you feel the severest heat and the breath in the winter is at the time when you feel the severest cold",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Par très forte chaleur, retardez la prière de Zuhr jusqu’à ce qu’il fasse un peu plus frais, car la chaleur intense vient de la fournaise de l’Enfer. L’Enfer s’est plaint à son Seigneur en disant : Ô Seigneur ! Mes parties se détruisent les unes les autres. Alors Allah lui a permis de souffler deux fois : une en hiver et une en été. Le souffle de l’été, c’est quand vous ressentez la plus grande chaleur, et celui de l’hiver, c’est quand vous ressentez le plus grand froid. »",
          "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah Al Mutsanna] berkata, telah menceritakan kepada kami [Sufyan] berkata, kami telah menghafalnya dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila panas sangat menyengat maka tudalah shalat hingga panasnya mereda. Sebab panas yang sangat menyengat itu berasal dari hembusan api jahannam. Neraka jahannam mengadu kepada Rabbnya seraya berkata, 'Wahai Rabb, sebagian kami telah makan sebagian yang lain! ', maka Allah pun memberinya izin dengan dua tarikan nafas; sekali saat musim dingin dan sekali saat musim panas. Maka apa yang kalian rasakan berupa udara panas berasal darinya, begitu juga udara dingin yang kalian rasakan berasal darinya",
          "tr": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Hava aşırı derecede sıcak olduğu zaman, namaz'ı serin bir vakte te'hir edin. Çünkü havanın aşırı derecede sıcak olması, cehennem'in kaynamasından / sıcağının artmasından ileri gelir.\" [-537-] \"Cehennem Rabbine Ya Rabbi! Bir kısmım bir kısmımı yedi diye şikayette butundu. Bunun üzerine Allah Teâlâ ona, biri kışın diğeri yazın olmak üzere iki nefes alması için müsaade etti. İşte bu nefesler, yazın hissettiğinizden daha sıcak ve kışın yaşadığınız zemheriden daha soğuktur. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 14
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 538,
      "arabicNumber": 538,
      "book": 9,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَبْرِدُوا بِالظُّهْرِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏ تَابَعَهُ سُفْيَانُ وَيَحْيَى وَأَبُو عَوَانَةَ عَنِ الأَعْمَشِ‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id:that Allah's Messenger (ﷺ) said, \"Pray Zuhr prayer when it becomes (a bit) cooler as the severity of heat is from the raging of the Hell-fire",
          "ur": "ہم سے عمر بن حفص بن غیاث نے بیان کیا کہا مجھ سے میرے باپ نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا کہ ہم سے ابوصالح ذکوان نے ابو سعید خدری رضی اللہ عنہ کے واسطہ سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( کہ گرمی کے موسم میں ) ظہر کو ٹھنڈے وقت میں پڑھا کرو، کیونکہ گرمی کی شدت جہنم کی بھاپ سے پیدا ہوتی ہے۔ اس حدیث کی متابعت سفیان ثوری، یحییٰ اور ابوعوانہ نے اعمش کے واسطہ سے کی ہے۔",
          "fr": "Rapporté par Abu Sa`id : Allah's Messager (ﷺ) a dit : « Faites la prière de Zuhr quand il fait un peu plus frais, car la chaleur intense vient de la fournaise de l’Enfer. »",
          "id": "Telah menceritakan kepada kami ['Umar bin Hafsh bin Ghiyats] berkata, telah menceritakan kepada kami [Bapakku] ia berkata, telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Abu Shalih] dari [Abu Sa'id] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tundalah shalat Zhuhur (hingg panas mereda), karena panas yang sangat menyengat berasal dari hembusan jahannam.\" Hadits ini dikuatkan oleh [Sufyan] dan [Yahya] dan [Abu 'Awanah] dari [Al A'masy]",
          "tr": "Ebu Saîd Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Öğle namazını serinlik düşünce kılın! Zira hava'nın aşırı sıcak olması, cehennemin kaynamasından ileri gelir. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 15
      },
      "narrator": {
        "en": "Abu Sa`id"
      }
    },
    {
      "hadithNumber": 539,
      "arabicNumber": 539,
      "book": 9,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا مُهَاجِرٌ أَبُو الْحَسَنِ، مَوْلًى لِبَنِي تَيْمِ اللَّهِ قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَأَرَادَ الْمُؤَذِّنُ أَنْ يُؤَذِّنَ لِلظُّهْرِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبْرِدْ ‏\"‏‏.‏ ثُمَّ أَرَادَ أَنْ يُؤَذِّنَ فَقَالَ لَهُ ‏\"‏ أَبْرِدْ ‏\"‏‏.‏ حَتَّى رَأَيْنَا فَىْءَ التُّلُولِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ، فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا بِالصَّلاَةِ ‏\"‏‏.‏ وَقَالَ ابْنُ عَبَّاسٍ تَتَفَيَّأُ تَتَمَيَّلُ‏.‏",
        "translations": {
          "en": "Narrated Abu Dhar Al-Ghifar:We were with the Prophet (ﷺ) on a journey and the Mu'adh-dhin (call maker for the prayer) wanted to pronounce the Adhan (call) for the Zuhr prayer. The Prophet (ﷺ) said, 'Let it become cooler.\" He again (after a while) wanted to pronounce the Adhan but the Prophet (ﷺ) said to him, \"Let it become cooler till we see the shadows of hillocks.\" The Prophet (ﷺ) added, \"The severity of heat is from the raging of the Hell-fire, and in very hot weather pray (Zuhr) when it becomes cooler",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے بنی تیم اللہ کے غلام مہاجر ابوالحسن نے بیان کیا، کہا کہ میں نے زید بن وہب جہنی سے سنا، وہ ابوذر غفاری رضی اللہ عنہ سے نقل کرتے تھے کہ انہوں نے کہا کہ ہم ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے۔ مؤذن نے چاہا کہ ظہر کی اذان دے۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ وقت کو ٹھنڈا ہونے دو، مؤذن نے ( تھوڑی دیر بعد ) پھر چاہا کہ اذان دے، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھنڈا ہونے دو۔ جب ہم نے ٹیلے کا سایہ ڈھلا ہوا دیکھ لیا۔ ( تب اذان کہی گئی ) پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ گرمی کی تیزی جہنم کی بھاپ کی تیزی سے ہے۔ اس لیے جب گرمی سخت ہو جایا کرے تو ظہر کی نماز ٹھنڈے وقت میں پڑھا کرو۔ ابن عباس رضی اللہ عنہما نے فرمایا «يتفيئو» ( کا لفظ جو سورۃ النحل میں ہے ) کے معنے «تتميل‏» ( جھکنا، مائل ہونا ) ہیں۔",
          "fr": "Rapporté par Abu Dhar Al-Ghifar : Nous étions avec le Prophète (ﷺ) en voyage et le muezzin voulait appeler à la prière de Zuhr. Le Prophète (ﷺ) a dit : « Attends qu’il fasse plus frais. » Il a voulu de nouveau appeler plus tard, mais le Prophète (ﷺ) lui a dit : « Attends qu’il fasse plus frais jusqu’à ce que nous voyions l’ombre des collines. » Le Prophète (ﷺ) a ajouté : « La chaleur intense vient de la fournaise de l’Enfer, alors par temps très chaud, faites la prière (Zuhr) quand il fait plus frais. »",
          "id": "Telah menceritakan kepada kami [Adam bin Abu Iyas] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami dari [Muhajir Abu Al Hasan] mantan budak bani Taimillah, ia berkata, aku mendengar [Zaid bin Wahb] dari [Abu Dzar Al Ghifari] berkata, \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan, ketika ada mu'adzin yang hendak mengumandangkan adzan Zhuhur, Nabi shallallahu 'alaihi wasallam bersabda: \"Tundalah.\" Sesaat kemudian mu'adzin itu kembali akan mengumandangkan adzan. Maka Nabi shallallahu 'alaihi wasallam pun kembali bersabda: \"Tundalah hingga kita melihat bayang-bayang bukit.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya panas yang sangat menyengat itu berasal dari hembusan api jahannam. Maka apabila udara sangat panas menyengat tundalah shalat (hingga panas) mereda.\" Ibnu 'Abbas berkata, \"Maksud dari firman Allah: tataqayya'u (Qs. An Nahl: 48) adalah condong",
          "tr": "Ebu Zer' el-Ğıfarî'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte bir seferde idik. Müezzin öğle ezanını okumak İstedi. Allah Resulü (Sallallahu Aleyhi ve Sellem): 'Serinlik düşünceye kadar bekle!' buyurdu. Bir müddet sonra müezzin, tekrar ezan okumak istedi. Resulullah Sallallahu Aleyhi ve Sellem yine: 'Serinlik düşünceye kadar bekle!' buyurdu. Nihayet tepenin gölgesinin uzadığını gördüğümüz bir vakitte (müezzin ezan okudu).\" İbn Abbâs demiştir ki; gölge düşer kelimesi, yani güneş batıya doğru kayar manasına gelir. Diğer tahric: Tirmizi Salat; Ebû Dâvûd, Salat"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 16
      },
      "narrator": {
        "en": "Abu Dhar Al-Ghifar"
      }
    },
    {
      "hadithNumber": 540,
      "arabicNumber": 540,
      "book": 9,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ حِينَ زَاغَتِ الشَّمْسُ فَصَلَّى الظُّهْرَ، فَقَامَ عَلَى الْمِنْبَرِ، فَذَكَرَ السَّاعَةَ، فَذَكَرَ أَنَّ فِيهَا أُمُورًا عِظَامًا ثُمَّ قَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَسْأَلَ عَنْ شَىْءٍ فَلْيَسْأَلْ، فَلاَ تَسْأَلُونِي عَنْ شَىْءٍ إِلاَّ أَخْبَرْتُكُمْ مَا دُمْتُ فِي مَقَامِي هَذَا ‏\"‏‏.‏ فَأَكْثَرَ النَّاسُ فِي الْبُكَاءِ، وَأَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَقَامَ عَبْدُ اللَّهِ بْنُ حُذَافَةَ السَّهْمِيُّ فَقَالَ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ أَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا‏.‏ فَسَكَتَ ثُمَّ قَالَ ‏\"‏ عُرِضَتْ عَلَىَّ الْجَنَّةُ وَالنَّارُ آنِفًا فِي عُرْضِ هَذَا الْحَائِطِ فَلَمْ أَرَ كَالْخَيْرِ وَالشَّرِّ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) came out as the sun declined at midday and offered the Zuhr prayer. He then stood on the pulpit and spoke about the Hour (Day of Judgment) and said that in it there would be tremendous things. He then said, \"Whoever likes to ask me about anything he can do so and I shall reply as long as I am at this place of mine. Most of the people wept and the Prophet (ﷺ) said repeatedly, \"Ask me.\" `Abdullah bin Hudhafa As-Sahmi stood up and said, \"Who is my father?\" The Prophet (ﷺ) said, \"Your father is Hudhafa.\" The Prophet (ﷺ) repeatedly said, \"Ask me.\" Then `Umar knelt before him and said, \"We are pleased with Allah as our Lord, Islam as our religion, and Muhammad as our Prophet.\" The Prophet then became quiet and said, \"Paradise and Hell-fire were displayed in front of me on this wall just now and I have never seen a better thing (than the former) and a worse thing (than the latter)",
          "ur": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا، کہا ہم سے شعیب نے زہری کی روایت سے بیان کیا، انہوں نے کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ جب سورج ڈھلا تو نبی کریم صلی اللہ علیہ وسلم حجرہ سے باہر تشریف لائے اور ظہر کی نماز پڑھی۔ پھر منبر پر تشریف لائے۔ اور قیامت کا ذکر فرمایا۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت میں بڑے عظیم امور پیش آئیں گے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کسی کو کچھ پوچھنا ہو تو پوچھ لے۔ کیونکہ جب تک میں اس جگہ پر ہوں تم مجھ سے جو بھی پوچھو گے۔ میں اس کا جواب ضرور دوں گا۔ لوگ بہت زیادہ رونے لگے۔ آپ صلی اللہ علیہ وسلم برابر فرماتے جاتے تھے کہ جو کچھ پوچھنا ہو پوچھو۔ عبداللہ بن حذافہ سہمی کھڑے ہوئے اور دریافت کیا کہ نبی کریم صلی اللہ علیہ وسلم میرے باپ کون ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے باپ حذافہ تھے۔ آپ صلی اللہ علیہ وسلم اب بھی برابر فرما رہے تھے کہ پوچھو کیا پوچھتے ہو۔ اتنے میں عمر رضی اللہ عنہ ادب سے گھٹنوں کے بل بیٹھ گئے اور انہوں نے فرمایا کہ ہم اللہ تعالیٰ کے مالک ہونے، اسلام کے دین ہونے اور محمد ( صلی اللہ علیہ وسلم ) کے نبی ہونے سے راضی اور خوش ہیں۔ ( پس اس گستاخی سے ہم باز آتے ہیں کہ آپ صلی اللہ علیہ وسلم سے جا اور بے جا سوالات کریں ) اس پر نبی کریم صلی اللہ علیہ وسلم خاموش ہو گئے۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابھی ابھی میرے سامنے جنت اور جہنم اس دیوار کے کونے میں پیش کی گئی تھی۔ پس میں نے نہ ایسی کوئی عمدہ چیز دیکھی ( جیسی جنت تھی ) اور نہ کوئی ایسی بری چیز دیکھی ( جیسی دوزخ تھی ) ۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d'Allah (ﷺ) est sorti alors que le soleil venait de passer son zénith et il a accompli la prière du Zuhr. Ensuite, il est monté sur le minbar et a parlé de l’Heure (le Jour du Jugement) en disant qu’il s’y produirait des choses extraordinaires. Puis il a dit : « Celui qui veut me poser une question peut le faire, et je répondrai tant que je suis ici. » La plupart des gens se mirent à pleurer, et le Prophète (ﷺ) répétait : « Demandez-moi. » `Abdullah bin Hudhafa As-Sahmi s’est levé et a demandé : « Qui est mon père ? » Le Prophète (ﷺ) a répondu : « Ton père est Hudhafa. » Le Prophète (ﷺ) a répété : « Demandez-moi. » Puis `Umar s’est agenouillé devant lui et a dit : « Nous sommes satisfaits qu’Allah soit notre Seigneur, l’Islam notre religion, et Muhammad notre Prophète. » Le Prophète est alors resté silencieux et a dit : « Le Paradis et l’Enfer viennent d’être montrés devant moi sur ce mur, et je n’ai jamais vu de chose meilleure que le premier ni de chose pire que le second. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku [Anas bin Malik], ketika matahari panas terik Rasulullah shallallahu 'alaihi wasallam keluar rumah melaksanakan shalat Zhuhur, kemudian beliau naik ke atas mimbar dan menyebutkan tentang hari kiamat. Beliau sebutkan bahwa pada saat itu terdapat perkara yang besar, kemudian beliau katakan: \"Siapa ingin bertanya maka bertanyalah. Dan tidaklah kalian bertanya kepadaku tentang sesuatu kecuali aku akan kabarkan kepada kalian selama aku masih berada di tempaku ini.\" Tiba-tiba para sahabat menangis, dan Nabi shallallahu 'alaihi wasallam terus mengulangi: \"Bertanyalah kepadaku.\" Maka berdirilah 'Abdullah bin Khudzafah As Sahmi seraya berkata, \"Siapakah ayahku?\" Beliau menjawab: \"Ayahmu Hudzafah.\" Kemudian Nabi shallallahu 'alaihi wasallam meminta lagi: \"Bertanyalah kepadaku.\" Maka bangkitlah 'Umar dari posisi duduk berlututnya lantas berkata, \"Kami ridla Allah sebagai Rabb, Islam sebagai agama dan Muhammad sebagai Nabi.\" Lalu Nabi shallallahu 'alaihi wasallam terdiam sejenak kemudian bersabda: \"Barusan diperlihatkan kepadaku surga dan neraka dari balik dinding ini, aku tidak lihat kebaikan sebagaimana keburukan",
          "tr": "Enes İbn Mâlik (r.a.)'den şöyle nakledilmiştir; \"Güneş tam tepe noktasına geldikten sonra batıya doğru meyletmeye başladığı bir sırada Nebi Sallallahu Aleyhi ve Sellem evinden çıkıp öğle namazını kıldırdı. Sonra minbere çıkıp, kıyametten bahsetti. O gün meydana gelecek büyük olayları anlattı. Sonra: 'Kim bana bir soru sormak istiyorsa, sorsun! Burada bulunduğum sürece sorduğunuz bütün sorulara cevap vereceğim' dedi. insanlar pek içli içli ağlamaya başladılar. Nebi Sallallahu Aleyhi ve Sellem de: 'Bana sorun!' diye birkaç kez hitabını yeniledi. Nihayet Abdullah İbn Huzâfe es-Sehmî çıkıp 'Benim babam kim?' diye sordu. Nebi Sallallahu Aleyhi ve Sellem Huzâfe'dir' dîye cevap verdi. Sonra: 'Bana sorun!' diye birkaç kez daha hitabını yeniledi. Bu esnada Ömer dizlerinin üzerinde durup 'Rab olarak Allah'tan, din olarak İslam'dan, Nebi olarak da Muhammed'den razı olduk' dedi. Resulullah Sallallahu Aleyhi ve Sellem bir müddet sustu, sonra şöyle buyurdu; \"Biraz önce cennet ile cehennem şu duvar üzerinde bana gösterildi. Cennetten daha hayırlı, cehennemden de daha kötü bir şey görmedim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 17
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 541,
      "arabicNumber": 541,
      "book": 9,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي الْمِنْهَالِ، عَنْ أَبِي بَرْزَةَ، كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الصُّبْحَ وَأَحَدُنَا يَعْرِفُ جَلِيسَهُ، وَيَقْرَأُ فِيهَا مَا بَيْنَ السِّتِّينَ إِلَى الْمِائَةِ، وَيُصَلِّي الظُّهْرَ إِذَا زَالَتِ الشَّمْسُ، وَالْعَصْرَ وَأَحَدُنَا يَذْهَبُ إِلَى أَقْصَى الْمَدِينَةِ ثُمَّ يَرْجِعُ وَالشَّمْسُ حَيَّةٌ، وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ، وَلاَ يُبَالِي بِتَأْخِيرِ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ‏.‏ ثُمَّ قَالَ إِلَى شَطْرِ اللَّيْلِ‏.‏ وَقَالَ مُعَاذٌ قَالَ شُعْبَةُ ثُمَّ لَقِيتُهُ مَرَّةً فَقَالَ أَوْ ثُلُثِ اللَّيْلِ‏.‏",
        "translations": {
          "en": "Narrated Abu Al-Minhal:Abu Barza said, \"The Prophet (ﷺ) used to offer the Fajr (prayer) when one could recognize the person sitting by him (after the prayer) and he used to recite between 60 to 100 Ayat (verses) of the Qur'an. He used to offer the Zuhr prayer as soon as the sun declined (at noon) and the `Asr prayer at a time when a man might go and return from the farthest place in Medina and find the sun still hot. (The sub-narrator forgot what was said about the Maghrib). He did not mind delaying the `Isha prayer to one third of the night or the middle of the night",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، کہ ہم سے شعبہ نے بیان کیا ابوالمنہال کی روایت سے، انہوں نے ابوبرزہ (فضلہ بن عبید رضی اللہ عنہ) سے، انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم صبح کی نماز اس وقت پڑھتے تھے جب ہم اپنے پاس بیٹھے ہوئے شخص کو پہچان لیتے تھے۔ صبح کی نماز میں نبی کریم صلی اللہ علیہ وسلم ساٹھ سے سو تک آیتیں پڑھتے۔ اور آپ صلی اللہ علیہ وسلم ظہر اس وقت پڑھتے جب سورج ڈھل جاتا۔ اور عصر کی نماز اس وقت کہ ہم مدینہ منورہ کی آخری حد تک ( نماز پڑھنے کے بعد ) جاتے لیکن سورج اب بھی تیز رہتا تھا۔ نماز مغرب کا انس رضی اللہ عنہ نے جو وقت بتایا تھا وہ مجھے یاد نہیں رہا۔ اور نبی کریم صلی اللہ علیہ وسلم عشاء کی نماز کو تہائی رات تک دیر کرنے میں کوئی حرج نہیں سمجھتے تھے، پھر ابوالمنہال نے کہا کہ آدھی رات تک ( مؤخر کرنے میں ) کوئی حرج نہیں سمجھتے تھے۔ اور معاذ نے کہا کہ شعبہ نے فرمایا کہ پھر میں دوبارہ ابوالمنہال سے ملا تو انہوں نے فرمایا ”یا تہائی رات تک“۔",
          "fr": "Rapporté par Abu Al-Minhal : Abu Barza a dit : « Le Prophète (ﷺ) accomplissait la prière du Fajr quand on pouvait reconnaître la personne assise à côté de soi (après la prière), et il récitait entre 60 et 100 versets du Coran. Il accomplissait la prière du Zuhr dès que le soleil déclinait (à midi), et celle du `Asr à un moment où quelqu’un pouvait aller et revenir du point le plus éloigné de Médine et trouver le soleil encore chaud. (Le sous-narrateur a oublié ce qui a été dit à propos du Maghrib.) Il ne voyait pas d’inconvénient à retarder la prière du `Isha jusqu’au tiers ou au milieu de la nuit. »",
          "id": "Telah menceritakan kepada kami [Hafsh bin 'Umar] berkata, telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abu Al Minhal] dari [Abu Barzah], bahwa Nabi shallallahu 'alaihi wasallam melaksanakan shalat shubuh, dan salah seorang dari kami dapat mengetahui siapa orang yang ada di sisinya. Dalam shalat tersebut beliau membaca antara enam puluh hingga seratus ayat. Dan beliau shalat Zhuhur saat matahari sudah condong, shalat 'Ashar saat salah seorang dari kami pergi ke ujung kota dan matahari masih terasa panas sinarnya. Dan aku lupa apa yang dibaca beliau saat shalat Maghrib. Dan beliau sering mengakhirkan pelaksanaan shalat 'Isya hingga sepertiga malam lalu melaksanakannya sampai pertengahan malam.\" [Mu'adz] berkata, Syu'bah berkata; \"Aku pernah berjumpa denganya pada suatu hari, berkata, 'Atau sepertiga malam",
          "tr": "Ebu Berze'den şöyle nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem Bizden biri yanı başındaki arkadaşını tanıdığı kadar aydınlık olunca sabah namazını kıldırırdı. Fatiha'dan sonra atmış ile yüz âyet arasında Kur'an okurdu. Öğle namazını ise, güneş en yüksek konuma geldikten sonra batmaya doğru meylettiği zaman kıldırırdı. İkindi namazını öyle bir zamanda kıldırırdı ki, namazdan sonra bizden biri 'Medine'nin en ücra köşesine gidip geldiği halde güneş hâlâ batmamış olurdu. Akşam namazı hakkında ne söylediğini unuttum deniştir. {Ebu Berze) 'Yatsı namazını İse, gecenin 2/3'üne kadar geciktirmekte bir sakınca görmezdi' demiştir. Bir başka seferinde ise 'Gece yarısına kadar te'hirde sakınca görmezdi' demiştir. Muaz, Şu'be'nin şöyle dediğini nakletmiştir: 'Bir defasında onunla karşılaştım, gecenin 1/3'üne kadar geciktirmekte sakınca görmezdi' demiştir. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 18
      },
      "narrator": {
        "en": "Abu Al-Minhal"
      }
    },
    {
      "hadithNumber": 542,
      "arabicNumber": 542,
      "book": 9,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدٌ ـ يَعْنِي ابْنَ مُقَاتِلٍ ـ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي غَالِبٌ الْقَطَّانُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالظَّهَائِرِ فَسَجَدْنَا عَلَى ثِيَابِنَا اتِّقَاءَ الْحَرِّ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:When we offered the Zuhr prayers behind Allah's Messenger (ﷺ) we used to prostrate on our clothes to protect ourselves from the heat",
          "ur": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا ہم سے خالد بن عبدالرحمٰن نے بیان کیا، انہوں نے کہا مجھ سے غالب قطان نے بکر بن عبداللہ مزنی کے واسطہ سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے آپ نے فرمایا کہ جب ہم ( گرمیوں میں ) نبی کریم صلی اللہ علیہ وسلم کے پیچھے ظہر کی نماز دوپہر دن میں پڑھتے تھے تو گرمی سے بچنے کے لیے کپڑوں پر سجدہ کیا کرتے۔",
          "fr": "Rapporté par Anas bin Malik : Quand nous faisions la prière du Zuhr derrière le Messager d’Allah (ﷺ), nous nous prosternions sur nos vêtements pour nous protéger de la chaleur",
          "id": "Telah menceritakan kepada kami [Muhammad] -yakni Ibnu Muqatil-berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Khalid bin 'Abdurrahman] telah menceritakan kepadaku [Ghalib Al Qaththan] dari [Bakar bin 'Abdullah Al Muzani] dari [Anas bin Malik] ia berkata, \"Jika kami shalat di belakang Rasulullah shallallahu 'alaihi wasallam pada shalat Zhuhur saat udara panas, kami sujud beralaskan pakaian kami untuk menghindari panasnya pasir",
          "tr": "Enes İbn Mâlikten şöyle nakledilmiştir. \"Rasulullah Sallallahu Aleyhi ve Sellem'in arkasında öğlenin en sıcak anlarında na­maz kıldığımız zaman, sıcaktan korunmak için elbiselerimizin üzerine secde ederdik"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 19
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 543,
      "arabicNumber": 543,
      "book": 9,
      "hadithInBook": 20,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِالْمَدِينَةِ سَبْعًا وَثَمَانِيًا الظُّهْرَ وَالْعَصْرَ، وَالْمَغْرِبَ وَالْعِشَاءَ‏.‏ فَقَالَ أَيُّوبُ لَعَلَّهُ فِي لَيْلَةٍ مَطِيرَةٍ‏.‏ قَالَ عَسَى‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:\"The Prophet (ﷺ) prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers in Medina.\" Aiyub said, \"Perhaps those were rainy nights.\" Anas said, \"May be",
          "ur": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا عمرو بن دینار سے۔ انہوں نے جابر بن زید سے، انہوں نے ابن عباس رضی اللہ عنہما سے کہ نبی کریم صلی اللہ علیہ وسلم نے مدینہ میں رہ کر سات رکعات ( ایک ساتھ ) اور آٹھ رکعات ( ایک ساتھ ) پڑھیں۔ ظہر اور عصر ( کی آٹھ رکعات ) اور مغرب اور عشاء ( کی سات رکعات ) ایوب سختیانی نے جابر بن زید سے پوچھا شاید برسات کا موسم رہا ہو۔ جابر بن زید نے جواب دیا کہ غالباً ایسا ہی ہو گا۔",
          "fr": "Rapporté par Ibn `Abbas : « Le Prophète (ﷺ) a prié huit rak`at pour le Zuhr et le `Asr, et sept pour le Maghrib et le `Isha à Médine. » Aiyub a dit : « Peut-être que c’était des nuits de pluie. » Anas a dit : « Peut-être. »",
          "id": "Telah menceritakan kepada kami [Abu AN Nu'man] berkata, telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- dari ['Amru bin Dinar] dari [Jabir bin Zaid] dari [Ibnu 'Abbas], bahwa Nabi shallallahu 'alaihi wasallam pernah melaksanakan shalat di Madinah sebanyak tujuh dan delapan, yaitu shalat Zhuhur, 'Ashar, Maghrib dan 'Isya'.\" Ayyub berkata, \"Barangkali hal itu ketika pada malam itu hujan.\" Ibnu Abbas berkata, \"Bisa jadi",
          "tr": "İbn Abbâs'tan şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Medine'de öğle İle ikindi namazını birlikte sekiz rekat, akşam ile yatsı namazını da yedi rekat olarak kıldırmıştır.\" Ravilerden Eyyub kendisinden önceki râvî Câbir'e Bu olay yağmurlu bir gecede vaki olmuş olabilir mi?' diye sormuş, o da 'Muhtemelen' diye cevap vermiştir. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 20
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 544,
      "arabicNumber": 544,
      "book": 9,
      "hadithInBook": 21,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْعَصْرَ وَالشَّمْسُ لَمْ تَخْرُجْ مِنْ حُجْرَتِهَا‏.‏ وَقَالَ أَبُو أُسَامَةَ عَنْ هِشَامٍ مِنْ قَعْرِ حُجْرَتِهَا‏.‏",
        "translations": {
          "en": "Narrated Aisha:Allah's Messenger (ﷺ) used to offer the `Asr prayer when the sunshine had not disappeared from my chamber",
          "ur": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا ہم سے انس بن عیاض لیثی نے ہشام بن عروہ کے واسطہ سے بیان کیا، انہوں نے اپنے والد سے کہ مائی عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم عصر کی نماز ایسے وقت پڑھتے تھے کہ ان کے حجرہ میں سے ابھی دھوپ باہر نہیں نکلتی تھی۔",
          "fr": "Rapporté par Aisha : Le Messager d’Allah (ﷺ) accomplissait la prière du `Asr alors que le soleil n’avait pas encore quitté ma chambre",
          "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir] berkata, telah menceritakan kepada kami [Anas bin 'Iyadl] dari [Hisyam] dari [Bapaknya] bahwa ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat 'Ashar sedangkan matahari belum berlalu dari kamarnya (rumah 'Aisyah).\" [Abu Umamah] menyebutkan dari [Hisyam], \"Dari dalam kamarnya (posisi cahayanya)",
          "tr": "Hişam babası (Urve) kanalıyla Âişe (r.anha)'nın şöyle dediğini nakletmiştir: \"Nebi Sallallahu Aleyhi ve Sellem güneş ışıkları odama girmeye devam ettiği bir sırada, ikindi namazını kılardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 21
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 545,
      "arabicNumber": 545,
      "book": 9,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا، لَمْ يَظْهَرِ الْفَىْءُ مِنْ حُجْرَتِهَا‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Allah's Messenger (ﷺ) used to offer the `Asr prayers at a time when the sunshine was still inside my chamber and no shadow had yet appeared in it",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے ابن شہاب سے بیان کیا، انہوں نے عروہ بن زبیر رضی اللہ عنہ سے، انہوں نے عائشہ صدیقہ رضی اللہ عنہا سے کہ رسول اللہ صلی اللہ علیہ وسلم نے عصر کی نماز پڑھی تو دھوپ ان کے حجرہ ہی میں تھی۔ سایہ وہاں نہیں پھیلا تھا۔",
          "fr": "Rapporté par `Aisha : Le Messager d’Allah (ﷺ) accomplissait la prière du `Asr à un moment où le soleil était encore dans ma chambre et aucune ombre n’y était encore apparue",
          "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah], bahwa Rasulullah shallallahu 'alaihi wasallam shalat 'Ashar sementara matahari yang ada dikamarnya belum menampakkan bayang-bayang",
          "tr": "Âişe(r.anha): Rasûlüllah (sallallahü aleyhi ve sellem) ikindi namazını henüz Âişe'nin hücresinde güneş varken ve gölge Âişe'nin hücresinden yükselmeden kılardı, demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 22
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 546,
      "arabicNumber": 546,
      "book": 9,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي صَلاَةَ الْعَصْرِ وَالشَّمْسُ طَالِعَةٌ فِي حُجْرَتِي لَمْ يَظْهَرِ الْفَىْءُ بَعْدُ‏.‏ وَقَالَ مَالِكٌ وَيَحْيَى بْنُ سَعِيدٍ وَشُعَيْبٌ وَابْنُ أَبِي حَفْصَةَ وَالشَّمْسُ قَبْلَ أَنْ تَظْهَرَ‏.‏",
        "translations": {
          "en": "Narrated Aisha:The Prophet (ﷺ) used to pray the `Asr prayers at a time when the sunshine was still inside my chamber and no shadow had yet appeared in it",
          "ur": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے ابن شہاب زہری سے بیان کیا، انہوں نے عروہ سے، انہوں نے عائشہ صدیقہ رضی اللہ عنہا سے، آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم جب عصر کی نماز پڑھتے تو سورج ابھی میرے حجرے میں جھانکتا رہتا تھا۔ ابھی سایہ نہ پھیلا ہوتا تھا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) کہتے ہیں کہ امام مالک اور یحییٰ بن سعید، شعیب رحمہم اللہ اور ابن ابی حفصہ کے روایتوں میں ( زہری سے ) «والشمس قبل أن تظهر‏» کے الفاظ ہیں، ( جن کا مطلب یہ ہے کہ دھوپ ابھی اوپر نہ چڑھی ہوتی ) ۔",
          "fr": "Rapporté par Aisha : Le Prophète (ﷺ) priait le `Asr à un moment où le soleil était encore dans ma chambre et aucune ombre n’y était encore apparue",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah mengabarkan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat 'Ashar sementara matahari muncul dari dalam kamarku dan belum nampak bayang-bayang.\" [Malik] dan [Yahya bin Sa'id] dan [Syu'aib] dan [Ibnu Abu Hafsh] menyebutkan, \"Sementara matahari belum lagi nampak bayangannya",
          "tr": "Aişe (r.anha) şöyle demiştir: \"Güneş ışıkları odama vururken, henüz gölgenin de uzamadığı bir vakitte Nebi Sallallahu Aleyhi ve Sellem ikindi namazını kılardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 23
      },
      "narrator": {
        "en": "Aisha"
      }
    },
    {
      "hadithNumber": 547,
      "arabicNumber": 547,
      "book": 9,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عَوْفٌ، عَنْ سَيَّارِ بْنِ سَلاَمَةَ، قَالَ دَخَلْتُ أَنَا وَأَبِي، عَلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ، فَقَالَ لَهُ أَبِي كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْمَكْتُوبَةَ فَقَالَ كَانَ يُصَلِّي الْهَجِيرَ الَّتِي تَدْعُونَهَا الأُولَى حِينَ تَدْحَضُ الشَّمْسُ، وَيُصَلِّي الْعَصْرَ، ثُمَّ يَرْجِعُ أَحَدُنَا إِلَى رَحْلِهِ فِي أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ ـ وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ ـ وَكَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ الَّتِي تَدْعُونَهَا الْعَتَمَةَ، وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا، وَكَانَ يَنْفَتِلُ مِنْ صَلاَةِ الْغَدَاةِ حِينَ يَعْرِفُ الرَّجُلُ جَلِيسَهُ، وَيَقْرَأُ بِالسِّتِّينَ إِلَى الْمِائَةِ‏.‏",
        "translations": {
          "en": "Narrated Saiyar bin Salama:I along with my father went to Abu- Barza Al-Aslami and my father asked him, \"How Allah's Messenger (ﷺ) used to offer the five compulsory congregational prayers?\" Abu- Barza said, \"The Prophet (ﷺ) used to pray the Zuhr prayer which you (people) call the first one at midday when the sun had just declined The `Asr prayer at a time when after the prayer, a man could go to the house at the farthest place in Medina (and arrive) while the sun was still hot. (I forgot about the Maghrib prayer). The Prophet (ﷺ) Loved to delay the `Isha which you call Al- `Atama [??] and he disliked sleeping before it and speaking after it. After the Fajr prayer he used to leave when a man could recognize the one sitting beside him and he used to recite between 60 to 100 Ayat (in the Fajr prayer)",
          "ur": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا ہمیں عوف نے خبر دی سیار بن سلامہ سے، انہوں نے بیان کیا کہ میں اور میرے باپ ابوبرزہ اسلمی رضی اللہ عنہ کی خدمت میں حاضر ہوئے۔ ان سے میرے والد نے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم فرض نمازیں کن وقتوں میں پڑھتے تھے۔ انہوں نے فرمایا کہ دوپہر کی نماز جسے تم ”پہلی نماز“ کہتے ہو سورج ڈھلنے کے بعد پڑھتے تھے۔ اور جب عصر پڑھتے اس کے بعد کوئی شخص مدینہ کے انتہائی کنارہ پر اپنے گھر واپس جاتا تو سورج اب بھی تیز ہوتا تھا۔ سیار نے کہا کہ مغرب کے وقت کے متعلق آپ نے جو کچھ کہا تھا وہ مجھے یاد نہیں رہا۔ اور عشاء کی نماز جسے تم «عتمه» کہتے ہو اس میں دیر کو پسند فرماتے تھے اور اس سے پہلے سونے کو اور اس کے بعد بات چیت کرنے کو ناپسند فرماتے اور صبح کی نماز سے اس وقت فارغ ہو جاتے جب آدمی اپنے قریب بیٹھے ہوئے دوسرے شخص کو پہچان سکتا اور صبح کی نماز میں آپ ساٹھ سے سو تک آیتیں پڑھا کرتے تھے۔",
          "fr": "Rapporté par Saiyar bin Salama : Je suis allé avec mon père voir Abu Barza Al-Aslami et mon père lui a demandé : « Comment le Messager d’Allah (ﷺ) accomplissait-il les cinq prières obligatoires en groupe ? » Abu Barza a répondu : « Le Prophète (ﷺ) priait le Zuhr, que vous appelez la première, à midi quand le soleil venait juste de décliner. La prière du `Asr était accomplie à un moment où, après la prière, quelqu’un pouvait aller jusqu’à la maison la plus éloignée de Médine et revenir alors que le soleil était encore chaud. (J’ai oublié pour la prière du Maghrib.) Le Prophète (ﷺ) aimait retarder la prière du `Isha, que vous appelez Al-`Atama, et il n’aimait pas dormir avant ni discuter après. Après la prière du Fajr, il partait quand on pouvait reconnaître la personne assise à côté de soi, et il récitait entre 60 et 100 versets (dans la prière du Fajr). »",
          "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami ['Auf] dari [Sayyar bin Salamah] berkata, \"Aku dan bapakku datang menemui [Abu Barzah Al Aslami]. Lalu bapakku berkata kepadanya, \"Bagaimana Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat yang diwajibkan?\" Abu Barzah menjawab, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat Zhuhur, yang kalian sebut sebagai waktu utama, saat matahari telah tergelincir, shalat 'Ashar ketika salah seorang dari kami kembali dengan kendaraannya di ujung Kota sementara matahari masih terasa panas sinarnya. Dan aku lupa apa yang dibaca beliau saat shalat Maghrib. Beliau lebih suka mengakhirkan shalat 'Isya yang kalian sebut dengan shalat 'atmah, dan beliau tidak suka tidur sebelum shalat Isya dan berbincang-bincang sesudahnya. Dan beliau melaksanakan shalat Shubuh ketika seseorang dapat mengetahui siapa yang ada di sebelahnya, beliau membaca enam hingga seratus ayat",
          "tr": "Seyyar İbn Selâme'den şöyle nakledilmiştir: \"Babamla birlikte Ebu Berze el-Eslemî'nin yanına gittik. Babam ona 'Rasulullah Sallallahu Aleyhi ve Sellem farz namazları nasıl ne zaman kılardı?' diye sordu. O da şöyle cevap verdi: 'Güneş en yüksek noktaya çıktıktan sonra batı istikametine doğru meyletmeye başlayınca sizin ilk namaz dediğiniz öğle namazını kılardı. Asr / İkindi namazını kıldığı zaman, bizden biri Medine'nin en ücra köşesinde bulunan evine gittiği zaman hâlâ güneş parlamaya devam ederdi. (Ravi Ebu Berze'nin) Akşam namazı hakkında söylediklerini unuttum' (demiştir); Sizin 'Ateme' dediğiniz yatsı namazını ise, geciktirirdi. Yatsı namazından önce uyumayı, bu namazdan sonra ise konuşmayı hoş karşılamazdı. Sabah namazını bitirdiği zaman herkes yanı başında oturanı tanırdı. Sabah namazında altmış ile yüz âyet arasında Kur'an okurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 24
      },
      "narrator": {
        "en": "Saiyar bin Salama"
      }
    },
    {
      "hadithNumber": 548,
      "arabicNumber": 548,
      "book": 9,
      "hadithInBook": 25,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَخْرُجُ الإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ فَنَجِدُهُمْ يُصَلُّونَ الْعَصْرَ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:We used to pray the `Asr prayer and after that if someone happened to go to the tribe of Bani `Amr bin `Auf, he would find them still praying the `Asr (prayer)",
          "ur": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، وہ امام مالک رحمہ اللہ علیہ سے، انہوں نے اسحاق بن عبداللہ بن ابی طلحہ سے روایت کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے اس حدیث کو روایت کیا، انہوں نے فرمایا کہ ہم عصر کی نماز پڑھ چکتے اور اس کے بعد کوئی بنی عمرو بن عوف ( قباء ) کی مسجد میں جاتا تو ان کو وہاں عصر کی نماز پڑھتے ہوئے پاتا۔",
          "fr": "Rapporté par Anas bin Malik : Nous faisions la prière du `Asr et, après cela, si quelqu’un allait chez la tribu de Bani `Amr bin `Auf, il les trouvait encore en train de prier le `Asr",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Ishaq bin 'Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata, \"Kami pernah shalat 'Ashar kemudian orang-orang keluar menuju Bani 'Amru bin 'Auf, dan kami dapati mereka sedang melaksanakan shalat 'Ashar",
          "tr": "Enes İbn Mâlik'ten şöyle nakledilmiştir: \"Biz İkindi namazını kılardık. Biri Amr İbn Avf oğullarının bulunduğu bölgeye gittiği zaman onların ikindi namazını kıldığını görürdü. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 25
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 549,
      "arabicNumber": 549,
      "book": 9,
      "hadithInBook": 26,
      "text": {
        "arabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، يَقُولُ صَلَّيْنَا مَعَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ الظُّهْرَ، ثُمَّ خَرَجْنَا حَتَّى دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ فَوَجَدْنَاهُ يُصَلِّي الْعَصْرَ فَقُلْتُ يَا عَمِّ، مَا هَذِهِ الصَّلاَةُ الَّتِي صَلَّيْتَ قَالَ الْعَصْرُ، وَهَذِهِ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي كُنَّا نُصَلِّي مَعَهُ‏.‏",
        "translations": {
          "en": "Narrated Abu Bakr bin `Uthman bin Sahl bin Hunaif:that he heard Abu Umama saying: We prayed the Zuhr prayer with `Umar bin `Abdul `Aziz and then went to Anas bin Malik and found him offering the `Asr prayer. I asked him, \"O uncle! Which prayer have you offered?\" He said 'The `Asr and this is (the time of) the prayer of Allah's Apostle which we used to pray with him",
          "ur": "ہم سے محمد بن مقاتل نے بیان کیا، انہوں نے کہا ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا ہمیں ابوبکر بن عثمان بن سہل بن حنیف نے خبر دی، انہوں نے کہا میں نے ابوامامہ (سعد بن سہل) سے سنا، وہ کہتے تھے کہ ہم نے عمر بن عبدالعزیز رحمہ اللہ علیہ کے ساتھ ظہر کی نماز پڑھی۔ پھر ہم نکل کر انس بن مالک رضی اللہ عنہ کی خدمت میں حاضر ہوئے تو دیکھا آپ نماز پڑھ رہے ہیں۔ میں نے عرض کی کہ اے مکرم چچا! یہ کون سی نماز آپ نے پڑھی ہے۔ فرمایا کہ عصر کی اور اسی وقت ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بھی یہ نماز پڑھتے تھے۔",
          "fr": "Rapporté par Abu Bakr bin `Uthman bin Sahl bin Hunaif : Il a entendu Abu Umama dire : Nous avons prié le Zuhr avec `Umar bin `Abdul `Aziz puis nous sommes allés voir Anas bin Malik et nous l’avons trouvé en train de faire la prière du `Asr. Je lui ai demandé : « Ô oncle ! Quelle prière viens-tu de faire ? » Il a répondu : « Le `Asr, et c’est à ce moment-là que le Messager d’Allah (ﷺ) priait avec nous. »",
          "id": "Telah menceritakan kepada kami [Ibnu Muqatil] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Abu Bakar bin Utsman bin Sahl bin Hunaif] berkata, \"Aku mendengar [Abu Umamah bin Sahl] berkata, \"Kami pernah shalat Zhuhur bersama 'Umar bin 'Abdul 'Aziz. Setelah selesai kami keluar mendatangi [Anas bin Malik], dan saat itu kami dapati mereka sedang melaksanakan shalat 'Ashar. Maka aku pun bertanya, \"Wahai paman, shalat apakah yang kamu kerjakan ini?\" Dia menjawab, \"Shalat 'Ashar. Saat seperti inilah shalat Rasulullah shallallahu 'alaihi wasallam yang pernah kami lakukan bersamanya",
          "tr": "Ebu Bekir İbn Osman İbn Sehl İbn Huneyf, Ebu Ümâme'nin şöyle dediğini işittiğini nakletmiştir: \"Ömer İbn Abdülaziz ile birlikte öğle namazını kıldık. Sonra çıkıp Enes İbn Mâlik'in yanına gittik. O esnada ikindi namazını kılıyordu. Ona Amca! Hangi namazı kılıyorsun?' diye sordum. O da şöyle cevap verdi: İkindi namazını kılıyorum. Biz, Nebi Sallallahu Aleyhi ve Sellem ile birlikte böyle namaz kılardık"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 26
      },
      "narrator": {
        "en": "Abu Bakr bin `Uthman bin Sahl bin Hunaif"
      }
    },
    {
      "hadithNumber": 550,
      "arabicNumber": 550,
      "book": 9,
      "hadithInBook": 27,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ حَيَّةٌ، فَيَذْهَبُ الذَّاهِبُ إِلَى الْعَوَالِي فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ، وَبَعْضُ الْعَوَالِي مِنَ الْمَدِينَةِ عَلَى أَرْبَعَةِ أَمْيَالٍ أَوْ نَحْوِهِ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:Allah's Messenger (ﷺ) used to offer the `Asr prayer at a time when the sun was still hot and high and if a person went to Al-`Awali (a place) of Medina, he would reach there when the sun was still high. Some of Al-`Awali of Medina were about four miles or so from the town",
          "ur": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا کہ کہا ہمیں شعیب بن ابی حمزہ نے زہری سے خبر دی، انہوں نے کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا، انہوں نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم جب عصر کی نماز پڑھتے تو سورج بلند اور تیز روشن ہوتا تھا۔ پھر ایک شخص مدینہ کے بالائی علاقہ کی طرف جاتا وہاں پہنچنے کے بعد بھی سورج بلند رہتا تھا ( زہری نے کہا کہ ) مدینہ کے بالائی علاقہ کے بعض مقامات تقریباً چار میل پر یا کچھ ایسے ہی واقع ہیں۔",
          "fr": "Rapporté par Anas bin Malik : Le Messager d’Allah (ﷺ) accomplissait la prière du `Asr à un moment où le soleil était encore haut et chaud, et si quelqu’un allait à Al-`Awali (un endroit) de Médine, il y arrivait alors que le soleil était encore haut. Certains endroits d’Al-`Awali se trouvaient à environ quatre miles ou plus de la ville",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhrii] berkata, telah menceritakan kepadaku [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan shalat 'Ashar saat matahari masih meninggi. Dan jika ada seseorang pergi menemui keluarganya kemudian kembali, maka ia akan mendapati matahari masih tinggi. Sedangkan sebagian desa jaraknya dengan Madinah ada yang berjarak sampai empat mil atau sekitar itu",
          "tr": "Zührî, Enes İbn Mâlik'in kendisine şöyle naklettiğini bildirmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ikindi namazını güneş yüksekte ışık saçmaya devam ederken kılardı. Hatta biri namazı kıldıktan sonra Medine'nin Avâlî'sine gidip gelir de, güneş hala ışık saçmaya devam ederdi. Medine'nin Avalî'sinin bir kısmı, yaklaşık olarak dört mil uzaklıkta idi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 27
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 551,
      "arabicNumber": 551,
      "book": 9,
      "hadithInBook": 28,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَذْهَبُ الذَّاهِبُ مِنَّا إِلَى قُبَاءٍ، فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ‏.‏",
        "translations": {
          "en": "Narrated Anas bin Malik:We used to pray the `Asr and after that if one of us went to Quba' he would arrive there while the sun was still high",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہمیں امام مالک رحمہ اللہ علیہ نے ابن شہاب زہری کے واسطہ سے خبر دی، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ آپ نے فرمایا ہم عصر کی نماز پڑھتے ( نبی کریم صلی اللہ علیہ وسلم کے ساتھ ) اس کے بعد کوئی شخص قباء جاتا اور جب وہاں پہنچ جاتا تو سورج ابھی بلند ہوتا تھا۔",
          "fr": "Rapporté par Anas bin Malik : Nous faisions la prière du `Asr et, après cela, si l’un d’entre nous allait à Quba’, il y arrivait alors que le soleil était encore haut",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Anas bin Malik] berkata, \"Kami pernah melakanakan shalat 'Ashar, dan jika salah seorang dari kami pergi ke Quba mendatangi mereka (penduduk), maka matahari masih tinggi",
          "tr": "Enes İbn Mâlik'in şöyle dediği nakledilmiştir: \"Biz ikindi namazını kılardık. Sonra içimizden biri Kuba'ya gidip dönerdi. Bu esnada güneş, hâlâ yüksekte bulunurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 28
      },
      "narrator": {
        "en": "Anas bin Malik"
      }
    },
    {
      "hadithNumber": 552,
      "arabicNumber": 552,
      "book": 9,
      "hadithInBook": 29,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الَّذِي تَفُوتُهُ صَلاَةُ الْعَصْرِ كَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) said, \"Whoever misses the `Asr prayer (intentionally) then it is as if he lost his family and property",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہمیں امام مالک نے نافع کے ذریعہ سے خبر پہنچائی، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، جس کی نماز عصر چھوٹ گئی گویا اس کا گھر اور مال سب لٹ گیا۔ امام بخاری رحمہ اللہ نے فرمایا کہ سورۃ محمد میں جو «يترکم» کا لفظ آیا ہے وہ «وتر» سے نکالا گیا ہے۔ «وتر» کہتے ہیں کسی شخص کا کوئی آدمی مار ڈالنا یا اس کا مال چھین لینا۔",
          "fr": "Rapporté par Ibn `Umar : Le Messager d’Allah (ﷺ) a dit : « Celui qui manque intentionnellement la prière du `Asr, c’est comme s’il avait perdu sa famille et ses biens. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang kehilangan shalat 'Ashar (dengan berjama'ah) seperti orang yang kehilangan keluarga dan hartanya.\" Saat menafsirkan ayat: '(Dia sekali-kali tidak akan mengurangi) ' (Qs. Muhammad: 35) Abu Abdullah berkata, \"Bila kamu membunuh seseorang atau kamu mengambil hartanya",
          "tr": "İbn Ömer (r.a.)'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu nakledilmiştir: \"İkindi namazını kaçıran kimse, ailesi helak olmuş, serveti batmış kimse gibidir.\" Diğer tahric: Tirmizi Salat; Nesâî, Mesâcid"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 29
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 553,
      "arabicNumber": 553,
      "book": 9,
      "hadithInBook": 30,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، قَالَ كُنَّا مَعَ بُرَيْدَةَ فِي غَزْوَةٍ فِي يَوْمٍ ذِي غَيْمٍ فَقَالَ بَكِّرُوا بِصَلاَةِ الْعَصْرِ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ صَلاَةَ الْعَصْرِ فَقَدْ حَبِطَ عَمَلُهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Al-Malih [??]:We were with Buraida in a battle on a cloudy day and he said, \"Offer the `Asr prayer early as the Prophet said, \"Whoever leaves the `Asr prayer, all his (good) deeds will be annulled",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے ہشام بن عبداللہ دستوائی نے بیان کیا، کہا ہمیں یحییٰ بن ابی کثیر نے ابوقلابہ عبداللہ بن زید سے خبر دی۔ انہوں نے ابوالملیح سے، کہا ہم بریدہ رضی اللہ عنہ کے ساتھ ایک سفر جنگ میں تھے۔ ابر و بارش کا دن تھا۔ آپ نے فرمایا کہ عصر کی نماز جلدی پڑھ لو۔ کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے عصر کی نماز چھوڑ دی، اس کا نیک عمل ضائع ہو گیا۔",
          "fr": "Rapporté par Abu Al-Mahh : Nous étions avec Buraida lors d’une bataille un jour nuageux et il a dit : « Faites la prière du `Asr tôt, car le Prophète a dit : “Celui qui laisse la prière du `Asr, toutes ses bonnes actions seront annulées.” »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hisyam] berkata, telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Qilabah] dari [Al Malih] berkata, \"Kami pernah bersama [Buraidah] pada suatu peperangan saat cuaca mendung, lalu ia berkata, \"Segeralah laksanakan shalat 'Ashar! Karena Nabi shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa meninggalkan shalat 'Ashar sungguh hapuslah amalnya",
          "tr": "Ebu Melîh'ten şöyle nakledilmiştir: \"Bulutlu bir günde bir gazvede Büreyde ile beraberdik. Bize: 'İkindi namazını erken kılın!' diye talimat verdi. Sonra Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: Kim ikindi namazını terk ederse, ameli boşa gider. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 30
      },
      "narrator": {
        "en": "Abu Al-Malih [??]"
      }
    },
    {
      "hadithNumber": 554,
      "arabicNumber": 554,
      "book": 9,
      "hadithInBook": 31,
      "text": {
        "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةً ـ يَعْنِي الْبَدْرَ ـ فَقَالَ ‏\"‏ إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لاَ تُضَامُّونَ فِي رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أَنْ لاَ تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا فَافْعَلُوا ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ‏}‏‏.‏ قَالَ إِسْمَاعِيلُ افْعَلُوا لاَ تَفُوتَنَّكُمْ‏.‏",
        "translations": {
          "en": "Narrated Qais:Jarir said, \"We were with the Prophet (ﷺ) and he looked at the moon--full-moon--and said, 'Certainly you will see your Lord as you see this moon and you will have no trouble in seeing Him. So if you can avoid missing (through sleep or business, etc.) a prayer before the sunrise (Fajr) and a prayer before sunset (`Asr), you must do so.' He then recited Allah's Statement: And celebrate the praises Of your Lord before the rising of the sun and before (its) setting.\" (50.39) Isma`il said, \"Offer those prayers and do not miss them",
          "ur": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے مروان بن معاویہ نے، کہا ہم سے اسماعیل بن ابی خالد نے قیس بن ابی حازم سے۔ انہوں نے جریر بن عبداللہ بجلی رضی اللہ عنہ سے، انہوں نے کہا کہ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھے۔ آپ صلی اللہ علیہ وسلم نے چاند پر ایک نظر ڈالی پھر فرمایا کہ تم اپنے رب کو ( آخرت میں ) اسی طرح دیکھو گے جیسے اس چاند کو اب دیکھ رہے ہو۔ اس کے دیکھنے میں تم کو کوئی زحمت بھی نہیں ہو گی، پس اگر تم ایسا کر سکتے ہو کہ سورج طلوع ہونے سے پہلے والی نماز ( فجر ) اور سورج غروب ہونے سے پہلے والی نماز ( عصر ) سے تمہیں کوئی چیز روک نہ سکے تو ایسا ضرور کرو۔ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی کہ ”پس اپنے مالک کی حمد و تسبیح کر سورج طلوع ہونے اور غروب ہونے سے پہلے۔“ اسماعیل ( راوی حدیث ) نے کہا کہ ( عصر اور فجر کی نمازیں ) تم سے چھوٹنے نہ پائیں۔ ان کا ہمیشہ خاص طور پر دھیان رکھو۔",
          "fr": "Rapporté par Qais : Jarir a dit : « Nous étions avec le Prophète (ﷺ) et il a regardé la lune, pleine, et a dit : “Vous verrez certainement votre Seigneur comme vous voyez cette lune, et vous n’aurez aucune difficulté à Le voir. Donc, si vous pouvez éviter de manquer (par sommeil ou occupation, etc.) une prière avant le lever du soleil (Fajr) et une prière avant le coucher du soleil (`Asr), faites-le.” Il a ensuite récité la parole d’Allah : Et célèbre les louanges de ton Seigneur avant le lever du soleil et avant son coucher. (50.39) Isma`il a dit : “Accomplissez ces prières et ne les manquez pas.” »",
          "id": "Telah menceritakan kepada kami [Al Humaidi] berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah] berkata, telah menceritakan kepada kami [Isma'il] dari [Qais] dari [Jarir bin 'Abdullah] berkata, \"Pada suatu malam kami pernah bersama Nabi shallallahu 'alaihi wasallam, beliau lalu melihat ke arah bulan purnama. Kemudian beliau bersabda: \"Sesungguhnya kalian akan melihat Rabb kalian sebagaimana kalian melihat bulan purnama ini. Dan kalian tidak akan saling berdesakan dalam melihat-Nya. Maka jika kalian mampu untuk tidak terlewatkan untuk melaksanakan shalat sebelum terbit matahri dan sebelum terbenamnya, maka lakukanlah.\" Beliau kemudian membaca ayat: '(Dan bertasbihlah sambil memuji Rabbmu sebelum terbit matahari dan sebelum terbenamnya) ' (Qs. Qaaf: 39). Isma'il menyebutkan, \"Kerjakanlah dan sekali-kali jangan sampai kalian terlewatkan",
          "tr": "Cerîr (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikteydik. Bir gece ay'a (dolunaya) baktı ve şöyle buyurdu: Şu ay'ı gördüğünüz gibi kuşkusuz Rabbiniz'i de âhirette göreceksiniz. Onu görme konusunda hiç haksızlığa uğramayacaksınız. Güneşin doğuşundan ve batışından önceki namazları geçirmemeyi başarabîliyorsanız, bunu yapın!\" Sonra Cerîr, \"Güneşin doğmasından önce de, batmasından önce de Rabbini hamd ile tesbih et! [Tâhâ 130.] âyetini okudu. İsmail şöyle dedi: \"Bunu yapın ve sakın bir vakit namazı geçirmeyin! Tekrar: 573, 4851, 7434, 7435, 7436. Diğer tahric: Tirmizi Cennet; Müslim, Mesacid dede tahric ettiler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 31
      },
      "narrator": {
        "en": "Qais"
      }
    },
    {
      "hadithNumber": 555,
      "arabicNumber": 555,
      "book": 9,
      "hadithInBook": 32,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَتَعَاقَبُونَ فِيكُمْ مَلاَئِكَةٌ بِاللَّيْلِ وَمَلاَئِكَةٌ بِالنَّهَارِ، وَيَجْتَمِعُونَ فِي صَلاَةِ الْفَجْرِ وَصَلاَةِ الْعَصْرِ، ثُمَّ يَعْرُجُ الَّذِينَ بَاتُوا فِيكُمْ، فَيَسْأَلُهُمْ وَهْوَ أَعْلَمُ بِهِمْ كَيْفَ تَرَكْتُمْ عِبَادِي فَيَقُولُونَ تَرَكْنَاهُمْ وَهُمْ يُصَلُّونَ، وَأَتَيْنَاهُمْ وَهُمْ يُصَلُّونَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Angels come to you in succession by night and day and all of them get together at the time of the Fajr and `Asr prayers. Those who have passed the night with you (or stayed with you) ascend (to the Heaven) and Allah asks them, though He knows everything about you, well, \"In what state did you leave my slaves?\" The angels reply: \"When we left them they were praying and when we reached them, they were praying",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم سے امام مالک رحمہ اللہ علیہ نے ابوالزناد عبداللہ بن ذکوان سے، انہوں نے عبدالرحمٰن بن ہرمز اعرج سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ رات اور دن میں فرشتوں کی ڈیوٹیاں بدلتی رہتی ہیں۔ اور فجر اور عصر کی نمازوں میں ( ڈیوٹی پر آنے والوں اور رخصت پانے والوں کا ) اجتماع ہوتا ہے۔ پھر تمہارے پاس رہنے والے فرشتے جب اوپر چڑھتے ہیں تو اللہ تعالیٰ پوچھتا ہے حالانکہ وہ ان سے بہت زیادہ اپنے بندوں کے متعلق جانتا ہے، کہ میرے بندوں کو تم نے کس حال میں چھوڑا۔ وہ جواب دیتے ہیں کہ ہم نے جب انہیں چھوڑا تو وہ ( فجر کی ) نماز پڑھ رہے تھے اور جب ان کے پاس گئے تب بھی وہ ( عصر کی ) نماز پڑھ رہے تھے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Les anges viennent à vous en alternance, la nuit et le jour, et tous se réunissent au moment des prières du Fajr et du `Asr. Ceux qui sont restés avec vous la nuit montent (au ciel) et Allah leur demande, bien qu’Il sache parfaitement votre état : “Dans quel état avez-vous laissé Mes serviteurs ?” Les anges répondent : “Quand nous les avons quittés, ils étaient en train de prier, et quand nous sommes arrivés, ils priaient.” »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Para Malaikat malam dan Malaikat siang silih berganti mendatangi kalian. Dan mereka berkumpul saat shalat Fajar (Subuh) dan 'Ashar. Kemudian Malaikat yang menjaga kalian naik ke atas hingga Allah Ta'ala bertanya kepada mereka, dan Allah lebih mengetahui keadaan mereka (para hamba-Nya), 'Dalam keadaan bagaimana kalian tinggalkan hamba-hambaKu? ' Para Malaikat menjawab, 'Kami tinggalkan mereka dalam keadaan sedang mendirikan shalat. Begitu juga saat kami mendatangi mereka, mereka sedang mendirikan shalat",
          "tr": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Bazı melekler gece, bazıları da gündüz nöbetleşe yanınıza gelir. Bunlar, sabah ve ikindi namazlarında bir araya gelirler. Daha sonra gece sizin yanınızda olanlar Hak Teâlâ'nın huzuruna çıkar. Allah Teâlâ kullarını en iyi kendisi bilmesine rağmen yine de onlara 'Kullarımı nasıl bıraktınız?' diye sorar. Onlar da: Yanlarından ayrılırken namaz kılıyorlardı. Yanlarına vardığımızda da namaz kılıyorlardı' diye cevap verirler. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 32
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 556,
      "arabicNumber": 556,
      "book": 9,
      "hadithInBook": 33,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَدْرَكَ أَحَدُكُمْ سَجْدَةً مِنْ صَلاَةِ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَلْيُتِمَّ صَلاَتَهُ، وَإِذَا أَدْرَكَ سَجْدَةً مِنْ صَلاَةِ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَلْيُتِمَّ صَلاَتَهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"If anyone of you can get one rak`a of the `Asr prayer before sunset, he should complete his prayer. If any of you can get one rak`a of the Fajr prayer before sunrise, he should complete his prayer",
          "ur": "ہم سے ابونعیم نے بیان کیا، انہوں نے کہا ہم سے شیبان نے یحییٰ بن ابی کثیر سے، انہوں نے ابوسلمہ سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر عصر کی نماز کی ایک رکعت بھی کوئی شخص سورج غروب ہونے سے پہلے پا سکا تو پوری نماز پڑھے ( اس کی نماز ادا ہوئی نہ قضاء ) اسی طرح اگر سورج طلوع ہونے سے پہلے فجر کی نماز کی ایک رکعت بھی پا سکے تو پوری نماز پڑھے۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Si l’un de vous arrive à faire une rak`a de la prière du `Asr avant le coucher du soleil, il doit terminer sa prière. Si l’un de vous arrive à faire une rak`a de la prière du Fajr avant le lever du soleil, il doit terminer sa prière. »",
          "id": "Telah menceritakan kepada kami [Abu An Nu'aim] berkata, telah menceritakan kepada kami [Syaiban] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seeorang dari kalian mendapatkan sujud shalat 'Ashar sebelum terbenam matahari maka sempurnakanlah, dan jika mendapatkan sujud shalat Subuh sebelum terbit matahari maka sempurnakanlah",
          "tr": "Ebu Hureyre (r.a.), Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Siz'den biri, güneş batmadan önce ikindi namazının bîr secdesini yapmış ise, namazını tamamlasın. Aynı şekilde güneş doğmadan sabah namazının bir secdesini yapmış ise, namazını tamamlasın. Tekrar: 579, 580. Diğer tahric: Tirmizi Salat; Nesâî, Mevâkît"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 33
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 557,
      "arabicNumber": 557,
      "book": 9,
      "hadithInBook": 34,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّمَا بَقَاؤُكُمْ فِيمَا سَلَفَ قَبْلَكُمْ مِنَ الأُمَمِ كَمَا بَيْنَ صَلاَةِ الْعَصْرِ إِلَى غُرُوبِ الشَّمْسِ، أُوتِيَ أَهْلُ التَّوْرَاةِ التَّوْرَاةَ فَعَمِلُوا حَتَّى إِذَا انْتَصَفَ النَّهَارُ عَجَزُوا، فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُوتِيَ أَهْلُ الإِنْجِيلِ الإِنْجِيلَ فَعَمِلُوا إِلَى صَلاَةِ الْعَصْرِ، ثُمَّ عَجَزُوا، فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُوتِينَا الْقُرْآنَ فَعَمِلْنَا إِلَى غُرُوبِ الشَّمْسِ، فَأُعْطِينَا قِيرَاطَيْنِ قِيرَاطَيْنِ، فَقَالَ أَهْلُ الْكِتَابَيْنِ أَىْ رَبَّنَا أَعْطَيْتَ هَؤُلاَءِ قِيرَاطَيْنِ قِيرَاطَيْنِ، وَأَعْطَيْتَنَا قِيرَاطًا قِيرَاطًا، وَنَحْنُ كُنَّا أَكْثَرَ عَمَلاً، قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ هَلْ ظَلَمْتُكُمْ مِنْ أَجْرِكُمْ مِنْ شَىْءٍ قَالُوا لاَ، قَالَ فَهْوَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Salim bin `Abdullah:My father said, \"I heard Allah's Messenger (ﷺ) saying, 'The period of your stay as compared to the previous nations is like the period equal to the time between the `Asr prayer and sunset. The people of the Torah were given the Torah and they acted (upon it) till midday then they were exhausted and were given one Qirat (of gold) each. And then the people of the Gospel were given the Gospel and they acted (upon it) till the `Asr prayer then they were exhausted and were given one Qirat each. And then we were given the Qur'an and we acted (upon it) till sunset and we were given two Qirats each. On that the people of both the scriptures said, 'O our Lord! You have given them two Qirats and given us one Qirat, though we have worked more than they.' Allah said, 'Have I usurped some of your right?' They said, 'No.' Allah said: \"That is my blessing I bestow upon whomsoever I wish",
          "ur": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا، کہا مجھ سے ابراہیم بن سعد نے ابن شہاب سے، انہوں نے سالم بن عبداللہ بن عمر رضی اللہ عنہما سے، انہوں نے اپنے باپ عبداللہ بن عمر رضی اللہ عنہما سے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ تم سے پہلے کی امتوں کے مقابلہ میں تمہاری زندگی صرف اتنی ہے جتنا عصر سے سورج ڈوبنے تک کا وقت ہوتا ہے۔ توراۃ والوں کو توراۃ دی گئی۔ تو انہوں نے اس پر ( صبح سے ) عمل کیا۔ آدھے دن تک پھر وہ عاجز آ گئے، کام پورا نہ کر سکے، ان لوگوں کو ان کے عمل کا بدلہ ایک ایک قیراط دیا گیا۔ پھر انجیل والوں کو انجیل دی گئی، انہوں نے ( آدھے دن سے ) عصر تک اس پر عمل کیا، اور وہ بھی عاجز آ گئے۔ ان کو بھی ایک ایک قیراط ان کے عمل کا بدلہ دیا گیا۔ پھر ( عصر کے وقت ) ہم کو قرآن ملا۔ ہم نے اس پر سورج کے غروب ہونے تک عمل کیا ( اور کام پورا کر دیا ) ہمیں دو دو قیراط ثواب ملا۔ اس پر ان دونوں کتاب والوں نے کہا۔ اے ہمارے پروردگار! انہیں تو آپ نے دو دو قیراط دئیے اور ہمیں صرف ایک ایک قیراط۔ حالانکہ عمل ہم نے ان سے زیادہ کیا۔ اللہ عزوجل نے فرمایا، تو کیا میں نے اجر دینے میں تم پر کچھ ظلم کیا۔ انہوں نے عرض کی کہ نہیں۔ اللہ تعالیٰ نے فرمایا کہ پھر یہ ( زیادہ اجر دینا ) میرا فضل ہے جسے میں چاہوں دے سکتا ہوں۔",
          "fr": "Rapporté par Salim bin `Abdullah : Mon père a dit : « J’ai entendu le Messager d’Allah (ﷺ) dire : ‘La durée de votre communauté par rapport aux nations précédentes ressemble à la période entre la prière du `Asr et le coucher du soleil. Les gens de la Torah ont reçu la Torah et l’ont appliquée jusqu’à midi, puis ils se sont fatigués et ont reçu chacun un qirat (d’or). Ensuite, les gens de l’Évangile ont reçu l’Évangile et l’ont appliqué jusqu’à la prière du `Asr, puis ils se sont fatigués et ont reçu chacun un qirat. Puis nous avons reçu le Coran et nous l’avons appliqué jusqu’au coucher du soleil, et nous avons reçu chacun deux qirats.’ Les gens des deux Écritures ont dit : ‘Ô notre Seigneur ! Tu leur as donné deux qirats et à nous un seul, alors que nous avons travaillé plus qu’eux.’ Allah a dit : ‘Ai-je pris une partie de votre droit ?’ Ils ont répondu : ‘Non.’ Allah a dit : ‘C’est Ma grâce que Je donne à qui Je veux.’ »",
          "id": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah Al Uwaisi] berkata, telah menceritakan kepadaku [Ibrahim bin Sa'ad] dari [Ibnu Syihab] dari [Salim bin 'Abdullah] dari [Bapaknya] ia mengabarkan kepadanya, bahwa dia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya keberadaan kalian dibandingakan ummat-ummat sebelum kalian seperti masa antara shalat 'Ashar dan terbenamnya matahari. Ahlu Taurat diberikan Kitab Taurat, kemudian mereka mengamalkannya hingga apabila sampai pertengahan siang hari mereka menjadi lemah (tidak kuat sehingga melalaikannya). Maka mereka diberi pahala satu qirath satu qirath. Kemudian Ahlu Injil diberikan Kitab Injil, lalu mereka mengamalkannya hingga waktu shalat 'Ashar, dan mereka pun melemah. Maka merekapun diberi pahala satu qirath satu qirath. Sedangkan kita diberikan Al Qur'an, lalu kita mengamalkannya hingga matahari terbenam, maka kita diberi pahala dua qirath dua qirath. kedua Ahlul Kitab tersebut berkata, 'Wahai Rabb kami, bagaimana Engkau memberikan mereka dua qirath dua qirath dan Engkau beri kami satu qirath satu qirath. Padahal kami lebih banyak beramal! ' Beliau melanjutkan kisahnya: \"Maka Allah 'azza wajalla bertanya: 'Apakah Aku menzhalimi sesuatu dari bagian pahala kalian? ' Mereka menjawab, 'Tidak'. Maka Allah 'azza wajalla berfirman: 'Itulah karunia-Ku yang Aku berikan kepada siapa yang Aku kehendaki",
          "tr": "Salim bin Abdullah, babasının kendisine Nebi Sallallahu Aleyhi ve Sellem'in Şöyle buyurduğunu naklettiğini bildirmiştir: \"Önceki ümmetlere nispeten sizin dünyada kalmanız, (tam güne göre) ikindi namazı İle güneşin batması arasında geçen süre kadardır. Tevrat ehline, Tevrat verildi. (Onun içindekilerle) amel etmeye başladılar. Gün ortasına gelince artık çalışamaz oldular. Yine de, birer kırat ile ödüllendirildiler. Sonra incil ehline incil verildi. İkindi namazına kadar çalıştılar. Sonra onlar da çalışmaktan aciz kaldılar. Yine de birer kırat ile ödüllendirildiler. Bize de Kur'an verildi. Güneş batıncaya kadar onunla amel ettik. Bize ikişer kırat, ikişer kırat verildi. Bunun üzerine Ehl-i kitap: Ey Rabbimiz, bunlara ikişer kırat ikişer kırat verdin. Bize ise birer birer verdin. Oysa biz onlardan daha çok çalıştık' dediler. Hak Teâlâ da onlara: 'Ücretiniz konusunda size en ufak bir haksızlık yaptım mı?' diye sordu. Onlar: Hayır' deyince şöyle buyurdu: Bu benim lütfumdandır. Lütfumu da dilediğime veririm. Tekrar: 2268, 2269, 3459, 5021, 7467, 7533 Diğer tahric: Tirmizi Emsal de tahric etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 34
      },
      "narrator": {
        "en": "Salim bin `Abdullah"
      }
    },
    {
      "hadithNumber": 558,
      "arabicNumber": 558,
      "book": 9,
      "hadithInBook": 35,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْمُسْلِمِينَ وَالْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَأْجَرَ قَوْمًا يَعْمَلُونَ لَهُ عَمَلاً إِلَى اللَّيْلِ، فَعَمِلُوا إِلَى نِصْفِ النَّهَارِ، فَقَالُوا لاَ حَاجَةَ لَنَا إِلَى أَجْرِكَ، فَاسْتَأْجَرَ آخَرِينَ فَقَالَ أَكْمِلُوا بَقِيَّةَ يَوْمِكُمْ، وَلَكُمُ الَّذِي شَرَطْتُ، فَعَمِلُوا حَتَّى إِذَا كَانَ حِينَ صَلاَةِ الْعَصْرِ قَالُوا لَكَ مَا عَمِلْنَا‏.‏ فَاسْتَأْجَرَ قَوْمًا فَعَمِلُوا بَقِيَّةَ يَوْمِهِمْ حَتَّى غَابَتِ الشَّمْسُ، وَاسْتَكْمَلُوا أَجْرَ الْفَرِيقَيْنِ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Musa:The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night. They worked till midday and they said, 'We are not in need of your reward.' So the man employed another batch and said to them, 'Complete the rest of the day and yours will be the wages I had fixed (for the first batch). They worked until the time of the `Asr prayer and said, 'Whatever we have done is for you.' He employed another batch. They worked for the rest of the day till sunset, and they received the wages of the two former batches",
          "ur": "ہم سے ابوکریب محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے برید بن عبداللہ کے واسطہ سے بیان کیا، انہوں نے ابوبردہ عامر بن عبداللہ سے، انہوں نے اپنے باپ ابوموسیٰ اشعری عبداللہ بن قیس رضی اللہ عنہ سے۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مسلمانوں اور یہود و نصاری کی مثال ایک ایسے شخص کی سی ہے کہ جس نے کچھ لوگوں سے مزدوری پر رات تک کام کرنے کے لیے کہا۔ انہوں نے آدھے دن کام کیا۔ پھر جواب دے دیا کہ ہمیں تمہاری اجرت کی ضرورت نہیں، ( یہ یہود تھے ) پھر اس شخص نے دوسرے مزدور بلائے اور ان سے کہا کہ دن کا جو حصہ باقی بچ گیا ہے ( یعنی آدھا دن ) اسی کو پورا کر دو۔ شرط کے مطابق مزدوری تمہیں ملے گی۔ انہوں نے بھی کام شروع کیا لیکن عصر تک وہ بھی جواب دے بیٹھے۔ ( یہ نصاریٰ تھے ) پس اس تیسرے گروہ نے ( جو اہل اسلام ہیں ) پہلے دو گروہوں کے کام کی پوری مزدوری لے لی۔",
          "fr": "Rapporté par Abu Musa : Le Prophète (ﷺ) a dit : « L’exemple des musulmans, des juifs et des chrétiens est comme celui d’un homme qui a embauché des ouvriers pour travailler pour lui du matin au soir. Ils ont travaillé jusqu’à midi puis ont dit : ‘Nous n’avons pas besoin de ta récompense.’ Alors l’homme a embauché un autre groupe et leur a dit : ‘Finissez le reste de la journée et vous aurez le salaire que j’avais fixé pour le premier groupe.’ Ils ont travaillé jusqu’à la prière du `Asr puis ont dit : ‘Tout ce que nous avons fait est pour toi.’ Il a embauché un autre groupe. Ils ont travaillé le reste de la journée jusqu’au coucher du soleil, et ils ont reçu le salaire des deux premiers groupes. »",
          "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perumpaman Kaum Muslimin, Yahudi dan Nashara seperti seseorang yang memperkerjakan suatu Kaum, mereka harus bekerja untuknya hingga malam hari, sementara mereka hanya beramal hingga sianghari. Mereka berkata, 'Kami tidak patut menerima upah darimu. Akhirnya orang itu memperkerjakan Kaum yang lain dan berkata, 'Sempurnakanlah sisa hari yang ada, nanti kalian mendapatkan bagian upah sesuai persyaratanku.' Maka mereka mengerjakan pekerjaan hingga hanya sampai waktu 'Ashar, mereka lalu berkata, 'Kami kembalikan pekerjaan kepadamu.' Lalu orang itu memperkerjakan Kaum yang lain lagi. Maka Kaum tersebut bekerja menuntaskan sisa hari sampai matahari terbenam. Jadilah Kaum ini menyempurnakan pahala dua Kaum sebelumnya",
          "tr": "Ebu Musa Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: \"Müslümanlar ile Yahudi ve Hıristiyanlar'ın durumu şu örneğe benzer: Adamın biri, kendisi için gece vaktine kadar çalışmak şartıyla bir grup işçi ile anlaşır, işçiler öğlene kadar çalışır, sonra adama, 'Bizim senin vereceğin ücrete ihtiyacımız yok' deyip işi bırakırlar. Bunun üzerine adam, başka bir grup ile anlaşır. Onlara işin geri kalan kısmını tamamlayın, size ücretin tamamını vereyim' der. Onlar da, ikindi namazına kadar çalışıp adam'a, 'Çalıştığımız senin olsun! (ücret falan istemiyoruz)' derler. Nihayet adam, güneş batıncaya kadar günün geri kalan kısmında çalışan bir grupla anlaşır. Bu grup, öncekilerin ücretini de tam olarak alır. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 35
      },
      "narrator": {
        "en": "Abu Musa"
      }
    },
    {
      "hadithNumber": 559,
      "arabicNumber": 559,
      "book": 9,
      "hadithInBook": 36,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنَا أَبُو النَّجَاشِيِّ، صُهَيْبٌ مَوْلَى رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ، يَقُولُ كُنَّا نُصَلِّي الْمَغْرِبَ مَعَ النَّبِيِّ صلى الله عليه وسلم فَيَنْصَرِفُ أَحَدُنَا وَإِنَّهُ لَيُبْصِرُ مَوَاقِعَ نَبْلِهِ‏.‏",
        "translations": {
          "en": "Narrated Rafi` bin Khadij:We used to offer the Maghrib prayer with the Prophet (ﷺ) and after finishing the prayer one of us may go away and could still see as far as the spots where one's arrow might reach when shot by a bow",
          "ur": "ہم سے محمد بن مہران نے بیان کیا، کہا ہم سے ولید بن مسلمہ نے، انہوں نے کہا کہ ہم سے عبدالرحمٰن بن عمرو اوزاعی نے بیان کیا، کہا مجھ سے ابوالنجاشی نے بیان کیا، ان کا نام عطاء بن صہیب تھا اور یہ رافع بن خدیج رضی اللہ عنہ کے غلام ہیں۔ انہوں نے کہا کہ میں نے رافع بن خدیج سے سنا آپ نے فرمایا کہ ہم مغرب کی نماز نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھ کر جب واپس ہوتے اور تیر اندازی کرتے ( تو اتنا اجالا باقی رہتا تھا کہ ) ایک شخص اپنے تیر گرنے کی جگہ کو دیکھتا تھا۔",
          "fr": "Rapporté par Rafi` bin Khadij : Nous faisions la prière du Maghrib avec le Prophète (ﷺ) et, après avoir terminé la prière, l’un de nous pouvait encore voir aussi loin que l’endroit où une flèche tirée d’un arc pouvait atteindre",
          "id": "Telah menceritakan kepada kami [Muhammad bin Mihran] berkata, telah menceritakan kepada kami [Al Walid] berkata, telah menceritakan kepada kami [Al Awza'i] berkata, telah menceritakan kepada kami [Abu An Najasyi Shuhaib] mantan budak Rafi' bin Khadij, ia berkata, \"Aku pernah mendengar [Rafi' bin Khadij] berkata, \"Kami pernah shalat Maghrib bersama Nabi shallallahu 'alaihi wasallam, ketika salah seorang dari kami berlalu pergi, maka ia masih dapat melihat tempat sandal kami",
          "tr": "Râfi' bin Hadîc (r.a.) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte akşam namazını kılardık. Birimiz namazdan çıktıktan sonra (attığı) ok'un nereye düştüğünü görecek kadar, gün aydınlık olurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 36
      },
      "narrator": {
        "en": "Rafi` bin Khadij"
      }
    },
    {
      "hadithNumber": 560,
      "arabicNumber": 560,
      "book": 9,
      "hadithInBook": 37,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ قَدِمَ الْحَجَّاجُ فَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ بِالْهَاجِرَةِ، وَالْعَصْرَ وَالشَّمْسُ نَقِيَّةٌ، وَالْمَغْرِبَ إِذَا وَجَبَتْ، وَالْعِشَاءَ أَحْيَانًا وَأَحْيَانًا، إِذَا رَآهُمُ اجْتَمَعُوا عَجَّلَ، وَإِذَا رَآهُمْ أَبْطَوْا أَخَّرَ، وَالصُّبْحَ كَانُوا ـ أَوْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّيهَا بِغَلَسٍ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:The Prophet (ﷺ) used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the Maghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people assembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the prayer. And they or the Prophet (ﷺ) used to offer the Fajr Prayers when it was still dark",
          "ur": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے، کہا ہم سے شعبہ بن حجاج نے سعد بن ابراہیم سے، انہوں نے محمد بن عمرو بن حسن بن علی سے، انہوں نے کہا کہ حجاج کا زمانہ آیا ( اور وہ نماز دیر کر کے پڑھایا کرتا تھا اس لیے ) ہم نے جابر بن عبداللہ رضی اللہ عنہما سے اس کے بارے میں پوچھا تو انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز ٹھیک دوپہر میں پڑھایا کرتے تھے۔ ابھی سورج صاف اور روشن ہوتا تو نماز عصر پڑھاتے۔ نماز مغرب وقت آتے ہی پڑھاتے اور نماز عشاء کو کبھی جلدی پڑھاتے اور کبھی دیر سے۔ جب دیکھتے کہ لوگ جمع ہو گئے ہیں تو جلدی پڑھا دیتے اور اگر لوگ جلدی جمع نہ ہوتے تو نماز میں دیر کرتے۔ ( اور لوگوں کا انتظار کرتے ) اور صبح کی نماز صحابہ رضی اللہ عنہم یا ( یہ کہا کہ ) نبی کریم صلی اللہ علیہ وسلم اندھیرے میں پڑھتے تھے۔",
          "fr": "Rapporté par Jabir bin `Abdullah : Le Prophète (ﷺ) avait l’habitude de prier le Zuhr au milieu de la journée, et le `Asr quand le soleil brillait encore. Il priait le Maghrib après le coucher du soleil (à l’heure prévue) et l`Isha à des horaires variables. Quand il voyait que les gens étaient rassemblés pour la prière d’`Isha, il priait plus tôt, et si les gens tardaient, il retardait la prière. Lui ou les gens priaient le Fajr alors qu’il faisait encore nuit",
          "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Sa'ad bin Ibrahim] dari [Muhammad bin 'Amru bin Al Hasan bin 'Ali] berkata, \"Al Hajjaj pernah menunda pelaksanaan shalat, maka kami bertanya kepada [Jabir bin 'Abdullah]. Maka dia menjawab, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat Zhuhur ketika matahari telah condong, shalat 'Ashar saat matahari masih terasa panas sinarnya, shalat Maghrib ketika matahari telah terbenam, dan shalat 'Isya terkadang beliau mengikuti kedaan jama'ah; jika beliau lihat sudah berkumpul maka beliau segerakan, dan jika mereka belum berkumpul maka beliau akhirkan. Sementara untuk shalat Subuh, mereka atau beliau melaksanakannya saat pagi masih gelap",
          "tr": "Cabir İbn Abdullah (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Öğle namazını öğlenin en sıcak olduğu zamanda, İkindi namazını güneş beyaz ışık saçarken, akşam namazını güneş batınca kıldırırdi. Yatsı namazında ise esnek davranırdı. Cemaatin toplandığını görünce hemen kıldırır, cemaatin ağırdan aldığını görünce o da, geciktirirdi. Sabah namazını ise, karanlıkta kıldırırdı. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 37
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 561,
      "arabicNumber": 561,
      "book": 9,
      "hadithInBook": 38,
      "text": {
        "arabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْمَغْرِبَ إِذَا تَوَارَتْ بِالْحِجَابِ‏.‏",
        "translations": {
          "en": "Narrated Salama:We used to pray the Maghrib prayer with the Prophet (ﷺ) when the sun disappeared from the horizon",
          "ur": "ہم سے مکی بن ابراہیم نے بیان کیا، انہوں نے کہا ہم سے یزید بن ابی عبید نے بیان کیا سلمہ بن اکوع رضی اللہ عنہ سے، فرمایا کہ ہم نماز مغرب نبی کریم صلی اللہ علیہ وسلم کے ساتھ اس وقت پڑھتے تھے جب سورج پردے میں چھپ جاتا۔",
          "fr": "Rapporté par Salama : Nous priions le Maghrib avec le Prophète (ﷺ) dès que le soleil disparaissait de l’horizon",
          "id": "Telah menceritakan kepada kami [Al Makki bin Ibrahim] berkata, telah menceritakan kepada kami [Yazid bin Abu 'Ubaid] dari [Salamah] berkata, \"Kami pernah shalat Maghrib bersama Nabi shallallahu 'alaihi wasallam ketika matahari sudah tenggelam tidak terlihat",
          "tr": "Seleme (r.a.) şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile akşam namazını, güneş batınca kılardık"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 38
      },
      "narrator": {
        "en": "Salama"
      }
    },
    {
      "hadithNumber": 562,
      "arabicNumber": 562,
      "book": 9,
      "hadithInBook": 39,
      "text": {
        "arabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم سَبْعًا جَمِيعًا وَثَمَانِيًا جَمِيعًا‏.‏",
        "translations": {
          "en": "Narrated Ibn `Abbas:The Prophet (ﷺ) prayed seven rak`at together and eight rak`at together",
          "ur": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے عمرو بن دینار نے بیان کیا، کہا میں نے جابر بن زید سے سنا، وہ ابن عباس رضی اللہ عنہما کے واسطے سے بیان کرتے تھے۔ آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے سات رکعات ( مغرب اور عشاء کی ) ایک ساتھ آٹھ رکعات ( ظہر اور عصر کی نمازیں ) ایک ساتھ پڑھیں۔",
          "fr": "Rapporté par Ibn `Abbas : Le Prophète (ﷺ) a prié sept rak`a ensemble et huit rak`a ensemble",
          "id": "Telah menceritakan kepada kami [Adam] berkata, telah menceritakan kepada kami [Syu'bah] berkata, ['Amru bin Dinar] berkata, Aku pernah mendengar [Jabir bin Zaid] dari ['Abdullah bin 'Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam pernah melaksanakan shalat tujuh rakaat dengan jama' dan delapan rakaat dengan jama",
          "tr": "İbn Abbas (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem akşam ve yatsı namazını birlikte yedi rekat olarak, öğle ile İkindi namazını ise yine birlikte sekiz rekat olarak kıldı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 39
      },
      "narrator": {
        "en": "Ibn `Abbas"
      }
    },
    {
      "hadithNumber": 563,
      "arabicNumber": 563,
      "book": 9,
      "hadithInBook": 40,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو مَعْمَرٍ ـ هُوَ عَبْدُ اللَّهِ بْنُ عَمْرٍو ـ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ الْمُزَنِيُّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَغْلِبَنَّكُمُ الأَعْرَابُ عَلَى اسْمِ صَلاَتِكُمُ الْمَغْرِبِ ‏\"‏‏.‏ قَالَ الأَعْرَابُ وَتَقُولُ هِيَ الْعِشَاءُ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah Al-Muzani:The Prophet (ﷺ) said, \"Do not be influenced by bedouins regarding the name of your Maghrib prayer which is called `Isha' by them",
          "ur": "ہم سے ابومعمر نے بیان کیا، جو عبداللہ بن عمرو ہیں، کہا ہم سے عبدالوارث بن سعید نے حسین بن ذکوان سے بیان کیا، کہا ہم سے عبداللہ بن بریدہ نے، کہا مجھ سے عبداللہ مزنی رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ایسا نہ ہو کہ ”مغرب“ کی نماز کے نام کے لیے اعراب ( یعنی دیہاتی لوگوں ) کا محاورہ تمہاری زبانوں پر چڑھ جائے۔ عبداللہ بن مغفل رضی اللہ عنہ نے کہا یا خود نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بدوی مغرب کو عشاء کہتے تھے۔",
          "fr": "Rapporté par `Abdullah Al-Muzani : Le Prophète (ﷺ) a dit : « Ne vous laissez pas influencer par les bédouins concernant le nom de votre prière du Maghrib, qu’ils appellent `Isha. »",
          "id": "Telah menceritakan kepada kami [Abu Ma'mar] -yaitu 'Abdullah bin 'Amru- berkata, telah menceritakan kepada kami ['Abdul Warits] dari [Al Husain] berkata, telah menceritakan kepada kami ['Abdullah bin Buraidah] berkata, telah menceritakan kepadaku ['Abdullah bin Mughaffal Al Muzani], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian dikalahkan oleh orang Badui dalam menamakan (melaksanakan) shalat Maghrib kalian.\" 'Abdullah bin Mughaffal Al Muzani berkata, \"Orang Badui menyebut Maghrib dengan 'Isya (kerena mereka menunda pelaksanaan Maghrib hingga masuk waktu 'Isya)",
          "tr": "Abdullah el-Müzenî Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Bedeviler akşam namazınızın adı hususunda size baskı yapmasınlar! Zira onlar akşam namazına işâ derler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 40
      },
      "narrator": {
        "en": "`Abdullah Al-Muzani"
      }
    },
    {
      "hadithNumber": 564,
      "arabicNumber": 564,
      "book": 9,
      "hadithInBook": 41,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ سَالِمٌ أَخْبَرَنِي عَبْدُ اللَّهِ، قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً صَلاَةَ الْعِشَاءِ ـ وَهْىَ الَّتِي يَدْعُو النَّاسُ الْعَتَمَةَ ـ ثُمَّ انْصَرَفَ فَأَقْبَلَ عَلَيْنَا فَقَالَ ‏ \"‏ أَرَأَيْتُمْ لَيْلَتَكُمْ هَذِهِ فَإِنَّ رَأْسَ مِائَةِ سَنَةٍ مِنْهَا لاَ يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah:\"One night Allah's Messenger (ﷺ) led us in the `Isha' prayer and that is the one called Al-`Atma [??] by the people. After the completion of the prayer, he faced us and said, \"Do you know the importance of this night? Nobody present on the surface of the earth tonight will be living after one hundred years from this night.\" (See Hadith No)",
          "ur": "ہم سے عبدان عبداللہ بن عثمان نے بیان کیا، انہوں نے کہا ہمیں عبداللہ بن مبارک نے خبر دی، انہوں نے کہا ہمیں یونس بن یزید نے خبر دی زہری سے کہ سالم نے یہ کہا کہ مجھے (میرے باپ) عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ ایک رات نبی کریم صلی اللہ علیہ وسلم نے ہمیں عشاء کی نماز پڑھائی۔ یہی جسے لوگ «عتمه» کہتے ہیں۔ پھر ہمیں خطاب کرتے ہوئے فرمایا کہ تم اس رات کو یاد رکھنا۔ آج جو لوگ زندہ ہیں ایک سو سال کے گزرنے تک روئے زمین پر ان میں سے کوئی بھی باقی نہیں رہے گا۔",
          "fr": "Rapporté par `Abdullah : Une nuit, le Messager d’Allah (ﷺ) nous a dirigé dans la prière d’`Isha, celle que les gens appellent Al-`Atma. Après la prière, il s’est tourné vers nous et a dit : « Savez-vous quelle est l’importance de cette nuit ? Personne parmi ceux qui sont sur la terre ce soir ne sera encore en vie dans cent ans à partir de cette nuit. »",
          "id": "Telah menceritakan kepada kami ['Abdan] berkata, telah mengabarkan kepada kami ['Abdullah] berkata, telah mengabarkan kepada kami [Yunus] dari [Az Zuhri], [Salim] berkata, ['Abdullah] mengabarkan kepadaku, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah memimpin kami melaksanakan shalat 'Isya pada waktu yang orang-orang menyebutnya dengan sebutan 'Atamah. Selesai shalat beliau berpaling dan menghadap ke arah kami seraya bertanya: \"Tidakkah kalian melihat malam kalian ini? Ketahuilah, sesungguhnya pada setiap seratus tahun tidak ada seorang pun yang hidup di atas bumi akan tersisa",
          "tr": "Abdullah İbn Ömer r.a.'den şöyle nakledilmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem, bize, halkın ateme olarak isimlendirdiği yatsı namazını kıldırdı. Namazı bitirdikten sonra bize yönelip şöyle dedi: Bu gecenizi gördünüz mü? Bu gecenizden sonraki yüz sene sonunda yeryüzünde yaşayan insanlardan hiç bir kimse hayatta kalmayacaktır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 41
      },
      "narrator": {
        "en": "`Abdullah"
      }
    },
    {
      "hadithNumber": 565,
      "arabicNumber": 565,
      "book": 9,
      "hadithInBook": 42,
      "text": {
        "arabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو ـ هُوَ ابْنُ الْحَسَنِ بْنِ عَلِيٍّ ـ قَالَ سَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ صَلاَةِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ كَانَ يُصَلِّي الظُّهْرَ بِالْهَاجِرَةِ، وَالْعَصْرَ وَالشَّمْسُ حَيَّةٌ، وَالْمَغْرِبَ إِذَا وَجَبَتْ، وَالْعِشَاءَ إِذَا كَثُرَ النَّاسُ عَجَّلَ، وَإِذَا قَلُّوا أَخَّرَ، وَالصُّبْحَ بِغَلَسٍ‏.‏",
        "translations": {
          "en": "Narrated Muhammad bin `Amr:We asked Jabir bin `Abdullah about the prayers of the Prophet (ﷺ) . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark",
          "ur": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے شعبہ حجاج نے سعد بن ابراہیم سے بیان کیا، وہ محمد بن عمرو سے جو حسن بن علی بن ابی طالب کے بیٹے ہیں، فرمایا کہ ہم نے جابر بن عبداللہ رضی اللہ عنہما سے نبی کریم صلی اللہ علیہ وسلم کی نماز کے بارے میں دریافت کیا۔ تو آپ نے فرمایا کہ آپ نماز ظہر دوپہر میں پڑھتے تھے۔ اور جب نماز عصر پڑھتے تو سورج صاف روشن ہوتا۔ مغرب کی نماز واجب ہوتے ہی ادا فرماتے، اور ”عشاء“ میں اگر لوگ جلدی جمع ہو جاتے تو جلدی پڑھ لیتے اور اگر آنے والوں کی تعداد کم ہوتی تو دیر کرتے۔ اور صبح کی نماز منہ اندھیرے میں پڑھا کرتے تھے۔",
          "fr": "Rapporté par Muhammad bin `Amr : Nous avons demandé à Jabir bin `Abdullah comment le Prophète (ﷺ) priait. Il a dit : « Il priait le Zuhr au milieu de la journée, le `Asr quand le soleil était encore chaud, et le Maghrib après le coucher du soleil (à l’heure prévue). L’`Isha était faite tôt si les gens étaient nombreux, et retardée si le nombre était faible ; la prière du matin était faite alors qu’il faisait encore nuit. »",
          "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Muhammad bin 'Amru] -yaitu Ibnu Al Hasan bin 'Ali- ia berkata, \"Kami pernah bertanya kepada [Jabir bin 'Abdullah] tentang shalatnya Nabi shallallahu 'alaihi wasallam. Ia lalu menjawab, \"Beliau melaksanakan shalat Zhuhur jika matahari sudah condong, shalat 'Ashar saat matahari masih terasa panasnya (masih terang), shalat Maghrib ketika matahari sudah tenggelam, sedangkan shalat 'Isya; jika orang-orang sudah berkumpul maka beliau segerakan, dan jika belum maka beliau akhirkan. Dan waktu untuk shalat Subuh saat pagi masih gelap",
          "tr": "Muhammed İbn Amr'dan şöyle nakledilmiştir: \"Câbir İbn Abdillah'a Nebi Sallallahu Aleyhi ve Sellem'in hangi vakitlerde namaz kıldığını sorduk. O da şöyle cevap verdi: Öğle namazını öğlen sıcağının kızgın olduğu vakitte, ikindi namazını güneş ışık saçmaya devam ettiği bir vakitte, akşam namazını farz olunca (güneş battığında farz olur), yatsı namazını ise cemaat çoğalırsa erken, az olursa geç bir vakitte, sabah namazını ise gece karanlığının sonunda kılardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 42
      },
      "narrator": {
        "en": "Muhammad bin `Amr"
      }
    },
    {
      "hadithNumber": 566,
      "arabicNumber": 566,
      "book": 9,
      "hadithInBook": 43,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ قَالَتْ، أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِالْعِشَاءِ، وَذَلِكَ قَبْلَ أَنْ يَفْشُوَ الإِسْلاَمُ، فَلَمْ يَخْرُجْ حَتَّى قَالَ عُمَرُ نَامَ النِّسَاءُ وَالصِّبْيَانُ‏.‏ فَخَرَجَ فَقَالَ لأَهْلِ الْمَسْجِدِ ‏ \"‏ مَا يَنْتَظِرُهَا أَحَدٌ مِنْ أَهْلِ الأَرْضِ غَيْرُكُمْ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Allah's Messenger (ﷺ) once delayed the `Isha' prayer and that was during the days when Islam still had not spread. The Prophet (ﷺ) did not come out till `Umar informed him that the women and children had slept. Then he came out and said to the people of the mosque: \"None amongst the dwellers of the earth has been waiting for it (`Isha prayer) except you",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے عقیل کے واسطے سے بیان کیا، انہوں نے ابن شہاب سے، انہوں نے عروہ سے کہ عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ ایک رات رسول اللہ صلی اللہ علیہ وسلم نے عشاء کی نماز دیر سے پڑھی۔ یہ اسلام کے پھیلنے سے پہلے کا واقعہ ہے۔ آپ صلی اللہ علیہ وسلم اس وقت تک باہر تشریف نہیں لائے جب تک عمر رضی اللہ عنہ نے یہ نہ فرمایا کہ عورتیں اور بچے سو گئے۔ پس آپ صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ تمہارے علاوہ دنیا میں کوئی بھی انسان اس نماز کا انتظار نہیں کرتا۔",
          "fr": "Rapporté par `Aisha : Le Messager d’Allah (ﷺ) a une fois retardé la prière d’`Isha, à une époque où l’islam n’était pas encore répandu. Le Prophète (ﷺ) n’est pas sorti avant que `Umar ne l’informe que les femmes et les enfants s’étaient endormis. Il est alors sorti et a dit aux gens dans la mosquée : « Personne sur terre n’a attendu cette prière (d’`Isha) à part vous. »",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] dari ['Urwah] bahwa ['Aisyah] mengabarkan kepadanya, ia katakan, \"Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan shalat 'Isya ketika malam telah masuk sepertiga akhir malam ('Atamah), dan itu terjadi ketika Islam belum luas tersebar. Beliau tidak juga keluar hingga 'Umar berkata, 'Para wanita dan anak-anak sudah tidur! ' Maka beliau pun keluar dan bersabda kepada orang-orang yang ada di Masjid: \"Tidak ada seorangpun dari penduduk bumi yang menunggu shalat ini selain kalian",
          "tr": "Urve Aişe r.anha'nın kendisine şöyle haber verdiğini nakletmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem yatsı namazını geciktirdi. Bu olay İslâm'ın henüz yayılmadığı bir dönemde vuku bulmuştu. Ömer (r.a.), 'Kadınlar ve çocuklar uyuyakaldı' deyinceye kadar Allah Resulü Sallallahu Aleyhi ve Sellem namaz kılmaya gelmedi. Sonra mescid'e gelip cemaat'e, Yeryüzünde sizin dışınızda kimse bu namazı beklemiyor' dedi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 43
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 567,
      "arabicNumber": 567,
      "book": 9,
      "hadithInBook": 44,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ أَخْبَرَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كُنْتُ أَنَا وَأَصْحَابِي الَّذِينَ، قَدِمُوا مَعِي فِي السَّفِينَةِ نُزُولاً فِي بَقِيعِ بُطْحَانَ، وَالنَّبِيُّ صلى الله عليه وسلم بِالْمَدِينَةِ، فَكَانَ يَتَنَاوَبُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ صَلاَةِ الْعِشَاءِ كُلَّ لَيْلَةٍ نَفَرٌ مِنْهُمْ، فَوَافَقْنَا النَّبِيَّ ـ عليه السلام ـ أَنَا وَأَصْحَابِي وَلَهُ بَعْضُ الشُّغْلِ فِي بَعْضِ أَمْرِهِ فَأَعْتَمَ بِالصَّلاَةِ حَتَّى ابْهَارَّ اللَّيْلُ، ثُمَّ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى بِهِمْ، فَلَمَّا قَضَى صَلاَتَهُ قَالَ لِمَنْ حَضَرَهُ ‏\"‏ عَلَى رِسْلِكُمْ، أَبْشِرُوا إِنَّ مِنْ نِعْمَةِ اللَّهِ عَلَيْكُمْ أَنَّهُ لَيْسَ أَحَدٌ مِنَ النَّاسِ يُصَلِّي هَذِهِ السَّاعَةَ غَيْرُكُمْ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ مَا صَلَّى هَذِهِ السَّاعَةَ أَحَدٌ غَيْرُكُمْ ‏\"‏‏.‏ لاَ يَدْرِي أَىَّ الْكَلِمَتَيْنِ قَالَ‏.‏ قَالَ أَبُو مُوسَى فَرَجَعْنَا فَفَرِحْنَا بِمَا سَمِعْنَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Abu Musa:My companions, who came with me in the boat and I landed at a place called Baqi [??] Buthan [??] . The Prophet (ﷺ) was in Medina at that time. One of us used to go to the Prophet (ﷺ) by turns every night at the time of the `Isha prayer. Once I along with my companions went to the Prophet (ﷺ) and he was busy in some of his affairs, so the `Isha' prayer was delayed to the middle of the night He then came out and led the people (in prayer). After finishing from the prayer, he addressed the people present there saying, \"Be patient! Don't go away. Have the glad tiding. It is from the blessing of Allah upon you that none amongst mankind has prayed at this time save you.\" Or said, \"None except you has prayed at this time.\" Abu Musa added, 'So we returned happily after what we heard from Allah's Messenger (ﷺ)",
          "ur": "ہم سے محمد بن علاء نے بیان کیا کہا ہم سے ابواسامہ نے برید کے واسطہ سے، انہوں نے ابی بردہ سے انہوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے، آپ نے فرمایا کہ میں نے اپنے ان ساتھیوں کے ساتھ جو کشتی میں میرے ساتھ ( حبشہ سے ) آئے تھے ”بقیع بطحان“ میں قیام کیا۔ اس وقت نبی کریم صلی اللہ علیہ وسلم مدینہ میں تشریف رکھتے تھے۔ ہم میں سے کوئی نہ کوئی عشاء کی نماز میں روزانہ باری مقرر کر کے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا کرتا تھا۔ اتفاق سے میں اور میرے ایک ساتھی ایک مرتبہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ آپ صلی اللہ علیہ وسلم اپنے کسی کام میں مشغول تھے۔ ( کسی ملی معاملہ میں آپ صلی اللہ علیہ وسلم اور ابوبکر صدیق رضی اللہ عنہ گفتگو فرما رہے تھے ) جس کی وجہ سے نماز میں دیر ہو گئی اور تقریباً آدھی رات گزر گئی۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور نماز پڑھائی۔ نماز پوری کر چکے تو حاضرین سے فرمایا کہ اپنی اپنی جگہ پر وقار کے ساتھ بیٹھے رہو اور ایک خوشخبری سنو۔ تمہارے سوا دنیا میں کوئی بھی ایسا آدمی نہیں جو اس وقت نماز پڑھتا ہو، یا آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ تمہارے سوا اس وقت کسی ( امت ) نے بھی نماز نہیں پڑھی تھی۔ یہ یقین نہیں کہ آپ نے ان دو جملوں میں سے کون سا جملہ کہا تھا۔ پھر راوی نے کہا کہ ابوموسیٰ رضی اللہ عنہ نے فرمایا۔ پس ہم نبی کریم صلی اللہ علیہ وسلم سے یہ سن کر بہت ہی خوش ہو کر لوٹے۔",
          "fr": "Rapporté par Abu Musa : Mes compagnons et moi, qui étions venus en bateau, avons débarqué à un endroit appelé Baqi Buthan. Le Prophète (ﷺ) était alors à Médine. L’un de nous allait voir le Prophète (ﷺ) chaque nuit à l’heure de la prière d’`Isha. Un jour, mes compagnons et moi sommes allés le voir, mais il était occupé, alors la prière d’`Isha a été retardée jusqu’au milieu de la nuit. Il est ensuite sorti et a dirigé la prière. Après la prière, il a dit aux personnes présentes : « Soyez patients ! Ne partez pas. Réjouissez-vous. C’est une bénédiction d’Allah pour vous : personne parmi les humains n’a prié à cette heure, sauf vous. » Ou il a dit : « Personne à part vous n’a prié à cette heure. » Abu Musa a ajouté : Nous sommes repartis heureux après avoir entendu cela du Messager d’Allah (ﷺ)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] berkata, telah mengabarkan kepada kami [Abu Umamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Aku dan sahabat-sahabatku yang pernah ikut dalam perahu singgah pada tanah lapang yang memiliki aliran air, sedangkan Nabi shallallahu 'alaihi wasallam berada di Madinah. Di antara mereka ada beberapa orang yang saling bergantian mengikuti Nabi shallallahu 'alaihi wasallam shalat 'Isya di setiap malamnya. Hingga pada suatu malam, aku dan para sahabatku menjumpai Nabi shallallahu 'alaihi wasallam yang saat itu sedang sibuk dengan urusannya, sehingga beliau mengakhirkan pelaksanaan shalatr 'Isya hingga pada pertengahan malam. Maka Nabi shallallahu 'alaihi wasallam keluar untuk menunaikan shalat bersama mereka. Selesai shalat beliau bersabda kepada orang-orang yang hadir: \"Tetaplah kalian di tempat kalian, dan bergemberilah. Sesungguhnya termasuk dari nikmat Allah kepada kalian adalah didapatinya seorang pun saat ini yang melaksanakan shalat (Isya) selain kalian.\" Atau Beliau bersabda: \"Tidak ada yang melaksanakan shalat pada waktu seperti ini kecuali kalian.\" Namun ia terlupa mana dari dua kalimat ini yang dikatakan beliau. Abu Burdah berkata, Abu Musa, \"Maka kami kembali dengan gembira dengan apa yang kami dengar dari Rasulullah shallallahu 'alaihi wasallam",
          "tr": "Ebu Musa'nın şöyle dediği nakledilmiştir; \"Benimle birlikte gemi İle Medine'ye gelen arkadaşlarımla birlikte Bakîu Buthân vadisine yerleştik. O esnada Nebi (Sallallahu Aleyhi ve Sellem) Medine'de idi. Yatsı namazını arkasında kılmak için her gece sıra kime gelmişse o grup Allah Resûlü'nün yanına giderdi. Ben ve arkadaşlarım Nebi Sallallahu Aleyhi ve Sellem'in namaza geldiği an'a rastladık. O gece Nebi Sallallahu Aleyhi ve Sellem'in bir işi vardı. Bu yüzden namazı gece yarısına kadar geciktirmişti. Daha sonra Nebi Sallallahu Aleyhi ve Sellem çıkıp cemaate namaz kıldırdı. Namazı bitirdikten sonra orada bulunanlara, 'Gitmek için acele etmeyin! Sizlere müjdem var. Şu an sizin dışınızda başka hiç kimsenin namaz kılmaması, Allah'ın size bahşettiği nimetlerden biridir' veya 'Şu an sizin dışınızda hiç kimse namaz kılmadı' buyurdu. (Bu hadisi Ebu Musa'dan nakleden râvî, onun, Allah Resûlü'nün hangi sözü söylediğini hatırlayamadığını söylemiştir). Ebu Musa olayı anlatmaya şöyle devam etti: Sonra evimize döndük, Rasûlullah Sallallahu Aleyhi ve Sellem'den duyduklarımız bizi mutlu etmişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 44
      },
      "narrator": {
        "en": "Abu Musa"
      }
    },
    {
      "hadithNumber": 568,
      "arabicNumber": 568,
      "book": 9,
      "hadithInBook": 45,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالَ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي الْمِنْهَالِ، عَنْ أَبِي بَرْزَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَكْرَهُ النَّوْمَ قَبْلَ الْعِشَاءِ وَالْحَدِيثَ بَعْدَهَا‏.‏",
        "translations": {
          "en": "Narrated Abu Barza:Allah's Messenger (ﷺ) disliked to sleep before the `Isha' prayer and to talk after it",
          "ur": "ہم سے محمد بن سلام نے بیان کیا، انہوں نے کہا ہم سے عبدالوہاب ثقفی نے بیان کیا، انہوں نے کہا کہ ہم سے خالد حذاء نے بیان کیا ابوالمنہال سے، انہوں نے ابوبرزہ اسلمی رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم عشاء سے پہلے سونے اور اس کے بعد بات چیت کرنے کو ناپسند فرماتے تھے۔",
          "fr": "Rapporté par Abu Barza : Le Messager d’Allah (ﷺ) n’aimait pas dormir avant la prière d’`Isha ni discuter après",
          "id": "Telah menceritakan kepada kami [Muhammad bin Salam] berkata, telah mengabarkan kepada kami ['Abdul Wahhab Ats Tsaqafi] berkata, telah menceritakan kepada kami [Khalid Al Hadza'] dari [Abu Al Minhal] dari [Abu Barzah], bahwa Rasulullah shallallahu 'alaihi wasallam tidak suka tidur sebelum shalat 'Isya dan berbincang-bincang setelahnya",
          "tr": "Ebu Berze (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yatsı namazından önce uyumayı, yatsı namazından sonra konuşmayı sevmezdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 45
      },
      "narrator": {
        "en": "Abu Barza"
      }
    },
    {
      "hadithNumber": 569,
      "arabicNumber": 569,
      "book": 9,
      "hadithInBook": 46,
      "text": {
        "arabic": "حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي أَبُو بَكْرٍ، عَنْ سُلَيْمَانَ، قَالَ صَالِحُ بْنُ كَيْسَانَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، قَالَتْ أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْعِشَاءِ حَتَّى نَادَاهُ عُمَرُ الصَّلاَةَ، نَامَ النِّسَاءُ وَالصِّبْيَانُ‏.‏ فَخَرَجَ فَقَالَ ‏ \"‏ مَا يَنْتَظِرُهَا أَحَدٌ مِنْ أَهْلِ الأَرْضِ غَيْرُكُمْ ‏\"‏‏.‏ قَالَ وَلاَ يُصَلَّى يَوْمَئِذٍ إِلاَّ بِالْمَدِينَةِ، وَكَانُوا يُصَلُّونَ فِيمَا بَيْنَ أَنْ يَغِيبَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ الأَوَّلِ‏.‏",
        "translations": {
          "en": "Narrated Ibn Shihab from `Urwa:`Aisha said, \"Once Allah's Messenger (ﷺ) delayed the `Isha' prayer till `Umar reminded him by saying, \"The prayer!\" The women and children have slept. Then the Prophet (ﷺ) came out and said, 'None amongst the dwellers of the earth has been waiting for it (the prayer) except you.\" `Urwa said, \"Nowhere except in Medina the prayer used to be offered (in those days).\" He further said, \"The Prophet (ﷺ) used to offer the `Isha' prayer in the period between the disappearance of the twilight and the end of the first third of the night",
          "ur": "ہم سے ایوب بن سلیمان نے بیان کیا، کہا ہم سے ابوبکر نے سلیمان سے، ان سے صالح بن کیسان نے بیان کیا کہ مجھے ابن شہاب نے عروہ سے خبر دی کہ عائشہ رضی اللہ عنہا نے بتلایا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دفعہ عشاء کی نماز میں دیر فرمائی۔ یہاں تک کہ عمر رضی اللہ عنہ نے پکارا، نماز! عورتیں اور بچے سب سو گئے۔ تب آپ صلی اللہ علیہ وسلم گھر سے باہر تشریف لائے، آپ صلی اللہ علیہ وسلم نے فرمایا کہ روئے زمین پر تمہارے علاوہ اور کوئی اس نماز کا انتظار نہیں کرتا۔ راوی نے کہا، اس وقت یہ نماز ( باجماعت ) مدینہ کے سوا اور کہیں نہیں پڑھی جاتی تھی۔ صحابہ اس نماز کو شام کی سرخی کے غائب ہونے کے بعد رات کے پہلے تہائی حصہ تک ( کسی وقت بھی ) پڑھتے تھے۔",
          "fr": "Rapporté par Ibn Shihab d’après `Urwa : `Aisha a dit : « Une fois, le Messager d’Allah (ﷺ) a retardé la prière d’`Isha jusqu’à ce que `Umar lui rappelle en disant : “La prière ! Les femmes et les enfants se sont endormis.” Le Prophète (ﷺ) est alors sorti et a dit : ‘Personne sur terre n’a attendu cette prière à part vous.’ » `Urwa a ajouté : « À cette époque, la prière n’était faite qu’à Médine. » Il a aussi dit : « Le Prophète (ﷺ) priait l’`Isha entre la disparition du crépuscule et la fin du premier tiers de la nuit. »",
          "id": "Telah menceritakan kepada kami [Ayyub bin Sulaiman] -yaitu Ibnu Bilal- ia berkata, telah menceritakan kepadaku [Abu Bakar] dari [Sulaiman] -yaitu Ibnu Bilal- berkata, telah menceritakan kepada kami [Shalih bin Kaisan] telah mengabarkan kepadaku [Ibnu Syihab] dari ['Urwahl] bahwa ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengakhirkan shalat 'Isya hingga sepertiga malam yang akhir. Lalu 'Umar pun berseru kepada beliau, \"(Laksanakanlah) shalat, sebab para wanita dan anak-anak telah terlelap tidur.\" Maka keluarlah beliau seraya berkata: \"Tidak ada seorangpun dari penduduk bumi yang menunggu shalat Isya ini selain kalian.\" Beliau tidaklah melaksanakan shalat seperti ini kecuali di Madinah. Dan mereka melaksnakan shalat antara hilangnya syafaq (cahaya kemerahan di langit) hingga sepertiga awal dari malam",
          "tr": "Urve Aişe (r.anha)'nın şöyle dediğini nakletmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem yatsı namazını geciktirdi. Derken Ömer (r.a.), 'Haydi namaza! Kadınlar ve çocuklar uyumaya başladı' diye seslendi. Sonra Allah Resulü Sallallahu Aleyhi ve Sellem namaz kıldırmak için çıktı ve şöyle buyurdu: Yeryüzünde sizden başka bu namazı bekleyen yoktur.\" Ravi şöyle demiştir: \"O dönemde sadece Medine'de cemaatle namaz kılınırdı. İnsanlar, şafak kaybolduktan sonra gecenin üçte biri dolana kadarki zaman içinde bu namazı kılardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 46
      },
      "narrator": {
        "en": "Ibn Shihab from `Urwa"
      }
    },
    {
      "hadithNumber": 571,
      "arabicNumber": 571,
      "book": 9,
      "hadithInBook": 47,
      "text": {
        "arabic": "حَدَّثَنَا مَحْمُودٌ، قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي نَافِعٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم شُغِلَ عَنْهَا لَيْلَةً، فَأَخَّرَهَا حَتَّى رَقَدْنَا فِي الْمَسْجِدِ، ثُمَّ اسْتَيْقَظْنَا ثُمَّ رَقَدْنَا ثُمَّ اسْتَيْقَظْنَا، ثُمَّ خَرَجَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ لَيْسَ أَحَدٌ مِنْ أَهْلِ الأَرْضِ يَنْتَظِرُ الصَّلاَةَ غَيْرُكُمْ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ لاَ يُبَالِي أَقَدَّمَهَا أَمْ أَخَّرَهَا إِذَا كَانَ لاَ يَخْشَى أَنْ يَغْلِبَهُ النَّوْمُ عَنْ وَقْتِهَا، وَكَانَ يَرْقُدُ قَبْلَهَا‏.‏ قَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ وَقَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِالْعِشَاءِ حَتَّى رَقَدَ النَّاسُ وَاسْتَيْقَظُوا، وَرَقَدُوا وَاسْتَيْقَظُوا، فَقَامَ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ الصَّلاَةَ‏.‏ قَالَ عَطَاءٌ قَالَ ابْنُ عَبَّاسٍ فَخَرَجَ نَبِيُّ اللَّهِ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَيْهِ الآنَ، يَقْطُرُ رَأْسُهُ مَاءً، وَاضِعًا يَدَهُ عَلَى رَأْسِهِ فَقَالَ ‏\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ أَنْ يُصَلُّوهَا هَكَذَا ‏\"‏‏.‏ فَاسْتَثْبَتُّ عَطَاءً كَيْفَ وَضَعَ النَّبِيُّ صلى الله عليه وسلم عَلَى رَأْسِهِ يَدَهُ كَمَا أَنْبَأَهُ ابْنُ عَبَّاسٍ، فَبَدَّدَ لِي عَطَاءٌ بَيْنَ أَصَابِعِهِ شَيْئًا مِنْ تَبْدِيدٍ، ثُمَّ وَضَعَ أَطْرَافَ أَصَابِعِهِ عَلَى قَرْنِ الرَّأْسِ ثُمَّ ضَمَّهَا، يُمِرُّهَا كَذَلِكَ عَلَى الرَّأْسِ حَتَّى مَسَّتْ إِبْهَامُهُ طَرَفَ الأُذُنِ مِمَّا يَلِي الْوَجْهَ عَلَى الصُّدْغِ، وَنَاحِيَةِ اللِّحْيَةِ، لاَ يُقَصِّرُ وَلاَ يَبْطُشُ إِلاَّ كَذَلِكَ وَقَالَ ‏\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ أَنْ يُصَلُّوا هَكَذَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn Juraij from Nafi`:`Abdullah bin `Umar said, \"Once Allah's Messenger (ﷺ) was busy (at the time of the `Isha'), so the prayer was delayed so much so that we slept and woke up and slept and woke up again. The Prophet (ﷺ) came out and said, 'None amongst the dwellers of the earth but you have been waiting for the prayer.\" Ibn `Umar did not find any harm in praying it earlier or in delaying it unless he was afraid that sleep might overwhelm him and he might miss the prayer, and sometimes he used to sleep before the `Isha' prayer. Ibn Juraij said, \"I said to `Ata', 'I heard Ibn `Abbas saying: Once Allah's Messenger (ﷺ) delayed the `Isha' prayer to such an extent that the people slept and got up and slept again and got up again. Then `Umar bin Al-Khattab, stood up and reminded the Prophet (ﷺ) of the prayer.' `Ata' said, 'Ibn `Abbas said: The Prophet came out as if I was looking at him at this time, and water was trickling from his head and he was putting his hand on his head and then said, 'Hadn't I thought it hard for my followers, I would have ordered them to pray (`Isha' prayer) at this time.' I asked `Ata' for further information, how the Prophet had kept his hand on his head as he was told by Ibn `Abbas. `Ata' separated his fingers slightly and put their tips on the side of the head, brought the fingers downwards approximating them till the thumb touched the lobe of the ear at the side of the temple and the beard on the face. He neither slowed nor hurried in this action but he acted like that. The Prophet (ﷺ) said: \"Hadn't I thought it hard for my followers I would have ordered them to pray at this time",
          "fr": "Rapporté par Ibn Juraij d’après Nafi` : `Abdullah bin `Umar a dit : « Une fois, le Messager d’Allah (ﷺ) était occupé à l’heure de l’`Isha, alors la prière a été tellement retardée que nous nous sommes endormis, réveillés, puis rendormis et réveillés encore. Le Prophète (ﷺ) est sorti et a dit : ‘Personne sur terre à part vous n’a attendu la prière.’ Ibn `Umar ne voyait pas de problème à prier plus tôt ou plus tard, sauf s’il craignait de s’endormir et de manquer la prière, et il lui arrivait de dormir avant l’`Isha. Ibn Juraij a dit : « J’ai demandé à `Ata’ : J’ai entendu Ibn `Abbas dire : Une fois, le Messager d’Allah (ﷺ) a tellement retardé la prière d’`Isha que les gens se sont endormis, réveillés, puis rendormis et réveillés encore. Puis `Umar bin Al-Khattab s’est levé et a rappelé la prière au Prophète (ﷺ). » `Ata’ a dit : « Ibn `Abbas a dit : Le Prophète est sorti, comme si je le voyais à ce moment, de l’eau coulait de sa tête, il posait sa main sur sa tête et a dit : ‘Si je ne craignais pas de rendre cela difficile pour ma communauté, je leur aurais ordonné de prier (`Isha) à cette heure.’ » J’ai demandé à `Ata’ comment le Prophète avait mis sa main sur sa tête, comme Ibn `Abbas l’avait décrit. `Ata’ a écarté légèrement ses doigts, a posé leurs extrémités sur le côté de la tête, a descendu les doigts jusqu’à ce que le pouce touche le lobe de l’oreille, près de la tempe et de la barbe. Il n’a ni ralenti ni accéléré ce geste, il l’a fait ainsi. Le Prophète (ﷺ) a dit : « Si je ne craignais pas de rendre cela difficile pour ma communauté, je leur aurais ordonné de prier à cette heure. »",
          "id": "Telah menceritakan kepada kami [Mahmud] -yaitu Ibnu Ghailan- berkata, telah mengabarkan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepadaku [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Nafi'] berkata, telah menceritakan kepada kami ['Abdullah bin 'Umar], bahwa Rasulullah shallallahu 'alaihi wasallam pernah suatu malam disibukkan dengan urusan sehingga mengakhirkan shalat 'Isya. Dan karenanya kami tertidur di dalam masjid. Lalu kami terbangun, lalu tertidur, lalu terbangun lagi hingga akhirnya Rasulullah shallallahu 'alaihi wasallam keluar menemui kami seraya bersabda: \"Tidak ada seorangpun dari penduduk bumi yang menunggu shalat seperti ini selain kalian.\" Dan Ibnu 'Umar tidak mempermasalahkan apakah Beliau memajukannya atau mengakhirkan. Pelaksanakaannya. Dan Ibnu Umar tidur dahulu sebelum shalat Isya. [Ibnu Juraij] berkata, \"Aku bertanya kepada ['Atha'], lalu dia berkata, \"Aku mendengar [Ibnu 'Abbas] berkata, \"Pernah suatu malam Rasulullah shallallahu 'alaihi wasallam mengakhirkan shalat 'Isya hingga banyak orang tertidur, kemudian mereka terbangun, lalu tertidur lagi, kemudian terbangun lagi.\" 'Umar bin Al Khaththab lalu berdiri dan berkata, \"Shalat.\" 'Atha' berkata, Ibnu 'Abbas, \"Maka Nabi shallallahu 'alaihi wasallam kemudian keluar dengan meletakkan tangan pada kepala, seakan aku melihat rambut beliau basah meneteskan air. Beliau kemudiaan bersabda: \"Seandainya tidak memberatkan ummatku, niscaya aku akan perintahkan mereka melaksanakan shalat 'Isya seperti waktu sekarang ini.\" Aku (Ibnu Juraij) kemudian menanyakan kepada 'Atha untuk memastikan kenapa Nabi shallallahu 'alaihi wasallam meletakkan tangannya di kepalanya seabgaimana yang diberitakan oleh Ibnu 'Abbas. Maka 'Atha merenggangkan sedikit jari-jarinya kemudian meletakkan ujung jarinya di atas sisi kepala, kemudian ia menekannya sambil menggerakkan ke sekeliling kepala hingga ibu jarinya menyentuh ujung telinga yang dimulai dari pelipis hingga pangkal jenggot. Dia melakukannya tidak pelan juga tidak cepat, kecuali sedang seperti itu. Lalu Beliau bersabda: \"Seandainya tidak memberatkan ummatku, niscaya aku akan perintahkan mereka melaksanakan shalat seperti waktu sekarang ini",
          "tr": "Abdullah İbn Ömer'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in bir gece yatsı namazı esnasında meşguliyeti çıktı. Bu yüzden namazı o kadar geciktirdi ki, biz Mescid-i Nebevi'de uyuduk, sonra uyandık, daha sonra tekrar uyuyup uyandık. Nihayet Allah Re­sulü Sallallahu Aleyhi ve Sellem evinden çıktı ve şöyle buyurdu: Yeryüzünde sizin dışınızda namazı bekleyen hiç kimse yoktur.\" İbn Ömer uyuyup vaktini geçirmekten korkmadığı sürece, yatsı namazını önce ya da sonra kılmak arasında bir ayırım gözetmezdi. Yatsı namazından önce uyuduğu da olurdu. İbn Cüreyc 'Bunu Atâ'ya söyledim' demiştir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 47
      },
      "narrator": {
        "en": "Ibn Juraij from Nafi`"
      }
    },
    {
      "hadithNumber": 572,
      "arabicNumber": 572,
      "book": 9,
      "hadithInBook": 48,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الرَّحِيمِ الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ، قَالَ أَخَّرَ النَّبِيُّ صلى الله عليه وسلم صَلاَةَ الْعِشَاءِ إِلَى نِصْفِ اللَّيْلِ، ثُمَّ صَلَّى ثُمَّ قَالَ ‏ \"‏ قَدْ صَلَّى النَّاسُ وَنَامُوا، أَمَا إِنَّكُمْ فِي صَلاَةٍ مَا انْتَظَرْتُمُوهَا ‏\"‏‏.‏ وَزَادَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي حُمَيْدٌ سَمِعَ أَنَسًا كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ لَيْلَتَئِذٍ‏.‏",
        "translations": {
          "en": "Narrated Anas:The Prophet (ﷺ) delayed the `Isha' prayer till midnight and then he offered the prayer and said, \"The people prayed and slept but you have been in prayer as long as you have been waiting for it (the prayer).\" Anas added: As if I am looking now at the glitter of the ring of the Prophet (ﷺ) on that night",
          "ur": "ہم سے عبدالرحیم محاربی نے بیان کیا، کہا ہم سے زائدہ نے حمید طویل سے، انہوں نے انس رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے ( ایک دن ) عشاء کی نماز آدھی رات گئے پڑھی۔ اور فرمایا کہ دوسرے لوگ نماز پڑھ کر سو گئے ہوں گے۔ ( یعنی دوسری مساجد میں پڑھنے والے مسلمان ) اور تم لوگ جب تک نماز کا انتظار کرتے رہے ( گویا سارے وقت ) نماز ہی پڑھتے رہے۔ ابن مریم نے اس میں یہ زیادہ کیا کہ ہمیں یحییٰ بن ایوب نے خبر دی۔ کہا مجھ سے حمید طویل نے بیان کیا، انہوں نے انس رضی اللہ عنہ سے یہ سنا، گویا اس رات آپ کی انگوٹھی کی چمک کا نقشہ اس وقت بھی میری نظروں کے سامنے چمک رہا ہے۔",
          "fr": "Rapporté par Anas : Le Prophète (ﷺ) a retardé la prière d’`Isha jusqu’à minuit, puis il a prié et a dit : « Les gens ont prié et sont allés dormir, mais vous êtes restés en prière tant que vous attendiez la prière. » Anas a ajouté : C’est comme si je voyais encore l’éclat de la bague du Prophète (ﷺ) cette nuit-là",
          "id": "Telah menceritakan kepada kami ['Abdurrahim Al Muharibi] berkata, telah menceritakan kepada kami [Zaidah] dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam pernah mengakhirkan shalat 'Isya hingga pertengahan malam, setelah melaksanakan shalat beliau bersabda: \"Manusia semuanya sudah selesai shalat lalu mereka tidur. Dan kalian akan senantiasa dalam hitungan shalat selama kalian menunggu pelaksanaannya.\" [Ibnu Abu Maryam] menambahkan; telah mengabarkan kepada kami [Yahya bin Ayyub] telah menceritakan kepadaku [Humaid] dia mendengar [Anas bin Malik] berkata, \"Pada malam itu aku seolah melihat cahaya cincin Beliau",
          "tr": "Enes İbn Mâlİk (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem yatsı namazını gece yarısına kadar geciktirdi. Sonra namaz kıldırıp şöyle uyurdu: İnsanlar namaz kılıp uyudu. Siz ise, namazı beklediğiniz sürece namaz kılıyor gibisiniz.\" Buna ilave olarak İbn Ebî Meryem, Yahya İbn Eyyub ve Humeyd kanalıy¬la Enes'in şöyle dediğini nakletmiştir: \"O gece yüzüğünün parlaması hâlâ gözlemin önündedir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 48
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 573,
      "arabicNumber": 573,
      "book": 9,
      "hadithInBook": 49,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ لِي جَرِيرُ بْنُ عَبْدِ اللَّهِ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ نَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ فَقَالَ ‏\"‏ أَمَا إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا، لاَ تُضَامُّونَ ـ أَوْ لاَ تُضَاهُونَ ـ فِي رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أَنْ لاَ تُغْلَبُوا عَلَى صَلاَةٍ قَبْلَ طُلُوعِ الشَّمْسِ، وَقَبْلَ غُرُوبِهَا فَافْعَلُوا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ فَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Jarir bin `Abdullah:We were with the Prophet (ﷺ) on a full moon night. He looked at the moon and said, \"You will certainly see your Lord as you see this moon, and there will be no trouble in seeing Him. So if you can avoid missing (through sleep, business, etc.) a prayer before the rising of the sun (Fajr) and before its setting (`Asr) you must do so. He (the Prophet (ﷺ) ) then recited the following verse: And celebrate the praises Of Your Lord before The rising of the sun And before (its) setting",
          "ur": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے اسماعیل سے، کہا ہم سے قیس نے بیان کیا، کہا مجھ سے جریر بن عبداللہ نے بیان کیا، کہ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے آپ صلی اللہ علیہ وسلم نے چاند کی طرف نظر اٹھائی جو چودھویں رات کا تھا۔ پھر فرمایا کہ تم لوگ بے ٹوک اپنے رب کو اسی طرح دیکھو گے جیسے اس چاند کو دیکھ رہے ہو ( اسے دیکھنے میں تم کو کسی قسم کی بھی مزاحمت نہ ہو گی ) یا یہ فرمایا کہ تمہیں اس کے دیدار میں مطلق شبہ نہ ہو گا اس لیے اگر تم سے سورج کے طلوع اور غروب سے پہلے ( فجر اور عصر ) کی نمازوں کے پڑھنے میں کوتاہی نہ ہو سکے تو ایسا ضرور کرو۔ ( کیونکہ ان ہی کے طفیل دیدار الٰہی نصیب ہو گا یا ان ہی وقتوں میں یہ رویت ملے گی ) پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی «فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها» ”پس اپنے رب کے حمد کی تسبیح پڑھ سورج کے نکلنے اور اس کے غروب ہونے سے پہلے۔“ امام ابوعبداللہ بخاری رحمہ اللہ نے کہا کہ ابن شہاب نے اسماعیل کے واسطہ سے جو قیس سے بواسطہ جریر ( راوی ہیں ) یہ زیادتی نقل کی کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”تم اپنے رب کو صاف دیکھو گے“۔",
          "fr": "Rapporté par Jarir bin `Abdullah : Nous étions avec le Prophète (ﷺ) une nuit de pleine lune. Il a regardé la lune et a dit : « Vous verrez sûrement votre Seigneur comme vous voyez cette lune, et vous n’aurez aucune difficulté à Le voir. Donc, si vous pouvez éviter de manquer une prière avant le lever du soleil (Fajr) et avant son coucher (`Asr), faites-le. » Puis il a récité ce verset : « Et célèbre les louanges de ton Seigneur avant le lever du soleil et avant son coucher. »",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Isma'il] telah menceritakan kepada kami [Qais], [Jarir bin 'Abdullah] berkata kepadaku, \"Kami sedang bersama Nabi shallallahu 'alaihi wasallam saat beliau melihat rembulan di malam purnama. Kemudian beliau bersabda: \"Sesungguhnya kalian akan melihat Rabb kalian sebagaimana kalian melihat bulan purnama ini. Dan kalian tidak akan saling berdesakan dalam melihatnya. Maka jika kalian mampu untuk tidak terlewatkan melaksanakan shalat sebelum terbit matahari dan sebelum terbenamnya, maka lakukanlah, \" Kemudian beliau membaca: '(Maka bertasbihlah sambil memuji Rabbmu sebelum terbit matahari dan sebelum terbenamnya) ' (Qs. Qaaf:)",
          "tr": "Cerîr İbn Abdullah (r.a.)'dan şöyle nakledilmiştir: \"Dolunay gecesi ay'a baktığı zaman Nebi (Sallallahu Aleyhi ve Sellem) ile birlikteydik. O zaman şöyle buyurmuştu: Kuşkusuz sizler, şu ayı gördüğünüz gibi Rabbiniz'i göreceksiniz. Onu görme hususunda sîze haksızlık yapılmayacak. Eğer güneş doğmadan ve batmadan önceki namazları kılabiliyorsanız, bunları kılın!\" Sonra şu âyeti okudu: \"Güneşin doğmasından ve batmasından önce Rabbini övgü ile tesbih et! [Tâhâ]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 49
      },
      "narrator": {
        "en": "Jarir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 574,
      "arabicNumber": 574,
      "book": 9,
      "hadithInBook": 50,
      "text": {
        "arabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا هَمَّامٌ، حَدَّثَنِي أَبُو جَمْرَةَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ صَلَّى الْبَرْدَيْنِ دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ وَقَالَ ابْنُ رَجَاءٍ حَدَّثَنَا هَمَّامٌ عَنْ أَبِي جَمْرَةَ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ اللَّهِ بْنِ قَيْسٍ أَخْبَرَهُ بِهَذَا‏.‏ حَدَّثَنَا إِسْحَاقُ، عَنْ حَبَّانَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا أَبُو جَمْرَةَ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
        "translations": {
          "en": "Narrated Abu Bakr bin Abi Musa:My father said, \"Allah's Messenger (ﷺ) said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to Paradise",
          "ur": "ہم سے ہدبہ بن خالد نے بیان کیا، کہا ہم سے ہمام نے، انہوں نے کہا کہ ہم سے ابوجمرہ نے بیان کیا، ابوبکر بن ابی موسیٰ اشعری رضی اللہ عنہ سے، انہوں نے اپنے باپ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے ٹھنڈے وقت کی دو نمازیں ( وقت پر ) پڑھیں ( فجر اور عصر ) تو وہ جنت میں داخل ہو گا۔ ابن رجاء نے کہا کہ ہم سے ہمام نے ابوجمرہ سے بیان کیا کہ ابوبکر بن عبداللہ بن قیس رضی اللہ عنہ نے انہیں اس حدیث کی خبر دی۔ ہم سے اسحاق نے بیان کیا، کہا ہم سے حبان نے، انہوں نے کہا کہ ہم سے ہمام نے بیان کیا، کہا ہم سے ابوجمرہ نے بیان کیا ابوبکر بن عبداللہ رضی اللہ عنہ سے، انہوں نے اپنے والد سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے، پہلی حدیث کی طرح۔",
          "fr": "Rapporté par Abu Bakr bin Abi Musa : Mon père a dit : Le Messager d’Allah (ﷺ) a dit : « Celui qui prie les deux prières fraîches (`Asr et Fajr) entrera au Paradis. »",
          "id": "Telah menceritakan kepada kami [Hudbah bin Khalid] berkata, telah menceritakan kepada kami [Hammam] telah menceritakan kepadaku [Abu Jamrah] dari [Abu Bakar bin Abu Musa] dari [Bapaknya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat pada dua waktu dingin, maka dia akan masuk surga.\" [Ibnu Raja'] berkata; telah menceritakan kepada kami [Hammam] dari [Abu Jamrah] bahwa [Abu Bakar bin 'Abdullah bin Qais] telah mengabarkan kepadanya seperti ini.\" Dan telah menceritakan kepada kami [Ishaq] telah menceritakan kepada kami [Habban] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Abu Jamrah] dari [Abu Bakar bin 'Abdullah] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam seperti ini",
          "tr": "Ebu Bekir İbn Ebî Musa babası kanalıyla Allah Resulü (Sallallahu Aleyhi ve Sellem)'in şöyle dediğini nakletmiştir: \"iki serin vakitteki namazları kim kılarsa cennete girer"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 50
      },
      "narrator": {
        "en": "Abu Bakr bin Abi Musa"
      }
    },
    {
      "hadithNumber": 575,
      "arabicNumber": 575,
      "book": 9,
      "hadithInBook": 51,
      "text": {
        "arabic": "حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، حَدَّثَهُ أَنَّهُمْ، تَسَحَّرُوا مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَامُوا إِلَى الصَّلاَةِ‏.‏ قُلْتُ كَمْ بَيْنَهُمَا قَالَ قَدْرُ خَمْسِينَ أَوْ سِتِّينَ ـ يَعْنِي آيَةً ـ ح‏.‏",
        "translations": {
          "en": "Narrated Anas:Zaid bin Thabit said, \"We took the \"Suhur\" (the meal taken before dawn while fasting is observed) with the Prophet (ﷺ) and then stood up for the (morning) prayer.\" I asked him how long the interval between the two (Suhur and prayer) was. He replied, 'The interval between the two was just sufficient to recite fifty to sixty 'Ayat",
          "ur": "ہم سے عمرو بن عاصم نے یہ حدیث بیان کی، کہا ہم سے ہمام نے یہ حدیث بیان کی قتادہ سے، انہوں نے انس رضی اللہ عنہ سے کہ یزید بن ثابت رضی اللہ عنہ نے ان سے بیان کیا کہ ان لوگوں نے ( ایک مرتبہ ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ سحری کھائی، پھر نماز کے لیے کھڑے ہو گئے۔ میں نے دریافت کیا کہ ان دونوں کے درمیان کس قدر فاصلہ رہا ہو گا۔ فرمایا کہ جتنا پچاس یا ساٹھ آیت پڑھنے میں صرف ہوتا ہے اتنا فاصلہ تھا۔",
          "fr": "Rapporté par Anas : Zaid bin Thabit a dit : « Nous avons pris le “Suhur” (le repas avant l’aube pendant le jeûne) avec le Prophète (ﷺ), puis nous nous sommes levés pour la prière du matin. » Je lui ai demandé combien de temps il y avait entre les deux. Il a répondu : « Juste le temps de réciter cinquante versets. »",
          "id": "Telah menceritakan kepada kami ['Amru bin 'Ashim] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas bin Malik] bahwa [Zaid bin Tsabit] telah menceritakan kepadanya, bahwa mereka pernah sahur bersama Nabi shallallahu 'alaihi wasallam, kemudian mereka berdiri untuk melaksanakan shalat.\" Aku bertanya, \"Berapa jarak antara sahur dengan shalat subuh?\" Dia menjawab, \"Antara lima puluh hingga enam puluh ayat",
          "tr": "Enes İbn Mâlik (r.a.)'den şöyle nakledilmiştir: \"Zeyd bin Sâbit'in Nebi Sallallahu Aleyhi ve Sellem ile birlikte sahur yaptıklarını, sonra da namaza durduklarını bana anlattı. Ona: 'Sabah namazı ile sahur arasında ne kadar zaman geçmişti?' diye sordum. O da: 'Elli ya da altmış âyet okunacak kadar bir zaman' diye cevap verdi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 51
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 576,
      "arabicNumber": 576,
      "book": 9,
      "hadithInBook": 52,
      "text": {
        "arabic": "حَدَّثَنَا حَسَنُ بْنُ صَبَّاحٍ، سَمِعَ رَوْحًا، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَزَيْدَ بْنَ ثَابِتٍ تَسَحَّرَا، فَلَمَّا فَرَغَا مِنْ سَحُورِهِمَا قَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِلَى الصَّلاَةِ فَصَلَّى‏.‏ قُلْنَا لأَنَسٍ كَمْ كَانَ بَيْنَ فَرَاغِهِمَا مِنْ سَحُورِهِمَا وَدُخُولِهِمَا فِي الصَّلاَةِ قَالَ قَدْرُ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً‏.‏",
        "translations": {
          "en": "Narrated Qatada:Anas bin Malik said, \"The Prophet (ﷺ) and Zaid bin Thabit took the 'Suhur' together and after finishing the meal, the Prophet (ﷺ) stood up and prayed (Fajr prayer).\" I asked Anas, \"How long was the interval between finishing their 'Suhur' and starting the prayer?\" He replied, \"The interval between the two was just sufficient to recite fifty 'Ayat.\" (Verses of the Qur'an)",
          "ur": "ہم سے حسن بن صباح نے یہ حدیث بیان کی، انہوں نے روح بن عبادہ سے سنا، انہوں نے کہا ہم سے سعید نے بیان کیا، انہوں نے قتادہ سے روایت کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم اور زید بن ثابت رضی اللہ عنہ نے سحری کھائی، پھر جب وہ سحری کھا کر فارغ ہوئے تو نماز کے لیے اٹھے اور نماز پڑھی۔ ہم نے انس رضی اللہ عنہ سے پوچھا کہ آپ کی سحری سے فراغت اور نماز کی ابتداء میں کتنا فاصلہ تھا؟ انہوں نے فرمایا کہ اتنا کہ ایک شخص پچاس آیتیں پڑھ سکے۔",
          "fr": "Rapporté par Qatada : Anas bin Malik a dit : « Le Prophète (ﷺ) et Zaid bin Thabit ont pris le ‘Suhur’ ensemble et, après avoir fini, le Prophète (ﷺ) s’est levé et a prié (Fajr). » J’ai demandé à Anas combien de temps il y avait entre la fin du ‘Suhur’ et le début de la prière. Il a répondu : « Juste le temps de réciter cinquante versets du Coran. »",
          "id": "Telah menceritakan kepada kami [Hasan bin Shabbah] telah mendengar [Rauh bin 'Ubadah] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik], bahwa Nabi shallallahu 'alaihi wasallam dan Zaid bin Tsabit makan sahur bersama. Setelah keduanya selesai makan sahur, beliau lalu bangkit melaksanakan shalat.\" Kami bertanya kepada Anas, \"Berapa rentang waktu antara selesainya makan sahur hingga keduanya melaksanakan shalat?\" Anas bin Malik menjawab, \"Kira-kira waktu seseorang membaca lima puluh ayat",
          "tr": "Enes İbn Mâlik (r.a.)'den şöyle nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem ile Zeyd İbn Sabit sahur yaptı. Sahurlarını tamamladıktan bir müddet sonra Allah Resulü (Sallallahu Aleyhi ve Sellem) namaz'a durdu. Peşi sıra biz de namaza başladık.\" \"(Raviler şöyle dedi:) 'Enes'e Nebi Sallallahu Aleyhi ve Sellem ile Zeyd'in sahur yapıp namaza başlamaları arasında ne kadar bir zaman geçti?' diye sorduk. Bize 'Bir adamın elli âyet okuyacağı kadar bir zaman' diye cevap verdi. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 52
      },
      "narrator": {
        "en": "Qatada"
      }
    },
    {
      "hadithNumber": 577,
      "arabicNumber": 577,
      "book": 9,
      "hadithInBook": 53,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، أَنَّهُ سَمِعَ سَهْلَ بْنَ سَعْدٍ، يَقُولُ كُنْتُ أَتَسَحَّرُ فِي أَهْلِي ثُمَّ يَكُونُ سُرْعَةٌ بِي أَنْ أُدْرِكَ صَلاَةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Sahl bin Sa`d:I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) with Allah's Messenger (ﷺ)",
          "ur": "ہم سے اسماعیل بن ابی اویس نے بیان کیا اپنے بھائی عبدالحمید بن ابی اویس سے، انہوں نے سلیمان بن بلال سے، انہوں نے ابی حازم سلمہ بن دینار سے کہ انہوں نے سہل بن سعد رضی اللہ عنہ صحابی سے سنا، آپ نے فرمایا کہ میں اپنے گھر سحری کھاتا، پھر نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز فجر پانے کے لیے مجھے جلدی کرنی پڑتی تھی۔",
          "fr": "Rapporté par Sahl bin Sa`d : Je prenais le repas du ‘Suhur’ avec ma famille et je me dépêchais pour attraper la prière du Fajr avec le Messager d’Allah (ﷺ)",
          "id": "Telah menceritakan kepada kami [Isma'il bin Abu Uwais] dari [Saudaranya] dari [Sulaiman] dari [Abu Hazm] bahwa dia mendengar [Sahl bin Sa'd] berkata, \"Suatu kali aku pernah makan sahur bersama keluargaku, kemudian aku bersegera agar dapat melaksanakan shalat Subuh bersama Rasulullah shallallahu 'alaihi wasallam",
          "tr": "Ebu Hazim Sehl İbn Sa'd'ın şöyle dediğini işittiğini nakletmiştir: \"Ailemle birlikte sahur yapardım. Nebi Sallallahu Aleyhi ve Sellem ile sabah namazını kılmaya yetişmek için acele ederdim. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 53
      },
      "narrator": {
        "en": "Sahl bin Sa`d"
      }
    },
    {
      "hadithNumber": 578,
      "arabicNumber": 578,
      "book": 9,
      "hadithInBook": 54,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ أَخْبَرَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ قَالَتْ، كُنَّ نِسَاءُ الْمُؤْمِنَاتِ يَشْهَدْنَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْفَجْرِ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ، ثُمَّ يَنْقَلِبْنَ إِلَى بُيُوتِهِنَّ حِينَ يَقْضِينَ الصَّلاَةَ، لاَ يَعْرِفُهُنَّ أَحَدٌ مِنَ الْغَلَسِ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:The believing women covered with their veiling sheets used to attend the Fajr prayer with Allah's Apostle, and after finishing the prayer they would return to their home and nobody could recognize them because of darkness",
          "ur": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہمیں لیث نے خبر دی، انہوں نے عقیل بن خالد سے، انہوں نے ابن شہاب سے، انہوں نے کہا کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی کہ ام المؤمنین عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ مسلمان عورتیں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز فجر پڑھنے چادروں میں لپٹ کر آتی تھیں۔ پھر نماز سے فارغ ہو کر جب اپنے گھروں کو واپس ہوتیں تو انہیں اندھیرے کی وجہ سے کوئی شخص پہچان نہیں سکتا تھا۔",
          "fr": "Rapporté par `Aisha : Les femmes croyantes, couvertes de leurs voiles, assistaient à la prière du Fajr avec le Messager d’Allah (ﷺ). Après la prière, elles rentraient chez elles et personne ne pouvait les reconnaître à cause de l’obscurité",
          "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata, telah mengabarkan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syuhab] berkata, telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwa ['Aisyah] mengabarkan kepadanya, ia mengatakan, \"Kami, wanita-wanita Mukminat, pernah ikut shalat fajar bersama Rasulullah shallallahu 'alaihi wasallam dengan menutup wajahnya dengan kerudung, kemudian kembali ke rumah mereka masing-masing setelah selesai shalat tanpa diketahui oleh seorangpun karena hari masih gelap",
          "tr": "Urve İbn Zübeyr Âişe (r.anha)'nın kendisine şöyle haber verdiğini nakletmiştir: \"Müslüman kadınlar, mırt adı verilen örtüye bürünerek Nebi Sallallahu Aleyhi ve Sellem ile birlikte sabah namazına iştirak ederlerdi. Namaz bitince evlerine dönerlerdi. Gecenin karanlığından ötürü kimse onları tanımazdı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 54
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 579,
      "arabicNumber": 579,
      "book": 9,
      "hadithInBook": 55,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، وَعَنِ الأَعْرَجِ، يُحَدِّثُونَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَدْرَكَ مِنَ الصُّبْحِ رَكْعَةً قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ الصُّبْحَ، وَمَنْ أَدْرَكَ رَكْعَةً مِنَ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَ الْعَصْرَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the (morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the (`Asr) prayer",
          "ur": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک سے، انہوں نے زید بن اسلم سے، انہوں نے عطاء بن یسار اور بسر بن سعید اور عبدالرحمٰن بن ہرمز اعرج سے، ان تینوں نے ابوہریرہ رضی اللہ عنہ کے واسطے سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے فجر کی ایک رکعت ( جماعت کے ساتھ ) سورج نکلنے سے پہلے پا لی اس نے فجر کی نماز ( باجماعت کا ثواب ) پا لیا۔ اور جس نے عصر کی ایک رکعت ( جماعت کے ساتھ ) سورج ڈوبنے سے پہلے پا لی، اس نے عصر کی نماز ( باجماعت کا ثواب ) پا لیا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Celui qui arrive à faire une rak`a de la prière du Fajr avant le lever du soleil a accompli la prière du matin, et celui qui fait une rak`a de la prière du `Asr avant le coucher du soleil a accompli la prière du `Asr. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Zaid bin Aslam] dari ['Atha bin Yasar], dan dari [Busr bin Sa'id], dan dari [Al A'raj] mereka semua menceritakan dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan satu rakaat dari shalat subuh sebelum terbit matahari berarti dia mendapatkan subuh. Dan siapa yang mendapatkan satu rakaat dari shalat 'Ashar sebelum terbenam matahari berarti dia telah mendapatkan 'Ashar",
          "tr": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Her kim güneş doğmadan önce sabah namazından bir rekat'a yetişirse, sabah namazına yetişmiş demektir. Her kim de, güneş batmadan önce ikindi namazına yetişirse, ikindi namazına yetiş­miş demektir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 55
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 580,
      "arabicNumber": 580,
      "book": 9,
      "hadithInBook": 56,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصَّلاَةِ فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Whoever could get one rak`a of a prayer, (in its proper time) he has got the prayer",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم سے امام مالک نے ابن شہاب سے، انہوں نے ابوسلمہ بن عبدالرحمٰن بن عوف رضی اللہ عنہ سے انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے ایک رکعت نماز ( باجماعت ) پا لی اس نے نماز ( باجماعت کا ثواب ) پا لیا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d'Allah (ﷺ) a dit : « Celui qui parvient à faire une rak‘a d’une prière (dans son temps), il a accompli la prière. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan satu rakaat dari shalat berarti dia telah mendapatkan shalat",
          "tr": "Ebu Hureyre (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: Her kim namaz'ın bir rek'atına yetişirse, namaz'a yetişmiş demek­tir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 56
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 581,
      "arabicNumber": 581,
      "book": 9,
      "hadithInBook": 57,
      "text": {
        "arabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ شَهِدَ عِنْدِي رِجَالٌ مَرْضِيُّونَ وَأَرْضَاهُمْ عِنْدِي عُمَرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الصَّلاَةِ بَعْدَ الصُّبْحِ حَتَّى تَشْرُقَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ‏.‏ حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، سَمِعْتُ أَبَا الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدَّثَنِي نَاسٌ، بِهَذَا‏.‏",
        "translations": {
          "en": "Narrated `Umar:\"The Prophet (ﷺ) forbade praying after the Fajr prayer till the sun rises and after the `Asr prayer till the sun sets.\" Narrated Ibn `Abbas: Some people told me the same narration (as above)",
          "ur": "ہم سے حفص بن عمر نے بیان کیا، انہوں نے کہا ہم سے ہشام دستوائی نے بیان کیا، انہوں نے قتادہ بن دعامہ سے، انہوں نے ابوالعالیہ رفیع سے، انہوں نے ابن عباس رضی اللہ عنہما سے فرمایا کہ میرے سامنے چند معتبر حضرات نے گواہی دی، جن میں سب سے زیادہ معتبر میرے نزدیک عمر رضی اللہ عنہ تھے، کہ نبی کریم صلی اللہ علیہ وسلم نے فجر کی نماز کے بعد سورج بلند ہونے تک اور عصر کی نماز کے بعد سورج ڈوبنے تک نماز پڑھنے سے منع فرمایا۔ ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے شعبہ سے، انہوں نے قتادہ سے کہ میں نے ابوالعالیہ سے سنا، وہ ابن عباس رضی اللہ عنہما سے بیان کرتے تھے کہ انہوں نے فرمایا کہ مجھ سے چند لوگوں نے یہ حدیث بیان کی۔ ( جو پہلے ذکر ہوئی ) ۔",
          "fr": "Rapporté par ‘Umar : Le Prophète (ﷺ) a interdit de prier après la prière du Fajr jusqu’au lever du soleil et après la prière du ‘Asr jusqu’au coucher du soleil. Rapporté aussi par Ibn ‘Abbas : Certaines personnes m’ont raconté la même chose",
          "id": "Telah menceritakan kepada kami [Hafsh bin 'Umar] berkata, telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Abu Al Aliyah] dari [Ibnu 'Abbas] berkata, \"Orang-orang yang diridlai mempersaksikan kepadaku dan di antara mereka yang paling aku ridlai adalah ['Umar], (mereka semua mengatakan) bahwa Nabi shallallahu 'alaihi wasallam melarang shalat setelah Shubuh hingga matahari terbit, dan setelah 'Ashar sampai matahari terbenam.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Qatadah] aku mendengar [Abu Al Aliyah] dari [Ibnu 'Abbas] berkata, \"Orang-orang (para sahabat) menceritakan hadits ini kepadaku",
          "tr": "İbni Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Bence aralarında, Müslümanların rızasını en fazla kazanan Ömer (r.a.)'in de bulunduğu, (adı, sıdk, emanet ve diyanet bakımından) insanların kendilerinden razı olduğu birçok kimse bana, Nebi Sallallahu Aleyhi ve Sellem'in sabah namazından sonra güneş ışıklarının doğmasına, ikindi namazından sonra da güneş batıncaya kadar namaz kılmayı yasakladığını bildirdi. Tekrar: 585, 589, 1192, 1629, 3273. Diğer tahric: Tirmizi Salat; Nesâî, Mevâkît"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 57
      },
      "narrator": {
        "en": "`Umar"
      }
    },
    {
      "hadithNumber": 583,
      "arabicNumber": 583,
      "book": 9,
      "hadithInBook": 58,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَنِي ابْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَحَرَّوْا بِصَلاَتِكُمْ طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا ‏\"‏‏.‏ وَقَالَ حَدَّثَنِي ابْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا طَلَعَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَرْتَفِعَ، وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَغِيبَ ‏\"‏‏.‏ تَابَعَهُ عَبْدَةُ‏.‏",
        "translations": {
          "en": "Narrated Hisham's father:Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'Do not pray at the time of sunrise and at the time of sunset.' \" Ibn `Umar said, \"Allah's Messenger (ﷺ) said, 'If the edge of the sun appears (above the horizon) delay the prayer till it becomes high, and if the edge of the sun disappears, delay the prayer till it sets (disappears completely)",
          "fr": "Rapporté par le père de Hisham : Ibn ‘Umar a dit : Le Messager d’Allah (ﷺ) a dit : « Ne priez pas au moment du lever du soleil ni au moment de son coucher. » Ibn ‘Umar a dit : Le Messager d’Allah (ﷺ) a dit : « Si le bord du soleil apparaît (à l’horizon), retardez la prière jusqu’à ce qu’il soit bien levé, et si le bord du soleil disparaît, retardez la prière jusqu’à ce qu’il se couche complètement. »",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] berkata, telah mengabarkan kepadaku [Bapakku] berkata, telah mengabarkan kepadaku [Ibnu 'Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian sengaja melaksanakan shalat ketika matahari sedang terbit dan juga ketika terbenamnya.\" Dan telah menceritakan kepadaku Ibnu 'Umar berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika matahari sedang terbit maka tundalah shalat hingga telah meninggi, dan jika matahari sedang terbenam maka tundalah shalat hingga menghilang.\" Hadits ini juga kuatkan oleh ['Abdah]",
          "tr": "İbn Ömer (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Güneş yuvarlağının bir kısmı doğunca, namazı güneşin yükseleceği vakte kadar erteleyin. Güneş yuvarlağının bir kısmı batınca, namazı güneşin tamamen batacağı vakte kadar te'hir edin. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 58
      },
      "narrator": {
        "en": "Hisham's father"
      }
    },
    {
      "hadithNumber": 584,
      "arabicNumber": 584,
      "book": 9,
      "hadithInBook": 59,
      "text": {
        "arabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعَتَيْنِ وَعَنْ لِبْسَتَيْنِ وَعَنْ صَلاَتَيْنِ نَهَى عَنِ الصَّلاَةِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ، وَعَنِ اشْتِمَالِ الصَّمَّاءِ وَعَنْ الاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ يُفْضِي بِفَرْجِهِ إِلَى السَّمَاءِ، وَعَنِ الْمُنَابَذَةِ وَالْمُلاَمَسَةِ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) forbade two kinds of sales, two kinds of dresses, and two prayers. He forbade offering prayers after the Fajr prayer till the rising of the sun and after the `Asr prayer till its setting. He also forbade \"Ishtimal-Assama [??] \" and \"al-Ihtiba\" in one garment in such a way that one's private parts are exposed towards the sky. He also forbade the sales called \"Munabadha\" and \"Mulamasa.\" (See Hadith No. 354 and 355 Vol)",
          "ur": "ہم سے عبید بن اسماعیل نے بیان کیا، انہوں نے ابی اسامہ کے واسطے سے بیان کیا۔ انہوں نے عبیداللہ بن عمر سے، انہوں نے خبیب بن عبدالرحمٰن سے، انہوں نے حفص بن عاصم سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے دو طرح کی خرید و فروخت اور دو طرح کے لباس اور دو وقتوں کی نمازوں سے منع فرمایا۔ آپ صلی اللہ علیہ وسلم نے نماز فجر کے بعد سورج نکلنے تک اور نماز عصر کے بعد غروب ہونے تک نماز پڑھنے سے منع فرمایا ( اور کپڑوں میں ) اشتمال صماء یعنی ایک کپڑا اپنے اوپر اس طرح لپیٹ لینا کہ شرمگاہ کھل جائے۔ اور ( احتباء ) یعنی ایک کپڑے میں گوٹ مار کر بیٹھنے سے منع فرمایا۔ ( اور خرید و فروخت میں ) آپ صلی اللہ علیہ وسلم نے منابذہ اور ملامسہ سے منع فرمایا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a interdit deux types de ventes, deux types de vêtements et deux prières. Il a interdit de prier après la prière du Fajr jusqu’au lever du soleil et après la prière du ‘Asr jusqu’à son coucher. Il a aussi interdit « Ishtimal-Assama » et « al-Ihtiba » dans un seul vêtement de façon à ce que les parties intimes soient tournées vers le ciel. Il a également interdit les ventes appelées « Munabadha » et « Mulamasa ». (Voir hadith n°354 et 355, volume)",
          "id": "Telah menceritakan kepada kami ['Ubaid bin Isma'il] dari [Abu Usamah] dari ['Ubaidullah] dari [Khubaib bin 'Abdurrahman] dari [Hafsh bin 'Ashim] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari dua macam jual beli, dua cara berpakaian dan dua shalat. Beliau melarang shalat setelah Shubuh sampai terbit matahari dan setelah 'Ashar sampai matahari terbenam. Melarang dari pakaian shama` dan duduk ihtiba` dengan satu kain sehingga menghadapkan kemaluannya ke langit. Dan beliau juga melarang dari jual beli Al Munabadzah dan Al Mulasamah",
          "tr": "Ebu Hureyre (r.a.)'den şöyle nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem iki tür alışverişi, iki tür giyinmeyi ve iki namazı yasaklamıştır: Güneş doğuncaya kadar sabah namazından sonra, batıncaya kadar da ikindi namazından sonra namaz kılmayı, Sama şeklinde bürünmeyi ve bir elbise ile ihtibâ şeklinde örtünmeyi, münabeze ve mülameseyi yasaklamıştır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 59
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 585,
      "arabicNumber": 585,
      "book": 9,
      "hadithInBook": 60,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَتَحَرَّى أَحَدُكُمْ فَيُصَلِّي عِنْدَ طُلُوعِ الشَّمْسِ وَلاَ عِنْدَ غُرُوبِهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:Allah's Messenger (ﷺ) said, \"None of you should try to pray at sunrise or sunset",
          "ur": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہ کہا ہمیں امام مالک نے نافع سے خبر دی، انہوں نے ابن عمر رضی اللہ عنہما سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، کوئی تم میں سے انتظار میں نہ بیٹھا رہے کہ سورج طلوع ہوتے ہی نماز کے لیے کھڑا ہو جائے، اسی طرح سورج کے ڈوبنے کے انتظار میں بھی نہ رہنا چاہیے۔",
          "fr": "Rapporté par Ibn ‘Umar : Le Messager d’Allah (ﷺ) a dit : « Aucun d’entre vous ne doit essayer de prier au lever ou au coucher du soleil. »",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Nafi'] dari [Ibnu 'Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian sengaja shalat ketika matahari sedang terbit dan atau ketika saat terbenam",
          "tr": "İbn Ömer (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Sizd'en biri güneşin batışı veya doğuşu esnasında namaz kılmaya kalkışmasın"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 60
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 586,
      "arabicNumber": 586,
      "book": 9,
      "hadithInBook": 61,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ الْجُنْدَعِيُّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ صَلاَةَ بَعْدَ الصُّبْحِ حَتَّى تَرْتَفِعَ الشَّمْسُ، وَلاَ صَلاَةَ بَعْدَ الْعَصْرِ حَتَّى تَغِيبَ الشَّمْسُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Sa`id Al-Khudri:I heard Allah's Messenger (ﷺ) saying, \"There is no prayer after the morning prayer till the sun rises, and there is no prayer after the `Asr prayer till the sun sets",
          "ur": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا، انہوں نے صالح سے یہ حدیث بیان کی، انہوں نے ابن شہاب سے، انہوں نے کہا مجھ سے عطاء بن یزید جندعی لیثی نے بیان کیا کہ انہوں نے ابو سعید خدری رضی اللہ عنہ سے سنا۔ انہوں نے فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ فجر کی نماز کے بعد کوئی نماز سورج کے بلند ہونے تک نہ پڑھی جائے، اسی طرح عصر کی نماز کے بعد سورج ڈوبنے تک کوئی نماز نہ پڑھی جائے۔",
          "fr": "Rapporté par Abu Sa‘id Al-Khudri : J’ai entendu le Messager d’Allah (ﷺ) dire : « Il n’y a pas de prière après la prière du matin jusqu’à ce que le soleil se lève, et il n’y a pas de prière après la prière du ‘Asr jusqu’à ce que le soleil se couche. »",
          "id": "Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Shalih] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku ['Atha bin Yazid Al Junda'i] bahwa dia mendengar [Abu Sa'id Al Khudri] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada shalat setelah Shubuh hingga matahari meninggi dan tidak ada shalat setelah 'Ashar hingga matahari menghilang",
          "tr": "Ebu Saîd el-Hudrî (r.a.) Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini işittiğini nakletmiştir: \"Güneş yükselinceye kadar sabah namazından sonra namaz kılınmaz! Güneş batıncaya kadar da, ikindi namazından sonra namazı kılınmaz! Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 61
      },
      "narrator": {
        "en": "Abu Sa`id Al-Khudri"
      }
    },
    {
      "hadithNumber": 587,
      "arabicNumber": 587,
      "book": 9,
      "hadithInBook": 62,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ عَنْ مُعَاوِيَةَ، قَالَ إِنَّكُمْ لَتُصَلُّونَ صَلاَةً، لَقَدْ صَحِبْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَمَا رَأَيْنَاهُ يُصَلِّيهَا، وَلَقَدْ نَهَى عَنْهُمَا، يَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ‏.‏",
        "translations": {
          "en": "Narrated Muawiya:You offer a prayer which I did not see being offered by Allah's Messenger (ﷺ) when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer)",
          "ur": "ہم سے محمد بن ابان نے بیان کیا، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا، کہا کہ ہم سے شعبہ نے حدیث بیان کی ابوالتیاح یزید بن حمید سے، کہا کہ میں نے حمران بن ابان سے سنا، وہ معاویہ بن ابی سفیان رضی اللہ عنہما سے یہ حدیث بیان کرتے تھے کہ انھوں نے فرمایا کہ تم لوگ تو ایک ایسی نماز پڑھتے ہو کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی صحبت میں رہے لیکن ہم نے کبھی آپ صلی اللہ علیہ وسلم کو وہ نماز پڑھتے نہیں دیکھا۔ بلکہ آپ صلی اللہ علیہ وسلم نے تو اس سے منع فرمایا تھا۔ معاویہ رضی اللہ عنہ کی مراد عصر کے بعد دو رکعتوں سے تھی ( جسے آپ کے زمانہ میں بعض لوگ پڑھتے تھے ) ۔",
          "fr": "Rapporté par Muawiya : Vous faites une prière que je n’ai pas vue être pratiquée par le Messager d’Allah (ﷺ) quand nous étions avec lui, et il l’avait certainement interdite (c’est-à-dire deux rak‘a après la prière du ‘Asr)",
          "id": "Telah menceritakan kepada kami [Muhammad bin Aban] berkata, telah menceritakan kepada kami [Ghundar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu At Tiyah] berkata, aku mendengar [Humran bin Aban] menceritakan dari [Mu'awiyyah] berkata, \"Sungguh kalian telah mengerjakan suatu shalat (yang dilarang). Kami telah mendampingi Rasulullah shallallahu 'alaihi wasallam, dan kami tidak pernah melihat beliau melaksanakannya. Beliau telah melarang keduanya, yaitu dua rakaat setelah shalat 'Ashar",
          "tr": "Muaviye'nin şöyle dediği nakledilmiştir; \"Siz öyle bir namaz kılıyorsunuz ki, biz Nebi Sallallahu Aleyhi ve Sellem İle birlikte olduk. Onun sizin bu namazınız gibi bir namaz kıldığına şahit olmadık. Muhakkak ki o, bunları.\" (Bu sözleriyle ikindi namazından sonra kılınan iki rekatı kasdetmiştir.) Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 62
      },
      "narrator": {
        "en": "Muawiya"
      }
    },
    {
      "hadithNumber": 588,
      "arabicNumber": 588,
      "book": 9,
      "hadithInBook": 63,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَتَيْنِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ، وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) forbade the offering of two prayers: -1. after the morning prayer till the sunrises. -2. after the `Asr prayer till the sun sets",
          "ur": "ہم سے محمد بن سلام نے بیان کیا، انہوں نے کہا کہ ہم سے عبدہ نے بیان کیا، انہوں نے عبیداللہ سے خبر دی، انہوں نے خبیب سے، انہوں نے حفص بن عاصم سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے دو وقت نماز پڑھنے سے منع فرمایا، نماز فجر کے بعد سورج نکلنے تک اور نماز عصر کے بعد سورج غروب ہونے تک۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a interdit deux prières : 1. après la prière du matin jusqu’au lever du soleil, 2. après la prière du ‘Asr jusqu’au coucher du soleil",
          "id": "Telah menceritakan kepada kami [Muhammad bin Salam] berkata, telah menceritakan kepada kami ['Abdah] dari ['Ubaidullah] dari [Khubaib] dari [Hafsh bin 'Ashim] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari dua macam shalat; dua rakaat setelah Shubuh hingga terbit matahari dan dua rakaat setelah 'Ashar hingga matahari terbenam",
          "tr": "Ebu Hureyre (r.a.)'in şöyle dediği nakledilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem şu iki namazı yasakladı: Sabah namazından sonra güneş doğuncaya kadar kılınan namaz ile ikindi namazından sonra güneş batıncaya kadar kılınan namaz"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 63
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 589,
      "arabicNumber": 589,
      "book": 9,
      "hadithInBook": 64,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ أُصَلِّي كَمَا رَأَيْتُ أَصْحَابِي يُصَلُّونَ، لاَ أَنْهَى أَحَدًا يُصَلِّي بِلَيْلٍ وَلاَ نَهَارٍ مَا شَاءَ، غَيْرَ أَنْ لاَ تَحَرَّوْا طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:I pray as I saw my companions praying. I do not forbid praying at any time during the day or night except at sunset and sunrise",
          "ur": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا، کہا ہم سے حماد بن زید نے ایوب سے کہا، انہوں نے نافع سے، انہوں نے ابن عمر رضی اللہ عنہما سے، آپ نے فرمایا کہ جس طرح میں نے اپنے ساتھیوں کو نماز پڑھتے دیکھا، میں بھی اسی طرح نماز پڑھتا ہوں، کسی کو روکتا نہیں۔ دن اور رات کے جس حصہ میں جی چاہے نماز پڑھ سکتا ہے، البتہ سورج کے طلوع اور غروب کے وقت نماز نہ پڑھا کرو۔",
          "fr": "Rapporté par Ibn ‘Umar : Je prie comme j’ai vu mes compagnons prier. Je n’interdis pas de prier à n’importe quel moment du jour ou de la nuit, sauf au coucher et au lever du soleil",
          "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar] berkata, \"Aku melaksanakan shalat sebagaimana aku melihat para sahabatku melaksanakannya. Aku tidak melarang seorangpun untuk melaksanakan shalat baik di malam hari maupun di siang hari, kecuali bila kalian sengaja mengerjakannya saat matahari sedang terbit atau ketika sedang terbenamnya",
          "tr": "İbn Ömer radiyallahu anh'den şöyle nakledilmiştir: \"Arkadaşlarımı nasıl namaz kılarken gördüysem öyle namaz kılıyorum. Güneşin doğduğu veya battığı anda namaz kılmaya kalkışanlar dışında, gece veya gündüzün herhangi bir vaktinde namaz kılmak isteyen kimseye namaz kılmasını yasaklamam"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 64
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 590,
      "arabicNumber": 590,
      "book": 9,
      "hadithInBook": 65,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي أَبِي أَنَّهُ، سَمِعَ عَائِشَةَ، قَالَتْ وَالَّذِي ذَهَبَ بِهِ مَا تَرَكَهُمَا حَتَّى لَقِيَ اللَّهَ، وَمَا لَقِيَ اللَّهَ تَعَالَى حَتَّى ثَقُلَ عَنِ الصَّلاَةِ، وَكَانَ يُصَلِّي كَثِيرًا مِنْ صَلاَتِهِ قَاعِدًا ـ تَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ ـ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّيهِمَا، وَلاَ يُصَلِّيهِمَا فِي الْمَسْجِدِ مَخَافَةَ أَنْ يُثَقِّلَ عَلَى أُمَّتِهِ، وَكَانَ يُحِبُّ مَا يُخَفَّفُ عَنْهُمْ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:By Allah, Who took away the Prophet. The Prophet (ﷺ) never missed them (two rak`at) after the `Asr prayer till he met Allah and he did not meet Allah till it became heavy for him to pray while standing so he used to offer most of the prayers while sitting. (She meant the two rak`at after `Asr) He used to pray them in the house and never prayed them in the mosque lest it might be hard for his followers and he loved what was easy for them",
          "ur": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہ کہا ہم سے عبدالواحد بن ایمن نے بیان کیا، کہا کہ مجھ سے میرے باپ ایمن نے حدیث بیان کی کہ انہوں نے عائشہ رضی اللہ عنہا سے سنا، آپ نے فرمایا کہ اللہ کی قسم! جس نے رسول اللہ صلی اللہ علیہ وسلم کو اپنے یہاں بلا لیا۔ آپ صلی اللہ علیہ وسلم نے عصر کے بعد کی دو رکعات کو کبھی ترک نہیں فرمایا، یہاں تک کہ آپ صلی اللہ علیہ وسلم ، اللہ پاک سے جا ملے۔ اور آپ صلی اللہ علیہ وسلم کو وفات سے پہلے نماز پڑھنے میں بڑی دشواری پیش آتی تھی۔ پھر اکثر آپ صلی اللہ علیہ وسلم بیٹھ کر نماز ادا فرمایا کرتے تھے۔ اگرچہ نبی کریم صلی اللہ علیہ وسلم انہیں پوری پابندی کے ساتھ پڑھتے تھے لیکن اس خوف سے کہ کہیں ( صحابہ بھی پڑھنے لگیں اور اس طرح ) امت کو گراں باری ہو، انہیں آپ صلی اللہ علیہ وسلم مسجد میں نہیں پڑھتے تھے۔ آپ صلی اللہ علیہ وسلم کو اپنی امت کا ہلکا رکھنا پسند تھا۔",
          "fr": "Rapporté par ‘Aisha : Par Allah, qui a rappelé le Prophète à Lui. Le Prophète (ﷺ) n’a jamais délaissé ces deux rak‘a après la prière du ‘Asr jusqu’à ce qu’il rencontre Allah, et il n’a pas rencontré Allah avant que cela ne devienne difficile pour lui de prier debout, alors il priait la plupart du temps assis. (Elle parlait des deux rak‘a après ‘Asr.) Il les priait chez lui et ne les priait jamais à la mosquée pour ne pas rendre cela difficile à ses compagnons, car il aimait leur faciliter les choses",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami ['Abdul Wahid bin Aiman] berkata, telah menceritakan kepadaku [Bapakku] bahwa dia mendengar ['Aisyah] berkata, \"Demi Dzat yang telah mewafatkan beliau, beliau tidak pernah meninggalkan keduanya hingga beliau berjuma Allah, dan tidaklah beliau bertemu Allah hingga terasa berat mengerjakan shalat (tua). Beliau sering mengerjakan shalat dengan duduk, yakni dua rakaat setelah 'Ashar. Namun Nabi shallallahu 'alaihi wasallam tidak mengerjakannya di masjid karena khawatir akan memberatkan ummatnya, sebab beliau lebih suka meringankan mereka",
          "tr": "Aişe radiyallahu anha şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'i vefat ettiren Allah'a yemin olsun ki, Allah Resulü ikindi namazından sonra kıldığı iki rek'at namazı Hak Teâlâ'ya kavuşuncaya kadar terk etmedi. Namaz kılacak takati kalmayıncaya kadar Hak Teâlâ'ya kavuşmadı. Namazlarının (ikindi namazından sonra kıldığı iki rekatlik namazların) pek çoğunu oturarak kılardı. Daima Nebi Sallallahu Aleyhi ve Sellem bu iki rekatlık namaz'ı kılardı. Ancak ümmetine ağır gelir korkusu ile bu namazları mescidde kılmazdı. Ümmetinin sorumluluklarının hafifletilmesi hoşuna giderdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 65
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 591,
      "arabicNumber": 591,
      "book": 9,
      "hadithInBook": 66,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي قَالَتْ، عَائِشَةُ ابْنَ أُخْتِي مَا تَرَكَ النَّبِيُّ صلى الله عليه وسلم السَّجْدَتَيْنِ بَعْدَ الْعَصْرِ عِنْدِي قَطُّ‏.‏",
        "translations": {
          "en": "Narrated Hisham's father:`Aisha (addressing me) said, \"O son of my sister! The Prophet (ﷺ) never missed two prostrations (i.e. rak`at) after the `Asr prayer in my house",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ قطان نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، کہا کہ مجھے میرے باپ عروہ نے خبر دی، کہا کہ عائشہ رضی اللہ عنہا نے فرمایا میرے بھانجے! نبی کریم صلی اللہ علیہ وسلم نے عصر کے بعد کی دو رکعات میرے یہاں کبھی ترک نہیں کیں۔",
          "fr": "Rapporté par le père de Hisham : ‘Aisha (s’adressant à moi) a dit : « Ô fils de ma sœur ! Le Prophète (ﷺ) n’a jamais délaissé deux prosternations (c’est-à-dire deux rak‘a) après la prière du ‘Asr dans ma maison. »",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] berkata, telah menceritakan kepada kami [Hisyam] berkata, telah mengabarkan kepadaku [Bapakku] - [Aisyah] berkata; yaitu anak saudara perempuanku-, \"Nabi shallallahu 'alaihi wasallam tidak pernah meninggalkan dua rakaat setelah shalat 'Ashar",
          "tr": "Hişam'dan şöyle nakledilmiştir: \"Babam, Âişe r.anha'nın kendisine şöyle dediğini bana haber verdi: Yeğenim! Allah Resulü yanımda bulunduğu zaman süresince ikindi namazından sonra kıldığı iki rekat namazı asla terk etmedi.\" AÇIKLAMA 351.sayfa’da"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 66
      },
      "narrator": {
        "en": "Hisham's father"
      }
    },
    {
      "hadithNumber": 592,
      "arabicNumber": 592,
      "book": 9,
      "hadithInBook": 67,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الشَّيْبَانِيُّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ رَكْعَتَانِ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَعُهُمَا سِرًّا وَلاَ عَلاَنِيَةً رَكْعَتَانِ قَبْلَ صَلاَةِ الصُّبْحِ، وَرَكْعَتَانِ بَعْدَ الْعَصْرِ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Allah's Messenger (ﷺ) never missed two rak`at before the Fajr prayer and after the `Asr prayer openly and secretly",
          "ur": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا، کہا ہم سے شیبانی نے بیان کیا، کہا ہم سے عبدالرحمٰن بن اسود نے بیان کیا، انہوں نے اپنے باپ سے، انہوں نے عائشہ رضی اللہ عنہا سے کہ آپ نے فرمایا کہ دو رکعتوں کو رسول اللہ صلی اللہ علیہ وسلم نے کبھی ترک نہیں فرمایا، پوشیدہ ہو یا عام لوگوں کے سامنے، صبح کی نماز سے پہلے دو رکعات اور عصر کی نماز کے بعد دو رکعات۔",
          "fr": "Rapporté par ‘Aisha : Le Messager d’Allah (ﷺ) n’a jamais délaissé deux rak‘a avant la prière du Fajr et après la prière du ‘Asr, que ce soit en public ou en privé",
          "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami ['Abdul Wahid] berkata, telah menceritakan kepada kami [Asy Syaibani] berkata, telah menceritakan kepada kami ['Abdurrahman bin Al Aswad] dari [Bapaknya] dari ['Aisyah] berkata, \"Dua rakaat yang tidak pernah Rasulullah shallallahu 'alaihi wasallam tinggalkan baik secara sembunyi-sembunyi maupun terang-terangan adalah dua rakaat sebelum Shubuh dan dua rakaat setelah 'Ashar",
          "tr": "Âişe r.anha şöyle demiştir: \"İki namaz vardır ki, Allah Resulü onları ne gizli ne de herkesin yanında kıldığı zaman terk ederdi. Bunlar, sabah namazının farzından önce kılınan iki rekat namaz ile ikindi namazının farzından sonra kılınan iki rekat namazdır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 67
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 593,
      "arabicNumber": 593,
      "book": 9,
      "hadithInBook": 68,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ رَأَيْتُ الأَسْوَدَ وَمَسْرُوقًا شَهِدَا عَلَى عَائِشَةَ قَالَتْ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْتِينِي فِي يَوْمٍ بَعْدَ الْعَصْرِ إِلاَّ صَلَّى رَكْعَتَيْنِ‏.‏",
        "translations": {
          "en": "Narrated `Aisha:Whenever the Prophet (ﷺ) come to me after the `Asr prayer, he always prayed two rak`at",
          "ur": "ہم سے محمد بن عرعرہ نے بیان کیا، کہا ہم سے شعبہ نے ابواسحاق سے بیان کیا، کہا کہ ہم نے اسود بن یزید اور مسروق بن اجدع کو دیکھا کہ انھوں نے عائشہ رضی اللہ عنہا کے اس کہنے پر گواہی دی کہ نبی کریم صلی اللہ علیہ وسلم جب بھی میرے گھر میں عصر کے بعد تشریف لائے تو دو رکعت ضرور پڑھتے۔",
          "fr": "Rapporté par ‘Aisha : Chaque fois que le Prophète (ﷺ) venait chez moi après la prière du ‘Asr, il priait toujours deux rak‘a",
          "id": "Telah menceritakan kepada kami [Muhammad bin 'Ar'arah] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] berkata, Aku melihat [Al Aswad] dan [Masruq] bersaksi atas ['Aisyah] ia berkata, \"Tidaklah Nabi shallallahu 'alaihi wasallam mendatangiku dalam suatu hari setelah 'Ashar kecuali beliau shalat dua rakaat",
          "tr": "Ebu İshak'tan şöyle nakledilmiştir: \"Esved ile Mesruk Aişe r.anha'nın: \"Nebi Sallallahu Aleyhi ve Sellem her ne vakit ikindi namazından sonra bana gelse iki rekat namaz kılardı\" dediğine şahit olmuşlardı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 68
      },
      "narrator": {
        "en": "`Aisha"
      }
    },
    {
      "hadithNumber": 594,
      "arabicNumber": 594,
      "book": 9,
      "hadithInBook": 69,
      "text": {
        "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى ـ هُوَ ابْنُ أَبِي كَثِيرٍ ـ عَنْ أَبِي قِلاَبَةَ، أَنَّ أَبَا الْمَلِيحِ، حَدَّثَهُ قَالَ كُنَّا مَعَ بُرَيْدَةَ فِي يَوْمٍ ذِي غَيْمٍ فَقَالَ بَكِّرُوا بِالصَّلاَةِ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَكَ صَلاَةَ الْعَصْرِ حَبِطَ عَمَلُهُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Ibn Abu Malih [??]:I was with Buraida on a cloudy day and he said, \"Offer the `Asr prayer earlier as the Prophet (ﷺ) said, 'Whoever leaves the `Asr prayer will have all his (good) deeds annulled.\" (See Hadith No. 527 and)",
          "ur": "ہم سے معاذ بن فضالہ نے بیان کیا، انہوں نے کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے بیان کیا، وہ قلابہ سے نقل کرتے ہیں کہ ابوالملیح عامر بن اسامہ ہذلی نے ان سے بیان کیا، انہوں نے کہا کہ ہم ابر کے دن ایک مرتبہ بریدہ بن حصیب رضی اللہ عنہ صحابی کے ساتھ تھے، انہوں نے فرمایا کہ نماز سویرے پڑھا کرو۔ کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے عصر کی نماز چھوڑی اس کا عمل اکارت ہو گیا۔",
          "fr": "Rapporté par Ibn Abu Malih : J’étais avec Buraida un jour nuageux et il a dit : « Prie la prière du ‘Asr plus tôt, car le Prophète (ﷺ) a dit : ‘Celui qui délaisse la prière du ‘Asr verra toutes ses bonnes actions annulées.’ » (Voir hadith n°527 et)",
          "id": "Telah menceritakan kepada kami [Mu'adz bin Fadlalah] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] -yaitu Ibnu Abu Katsir- dari [Abu Qilabah] bahwa [Abu Al Malih] menceritakan kepadanya, ia berkata, \"Kami pernah bersama [Buraidah] pada suatu hari yang mendung, ia lalu berkata, \"Segeralah laksanakan shalat, karena Nabi shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa meninggalkan shalat 'Ashar, sungguh telah hapuslah amalnya",
          "tr": "Ebu Kılabe, Ebu'l-Melih'in kendisine şöyle naklettiğini rivayet etmiştir: \"Bulutlu bir günde Büreyde ile birlikte idik. Bize 'Namazı erken kılın! Zira Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: Her kim ikindi namazını terk ederse ameli boşa gider' dedi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 69
      },
      "narrator": {
        "en": "Ibn Abu Malih [??]"
      }
    },
    {
      "hadithNumber": 595,
      "arabicNumber": 595,
      "book": 9,
      "hadithInBook": 70,
      "text": {
        "arabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا حُصَيْنٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ سِرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم لَيْلَةً فَقَالَ بَعْضُ الْقَوْمِ لَوْ عَرَّسْتَ بِنَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَخَافُ أَنْ تَنَامُوا عَنِ الصَّلاَةِ ‏\"‏‏.‏ قَالَ بِلاَلٌ أَنَا أُوقِظُكُمْ‏.‏ فَاضْطَجَعُوا وَأَسْنَدَ بِلاَلٌ ظَهْرَهُ إِلَى رَاحِلَتِهِ، فَغَلَبَتْهُ عَيْنَاهُ فَنَامَ، فَاسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم وَقَدْ طَلَعَ حَاجِبُ الشَّمْسِ فَقَالَ ‏\"‏ يَا بِلاَلُ أَيْنَ مَا قُلْتَ ‏\"‏‏.‏ قَالَ مَا أُلْقِيَتْ عَلَىَّ نَوْمَةٌ مِثْلُهَا قَطُّ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ قَبَضَ أَرْوَاحَكُمْ حِينَ شَاءَ، وَرَدَّهَا عَلَيْكُمْ حِينَ شَاءَ، يَا بِلاَلُ قُمْ فَأَذِّنْ بِالنَّاسِ بِالصَّلاَةِ ‏\"‏‏.‏ فَتَوَضَّأَ فَلَمَّا ارْتَفَعَتِ الشَّمْسُ وَابْيَاضَّتْ قَامَ فَصَلَّى‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin Abi Qatada:My father said, \"One night we were traveling with the Prophet (ﷺ) and some people said, 'We wish that Allah's Messenger (ﷺ) would take a rest along with us during the last hours of the night.' He said, 'I am afraid that you will sleep and miss the (Fajr) prayer.' Bilal said, 'I will make you get up.' So all slept and Bilal rested his back against his Rahila and he too was overwhelmed (by sleep) and slept. The Prophet (ﷺ) got up when the edge of the sun had risen and said, 'O Bilal! What about your statement?' He replied, 'I have never slept such a sleep.' The Prophet (ﷺ) said, 'Allah captured your souls when He wished, and released them when He wished. O Bilal! Get up and pronounce the Adhan for the prayer.' The Prophet (ﷺ) performed ablution and when the sun came up and became bright, he stood up and prayed",
          "ur": "ہم سے عمران بن میسرہ نے روایت کیا، کہا ہم سے محمد بن فضیل نے بیان کیا، کہا کہ ہم سے حصین بن عبدالرحمٰن نے عبداللہ بن ابی قتادہ سے، انہوں نے اپنے باپ سے، کہا ہم ( خیبر سے لوٹ کر ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ رات میں سفر کر رہے تھے۔ کسی نے کہا کہ یا رسول اللہ! آپ اب پڑاؤ ڈال دیتے تو بہتر ہوتا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ڈر ہے کہ کہیں نماز کے وقت بھی تم سوتے نہ رہ جاؤ۔ اس پر بلال رضی اللہ عنہ بولے کہ میں آپ سب لوگوں کو جگا دوں گا۔ چنانچہ سب لوگ لیٹ گئے۔ اور بلال رضی اللہ عنہ نے بھی اپنی پیٹھ کجاوہ سے لگا لی۔ اور ان کی بھی آنکھ لگ گئی اور جب نبی کریم صلی اللہ علیہ وسلم بیدار ہوئے تو سورج کے اوپر کا حصہ نکل چکا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا بلال! تو نے کیا کہا تھا۔ وہ بولے آج جیسی نیند مجھے کبھی نہیں آئی۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہاری ارواح کو جب چاہتا ہے قبض کر لیتا ہے اور جس وقت چاہتا ہے واپس کر دیتا ہے۔ اے بلال! اٹھ اور اذان دے۔ پھر آپ صلی اللہ علیہ وسلم نے وضو کیا اور جب سورج بلند ہو کر روشن ہو گیا تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور نماز پڑھائی۔",
          "fr": "Rapporté par ‘Abdullah bin Abi Qatada : Mon père a dit : « Une nuit, nous voyagions avec le Prophète (ﷺ) et certains ont dit : ‘Nous aimerions que le Messager d’Allah (ﷺ) se repose avec nous pendant la dernière partie de la nuit.’ Il a dit : ‘J’ai peur que vous dormiez et manquiez la prière (du Fajr).’ Bilal a dit : ‘Je vous réveillerai.’ Alors tous se sont endormis et Bilal s’est adossé à sa monture et a aussi été pris par le sommeil. Le Prophète (ﷺ) s’est réveillé quand le soleil était déjà levé et a dit : ‘Ô Bilal ! Qu’en est-il de ta promesse ?’ Il a répondu : ‘Je n’ai jamais dormi d’un tel sommeil.’ Le Prophète (ﷺ) a dit : ‘Allah a pris vos âmes quand Il l’a voulu, et Il les a rendues quand Il l’a voulu. Ô Bilal ! Lève-toi et fais l’Adhan pour la prière.’ Le Prophète (ﷺ) a fait ses ablutions et quand le soleil était bien levé, il s’est levé et a prié. »",
          "id": "Telah menceritakan kepada kami ['Imran bin Maisarah] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] berkata, telah menceritakan kepada kami [Hushain] dari ['Abdullah bin Abu Qatadah] dari [Bapaknya] berkata, \"Kami pernah berjalan bersama Nabi shallallahu 'alaihi wasallam pada suatu malam. Sebagian kaum lalu berkata, \"Wahai Rasulullah, sekiranya Tuan mau istirahat sebentar bersama kami?\" Beliau menjawab: \"Aku khawatir kalian tertidur sehingga terlewatkan shalat.\" Bilal berkata, \"Aku akan membangunkan kalian.\" Maka merekapun berbaring, sedangkan Bilal bersandar pada hewan tunggannganya, tapi rasa kantuknya mengalahkannya dan akhirnya iapun tertidur. Ketika Nabi shallallahu 'alaihi wasallam terbangun ternyata matahari sudah terbit, maka beliau pun bersabda: \"Wahai Bilal, mana bukti yang kau ucapkan!\" Bilal menjawab: \"Aku belum pernah sekalipun merasakan kantuk seperti ini sebelumnya.\" Beliau lalu bersabda: \"Sesungguhnya Allah Azza Wa Jalla memegang ruh-ruh kalian sesuai kehendak-Nya dan mengembalikannya kepada kalian sekehendak-Nya pula. Wahai Bilal, berdiri dan adzanlah (umumkan) kepada orang-orang untuk shalat!\" kemudian beliau berwudlu, ketika matahari meninggi dan tampak sinar putihnya, beliau pun berdiri melaksanakan shalat",
          "tr": "Abdullah İbn Ebî Katade babasından şöyle nakletmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem ile birlikte seferdeydik. Derken topluluk içinden biri 'Ey Allah'ın elçisi bizim için bir mola versen!' dedi. Allah Resulü (Sallallahu Aleyhi ve Sellem): 'Ben uyuya kalıp namaza kalkamamanızdan endişe ediyorum' şeklinde karşılık verdi. Bunun üzerine Bilal, 'Ben sizi uyandırırım' dedi. Nihayet kafiledeki herkes uyudu. Bilâl de sırtını bineğine yasladı. Gözleri uykuya yenik düştü ve o da uyuya kaldı. Derken Nebi Sallallahu Aleyhi ve Sellem uyandı. O esnada, güneşin yuvarlağı ufukta belirmişti. Bunun üzerine: 'Ey Bilâl! Söylediğin söz nerde kaldı?' dedi. Bilal, 'Hayatımda bunun gibi bir uykuyla karşılaşmadım' diye cevap verdi. Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah Teâlâ dilediği zaman sizin ruhlarınızı kabzeder, dilediği zaman de geri iade eder... Ey Bilal! Kalk Müslümanlara namazı haber vermek için ezan oku! Daha sonra Nebi Sallallahu Aleyhi ve Sellem abdest aldı. Güneş iyice yükselip ışığı beyazlaşınca kalktı ve cemaate namaz kıldırdı. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 70
      },
      "narrator": {
        "en": "`Abdullah bin Abi Qatada"
      }
    },
    {
      "hadithNumber": 596,
      "arabicNumber": 596,
      "book": 9,
      "hadithInBook": 71,
      "text": {
        "arabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، جَاءَ يَوْمَ الْخَنْدَقِ بَعْدَ مَا غَرَبَتِ الشَّمْسُ، فَجَعَلَ يَسُبُّ كُفَّارَ قُرَيْشٍ قَالَ يَا رَسُولَ اللَّهِ مَا كِدْتُ أُصَلِّي الْعَصْرَ حَتَّى كَادَتِ الشَّمْسُ تَغْرُبُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ وَاللَّهِ مَا صَلَّيْتُهَا ‏\"‏‏.‏ فَقُمْنَا إِلَى بُطْحَانَ، فَتَوَضَّأَ لِلصَّلاَةِ، وَتَوَضَّأْنَا لَهَا فَصَلَّى الْعَصْرَ بَعْدَ مَا غَرَبَتِ الشَّمْسُ، ثُمَّ صَلَّى بَعْدَهَا الْمَغْرِبَ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:On the day of Al-Khandaq (the battle of trench.) `Umar bin Al-Khattab came cursing the disbelievers of Quraish after the sun had set and said, \"O Allah's Messenger (ﷺ) I could not offer the `Asr prayer till the sun had set.\" The Prophet (ﷺ) said, \"By Allah! I, too, have not prayed.\" So we turned towards Buthan, and the Prophet (ﷺ) performed ablution and we too performed ablution and offered the `Asr prayer after the sun had set, and then he offered the Maghrib prayer",
          "ur": "ہم سے معاذ بن فضالہ نے حدیث نقل کی، انہوں نے کہا ہم سے ہشام دستوائی نے بیان کیا، انہوں نے یحییٰ بن ابی کثیر سے روایت کیا، انہوں نے ابوسلمہ بن عبدالرحمٰن سے، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے کہ عمر بن خطاب رضی اللہ عنہ غزوہ خندق کے موقع پر ( ایک مرتبہ ) سورج غروب ہونے کے بعد آئے اور وہ کفار قریش کو برا بھلا کہہ رہے تھے۔ اور آپ نے کہا کہ اے اللہ کے رسول! سورج غروب ہو گیا، اور نماز عصر پڑھنا میرے لیے ممکن نہ ہو سکا۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ نماز میں نے بھی نہیں پڑھی۔ پھر ہم وادی بطحان میں گئے اور آپ صلی اللہ علیہ وسلم نے وہاں نماز کے لیے وضو کیا، ہم نے بھی وضو بنایا۔ اس وقت سورج ڈوب چکا تھا۔ پہلے آپ صلی اللہ علیہ وسلم نے عصر پڑھائی اس کے بعد مغرب کی نماز پڑھی۔",
          "fr": "Rapporté par Jabir bin ‘Abdullah : Le jour d’Al-Khandaq (la bataille du fossé), ‘Umar bin Al-Khattab est venu en maudissant les mécréants de Quraish après le coucher du soleil et a dit : « Ô Messager d’Allah (ﷺ), je n’ai pas pu faire la prière du ‘Asr avant le coucher du soleil. » Le Prophète (ﷺ) a dit : « Par Allah ! Moi non plus, je ne l’ai pas priée. » Nous nous sommes donc dirigés vers Buthan, et le Prophète (ﷺ) a fait ses ablutions, nous aussi, puis nous avons prié la prière du ‘Asr après le coucher du soleil, puis il a prié le Maghrib",
          "id": "Telah menceritakan kepada kami [Mu'adz bin Fadlalah] berkata, telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Jabir bin 'Abdullah], bahwa 'Umar bin Al Khaththab datang pada hari peperangan Khandaq setelah matahari terbenam hingga ia mengumpat orang-orang kafir Quraisy, lalu ia berkata, \"Wahai Rasulullah, aku belum melaksanakan shaat 'Ashar hingga matahari hampir terbenam!\" Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Demi Allah, aku juga belum melakasanakannya.\" Kemudian kami berdiri menuju aliran air (sungai), beliau berwudlu dan kami pun ikut berwudlu, kemudian beliau melaksanakan shalat 'Ashar setelah matahari terbenam, dan setelah itu dilanjutkan dengan shalat Maghrib",
          "tr": "Câbir bin Abdullah r.a.'dan şöyle nakledilmiştir: \"Ömer r.a. Hendek savaşında güneş batmak üzere iken Nebi Sallallahu Aleyhi ve Sellem'in yanına geldi ve Kureyşli kafirlere hakaret etmeye başladı: 'Ey Allah'ın elçisi güneş batmadan neredeyse ikindi namazını kılamayacaktım’ dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: Allah'a and olsun ki, ben bile kılmadım' buyurdu. Sonra kalkıp Buthan'a gittik. Rasûlullah Sallallahu Aleyhi ve Sellem namaz kılmak için abdest aldı, biz de abdest aldık. Güneş battıktan sonra ikindi namazını kıldırdı. Ondan sonra da, akşam namazını kıldırdı. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 71
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 597,
      "arabicNumber": 597,
      "book": 9,
      "hadithInBook": 72,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ نَسِيَ صَلاَةً فَلْيُصَلِّ إِذَا ذَكَرَهَا، لاَ كَفَّارَةَ لَهَا إِلاَّ ذَلِكَ ‏\"‏‏.‏ ‏{‏وَأَقِمِ الصَّلاَةَ لِذِكْرِي‏}‏ قَالَ مُوسَى قَالَ هَمَّامٌ سَمِعْتُهُ يَقُولُ بَعْدُ ‏{‏وَأَقِمِ الصَّلاَةَ لِذِكْرِي‏}‏‏.‏وَقَالَ حَبَّانُ حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
        "translations": {
          "en": "Narrated Anas:The Prophet (ﷺ) said, \"If anyone forgets a prayer he should pray that prayer when he remembers it. There is no expiation except to pray the same.\" Then he recited: \"Establish prayer for My (i.e. Allah's) remembrance",
          "ur": "ہم سے ابونعیم فضل بن دکین اور موسیٰ بن اسماعیل نے بیان کیا، ان دونوں نے کہا کہ ہم سے ہمام بن یحییٰ نے قتادہ سے بیان کیا، انہوں نے انس بن مالک رضی اللہ عنہ سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی نماز پڑھنا بھول جائے تو جب بھی یاد آ جائے اس کو پڑھ لے۔ اس قضاء کے سوا اور کوئی کفارہ اس کی وجہ سے نہیں ہوتا۔ اور ( اللہ تعالیٰ نے فرمایا کہ ) نماز میرے یاد آنے پر قائم کر۔ موسیٰ نے کہا کہ ہم سے ہمام نے حدیث بیان کی کہ میں نے قتادہ رضی اللہ عنہ سے سنا وہ یوں پڑھتے تھے نماز پڑھ میری یاد کے لیے۔ حبان بن ہلال نے کہا، ہم سے ہمام نے بیان کیا، کہا ہم سے قتادہ نے، کہا ہم سے انس رضی اللہ عنہ نے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے، پھر ایسی ہی حدیث بیان کی۔",
          "fr": "Rapporté par Anas : Le Prophète (ﷺ) a dit : « Si quelqu’un oublie une prière, il doit la faire dès qu’il s’en souvient. Il n’y a pas d’autre expiation que de la prier. » Puis il a récité : « Accomplis la prière pour Mon (c’est-à-dire Allah) souvenir. »",
          "id": "Telah menceritakan kepada kami [Abu Nu'aim] dan [Musa bin Isma'il] keduanya berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa lupa suatu shalat, maka hendaklah dia melaksanakannya ketika dia ingat. Karena tidak ada tebusannya kecuali itu. Allah berfirman: '(Dan tegakkanlah shalat untuk mengingat-Ku) ' (Qs. Thaahaa: 14). Musa berkata, Hammam berkata, \"Setelah itu aku mendengar beliau mengucapkan: '(Dan tegakkanlah shalat untuk mengingat-Ku) ' Abu 'Abdullah berkata; [Habban] berkata, telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] telah menceritakan kepada kami [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam seperti itu",
          "tr": "Enes bin Malik r.a. Nebi s.a.v.'in şöyle buyurduğunu nakletmiştir: \"Kim bir namaz'ı kılmayı unutmuşsa, onu hatırlayınca kılsın! Zira bundan başka bunun bir keffâreti yoktur. Beni anmak için namaz kıl. [Taha suresi 14] Musa, Hemmâm'ın şöyle dediğini bildirmiştir: \"Daha sonra şu âyeti okudu: Beni anmak için namaz kıl"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 72
      },
      "narrator": {
        "en": "Anas"
      }
    },
    {
      "hadithNumber": 598,
      "arabicNumber": 598,
      "book": 9,
      "hadithInBook": 73,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ أَبِي كَثِيرٍ ـ عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، قَالَ جَعَلَ عُمَرُ يَوْمَ الْخَنْدَقِ يَسُبُّ كُفَّارَهُمْ وَقَالَ مَا كِدْتُ أُصَلِّي الْعَصْرَ حَتَّى غَرَبَتْ‏.‏ قَالَ فَنَزَلْنَا بُطْحَانَ، فَصَلَّى بَعْدَ مَا غَرَبَتِ الشَّمْسُ، ثُمَّ صَلَّى الْمَغْرِبَ‏.‏",
        "translations": {
          "en": "Narrated Jabir:`Umar came cursing the disbelievers (of Quraish) on the day of Al-Khandaq (the battle of Trench) and said, \"I could not offer the `Asr prayer till the sun had set. Then we went to Buthan and he offered the (`Asr) prayer after sunset and then he offered the Maghrib prayer",
          "ur": "ہم سے مسدد نے بیان کیا، کہا کہ ہم سے یحییٰ بن سعید قطان نے، کہا کہ ہم سے ہشام دستوائی نے حدیث بیان کی، کہا کہ ہم سے یحییٰ نے جو ابی کثیر کے بیٹے ہیں حدیث بیان کی ابوسلمہ سے، انہوں نے جابر رضی اللہ عنہ سے، انہوں نے فرمایا کہ عمر رضی اللہ عنہ غزوہ خندق کے موقع پر ( ایک دن ) کفار کو برا بھلا کہنے لگے۔ فرمایا کہ سورج غروب ہو گیا، لیکن میں ( لڑائی کی وجہ سے ) نماز عصر نہ پڑھ سکا۔ جابر رضی اللہ عنہ نے بیان کیا کہ پھر ہم وادی بطحان کی طرف گئے۔ اور ( آپ صلی اللہ علیہ وسلم نے عصر کی نماز ) غروب شمس کے بعد پڑھی اس کے بعد مغرب پڑھی۔",
          "fr": "Rapporté par Jabir : ‘Umar est venu en maudissant les mécréants (de Quraish) le jour d’Al-Khandaq (la bataille du fossé) et a dit : « Je n’ai pas pu faire la prière du ‘Asr avant le coucher du soleil. » Nous sommes alors allés à Buthan et il a prié (‘Asr) après le coucher du soleil, puis il a prié le Maghrib",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya Al Qaththan] telah mengabarkan kepada kami [Hisyam] berkata, telah menceritakan kepada kami [Yahya] -yaitu Ibnu Abu Katsir- dari [Abu Salamah] dari [Jabir bin 'Abdullah] berkata, \"Pada peperangan Khandaq 'Umar bin Al Khaththab mengumpat orang-orang kafir, lalu ia berkata, \"Hampir saja aku tidak melaksanakan shalat 'Ashar kecuali setelah Matahari hampir tenggelam.\" Umar melanjutkan, \"Maka kami berdiri menuju aliran air (sungai), kemudian beliau melaksanakan shalat 'Ashar setelah matahari terbenam, dan dilanjutkan dengan shalat Maghrib",
          "tr": "Cabir bin Abdullah r.a.'dan şöyle nakledilmiştir: \"Hendek savaşında Ömer r.a. kafirlere hakaret etmeye başladı. Bir ara, 'Neredeyse güneş batıncaya kadar namazımı kılamayacaktım' dedi. Sonra Buthan vadisine indik. Allah Re­sulü Sallallahu Aleyhi ve Sellem güneş battıktan sonra ikindi namazını, daha sonra da akşam namazını kıldırdı.\" باب: ما يكره من السمر بعد العشاء. 39. Yatsı Namazından Sonra Mekruh Olan Sohbet"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 73
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 599,
      "arabicNumber": 599,
      "book": 9,
      "hadithInBook": 74,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا عَوْفٌ، قَالَ حَدَّثَنَا أَبُو الْمِنْهَالِ، قَالَ انْطَلَقْتُ مَعَ أَبِي إِلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ فَقَالَ لَهُ أَبِي حَدِّثْنَا كَيْفَ، كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْمَكْتُوبَةَ قَالَ كَانَ يُصَلِّي الْهَجِيرَ وَهْىَ الَّتِي تَدْعُونَهَا الأُولَى حِينَ تَدْحَضُ الشَّمْسُ، وَيُصَلِّي الْعَصْرَ، ثُمَّ يَرْجِعُ أَحَدُنَا إِلَى أَهْلِهِ فِي أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ، وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ‏.‏ قَالَ وَكَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ‏.‏ قَالَ وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا، وَكَانَ يَنْفَتِلُ مِنْ صَلاَةِ الْغَدَاةِ حِينَ يَعْرِفُ أَحَدُنَا جَلِيسَهُ، وَيَقْرَأُ مِنَ السِّتِّينَ إِلَى الْمِائَةِ‏.‏",
        "translations": {
          "en": "Narrated Abu-l-Minhal:My father and I went to Abi Barza Al-Aslami and my father said to him, \"Tell us how Allah's Messenger (ﷺ) used to offer the compulsory congregational prayers.\" He said, \"He used to pray the Zuhr prayer, which you call the first prayer, as the sun declined at noon, the `Asr at a time when one of US could go to his family at the farthest place in Medina while the sun was still hot. (The narrator forgot what Abu Barza had said about the Maghrib prayer), and the Prophet (ﷺ) preferred to pray the `Isha' late and disliked to sleep before it or talk after it. And he used to return after finishing the morning prayer at such a time when it was possible for one to recognize the person sitting by his side and he (the Prophet) used to recite 60 to 100 'Ayat' (verses) of the Qur'an in it",
          "ur": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے، کہا ہم سے عوف اعرابی نے، کہا کہ ہم سے ابوالمنہال سیار بن سلامہ نے، انہوں نے کہا کہ میں اپنے باپ سلامہ کے ساتھ ابوبرزہ اسلمی رضی اللہ عنہ کی خدمت میں حاضر ہوا۔ ان سے میرے والد صاحب نے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم فرض نمازیں کس طرح ( یعنی کن کن اوقات میں ) پڑھتے تھے۔ ہم سے اس کے بارے میں بیان فرمائیے۔ انہوں نے فرمایا کہ آپ صلی اللہ علیہ وسلم «هجير» ( ظہر ) جسے تم صلوٰۃ اولیٰ کہتے ہو سورج ڈھلتے ہی پڑھتے تھے۔ اور آپ صلی اللہ علیہ وسلم کے عصر پڑھنے کے بعد کوئی بھی شخص اپنے گھر واپس ہوتا اور وہ بھی مدینہ کے سب سے آخری کنارہ پر تو سورج ابھی صاف اور روشن ہوتا۔ مغرب کے بارے میں آپ نے جو کچھ بتایا مجھے یاد نہیں رہا۔ اور فرمایا کہ عشاء میں آپ صلی اللہ علیہ وسلم تاخیر پسند فرماتے تھے۔ اس سے پہلے سونے کو اور اس کے بعد بات کرنے کو پسند نہیں کرتے تھے۔ صبح کی نماز سے جب آپ صلی اللہ علیہ وسلم فارغ ہوتے تو ہم اپنے قریب بیٹھے ہوئے دوسرے شخص کو پہچان لیتے۔ آپ صلی اللہ علیہ وسلم فجر میں ساٹھ سے سو تک آیتیں پڑھتے تھے۔",
          "fr": "Rapporté par Abu-l-Minhal : Mon père et moi sommes allés voir Abi Barza Al-Aslami et mon père lui a dit : « Raconte-nous comment le Messager d’Allah (ﷺ) accomplissait les prières obligatoires en groupe. » Il a dit : « Il priait la prière du Zuhr, que vous appelez la première prière, dès que le soleil déclinait à midi, la prière du ‘Asr à un moment où l’un de nous pouvait aller jusqu’à sa famille à l’endroit le plus éloigné de Médine alors que le soleil était encore chaud. (Le narrateur a oublié ce qu’Abu Barza avait dit à propos de la prière du Maghrib), et le Prophète (ﷺ) préférait retarder la prière du ‘Isha’ et n’aimait pas dormir avant ou parler après. Et il revenait après la prière du matin à un moment où il était possible de reconnaître la personne assise à côté de soi, et il récitait entre 60 et 100 versets du Coran pendant cette prière. »",
          "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] berkata, telah menceritakan kepada kami ['Auf] berkata, telah menceritakan kepada kami [Abu Al Minhal] berkata, \"Aku dan bapakku pergi berangkat menemui [Abu Barzah Al Aslami], bapakku lalu berkata kepadanya, \"Bagaimana Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat yang Maktubah (Wajib)?\" Abu Barzah menjawab, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat Zhuhur yang kalian sebut sebagai waktu utama saat Matahari tergelincir, shalat 'Ashar ketika seseorang dari kami pulang menemui keluarganya di ujung Kota, maka matahari masih terasa panas sinarnya. Dan aku lupa apa yang dibaca beliau saat shalat Maghrib. Dan beliau lebih suka mengakhirkan pelaksanaan shalat 'Isya yang kalian sebut sebagai waktu 'Atamah, beliau tidak suka tidur sebelum 'Isya dan berbincang-bincang setelahnya. Dan beliau melaksanakan shalat Shubuh ketika salah seorang dari kami dapat mengetahui siapa yang berada di sampingnya, beliau membaca antara enam hingga seratus ayat",
          "tr": "Ebu'l-Minhâl'den şöyle nakledilmiştir: \"Babamla birlikte Ebu Berze el-Eslemî'nin yanına gittik. Babam ona Rasulullah Sallallahu Aleyhi ve Sellem'in farz namazları nasıl kıldığını bize anlat' dedi. O da şunları söyledi: Öğle namazını güneş batı yönüne doğru harekete geçince sizin \"ilk namaz\" dediğiniz öğle namazını kılardı. İkindi namazını kılınca, bizden biri Medine'nin ücra köşesinde bulunan ailesinin yanına döndüğü vakit güneş hâlâ parlaklığını korurdu. (Ravi der ki:) Akşam namazı hakkında ne dediğini unuttum. Yatsı namazını ise geciktirmeyi severdi. Yatsı namazından önce uyumayı, ondan sonra da konuşmayı hoş karşılamazdı. Sabah namazını ise, bizim yanı başımızdakini tanıyacak kadar hava ağarınca bitirirdi. Sabah namazında altmış ile yüz âyet arasında Kur'an okurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 74
      },
      "narrator": {
        "en": "Abu-l-Minhal"
      }
    },
    {
      "hadithNumber": 600,
      "arabicNumber": 600,
      "book": 9,
      "hadithInBook": 75,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ، قَالَ حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، قَالَ انْتَظَرْنَا الْحَسَنَ وَرَاثَ عَلَيْنَا حَتَّى قَرُبْنَا مِنْ وَقْتِ قِيَامِهِ، فَجَاءَ فَقَالَ دَعَانَا جِيرَانُنَا هَؤُلاَءِ‏.‏ ثُمَّ قَالَ قَالَ أَنَسٌ نَظَرْنَا النَّبِيَّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ حَتَّى كَانَ شَطْرُ اللَّيْلِ يَبْلُغُهُ، فَجَاءَ فَصَلَّى لَنَا، ثُمَّ خَطَبَنَا فَقَالَ ‏ \"‏ أَلاَ إِنَّ النَّاسَ قَدْ صَلَّوْا ثُمَّ رَقَدُوا، وَإِنَّكُمْ لَمْ تَزَالُوا فِي صَلاَةٍ مَا انْتَظَرْتُمُ الصَّلاَةَ ‏\"‏‏.‏ قَالَ الْحَسَنُ وَإِنَّ الْقَوْمَ لاَ يَزَالُونَ بِخَيْرٍ مَا انْتَظَرُوا الْخَيْرَ‏.‏ قَالَ قُرَّةُ هُوَ مِنْ حَدِيثِ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
        "translations": {
          "en": "Narrated Qurra bin Khalid:Once he waited for Al-Hasan and he did not show up till it was about the usual time for him to start his speech; then he came and apologized saying, \"Our neighbors invited us.\" Then he added, \"Narrated Anas, 'Once we waited for the Prophet (ﷺ) till it was midnight or about midnight. He came and led the prayer, and after finishing it, he addressed us and said, 'All the people prayed and then slept and you had been in prayer as long as you were waiting for it.\" Al-Hasan said, \"The people are regarded as performing good deeds as long as they are waiting for doing good deeds.\" Al-Hasan's statement is a portion of Anas's [??] Hadith from the Prophet (ﷺ)",
          "ur": "ہم سے عبداللہ بن صباح نے بیان کیا، کہا ہم سے ابوعلی عبیداللہ حنفی نے، کہا ہم سے قرہ بن خالد سدوسی نے، انہوں نے کہا کہ ایک دن حسن بصری رحمہ اللہ نے بڑی دیر کی۔ اور ہم آپ کا انتظار کرتے رہے۔ جب ان کے اٹھنے کا وقت قریب ہو گیا تو آپ آئے اور ( بطور معذرت ) فرمایا کہ میرے ان پڑوسیوں نے مجھے بلا لیا تھا ( اس لیے دیر ہو گئی ) پھر بتلایا کہ انس بن مالک رضی اللہ عنہ نے کہا تھا کہ ہم ایک رات نبی کریم صلی اللہ علیہ وسلم کا انتظار کرتے رہے۔ تقریباً آدھی رات ہو گئی تو آپ صلی اللہ علیہ وسلم تشریف لائے، پھر ہمیں نماز پڑھائی۔ اس کے بعد خطبہ دیا۔ پس آپ نے فرمایا کہ دوسروں نے نماز پڑھ لی اور سو گئے۔ لیکن تم لوگ جب تک نماز کے انتظار میں رہے ہو گویا نماز ہی کی حالت میں رہے ہو۔ امام حسن بصری رحمہ اللہ نے فرمایا کہ اگر لوگ کسی خیر کے انتظار میں بیٹھے رہیں تو وہ بھی خیر کی حالت ہی میں ہیں۔ قرہ بن خالد نے کہا کہ حسن کا یہ قول بھی انس رضی اللہ عنہ کی حدیث کا ہے جو انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے۔",
          "fr": "Rapporté par Qurra bin Khalid : Un jour, il attendit Al-Hasan qui n’arriva pas avant l’heure habituelle de son discours ; puis Al-Hasan arriva et s’excusa en disant : « Nos voisins nous ont invités. » Ensuite, il ajouta : « Anas a rapporté : ‘Un jour, nous avons attendu le Prophète (ﷺ) jusqu’à minuit ou presque. Il est venu, a dirigé la prière, puis, après l’avoir terminée, il s’est adressé à nous et a dit : “Tous les gens ont prié puis sont allés dormir, et vous, vous êtes restés en prière tant que vous l’attendiez.”’ » Al-Hasan a dit : « Les gens sont considérés comme accomplissant de bonnes actions tant qu’ils attendent de faire de bonnes actions. » La parole d’Al-Hasan fait partie du hadith d’Anas rapporté du Prophète (ﷺ)",
          "id": "Telah menceritakan kepada kami ['Abdullah bin Ash Shabbah] berkata, telah menceritakan kepada kami [Abu 'Ali Al Hanafi] telah menceritakan kepada kami [Qurrah bin Khalid] berkata, \"Kami pernah menunggu [Al Hasan] hingga memperlambat kami hingga sudah dekat dengan waktu ditegakkannya shalat. Lalu dia datang dan berkata, \"Kami diundang tetangga kami.\" Kemudian dia melanjutkan, [Anas bin Malik] menyebutkan, \"Pada suatu malam kami pernah menunggu Nabi shallallahu 'alaihi wasallam hingga sampai pertengahan malam. Lalu Beliau shalat bersama kami kemudian menyampaikan khuthbah kepada kami, sabda beliau: \"Manusia sudah selesai melaksanakan shalat lalu mereka tidur. Dan kalian akan senantiasa dalam hitungan shalat selagi kalian menunggu pelaksanaannya.\" Al Hasan berkata, \"Sesungguhnya suatu kaum senantiasa akan berada dalam kebaikan selagi mereka mananti kebaikan.\" Qurrah berkata, \"Ini adalah hadits dari Anas, dari Nabi shallallahu 'alaihi wasallam",
          "tr": "Enes bin Malik r.a.'den şöyle nakledilmiştir: \"Bir gece Nebi Sallallahu Aleyhi ve Sellem'i bekledik. Vakit gece yarısına doğru geliyordu. Derken Allah Resulü (Sallallahu aleyhi ve Sellem)’evinden çıktı ve bize namaz kıldırdı. Daha sonra bize hitap ederek şöyle buyurdu: Biliniz ki! Bütün insanlar namaz kılıp uyudular. Siz namazı beklediğiniz sürece namaz kılıyorsunuz demektir.\" Hasan-ı Basri şöyle demiştir: \"Bir topluluk hayırlı bir mesele için beklediği sürece hayır üzere olmaya devam eder.\" Kurre de şöyle demiştir: \"Bu söz, Enes'in Nebi s.a.v.'den naklettiği hadisin bir parçasıdır"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 75
      },
      "narrator": {
        "en": "Qurra bin Khalid"
      }
    },
    {
      "hadithNumber": 601,
      "arabicNumber": 601,
      "book": 9,
      "hadithInBook": 76,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، وَأَبُو بَكْرِ بْنُ أَبِي حَثْمَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم صَلاَةَ الْعِشَاءِ فِي آخِرِ حَيَاتِهِ، فَلَمَّا سَلَّمَ قَامَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ فَإِنَّ رَأْسَ مِائَةٍ لاَ يَبْقَى مِمَّنْ هُوَ الْيَوْمَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏ فَوَهِلَ النَّاسُ فِي مَقَالَةِ رَسُولِ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ إِلَى مَا يَتَحَدَّثُونَ مِنْ هَذِهِ الأَحَادِيثِ عَنْ مِائَةِ سَنَةٍ، وَإِنَّمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ يَبْقَى مِمَّنْ هُوَ الْيَوْمَ عَلَى ظَهْرِ الأَرْضِ ‏\"‏ يُرِيدُ بِذَلِكَ أَنَّهَا تَخْرِمُ ذَلِكَ الْقَرْنَ‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:The Prophet (ﷺ) prayed one of the `Isha' prayer in his last days and after finishing it with Taslim, he stood up and said, \"Do you realize (the importance of) this night? Nobody present on the surface of the earth tonight would be living after the completion of one hundred years from this night.\" The people made a mistake in grasping the meaning of this statement of Allah's Messenger (ﷺ) and they indulged in those things which are said about these narrators (i.e. some said that the Day of Resurrection will be established after 100 years etc.) But the Prophet (ﷺ) said, \"Nobody present on the surface of earth tonight would be living after the completion of 100 years from this night\"; he meant \"When that century (people of that century) would pass away",
          "ur": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا انہوں نے کہا کہ ہمیں شعیب بن ابی حمزہ نے زہری سے خبر دی، کہا کہ مجھ سے سالم بن عبداللہ بن عمر رضی اللہ عنہما اور ابوبکر بن ابی حثمہ نے حدیث بیان کی کہ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے عشاء کی نماز پڑھی اپنی زندگی کے آخری زمانے میں۔ سلام پھیرنے کے بعد آپ کھڑے ہوئے اور فرمایا کہ اس رات کے متعلق تمہیں کچھ معلوم ہے؟ آج اس روئے زمین پر جتنے انسان زندہ ہیں۔ سو سال بعد ان میں سے کوئی بھی باقی نہیں رہے گا۔ لوگوں نے نبی کریم صلی اللہ علیہ وسلم کا کلام سمجھنے میں غلطی کی اور مختلف باتیں کرنے لگے۔ ( ابومسعود رضی اللہ عنہ نے یہ سمجھا کہ سو برس بعد قیامت آئے گی ) حالانکہ آپ صلی اللہ علیہ وسلم کا مقصد صرف یہ تھا کہ جو لوگ آج ( اس گفتگو کے وقت ) زمین پر بستے ہیں۔ ان میں سے کوئی بھی آج سے ایک صدی بعد باقی نہیں رہے گا۔ آپ صلی اللہ علیہ وسلم کا مطلب یہ تھا کہ سو برس میں یہ قرن گزر جائے گا۔",
          "fr": "Rapporté par `Abdullah bin `Umar : Le Prophète (ﷺ) a prié une des prières du ‘Isha’ dans ses derniers jours et, après l’avoir terminée avec le Taslim, il s’est levé et a dit : « Comprenez-vous l’importance de cette nuit ? Personne ici présent sur la surface de la terre ce soir ne sera encore en vie après cent ans à partir de cette nuit. » Les gens n’ont pas bien compris ce que voulait dire le Messager d’Allah (ﷺ) et certains ont pensé que cela annonçait la fin du monde après cent ans, etc. Mais le Prophète (ﷺ) a dit : « Personne ici présent sur la surface de la terre ce soir ne sera encore en vie après cent ans à partir de cette nuit », il voulait dire : « Quand ce siècle (les gens de ce siècle) sera passé. »",
          "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah menceritakan kepadaku [Salim bin 'Abdullah bin 'Umar] dan [Abu Bakar Ibnu Abu Hatsmah] bahwa ['Abdullah bin 'Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat 'Isya pada suatu malam di akhir hayatnya. Selesai salam, Nabi shallallahu 'alaihi wasallam berdiri dan berkata, \"Tidakkah kalian melihat malam kalian ini? Ketahuilah, sesungguhnya setelah seratus tahun tidak akan ada orang pun di muka bumi ini yang tersisa dari mereka yang hadir pada malam ini.\" Kemudian orang-orang mengalami kerancuan dalam memahami pernyataan Rasulullah shallallahu 'alaihi wasallam tersebut hingga mereka memperbincangkannya, yakni apa yang maksud dengan seratus tahun tersebut?\" 'Abdullah bin 'Umar berkata, \"Sesungguhnya maksud sabda Nabi, 'Tidak akan ada orang yang tersisa di atas bumi ini' adalah berakhirnya generasi tersebut",
          "tr": "Abdullah İbn Ömer r.a.'den şöyle nakledilmiştir: \"Ömrünün sonlarına doğru Allah Resulü yatsı namazını kıldırdı. Selam verdikten sonra dönüp cemaate şöyle dedi: Bu gecenizi gördünüz mü? Yüz sene sonra bugün yaşayanlardan yeryüzünde hiçbir kimse kalmayacak. Hemen Müslümanlar Nebi Sallallahu Aleyhi ve Sellem'in sözünü yanlış anladılar. Onun 'yüz sene' sözü hakkında farklı görüşler ortaya attılar. Bunun üzerine Nebi (Sallallahu aleyhi ve Sellem) şöyle buyurdu: Bugün yeryüzünde yaşayanlardan kimse kalmayacak. Akıp giden zaman bu nesli yok edecek"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 76
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 602,
      "arabicNumber": 602,
      "book": 9,
      "hadithInBook": 77,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، أَنَّ أَصْحَابَ الصُّفَّةِ، كَانُوا أُنَاسًا فُقَرَاءَ، وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ عِنْدَهُ طَعَامُ اثْنَيْنِ فَلْيَذْهَبْ بِثَالِثٍ، وَإِنْ أَرْبَعٌ فَخَامِسٌ أَوْ سَادِسٌ ‏\"‏‏.‏ وَأَنَّ أَبَا بَكْرٍ جَاءَ بِثَلاَثَةٍ فَانْطَلَقَ النَّبِيُّ صلى الله عليه وسلم بِعَشَرَةٍ، قَالَ فَهْوَ أَنَا وَأَبِي وَأُمِّي، فَلاَ أَدْرِي قَالَ وَامْرَأَتِي وَخَادِمٌ بَيْنَنَا وَبَيْنَ بَيْتِ أَبِي بَكْرٍ‏.‏ وَإِنَّ أَبَا بَكْرٍ تَعَشَّى عِنْدَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ لَبِثَ حَيْثُ صُلِّيَتِ الْعِشَاءُ، ثُمَّ رَجَعَ فَلَبِثَ حَتَّى تَعَشَّى النَّبِيُّ صلى الله عليه وسلم فَجَاءَ بَعْدَ مَا مَضَى مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ، قَالَتْ لَهُ امْرَأَتُهُ وَمَا حَبَسَكَ عَنْ أَضْيَافِكَ ـ أَوْ قَالَتْ ضَيْفِكَ ـ قَالَ أَوَمَا عَشَّيْتِيهِمْ قَالَتْ أَبَوْا حَتَّى تَجِيءَ، قَدْ عُرِضُوا فَأَبَوْا‏.‏ قَالَ فَذَهَبْتُ أَنَا فَاخْتَبَأْتُ فَقَالَ يَا غُنْثَرُ، فَجَدَّعَ وَسَبَّ، وَقَالَ كُلُوا لاَ هَنِيئًا‏.‏ فَقَالَ وَاللَّهِ لاَ أَطْعَمُهُ أَبَدًا، وَايْمُ اللَّهِ مَا كُنَّا نَأْخُذُ مِنْ لُقْمَةٍ إِلاَّ رَبَا مِنْ أَسْفَلِهَا أَكْثَرُ مِنْهَا‏.‏ قَالَ يَعْنِي حَتَّى شَبِعُوا وَصَارَتْ أَكْثَرَ مِمَّا كَانَتْ قَبْلَ ذَلِكَ، فَنَظَرَ إِلَيْهَا أَبُو بَكْرٍ فَإِذَا هِيَ كَمَا هِيَ أَوْ أَكْثَرُ مِنْهَا‏.‏ فَقَالَ لاِمْرَأَتِهِ يَا أُخْتَ بَنِي فِرَاسٍ مَا هَذَا قَالَتْ لاَ وَقُرَّةِ عَيْنِي لَهِيَ الآنَ أَكْثَرُ مِنْهَا قَبْلَ ذَلِكَ بِثَلاَثِ مَرَّاتٍ‏.‏ فَأَكَلَ مِنْهَا أَبُو بَكْرٍ وَقَالَ إِنَّمَا كَانَ ذَلِكَ مِنَ الشَّيْطَانِ ـ يَعْنِي يَمِينَهُ ـ ثُمَّ أَكَلَ مِنْهَا لُقْمَةً، ثُمَّ حَمَلَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَصْبَحَتْ عِنْدَهُ، وَكَانَ بَيْنَنَا وَبَيْنَ قَوْمٍ عَقْدٌ، فَمَضَى الأَجَلُ، فَفَرَّقَنَا اثْنَا عَشَرَ رَجُلاً، مَعَ كُلِّ رَجُلٍ مِنْهُمْ أُنَاسٌ، اللَّهُ أَعْلَمُ كَمْ مَعَ كُلِّ رَجُلٍ فَأَكَلُوا مِنْهَا أَجْمَعُونَ، أَوْ كَمَا قَالَ‏.‏",
        "translations": {
          "en": "Narrated Abu `Uthman:`Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet (ﷺ) said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet (ﷺ) took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet (ﷺ) and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet (ﷺ) till the Prophet (ﷺ) took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet (ﷺ) divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal",
          "ur": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا، ان سے ان کے باپ سلیمان بن طرخان نے، کہا کہ ہم سے ابوعثمان نہدی نے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما سے یہ حدیث بیان کی کہ اصحاب صفہ نادار مسکین لوگ تھے اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کے گھر میں دو آدمیوں کا کھانا ہو تو وہ تیسرے ( اصحاب صفہ میں سے کسی ) کو اپنے ساتھ لیتا جائے۔ اور جس کے ہاں چار آدمیوں کا کھانا ہے تو وہ پانچویں یا چھٹے آدمی کو سائبان والوں میں سے اپنے ساتھ لے جائے۔ پس ابوبکر رضی اللہ عنہ تین آدمی اپنے ساتھ لائے۔ اور نبی کریم صلی اللہ علیہ وسلم دس آدمیوں کو اپنے ساتھ لے گئے۔ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ گھر کے افراد میں اس وقت باپ، ماں اور میں تھا۔ ابوعثمان راوی کا بیان ہے کہ مجھے یاد نہیں کہ عبدالرحمٰن بن ابی بکر نے یہ کہا یا نہیں کہ میری بیوی اور ایک خادم جو میرے اور ابوبکر رضی اللہ عنہ دونوں کے گھر کے لیے تھا یہ بھی تھے۔ خیر ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے یہاں ٹھہر گئے۔ ( اور غالباً کھانا بھی وہیں کھایا۔ صورت یہ ہوئی کہ ) نماز عشاء تک وہیں رہے۔ پھر ( مسجد سے ) نبی کریم صلی اللہ علیہ وسلم کے حجرہ مبارک میں آئے اور وہیں ٹھہرے رہے تاآنکہ نبی کریم صلی اللہ علیہ وسلم نے بھی کھانا کھا لیا۔ اور رات کا ایک حصہ گزر جانے کے بعد جب اللہ تعالیٰ نے چاہا تو آپ گھر تشریف لائے تو ان کی بیوی ( ام رومان ) نے کہا کہ کیا بات پیش آئی کہ مہمانوں کی خبر بھی آپ نے نہ لی، یا یہ کہ مہمان کی خبر نہ لی۔ آپ نے پوچھا، کیا تم نے ابھی انہیں رات کا کھانا نہیں کھلایا۔ ام رومان نے کہا کہ میں کیا کروں آپ کے آنے تک انہوں نے کھانے سے انکار کیا۔ کھانے کے لیے ان سے کہا گیا تھا لیکن وہ نہ مانے۔ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ میں ڈر کر چھپ گیا۔ ابوبکر رضی اللہ عنہ نے پکارا اے غنثر! ( یعنی او پاجی ) آپ نے برا بھلا کہا اور کوسنے دئیے۔ فرمایا کہ کھاؤ تمہیں مبارک نہ ہو! اللہ کی قسم! میں اس کھانے کو کبھی نہیں کھاؤں گا۔ ( آخر مہمانوں کو کھانا کھلایا گیا ) ( عبدالرحمٰن رضی اللہ عنہ نے کہا ) اللہ گواہ ہے کہ ہم ادھر ایک لقمہ لیتے تھے اور نیچے سے پہلے سے بھی زیادہ کھانا ہو جاتا تھا۔ بیان کیا کہ سب لوگ شکم سیر ہو گئے۔ اور کھانا پہلے سے بھی زیادہ بچ گیا۔ ابوبکر رضی اللہ عنہ نے دیکھا تو کھانا پہلے ہی اتنا یا اس سے بھی زیادہ تھا۔ اپنی بیوی سے بولے۔ بنوفراس کی بہن! یہ کیا بات ہے؟ انہوں نے کہا کہ میری آنکھ کی ٹھنڈک کی قسم! یہ تو پہلے سے تین گنا ہے۔ پھر ابوبکر رضی اللہ عنہ نے بھی وہ کھانا کھایا اور کہا کہ میرا قسم کھانا ایک شیطانی وسوسہ تھا۔ پھر ایک لقمہ اس میں سے کھایا۔ اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بقیہ کھانا لے گئے اور آپ کی خدمت میں حاضر ہوئے۔ وہ صبح تک آپ کے پاس رکھا رہا۔ عبدالرحمٰن نے کہا کہ ہم مسلمانوں کا ایک دوسرے قبیلے کے لوگوں سے معاہدہ تھا۔ اور معاہدہ کی مدت پوری ہو چکی تھی۔ ( اس قبیلہ کا وفد معاہدہ سے متعلق بات چیت کرنے مدینہ میں آیا ہوا تھا ) ہم نے ان میں سے بارہ آدمی جدا کئے اور ہر ایک کے ساتھ کتنے آدمی تھے اللہ کو ہی معلوم ہے ان سب نے ان میں سے کھایا۔ عبدالرحمٰن رضی اللہ عنہ نے کچھ ایسا ہی کہا۔",
          "fr": "Rapporté par Abu `Uthman : `Abdur Rahman bin Abi Bakr a dit : « Les compagnons de la Suffa étaient pauvres et le Prophète (ﷺ) a dit : ‘Celui qui a de la nourriture pour deux personnes doit inviter un troisième parmi eux (les compagnons de la Suffa). Et celui qui a de la nourriture pour quatre personnes doit en inviter un ou deux.’ Abu Bakr a pris trois hommes et le Prophète (ﷺ) en a pris dix. » `Abdur Rahman a ajouté : mon père, ma mère et moi étions là (dans la maison). (Le sous-narrateur n’est pas sûr si `Abdur Rahman a aussi dit : ‘Ma femme et notre serviteur qui était commun à ma maison et à celle d’Abu Bakr.’) Abu Bakr a pris son repas du soir avec le Prophète (ﷺ) et est resté jusqu’à la prière du ‘Isha’. Il est rentré chez lui après une grande partie de la nuit. La femme d’Abu Bakr lui a dit : « Qu’est-ce qui t’a retenu loin de tes invités (ou de ton invité) ? » Il a répondu : « Tu ne leur as pas encore servi à manger ? » Elle a dit : « Ils ont refusé de manger tant que tu n’étais pas là. La nourriture était servie mais ils ont refusé. » `Abdur Rahman a ajouté : « Je suis parti me cacher (par peur d’Abu Bakr) et, entre-temps, il m’a appelé : ‘Ô Ghunthar (un mot dur) !’ et il m’a insulté, puis il a dit (à sa famille) : ‘Mangez. Pas de bienvenue pour vous.’ Ensuite, le repas a été servi. Abu Bakr a juré de ne pas manger de cette nourriture. Le narrateur a ajouté : Par Allah, chaque fois que l’un de nous (moi-même et les invités de la Suffa) prenait de la nourriture, elle augmentait par-dessous. Nous avons tous mangé à satiété et il y en avait plus qu’avant. Abu Bakr a regardé la nourriture et l’a trouvée comme avant, voire plus. Il a dit à sa femme : ‘Ô sœur des Bani Firas ! Qu’est-ce que c’est ?’ Elle a répondu : ‘Ô joie de mes yeux ! La nourriture est maintenant trois fois plus qu’avant.’ Abu Bakr en a mangé et a dit : ‘Ce serment venait de Satan’, en parlant de son serment de ne pas manger. Ensuite, il a repris une bouchée et a apporté le reste au Prophète (ﷺ). Ce repas était avec le Prophète. Il y avait un traité entre nous et certaines personnes, et quand ce traité a pris fin, le Prophète (ﷺ) nous a divisés en douze groupes, chacun dirigé par un homme. Allah sait combien d’hommes il y avait sous la responsabilité de chaque chef. Tous (les 12 groupes) ont mangé de ce repas",
          "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Mu'tamin bin Sulaiman] berkata, telah menceritakan kepada kami [bapakku] berkata, telah menceritakan kepada kami [Abu 'Utsman] dari ['Abdurrahman bin Abu Bakar], bahwa para Ashhabush Shuffah adalah orang-orang yang berasal dari kalangan fakir miskin. Nabi Shallallahu 'alaihi wa Sallam bersabda: \"Barangsiapa memiliki makanan cukup untuk dua orang, maka ajaklah orang yang ketiga. Jika memiliki makanan untuk empat orang hendaklah mengajak orang yang kelima atau keenam.\" Maka Abu Bakar datang dengan membawa makanan yang cukup untuk tiga orang. Nabi Shallallahu 'alaihi wa Sallam lalu datang dengan membawa makanan yang cukup untuk sepuluh orang.\" 'Abdurrahman bin Abu Bakar berkata, \"Mereka itu adalah aku, bapakku, ibuku, -perawi berkata; aku tidak tahu ia mengatakan- isteriku dan pelayan yang biasa membantu kami dan keluarga Abu Bakar. Saat itu Abu Bakar makan malam di sisi Nabi Shallallahu 'alaihi wa Sallam hingga waktu isya, dan ia tetap di sana hingga shalat dilaksanakan. Ketika Abu Bakar pulang di waktu yang sudah malam isterinya (ibuku) berkata, \"Apa yang menghalangimu untuk menjamu tamu-tamumu?\" Abu Bakar balik bertanya, \"Kenapa tidak engkau jamu mereka?\" Isterinya menjawab, \"Mereka enggan untuk makan hingga engkau kembali, padahal mereka sudah ditawari.\" 'Abdurrahman berkata, \"Kemudian aku pergi dan bersembunyi.\" Abu Bakar lantas berkata, \"Wahai Ghuntsar (kalimat celaan)!\" Abu Bakar terus saja marah dan mencela (aku). Kemudian ia berkata (kepada tamu-tamunya), \"Makanlah kalian semua.\" Kemudian tamunya mengatakan, \"Selamanya kami tidak akan makan. Demi Allah, tidaklah kami ambil satu suap kecuali makanan tersebut justru bertambah semakin banyak dari yang semula.\" 'Abdurrahman berkata, \"Mereka kenyang semua, dan makanan tersebut menjadi tiga kali lebih banyak dari yang semula. Abu Bakar memandangi makanan tersebut tetap utuh bahkan lebih banyak lagi. Kemudian ia berkata kepada isterinya, \"Wahai saudara perempuan Bani Firas, bagaimana ini?\" Isterinya menjawab, \"Tak masalah, bahkan itu suatu kebahagiaan, ia bertambah tiga kali lipatnya.\" Abu Bakar kemudian memakannya seraya berkata, \"Itu pasti dari setan-yakni sumpah yang ia ucapkan-.\" Kemudian ia memakan satu suap lantas membawanya ke hadapan Nabi Shallallahu 'alaihi wa Sallam. Waktu itu antara kami mempunyai perjanjian dengan suatu kaum dan masanya pun telah habis. Kemudian kami membagi orang-orang menjadi dua belas orang, dan setiap dari mereka diikuti oleh beberapa orang -dan Allah yang lebih tahu berapa jumlah mereka-. Kemudian mereka menyantap makanan tersebut hingga kenyang",
          "tr": "Abdurrahman bin Ebî Bekir'den şöyle nakledilmiştir: \"Ashâb-i suffe, fakir kimselerden oluşuyordu. Nebi Sallallahu Aleyhi ve Sellem iki kişilik yemeği olan kimse, üçüncü olarak ashâb-ı suffeden birini götürsün, dört kişilik yemeği olan beşinci veya altıncı olarak ashab-ı suffeden birini götürsün' buyurdu. Ebu Bekir beraberinde üç kişiyi götürdü. Nebi Sallallahu Aleyhi ve Sellem ise on kişiyi aldı. Bizim aile, ben, babam ve annemden meydana geliyordu. (Ravi Ebu Osman, 'Abdurrahman'ın eşini sayıp saymadığını hatırlamıyorum' demiştir.) Bir de Ebu Bekir'in evi ile bizim ev arasında müşterek olarak kullandığımız hizmetçimiz vardı. Ebu Bekir Nebi (Sallallahu aleyhi ve Sellem)’in evinde akşam yemeği yedi. Yatsı namazını kılıncaya kadar evinde kaldı. Sonra Nebi Sallallahu Aleyhi ve Sellem'in yanına dönüp O (Sallallahu aleyhi ve Sellem) akşam yemeğini yeyinceye kadar orada kaldı. Gece'nin bir bölümü ilerledikten sonra evine döndü. Hanımı ona, 'Neden misafirlerinle veya misafirinle ilgilenmedin?' diye sordu. O da, 'Onlara akşam yemeği verdin mi?' diye sordu. Hanımı da şöyle cevap verdi: 'Onlar sen gelinceye kadar yemek yemeyi kabul etmediler. Onlar için sofra kuruldu ama yemek İstemediler. Abdurrahman şöyle dedi: Babamın kızmasından korktuğum için bir köşeye gidip saklandım. Ebu Bekir şöyle dedi: Ey korkak adam nerdesin! Kulağı kopasıca! Burnu düşesice! Dudağı büzülesice nerdesin! diyerek oğluna hakaretler yağdırdı. Ancak misafirlerin yemek yememelerinin oğlunun kusurundan değil de onların tercihinden ileri geldiğini anlayınca onlara şöyle dedi: 'Buyurun, yeyin! Afiyet olmasın!' Sonra Ebu Bekir şöyle dedi: 'Allah'a and olsun ki, ben asla yemeyeceğim! Allah'a yemin olsun ki, yemekten bir lokma aldığımız zaman yemek alttan alta çoğalıyordu. Abdurrahman şöyle dedi: Misafirler doydu. Yemek ise sofraya konduğundan daha fazla idi. Ebu Bekir sofraya baktı ve yemeğin konduğu gibi hatta daha fazla olduğunu fark etti. Bunun üzerine hanımına şöyle seslendi: Benû Firâs'ın bacısı bu da nedir? O da 'Gözümün nuruna yemin olsun ki, bu yemekler sofraya koyduğumdan daha fazla!' diye üç kez seslendi. Sonra Ebu Bekir yemekten yedi ve şöyle dedi: Bu benim ettiğim yemin şeytanın vesvesesinden ileri geldi. 'Sonra yemekten bir lokma aldı. Daha sonra yemeği Nebi Sallallahu Aleyhi ve Sellem'e götürdü, sabaha kadar orada kaldı. O kavimle bizim aramızda barış sözleşmesi vardı. Anlaşmanın süresi dolmuştu. Bu yüzden Medine'ye gelmişlerdi. Biz de onları on iki gruba ayırmıştık. Her grupta bayağı adam vardı. Tam sayılarını ancak Allah bilir. İşte bu adamlar hep beraber bu yemekten yemişlerdir. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 9,
        "hadith": 77
      },
      "narrator": {
        "en": "Abu `Uthman"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "51KB"
  }
}