{
  "collection": "bukhari",
  "book": 54,
  "name": {
    "arabic": "كتاب Conditions",
    "transliteration": "conditions",
    "translation": "Conditions"
  },
  "totalHadith": 24,
  "hadithNumberRange": {
    "first": 2712,
    "last": 2737
  },
  "content": [
    {
      "hadithNumber": 2712,
      "arabicNumber": 2712,
      "book": 54,
      "hadithInBook": 1,
      "text": {
        "arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ مَرْوَانَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، رضى الله عنهما يُخْبِرَانِ عَنْ أَصْحَابِ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ لَمَّا كَاتَبَ سُهَيْلُ بْنُ عَمْرٍو يَوْمَئِذٍ كَانَ فِيمَا اشْتَرَطَ سُهَيْلُ بْنُ عَمْرٍو عَلَى النَّبِيِّ صلى الله عليه وسلم أَنَّهُ لاَ يَأْتِيكَ مِنَّا أَحَدٌ وَإِنْ كَانَ عَلَى دِينِكَ إِلاَّ رَدَدْتَهُ إِلَيْنَا، وَخَلَّيْتَ بَيْنَنَا وَبَيْنَهُ‏.‏ فَكَرِهَ الْمُؤْمِنُونَ ذَلِكَ، وَامْتَعَضُوا مِنْهُ، وَأَبَى سُهَيْلٌ إِلاَّ ذَلِكَ، فَكَاتَبَهُ النَّبِيُّ صلى الله عليه وسلم عَلَى ذَلِكَ، فَرَدَّ يَوْمَئِذٍ أَبَا جَنْدَلٍ عَلَى أَبِيهِ سُهَيْلِ بْنِ عَمْرٍو، وَلَمْ يَأْتِهِ أَحَدٌ مِنَ الرِّجَالِ إِلاَّ رَدَّهُ فِي تِلْكَ الْمُدَّةِ، وَإِنْ كَانَ مُسْلِمًا، وَجَاءَ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ، وَكَانَتْ أُمُّ كُلْثُومٍ بِنْتُ عُقْبَةَ بْنِ أَبِي مُعَيْطٍ مِمَّنْ خَرَجَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ وَهْىَ عَاتِقٌ، فَجَاءَ أَهْلُهَا يَسْأَلُونَ النَّبِيَّ صلى الله عليه وسلم أَنْ يَرْجِعَهَا إِلَيْهِمْ، فَلَمْ يَرْجِعْهَا إِلَيْهِمْ لِمَا أَنْزَلَ اللَّهُ فِيهِنَّ ‏{‏إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ‏}‏ إِلَى قَوْلِهِ ‏{‏وَلاَ هُمْ يَحِلُّونَ لَهُنَّ‏}‏‏.‏",
        "translations": {
          "en": "Narrated Marwan and al-Miswar bin Makhrama:(from the companions of Allah's Messenger (ﷺ)) When Suhail bin `Amr agreed to the Treaty (of Hudaibiya), one of the things he stipulated then, was that the Prophet (ﷺ) should return to them (i.e. the pagans) anyone coming to him from their side, even if he was a Muslim; and would not interfere between them and that person. The Muslims did not like this condition and got disgusted with it. Suhail did not agree except with that condition. So, the Prophet (ﷺ) agreed to that condition and returned Abu Jandal to his father Suhail bin `Amr. Thenceforward the Prophet (ﷺ) returned everyone in that period (of truce) even if he was a Muslim. During that period some believing women emigrants including Um Kulthum bint `Uqba bin Abu Muait who came to Allah's Messenger (ﷺ) and she was a young lady then. Her relative came to the Prophet (ﷺ) and asked him to return her, but the Prophet (ﷺ) did not return her to them for Allah had revealed the following Verse regarding women: \"O you who believe! When the believing women come to you as emigrants. Examine them, Allah knows best as to their belief, then if you know them for true believers, Send them not back to the unbelievers, (for) they are not lawful (wives) for the disbelievers, Nor are the unbelievers lawful (husbands) for them",
          "fr": "Rapporté par Marwan et al-Miswar bin Makhrama : (parmi les compagnons du Messager d’Allah (ﷺ)) Lorsque Suhail bin `Amr a accepté le traité de Hudaibiya, il a posé comme condition que le Prophète (ﷺ) devait leur renvoyer toute personne venant de leur côté, même si c’était un musulman, et qu’il ne devait pas intervenir entre eux et cette personne. Les musulmans n’aimaient pas cette condition et en étaient contrariés. Suhail n’a accepté que sous cette condition. Le Prophète (ﷺ) a donc accepté et a renvoyé Abu Jandal à son père Suhail bin `Amr. À partir de là, le Prophète (ﷺ) a renvoyé toute personne pendant cette période de trêve, même si elle était musulmane. Pendant cette période, des femmes croyantes ont émigré, dont Um Kulthum bint `Uqba bin Abu Muait, qui était alors jeune. Un membre de sa famille est venu demander au Prophète (ﷺ) de la lui rendre, mais il ne l’a pas fait, car Allah avait révélé ce verset concernant les femmes : « Ô vous qui croyez ! Lorsque des femmes croyantes viennent à vous en tant qu’émigrantes, examinez-les. Allah connaît mieux leur foi. Si vous les reconnaissez comme croyantes, ne les renvoyez pas aux mécréants, car elles ne leur sont pas licites, ni eux pour elles. »",
          "id": "Telah bercerita kepada kami [Yahya bin Bukair] telah bercerita kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] berkata telah bercerita kepadaku ['Urwah bin Az Zubair] bahwa dia mendengar [Marwan] dan [Al Miswar bin Makhramah radliallahu 'anhu] keduanya mengabarkan dari para shahabat Rasulullah shallallahu 'alaihi wasallam berkata; Pada hari Suhail bin 'Amru menulis surat perjanjian yang isinya tertera sebuah persyaratan terhadap Nabi Shallahu 'Alaihi Wasallam bahwa: \"Tidak akan ada seorangpun dari golongan kami yang datang kepada Anda miski ia telah memeluk agamamu melainkan Anda harus mengembalikannya kepada kami serta membiarkannya berada diantara kami\". Maka kaum mukminin tidak senang dan merasa tertekan dengan persyaratan tersebut, namun Suhail mengabaikannya dan tetap pada pendiriannya. Akhirnya Nabi shallallahu 'alaihi wasallam menyetujuinya maka pada hari itu pula Beliau harus mengembalikan Abu Jandal kepada bapaknya, yaitu Suhail bin 'Amru dan tidak satupun orang laki-laki yang datang kepada Beliau melainkan Beliau mengembalikannya pada masa perjanjian tersebut sekalipun dia seorang Muslim. Lalu datanglah para wanita mu'minah muhajirah dan pada hari itu di antara mereka terdapat Ummu Kultsum binti 'Uqbah bin Abi Mu'aith yang termasuk orang-orang yang berhijrah kepada Rasulullah SHALALLAHU 'ALAIHI WASALLAM, dia adalah seorang sahaya yang telah dibebaskan namun kemudian kelurganya datang dan meminta kepada Nabi shallallahu 'alaihi wasallam agar mengembalikannya kepada mereka, akan tetapi Beliau tidak mau mengembalikannya kepada mereka lalu turunlah firman Allah tentang wanita-wanita yang berhijrah ini (dalam surah Al Mumtahanah) yang artinya (\"Apabila datang kepadamu wanita-wanita mu'minah yang berhijrah maka ujilah mereka. Allah yang lebih mengetahui tentang iman mereka) hingga firman-Nya (\"Dan mereka (orang Musyrik) tidak halal bagi mereka (wanita mu'minah). 'Urwah berkata maka 'Aisyah radliallahu 'anha mengabarkan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam saat itu menguji mereka dengan ayat ini: (\"Wahai orang-orang beriman, apabila datang kepadamu wanita-wanita mu'minah yang berhijrah maka ujilah mereka. Allah yang lebih mengetahui tentang iman mereka) hingga firman-Nya (\"dan Allah Maha Pengampun lagi Maha Penyayang\"). ['Urwah] berkata; ['Aisyah radliallahu 'anha] berkata: \"Siapa saja di antara mereka yang menyetujui persyaratan ini, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Sungguh aku telah membai'at kamu\" disambung dengan satu kalimat yang Beliau ucapkan. Demi Allah, sama sekali tangan Beliau tidak menyentuh tangan seorang wanitapun dalam baiat tersebut dan tidaklah Beliau membai'at mereka melainkan hanya dengan ucapan Beliau",
          "tr": "Allah Resu!ü'nün ashabından nakledilmiştir: Süheyl İbn Amr o gün (Hudeybiye günü) anlaşma imzaladığında Allah Resulü Sallallahu Aleyhi ve Sellem'e koştuğu şartlardan biri de şuydu: \"Biz'den biri sana geldiğinde, senin dininden olsa bile onu bize iade edeceksin ve onunla bizim aramıza girmeyeceksin.\" Mu'minler bu şarttan rahatsız oldular ve öfkelendiler. Ama Süheyl bu şartta ısrarcı oldu. Hz. Nebi o gün Ebu Cendel'i babası Süheyl İbn Amr'a iade etti ve anlaşma süresince kendisine her kim geldiyse Müslüman olanlar da dahil hepsini iade etti. Sonra mu'min kadınlar hicret ederek Hz.Nebi'in yanına geldiler. Ümmü Gülsüm bint-i Ukbe İbn Ebı Muayt da bu gelen kadınlar arasında bulunuyordu. Henüz genç bir kızdı. Ailesi gelerek kızlarını kendilerine teslim etmesini istediler. Ama Nebi Sallallahu Aleyhi ve Sellem onu onlara teslim etmedi. Çünkü Allah (c.c.): \"Ey iman edenler! Mu'min kadınlar hicret ederek size geldiği zaman, onları imtihan edin. Allah onların imanlarını daha iyi bilir. Eğer siz de onların inanmış kadınlar olduklarını öğrenirseniz onları kafirlere geri göndermeyin. Bunlar onlara helal değildir. Onlar da bunlara helal olmazlar\"[Mümtehine 10] ayetini indirmişti. [-2713-] Urve şöyle anlatır: Aişe bana, Allah Resulü Sallallahu Aleyhi ve Sellem'in kadınları şu ayete göre imtihan ettiğini bildirmişti: \"Ey Nebi! İnanmış kadınlar, Allah'a hiçbir şeyi ortak koşmamak, hırsızlık yapmamak, zina etmemek, çocuklarını öldürmemek, elleriyle ayakları arasında bir iftira uydurup getirmemek, iyi işi işlemekte sana karşı gelmemek hususunda sana bey'at etmeye geldikleri zaman, bey'atlarını kabul et ve onlar için Allah'tan bağışlanma dile. Allah çok bağışlayandır, çok esirgeyendir\" [Mümtehine 12] Urve, Aişe'nin şöyle dediğini nakletmiştir: Bu şartları kabul edenlere Allah Resulü Sallallahu Aleyhi ve Sellem sadece sözle \"Senden bey'at aldım\" diyordu. Allah'a yemin ederim ki, bey'at alırken O'nun eli hiçbir kadının eline dokunmamıştı. Tekrar:"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 1
      },
      "narrator": {
        "en": "Marwan and al-Miswar bin Makhrama"
      }
    },
    {
      "hadithNumber": 2713,
      "arabicNumber": 2713,
      "book": 54,
      "hadithInBook": 2,
      "text": {
        "arabic": "قَالَ عُرْوَةُ فَأَخْبَرَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُهُنَّ بِهَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ ‏}‏ إِلَى ‏{‏غَفُورٌ رَحِيمٌ‏}‏‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَمَنْ أَقَرَّ بِهَذَا الشَّرْطِ مِنْهُنَّ قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ بَايَعْتُكِ ‏\"‏‏.‏ كَلاَمًا يُكَلِّمُهَا بِهِ، وَاللَّهِ مَا مَسَّتْ يَدُهُ يَدَ امْرَأَةٍ قَطُّ فِي الْمُبَايَعَةِ، وَمَا بَايَعَهُنَّ إِلاَّ بِقَوْلِهِ‏.‏",
        "translations": {
          "en": "Narrated `Urwa: Aisha told me, \"Allah's Messenger (ﷺ) used to examine them according to this Verse: \"O you who believe! When the believing women come to you, as emigrants test them . . . for Allah is Oft- Forgiving, Most Merciful.\" (60.10-12) Aisha said, \"When any of them agreed to that condition Allah's Apostle would say to her, 'I have accepted your pledge of allegiance.' He would only say that, but, by Allah he never touched the hand of any women (i.e. never shook hands with them) while taking the pledge of allegiance and he never took their pledge of allegiance except by his words (only)",
          "ur": "عروہ نے کہا کہ مجھے عائشہ رضی اللہ عنہا نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم ہجرت کرنے والی عورتوں کا اس آیت کی وجہ سے امتحان لیا کرتے تھے «{‏ يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن ‏}‏ إلى ‏ {‏ غفور رحيم‏ }‏‏.‏» ”اے مسلمانو! جب تمہارے یہاں مسلمان عورتیں ہجرت کر کے آئیں تو تم ان کا امتحان لے لو غفور رحیم تک۔“ عروہ نے کہا کہ عائشہ رضی اللہ عنہا نے کہا کہ ان عورتوں میں سے جو اس شرط کا اقرار کر لیتیں تو رسول اللہ صلی اللہ علیہ وسلم فرماتے کہ میں نے تم سے بیعت کی، آپ صلی اللہ علیہ وسلم صرف زبان سے بیعت کرتے تھے۔ قسم اللہ کی! بیعت کرتے وقت آپ صلی اللہ علیہ وسلم کے ہاتھ نے کسی بھی عورت کے ہاتھ کو کبھی نہیں چھوا، بلکہ آپ صلی اللہ علیہ وسلم صرف زبان سے بیعت لیا کرتے تھے۔",
          "fr": "Rapporté par `Urwa : Aisha m’a raconté : « Le Messager d’Allah (ﷺ) les examinait selon ce verset : “Ô vous qui croyez ! Lorsque des femmes croyantes viennent à vous en tant qu’émigrantes, testez-les… car Allah est Pardonneur et Miséricordieux.” (60.10-12) Aisha a dit : « Quand l’une d’elles acceptait cette condition, le Messager d’Allah lui disait : ‘J’accepte ton engagement.’ Il ne disait que cela, mais, par Allah, il n’a jamais touché la main d’une femme (c’est-à-dire qu’il ne leur serrait pas la main) lors de la prise d’engagement, et il n’a accepté leur engagement que par ses paroles. »",
          "tr": "Urve dedi ki: Bana Âişe, Rasûlüllah'ın gelen kadınları şu âyetler ile imtihan edip dener olduğunu haber verdi: îmân edenler! Mü 'min kadınlar muhacirler olarak size geldikleri zaman onları imtihan edin... Çünkü Allah çok mağfiret edici, çok merhamet eyleyicidir\" kavline kadar(el-Mümtehine: 10-12). dedi ki: Âişe şöyle dedi: İşte kadınlardan her kim bu âyetteki şartı ikrar ve i'tirâf etti ise, Rasûlüllah o kadına konuşmakta olduğu bir kelâm olarak: \"Ben seninle bey'at ettim \"buyurdu. Allah'a yemîn ederim ki, Rasûlüllah'ın eli, bu bey'atlaşma töreninde asla hiçbir kadının eline dokunmadı. Rasûlüllah kadınlara ancak sözü ile bey'at etti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 2
      },
      "narrator": {
        "en": "`Urwa"
      }
    },
    {
      "hadithNumber": 2714,
      "arabicNumber": 2714,
      "book": 54,
      "hadithInBook": 3,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، قَالَ سَمِعْتُ جَرِيرًا ـ رضى الله عنه ـ يَقُولُ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاشْتَرَطَ عَلَىَّ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
        "translations": {
          "en": "Narrated Jarir:When I gave the pledge of allegiance to Allah's Messenger (ﷺ) and he stipulated that I should give good advice to every Muslim",
          "ur": "ہم سے ابونعیم نے بیان کیا، کہا کہ ہم سے سفیان نے بیان کیا، ان سے زیاد بن علاقہ نے بیان کیا کہ میں نے جریر رضی اللہ عنہ سے سنا، آپ بیان کرتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تو آپ صلی اللہ علیہ وسلم نے مجھ سے ہر مسلمان کے ساتھ خیر خواہی کرنے کی شرط پر بیعت کی تھی۔",
          "fr": "Rapporté par Jarir : Quand j’ai prêté serment d’allégeance au Messager d’Allah (ﷺ), il a posé comme condition que je donne de bons conseils à chaque musulman",
          "id": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Sufyan] dari [Ziyad bin 'Alaqoh] berkata aku mendengar [Jarir radliallahu 'anhu] berkata: \"Aku membai'at Rasulullah shallallahu 'alaihi wasallam lalu Beliau memberi persyaratan kepadaku untuk saling memberi nashihat kepada sesama Muslim",
          "tr": "Ziyad İbn ilaka'dan nakledilmiştir: Cerir r.a.'in şöyle dediğini işitmiştim: \"Ben Allah Resulü Sallallahu Aleyhi ve Sellem'e bey'at ettim. Bana bütün Müslümanların iyiliğini istemeyi şart koşmuştu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 3
      },
      "narrator": {
        "en": "Jarir"
      }
    },
    {
      "hadithNumber": 2715,
      "arabicNumber": 2715,
      "book": 54,
      "hadithInBook": 4,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ وَإِيتَاءِ الزَّكَاةِ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
        "translations": {
          "en": "Narrated Jabir bin `Abdullah:I gave the pledge of allegiance to Allah's Messenger (ﷺ) for offering the prayers perfectly paying the Zakat and giving good advice to every Muslim",
          "ur": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، انہوں نے کہا ہم سے اسماعیل نے بیان کیا، ان سے قیس بن ابی حازم نے اور ان سے جریر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم سے میں نے نماز قائم کرنے، زکوٰۃ ادا کرنے اور ہر مسلمان کے ساتھ خیر خواہی کرنے کی شرطوں کے ساتھ بیعت کی تھی۔",
          "fr": "Rapporté par Jabir bin `Abdullah : J’ai prêté serment d’allégeance au Messager d’Allah (ﷺ) pour accomplir parfaitement la prière, payer la Zakat et donner de bons conseils à chaque musulman",
          "id": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yahya] dari [Isma'il] berkata telah bercerita kepadaku [Qais bin Abi Hazim] dari [Jarir bin 'Abdullah radliallahu 'anhu] berkata: \"Aku membai'at Rasulullah shallallahu 'alaihi wasallam untuk menegakkan shalat, menunaikan zakat dan saling memberi nashehat kepada sesama Muslim",
          "tr": "Cerir İbn Abdullah r.a.'dan nakledilmiştir: Namaz kılmak, zekat vermek ve bütün Müslümanların iyiliğini istemek üzere Allah Resulü'ne bey'at ettim"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 4
      },
      "narrator": {
        "en": "Jabir bin `Abdullah"
      }
    },
    {
      "hadithNumber": 2716,
      "arabicNumber": 2716,
      "book": 54,
      "hadithInBook": 5,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) said, \"If someone sells pollinated date-palms, their fruits will be for the seller, unless the buyer stipulates the contrary",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”جس نے کوئی ایسا کھجور کا باغ بیچا جس کی پیوند کاری ہو چکی تھی تو اس کا پھل ( اس سال کے ) بیچنے والے ہی کا ہو گا۔ ہاں اگر خریدار شرط لگا دے ( تو پھل سمیت بیع سمجھی جائے گی ) ۔",
          "fr": "Rapporté par `Abdullah bin `Umar : Le Messager d’Allah (ﷺ) a dit : « Si quelqu’un vend des palmiers déjà pollinisés, les fruits reviennent au vendeur, sauf si l’acheteur pose une condition contraire. »",
          "id": "Telah bercerita kepada kami ['Abdullah bin Yusuf] telah mengabarkan kepada kami [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar Radhiyyallahu 'Anhuma] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang menjual pohon kurma yang telah dikawinkan maka buahnya nanti menjadi hak penjual kecuali disyaratkan oleh pembeli",
          "tr": "Abdullah İbn Ömer r.a.'den nakledilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem \"Her kim aşılanmış bir hurmalık satarsa ürünü satıcıya aittir. Ancak müşteri sözleşmede şart koşarsa o başka.\" buyurdu. Not: Bu hadis \"Alışveriş\" bölümünde açıklanmıştır. باب: الشروط في البيع. 3. ALIŞVERİşTE KOŞULAN ŞARTLAR"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 5
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 2717,
      "arabicNumber": 2717,
      "book": 54,
      "hadithInBook": 6,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةََ،ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا، وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، قَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ، فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ إِلَى أَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ، وَيَكُونَ لَنَا وَلاَؤُكِ‏.‏ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا ‏ \"‏ ابْتَاعِي فَأَعْتِقِي، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Urwa:Aisha told me that Barirah came to seek her help in writing for emancipation and at that time she had not paid any part of her price. `Aisha said to her, \"Go to your masters and if they agree that I will pay your price (and free you) on condition that your Wala' will be for me, I will pay the money.\" Barirah told her masters about that, but they refused, and said, \"If `Aisha wants to do a favor she could, but your Wala will be for us.\" Aisha informed Allah's Messenger (ﷺ) of that and he said to her, \"Buy and manumit Barirah as the Wala' will go to the manumitted",
          "ur": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ نے اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ بریرہ، عائشہ رضی اللہ عنہا کے یہاں اپنی مکاتبت کے بارے میں ان سے مدد لینے کے لیے آئیں، انہوں نے ابھی تک اس معاملے میں ( اپنے مالکوں کو ) کچھ دیا نہیں تھا۔ عائشہ رضی اللہ عنہا نے ان سے فرمایا کہ اپنے مالکوں کے یہاں جا کر ( ان سے دریافت کرو ) اگر وہ یہ صورت پسند کریں کہ تمہاری مکاتبت کی ساری رقم میں ادا کر دوں اور تمہاری ولاء میرے لیے ہو جائے تو میں ایسا کر سکتی ہوں۔ بریرہ نے اس کا تذکرہ جب اپنے مالکوں کے سامنے کیا تو انہوں نے انکار کیا اور کہا کہ وہ ( عائشہ رضی اللہ عنہا ) اگر چاہیں تو یہ کار ثواب تمہارے ساتھ کر سکتی ہیں لیکن ولاء تو ہمارے ہی رہے گی۔ عائشہ رضی اللہ عنہا نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تم انہیں خرید کر آزاد کر دو، ولاء تو بہرحال اسی کی ہوتی ہے جو آزاد کر دے۔",
          "fr": "Rapporté par `Urwa : Aisha m’a raconté que Barirah était venue lui demander de l’aide pour rédiger un contrat d’affranchissement, alors qu’elle n’avait encore rien payé de sa somme. Aisha lui a dit : « Va voir tes maîtres et s’ils acceptent que je paie ton prix (et que je t’affranchisse) à condition que ton Wala’ me revienne, je paierai la somme. » Barirah en a parlé à ses maîtres, mais ils ont refusé et ont dit : « Si Aisha veut te faire une faveur, qu’elle le fasse, mais ton Wala’ sera pour nous. » Aisha a informé le Messager d’Allah (ﷺ) de cela et il lui a dit : « Achète et affranchis Barirah, car le Wala’ revient à celui qui affranchit. »",
          "id": "Telah bercerita kepada kami ['Abdullah bin Maslamah] telah bercerita kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] bahwa ['Aisyah radliallahu 'anha] mengabarkan kepadanya bahwa Barirah datang menemui 'Aisyah untuk meminta bantuannya tentang perihal penebusan dirinya untuk merdeka sesuai waktu yang telah ditentukan namun waktunya belum habis maka 'Aisyah berkata kepadanya: \"Kembalilah kepada tuanmu, jika mereka suka aku akan bayar untuk pembebasanmu dan perwalianmu menjadi hakku\". Lalu Barirah menyampaikan hal ini kepada tuannya namun mereka menolaknya seraya berkata: \"Jika dia mau untuk membayarmu silakan tapi perwalian tetap menjadi milik kami\". Kemudian hal ini disampaikkan oleh 'Aisyah kepada Rasulullah shallallahu 'alaihi wasallam, maka Beliau bersabda: \"Belilah dia lalu bebaskanlah karena perwalian menjadi hak orang yang membebaskannya",
          "tr": "Urve, Hz. Aişe'nin kendisine şöyle dediğini nakletmiştir: Berire, Aişe'ye gelerek (yaptığı) özgürlük anlaşması konusunda ondan yardım istemişti. Henüz anlaşması için hiç taksit ödememişti. Aişe ona: \"Sahiplerine dön. Özgürlük bedelini senin adına ödememe ve vela hakkının bana ait olmasına razı olurlarsa bunu yapayım\" dedi. Berire, Hz.Aişe'nin sözünü sahiplerine iletti. Onlar bunu kabul etmediler ve \"Bunu hayrına yapmak istiyorsa yapsın. Ama vela hakkın bize ait olacaktır\" dediler. Aişe bunu Allah Resulü Sallallahu Aleyhi ve Sellem'e anlattı. O da: \"Sen onu satın al ve azad et. Vela hakkı azad edene aittir\" buyurdu. باب: إذا اشترط البائع ظهر الدابة إلى مكان مسمى جاز. 4. SATICI BELİRLİ BİR YERE KADAR SATTlĞI HAYVANIN SIRTINDA KENDİSİ GİTMEYİ ŞART KOŞABİLİR"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 6
      },
      "narrator": {
        "en": "`Urwa"
      }
    },
    {
      "hadithNumber": 2718,
      "arabicNumber": 2718,
      "book": 54,
      "hadithInBook": 7,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، قَالَ سَمِعْتُ عَامِرًا، يَقُولُ حَدَّثَنِي جَابِرٌ ـ رضى الله عنه أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ قَدْ أَعْيَا، فَمَرَّ النَّبِيُّ صلى الله عليه وسلم فَضَرَبَهُ، فَدَعَا لَهُ، فَسَارَ بِسَيْرٍ لَيْسَ يَسِيرُ مِثْلَهُ ثُمَّ قَالَ ‏\"‏ بِعْنِيهِ بِوَقِيَّةٍ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ ثُمَّ قَالَ ‏\"‏ بِعْنِيهِ بِوَقِيَّةٍ ‏\"‏‏.‏ فَبِعْتُهُ فَاسْتَثْنَيْتُ حُمْلاَنَهُ إِلَى أَهْلِي، فَلَمَّا قَدِمْنَا أَتَيْتُهُ بِالْجَمَلِ، وَنَقَدَنِي ثَمَنَهُ، ثُمَّ انْصَرَفْتُ، فَأَرْسَلَ عَلَى إِثْرِي، قَالَ ‏\"‏ مَا كُنْتُ لآخُذَ جَمَلَكَ، فَخُذْ جَمَلَكَ ذَلِكَ فَهْوَ مَالُكَ ‏\"‏‏.‏ قَالَ شُعْبَةُ عَنْ مُغِيرَةَ عَنْ عَامِرٍ عَنْ جَابِرٍ أَفْقَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ظَهْرَهُ إِلَىَ الْمَدِينَةِ‏.‏ وَقَالَ إِسْحَاقُ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ فَبِعْتُهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ‏.‏ وَقَالَ عَطَاءٌ وَغَيْرُهُ لَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ، وَقَالَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ جَابِرٍ شَرَطَ ظَهْرَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ زَيْدُ بْنُ أَسْلَمَ عَنْ جَابِرٍ وَلَكَ ظَهْرُهُ حَتَّى تَرْجِعَ‏.‏ وَقَالَ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَفْقَرْنَاكَ ظَهْرَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ الأَعْمَشُ عَنْ سَالِمٍ عَنْ جَابِرٍ تَبَلَّغْ عَلَيْهِ إِلَى أَهْلِكَ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ وَابْنُ إِسْحَاقَ عَنْ وَهْبٍ عَنْ جَابِرٍ اشْتَرَاهُ النَّبِيُّ صلى الله عليه وسلم بِوَقِيَّةٍ‏.‏ وَتَابَعَهُ زَيْدُ بْنُ أَسْلَمَ عَنْ جَابِرٍ‏.‏ وَقَالَ ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ وَغَيْرِهِ عَنْ جَابِرٍ أَخَذْتُهُ بِأَرْبَعَةِ دَنَانِيرَ‏.‏ وَهَذَا يَكُونُ وَقِيَّةً عَلَى حِسَابِ الدِّينَارِ بِعَشَرَةِ دَرَاهِمَ‏.‏ وَلَمْ يُبَيِّنِ الثَّمَنَ مُغِيرَةُ عَنِ الشَّعْبِيِّ عَنْ جَابِرٍ، وَابْنُ الْمُنْكَدِرِ وَأَبُو الزُّبَيْرِ عَنْ جَابِرٍ‏.‏ وَقَالَ الأَعْمَشُ عَنْ سَالِمٍ عَنْ جَابِرٍ وَقِيَّةُ ذَهَبٍ‏.‏ وَقَالَ أَبُو إِسْحَاقَ عَنْ سَالِمٍ عَنْ جَابِرٍ بِمِائَتَىْ دِرْهَمٍ‏.‏ وَقَالَ دَاوُدُ بْنُ قَيْسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرٍ اشْتَرَاهُ بِطَرِيقِ تَبُوكَ، أَحْسِبُهُ قَالَ بِأَرْبَعِ أَوَاقٍ‏.‏ وَقَالَ أَبُو نَضْرَةَ عَنْ جَابِرٍ اشْتَرَاهُ بِعِشْرِينَ دِينَارًا‏.‏ وَقَوْلُ الشَّعْبِيِّ بِوَقِيَّةٍ أَكْثَرُ‏.‏ الاِشْتِرَاطُ أَكْثَرُ وَأَصَحُّ عِنْدِي‏.‏ قَالَهُ أَبُو عَبْدِ اللَّهِ‏.‏",
        "translations": {
          "en": "Narrated Jabir:While I was riding a (slow) and tired camel, the Prophet (ﷺ) passed by and beat it and prayed for Allah's Blessings for it. The camel became so fast as it had never been before. The Prophet (ﷺ) then said, \"Sell it to me for one Uqiyya (of gold).\" I said, \"No.\" He again said, \"Sell it to me for one Uqiyya (of gold).\" I sold it and stipulated that I should ride it to my house. When we reached (Medina) I took that camel to the Prophet (ﷺ) and he gave me its price. I returned home but he sent for me (and when I went to him) he said, \"I will not take your camel. Take your camel as a gift for you.\" (Various narrations are mentioned here with slight variations in expressions relating the condition that Jabir had the right to ride the sold camel up to Medina)",
          "ur": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا ہم سے زکریا نے بیان کیا، کہا کہ میں نے عامر سے سنا، انہوں نے بیان کیا کہ مجھ سے جابر رضی اللہ عنہ نے بیان کیا کہ وہ ( ایک غزوہ کے موقع پر ) اپنے اونٹ پر سوار آ رہے تھے، اونٹ تھک گیا تھا۔ نبی کریم صلی اللہ علیہ وسلم کا ادھر سے گزر ہوا تو آپ صلی اللہ علیہ وسلم نے اونٹ کو ایک ضرب لگائی اور اس کے حق میں دعا فرمائی، چنانچہ اونٹ اتنی تیزی سے چلنے لگا کہ کبھی اس طرح نہیں چلا تھا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے ایک اوقیہ میں مجھے بیچ دو۔ میں نے انکار کیا مگر آپ صلی اللہ علیہ وسلم کے اصرار پر پھر میں نے آپ صلی اللہ علیہ وسلم کے ہاتھ بیچ دیا، لیکن اپنے گھر تک اس پر سواری کو مستثنیٰ کرا لیا۔ پھر جب ہم ( مدینہ ) پہنچ گئے، تو میں نے اونٹ آپ صلی اللہ علیہ وسلم کو پیش کر دیا اور آپ صلی اللہ علیہ وسلم نے اس کی قیمت بھی ادا کر دی، لیکن جب میں واپس ہونے لگا تو میرے پیچھے ایک صاحب کو مجھے بلانے کے لیے بھیجا ( میں حاضر ہوا تو ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہارا اونٹ کوئی لے تھوڑا ہی رہا تھا، اپنا اونٹ لے جاؤ، یہ تمہارا ہی مال ہے۔ ( اور قیمت واپس نہیں لی ) شعبہ نے مغیرہ کے واسطے سے بیان کیا، ان سے عامر نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینہ تک اونٹ پر مجھے سوار ہونے کی اجازت دی تھی، اسحاق نے جریر سے بیان کیا اور ان سے مغیرہ نے کہ ( جابر رضی اللہ عنہ نے فرمایا تھا ) پس میں نے اونٹ اس شرط پر بیچ دیا کہ مدینہ پہنچنے تک اس پر میں سوار رہوں گا۔ عطاء وغیرہ نے بیان کیا کہ ( رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ) اس پر مدینہ تک کی سواری تمہاری ہے۔ محمد بن منکدر نے جابر رضی اللہ عنہ سے بیان کیا کہ انہوں نے مدینہ تک سواری کی شرط لگائی تھی۔ زید بن اسلم نے جابر رضی اللہ عنہ کے واسطہ سے بیان کیا کہ ( رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ) مدینہ تک اس پر تم ہی رہو گے۔ ابوالزبیر نے جابر رضی اللہ عنہ سے بیان کیا کہ مدینہ تک کی سواری کی آپ صلی اللہ علیہ وسلم نے مجھے اجازت دی تھی۔ اعمش نے سالم سے بیان کیا اور ان سے جابر رضی اللہ عنہ نے کہ ( رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ) اپنے گھر تک تم اسی پر سوار ہو کے جاؤ۔ عبیداللہ اور ابن اسحاق نے وہب سے بیان کیا اور ان سے جابر رضی اللہ عنہ نے کہ اونٹ کو رسول اللہ صلی اللہ علیہ وسلم نے ایک اوقیہ میں خریدا تھا۔ اس روایت کی متابعت زید بن اسلم نے جابر رضی اللہ عنہ سے کی ہے۔ ابن جریج نے عطاء وغیرہ سے بیان کیا اور ان سے جابر رضی اللہ عنہ نے ( کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا ) میں تمہارا یہ اونٹ چار دینار میں لیتا ہوں، اس حساب سے کہ ایک دینار دس درہم کا ہوتا ہے، چار دینار کا ایک اوقیہ ہو گا۔ مغیرہ نے شعبی کے واسطہ سے اور انہوں نے جابر رضی اللہ عنہ سے ( ان کی روایت میں اور ) اسی طرح ابن المنکدر اور ابوالزبیر نے جابر رضی اللہ عنہ سے اپنی روایت میں قیمت کا ذکر نہیں کیا ہے۔ اعمش نے سالم سے اور انہوں نے جابر رضی اللہ عنہ سے اپنی روایت میں ایک اوقیہ سونے کی وضاحت کی ہے۔ ابواسحاق نے سالم سے اور انہوں نے جابر رضی اللہ عنہ سے اپنی روایت میں دو سو درہم بیان کیے ہیں اور داود بن قیس نے بیان کیا، ان سے عبیداللہ بن مقسم نے اور ان سے جابر رضی اللہ عنہ نے کہ آپ صلی اللہ علیہ وسلم نے اونٹ تبوک کے راستے میں ( غزوہ سے واپس ہوتے ہوئے ) خریدا تھا۔ میرا خیال ہے کہ انہوں نے کہا کہ چار اوقیہ میں ( خریدا تھا ) ابونضرہ نے جابر رضی اللہ عنہ سے روایت میں بیان کیا کہ بیس دینار میں خریدا تھا۔ شعبی کے بیان کے مطابق ایک اوقیہ ہی زیادہ روایتوں میں ہے۔ اسی طرح شرط لگانا بھی زیادہ روایتوں سے ثابت ہے اور میرے نزدیک صحیح بھی یہی ہے، یہ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے فرمایا۔",
          "fr": "Rapporté par Jabir : Alors que je montais un chameau lent et fatigué, le Prophète (ﷺ) est passé, il l’a frappé et a prié pour qu’Allah le bénisse. Le chameau est alors devenu plus rapide qu’il ne l’avait jamais été. Le Prophète (ﷺ) a ensuite dit : « Vends-le-moi pour une Uqiyya (d’or). » J’ai répondu : « Non. » Il a répété : « Vends-le-moi pour une Uqiyya (d’or). » Je l’ai vendu, en posant la condition de pouvoir le monter jusqu’à chez moi. Quand nous sommes arrivés à Médine, j’ai amené le chameau au Prophète (ﷺ) et il m’a donné son prix. Je suis rentré chez moi, mais il m’a fait appeler (et quand je suis venu) il m’a dit : « Je ne prendrai pas ton chameau. Prends-le, il est pour toi en cadeau. » (Diverses versions existent, précisant que Jabir avait le droit de monter le chameau vendu jusqu’à Médine)",
          "id": "Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Zakariya'] berkata aku mendengar ['Amir] berkata telah bercerita kepadaku [Jabir radliallahu 'anhu] bahwa dia bepergian dengan menunggang unta yang sudah lemah lalu Nabi shallallahu 'alaihi wasallam lewat di hadapannya dan memukul unta tersebut serta mendo'akannya maka unta itu berjalan tidak seperti biasanya kemudian Beliau berkata: \"Juallah kepadaku dengan empat puluh dirham\". Aku katakan \"Aku tidak mau\". Kemudian Beliau berkata lagi: \"Juallah kepadaku dengan empat puluh dirham\". Maka aku jual dengan syarat aku boleh menungganginya sampai aku pulang ke rumah keluargaku. Ketika kami telah sampai, aku berikan kepada Beliau unta tersebut dan Beliau memberiku uang pembayarannya lalu aku pergi. Namun Beliau mengikuti aku dan bersabda: \"Aku tidak akan mengambil untamu, ambillah untamu dan itu menjadi hartamu\". [Syu'bah] berkata dari [Mughirah] dari ['Amir] dari [Jabir]: \"Rasulullah shallallahu 'alaihi wasallam memberikan izin aku menungganginya sampai Madinah\". Dan berkata [Ishaq] dari [Jarir] dari [Mughirah]: \"Maka aku jual dengan syarat aku boleh menungganginya hingga aku tiba di Madinah\". [Atha`] dan selainnya berkata; \"kamu boleh menungganginya hingga Madinah\". [Muhammad bin Al Munkadir] berkata dari [Jabir] \"bahwa ia mensyaratkan untuk menungganginya hingga Madinah\", [Zaid bin Aslam] berkata dari [Jabir]: \"Dan kamu boleh menungganginya sampai kamu kembali\". Dan berkata [Abu Az Zubair] dari [Jabir]: \"Kami izinkan kamu menungganginya hingga tiba di Madinah\". Dan berkata [Al A'masy] dari [Salim] dari [Jabir]: \"Kamu gunakan hinga kamu bertemu keluargamu\". Dan berkata ['Ubaidullah] dan [Ibnu IShaq] dari [Wahb] dari [Jabir]: \"Nabi shallallahu 'alaihi wasallam membellinya dengan empat puluh dirham\". Dan hadits ini diikuti juga oleh [Zaid bin Aslam] dari [Jabir]. Dan berkata [Ibnu Juraij] dari ['Atha'] dan selainnya dari [Jabir]: \"Aku ambil pembayarannya seharga empat dinar\". Demikianlah bahwa nilai satu dinar sama dengan sepuluh dirham dan [Mughirah] tidak menerangkan harganya dari [Asy Sya'biy] dari [Jabir] dan [Ibnu Al Munkadir] dan [Abu Az Zubair] dari [Jabir]. Dan berkata [Al A'masy] dari [Salim] dari [Jabir]: \"Empat puluh uang emas\". Dan berkata [Abu Ishaq] dari [Salim] dari [Jabir]: \"Dengan dua ratus dirham\". Dan berkata [Daud bin Qais] dari ['Ubaidullah bin Miqsam] dari [Jabir]: \"Beliau membelinya di perjalanan Tabuk\". Aku menduga dia berkata: \"Empat awaq\". Dan berkata [Abu Nadhrah] dari [Jabir]: \"Beliau membelinya degan harga dua puluh dinar\". Dan perkataan Asy Sya'biy: 'Dengan empat puluh dirham\" lebih memenuhi syarat dan lebih shohih menurutku\". Ini perkataan Abu 'Abdullah Al Bukhariy",
          "tr": "Cabir r.a.'den nakledilmiştir: Cabir, devesinin sırtında gidiyordu. Devesi iyice yorulmuştu. Nebi Sallallahu Aleyhi ve Sellem ona rastladı ve eliyle vurdu. Deve (birden canlandı), öyle yürüyordu ki daha önce hiç öyle yürümemişti. Sonra \"Bunu bana bir ukkaya sat\" buyurdu. Ben de sattım ama eve kadar beni taşımasını şart koştum. Eve gelince deveyi ona getirdim ve parasını verdi. Sonra yanından ayrıldım. Peşimden birini göndererek \"Ben deveni alacak değilim. Al deveni. Bu senin malındır\" buyurdu. Şu'be, Cabir'in \"Allah Resulü Medine'ye kadar beni hayvanının sırtında taşıdı\" dediğini nakletmiştir. İshak, Cabir'in \"Medine'ye varıncaya kadar hayvanın sırtının bana ait olması şartıyla sattım\" dediğini nakletmiştir. Ata, Hz. Nebi'in \"(Bunu bana sat ama), Medine'ye kadar sırtı sana aittir\" (Medine'ye kadar binek olarak kullanabilirsin) buyurduğunu nakletmiştir. Muhammed İbn Münkedir, \"Medine'ye kadar devenin sırtını şart koştu\" diye nakletmiştir. Zeyd İbn Eslem, \"Dönünceye kadar sırtı sana aittir\" diye nakletmiştir. Ebü'z-Zübeyr, \"Medine'ye kadar sırtını sana veririz\" diye nakletmiştir. A'meş, \"Üzerinde ailene kadar varırsın\" diye nakletmiştir. Ebu Abdullah (Buhari), \"Cabir'in şart koşmuş olduğu yolundaki rivayetler daha çok ve bence daha sağlamdır\" demiştir. Hz. Nebi'in deveyi kaça satın aldığı konusunda da rivayetler farklı farklıdır. Kimine göre bir okka (40 dirhem), kimine göre dört dinardır. Dört dinar da dinarın on dirheme eşit olduğuna bakılırsa bir okka demektir. Bazı raviler miktar belirtmemiştir. Bazı raviler \"altın okka\" demişlerdir. Bazıları \"iki yüz dirhem\" demişlerdir. Davud İbn Kays Hz. Nebi'in bu deveyi Tebük yolunda satın aldığını söylemiş ve \"sanırım dört okkaya almıştı\" demiştir. Ebu Nadra \"Yirmi dinara satın aldı\" demiştir. Ancak Şa'bi'nin \"bir okkaya satın aldı\" rivayet 'i en yaygın rivayettir"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 7
      },
      "narrator": {
        "en": "Jabir"
      }
    },
    {
      "hadithNumber": 2719,
      "arabicNumber": 2719,
      "book": 54,
      "hadithInBook": 8,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَتِ الأَنْصَارُ لِلنَّبِيِّ صلى الله عليه وسلم اقْسِمْ بَيْنَنَا وَبَيْنَ إِخْوَانِنَا النَّخِيلَ‏.‏ قَالَ ‏ \"‏ لاَ ‏\"‏‏.‏ فَقَالَ تَكْفُونَا الْمَئُونَةَ وَنُشْرِكُكُمْ فِي الثَّمَرَةِ‏.‏ قَالُوا سَمِعْنَا وَأَطَعْنَا‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Ansar said to the Prophet, \"Divide our date-palms between us and our emigrant brothers.\" The Prophet said, \"No.\" The Ansar said to the emigrants, \"You may do the labor (in our gardens) and we will share the fruits with you.\" The emigrants said, \"We hear and obey",
          "ur": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی۔ ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ انصار رضوان اللہ علیہم نے نبی کریم صلی اللہ علیہ وسلم کے سامنے ( مؤاخات کے بعد ) یہ پیش کش کی کہ ہمارے کھجور کے باغات آپ ہم میں اور ہمارے بھائیوں ( مہاجرین ) میں تقسیم فرما دیں، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ اس پر انصار نے مہاجرین سے کہا کہ آپ لوگ ہمارے باغوں کے کام کر دیا کریں اور ہمارے ساتھ پھل میں شریک ہو جائیں، مہاجرین نے کہا کہ ہم نے سن لیا اور ہم ایسا ہی کریں گے۔",
          "fr": "Rapporté par Abu Huraira : Les Ansar ont dit au Prophète : « Partage nos palmiers-dattiers entre nous et nos frères émigrants. » Le Prophète a dit : « Non. » Les Ansar ont alors proposé aux émigrants : « Vous pouvez travailler dans nos jardins et nous partagerons les fruits avec vous. » Les émigrants ont répondu : « Nous écoutons et nous obéissons. »",
          "id": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah bercerita kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] berkata; Kaum Anshar berkata kepada Nabi shallallahu 'alaihi wasallam: \"Bagilah untuk kami dan saudara-saudara kami kebun kurma ini\". Beliau bersabda: \"Tidak\". Lalu Beliau bersabda: \"Kalian cukup memberikan kepada kami pekerjaan untuk mengurus kebun kurma tersebut lalu kami mendapat bagian dari hasil buahnya\". Mereka berkata: \"Kami dengar dan kami taat",
          "tr": "Ebu Hureyre r.a.'den nakledilmiştir: Medineli Müslümanlar Nebi Sallallahu Aleyhi ve Sellem'e \"Atları bizimle kardeşlerimiz arasında paylaştırsan\" dediler. Nebi Sallallahu Aleyhi ve Sellem: \"Olmaz\" buyurdu. Bunun üzerine onlar muhacirler \"Siz çalışmada bize yardım edersiniz. Biz de üründe sizi ortak kılarız\" dediler. Muhacirler onların bu teklifini kabul ederek \"İşittik ve itaat ettik\" dediler"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 8
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2720,
      "arabicNumber": 2720,
      "book": 54,
      "hadithInBook": 9,
      "text": {
        "arabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ الْيَهُودَ أَنْ يَعْمَلُوهَا وَيَزْرَعُوهَا، وَلَهُمْ شَطْرُ مَا يَخْرُجُ مِنْهَا‏.‏",
        "translations": {
          "en": "Narrated `Abdullah bin `Umar:Allah's Messenger (ﷺ) gave the land of Khaibar to the Jews on the condition that they would work on it and cultivate it and they would get half of its yield",
          "ur": "ہم سے موسیٰ نے بیان کیا، کہا ہم سے جویریہ بن اسماء نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کی زمین یہودیوں کو اس شرط پر دی تھی کہ اس میں کام کریں اور اسے بوئیں تو آدھی پیداوار انہیں دی جایا کرے گی۔",
          "fr": "Rapporté par `Abdullah bin `Umar : Le Messager d’Allah (ﷺ) a donné les terres de Khaybar aux Juifs à condition qu’ils les cultivent et qu’ils en reçoivent la moitié de la récolte",
          "id": "Telah bercerita kepada kami [Musa bin Isma'il] telah bercerita kepada kami [Juwairiyah bin Asma'] dari [nafi'] dari ['Abdullah bin 'Umar radliallahu 'anhuma] berkata; Rasulullah shallallahu 'alaihi wasallam memberikan tanah Khaibar kepada orang Yahudi agar dimanfaatkan dan dijadikan ladang pertanian dimana mereka mendapat separuh hasilnya",
          "tr": "Abdullah b. Ömer r.a.'den nakledilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem Hayber'deki tarlaları, çalışarak ekip dikmeleri ve çıkan ürünün yarısını almalarını şart koşarak Yahudilerin elinde bıraktı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 9
      },
      "narrator": {
        "en": "`Abdullah bin `Umar"
      }
    },
    {
      "hadithNumber": 2721,
      "arabicNumber": 2721,
      "book": 54,
      "hadithInBook": 10,
      "text": {
        "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَحَقُّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Uqba bin Amir:Allah's Messenger (ﷺ) said, \"From among all the conditions which you have to fulfill, the conditions which make it legal for you to have sexual relations (i.e. the marriage contract) have the greatest right to be fulfilled",
          "ur": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث نے بیان کیا، کہا کہ مجھ سے یزید بن ابی حبیب نے بیان کیا، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”وہ شرطیں جن کے ذریعہ تم نے عورتوں کی شرمگاہوں کو حلال کیا ہے، پوری کی جانے کی سب سے زیادہ مستحق ہیں۔“",
          "fr": "Rapporté par `Uqba bin Amir : Le Messager d’Allah (ﷺ) a dit : « Parmi toutes les conditions que vous devez respecter, celles qui rendent licite la relation conjugale (c’est-à-dire le contrat de mariage) sont celles qui méritent le plus d’être tenues. »",
          "id": "Telah bercerita kepada kami ['Abdullah binYusuf] telah bercerita kepada kami [Al Laits] berkata telah bercerita kepadaku [Yazid bin Abi Habib] dari [Abu Al Khoir] dari ['Uqbah bin 'AMir radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Syarat yang paling patut kalian tepati adalah syarat pernikahan",
          "tr": "Ukbe bin Amir (r.a.)'den nakledilmiştir: Allah Resulü (Sallallahu Aleyhi ve Sellem): \"Yerine getirmenize en layık şart, namusları kendinize helal kılmanızı sağlayan (evlilik sözleşmesinde koşulan) şartlardır\" buyurmuştur. Tekrar: 5151 Diğer tahric: Tirmizî, Nikah: 54; Nesâî, Nikah: 42 TEKRARINDA GENİŞ İZAH VAR! BURAYA TIKLA باب: الشروط في المزارعة. 7. EKİN ORTAKLIĞINDA KOŞULAN ŞARTLAR"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 10
      },
      "narrator": {
        "en": "`Uqba bin Amir"
      }
    },
    {
      "hadithNumber": 2722,
      "arabicNumber": 2722,
      "book": 54,
      "hadithInBook": 11,
      "text": {
        "arabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ حَنْظَلَةَ الزُّرَقِيَّ، قَالَ سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ ـ رضى الله عنه ـ يَقُولُ كُنَّا أَكْثَرَ الأَنْصَارِ حَقْلاً، فَكُنَّا نُكْرِي الأَرْضَ، فَرُبَّمَا أَخْرَجَتْ هَذِهِ وَلَمْ تُخْرِجْ ذِهِ، فَنُهِينَا عَنْ ذَلِكَ، وَلَمْ نُنْهَ عَنِ الْوَرِقِ‏.‏",
        "translations": {
          "en": "Narrated Rafi` bin Khadij:We used to work on the fields more than the other Ansar, and we used to rent the land (for the yield of a specific portion of it). But sometimes that portion or the rest of the land did not give any yield, so we were forbidden (by the Prophet (ﷺ) ) to follow such a system, but we were allowed to rent the land for money",
          "ur": "ہم سے مالک بن اسماعیل نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، کہا کہ میں نے حنظلہ زرقی سے سنا، انہوں نے کہا کہ میں نے رافع بن خدیج رضی اللہ عنہ سے سنا، آپ بیان کرتے تھے کہ ہم اکثر انصار کاشتکاری کیا کرتے تھے اور ہم زمین بٹائی پر دیتے تھے۔ اکثر ایسا ہوتا کہ کسی کھیت کے ایک ٹکڑے میں پیداوار ہوتی اور دوسرے میں نہ ہوتی، اس لیے ہمیں اس سے منع کر دیا گیا۔ لیکن چاندی ( روپے وغیرہ ) کے لگان سے منع نہیں کیا گیا۔",
          "fr": "Rapporté par Rafi` bin Khadij : Nous travaillions plus que les autres Ansar dans les champs, et nous louions la terre contre une partie de la récolte. Mais parfois cette partie, ou le reste du champ, ne donnait rien, alors le Prophète (ﷺ) nous a interdit ce système, mais il nous a permis de louer la terre contre de l’argent",
          "id": "Telah bercerita kepada kami [Malik bin Isma'il] telah bercerita kepada kami [Ibnu 'Uyainah] telah bercerita kepada kami [Yahya bin Sa'id] berkata aku mendengar [Hanzholah Az Zuraqiy] berkata aku mendengar [Rofi' bin Khodij radliallahu 'anhu] berkata: \"Kami adalah orang Anshor yang paling banyak memiliki kebun dan kami memperkerjakan orang untuk menggarap ladang dan apabila ada hasilnya penggarapnya mendapatkan bagian dan bila tidak maka tidak dapat bagian. Kemudian kami dilarang mempraktekkan ini namun kami tidak dilarang bila memberi upah dengan uang",
          "tr": "Rafi İbn Hadlc r.a.'den nakledilmiştir: Medineli Müslümanlar içinde en çok bizim tarlamız vardı ve biz, tarlalarımızı kiraya verirdik. (Kimilerimiz tarlasını kiraya verirken \"Şurası sana aittir, burası bana aittir\" diye şart koşardı ama bazen tarlanın bir kısmı ürün verirken kalan kısmı ürün vermeyebiliyordu. Böyle yapmamız yasaklandı. Ama gümüş karşılığı kiraya vermemiz yasaklanmadı. Not: Parantez içindeki ifade hadisin diğer rivayetlerinden alınmıştır. باب: ما لا يجوز من الشروط في النكاح 8. EVLİLİK SÖZLEŞMESİNDE KOŞULMASI CAİZ OLMAYAN ŞARTLAR)"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 11
      },
      "narrator": {
        "en": "Rafi` bin Khadij"
      }
    },
    {
      "hadithNumber": 2723,
      "arabicNumber": 2723,
      "book": 54,
      "hadithInBook": 12,
      "text": {
        "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ، وَلاَ تَنَاجَشُوا، وَلاَ يَزِيدَنَّ عَلَى بَيْعِ أَخِيهِ، وَلاَ يَخْطُبَنَّ عَلَى خِطْبَتِهِ، وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَسْتَكْفِئَ إِنَاءَهَا ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:The Prophet (ﷺ) said, \"No town-dweller should sell for a bedouin. Do not practice Najsh (i.e. Do not offer a high price for a thing which you do not want to buy, in order to deceive the people). No Muslim should offer more for a thing already bought by his Muslim brother, nor should he demand the hand of a girl already engaged to another Muslim. A Muslim woman shall not try to bring about The divorce of her sister (i.e. another Muslim woman) in order to take her place herself",
          "ur": "ہم سے مسدد نے بیان کیا، کہا ہم سے یزید بن زریع نے بیان کیا، ان سے معمر نے بیان کیا، ان سے زہری نے، ان سے سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کوئی شہری کسی دیہاتی کا مال تجارت نہ بیچے۔ کوئی شخص نجش نہ کرے اور نہ اپنے بھائی کی لگائی ہوئی قیمت پر بھاؤ بڑھائے۔ نہ کوئی شخص اپنے کسی بھائی کے پیغام نکاح کی موجودگی میں اپنا پیغام بھیجے اور نہ کوئی عورت ( کسی مرد سے ) اپنی بہن کی طلاق کا مطالبہ کرے ( جو اس مرد کے نکاح میں ہو ) تاکہ اس طرح اس کا حصہ بھی خود لے لے۔“",
          "fr": "Rapporté par Abu Huraira : Le Prophète (ﷺ) a dit : « Aucun citadin ne doit vendre pour un bédouin. Ne pratiquez pas le Najsh (c’est-à-dire ne proposez pas un prix élevé pour une chose que vous ne voulez pas acheter, dans le but de tromper les gens). Aucun musulman ne doit surenchérir sur un achat déjà fait par son frère musulman, ni demander la main d’une femme déjà fiancée à un autre musulman. Une femme musulmane ne doit pas chercher à provoquer le divorce de sa sœur (c’est-à-dire une autre musulmane) pour prendre sa place. »",
          "id": "Telah bercerita kepada kami [Musaddad] telah bercerita kepada kami [Yazid bin Zurai'] telah bercerita kepada kami [Ma'mar] dari [Az Zuhriy] dari [Sa'id] dari [Abu Hurairah radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah orang yang hadir (orang kota) membeli untuk yang tidak hadir (orang desa), dan janganlah seseorang menyewa malakukan najasy dan janganlah kalian melebihkan harga tawaran barang (yang sedang ditawar) saudaranya dan janganlah pula seseorang meminang (wanita) pinangan saudaranya dan janganlah seorang istri meminta suaminya menceraikan saudaranya (istri suaminya yang lain) demi untuk mencukupi periuknya",
          "tr": "Ebu Hureyre r.a.'den nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem \"Şehirli, köylünün adına satmasın (simsarlık yapmayın). Satış kızıştırmayın. Kardeşinizin alış fiyatını yükseltmeyin. Kardeşinizin talip olduğu kıza siz de talip olmayın. Bir kadın, kabını ağzına kadar doldurmak için kardeşinin (ortak olacağı kadının) boşanmasını istemesin\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 12
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2724,
      "arabicNumber": 2724,
      "book": 54,
      "hadithInBook": 13,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، رضى الله عنهم أَنَّهُمَا قَالاَ إِنَّ رَجُلاً مِنَ الأَعْرَابِ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولَ اللَّهِ أَنْشُدُكَ اللَّهَ إِلاَّ قَضَيْتَ لِي بِكِتَابِ اللَّهِ‏.‏ فَقَالَ الْخَصْمُ الآخَرُ وَهْوَ أَفْقَهُ مِنْهُ نَعَمْ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَائْذَنْ لِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُلْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا، فَزَنَى بِامْرَأَتِهِ، وَإِنِّي أُخْبِرْتُ أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَوَلِيدَةٍ، فَسَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّمَا عَلَى ابْنِي جَلْدُ مِائَةٍ، وَتَغْرِيبُ عَامٍ، وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، الْوَلِيدَةُ وَالْغَنَمُ رَدٌّ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، اغْدُ يَا أُنَيْسُ إِلَى امْرَأَةِ هَذَا فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ قَالَ فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ، فَأَمَرَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَتْ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:A bedouin came to Allah's Messenger (ﷺ) and said, \"O Allah's apostle! I ask you by Allah to judge My case according to Allah's Laws.\" His opponent, who was more learned than he, said, \"Yes, judge between us according to Allah's Laws, and allow me to speak.\" Allah's Messenger (ﷺ) said, \"Speak.\" He (i .e. the bedouin or the other man) said, \"My son was working as a laborer for this (man) and he committed illegal sexual intercourse with his wife. The people told me that it was obligatory that my son should be stoned to death, so in lieu of that I ransomed my son by paying one hundred sheep and a slave girl. Then I asked the religious scholars about it, and they informed me that my son must be lashed one hundred lashes, and be exiled for one year, and the wife of this (man) must be stoned to death.\" Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is, I will judge between you according to Allah's Laws. The slave-girl and the sheep are to be returned to you, your son is to receive a hundred lashes and be exiled for one year. You, Unais, go to the wife of this (man) and if she confesses her guilt, stone her to death.\" Unais went to that woman next morning and she confessed. Allah's Messenger (ﷺ) ordered that she be stoned to death",
          "fr": "Rapporté par Abu Huraira et Zaid bin Khalid Al-Juhani : Un bédouin est venu voir le Messager d’Allah (ﷺ) et a dit : « Ô Messager d’Allah ! Je te demande, par Allah, de juger mon cas selon les lois d’Allah. » Son adversaire, qui était plus instruit, a dit : « Oui, juge entre nous selon les lois d’Allah, et permets-moi de parler. » Le Messager d’Allah (ﷺ) a dit : « Parle. » Il (c’est-à-dire le bédouin ou l’autre homme) a dit : « Mon fils travaillait comme ouvrier pour cet homme et il a commis un acte illégal avec sa femme. Les gens m’ont dit qu’il devait être lapidé, alors j’ai racheté mon fils en donnant cent moutons et une esclave. Ensuite, j’ai demandé aux savants religieux, qui m’ont dit que mon fils devait recevoir cent coups de fouet et être exilé un an, et que la femme de cet homme devait être lapidée. » Le Messager d’Allah (ﷺ) a dit : « Par Celui qui détient mon âme, je jugerai entre vous selon les lois d’Allah. L’esclave et les moutons doivent te revenir, ton fils recevra cent coups de fouet et sera exilé un an. Toi, Unais, va voir la femme de cet homme et si elle avoue, lapide-la. » Unais est allé voir cette femme le lendemain matin, elle a avoué, et le Messager d’Allah (ﷺ) a ordonné qu’elle soit lapidée",
          "id": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Laits] dari [Ibnu Syihab] dari ['Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud] dari [Abu Hurairah] dan [Zaid bin Khalid] Al Juhaniy radliallahu 'anhuma bahwa keduanya berkata; Ada seorang warga Arab datang kepada Rasulullah shallallahu 'alaihi wasallam lalu berkata: \"Wahai Rasulullah, aku bersumpa atas nama Allah kepadamu, bahwa engkau tidak memutuskan perkara diantara kami melainkan dengan Kitab Allah. Lalu lawan yang tutur katanya lebih baik dari padanya berkata: \"Dia benar, putuskan perkara diantara kami dengan Kitab Allah dan perkenankanlah untukku\". Maka Rasululloh shallallahu 'alaihi wasallam besabda: \"Katakan\". Seorang warga Arab berkata: \"Sesunguhnya anakku adalah buruh yang bekerja pada orang ini lalu dia berzina dengan istrinya maka aku diberitahu bahwa anakku harus dirajam.. Kemudian aku tebus anakku dengan seratus ekor kambing dan seorang budak wanita kemudian aku bertanya kepada ahli ilmu lalu mereka memberitahu aku bahwa atas anakku cukup dicambuk seratus kali dan diasingkan selama setahun sedangkan untuk istri orang ini dirajam\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, sungguh aku akan putuskan buat kalian berdua dengan menggunakan Kitab Allah. Adapun seorang budak dan kambing seharusnya dikembalikan dan untuk anakmu dikenakan hukum cambuk sebanyak seratus kali dan diasingkan selama setahun. Adapun kamu, wahai Unais, besok pagi datangilah istri orang ini. Jika dia mengaku maka rajamlah\". Kemudian Unais mendatangi wanita itu dan dia mengakuinya. Maka Rasulullah shallallahu 'alaihi wasallam memerintahkan agar wanita itu dirajam",
          "tr": "Ebu Hureyre'den ve Zeyd İbn Halid el-Cüheni'den naklediImiştir: Bir bedevi Allah Resulü Sallallahu Aleyhi ve Sellem'e gelerek: \"Ey Allah'ın Resulü! Allah'a and veriyorum. Allah'ın Kitabı'yla benim için hüküm vereceksin\" dedi. Öteki şahıs -ki ilkinden daha anlayışlıydı- \"Evet, aramızda Allah'ın Kitabı'na göre hüküm ver ve müsaade et, sözümü söyleyeyim\" dedi. Allah Resulü Sallallahu Aleyhi ve Sellem \"Söyle\" buyurdu. Adam dedi ki: \"Oğlum bunun yanında işçiydi. Hanımıyla zina etmiş. Bana oğlumun recmedilmesi gerektiği haber verildi. Ben de onu kurtarmak için yüz koyun ve bir cariye verdim. Sonra bilenlere sordum. Onlar oğlumun cezasının yüz sopa ve bir yıl sürgün olduğunu, bunun karısının cezasının ise recmedilmek olduğunu söylediler.\" Allah Resulü Sallallahu Aleyhi ve Sellem \"Canım elinde olan'a yemin ederim ki, sizin aranızda Allah'ın Kitabı'na göre hükmedeceğim. Cariye ve yüz koyun sana geri verilecek. Oğluna yüz sopa vurulacak ve bir yıl sürgün edilecek\" buyurdu. Sonra \"Üneys! Şu adamın karısına yarın sabah git ve sor: İtiraf ederse onu recm et\" dedi. Uneys ertesi sabah kadının yanına gitti ve kadın zina ettiğini itiraf etti. Bunun üzerine kadın, Allah Resulü'nün emriyle recmedildi. Diğer tahric: Tirmizi Hudud; Müslim, Hudud"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 13
      },
      "narrator": {
        "en": "Abu Huraira and Zaid bin Khalid Al-Juhani"
      }
    },
    {
      "hadithNumber": 2726,
      "arabicNumber": 2726,
      "book": 54,
      "hadithInBook": 14,
      "text": {
        "arabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ الْمَكِّيُّ، عَنْ أَبِيهِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَتْ عَلَىَّ بَرِيرَةُ وَهْىَ مُكَاتَبَةٌ، فَقَالَتْ يَا أُمَّ الْمُؤْمِنِينَ اشْتَرِينِي فَإِنَّ أَهْلِي يَبِيعُونِي فَأَعْتِقِينِي قَالَتْ نَعَمْ‏.‏ قَالَتْ إِنَّ أَهْلِي لاَ يَبِيعُونِي حَتَّى يَشْتَرِطُوا وَلاَئِي‏.‏ قَالَتْ لاَ حَاجَةَ لِي فِيكِ‏.‏ فَسَمِعَ ذَلِكَ النَّبِيُّ صلى الله عليه وسلم أَوْ بَلَغَهُ، فَقَالَ ‏\"‏ مَا شَأْنُ بَرِيرَةَ فَقَالَ اشْتَرِيهَا فَأَعْتِقِيهَا وَلْيَشْتَرِطُوا مَا شَاءُوا ‏\"‏‏.‏ قَالَتْ فَاشْتَرَيْتُهَا فَأَعْتَقْتُهَا، وَاشْتَرَطَ أَهْلُهَا وَلاَءَهَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ، وَإِنِ اشْتَرَطُوا مِائَةَ شَرْطٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Aiman Al-Makki:When I visited Aisha she said, \"Barirah who had a written contract for her emancipation for a certain amount came to me and said, \"O mother of the believers! Buy me and manumit me, as my masters will sell me.\" Aisha agreed to it. Barirah said, 'My masters will sell me on the condition that my Wala will go to them.\" Aisha said to her, 'Then I am not in need of you.' The Prophet (ﷺ) heard of that or was told about it and so he asked Aisha, 'What is the problem of Barirah?' He said, 'Buy her and manumit her, no matter what they stipulate.' Aisha added, 'I bought and manumitted her, though her masters had stipulated that her Wala would be for them.' The Prophet (ﷺ) said, The Wala is for the liberator, even if the other stipulated a hundred conditions",
          "ur": "ہم سے خلاد بن یحییٰ نے بیان کیا، کہا ہم سے عبدالواحد بن ایمن مکی نے بیان کیا، ان سے ان کے باپ نے بیان کیا کہ میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو آپ نے بتلایا کہ بریرہ رضی اللہ عنہ میرے یہاں آئیں، انہوں نے کتابت کا معاملہ کر لیا تھا۔ مجھ سے کہنے لگیں کہ اے ام المؤمنین! مجھے آپ خرید لیں، کیونکہ میرے مالک مجھے بیچنے پر آمادہ ہیں، پھر آپ مجھے آزاد کر دینا۔ عائشہ رضی اللہ عنہا نے فرمایا کہ ہاں ( میں ایسا کر لوں گی ) لیکن بریرہ رضی اللہ عنہا نے پھر کہا کہ میرے مالک مجھے اسی وقت بیچیں گے جب وہ ولاء کی شرط اپنے لیے لگا لیں۔ اس پر عائشہ رضی اللہ عنہا نے فرمایا کہ پھر مجھے ضرورت نہیں ہے۔ جب نبی کریم صلی اللہ علیہ وسلم نے سنا، یا آپ صلی اللہ علیہ وسلم کو معلوم ہوا ( راوی کو شبہ تھا ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ بریرہ ( رضی اللہ عنہا ) کا کیا معاملہ ہے؟ تم انہیں خرید کر آزاد کر دو، وہ لوگ جو چاہیں شرط لگا لیں۔ عائشہ رضی اللہ عنہا نے کہا کہ میں نے بریرہ کو خرید کر آزاد کر دیا اور اس کے مالک نے ولاء کی شرط اپنے لیے محفوظ رکھی۔ آپ صلی اللہ علیہ وسلم نے یہی فرمایا کہ ولاء اسی کی ہوتی ہے جو آزاد کرے ( دوسرے ) جو چاہیں شرط لگاتے رہیں۔",
          "fr": "Rapporté par Aiman Al-Makki : Quand je suis allé voir Aisha, elle m’a dit : « Barirah, qui avait un contrat écrit pour son affranchissement contre une certaine somme, est venue me voir et a dit : “Ô mère des croyants ! Achète-moi et affranchis-moi, car mes maîtres veulent me vendre.” Aisha a accepté. Barirah a dit : ‘Mes maîtres veulent me vendre à condition que mon Wala leur revienne.’ Aisha lui a répondu : ‘Alors je n’ai pas besoin de toi.’ Le Prophète (ﷺ) a entendu parler de cela ou on le lui a rapporté, alors il a demandé à Aisha : ‘Quel est le problème avec Barirah ?’ Il a dit : ‘Achète-la et affranchis-la, peu importe ce qu’ils stipulent.’ Aisha a ajouté : ‘Je l’ai achetée et affranchie, même si ses maîtres avaient posé comme condition que son Wala serait pour eux.’ Le Prophète (ﷺ) a dit : « Le Wala revient à celui qui affranchit, même si l’autre pose cent conditions. »",
          "id": "Telah bercerita kepada kami [Khallad bin Yahya] telah bercerita kepada kami ['Abdul Wahid bin Aiman Al Makkiy] dari [bapaknya] berkata; Aku menemui ['Aisyah] radliallahu 'anha lalu dia berkata: \"Barirah pernah datang kepadaku sementara dia seorang budak mukatab, lalu berkata: \"Wahai Ummul Mu'minin, belilah aku karena tuanku akan menjualku, maka merdekakanlah aku\". 'Aisyah berkata: \"baiklah\". Barirah berkata: \"Sesungguhnya tuanku tidak akan menjualku kecuali dengan membuat persyaratan tentang perwalianku\". 'Aisyah berkata: \"Aku tidak ada keperluan dalam urusanmu itu\". Kemudian Nabi shallallahu 'alaihi wasallam mendengar hal ini atau sampai kabar hal ini kepada Beliau lalu Beliau bertanya: \"Ada apa dengan Bararah?\" Kemudian Beliau bersabda: \"Belilah dia lalu bebaskanlah dan biarkanlah mereka dengan persyaratan yang mereka buat sesuka mereka\". Maka 'Aisyah membelinya lalu membebaskannya sedangkan tuannya meminta perwaliannya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Perwalian menjadi milik orang yang membebaskannya sekalipun mereka membuat seratus persyaratam",
          "tr": "Abdülvahid İbn Eymen babasından nakletmiştir: Aişe'nin yanına girmiştim. Bana şöyle anlattı: Berire mükatep iken yanıma geldi ve \"Ey müminlerin annesi! Beni satın aL. Sahiplerim beni satacaklar. (Bari sen al da) beni azat ediver\" dedi. Hz. Aişe \"Olur\" dedi. Berire \"Ama sahiplerim beni ancak vela hakkım kendilerine ait olmak şartıyla satıyorlar\" dedi. Bunun üzerine Aişe \"Benim sana bir ihtiyacım yok\" dedi. Allah Resulü Sallallahu Aleyhi ve Sellem onun bu sözünü duydu ve \"Berire'yle ilgili durum nedir?\" diye sordu. (Durumu öğrendikten sonra) \"Sen onu satın al ve azat et. Onları da bırak diledikleri şartı koşsunlar\" buyurdu. Aişe diyor ki: Ben onu satın alıp azat ettim. Sahipleri de onun vela hakkının kendilerine ait olmasını şart koştular. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Vela hakkı, azat edene aittir. Onlar isterse yüz şart koşsunlar\" buyurdu. Not: Bu hadis \"Azat Etme\" konusunda ayrıntılı olarak açıklanmıştır. باب: الشروط في الطلاق. 11. BOŞAMADA KOŞULAN ŞARTLAR"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 14
      },
      "narrator": {
        "en": "Aiman Al-Makki"
      }
    },
    {
      "hadithNumber": 2727,
      "arabicNumber": 2727,
      "book": 54,
      "hadithInBook": 15,
      "text": {
        "arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّلَقِّي، وَأَنْ يَبْتَاعَ الْمُهَاجِرُ لِلأَعْرَابِيِّ، وَأَنْ تَشْتَرِطَ الْمَرْأَةُ طَلاَقَ أُخْتِهَا، وَأَنْ يَسْتَامَ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ، وَنَهَى عَنِ النَّجْشِ، وَعَنِ التَّصْرِيَةِ‏.‏ تَابَعَهُ مُعَاذٌ وَعَبْدُ الصَّمَدِ عَنْ شُعْبَةَ‏.‏ وَقَالَ غُنْدَرٌ وَعَبْدُ الرَّحْمَنِ نُهِيَ‏.‏ وَقَالَ آدَمُ نُهِينَا‏.‏ وَقَالَ النَّضْرُ وَحَجَّاجُ بْنُ مِنْهَالٍ نَهَى‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) forbade (1) the meeting of the caravan (of goods) on the way, (2) and that a residing person buys for a bedouin, (3) and that a woman stipulates the divorce of the wife of the would-be husband, (4) and that a man tries to cause the cancellation of a bargain concluded by another. He also forbade An-Najsh (see Hadith 824) and that one withholds the milk in the udder of the animal so that he may deceive people on selling it",
          "ur": "ہم سے محمد بن عرعرہ نے بیان کیا، کہا ہم سے شعبہ نے، ان سے عدی بن ثابت نے، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( تجارتی قافلوں کی ) پیشوائی سے منع فرمایا تھا اور اس سے بھی کہ کوئی شہری کسی دیہاتی کا سامان تجارت بیچے اور اس سے بھی کہ کوئی عورت اپنی ( دینی یا نسبی ) بہن کے طلاق کی شرط لگائے اور اس سے کہ کوئی اپنے کسی بھائی کے بھاؤ پر بھاؤ لگائے، اسی طرح آپ صلی اللہ علیہ وسلم نے نجش اور تصریہ سے بھی منع فرمایا۔ محمد بن عرعرہ کے ساتھ اس حدیث کو معاذ بن معاذ اور عبدالصمد بن عبدالوارث نے بھی شعبہ سے روایت کیا ہے اور غندر اور عبدالرحمٰن بن مہدی نے یوں کہا کہ ممانعت کی گئی تھی ( مجہول کے صیغے کے ساتھ ) آدم بن ابی ایاس نے یوں کہا کہ ہمیں منع کیا گیا تھا نضر اور حجاج بن منہال نے یوں کہا کہ منع کیا تھا ( رسول اللہ صلی اللہ علیہ وسلم نے ) ۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a interdit (1) d’aller à la rencontre des caravanes de marchandises sur la route, (2) qu’un résident achète pour un bédouin, (3) qu’une femme pose comme condition le divorce de l’épouse de celui qu’elle veut épouser, (4) qu’un homme tente d’annuler un marché conclu par un autre. Il a aussi interdit le Najsh (voir hadith 824) et de retenir le lait dans la mamelle d’un animal pour tromper les gens lors de la vente",
          "id": "Telah bercerita kepada kami [Muhammad bin 'Ar'arah] telah bercerita kepada kami [Syu'bah] dari ['Adiy binTsabit] dari [Abu Hazim] dari [Abu Hurairah radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam melarang mencegat pedagang (sebelum sampai di pasar) dan melarang pula orang kota membeli untuk orang desa dan melarang seorang istri meminta persyaratan agar suaminya menceraikan istrinya yang lain dan melarang seseorang melebihkan penawaran barang yang sedang ditawar saudaranya dan melarang pula dari najasy serta tashriyah. Hadits ini ditelusuri pula oleh [Mu'adz] dan ['Abdush Shomad] dari [Syu'bah]. Dan berkata [Ghundar] dan ['Abdur Rahman]: \"Dilarang\". Dan berkata [Adam]: \"Kami dilarang\", sedangkan [An Nadhar] dan [Hajjaj bin Minhal] berkata: \"Beliau melarang",
          "tr": "Ebu Hureyre r.a.'den nakledilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem şehre gelen köylüleri karşılamayı, şehirde oturanın bedevinin malını onun adına satmasını, bir kadının (evliliği kabul etmek için) kardeşinin boşanması şartını koşmasını veya kişinin kardeşinin pazarlığı üzerine pazarlık etmesini yasakladı. Müşteri kızıştırmayı ve satılık hayvanın sütünü sağmayıp memesinde biriktirmeyi de yasakladı. باب: الشروط مع الناس بالقول. 12. İNSANLARLA SÖZLÜ OLARAK BİR ŞARTTA ANLAŞMAK"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 15
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2728,
      "arabicNumber": 2728,
      "book": 54,
      "hadithInBook": 16,
      "text": {
        "arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ وَغَيْرُهُمَا قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ إِنَّا لَعِنْدَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مُوسَى رَسُولُ اللَّهِ ‏\"‏ فَذَكَرَ الْحَدِيثَ ‏{‏قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا‏}‏ كَانَتِ الأُولَى نِسْيَانًا، وَالْوُسْطَى شَرْطًا، وَالثَّالِثَةُ عَمْدًا ‏{‏قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا‏}‏‏.‏ ‏{‏لَقِيَا غُلاَمًا فَقَتَلَهُ‏}‏ فَانْطَلَقَا فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ‏.‏ قَرَأَهَا ابْنُ عَبَّاسٍ أَمَامَهُمْ مَلِكٌ‏.‏",
        "translations": {
          "en": "Narrated Ubai bin Ka`b:Allah's Messenger (ﷺ) said, \"Moses the Messenger of Allah,\" and then he narrated the whole story about him. Al-Khadir said to Moses, \"Did not I tell you that you can have no patience with me.\" (18.72). Moses then violated the agreement for the first time because of forgetfulness, then Moses promised that if he asked Al-Khadir about anything, the latter would have the right to desert him. Moses abided by that condition and on the third occasion he intentionally asked Al-Khadir and caused that condition to be applied. The three occasions referred to above are referred to by the following Verses: \"Call me not to account for forgetting And be not hard upon me.\" (18.73) \"Then they met a boy and Khadir killed him.\" (18.74) \"Then they proceeded and found a wall which was on the verge of falling and Khadir set it up straight",
          "ur": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا کہ ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے یعلیٰ بن مسلم اور عمرو بن دینار نے خبر دی سعید بن جبیر سے اور ان میں ایک دوسرے سے زیادہ بیان کرتا ہے، ابن جریج نے کہا مجھ سے یہ حدیث یعلیٰ اور عمرو کے سوا اوروں نے بھی بیان کی، وہ سعید بن جبیر سے روایت کرتے ہیں کہ ہم ابن عباس رضی اللہ عنہما کی خدمت میں حاضر تھے۔ انہوں نے کہا کہ مجھ سے ابی بن کعب رضی اللہ عنہ نے بیان کیا، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”خضر سے جو جا کر ملے تھے وہ موسیٰ علیہ السلام تھے۔“ پھر آخر تک حدیث بیان کی کہ خضر علیہ السلام نے موسیٰ علیہ السلام سے کہا کیا میں آپ کو پہلے ہی نہیں بتا چکا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے ( موسیٰ علیہ السلام کی طرف سے ) پہلا سوال تو بھول کر ہوا تھا، بیچ کا شرط کے طور پر اور تیسرا جان بوجھ کر ہوا تھا۔ آپ نے خضر سے کہا تھا کہ ”میں جس کو بھول گیا آپ اس میں مجھ سے مواخذہ نہ کیجئے اور نہ میرا کام مشکل بنائیے۔“ دونوں کو ایک لڑکا ملا جسے خضر علیہ السلام نے قتل کر دیا وہ وہ آگے بڑھے تو انہیں ایک دیوار ملی جو گرنے والی تھی لیکن خضر علیہ السلام نے اسے درست کر دیا۔ ابن عباس رضی اللہ عنہما نے «وراءهم ملك‏» «وراءهم‏» کے بجائے «أمامهم ملك‏.‏» پڑھا ہے۔",
          "fr": "Rapporté par Ubai bin Ka`b : Le Messager d’Allah (ﷺ) a dit : « Moïse, le Messager d’Allah, » puis il a raconté toute l’histoire à son sujet. Al-Khadir a dit à Moïse : « Ne t’ai-je pas dit que tu ne pourrais pas être patient avec moi ? » (18.72). Moïse a alors enfreint l’accord une première fois par oubli, puis il a promis que s’il interrogeait encore Al-Khadir, ce dernier aurait le droit de le quitter. Moïse a respecté cette condition et, à la troisième occasion, il a volontairement interrogé Al-Khadir, ce qui a entraîné l’application de la condition. Les trois occasions mentionnées sont évoquées dans les versets suivants : « Ne me tiens pas rigueur pour mon oubli et ne sois pas trop dur envers moi. » (18.73) « Puis ils rencontrèrent un garçon et Khadir le tua. » (18.74) « Ensuite ils continuèrent et trouvèrent un mur sur le point de s’effondrer, et Khadir le redressa. »",
          "id": "Telah bercerita kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Hisyam] bahwa [Ibnu Juraij] mengabarkan kepadanya, berkata telah bercerita kepadaku [Ya'laa bin Muslim] dan ['Amru bin Dinar] dari [Sa'id bin Jubair] dimana satu sama lain saling menambahkan dan begitu juga para perawi selain keduanya, sungguh aku pernah mendengarnya bercerita kepadanya dari [Sa'id bin Jubair] berkata; Kami sedang bermajelis dengan [Ibnu 'Abbas radliallahu 'anhuma] ia berkata, telah bercerita kepadaku [Ubay bin Ka'ab] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Musa Rasulullah Alaihis Salam, lalu dia menyebutkan hadits. Kisahnya dalam firman Allah Surah al-Kahfi; 72: (Nabi Hidzir AS berkata: \"Bukankah telah aku katakan bahwa kamu tidak akan sanngup untuk bersabar bersamaku\"). Pertanyaan dari Musa yang pertama adalah karena lupa, yang kedua syarat yang diajukannya sedangkan yang ketiga adalah kesengajaan. (Musa AS berkata: \"Janganlah kamu menghukum aku karena kelupaanku dan janganlah kamu membebani aku dengan sesuatu kesulitan dalam urusanku\"). -Al Kahfi; 73- (\"..hingga tatkala keduanya berjumpa dengan seorang anak.\") -Al Kahfi; 74- Lalu keduanya berjalan hingga mendapatkan (…dalam negeri itu dinding rumah yang hampir raboh..) -Al Kahfi; 77- Ibnu 'Abbas membacakannya; \"sedang didepan mereka ada seorang raja",
          "tr": "Abdullah İbn Abbas r.a.'dan nakledilmiştir: Bana Ubeyy İbn Ka'b şöyle söylemişti: Allah Resulü Sallallahu Aleyhi ve Sellem Musa Nebi'in kıssasını anlatıyordu. Adam (Hızır) \"Sen benimle birlikte olmaya dayanamazsın, dememiş miydim?\" [Kehf 67] dedi. İlki (gemi delme olayına itirazı) unutmaydı; ikincisi (çocuğu öldürmesine itiraz etmesi) şarttı (yani bu kez Musa \"Daha sana bir şey (sorarsam benden ayrıl\" [ Kehf 76] diyerek şart koşmuştu), üçüncüsü (yani duvarı ücret almadan yapmasına itiraz etmesi) de kasıttı. Musa \"Unuttuğum bir şeyle beni sorumlu tutma ve bana taşıyamayacağım yükü yükleme'' [Kehf 73] dedi. \"Bir çocukla karşılaşmışlardı da adam onu öldürmüştü. \"[Kehf 74] \"Yola devam ettiler.,. Yıkılmak üzere olan bir duvara rastladılar ve adam duvarı kaldırıverdi\".[Kehf 77] İbn Abbas bu ayetleri okudu. \"Önlerinde bir kral vardı.. \"[Kehf]"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 16
      },
      "narrator": {
        "en": "Ubai bin Ka`b"
      }
    },
    {
      "hadithNumber": 2729,
      "arabicNumber": 2729,
      "book": 54,
      "hadithInBook": 17,
      "text": {
        "arabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْنِي بَرِيرَةُ فَقَالَتْ كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ، فَأَعِينِينِي‏.‏ فَقَالَتْ إِنْ أَحَبُّوا أَنْ أَعُدَّهَا لَهُمْ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا، فَقَالَتْ لَهُمْ، فَأَبَوْا عَلَيْهَا، فَجَاءَتْ مِنْ عِنْدِهِمْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ، فَقَالَتْ إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ فَأَبَوْا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ‏.‏ فَسَمِعَ النَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَتْ عَائِشَةُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ خُذِيهَا وَاشْتَرِطِي لَهُمُ الْوَلاَءَ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ فَفَعَلَتْ عَائِشَةُ، ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، وَإِنْ كَانَ مِائَةَ شَرْطٍ، قَضَاءُ اللَّهِ أَحَقُّ، وَشَرْطُ اللَّهِ أَوْثَقُ، وَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Urwa:Aisha said, \"Barirah came to me and said, 'My people (masters) have written the contract for my emancipation for nine Awaq ) of gold) to be paid in yearly installments, one Uqiyya per year; so help me.\" Aisha said (to her), \"If your masters agree, I will pay them the whole sum provided the Wala will be for me.\" Barirah went to her masters and told them about it, but they refused the offer and she returned from them while Allah's Messenger (ﷺ) was sitting. She said, \"I presented the offer to them, but they refused unless the Wala' would be for them.\" When the Prophet (ﷺ) heard that and `Aisha told him about It, he said to her, \"Buy Barirah and let them stipulate that her Wala' will be for them, as the Wala' is for the manumitted.\" `Aisha did so. After that Allah's Messenger (ﷺ) got up amidst the people, Glorified and Praised Allah and said, \"What is wrong with some people who stipulate things which are not in Allah's Laws? Any condition which is not in Allah's Laws is invalid even if there were a hundred such conditions. Allah's Rules are the most valid and Allah's Conditions are the most solid. The Wala is for the manumitted",
          "ur": "ہم سے اسماعیل نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، انہوں نے ہشام بن عروہ سے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ میرے پاس بریرہ رضی اللہ عنہا آئیں اور کہنے لگیں کہ میں نے اپنے مالک سے نو اوقیہ چاندی پر مکاتبت کر لی ہے، ہر سال ایک اوقیہ دینا ہو گا۔ آپ بھی میری مدد کیجئے۔ عائشہ رضی اللہ عنہا نے فرمایا کہ اگر تمہارے مالک چاہیں تو میں ایک دم انہیں اتنی قیمت ادا کر سکتی ہوں۔ لیکن تمہاری ولاء میری ہو گی۔ بریرہ رضی اللہ عنہا اپنے مالکوں کے یہاں گئیں اور ان سے اس صورت کا ذکر کیا لیکن انہوں نے ولاء کے لیے انکار کیا۔ جب وہ ان کے یہاں سے واپس ہوئیں تو رسول اللہ صلی اللہ علیہ وسلم بھی تشریف فرما تھے۔ انہوں نے کہا کہ میں نے اپنے مالکوں کے سامنے یہ صورت رکھی تھی، لیکن وہ کہتے تھے کہ ولاء انہیں کی ہو گی۔ نبی کریم صلی اللہ علیہ وسلم نے بھی یہ بات سنی اور عائشہ رضی اللہ عنہا نے آپ صلی اللہ علیہ وسلم کو صورت حال سے آگاہ کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو انہیں خرید لے اور انہیں ولاء کی شرط لگانے دے۔ ولاء تو اسی کے ساتھ قائم ہو سکتی ہے جو آزاد کرے۔ چنانچہ عائشہ رضی اللہ عنہا نے ایسا ہی کیا پھر رسول اللہ صلی اللہ علیہ وسلم صحابہ میں گئے اور اللہ تعالیٰ کی حمد و ثناء کے بعد فرمایا کہ کچھ لوگوں کو کیا ہو گیا ہے کہ وہ ایسی شرطیں لگاتے ہیں جن کا کوئی پتہ ( سند، دلیل ) کتاب اللہ میں نہیں ہے ایسی کوئی بھی شرط جس کا پتہ ( سند، دلیل ) کتاب اللہ میں نہ ہو باطل ہے خواہ سو شرطیں کیوں نہ لگالی جائیں۔ اللہ کا فیصلہ ہی حق ہے اور اللہ کی شرطیں ہی پائیدار ہیں اور ولاء تو اسی کو ملے گی جو آزاد کرے گا۔",
          "fr": "Rapporté par `Urwa : Aisha a dit : « Barirah est venue me voir et m’a dit : “Mes maîtres ont écrit un contrat pour mon affranchissement contre neuf awaq d’or, à payer en versements annuels, une uqiyya par an ; aide-moi.” Aisha lui a répondu : “Si tes maîtres sont d’accord, je leur paierai la totalité à condition que le wala’ me revienne.” Barirah est allée voir ses maîtres pour leur transmettre la proposition, mais ils ont refusé et elle est revenue alors que le Messager d’Allah (ﷺ) était assis. Elle a dit : “Je leur ai présenté l’offre, mais ils ont refusé à moins que le wala’ ne soit pour eux.” Quand le Prophète (ﷺ) a entendu cela et qu’Aisha le lui a raconté, il lui a dit : “Achète Barirah et laisse-les poser comme condition que le wala’ soit pour eux, car le wala’ appartient à celui qui affranchit.” Aisha a fait ainsi. Ensuite, le Messager d’Allah (ﷺ) s’est levé devant les gens, a glorifié et loué Allah, puis a dit : “Qu’arrive-t-il à certains qui posent des conditions qui ne font pas partie des lois d’Allah ? Toute condition qui ne figure pas dans les lois d’Allah est nulle, même s’il y en avait cent. Les règles d’Allah sont les plus valables et Ses conditions sont les plus solides. Le wala’ revient à celui qui affranchit.” »",
          "id": "Telah bercerita kepada kami [Isma'il] telah bercerita kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah radliallahu 'anha] berkata: \"Barirah datang kepadaku seraya berkata: \"Aku telah menetapkan tebusan kepada Tuanku untuk kemerdekaan diriku dengan sembilan Awaq, dimana aku harus membayar satu uqiyah dalam setiap tahunnya, maka tolonglah aku\". Aku berkata: \"Jika tuanmu berkehendak aku akan bayar ketetapan tersebut kepada mereka sedangkan perwalianmu menjadi hakku\". Lalu aku penuhi. Kemudian Barirah pergi menemui tuannya dan menyampaikannya kepada mereka namun mereka menolaknya. Lalu dia datang setelah menemui mereka sementara Rasulullah shallallahu 'alaihi wasallam sedang duduk, seraya berkata: \"Sungguh aku sudah menawarkan hal itu kepada mereka namun mereka enggan menerimanya kecuali bila perwalian tetap menjadi hak mereka\". Nabi shallallahu 'alaihi wasallam mendengar hal ini lalu 'Aisyah mengabarkan kepada Nabi shallallahu 'alaihi wasallam, maka Beliau berkata: \"Ambillah dia (Barirah) dan berikan syarat perwalian kepada tuannya bahwa perwalian seorang budak adalah bagi yang memerdekakannya\". Maka 'Aisyah radliallahu 'anha melaksanakan perintah Beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri di hadapan manusia seraya memuji Allah dan mengagungkan-Nya kemudian bersabda: \"Bagaimana jadinya orang-orang itu, mereka membuat persyaratan dengan syarat-syarat yang tidak ada pada Kitab Allah. Apapun bentuknya syarat yang tidak sesuai dengan Kitab Allah maka syarat itu batal sekalipun seratus kali persyaratan. Ketetapan Allah lebih berhaq (untuk ditunaikan) dan syarat (yang ditetapkan) Allah lebih kuat. Sesungguhnya perwalian (seorang budak) adalah milik orang yang memerdekakannya",
          "tr": "Hz. Aişe'den nakledilmiştir: Berire bana gelerek \"Ben her yıl bir okka vermek üzere dokuz okka karşılığında sahiplerimle özgürlük anlaşması yaptım. Bana yardım eder misin ?\" dedi. Ben de \"Bu parayı onlara hazırlamam durumunda ve la hakkının bana ait olmasına razı olurlarsa yaparım\" dedim. Berire gidip sahiplerine bu şartımı iletti. Kabul etmediler. Onların yanından geldi. Allah Resulü Sallallahu Aleyhi ve Sellem oturuyordu. Dedi ki \"Bu teklifini onlara ilettim ama vela hakkının kendilerinde kalması konusunda ısrarcı oldular\" dedi. Ben de durumu Hz. Nebi'e bildirdim. Nebi Sallallahu Aleyhi ve Sellem \"Onu al ve onların vela hakkı şartını kabul et. Vela hakkı azat edene aittir\" buyurdu. Sonra Allah Resulü insanların arasında minbere çıkarak Allah'a hamd ü sena ettikten sonra \"Birilerine ne oluyor ki Allah'ın kitabında yeri olmayan şartlar koşuyorlar. Allah'ın kitabında yeri olmayan bütün şartlar geçersizdir, yüz şart bile olsa. Allah'ın hükmü uyulmaya daha layıktır. Allah'ın şartı daha sağlamdır. Vela hakkı azat edene aittir\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 17
      },
      "narrator": {
        "en": "`Urwa"
      }
    },
    {
      "hadithNumber": 2730,
      "arabicNumber": 2730,
      "book": 54,
      "hadithInBook": 18,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى أَبُو غَسَّانَ الْكِنَانِيُّ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا فَدَعَ أَهْلُ خَيْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَامَ عُمَرُ خَطِيبًا فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَامَلَ يَهُودَ خَيْبَرَ عَلَى أَمْوَالِهِمْ، وَقَالَ ‏\"‏ نُقِرُّكُمْ مَا أَقَرَّكُمُ اللَّهُ ‏\"‏‏.‏ وَإِنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ خَرَجَ إِلَى مَالِهِ هُنَاكَ فَعُدِيَ عَلَيْهِ مِنَ اللَّيْلِ، فَفُدِعَتْ يَدَاهُ وَرِجْلاَهُ، وَلَيْسَ لَنَا هُنَاكَ عَدُوٌّ غَيْرُهُمْ، هُمْ عَدُوُّنَا وَتُهَمَتُنَا، وَقَدْ رَأَيْتُ إِجْلاَءَهُمْ، فَلَمَّا أَجْمَعَ عُمَرُ عَلَى ذَلِكَ أَتَاهُ أَحَدُ بَنِي أَبِي الْحُقَيْقِ، فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ، أَتُخْرِجُنَا وَقَدْ أَقَرَّنَا مُحَمَّدٌ صلى الله عليه وسلم وَعَامَلَنَا عَلَى الأَمْوَالِ، وَشَرَطَ ذَلِكَ لَنَا فَقَالَ عُمَرُ أَظَنَنْتَ أَنِّي نَسِيتُ قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ بِكَ إِذَا أُخْرِجْتَ مِنْ خَيْبَرَ تَعْدُو بِكَ قَلُوصُكَ، لَيْلَةً بَعْدَ لَيْلَةٍ ‏\"‏‏.‏ فَقَالَ كَانَتْ هَذِهِ هُزَيْلَةً مِنْ أَبِي الْقَاسِمِ‏.‏ قَالَ كَذَبْتَ يَا عَدُوَّ اللَّهِ‏.‏ فَأَجْلاَهُمْ عُمَرُ وَأَعْطَاهُمْ قِيمَةَ مَا كَانَ لَهُمْ مِنَ الثَّمَرِ مَالاً وَإِبِلاً وَعُرُوضًا، مِنْ أَقْتَابٍ وَحِبَالٍ وَغَيْرِ ذَلِكَ‏.‏ رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ عُبَيْدِ اللَّهِ، أَحْسِبُهُ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، اخْتَصَرَهُ‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:When the people of Khaibar dislocated `Abdullah bin `Umar's hands and feet, `Umar got up delivering a sermon saying, \"No doubt, Allah's Messenger (ﷺ) made a contract with the Jews concerning their properties, and said to them, 'We allow you (to stand in your land) as long as Allah allows you.' Now `Abdullah bin `Umar went to his land and was attacked at night, and his hands and feet were dislocated, and as we have no enemies there except those Jews, they are our enemies and the only people whom we suspect, I have made up my mind to exile them.\" When `Umar decided to carry out his decision, a son of Abu Al-Huqaiq's came and addressed `Umar, \"O chief of the believers, will you exile us although Muhammad allowed us to stay at our places, and made a contract with us about our properties, and accepted the condition of our residence in our land?\" `Umar said, \"Do you think that I have forgotten the statement of Allah's Messenger (ﷺ), i.e.: What will your condition be when you are expelled from Khaibar and your camel will be carrying you night after night?\" The Jew replied, \"That was a joke from Abul-Qasim.\" `Umar said, \"O the enemy of Allah! You are telling a lie.\" `Umar then drove them out and paid them the price of their properties in the form of fruits, money, camel saddles and ropes, etc",
          "ur": "ہم سے ابواحمد مرار بن حمویہ نے بیان کیا ‘ کہا کہ ہم سے محمد بن یحییٰ ابوغسان کنانی نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی نافع سے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ جب ان کے ہاتھ پاؤں خیبر والوں نے توڑ ڈالے تو عمر رضی اللہ عنہ خطبہ دینے کے لیے کھڑے ہوئے ‘ آپ رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے جب خیبر کے یہودیوں سے ان کی جائیداد کا معاملہ کیا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب تک اللہ تعالیٰ تمہیں قائم رکھے ہم بھی قائم رکھیں گے اور عبداللہ بن عمر رضی اللہ عنہما وہاں اپنے اموال کے سلسلے میں گئے تو رات میں ان کے ساتھ مار پیٹ کا معاملہ کیا گیا جس سے ان کے پاؤں ٹوٹ گئے۔ خیبر میں ان کے سوا اور کوئی ہمارا دشمن نہیں ‘ وہی ہمارے دشمن ہیں اور انہیں پر ہمیں شبہ ہے اس لیے میں انہیں جلا وطن کر دینا ہی مناسب جانتا ہوں۔ جب عمر رضی اللہ عنہ نے اس کا پختہ ارادہ کر لیا تو بنو ابی حقیق ( ایک یہودی خاندان ) کا ایک شخص تھا ’ آیا اور کہا یا امیرالمؤمنین کیا آپ ہمیں جلا وطن کر دیں گے حالانکہ محمد صلی اللہ علیہ وسلم نے ہمیں یہاں باقی رکھا تھا اور ہم سے جائیداد کا ایک معاملہ بھی کیا تھا اور اس کی ہمیں خیبر میں رہنے دینے کی شرط بھی آپ نے لگائی تھی۔ عمر رضی اللہ عنہ نے اس پر فرمایا کیا تم یہ سمجھتے ہو کہ میں رسول اللہ صلی اللہ علیہ وسلم کا فرمان بھول گیا ہوں۔ جب رسول اللہ صلی اللہ علیہ وسلم نے کہا تھا کہ تمہارا کیا حال ہو گا جب تم خیبر سے نکالے جاؤ گے اور تمہارے اونٹ تمہیں راتوں رات لیے پھریں گے۔ اس نے کہا یہ ابوالقاسم ( آپ صلی اللہ علیہ وسلم ) کا ایک مذاق تھا۔ عمر رضی اللہ عنہ نے فرمایا: اللہ کے دشمن! تم نے جھوٹی بات کہی۔ چنانچہ عمر رضی اللہ عنہ نے انہیں شہر بدر کر دیا اور ان کے پھلوں کی کچھ نقد قیمت کچھ مال اور اونٹ اور دوسرے سامان یعنی کجاوے اور رسیوں کی صورت میں ادا کر دی۔ اس کی روایت حماد بن سلمہ نے عبیداللہ سے نقل کی ہے جیسا کہ مجھے یقین ہے نافع سے اور انہوں نے ابن عمر رضی اللہ عنہما سے اور انہوں نے عمر رضی اللہ عنہ سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے مختصر طور پر۔",
          "fr": "Rapporté par Ibn `Umar : Lorsque les gens de Khaybar ont démis de ses mains et de ses pieds `Abdullah ibn `Umar, `Umar s’est levé pour prononcer un sermon et a dit : « Il ne fait aucun doute que le Messager d’Allah (ﷺ) avait conclu un accord avec les Juifs concernant leurs biens, et leur avait dit : “Nous vous laissons dans votre terre tant qu’Allah le permettra.” Or, `Abdullah ibn `Umar s’est rendu sur sa terre et a été attaqué de nuit, ses mains et ses pieds ont été démis, et comme nous n’avons là-bas d’ennemis que ces Juifs, ce sont eux nos ennemis et les seuls que nous soupçonnons. J’ai donc décidé de les expulser.” Quand `Umar a pris sa décision, un fils d’Abu Al-Haqiq est venu s’adresser à lui : “Ô chef des croyants, vas-tu nous expulser alors que Muhammad nous a permis de rester sur nos terres, a conclu un accord avec nous sur nos biens et a accepté la condition de notre résidence sur notre terre ?” `Umar a répondu : “Penses-tu que j’ai oublié la parole du Messager d’Allah (ﷺ) : ‘Que ferez-vous quand vous serez expulsés de Khaybar et que votre chameau vous portera nuit après nuit ?’” Le Juif a répondu : “C’était une plaisanterie de la part d’Abul-Qasim.” `Umar a dit : “Ô ennemi d’Allah ! Tu mens.” Puis `Umar les a expulsés et leur a payé la valeur de leurs biens sous forme de fruits, d’argent, de selles de chameaux, de cordes, etc",
          "id": "Telah bercerita kepada kami [Abu Ahmad Marrar bin Hammuyah] telah bercerita kepada kami [Muhammad binYahya Abu Ghossan Al Kinaniy] telah mengabarkan kepada kami [Malik] dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] berkata: Ketika penduduk Khaibar membuat tangan 'Abdullah bin 'Umar radliallahu 'anhuma terkilir, ['Umar] berdiri menyampaikan khotbah lalu berkata: \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam dahulu membuat kesepakatan kerja dengan orang Yahudi Khaibar untuk mengerjakan harta mereka (lahan) dimana Beliau berkata: \"Kami tetapkan sebagaimana Allah menetapkannya atas kalian\". Dan bahwa pada suatu hari 'Abdullah bin 'Umar keluar untuk bekerja pada lahan miliknya disana lalu dia di malam hari diperlakukan secara kasar hingga tangan dan kakinya terkilir (bergeser dari sendinya) padahal disana kami tidak memiliki musuh selain mereka (penduduk Khaibar). Merekalah musuh kami dan pihak yang kami curigai dan aku sudah bertekad untuk mengusir mereka\". Ketika 'Umar sudah membulatkan tekadnya ada seorang dari suku Banu Abi Al Huqoiq yang datang kepadanya lalu berkata: 'Wahai amirul mu'minin, apakah anda akan mengusir kami padahal Muhammad shallallahu 'alaihi wasallam telah membuat perjanjian kerja dengan kami atas harta-harta (kebun) dan juga membuat persyaratan (pembagian hasil) tentangnya\". Maka 'Umar berkata: \"Apakah kamu menduga bahwa aku telah lupa dengan sabda Rasulullah shallallahu 'alaihi wasallam itu? Yaitu; \"Bagaimana kamu seandainya diusir dari Khaibar lalu unta betinamu membawamu lari malam demi malam?\" Orang itu berkata: \"Ini hanyalah gurauan dari Abu Al Qosim\". 'Umar berkata: \"Kamu berdusta wahai musuh Allah\". Maka 'Umar mengusir mereka dan memberi ganti harga buah-buahan yang menjadi hak mereka dengan uang, unta, barang-barang, pelana, tali kekang dan lainnya. Dan diriwayakan oleh [Hammad bin Salamah] dari ['Ubaidullah]; Aku menduga dari [Nafi'] dari [Ibnu 'Umar radliallahu 'anhuma] dari ['Umar] dari Nabi shallallahu 'alaihi wasallam yang diriwayatkannya secara singkat/ringkas",
          "tr": "Abdullah İbn Ömer r.a.'den nakledilmiştir: Hayber halkı Abdullah İbn Ömer'in elini ve ayağını kırınca Hz. Ömer şu konuşmayı yapmıştı: Allah Resulü Sallallahu Aleyhi ve Sellem Hayber Yahudileri ile malları karşılığında bir anlaşma yaparak \"Allah onları yerlerinde bıraktığı sürece biz de onları yerlerinde bırakırız\" buyurmuştu. Abdullah İbn Ömer oradaki hurmalığına gidince geceleyin saldırıya uğradı ve eli-ayağı kırıldı. Bizim orada onlardan başka düşmanımız yoktur. Bizim düşmanımız ve kuşkulandığımız kişiler onlardır. Ben onların sürgün edilmesi görüşündeyim, \" Ömer bu konuşmayı yapınca Ebu'l-Hukayk oğullarından biri gelerek \"Ey mu'minierin emiri! Muhammed, bizim burada kalmamıza müsaade edip mallarımız karşılığında bizimle anlaştığı ve bize bunu şart koştuğu halde sen bizi buradan çıkartacak mısın?\" dedi. Ömer \"Sen, Allah Resulü'nün \"Hayber'den çıkartıldığın zaman dişi deven .seni her gece oraya buraya koşturduğunda halin nice olacak!\" buyurduğunu unuttuğumu mu sanıyorsun?\" dedi. Adam \"Bu, Ebu'l-Kasım'ın (Muhammed'in) yaptığı küçük bir şakaydı\" dedi. Ömer \"Yalan söylüyorsun, Allah'ın düşmanı!\" dedi. Onları sürgün etti ve onlara sahip oldukları hurmaların değeri kadar mal, deve, deve palanı, ip vb. eşyalar verdi"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 18
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    },
    {
      "hadithNumber": 2732,
      "arabicNumber": 2732,
      "book": 54,
      "hadithInBook": 19,
      "text": {
        "arabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، قَالَ أَخْبَرَنِي الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، وَمَرْوَانَ، يُصَدِّقُ كُلُّ وَاحِدٍ مِنْهُمَا حَدِيثَ صَاحِبِهِ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَمَنَ الْحُدَيْبِيَةِ، حَتَّى كَانُوا بِبَعْضِ الطَّرِيقِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ خَالِدَ بْنَ الْوَلِيدِ بِالْغَمِيمِ فِي خَيْلٍ لِقُرَيْشٍ طَلِيعَةً فَخُذُوا ذَاتَ الْيَمِينِ ‏\"‏‏.‏ فَوَاللَّهِ مَا شَعَرَ بِهِمْ خَالِدٌ حَتَّى إِذَا هُمْ بِقَتَرَةِ الْجَيْشِ، فَانْطَلَقَ يَرْكُضُ نَذِيرًا لِقُرَيْشٍ، وَسَارَ النَّبِيُّ صلى الله عليه وسلم حَتَّى إِذَا كَانَ بِالثَّنِيَّةِ الَّتِي يُهْبَطُ عَلَيْهِمْ مِنْهَا، بَرَكَتْ بِهِ رَاحِلَتُهُ‏.‏ فَقَالَ النَّاسُ حَلْ حَلْ‏.‏ فَأَلَحَّتْ، فَقَالُوا خَلأَتِ الْقَصْوَاءُ، خَلأَتِ الْقَصْوَاءُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا خَلأَتِ الْقَصْوَاءُ، وَمَا ذَاكَ لَهَا بِخُلُقٍ، وَلَكِنْ حَبَسَهَا حَابِسُ الْفِيلِ، ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لاَ يَسْأَلُونِي خُطَّةً يُعَظِّمُونَ فِيهَا حُرُمَاتِ اللَّهِ إِلاَّ أَعْطَيْتُهُمْ إِيَّاهَا ‏\"‏‏.‏ ثُمَّ زَجَرَهَا فَوَثَبَتْ، قَالَ فَعَدَلَ عَنْهُمْ حَتَّى نَزَلَ بِأَقْصَى الْحُدَيْبِيَةِ، عَلَى ثَمَدٍ قَلِيلِ الْمَاءِ يَتَبَرَّضُهُ النَّاسُ تَبَرُّضًا، فَلَمْ يُلَبِّثْهُ النَّاسُ حَتَّى نَزَحُوهُ، وَشُكِيَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَطَشُ، فَانْتَزَعَ سَهْمًا مِنْ كِنَانَتِهِ، ثُمَّ أَمَرَهُمْ أَنْ يَجْعَلُوهُ فِيهِ، فَوَاللَّهِ مَا زَالَ يَجِيشُ لَهُمْ بِالرِّيِّ حَتَّى صَدَرُوا عَنْهُ، فَبَيْنَمَا هُمْ كَذَلِكَ، إِذْ جَاءَ بُدَيْلُ بْنُ وَرْقَاءَ الْخُزَاعِيُّ فِي نَفَرٍ مِنْ قَوْمِهِ مِنْ خُزَاعَةَ، وَكَانُوا عَيْبَةَ نُصْحِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ تِهَامَةَ، فَقَالَ إِنِّي تَرَكْتُ كَعْبَ بْنَ لُؤَىٍّ وَعَامِرَ بْنَ لُؤَىٍّ نَزَلُوا أَعْدَادَ مِيَاهِ الْحُدَيْبِيَةِ، وَمَعَهُمُ الْعُوذُ الْمَطَافِيلُ، وَهُمْ مُقَاتِلُوكَ وَصَادُّوكَ عَنِ الْبَيْتِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا لَمْ نَجِئْ لِقِتَالِ أَحَدٍ، وَلَكِنَّا جِئْنَا مُعْتَمِرِينَ، وَإِنَّ قُرَيْشًا قَدْ نَهِكَتْهُمُ الْحَرْبُ، وَأَضَرَّتْ بِهِمْ، فَإِنْ شَاءُوا مَادَدْتُهُمْ مُدَّةً، وَيُخَلُّوا بَيْنِي وَبَيْنَ النَّاسِ، فَإِنْ أَظْهَرْ فَإِنْ شَاءُوا أَنْ يَدْخُلُوا فِيمَا دَخَلَ فِيهِ النَّاسُ فَعَلُوا، وَإِلاَّ فَقَدْ جَمُّوا، وَإِنْ هُمْ أَبَوْا فَوَالَّذِي نَفْسِي بِيَدِهِ، لأُقَاتِلَنَّهُمْ عَلَى أَمْرِي هَذَا حَتَّى تَنْفَرِدَ سَالِفَتِي، وَلَيُنْفِذَنَّ اللَّهُ أَمْرَهُ ‏\"‏‏.‏ فَقَالَ بُدَيْلٌ سَأُبَلِّغُهُمْ مَا تَقُولُ‏.‏ قَالَ فَانْطَلَقَ حَتَّى أَتَى قُرَيْشًا قَالَ إِنَّا قَدْ جِئْنَاكُمْ مِنْ هَذَا الرَّجُلِ، وَسَمِعْنَاهُ يَقُولُ قَوْلاً، فَإِنْ شِئْتُمْ أَنْ نَعْرِضَهُ عَلَيْكُمْ فَعَلْنَا، فَقَالَ سُفَهَاؤُهُمْ لاَ حَاجَةَ لَنَا أَنْ تُخْبِرَنَا عَنْهُ بِشَىْءٍ‏.‏ وَقَالَ ذَوُو الرَّأْىِ مِنْهُمْ هَاتِ مَا سَمِعْتَهُ يَقُولُ‏.‏ قَالَ سَمِعْتُهُ يَقُولُ كَذَا وَكَذَا، فَحَدَّثَهُمْ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَقَامَ عُرْوَةُ بْنُ مَسْعُودٍ فَقَالَ أَىْ قَوْمِ أَلَسْتُمْ بِالْوَالِدِ قَالُوا بَلَى‏.‏ قَالَ أَوَلَسْتُ بِالْوَلَدِ قَالُوا بَلَى‏.‏ قَالَ فَهَلْ تَتَّهِمُونِي‏.‏ قَالُوا لاَ‏.‏ قَالَ أَلَسْتُمْ تَعْلَمُونَ أَنِّي اسْتَنْفَرْتُ أَهْلَ عُكَاظٍ، فَلَمَّا بَلَّحُوا عَلَىَّ جِئْتُكُمْ بِأَهْلِي وَوَلَدِي وَمَنْ أَطَاعَنِي قَالُوا بَلَى‏.‏ قَالَ فَإِنَّ هَذَا قَدْ عَرَضَ لَكُمْ خُطَّةَ رُشْدٍ، اقْبَلُوهَا وَدَعُونِي آتِهِ‏.‏ قَالُوا ائْتِهِ‏.‏ فَأَتَاهُ فَجَعَلَ يُكَلِّمُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم نَحْوًا مِنْ قَوْلِهِ لِبُدَيْلٍ، فَقَالَ عُرْوَةُ عِنْدَ ذَلِكَ أَىْ مُحَمَّدُ، أَرَأَيْتَ إِنِ اسْتَأْصَلْتَ أَمْرَ قَوْمِكَ هَلْ سَمِعْتَ بِأَحَدٍ مِنَ الْعَرَبِ اجْتَاحَ أَهْلَهُ قَبْلَكَ وَإِنْ تَكُنِ الأُخْرَى، فَإِنِّي وَاللَّهِ لأَرَى وُجُوهًا، وَإِنِّي لأَرَى أَوْشَابًا مِنَ النَّاسِ خَلِيقًا أَنْ يَفِرُّوا وَيَدَعُوكَ‏.‏ فَقَالَ لَهُ أَبُو بَكْرٍ امْصُصْ بَظْرَ اللاَّتِ، أَنَحْنُ نَفِرُّ عَنْهُ وَنَدَعُهُ فَقَالَ مَنْ ذَا قَالُوا أَبُو بَكْرٍ‏.‏ قَالَ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ يَدٌ كَانَتْ لَكَ عِنْدِي لَمْ أَجْزِكَ بِهَا لأَجَبْتُكَ‏.‏ قَالَ وَجَعَلَ يُكَلِّمُ النَّبِيَّ صلى الله عليه وسلم فَكُلَّمَا تَكَلَّمَ أَخَذَ بِلِحْيَتِهِ، وَالْمُغِيرَةُ بْنُ شُعْبَةَ قَائِمٌ عَلَى رَأْسِ النَّبِيِّ صلى الله عليه وسلم وَمَعَهُ السَّيْفُ وَعَلَيْهِ الْمِغْفَرُ، فَكُلَّمَا أَهْوَى عُرْوَةُ بِيَدِهِ إِلَى لِحْيَةِ النَّبِيِّ صلى الله عليه وسلم ضَرَبَ يَدَهُ بِنَعْلِ السَّيْفِ، وَقَالَ لَهُ أَخِّرْ يَدَكَ عَنْ لِحْيَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَرَفَعَ عُرْوَةُ رَأْسَهُ فَقَالَ مَنْ هَذَا قَالُوا الْمُغِيرَةُ بْنُ شُعْبَةَ‏.‏ فَقَالَ أَىْ غُدَرُ، أَلَسْتُ أَسْعَى فِي غَدْرَتِكَ وَكَانَ الْمُغِيرَةُ صَحِبَ قَوْمًا فِي الْجَاهِلِيَّةِ، فَقَتَلَهُمْ، وَأَخَذَ أَمْوَالَهُمْ، ثُمَّ جَاءَ فَأَسْلَمَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَّا الإِسْلاَمَ فَأَقْبَلُ، وَأَمَّا الْمَالَ فَلَسْتُ مِنْهُ فِي شَىْءٍ ‏\"‏‏.‏ ثُمَّ إِنَّ عُرْوَةَ جَعَلَ يَرْمُقُ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم بِعَيْنَيْهِ‏.‏ قَالَ فَوَاللَّهِ مَا تَنَخَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم نُخَامَةً إِلاَّ وَقَعَتْ فِي كَفِّ رَجُلٍ مِنْهُمْ فَدَلَكَ بِهَا وَجْهَهُ وَجِلْدَهُ، وَإِذَا أَمَرَهُمُ ابْتَدَرُوا أَمْرَهُ، وَإِذَا تَوَضَّأَ كَادُوا يَقْتَتِلُونَ عَلَى وَضُوئِهِ، وَإِذَا تَكَلَّمَ خَفَضُوا أَصْوَاتَهُمْ عِنْدَهُ، وَمَا يُحِدُّونَ إِلَيْهِ النَّظَرَ تَعْظِيمًا لَهُ، فَرَجَعَ عُرْوَةُ إِلَى أَصْحَابِهِ، فَقَالَ أَىْ قَوْمِ، وَاللَّهِ لَقَدْ وَفَدْتُ عَلَى الْمُلُوكِ، وَوَفَدْتُ عَلَى قَيْصَرَ وَكِسْرَى وَالنَّجَاشِيِّ وَاللَّهِ إِنْ رَأَيْتُ مَلِكًا قَطُّ، يُعَظِّمُهُ أَصْحَابُهُ مَا يُعَظِّمُ أَصْحَابُ مُحَمَّدٍ صلى الله عليه وسلم مُحَمَّدًا، وَاللَّهِ إِنْ تَنَخَّمَ نُخَامَةً إِلاَّ وَقَعَتْ فِي كَفِّ رَجُلٍ مِنْهُمْ، فَدَلَكَ بِهَا وَجْهَهُ وَجِلْدَهُ، وَإِذَا أَمَرَهُمُ ابْتَدَرُوا أَمْرَهُ وَإِذَا تَوَضَّأَ كَادُوا يَقْتَتِلُونَ عَلَى وَضُوئِهِ، وَإِذَا تَكَلَّمَ خَفَضُوا أَصْوَاتَهُمْ عِنْدَهُ، وَمَا يُحِدُّونَ إِلَيْهِ النَّظَرَ تَعْظِيمًا لَهُ، وَإِنَّهُ قَدْ عَرَضَ عَلَيْكُمْ خُطَّةَ رُشْدٍ، فَاقْبَلُوهَا‏.‏ فَقَالَ رَجُلٌ مِنْ بَنِي كِنَانَةَ دَعُونِي آتِهِ‏.‏ فَقَالُوا ائْتِهِ‏.‏ فَلَمَّا أَشْرَفَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَأَصْحَابِهِ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا فُلاَنٌ، وَهْوَ مِنْ قَوْمٍ يُعَظِّمُونَ الْبُدْنَ فَابْعَثُوهَا لَهُ ‏\"‏‏.‏ فَبُعِثَتْ لَهُ وَاسْتَقْبَلَهُ النَّاسُ يُلَبُّونَ، فَلَمَّا رَأَى ذَلِكَ قَالَ سُبْحَانَ اللَّهِ مَا يَنْبَغِي لِهَؤُلاَءِ أَنْ يُصَدُّوا عَنِ الْبَيْتِ، فَلَمَّا رَجَعَ إِلَى أَصْحَابِهِ قَالَ رَأَيْتُ الْبُدْنَ قَدْ قُلِّدَتْ وَأُشْعِرَتْ، فَمَا أَرَى أَنْ يُصَدُّوا عَنِ الْبَيْتِ‏.‏ فَقَامَ رَجُلٌ مِنْهُمْ يُقَالُ لَهُ مِكْرَزُ بْنُ حَفْصٍ‏.‏ فَقَالَ دَعُونِي آتِهِ‏.‏ فَقَالُوا ائْتِهِ‏.‏ فَلَمَّا أَشْرَفَ عَلَيْهِمْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَذَا مِكْرَزٌ وَهْوَ رَجُلٌ فَاجِرٌ ‏\"‏‏.‏ فَجَعَلَ يُكَلِّمُ النَّبِيَّ صلى الله عليه وسلم، فَبَيْنَمَا هُوَ يُكَلِّمُهُ إِذْ جَاءَ سُهَيْلُ بْنُ عَمْرٍو‏.‏ قَالَ مَعْمَرٌ فَأَخْبَرَنِي أَيُّوبُ عَنْ عِكْرِمَةَ، أَنَّهُ لَمَّا جَاءَ سُهَيْلُ بْنُ عَمْرٍو قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَقَدْ سَهُلَ لَكُمْ مِنْ أَمْرِكُمْ ‏\"‏‏.‏ قَالَ مَعْمَرٌ قَالَ الزُّهْرِيُّ فِي حَدِيثِهِ فَجَاءَ سُهَيْلُ بْنُ عَمْرٍو فَقَالَ هَاتِ، اكْتُبْ بَيْنَنَا وَبَيْنَكُمْ كِتَابًا، فَدَعَا النَّبِيُّ صلى الله عليه وسلم الْكَاتِبَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ‏\"‏‏.‏ قَالَ سُهَيْلٌ أَمَّا الرَّحْمَنُ فَوَاللَّهِ مَا أَدْرِي مَا هُوَ وَلَكِنِ اكْتُبْ بِاسْمِكَ اللَّهُمَّ‏.‏ كَمَا كُنْتَ تَكْتُبُ‏.‏ فَقَالَ الْمُسْلِمُونَ وَاللَّهِ لاَ نَكْتُبُهَا إِلاَّ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اكْتُبْ بِاسْمِكَ اللَّهُمَّ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ ‏\"‏‏.‏ فَقَالَ سُهَيْلٌ وَاللَّهِ لَوْ كُنَّا نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ مَا صَدَدْنَاكَ عَنِ الْبَيْتِ وَلاَ قَاتَلْنَاكَ، وَلَكِنِ اكْتُبْ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَاللَّهِ إِنِّي لَرَسُولُ اللَّهِ وَإِنْ كَذَّبْتُمُونِي‏.‏ اكْتُبْ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ‏\"‏‏.‏ قَالَ الزُّهْرِيُّ وَذَلِكَ لِقَوْلِهِ ‏\"‏ لاَ يَسْأَلُونِي خُطَّةً يُعَظِّمُونَ فِيهَا حُرُمَاتِ اللَّهِ إِلاَّ أَعْطَيْتُهُمْ إِيَّاهَا ‏\"‏‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى أَنْ تُخَلُّوا بَيْنَنَا وَبَيْنَ الْبَيْتِ فَنَطُوفَ بِهِ ‏\"‏‏.‏ فَقَالَ سُهَيْلٌ وَاللَّهِ لاَ تَتَحَدَّثُ الْعَرَبُ أَنَّا أُخِذْنَا ضُغْطَةً وَلَكِنْ ذَلِكَ مِنَ الْعَامِ الْمُقْبِلِ فَكَتَبَ‏.‏ فَقَالَ سُهَيْلٌ وَعَلَى أَنَّهُ لاَ يَأْتِيكَ مِنَّا رَجُلٌ، وَإِنْ كَانَ عَلَى دِينِكَ، إِلاَّ رَدَدْتَهُ إِلَيْنَا‏.‏ قَالَ الْمُسْلِمُونَ سُبْحَانَ اللَّهِ كَيْفَ يُرَدُّ إِلَى الْمُشْرِكِينَ وَقَدْ جَاءَ مُسْلِمًا فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ دَخَلَ أَبُو جَنْدَلِ بْنُ سُهَيْلِ بْنِ عَمْرٍو يَرْسُفُ فِي قُيُودِهِ، وَقَدْ خَرَجَ مِنْ أَسْفَلِ مَكَّةَ، حَتَّى رَمَى بِنَفْسِهِ بَيْنَ أَظْهُرِ الْمُسْلِمِينَ‏.‏ فَقَالَ سُهَيْلٌ هَذَا يَا مُحَمَّدُ أَوَّلُ مَا أُقَاضِيكَ عَلَيْهِ أَنْ تَرُدَّهُ إِلَىَّ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّا لَمْ نَقْضِ الْكِتَابَ بَعْدُ ‏\"‏‏.‏ قَالَ فَوَاللَّهِ إِذًا لَمْ أُصَالِحْكَ عَلَى شَىْءٍ أَبَدًا‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَأَجِزْهُ لِي ‏\"‏‏.‏ قَالَ مَا أَنَا بِمُجِيزِهِ لَكَ‏.‏ قَالَ ‏\"‏ بَلَى، فَافْعَلْ ‏\"‏‏.‏ قَالَ مَا أَنَا بِفَاعِلٍ‏.‏ قَالَ مِكْرَزٌ بَلْ قَدْ أَجَزْنَاهُ لَكَ‏.‏ قَالَ أَبُو جَنْدَلٍ أَىْ مَعْشَرَ الْمُسْلِمِينَ، أُرَدُّ إِلَى الْمُشْرِكِينَ وَقَدْ جِئْتُ مُسْلِمًا أَلاَ تَرَوْنَ مَا قَدْ لَقِيتُ وَكَانَ قَدْ عُذِّبَ عَذَابًا شَدِيدًا فِي اللَّهِ‏.‏ قَالَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ فَأَتَيْتُ نَبِيَّ اللَّهِ صلى الله عليه وسلم فَقُلْتُ أَلَسْتَ نَبِيَّ اللَّهِ حَقًّا قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ قُلْتُ أَلَسْنَا عَلَى الْحَقِّ وَعَدُوُّنَا عَلَى الْبَاطِلِ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ قُلْتُ فَلِمَ نُعْطِي الدَّنِيَّةَ فِي دِينِنَا إِذًا قَالَ ‏\"‏ إِنِّي رَسُولُ اللَّهِ، وَلَسْتُ أَعْصِيهِ وَهْوَ نَاصِرِي ‏\"‏‏.‏ قُلْتُ أَوَلَيْسَ كُنْتَ تُحَدِّثُنَا أَنَّا سَنَأْتِي الْبَيْتَ فَنَطُوفُ بِهِ قَالَ ‏\"‏ بَلَى، فَأَخْبَرْتُكَ أَنَّا نَأْتِيهِ الْعَامَ ‏\"‏‏.‏ قَالَ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ فَإِنَّكَ آتِيهِ وَمُطَّوِّفٌ بِهِ ‏\"‏‏.‏ قَالَ فَأَتَيْتُ أَبَا بَكْرٍ فَقُلْتُ يَا أَبَا بَكْرٍ، أَلَيْسَ هَذَا نَبِيَّ اللَّهِ حَقًّا قَالَ بَلَى‏.‏ قُلْتُ أَلَسْنَا عَلَى الْحَقِّ وَعَدُوُّنَا عَلَى الْبَاطِلِ قَالَ بَلَى‏.‏ قُلْتُ فَلِمَ نُعْطِي الدَّنِيَّةَ فِي دِينِنَا إِذًا قَالَ أَيُّهَا الرَّجُلُ، إِنَّهُ لَرَسُولُ اللَّهِ صلى الله عليه وسلم وَلَيْسَ يَعْصِي رَبَّهُ وَهْوَ نَاصِرُهُ، فَاسْتَمْسِكْ بِغَرْزِهِ، فَوَاللَّهِ إِنَّهُ عَلَى الْحَقِّ‏.‏ قُلْتُ أَلَيْسَ كَانَ يُحَدِّثُنَا أَنَّا سَنَأْتِي الْبَيْتَ وَنَطُوفُ بِهِ قَالَ بَلَى، أَفَأَخْبَرَكَ أَنَّكَ تَأْتِيهِ الْعَامَ قُلْتُ لاَ‏.‏ قَالَ فَإِنَّكَ آتِيهِ وَمُطَّوِّفٌ بِهِ‏.‏ قَالَ الزُّهْرِيِّ قَالَ عُمَرُ فَعَمِلْتُ لِذَلِكَ أَعْمَالاً‏.‏ قَالَ فَلَمَّا فَرَغَ مِنْ قَضِيَّةِ الْكِتَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ قُومُوا فَانْحَرُوا، ثُمَّ احْلِقُوا ‏\"‏‏.‏ قَالَ فَوَاللَّهِ مَا قَامَ مِنْهُمْ رَجُلٌ حَتَّى قَالَ ذَلِكَ ثَلاَثَ مَرَّاتٍ، فَلَمَّا لَمْ يَقُمْ مِنْهُمْ أَحَدٌ دَخَلَ عَلَى أُمِّ سَلَمَةَ، فَذَكَرَ لَهَا مَا لَقِيَ مِنَ النَّاسِ‏.‏ فَقَالَتْ أُمُّ سَلَمَةَ يَا نَبِيَّ اللَّهِ، أَتُحِبُّ ذَلِكَ اخْرُجْ ثُمَّ لاَ تُكَلِّمْ أَحَدًا مِنْهُمْ كَلِمَةً حَتَّى تَنْحَرَ بُدْنَكَ، وَتَدْعُوَ حَالِقَكَ فَيَحْلِقَكَ‏.‏ فَخَرَجَ فَلَمْ يُكَلِّمْ أَحَدًا مِنْهُمْ، حَتَّى فَعَلَ ذَلِكَ نَحَرَ بُدْنَهُ، وَدَعَا حَالِقَهُ فَحَلَقَهُ‏.‏ فَلَمَّا رَأَوْا ذَلِكَ، قَامُوا فَنَحَرُوا، وَجَعَلَ بَعْضُهُمْ يَحْلِقُ بَعْضًا، حَتَّى كَادَ بَعْضُهُمْ يَقْتُلُ بَعْضًا غَمًّا، ثُمَّ جَاءَهُ نِسْوَةٌ مُؤْمِنَاتٌ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ‏}‏ حَتَّى بَلَغَ ‏{‏بِعِصَمِ الْكَوَافِرِ‏}‏ فَطَلَّقَ عُمَرُ يَوْمَئِذٍ امْرَأَتَيْنِ كَانَتَا لَهُ فِي الشِّرْكِ، فَتَزَوَّجَ إِحْدَاهُمَا مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ، وَالأُخْرَى صَفْوَانُ بْنُ أُمَيَّةَ، ثُمَّ رَجَعَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ، فَجَاءَهُ أَبُو بَصِيرٍ ـ رَجُلٌ مِنْ قُرَيْشٍ ـ وَهْوَ مُسْلِمٌ فَأَرْسَلُوا فِي طَلَبِهِ رَجُلَيْنِ، فَقَالُوا الْعَهْدَ الَّذِي جَعَلْتَ لَنَا‏.‏ فَدَفَعَهُ إِلَى الرَّجُلَيْنِ، فَخَرَجَا بِهِ حَتَّى بَلَغَا ذَا الْحُلَيْفَةِ، فَنَزَلُوا يَأْكُلُونَ مِنْ تَمْرٍ لَهُمْ، فَقَالَ أَبُو بَصِيرٍ لأَحَدِ الرَّجُلَيْنِ وَاللَّهِ إِنِّي لأَرَى سَيْفَكَ هَذَا يَا فُلاَنُ جَيِّدًا‏.‏ فَاسْتَلَّهُ الآخَرُ فَقَالَ أَجَلْ، وَاللَّهِ إِنَّهُ لَجَيِّدٌ، لَقَدْ جَرَّبْتُ بِهِ ثُمَّ جَرَّبْتُ‏.‏ فَقَالَ أَبُو بَصِيرٍ أَرِنِي أَنْظُرْ إِلَيْهِ، فَأَمْكَنَهُ مِنْهُ، فَضَرَبَهُ حَتَّى بَرَدَ، وَفَرَّ الآخَرُ، حَتَّى أَتَى الْمَدِينَةَ، فَدَخَلَ الْمَسْجِدَ يَعْدُو‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ رَآهُ ‏\"‏ لَقَدْ رَأَى هَذَا ذُعْرًا ‏\"‏‏.‏ فَلَمَّا انْتَهَى إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ قُتِلَ وَاللَّهِ صَاحِبِي وَإِنِّي لَمَقْتُولٌ، فَجَاءَ أَبُو بَصِيرٍ فَقَالَ يَا نَبِيَّ اللَّهِ، قَدْ وَاللَّهِ أَوْفَى اللَّهُ ذِمَّتَكَ، قَدْ رَدَدْتَنِي إِلَيْهِمْ ثُمَّ أَنْجَانِي اللَّهُ مِنْهُمْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَيْلُ أُمِّهِ مِسْعَرَ حَرْبٍ، لَوْ كَانَ لَهُ أَحَدٌ ‏\"‏‏.‏ فَلَمَّا سَمِعَ ذَلِكَ عَرَفَ أَنَّهُ سَيَرُدُّهُ إِلَيْهِمْ، فَخَرَجَ حَتَّى أَتَى سِيفَ الْبَحْرِ‏.‏ قَالَ وَيَنْفَلِتُ مِنْهُمْ أَبُو جَنْدَلِ بْنُ سُهَيْلٍ، فَلَحِقَ بِأَبِي بَصِيرٍ، فَجَعَلَ لاَ يَخْرُجُ مِنْ قُرَيْشٍ رَجُلٌ قَدْ أَسْلَمَ إِلاَّ لَحِقَ بِأَبِي بَصِيرٍ، حَتَّى اجْتَمَعَتْ مِنْهُمْ عِصَابَةٌ، فَوَاللَّهِ مَا يَسْمَعُونَ بِعِيرٍ خَرَجَتْ لِقُرَيْشٍ إِلَى الشَّأْمِ إِلاَّ اعْتَرَضُوا لَهَا، فَقَتَلُوهُمْ، وَأَخَذُوا أَمْوَالَهُمْ، فَأَرْسَلَتْ قُرَيْشٌ إِلَى النَّبِيِّ صلى الله عليه وسلم تُنَاشِدُهُ بِاللَّهِ وَالرَّحِمِ لَمَّا أَرْسَلَ، فَمَنْ أَتَاهُ فَهْوَ آمِنٌ، فَأَرْسَلَ النَّبِيُّ صلى الله عليه وسلم إِلَيْهِمْ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ‏}‏ حَتَّى بَلَغَ ‏{‏الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ‏}‏ وَكَانَتْ حَمِيَّتُهُمْ أَنَّهُمْ لَمْ يُقِرُّوا أَنَّهُ نَبِيُّ اللَّهِ، وَلَمْ يُقِرُّوا بِبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، وَحَالُوا بَيْنَهُمْ وَبَيْنَ الْبَيْتِ‏.‏",
        "translations": {
          "en": "Narrated Al-Miswar bin Makhrama and Marwan:(whose narrations attest each other) Allah's Messenger (ﷺ) set out at the time of Al-Hudaibiya (treaty), and when they proceeded for a distance, he said, \"Khalid bin Al-Walid leading the cavalry of Quraish constituting the front of the army, is at a place called Al-Ghamim, so take the way on the right.\" By Allah, Khalid did not perceive the arrival of the Muslims till the dust arising from the march of the Muslim army reached him, and then he turned back hurriedly to inform Quraish. The Prophet (ﷺ) went on advancing till he reached the Thaniya (i.e. a mountainous way) through which one would go to them (i.e. people of Quraish). The she-camel of the Prophet (ﷺ) sat down. The people tried their best to cause the she-camel to get up but in vain, so they said, \"Al-Qaswa' (i.e. the she-camel's name) has become stubborn! Al-Qaswa' has become stubborn!\" The Prophet (ﷺ) said, \"Al-Qaswa' has not become stubborn, for stubbornness is not her habit, but she was stopped by Him Who stopped the elephant.\" Then he said, \"By the Name of Him in Whose Hands my soul is, if they (i.e. the Quraish infidels) ask me anything which will respect the ordinances of Allah, I will grant it to them.\" The Prophet (ﷺ) then rebuked the she-camel and she got up. The Prophet (ﷺ) changed his way till he dismounted at the farthest end of Al-Hudaibiya at a pit (i.e. well) containing a little water which the people used in small amounts, and in a short while the people used up all its water and complained to Allah's Messenger (ﷺ); of thirst. The Prophet (ﷺ) took an arrow out of his arrow-case and ordered them to put the arrow in that pit. By Allah, the water started and continued sprouting out till all the people quenched their thirst and returned with satisfaction. While they were still in that state, Budail bin Warqa-al-Khuza`i came with some persons from his tribe Khuza`a and they were the advisers of Allah's Messenger (ﷺ) who would keep no secret from him and were from the people of Tihama. Budail said, \"I left Ka`b bin Luai and 'Amir bin Luai residing at the profuse water of Al-Hudaibiya and they had milch camels (or their women and children) with them, and will wage war against you, and will prevent you from visiting the Ka`ba.\" Allah's Messenger (ﷺ) said, \"We have not come to fight anyone, but to perform the `Umra. No doubt, the war has weakened Quraish and they have suffered great losses, so if they wish, I will conclude a truce with them, during which they should refrain from interfering between me and the people (i.e. the 'Arab infidels other than Quraish), and if I have victory over those infidels, Quraish will have the option to embrace Islam as the other people do, if they wish; they will at least get strong enough to fight. But if they do not accept the truce, by Allah in Whose Hands my life is, I will fight with them defending my Cause till I get killed, but (I am sure) Allah will definitely make His Cause victorious.\" Budail said, \"I will inform them of what you have said.\" So, he set off till he reached Quraish and said, \"We have come from that man (i.e. Muhammad) whom we heard saying something which we will disclose to you if you should like.\" Some of the fools among Quraish shouted that they were not in need of this information, but the wiser among them said, \"Relate what you heard him saying.\" Budail said, \"I heard him saying so-and-so,\" relating what the Prophet (ﷺ) had told him. `Urwa bin Mas`ud got up and said, \"O people! Aren't you the sons? They said, \"Yes.\" He added, \"Am I not the father?\" They said, \"Yes.\" He said, \"Do you mistrust me?\" They said, \"No.\" He said, \"Don't you know that I invited the people of `Ukaz for your help, and when they refused I brought my relatives and children and those who obeyed me (to help you)?\" They said, \"Yes.\" He said, \"Well, this man (i.e. the Prophet) has offered you a reasonable proposal, you'd better accept it and allow me to meet him.\" They said, \"You may meet him.\" So, he went to the Prophet (ﷺ) and started talking to him. The Prophet (ﷺ) told him almost the same as he had told Budail. Then `Urwa said, \"O Muhammad! Won't you feel any scruple in extirpating your relations? Have you ever heard of anyone amongst the Arabs extirpating his relatives before you? On the other hand, if the reverse should happen, (nobody will aid you, for) by Allah, I do not see (with you) dignified people, but people from various tribes who would run away leaving you alone.\" Hearing that, Abu Bakr abused him and said, \"Do you say we would run and leave the Prophet (ﷺ) alone?\" `Urwa said, \"Who is that man?\" They said, \"He is Abu Bakr.\" `Urwa said to Abu Bakr, \"By Him in Whose Hands my life is, were it not for the favor which you did to me and which I did not compensate, I would retort on you.\" `Urwa kept on talking to the Prophet (ﷺ) and seizing the Prophet's beard as he was talking while Al-Mughira bin Shu`ba was standing near the head of the Prophet, holding a sword and wearing a helmet. Whenever `Urwa stretched his hand towards the beard of the Prophet, Al-Mughira would hit his hand with the handle of the sword and say (to `Urwa), \"Remove your hand from the beard of Allah's Messenger (ﷺ).\" `Urwa raised his head and asked, \"Who is that?\" The people said, \"He is Al-Mughira bin Shu`ba.\" `Urwa said, \"O treacherous! Am I not doing my best to prevent evil consequences of your treachery?\" Before embracing Islam Al-Mughira was in the company of some people. He killed them and took their property and came (to Medina) to embrace Islam. The Prophet (ﷺ) said (to him, \"As regards your Islam, I accept it, but as for the property I do not take anything of it. (As it was taken through treason). `Urwa then started looking at the Companions of the Prophet. By Allah, whenever Allah's Messenger (ﷺ) spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it on his face and skin; if he ordered them they would carry his orders immediately; if he performed ablution, they would struggle to take the remaining water; and when they spoke to him, they would lower their voices and would not look at his face constantly out of respect. `Urwa returned to his people and said, \"O people! By Allah, I have been to the kings and to Caesar, Khosrau and An- Najashi, yet I have never seen any of them respected by his courtiers as much as Muhammad is respected by his companions. By Allah, if he spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it on his face and skin; if he ordered them, they would carry out his order immediately; if he performed ablution, they would struggle to take the remaining water; and when they spoke, they would lower their voices and would not look at his face constantly out of respect.\" `Urwa added, \"No doubt, he has presented to you a good reasonable offer, so please accept it.\" A man from the tribe of Bani Kinana said, \"Allow me to go to him,\" and they allowed him, and when he approached the Prophet and his companions, Allah's Messenger (ﷺ) said, \"He is so-and-so who belongs to the tribe that respects the Budn (i.e. camels of the sacrifice). So, bring the Budn in front of him.\" So, the Budn were brought before him and the people received him while they were reciting Talbiya. When he saw that scene, he said, \"Glorified be Allah! It is not fair to prevent these people from visiting the Ka`ba.\" When he returned to his people, he said, 'I saw the Budn garlanded (with colored knotted ropes) and marked (with stabs on their backs). I do not think it is advisable to prevent them from visiting the Ka`ba.\" Another person called Mikraz bin Hafs got up and sought their permission to go to Muhammad, and they allowed him, too. When he approached the Muslims, the Prophet (ﷺ) said, \"Here is Mikraz and he is a vicious man.\" Mikraz started talking to the Prophet and as he was talking, Suhail bin `Amr came. When Suhail bin `Amr came, the Prophet (ﷺ) said, \"Now the matter has become easy.\" Suhail said to the Prophet \"Please conclude a peace treaty with us.\" So, the Prophet (ﷺ) called the clerk and said to him, \"Write: By the Name of Allah, the most Beneficent, the most Merciful.\" Suhail said, \"As for 'Beneficent,' by Allah, I do not know what it means. So write: By Your Name O Allah, as you used to write previously.\" The Muslims said, \"By Allah, we will not write except: By the Name of Allah, the most Beneficent, the most Merciful.\" The Prophet (ﷺ) said, \"Write: By Your Name O Allah.\" Then he dictated, \"This is the peace treaty which Muhammad, Allah's Messenger (ﷺ) has concluded.\" Suhail said, \"By Allah, if we knew that you are Allah's Messenger (ﷺ) we would not prevent you from visiting the Ka`ba, and would not fight with you. So, write: \"Muhammad bin `Abdullah.\" The Prophet (ﷺ) said, \"By Allah! I am the Apostle of Allah even if you people do not believe me. Write: Muhammad bin `Abdullah.\" (Az-Zuhri said, \"The Prophet (ﷺ) accepted all those things, as he had already said that he would accept everything they would demand if it respects the ordinance of Allah, (i.e. by letting him and his companions perform `Umra.)\") The Prophet (ﷺ) said to Suhail, \"On the condition that you allow us to visit the House (i.e. Ka`ba) so that we may perform Tawaf around it.\" Suhail said, \"By Allah, we will not (allow you this year) so as not to give chance to the 'Arabs to say that we have yielded to you, but we will allow you next year.\" So, the Prophet (ﷺ) got that written. Then Suhail said, \"We also stipulate that you should return to us whoever comes to you from us, even if he embraced your religion.\" The Muslims said, \"Glorified be Allah! How will such a person be returned to the pagans after he has become a Muslim? While they were in this state Abu Jandal bin Suhail bin `Amr came from the valley of Mecca staggering with his fetters and fell down amongst the Muslims. Suhail said, \"O Muhammad! This is the very first term with which we make peace with you, i.e. you shall return Abu Jandal to me.\" The Prophet (ﷺ) said, \"The peace treaty has not been written yet.\" Suhail said, \"I will never allow you to keep him.\" The Prophet (ﷺ) said, \"Yes, do.\" He said, \"I won't do.: Mikraz said, \"We allow you (to keep him).\" Abu Jandal said, \"O Muslims! Will I be returned to the pagans though I have come as a Muslim? Don't you see how much I have suffered?\" Abu Jandal had been tortured severely for the Cause of Allah. `Umar bin Al-Khattab said, \"I went to the Prophet (ﷺ) and said, 'Aren't you truly the Messenger of Allah?' The Prophet (ﷺ) said, 'Yes, indeed.' I said, 'Isn't our Cause just and the cause of the enemy unjust?' He said, 'Yes.' I said, 'Then why should we be humble in our religion?' He said, 'I am Allah's Messenger (ﷺ) and I do not disobey Him, and He will make me victorious.' I said, 'Didn't you tell us that we would go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did I tell you that we would visit the Ka`ba this year?' I said, 'No.' He said, 'So you will visit it and perform Tawaf around it.' \" `Umar further said, \"I went to Abu Bakr and said, 'O Abu Bakr! Isn't he truly Allah's Prophet?' He replied, 'Yes.' I said, 'Then why should we be humble in our religion?' He said, 'Indeed, he is Allah's Messenger (ﷺ) and he does not disobey his Lord, and He will make him victorious. Adhere to him as, by Allah, he is on the right.' I said, 'Was he not telling us that we would go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did he tell you that you would go to the Ka`ba this year?' I said, 'No.' He said, \"You will go to Ka`ba and perform Tawaf around it.\" (Az-Zuhri said, \" `Umar said, 'I performed many good deeds as expiation for the improper questions I asked them.' \") When the writing of the peace treaty was concluded, Allah's Messenger (ﷺ) said to his companions, \"Get up and' slaughter your sacrifices and get your head shaved.\" By Allah none of them got up, and the Prophet repeated his order thrice. When none of them got up, he left them and went to Um Salama and told her of the people's attitudes towards him. Um Salama said, \"O the Prophet of Allah (ﷺ)! Do you want your order to be carried out? Go out and don't say a word to anybody till you have slaughtered your sacrifice and call your barber to shave your head.\" So, the Prophet (ﷺ) went out and did not talk to anyone of them till he did that, i.e. slaughtered the sacrifice and called his barber who shaved his head. Seeing that, the companions of the Prophet (ﷺ) got up, slaughtered their sacrifices, and started shaving the heads of one another, and there was so much rush that there was a danger of killing each other. Then some believing women came (to the Prophet (ﷺ) ); and Allah revealed the following Divine Verses:-- \"O you who believe, when the believing women come to you as emigrants examine them . . .\" (60.10) `Umar then divorced two wives of his who were infidels. Later on Muawiya bin Abu Sufyan married one of them, and Safwan bin Umaiya married the other. When the Prophet (ﷺ) returned to Medina, Abu Basir, a new Muslim convert from Quraish came to him. The Infidels sent in his pursuit two men who said (to the Prophet (ﷺ) ), \"Abide by the promise you gave us.\" So, the Prophet (ﷺ) handed him over to them. They took him out (of the City) till they reached Dhul-Hulaifa where they dismounted to eat some dates they had with them. Abu Basir said to one of them, \"By Allah, O so-and-so, I see you have a fine sword.\" The other drew it out (of the scabbard) and said, \"By Allah, it is very fine and I have tried it many times.\" Abu Basir said, \"Let me have a look at it.\" When the other gave it to him, he hit him with it till he died, and his companion ran away till he came to Medina and entered the Mosque running. When Allah's Messenger (ﷺ) saw him he said, \"This man appears to have been frightened.\" When he reached the Prophet (ﷺ) he said, \"My companion has been murdered and I would have been murdered too.\" Abu Basir came and said, \"O Allah's Messenger (ﷺ), by Allah, Allah has made you fulfill your obligations by your returning me to them (i.e. the Infidels), but Allah has saved me from them.\" The Prophet (ﷺ) said, \"Woe to his mother! what excellent war kindler he would be, should he only have supporters.\" When Abu Basir heard that he understood that the Prophet (ﷺ) would return him to them again, so he set off till he reached the seashore. Abu Jandal bin Suhail got himself released from them (i.e. infidels) and joined Abu Basir. So, whenever a man from Quraish embraced Islam he would follow Abu Basir till they formed a strong group. By Allah, whenever they heard about a caravan of Quraish heading towards Sham, they stopped it and attacked and killed them (i.e. infidels) and took their properties. The people of Quraish sent a message to the Prophet (ﷺ) requesting him for the Sake of Allah and Kith and kin to send for (i.e. Abu Basir and his companions) promising that whoever (amongst them) came to the Prophet (ﷺ) would be secure. So the Prophet (ﷺ) sent for them (i.e. Abu Basir's companions) and Allah revealed the following Divine Verses: \"And it is He Who Has withheld their hands from you and your hands From them in the midst of Mecca, After He made you the victorious over them. ... the unbelievers had pride and haughtiness, in their hearts ... the pride and haughtiness of the time of ignorance.\" (48.24-26) And their pride and haughtiness was that they did not confess (write in the treaty) that he (i.e. Muhammad) was the Prophet of Allah and refused to write: \"In the Name of Allah, the most Beneficent, the Most Merciful,\" and they (the mushriks) prevented them (the Muslims) from visiting the House (the Ka`bah)",
          "ur": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا مجھ کو معمر نے خبر دی ‘ کہا کہ مجھے زہری نے خبر دی ‘ کہا مجھے عروہ بن زبیر نے خبر دی اور ان سے مسور بن مخرمہ رضی اللہ عنہ اور مروان نے ‘ دونوں کے بیان سے ایک دوسرے کی حدیث کی تصدیق بھی ہوتی ہے۔ انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم صلح حدیبیہ کے موقع پر ( مکہ ) جا رہے تھے ‘ ابھی آپ صلی اللہ علیہ وسلم راستے ہی میں تھے ‘ فرمایا خالد بن ولید قریش کے ( دو سو ) سواروں کے ساتھ ہماری نقل و حرکت کا اندازہ لگانے کے لیے مقام غمیم میں مقیم ہے ( یہ قریش کا مقدمۃ الجیش ہے ) اس لیے تم لوگ داہنی طرف سے جاؤ ‘ پس اللہ کی قسم خالد کو ان کے متعلق کچھ بھی علم نہ ہو سکا اور جب انہوں نے اس لشکر کا غبار اٹھتا ہوا دیکھا تو قریش کو جلدی جلدی خبر دینے گئے۔ ادھر نبی کریم صلی اللہ علیہ وسلم چلتے رہے یہاں تک کہ آپ صلی اللہ علیہ وسلم اس گھاٹی پر پہنچے جس سے مکہ میں اترتے ہیں تو آپ صلی اللہ علیہ وسلم کی سواری بیٹھ گئی۔ صحابہ اونٹنی کو اٹھانے کیلئے حل حل کہنے لگے لیکن وہ اپنی جگہ سے نہ اٹھی۔ صحابہ رضی اللہ عنہم نے کہا کہ قصواء اڑ گئی آپ صلی اللہ علیہ وسلم نے فرمایا قصواء اڑی نہیں اور نہ یہ اس کی عادت ہے ‘ اسے تو اس ذات نے روک لیا جس نے ہاتھیوں ( کے لشکر ) کو ( مکہ ) میں داخل ہونے سے روک لیا تھا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے قریش جو بھی ایسا مطالبہ رکھیں گے جس میں اللہ کی محرمات کی بڑائی ہو تو میں اس کا مطالبہ منظور کر لوں گا۔ آخر آپ صلی اللہ علیہ وسلم نے اونٹنی کو ڈانٹا تو وہ اٹھ گئی۔ راوی نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم صحابہ سے آگے نکل گئے اور حدیبیہ کے آخری کنارے ثمد ( ایک چشمہ یا گڑھا ) پر جہاں پانی کم تھا، آپ صلی اللہ علیہ وسلم نے پڑاؤ کیا۔ لوگ تھوڑا تھوڑا پانی استعمال کرنے لگے، انہوں نے پانی کو ٹھہرنے ہی نہیں دیا، سب کھینچ ڈالا۔ اب رسول اللہ صلی اللہ علیہ وسلم سے پیاس کی شکایت کی گئی تو آپ صلی اللہ علیہ وسلم نے اپنے ترکش میں سے ایک تیر نکال کر دیا کہ اس گڑھے میں ڈال دیں بخدا تیر گاڑتے ہی پانی انہیں سیراب کرنے کے لیے ابلنے لگا اور وہ لوگ پوری طرح سیراب ہو گئے۔ لوگ اسی حال میں تھے کہ بدیل بن ورقاء خزاعی رضی اللہ عنہ اپنی قوم خزاعہ کے کئی آدمیوں کو لے کر حاضر ہوا۔ یہ لوگ تہامہ کے رہنے والے تھے اور رسول اللہ صلی اللہ علیہ وسلم کے محرم راز بڑے خیرخواہ تھے۔ انہوں نے خبر دی کہ میں کعب بن لوئی اور عامر بن لوئی کو پیچھے چھوڑ کر آ رہا ہوں۔ جنہوں نے حدیبیہ کے پانی کے ذخیروں پر اپنا پڑاؤ ڈال دیا ہے ‘ ان کے ساتھ بکثرت دودھ دینے والی اونٹنیاں اپنے نئے نئے بچوں کے ساتھ ہیں۔ وہ آپ سے لڑیں گے اور آپ کے بیت اللہ پہنچنے میں رکاوٹ بنیں گے۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا ہم کسی سے لڑنے نہیں آئے ہیں صرف عمرہ کے ارادے سے آئے ہیں اور واقعہ تو یہ ہے ( مسلسل لڑائیوں ) نے قریش کو بھی کمزور کر دیا ہے اور انہیں بڑا نقصان اٹھانا پڑا ہے ‘ اب اگر وہ چاہیں تو میں ایک مدت ان سے صلح کا معاہدہ کر لوں گا ‘ اس عرصہ میں وہ میرے اور عوام ( کفار مشرکین عرب ) کے درمیان نہ پڑیں پھر اگر میں کامیاب ہو جاؤں اور ( اس کے بعد ) وہ چاہیں تو اس دین ( اسلام ) میں وہ بھی داخل ہو سکتے ہیں ( جس میں اور تمام لوگ داخل ہو چکے ہوں گے ) لیکن اگر مجھے کامیابی نہیں ہوئی تو انہیں بھی آرام مل جائے گا اور اگر انہیں میری پیش کش سے انکار ہے تو اس ذات کی قسم جس کے ہاتھ میں میری جان ہے جب تک میرا سر تن سے جدا نہیں ہو جاتا، میں اس دین کے لیے برابر لڑتا رہوں گا یا پھر اللہ تعالیٰ اسے نافذ ہی فرما دے گا۔ بدیل رضی اللہ عنہ نے کہا کہ قریش تک آپ کی گفتگو میں پہچاؤں گا چنانچہ وہ واپس ہوئے اور قریش کے یہاں پہنچے اور کہا کہ ہم تمہارے پاس اس شخص ( نبی کریم صلی اللہ علیہ وسلم ) کے یہاں سے آ رہے ہیں اور ہم نے اسے ایک بات کہتے سنا ہے ‘ اگر تم چاہو تو تمہارے سامنے اسے بیان کر سکتے ہیں۔ قریش کے بے وقوفوں نے کہا کہ ہمیں اس کی ضرورت نہیں کہ تم اس شخص کی کوئی بات ہمیں سناؤ۔ جو لوگ صائب الرائے تھے ‘ انہوں نے کہا کہ ٹھیک ہے جو کچھ تم نے سنا ہے ہم سے بیان کر دو۔ انہوں نے کہا کہ میں نے اسے ( آپ صلی اللہ علیہ وسلم ) کو یہ کہتے سنا ہے اور پھر جو کچھ انہوں نے آپ صلی اللہ علیہ وسلم سے سنا تھا ‘ سب بیان کر دیا۔ اس پر عروہ بن مسعود رضی اللہ عنہ ( جو اس وقت تک کفار کے ساتھ تھے ) کھڑے ہوئے اور کہا اے قوم کے لوگو! کیا تم مجھ پر باپ کی طرح شفقت نہیں رکھتے۔ سب نے کہا کیوں نہیں ‘ ضرور رکھتے ہیں۔ عروہ نے پھر کہا کیا میں بیٹے کی طرح تمہارا خیرخواہ نہیں ہوں ‘ انہوں نے کہا کیوں نہیں۔ عروہ نے پھر کہا تم لوگ مجھ پر کسی قسم کی تہمت لگا سکتے ہو؟ انہوں نے کہا کہ نہیں۔ انہوں نے پوچھا کیا تمہیں معلوم نہیں ہے کہ میں نے عکاظ والوں کو تمہاری مدد کے لیے کہا تھا اور جب انہوں نے انکار کیا تو میں نے اپنے گھرانے ‘ اولاد اور ان تمام لوگوں کو تمہارے پاس لا کر کھڑا کر دیا تھا جنہوں نے میرا کہنا مانا تھا؟ قریش نے کہا کیوں نہیں ( آپ کی باتیں درست ہیں ) اس کے بعد انہوں نے کہا دیکھو اب اس شخص ( نبی کریم صلی اللہ علیہ وسلم ) نے تمہارے سامنے ایک اچھی تجویز رکھی ہے ‘ اسے تم قبول کر لو اور مجھے اس کے پاس ( گفتگو ) کے لیے جانے دو ‘ سب نے کہا آپ ضرور جایئے۔ چنانچہ عروہ بن مسعود رضی اللہ عنہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے گفتگو شروع کی۔ آپ صلی اللہ علیہ وسلم نے ان سے بھی وہی باتیں کہیں جو آپ صلی اللہ علیہ وسلم بدیل سے کہہ چکے تھے ‘ عروہ رضی اللہ عنہ نے اس وقت کہا۔ اے محمد ( صلی اللہ علیہ وسلم ) ! بتائیے اگر آپ صلی اللہ علیہ وسلم نے اپنی قوم کو تباہ کر دیا تو کیا اپنے سے پہلے کسی بھی عرب کے متعلق سنا ہے کہ اس نے اپنے خاندان کا نام و نشان مٹا دیا ہو لیکن اگر دوسری بات واقع ہوئی ( یعنی ہم آپ صلی اللہ علیہ وسلم پر غالب ہوئے ) تو میں اللہ کی قسم تمہارے ساتھیوں کا منہ دیکھتا ہوں یہ مختلف جنسوں لوگ یہی کریں گے۔ اس وقت یہ سب لوگ بھاگ جائیں گے اور آپ کو تنہا چھوڑ دیں گے۔ اس پر ابوبکر رضی اللہ عنہ بولے «امصص بظر اللات» ۔ کیا ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس سے بھاگ جائیں گے اور آپ صلی اللہ علیہ وسلم کو تنہا چھوڑ دیں گے۔ عروہ نے پوچھا کون صاحب ہیں؟ لوگوں نے بتایا کہ ابوبکر رضی اللہ عنہ ہیں۔ عروہ نے کہا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر تمہارا مجھ پر ایک احسان نہ ہوتا جس کا اب تک میں بدلہ نہیں دے سکا ہوں تو تمہیں ضرور جواب دیتا۔ بیان کیا کہ وہ نبی کریم صلی اللہ علیہ وسلم سے پھر گفتگو کرنے لگے اور گفتگو کرتے ہوئے آپ صلی اللہ علیہ وسلم کی داڑھی مبارک پکڑ لیا کرتے تھے۔ مغیرہ بن شعبہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے پاس کھڑے تھے ‘ تلوار لٹکائے ہوئے اور سر پر خود پہنے۔ عروہ جب بھی نبی کریم صلی اللہ علیہ وسلم کی داڑھی مبارک کی طرف اپنا ہاتھ لے جاتے تو مغیرہ رضی اللہ عنہ تلوار کی نیام کو اس کے ہاتھ پر مارتے اور ان سے کہتے کہ رسول اللہ صلی اللہ علیہ وسلم کی داڑھی سے اپنا ہاتھ الگ رکھ۔ عروہ رضی اللہ عنہ نے اپنا سر اٹھایا اور پوچھا یہ کون صاحب ہیں؟ لوگوں نے بتایا کہ مغیرہ بن شعبہ۔ عروہ نے انہیں مخاطب کر کے کہا اے دغا باز! کیا میں نے تیری دغا بازی کی سزا سے تجھ کو نہیں بچایا؟ اصل میں مغیرہ رضی اللہ عنہ ( اسلام لانے سے پہلے ) جاہلیت میں ایک قوم کے ساتھ رہے تھے پھر ان سب کو قتل کر کے ان کا مال لے لیا تھا۔ اس کے بعد ( مدینہ ) آئے اور اسلام کے حلقہ بگوش ہو گئے ( تو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ان کا مال بھی رکھ دیا کہ جو چاہیں اس کے متعلق حکم فرمائیں ) لیکن آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ تیرا اسلام تو میں قبول کرتا ہوں، رہا یہ مال تو میرا اس سے کوئی واسطہ نہیں۔ کیونکہ وہ دغا بازی سے ہاتھ آیا ہے جسے میں لے نہیں سکتا ‘ پھر عروہ رضی اللہ عنہ گھور گھور کر رسول اللہ صلی اللہ علیہ وسلم کے اصحاب کی نقل و حرکت دیکھتے رہے۔ پھر راوی نے بیان کیا کہ قسم اللہ کی اگر کبھی رسول اللہ صلی اللہ علیہ وسلم نے بلغم بھی تھوکا تو آپ صلی اللہ علیہ وسلم کے اصحاب نے اپنے ہاتھوں پر اسے لے لیا اور اسے اپنے چہرہ اور بدن پر مل لیا۔ کسی کام کا اگر آپ صلی اللہ علیہ وسلم نے حکم دیا تو اس کی بجا آوری میں ایک دوسرے پر لوگ سبقت لے جانے کی کوشش کرتے۔ آپ صلی اللہ علیہ وسلم وضو کرنے لگے تو ایسا معلوم ہوا کہ آپ صلی اللہ علیہ وسلم کے وضو کے پانی پر لڑائی ہو جائے گی ( یعنی ہر شخص اس پانی کو لینے کی کوشش کرتا تھا ) جب آپ صلی اللہ علیہ وسلم گفتگو کرنے لگے تو سب پر خاموشی چھا جاتی۔ آپ صلی اللہ علیہ وسلم کی تعظیم کا یہ حال تھا کہ آپ صلی اللہ علیہ وسلم کے ساتھی نظر بھر کر آپ صلی اللہ علیہ وسلم کو دیکھ بھی نہیں سکتے تھے۔ خیر عروہ جب اپنے ساتھیوں سے جا کر ملے تو ان سے کہا اے لوگو! قسم اللہ کی میں بادشاہوں کے دربار میں بھی وفد لے کر گیا ہوں ‘ قیصر و کسریٰ اور نجاشی سب کے دربار میں لیکن اللہ کی قسم میں نے کبھی نہیں دیکھا کہ کسی بادشاہ کے ساتھی اس کی اس درجہ تعظیم کرتے ہوں جتنی محمد صلی اللہ علیہ وسلم کے اصحاب آپ صلی اللہ علیہ وسلم کی تعظیم کرتے ہیں۔ قسم اللہ کی اگر محمد صلی اللہ علیہ وسلم نے بلغم بھی تھوک دیا تو ان کے اصحاب نے اسے اپنے ہاتھوں میں لے لیا اور اسے اپنے چہرہ اور بدن پر مل لیا۔ آپ صلی اللہ علیہ وسلم نے انہیں اگر کوئی حکم دیا تو ہر شخص نے اسے بجا لانے میں ایک دوسرے پر سبقت کی کوشش کی۔ آپ صلی اللہ علیہ وسلم نے اگر وضو کیا تو ایسا معلوم ہوتا کہ آپ صلی اللہ علیہ وسلم کے وضو پر لڑائی ہو جائے گی۔ آپ صلی اللہ علیہ وسلم نے جب گفتگو شروع کی تو ہر طرف خاموشی چھا گئی۔ ان کے دلوں میں آپ صلی اللہ علیہ وسلم کی تعظیم کا یہ عالم تھا کہ آپ صلی اللہ علیہ وسلم کو نظر بھر کر بھی نہیں دیکھ سکتے۔ انہوں نے تمہارے سامنے ایک بھلی صورت رکھی ہے ‘ تمہیں چاہئے کہ اسے قبول کر لو۔ اس پر بنو کنانہ کا ایک شخص بولا کہ اچھا مجھے بھی ان کے یہاں جانے دو ‘ لوگوں نے کہا تم بھی جا سکتے ہو۔ جب یہ رسول اللہ صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم کے اصحاب رضوان اللہ علیہم اجمعین کے قریب پہنچے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ فلاں شخص ہے ‘ ایک ایسی قوم کا فرد جو بیت اللہ کی قربانی کے جانوروں کی تعظیم کرتے ہیں۔ اس لیے قربانی کے جانور اس کے سامنے کر دو۔ صحابہ رضی اللہ عنہم نے قربانی کے جانور اس کے سامنے کر دیئے اور لبیک کہتے ہوئے اس کا استقبال کیا جب اس نے یہ منظر دیکھا تو کہنے لگا کہ سبحان اللہ قطعاً مناسب نہیں ہے کہ ایسے لوگوں کو کعبہ سے روکا جائے۔ اس کے بعد قریش میں سے ایک دوسرا شخص مکرز بن حفص نامی کھڑا ہوا اور کہنے لگا کہ مجھے بھی ان کے یہاں جانے دو۔ سب نے کہا کہ تم بھی جا سکتے ہو جب وہ آپ صلی اللہ علیہ وسلم اور صحابہ رضی اللہ عنہم سے قریب ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ مکرز ہے ایک بدترین شخص ہے۔ پھر وہ نبی کریم صلی اللہ علیہ وسلم سے گفتگو کرنے لگا۔ ابھی وہ گفتگو کر ہی رہا تھا کہ سہیل بن عمرو آ گیا۔ معمر نے ( سابقہ سند کے ساتھ ) بیان کیا کہ مجھے ایوب نے خبر دی اور انہیں عکرمہ نے کہ جب سہیل بن عمرو آیا تو نبی کریم صلی اللہ علیہ وسلم نے ( نیک فالی کے طور پر ) فرمایا تمہارا معاملہ آسان ( سہل ) ہو گیا۔ معمر نے بیان کیا کہ زہری نے اپنی حدیث میں اس طرح بیان کیا تھا کہ جب سہیل بن عمرو آیا تو کہنے لگا کہ ہمارے اور اپنے درمیان ( صلح ) کی ایک تحریر لکھ لو۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے کاتب کو بلوایا اور فرمایا کہ لکھو «بسم الله الرحمن الرحيم» سہیل کہنے لگا رحمن کو اللہ کی قسم میں نہیں جانتا کہ وہ کیا چیز ہے۔ البتہ تم یوں لکھ سکتے ہو «باسمك اللهم‏.‏» جیسے پہلے لکھا کرتے تھے مسلمانوں نے کہا کہ قسم اللہ کی ہمیں «بسم الله الرحمن الرحيم» کے سوا اور کوئی دوسرا جملہ نہ لکھنا چاہئے۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ «باسمك اللهم‏.‏» ہی لکھنے دو۔ پھر آپ صلی اللہ علیہ وسلم نے لکھوایا یہ محمد رسول اللہ کی طرف سے صلح نامہ کی دستاویز ہے۔ سہیل نے کہا اگر ہمیں یہ معلوم ہوتا کہ آپ رسول اللہ ہیں تو نہ ہم آپ صلی اللہ علیہ وسلم کو کعبہ سے روکتے اور نہ آپ سے جنگ کرتے۔ آپ تو صرف اتنا لکھئے کہ ”محمد بن عبداللہ“ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ گواہ ہے کہ میں اس کا سچا رسول ہوں خواہ تم میری تکذیب ہی کرتے رہو ‘ لکھو جی ”محمد بن عبداللہ“ زہری نے بیان کیا کہ یہ سب کچھ ( نرمی اور رعایت ) صرف آپ صلی اللہ علیہ وسلم کے اس ارشاد کا نتیجہ تھا ( جو پہلے بدیل رضی اللہ عنہ سے کہہ چکے تھے ) کہ قریش مجھ سے جو بھی ایسا مطالبہ کریں گے جس سے اللہ تعالیٰ کی حرمتوں کی تعظیم مقصود ہو گی تو میں ان کے مطالبے کو ضرور مان لوں گا ‘ اس لیے نبی کریم صلی اللہ علیہ وسلم نے سہیل سے فرمایا لیکن صلح کے لیے پہلی شرط یہ ہو گی کہ تم لوگ ہمیں بیت اللہ کے طواف کرنے کے لیے جانے دو گے۔ سہیل نے کہا قسم اللہ کی ہم ( اس سال ) ایسا نہیں ہونے دیں گے ورنہ عرب کہیں گے ہم مغلوب ہو گئے تھے ( اس لیے ہم نے اجازت دے دی ) آئندہ سال کے لیے اجازت ہے۔ چنانچہ یہ بھی لکھ لیا۔ پھر سہیل نے لکھا کہ یہ شرط بھی ( لکھ لیجئے ) کہ ہماری طرف کا جو شخص بھی آپ کے یہاں جائے گا خواہ وہ آپ کے دین ہی پر کیوں نہ ہو آپ اسے ہمیں واپس کر دیں گے۔ مسلمانوں نے ( یہ شرط سن کر کہا ) سبحان اللہ! ( ایک شخص کو ) مشرکوں کے حوالے کس طرح کیا جا سکتا ہے جو مسلمان ہو کر آیا ہو۔ ابھی یہی باتیں ہو رہی تھیں کہ ابوجندل بن سہیل بن عمرو رضی اللہ عنہ اپنی بیڑیوں کو گھسیٹتے ہوئے آ پہنچے ‘ وہ مکہ کے نشیبی علاقے کی طرف سے بھاگے تھے اور اب خود کو مسلمانوں کے سامنے ڈال دیا تھا۔ سہیل نے کہا اے محمد! یہ پہلا شخص ہے جس کے لیے ( صلح نامہ کے مطابق ) میں مطالبہ کرتا ہوں کہ آپ صلی اللہ علیہ وسلم ہمیں اسے واپس کر دیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابھی تو ہم نے ( صلح نامہ کی اس دفعہ کو ) صلح نامہ میں لکھا بھی نہیں ہے ( اس لیے جب صلح نامہ طے پا جائے گا اس کے بعد اس کا نفاذ ہونا چاہئے ) سہیل کہنے لگا کہ اللہ کی قسم پھر میں کسی بنیاد پر بھی آپ صلی اللہ علیہ وسلم سے صلح نہیں کروں گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اچھا مجھ پر اس ایک کو دے کر احسان کر دو۔ اس نے کہا کہ میں اس سلسلے میں احسان بھی نہیں کر سکتا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ہمیں احسان کر دینا چاہئے لیکن اس نے یہی جواب دیا کہ میں ایسا کبھی نہیں کر سکتا۔ البتہ مکرز نے کہا کہ چلئے ہم اس کا آپ صلی اللہ علیہ وسلم پر احسان کرتے ہیں مگر ( اس کی بات نہیں چلی ) ابوجندل رضی اللہ عنہ نے کہا مسلمانوں! میں مسلمان ہو کر آیا ہوں۔ کیا مجھے مشرکوں کے ہاتھ میں دے دیا جائے گا؟ کیا میرے ساتھ جو اذیتیں پہنچائی گئیں تھیں۔ راوی نے بیان کیا کہ عمر بن خطاب رضی اللہ عنہ نے کہا آخر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا، کیا یہ واقعہ اور حقیقت نہیں کہ آپ صلی اللہ علیہ وسلم اللہ کے نبی ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کیوں نہیں! میں نے عرض کیا، کیا ہم حق پر نہیں ہیں اور کیا ہمارے دشمن باطل پر نہیں ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کیوں نہیں! میں نے کہا پھر اپنے دین کے معاملے میں کیوں دبیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا میں اللہ کا رسول ہوں ‘ اس کی حکم عدولی نہیں کر سکتا اور وہی میرا مددگار ہے۔ میں نے کہا کیا آپ صلی اللہ علیہ وسلم ہم سے یہ نہیں فرماتے تھے کہ ہم بیت اللہ جائیں گے اور اس کا طواف کریں گے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھیک ہے لیکن کیا میں نے تم سے یہ کہا تھا کہ اسی سال ہم بیت اللہ پہنچ جائیں گے۔ عمر رضی اللہ عنہ نے بیان کیا کہ میں نے کہا نہیں ( آپ صلی اللہ علیہ وسلم نے اس قید کے ساتھ نہیں فرمایا تھا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اس میں کوئی شبہ نہیں کہ تم بیت اللہ تک ضرور پہنچو گے اور ایک دن اس کا طواف کرو گے۔ انہوں نے بیان کیا کہ پھر ابوبکر رضی اللہ عنہ کے یہاں گیا اور ان سے بھی یہی پوچھا کہ ابوبکر! کیا یہ حقیقت نہیں کہ آپ صلی اللہ علیہ وسلم اللہ کے نبی ہیں؟ انہوں نے بھی کہا کہ کیوں نہیں۔ میں نے پوچھا کیا ہم حق پر نہیں ہیں؟ اور کیا ہمارے دشمن باطل پر نہیں ہیں؟ انہوں نے کہا کیوں نہیں! میں نے کہا کہ پھر اپنے دین کو کیوں ذلیل کریں۔ ابوبکر رضی اللہ عنہ نے کہا جناب! بلا شک و شبہ وہ اللہ کے رسول ہیں ‘ اور اپنے رب کی حکم عدولی نہیں کر سکتے اور رب ہی ان کا مددگار ہے پس ان کی رسی مضبوطی سے پکڑ لو ‘ اللہ گواہ ہے کہ وہ حق پر ہیں۔ میں نے کہا کیا آپ صلی اللہ علیہ وسلم ہم سے یہ نہیں کہتے تھے کہ عنقریب ہم بیت اللہ پہونچیں گے اور اس کا طواف کریں گے انہوں نے فرمایا کہ یہ بھی صحیح ہے لیکن کیا آپ صلی اللہ علیہ وسلم نے آپ سے یہ فرمایا تھا کہ اسی سال آپ بیت اللہ پہنچ جائیں گے۔ میں نے کہا کہ نہیں۔ پھر ابوبکر رضی اللہ عنہ نے کہا پھر اس میں بھی کوئی شک و شبہ نہیں کہ آپ ایک نہ ایک دن بیت اللہ پہنچیں گے اور اس کا طواف کریں گے۔ زہری نے بیان کیا کہ عمر رضی اللہ عنہ نے فرمایا بعد میں میں نے اپنی عجلت پسندی کی مکافات کے لیے نیک اعمال کئے۔ پھر جب صلح نامہ سے آپ فارغ ہو چکے تو صحابہ رضوان اللہ علیہم سے فرمایا کہ اب اٹھو اور ( جن جانوروں کو ساتھ لائے ہو ان کی ) قربانی کر لو اور سر بھی منڈوا لو۔ انہوں نے بیان کیا کہ اللہ گواہ ہے صحابہ میں سے ایک شخص بھی نہ اٹھا اور تین مرتبہ آپ صلی اللہ علیہ وسلم نے یہ جملہ فرمایا۔ جب کوئی نہ اٹھا تو نبی کریم صلی اللہ علیہ وسلم ام سلمہ کے خیمہ میں گئے اور ان سے لوگوں کے طرز عمل کا ذکر کیا۔ ام سلمہ رضی اللہ عنہا نے کہا اے اللہ کے نبی! کیا آپ یہ پسند کریں گے کہ باہر تشریف لے جائیں اور کسی سے کچھ نہ کہیں بلکہ اپنا قربانی کا جانور ذبح کر لیں اور اپنے حجام کو بلا لیں جو آپ کے بال مونڈ دے۔ چنانچہ آپ صلی اللہ علیہ وسلم باہر تشریف لائے۔ کسی سے کچھ نہیں کہا اور سب کچھ کیا ‘ اپنے جانور کی قربانی کر لی اور اپنے حجام کو بلوایا جس نے آپ صلی اللہ علیہ وسلم کے بال مونڈے۔ جب صحابہ نے دیکھا تو وہ بھی ایک دوسرے کے بال مونڈنے لگے ‘ ایسا معلوم ہوتا تھا کہ رنج و غم میں ایک دوسرے سے لڑ پڑیں گے۔ پھر آپ صلی اللہ علیہ وسلم کے پاس ( مکہ سے ) چند مومن عورتیں آئیں تو اللہ تعالیٰ نے یہ حکم نازل فرمایا «يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن‏» اے لوگو! جو ایمان لا چکے ہو جب تمہارے پاس مومن عورتیں ہجرت کر کے آئیں تو ان کا امتحان لے «بعصم الكوافر‏» تک۔ اس دن عمر رضی اللہ عنہ نے اپنی دو بیویوں کو طلاق دی جو اب تک مسلمان نہ ہوئی تھیں۔ ان میں سے ایک نے تو معاویہ بن ابی سفیان رضی اللہ عنہما سے نکاح کر لیا تھا اور دوسری سے صفوان بن امیہ نے۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم مدینہ واپس تشریف لائے تو قریش کے ایک فرد ابوبصیر رضی اللہ عنہ ( مکہ سے فرار ہو کر ) حاضر ہوئے۔ وہ مسلمان ہو چکے تھے۔ قریش نے انہیں واپس لینے کے لیے دو آدمیوں کو بھیجا اور انہوں نے آ کر کہا کہ ہمارے ساتھ آپ کا معاہدہ ہو چکا ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے ابوبصیر رضی اللہ عنہ کو واپس کر دیا۔ قریش کے دونوں افراد جب انہیں واپس لے کر لوٹے اور ذوالحلیفہ پہنچے تو کھجور کھانے کے لیے اترے جو ان کے ساتھ تھی۔ ابوبصیر رضی اللہ عنہ نے ان میں سے ایک سے فرمایا قسم اللہ کی تمہاری تلوار بہت اچھی معلوم ہوتی ہے۔ دوسرے ساتھی نے تلوار نیام سے نکال دی۔ اس شخص نے کہا ہاں اللہ کی قسم نہایت عمدہ تلوار ہے ‘ میں اس کا بارہا تجربہ کر چکا ہوں۔ ابوبصیر رضی اللہ عنہ اس پر بولے کہ ذرا مجھے بھی تو دکھاؤ اور اس طرح اپنے قبضہ میں کر لیا پھر اس شخص نے تلوار کے مالک کو ایسی ضرب لگائی کہ وہ وہیں ٹھنڈا ہو گیا۔ اس کا دوسرا ساتھی بھاگ کر مدینہ آیا اور مسجد میں دوڑتا ہوا۔ داخل ہوا نبی کریم صلی اللہ علیہ وسلم نے جب اسے دیکھا تو فرمایا یہ شخص کچھ خوف زدہ معلوم ہوتا ہے۔ جب وہ آپ صلی اللہ علیہ وسلم کے قریب پہنچا تو کہنے لگا اللہ کی قسم میرا ساتھی تو مارا گیا اور میں بھی مارا جاؤں گا ( اگر آپ لوگوں نے ابوبصیر کو نہ روکا ) اتنے میں ابوبصیر بھی آ گئے اور عرض کیا اے اللہ کے نبی! اللہ کی قسم اللہ تعالیٰ نے آپ کی ذمہ داری پوری کر دی ‘ آپ مجھے ان کے حوالے کر چکے تھے لیکن اللہ تعالیٰ نے مجھے ان سے نجات دلائی۔ آپ صلی اللہ علیہ وسلم نے فرمایا ( تیری ماں کی خرابی ) اگر اس کا کوئی ایک بھی مددگار ہوتا تو پھر لڑائی کے شعلے بھڑک اٹھتے۔ جب انہوں نے آپ صلی اللہ علیہ وسلم کے یہ الفاظ سنے تو سمجھ گئے کہ آپ صلی اللہ علیہ وسلم پھر کفار کے حوالے کر دیں گے اس لیے وہاں سے نکل گئے اور سمندر کے کنارے پر آ گئے۔ راوی نے بیان کیا کہ اپنے گھر والوں ( مکہ سے ) چھوٹ کر ابوجندل بن سہیل رضی اللہ عنہ بھی ابوبصیر رضی اللہ عنہ سے جا ملے اور اب یہ حال تھا کہ قریش کا جو شخص بھی اسلام لاتا ( بجائے مدینہ آنے کے ) ابوبصیر رضی اللہ عنہ کے یہاں ( ساحل سمندر پر ) چلا جاتا۔ اس طرح سے ایک جماعت بن گئی اور اللہ گواہ ہے یہ لوگ قریش کے جس قافلے کے متعلق بھی سن لیتے کہ وہ شام جا رہا ہے تو اسے راستے ہی میں روک کر لوٹ لیتے اور قافلہ والوں کو قتل کر دیتے۔ اب قریش نے نبی کریم صلی اللہ علیہ وسلم کے یہاں اللہ اور رحم کا واسطہ دے کر درخواست بھیجی کہ آپ کسی کو بھیجیں ( ابوبصیر رضی اللہ عنہ اور ان کے دوسرے ساتھیوں کے یہاں کہ وہ قریش کی ایذا سے رک جائیں ) اور اس کے بعد جو شخص بھی آپ صلی اللہ علیہ وسلم کے یہاں جائے گا ( مکہ سے ) اسے امن ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے ان کے یہاں اپنا آدمی بھیجا اور اللہ تعالیٰ نے یہ آیت نازل فرمائی «وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏» ”اور وہ ذات پروردگار جس نے روک دیا تھا تمہارے ہاتھوں کو ان سے اور ان کے ہاتھوں کو تم سے ( یعنی جنگ نہیں ہو سکی تھی ) وادی مکہ میں ( حدیبیہ میں ) بعد میں اس کے کہ تم کو غالب کر دیا تھا ان پر یہاں تک کہ بات جاہلیت کے دور کی بے جا حمایت تک پہنچ گئی تھی ) ۔“ ان کی حمیت ( جاہلیت ) یہ تھی کہ انہوں نے ( معاہدے میں بھی ) آپ کے لیے اللہ کے نبی ہونے کا اقرار نہیں کیا اسی طرح انہوں نے «بسم الله الرحمن الرحيم» نہیں لکھنے دیا اور آپ بیت اللہ جانے سے مانع بنے۔",
          "fr": "Rapporté par Al-Miswar bin Makhrama et Marwan : Le Messager d'Allah (ﷺ) partit lors du traité d'Al-Hudaybiya. Après avoir parcouru une certaine distance, il dit : « Khalid bin Al-Walid, à la tête de la cavalerie de Quraysh, se trouve à un endroit appelé Al-Ghamim, alors prenez le chemin de droite. » Par Allah, Khalid ne remarqua pas l’arrivée des musulmans avant que la poussière soulevée par l’armée musulmane ne l’atteigne. Il fit alors demi-tour précipitamment pour prévenir Quraysh. Le Prophète (ﷺ) continua jusqu’à atteindre un passage montagneux menant vers les gens de Quraysh. La chamelle du Prophète (ﷺ) s’assit. Les gens firent tout pour la faire se relever, sans succès, et dirent : « Al-Qaswa’ (le nom de la chamelle) est devenue têtue ! » Le Prophète (ﷺ) dit : « Al-Qaswa’ n’est pas têtue, ce n’est pas dans sa nature, mais c’est Celui qui a arrêté l’éléphant qui l’a arrêtée. » Il ajouta : « Par Celui qui détient mon âme, si les Quraysh me demandent quelque chose qui respecte les lois d’Allah, je l’accepterai. » Puis il réprimanda la chamelle et elle se releva. Le Prophète (ﷺ) changea de chemin et s’arrêta à l’extrémité d’Al-Hudaybiya, près d’un puits où il restait peu d’eau. Les gens utilisèrent toute l’eau rapidement et se plaignirent de la soif au Messager d’Allah (ﷺ). Le Prophète (ﷺ) prit une flèche de son carquois et ordonna de la mettre dans le puits. Par Allah, l’eau jaillit et continua de couler jusqu’à ce que tout le monde puisse boire à sa soif. Pendant ce temps, Budail bin Warqa’ Al-Khuza’i arriva avec des membres de sa tribu, les Khuza’a, qui étaient des conseillers du Messager d’Allah (ﷺ) et ne lui cachaient rien. Budail dit : « J’ai laissé Ka’b bin Luai et ‘Amir bin Luai près de l’eau abondante d’Al-Hudaybiya, avec leurs chameaux laitiers, leurs femmes et enfants. Ils veulent vous faire la guerre et vous empêcher de visiter la Ka’ba. » Le Messager d’Allah (ﷺ) répondit : « Nous ne sommes pas venus pour combattre, mais pour accomplir la ‘Umra. La guerre a affaibli Quraysh et ils ont subi de lourdes pertes. S’ils le souhaitent, je conclurai une trêve avec eux, à condition qu’ils ne s’interposent pas entre moi et les autres Arabes. Si je l’emporte sur ces infidèles, Quraysh pourra embrasser l’islam comme les autres, s’ils le veulent. Sinon, par Allah, je combattrai pour ma cause jusqu’à la mort, mais Allah fera triompher Sa cause. » Budail dit : « Je vais leur transmettre ce que tu as dit. » Il alla voir Quraysh et leur rapporta les paroles du Prophète (ﷺ). ‘Urwa bin Mas’ud se leva et dit : « Ô peuple ! N’êtes-vous pas mes enfants ? » Ils répondirent : « Oui. » Il ajouta : « Ne suis-je pas votre père ? » Ils dirent : « Oui. » Il dit : « Ne me faites-vous pas confiance ? » Ils dirent : « Non. » Il dit : « N’ai-je pas cherché de l’aide pour vous auprès des gens de ‘Ukaz, puis auprès de mes proches et de ceux qui m’obéissaient ? » Ils répondirent : « Oui. » Il dit : « Cet homme (le Prophète) vous propose une offre raisonnable, acceptez-la et laissez-moi aller le voir. » Ils acceptèrent. Il alla voir le Prophète (ﷺ) et lui parla. Le Prophète (ﷺ) lui dit à peu près ce qu’il avait dit à Budail. ‘Urwa dit : « Ô Muhammad ! N’as-tu aucun scrupule à combattre tes proches ? As-tu déjà vu un Arabe exterminer sa propre famille ? Si le contraire arrivait, personne ne t’aiderait, car je ne vois avec toi que des gens de diverses tribus qui fuiraient en te laissant seul. » En entendant cela, Abu Bakr l’insulta et dit : « Tu penses que nous abandonnerions le Prophète (ﷺ) ? » ‘Urwa demanda qui il était, on lui répondit : « C’est Abu Bakr. » ‘Urwa dit à Abu Bakr : « Par Celui qui détient ma vie, si je ne te devais pas une faveur, je t’aurais répondu. » ‘Urwa continua à parler au Prophète (ﷺ) en lui prenant la barbe, tandis qu’Al-Mughira bin Shu’ba, debout près du Prophète, tenait une épée et portait un casque. Chaque fois que ‘Urwa touchait la barbe du Prophète, Al-Mughira frappait sa main avec le manche de l’épée et disait : « Enlève ta main de la barbe du Messager d’Allah (ﷺ). » ‘Urwa demanda qui il était, on lui répondit : « C’est Al-Mughira bin Shu’ba. » ‘Urwa dit : « Ô traître ! N’essaie-je pas d’éviter les conséquences de ta trahison ? » Avant d’embrasser l’islam, Al-Mughira avait tué des gens et pris leurs biens, puis était venu à Médine pour se convertir. Le Prophète (ﷺ) lui dit : « J’accepte ton islam, mais je ne prends rien de ces biens. » ‘Urwa observa ensuite les compagnons du Prophète. Par Allah, chaque fois que le Messager d’Allah (ﷺ) crachait, l’un d’eux attrapait la salive et s’en frottait le visage et la peau ; s’il donnait un ordre, ils l’exécutaient aussitôt ; s’il faisait ses ablutions, ils se disputaient l’eau restante ; et quand ils lui parlaient, ils baissaient la voix et ne le regardaient pas fixement par respect. ‘Urwa retourna voir son peuple et dit : « Ô peuple ! Par Allah, j’ai vu des rois, César, Khosrau et An-Najashi, mais je n’ai jamais vu quelqu’un respecté par ses compagnons comme Muhammad l’est par les siens. Par Allah, s’il crache, l’un d’eux attrape la salive et s’en frotte le visage et la peau ; s’il ordonne quelque chose, ils obéissent immédiatement ; s’il fait ses ablutions, ils se disputent l’eau restante ; et quand ils lui parlent, ils baissent la voix et ne le regardent pas fixement par respect. Il vous a fait une offre raisonnable, acceptez-la. » Un homme de la tribu de Bani Kinana demanda à aller voir le Prophète, et ils acceptèrent. Quand il arriva, le Messager d’Allah (ﷺ) dit : « C’est un homme de la tribu qui respecte les Budn (chameaux du sacrifice). Amenez les Budn devant lui. » Les Budn furent amenés et les gens l’accueillirent en récitant la Talbiya. En voyant cela, il dit : « Gloire à Allah ! Il n’est pas juste d’empêcher ces gens de visiter la Ka’ba. » Il retourna voir son peuple et dit : « J’ai vu les Budn décorés et marqués. Je ne pense pas qu’il soit bon de les empêcher de visiter la Ka’ba. » Un autre, Mikraz bin Hafs, demanda à aller voir Muhammad, et ils acceptèrent aussi. Quand il arriva, le Prophète (ﷺ) dit : « Voici Mikraz, c’est un homme dur. » Mikraz parla au Prophète, puis Suhail bin ‘Amr arriva. Le Prophète (ﷺ) dit : « Maintenant, la situation va s’arranger. » Suhail demanda au Prophète de conclure un traité de paix. Le Prophète (ﷺ) appela le scribe et lui dit : « Écris : Au nom d’Allah, le Tout Miséricordieux, le Très Miséricordieux. » Suhail dit : « Quant à “Miséricordieux”, par Allah, je ne sais pas ce que cela veut dire. Écris : Au nom de Toi, ô Allah, comme tu écrivais avant. » Les musulmans dirent : « Par Allah, nous n’écrirons que : Au nom d’Allah, le Tout Miséricordieux, le Très Miséricordieux. » Le Prophète (ﷺ) dit : « Écris : Au nom de Toi, ô Allah. » Puis il dicta : « Ceci est le traité de paix conclu par Muhammad, le Messager d’Allah (ﷺ). » Suhail dit : « Par Allah, si nous savions que tu es le Messager d’Allah, nous ne t’aurions pas empêché de visiter la Ka’ba ni combattu. Écris : Muhammad bin ‘Abdullah. » Le Prophète (ﷺ) dit : « Par Allah ! Je suis le Messager d’Allah même si vous ne me croyez pas. Écris : Muhammad bin ‘Abdullah. » (Az-Zuhri dit : « Le Prophète (ﷺ) accepta tout cela, comme il avait dit qu’il accepterait tout ce qu’ils demanderaient si cela respectait la loi d’Allah. ») Le Prophète (ﷺ) dit à Suhail : « À condition que vous nous laissiez visiter la Maison (la Ka’ba) pour faire le Tawaf autour. » Suhail répondit : « Par Allah, pas cette année, pour que les Arabes ne disent pas que nous avons cédé, mais l’année prochaine. » Le Prophète (ﷺ) fit écrire cela. Suhail ajouta : « Nous exigeons aussi que tu nous rendes toute personne venant de chez nous, même si elle a embrassé ta religion. » Les musulmans dirent : « Gloire à Allah ! Comment rendre quelqu’un aux polythéistes après qu’il soit devenu musulman ? » Pendant ce temps, Abu Jandal bin Suhail bin ‘Amr arriva de la vallée de La Mecque, enchaîné, et tomba parmi les musulmans. Suhail dit : « Ô Muhammad ! C’est la première condition de notre traité : tu dois me rendre Abu Jandal. » Le Prophète (ﷺ) dit : « Le traité n’est pas encore écrit. » Suhail insista : « Je ne te laisserai pas le garder. » Le Prophète (ﷺ) dit : « Oui, fais-le. » Il répondit : « Non. » Mikraz dit : « Nous te permettons de le garder. » Abu Jandal s’écria : « Ô musulmans ! Vais-je être rendu aux polythéistes alors que je suis venu en tant que musulman ? Ne voyez-vous pas ce que j’ai enduré ? » (suite)",
          "id": "Telah bercerita kepadaku ['Abdullah bin Muhammad] telah bercerita kepada kami ['Abdur Rozzaq] telah mengabarkan kepada kami [Ma'mar] berkata telah bercerita kepadaku [Az Zuhriy] berkata telah bercerita kapadaku ['Urwah bin Az Zubair] dari [Al Miswar bin Makhramah] dan [Marwan] dimana setiap perawi saling membenarkan perkataan perawi lainnya, keduanya berkata; Rasulullah shallallahu 'alaihi wasallam keluar pada waktu perjanjian Hudaibiyah hingga ketika mereka berada di tengah perjalanan Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Khalid bin Al Walid sedang berada di wilayah al-Ghomim mengawasi pasukan berkuda Quraisy yang ada di bagian depan pasukan, karena itu ambillah jalan sebelan kanan (jalan yang menuju pasukan Khalid) \". Demi Allah, Khalid tidak menyadari dengan keberadaan mereka (Quraisy) hingga ketika mereka berada di markas pasukan, Khalid bergegas berlari menakut-nakuti Quraisy. Nabi shallallahu 'alaihi wasallam berjalan hingga ketika sampai di bukit yang menjadikan mereka berjalan menurun, unta Beliau berhenti dan menderum. Maka orang-orang berkata: \"Bangun, bangun ayo jalan\". Namun unta itu tetap menderum. Lalu mereka berkata: \"Unta al-Qushwa' mogok, unta al-Qushwa' mogok\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"al-Qushwa' tidaklah mogok karena bukan tabi'atnya tapi dia ditahan oleh Yang Menahan pasukan gajah\". Lalu Beliau bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, mereka tidaklah meminta kepadaku satu langkah perbuatan yang membuat mereka mengangungkan kehormatan-kehormatan Allah melainkan aku pasti akan memenuhinya\". Lalu Beliau menghentaknya maka unta itu bangkit. Perawi berkata: Maka Beliau meninggalkan mereka (berjalan lebih dahulu) hingga singgah di ujung Hudaibiyah di tepi sumur yang airnya sedikit dimana orang-orang sedang mengerumuninya. Tidak lama orang-orang mengerumuninya maka airnya habis lalu mereka melaporkan rasa haus kepada Rasulullah shallallahu 'alaihi wasallam. Maka Beliau mencabut anak panah dari sarungnya lalu memerintahkan mereka agar menancapkannya disana. Maka demi Allah, setelah itu sumur itu selalu saja mengalirkan airnya yang segar untuk mereka sampai mereka meminum darinya. Ketika mereka sedang dalam keadaan keadaan tersebut tiba-tiba datang Budail bin Warqo' Al Khuza'iy beserta serambongan orang dari kaumnya yaitu suku Khuza'ah. Dahulu mereka adalah orang-orang kepercayaan Rasulullah shallallahu 'alaihi wasallam dari penduduk Tihamah. Ia berkata: \"Sesungguhnya aku biarkan Ka'ab bin Lu'ay dan 'Amir bin Lu'ay singgah mengambil air di tanah Hudaibiyah. Bersama mereka ada beberapa ekor unta yang baru melahirkan yang masih menyusukan anaknya dan menjadi induk yang ditemani anak-anaknya. Mereka akan memerangi dan menghalangi Tuan dari Baitulloh. Maka Beliau bersabda: \"Sesungguhnya kami datang bukan untuk memerangi seorangpun, akan tetapi kedatangan kami untuk melaksanakan 'ibadah 'umrah. Dan sesungguhnya orang-orang Quraisy telah dilemahkan kekuatannya dan menderita kerugian akibat perang. Jika mereka mau aku akan memberikan tempo kepada mereka untuk bebas berlalu tanpa terhalang apapun antara aku dan manusia. Seandainya aku menang, kalau mau mereka boleh masuk (Islam), agama yang telah dipeluk orang banyak. Kalau tidak mau, mereka bisa beristirahat dari kelelahan berperang. Namun jika mereka enggan (dari tawaran ini), maka demi Dzat Yang jiwaku berada di tangan-Nya, aku sungguh akan memerangi mereka atas nama agama ini hingga siapa yang akan menang lebih dahulu dan sungguh Allah akan merelisasikan urusan-Nya\". Maka Budail berkata: \"Aku akan sampaikan kepada mereka apa yang Anda katakan tadi\". Perawi berkata; Maka iapun pergi menjumpai kaum Quraisy lalu berkata: \"Sesungguhnya kami datang kepadamu setelah menemui laki-laki ini dimana kami mendengar apa yang telah dikatakannya. Jika kalian mau untuk kami paparkan perkataannya itu maka akan kami lakukan\". Orang-orang yang bodoh dari mereka mengatakan: \"Kami tidak butuh kabar apapun tentangnya dari kamu\". Dan orang yang bijak dari mereka berkata: \"Sampaikan apa yang kamu dengar darinya\". Dia (Budail) berkata: \"Aku mendengar dia berkata begini begini, lalu dia menyampaikan kepada mereka apa yag dikatakan oleh Nabi shallallahu 'alaihi wasallam. Maka 'Urwah bin Mas'ud berdiri seraya berkata: \"Wahai kaum, bukankah kalian ini para orangtua?\" Mereka menjawab: \"Ya benar\". Dia berkata lagi: \"Atau bukankah aku ini adalah seorang anak (dari kalian)? ' Mereka menjawab: \"Ya benar\". Lalu dia bertanya lagi: \"Apakah kalian mencurigai aku?\" Mereka menjawab: \"Tidak\". Dia berkata lagi: \"Bukankah kalian mengetahui bahwa aku pernah meminta bantuan kepada orang-orang Ukazh lalu ketika enggan, aku datang menemui kalian dengan membawa keluargaku, anak-anakku dan orang-orang yang taat kepadaku?\" Mereka menjawab: \"Ya benar\". Dia berkata: \"Sungguh orang ini telah menawarkan kepada kalian satu penawaran yang bijak maka terimalah dan biarkanlah aku untuk menemuinya\". Mereka berkata: \"Temuilah dia\". Maka dia menemui Beliau lalu dia berbicara dengan Nabi shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam berkata seperti yang Beliau katakan kepada Budail. Lalu saat itu 'Urwah berkata: \"Wahai Muhammad, apa pendapatmu jika kamu menghabisi urusan kaummu, apakah kamu pernah mendengar ada orang dari kalangan bangsa 'Arab yang pernah melakukannya sebelummu? Kalau ada yang lain, demi Allah, sesungguhnya aku melihat beberapa tokoh, dan juga beberapa kelompok orang dibelakang yang akan menghindar darimu dan meninggalkanmu\". Maka Abu Bakar berkata kepadanya: \"Tutup mulutmu!. Apakah kami akan menghindar dan meninggalkannya?\" Ia bertanya: \"Siapa orang ini?\" Para sahabat menjawab: \"Dia Abu Bakar\". Abu Bakar berkata: \"Demi Dzat yang jiwaku berada di tangan-Nya, seandainya tidak ada jasa yang pernah kamu lakukan terhadapku dan belum aku balas tentu aku akan menjawabmu\". Perawi berkata; 'Lalu 'Urwah kembali berbicara dengan Nabi shallallahu 'alaihi wasallam dan setiap kali berbicara dia memegang jenggot Beliau sementara Al Mughirah bin Syu'bah berdiri dekat kepala Nabi shallallahu 'alaihi wasallam dan dia memegang pedang serta mengenakan baju besi. Dan setiap kali 'Urwah memegang jenggot Nabi shallallahu 'alaihi wasallam dengan tangannya, Al Mughirah memukul tangannya dengan bagian bawah sarung pedang seraya berkata: \"Enyahkan tanganmu dari jenggot Rasulullah shallallahu 'alaihi wasallam\". Maka; 'Urwah mengangkat kepalanya sera berkata: 'Siapakah orang ini?\" Para sahabat menjawab: \"Dia adalah Al Mughirah bin Syu'bah\". 'Urwah lantas berkata: \"Hai pengkhianat, bukankah aku telah menjadi susah payah akibat pengkhianatanmu?\" Dahulu Al Mughirah dimasa jahiliyah pernah menemani suatu kaum lalu dia membunuh dan mengambil harta mereka. Kemudian dia datang dan masuk Islam. Maka Nabi shallallahu 'alaihi wasallam berkata saat itu: \"Adapun keIslaman maka aku terima. Sedangkan mengenai harta, aku tidak ada sangkut pautnya sedikitpun\". Kemudian 'Urwah melayangkan pandangan kedua matanya kepada para shahabat Nabi shallallahu 'alaihi wasallam. Perawi berkata: \"Demi Allah, tidaklah Rasulullah shallallahu 'alaihi wasallam apabila membuang dahak lalu dahak Beliau tepat jatuh di telapak tangan salah seorang dari sahabat melainkan orang itu menggosokkannya pada wajah dan kulitnya. Dan bila Beliau menyuruh mereka, merekapun segera begegas melaksanakan perintah Beliau. Dan apabila Beliau hendak berwudhu', selalu mereka hampir berkelahi karena berebut untuk menyiapkan air untuk wudhu' Beliau. Bila Beliau berbicara, mereka merendahkan suara mereka di hadapan Beliau dan mereka tidaklah menajamkan pandangan kepada Beliau sebagai pengagungan mereka terhadap Beliau. Maka 'Urwah pun kembali kepada sahabat-sahabatnya lalu berkata: \"Wahai kaum, demi Allah, sungguh aku pernah menjadi utusan yang diutus mengahap raja-raja, juga Qaisar (raja Romawi) dan Kisra (raja Parsia) juga kepada raja an-Najasiy. Demi Allah, tidak pernah aku melihat seorang rajapun yang begitu diagungkan seperti para sahabat Muhamad shallallahu 'alaihi wasallam mengagungkan Muhammad. Sungguh tidaklah dia berdahak lalu mengenai telapak seorang dari mereka kecuali dia akan membasuhkan dahak itu ke wajah dan kulitnya dan jika dia memerintahkan mereka maka mereka segera berebut melaksnakannya dan apabila dia berwudhu' hampir-hampir mereka berkelahi karena memperebutkan sisa air wudhu'nya itu dan jika dia berbicara maka mereka merendahkan suara mereka (mendengarkan dengan seksama) dan tidaklah mereka mengarahkan pandangan kepadanya karena sangat menghormatinya. Sungguh dia telah menawarkan kepada kalian satu tawaran yang membawa kepada kebaikan, maka terimalah\". Lalu seorang dari Bani Kinanah berkata: \"Biarkan aku yang akan menemuinya\". Mereka berkata: \"Temuilah\". Ketika orang itu telah mendatangi Nabi shallallahu 'alaihi wasallam dan para sahabat Beliau, Rasulullah shallallahu 'alaihi wasallam berkata: \"Ini si fulan. Dia berasal dari kaum yang mengagungkan unta, karena itu kirimkan unta kepadanya\". Maka dikirimlah unta kepadanya. Dan orang-orang kemudian menyambutnya seraya mengucapkan talbiyah. Ketika orang itu melihat hal ini maka dia berkata: \"Maha suci Allah. Tidak sepatutnya orang-orang ini dihalangi untuk mendatangi Baitulloh\". Setelah dia kembali kepada teman-temannya dia berkata: \"Aku melihat unta-unta telah dikalungi dan diberi tanda, maka aku berpendapat tidak sepatutnya mereka dihalangi dari Baitulloh\". Tiba-tiba berdiri seorang laki-laki dari mereka yang biasa dipanggil dengan Mikraz bin Hafsh seraya berkata: \"Biarkan aku untuk menemuinya\". Lalu mereka berkata: \"Temuilah\". Ketika orang itu telah mendatangi mereka, Nabi shallallahu 'alaihi wasallam berkata: \"Inilah Mikraz, dia adalah seorang yang durjana\". Maka Mikraz mulai berbicara dengan Nabi shallallahu 'alaihi wasallam. Ketika dia sedang berbicara dengan Beliau, tiba-tiba Suhail bin 'Amru datang. [Ma'mar] berkata; Maka telah bercerita kapadaku [Ayyub] dari ['Ikrimah] bahwa dia mengabarkan: Ketika Suhail bin 'Amru datang, Nabi shallallahu 'alaihi wasallam berkata: \"Sungguh urusan kalian telah menjadi mudah\". [Ma'mar] berkata; [Az Zuhriy] berkata dham periwayatan hadits ini: \"Maka Suhail bin 'Amru datang seraya berkata: \"Bawa kemari (kertas) dan buatlah surat perjanjian antara kami dan kalian\". Maka Nabi shallallahu 'alaihi wasallam memanggil seorang penulis lalu Nabi shallallahu 'alaihi wasallam bersabda: \"(Tulislah) bismillahir rahmaanir rahim\". Maka Suhail berkata: \"Tentang sebutan ar-Rahman, demi Allah, aku tidak mengenalnya. Tetapi tulislah Bismika Allahumma (Dengan namu-Mu ya Allah) sebagaimana sebelumnya kamu biasa menuliskannya\". Maka kaum Muslimun berkata: \"Demi Allah, janganlah ditulis melainkan bismillahir rahmaanir rahim\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"Tulislah; \"Bismika Allahumma\". Kemudian Beliau berkata: \"Ini adalah perjanjian yang ditetapkan oleh Muhammad Rasulullah\". Seketika itu juga Suhail berkata: \"Demi Allah, seandainya kami mengetahui bahwa kamu utusan Allah, tentu kami tidak akan mengahalangi kamu dari Baitulloh dan tidaklah kami memerangimu. Akan tetapi tulislah: \"Muhammad bin 'Abdullah\". Maka Nabi shallallahu 'alaihi wasallam berkata; \"Demi Allah, sungguh aku ini adalah memang benar Utusan Allah sekalipun kalian mendustakan aku. Tulislah: Muhammad bin 'Abdullah\". Az Zuhriy berkata: \"Hal ini berkenaan dengan sabda Beliau: \"Tidaklah mereka meminta kepadaku satu permintaan dimana didalamnya mereka mengagungkan kehormatan-kehormatan Allah melainkan pasti aku akan berikan kepada mereka\". Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Dengan syarat kalian memberi kebebasan kami mendatangi Baitulloh untuk melaksanakan thawaf disana\". Suhail berkata: \"Demi Allah, jangan sampai bangsa 'Arab bercerita bahwa kami direbut secara paksa. Namun kesempatan itu kami akan berikan untuk tahun depan. Dan syarat berikutnya, bahwa tidak seorangpun yang datang kepadamu dari pihak kami sekalipun dia sudah mengikuti agamamu, melainkan kamu harus mengembalikannya kepada kami\". Lalu Kaum Muslimun (prates) berkata: \"Subhaanalloh, bagaimana mungkin dia dikembalikan kepada orang-orang musyrik padahal dia datang sebagai seorang muslim?\" Ketika mereka sedang dalam keadaan bersitegang itu, tiba-tiba datang Abu Jandal bin Suhail bin 'Amru dalam keadaan terikat yang kabur dari dataran rendah kota Makkah hingga bisa bergabung ditengah-tengah Kaum Muslimin. Maka Suhail berkata: \"Wahai Muhammad, inilah orang pertama yang kamu harus serahkan kepadaku sesuai kesepatan kamu\". Maka Nabi shallallahu 'alaihi wasallam berkata: \"Sungguh kita belum lagi menetapkan kesepakatan\". Suhail berkata: \"Demi Allah, kalau begitu aku tidak akan membuat perjanjian damai apapun kepadamu untuk selamanya\". Nabi shallallahu 'alaihi wasallam berkata: \"Berikanlah dia kepadaku sebagai pengecualian\". Suhail berkata: \"Aku tidak akan pernah memberikannya kepadamu\". Beliau kembali berkata: \"Jangan begitu, berikanlah kepadaku\". Suhail berkata: \"Aku tidak akan melakukannya\". Mikraz berkata: \"Bahkan kami telah memberikannya (kemudahan) kepadamu\". Abu Jandal berkata: \"Wahai sekalian Muslimin, apakah aku akan dikembalikan kepada orang-orang musyrik padahal aku datang sebagai seorang Muslim? Tidakkah kalian melihat apa yang sudah aku alami?\" Memang Abu Jandal telah didiksa dengan siksaan yang sangat kejam karena memilih jalan Allah. Perawi berkata; Maka 'Umar bin Al Khaththab radliallahu 'anhu berkata: 'Maka aku menemui Nabi Allah shallallahu 'alaihi wasallam lalu aku bertanya: \"Bukankah Anda ini benar-benar Nabi Allah?\" Beliau menjawab: \"Ya benar\". Aku katakan: \"Bukankah kita berada diatas kebenaran sedangkan musuh-musuh kita di atas kebatilan\". Beliau menjawab: \"Ya benar\". Aku katakan: \"Lalu kenapa kita terima penghinaan ini kepada agama kita?\" Beliau berkata: \"Sungguh aku ini adalah Utusan Allah dan aku tidak mendurhakai-Nya dan Dialah Penolongku\". Aku katakan: \"Bukankah Anda pernah mengatakan bahwa kita pasti akan mendatangi Baitulloh lalu kita thawaf disana?\" Beliau berkata: \"Benar. Tapi apakah aku mengatakannya kepadamu bahwa kita akan mendatanginya tahun ini?\" 'Umar berkata: Aku jawab: \"Memang tidak\". Beliau berkata lagi: \"Sungguh kamu pasti akan mendatanginya dan thawaf disana\". 'Umar berkata: \"Maka kemudian aku menemui Abu Bakar lalu aku katakan: \"Wahai Abu Bakar, bukankah Beliau itu benar-benar Nabi Allah?\" Abu Bakar menjawab: \"Ya benar\". Aku katakan: \"Bukankah kita berada diatas kebenaran sedangkan musuh-musuh kita di atas kebatilan\". Dia menjawab: \"Ya benar\". Aku katakan lagi: \"Lalu kenapa kita terima kehinaan ini kepada agama kita?\" Abu Bakar berkata: \"Wahai pejuang, sungguh Beliau itu adalah Utusan Allah shallallahu 'alaihi wasallam dan Beliau tidak akan durhaka kepada Robb-Nya dan Dialah Penolongnya. Maka itu berpeganglah pada perintah Beliau dan jangan menyelisihinya. Demi Allah, sungguh Beliau berada diatas kebenaran\". Aku katakan: \"Bukankah Beliau pernah mengatakan bahwa kita pasti akan mendatangi Baitulloh lalu kita thawaf disana?\" Abu Bakar menjawab: \"Benar. Tapi apakah Beliau mengatakannya bahwa kita akan mendatanginya tahun ini?\" Aku jawab: \"Tidak\". Abu Bakar berkata: \"Sungguh kamu pasti akan mendatanginya dan melaksanakan thawaf disana\". [Az Zuhriy] berkata; 'Umar berkata: \"Karena tindakanku itu maka aku melakukan beberapa amal kebajikan (sebagai penebus atas ucapan yang tidak patut) \". Setelah selesai dari membuat perjanjian, Rasulullah shallallahu 'alaihi wasallam berkata kepada para sahabat Beliau: \"Bangun dan sembelihlah hewan qurban kalian lalu cukurlah kepala kalian\". Perawi berkata: \"Demi Allah, tidak ada satupun orang yang beranjak berdiri (untuk melaksanakan perintah Beliau) hingga Beliau memerintahkannya sampai tiga kali. Ketika tidak ada seorangpun dari mereka yang berdiri, untuk melaksanakan perintah Beliau, akhirnya Beliau masuk menemui Ummu Salamah lalu menceritakan kejadian yang Beliau dapatkan di kalangan Kaum Musliminan. Maka Ummu Salamah berkata: \"Wahai Nabi Allah, apakah Tuan suka agar mereka melakukannya? Keluarlah lalu janganlah Tuan berbicara sepatah katapun dengan siapapun dari mereka hingga Tuan menyembelih unta qurban Tuan lalu Tuan panggil tukang cukur Tuan untuk mencukur rambut Tuan\". Maka Beliau keluar dan tidak berbicara dengan seorangpun dari mereka hingga Beliau menyembelih unta qurban Beliau lalu memanggil tukang cukur Beliau hingga tukang cukur",
          "tr": "(Bize Ma'mer ibn Râşid haber verip şöyle dedi: Bana ez-Zuhrî haber verip şöyle dedi: Bana Urvetu'bnu'z-Zubeyr, el-Mısver ibn Mahrame ile Mervân ibnu'l-Hakem'den haber verdi. Bu iki râvîden her biri arkadaşının hadîsini doğrulayarak şöyle demişlerdir aleyhi ve sellem), Hudeybiye zamanında(Medine'den yola) çıktı. Yolun bir kısmına vardıklarında Peygamber, sahâbîlerine: \"Hâlid ibnu'l-Velîd bir takım Kureyş süvarisi ile öncü ve gözcü olarak Ganîm mevkiindedir. Şimdi siz yolun sağ tarafını tutunuz!\" buyurdu. Hâlid, Peygamber ile beraberindekilerin hareketini sezemedi. Nihayet Hâlid, Peygamber ordusunun kaldırdığı kara tozu gördü de, hayvanını ayağı ile vurup koşturarak (Peygamber'in geldiğini) Kureyş'e bildirmek üzere sür'atle gitti. Peygamber de (sahâbîleriyle) yürüdü. Nihayet Seniyye mevkiine gelmişti ki, oradan Kureyş (karargâhı) üzerine inilirdi. Peygamber'in binek devesi burada çöktü. İnsanlar: Kalk yürü, kalk yürü! diye azarlama yaptılar. Fakat deve çökmekte ısrar etti. Bu sefer insanlar: Kasvâ çöküp kaldı! Kasvâ çöküp kaldı! dediler. Bunun üzerine Peygamber: \"Kasvâ çöküp kalmaz; onun çökme huyu da yoktur. Fakat vaktiyle fîli (Mekke'ye girmekten) men' eden Allah, şimdi Kasvâ'yı men' etti\" buyurdu. sonra Rasûlüllah: \"Hayâtım elinde olan Allah'a yemin ederim ki, Kureyş, Allah'ın (Harem içinde) muhterem kıldığı şeyleri ta'zîm kasdederek benden ne kadar müşkil istekte bulunursa, ben onu muhakkak onlara vereceğim\" buyurdu. Kasvâ'yı sürdü. Hayvan hemen sıçrayıp kalktı. Râvî dedi ki: Bu defa Rasûlüllah, Kureyş tarafından saptı da, nihayet suyu az olan \"Semed' kuyusu yolu üzerindeki Hudeybiye mevkiinin en sonuna indi. Bu az suyu, insanlar birer parça alıyor ve insanların orada eğlenip ikaamet etmeleri için su bırakmıyor da kuyunun suyunu kamilen çekiyorlardı. Şimdi Rasûlüllah'a susuzluktan şikâyet edildi. Bunun üzerine Rasûlüllah ok mahfazasından bir ok çıkardı. Sonra onlara bu oku Semed kuyusuna koymalarını emretti. Vallahi o anda kuyunun suyu coşmağa başladı. Suyun bu fışkırması Rasûlüllah'ın sahâbîleri oradan dönünceye kadar, onları suya kandırmak için devam etti. ile sahâbîleri bu hâlde iken, Budeyl ibn Verkaa el-Huzâî, kendi kabilesi olan Huzaa'dan birkaç kişi ile çıkageldi. (Mekke ve havalisindeki) Tihâme kabileleri arasında Huzaalılar, öteden beri Rasûlüllah'ın sırdaşı idiler.(Müslim olsun, müşrik bulunsun bütün Huzaalılar, Mekke'de olup biten her şeyi Rasûlüllah'tan saklamazlar, gizlice bildirirlerdi -ibn İshâk-.) Budeyl gelince, Peygamber'e: (Haberiniz olsun! Kureyş'in) Ka'b ibn Luey ile Âmir ibn Luey kabileleri Hudeybiye sularının en zengin kaynaklarına kondular. Sütlü ve yavrulu develeri (kadınları ve çocukları) da yanlarında bulunuyor. Şimdi ben onları bu hâlde bıraktım, geliyorum. Bunlar muhakkak size karşı harb edecekler, dedi. şöyle buyurdu: “Fakat biz hiçbir kimse ile harb etmek için gelmedik. Biz yalnız umre yapmak niyetiyle geldik. Bununla beraber harb, Kureyş'in maddî ma'nevî kuvvetlerini zayıflatmış ve onları zarara uğratmıştır. Eğer Kureyş arzu ederse, ben onlarla aramızda barış için bir müddet ta'yîn ederim. Onlar da benimle diğer müşriklerin arasını serbest bıraksınlar. Eğer ben Arablar'a gâlib olursam, Kureyş müşrikleri de insanların girdiği bu itaat yoluna girmek isterlerse (kendi arzûlarıyle)girebilirler. Şayet ben (müşriklerin sandıkları gibi)Arablar'a gâlib gelmezsem, bu ihtimâle göre de müşrikler (benimle harb etmek zahmetinden kurtulup) rahata ererler. Mekkeliler böyle bir mütârekeyi kabul etmez ve diğer Arablar'la beni kendi hâlimize bırakmayıp, müdâhale etmek isterlerse, hayâtım elinde olan Allah'a yemîn ederim ki, şu müdâfaa ettiğim müslümânlık uğrunda başım vücûdumdan ayrılıncaya kadar Mekkeliler'e karşı cihâd edeceğim, bu muhakkaktır. Şu kesindir ki,(o zaman) Allah, Kur'ân'daki nusrat va'dini yerine getirecektir\". üzerine Budeyl, Rasûlüllah'a: Şimdi ben senin bu söylediklerini muhakkak Kureyş'e tebliğ edeceğim, dedi. râvînin beyânına göre, gidip Kureyş karargâhına vardı. Ve: Şimdi ben yanınıza şu adamın yanından geliyorum. Onu şöyle bir söz söylerken işittik; eğer sizler bizim o sözleri sizlere arz etmemizi isterseniz arz ederiz, dedi. Kureyş'in beyinsizleri: Senin bize ondan birşey haber vermene ihtiyâcımız yoktur, diye karşıladılar. içlerinden re'y sahibi olan birisi: Haydi ondan söylerken işittiğin sözü getir, dedi. Budeyl: Ben O'ndan şöyle şöyle sözleri söylerken işittim, diyerek, Peygamber'in söylediği sözleri birer birer anlattı. Bunun üzerine Urve ibn Mes'ûd ayağa kalktı ve Kureyş'e şunları söyledi: Ey kavmim! Siz benim babam yerinde değil misiniz? Diye sordu. Kureyşliler: Evet, diye doğruladılar. Bunun üzerine Urve ibn Mes'ûd: Ben de sizin oğlunuz mesabesinde değil miyim? dedi. Onlar: Evet, diye tasdik ettiler. Sonra Urve: Sizler beni bir kabahat ile ittihâm ediyor musunuz? diye sordu. Onlar buna da: Hayır, diye cevâb verdiler. Bu defa Urve ibn Mes'ûd: Ukâz halkını size toptan yardıma çağırdığımı ve onların bu yardımdan çekinmeleri üzerine kendim ailem ve çocuklarımla ve bana itaat eden tâbi'lerimle size yardıma koştuğumu pekâlâ bilirsiniz değil mi? dedi. da (bir ağızdan): Evet; biliriz, diye tasdik ettiler.(Bu te'mînâtları aldıktan sonra) Urve: Bu adam size hayır ve iyilik yolu gösteriyor. O yolu kabul ediniz! Ve beni bırakınız, O'na gideyim! dedi. Mekkeliler: Haydi git, diye izin verdiler. ibn Mes'ûd, Peygamber'e geldi ve O'nunla olanları konuştu. Peygamber de Urve'ye, Budeyl'e söylediği sözlere benzer bir surette fikirler beyân etti.(Bu arada Peygamber: \"Bir mütâreke kabul etmezlerse, Kureyş ile Ölünceye kadar harb edeceğim\" buyurunca) Urve ibn Mes'ûd: Ey Muhammed! Sen kavminin kökünü kazıdığını farz etsek, ne düşünürsün, bana söyle! Senden evvel Arab'dan kendi kavmim toptan helak eden bir kimse işittin mi? Ya mesele diğer şekilde meydana gelirse(Kureyş'in size ne kötü muamele edecekleri, size gizli değildir). Vallahi ben aranızda ileri gelenlerden bâzı kimseler görüyorum, bu muhakkak olmakla beraber, yine ben bir takım kabilelerden toplanmış karışık kimseler de görüyorum ki, bunlar harb sırasında kaçıp, Seni yalnız bırakabilecek kaabiliyettedirler, dedi. Bekr, (Urve'nin, Peygamber'in sahâbîlerini harbden kaçmakla ittihâm etmesine dayanamadı da) Urve'ye: Haydi sen, Lât putunun fercini yala! Biz mi harbden kaçıpRasûlüllah'ı yalnız bırakacağız(hâşâ)! diye sövüp reddetti. Bu kimdir? diye sordu. Sahâbîler: Ebû Bekr'dir, dediler. Urve: Dikkat et Ebû Bekr! Nefsim elinde olan Allah'a yemîn ederim ki, eğer üzerimde henüz ödeyemediğim bir iyiliğin olmasaydı, elbette ben de sana cevâb verirdim, dedi. dedi ki: Urve, Peygamber'e söz söylemeye devam etti. Ve (konuşma arasında Arab âdeti üzere) her söz söyledikçe eliyle Peygamber'in sakalını tutuyordu. Halbuki bu sırada Mugîre ibn Şu'be -ki Urve'nin kardeşinin oğludur-, başında miğfer ve yalın kılıç bir hâlde Peygamber'in başı üzerinde duruyor, O'nu koruyordu. Ve Urve her ne zaman Peygamber'in sakalına eliyle uzanıp okşamaya girişirse, derhâl Mugîre kılıcının kınının ucuyla Urve'nin eline vuruyor ve Urve'ye: Rasûlüllah'ın sakalından elini çek! Diyordu. Mugîre'nin bu hareketi üzerine Urve başını kaldırdı da: Bu da kimdir? diye sordu. Sahâbîler: Mugîre ibn Şu'be'dir, dediler. Bunun üzerine Urve: Ey gaddar! Ben hâlâ senin (Câhiliyet'teki) gadr ve hıyanetini ödemeye çalışmakla meşgul değil miyim? dedi. Câhiliyet'te Mâlik oğulları'ndan bâzı kimselerle yol arkadaşlığı yapmış ve yolda bunları öldürüp mallarını almış, sonra Medine'ye gelip müslümân olmuştu. (Bu mallan Peygamber'e arz ettiğinde) Peygamber: \"İslâm olmana gelince, bunu kabul ediyorum. Mallara gelince (bunlar gadrdır); ben bunlardan hiçbir şeyi de (alıcı) değilim\" buyurdu. Urve, Peygamberin sahâbîlerini iki gözü ile iyice tedkîke başladı. (Ve arkadaşlarına:) (Bu ne ta'zîmdir!) Vallahi Rasülullah ağzından bir şey atarsa bu muhakkak sahâbîlerinden bir adamın avucuna düşüyor ve o adam bunu yüzüne ve bedenine sürüp ovalıyor. Onlara bir şey emredince, sahâbîleri derhâl emrini yerine getirmeye koşuşuyorlar. Abdest aldığı zaman da abdest suyunun artanını almak için birbirlerini öldürmeye yaklaşıyorlar. Peygamber söz söylediği zaman, huzurundaki bütün sahâbîler seslerini alçaltıyorlar(yânı O'na alçak sesle cevâb veriyorlar). O'nu ta'zîm için yüzüne dikkatle bakamıyorlar, dedi. Urve, Kureyş'in yanına geldi ve gördüklerini şöyle bildirdi: Ey kavmim! Vallahi ben vaktiyle birçok meliklerin huzuruna sefir olarak çıktım. Rûm meliki Kaysar'ın, Fars meliki Kisrâ'nın, Habeş meliki Necâşî'nin dîvânlarına elçilikle girdim. Vallahi bunlardan hiçbir melikin adamlarını, Muhammed'in sahâbîlerinin Muhammed'i ta'zîm ettikleri derecede hükümdarlarını asla ta'zîm eder görmedim. Muhammed'in sahabeleri, O'nun tükürüğü ile bile teberrük ediyorlar! O birşey emredince, O'nun sahâbîleri derhâl emrini yerine getirmeye koşuşuyorlar. O abdest aldığı zaman da, abdest suyunun fazlasını birbirlerinin üzerine yığılarak paylaşıyorlar. O söz söylediği zaman sahâbîleri hafif bir sesle O'nu tasdîk edip cevâb veriyorlar. Muhammed'in sahâbîleri O'nu ta'zîm için, O'nun yüzüne dikkatle bakamıyorlar. Muhammed size güzel bir barış ve iyilik yolu arz etti. Bunu kabul edin! dedi. üzerine Kinâne oğulları'ndan birisi Kureyş'e hitaben: Beni bırakınız, bir kerre de Muhammed'in yanına ben gideyim, dedi. da: Pekâlâ git! dediler. Kinânlı zât, Peygamber'in sahâbîlerine doğru giderken, Rasûlüllah: \"Bu gelen fulan kimsedir. O öyle bir kabiledendir ki, onlar hacc ve umre kurbanlarını ta'zîm ederler. Gerdanlıklı kurban develerini bu zâtın gözü önüne salıverin!\" buyurdu. bütün kurbanlık develeri onun geleceği yolun üzerine salıverdiler; sahâbîler de yüksek sesle Lebbeyk, Allâhümme lebbeyk diyerek Kinânî'yi karşıladılar. Kinânî zât kurban develerini ve sahâbîlerin telbiye ile karşılamalarını görünce hayret ederek: Subhânallahl Bu zâtların Beyt'i ziyaretten men' edilmeleri, bunlara yakışmayan bir harekettir, dedi. yanına döndüğünde de: Ben bunların umre için kesecekleri kurban develerini kılâdelenmiş ve alâmetlendirilmiş bir hâlde gördüm. Ben bunların Beyt'i ziyaretten men' edilmelerini uygun görmem, dedi. Kureyşliler arasından Mıkrez ibn Hafs denilen birisi kalktı ve: Bana müsâade edin de Muhammed'e bir de ben gideyim, dedi. Onlar da: Haydi git! dediler. sahâbîlere doğru gelirken, Peygamber (sallallahü aleyhi ve sellem): \"Şu gelen Mıkrez'dir, gaddar bir kimsedir\" buyurdu. Mıkrez Peygamber ile konuşmağa başladı. Peygamber ona söz söyleyeceği sırada, Süheyl ibnAmr çıkageldi. Râvî Ma'mer dedi ki1: Bana Eyyûb es-Sahtiyânî, ibn Abbâs'ın âzâdlısı İkrime'den haber verdi ki, Süheyl ibn Amr gelince, Peygamber bu isim ile tefe'ül ederek, sahâbîlere: \"Artık işiniz size bir dereceye kadar kolaylaştı\" buyurdu. Ma'mer ibn Râşid dedi ki: ez-Zuhrî, kendi hadîsinde şöyle dedi: Süheyl ibn Amr gelince, Peygamber'e: Haydi (yazı malzemesi) getir; bizimle sizin aranızda bir barış mektubu yaz! dedi. Bunun üzerine Peygamber yazı yazacak olan kâtibi(Alî ibn Ebî Tâlib'i) çağırdı. Ve: \"Bismillâhirrahmânirrahîm yaz!\" buyurdu. (Câhiliyet koruyuculuğu sevkı ile) Peygamber'e: Rahman ismine gelince, vallahi ben onun mâhiyetini bilmiyorum. Fakat vaktiyle Senin de yazdırdığın gibi \"Bismikellâhumme = Allahım, Senin isminle yazmağa başlarım)\" diye yaz! Dedi. Müslümanlar da bir ağızdan: Vallahi biz onu yazmayız, ancak Bismillâhirrahmânirrahîm yazılmasını isteriz, dediler. Peygamber(Alî'ye hitaben): \"Haydi Bismikellâhumme yaz!\" buyurdu. Sonra da: \"Bu, Muhammed Rasûlüllah'ın, üzerinde barış andlaşması yaptığı hükümler kitabıdır” diye yazmasını emretti. sefer de Süheyl (buna karşı koyarak): Vallahi biz Senin Allah'ın Rasûlü olduğunu biliyor ve tasdîk ediyor olaydık, biz Seni Beyt'ten men' etmez ve Sana karşı harbe 'girişmezdik. Fakat Sen \"Muhammed ibn Abdillah\" yaz! dedi. teklif üzerine Peygamber: '' Vallahi siz yalanlasanız da ben şübhesiz Allah Rasûlü'yüm'' buyurdu ve Alî bin Ebî Tâlib'e: \"Haydi(Rasûlüllah lâfzını sil de) Muhammed ibn Abdillah yaz!\" diye emretti. Vallahi ben Sen'in Rasûlüllah unvanını kat'iyyen silmem, dedi. Bunun üzerine Peygamber kitabı eline alıp o ta'bîri sildi ve Muhammed ibn Abdillah yazdırdı.) şöyle demiştir: Peygamber'in gerek Besmele'nin, gerek barış mektubunun unvanının yazılma sureti hakkında Süheyl ibn Amr'ın teklîflerine uyması, Peygamber'in evvelce:\"Kureyş, Allah'ın Harem içinde muhterem kıldığı şeyleri ta'zîm kasdederek, benden ne kadar müşkil istekte bulunursa bulunsun, ben onu muhakkak onlara vereceğim\" suretinde verdiği kararın netîcesi ve tecellîsidir. yazısının başlığı: \"Yâ Allah, Sen'in isminle başlarım.. Bu Muhammed ibn Abdillah'ın üzerinde barış andlaşması yaptığı hükümler kitabıdır\" suretinde kararlaşıp, böyle yazıldıktan sonra, Peygamber anlaşma şartlarını teklif ederek, Süheyl ibn Amr'e: \"Siz bizimle Beyt arasını serbest bırakacaksınız; biz de Beyt'i tavaf edeceğiz\" buyurdu. bu teklife de i'tirâz edip: Vallahi sizinle Beyt arasını boş bırakamayız. Çünkü Arab milleti cebren ve kahren isti'lâ olunduk diye hakkımızda dedikodu eder; şu kadar ki, bu boşaltma işi gelecek seneden i'tibâren başlasın, dedi. (bu suret kabul olundu da) Alî bunu yazdı. Süheyl ibn Amr da şu maddeyi teklîf etti: Sana bizden bir erkek gelirse, o gelen kimse Sen'in dîninde olsa bile, onu bize geri vereceksin! dedi. Bu teklife müslümânlar hayret ederek: Subhânallah! İslâm camiasına sığınan bir müslümân, müşriklere nasıl geri verilir? Dediler. bu hâlde iken, Süheyl ibn Amr'ın oğlu Ebû Cendel, ayakları bukağılı olarak seke seke çıkageldi. (Ebû Cendel müslümân olmuş, bu yüzden Mekke'de habs olunmuştu.) Mekke'nin aşağısındaki habsedildiği yerden kaçmış ve nihayet kendisini müslümânlar arasına atmıştı. Bunun üzerine Süheyl: İşte yâ Muhammed! Sana karşı imza edeceğim anlaşmanın birinci maddesi uyarınca bunu bana geri vermelisin! dedi. \"Biz barış yazısını henüz yazıp bitirmedik (imza etmedik)\"buyurdu. O takdirde vallahi ben de Sen'inle hiçbir madde üzerinde barış anlaşması yapmam, dedi. Peygamber: \"Haydi şu Ebû Cendel'i bana bağışla da imza et\" buyurdu. Süheyl: Ben bunu Sana bağışlamayı asla caiz görmem, diye reddetti. Peygamber: \"Hayır, bu işi benim hatırım için yap!\" buyurdu. Süheyl ısrar edip: Asla yapmam, dedi. ibn Hafs da (temsilci olduğu için) Peygamber'e hitaben: Bunu Sana caiz kıldık, dedi. (Fakat imzaya yetkili olan Süheyl kabul etmedi.) Şimdi Ebû Cendel, babasının inadından üzülerek: Ey Müslümanlar cemâati! Müslüman olarak geldiğim hâlde şimdi ben müşriklere geri mi veriliyorum? Benim karşılaştığım şu kötü hâli görmüyor musunuz? diye haykırdı. zavallı Ebû Cendel, Allah yolunda Kureyş'in şiddetli işkencesiyle azâb olunmuştu. İbn İshâk burada şu ziyâdeyi rivayet etmiştir: Rasûlüllah: Ebâ Cendel! Sabr et, Allah'tan ümitli ol! Biz müslümânlar mağdur ve mağlûb olmayız. Yüce Allah yakında sana da kurtuluş yolu bahşedecektir\" (buyurdu.) müşkil vaziyetten üzülen Omer ibnu'l-Hattâb şöyle demiştir: Bunun üzerine ben Peygamber'e vardım ve: Sen Allah'ın hakk peygamberi değil misin? Dedim. Peygamber: \"Evet, Allah'ın hakk peygamberiyim!\" buyurdu. Ben: Biz müslümânlar hakk üzerinde; düşmanlarımız ise bâtıl üzerinde bulunmuyorlar mı? Dedim. Peygamber: \"Evet, öyledir\" buyurdu. Ben: O hâlde dînimiz hakkında bu aşağılık hâli niçin kabul ediyoruz? Dedim. \"Muhakkak surette ben Allah'ın Rasûlü'yüm ve ben (bu anlaşmayı kabul etmekle) Allah 'a isyan etmiş değilim. Allah benim yardımcımdır!\"buyurdu. yine: Vaktiyle Sen bize: \"Yakında Ka'be'ye varıp tavaf edeceğiz!\" diye haber vermez miydin? dedim. Rasûlüllah: \"Ben sana (vakit ta'yîn ederek) 'Bu sene varıp tavaf edeceğiz!' diye haber verdim mi?\" buyurdu. Ben de: Hayır, dedim. Rasûlüllah: \"Muhakkak sen (yakın zamanda)Beyt'e varıp onu tavaf edeceksin\" buyurdu. ibn Hattâb dedi ki: Bunu müteâkıb ben, Ebû Bekr'e vardım ve: Yâ Ebâ Bekr! Bu adam Allah'ın hakk peygamberi değil midir? Dedim. Bekr de: Evet, hakk peygamberidir, dedi. Ben: Biz müslümânlar hakk üzerinde; düşmanlarımız bâtıl üzerinde bulunmuyor mu? dedim. O da: Evet öyledir, diye cevâb verdi. Ben tekrar: Öyle ise niçin biz dînimize küçüklük veriyoruz? Dedim. Ebû Bekr: Behey adam! Muhammed muhakkak Allah'ın Rasûlü'dür. O, Rabb'ine âsî değildir. Allah O'nun yardımcısıdır. Sen hemen O'nun emrine sarıl! Vallahi Muhammed hakk üzeredir, dedi. Ben tekrar: O bize Medîne'de \"Beyt'e varacağız, tavaf edeceğiz\" demedi mi? diye sordum. Ebû Bekr: Evet öyledir. Fakat sana \"Bu sene varıp tavaf edersin” diye mi haber verdi? dedi. Ben de: Hayır, dedim. Ebû Bekr: (Dur bakalım!) Sen muhakkak yakın bir zamanda Beyt'e varıp onu tavaf edeceksin! dedi. ez-Zuhrî dedi ki: Omer (radıyallahü anh): Bu itirazlarınmdan dolayı keffâret olarak sonra birçok iyi işler yapmışımdır, demiştir. Râvî dedi ki: Rasûlüllah barış andlaşmasının yazım ve imzasını bitirip ayrıldığı zaman, sahâbîlere : \"Haydi artık kalkın, kurbanlarınızı kesip, başlarınızı tıraş edin!\" buyurdu. dedi ki: Vallâhî sahâbîlerden bir kişi olsun kalkmadı. Hattâ Rasûlüllah bu emri üç kerre söyledi. Sahâbîlerden hiçbirisi kalkmayınca, Rasûlüllah zevcelerinden Ümmü Seleme'nin yanına girdi ve sahâbîlerden gördüğü kayıdsızlığı ona söyledi. Ümmü Seleme: Ey Allah'ın Peygamberi! Sen bu emri yerine getirmek istiyor musun? O hâlde şimdi dışarı çık, sonra tâ kurbanlık develerini kesinceye ve berberini çağırıp, o seni tıraş edinceye kadar sahâbîlerinden hiçbirisine bir kelime bile söyleme! dedi. üzerine Peygamber, Ümmü Seleme'nin yanından çıktı ve sahâbîlerinden hiçbirisi ile konuşmayarak, umre ibâdetlerini yerine getirdi. Kurbanlık develerini kesti ve berberi(Huzaalı Hırâş ibn Umeyye'yi) çağırıp tıraş oldu. Sahâbîler Peygamber'i bu hâlde görünce, onlar da hemen kalkarak kurbanlarını kestiler, birbirlerini tıraş etmeye başladılar, hattâ (icabet çabukluğunun meydana getirdiği sıkışıklıktan) birbirlerini öldüre yazdılar. tıraş olduktan sonra huzuruna bir takım mü'min kadınlar geldi. Bu hususta, yâni kadınlar hususunda yapılacak işleri öğretmek için de Yüce Allah şu âyetleri indirdi: \"Ey imân edenler, mü'min kadınlar muhacirler olarak size geldikleri zaman onları imtihan edin. Allah onların îmânlarını daha iyi bilendir ya. Fakat siz de mü'min kadınlar olduklarına bilgi edinirseniz, onları kâfirlere döndürmeyin. Bunlar onlara helâl değildir. Onlar da bunlara helâl olmazlar. Sarf ettikleri mehri onlara geri verin. Sizin onları nikâhla almanızda, mehirlerini verdiğiniz takdirde, üzerinize bir günâh yoktur. Kâfir kadınların ismetlerini nikâhınızda tutmayın...\" (el-Mumtehine: ıo). âyetin inmesi üzerine Omer, müşrik hâlde bulunan iki karısını boşadı. Bunlardan birisini (Kureybe'yi) Muâviye ibn Ebî Sufyân, diğerini de Safvân ibn Umeyye zevceliğe aldı. Peygamber(sallallahü aleyhi ve sellem) Medîne'ye döndü. Akabinde Kureyş'in yemînli dostu olan Ebû Basîr (Utbe es-Sakafî) müslümân olarak geldi. Bunu istemek üzere de Kureyş iki kişi gönderdi. Bunlar Peygamber'e: Bize karşı imza ettiğin ahdi hatırlatırız, dediler. Peygamber de (muahede gereğince) Ebû Basîr'i bu iki kişiye geri verdi. Bunlar Ebû Basîr ile yola çıktılar. Nihayet Zu’l-Huleyfe'ye eriştiler.(Dağarcıklarındaki) hurmadan bir mikdârını yemek için oraya indiler. Ebû Basîr bu iki kişiden birisine (Huneys'e): Yâ Fulân! Vallahi ben senin şu kılıcını emîn ol çok güzel görüyorum, dedi. sahibi olan) o birisi de, kılıcı kınından çekip: Evet, vallahi bu kılıç çok iyidir. Onu ben birçok kerre tecrübe ettim, dedi. Basîr de: Müsâade et de bakayım, dedi. bir fırsat bulup elinden aldı. Hemen de Huneys'e vurdu. Huneys nihayet öldü. Öbür arkadaşı (bir rivayette Huneys'in kölesi Kevser) kaçarak tâ Medîne'ye vardı. Mescide koşarak girdi. Rasûlüllah onun telâşla koşup geldiğini görünce: \"Muhakkak bu adam bir korku görüp geçirmiştir \" buyurdu. Kevser, Peygamber'e yaklaşınca, O'na: Vallahi sahibim öldürüldü. (Men' etmezseniz) muhakkak ben de öldürüleceğim, dedi. Bu sırada Ebû Basîr de geldi ve: Ey Allah'ın Peygamberi! Vallahi Allah sana ahdini îfâ ettirdi; beni müşriklere geri verdin. Sonra Allah beni onlardan kurtardı, dedi. Bunun üzerine Peygamber, sahâbîlere hitaben: \"Anası helak olası Ebû Basîr'e hayret olunur! Bu adam harb gelberisidir, eğer bunun fikrine yardım eden bulunsa (o fırın karıştırır gibi harbi ateşleyecek, sulhu bozacak)\" buyurdu. Basîr Peygamber'in bu sözlerini işitince kendisini müşriklere hemen geri vereceğini anladı. Peygamber'in yanından çıktı ve deniz sahiline kadar kaçtı; \"Iys\" mevkiine yerleşti. dedi ki: Süheyl'in oğlu Ebû Cendel de(yetmiş süvari müslümân ile birlikte) müşrikler arasından kaçarak Ebû Basîr'e katıldı. Şimdi artık müslümân olan herkes, Kureyş arasından ayrılarak Ebû Basîr'e katılmaya başladı. Nihayet Ebû Basîr'in başında mühim bir kuvvet toplandı. Vallahi bunlar, Kureyş'in Şam'a bir ticâret kaafilesinin gittiğini duyar duymaz, hemen onları çevirirlerdi. Kendilerini öldürüp mallarını alırlardı. kendisini korkutan bu vaziyet üzerine Peygamber'e (Ebû Sufyân'ı husûsî yetki ile) gönderdi. Şimdi Kureyş, Peygamberden Allah rızâsı için ve aradaki yakınlığa hürmeten Ebû Basîr cemâatinin baskın ve yağmalarının men' edilmesini ricaya başlamıştı. \"Artık bundan böyle Mekke'den Medine'ye kim giderse emindir (geri getirilmeyecektir)\" diye haber gönderdiler. aleyhi ve sellem), Ebû Basîr cemâatine mektûb gönderdi(Medîne'ye gelmelerini bildirdi). Bunun üzerine Yüce Allah şu âyetleri indirmiştir: sizi Mekke'nin karnında, onlara karşı muzaffer kıldıktan sonra, onların ellerini sizden, sizin ellerinizi onlardan çekendi. Allah ne yaparsanız hakkıyla görücüdür. Onlar, küfreden, sizi Mescidi Hâram'dan ve alıkonulmuş hediyelerin mahalline ulaşmasından men edenlerdir. Eğer (Mekke'de) kendilerini henüz tanımadığınız mü'min erkeklerle mü'min kadınları bilmeyerek çiğneyip de o yüzden size bir vebal isabet edecek olmasaydı (Allah size fetih için elbette izin verirdi). Bunu, kimi dilerse onu rahmetine kavuşturmak için yaptı. Eğer onlar, seçilip ayrılmış olsalardı, biz onlardan küfredenleri muhakkak elem verici bir azaba uğratmıştık bile. O küfredenler kalblerine o taassubu, o cahillik taassubunu yerleştirdiği sırada idi ki, hemen Allah, Rasûlü'nün ve mü'minlerin üzerine ma'nevî kuvvetini indirdi; onları takva sözü üzerinde durdurdu. Onlar da buna çok lâyık ve buna ehil idiler. Allah her şeyi hakkıyle bilendir\" (el-Feth: 24-26) hamiyyetleri: Muhammed'in Allah'ın Peygamberi olduğunu ikrar etmemeleri, Bismillahirrahmâhirrahîm’i ikrar etmemeleri, müslümânlarla Beyt arasına engel olmalarıdır. Abdillah el-Buhârî dedi ki: \"Maarratun\", uyuz illeti demek olan \"el-Urrun\"dur, \"Tezeyyelû\", ayrılıp seçilselerdi demektir. \"Hameytu'l-kavme\" demek, \"onları koruma olarak men' ettim\" demektir. Ve \"Ahmeytu’l-hımâ\", \"onu içine girilmez bir koruluk yaptım\" demektir. Kendisini iyice kızdırdığım zaman: \"Ahmeytu'l-hadîde\" ve \"Ahmeytu'r-racule\" derim. Ukayl, ez-Zuhrî'den söyledi: Urve şöyle demiştir: Bana Âişe (r.anha) haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem) mü'min kadınlardan hicret edip gelenleri(yemîn vererek ve diğer deliller ve emarelere bakarak) imtihan ederdi. dedi ki: Bize şu haber ulaştı: Yüce Allah, müşriklerin mü'min olup da hicret etmiş bulunan kadınlarına yaptıkları mehir harcamalarını onlara geri vermeleri (el-Mümtehime: ıo) âyetini indirdiği ve yine bu âyette “Kâfir kadınları nikâhlarında tutmamalarını” müslümânlar üzerine hükmedince, Omer, henüz müşrik hâlde bulunan iki karısını birden boşamıştır. Bunlardan birisi Kureybe -yahut Karîbe- bintu Ebî Umeyye , diğeri de Ümmü Kulsüm ibnetu Cervel el-Huzâîdir -ki bu kadın Abdullah ibn Omer'in anasıdır-. Bu boşama akabinde Kureybe'yi Muâviye ibn Ebî Sufyân zevceliğe almış; diğer kadın Ümmü Kulsüm'ü de Ebû Cehm zevceliğe almıştır (ki o sırada Muâviye ile Ebû Cehm müşrik hâlde idiler). - “Sarf ettiğinizi isteyin, kâfirler de sarf ettiklerini istesinler\"(el-Mümtehıne:10) âyeti gereğince- müslümânların, zevcelerine yaptıkları harcamaları ödemeyi ikrar ve kabul etmekten çekindikleri zaman Yüce Allah: “Eğer zevcelerinizden bir şey sizden kâfirlere kaçar da, siz de muharebede ganimete kavuşursanız, zevceleri gitmiş olan müslümânlara harcadıkları (mehir) kadar verin...\" (el-Mümtehine:11) âyetini indirdi. Bu âyetteki \"el-Akbu\", müslümânların, karısı müslümânlara hicret etmiş olan kâfir erkeklere ödeyecekleri masraftır. İşte Allah, müslümânlardan karısı dînden, çıkarak kâfirlere gitmiş olan kimselere de, kâfirlerin müslümânlara hicret etmiş olan kadınlarına vermiş oldukları mehrin benzerinin verilmesini emretti. Fakat biz îmân etmesinden sonra dîninden dönmüş hiçbir muhacir kadın bilmiyoruz. şöyle dedi: Yine bize ulaştı ki, Ebû Basîr ibnu Esîd es-Sakafî, Peygamber'in huzuruna bu barış müddeti için bir mü'min muhacir olarak gelmiştir. Bunun üzerine el-Ahnes ibnu Şerîk de Peygamber'e bir mektûb yazıp, Ebû Basîr'i (barış maddesi gereğince kendilerine) geri göndermesini istiyordu. Bu iş için iki de adam gönderdiler, diyerek yukarıda geçen hadîsi zikretti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 19
      },
      "narrator": {
        "en": "Al-Miswar bin Makhrama and Marwan"
      }
    },
    {
      "hadithNumber": 2733,
      "arabicNumber": 2733,
      "book": 54,
      "hadithInBook": 20,
      "text": {
        "arabic": "وَقَالَ عُقَيْلٌ عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ فَأَخْبَرَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُهُنَّ، وَبَلَغَنَا أَنَّهُ لَمَّا أَنْزَلَ اللَّهُ تَعَالَى أَنْ يَرُدُّوا إِلَى الْمُشْرِكِينَ مَا أَنْفَقُوا عَلَى مَنْ هَاجَرَ مِنْ أَزْوَاجِهِمْ، وَحَكَمَ عَلَى الْمُسْلِمِينَ، أَنْ لاَ يُمَسِّكُوا بِعِصَمِ الْكَوَافِرِ، أَنَّ عُمَرَ طَلَّقَ امْرَأَتَيْنِ قَرِيبَةَ بِنْتَ أَبِي أُمَيَّةَ، وَابْنَةَ جَرْوَلٍ الْخُزَاعِيِّ، فَتَزَوَّجَ قَرِيبَةَ مُعَاوِيَةُ، وَتَزَوَّجَ الأُخْرَى أَبُو جَهْمٍ، فَلَمَّا أَبَى الْكُفَّارُ أَنْ يُقِرُّوا بِأَدَاءِ مَا أَنْفَقَ الْمُسْلِمُونَ عَلَى أَزْوَاجِهِمْ، أَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَإِنْ فَاتَكُمْ شَىْءٌ مِنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ فَعَاقَبْتُمْ‏}‏ وَالْعَقِبُ مَا يُؤَدِّي الْمُسْلِمُونَ إِلَى مَنْ هَاجَرَتِ امْرَأَتُهُ مِنَ الْكُفَّارِ، فَأَمَرَ أَنْ يُعْطَى مَنْ ذَهَبَ لَهُ زَوْجٌ مِنَ الْمُسْلِمِينَ مَا أَنْفَقَ مِنْ صَدَاقِ نِسَاءِ الْكُفَّارِ اللاَّئِي هَاجَرْنَ، وَمَا نَعْلَمُ أَحَدًا مِنَ الْمُهَاجِرَاتِ ارْتَدَّتْ بَعْدَ إِيمَانِهَا‏.‏ وَبَلَغَنَا أَنَّ أَبَا بَصِيرِ بْنَ أَسِيدٍ الثَّقَفِيَّ قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم مُؤْمِنًا مُهَاجِرًا فِي الْمُدَّةِ، فَكَتَبَ الأَخْنَسُ بْنُ شَرِيقٍ إِلَى النَّبِيِّ صلى الله عليه وسلم يَسْأَلُهُ أَبَا بَصِيرٍ، فَذَكَرَ الْحَدِيثَ‏.‏",
        "translations": {
          "en": "Narrated Az-Zuhri:`Urwa said, \"Aisha told me that Allah's Messenger (ﷺ) used to examine the women emigrants. We have been told also that when Allah revealed the order that the Muslims should return to the pagans what they had spent on their wives who emigrated (after embracing Islam) and that the Muslims should not keep unbelieving women as their wives, `Umar divorced two of his wives, Qariba, the daughter of Abu Umayyah and the daughter of Jarwal Al-Khuza`i. Later on Mu`awiya married Qariba and Abu Jahm married the other.\" When the pagans refused to pay what the Muslims had spent on their wives, Allah revealed: \"And if any of your wives have gone from you to the unbelievers and you have an accession (by the coming over of a woman from the other side) (then pay to those whose wives have gone) the equivalent of what they had spent (on their Mahr).\" (60.11) So, Allah ordered that the Muslim whose wife has gone, should be given, as a compensation of the Mahr he had given to his wife, from the Mahr of the wives of the pagans who had emigrated deserting their husbands. We do not know any of the women emigrants who deserted Islam after embracing it. We have also been told that Abu Basir bin Asid Ath-Thaqafi came to the Prophet (ﷺ) as a Muslim emigrant during the truce. Al-Akhnas bin Shariq wrote to the Prophet (ﷺ) requesting him to return Abu Basir",
          "ur": "عقیل نے زہری سے بیان کیا ‘ ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم عورتوں کا ( جو مکہ سے مسلمان ہونے کی وجہ سے ہجرت کر کے مدینہ آتی تھیں ) امتحان لیتے تھے ( زہری نے ) بیان کیا کہ ہم تک یہ روایت پہنچی ہے کہ جب اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ مسلمان وہ سب کچھ ان مشرکوں کو واپس کر دیں جو انہوں نے اپنی ان بیویوں پر خرچ کیا ہو جو ( اب مسلمان ہو کر ) ہجرت کر آئی ہیں اور مسلمانوں کو حکم دیا کہ کافر عورتوں کو اپنے نکاح میں نہ رکھیں تو عمر رضی اللہ عنہ نے اپنی دو بیویوں قریبہ بنت ابی امیہ اور ایک جرول خزاعی کی لڑکی کو طلاق دے دی۔ بعد میں قریبہ سے معاویہ رضی اللہ عنہ نے شادی کر لی تھی ( کیونکہ اس وقت معاویہ رضی اللہ عنہ مسلمان نہیں ہوئے تھے ) اور دوسری بیوی سے ابوجہم نے شادی کر لی تھی لیکن جب کفار نے مسلمانوں کے ان اخراجات کو ادا کرنے سے انکار کیا جو انہوں نے اپنی ( کافرہ ) بیویوں پر کئے تھے تو اللہ تعالیٰ نے یہ آیت نازل فرمائی «وإن فاتكم شىء من أزواجكم إلى الكفار فعاقبتم‏» ”اور تمہاری بیویوں میں سے کوئی کافروں کے ہاں چلی گئی تو وہ معاوضہ تم خود ہی لے لو۔“ یہ وہ معاوضہ تھا جو مسلمان کفار میں سے اس شخص کو دیتے جس کی بیوی ہجرت کر کے ( مسلمان ہونے کے بعد کسی مسلمان کے نکاح میں آ گئی ہو ) پس اللہ نے اب یہ حکم دیا کہ جس مسلمان کی بیوی مرتد ہو کر ( کفار کے یہاں ) چلی جائے اس کے ( مہر و نفقہ کے ) اخراجات ان کفار کی عورتوں کے مہر سے ادا کر دئیے جائیں جو ہجرت کر کے آ گئی ہیں ( اور کسی مسلمان نے ان سے نکاح کر لیا ہے ) اگرچہ ہمارے پاس اس کا کوئی ثبوت نہیں کہ کوئی مہاجرہ بھی ایمان کے بعد مرتد ہوئی ہوں اور ہمیں یہ روایت بھی معلوم ہوئی کہ ابوبصیر بن اسید ثقفی رضی اللہ عنہ جب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مومن و مہاجر کی حیثیت سے معاہدہ کی مدت کے اندر ہی حاضر ہوئے تو اخنس بن شریق نے نبی کریم صلی اللہ علیہ وسلم کو ایک تحریر لکھی جس میں اس نے ( ابوبصیر رضی اللہ عنہ کی واپسی کا ) مطالبہ آپ صلی اللہ علیہ وسلم سے کیا تھا۔ پھر انہوں نے حدیث پوری بیان کی۔",
          "fr": "Rapporté par Az-Zuhri : ‘Urwa a dit : ‘Aisha m’a raconté que le Messager d’Allah (ﷺ) examinait les femmes émigrantes. On nous a aussi dit que lorsque Allah a révélé l’ordre que les musulmans devaient rendre aux polythéistes ce qu’ils avaient dépensé pour leurs épouses qui avaient émigré (après avoir embrassé l’islam), et que les musulmans ne devaient pas garder de femmes non-croyantes comme épouses, ‘Umar a divorcé de deux de ses femmes : Qariba, la fille d’Abu Umayya, et la fille de Jarwal Al-Khuza’i. Plus tard, Mu‘awiya a épousé Qariba et Abu Jahm a épousé l’autre. Lorsque les polythéistes ont refusé de rembourser ce que les musulmans avaient dépensé pour leurs femmes, Allah a révélé : « Et si l’une de vos épouses part chez les non-croyants et qu’une femme de l’autre camp vient à vous, alors payez à ceux dont les femmes sont parties l’équivalent de ce qu’ils avaient dépensé (pour la dot). » (60.11) Ainsi, Allah a ordonné que le musulman dont la femme est partie reçoive, en compensation de la dot, une part prise sur la dot des femmes polythéistes qui avaient émigré en quittant leurs maris. Nous ne connaissons aucune femme émigrante qui ait quitté l’islam après l’avoir embrassé. On nous a aussi dit qu’Abu Basir bin Asid Ath-Thaqafi est venu voir le Prophète (ﷺ) comme musulman émigrant pendant la trêve. Al-Akhnas bin Shariq a écrit au Prophète (ﷺ) pour lui demander de rendre Abu Basir",
          "tr": "Ukayl'in Zührı'den aktardığına göre Urve İbn Zübeyr, Hz. Aişe'nin kendisine şöyle bildirdiğini nakletmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem kadınları imtihan ederdi. Bize bildirildi ki Allah, hicret eden hanımları için harcadıklarının müşriklere iade edilmesini emredip, Müslümanların da gayrimüslim kadınların bileklerinden tutmamalarına (onları boşamalarına) hükmedince Hz. Ömer Kurayba bint-i Ebu Ümeyye ve Cervel el-Huzaı'nın kızı olan iki hanımını boşadı. Kurayba ile Muaviye; diğeriyle de Ebu Cehm evlendi. Kafirler, Müslümanların eşleri için yaptıkları harcamaları ödemeyi kabul etmeyince \"Eğer eşlerinizden biri sizi bırakıp kafirlere kaçar, siz de galip gelirseniz, eşleri gitmiş olanlara harcadıkları kadar verin\" ayeti indirilmiştir. Bu ayetle Müslümanlardan birinin eşi kafirlere kaçtığında onun ona yaptığı harcamaların hicret eden kafir kadınlarının mehirlerinden onlara verilmesi emredildi. Ancak biz muhacir kadınlarından iman ettikten sonra dinden çıkan birini bilmiyoruz. Bize bildirildi ki Sakif kabilesinden Ebu Basir İbn Üseyd anlaşma süresi içinde Müslüman olmuş ve hicret ederek Hz. Nebi'in yanına gelmişti. Ahnes İbn Şureyk/Şerik de Ebu Basir'i göndermesini isternek için Hz. Nebi'e bir mektup yazmıştı. Sonra ravi olayı anlattı"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 20
      },
      "narrator": {
        "en": "Az-Zuhri"
      }
    },
    {
      "hadithNumber": 2734,
      "arabicNumber": 2734,
      "book": 54,
      "hadithInBook": 21,
      "text": {
        "arabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَجُلاً سَأَلَ بَعْضَ بَنِي إِسْرَائِيلَ أَنْ يُسْلِفَهُ أَلْفَ دِينَارِ، فَدَفَعَهَا إِلَيْهِ إِلَى أَجَلٍ مُسَمًّى‏.‏ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ وَعَطَاءٌ إِذَا أَجَّلَهُ فِي الْقَرْضِ جَازَ‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) mentioned a person who asked an Israeli man to lend him one-thousand Dinars, and the Israeli lent him the sum for a certain fixed period",
          "ur": "اور لیث نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا ‘ ان سے عبدالرحمٰن بن ہرمز نے بیان کیا ‘ ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کا ذکر کیا جنہوں نے بنی اسرائیل کے کسی دوسرے شخص سے ایک ہزار اشرفی قرض مانگا اور اس نے ایک مقررہ مدت تک کے لیے دے دیا۔",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a parlé d’un homme qui demanda à un Israélite de lui prêter mille dinars, et l’Israélite accepta pour une durée déterminée",
          "tr": "Ebu Hureyre r.a.'den nakledilmiştir: Allah Resulü Sallallahu Aleyhi ve Sellem birinden söz etmişti. O kişi İsrailoğullarından birinden bin dinar ödünç istemişti de o da belirli bir tarihte ödemesi şartıyla ona bu parayı ödünç vermişti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 21
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2735,
      "arabicNumber": 2735,
      "book": 54,
      "hadithInBook": 22,
      "text": {
        "arabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَتَتْهَا بَرِيرَةُ تَسْأَلُهَا فِي كِتَابَتِهَا، فَقَالَتْ إِنْ شِئْتِ أَعْطَيْتُ أَهْلَكِ وَيَكُونُ الْوَلاَءُ لِي‏.‏ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَكَّرْتُهُ ذَلِكَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ابْتَاعِيهَا فَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ، وَإِنِ اشْتَرَطَ مِائَةَ شَرْطٍ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated `Amra:Aisha said that Barirah came to seek her help in the writing of her emancipation. `Aisha said to her, \"If you wish, I will pay your masters (your price) and the wala' will be for me.\" When Allah's Messenger (ﷺ) came, she told him about it. The Prophet (ﷺ) said to her, \"Buy her (i.e. Barirah) and manumit (free) her, for the Wala is for the one who manumits.\" Then Allah's Messenger (ﷺ) ascended the pulpit and said, \"What about those people who stipulate conditions which are not in Allah's Laws? Whoever stipulates such conditions as are not in Allah's Laws, then those conditions are invalid even if he stipulated a hundred such conditions",
          "ur": "ہم سے علی بن عبداللہ مدینی نے بیان کیا۔ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ یحییٰ بن سعید انصاری سے ‘ ان سے عمرہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ بریرہ رضی اللہ عنہا اپنے مکاتبت کے سلسلے میں ان سے مدد مانگنے آئیں تو انہوں نے کہا کہ اگر تم چاہو تو تمہارے مالکوں کو ( پوری قیمت ) دے دوں اور تمہاری ولاء میرے ہو گی۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو آپ صلی اللہ علیہ وسلم سے میں نے اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا انہیں تو خرید لے اور آزاد کر دے۔ ولاء تو بہرحال اسی کی ہو گی جو آزاد کر دے۔ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر تشریف لائے اور فرمایا ان لوگوں کو کیا ہو گیا ہے جو ایسی شرطیں لگاتے ہیں جن کا کوئی پتہ ( دلیل، سند ) کتاب اللہ میں نہیں ہے ‘ جس نے بھی کوئی ایسی شرط لگائی جس کا پتہ ( دلیل، سند ) کتاب اللہ میں نہ ہو تو خواہ ایسی سو شرطیں لگا لے ان سے کچھ فائدہ نہ اٹھائے گا۔",
          "fr": "Rapporté par ‘Amra : ‘Aisha a dit que Barirah est venue lui demander de l’aide pour obtenir son affranchissement. ‘Aisha lui a dit : « Si tu veux, je paierai tes maîtres (ton prix) et le droit de protection (wala’) sera pour moi. » Quand le Messager d’Allah (ﷺ) est venu, elle lui en a parlé. Le Prophète (ﷺ) lui a dit : « Achète-la (c’est-à-dire Barirah) et affranchis-la, car le wala’ revient à celui qui affranchit. » Ensuite, le Messager d’Allah (ﷺ) monta sur le minbar et dit : « Que dire de ceux qui posent des conditions qui ne sont pas dans les lois d’Allah ? Celui qui pose de telles conditions, même s’il en pose cent, elles sont toutes invalides. »",
          "id": "Telah bercerita kepada kami ['Ali bin 'Abdullah] telah bercerita kepada kami [Sufyan] dari [Yahya] dari ['Amrah] dari ['Aisyah radliallahu 'anha] berkata bahwa Barirah mendatanginya untuk meminta tolong kepadanya perihal penebusan dirinya kepada tuannya untuk kebebasannya. Maka 'Aisyah radliallahu 'anha berkata: \"Kalau kamu mau aku akan berikan (uang pembesanmu) kepada tuanmu namun perwalianmu menjadi milikku\". Ketika Rasulullah shallallahu 'alaihi wasallam datang, 'Aisyah radliallahu 'anha menceritakannya kepada Beliau. Maka Nabi shallallahu 'alaihi wasallam: \"Belilah Barirah lalu bebaskanlah, karena perwalian menjadi milik orang yang membebaskannya\". Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri di atas mimbar lalu bersabda: \"Apa jadinya suatu kaum, jika mereka membuat persyaratan yang tidak ada pada Kitab Allah. Siapa yang membuat persyaratan yang tidak ada pada Kitab Allah, maka tidak ada (berlaku) baginya sekalipun dia membuat seratus persyaratan",
          "tr": "Hz. Aişe r.anha'dan nakledilmiştir: Berire, Hz. Aişe'ye gelerek kitabet sözleşmesi için ondan yardım istemişti. O da \"İstersen sahiplerine kıymetini ödeyeyim ve velayet hakkın bana ait olsun\" demişti ... (Aişe diyor ki:) Nebi s.a.v. gelince ona olanı biteni anlattım. Bunun üzerine O (Sallallahu aleyhi ve Sellem), \"Onu satın al ve azad et. Velayet hakkı azad edene aittir\" buyurdu. Sonra minbere çıkarak \"Bazılarına ne oluyor ki Allah'ın kitabında olmayan şartlar koşuyorlar. Allah'ın kitabından olmayan bir şeyi şart koşan kişi, isterse yüz şart koşsun bu koştuğu şartlar geçersizdir.\" buyurdu"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 22
      },
      "narrator": {
        "en": "`Amra"
      }
    },
    {
      "hadithNumber": 2736,
      "arabicNumber": 2736,
      "book": 54,
      "hadithInBook": 23,
      "text": {
        "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمَا مِائَةً إِلاَّ وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏",
        "translations": {
          "en": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Allah has ninety-nine names, i.e. one-hundred minus one, and whoever knows them will go to Paradise.\" (Please see Hadith No. 419 Vol)",
          "ur": "ہم سے ابوالیمان نے بیان کیا ‘ کہا کہ ہم کو شعیب نے خبر دی ‘ ان سے ابوالزناد نے بیان کیا ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اللہ تعالیٰ کے ننانوے نام ہیں یعنی ایک کم سو۔ جو شخص ان سب کو محفوظ رکھے گا وہ جنت میں داخل ہو گا۔“",
          "fr": "Rapporté par Abu Huraira : Le Messager d’Allah (ﷺ) a dit : « Allah a quatre-vingt-dix-neuf noms, soit cent moins un, et celui qui les connaît entrera au Paradis. » (Voir aussi le hadith n°419, volume)",
          "id": "Telah bercerita kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] telah bercerita kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah radliallahu 'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memiliki sembilan puluh sembilan nama, seratus kurang satu. Siapa yang menghitungnya (menjaganya) maka dia akan masuk surga",
          "tr": "Bize Ebu'z-Zinâd, el-A'rac'dan; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem): \"Allah'ın yüzden bir eksik olarak doksan dokuz ismi vardır. Bu isimleri kim (tamamen) sayarsa cennete girer\" buyurmuştur"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 23
      },
      "narrator": {
        "en": "Abu Huraira"
      }
    },
    {
      "hadithNumber": 2737,
      "arabicNumber": 2737,
      "book": 54,
      "hadithInBook": 24,
      "text": {
        "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ أَنْبَأَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَصَابَ أَرْضًا بِخَيْبَرَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم يَسْتَأْمِرُهُ فِيهَا، فَقَالَ يَا رَسُولَ اللَّهِ، إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ، لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ عِنْدِي مِنْهُ، فَمَا تَأْمُرُ بِهِ قَالَ ‏ \"‏ إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا ‏\"‏‏.‏ قَالَ فَتَصَدَّقَ بِهَا عُمَرُ أَنَّهُ لاَ يُبَاعُ وَلاَ يُوهَبُ وَلاَ يُورَثُ، وَتَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَفِي الْقُرْبَى، وَفِي الرِّقَابِ، وَفِي سَبِيلِ اللَّهِ، وَابْنِ السَّبِيلِ، وَالضَّيْفِ، لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، وَيُطْعِمَ غَيْرَ مُتَمَوِّلٍ‏.‏ قَالَ فَحَدَّثْتُ بِهِ ابْنَ سِيرِينَ فَقَالَ غَيْرَ مُتَأَثِّلٍ مَالاً‏.‏",
        "translations": {
          "en": "Narrated Ibn `Umar:Umar bin Al-Khattab got some land in Khaibar and he went to the Prophet (ﷺ) to consult him about it saying, \"O Allah's Messenger (ﷺ) I got some land in Khaibar better than which I have never had, what do you suggest that I do with it?\" The Prophet (ﷺ) said, \"If you like you can give the land as endowment and give its fruits in charity.\" So `Umar gave it in charity as an endowment on the condition that it would not be sold nor given to anybody as a present and not to be inherited, but its yield would be given in charity to the poor people, to the Kith and kin, for freeing slaves, for Allah's Cause, to the travelers and guests; and that there would be no harm if the guardian of the endowment ate from it according to his need with good intention, and fed others without storing it for the future",
          "ur": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا کہ ہم سے محمد بن عبداللہ انصاری نے بیان کیا ‘ ان سے ابن عون نے ‘ کہا کہ مجھے نافع نے خبر دی ‘ انہیں ابن عمر رضی اللہ عنہما نے کہ عمر بن خطاب رضی اللہ عنہ کو خیبر میں ایک قطعہ زمین ملی تو آپ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں مشورہ کیلئے حاضر ہوئے اور عرض کیا یا رسول اللہ! مجھے خیبر میں ایک زمین کا ٹکڑا ملا ہے اس سے بہتر مال مجھے اب تک کبھی نہیں ملا تھا ‘ آپ اس کے متعلق کیا حکم فرماتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر جی چاہے تو اصل زمین اپنے ملکیت میں باقی رکھ اور پیداوار صدقہ کر دے۔ ابن عمر رضی اللہ عنہما نے بیان کیا کہ پھر عمر رضی اللہ عنہ نے اس کو اس شرط کے ساتھ صدقہ کر دیا کہ نہ اسے بیچا جائے گا نہ اس کا ہبہ کیا جائے گا اور نہ اس میں وراثت چلے گی۔ اسے آپ نے محتاجوں کے لیے ‘ رشتہ داروں کے لیے اور غلام آزاد کرانے کے لیے ‘ اللہ کے دین کی تبلیغ اور اشاعت کے لیے اور مہمانوں کیلئے صدقہ ( وقف ) کر دیا اور یہ کہ اس کا متولی اگر دستور کے مطابق اس میں سے اپنی ضرورت کے مطابق وصول کر لے یا کسی محتاج کو دے تو اس پر کوئی الزام نہیں۔ ابن عون نے بیان کیا کہ جب میں نے اس حدیث کا ذکر ابن سیرین سے کیا تو انہوں نے فرمایا کہ ( متولی ) اس میں سے مال جمع کرنے کا ارادہ نہ رکھتا ہو۔",
          "fr": "Rapporté par Ibn ‘Umar : ‘Umar bin Khattab a reçu un terrain à Khaybar et il est allé consulter le Prophète (ﷺ) à ce sujet en disant : « Ô Messager d’Allah (ﷺ), j’ai obtenu un terrain à Khaybar, meilleur que tout ce que j’ai eu auparavant. Que me conseilles-tu d’en faire ? » Le Prophète (ﷺ) a dit : « Si tu veux, tu peux en faire une fondation pieuse (waqf) et donner ses fruits en aumône. » ‘Umar l’a donc donné en aumône comme waqf, à condition qu’il ne soit ni vendu, ni offert, ni hérité, mais que ses revenus soient distribués aux pauvres, aux proches, pour affranchir des esclaves, pour la cause d’Allah, aux voyageurs et aux invités ; et qu’il n’y ait pas de mal si le responsable du waqf en mange selon ses besoins, avec bonne intention, et en fait profiter d’autres sans en faire de réserve",
          "id": "Telah bercerita kepada kami [Qutaibah bin Sa'id] telah bercerita kepada kami [Muhammad bin 'Abdullah Al Anshariy] telah bercerita kepada kami [Ibnu 'Aun] berkata [Nafi'] memberitakan kepadaku dari [Ibnu 'Umar radliallahu 'anhuma] bahwa 'Umar bin Al Khaththab radliallahu 'anhu mendapat bagian lahan di Khaibar lalu dia menemui Nabi shallallahu 'alaihi wasallam untuk meminta pendapat Beliau tentang tanah lahan tersebut dengan berkata: \"Wahai Rasulullah, aku mendapatkan lahan di Khaibar dimana aku tidak pernah mendapatkan harta yang lebih bernilai selain itu. Maka apa yang Tuan perintahkan tentang tanah tersebut?\" Maka Beliau berkata: \"Jika kamu mau, kamu tahan (pelihara) pepohonannya lalu kamu dapat bershadaqah dengan (hasil buah) nya\". Ibnu 'Umar radliallahu 'anhu berkata: \"Maka 'Umar menshadaqahkannya dimana tidak dijualnya, tidak dihibahkan dan juga tidak diwariskan namun dia menshadaqahkannya untuk para faqir, kerabat, untuk membebaskan budak, fii sabilillah, ibnu sabil dan untuk menjamu tamu. Dan tidak dosa bagi orang yang mengurusnya untuk memakan darinya dengan cara yang ma'ruf (benar) dan untuk memberi makan orang lain bukan bermaksud menimbunnya. Perawi berkata; \"Kemudian aku ceritakan hadits ini kepada Ibnu Sirin maka dia berkata: \"ghoiru muta'atstsal maalan artinya tidak mengambil harta anak yatim untuk menggabungkannya dengan hartanya",
          "tr": "Abdullah İbn Ömer r.a.'den nakledilmiştir: Ömer İbnü'l-Hattab r.a. Hayber'de bir toprağa sahip olmuştu. Danışmak üzere Hz. Nebi'e geldi ve \"Ey Allah'ın Resulü! Ben Hayber'de bir toprağa sahip oldum. Bugüne değin ondan daha değerli bir malım hiç olmamıştı. Ne önerirsin\" dedi. Hz. Nebi Sallallahu Aleyhi ve Sellem \"Dilersen mülkiyetini elinde bırakır ve menfaatini (gelirini) sadaka verirsin\" buyurdu. Ömer de radıyallahu anh orayı \"satılmamak, bağışlanmamak, kimseye miras kalmamak üzere\" sadaka olarak verdi. Fakirlere, yakınlarına, özgürlüğünü satın almak isteyenlere, Allah yolunda cihat edenlere, yolda kalanlara ve misafirlere sadaka olarak bıraktı. Ancak mütevellinin, oranın gelirinden örfe uygun bir şekilde yemesinde ve kendi malına katmaksızın birine yedirmesinde sakınca olmadığını belirtti"
        }
      },
      "grades": [],
      "reference": {
        "collection": "bukhari",
        "book": 54,
        "hadith": 24
      },
      "narrator": {
        "en": "Ibn `Umar"
      }
    }
  ],
  "metadata": {
    "averageLength": "long",
    "size": "34KB"
  }
}